{"authors":["Madeline Stone"],"date_download":"2018-10-30 20:52:47","date_modify":"2018-10-30 20:52:47","date_publish":"2016-12-26 00:00:00","description":"Winter is coming to ruin your shoes.","filename":"data/vaneerConsumption/Howtocareforyourdressshoesinthewinter.json","image_url":"https://amp.businessinsider.com/images/585d57afee14b6ce348b4cf8-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_how-to-protect-dress-shoes-from-snow-and-rain-2016-12_1540932767.html","title":"How to care for your dress shoes in the winter","title_page":"    How to care for your dress shoes in the winter - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Madeline Stone / Business Insider Whether it's rain, snow, or ice, winter weather can really wreak havoc on your dress shoes.\nJack Erwin is a startup that makes a high-quality, classic shoe that it says won't go out of style or break the bank. The shoes are all made out of Italian leather and priced between $115 and $220.\nWe asked the Jack Erwin team to share their tips for protecting your shoes during the bleak winter months.\nHere's what they had to say.\nHow do I save wet leather shoes?\nThough it may be tempting to stick the soaked shoes in front of a direct heat source, like a radiator or fireplace, cofounders Ariel Nelson and Lane Gerson advise against doing so.\n\"Stuff your shoes with newspaper to absorb the moisture, then replace with cedar shoe trees,\" they said. \"If you have leather soles, let them dry too.\"\nWhat if my shoes start to smell bad?\nFunky-smelling shoes are usually caused by bacterial or fungal build-up.\n\"There are a variety of fixes, including applying antibacterial sprays or a light layer of baking soda,\" they said.\nYou could also try inserting an odor-controlling insole or even dryer sheets.\nSalt stained my shoes — now what?\nFirst, Nelson and Gerson recommend using saddle soap or a specialty salt stain remover to get rid of the stain itself. Then stuff the shoes with newspaper and leave them out to dry, away from a direct heat source.\n\"Last, apply leather conditioner or natural oils to replenish the leather and return it to its original luster,\" they said.\nWhat are the best kinds of shoes to wear in bad weather?\n\"Synthetic materials created specifically for inclement weather such as Gore Tex and rubber are fitting materials for the worst of the winter,\" they said. \"When cared for and treated properly, full-grain leather is a naturally resilient material that can also withstand the elements.\"\nThey recommend using natural oils, like mink oil, to make leather even stronger in the winter.\nWhat products are best for regular shoe maintenance?\n\"Shoe horns are always recommended as they help to preserve the back counter and overall structure of your shoe,\" they said.\nYou should also be conditioning and polishing your shoes on a regular basis, which will keep the leather supple and moisturized.\nWhat styles of boots are fashionable this winter?\nJack Erwin's Chester boot ($220). Jack Erwin Bertrand Guillaume, Jack Erwin's head of product, said that the brand's Ellis and Chester boots are among its most popular this season.\n\"Each represents a cleaned up, modern approach to a boot style with traditionally humble origins that our customers seem to really connect with,\" he said.\n\"Our customers have also found that, because of their rubber soles, these boots are durable enough to handle life on the city streets, but elevated enough in their design to carry them straight from the daily grind to a night out.\"","url":"https://www.businessinsider.com/how-to-protect-dress-shoes-from-snow-and-rain-2016-12"}
