{"authors":[],"date_download":"2018-10-22 21:16:45","date_modify":"2018-10-22 21:16:45","date_publish":"2014-05-06 18:17:20","description":"Measures that stopped SARS in 2003 are being put to good use against MERS.","filename":"data/vaneerConsumption/HowtoStopMERSGlovesMasksandGoggles.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/423936/140506-munster-mers-hospital-1315_20f485440fe3ff538b2f3008346d1012.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_mers-mystery_how-stop-mers-gloves-masks-goggles-n98421_1540243005.html","title":"How to Stop MERS: Gloves, Masks and Goggles","title_page":"How to Stop MERS: Gloves, Masks and Goggles","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAny health worker going to care for a man who has MERS in Munster, Indiana has to dress up in a gown, gloves, mask and goggles. He’s being kept in a “negative pressure” room that vents air to the outside through a filter. And everyone who’s been near him over the past two weeks is being tracked down and watched for signs of infection.\nThese are all measures that stopped another alarming virus, SARS, or severe acute respiratory syndrome, from causing a global pandemic in 2003, and they’re working well for the community hospital, too. Health experts hope that MERS, like SARS, can be stopped without a vaccine or drugs, but with extreme hygiene.\nThe patient, a healthcare worker in his 60s visiting family after a stint working at a Saudi hospital, is the first known case of MERS in the United States. Middle East Respiratory syndrome has only been around since 2012. It’s worrying because it’s very deadly, killing about a third of the more than 400 or so known or suspected victims.\nWhen he walked into the Munster Community Hospital's emergency department, standard procedures went into almost immediate effect, says Alan Kumar, chief medical information officer at the hospital. Many of these procedures began as hospitals braced for a feared pandemic of SARS, which broke out in 2003 and infected more than 8,000 people, killing about 10 percent of them, before it was stopped.\n“We have standard precautions for any types of respiratory infections that we tend to believe are infectious or dangerous,” Kumar told NBC News. “For example, the hospital has eight negative pressure airflow rooms in the emergency department alone, and more than 50 in the hospital.”\nEach special room has an anteroom, where anyone entering puts on clean gloves, goggles, foot protectors and a gown, and only then opens a closed door to the actual patient’s room. The procedure is done in reverse, every time without fail, upon leaving. Everything that touches the patient, from needles to food trays, is disposable after one use.\nAnd while MERS is not especially catching, at least not yet, everyone who was in close contact with the patient is being tracked down, from seatmates on the flights he took to fellow passengers on the bus from Chicago’s O’Hare Airport to Munster, a Chicago suburb. Family members and health care workers who were in direct contact with the patient have been tested for the virus — all have been negative so far.\n“This particular virus has not been very contagious.\"\nThese precautions are useful against any of the many airborne diseases that people might walk in with, such as flu, tuberculosis and especially measles. They’d be useful if one of the mysterious bird flus that are in circulation, such as H7N9 or H5N1, infected a traveler. It’s still not clear if SARS was airborne or if MERS can be spread that way, but keeping the air from a patient separate is a common-sense measure.\nMany hospitals around the world have been phasing in such precautions as the world keeps an eye out for new pandemics, and as evidence piles up on how to stop all sorts of infections, from drug-resistant superbugs such as MRSA to avian influenza.","url":"https://www.nbcnews.com/storyline/mers-mystery/how-stop-mers-gloves-masks-goggles-n98421"}
