{"authors":["Thomas Colson"],"date_download":"2018-10-30 21:34:58","date_modify":"2018-10-30 21:34:58","date_publish":"2016-12-19 00:00:00","description":"The prize is a 7-year fellowship at Oxford.","filename":"data/vaneerConsumption/HowtoanswertheAllSoulsexaminationatOxfordUniversity.json","image_url":"https://amp.businessinsider.com/images/58578577dd08959b7f8b4620-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_how-to-answer-the-all-souls-examination-at-oxford-university-2016-12_1540935298.html","title":"How to answer the All Souls examination at Oxford University","title_page":"    How to answer the All Souls examination at Oxford University - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Codrington Library, All Souls College, Oxford University. Wikipedia / CC 3.0 Students applying to Oxford University are interviewed throughout December, so Christmas is a nerve-racking time for applicants.\nAs well as being interviewed, prospective students at some Oxford colleges are required to take entrance exams, and while all of them are notoriously tough, some are more difficult than others.\nThe entrance exam for All Souls College at Oxford University has been called the world's hardest test: It's nearly impossible to revise for, the questions are abstract, and there are no right or wrong answers.\nConsequently, only a 20th of the Oxford graduates who take the test are invited to continue the process.\nThe prize is a seven-year fellowship at Oxford University, which typically goes to two students each year.\nBusiness Insider spoke with someone who passed their own All Souls exam and now grades them. Our source gave us the inside track on what examiners look for. When you're done, check out all the past exam questions here.\nMike Bird contributed the original reporting to this article.","url":"https://www.businessinsider.com/how-to-answer-the-all-souls-examination-at-oxford-university-2016-12"}
