{"authors":["Emma Cueto"],"date_download":"2018-10-30 22:49:18","date_modify":"2018-10-30 22:49:18","date_publish":"2014-08-14 18:32:24","description":"Anyone who's been through a break up knows it can be a real blow to your self-esteem. So even though there are all sorts of healthy ways to move on after a break-up, there are also just those options that make you feel better for a while (like…","filename":"data/vaneerConsumption/HowtoCutYourOwnBangsVideofromCollegeHumorShowsWhyYouShouldBewarethePostBreakupMakeover.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e47b27bd-07b9-4d5c-99ef-b51b1d5e9a09.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35812-how-to-cut-your-own-bangs-video-from-college-humor-shows-why-you-should-beware-the_1540939758.html","title":"\"How to Cut Your Own Bangs\" Video from College Humor Shows Why You Should Beware the Post-Breakup Makeover","title_page":"\"How to Cut Your Own Bangs\" Video from College Humor Shows Why You Should Beware the Post-Breakup Makeover","title_rss":"NULL","source_domain":"bustle.com","text":"Anyone who's been through a break up knows it can be a real blow to your self-esteem. So even though there are all sorts of healthy ways to move on after a break-up, there are also just those options that make you feel better for a while (like Netflix marathons or break-up playlists) and those that make you feel better about yourself, like the time honored tradition of giving yourself a post-break-up makeover. But if you're going the makeover route, take note of one very important thing: Do not, under any circumstances, cut your own hair.\nThat seems like an obvious bit of advice — after all, you say, didn't most people outgrow the impulse to cut their own hair after the age of five or so? False. The impulse is always there, lurking beneath the surface, just waiting until you are emotionally vulnerable and your judgement has been compromised by half a bottle of wine, seeking the perfect opportunity to strike.\nSo if you find yourself suddenly with a hunk of your own hair in one hand and a pair of scissors in the other, remember this College Humor video detailing exactly why you should stop. And please, for the love of all that is long-locked and holy: stop.\nImage: CollegeHumor.com","url":"https://www.bustle.com/articles/35812-how-to-cut-your-own-bangs-video-from-college-humor-shows-why-you-should-beware-the"}
