{"authors":["Judy Lin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:42:13","date_modify":"2018-10-30 22:42:13","date_publish":"2016-02-22 08:00:00","description":"This week, a state appellate court will be asked to overturn a closely watched legal decision that said poor and minority school students in California","filename":"data/vaneerConsumption/HowtofollowVergaravCalifornia.json","image_url":"https://calmatters.org/wp-content/uploads/ap_119918148618.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939333.html","title":"How to follow Vergara v. California","title_page":"How to follow Vergara v. California | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"This week, a state appellate court will be asked to overturn a closely watched legal decision that said poor and minority school students in California have been denied their right to a proper education because of laws that prevent the dismissal of bad teachers.\nThe case, Vergara v. California, was filed on behalf of nine students in 2012 by Students Matter, a nonprofit organization founded by Silicon Valley entrepreneur David Welch. The defendants include Gov. Jerry Brown and state Superintendent of Public Instruction Tom Torlakson. The state’s two largest teacher unions — the California Teachers Association and the California Federation of Teachers — intervened with the defendants.\nIn 2014, Los Angeles Superior Court Judge Rolf Treu agreed with Students Matter and struck down five state laws regarding teacher tenure, dismissal and layoffs. He wrote in his decision that “grossly ineffective teachers” cause a significant harm to students. “The evidence is compelling. Indeed, it shocks the conscience,” he wrote.\nThe appeal by Attorney General Kamala Harris on behalf of Brown and Torlakson was a major campaign issue in the 2014 election.\nOral arguments in the appeal have been set for Thursday, Feb. 25, before a three-judge panel in California’s 2nd District Court of Appeal in Los Angeles.\nTom Torlakson on teacher tenure\nWhat is this fight about?\nThis fight is about whether ineffective teachers are allowed to continue to work in the classroom because state laws make it too difficult to dismiss them. Because most high quality teachers are attracted to the best schools, the lawsuit says that poor and minority students suffer most when ineffective teachers are not removed.\nThe fight is also about a high-stakes political confrontation between the powerful labor unions that represent teachers and a well-financed community of education reform advocates who are seeking to hold schools and teachers more accountable for academic outcomes.\nJudge Treu’s decision said there is “no dispute that there are a significant number of grossly ineffective teachers currently active in California classrooms.” There was also testimony about the value of teacher quality in a student’s education. Harvard University economics professor Raj Chetty testified for plaintiffs that replacing the bottom 5 percent of teachers with average teachers would increase a child’s lifetime earnings by $50,000.\nTreu struck down five state teacher workplace laws saying they harm students’ right to an equal opportunity for education by making it too difficult to remove bad teachers. The five laws touch on three key areas:\nTenure: In California, newly hired teachers are on probation for two years, during which time they cannot challenge any termination. After two years, they are granted tenure, which requires a process for dismissal that is being challenged in the lawsuit. Judge Treu agreed with plaintiffs that two years is insufficient time to judge whether a teacher should be granted tenure. Linda Darling-Hammond, a nationally recognized expert on education policy who teaches at the Stanford Graduate School of Education, testified for the defendants that the two-year probation period was long enough.\nDismissal : Once a teacher receives tenure, the lawsuit claims school district officials have to jump through cumbersome laws requiring extensive documentation and a drawn-out appeals process to remove a bad teacher. During trial, testimony for the plaintiffs said school districts in California brought 36 cases of unsatisfactory teacher performance between 2003 and 2013, with 22 leading to dismissal, for an average of 2.2 teachers per year out of the state’s nearly 300,000 teachers. Testimony also said that the Los Angeles Unified School District spent “between $250,000 and $450,000” to dismiss a single ineffective teacher with tenure. At trial, attorneys for the labor unions suggested it was poor management by school administrators, not the statues.\nLayoff: The lawsuit takes issue with the state’s seniority-based layoff process, where a school district is required to release the newest teachers first even if they are considered more talented than a veteran teacher. Since experienced teachers are attracted to the best schools, the seniority-based layoffs are also concentrated on poor schools.\n“Collectively, these statutes operate as a perfect storm in denying equal educational opportunities to low-income students and students of color,” The Education Trust-West, an Oakland-based group that advocates for raising academic achievement for poor and minority students, wrote in a friend of the court brief in support of Students Matter. “Together, they ensure that a glut of ineffective teachers will remain in California’s system, and they increase the likelihood that these ineffective teachers will be shuffled into classrooms with lower-income students and students of color who are most in need of effective teaching.”\nRyan Smith of The Education Trust-West\nAttorney General Harris wrote in her opening appeals brief that the current system is the most fair and efficient way to conduct layoffs “because it is objective and it positively correlates with effective teaching.” She says the Legislature made its decision in order to “help attract and retain qualified applicants to the teaching profession; protect them from arbitrary dismissal after a defined probationary period; and provide for using seniority in selecting which teachers to retain when economic layoffs are required.”\nIn his appeal filing, Gov. Brown argued that the judge in this case failed “to provide a detailed statement of the factual and legal bases for its ruling” and that a change of this magnitude requires appellate review.\nWhat’s next?\nThe appeal to be heard on Thursday is before a three-judge panel of the 2nd District Court of Appeal in Los Angeles. After the hearing, the judges have 90 days to issue a ruling. The case could then be appealed to the state Supreme Court.\nAt issue before the appeals panel is whether the trial court erred in striking down the five teacher workplace laws. The state says the plaintiffs did not meet the criteria for an equal protection claim because they were unable to prove that the five statutes have caused real harm to a particular class of students. The state also argues it’s the Legislature’s job to construct such rules and it adopted the current policies. Students Matter says the policies deprive poor and minority students from accessing good teachers.\nTreu stayed his decision, meaning there will be no impact until the appellate court makes a ruling. A final decision could influence teacher tenure and job protections across the nation. A month after Treu threw out California’s laws, a suit challenging teacher tenure in New York was filed on behalf of seven families by the Partnership for Education Justice, a group led by former news anchor Campbell Brown.","url":"https://calmatters.org/articles/how-to-follow-vergara-v-california/"}
