{"authors":[],"date_download":"2018-10-30 01:11:20","date_modify":"2018-10-30 01:11:20","date_publish":"2016-08-15 00:35:07","description":null,"filename":"data/vaneerConsumption/HowTrumpCanBecomeOneofOurGreatestPresidentscont.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/08/Ryan2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861880.html","title":"How Trump Can Become One of Our Greatest Presidents (cont.)","title_page":"How Trump Can Become One of Our Greatest Presidents (cont.)The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Donald Trump can become one of the greatest Presidents in American history, if he can accomplish just a few simple things that America urgently needs to get right. Trump has already pledged to do precisely these things, while Hillary has pledged to do just the opposite.\nThis is the second in a four-part series on those few simple things America desperately needs. Part One focused on perhaps the most important Presidential responsibility: appointing high quality Justices for nearly half the Supreme Court, and judges for the rest of the federal judiciary balancing out the radical judges Obama has appointed since 2009. This Part Two explains the next priority: tax reform providing for sharply lower tax rates, especially on overtaxed American business and investment.\nAmerica suffers under the highest marginal tax rates in the world on investment, corporate, and business income. America urgently needs pro-growth tax reform, with much lower, internationally competitive, marginal tax rates. A good model has been developed by House Speaker Paul Ryan’s Tax Reform Task Force Report, which was spearheaded by Ways and Means Chairman Kevin Brady.\nRyan/Brady proposes to replace the 7 tax brackets of the current income tax code, with effective rates reaching into the mid-40s, with just 3 rates of 12%, 25%, and 33%, cutting marginal tax rates for everyone. The standard deduction for married couples filing jointly would be increased from $12,600 today to $24,000, doubling income that can be earned tax free. The refundable $1,000 Child Tax Credit and Earned Income Tax Credit of up to $5,572 for a single mother with two children, $6,269 for three children, would continue. This would assure zero federal income taxes for everyone in the 10% bracket today.\nCurrently, 95% of all businesses in America, and 50% of all business income, are taxed as sole proprietorships or “pass through” entities, such as partnerships, limited liability corporations (LLCs), and Subchapter S corps, subject to a rate as high as 44.6%. For many years, most new jobs in America have been created by these businesses. Ryan/Brady would enact a new maximum small business tax rate of 25%, sparking explosive small business job expansion.\nThe greatest culprit driving businesses and jobs offshore is federal and state corporate income taxes imposing a combined top marginal tax rate of nearly 40%, highest in the developed world, third highest in the entire world, with only Chad and the United Arab Emirates imposing higher rates. When the current federal corporate income tax rate was last set in 1986, the average corporate rate of other industrialized (OECD) nations was 47.2%. Today, that has been cut in half to 24.8%, reflecting modern economic research showing that 80% of corporate income taxes are effectively borne by workers through reduced wages or lost jobs.\nWith U.S. corporate rates so outdated, capital flight from America has soared through “corporate inversions” (merging with foreign companies). American companies subject to double taxation under federal tax law are also holding more than $2 trillion in capital overseas. Ryan/Brady would end this double taxation penalty by adopting territoriality, ending attempted U.S. taxation of corporate income earned abroad, as in all other developed nations.\nRyan/Brady would adopt a flat 20% federal corporate income tax rate, making American companies and their workers internationally competitive again. Ryan/Brady would also abolish the death tax, the AMT, and offset the income tax code’s bias against capital investment by allowing taxpayers to deduct 50 percent of their capital gains, dividends, and interest income, resulting in rates of 6% to 16.5% on investment income. It would also provide for “expensing,” or an immediate deduction, for capital investment, just like all other expenses for production of income. The plan would also provide for “border adjustability” exempting exports from taxation, while taxing imports.\nThe plan is scored dynamically as revenue neutral based on reasonable expectations of the economic growth it will generate, compared to the current policy baseline, which incorporates what Congress routinely does to avoid tax increases from current law. The result will likely be higher tax revenues due to booming, long overdue economic recovery, growth, and soaring jobs, wages, and incomes.\nOn August 9, at the Detroit Economic Club, Trump unveiled his economic growth plan. He discarded his earlier tax reform with its estimated $12 trillion in revenue losses, replacing it instead with a plan much closer to Ryan-Brady. But instead of Ryan/Brady’s 20% federal corporate rate, Trump proposed to reduce that rate to 15%. And instead of the business pass-through rate of 25%, Trump proposed a 15% rate for those businesses as well. Hillary and her so-called “progressive” Democrats will bitterly oppose such reforms, favoring confiscatory tax rates that will keep America down and dependent on government handouts. That is progress to “progressives.” Hillary has proposed still another, massive, $1.3 trillion tax increase, as Walter Mondale did in 1984. But Hillary’s so-called “progressives” will be surprised at how many Congressional Democrats will cross over and pass the badly needed Trump tax reform on a broad, bipartisan basis, just as so many Congressional Democrats did concerning Reagan’s tax reforms.","url":"https://spectator.org/how-trump-can-become-one-of-our-greatest-presidents-cont/"}
