{"authors":["Natalia Lusinski"],"date_download":"2018-10-31 01:45:07","date_modify":"2018-10-31 01:45:07","date_publish":"2018-09-14 14:49:43","description":"It could happen to anybody: they find themselves short on rent one month when they get laid off from work and their temp job paycheck is not going to cut it. Do they max out their credit cards? Beg their landlord to pay late? Borrow money from a…","filename":"data/vaneerConsumption/HowToLoanSomeoneMoneyAndActuallyBePaidBackAccordingToExperts.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/0f23bdaf-0648-4008-b9e0-f4f48d14d34e-fotolia_108022598_subscription_monthly_m-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-to-loan-someone-money-actually-be-paid-back-according-to-experts-11910851_1540950307.html","title":"How To Loan Someone Money - And Actually Be Paid Back, According To Experts","title_page":"How To Loan Someone Money — And Actually Be Paid Back, According To Experts","title_rss":"NULL","source_domain":"bustle.com","text":"It could happen to anybody: they find themselves short on rent one month when they get laid off from work and their temp job paycheck is not going to cut it. Do they max out their credit cards? Beg their landlord to pay late? Borrow money from a friend or family member — aka you? As much as they may not want to do the latter after hearing horror stories from other people about how money can ruin relationships, they decide to do it anyway. Perhaps money is not an issue to you or you offered your BFF the money before they even asked — and you insist they take it. But then what? Well, there is a right way to loan someone money, according to money experts.\n“It’s common for people to ask friends or family members for a loan,” Priyanka Prakash, lending expert at Fundera, a marketplace for small business financial solutions, tells Bustle. “People ask for loans to start businesses, get medical procedures, go to school, and many other purposes.” She says while it’s OK to borrow and lend money, both parties should take the loan seriously. “Treat this as you would any other loan so there are no miscommunications,” she says.\nIn 2016, MyBankTracker conducted a study that found 17 percent of individuals said they’d had a bad experience with lending money to a friend or family member — 18.1 percent of women versus 15.6 percent of men felt that lending money was a mistake. However, there *are* ways to make it manageable. If you find yourself letting a friend or family member borrow money, here are some tips on how to loan it to them so your relationship will survive.\n1 Put It In Writing Hannah Burton/Bustle Like any other contract — your apartment lease, your car loan — put the loan in writing. “Even if you are a friend or family member of the borrower, draft up a quick note that contains the essential terms: the loan amount, the repayment deadline, the interest rate, the frequency of payments, and any late fees,” Prakash says. She says if you want some ideas, you can check out what the IRS suggests about the minimum interest rate you should collect. Melissa Lowry, vice president of brand and marketing at Early Warning, the network behind Zelle, agrees on clarifying the loan. “Whenever your friend, family member, or acquaintance needs your help to cover a cost, it’s always good to have a clear plan of action for when and how they’ll pay you back,” she tells Bustle. “Our recent survey found that nearly nine in 10 millennials say they’ve not been paid back by friends and family — so make sure you set a clear timeline for when someone is going to pay you back.” She also says not to be afraid to remind them if they don’t.\n2 Charge Late Fees & Interest Hannah Burton/Bustle A great way to get somebody to pay you back is by charging them interest on the loan. Prakash says that for loans less than $10,000, neither the lender nor the borrower has to report anything on their tax return. “However, when you loan someone a higher amount, you have to report the interest that you are expected to earn from the loan,” she says. “This is where the IRS’ minimum interest rates come into play. If you don’t charge at least that much interest, the IRS could make the interest you should have charged taxable to you.” So, even for small loans (less than $10,000), Prakash suggest charging interest to help ensure that the borrower takes the loan and the responsibility to pay you back seriously.\n3 Decide On An End Date Hannah Burton/Bustle Even if you have a contract drawn up, make sure there is an end date on it, too, Jill Caponera, consumer savings expert at Promocodes.com, tells Bustle. “Be sure to first verbally communicate with the person who you are loaning money to when they expect to pay you back in full, then write that information into your contract,” she says. “Not having an end date to receive your money could leave the loan open-ended and allows for too much of a gray area.”\n4 Make Sure You Both Sign The Paperwork undrey/Fotolia Byron Ellis, a certified financial planner with United Capital Financial Life Management and founder of the blog Doing Money Right, agrees with creating a loan contract, but with a caveat. “In order to make your loan agreement legally binding, both the lender and the borrower must sign documents that outline the specific terms of the agreement,” he tells Bustle. He says you can choose to have a lawyer draw up these documents or find a contract online that fits your needs. “Either way, having one can help to protect your investment and avoid contention among friends or family members.” Furthermore, Joyce Blue, a money relationship expert, also suggests getting the contract notarized. “This way, if things go wrong, you are protected,” she tells Bustle.\n5 Be Firm Andrew Zaeh for Bustle Caponera says to be firm and stern when it comes to loaning someone money and the repayment terms. “While it’s a nice gesture to loan friends or family money, it’s also something that should be done with caution and only in desperate situations,” she says. “If you do choose to move forward with the loan, you will have to play bill collector and put your foot down if your loan is not being paid back in a timely manner.” She also says to remember that this is a favor you did and, ultimately, it’s your money to collect. “Do not feel intimidated or guilty to ask for it back,” she says.\n6 Get Collateral jcomp/Fotolia Another way to help ensure that you will be paid back is by asking the person you’re loaning money to for collateral. “As the lender, you want to have some sort of reassurance that the borrower will repay the loan,” Jason Reposa, CEO and co-founder of MyBankTracker.com, tells Bustle. “Being in possession of a piece of collateral, such as a valuable material item or family heirloom, means that the borrower has something at stake to discourage them from not paying it back.” Prakash agrees that sometimes asking for collateral may be necessary. “If it’s a large loan and you have some doubt of the borrower’s ability to pay you back, the collateral can protect you,” she says. “If the borrower doesn’t pay back the loan, you can get a court order to sell off the property, for instance, and get most of your money back that way. Just keep in mind that if things get to that point, the relationship will almost certainly be ruined, so be careful who you lend money to in the first place!”\n7 If They Miss A Payment, Say Something Right Away Andrew Zaeh for Bustle Say you are doing everything you can so far to make sure you’re paid back in a timely manner. However, then your friend or family member misses a payment. “It’s just this once,” they say. OK — one time is one thing, but more than once is another. “If the borrower misses a payment, give them a friendly reminder,” Prakash says. Sometimes, all it takes is a quick phone call or email, and they may just be busy with life and have forgotten.” However, she says it’s different if they’ve gotten into a situation where they are unable to pay you back. “In this case, have them write out a signed statement to that effect,” she says. “You can use that to write off the loan as bad, unpayable debt on your tax return.”\n8 Foresee Potential Problems Andrew Zaeh for Bustle “There are a lot of situations where the borrower might not be able to pay you back,” Prakash says. “For instance, many people seek loans from family and friends to start a business, and that is inherently risky since about 80 percent of startups fail. The person could also lose their job, fall ill, or spend the money for reasons other than what they promised.” As a solution, she says that if your loan agreement gives you any options, such as possessing collateral, then pursue those if the borrower doesn’t meet their obligations. “But at the end of the day, realize you are taking a risk and might not get the money that’s owed to you,” Prakash says.","url":"https://www.bustle.com/p/how-to-loan-someone-money-actually-be-paid-back-according-to-experts-11910851"}
