{"authors":[],"date_download":"2018-10-30 17:50:39","date_modify":"2018-10-30 17:50:39","date_publish":"2018-10-30 16:48:54","description":"Millions of civilians in Yemen continue to face “shortages of food, medical supplies, fuel, water, and electricity,” according to Charity Navigator. Here's how you can help the people of Yemen.","filename":"data/vaneerConsumption/HowtohelpvictimsinSaudiledYemenWar.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Videos/4519008.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_world_yemen-war-how-he_b97ae26d6f67287af3ac2b9af55ab0d1__1540921839.html","title":"How to help victims in Saudi led Yemen War","title_page":"Yemen War news: How to help victims in Saudi led Yemen War","title_rss":"NULL","source_domain":"ajc.com","text":"Saudi Arabia’s role in the devastating war in Yemen has brought the kingdom under international scrutiny following the recent assassination of Saudi journalist and dissident Jamal Khashoggi.\nMalnutrition continues to stalk children in #Yemen.\nMore than 1.8 million children are acutely malnourished.\nWith the support of partners, @UNICEF_Yemen treated more than 244,000 under-5 severely malnourished children since the beginning of the year.https://t.co/a03GOlExtP pic.twitter.com/FLTiHHcYqE — UNICEF MENA (@UNICEFmena) October 30, 2018\nThe United Nations and other humanitarian groups have called the war “the world’s worst humanitarian crisis,” leading to an estimated 10,000 deaths, leaving tens of millions reliant on aid and more than 8 million at risk of starvation, Al Jazeera reported. The UN also estimates more than 3 million Yemenis have been displaced, with 280,000 seeking asylum in other countries.\n» RELATED: Aid groups decry 'routine' killing of Yemen's civilians\nOther aid groups believe the casualties are even higher than UN reports. Save The Children has estimated at least 50,000 children died last year alone, an average of 130 every day. Andrea Carboni, an independent researcher with the Yemen for the Armed Conflict Location and Event Data Project, expects to uncover between 70,000 and 80,000 casualties between January 2016 and October 2018 once he completes his research, he told the Independent.\n“The harshest criticism of the Saudi-led war has focused on the airstrikes that have killed thousands of civilians at weddings, funerals and on school buses, aided by American-supplied bombs and intelligence,” according to the New York Times. Aid officials say the economic war led by Crown Prince Mohammed bin Salaman and Yemeni allies has driven millions of civilians deeper into poverty. A UN report published in August also recorded possible violations of sexual violence and recruitment of child soldiers.\n“The drumbeat of assaults on men, women and children is one that has become appallingly routine,” the Norwegian Refugee Council said in a recent statement.\nThe report also noted that after two years of war between government forces and rebels, Yemen's health and sanitation systems are also collapsing. In fact, the nation is currently facing the world’s worst cholera outbreak, with estimates of more than 200,000 cases of cholera in the country and approximately 1,300 people deaths from the disease. One-quarter of that figure are children, according to the UN.\n» RELATED: UN: Death toll from Saudi airstrike in Yemen at 21\nAbout the war\nAccording to Al Jazeera, the conflict in Yemen, the Arab world’s poorest country, dates back to 2004, when the Shiite Houthi rebels who rose to power after the Arab Spring of 2011 and the internationally recognized Yemeni government began battling.\nIn 2014, Houthi rebels took control of Yemen's capital, Sanaa. As the Houthis gained ground in Yemen’s second-biggest city, Aden, a coalition of Arab states led by Saudi Arabia launched a military campaign aimed at defeating the Houthis, who bin Salaman saw as a proxy for Saudi Arabia’s regional rival, Iran. Iran had aided the Houthis’ advance by providing military equipment.\nSeveral of the countries in the coalition, which includes Kuwait, the United Arab Emirates and Bahrain, have either sent troops to fight in the war or carried out airstrikes. The U.S. also recently admitted to deploying a number of troops in addition to supplying the coalition with intelligence and weaponry.\n“The conflict is mostly unknown to Americans, whose military has backed the Saudi-led coalition’s campaign with intelligence, bombs and refueling, leading to accusations of complicity in possible war crimes,” the New York Times reported. “Early promises of a swift victory have given way to a bloody stalemate, while the war has inflicted a catastrophic toll on Yemenis, including widespread hunger and the worst cholera epidemic in history.”\n» RELATED: Trump defends Saudi arms sales amid fury over missing writer\nHow to help\nWHO, @UNICEF_Yemen and health partners continue their efforts to control #cholera outbreak in #Yemen. Today, the third day of the oral cholera vaccination campaign concluded in #Aden targeting more than 250,000 people from five districts.#VaccinesWork pic.twitter.com/vXrWssHexb — WHO Yemen (@WHOYemen) October 29, 2018\nMillions of civilians in Yemen continue to face “shortages of food, medical supplies, fuel, water, and electricity,” according to Charity Navigator. “Despite the difficulties posed by continued violence and regional destabilization, aid groups are responding to the crisis by providing desperately needed food and supplies.”\nThe New York Times recently published a list of such organizations to help the victims. We’ve included the recommendations from Charity Navigator and other nonprofit organizations.\nDonate to:\nYou can also explore more from Charity Navigator to learn about the organizations above before donating. Note that sending money via text message may seem convenient, but according to the Associated Press, that’s not the case. Charities often have to wait on phone companies to release the money.\n» RELATED: Saudis reject threats as stocks plunge after Trump comments\nSign up to be a UN volunteer in Yemen\nApproximately 2,000 assignments become available each year, and while the selection process isn’t easy, UN volunteers get the chance to help on the ground. Be sure to emphasize any relevant skills, including fluency in multiple languages, medical skills and prior disaster relief experience.\nApply here. You can also volunteer to work with the UN online.\nContinue to spread the word\nSometimes word of mouth (or text) is all it takes. Take part in the relief campaign by retweeting news and alerts about shelters, donations and more from official accounts such as: @ICRC_ye, @UNICEF_Yemen, @WHOYemen, @YemenData and more.","url":"https://www.ajc.com/news/world/yemen-war-how-help-civilians-affected-the-world-worst-humanitarian-crisis/FBAESPdJFYasi3rcOnA19I/"}
