{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-23 01:27:02","date_modify":"2018-10-23 01:27:02","date_publish":"2017-03-16 11:22:50","description":"Protect and Survive was first published in 1980 to advise the public on what to do in the face of nuclear war, and provides a survival kit list, tips on sanitation and how to survive a blast.","filename":"data/vaneerConsumption/Howtosurviveanuclearwar1980Governmentleaflet.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E538F2200000578-0-image-a-17_1489662262169.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319466_How-survive-nuclear-war-1980-Government-leaflet_1540258022.html","title":"How to survive a nuclear war: 1980 Government leaflet","title_page":"How to survive a nuclear war: 1980 Government leaflet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A chilling and unnerving Government pamphlet gives advice to people across the UK on how to survive in the event of a nuclear war - from disposing of a body to bricking up windows.\nProtect and Survive was first published in 1980 to advise the public on what to do in the face of nuclear war.\nWarning that no part of the United Kingdom is safe, it details the effects of a nuclear fall-out, outlines how to plan for survival and recognise the warning signs when an attack is imminent, and advises on what to do immediately following an attack and in the days after.\nThe pamphlet is now set to be republished by the Imperial War Museum ahead of its People Power: Fighting for Peace exhibition opening later this month.\nProtect and Survive was first published in 1980 to advise the public on what to do in the face of nuclear war\nWarning that no part of the United Kingdom is safe, it details the effects of a nuclear fall-out, outlines how to plan for survival and recognise the warning signs when an attack is imminent\nWith checklists and a picture guide, it advises on what to do immediately following an attack and in the days after\nAt times shocking, Protect and Survive is a stark reminder of how the world was poised for nuclear war.\nIt advises people on how to make a fallout room and create within it an inner refuge to protect from radioactive fallout dust.\nFamilies would remain in the room for some 14 days after the attack, so the brochure provides a list of essential items to stockpile.\nIndividuals will need some three-and-half gallons (16 litres) of water each and are told to remove toilet chains or tape up handles so clean water could be stored in the cistern.\nAnd should someone die, the leaflet advises placing the body in another room and cover it as securely as possible, and attach an identification.\nThe pamphlet was produced by Margaret Thatcher’s government at the height of the cold war in 1980, as Britain braced itself for any possible attack.\nAt times shocking, Protect and Survive is a stark reminder of how the world was poised for nuclear war\nThe guide advises people on how to make a fallout room and create within it an inner refuge to protect from radioactive fallout dust\nThe pamphlet also tells people how to recognise warnings prior to an attack, what to do during and after, how to deal with casualties, and proves a handy action checklist\nA survival kit list includes biscuits, vegetables, meats, fruit, fruit juices, sugar cubes, jams, crockery, notebooks and pencils for messages and dust bags\nIf people were not at home during the nuclear strike, they were told to, 'lie flat (in a ditch) and cover the exposed skin of the head and hands'.\nA survival kit list includes biscuits, vegetables, meats, fruit, fruit juices, sugar cubes, jams, crockery, notebooks and pencils for messages and dust bags.\nAnd a portable radio is needed in order to listen out for advice following the attack.\nOther items needed in the fallout room are spare clothes, a table and chairs, toys and magazines, a clock and a calendar.\nThe pamphlet also tells people how to recognise warnings prior to an attack, what to do during and after, how to deal with casualties, and proves a handy action checklist.\nOther items needed in the fallout room are spare clothes, a table and chairs, toys and magazines, a clock and a calendar\nIt gives a handy how-to guide on constructing an inner refuge which people might need to stay in for some 14 days following an attack\nRare items such as a handwritten poem by Siegfried Sassoon and original sketches for the peace symbol will go on display in the Imperial War Museum's exhibition.\nThe exhibition tells the stories of individual and collective acts of anti-war protest, and the varied forms of creative expression used to campaign against war.\nA combination of more than three hundred items will take visitors on a journey from the First World War to the present day, looking at how peace activists have influenced perceptions of war and conflict.\nPaintings, literature, posters, banners, badges and music reveal the breadth of creativity generated by those who have opposed war and how anti-war protest has been inextricably linked to the cultural mood of each era.\nMatt Brosnan, Historian and Curator of People Power: Fighting for Peace at IWM said: 'This exhibition is the first of its kind and displays a number of fascinating items which have never been exhibited before.\n'In IWM's Centenary year, this major exhibition continues our mission to explore war and conflict from multiple perspectives – highlighting the peace movement and its important role in British history.'","url":"https://www.dailymail.co.uk/news/article-4319466/How-survive-nuclear-war-1980-Government-leaflet.html"}
