{"authors":["Jeremy Duns"],"date_download":"2018-10-30 18:32:17","date_modify":"2018-10-30 18:32:17","date_publish":"2015-04-15 11:21:54","description":"The Edward Snowden story is a rare beast: you can’t predict how people will feel about it. And they usually feel very strongly one way or the other. |","filename":"data/vaneerConsumption/HowThePressMisledUsOverWhatEdwardSnowdenReallyRevealed.json","image_url":"https://media.breitbart.com/media/2015/04/smiling_snowden.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_15__1540924337.html","title":"How The Press Misled Us Over What Edward Snowden Really Revealed","title_page":"How The Press Misled Us Over What Edward Snowden Really Revealed | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Edward Snowden story is a rare beast: you can’t predict how people will feel about it. And they usually feel very strongly one way or the other. Snowden is either a hero who can do no wrong, or a traitor who has caused immense damage to national security.\nIt’s not often you find liberals and libertarians on the same side of an issue, but as acknowledged by outgoing Guardian editor Alan Rusbridger, the two often meet in approving of Snowden’s actions. The journalists who have reported on the Snowden material have also often noted, sometimes with a tinge of despair, that despite huge interest in the US, Germany and elsewhere, British readers have been noticeably colder to the story. In October 2013, The Guardian even gave journalist and novelist John Lanchester access to Snowden files in the hope he could make the case better, which he did:\nIn the UK there has been an extraordinary disconnect between the scale and seriousness of what Snowden has revealed, and the scale and seriousness of the response. One of the main reasons for that, I think, is that while some countries are interested in rights, in Britain we are more focused on wrongs.\nI think there’s some truth to this. Brits don’t necessarily trust their government any more than Americans do, but I suspect many find the idea their spy agencies are so powerful and efficient they can practically monitor everyone’s movements by the second highly implausible. This is perhaps a cultural difference, and one that is striking in a lot of fiction and entertainment.\nAs a Brit, I tend to watch American TV crime series feeling like a Dickensian child pressing my nose against a window-pane: the beaches, the sunshine, the cops who look like they have a second gig as models. British crime series tend to be much grittier affairs, with middle-aged detectives in wrinkled trench-coats rubbing their hands together in the rain as they stand over yet another body of a young woman found in the woods.\nSuch bleakness is of course just as much a device as the glossiness of CSI: Miami. But British shows do seem more realistic to me when it comes to the way they treat two aspects of police work: bureaucracy and technology. In an American series, a detective simply has to lean over the shoulder of a colleague for a few moments before barking ‘Wait – what’s that?’, whereupon a slightly-less-preposterously-good-looking computer savant zooms into the close-circuit footage on screen and instead of the picture becoming grainer as would happen in real life, a previously unseen detail is now magically made crystal-clear.\nSimilarly, a detective on an American show only needs to mention a suspect’s name and within moments their entire life history is pulled up on a giant screen. Some of this has seeped into British TV, but generally there is a greater sense that finding evidence is time-consuming, tedious and often thwarted by internal politicking.\nThese differences rely on stereotypes, but I think contain a grain of truth about the national psyche of Brits and Americans – and that they go some way to explaining the gulf in how the two nationalities have reacted to the Edward Snowden disclosures. For many Brits, the claims made by Snowden and his supporters of the capabilities of the NSA and other agencies feel as realistic as those ‘Zoom in on that!’ moments in American TV shows.\nI’ve no doubt the spooks want to gather as much information as is humanly possible, but I think the key word is humanly. Humans are flawed, messy creatures. In a Guardian article a month before the Snowden story broke, Glenn Greenwald pointed to an astonishing statistic that had been reported by the Washington Post three years earlier:\nEvery day, collection systems at the National Security Agency intercept and store 1.7 billion e-mails, phone calls and other types of communications.\nFor Greenwald, this was alarming: more evidence that the US had become a ‘ubiquitous, limitless Surveillance State’. But for me, at least, that figure is reassuring. It’s simply too large to be sifted. Snowden supporters pour scorn on the ‘if you have nothing to hide, you have nothing to fear’ argument, but it’s more that in such a vast ocean of information the likelihood of my petty secrets being of interest to anyone seems vanishingly small. Indeed, the Washington Post article Greenwald was quoting from made this clear in context:\nEvery day, collection systems at the National Security Agency intercept and store 1.7 billion e-mails, phone calls and other types of communications. The NSA sorts a fraction of those into 70 separate databases. The same problem bedevils every other intelligence agency, none of which have enough analysts and translators for all this work. The practical effect of this unwieldiness is visible, on a much smaller scale, in the office of Michael Leiter, the director of the National Counterterrorism Center. Leiter spends much of his day flipping among four computer monitors lined up on his desk. Six hard drives sit at his feet. The data flow is enormous, with dozens of databases feeding separate computer networks that cannot interact with one another.\nThis is the key reason, I think, that Brits are less bothered about Snowden’s revelations suggesting our privacy is at risk. We tend to believe ‘cock-up’ is a more likely explanation than conspiracy, and that even if the spooks aren’t all downing whiskeys as they reflect on their failed marriages like Len Deighton characters, their lives are probably closer to normal – closer to ours – than to a sleek Prada-clad operative summoning up the details of what we bought at our local off-licence three hours ago by speaking to a giant screen.\nIn real life, computers crash, or don’t have all the information you want. In real life, bosses accidentally delete files because they’re 61 and shouldn’t be allowed anywhere near a PC.\nDamaging\nSnowden supporters have pooh-poohed repeated claims by intelligence officials in the United States and Britain that Snowden’s leaks have caused catastrophic damage to Western intelligence activities. I’ve no love for these officials, some of whose gung-ho defences of spies seem self-parodic. Congressman Mike Rogers, who last year told the House of Commons Snowden was a traitor who should be charged with murder, seems to have stepped out of a bad 80s spy movie that couldn’t afford to cast Brian Dennehy. In Britain, Sir Malcolm Rifkind, chairman of Parliament’s Intelligence and Security Committee and a staunch defender of MI6 and GCHQ’s actions in the face of the Snowden leaks, had to resign from his chairmanship last February when he was caught in a newspaper sting hinting to representatives of a fictional Chinese company that he had ‘useful’ access to ambassadors.\nIn a stroke, all his smooth reassurances about the care the spy agencies take with metadata turned to ashes: what if it had been Chinese intelligence who had fabricated the company rather than the Daily Telegraph? But there was an element of cock-up here, too. Snowden and his supporters have painted Western intelligence agencies as near-omniscient, but in reality it appears they don’t even have basic oversight of knights of the realm with privileged access to their secrets.\nMany have pointed out the absurdity of the spy agencies not offering any proof of their assertions that the Snowden leaks have damaged national security. But what proof would we accept of it? Revealing the specifics of how some ‘bad actors’ have used the leaks to their advantage would run the risk of revealing this to other bad actors who haven’t yet taken advantage of the same information. And spooks would be unlikely to be believed anyway: any evidence they produced would be shouted down to cries of ‘WMD’ – and people would rightly point out that intelligence agencies are professional deceivers, so are hardly beyond fabricating evidence.\nSnowden supporters claim none of the stories have damaged national security, but on the face of it this stretches common sense. For instance, a review by Associated Press in February 2014 found that six NSA employees had been accidentally named in the Snowden reporting due to redaction errors.\nSnowden has exposed NSA efforts to spy on China, but the US does that for very good reasons and none of those stories presented any evidence the NSA was engaged in anything other than legitimate espionage activity. Snowden didn’t just give the South China Morning Post information about the NSA’s operations against Hong Kong and ‘the mainland’, i.e. China itself – self-evidently damaging US national security in the process – but also showed reporter Lana Lam documents in an online interview he had with her and gave specific intelligence about NSA targets’ IP addresses and dates of activity.\nSnowden’s attempt to justify handing this information over was a mixture of contradictions, unsupported statements and an apparent total misunderstanding of what constitutes illegitimate espionage activity on the part of the United States. Even Glenn Greenwald baulked at this development:\nGreenwald said he would not have published some of the stories that ran in the South China Morning Post. “Whether I would have disclosed the specific IP addresses in China and Hong Kong the NSA is hacking, I don’t think I would have,” Greenwald said. “What motivated that leak though was a need to ingratiate himself to the people of Hong Kong and China.”\nWell, yes: he was on the run for stealing hundreds of thousands of documents from the NSA. But I don’t think Snowden wanting to ingratiate himself to China excuses his damaging US national security.\nMisleading\nSome of the other Snowden stories have been more nuanced: it is possible for a story as a whole to be in the public interest and expose wrongdoing, but unbeknown to the reporters, or perhaps even to the intelligence agencies, a single detail in it can alert terrorists or others to a security breach, acting as a clue they assemble alongside others. It could be that the Snowden leaks are simultaneously the most significant exposure of illegitimate activities by Western intelligence agencies in recent history and the most significant exposure of legitimate ones, too.\nSome legitimate secrets have been exposed without there being too much fuss made, partly because the spooks have mounted such a poor defence of their actions, partly because there has been such a deluge of reports it’s been hard to keep track, and partly because sensationalised reporting has often disguised a lack of public interest in exposure. One example of that is a story published last January by The Guardian, The New York Times and ProPublica. The Guardian’s headline was ‘Angry Birds and “leaky” phone apps targeted by NSA and GCHQ for user data’, and it opened:\nThe National Security Agency and its UK counterpart GCHQ have been developing capabilities to take advantage of “leaky” smartphone apps, such as the wildly popular Angry Birds game, that transmit users’ private information across the internet, according to top secret documents. The data pouring onto communication networks from the new generation of iPhone and Android apps ranges from phone model and screen size to personal details such as age, gender and location. Some apps, the documents state, can share users’ most sensitive information such as sexual orientation – and one app recorded in the material even sends specific sexual preferences such as whether or not the user may be a swinger. Many smartphone owners will be unaware of the full extent this information is being shared across the internet, and even the most sophisticated would be unlikely to realise that all of it is available for the spy agencies to collect.\nFrightening stuff. Most people who read this far and who had ever played Angry Birds or anything like it would most likely have been shocked and outraged. The impression is that the NSA is spying on their apps and games, and extracting information about their lives from them. But if you read the whole piece, paragraph 17 states:\nThe documents do not make it clear how much of the information that can be taken from apps is routinely collected, stored or searched, nor how many users may be affected. The NSA says it does not target Americans and its capabilities are deployed only against “valid foreign intelligence targets”.\nSo there’s no evidence of wrongdoing, then – and the public interest defence in the story collapses as a result. If GCHQ and the NSA planned to try this on valid foreign intelligence targets, it’s a fair guess those targets weren’t aware their apps could be accessed in such a way. But thanks to these articles, they might well have been alerted to this vulnerability. It might be impossible to prove Western intelligence agencies lost targets as a result of this story, but common sense suggests it is a very real possibility.\nThe takeaway most readers would have got from this story would have been ‘the NSA is currently exploiting Angry Birds’, or even ‘the NSA might be gathering intelligence on me while I play Angry Birds’. This is a result of misrepresentations in reporting. For instance, ProPublica’s headline was ‘Spy Agencies Probe Angry Birds and Other Apps for Personal Data’. ‘Probe’ is in the present tense and the headline suggests the agencies are extracting personal data from it.\nYet paragraph 19 of The Guardian’s article revealed that there wasn’t any evidence that Angry Birds had been exploited in this way – instead, a GCHQ document in 2012 had listed the code needed to do this, using the game as a case study to show what could be extracted from it. And to find the year of that GCHQ document I had to triangulate the reporting, as it was mentioned by ProPublica and The New York Times, but not by The Guardian.\nWith all of these stories, there’s a bait and switch: an alarming claim at the top of the stories that, as you read further, you realise isn’t supported by the evidence. The New York Times story, for instance, opened:\nWhen a smartphone user opens Angry Birds, the popular game application, and starts slinging birds at chortling green pigs, spies could be lurking in the background to snatch data revealing the player’s location, age, sex and other personal information, according to secret British intelligence documents.\nYes, of course they could be. But there is no evidence they are. It’s not until paragraph 6 that the story comes clean and admits this.\nThe scale and the specifics of the data haul are not clear. The documents show that the N.S.A. and the British agency routinely obtain information from certain apps, particularly those introduced earliest to cellphones. With some newer apps, including Angry Birds, the agencies have a similar ability, the documents show, but they do not make explicit whether the spies have put that into practice.\nAnd yet all three publications reported this in a way that suggested that this very thing was put into practice, and was current. These articles would have been in the public interest if they had presented any evidence that GCHQ and/or the NSA were indiscriminately accessing and actively using information of people who they had insufficient reasons to suspect were a threat to national security – but none did.\nSensationalist\nSometimes, the tricks are more subtle. The Guardian used a photograph of Angry Birds in their piece but noted in the caption that this was as part of a case study. But newspapers know that people generally won’t read as carefully as this, and that they will garner the wrong impression. Editors may even be trying to give the wrong impression, in fact, because they want the headline and early paragraphs to generate outrage among readers, so that they read it and share it. That’s more likely to happen if they imply that a hypothetical proposal from 2012 is a current operation, and that it might be aimed at their own readers.\nThe Guardian caption read ‘GCHQ documents use Angry Birds – reportedly downloaded more than 1.7bn times – as a case study for app data collection’. Most won’t have read the caption but simply seen the accompanying image and presumed that Angry Birds was being exploited. But even if you did read the caption, you would probably have assumed by its use of the present tense that the GCHQ documents in question were current rather than from two years earlier.\nOne could argue that the caption was technically correct, as the documents exist in the present, but it’s misleading nevertheless, and purposefully so. ‘Internal GCHQ documents from 2012 discussed the hypothetical use of Angry Birds to collect intelligence against suspected targets’ isn’t as exciting a story. In fact, it’s not a story at all, as there’s no public interest to it – there’s no evidence of wrongdoing here, just the exposing of classified information about an idea our intelligence agencies had. It was an interesting story, certainly. But it wasn’t in the public interest.\nMany of the Snowden stories have followed this pattern: a seemingly shocking example of malfeasance by Western intelligence agencies draws readers in, but within a few paragraphs it becomes clear there is no evidence for the malfeasance mentioned, and instead legitimate intelligence methods are being disclosed to the world and possibly being rendered useless.\nThis clickbait sensationalist approach is the pattern of a lot of media today, of course, but it’s disheartening to see it applied to our national security secrets, especially by newspapers as well-respected as The Guardian and The New York Times, not least because other outlets take the lead from them. Once the Angry Birds story had been published by those two papers, Chinese whispers began and the story became even more baldly stated and lurid.\nIn a White House press conference, Victoria Jones of Talk Radio News Service said: ‘The NSA is lurking in the background of your game of Angry Birds, waiting to scoop up all your personal data as you lob hapless creatures into the air. It feels like this is the last bastion of American freedom that’s been breached.’ ABC News ran a story headlined ‘A Little (Angry) Bird Told the NSA What You’re Up To’.\nThat headline epitomises one of the biggest problems with the way the Snowden leaks have been reported: to drive traffic, stories distorts the truth, misrepresenting an unrealised idea from 2012 to legitimately target suspected bad actors as a current operation directed at invading the privacy of you, the reader. This sort of story – and there have been dozens of them in the coverage of Snowden’s documents – has created a new kind of scaremongering.\nWhere national security state hawks once sold the public the message ‘BE AFRAID – THE TERRORISTS ARE PLANNING TO ATTACK US!’, the Snowden story has repeatedly sold a new but equally terrifying narrative: ‘BE AFRAID – YOUR GOVERNMENT IS SPYING ON YOU!’ As we only know what the Snowden documents contain through the distorted lens of this kind of coverage, it’s little wonder that the debate over surveillance reform has largely been framed as being about the needless invasion of citizens’ privacy.\nBut even if zooming in on your emails were as easily done as in an episode of CSI: Cyber, the likelihood of this happening seems extremely small and the chances of these revelations damaging national security can be conveniently forgotten in the panic.\nAdapted from News of Devils: The Media and Edward Snowden by Jeremy Duns","url":"https://www.breitbart.com/national-security/2015/04/15/how-the-press-misled-us-over-what-edward-snowden-really-revealed/"}
