{"authors":[],"date_download":"2018-10-30 14:22:03","date_modify":"2018-10-30 14:22:03","date_publish":"2017-01-26 00:00:00","description":null,"filename":"data/vaneerConsumption/HowTrumpcancutofffundstosanctuarycities.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_01_how_trump_can_cut_off_funds_to_sanctuary_cities_comments_1540909323.html","title":"How Trump can cut off funds to sanctuary cities","title_page":"Blog: How Trump can cut off funds to sanctuary cities","title_rss":"NULL","source_domain":"americanthinker.com","text":"Yesterday, Donald Trump threw down the gauntlet to sanctuary cities by issuing an executive order that directed federal agencies to identify funds the government can withhold to punish sanctuary cities. It's a shot across the bow to the more than 300 states, cities, and towns that refuse to cooperate with the federal government in deporting illegal aliens. But it's not going to be easy. The funds that the Trump administration will target have other purposes than enforcing immigration law, which may cause the effort to come a cropper in the courts. So the plan appears to be to incorporate a carrot and stick approach to convince some localities to drop their opposition to enforcing immigration law and to challenge and threaten other entities to obey. USA Today: Trump will be armed with a range of powerful options, including federal lawsuits and the power to withhold hundreds of millions of dollars in grants that states and cities rely... (Read Full Post)","url":"https://www.americanthinker.com/blog/2017/01/how_trump_can_cut_off_funds_to_sanctuary_cities_comments.html"}
ination of carrots and sticks,\" said Jessica Vaughan, director of policy studies at the Center for Immigration Studies , who has advised the Trump transition team on immigration enforcement options. \"The point is not to go around whacking all these little cities and counties, it's to get them to do the right thing. And for the die-hards, to confront them.\" Local communities are digging in for a fight. Chicago Mayor Rahm Emanuel created a task force to help undocumented immigrants and pledged $1 million for a legal defense fund. \"Chicago always will be a sanctuary city,\" he said. Some cities — including San Francisco, Chicago and New York — proudly declare themselves sanctuaries and have enacted policies that prohibit municipal employees from turning over residents or information on them to the U.S. Immigration and Customs Enforcement (ICE). Other cities more narrowly restrict police from inquiring about the immigration status of detained suspects. There also are cities that work with federal immigration authorities but refuse to hold suspects in jail solely so ICE agents can pick them up.\nLawsuits against sanctuary cities will probably take years to resolve. But going after grant money is a different story:\nThe Trump administration has the power to cut off much of that funding. For example, Justice's State Criminal Alien Assistance Program, or SCAAP, distributed $165 million in 2015 to local agencies that detained undocumented immigrants in its jails. Laurie Robinson , a former assistant attorney general under Presidents Clinton and Obama who headed the Office of Justice Programs , which oversees grants, said the statute implementing SCAAP gives an attorney general broad power to decide who gets money. \"They could cut off drug programs, domestic violence grants, violence against women grants,\" she said.\nThe hue and cry that such cuts in funding will provoke presents a thorny political problem for the Trump administration, but not an insurmountable one. The threat of a cutoff may bring many of these sanctuary cities around. If it doesn't, the cuts in grant money will be weighed against the federal government's compelling need to deport criminal aliens – an issue for which most residents even in sanctuary cities agree is in the community's best interest.\nWhile there are legal minefields to avoid or overcome, it seems a certainty that the first serious effort to fight the defiance of immigration law by sanctuary cities will be attempted by the Trump administration.","url":"https://www.americanthinker.com/blog/2017/01/how_trump_can_cut_off_funds_to_sanctuary_cities.html"}
