{"authors":["David Wickert"],"date_download":"2018-10-30 01:26:19","date_modify":"2018-10-30 01:26:19","date_publish":"2018-06-27 11:24:00","description":"Georgia police departments are preparing to enforce Georgia’s new hands free driving law, which takes effect July 1. If you get a ticket for breaking the cell phone law, there’s a provision in the law that could help you get in court.","filename":"data/vaneerConsumption/Howtowinincourt.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/12/Videos/4414415.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_commuting_georgia-distracted-driving-law-how-win-court__1540862779.html","title":"How to win in court","title_page":"Georgia hands free cell phone law: How to win in court","title_rss":"NULL","source_domain":"ajc.com","text":"As The Atlanta Journal-Constitution reported last week, local police departments are preparing to enforce Georgia’s new distracted driving law, which takes effect this Sunday.\nThe new law prohibits motorists from holding a phone or other electronic device while driving. A first offense will cost you $50 and one point on your driver’s license (motorists who accumulate 15 points in a 24-month period lose their license). A second offense costs $100 and two points, while a third costs $150 and three points.\nBut there’s a little-discussed provision of the law that could help you get a distracted-driving citation tossed out.\nUnder that provision, any person appearing in court for a first offense who produces a hands-free device or proof of purchase of such a device will not be guilty of the violation. The idea is to give you a chance to show you intend to comply with the law in the future.\nThink of it as a “get out of jail free” card. The provision requires you to affirm you have not used such a “card” in the past – so you can’t keep producing receipts to get out of subsequent violations.\nYou can learn more about how the new law will be enforced here. You can find more information about what’s legal and what’s not under the law here.","url":"https://www.ajc.com/blog/commuting/georgia-distracted-driving-law-how-win-court/5vKbMEv47Mdrz2mRTBkkpK/"}
