{"authors":["Sadie Whitelocks For Mailonline"],"date_download":"2018-10-23 01:42:14","date_modify":"2018-10-23 01:42:14","date_publish":"2017-04-26 12:13:54","description":"The giant liner, which boasts 16 decks and the capacity to hold 2,014 passengers, will be docked at the Fincantieri Shipyard in Palermo, Italy, while it's given an overhaul.","filename":"data/vaneerConsumption/HowtheQueenVictorialinerwilllookafter34mrefurb.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9DD36D00000578-0-image-a-39_1493197499584.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-4446786_How-Queen-Victoria-liner-look-34m-refurb_1540258934.html","title":"How the Queen Victoria liner will look after £34m refurb","title_page":"How the Queen Victoria liner will look after £34m refurb | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A decade after its launch, the iconic Queen Victoria cruise ship is getting a £34million makeover, giving it a truly royal look.\nThe giant liner, which boasts 16 decks and the capacity to hold 2,014 passengers, will be upgraded with newly-designed penthouse suites and an extension of the rooftop pool area.\nOther new features include a 'pillow menu' featuring nine different pillows to ensure maximum comfort for cruise-goers and private butlers for penthouse guests.\nScroll down for video\nSun deck: This lounge space will be extended to provide guests with additional deck space and access to the rays from sunrise to sunset. The shaded area will also be increased for those looking to dine al fresco\nLiving the high life: Five of Queen Victoria’s penthouse suites will be made-over with features including floor-to-ceiling windows and private balconies\nComputer generated images reveal what the vessel will look like after its transformation, with slick interiors and soft lighting.\nThe bedrooms look fit for a queen, with royal blue and blood red bed throws. Pillows embroidered with gold thread are an extra touch.\nFive of Queen Victoria's penthouse suites have been completely redesigned with floor-to-ceiling windows and private balconies.\nThe bathrooms have also been spruced up, with the installation of bubbling whirlpool baths.\nIn order to complete the facelift, the ship will be out of action from May 5 with completion scheduled for June 4.\nLounging around: Computer generated images reveal what the vessel will look like after its transformation, with slick interiors and soft lighting\nTouring trio: Ordered by Carnival and built in 2007 for the Cunard Line, Queen Victoria has two sister ships, including the RMS Queen Mary 2 and the MS Queen Elizabeth\nAll mod cons: New flat screen TVs and hot drink making facilities will be installed in the ship's premium rooms\nOrdered by Carnival and built in 2007 for the Cunard Line, Queen Victoria has two sister ships, the Queen Mary 2 and the Queen Elizabeth.\nThe carrier was last given a fresh lick of paint in 2011, with communal spaces and staterooms being the prime focus.\nA new carpet was fitted in the Britannia Restaurant and the dance floor in the Queen’s Room ballroom was refinished.\nOther popular features of the boat include a library boasting more than 6,000 books and a spa with 'heat-therapy chambers'.\nCommenting on the upcoming renovations, Cunard's senior vice president Simon Palethorpe said: 'As part of the Queen Victoria refurbishment, we’ve looked to heighten our customers’ experience in every way, from the extension of the aft lido sun deck to refreshed interiors across the board.\nSun trap: The Winter Garden relaxation room will get new furnishings and carpet with a glass canopy added\nTop trimmings: Other new features include a 'pillow menu' featuring nine different pillows to ensure 'maximum comfort' for cruise-goers and private butlers for penthouse guests\nSuite dreams: The bedrooms look fit for a queen, with royal blue and blood red bed throws. Pillows embroidered with gold thread are an extra touch\n'Responding to the demands of our guests, we've introduced 43 Britannia Club Staterooms, bringing the Queen Victoria in line with the rest of the Cunard fleet.\n'The distinctive Cunard elegance remains of course and design cues have been taken from previous Cunard ships, such as the original Queen Mary and Queen Elizabeth.\n'At the same time, there are many enhancements - for example, new bar concepts and large flat screen TVs in all staterooms - that meet the needs of today's luxury traveller.\n'We’re looking forward to inviting the first Cunard guests on board to enjoy the new additions and refreshed features.'\nThe ship's refit will be carried out at the Fincantieri Shipyard in Palermo, Italy.\nQueen Victoria, will then return to Southampton before embarking on its maiden four-night voyage to Amsterdam and Bruges.","url":"https://www.dailymail.co.uk/travel/travel_news/article-4446786/How-Queen-Victoria-liner-look-34m-refurb.html"}
