{"authors":[],"date_download":"2018-10-30 18:15:09","date_modify":"2018-10-30 18:15:09","date_publish":"2018-08-08 16:22:33","description":"Timed entry passes and tickets for the National Museum of African American History and Culture in Washington are difficult but not impossible to obtain.","filename":"data/vaneerConsumption/HowtogetticketstoDCsAfricanAmericanhistorymuseum.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/09/15/Videos/5127206173001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/travel_how-get-tickets-for-_6d68e8e94d2beb80d65136956177cd0a__1540923309.html","title":"How to get tickets to DC's African American history museum","title_page":"How to get tickets to DC's  African American history museum","title_rss":"NULL","source_domain":"ajc.com","text":"Since opening on Sept. 24, 2016, the National Museum of African American History and Culture (NMAAHC) has generated demand for tickets the likes of which are usually reserved for hit plays, popular concerts, or major sporting events.\n»RELATED: Oprah Winfrey exhibit coming to DC’s National Museum of African American History and Culture\nAbout three million people have already visited the NMAAHC, which is the newest museum in the Smithsonian Institution and houses close to 37,000 rare artifacts within three stories.\nNMAAHC timed-entry passes are released the first Wednesday of each month.\nThese include historical items such as Nat Turner's Bible and a shawl worn by Harriett Tubman, as well as documents, photography and other materials.\n» Read John Lewis’ powerful speech at opening of the national African American museum\n» RELATED: Honoring Dr. Martin Luther King Jr.\nThe NMAAHC also celebrates popular culture with items such parts of the \"Oprah\" set, but it also contains some items – such photographs of lynchings - that show the violence that has been directed toward African Americans. These items are located within red lines to advise viewers of their content.\nNot only is demand for tickets high, visitors tend to spend a lot of time in the museum once they get in. The museum's associate director told NPR.com in November that while most venues have a \"dwell\" time of an hour and 45 minutes to two hours, visitors are spending up to six hours exploring. It's already an important part of many people's list of things to do in Washington, D.C.\nHow you can visit the museum\nFree NMAAHC timed passes – each of which has unique code and can only be used once - are available online through ETIX. Officials caution visitors that passes that aren't obtained by walking up to the museum or online via ETIX for the African American museum may be counterfeit.\nYou won't be admitted prior to the time on your pass, but if you're late getting to the museum and miss the time on the pass, you can go later that same day. If the NMAAHC is already at capacity, you'll have to wait until room is available.\n»RELATED: 9 iconic black history landmarks to visit near Georgia\nThere are four types of timed entry passes:\nSame-day online\nYou can look online daily beginning at 6 a.m. and claim up to four passes for the same day. They're available until they run out.\nWalk-ups\nBecause weekends are so popular, walk-up passes aren't available for Saturdays or Sundays. During the week, a limited number of walk-up passes at one per person are available starting at 1 p.m. They're given out on the Madison Drive side of the museum.\nAdvance online\nIf you're planning a trip from Atlanta in advance and want to make sure you can get tickets before you go, this option is your best bet. If you're able to obtain advanced-entry passes, you can claim up to six. They're timed at 15-minute intervals, and everyone – even infants – entering the museum will need a pass.","url":"https://www.ajc.com/travel/how-get-tickets-for-the-national-african-american-history-museum/aFBQyzIHD85FWNm1cuqllK/"}
