{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:22:50","date_modify":"2018-10-30 21:22:50","date_publish":"2015-11-20 06:17:09","description":"A story is making the rounds on Facebook that claims Donald Trump is calling for \"ID badges\" for Muslims. Frightening--and a lie.","filename":"data/vaneerConsumption/HowtheMediaSmearedDonaldTrumpasaNazi.json","image_url":"https://media.breitbart.com/media/2015/11/Donald-Trump-Scott-Olson-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_19__1540934570.html","title":"How the Media Smeared Donald Trump as a Nazi","title_page":"How the Media Smeared Donald Trump as a Nazi | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A story is making the rounds on Facebook that claims Republican frontrunner Donald Trump is calling for “ID badges” for American Muslims. The image on the story is of Jewish children wearing yellow stars during the Holocaust. Very frightening–and a lie.\nStep 1: Seed. The lie begins with a Yahoo! profile in which Trump is asked, supposedly (the reporter does not provide his exact question), if he would “require registering Muslims in a database or giving them a form of special identification that noted their religion.”\nTrump does not say yes or no. Instead, he dodges the question, and comes back to the question of monitoring mosques (which the U.S. has done in the past): “We’re going to have to–we’re going to have to look at a lot of things very closely,” Trump said when presented with the idea. “We’re going to have to look at the mosques. We’re going to have to look very, very carefully.”\nThe Yahoo! reporter, Hunter Walker (a hater of note), construes Trump’s answer as follows: “He wouldn’t rule it out.”\nStep 2: Amplify. The story is picked up by CNN. Sara Murray asks whether Trump would “rule out” a database for Muslims–borrowing from Walker’s article. Trump is surprised, and tells her, truthfully, that he never responded to Walker’s question.\nHere is their exchange, as reported by CNN:\nWhen Murray asked whether Trump would rule out a database for Muslims, he said he didn’t “know where you heard that.” “Yahoo News asked you about it, you didn’t rule it out,” Murray said as Trump worked a ropeline after the event. “No, I never — I never responded to that question,” Trump said. “So would you not support it?” Murray asked. “I never responded to that question, Sara,” Trump said. He added that he didn’t “know who wrote it,” referring to the Yahoo News article, and declined to answer a follow-up question from Murray about whether he would “support something like that,” referring to a Muslim database.\nStep 3: Distort. NBC News’ Vaughn Hillyard confronts Trump: “Should there be a database system that tracks the Muslims here in this country?” Trump replies: “There should be a lot of systems, beyond databases. We should have a lot of systems. And today you can do it. But right now, we have to have a border, we have to have strength, we have to have a wall, and we cannot let what’s happening to this country happen any longer.” Hillyard asks: “But that’s something your White House would like to implement?” Trump: “Oh I would certainly implement that. Absolutely.” Hillyard follows up: What do you think the effect of that would be? How would that work? It would stop people from coming in illegally. We have to stop people from coming into our country illegally.” Hillyard asks if Trump would go to mosques to register people. “Different places,” Trump says.\nIt is clear from the exchange that Trump thinks Hillyard is talking about new entrants to the United States, presumably Syrian refugees. But Hillyard reports Trump’s answer as if he is talking unambiguously about Muslims already in the United States.\nStep 4: Smear. Hillyard comes back later, asking Trump: “Mr. Trump, why would Muslim databases not be the same thing as requiring Jews to register in Nazi Germany?” Trump realizes Hillyard is out for blood. “You tell me,” he says, and walks away.\nThe story goes viral: “Donald Trump Is In Favor Of Legally Requiring American Muslims to Register on a Database,” writes Zeke Miller of Time, linking to Hillyard’s story at NBC. A proposal Trump never made is now an established mainstream media fact.\n[Update: The Washington Post‘s Jose A. DelReal got creative, asking the Trump campaign “whether his proposals would require the creation of a special agency.” (The campaign, according to DelReal, did not respond to his query–did not rule it out, perhaps.)]\nNote that none of these esteemed journalists bothers to question their own assumptions, or to ask Trump precisely whether he is talking about American citizens or about foreign nationals. They chase their own questions down a broken telephone line.\nStep 5: Nazi. Now the dregs of the Internet begin to play up what Yahoo!-CNN-NBC have produced, with Raw Story reporting: “Trump crosses the Nazi line: Maybe Muslims should wear special ID badges.”\nHe never said that–but at this stage, who cares.","url":"https://www.breitbart.com/politics/2015/11/19/how-the-media-smeared-donald-trump-as-a-nazi/"}
