{"authors":[],"date_download":"2018-10-30 20:07:10","date_modify":"2018-10-30 20:07:10","date_publish":"2016-06-20 15:11:00","description":"Here's how to evict someone in Georgia. We cover eviction notices, services, timelines and process.","filename":"data/vaneerConsumption/HowtoevictsomeoneinGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/06/14/Images/photos.medleyphoto.10235590.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_home--garden_how-evict-someone-georgia__1540930030.html","title":"How to evict someone in Georgia","title_page":"How to evict someone in Georgia","title_rss":"NULL","source_domain":"ajc.com","text":"So you want to know how to evict someone in Georgia?\nKeep in mind that however fed up you are, there are strict state laws governing the eviction process in Georgia.\n[Read more: A Q&A on the eviction process in Georgia]\nAnd according to the U.S. Department of Housing and Development's web portal for landlord and tenant rights in Georgia, the state-enacted laws \"establish certain rights and responsibilities, which even if not mentioned in the lease, are still legally enforceable.\"\nThe specific area of the Georgia code that addresses evictions, or \"dispossessory proceedings\" is Title 44, Chapter 7, and it clearly states that evictions in Georgia require a \"Writ of Possession.\" This is a document signed by a judge that directs law enforcement to remove the named persons or other occupants from the premises identified in the dispossessory warrant and on the writ.\nSo yes, to legally evict in Fulton, Cobb or DeKalb County, you'll need to work through the courts and local law. And keep in mind that Georgia rental laws indicate certain rights even for tennants who haven't been paying their rent, and that the eviction process must play out in a timely fashion.\nAccording to the Valdosta State University's \"Georgia Tenant-Landlord Law\" link from the U.S. Department of Housing and Urban Development's website, several conditions allow you, as landlord, to proceed with an eviction. The most common, of course, is failure to pay rent.\nBut in Georgia, before you can evict, you must make a written demand that full rent is due by a specific date (or that another lease agreement be met), and only after the tenant fails to comply can you move along. Even then, you first must give tenants 30 days to vacate before an eviction comes into play.\nEviction proceedings are handled in the Civil Division of the State Court Clerk's Office. In addition, DeKalb, Fulton or Cobb County law enforcement will execute the Writ of Possession. Each lists a process they would like landlords to follow, usually beginning with scheduling an eviction appointment with the sheriff or marshal's office.\n[Read more: Law helps renters forced out when landlord defaults]\nIn DeKalb, for example, the DeKalb County Marshal's Office provides a checklist for landlords who have already completed the dispossessory process and obtained a Writ of Possession. It lists further steps for eviction such as giving the Writ two business days to reach the Marshal's office.\nThe Marshal's office also outlines practical arrangements that are the evicting landlord's responsibility and gives some tips for evictions in DeKalb County, including\nProvide sufficient labor to safely remove all items, usually a minimum of five workers, who you can find by contacting a company that specializes in \"eviction services\" in the Yellow Pages.\nProvide a way to gain entry to the property, such as a pass key or locksmith.\nOnce a deputy has made a safety sweep of the location and given you permission to start, have your labor crew remove all items of value and place them on the closest right-of-way. Items removed from apartments or condos can be placed in the nearest parking space.\nBring large bags or boxes to pack smaller items.\nChange all locks and secure the location immediately upon the competition of the eviction.\nVehicles can be removed by a wrecker service of your choosing and expense.\nOnce the deputy has completed the eviction, evicted items are considered abandoned, per Georgia Law (O.C.G.A. 44-7-55).\nOther cautions for landlords seeking to evict in Georgia come from a handbook written by the state's Department of Community Affairs in 2012 and include these tips:\nA landlord must be cautious in declaring rental property abandoned and taking possession.\nIf a landlord mistakenly declares the\nunit to be abandoned and removes the tenant's property, the landlord may be held liable for the\nitems the tenant lost and for a wrongful eviction.\nA landlord should not consider property abandoned while rent on the unit is paid.\nThe landlord should also determine if the tenant is still paying to have utilities furnished to the unit.\nThe safest course of action is for the landlord to wait until rent is past due and file a dispossessory affidavit and obtain a court order for possession of the property.\nIf the landlord does remove the tenant's property without a court order, it is a good idea for the landlord to take pictures of the property disposed of in case the tenant raises a claim against the landlord.\nTo access Georgia Legal Aid's Landlord Tenant Handbook, click here. For a free sample eviction notice for Georgia, click here. For the AJC's \"Atlanta Landlord Guide\" and other real estate tools, click here.\n[Read more: Homeowner attacked while evicting 4 tenants]\nRenter rights in Georgia and how to stop an eviction\nAnd if you're on the flip side of the coin? Georgia groups may be able to help tenants facing eviction problems, especially those who are low-income, seniors or may be facing homelessness. To find a legal aid group that might work with you or a private attorney, click this link (takes some time to load, see end of presentation).\nYou can also take steps to avoid placing yourself in an eviction situation the next go 'round:\nRead the fine print. According to HUD's online resources for Georgia tenants, the most important protection for leaseholders is a careful reading of the lease at the outset of the arrangement. That way, you'll know your responsibilities under the lease and won't be blindsided by an obligation you didn't meet giving your landlord grounds for starting the eviction process.\nStay within your budget. To set yourself up in a healthy rental situation where you'll most likely be able to pay your landlord each month, begin your rental property search by using an online rent affordability calculator. This will help calculate how much rent you can reasonably afford based on your monthly net income and your monthly debts. Zillow offers a rent affordability calculator that's localized for Atlanta.\nSearch for the best rental options in your budget range. Research your rental options, including expense, neighborhood and commute and school details, on a reputable rental home finder like the one offered by AJC.com.\nProtect your rent money with insurance. Avoid the kind of financial stress that can leave eviction as your only option with the purchase of renters insurance, which might run about $15 per month in the Atlanta metro area. It will cover personal property that is stolen, damaged or destroyed, says consumer expert Clark Howard, founder of Atlanta's Consumer Action Center. Also a consumer reporter on Atlanta's WSB-TV, Howard recommends a policy that includes relocation assistance and replacement value coverage, so you'll receive one lump sum payment for starting over in lieu of haggling over the value of, say, your aging television.","url":"https://www.ajc.com/lifestyles/home--garden/how-evict-someone-georgia/T93zTyRavYEfHGbQhBu8nN/"}
