{"authors":["Ashley Mateo"],"date_download":"2018-10-31 01:39:27","date_modify":"2018-10-31 01:39:27","date_publish":"2018-08-30 19:43:10","description":"You tossed the bouquet, you maintained your champagne buzz for two weeks on the Italian coast, and now the honeymoon is officially over. Except... you still have to thank everyone who spent their time and money on you and your now lawfully wedded…","filename":"data/vaneerConsumption/HowToWriteGoodThankYouNotesForYourWeddingGiftsSoYouCanFinallyBeDone.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/46fff4d3-958c-45bd-aa07-624cc668114d-stocksy_txp8739fffc414200_small_845195.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-to-write-good-thank-you-notes-for-your-wedding-gifts-so-you-can-finally-be-done-10228045_1540949967.html","title":"How To Write Good Thank You Notes For Your Wedding Gifts, So You Can Finally Be Done","title_page":"How To Write Good Thank You Notes For Your Wedding Gifts, So You Can Finally Be Done","title_rss":"NULL","source_domain":"bustle.com","text":"You tossed the bouquet, you maintained your champagne buzz for two weeks on the Italian coast, and now the honeymoon is officially over. Except... you still have to thank everyone who spent their time and money on you and your now lawfully wedded partner. Yes, it’s tedious AF. No, there’s no way out of it. “Sending thank you notes is a tradition you don't see happen as much today,” Lizzie Post, the great-great-granddaughter of etiquette expert Emily Post, co-president of the Emily Post Institute, and co-host of the Awesome Etiquette podcast, tells Bustle. “Taking the time to send them is worth the effort in how it will make your friends and family feel.”\nAnd if you’re going to take that time, why not write notes that actually communicate your gratitude (without taking too much time to write)?? “The thank you note is the last memory someone is going to have to close out your wedding celebration,” says Diane Gottsman, a national etiquette expert, author of Modern Etiquette for a Better Life, and founder of The Protocol School of Texas. “People always remember the last thing, so if you send a card that doesn’t seem genuine or if you don’t send a card, that’s going to stick with them.” The last thing you want to do is leave someone you care enough about to invite to your wedding with a sour taste in their mouth, so follow these five rules for crafting a thank you note that doesn’t suck.\n1 Start ASAP Lum3n That whole “you have a year to send thank yous after the wedding” rule? “That’s so outdated and inappropriate,” says Gottsman. We live in a fast-paced world, and waiting up to a year to thank someone — especially if you’re going to socialize with them during that time — isn’t a good look. “These days, we recommend that you send a thank you within three months of receiving a gift,” says Post. And since many guests will order off your registry and have gifts shipped directly to your house even before the wedding, you can get started on those thank yous immediately, says Post (it’ll make it easier to deal with the rest post-wedding).\n2 Hand-Write Your Thank Yous Lauren Naefe Verbal and digital thank yous won’t do for engagement parties, bridal showers, and weddings; unfortunately, you need to sit down and hand-write all those cards “If someone put the effort into coming to your wedding shower, going to buy your gift, taking time out of their Saturday when they could've been doing something else, you can take the time to sit down and write a note,” says Gottsman. It really makes a difference, says Post. “It just feels more personal and heartfelt to open a card and see someone’s handwriting,” she says.\n3 Keep It Simple Milles Studio Your note doesn’t have to be long — about the length of an index card is fine — and it doesn’t have to be complicated. “A lot of people stare at the blank note and get so worried about what the right thing to say is,” says Post. “Keep your focus on the ‘thank you.’” Post recommends starting with a nice greeting (you can refer to the wedding celebration itself as your opener, for example: “It was so wonderful to have you there to celebrate with us on [wedding date]. We can’t believe it’s over!”), address the gift, then close by saying you hope to see them and you wish them well. That’s it!\n4 Be Personal & Specific Helene Cyr Writing a generic “thank you for your gift” isn’t going to cut it here. “You want to mention what they got you specifically so that a) they know you got the right gift and b) your thank you doesn’t feel generic,” says Gottsman. But if they gave you money or donated to a honeymoon fund, you don’t have to call out the amount. “Just thank them for the generous gift and give them a hint as to what you might use that money for, whether it’s a spa treatment on the honeymoon or a new piece of furniture for your house,” Post adds. If you hate the gift? “Just make sure to point how thoughtful it was for them to think of you and come to the wedding,” says Gottsman. “You don’t have to be brutally honest.”\n5 Thank Them For Their Time, Too Carolyn Lagattuta Weddings are not cheap, not even for guests. In fact, Americans spend an average of $628 to attend just one wedding, according to a report by Bankrate.com. That’s why it’s important to acknowledge not just the gift a guest gave you, but the fact that it likely cost them a fair amount of time and money to be with you on your wedding day. “You want to let them know that their life is busy, and that they took time out of it for you,” says Gottsman. “A simple. ‘It meant a lot to have you share this day with me’ goes a long way.” And there will be some people who don’t give gifts. You should still thank them, says Post. “You can always thank them for coming to the wedding or just for their support of you and your partner,” she says.\n6 Pay Attention To Details Boris Jovanovic This should be a no-brainer, but the digital world has made us all lazy (thanks, spell check). For starters, make sure you spell their name right. “My name is Diane. If somebody sends me an envelope that says ‘Diana’ and I just spent $100 on their wedding gift, it's going to be offensive,” says Gottsman. And don’t try to outsource any writing. “Sure, you can get people to help you with pretty much any task these days, but I think a thank you note needs to be heartfelt—even if it takes a little bit longer.” Computer-generated labels and sending from your office mailroom are also no-gos; it just comes off as so impersonal.","url":"https://www.bustle.com/p/how-to-write-good-thank-you-notes-for-your-wedding-gifts-so-you-can-finally-be-done-10228045"}
