{"authors":["Danielle Burgos"],"date_download":"2018-10-31 01:47:00","date_modify":"2018-10-31 01:47:00","date_publish":"2018-09-06 15:02:30","description":"With five full features and more on the way, horror franchise The Conjuring is hoping to achieve for demonic dolls and creeping horrors what Marvel and DC have done for caped crusaders — instead of the endlessly interchangeable sequels (and victims)…","filename":"data/vaneerConsumption/HowToStreamTheConjuring2IfYouNeedARefresherBeforeTheNun.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/4/dbce7693-28e8-4f54-9c61-672355458749-screen-shot-2018-09-04-at-55355-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-to-stream-the-conjuring-2-if-you-need-a-refresher-before-the-nun-11497576_1540950420.html","title":"How To Stream 'The Conjuring 2' If You Need A Refresher Before 'The Nun'","title_page":"How To Stream 'The Conjuring 2' If You Need A Refresher Before 'The Nun'","title_rss":"NULL","source_domain":"bustle.com","text":"With five full features and more on the way, horror franchise The Conjuring is hoping to achieve for demonic dolls and creeping horrors what Marvel and DC have done for caped crusaders — instead of the endlessly interchangeable sequels (and victims) of '80s slasher films, director/producer James Wan and company hope to build up an entire cinematic universe of interconnected terror, exploring and deepening characters' stories. The latest outing is The Nun, exploring the origins of the terrifying entity that's haunted psychic investigators the Warrens since The Conjuring 2. And in case you're in the mood for a refresher, here is how to stream The Conjuring 2 before you see The Nun to prepare yourselves for the Conjuring universe's latest.\nTo understand the entire series, it's best to start at the beginning. The Conjuring, the film that started it all, is currently available to stream on Netflix. The film introduces audiences to Ed and Lorraine Warren, a married couple who work together as paranormal investigators and demonologists, as they take on the haunting of a Rhode Island farmhouse by a malevolent witch spirit. It isn't their first case, as the couple are shown dealing with evil doll and Conjuring fan favorite Annabelle before moving on to the Perron family's problems, and certainly indicates it won't be their last, as their music box memento of exorcism begins playing on its own.\nEd and Lorraine Warren are real people whose extrasensory exploits inspired numerous films, including The Amityville Horror and its many sequels. Though Ed passed on in 2006, Lorraine still speaks regularly at conferences about her and her husband's encounters with the supernatural, and as director James Wan told i09, when filming the first movie featuring The Nun, The Conjuring 2, he explicitly based the frightening character on conversations he'd had with Lorraine.\nFilmSelect Trailer on YouTube\n\"From talking to [the real] Lorraine in passing, she mentioned a spectral entity that has haunted her in her house...Because it is a demonic vision that haunts her, that only attacks her, I wanted something that would attack her faith. Something that would threaten the safety of her husband. And so that was eventually how the idea of this very iconographic image of a holy icon cemented in my head.\"\nThe Nun was the last element of the film to come together; in the same interview Wan said he was \"saving\" creation of what became The Nun for reshoots, as he hoped to discover what the demon would look like through putting the movie itself together. The film offers the surprise twist that the spirit of an old man the Warrens thought was causing trouble was only a pawn of the demonic nun spirit, herself an iteration of the demon Valak. The film is currently available to rent or buy through any number of streaming services for your devotional-dread viewing, including Apple, Google Play, Amazon, Fandango Now, Vudu, and YouTube. (All available to rent or buy.)\nThe Nun/Valak's next appearance is chronologically her earliest — coming full-circle from the original Conjuring's depiction of the case's resolution, the tail end of Annabelle: Creation cuts to a Romanian monastery in 1952 — the demon nun slowly walking down a candle-lit aisle snuffing each one out as she passes.\nWarner Bros. Pictures on YouTube\nThat leads up to The Nun proper - the featurette below places the film's 1952 setting as the earliest in the entire Conjuring universe, and hints that the demon has plenty more in store than later terrorizing the Warrens. In the film, a young novitiate nun and priest with a dark past investigate another nun's suicide at the Romanian monastery, and confront an evil that threatens their very souls. While the plot (so far as we know) isn't directly connected to other Conjuring films save for The Nun, the movie has some deep off-screen interconnections binding them to the universe. Taissa Farmiga, no slouch in the scare scene with her American Horror Story appearances, is sister of The Conjuring and Conjuring 2 star Vera Farmiga (not that it helped her get the role; quite the opposite). And though he wasn't slated to direct, Wan picked up the camera to assist on The Nun's filming himself, making this latest installment another star in the Conjuring firmament.","url":"https://www.bustle.com/p/how-to-stream-the-conjuring-2-if-you-need-a-refresher-before-the-nun-11497576"}
