{"authors":[],"date_download":"2018-10-30 21:09:33","date_modify":"2018-10-30 21:09:33","date_publish":"2016-12-30 05:00:00","description":"A bowl game that once struggled for survival and long toiled in the lower tiers of college football&...","filename":"data/vaneerConsumption/HowthePeachBowlgrewuptobeaCollegeFootballPlayoffsemifinal.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/30/Images/newsEngin.17117711_PEACH-TROPHY.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_how-the-peac_05f43c7e440c72e93829966ef0c61b1d__1540933773.html","title":"How the Peach Bowl grew up to be a College Football Playoff semifinal","title_page":"How the Peach Bowl grew up to be a College Football Playoff semifinal","title_rss":"NULL","source_domain":"ajc.com","text":"A bowl game that once struggled for survival and long toiled in the lower tiers of college football’s postseason finally reaches the pinnacle Saturday.\nThe Chick-fil-A Peach Bowl will be played for the 49th time, and this season it is a more important game than the storied Rose Bowl or Sugar Bowl or Orange Bowl.\nAtlanta’s bowl game, now the nation’s ninth oldest, is a College Football Playoff semifinal for the first time, with the winner advancing to play for the national championship.\nThe game between No. 1 Alabama and No. 4 Washington is a far cry from those old Peach Bowls of the 1970s and 1980s that often featured middling teams, small crowds and lousy weather at Atlanta-Fulton County Stadium.\nThe bowl’s evolution can be best appreciated by those who have been involved with it for decades.\n“It has been an amazing journey to see it go from one of the smaller bowls to the top,” said Albert Tarica, a volunteer with the bowl since its second year in 1969 and still on its board of trustees.\n“It’s a vision fulfilled,” said Bob Coggin, a retired Delta Air Lines executive who has been affiliated with the bowl since 1986 and remains on its board.\n“One of the things I’m most proud of, out of all the things I’ve been involved in over the years, is the bowl and how it has evolved to where it is today,” said Glenn Cornell, a retired bank executive whose volunteer work with the bowl started in the mid-1970s.\nAs long-time supporters of the Peach Bowl celebrate its new stature, they recall how close it came on more than one occasion to going out of business.\n“Oh, sure, there were a lot of times,” said Tarica, a certified public accountant. “We had a lot of things we had to deal with — bad weather, lack of funds and just sort of a negative perception in Atlanta of the bowl, the perception that it wasn’t a quality bowl. You would go from year to year and just hope we made it to the next year.”\nThe bowl was started by the Lion’s Club of Georgia in 1968, with the first three games played at Georgia Tech. It moved to Atlanta-Fulton County Stadium in 1971, remaining there until the Georgia Dome opened in 1992.\nBowl veterans still shudder at the memory of the cold, wet, miserable weather that often marred the event before it moved indoors at the Dome.\n“I think the bowl’s first title sponsor was ‘Weather-Plagued,’ because every media report would refer to it was the weather-plagued Peach Bowl,” cracked Gary Stokan, who started serving as a volunteer with the bowl in the 1980s and has been its president and CEO since 1998. “Before the Dome, we struggled to get teams because it was the ‘wild, wild West’ without conference alignments, and the Florida bowls would use weather against us.”\nThe Peach Bowl suffered more than its share of low points.\nFor a Georgia Tech-Purdue matchup in 1978, only 20,277 showed up despite the wife of then-Tech coach Pepper Rodgers, leading a ticket-sales drive.\nWhen local ticket sales in 1983 barely reached the minimum required to keep the bowl’s certification, an NCAA official warned “action will be taken” if Atlanta didn’t “make a better showing” the next year.\nAfter an Army-Illinois matchup in the 1985 game, CBS chose not to renew the bowl’s national TV contract, relegating its broadcasts to syndication.\nBy all accounts, a series of events transformed the bowl:\nIn 1986, it became an affiliate of the Metro Atlanta Chamber of Commerce, ensuring previously elusive support from the business community, starting with a $100,000 contribution from Delta. “The bowl was about to go out of business,” Coggin said. But after becoming part of the Chamber, “it got on pretty solid ground,” he said.\nIn 1992, two problems were addressed: The opening of the Georgia Dome solved the weather problem, and new contracts with the ACC and SEC to provide teams for each year’s game solved the ticket-sales problem by ensuring regionally appealing matchups.\nIn 1997, the bowl got its first — and only — title sponsor. That not only brought in more money; it also brought in Chick-fil-A’s marketing expertise. “Had to be one of the best things we could ever have done,” Tarica said.\nIn 2008, Stokan expanded the bowl’s reach by creating the season-opening Chick-fil-A Kickoff game. And in 2009, he convinced the National Football Foundation to relocate the College Football Hall of Fame to Atlanta. Both developments deepened the bowl’s relationships within the sport.\n“There always seemed to be that one event that kind of took us to that next step,” Tarica said.\nThe steps culminated in 2013, when the College Football Playoff was created and six bowls were chosen as rotating hosts of the semifinals: the Rose, Sugar, Orange, Cotton, Fiesta and Peach.\nTo join the playoff, the Peach had to give up its ACC-vs.-SEC formula.\n“Our feeling was if we’re going to reach where we wanted to be, we just had to be a part of this playoff group,” Tarica said.\nThe bowl had grown up.\n“Just to hear the Atlanta people talk about the bowl now in a much different tone than they used to talk about us,” Tarica said, “they really believe we’re one of the top bowls now.”\nThis is the playoff’s third season but the Peach’s first turn to host a semifinal.\n“I’m so excited,” said Patti Young, who has worked for the bowl since 1970 and now is executive assistant to Stokan. “I just wish Mr. Crumbley was here to see this.”\nGeorge Crumbley was the driving force behind starting the bowl and served as its executive director until 1985. He died in 2009. The bowl’s championship trophy bears his name.\nYoung went to work for the bowl at age 19, thinking it would be a short-term gig.\n“Every month, Mr. Crumbley would say, ‘Can you stay one more month?’” she recalled. “I wound up never leaving.\n“I just love it. I love our volunteers. I love the people I work with. It’s my bowl family.”\nIn discussing reasons for the bowl’s survival in the early years and success in recent years, long-time board members often cite Young’s contributions.\n“She and George Crumbley and a few people kept it going,” Cornell said. “A lot of credit for being where we are today goes back to people who were there in the early stages, who worked so hard and stood out there in that weather.”\nSaturday’s game will be the bowl’s 25th — and last — in the soon-to-be-demolished Georgia Dome.\n“I’m just going to be real misty-eyed at the last game there,” Young said.\nAtlanta’s place in the college football postseason will get even loftier next season, when the Dome’s successor, Mercedes-Benz Stadium, hosts the CFP’s national championship game. The national title game, unlike the semifinals, is staged outside the bowl system, but having the game here will be another reflection of the Peach’s influence.\n“If you step back and look at it in some sort of context, it’s pretty dramatic the impact the bowl has had on making Atlanta what it is from a sports standpoint,” Cornell said.\nA remark Stokan made to volunteers just before the playoff selection committee tabbed Washington for this season’s game spoke volumes.\n“Gary said, ‘You know, if Washington doesn’t make it to our game, their consolation is the Rose Bowl,’” Tarica recalled. “And I thought that pretty much summed up where we are and where we’ve come from.”","url":"https://www.ajc.com/sports/college/how-the-peach-bowl-grew-college-football-playoff-semifinal/TkLQMa3qarDIl6o2zj02VK/"}
