{"authors":[],"date_download":"2018-10-30 18:06:39","date_modify":"2018-10-30 18:06:39","date_publish":"2016-07-15 23:15:00","description":"How can you stand out? Here's some information that may help.","filename":"data/vaneerConsumption/HowtogetajobattheGeorgiaAquarium.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_employment_meet-th_9738960fd50dc10f814352973dbc8e1e__1540922799.html","title":"How to get a job at the Georgia Aquarium","title_page":"How to get a job at the Georgia Aquarium","title_rss":"NULL","source_domain":"ajc.com","text":"You'll meet people from all over the world. No one day will likely be the same. And some of your colleagues will be sharks. And whales. And sea lions - with really bad breath. But it won't matter. They're adorable. Let's face it, having a job at the Georgia Aquarium can provide an experience of a lifetime. Therefore, it's no surprise Corey Brown, human resources manager for the aquarium, sifts through at least 1,000 applications for many entry-level positions. How can you stand out in an applicant pool that size? Here's some information that may help:\n>>RELATED: Here's how to get a job at Six Flags\nHow to apply\nBrown said the Georgia Aquarium prefers receiving applications online, although you may also send your paperwork via fax. Keep in mind, online applications are electronically scanned for keywords using an applicant tracking system. Therefore, make sure your resume and/or cover letter includes some of the exact wording listed in the job description. Brown also suggests keeping your resume to a single page and tailoring your cover letter to the position.\n\"The cover letter is an introduction of who you are, what your experience and background are and what you can bring to the table to grow the position,\" he said. \"If you're applying for five different positions, then you should have five different cover letters.\"\nHow to nail the interview\nArrive 15 minutes early. Brown agrees 30 minutes is overkill and not a productive use of time. He also suggests bringing copies of your resume printed on professional resume paper, which can make your presentation more \"memorable.\" Dress the part. When discussing this, Brown even mentioned \"polished shoes.\"\nHe said you don't have to wear a suit, but it's absolutely imperative you arrive in clean, professional attire. In addition, walk in knowledgeable. You'll receive an email confirming your interview. That email will contain information about the aquarium, hyperlinks and what to expect from the interview process. Be familiar with everything in it. Speak up and be respectable of the job applicants around you. Brown said it's important to project your voice and enunciate your words, because that's an indication of how you'll work with aquarium guests. He also encourages applicants to interact with others during the interview process, because this is another indication of how you'll be on the job.\nWalk your talk. If you want to convey your passion for working with animals, you don't necessarily need a zoology degree, Brown said. But it does help to have volunteer experience or an internship supporting your commitment.\nHow to survive the unexpected\nIf something happens to keep you from arriving to the interview on time, he suggests showing up any way. Pull him aside and ask if you can reschedule, because that shows \"respect of everyone's time.\" There are no guarantees it will happen, but you could get another shot. Brown said he makes those decisions on a case-by-case basis. One way to sway him is to convey your interest and desire to work for the aquarium. This may help, too: Brown said it's much easier to reschedule an interview for an entry-level position, because those panel discussions are held on a weekly and biweekly basis.\nHow to follow up\nThe interview is over, but you still have one, final opportunity to set yourself apart. At this point, Brown suggests mailing a handwritten thank you note.\n\"That demonstrates they have taken the time to handcraft their words and are thankful for the interview,\" he said.\nCalling will not help your case, but sending an email might. If you haven't heard anything in a reasonable amount of time, email human resources reaffirming your interest and availability, Brown said. Make certain to ask for his email address in your interview.","url":"https://www.ajc.com/business/employment/meet-this-requirement-get-job-the-georgia-aquarium/OSqi9TqBh085pxpCp7YaAN/"}
