{"authors":["Georgia Diebelius For Mailonline"],"date_download":"2018-10-22 23:51:33","date_modify":"2018-10-22 23:51:33","date_publish":"2016-01-28 13:13:00","description":"From £400 fines to court appearances, this guide reveals the punishments meted out if unusual driving laws in countries including Britain, Finland and even Japan, are broken.","filename":"data/vaneerConsumption/HowtosteerclearoftroublewhileontheroadabroadInfographicrevealsthemostunusualdrivinglawsaroundtheworldincludingfinesfordirtycarsandlashesforwomenbehindthewheel.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A9013B00000578-0-image-a-19_1453977292075.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3420589_How-steer-clear-trouble-road-abroad-Infographic-reveals-unusual-driving-laws-world-including-fines-dirty-cars-lashes-women-wheel_1540252293.html","title":"How to steer clear of trouble while on the road abroad: Infographic reveals the most unusual driving laws around the world including fines for dirty cars and lashes for women behind the wheel","title_page":"How to steer clear of trouble while on the road abroad: Infographic reveals the most unusual driving laws around the world including fines for dirty cars and lashes for women behind the wheel | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Don’t drive in Saudi Arabia if you're a woman, ensure you wash your car in Russia and let the animals cross the road in South Africa.\nThese are just three of the unusual driving laws in play around the world in countries including Britain, Finland and even Japan, an infographic has revealed.\nSteering clear of trouble while driving abroad could prove tricky – and expensive – for travellers not familiar with the lesser-known laws, but this guide will help keep the police at bay.\nSplashing a pedestrian with a car is illegal in both the UK and Japan, however they have very different ways of dealing with drivers who've done this\nThe infographic, which was created by vehicle dealers Carwow, has compiled the laws from 25 countries.\nIn Russia, you will be issued a $38 (£26) fine on the spot if you drive a dirty car, and in Spain, a $225 (£157) charge if you're behind the wheel wearing flip-flops, high-heels, backless shoes or even if you're barefooted.\nSplashing a pedestrian with your car is illegal in both the UK and Japan, however they have very different ways of dealing with the driver.\nIn Japan, those who break this driving law will be fined $60 (£41) – and in the UK, the driver will be summoned to appear in court.\nAlso in the UK, the law states it is illegal to urinate in public unless you're by the rear wheel of your car and touching it. If you're not you're likely to be hit with a public indecency charge.\nIn Finland, a driver who has an accident involving a large animal and does not report it will be issued a fine based on their income\nSingapore's law state drivers must keep at least 50 metres away from pedestrians at all times, or face a fixed penalty charge.\nIn Finland, a driver who has an accident involving a large animal and does not report it will be issued a fine based on their income - meaning charges could be anything from tens to hundreds of pounds - and in South Africa, drivers must let any bovine animal, horse or ostrich cross the road, or face a $600 (£418) charge.\nOne of the most shocking laws is in Saudi Arabia, which states that women can own cars but not drive them - and if they do, they will face a punishment of up to ten lashes.\nClinton, Oklahoma, states that anyone who molests a car will be arrested and criminally charged, and in Manila, the number of days a week drivers are allowed behind the wheel is limited. And this figure is decided based on the last four digits of their licence plates.\nAnd if they do decide to drive, they can expect to receive a fine.","url":"https://www.dailymail.co.uk/travel/travel_news/article-3420589/How-steer-clear-trouble-road-abroad-Infographic-reveals-unusual-driving-laws-world-including-fines-dirty-cars-lashes-women-wheel.html"}
