{"authors":["Martha Sorren"],"date_download":"2018-10-30 22:46:14","date_modify":"2018-10-30 22:46:14","date_publish":"2014-08-14 19:29:03","description":"Much like Kim Kardashian's actual world is probably powered by Instagram selfies, it turns out Kim Kardashian's iPhone game is powered by lightning bolts of energy. Good luck trying to complete a photo shoot or talk to a famous photographer without…","filename":"data/vaneerConsumption/HowtoGetFullEnergyintheKimKardashianiPhoneGameSoYouCanFuelYourAddiction.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e52e5449-831f-43b2-b6c8-3a8d74469047.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35811-how-to-get-full-energy-in-the-kim-kardashian-iphone-game-so-you-can-fuel-your_1540939574.html","title":"How to Get Full Energy in the Kim Kardashian iPhone Game So You Can Fuel Your Addiction","title_page":"How to Get Full Energy in the Kim Kardashian iPhone Game So You Can Fuel Your Addiction","title_rss":"NULL","source_domain":"bustle.com","text":"Much like Kim Kardashian's actual world is probably powered by Instagram selfies, it turns out Kim Kardashian's iPhone game is powered by lightning bolts of energy. Good luck trying to complete a photo shoot or talk to a famous photographer without dropping a ton of the blue bolts. Unfortunately, for as necessary as energy is, it's pretty hard to earn. You get one bolt per five real minutes of play time which can feel agonizingly slow when the minutes on your appearance are running out and you need to finish with five stars.\nLife in Kim's game is infinitely better when you're at full energy, which is partially why I enjoy waking up these days so much more than I did before the game: my energy bar is at its max and I'm ready to take on the world. Having full energy can literally make your one-hour photo shoot take mere minutes to complete. The whole world is your oyster full of lightning bolt pearls.\nBut what even constitutes full energy? First it depends on what your maximum energy is which varies based on which level you're on. You start the game out with 15 energy bolts being your max and it increases one bolt per level. Right now I'm on level 20, which gives you a maximum of 34 lightning bolts. So how much playing time does it take to get to maximum energy?\nIF YOU WAIT IT OUT\nIf you take into account that each bolt takes five minutes to earn, that means at level one it takes an hour and 15 minutes to go from empty to fully charged. By the time you hit level 20 it takes two hours and 50 minutes to completely recharge.\nIF YOU TRAVEL THE GLOBE\nBut waiting it out isn't the only way go from zero to 100 percent. If you travel to each of the game's locations clicking on the objects (pigeons, fire hydrants, bushes) you can rack up energy even faster. It takes about five minutes to visit all of the game's hidden energy locations and you can earn anywhere from 13-17 each time. That means it takes about two to three trips around the globe to completely charge your energy, or 10-15 minutes.\nIF YOU DOUBLE TAP\nDon't forget to individually click all the lightning bolts, dollars, and people points that the pigeons and bushes spit out. Every time you click on a reward it drops the time it takes your energy to recharge by five seconds. It may not seem like a lot, but it could add up to an extra lightning bolt or two during your trip.\nIF YOU BUY IT\nIt will only take a few seconds, but then you have to consider how many real life hours it took to earn the money you just spent on digital lightning bolts. You probably don't want to be that person.\nPRO TIP: DON'T CLICK ON ANYTHING ONCE YOU'VE RECHARGED\nYour energy does have a maximum point so even if you find an energy bolt behind, like, a Kardash mannequin it won't get added to your energy bar. Wait to click on things until your energy drops below 100 percent so it actually counts.\nImages: Kim Kardashian: Hollywood; likecool; gifawesomeness, gifmethat/Tumblr","url":"https://www.bustle.com/articles/35811-how-to-get-full-energy-in-the-kim-kardashian-iphone-game-so-you-can-fuel-your"}
