{"authors":[],"date_download":"2018-10-30 14:27:20","date_modify":"2018-10-30 14:27:20","date_publish":"2017-04-27 23:59:00","description":"The combination of as many as 80,000 of attendees to the National Rifle Association’s annual c...","filename":"data/vaneerConsumption/HowtodealwithheavytrafficindowntownAtlantaFriday.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/26/Images/673546914.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_how-deal-with-he_95551bcf176463f53a31191cafb3076f__icmp=AJC_internallink_08042016_digesttease_0804_1540909640.html","title":"How to deal with heavy traffic in downtown Atlanta Friday","title_page":"Trump NRA speech, Hawks NBA playoffs could jam Atlanta traffic Friday ","title_rss":"NULL","source_domain":"ajc.com","text":"The combination of as many as 80,000 of attendees to the National Rifle Association’s annual convention and tens of thousands of Atlanta Hawks fans flocking to downtown Atlanta for a playoff game Friday create a recipe for heavy traffic.\nAlso on Friday, President Donald Trump is expected to address the National Rifle Association’s annual convention at the Georgia World Congress Center. (The exact time has not been announced). The president’s attendance likely will cause further headaches, as several roads likely will be closed at times to accommodate his motorcade.\nMeanwhile, Game 6 of the Hawks-Wizards Eastern Conference playoff series will be next door at Philips Arena at 7:30 p.m.\nComplicating the trip to downtown Atlanta is the recent collapse of a section of I-85 just north of downtown Atlanta, followed by a closure of a stretch of roadway while repairs are made.\nHere are four tips for heading downtown:\nArrive plenty early. Lower your stress levels by giving yourself plenty of time for travel and parking.\nPhilips will open 90 minutes before 7:30 p.m. tip off. Avoid the rush by going early, more than an hour early if possible to give yourself a cushion. And if you happen to arrive well before the game begins, you can get a bite to eat or walk around the arena before settling into your seats.\nTake MARTA. Friday is a good day to take public transportation or even consider taking it for the first time, particularly for those coming from north of the impacted area on I-85. Philips Arena is located directly outside the Dome/GWCC/Philips Arena/CNN Center stop on the Blue and Green lines. Just think: no bumper-to-bumper traffic, long lines for parking.\nThe Georgia World Congress Center is also near the Dome/GWCC/Philips Arena/CNN station on the blue and green rail line. If you are traveling from the red or gold line, such as from the airport, transfer at Five Points to the first westbound train and ride one stop to the Dome MARTA station. Take the Philips Arena exit out of the station and turn left at street level to enter the courtyard that is in front of the Georgia Dome. Keep right around Philips Arena to reach the Georgia World Congress Center. MARTA’s Park and Ride locations can be found at www.itsmarta.com which also has up-to-date information on schedules, fares, and more.\nKent Bazemore #24 of the Atlanta Hawks and Bradley Beal #3 of the Washington Wizards go after a loose ball in the first half in Game Five of the Eastern Conference Quarterfinals during the 2017 NBA Playoffs at at Verizon Center on April 26, 2017 in Washington, DC. Photo by (Rob Carr/Getty Images) (Rob Carr/Getty Images)\nUse WAZE. If you do plan to drive into the city, consider using the WAZE navigation app. (The GWCCA traffic management team, along with Georgia Department of Transportation work with Waze to update road closures and better direct travelers).\nTake UBER. The Atlanta Hawks, Uber, and Gentleman Jack, have joined together to create a co-branded pick-up area for fans at games and other events at Philips Arena. The designated area will serve as a convenient meeting point for Uber riders to easily find their drivers when using the popular ride sharing app.\nThe Uber/Gentleman Jack Zone is located near the arena’s lower level parking, across from the Philips Lot in the area known as “The Gulch”. It can be accessed by exiting the doors nearest portal 12 and crossing the CNN Deck walkway and going down the stairwell. Alternately, it may be reached by taking the elevators in the CNN Deck at Centennial Park Drive down to the lower level.","url":"https://www.ajc.com/lifestyles/how-deal-with-heavy-traffic-downtown-atlanta-friday/Ew0GDWKbB7YytAuW6Ey6lK/?icmp=AJC_internallink_08042016_digesttease_0804"}
