{"authors":["Emily Dixon"],"date_download":"2018-10-31 01:48:57","date_modify":"2018-10-31 01:48:57","date_publish":"2018-09-06 14:51:45","description":"For those of you still in denial, it's time to hear a harsh truth. Summer is over, and it's time to start preparing for the winter — specifically, it's time to think about getting the flu jab. As the NHS explains, the flu's an unpleasant illness on…","filename":"data/vaneerConsumption/HowToGetTheFluJabInTheUKBecauseItsThatTimeOfYearAgain.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/932f01f7-ec9a-40b0-b46d-772e7efa70c9-stocksy_txp0c7adea8wb4200_small_280849.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-to-get-the-flu-jab-in-the-uk-because-its-that-time-of-year-again-11771394_1540950537.html","title":"How To Get The Flu Jab In The UK, Because It's That Time Of Year Again","title_page":"How To Get The Flu Jab In The UK, Because It's That Time Of Year Again","title_rss":"NULL","source_domain":"bustle.com","text":"For those of you still in denial, it's time to hear a harsh truth. Summer is over, and it's time to start preparing for the winter — specifically, it's time to think about getting the flu jab. As the NHS explains, the flu's an unpleasant illness on its own, but it can also lead to more alarming complications including pneumonia. And with a vaccine readily available, it's worth taking steps to protect yourself. If you're particularly susceptible to the flu or its complications, it might even be free. Here's how to get the flu jab in the UK, and what you can expect from it.\nThe flu's made serious headlines over the past year — most recently, it was identified as the illness that afflicted a host of passengers on an Emirates flight from Dubai to New York, according to CNN. Last winter, the UK death toll from the flu almost tripled the total from the year before, as the Guardian reports, with 155 dying in the 2017-2018 outbreak compared to 53 the previous year. The NHS recommends getting vaccinated between the beginning of October and the end of November — so it's something to start considering right about now.\nStill, there's no need to panic if you contract the flu — as the NHS explains, \"if you are otherwise healthy it will usually clear up on its own within a week.\" But certain groups of people are more at risk to serious complications; if you belong to one of them, the NHS will vaccinate you free of charge. And that doesn't just apply to children and the elderly — according to the NHS, you're eligible for a free vaccination if you're pregnant, a carer, or a health and social care worker, or if you live with someone with a weakened immune system.\nSean Locke/Stocksy\nThose with certain long-term health conditions can also receive a free vaccine; that includes people with asthma and other chronic respiratory diseases, people with spleen issues; people with a chronic heart, liver, kidney, or neurological disease; those with weakened immune systems, whether the result of medication or illnesses like HIV and AIDS; and people with a BMI of 40 or above. The NHS website states, \"This list of conditions isn't definitive. It's always an issue of clinical judgement\" — so if you have a long-term health issue that you're worried might put you at risk, speak to your GP.\nNot eligible for a free flu jab? You can still get one at your doctors' surgery or pharmacy, the NHS says, though you will have to pay for the service. You can also book an appointment (online or in person) at certain Boots stores; it's typically £12.99, but you'll pay £11.69 if you book before Sept. 11, according to its website. Certain LloydsPharmacy stores also offer the service, and you don't need to book to receive it.\nThere are some people who shouldn't receive the vaccine — most significantly, those who've \"had a serious allergic reaction to the flu vaccine in the past,\" the NHS says. The vaccine might contain certain allergens like eggs, but there are alternatives available; if you have allergies, speak to your GP before getting the vaccination. Got a fever? Wait until it clears up before you get the jab.\nIlya/Stocksy\nSo what can you expect from your flu jab? If you're between 18 and 64, you'll probably receive the quadrivalent flu vaccine, according to the Vaccine Knowledge Project created by Oxford University. That means you'll be protected against the four strains of flu deemed most likely to circulate this winter. \"On average, flu vaccines prevent about half of all flu cases, but the exact level of protection varies from year to year,\" the project explains — after all, the flu is a variable and unpredictable virus.\nThere's a possibility you'll experience some mild side effects from the vaccination, the NHS notes, including muscle ache, a slight fever, or a sore arm where you've been injected. You won't catch flu from the jab, though — as the NHS explains, \"there are no active viruses in the vaccine.\" Basically, the majority of people don't have much to lose by getting vaccinated, and some will be at serious risk if they forego it. Considering the vaccine? Speak to a doctor or a pharmacist — and do so before winter sets in.","url":"https://www.bustle.com/p/how-to-get-the-flu-jab-in-the-uk-because-its-that-time-of-year-again-11771394"}
