{"authors":["Laken Howard"],"date_download":"2018-10-31 01:44:05","date_modify":"2018-10-31 01:44:05","date_publish":"2018-09-14 15:22:56","description":"At some point or another, you've probably heard the old saying \"the grass is greener on the other side\" — and it's pretty likely that you heard it used in the context of dating and relationships. But what does it mean if someone is suffering from…","filename":"data/vaneerConsumption/HowToOvercomeGrassIsGreenerSyndromeInDating.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/1e500e94-e317-4402-bb2d-2ff5893a4030-2t4a1047.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-to-overcome-grass-is-greener-syndrome-in-dating-11456124_1540950245.html","title":"How To Overcome \"Grass Is Greener\" Syndrome In Dating","title_page":"How To Overcome \"Grass Is Greener\" Syndrome In Dating","title_rss":"NULL","source_domain":"bustle.com","text":"At some point or another, you've probably heard the old saying \"the grass is greener on the other side\" — and it's pretty likely that you heard it used in the context of dating and relationships. But what does it mean if someone is suffering from grass is greener syndrome in dating? In short, it means that regardless of what's happening in your love life, you have a lingering, almost unshakable feeling that there's something better out there that's just waiting to be discovered.\n\"Grass is greener syndrome is quite simple and applies to much more than relationships,\" Joshua Klapow, PhD, clinical psychologist and host of The Kurre and Klapow Show, tells Bustle. \"It’s simply the feeling that what you have, where you are at, the situation you are experiencing is not as good as it might be someplace else or in some other situation. It is not necessarily a feeling of remorse but a feeling of uncertainty. A feeling that you haven’t reached what you see as the maximum benefit from your current situation. Whether it is a relationship, a job, a purchase — it is the feeling that a different choice might be better.\"\nWhen it's boiled down to its bare bones, grass is greener syndrome is really just an unfortunate byproduct of self-doubt. And in a time when everyone's lives are on full display on social media, it's even easier to fall into the trap of comparing yourself — and your relationship — to others. All that being, said, it's understandable that grass is greener syndrome is fairly common, in both dating, relationships, and marriages.\n\"We all question our choices — that is human — but questioning them over and over, and thinking about what else we could have frequently is a sign that our current situation is not right.\"\n\"The mindset is extremely common but not always lasting,\" Klapow says. \"In both dating and marriage there almost always comes at least one time (often multiple times over the years) where we think even for a minute that things could be better with someone else. It’s normal, and if it is a fleeting thought there is nothing to be alarmed over. It’s when we start thinking about it frequently, imagining often how things might be that we should be concerned. We all question our choices — that is human — but questioning them over and over, and thinking about what else we could have frequently is a sign that our current situation is not right.\"\nIf you're afraid that the grass is greener mindset has started to take its toll on you, here's everything you need to know about where it comes from, and how to overcome it in your own relationship.\nWhat Causes Grass Is Greener Syndrome?\nWhile it's common to experience doubts in a relationship from time to time, not every couple deals with the intense \"what if\" feelings that the grass is greener syndrome can bring on. But before you can diagnose yourself with grass is greener syndrome, it's crucial to understand where it comes from. According to Klapow, the notion of \"perceived choice\" is one of the biggest culprits behind the grass is greener mentality.\n\"[Perceived choice is] the belief that it is possible for you to have someone else, to be in a different situation, to experience different circumstances are all drivers of the grass is greener syndrome,\" Klapow says. \"Social media can fuel this — by presenting not realistic, but idealistic views of people, settings, and situations. The perfect life, the perfect picture, the great vacation, the endearing relationship all portrayed through a lens that is often not accurate.\"\nWhen you're constantly bombarded with images of other couples who seem — on the surface — to be totally smitten and leading picture-perfect lives, it can be tempting to compare your own relationship to those idealistic standards, all while ignoring the contextual realities of your relationship. But often there's something bigger lingering under the surface that exacerbates these feelings: fear.\n\"Another driver of the grass is greener [syndrome] is fear,\" Klapow says. \"Fear that the situation you are in — the relationship you are in — has conflict, has problems, might not be successful, and may put you in [a] vulnerable state. When we fear that our current relationship is less than ideal, often we don’t focus on the relationship itself, but focus on something emotionally easier — that is — what else could I have.\"\nSeeing images of \"perfect\" couples on social media can be a catalyst for reflecting on your own relationship and questioning how well things are really going — which can be productive, if you're willing to communicate with your partner about any potential concerns. More often, though, seeing these idealistic portrayals of relationships can skew our perceptions of what's actually *good* in our own relationships. It's easy to forget that smiling for a picture doesn't mean that these other couples don't argue, have awkward moments, or hurt each other; they simply don't put those moments on display.\n\"It’s important to remind yourself that while those other theoretical options could be better, they also could be worse, especially since you only see the surface in most cases,\" Jonathan Bennett, dating and relationship expert at DoubleTrust Dating, tells Bustle. \"Work on appreciating your partner and your relationship.\"\nWhat Grass Is Greener Syndrome Really Looks Like\nAshley Batz/Bustle\nIn any relationship, it's healthy and normal to want to grow and evolve with your partner instead of getting complacent and letting your relationship grow stagnant. But there's a huge difference between seeking to improve your relationship as a team, and having one-sided, unspoken doubts that things could hypothetically be better — which is often one of the ways grass is greener syndrome manifests.\n\"Relationships are work; no matter how awesome,\" Noelle Cordeaux, sexologist and co-founder of JRNI, tells Bustle. \"It is 100 percent natural to look at others or other people's relationships and pine for elements or characteristics that you wish you had in your own. It is also important to realize that there is no such thing as a perfect partner or a perfect relationship and what you perceive in others is probably just a projection of what you want for yourself.\"\nIt's OK to see a picture on your feed and file it under ~couple goals AF~, but when you're scared that your relationship isn't \"good enough\" for the long haul and you seek to replace your current situation rather than improve it, that's when grass is greener syndrome has the opportunity to really do some damage. You might start to have omnipresent doubts about the future of your relationship, and constantly go back and forth on whether or not breaking up is the right choice for you.\n\"You can tell you have [grass is greener syndrome] when you ruminate about your decision [and] you can't stop second-guessing yourself,\" LeslieBeth Wish, noted author, licensed psychotherapist, and founder of Love Victory, tells Bustle. \"You have this buzzing feeling of doubt, but you don't know whether another decision is a wise or unwise thing to do. As a result, you feel as though you are forever trapped in an ongoing pinball machine. As long as you allow yourself to stay trapped, you can avoid making what you fear is yet another unwise decision. What you often forget to take into account is that not making a change is also a decision.\"\nThe Consequences Of Having A 'Grass Is Greener' Mentality\nIf have concerns about your relationship, it's absolutely normal: so long as you voice those to your partner, you have the potential to work through them together and strengthen your relationship in the process. But if you're of the mindset that your relationship isn't cutting it and that something out there *must* be better, that can have serious consequences for your current relationship... even if you're not actively thinking about breaking up.\n\"The consequences include, betrayal, cheating, disengagement from the relationship, [and] preoccupation with 'what might be' versus 'what I have now,'\" Klapow says. \"The problem with grass is greener syndrome is that it fundamentally takes you out of your current situation emotionally and psychologically. Every minute you are in the syndrome is a minute you are not engaged in your relationship. Over time, this can pull you away from your efforts in the relationship and in some cases trigger a leap to go see if the grass is greener.\"\nAs cliche as it sounds, it's true that the grass is greener where you water it. If you spend time 'watering' the grass of your relationship, you can work to improve and nurture your connection, and hopefully eventually assuage any doubts you might have had. On the other hand, if you let your doubts and fears cloud your perception of your relationship, you might disengage and create distance from your partner — which will only compound your concerns and make things more difficult.\n\"If you’re always looking for someone better or more perfect, you’ll never be happy in any present situation.\"\n\"The biggest consequence [of grass is greener syndrome] is unhappiness for the individual who suffers from [it],\" Bennett says. \"If you’re always looking for someone better or more perfect, you’ll never be happy in any present situation. Every person and all relationships have flaws. If you can’t appreciate a life with imperfections, you’ll never be happy.\"\nIf you're constantly seeking an undefinable version of \"better,\" it's likely that you'll end up unhappy no matter who you're with. But, particularly in a time when everyone is so connected online — we all have access to exes, potential partners, and even total strangers — it can be tempting to pull the plug on a relationship prematurely solely because you want to feel the rush of exploring something new (or old, in the case of an ex). You just have to ask yourself: is it worth throwing away what I have to take a gamble on something unknown?\nHow You Can Overcome Grass Is Greener Syndrome\nAshley Batz/Bustle\nSo what should you do if you want to shake the eternal feeling of anticipating the ~bigger and better~ in your relationships? Aside from unplugging from social media (or coming up with coping strategies so you don't unhealthily compare your relationship to the ones you see on your feeds), one way to combat those feelings is by making an active effort to be more present and available in your current relationship.\n\"The people, experiences, and energies that cross your path are there for a reason: trust that,\" Pax Tandon, positive psychology expert and author of Mindfulness Matters: A Guide To Mastering Your Life, tells Bustle. \"Honor your life's design, be present with your relationships, and... don't put pressure on them to be long term or 'forever,' or expect them to look or feel a certain way. Just trust. Otherwise, you get caught up in a cycle of comparison, wondering if what you have is good enough for 'forever,' when it is just about what it good for right now. That leads to anxiety and suffering. All experiences are meant to help you grow and evolve — no one knows how long that growth phase will last. Relax and let it flow.\"\nOf course, it's important to note that sometimes, feeling like the grass might be greener on the other side is a real red flag that your current relationship isn't the right one for you — and it's important to be honest with yourself about your relationship satisfaction and trust your gut instinct. But if you think your mindset is a result of something internal that you need to work on, practicing mindfulness can help you gain some clarity.\n\"A daily mindfulness practice can help you train your attention to stay put, so you aren't constantly seeking new stimulation, [but] rather finding peace and bliss being right where you are,\" Tandon says. \"Relationships are hard, and in a culture of dating apps and media messages, it's easy to want to run to a new option when your current one feels challenging. Hence, a wandering eye to where the grass is greener. Mindfulness lets you sit with discomfort, so you can work through it to grow, instead of the temptation to go.\"\nAt the end of the day, the most important thing to remember is that no relationship is perfect. It's normal for your mind to wander to the \"what ifs\" occasionally, but you shouldn't let hypothetical happiness stand in the way of the feelings and connections you've worked so hard to build in your current relationship. Instead of seeking to migrate to better pastures, first try watering the grass in your own fields — you might just be surprised how much better the grass looks when it's properly nourished.","url":"https://www.bustle.com/p/how-to-overcome-grass-is-greener-syndrome-in-dating-11456124"}
