{"authors":[],"date_download":"2018-10-30 14:32:52","date_modify":"2018-10-30 14:32:52","date_publish":"2015-06-19 00:00:00","description":null,"filename":"data/vaneerConsumption/Howtobecomeblackinthreeeasysteps.json","image_url":"https://www.americanthinker.com/images/bucket/2015-06/194807.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_06_how_to_become_black_in_three_easy_steps_comments_1540909972.html","title":"How to become black in three easy steps","title_page":"Blog: How to become black in three easy steps","title_rss":"NULL","source_domain":"americanthinker.com","text":"Rachel Dolezal is the blonde, green-eyed head of the Spokane NAACP chapter who claimed to be black. Unfortunately for her, her parents came forward to reveal that neither they nor she was, in fact, black. She also claimed that (1) a very dark-skinned black man was her father (he wasn't), (2) she was born in a teepee in Montana and grew up hunting with bow and arrow, (3) her mother beat her with something called a \"baboon whip\" because she was black, and (4) she received hate mail from a racist group, even though the mail she turned over to the police turns out never to have been mailed in the first place (oops!). Surprisingly, the liberal media is supporting her. After all, she is a liberal. This creates a tremendous opening: if a blonde, green-eyed woman can be black, anyone can be black! Given the advantages in jobs, schooling, and government contracts, the only surprising thing is that more people don't do it! That's... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/06/how_to_become_black_in_three_easy_steps_comments.html"}
If you're light-skinned, you're going to have to do something to make yourself look at least ambiguously black. Remember on The Cosby Show how one daughter was much lighter-skinned than the rest, and everyone was wondering what she was doing there? Well, at least she had the stereotypical curly hair. Look how Dolezal transformed herself: she started out looking almost like Hitler Youth material but quickly transformed into something more appropriate, akin to Sideshow Bob from The Simpsons. Unfortunately, some time later, Dolezal went a bit overboard with the look. Too much braiding and rope-coiling simply looks like a white lady's parody of a black woman. Step 2: Be liberal. That's easy enough. The reason why so many people are sticking up for Rachel Dolezal is because she's the head of a chapter of a far-left organization, the NAACP, the only organization I know who would be offended if outsiders called its members by its own name for them (colored people). To be liberal, you don't have to be involved with a black group per se; it can be an extremist environmental group, or a homosexual lobby group, or a criminal lobby group like the ACLU, or some wing of the Democratic Party, as long as it's far-left. Note that while being white and leftist can make you black, the opposite is also true: being conservative and black can make you white. Just ask Clarence Thomas, who has endured decades of racist commentary on his character and the \"authenticity\" of his \"blackness.\" Step 3: Act according to the worst stereotypes of blacks. If you're Hillary Clinton, perhaps the whitest individual on the planet, you need to take on an offensive black accent and talk of blacks' great love for fried chicken. If you're Bill Clinton, you need to be sexually promiscuous. Or watch this training video from the \"I speak Jive\" lady from Airplane! Don't worry about being called racist. If you're liberal (see Step 2), the liberal media will approvingly equate your reprehensible behavior with \"blackness,\" simultaneously giving you street credibility and defaming the entire black culture in one stroke. Exit question: if America gave the kinds of special preferences in jobs, education, and business to Swedish people that it gives to blacks, do you think you would see people suddenly declare themselves Scandinavian-American? This article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/06/how_to_become_black_in_three_easy_steps.html"}
