{"authors":["John Naish For The Daily Mail"],"date_download":"2018-10-22 20:34:18","date_modify":"2018-10-22 20:34:18","date_publish":"2016-01-28 01:50:29","description":"Before World War II, Stork was advertised to Britons as The Energy Giver to dispel thoughts that margarine was unhealthy. But now the knives are out for marge.","filename":"data/vaneerConsumption/Howthegreatbutterrevivaliskillingmargarine.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A4522B00000578-0-image-a-9_1453945804271.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3420251_How-great-butter-revival-killing-margarine-turnaround-expert-health-advice-means-popular-spread-soon-toast_1540240458.html","title":"How the great butter revival is killing margarine","title_page":"How the great butter revival is killing margarine | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"As a 12-year-old at a family meal, I asked my uncle quizzically why he chose to eat margarine. From another part of the table came the answer: ‘He doesn’t want to die like your father.’\nMy dad had suffered a sudden, fatal heart attack in the late Sixties, aged only 52. That kitchen-table comment gave me something to blame. From then on, I was utterly convinced that butter equalled death.\nFrom the Seventies onwards, this was a popular belief. That yellow block of dairy was the dietary equivalent of a grenade with the pin out. We imagined the cloying fat it contained would seep into our veins until it stopped your heart like a clogged drain.\nBut now butter is back in favour, and margarine is out of favour instead.\nSpreading the word: A vintage advert for Stork - but sales of margarine have now slumped\nLast week, the food-giant Unilever announced corporate changes that have led industry-watchers to speculate it is pulling out of producing margarine due to plummeting sales.\nUnilever’s success is founded partly on margarine, which for decades was hailed as the heart-friendly alternative to butter.\nThe company was born in 1929 through the merger of British soapmaker Lever Brothers and the Dutch firm Margarine Unie, which began making the plant-derived spread in 1872.\nToday, the company is the world’s largest margarine-maker, with brands such as Flora and the doughty Stork, which was launched in 1920.\nBefore World War II, Stork was advertised as The Energy Giver to dispel thoughts that margarine was unhealthy. Originally made from beef fat and milk, most margarines are now made from a variety of vegetable oils, such as sunflower.\nBut now the knives are out for marge. Overall UK sales are falling by more than 7 per cent a year, according to the industry publication The Grocer.\nIn a financial report last week, Unilever admitted that it was not ‘able to stem the sustained market contraction in developed countries’.\nIn the past few years, a turnaround in expert health advice on dairy fats has transformed butter from fridge-shelf pariah to the golden boy of healthy spreads\nThe major problem for all margarine-makers is the dramatic rehabilitation of butter’s reputation.\nIn the past few years, a turnaround in expert health advice on dairy fats has transformed butter from fridge-shelf pariah to the golden boy of healthy spreads.\nWe increasingly understand how the whole anti-butter argument sits on shockingly shaky foundations.\nThis bad butter fallacy goes back to 1913, when a Russian researcher, Nikolaj Nikolajewitsch Anitschkow, fed large amounts of animal fats to rabbits and showed that their cholesterol levels rose dangerously.\nHe ignored the fact that rabbits do not naturally eat dairy. Their digestive systems can’t cope. Humans, meanwhile, are perfectly capable of digesting dairy.\nNevertheless, other scientists ran with the idea.\nIn 1953, Ancel Keys, an American physiologist, examined data from six different countries and claimed to have discovered a firm link between saturated fat intake and coronary heart disease.\nKeys’s research ignored clinical reports from European countries such as Spain and France, where the traditional diets are heavy in fats, but the rate of heart disease is low. He claimed that he could not find good data to include from these countries.\nHis study prompted a widespread fear of animal fats.\nBack in favour: The major problem for margarine is the dramatic rehabilitation of butter’s reputation. File image\nIn 1957, the American Heart Association began to target fat consumption as an enemy of cardiac health. Fat avoidance became U.S. policy in 1977 and Britain dutifully followed suit. Now, scientists are exposing the hollowness of this dietary diktat.\nFor example, a study in the British Medical Journal three years ago showed that middle-aged Australian men who had followed health advice and eaten margarine instead of butter actually had higher death rates.\nOne explanation for this is that the oils in their margarines were high in omega-6 fatty acids. These actually displace heart-healthy omega-3 fats from the body.\nMoreover, high levels of omega-6 fats in the body can cause inflammation, which may, in turn, cause cardiovascular disease.\nWe still have a way to go before Britain can officially be branded butter-crazy. The latest figures put us ninth in the European league for consumption\nAnd last year, a major review of research evidence in the BMJ journal Open Heart overturned 30 years of health advice telling us to avoid butter and full-fat milk.\nThe official advice — that we should cut our intake of saturated fats, such as butter, to only 10 per cent of our daily diet — ‘should not have been introduced’, experts said. Such revelations have prompted a renaissance for butter.\nAccording to market analyst Mintel, butter sales are growing by 4 per cent a year.\nIn 2015 in the UK, we consumed an estimated 150,000 tonnes of the spread, which seems like good news for Britain’s farmers.\nNew government figures show that monthly butter production was up by nearly 16 per cent last November compared with the previous year, at 2,000 tonnes.\nAnd while butter is receiving well-earned pats, the health news for margarine just keeps getting gloomier.\nLast year, for example, investigators warned how chemicals called emulsifiers — which are used to make margarine smooth — can disrupt the vital healthy balance of bacteria living in our guts.\nThis can inflame the intestine, which raises our risk of developing inflammatory bowel disease, according to a study in the journal Nature.\nWorse still, Georgia State University researchers have found the inflammatory disruption can also lead to people piling on dangerous levels of weight, raising their risk of heart disease and diabetes — the very illnesses we have spent decades trying to avoid by ditching butter for marge.\nAnalysts at Mintel say that butter is not only benefiting from health research, it is also booming thanks to low prices: the average cost of a 250g block of butter has fallen by 27 per cent between 2010 and 2015.\nWomen are leading the revolution. They are much more likely than men to be shifting back to butter, according to a study in the journal Public Health Nutrition.\nWhat’s more, we are fast turning into connoisseurs. Four in five of us say we can taste the difference between various brands, leading to a new phenomenon — designer butter.\nFamous chefs such as Stephen Harris have picked up on the craze. He churns his own butter at The Sportsman, near trendy Whitstable in Kent, and declares: ‘For me, bread is just a sideshow — it’s all about the butter.’\nArtisan butter companies are also appearing. For example, the Swedish dairy experts Patrik Johansson and Maria Hakansson are setting up a dairy on the Isle of Wight, selling their handmade organic products to top restaurants.\n‘There are more than 150 taste components in cultured butter,’ says Johansson.\n‘Most of them come from the buttermilk, or cultured cream, which we make ourselves.’\nAlthough the very thought of butter becoming the latest status ingredient (following foodstuffs such as quinoa and banana flour) is wearisome, it is true that butters are not all created equal.\nCrucially, the healthy omega-3 content of butter is reportedly higher when it is made with milk from cows that have been allowed to graze happily on rich pasture, rather than being stuffed with hay.\nIt’s why I have not only banished ‘heart-healthy’ marge brands from the fridge, but have become an assiduous buyer of grass-fed, unpasteurised Normandy butter.\nYes, it is twice the price of economy brands, but I hope that the bacterial strains it contains will help to keep a healthy balance in my gut — quite the opposite of what the emulsifiers in marge may have been doing for years.\nWe still have a way to go before Britain can officially be branded butter-crazy. The latest figures put us ninth in the European league for consumption. The French eat the most, at 7.9kg per head, with the Germans second, at 6.2kg.\nWe are thinly spread by comparison, eating 3.3kg each — a little less than the European Union average of 3.7kg.\nMeanwhile, the story for Stork is only getting grimmer. Figures from market analysts IRI show that while we bought £38.4 million worth in 2013, that had slumped to £32.2 million by 2015.\nLast year, in a bid to boost UK sales, Unilever even decided to launch a Stork margarine line containing its dairy nemesis — yes, butter.","url":"https://www.dailymail.co.uk/health/article-3420251/How-great-butter-revival-killing-margarine-turnaround-expert-health-advice-means-popular-spread-soon-toast.html"}
