{"authors":["Akin Oyedele"],"date_download":"2018-10-30 23:12:16","date_modify":"2018-10-30 23:12:16","date_publish":"2018-07-20 00:00:00","description":"Traders largely aren't moved by President Donald Trump's tweets on trade, except in one asset where prices have recently fallen to the lowest in nearly a decade.","filename":"data/vaneerConsumption/HowTrumpstweetsontradeaffectmarkets.json","image_url":"https://amp.businessinsider.com/images/5accfd4087826b32008b4ab3-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_how-trump-tweets-on-trade-affect-markets-2018-7_1540941136.html","title":"How Trump's tweets on trade affect markets","title_page":"    How Trump's tweets on trade affect markets - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Farm equipment provides a backdrop as U.S. President Donald Trump takes the stage to deliver remarks on agriculture Kirkwood Community College in Cedar Rapids, Iowa. Reuters/Jonathan Ernst\nPresident Donald Trump's tweets on trade don't mean much to traders except in the soybeans market, according to Goldman Sachs.\nEconomists at the firm looked into the link between Trump's tweets on trade and stock-market volatility, as measured by the CBOE Volatility Index, or the VIX. They found that traders largely shrugged off Trump's tweets containing the words \"trade\" or \"tariff,\" even as the US engaged in disputes with China, Canada, Mexico, and the European Union.\nUsing a regression analysis to test the relationship between Trump's trade-related tweets and various assets, while controlling for the dollar and the Economic Policy Uncertainty index, they found that soybeans was the only one significantly impacted by tweets.\nAfter the Trump administration imposed a 25% tariff on roughly $34 billion worth of Chinese goods, China retaliated with similar tariffs on American products including soybeans. Soybean futures for November delivery fell last week to $8.26 per bushel, the lowest in nearly a decade.\n\"The result is consistent with our commodity team's view that trade tensions should have a minor impact on commodity markets with the sole exception of soybeans, where it is not possible to completely reroute supplies should China levy tariffs on US soybeans,\" Goldman's James Weldon said in a note on Thursday. As the New York Times reported, China's farms are generally too underdeveloped to replace a shortfall in imports.\nChina is the world's largest importer of soybeans. Last year, it imported $12.4 billion worth of the legume from the US to feed its pigs, The Wall Street Journal reported. American soybeans help China lower the price of pork, a staple protein for households, and aid in the production of cooking oil.\nEven though China can turn to Brazil, another major producer and exporter of soybeans, it may still feel the pangs of fewer American soybeans.\nThat's why soybean traders respond when Trump tweets about trade policy.\n\"This is not to say that markets are not pricing trade risk or that trade tensions are not a concern,\" Weldon said. They're just not relying on Twitter to price the risk, he concluded.\nSee also:","url":"https://www.businessinsider.com/how-trump-tweets-on-trade-affect-markets-2018-7"}
