{"authors":[],"date_download":"2018-10-30 14:09:56","date_modify":"2018-10-30 14:09:56","date_publish":"2016-11-08 13:31:00","description":"As voters head to the polls, here's how to report voting problems in Georgia on Election Day","filename":"data/vaneerConsumption/HowtoreportvotingproblemsinGeorgiaonElectionDay.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/08/Images/newsEngin.16733549_102716-ELX-Early-Voting-HS01.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_b905e17e5e4050139a29e3d47456cd2c__1540908596.html","title":"How to report voting problems in Georgia on Election Day","title_page":"How to report voting problems in Georgia on Election Day","title_rss":"NULL","source_domain":"ajc.com","text":"This is it, Georgia — the 2016 presidential election is upon us. Polls are open from 7 a.m. through 7 p.m. today.\nWhat if I encounter a problem at my polling place?\nProblems may be reported to the Secretary of State Office. In metro Atlanta, call 404-656-2871 or 404-656-2881. Elsewhere in Georgia, call tollfree 1-877-725-9797. Georgia Secretary of State Brian Kemp, who said Monday morning that he was confident the election would go well after a record early voting period, has also encouraged voters to go online to report voter fraud or submit complaints via http://sos.ga.gov/index.php/elections/stop_voter_fraud.\nThe U.S. Justice Department, which is sending poll monitors to Fulton, Gwinnett and Hancock counties, is staffing its own toll-free hotline at 800-253-3931.\nAny voter in line by 7 p.m. is legally allowed to cast a ballot no matter how long the line may be.\nMORE: Report voting issues to the Atlanta Journal-Constitution\nHow to vote in Georgia\nYou can log onto the Secretary of State Office’s online “my voter page” website (www.mvp.sos.ga.gov/MVP/mvp.do) to find you polling location and to see a sample ballot.\nLocal elections office will post links and precinct locations on their local websites.\nInformation about local elections and your “My Voter Page” can also be found on the free “GA SOS” app for your smartphone via iTunes or Google Play for Android.\nAs long as you've registered to vote by Oct. 11, there aren't many reasons you shouldn't be allowed to cast a ballot. (Erica A. Hernandez/AJC)\nDos and don’ts for voting in Georgia\nDon’t forget to bring photo identification, which can include a Georgia driver’s license, even if it’s expired; a state-issued voter identification card; a valid U.S. passport; or a valid U.S. military photo ID.\nNo “ballot selfies” are allowed at the polls, so wait until you’re outside to snap a photo. It is illegal in Georgia to take pictures of a ballot or voting equipment, but the Secretary of State Office has said it has seen voters in previous elections post “ballot selfies” on social media — something that could get you in trouble with the law.","url":"https://www.ajc.com/news/state--regional-govt--politics/how-report-voting-problems-georgia-election-day/OuNAP1ndwtpeHK0Muo3mJL/"}
