{"authors":["Akin Oyedele"],"date_download":"2018-10-30 23:35:41","date_modify":"2018-10-30 23:35:41","date_publish":"2018-07-17 00:00:00","description":"BI PRIME: For the third time in five months, a trade war topped the ranking of tail risks in Bank of America Merrill Lynch's fund-manager survey. The chief investment strategist has some ideas for contrarian investors who want to bet that trade disputes won't lead to financial carnage.","filename":"data/vaneerConsumption/HowtoprofitfromresolvedtradewarviaBankofAmericaMerrillLynch.json","image_url":"https://amp.businessinsider.com/images/5b4debd6f29aa42c008b4c61-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_trump-china-trade-war-top-contrarian-trades-bank-of-america-merrill-lynch-2018-7_1540942541.html","title":"How to profit from resolved trade war, via Bank of America Merrill Lynch","title_page":"    How to profit from resolved trade war, via Bank of America Merrill Lynch - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Fund managers see a trade war between the US and China as the biggest tail risk. AP Photo/File\nThere's nothing investors are more worried about right now than a trade war, according to Bank of America Merrill Lynch.\nThe bank's fund-manager survey for July, released Tuesday, found that more investors saw this as the biggest tail risk since the European Union's debt crisis in 2014. It topped the list for the third time in five months as the US entered into trade disputes with several economies including China, Mexico, Canada, and the European Union.\nThough tail risks by definition are unlikely to happen, various doomsday scenarios for financial markets and the economy have been published. For example, UBS economists said last week that markets were underestimating the impact of a trade war and that it could tank the S&P 500 by 20%. Also, Oxford Economics highlighted that it took decades for the ratio of world trade to gross domestic product to recover after disputes in the 1930s.\nBut for the investor who thinks the disputes will be resolved without that much damage, Michael Hartnett, the chief investment strategist at Bank of America Merrill Lynch, has some actionable trades.\n\"We tactically advise contrarian bulls to position for overblown trade war concerns via yield curve steepening, EM & EU stock upside, weaker US dollar (note extreme EU debt \"tail risk\" of Jun'12 followed by 45% rally in EU banks in 3 months),\" Hartnett said in a client note.\nA yield-curve steepener, which uses derivatives to profit from rising yields on bonds with various maturities, is probably as contrarian as it gets right now. One-third of the investors surveyed did not expect yield curves to steepen over the next 12 months, the lowest level since 2011, according to Hartnett.\nBank of America Merrill Lynch\nThe gap between the two- and 10-year note yields is at its lowest level in 11 years. It has turned negative, meaning the yield curve inverted, before every recession since the 1960s, and there's fierce debate about whether this will happen by 2020.\nHartnett also offered up some ideas for investors who aren't contrarian and are looking to position for the end of this economic cycle.\n\"We cyclically advise contrarian bears to position for 'peak profit, peak policy stimulus' theme via long gold, short US tech (note extreme 'long US$' trade of Dec'15 followed by 8% plunge in DXY in 6 months),\" he said.","url":"https://www.businessinsider.com/trump-china-trade-war-top-contrarian-trades-bank-of-america-merrill-lynch-2018-7"}
