{"authors":["Mehreen Kasana"],"date_download":"2018-10-31 01:52:17","date_modify":"2018-10-31 01:52:17","date_publish":"2018-09-13 20:28:28","description":"As the Southeast prepares itself for a potentially catastrophic storm, you may be wondering how to watch Hurricane Florence in real time. On Thursday morning, the hurricane was downgraded from Category 4 to Category 2, based on calculations made by…","filename":"data/vaneerConsumption/HowToWatchHurricaneFlorenceInRealTimeAsItBarrelsTowardTheEastCoast.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/13/7557624b-ec6e-4302-9816-dd772dc98018-getty-1032809356.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-to-watch-hurricane-florence-in-real-time-as-it-barrels-toward-the-east-coast-11912845_1540950737.html","title":"How To Watch Hurricane Florence In Real Time As It Barrels Toward The East Coast","title_page":"How To Watch Hurricane Florence In Real Time As It Barrels Toward The East Coast","title_rss":"NULL","source_domain":"bustle.com","text":"As the Southeast prepares itself for a potentially catastrophic storm, you may be wondering how to watch Hurricane Florence in real time. On Thursday morning, the hurricane was downgraded from Category 4 to Category 2, based on calculations made by the Saffir-Simpson Hurricane Wind Scale.\nStill, there's enough reason to be alert as things could get alarming, according to National Hurricane Center's director Ken Graham. \"It truly is really about the whole size of this storm,\" Graham told CBS News. \"The larger and slower the storm is, the greater the threat and impact. And we have that.\"\nOne of the ways you can view Hurricane Florence in real time is by tuning in to EarthCam. The website previously showed live footage from areas such as Puerto Rico and the Virgin Islands, which were devastated by Hurricane Maria in September 2017. EarthCam is currently show real-time footage from several parts of the Carolinas where Hurricane Florence is expected to pummel the region with winds faster than 80 mph.\nAmong other areas, EarthCam has footage of South Carolina's Myrtle Beach, Kiawah Island Beach, and Charleston, but also parts of Virginia where Florence may turn to, including Virginia Beach. Additionally, EarthCam offers a live-stream for Maryland's Sandy Cove and North Carolina's Southport.\nThe website's live footage and multiple options for different areas may prove to be helpful for those in the pathway of Florence as well as those with loved ones on the East Coast. But if these scenarios don't apply to you, EarthCam is also useful for those who can't help but marvel at the sheer power of nature, including monstrous hurricanes.\nIt's worth mentioning that EarthCam comes with a caveat. The seamlessness of the stream directly depends on the strength of the hurricane. In some cases, like Hurricane Maria in 2017, the live stream may abruptly end as the power of the hurricane can affect signal continuity. In other words, the more vicious the storm, the more likely it is for the camera to cease running. So, keep that in mind while tuning in.\nThe best way to navigate a dotty EarthCam is by checking it periodically. If EarthCam doesn't work for you at all, try tracking the pathway of Florence by checking data from the Global Forecast System. The system offers a highly detailed look into the wind speed probabilities for Florence. But that's not all; you can check the arrival time of its winds, warning cones and zones for areas directly in its pathway, rainfall potential, surge warnings, and flash flooding possibilities.\nAnother way to watch Hurricane Florence in real time is by checking ABC News' affiliate, ABC11. Sure, there are ads that occasionally interrupt the footage but it's an option if nothing else works. There's also Explore's live-cam footage of Hurricane Florence for viewers interested in an option on YouTube.\nNASA/Getty Images News/Getty Images\nAs Florence eyes the Southeast, options for live camera footage will possibly increase. But they're not as important as ensuring you and your loved ones are safe and prepared for shielding yourself from potential harm and damage. If you're in Florence's projected pathway, consider learning about these cautionary steps to take. After all, it's always better to be safe than sorry.","url":"https://www.bustle.com/p/how-to-watch-hurricane-florence-in-real-time-as-it-barrels-toward-the-east-coast-11912845"}
