{"authors":["Katy Parker-Shorthouse"],"date_download":"2018-10-31 01:52:41","date_modify":"2018-10-31 01:52:41","date_publish":"2018-09-06 09:02:15","description":"Yup, you read that right. For ABBA fans everywhere, this seems almost too good to be true, but it is coming to London. And the question on everyone's lips now is: how does one book the Mamma Mia! immersive restaurant?\nIf you're anything like me,…","filename":"data/vaneerConsumption/HowToBookTheMammaMiaImmersiveRestaurantBecauseDancingQueensWillWantASliceOfThePie.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/5/5e92ebee-972c-4c37-a5fd-dcc3663bd55b-getty-1000217548.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-to-book-the-mamma-mia-immersive-restaurant-because-dancing-queens-will-want-a-slice-of-the-pie-11503380_1540950761.html","title":"How To Book The 'Mamma Mia!' Immersive Restaurant Because Dancing Queens Will Want A Slice Of The Pie","title_page":"How To Book The 'Mamma Mia!' Immersive Restaurant Because Dancing Queens Will Want A Slice Of The Pie","title_rss":"NULL","source_domain":"bustle.com","text":"Yup, you read that right. For ABBA fans everywhere, this seems almost too good to be true, but it is coming to London. And the question on everyone's lips now is: how does one book the Mamma Mia! immersive restaurant?\nIf you're anything like me, you've seen the stage show, watched both films, and now your wildest dream is going to be realised as an immersive Mamma Mia! restaurant is due to land in the English capital next year. This is not a drill. It really is happening.\nBelieve it or not, it was all the way back in 1999 that the original Mamma Mia! stage show first opened in London's West End, featuring hit songs from '70s mega group ABBA; composed by former band members Benny Andersson and Björn Ulvaeus. Since then, the hit musical about life, love, and motherhood, that features huge hits such as 'Dancing Queen' and 'Voulez-Vous', has had more than 60 million visitors over the years and grossed more than $2 billion worldwide, according to reports by Vanity Fair. It has had 8 million visitors in London alone, and its Broadway version ran for 14 years, making it New York's eighth longest-running musical, the show's website reports.\nThe first Mamma Mia! movie, meanwhile, succeeded in making even the most reluctant ABBA fans smile. A joyous celebration of all that is good in life, the movie, which was brought to life by a star-studded cast including Meryl Streep, Amanda Seyfried, Colin Firth, and Piers Brosnan was an incredible success and one of the biggest box office hits of 2008. According to reports from the BBC, the film made £466 million ($610 million) at the box office and became Britain's fastest selling DVD ever. That's ever.\nIt's no surprise then that movie-makers dared to try the formula a second time around, reuniting members of the old cast, including Julie Walters, Colin Firth, and Piers Brosnan, and adding to the mix some fresh faces including Lily James and, erm, Cher. Wonderfully bonkers and bursting with joie de vivre, the most recent film has again wowed critics and audiences alike, garnering box office figures of £9.74 million on its first opening weekend in the UK — the fourth biggest of the year so far, according to The Guardian. And if you haven't seen it, go now, it's totally worth it for Cher's rendition of 'Fernando' alone.\nAnd with the rise of immersive experiences (see Secret Cinema's most recent recreation of the Venice Beach of Baz Luhrmann's Romeo + Juliet in West London), it was only a matter of time before everyone's favourite musical sensation staged something where we could be part of the action. And, much like the band itself, this particular experience is making its way over here from Stockholm, Sweden. According to Cosmopolitan, the restaurant will be housed in London's O2 Arena and has been masterminded by ABBA's Björn Ulvaeus — the genius behind many of the band's greatest hits.\nMamma Mia! The Party has been a sell-out event in Stockholm for the past three years, according to Good Housekeeping, and the team look set to be re-creating the same magic for fans of the musical here in London. Reports state that the attraction will be able to host 500 guests a night, and will be a recreation of Donna's Greek taverna, complete with white-washed walls and tumbling vibrant pink bougainvillea. \"Owner\" Nikos will greet guests as the story plays out around them, including scenes with professional singers and dancers, while a stonking ABBA playlist blasts out in the background.\nFood and drink will have a Mediterranean theme, of course, so prepare yourselves for a mezze board and a glass of Aperol Spritz or two. But it is later on that the real excitement starts, as the tables are cleared to allow for an incredible '70s disco, complete with flares, disco balls, and insane ABBA medleys.\nExcited yet? Well get your dancing shoes at the ready, because while tickets aren't on sale until autumn, you can pre-order tickets by clicking on this link. It's the perfect way to say thank you for the music.","url":"https://www.bustle.com/p/how-to-book-the-mamma-mia-immersive-restaurant-because-dancing-queens-will-want-a-slice-of-the-pie-11503380"}
