{"authors":["Eva Taylor Grant"],"date_download":"2018-10-31 01:49:57","date_modify":"2018-10-31 01:49:57","date_publish":"2018-09-11 14:00:55","description":"These two things are both true: STIs are more common than many people think, and testing for STIs does not have to be as scary as it sometimes seems. But when the risk is real of testing positive, and the stigma is still so pervasive, it can be hard…","filename":"data/vaneerConsumption/HowToMakeGettingTestedForSTIsLessScaryAccordingToExperts.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/10/492dbd30-8113-4b4b-ab8a-ac57711f4d45-woman-lap.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-to-make-getting-tested-for-stis-less-scary-according-to-experts-10142334_1540950597.html","title":"How To Make Getting Tested For STIs Less Scary, According To Experts","title_page":"How To Make Getting Tested For STIs Less Scary, According To Experts","title_rss":"NULL","source_domain":"bustle.com","text":"These two things are both true: STIs are more common than many people think, and testing for STIs does not have to be as scary as it sometimes seems. But when the risk is real of testing positive, and the stigma is still so pervasive, it can be hard to find ways to calm the fear of getting tested for STIs. Luckily, there are plenty of ways to make it less nerve-wracking.\nSexual health is an important piece of the puzzle when it comes to overall physical health, but it is often overlooked. In a recent Bustle Trends Group survey of 226 women, ages 18 to 34, only 54 percent of women said they are \"extremely likely\" to discuss STIs with a new partner, and 21 percent wait until they become exclusive with a partner to talk about STIs. But it's not just glossed over in the bedroom.\nPhysicians only spend an average of 36 seconds talking about sexual health during checkups. And on a whole, according to a study published by the National Institutes of Health (NIH), stigma often gets in the way of testing. In this context, the fact that STIs are on the rise is no surprise.\nContrary to the language that still surrounds STIs, they are not rare, \"dirty,\" or abnormal. According to the Centers for Disease Control (CDC), sexually active young people account for half of all new STI diagnoses. \"STIs are on the rise in the U.S., and some communities are more negatively affected due to historical and structural oppression that lead to barriers to education and health care,\" June Gupta, MSN, WHNP-BC, associate director of medical standards at Planned Parenthood Federation of America, tells Bustle. \"... We know that there’s a vast unmet need for reproductive and sexual health care and education in the U.S. Too many people don’t have the health care and education they need to keep themselves healthy, and STI rates continue to be a significant public health concern.\" It may make the whole thing less overwhelming to know that you can be part of the fight against stigma and misinformation simply by doing your part and getting tested.\nAnd when you finally do take the plunge, you will likely find that the whole process is less scary than it seems, since testing is extremely common, and you'll join the ranks of empowered young people taking control over their sexual health.\nHere are 14 ways to make getting tested for STIs less scary, according to experts.\n1 Remember That Getting Tested Is Common Andrew Zaeh for Bustle Even if the people around you aren't talking about it, it's crucial to remember that getting tested is in no way abnormal. On the contrary, it's both common and healthy. \"Remember that getting tested is a normal, healthy part of a good sex life,\" Gupta says. \"Having a conversation with your partner(s) about why you want to get tested and have safer sex can really help, and you may even want to get tested together.\" Just reframing the way you think and talk about testing may help minimize some of your fears.\n2 Know That STIs Are Treatable Ashley Batz/Bustle Another thing to help quell your fears? Just knowing that even if you do test positive, things are going to be alright. \"The good news is that all STIs, even HIV, are treatable, and many are curable,\" Gupta says. \"Early treatment can help prevent serious, lifelong health problems that can result from untreated STIs. But you can’t get treatment if you don’t know your status. And the only way to know your status is to get tested.\" Knowledge is power. So just going in with this in mind can help you calm some of your jitters.\n3 Get Tested Where You Feel Most Comfortable Ashley Batz/Bustle You don't need to get tested in an environment you aren't comfortable with. \"Some things that can make testing easier is going to where the people are,\" AASECT certified sexuality educator Heather Alberda tells Bustle. This means trying to find a testing location that's in a place that makes you feel safe, not just the first sterile, less-visited clinic you find online. So think of where you feel most comfortable, she suggests, and see if they offer testing there. Places like schools, community centers, and even houses of worship sometimes have testing services or visiting clinics. And if you don't even know where to start looking, the CDC has a testing locator. Sometimes, even just going in your neighborhood, or to an area you know well, might help calm some nerves.\n4 Talk About It With Your Partner(s) — Or Get Tested Together Andrew Zaeh for Bustle Sometimes, when you start talking about a fear, it begins to dissipate. The same is true for talking about STI testing if you're nervous. One survey by the Kaiser Family Foundation even found that 78 percent of young people would be glad if their partner suggested a test, and that 89 percent think suggesting a test reflected their partner being responsible. \"Conversations about STIs don’t have to be uncomfortable,\" Gupta says. \"If you’re nervous, know that the more you do it, the easier it gets. You can start with something like, 'I'm a little nervous to bring this up ... but I want us to be healthy and I think it's important.' You may be surprised by how well your partner reacts ... Getting tested and knowing your status shows you care about yourself and your partner.\" Your partner's positive reaction can be another tool in your toolkit to feel strong when going in for testing. If that isn't enough, you can bring your partner along day-of, and even get tested together. \"Besides the simple person-to-person support, not shouldering the challenge of your STI test all alone does one more truly important thing: It lets you talk about it — bring it out of the closet, as it were,\" Good Vibrations staff sexologist Carol Queen tells Bustle. Getting tested together or having your partner there can help lessen the shame and bring you two closer together.\n5 Take An Online Quiz Hannah Burton/Bustle If you aren't sure where to begin with testing, there's something you can do about that. It's always best to speak with a doctor, but Planned Parenthood also has an online quiz that suggests what you should be tested for, and why. This means that if you don't quite understand whether you're at risk for certain STIs, or you can't remember what you're supposed to ask for when you go to the doctor or a clinic, the quiz will help clear up some of your questions. And fewer questions can mean fewer butterflies when it comes to the actual moment of testing.\n6 Try An At-Home Testing Kit If You Need To Yuriy Shevtsov/fotolia For a variety of reasons, going to a doctor or clinic to get tested might not be feasible for you right now. That's OK, too. Luckily, getting tested doesn't have to be done outside of your house. \"If going to the clinic for a test deters you from getting it done, you can also do it online or using the mail,\" Dr. Jess O’Reilly, host of the @SexWithDrJess Podcast, tells Bustle. \"MyLabBox.com allows you to purchase online, test at home (via swab, urine, or blood drop) and receive results in one to five days.\" This kind of testing will still require a doctor's visit if you end up testing positive or having further questions or symptoms, but can be a good way to calm the nerves before taking things a step further.\n7 Know That STIs Are Common, Too, And Not Something To Be Ashamed Of Boyarkina Marina/fotolia When it comes to getting tested, often the biggest fear is testing positive. To start to unpack that fear, and work around it, experts suggest understanding just how common, and normal, STIs are. \"Getting an STI or having a partner with an STI is extremely common,\" Gupta says. \"Anyone who ever has vaginal, anal, or oral sex could get an STI. Having an STI is a common result of close contact with other people and is not something anyone should be shamed or judged for.\" Once you start to really absorb these facts, you may begin to feel less anxiety around potentially receiving a positive diagnosis.\n8 Take Note Of Your Own Stigma Ashley Batz/Bustle Another way to be less afraid of the potential that you might have an STI, is to acknowledge any personal stigma you may have. If you can find ways to break down your own stigma surrounding these diagnoses, you may be able to feel more confident going in to get tested. \"There are still a lot of myths and misunderstandings about having an STI,\" Gupta says. \"... It’s important to remember that having an STI doesn’t make you any less good, valuable, or worthy of love. Your status doesn’t make you 'clean' or 'dirty.' Everyone deserves to have their sex life be healthy, happy, and free from shame and stigma.\" By shedding toxic messaging around STIs, you may not only be helping those with a diagnosis, but also your potential health as well.\n9 Reframe Your Thought Patterns Ashley Batz/Bustle If you're still scared about a positive outcome, because, after all, you are at a medical appointment, there's still a way around those fears. \"The risk and reality of a positive outcome [frightens people most],\" Dr. Laura Deitsch, Vibrant’s licensed clinical counselor and resident sexologist, tells Bustle. \"Folks are so scared of a test being positive that they don't realize that one of the most effective protective behaviors is testing!\" So every time you find yourself in a thought trap focused around the fear of having an STI, remind yourself that you're doing the most positive thing you can to prevent one.\n10 Do Your Research Andrew Zaeh for Bustle Any time the fear of the unknown pops up, things can start to feel disproportionately scary. To get a hold of this when it comes to testing, experts suggest doing as much research as possible so that your appointment day has fewer surprises. \"Find out in advance the hours, wait times, actual testing procedures, cost, and what you are being tested for,\" Dr. Deitsch says. \"... Pick a date, make the appointment, and make a plan to treat yourself before or after testing so there is something to look forward to.\" Having a set plan, and an understanding of what exactly will go down, may help keep you from freaking out too much.\n11 Have A Plan For The Appointment Ashley Batz/Bustle Beyond having the logistics prepared for your appointment, it's important to have an emotional game-plan too if you're nervous. \"Tell your medical provider you're feeling anxious and ask for support,\" Queen says. \"Have a supportive mantra ready to repeat if you start spinning out, [like] 'I'm taking care of my own health and that of my intimate friends,' or whatever feels real for you and makes you feel stronger.\" Whatever you think you might need, having a plan to support yourself through the tough feelings can help mitigate your fears.\n12 Have Test Day Be A \"Treat Yourself\" Day ulzanna/fotolia Test day doesn't need to be all business. If you can, schedule your test at a time where you can plan some self-loving activities around it. \"Treat yourself on your test day!\" Dr. Jess says. \"Whether you indulge in a whipped cream-topped, double-chocolate latte or pop by your favorite bookstore to pick up a guilty-pleasure read, do something nice for yourself as a reminder that getting tested is a form of self-care.\" If testing has to be squeezed into your busy schedule, you can still find ways to make the day a little more fun by incorporating these activities into your commute or after-work activities.\n13 Go With A Friend Andrew Zaeh for Bustle If you need an extra boost for the day you're getting tested, you can always bring a supportive friend to help make things easier. \"Silence and secrecy breeds shame and fear,\" Dr. Jess says. \"By bringing a friend and talking about your fears related to getting tested, you can help to alleviate some of the associated stress. Research suggests that sharing secrets and fears with a trusted confidante is associated with multiple health benefits. Keeping secrets allows shame to breed and this is associated with greater depression, loneliness, physical symptoms, and lower quality relationships.\" Not only will you have someone to keep you entertained in the waiting room, but you will also show your friend that you're there for them when they're in the same boat. That's big.","url":"https://www.bustle.com/p/how-to-make-getting-tested-for-stis-less-scary-according-to-experts-10142334"}
