{"authors":[],"date_download":"2018-10-30 18:55:31","date_modify":"2018-10-30 18:55:31","date_publish":"2016-08-16 13:51:00","description":"Searching for your next big break? Look no further. These are the TV shows filming in Atlanta right now.","filename":"data/vaneerConsumption/HowtogetcastintheTVshowsfilminginAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/31/Images/photos.medleyphoto.9236992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_employment_how-get_bd0a622960a0b30e22845407a458cde7__1540925731.html","title":"How to get cast in the TV shows filming in Atlanta","title_page":"How to get cast in the TV shows filming in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"Working as an extra on one of the many television and movie productions being filmed in and around Atlanta is an easy way to make $100. It's also a fun and a great way to make new friends. Here are three productions currently hiring background talent:\n>>RELATED: Get the scoop on what film and TV extra get paid in Atlanta\nNetflix's \"Ozarks\"\nActor Jason Bateman is both the star and director of this new television series, which focuses on the clandestine world of drug-money laundering. Tammy Smith Casting is overseeing background talent for the production. Over the last several weeks, she has been looking for a variety of extras for several scenes. The pay varies, but actors can make up to $64. Submit to OzarkExtras@tscasting.com for your shot at stardom.\n\"Fast & Furious 8\"\nThe incredibly successful franchise is filming it's next box office hit in The Peach City. So if you're hoping to book your next tough guy role, this could be the flick for you. Currently, directors are seeking Russian solders. Apply by sending your full name, phone number, height, weight, wardrobe size and two photos to CgCastingAtlanta@gmail.com.\n\"The Vampire Diaries\"\nThe CW show is back for an eighth season, and right now, the show is hiring actors that can play village children and elders. Filming begins the week of August 22, so if you're available, email a recent photo, your name, age, phone number, height and weight, and clothing sizes to tvdextracasting@gmail.com.\n\"Immortal Life of Henrietta Lacks\"\nThis Oprah Winfrey movie centers around the true story of Henrietta Lacks, an African-American woman whose cells were used to create the first immortal human cell line. The film has been casting background talent to play elderly men and women for a slew of flashback scenes. To apply, email three photos, sizes and contact information to extrascastingTM@gmail.com.\n>>RELATED: This is what it's really like to work as an extra in Atlanta\nTo check other listings and learn more about submitting, here are a few tips for those who have never worked as an extra:\nMonitor the web for new posts\nAlmost all the casting companies post calls on Facebook. Some pages to watch are: Marinella-Hume, Extras Casting Atlanta, CL Casting, Hylton Casting, New Life Casting, Casting TaylorMade, Rose Locke Casting and Tammy Smith Casting.\nHow to submit\nEvery casting call typically includes an email address and a description of the scene. Many times, the email address will be the production's name. For example, theblindside@gmail.com. Don't write it off as a generic gmail address. It's designed to be deleted as soon as the production wraps.\nSend three current pictures, preferably taken with a cell phone. For background work, don't send a professional head shot. That's not what they're looking for. The three pictures should be: face, waist-up and full length. Include all your contact information, weight, height and sizes (include shoe size). Casting asks for this just in case the scene requires you to go through wardrobe. They may also ask you to bring three of your own outfits to match the part.\nTip\nIf possible, you want to submit as quickly as a job is posted. Sometimes, it's a numbers game and agents just want to get the background cast and move on to the next project. Finding out about posts ASAP can be advantageous.","url":"https://www.ajc.com/business/employment/how-get-cast-the-shows-filming-atlanta-right-now/RcZCtyTQ5H1ECbBsMx1ZfK/"}
