{"authors":[],"date_download":"2018-10-30 21:51:16","date_modify":"2018-10-30 21:51:16","date_publish":"2015-12-31 19:06:33","description":"It happens every year. A new year sparks a desire for change in our lives — lose weight, get more exercise, maybe quit smoking or maybe 2016 is the year you finish your novel.","filename":"data/vaneerConsumption/HowtomeetNewYearsgoals.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/31/Images/photos.medleyphoto.8539826.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_health_how-reach-your-goals-2016__1540936276.html","title":"How to meet New Year's goals","title_page":"How to meet New Year's goals","title_rss":"NULL","source_domain":"ajc.com","text":"It happens every year. A new year sparks a desire for change in our lives — lose weight, get more exercise, maybe quit smoking or maybe 2016 is the year you finish your novel.\nFor Whitney Zygmont of Decatur, the new year is not so much a time of making hard-and-fast resolutions, but instead a time of reflection.\n“For me, fitness has always been there, and I am looking to make it a bigger part of my life again,” 36-year-old Zygmont, a mom of three children, said after taking a TRX class at Pace23, a new cycling and TRX studio (TRX refers to an approach to strength training that uses a system of ropes and webbing called a “suspension trainer” to allow users to work against their own body weight), in Decatur.\nMORE: 6 tips for staying fit in Atlanta this winter\nFor others, more dramatic lifestyle changes are desired, and people often fall short in their goals. Here’s the good news: New Year’s resolutions can work, and it doesn’t have to be brutally hard to change your habits. Even so, meeting your goals for 2016 will take planning, willpower, focus, and realizing it won’t always be easy.\nSteve Siebold, author of “177 Mental Toughness Secrets of the World Class” (London House Press, $16.99), also a former professional tennis player, said people often have great intentions of making a change in the new year, but the moment the going gets tough or they run into a challenge, they abandon ship.\nSiebold, who lives in Gainesville, also recommends people have an accountability buddy — friend, neighbor, anyone really — but the idea is to have someone there to help you push through the tough times, someone with whom you can share what’s working and what’s not. Something else to consider, he says, is writing a letter to a friend describing what you want your life to look like in six months, one year or three years from now. Don’t actually send the letter, he said, but hold onto it and read it to yourself whenever you need some motivation to keep going.\nAnd remember, Dr. J. Kip Matthews, an Athens psychologist, says, there will be the occasional “slips” along the way. It’s important to anticipate these lapses and have a strategy for how to move through them. This will help avoid the urge to just give up.\nHere are some more tips from Matthews for meeting your 2016 New Year’s resolutions:\nTake it slow. Break your goal down step by step. For example, if the goal is to exercise more, start with three days a week for 30 minutes (as opposed to going for an hour of cardio, six days a week). For those seeking family dinners, start with at least one home-cooked meal with the family per week and then gradually move toward three days a week. The same goes for learning an instrument. You don’t need to devote hours every day to your new interest. Start with one lesson per week and practicing twice a week. Add time little by little.\nHarness willpower to meet your goals. The American Psychological Association’s 2015 Stress in America survey revealed that lack of willpower was the most commonly cited barrier to making change (32 percent said lack of willpower kept them from making a change). However, willpower can be strengthened over time. Building self-control through focusing on one goal at a time and avoiding temptations can help you leverage willpower toward making those lifestyle changes.\nFocus on the process and not the outcome. Rather than judging yourself based on outcomes over which you have little or no control, direct your attention to the process (the activities themselves) that make up the goal. For example, if someone wants to be a better student, don’t focus so much on the grades, but rather on what it means to be a good student, including reading the text before class, reviewing your notes, attending study groups, etc. This strategy greatly enhances motivation and a consistent view of oneself. By doing this, you are able to adopt a “here-and-now” way of being and position yourself to let go of the past.\nThink about what you are willing to sacrifice to achieve your goals. Every decision we make involves letting go of something. If your resolutions are important to you and you are placing a high priority on those changes, then you need to consider what things in your life are less important that you are willing to let go of. Once you are clear on this, it helps to prevent any sense of regret that comes with making change.\nMORE: Salads to fall in love with in Atlanta","url":"https://www.ajc.com/lifestyles/health/how-reach-your-goals-2016/proXWp14uvroLYb7vHWXtJ/"}
