{"authors":["Alex Kritselis"],"date_download":"2018-10-31 00:11:03","date_modify":"2018-10-31 00:11:03","date_publish":"2014-08-12 20:19:02","description":"Did you hear the good news? Taylor Swift is holding a special event in New York City on August 18 that will be live streamed by Yahoo! Yes, this is what Swift was hinting at all of last week with her cryptic Instagram clues. If you're a die-hard…","filename":"data/vaneerConsumption/HowtoWatchTaylorSwiftsYahooLiveStreamEventinNYCMoreInfoontheAnticipatedPerformance.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/bd7ed479-dd13-4a74-a0a1-a406836be8c8.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35478-how-to-watch-taylor-swifts-yahoo-live-stream-event-in-nyc-more-info-on-the_1540944663.html","title":"How to Watch Taylor Swift's Yahoo Live Stream Event in NYC & More Info on the Anticipated Performance","title_page":"How to Watch Taylor Swift's Yahoo Live Stream Event in NYC & More Info on the Anticipated Performance","title_rss":"NULL","source_domain":"bustle.com","text":"Did you hear the good news? Taylor Swift is holding a special event in New York City on August 18 that will be live streamed by Yahoo! Yes, this is what Swift was hinting at all of last week with her cryptic Instagram clues. If you're a die-hard Swift fan, you absolutely cannot miss this event. If you're a casual Swift fan, you almost certainly need to tune in. And if you couldn't care less about Swift or her music, well, please know that you're wrong and your entire life has been a lie! I will keep you in my thoughts. It's never too late to see the light!\nIf you're a fan, you probably have some pretty important questions, like: What time is this whole thing going down? How do I watch it? Is Swift definitely debuting new music or what? Also, Yahoo still exists?? Thankfully, I've got all the answers. Let's make sure that you're totally and completely prepared for Monday, August 18 — because it might just be the single most important day of the year. No, I won't take that back. Yes, I am being serious. No, I don't realize how ridiculous I sound right now. Yeesh.\nSo, what time is this whole thing going down?\nOK, in case you weren't paying attention just a few sentences ago, a reminder that this is all happening on Monday, August 18. Write that down. The event will start at 5:00 p.m. EST/4:00 p.m. CST/2:00 p.m. PST. If you live in a different time zone, please consult this handy time zone calculator in order to figure out what time you need to tune in.\nHow do I watch it?\nJust head on over to: http://www.yahoo.com/taylorswift\nClick the link above and then bookmark it. It's that simple! The stream will start automatically when the event begins on Monday, August 18. If you visit the link now, you can even have Yahoo send you a reminder (either by text message or by email) when the concert is about to start. (Yes, Yahoo still exists and they're even sending texts!)\nBut wait, did I just hear you say that you live in or around New York City? By visiting Swift's official website, you can enter for a chance to actually attend the event! If you win, you're taking me with you! Just kidding (but seriously).\nIs Taylor definitely debuting new music at this thing?\nWhile Swift has yet to confirm that she'll be premiering new music at the event, all signs point to yes. First of all, we know by now that her next album is coming soon. Second of all, Yahoo's website does occasionally refer to this thing as a \"concert event.\" And finally...why the hell else would Swift be doing this?? She's a musician, she makes music!\nBut trust me, I understand your concerns. Taylor has a history of being a sneaky snake, especially recently, and she was just photographed making tacos or something with Lorde, so there's a very real concern that this event could turn into a cooking lesson. But I don't think that will happen. (But if it does, worst case scenario, tacos.)\nI think that pretty much covers it! Remember: Taylor Swift. Monday, August 18. Concert event live streamed by Yahoo. There will probably be some new music, and there might even be some tacos. I can hardly wait!\nBe there or...don't. You're free to do whatever you choose, but I'd highly suggest being there or you'll run the risk of being square, which, as we all know, is less than desirable.\nImages: Giphy","url":"https://www.bustle.com/articles/35478-how-to-watch-taylor-swifts-yahoo-live-stream-event-in-nyc-more-info-on-the"}
