{"authors":["Suzannah Weiss"],"date_download":"2018-10-31 01:38:55","date_modify":"2018-10-31 01:38:55","date_publish":"2018-08-29 16:40:07","description":"Some people are uncomfortable with the idea of their partners watching porn. But the thing is, so many of us have done it, and discomfort is often an invitation to explore your own psychology. Talking to your partner about porn can bring you closer,…","filename":"data/vaneerConsumption/HowToTalkToYourPartnerAboutPornAccordingToASexTherapist.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/29/d5fee5bc-aafe-411a-b03a-90a8a1aa214e-2t4a9942.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-to-talk-to-your-partner-about-porn-according-to-a-sex-therapist-10248693_1540949935.html","title":"How To Talk To Your Partner About Porn, According To A Sex Therapist","title_page":"How To Talk To Your Partner About Porn, According To A Sex Therapist","title_rss":"NULL","source_domain":"bustle.com","text":"Some people are uncomfortable with the idea of their partners watching porn. But the thing is, so many of us have done it, and discomfort is often an invitation to explore your own psychology. Talking to your partner about porn can bring you closer, teach you about each other, and help establish boundaries in your relationship.\n\"When I talk to a lot of my clients when they have an issue with porn or their partner watching porn, there's a couple of things that come up,\" licensed marriage and family therapist, sex therapist, and IntamacyMoons Retreats founder Marissa Nelson tells Bustle. \"Some people think that their partner watching porn is cheating on them, and so by virtue of having that person watching porn, they feel like it's violating their monogamy. Another reason for that is fear of infidelity: 'porn is the slippery slope, they are desiring what's happening in the porn and therefore they will seek that behavior outside of the relationship.' I also find that part of it is, for some people, it can be mental thing, like a mental insecurity... it brings up a lot of self-image stuff.\"\nWhen you discuss your feelings about porn with your partner, you'll likely end up discussing issues like these as well — and that's a good thing. Here's how to make a conversation with your partner about porn productive.\n1 You Can Make Requests, But They Can Say No Ashley Batz for Bustle You have the right to request that your partner doesn't watch porn or limits their porn use, but they have the right to decide that's not something they're willing to give up. On the flip side, if your partner doesn't want you watching porn, you have the right to say \"no\" as well. In Nelson's experience, when people tell their partners not to watch porn, they often do it anyway. If you can't accommodate that request, it's better to be honest. You might also discuss specific parameters around porn, like not watching it in front of each other, if you don't want to give it up altogether.\n2 If You're Uncomfortable With Your Partner Watching Porn, Ask Yourself Why Ashley Batz for Bustle Instead of skipping right to the conclusion that your partner should not watch porn, a lot can be gained by talking about why it bothers you. \"It's always a conversation,\" says Nelson. \"And I think it would start with really being honest: 'What makes me so uncomfortable?'\" That way, you're addressing the real issue rather than using porn as a proxy for it.\n3 Discuss The Boundaries Of Your Monogamy Ashley Batz for Bustle If the issue is that watching porn feels like cheating to you or you're afraid it could lead your partner to cheat, it's time for a discussion about what cheating means in your relationship. What is it about porn that feels like cheating to you, and where else does that feeling come up? Your partner may be able to reassure you that they aren't thinking of porn stars the way they think of you or that porn won't lead them to cheat — it may even prevent it, says Nelson.\n4 Talk About Your Insecurities Ashley Batz for Bustle Another common fear is that your partner will find porn stars more attractive than you, or that porn stars can do things in bed that you can't. These fears can reflect underlying insecurities about what you look like or how you have sex. If you talk about these fears, your partner can reassure you by letting you know how sexy and amazing they think you are. \"I get it: you're together and you want your partner to desire you,\" says Nelson. \"You want your partner to value you. You want your partner to fantasize about you. But it can also be true that your partner can go to and be stimulated by something else and then bring a lot of that sexual energy back to you, and the two have nothing to do with each other.\"\n5 You Can Incorporate Your Porn Preferences Into Your Own Sex Life Ashley Batz for Bustle Not only can watching porn coexist with a healthy relationship — it can actually help spice things up. Once you and your partner know what kind of porn you each like to watch, you'll have some new ideas for what you can try together. \"Porn can be a gateway to exploring,\" says Nelson. \"What is pleasurable about this? What is erotic about this? What turns you on about this? Could you take the lessons and tools that are arousing and exciting in this arena and bring it into your relationship?\"","url":"https://www.bustle.com/p/how-to-talk-to-your-partner-about-porn-according-to-a-sex-therapist-10248693"}
