{"authors":["Angela Chen"],"date_download":"2018-10-31 01:42:46","date_modify":"2018-10-31 01:42:46","date_publish":"2018-08-28 01:01:26","description":"When the main guy in charge of protecting students from predatory lenders bows out, it's not a good sign. And when the reason behind his resignation is that Trump's policies betray students, it's time to take a much closer look at those policies. On…","filename":"data/vaneerConsumption/HowTrumpsPoliciesAreHurtingStudentsDroveThisTopCollegeLoanOfficialToStepDown.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/09e83073-21b4-4447-a65a-e272ec10fbc8-getty-93235663.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-trumps-policies-are-hurting-students-drove-this-top-college-loan-official-to-step-down-10257970_1540950166.html","title":"How Trump's Policies Are Hurting Students Drove This Top College Loan Official To Step Down","title_page":"How Trump's Policies Are Hurting Students Drove This Top College Loan Official To Step Down","title_rss":"NULL","source_domain":"bustle.com","text":"When the main guy in charge of protecting students from predatory lenders bows out, it's not a good sign. And when the reason behind his resignation is that Trump's policies betray students, it's time to take a much closer look at those policies. On Monday, the Consumer Financial Protection Bureau's top college loan official quit, but he left a number of damning reasons to explain his departure. In a resignation letter, Seth Frotman outlined how Trump's policies are hurting students, according to Politico. Bustle has reached out to the CFPB for a comment.\n\"The Bureau does not comment on specific personnel matters,\" a rep for CFPB emailed Bustle. \"We hope that all of our departing employees find fulfillment in other pursuits and we thank them for their service.\"\nFrotman, who is the bureau's student loan ombudsman (an official tasked with representing the students and investigating complaints or violation of rights), said that the leadership within the bureau is \"hurting families\" in his resignation letter, according to NPR. Frotman also claimed that the Trump administration consistently subverted efforts meant to address abuses committed by student loan companies and for-profit colleges.\n\"The current leadership of the Bureau has turned its back on young people and their financial futures,\" Frotman wrote in his letter. \"Where we once found efficient and innovative ways to collaborate across government and protect consumer, the Bureau is now content doing the bare minimum for them while simultaneously going above and beyond to protect the interests of the biggest financial companies in America.\"\nFrotman goes on to list an example in which bureau leadership suppressed a report that would have shown how the country's largest banks were \"ripping off students\" by loading legally questionable fees on them.\n\"Recently, senior leadership at the Bureau blocked efforts to call attention to the ways in which the actions of this administration will hurt families ripped off by predatory for-profit schools,\" Frotman wrote. \"At every turn, your political appointees have silenced warnings by those of us tasked with standing up for servicemembers and students.\"\nFor the past three years, Frontman has been the student loan ombudsman, overseeing the bureau's Office for Students and Young Consumers, according to NPR. In his role, he reviewed student complaints about the dubious methods of lenders and loan servicers. The job couldn't have been easy; the CFPB has looked into more than 60,000 student loan complaints over the past seven years, NPR reported, with more than $750 million being rightfully returned to student borrowers.\nThe student loan industry sees about $1.5 trillion in business, and Frotman's accusations have put the federal government under scrutiny for their past actions on protecting student borrowers.\nElected officials responded with alarm at Frotman's allegations and called for an immediate investigation.\n“I am calling for congressional hearings to examine the bureau’s sudden withdrawal from its necessary role in protecting students and student loan borrowers from predatory companies,” Rep. Bobby Scott, a Democrat on House education committee, said in a statement.\nThe Trump administration has made moves to downplay CFPB's student loan office role; last year, the U.S. Education Department stymied its flow of data to the CFPB, accusing the bureau of overreaching in its authority on federal student loans, Politico reported.\nFrotman did not mince words toward the end of the letter, leaving the bureau leadership with this final thought: \"the damage you have done to the Bureau betrays these families and sacrifices the financial futures of millions of Americans in communities across the country.\"","url":"https://www.bustle.com/p/how-trumps-policies-are-hurting-students-drove-this-top-college-loan-official-to-step-down-10257970"}
