{"authors":["Quoctrung Bui"],"date_download":"2018-10-23 05:25:41","date_modify":"2018-10-23 05:25:41","date_publish":"2014-07-14 00:00:00","description":"Millennials are the most populous generation in America. From a demographic perspective, this is very good news.","filename":"data/vaneerConsumption/HowTheMillennialsMaySaveAmerica.json","image_url":"https://media.npr.org/assets/img/2014/07/14/millennials-save-america_wide-40ff0bf27dac29fff61af8fb91919004d4712dc7.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_money_2014_07_14_329887356_how-the-millennials-may-save-america_1540272341.html","title":"How The Millennials May Save America","title_page":"How The Millennials May Save America : Planet Money : NPR","title_rss":"NULL","source_domain":"npr.org","text":"How The Millennials May Save America\nMillennials are the most populous generation in America.\nFrom a demographic perspective, this is very good news for the nation. It means the U.S. has a wave of people just entering the workforce, whose tax dollars (hopefully) will support the retirement of the baby boomers.\nLots of other developed countries aren't so lucky. In Japan and many European countries, boomers (people ages 50 to 68) outnumber millennials (ages 14 to 33). Those countries may have a harder time maintaining the social safety net for the elderly as the ratio of retirees to working adults rises.\nThe demographics of less wealthy countries — like, say Mexico — look quite different. There, the young vastly outnumber the old.\nOf course, demography is not necessarily destiny. If Japan's younger workers are more productive than their parents were, fewer workers will be able to support more retirees. Conversely, in the U.S., if working-age adults continue to leave the labor force, we may find that we're in trouble, despite the millennial bump.","url":"https://www.npr.org/sections/money/2014/07/14/329887356/how-the-millennials-may-save-america"}
