{"authors":["Sophie Freeman For Mailonline"],"date_download":"2018-10-23 01:53:58","date_modify":"2018-10-23 01:53:58","date_publish":"2016-01-29 16:07:09","description":"Caffeine blocks the fatigue- causing chemical adenosine making people less tired and more motivated to continue exercising, said Professor Samuele Marcora, from the University of Kent.","filename":"data/vaneerConsumption/HowtwocupsofCOFFEEcanboostyourworkout.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/3099306A00000578-0-image-a-63_1454083103753.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3423060_How-two-cups-COFFEE-boost-workout-Caffeine-stops-feeling-physically-drained-make-exercise-longer_1540259638.html","title":"How two cups of COFFEE can boost your workout","title_page":"How two cups of COFFEE can boost your workout | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"If your New Year’s resolution was to get fitter but you now find your enthusiasm waning, try drinking some coffee before you work out.\nCaffeine can help our workouts seem easier, according to a leading physiologist.\nWhen we exercise, our nerve cells produce a chemical that makes us feel fatigued, called adenosine.\nBut caffeine blocks the adenosine, preventing us from feeling as physically drained and therefore making us more motivated to continue exercising, said Professor Samuele Marcora, from the University of Kent.\nDrinking two cups of coffee before exercising can help you work out for longer as the caffeine blocks chemicals that make people feel fatigued\nAdenosine also impacts how mentally fatigued we feel, so coffee could be particularly useful for those who often find exercise too much of a chore at the end of the working day, said Prof Marcora.\n‘Taking caffeine before a workout reduces perception of effort and enables people to exercise, on average, 11 per cent longer than placebo,’ he said.\n‘It also increases exercise enjoyment, and this should motivate people to stick to their exercise programme in the long term.\n‘Adenosine is also one of the main causes of mental fatigue, and mental fatigue increases perception of effort and reduces exercise performance,’ he added.\n‘So using caffeine before a workout is particularly beneficial to people that go for a run or to the gym after work when they are mentally tired.\n‘Caffeine can help them overcome their mental fatigue and perform a good workout.’\nHe said drinking 3mg of caffeine per kg of body weight before exercise should be ‘effective without inducing unpleasant side effects in most people’.\nParticipants who took caffeine tablets were able to exercise for an average 11 per cent longer than those who were given a placebo, the research found\nFor a 65kg woman (just over 10 stone), 195mg of caffeine – or two cups of fresh filter coffee – would be right.\nIn one of Professor Marcora’s studies, participants were asked to carry out a set exercise routine – with and without having taken a caffeine pill - and report how strenuous they felt it was.\nCaffeine can help them overcome their mental fatigue and perform a good workout Professor Samuele Marcora\nWhen they had taken the caffeine, they rated the workout as 6.1 on a 10-point scale for effort, but when they were exercised without the caffeine, they rated it as 6.7.\n‘In my opinion, we have not paid enough attention to the core psychobiological reason for why most people do not regularly engage in physical activity: humans do not like to exert effort,’ he wrote in an editorial for the scientific journal Sports Medicine.\n‘Compared to watching television (zero effort), even moderate-intensity physical activities like walking require considerable effort.\n‘Therefore, a psychoactive drug that reduces perception of effort during exercise may be particularly useful for the many people who are overweight or who exercise after work in a state of mental fatigue.","url":"https://www.dailymail.co.uk/health/article-3423060/How-two-cups-COFFEE-boost-workout-Caffeine-stops-feeling-physically-drained-make-exercise-longer.html"}
