{"authors":[],"date_download":"2018-10-30 14:37:53","date_modify":"2018-10-30 14:37:53","date_publish":"2018-08-10 16:17:00","description":"For a relaxing day at Atlanta's top hotel pools, a handful actually offer hotels offer hotel pool passes for locals.","filename":"data/vaneerConsumption/HowtogethotelpoolpassesinAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/06/23/Videos/4115966.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/places_hotel_ways-take-dive_8d6efc8a44c563959bf1930d61f9d4ad__1540910273.html","title":"How to get hotel pool passes in Atlanta","title_page":"How to get hotel pool passes in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"We're going to let you in on one of the biggest secrets in town.\nWhen it gets hot and you want the luxury and refreshment of a hotel pool, you don't have to buy a room to experience it.\nRELATED: 6 ways to find yourself on one of Atlanta's top hotel rooftops\nIf you want to enjoy a relaxing day at one of Atlanta's top hotel pools, a handful actually offer day passes for locals - and you don't even have to be a guest. As summer arises, you'll want to take advantage of this insider's tip with a drink in hand.\nCheck out these high-end hotel pools in Atlanta that offer hotel pool passes and other ways to access pools without a room:\nThe Four Seasons Hotel Atlanta Pool\n75 14th St. NE, Atlanta. 404-253-3848. www.fourseasons.com.\nSurround yourself in stunning neoclassic architecture that will make you feel like you're on a luxurious retreat by spending the day swimming at Four Seasons Hotel Atlanta. This saline indoor lap pool features a whirlpool bath, a sun terrace and separate locker rooms for men and women, each with steam and sauna.\nThe lowdown: Locals can purchase a $50 day pass that includes access to the pool from 6:30 a.m. to 9 p.m. Sunday through Thursday, 6:30 a.m. to 10 p.m. Friday and Saturday. As an added benefit, you'll also have access to the services offered at The Spa at Four Seasons. For more information, call 404-253-3848, or visit www.fourseasons.com.\nW Atlanta Downtown pool (Courtesy of Marriott International)\nThe W Atlanta-Downtown Wet Deck\n45 Ivan Allen Jr. Blvd., Atlanta. 404-582-5800. www.watlantadowntown.com.\nIf you're looking for some summertime fun at a swanky downtown pool that overlooks the Atlanta skyline, the Wet Deck at W Atlanta-Downtown has you covered. This posh rooftop locale offers a laid-back, zen-like experience with downtempo beats, cocktails and a crystal clear, zero-edge pool.\nThe lowdown:The Wet deck is available for a $20 day pass to non-guests on Saturdays and Sundays, from 12:30 p.m. to 6 p.m., and passes include access to the rooftop terrace pool, a complementary Bai drink, towel service and poolside games. Purchase your day pass at www.handpickedatlanta.com.\n»RELATED: 9 places to capture a great shot of Atlanta's skyline\nRitz-Carlton pool\nThe Ritz-Carlton Buckhead Pool\n3434 Peachtree Road NE, Atlanta. 404-240-7041. www.ritzcarlton.com.\nTo add a little extravagance into your summer, experience the splendor of the Ritz-Carlton Buckhead Pool. This junior Olympic-sized saline pool includes a whirlpool spa, sundeck, separate locker rooms with sauna and even a Pool Butler to clean your sunglasses or to bring you sunblock and water.\nThe lowdown: By booking a spa service, locals can enjoy full access of the Ritz-Carlton Buckhead Pool on Monday through Wednesday from 11 a.m. to 7 p.m., Thursday and Friday from 10 a.m. to 8 p.m., Saturday from 9 a.m. to 8 p.m. and 9 a.m. to 5 p.m. on Sunday. Spa service prices vary. Schedule your spa service by calling 404-240-7041, or by visiting www.ritzcarlton.com.\nThe W Atlanta-Midtown Cabana Wet Deck\n188 14th St. NE, Atlanta. 404-892-6000. www.watlantamidtown.com.\nThe next time you're planning a private party or celebratory event, don't miss out on one of the day passes at the W Atlanta-Midtown Cabana Wet Deck. Cabana passes include full access to the Wet Deck rooftop pool, four large Smartwaters, a flatscreen TV, W signature tote bag and sunscreen, chef-curated popcorn and house-made chips.\nThe lowdown: Book your party at the W Atlanta-Midtown Cabana Wet Deck on Sunday through Thursday for $175 for 4 hours or $300 for the full day, or on Friday or Saturday for $225 for 4 hours or $400 for the full day. Reserve your passes at www.watlantamidtown.com.\nFor slightly less, enjoy the pool on Sundays from 1 to 6 p.m. for $25 plus parking which for you, swimmer, is discounted to $10. The price includes a drink and a snack. More info at Eventbrite.\nThe Mandarin Oriental Hotel Atlanta Pool (Mandarin Oriental Hotel Group Limited)\nThe Mandarin Oriental Hotel Atlanta Pool\n3376 Peachtree Road NE, Atlanta. 404-995 7526. www.mandarinoriental.com.\nWhether you want to enjoy a leisurely swim or get in a few laps, the Mandarin Oriental Hotel Atlanta Pool offers a 60-foot indoor pool lined with beautiful French windows, which shower the pool with sunlight and garden views.\nThe lowdown:Locals can buy a $50 day pass, which includes access to pool from 5:30 a.m. to 9:30 p.m., use of the fitness center, yoga studio and spa. For more information, call 404-995 7526 or visit www.mandarinoriental.com.","url":"https://www.ajc.com/places/hotel/ways-take-dive-atlanta-hotel-pools-without-booking-room/JcX0G65jEbJn7Mj3n9xzHO/"}
