{"authors":[],"date_download":"2018-10-30 17:51:33","date_modify":"2018-10-30 17:51:33","date_publish":"2016-07-07 17:31:25","description":"Are you ready to take your acting career to the next level? Make the change from extra to principle character by following these tips.","filename":"data/vaneerConsumption/Howtogofromextatospeakingroles.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/11/30/Images/photos.medleyphoto.8441672.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_employment_how-fro_aa83dde438c2b014dfb8e6d6f8877db2__1540921893.html","title":"How to go from exta to speaking roles","title_page":"Atlanta TV and film: How to go from exta to speaking roles","title_rss":"NULL","source_domain":"ajc.com","text":"Are you ready to take your acting career to the next level? Make the change from extra to principal character by following these tips from Atlanta-based actors who successfully upgraded their careers.\n>>RELATED: How to get cast on the movies shooting in Atlanta this summer\nSign with an agent who truly believes in your talent and skill.\nChris Young, a certified Screen Actors Guild (SAG) agent with the Jana Van Dyke Agency, sums it up like this: Principal roles have to audition for the part. If you don't have training and don't have an agent, no one is going to see you. Sign with an agent who is well-connected.\nHenry Louis Adams, who's been booked for several roles including Fatal Attraction and Homicide Hunter, agreed. \"After you have some solid footage, submit for an agent. A reputable agent will not charge you to be represented. They get paid when you get paid from the jobs you book through them. Remember that you also need a strong headshot. A headshot is the first thing a casting director sees when deciding to bring you in for an audition.\"\n\"You can build a strong resume as you work the indies and other projects along the way. With Georgia being a right-to-work state, there is plenty of nonunion work here. You are not required to be in a union,\" he continued. \"However, ultimately you are going to have to join SAG-AFTRA if you want to solidify yourself as a professional in this field.\"\nSeek auditions and ask casting agents to consider you for featured work.\nSteve Bowlin has \"the look.\" He's tall, handsome, can effortlessly transform his appearance to work in present-day scenes, as well as period pieces and has a smile that lights up a room. He's also humble. His success story centers on showing up as an extra and being upgraded on set.\n\"Gees, for me it has been just getting in front of the decision makers, usually the director, and having fun with the part,\" Bowlin said. \"I have not sought representation, but I know that is probably the best way to get more auditions. Also, I've had opportunities on sets where I've been upgraded, or given lines and then compensated at SAG levels. That's always sweet and exciting.\"\nTake your craft seriously enough to train and sign up for classes.\n\"I would advise anyone who is trying to transition from a background actor to a principal actor to get an acting coach or take acting classes. Working in front of the camera is totally different from working behind it. Once you have trained, go and audition for some indie projects to enhance the skills you've learned in class,\" Adams said. \"Acting is actively listening, reacting and being in the moment, allowing life to happen through you. If someone can tell you are acting, then you are doing it wrong. Acting is 'being.\"\nBe willing to accepted unpaid roles.\nGregory Rose has worked on almost every production filmed in and around Atlanta over the past six years. He has a solid reputation and has experienced considerable success. However, he's done this through hard work, connections and being someone casting agents can count on - even if he didn't get paid.\n\"I've worked a lot of sets, but finally submitted for some roles that were not SAG or even paid, but had some lines,\" Rose said. \"I finally was able to have submission material for a role televised with lines. ... It still wasn't a SAG/union role, but it paid, it aired, and it was a great resume builder.\"","url":"https://www.ajc.com/business/employment/how-from-background-extra-speaking-role-atlanta-films/yhfuLgmejreMSBZU4hotBM/"}
