{"authors":[],"date_download":"2018-10-30 18:07:44","date_modify":"2018-10-30 18:07:44","date_publish":"2018-07-18 10:00:00","description":"With big events like the Super Bowl coming up in Atlanta, residents could make some cash renting rooms or homes on sites like Airbnb or VRBO.  Here’s what the rules are in Atlanta, Gwinnett County, DeKalb County, Cobb County and north Fulton County.","filename":"data/vaneerConsumption/HowtolistyourhomeonAirbnbinmetroAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/05/12/Images/GettyImages-586113528.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_how-list-your-ho_f842612227839972d7a1d07536c2d171__1540922864.html","title":"How to list your home on Airbnb in metro Atlanta","title_page":"Super Bowl 2019: How to list your home on Airbnb in metro Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"With big events like the Super Bowl coming up in Atlanta, residents could make some cash renting rooms or homes on sites like Airbnb or VRBO.\n» Where to stay for the Super Bowl in Atlanta? Airbnb has options\nDepending on where you live, there are different permits you’ll have to get. In some cities, short-term rentals are completely banned. In many cities, there is no specific legislation regarding short-term rentals, but properties used only for Airbnb or other short-term rental services could be considered hotels.\n» Follow: AJC’s Complete coverage of the 2019 Super Bowl in Atlanta\nAtlanta’s Super Bowl just 200 days away\nWith 200 days to go, Atlanta preps for Super Bowl\nAtlanta companies scrambling for contracts as hotels and restaurants brace for Super Bowl\nHere’s what the rules are in Atlanta, Gwinnett County, DeKalb County, Cobb County and north Fulton County.\n﻿Atlanta\nThose operating a short-term rental in Atlanta must acquire both a business license and a hotel license. Owners must also pay hotel occupancy taxes. Airbnb has a guide to all of Atlanta’s regulations on its website.\nRoswell\nShort-term rentals are not permitted in any residential zones in Roswell, according to spokeswoman Julie Brechbill. Bed and breakfasts are permitted in the Downtown Historic Districts, but must be permitted and licensed by the city and operate as businesses.\n﻿Milton\nShort-term rentals are not permitted under Milton’s zoning ordinances, according to spokeswoman Shannon Ferguson.\n﻿Sandy Springs\nHomeowners who operate a short-term rental property must register with the city and have their property inspected for compliance with fire and building codes. Neighbors within 500 feet of a short-term rental property must be notified about the space’s use and the homeowner must provide contact information so neighbors can alert them of potential problems. Sandy Springs’ noise ordinance must be visibly posted in the home. The homeowner must pay for a business license and pay a monthly tax.\n﻿Johns Creek\nShort-term rentals are not permitted in Johns Creek, according to spokeswoman Edie Damann.\n﻿Chamblee\nThere are no regulations in the city of Chamblee regarding short-term rentals, according to spokeswoman Tisa Moore.\n﻿Marietta\nThe city does not have specific regulations regarding short-term rentals, according to spokeswoman Lindsey Wiles. Properties used solely as short-term rentals with no long-term occupant are not allowed because the property would be considered a hotel and hotels are not allowed in residentially zoned areas.\nPowder Springs\nPowder Springs does not have any regulations regarding short-term rentals, according to spokeswoman Pam Conner.\nSmyrna\nSmyrna does not have any specific ordinances regarding short-term rentals in its city code.\nKennesaw\nUnder Kennesaw’s bed and breakfast ordinance, short-term rentals must be owner-occupied, with a maximum of five guest rooms and one parking spot per guest room. Owner-occupied short-term rental properties need a business license and will be taxed as a hotel/motel. Only properties in the following districts can welcome short-term renters: HPV, NS, NRC, PVC, CBD, and UVC.\n﻿Austell\nThere are no specific ordinances regarding short-term rentals, according to Austell’s website.\n﻿Dunwoody\nShort-term rentals are not permitted in residential areas, neighborhood shopping zones or “office institution transitional” areas, according to spokesman Bob Mullen.\n﻿Stonecrest\nStonecrest does not yet have a short-term rental ordinance, but a proposed ordinance will be voted on by the city council later in the year, according to spokesman Adrion Bell. The proposed ordinance requires rentals to have one off-street parking space per bedroom, evacuation routes and a landline phone. Short-term rental properties must be at least 500 feet from each other, according to the proposed ordinance.\n﻿Brookhaven\nShort-term rentals are considered commercial establishments and are banned from areas that are zoned as residential, according to city code.\n﻿Doraville\nThe city of Doraville does not have any ordinances concerning short-term rentals, according to its city code.\n﻿Clarkston\nClarkston does not have any ordinances specifically governing short-term rentals, according to city code.\n﻿Tucker\nThere is no ordinance regarding short-term rentals in Tucker’s city code, but the city’s definition of “family” restricts the number of unrelated persons in a home to three, spokeswoman Camille Taylor said.\n﻿Avondale Estates\nAvondale Estates does not have a specific ordinance regarding short-term rentals, according to its code of ordinances.\n﻿Stone Mountain\nShort-term rentals can only be conducted if the homeowner lives in the property on a long-term basis, according to city code. The homeowner must establish the property as a commercial business and get a home occupational tax certificate from the city, according to city code. There can be no more than three bedrooms available to guests in the short-term rental property.\nLithonia\nA spokesperson for the city of Lithonia did not respond to a request for clarification and the city’s code is not posted on its website.\n﻿Buford\nBuford does not have any specific regulations regarding short-term rentals, according to city codes.\n﻿Dacula\nThere are no specific regulations regarding short-term rentals, according to Dacula’s website.\n﻿Lilburn\nShort-term rentals are regulated under the city’s bed and breakfast ordinance. The homeowner must live in the property full-time, and the maximum number of paying guests is 10, with no more than two people in each guest room. There must be one parking space per guest room. The short-term rental will require a business license and will be taxed as a hotel/motel, according to city code.\n﻿Suwanee\nSuwanee does not have any specific regulations regarding short-term rentals, according to its code of ordinances.\n﻿Duluth\nThere are no specific ordinances regarding short-term rentals in Duluth, according to its city code.\nPeachtree Corners\nPeachtree Corners’ zoning ordinance prohibits short-term rentals of less than 31 days, spokeswoman Judy Putnam said.\n﻿Sugar Hill\nSugar Hill does not have a specific ordinance regulating short-term rentals, according to its website.\n﻿Snellville\nSnellville does not have a specific ordinance regulating short-term rentals, according to its city code.\n﻿Berkeley Lake\nThe city does not have any regulations specifically governing short-term rentals, but residential zoning and occupational taxes could apply to homes used solely as short-term rental properties without long-term occupants, according to deputy city administrator Pat Chapman.\n﻿Lawrenceville\nLawrenceville does not have a specific ordinance regarding short-term rentals, according to its city code.\nLike AJC on Facebook | Follow us on Twitter","url":"https://www.ajc.com/news/local/how-list-your-home-airbnb-metro-atlanta-for-the-super-bowl/B8ZsPINcEs1IOABDLxMcbJ/"}
