{"authors":["Dan Trepanier","Articles Of Style"],"date_download":"2018-10-30 22:52:19","date_modify":"2018-10-30 22:52:19","date_publish":"2016-12-10 00:00:00","description":"Just like a tailored suit, a pair of glasses should be properly fit to the wearer.","filename":"data/vaneerConsumption/Howtobuyglassesthatfityourface.json","image_url":"https://amp.businessinsider.com/images/551470b3eab8ea1e2669bd84-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_how-to-buy-glasses-that-fit-your-face-2016-11_1540939939.html","title":"How to buy glasses that fit your face","title_page":"    How to buy glasses that fit your face - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A proper fit is key. Articles of Style Just like a tailored suit, a pair of glasses should be properly fit to the wearer. A proper fitting frame is more flattering, more comfortable, and more effective at helping you see better or keeping the sun out of your eyes. Here's quick guide to getting the right fit, which is unique for every person depending on your head size, face shape, feature distribution, etc.\nA frame size is typically noted as: lens width - bridge width - temple width. For example: 51mm - 21mm - 145mm.\nThe key is finding a size that corresponds to the overall width of your face, while being mindful of the distribution of the physical size of your eyes (lens width) versus the space between them (bridge width).\nArticles of Style As a rule, I think sizing should be treated on a case-by-case basis, as it depends largely on your proportions and the style being selected. But as a general guideline, here are some starting points for total width (lens width x2 + bridge width):\nThe keys to proper eyewear fit\n1. The width of the frame should match the width of your face. This means, when looking at you straight on, the glasses should not hang off the side of your face (this would mean the frame is too wide) and we should not be able to see the sides of the temples (this would mean the frame is too narrow).\n2. We should be able to see your eyebrows above the frames. At least half of them, preferably a little more than half.\n3. Each eyeball should be directly in the center of the lens, from left to right. The distance between the corner of the eye and the edge of lens should be the same on both sides of the eye.\n4. Your eye should fill the top half of the lens. The bottom of the eye should roughly touch the vertical midpoint of the lens.\n5. The temples should be adjusted to fit around your ears. If you have a problem with glasses sliding down your nose, you need to have the temples bent to keep them in place.\n6. The overall frame should be located roughly in the middle of your face. It should provide a nice balance between the top of the face and the bottom of the face. In each of the examples below, notice there is roughly equal distance between the top of the frame and the top of the head, and the bottom of the from and the bottom of the chin.\nFitting examples\nArticles of Style\nWill has a chiseled jaw, which is complemented nicely by the angular shape of these square lenses. Notice the eyebrow showing above the lens (a little more than half the brow, which is ideal) and his eyes filling up roughly the top half of the lenses. The dark tortoise coloring is a great tone for his fair skin and blond hair.\nArticles of Style Sansho is a big guy - 6'4 215 - which means he has a larger head/face and therefore needs a larger frame. He benefits from the larger round lenses. He also has a low nose bridge, which is ideal for keyhole frames like these clear acetates. Again, notice the relative position of the eyebrows, the spacing of the eyes, and the overall proportions of the frame versus his face.\nArticles of Style Alex has a round-ish face shape, but he looks awesome in round glasses. This is why I don't really believe in the \"only one shape of glasses will suit your face shape\". It's more important that they are in proportion to your size and fit your face properly. Multiple shapes can fit on one face.\nArticles of Style Pat is slim with a narrow face. Therefore, he needs a narrower lens width and bridge with. He also benefits from a slighter taller frame, because a narrower face can also be seen as a longer face.\nArticles of Style I have a really large head and a oval shaped face. Therefore, I usually wear larger shades and I benefit from a slightly more square shape. I also have a very high nose bridge, which makes it difficult for me to wear frames that don't have nose pads. I usually bend the nose pads all the way back (toward the lenses), to make room for my high bridge. This allows the glasses to sit lower on my face, exposing a little eyebrow and keeping my eyeballs in the top half of the lenses.\nColor considerations\nIn addition to finding the proper shape and size for your face, you should also look for a frame (and lens) that compliments your natural coloring - meaning your skin, hair, and the colors you wear most often.\nLens color, as well as lens opacity, also make a big difference. For example, being able to see your eyes through the lenses of a pair of shades is a decidedly different look. In general, I would advise keeping your lenses dark enough that the eyes are barely visible. The majority of my shades are dark grey or brown, with the occasional dark purple or green, and a couple with gradient lenses which are a little more \"fashion-y\". I never really got into the colored or reflective lenses, they both always seemed a little cheesy.\nFinal note\nLastly, if you're in the market for a new pair of shades for the upcoming Spring season, I would advice you to shop local and try-on as many frames as possible before deciding on one. Bring a friend who's opinion you trust. Don't buy a style just because it looks cool on someone else; chances are their face shape is much different. The proper fit for your face is key.","url":"https://www.businessinsider.com/how-to-buy-glasses-that-fit-your-face-2016-11"}
