{"authors":["Ben Nagle For Mailonline"],"date_download":"2018-10-23 00:52:06","date_modify":"2018-10-23 00:52:06","date_publish":"2017-04-26 10:54:31","description":"When Wilfried Zaha steps on to the Selhurst Park turf on Wednesday night, he will make his 254th appearance in Crystal Palace colours. He is already a club legend in south London at just 24.","filename":"data/vaneerConsumption/Howwill40mratedWilfriedZahafareinSpursaudition.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3B3ED9CC00000578-0-image-a-12_1493199727488.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4446860_How-40m-rated-Wilfried-Zaha-fare-Spurs-audition_1540255926.html","title":"How will £40m-rated Wilfried Zaha fare in Spurs audition?","title_page":"How will £40m-rated Wilfried Zaha fare in Spurs audition? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When Wilfried Zaha steps on to the Selhurst Park turf on Wednesday night, he will make his 254th appearance in Crystal Palace colours.\nHe is already a club legend in south London at the tender age of 24, but the Tottenham game represents a big night in terms of his future.\nWhen the transfer window opens this summer, top four clubs are likely to come in for Palace's star man, with Spurs top of the list of prospective clubs.\nWilfried Zaha has been in incredible form for Crystal Palace this season, scoring six goals\nZaha is likely to be subject to a number of big-money bids from top four clubs in the summer\nTRUE PALACE MAN After joining the Eagles academy in 2004, Wilfried Zaha's professional career is as follows... 2010–2013: Crystal Palace 2013–2015: Manchester United 2013 → Crystal Palace (loan) 2014 → Cardiff City (loan) 2014–2015 → Crystal Palace (loan) 2015–present: Crystal Palace\nIn fact, as much as it pains Palace fans to think about it, Wednesday night is something of an audition for Zaha, who still dreams of making it at the very top level.\nWith Palace struggling for much of the season, it has become abundantly clear that the winger has outgrown the team, and most supporters wouldn't begrudge him a move away.\nThat said, money talks and the Eagles will demand a big fee for a player they have developed not once, but twice.\n'Personally, in today's market, absolutely (he's worth £40m),' Sam Allardyce said on Tuesday. 'I just hope no one bids it.'\nPalace have already made a big profit on Zaha, when they sold him to Manchester United for close to £15m in 2013, before buying him back for a snip of the price less than two years later.\nAfter selling Yannick Bolasie in a deal rising to £30m last summer, Palace's next wing wizard could command at least £10m more this year.\nAfter a failed spell at Manchester United, Zaha has a big decision to make about his future\nThe winger is already a Palace legend and has played over 250 times for the south London club\nSEASON SO FAR Appearances: 30 Goals: 6, Assists: 9 Pass Success %: 79.5 Dribbles: 231 - second only to Neymar (269) in Europe\nTottenham are charging towards Champions League football and after one failed move to a top club, Zaha is sure to be keen to try once more, to prove to himself and others that he has what it takes.\nA move within London is far more appealing for the player with a young family and a stable life, and Mauricio Pochettino will have a very keen eye trained on the winger on Wednesday night.\nWith Moussa Sissoko underwhelming Spurs fans and Erik Lamela's future unclear, there could well be space in the starting line-up for Zaha next term.\n'As far as I know, Wilfried's contract has a considerable amount of time on it,' Allardyce continued. 'The summer will bring with it whatever it brings whether that is us negotiating a new contract with him and he wants to stay, or whether some outrageous bid comes along.'\nPalace fans sing 'He's just too good for you' and have even put posters up around south London\nZaha has added goals and assists to his game this term and could command more than £40m\nWHERE COULD HE GO? Wilfried Zaha is being heavily linked with a move away from Selhurst Park, but where do the bookies think he'll end up next...? Chelsea 4/5 Crystal Palace 6/4 Tottenham 9/2 Arsenal 8/1 Borussia Dortmund 10/1 Inter Milan 10/1 Manchester City 16/1 Manchester United 40/1 Odds courtesy of Betway, and correct as of 26/04/17\nAnd outrageous it would have to be. Let's be clear, Palace are not a small club. Zaha's contract is currently less than that of many of his team-mates, but Steve Parish and Co are ready to break the bank to keep him in south London.\nA £120,000-a-week offer will be placed on the table for Zaha, making him the highest-paid player in the club's history. If that doesn't sum up the club's affection for him, I don't know what does.\nSo the decision, ultimately, will be Zaha's. He can stay or he can go. The offers and opportunities will be there, but the 24-year-old will be welcomed with open arms if he decides to stay put.\nHis performance on Wednesday night, though, could go some way to deciding if Tottenham is the next stop in the career of a player destined for greatness.","url":"https://www.dailymail.co.uk/sport/football/article-4446860/How-40m-rated-Wilfried-Zaha-fare-Spurs-audition.html"}
