{"authors":["Matt Levin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:54:51","date_modify":"2018-10-30 23:54:51","date_publish":"2016-10-02 14:18:53","description":"This fall, California voters will decide whether to approve the biggest jump in cigarette taxes since the state began taxing tobacco in 1959. Prop. 56,","filename":"data/vaneerConsumption/HowwouldtheProp56tobaccotaxreallyaffectpoorsmokers.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/Smoking-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540943691.html","title":"How would the Prop. 56 tobacco tax really affect poor smokers?","title_page":"How would the Prop. 56 tobacco tax really affect poor smokers? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"This fall, California voters will decide whether to approve the biggest jump in cigarette taxes since the state began taxing tobacco in 1959.\nProp. 56, backed by a wide coalition of public health, healthcare and union groups, would impose an additional $2 per-pack excise tax on cigarettes—raising the current state levy from 87-cents per pack for the first time in nearly two decades. The initiative would also extend tobacco taxes to the growing e-cigarette market for the first time.\nThe tobacco industry has spent heavily against the measure, pouring more than twice as much money into the “no” campaign as the “yes” side has raised. Cigarette companies and anti-tax groups make a familiar argument. “If this initiative were to go into effect,” said Beth Miller of the No on 56 campaign, “California’s tobacco taxes would be the sixth highest in the country—mostly paid by California’s poor.”\nIn fact, Prop. 56 would make California’s tobacco taxes the ninth highest, a point the No on 56 campaign later acknowledged. But how true is the claim that the tax would mostly be paid by California’s poor?\nJust like a sales tax, per-pack tobacco levies are regressive because low-income smokers will spend proportionately more of their resources on cigarette taxes than wealthier smokers. Tobacco products are also obviously highly addictive, meaning that poor smokers will have a tough time quitting even as tobacco takes a bigger and bigger bite of their budget.\nBut the better question is how much of a burden a $2.87 per pack tax will place on low-income California smokers, and how effective it will be at incentivizing them to quit or at least cut down. Any tobacco tax must be weighed against the health and financial benefits it produces.\nLet’s see what the data and available research tells us. First, some context:\nCalifornia has proportionately fewer smokers than the rest of the country, despite its lower cigarette prices and taxes\nAccording to the most recent estimates from the Centers for Disease Control, California has the second-lowest rate of adult smokers in the country, at about 12 percent (of course that’s still a lot of people. A recent UC-San Francisco study put it at about 4 million adults and adolescents smokers).\nCigarette Prices and Use Across States\nThe Golden State has been able to boast one of the nation’s lowest smoking prevalences while taxing tobacco at the 37th lowest rate in the country, lower than the relatively tax-allergic bastions of Arizona ($2 a pack), Texas ($1.41 a pack), and West Virginia ($1.20 a pack). While state levies aren’t the only determinant of cigarette prices, they are a major factor.\nSo why do we have few smokers if tobacco is relatively cheap?\nPublic health experts credit California’s low smoking rate partly to aggressive anti-smoking campaigns and other initiatives, such as banning workplace smoking and being the first state to ban lighting up in bars. Other cultural influences also play a part.\n“The big reasons that smoking is so low in California are that we have very strong clean indoor air laws, which has a consumption effect like a significant tax,” said Dr. Stanton Glantz, a leading tobacco control researcher at UCSF. “And we also had a very aggressive anti-smoking media campaign.”\nCalifornia vs U.S. smoking over time\nBut opponents of Prop. 56 cite California’s success in reducing smoking as reason to question the necessity of a new tax.\n“In a $122 billion budget, there is plenty of money outside of increasing regressive taxes to fund a tobacco cessation program,” said David Wolfe, legislative director at the Howard Jarvis Taxpayers Association, which opposes Prop. 56. “The way the revenue is structured is horrible.”\nRegardless of your feelings on Prop. 56, it’s true that California has been able to reduce smoking at a quicker rate than the national average—although that rate has plateaued in recent years.\nAbout 12 percent of Californians still smoke. Who those Californians are is very important to the success of Prop. 56.\nA disproportionate share of California’s remaining smokers are poor—and want to quit\nAccording to the federally funded Health Education Council, Californians who make less than $25,000 a year are more than twice as likely to smoke as Californians who make more than $50,000 a year. That mirrors a national pattern where smoking is much more common among poorer populations, and especially in low-income minority communities (African-American men, Vietnamese-American men and gay and bisexual Californians have particularly high smoking rates).\nThese remaining smokers light up rather frequently, although less so than they used to. About three out of every five of California’s remaining smokers smoke every day, and most of them want to stop. A poll from the California Department of Public Health found that 75 percent of California smokers wished they could quit, but only 6 percent actually tried to do so.\nSmoking more common for low-income Californians\nMost research has shown that taxes are a very effective way of reducing smoking, and even more effective for poor smokers\nAs any undergraduate econ student knows, cigarettes are a classic “inelastic good.” Because of the product’s addictive nature, consumers are generally slow to stop buying cigarettes even when a pack of Marlboros is $2 more than it used to be.\nStill, research suggests that taxes are a very effective way to reduce smoking. When there’s a 10 percent increase in the price in a pack of cigarettes, cigarette use drops 3 to 6 percent. About half of that decline results from smokers quitting entirely (taxes are also effective in preventing children and young adults from smoking). And recent studies suggest the higher the cost of cigarettes, the greater the reduction in total cigarette sales.\nHow rich and poor smokers respond to price increases\nExperts also mostly agree that a price increase makes lower-income smokers more likely to reduce smoking than higher-income smokers. One widely cited study found that below-median income smokers who earned less than the median income were four times as responsive to price hikes as above median-income smokers.\nOn one level, that’s intuitive—a $2 increase on a pack of cigarettes is going to mean more to a poor smoker struggling to make ends meet than a rich smoker with more disposable income. But rich smokers may also be able to pursue more expensive methods of quitting, such as individualized counseling. While the state’s health insurance program for poor Californians covers quitting-assistance products such as nicotine patches and gum, coverage for counseling services varies by health plan.\nBut for poor smokers who don’t quit, the costs can be alarming.\nIn 2010, New York imposed the highest state tax on cigarettes in the country, at $4.35 per pack. A study funded by the New York Department of Health found that after the resulting price increase, nearly a quarter of poor smokers’ income was going to tobacco.\nNew York’s poor smokers spend 1/4 of their income on cigarettes\nIn contrast to other research about how poor smokers respond to tax hikes, the study also found that while overall smoking in New York decreased by 20 percent after the tax hike, it actually made almost no difference in the percentage of poor New Yorkers who lit up.\n“This is a burden on a group of people who are already burdened,” said Matthew Farrelly, co-author on the New York study and an expert in tobacco economics. “They’re smoking at higher rates, they don’t have much money, and it’s a pretty shocking reality when you look at it.”\nFarrelly says that it’s surprising how little specific research has been done on the financial burden cigarette taxes have on poor smokers. He also cautions that his study has its limitations, and that the results can’t be generalized to every instance of a cigarette tax increase.\nProp. 56 is a significantly smaller tax than New York’s. For pack-a-day smokers (well more than the average California smoker) who don’t reduce smoking as a result of the tax, a very crude estimate of its additional cost would be around $730 per year, assuming tobacco companies pass on the exact amount of the tax to consumers.\nWhile a higher cigarette tax will be regressive, the health benefits should be progressive.\nSupporters of Prop. 56 argue that the tax’s progressive health benefits far outweigh its potentially regressive costs.\n“It would be preposterous to call this particular measure regressive because virtually all of the benefits go to low-income populations,” said Jim Knox, vice president of governmental relations for the American Cancer Society Cancer Action Network.\nAfter Congress raised the federal excise tax on cigarettes in 2009, low-income smokers got healthier. Of all the estimated tobacco-related deaths avoided because of the tax, almost half came from poor smokers.\nCigarette taxes reduce proportionally more deaths for low-income smokers\nThose benefits translate to healthcare savings for the smokers themselves, as well as the health system as a whole. A recent UCSF study found that smoking cost California $10 billion in direct healthcare expenses and about $8 billion in lost productivity. That totals to about $4,803 per smoker and $487 per state resident.\n“If you’re asking the broader question, which is what is the effect on poor people, yes they are going to be paying more money disproportionately than a millionaire,” said Glantz. “But the benefits in terms of reduced smoking, reduced disease, reduced health costs, reduced expenditures on tobacco and also increasing economic activity—you can argue they are going to be differentially benefitting.”\nSupporters also tout the fact that portions of the revenue generated by Prop. 56 will be devoted to California’s Tobacco Control Program, which will have a kind of multiplier effect in reducing smoking rates. The tax isn’t just a deterrent—a portion of its revenue will be used to help low-income households quit.\nNeither side of the Prop. 56 campaign nor the state has publicly estimated precisely how many Californians will quit because of Prop. 56, or its specific impact on low-income smokers. Glantz and colleagues are hoping to release the results of that analysis shortly.\nThe nonpartisan Legislative Analyst’s Office has estimated that Prop. 56 would generate between $1 billion and $1.4 billion in revenue in its first year, with potentially less in the future.\nThere’s no clear agreement about how the state could or should continue to reduce smoking rates by taxes. Critics of tobacco taxes argue that cigarettes are only the first in a litany of products the “nanny state” is increasingly trying to monitor—and that sugary soft drinks, fast food, coffee and red meat are next on the list. They frame smoking not as a public health issue but as a private one best left to individuals.\nBut advocates of Prop. 56 argue that tobacco use takes a toll on the public health system, and even on individuals who don’t smoke.\n“If I could get the Legislature to put another $100 million in the tobacco program, I would do that…” Glantz said. “They could do that without raising the tax, if the Legislature would do it, but they won’t. And so if you want to reduce smoking, the only choice you have is a tax increase.”\nGlantz also notes that California has pushed most of the smoking-reduction levers at its disposal. A major tax is one of the few options it hasn’t pursued.","url":"https://calmatters.org/articles/how-would-the-prop-56-tobacco-tax-really-affect-poor-smokers/"}
