{"authors":["Lea Rose Emery"],"date_download":"2018-10-31 01:46:08","date_modify":"2018-10-31 01:46:08","date_publish":"2018-08-27 19:21:45","description":"Maybe you’ve seen it happen: A single friend has very strong ideas about what they want from a relationship and about what they want from a partner. It all seems to be set in stone. That is, of course, until they get into a relationship — and then…","filename":"data/vaneerConsumption/HowYourRelationshipStandardsChangeOnceYoureDatingSomeone.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/4b59f79b-c818-4652-beb2-75c43f4502a2-7ded8509-d3e4-42f6-822d-cbf7503d5d48-zaeh_bustle_apr2016-180.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_how-your-relationship-standards-change-once-youre-dating-someone-10246584_1540950368.html","title":"How Your Relationship Standards Change Once You're Dating Someone","title_page":"How Your Relationship Standards Change Once You're Dating Someone","title_rss":"NULL","source_domain":"bustle.com","text":"Maybe you’ve seen it happen: A single friend has very strong ideas about what they want from a relationship and about what they want from a partner. It all seems to be set in stone. That is, of course, until they get into a relationship — and then everything changes. The truth is, for many of us the expectations and reality of being in a relationship are a difficult combination.\nWhile some people have expectations that are too high when they're dating, others seem to throw their relationship values out the window when they meet someone new, because they're eager to make things work. It can seem like our expectations of a relationship when we're single are very different than our standards when we're actually in one. And now, there's research that back that up.\nA new study in the journal of Personality And Individual Differences looked at how our expectations change before and after we get into a relationship. By speaking to single people, new couples, and couples who have been together for a long period, the researchers tried to get a sense of our expectations of a relationship. For part of the research, 408 participants were given a survey about their ideal partner — and people in a relationship were also asked to rate their current partner. Six months later, the survey was given again to single people who had entered into a relationship since the first survey. All participants were asked to rank their ideal (and/or current) partner in terms of physical attractiveness, their status and resources, vitality, and their warmth and trustworthiness. Interestingly, the research found that participants' idea of an ideal partner changed to match their current partner.\nThose who were in a relationship before the study started ranked their partner and ideal mate closer together than those who were single and then entered in a relationship. It suggests that, over time, our ideal shifts to match our current partner — especially as the rankings of the actual partners didn't vary, just the rankings of the ideal partner. So it's not that our partners are getting better over time, but instead, our expectations are changing. So why do our expectations change over time?\nSusan Trombetti, matchmaker and the owner of Exclusive Matchmaking tells Bustle she sees this in her clients. \"They want and crave someone, so they compromise their standards,\" she says. \"I do think there is a tendency to gloss over these things.\" But that can lead to unhappiness down the line, so it's important to find a balance.\nHow To Balance Expectations And Reality\nAndrew Zaeh for Bustle\nHow do you balance expectations and reality? On the one hand, you don't want to throw your dealbreakers and expectations out the window and settle — on the other hand, having expectations that are too high can kill a relationship.\n\"Relationships are not an exact science,\" Joanna Townsend, a life coach and a Washington D.C.-based psychotherapist for Blush Online Life Coaching, tells Bustle. \"We connect with others largely based on feelings, not reason. Perhaps it's out of biology that we approach new relationships with a set of ideals and standards because having expectations helps us to hone in on compatibility factors. It gives us a sense of control and predictability of success in finding a mate.\"\nAnd that can be a powerful thing because it can also be a helpful tool as we sort through potential partners. But what if you realize that having kids really is important to you — or that you need more stability than you thought? It's OK if your expectations evolve as you grow and learn. \"[W]hat this study illuminates ... is that we engage in idealistic distortion when it comes to expectations for new relationships because of these rigid ideals that are simply just that — ideals,\" Townsend says. \"And couple dynamics are lot more than a set of standards. Our ideals are likely to shift as we get to know someone and realize each other's humanness. Successful couples have a foundation rooted in connection while being open-minded and communicative to improve upon strength and growth areas, individually, and together.\"\nWhat we want and what we expect changes over time — and that can be a good thing. It's just important that you don't lower your expectations for a relationship that simply isn't right for you. Becoming realistic about relationships and people is one thing — settling is a totally different story.","url":"https://www.bustle.com/p/how-your-relationship-standards-change-once-youre-dating-someone-10246584"}
