{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 23:59:06","date_modify":"2018-10-30 23:59:06","date_publish":"2016-12-05 00:00:00","description":"Italian politics is in crisis but the country won't be ditching the euro for the lira any time soon, according to analysts at HSBC.","filename":"data/vaneerConsumption/HSBCItalywontbeditchingtheeuroanytimesoon.json","image_url":"https://amp.businessinsider.com/images/58451c94dd089531448b4b2f-750-375.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_hbsc-note-on-italian-referendum-and-renzi-resignation-2016-12_1540943946.html","title":"HSBC: Italy won't be ditching the euro any time soon","title_page":"    HSBC note on Italian referendum and Renzi resignation - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Italian Prime Minister Matteo Renzi resigned AP Photo/Khalil Senosi\nItalian politics is in crisis but the country will not be ditching the euro for the lira any time soon, according to analysts at HSBC.\nPrime Minister Matteo Renzi resigned on Monday, after a landslide referendum defeat of reforms on which he had bet his political career.\nBut, for the time being, the turmoil ends there.\nThe country is unlikely to have a snap election, according to HSBC economist Fabio Balboni, and instead will appoint someone to steady the ship following Renzi's departure.\n\"In our view the most likely scenario is that the president will attempt to form a technocratic caretaker government with the aim of passing a new electoral law for the upper house,\" Balboni said in a note to clients on Monday. \"This means no snap election, in our view.\"\nBalboni wrote that an election could take place in mid-2017, which is not far off the previously scheduled election in 2018.\nIt could pave the way for the Five Star Movement, Italy's anti-establishment party, to gain ground. They have been climbing in the polls as this chart shows:\nHSBC\nInvestors are concerned that the Five Star Movement's anti-European policies could eventually lead Italy out of the euro. If granted power, the Five Star Movement might try to hold another referendum, this time on euro membership. But HSBC sees this as very unlikely in the short to medium term.\nHere is Balboni (emphasis ours):\n\"A binding referendum on the euro would also be unconstitutional in Italy, and while there might be a consultative one, parliament would not be bound to implement it (although it might be hard to ignore it).\nBut, more importantly, the position of the 5SM on the issue is far from clear (it says it wants to hold a referendum on the euro, but to remain in the EU), suggesting that the debate about leaving the euro is still in its infancy in Italy.\"\nWhile Italy leaving the euro is unlikely, it is not impossible. The currency is not particularly popular:","url":"https://www.businessinsider.com/hbsc-note-on-italian-referendum-and-renzi-resignation-2016-12"}
