{"authors":["Gavin Lesnick"],"date_download":"2018-10-30 19:18:08","date_modify":"2018-10-30 19:18:08","date_publish":"2014-10-09 00:00:00","description":"Former Arkansas Gov. Mike Huckabee endorsed Asa Hutchinson in his race for governor Thursday, calling Hutchinson a leader who brings \"executive experience\" his opponent doesn't have.","filename":"data/vaneerConsumption/HuckabeeendorsesHutchinsonforgovernor.json","image_url":"https://media.arkansasonline.com/img/photos/2014/10/09/Screen_Shot_2014-10-09_at_9.59.52_AM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2014_oct_09__1540927088.html","title":"Huckabee endorses Hutchinson for governor","title_page":"Huckabee endorses Hutchinson for governor","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Former Arkansas Gov. Mike Huckabee describes winning his first bid for lieutenant governor by the \"slimmest of margins\" while endorsing Asa Hutchinson for governor Thursday. - Photo by Gavin Lesnick\nFormer Arkansas Gov. Mike Huckabee endorsed Asa Hutchinson in his race for governor Thursday, calling Hutchinson a leader who brings \"executive experience\" his opponent doesn't have.\nHutchinson, who represented Arkansas's 3rd District in Congress from 1997 to 2001, went on to serve as the director of the Drug Enforcement Administration.\n\"He understands what it is to be a leader of a massive entity,\" Huckabee said at a news conference with Hutchinson at Republican headquarters in Little Rock, likening governor to being \"CEO of an extraordinarily large organization.\"\n\"It is not an east task,\" he added. \"And someone needs to get in that job who has a history of being effective. And Asa has that.\"\nHutchinson faces Democrat Mike Ross, a former Congressman who represented the 4th District from 2001 to 2013.\nHuckabee, who also lauded Hutchinson's focus on Arkansas tourism as an economic driver, said he doesn't \"have anything against\" Ross and called him a \"decent human being.\" But he went on to criticize Ross for blocking pro-life legislation at the committee level while Ross served in the state Senate. Huckabee said he believed that occurred in 1995 or 1997.\n\"Mike Ross in the state Senate was part of the gang that wanted to go along, get along, make sure always happy to be part of the crowd,\" he said. \"Asa Hutchinson's a leader. He's willing to stand out. He's willing to stand alone. That's what leadership does.\"\nHuckabee ran unsuccessfully for the Republican nomination for president in 2008 and is weighing whether to make another run. He was asked during the news conference when a decision would come.\n\"Not today,\" he said with a laugh. \"Well after the elections.\"\nSee Friday's Arkansas Democrat-Gazette for more on this story.","url":"https://www.arkansasonline.com/news/2014/oct/09/huckabee-endorses-hutchinson-governor/"}
