{"authors":["Pam Key"],"date_download":"2018-10-30 21:25:35","date_modify":"2018-10-30 21:25:35","date_publish":"2016-01-17 21:24:21","description":"On Fox News Channel's \"Fox & Friends Weekend,\" Republican presidential candidate and former Gov. Mike Huckabee (R-AR) said while the release of the |","filename":"data/vaneerConsumption/HuckabeeUSBasicallyPaidIranBillionsinRansom.json","image_url":"https://media.breitbart.com/media/2016/01/huckabee.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_17__1540934735.html","title":"Huckabee: U.S. Basically Paid Iran Billions in Ransom","title_page":"Huckabee: U.S. Basically Paid Iran Billions in Ransom | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Fox News Channel’s “Fox & Friends Weekend,” Republican presidential candidate and former Gov. Mike Huckabee (R-AR) said while the release of the U.S. hostages form Iran was good news, the United States “basically paid Iran billions in ransom.”\nHuckabee said, “I am delighted they are going to be released. I mean there is no other way to express any other emotion for the hostages and their families, but that’s just it, they were hostages, they were not prisoners, they were not there because they had committed some international crime for which they had been justly tried. They were being held hostages by a government that we just made a deal with and just released $100 billion, maybe up to $150 billion. This is not a good deal because this wasn’t a deal. We were basically paying ransom is what it really came down to.”\nHe continued, “This is an invitation to go and find an American, hold him hostage, come up with phony charges, hold him a few years, humiliate the United States of America and then demand something of ridiculously high value and know that as long as this administration is in power, you’re going to get it. Because they’re so anxious to make a deal with the Iranians and for what reason, I’ve never been able to understand it.”\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/politics/2016/01/17/huckabee/"}
