{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 22:15:36","date_modify":"2018-10-30 22:15:36","date_publish":"2015-06-26 23:15:43","description":"Huckabee compared America today – now oppressed with the legalization of same-sex marriage at the hands of five Justices – to the nation’s Founders who challenged the tyranny of the British monarch. |","filename":"data/vaneerConsumption/HuckabeeonSameSexMarriageRulingWeMustResistandRejectJudicialTyrannyNotRetreat.json","image_url":"https://media.breitbart.com/media/2015/01/huckabee-hands-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_26__1540937736.html","title":"Huckabee on Same-Sex Marriage Ruling: ‘We Must Resist and Reject Judicial Tyranny, Not Retreat’","title_page":"Huckabee on Same-Sex Marriage Ruling: ‘We Must Resist and Reject Judicial Tyranny, Not Retreat’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In response to the Supreme Court’s ruling Friday on same-sex marriage, presidential contender Mike Huckabee called on Americans to resist a Supreme Court that he likened to “an imperial British monarch.”\nHuckabee compared America today – now oppressed with the legalization of same-sex marriage at the hands of five Justices – to the nation’s Founders who challenged the tyranny of the British monarch.\n“The Supreme Court has spoken with a very divided voice on something only the Supreme Being can do – redefine marriage,” Huckabee said in a press release. “I will not acquiesce to an imperial court any more than our Founders acquiesced to an imperial British monarch. We must resist and reject judicial tyranny, not retreat.”\nHuckabee continued that the Court’s decision is less about equality than about the redefinition of marriage.\nThis irrational, unconstitutional rejection of the expressed will of the people in over 30 states will prove to be one of the court’s most disastrous decisions, and they have had many,” he said. “The only outcome worse than this flawed, failed decision would be for the President and Congress, two co-equal branches of government, to surrender in the face of this out-of-control act of unconstitutional, judicial tyranny.\nThe former Arkansas governor explained that it is impossible for the Supreme Court to repeal natural law.\n“The Supreme Court can no more repeal the laws of nature and nature’s God on marriage than it can the law of gravity,” he asserted. “Under our Constitution, the court cannot write a law, even though some cowardly politicians will wave the white flag and accept it without realizing that they are failing their sworn duty to reject abuses from the court.”\n“If accepted by Congress and this President, this decision will be a serious blow to religious liberty, which is the heart of the First Amendment,” Huckabee added.","url":"https://www.breitbart.com/politics/2015/06/26/huckabee-on-same-sex-marriage-ruling-we-must-resist-and-reject-judicial-tyranny-not-retreat/"}
