{"authors":["Pam Key"],"date_download":"2018-10-30 21:25:33","date_modify":"2018-10-30 21:25:33","date_publish":"2015-12-14 22:36:10","description":"Huckabee: 'Foolish' To Put America In The Hands of Someone Without Governing Experience","filename":"data/vaneerConsumption/HuckabeeFoolishToPutAmericaInTheHandsofSomeoneWithoutGoverningExperience.json","image_url":"https://media.breitbart.com/media/2015/07/huckabee.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_14__1540934733.html","title":"Huckabee: 'Foolish' To Put America In The Hands of Someone Without Governing Experience","title_page":"Huckabee: 'Foolish' To Put America In The Hands of Someone Without Governing Experience | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Monday on CNN’s “The Lead,” while making a comparison to a candidate with no executive experience to someone flying a plane with no experience, Republican presidential candidate and former Gov. Mike Huckabee (R-AR) noted how “foolish” it would be to put someone in charge with no experience.\nHost Jake Tapper asked, “I know you’re not one to criticize your fellow candidates, but have you seen temperament issues from some of your rivals that give you pause?”\nHuckabee said, “It’s more of a matter of maturity, judgment, whether they’ve had executive experience. A few weeks ago I was on an airplane and the plane was delayed and delayed and we waited on a flight crew and the person at the gate said, hey, would anyone like to volunteer to fly the plane? Everybody laughed because it was ludicrous to think you would put a person, a total volunteer in the cockpit, fly people who had never been in the cockpit before. But how foolish would it be to put the future of America in the hands of somebody who’d never been in the cockpit, in other words who had never governed, who had never been in the executive seat of power. I don’t think our country’s in a position where we can afford on the job training or find out after a person gets there whether they have any skills and aptitude to be an executive in government.”\nHe added, “It’s a very different experience than being on a legislature. And it’s also very different than being a CEO or an executive in the private sector, of which I’ve been. but governing is different. I think people will start getting that more clearly in mind as we get closer to voting.”\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/politics/2015/12/14/huckabee-foolish-to-put-america-in-the-hands-of-someone-without-governing-experience/"}
