{"authors":["Tamara Keith","Domenico Montanaro"],"date_download":"2018-10-22 21:27:09","date_modify":"2018-10-22 21:27:09","date_publish":"2015-10-15 00:00:00","description":"He is the second Obama Cabinet member to endorse Clinton — even as Vice President Biden is still considering getting in the race.","filename":"data/vaneerConsumption/HUDSecretaryJulinCastroEndorsesHillaryClinton.json","image_url":"https://media.npr.org/assets/img/2015/10/15/ap_247896854721_wide-296f1dff6bfb57c86f4a243d1cfb6fb450edfba5.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_itsallpolitics_2015_10_15_448949248_juli-n-castro-endorses-hillary-clinton_1540243629.html","title":"HUD Secretary Julián Castro Endorses Hillary Clinton","title_page":"HUD Secretary Julián Castro Endorses Hillary Clinton : It's All Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"HUD Secretary Julián Castro Endorses Hillary Clinton\nEnlarge this image toggle caption Pablo Martinez Monsivais/AP Pablo Martinez Monsivais/AP\nClinton-Castro 2016?\nJulián Castro endorsed Hillary Clinton on Thursday. The secretary of Housing and Urban Development is the second Obama Cabinet official to endorse Clinton — even as Vice President Biden is still considering getting in the race. (Agriculture Secretary Tom Vilsack also endorsed Clinton earlier this year.)\nCastro would likely be on the vice-presidential short lists for whomever wins the Democratic nomination.\n\"I am really going to look hard at him for anything, because that is how good he is,\" Clinton said in Texas when asked by Javier Palomarez, president and CEO of the United States Hispanic Chamber of Commerce, if Castro would make a good vice president.\nThis summer, Castro said he was flattered by talk that he could be vice president. On MSNBC Thursday, he demurred, \"Oh, I doubt that will happen.\"\nThe endorsement comes the same day as a \"Latinos for Hillary\" rally in San Antonio, Texas, the city where Castro launched his political career and was a popular mayor until joining the Obama administration.\nThe Castro endorsement is significant, though not necessarily surprising. His twin brother, Congressman Joaquin Castro, recently campaigned for Clinton in Iowa.\nCastro said on MSNBC that his endorsement of Clinton, despite Biden waiting in the wings, has more to do with his long relationship with the Clintons.\n\"I have tremendous respect for Vice President Biden, and I know that he's going to make a decision about whether to enter the race,\" Castro said. \"I believe that he would also make a fantastic president. My support of Secretary Clinton is based on a long relationship that Joaquin, and I have had with her as well as with former President Clinton. ... This is not something that's against another person. This is really an endorsement of her.\"","url":"https://www.npr.org/sections/itsallpolitics/2015/10/15/448949248/juli-n-castro-endorses-hillary-clinton"}
