{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:21:58","date_modify":"2018-10-30 18:21:58","date_publish":"2016-08-10 22:39:48","description":"The Huffington Post's Jason Linkins failed to debunk Breitbart News' argument that Khizr Khan is, in fact, an enthusiast for sharia law.","filename":"data/vaneerConsumption/HuffingtonPostAttemptstoDenyKhizrKhansShariaEnthusiasm.json","image_url":"https://media.breitbart.com/media/2016/08/khizr-khan-constitution-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_10__1540923718.html","title":"Huffington Post Attempts to Deny Khizr Khan's Sharia Enthusiasm","title_page":"Huffington Post Attempts to Deny Khizr Khan's Sharia Enthusiasm","title_rss":"NULL","source_domain":"breitbart.com","text":"The Huffington Post’s Jason Linkins attempts to debunk Paul Sperry’s argument that the Democrats’ anti-Trump sensation, Khizr Khan is, in fact, an enthusiast for sharia law.\nLinkins fails — as I will show — but a helpful editor has put the term “face-planted” in his headline (and “Donald Trump’s bootlickers” in the sub-head), perhaps in the hope that no one would read the article itself, or on the theory that brainwashed left-wing millennial readers are more impressed by Joe Biden-style trash-talk buffoonery than intellectual arguments. (We’ve returned the favor.)\nUnfortunately for Linkins, Khan is indicted by his own words.\nIn a 1983 journal article cited by Sperry, “Juristic Classification of Islamic Law,” Khan argued that all other legal institutions are subordinate to sharia law. “All other juridical works which have been written during more than thirteen centuries are very rich and indispensable, but they must always be subordinated to the Shari’ah and open to reconsideration by all Muslims,” he wrote.\nLinkins argues that Khan was “specifically limiting himself to a discussion of Islamic culture and law.” (Original emphasis.) How does he know? He does not. He merely asserts that conclusion after drawing different inferences from the same passages, arguing that Khan meant to say that other Islamic juridical works are subordinate to sharia, and that sharia trumps Islamic constitutions.\nThe article does not specifically discuss secular law — but in an Islamic state, secular law does not exist separate from sharia law. A footnote indicates that Khan wrote the article while in Saudi Arabia — a country that does not recognize any other law outside the sharia. Moreover, the article itself appeared in the Houston Journal of International Law, not a journal specifically devoted to Islamic law, which suggests that Khan intended to compare sharia to law in general, not just to discuss Islamic law.\nI reached Sperry, who is traveling this week and had not seen Linkins’s article. He added this observation, via e-mail:\nHuffPo maintains that Khan is not making any “value judgment” about Islamic law in “Juristic Classification of Islamic Law,” yet Khan deferred to and “GRATEFULLY acknowledged” notorious Muslim Brotherhood radical Said Ramadan’s extremist interpretation of Islamic law. [Original emphasis]\nGoing further, Linkins addresses Sperry’s take on a review by Khan of a book that was, in turn, compiled from an academic seminar on “Human Rights and Islam.” Linkins argues that merely because Khan was able to describe, in detail, a troubling Islamic argument about human rights and the status of women, does not necessarily mean that he himself subscribed to that view.\nSperry is “either unwilling or unable to make the necessary distinction between an argument that a reader notes has been convincingly made,and an argument to which a reader agrees,” Linkins claims. The view belongs to Dr. A.K. Brohi, a former Pakistani minister whose brutality Linkins attempts to excuse: “It’s really difficult to tell whether he actually devised the nutty policies of chopping off hands and the like, or merely tacitly accepted them to remain in his position,” Linkins argues.\nLinkins goes on to say that Khan did not praise the disturbing parts of Brohi’s argument — including the religious sanction of wife-beating — but merely the idea that human rights can only exist in the context of another “moral value system.”\nReached by email, Sperry notes:\nHuffPo attempts to argue that Khan was merely praising Brohi’s support for any “moral value system,” but in full context, Khan was speaking of “the contribution made by ISLAM.” HuffPo attempts to whitewash Khan’s support for Brohi as confined to this passage about “moral value system” and not to his advocacy for wife beating and amputations and other sharia punishments, which tellingly HuffPo completely glosses over. In fact, Khan expresses support for Brohi’s entire 20-page contribution to book on “Human Rights in Islam” by singling it out as “a HALLMARK in this book.” In other words, Khan does not find objection with anything in the Brohi chapter, not with his advocacy for wife-beating or the barbaric hadood punishments or any other interpretation by Brohi of human rights under shariah. On the contrary, Khan is arguing Brohi’s chapter stands out as the best in the book he is reviewing. [Original emphasis.]\nGiven that Khan found none of that objectionable, perhaps Donald Trump’s remark about Khan’s wife standing mute next to him on the stage at the Democratic National Convention was on the mark, though perhaps inappropriate in context.\nRegardless, Khan’s more recent statements leave his views on sharia ambivalent at best.\nHe subscribes to the ridiculous and frankly embarrassing argument that terrorism has “nothing to do with Islam,” as he told CNN.\nAnyone with a nonzero IQ knows that claim is false, yet it happens to be the governing policy of the Obama administration. It is also the core foreign policy dogma of Hillary Clinton’s presidential campaign, in whose service Khan deployed his son’s honorable story before making any of his feelings about Trump known to any nonpartisan audience.\nSecond, as far as Khan is concerned, “there is no sharia law.” He made that claim when given the opportunity by Anderson Cooper to refute suggestions, made at Breitbart.com and elsewhere, that Khan “wants to advance sharia law in the United States.” Khan also made the curious argument that the U.S. Constitution trumps sharia law — not because sharia law recognizes the supremacy of American law, but of 14th Amendment jurisprudence that prevents discrimination by gender.\nThat does not answer the question Sperry raises — what Linkins calls “the murky arguments of whether any nation’s constitutional law should be Sharia-compliant,” in Khan’s view. Sperry cites Khan’s own words, which Linkins cannot evade.\nThe answer is relevant, because Khan is being presented to the public as a constitutional expert, though he is wrong on the question of whether restricting Muslim immigration is constitutional. (It is, whether or not it is a reasonable policy.)\nThat is the policy question here, which Linkins avoids, instead claiming Breitbart cannot tolerate contrary facts (we do), and fantasizing about internal “schisms” at the company.\nPerhaps that is why Linkins fails to convince: he prefers merely to rant.","url":"https://www.breitbart.com/politics/2016/08/10/huffington-post-denies-khizr-khans-denialism/"}
