{"authors":[],"date_download":"2018-10-22 21:45:02","date_modify":"2018-10-22 21:45:02","date_publish":"2014-05-08 08:31:05","description":"Aleppo, the country's largest city and former commercial hub, is carved up into rebel-held and government-held areas .","filename":"data/vaneerConsumption/HugeExplosionRocksCarltonHotelinSyrianCityofAleppo.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/428306/140507-aleppo-explosion-mn-710_f3e592d41a6c4ac6fc04841f839538b4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_huge-explosion-rocks-carlton-hotel-syrian-city-aleppo-n100071_1540244702.html","title":"'Huge Explosion' Rocks Carlton Hotel in Syrian City of Aleppo","title_page":"'Huge Explosion' Rocks Carlton Hotel in Syrian City of Aleppo","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBEIRUT -- A \"huge explosion\" leveled a hotel in northern Syria that Bashar Assad's troops used as a military base, along with several other buildings in a government-held area, state television and activists reported.\nSyrian state television said the explosion struck on the edge of a contested neighborhood in Aleppo. The television report identified the hotel as the Carlton Hotel.\nA local activist group called the Sham News Network also reported the blast, saying that the Syrian president's troops were based in the hotel.\nAnother activist group, the Britain-based Syrian Observatory for Human Rights, said the explosion struck Aleppo's Old City, where rebels have been holed up from months. It said the rebels belonging to the Islamic Front group planted a huge amount of explosives in a tunnel they dug below the Carlton Hotel, detonating it remotely. It said the hotel was destroyed in the blast and that there were casualties among the troops.\nAleppo, the country's largest city and former commercial hub, is carved up into rebel-held and government-held areas since the rebels launched an offensive there in mid-2010, capturing territory along Syria's northern border with Turkey.\nIn recent months, government aircraft relentlessly has bombed rebel-held areas of the city and the opposition fighters have hit back, firing mortars into government-held areas. The rebels also have detonated car bombs in residential areas, killing dozens of people..\n- The Associated Press","url":"https://www.nbcnews.com/news/world/huge-explosion-rocks-carlton-hotel-syrian-city-aleppo-n100071"}
