{"authors":[],"date_download":"2018-10-23 00:36:53","date_modify":"2018-10-23 00:36:53","date_publish":"2016-01-28 14:40:26","description":"Senegal on Thursday hailed the discovery of offshore gas reserves estimated at 450 billion cubic metres as a game changer for the west African nation. US fir...","filename":"data/vaneerConsumption/HugegasreservesfoundoffSenegal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h07t-2vdWmEltwXfba0ce28e6329a23c6-529_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421081_Huge-gas-reserves-Senegal_1540255013.html","title":"Huge gas reserves found off Senegal","title_page":"Huge gas reserves found off Senegal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Huge gas reserves found off Senegal\nSenegal on Thursday hailed the discovery of offshore gas reserves estimated at 450 billion cubic metres as a game changer for the west African nation.\nUS firm Kosmos said its Guembeul-1 exploration well, located in the northern part of the Saint Louis Offshore Profond license area in Senegal, had made a \"significant gas discovery.\"\nThe company said it was a \"world class gas resource that extends into both Senegal and Mauritania.\"\nUS firm Kosmos said its Guembeul-1 exploration well, located in the northern part of the Saint Louis Offshore Profond license area in Senegal, had made a \"significant gas discovery\" ©Martin Bureau (AFP/File)\n\"This is the best news possible for our country,\" said Energy Minister Thierno Alas sane Sall on state television.\nHe said this would allow Senegal \"to be self-sufficient in energy and also export gas to the rest of the world.\"\nDallas-based Kosmos Energy has since 2014 had exploration rights off Senegal.\nThe government said it was \"the biggest gas reserve in west Africa\" in an offshore area shared between Senegal and Mauritania.\nKosmos said it had signed agreements with the national oil companies of Senegal and Mauritania to jointly develop the offshore field.","url":"https://www.dailymail.co.uk/wires/afp/article-3421081/Huge-gas-reserves-Senegal.html"}
