{"authors":["Jo Scrimshire For Daily Mail Australia"],"date_download":"2018-10-22 20:51:55","date_modify":"2018-10-22 20:51:55","date_publish":"2016-01-28 04:27:22","description":"The Wolverine star, 47, has spoken about the 2016 Oscar nominations - which controversially featured only white actors - saying the boycotts have started a 'great conversation' in Hollywood","filename":"data/vaneerConsumption/HughJackmantalksaboutlackofdiversityinOscars2016nominations.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/04/30A6A3D300000578-0-image-a-32_1453954743673.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420325_Hugh-Jackman-talks-lack-diversity-2016-Oscar-nominations_1540241515.html","title":"Hugh Jackman talks about lack of diversity in Oscars 2016 nominations","title_page":"Hugh Jackman talks about lack of diversity in Oscars 2016 nominations | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He famously hosted the Academy Awards ceremony back in 2009.\nBut Hugh Jackman didn't hold back from addressing the lack of racial diversity among this year's Oscar nominations - which controversially featured only white actors.\nDuring an interview with People, the Wolverine star, 47, said that the backlash and high-profile boycotts have started a 'great conversation' about race in Hollywood.\n'It's a great conversation to have': Hugh Jackman, 47, pictured at the Oscars in 2013, claims the backlash following this year's all white acting nominees has started a 'great conversation' about race in Hollywood\nThe 47-year-old Wolverine star, pictured hosting the Oscars in 2009, received a Best Actor nod for his role as Jean Valjean in Les Misérables in 2013\nHe also told the publication that while he personally voted for some African-Americans, he still didn't immediately realise the problem of lack of diversity among the Oscar nominees.\nThe Sydney-born actor said: 'When the nominations came out, it never flagged in my head that this was an issue. And that gave me pause later when it came up.'\nHugh, who received a Best Actor nod for his role as Jean Valjean in Les Misérables in 2013, went on to say that diversity 'is something we need to talk about'.\nSee more of the latest news on the Oscars 2016 racism row as celebrities call for a boycott\n'It never flagged in my head that this was an issue': Hugh, pictured in his Oscar-nominated performance in Les Misérables, claimed he didn't immediately realise a problem with lack of diversity among this year's nominees\nHe continued: 'Films are there to tell the stories of our time and so need to reflect the world, the real world. And so it's a great conversation to have.'\nHugh rose to fame playing the mutant Wolverine in the X-Men series of films, which began in 2000.\nHe is a voting member of the Academy and insisted in the interview that Hollywood is able to lead the way on important social issues, like racial and sexual diversity.\nCritically acclaimed: Hugh played the character of Jean Valjean in Les Misérables\nIn recent weeks, several A-list stars have announced plans to boycott the Oscars ceremony to protest the absence of minorities among the acting nominees.\nDo The Right Thing director Spike Lee, 58, along with Hollywood star Will Smith, 47, and his actress wife Jada Pinkett Smith, 44, will not be attending next month's event.\nFor a second year in a row, the Academy of Motion Picture Arts and Sciences nominated only white actors for the 20 available slots, causing an outcry.\nHosting duties: Hugh, pictured in 2009, is considered one of the better Oscars hosts of the 2000s","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420325/Hugh-Jackman-talks-lack-diversity-2016-Oscar-nominations.html"}
