{"authors":[],"date_download":"2018-10-22 21:51:02","date_modify":"2018-10-22 21:51:02","date_publish":"2014-06-06 19:27:46","description":"One of the rarest and priciest violins in the world was hidden away in a closet for decades, but it is now up for auction at Christie's.","filename":"data/vaneerConsumption/HuguetteClarksStradivariCouldFetchMillionsatAuction.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/493586/140606-kreutzer-stradivarius-1733_de7e35d197cba4c0b96c357c09200a31.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_huguette-clarks-stradivari-could-fetch-millions-auction-n124786_1540245062.html","title":"Huguette Clark's Stradivari Could Fetch Millions at Auction","title_page":"Huguette Clark's Stradivari Could Fetch Millions at Auction","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nOne of the rarest and priciest violins in the world was hidden away in a closet for decades, but it is now up for auction at Christie's, with bidding starting Friday.\n\"Our pre-sale estimate on this is $7.5 million to $10 million,\" said Kerry Keane, head musical instrument specialist at Christie's, who is hosting the sealed-bid auction. Bidding will go on until June 12.\nPart of why this violin is so valuable is its provenance. The violin was made in 1731 by Antonio, who is considered to be the greatest violin maker ever. His 600 surviving violins are highly sought after by collectors, giving them multimillion-dollar price tags.\nThe violin up for auction is known as the Kreutzer Stradivari, named for its first-known owner, Rodolphe Kreutzer.\nIf you learned to play the violin, you can likely thank Kreutzer, a French violinist and teacher, who penned the 42 Études, a commonly used foundation for teaching students to play the instrument.\nEventually, the violin came to be owned by Huguette Clark, a wealthy reclusive heiress. She received this pricey Stradivari from her parents, who were American royalty during the Gilded Age.\n\"There is a spectacular telegram that her parents sent her in Paris in 1920 that told her...when they were sailing and when they would be arriving in New York, and that her mother had just bought her, quote unquote, the most fabulous violin in the world,\" Keane said.\nThe violin is one of more than 400 items from the family collection that Christie's is auctioning. It was found in Clark's closet after collecting dust for decades, according to Keane.\nThis Stradivari is from his late period. \"What's important about his later works is that they're the ones that are consistently the most powerful for players tonally. It has this warm gutsy sound that they produce, and with great color and complexity for the musician,\" Keane said.\nTo ensure that the violin is the real deal, Christie's analyzed the ring growths in its wood, a process known as dendrochronology.\n\"We did a dendrochronology of it. It matches four Stradivaris from 1730 to 1734 made from the same tree. That is a great find. It's like a fingerprint,\" Keane said.\n-- Jennifer Schlesinger","url":"https://www.nbcnews.com/business/business-news/huguette-clarks-stradivari-could-fetch-millions-auction-n124786"}
