{"authors":["Pa Reporter"],"date_download":"2018-10-23 05:52:45","date_modify":"2018-10-23 05:52:45","date_publish":"2017-03-10 15:26:53","description":"Ahead of the weekend's Premier League action, Sportsmail will be providing you with all you need to know. Here is all the information you need for Hull's home game with Swansea.","filename":"data/vaneerConsumption/HullvsSwanseaTeamnewskickoffprobablelineups.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3DF3BFEB00000578-0-image-a-11_1489151235195.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300746_Hull-vs-Swansea-Team-news-kick-probable-line-ups_1540273965.html","title":"Hull vs Swansea: Team news, kick-off, probable line-ups","title_page":"Hull vs Swansea: Team news, kick-off, probable line-ups | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ahead of the weekend's Premier League action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats. Here is all the information you need for Hull's home game with Swansea.\nHull vs Swansea (Saturday - KCOM Stadium)\nTeam news\nHull\nHull defender Curtis Davies is back in contention for the home game against Premier League relegation rivals Swansea.\nDavies returned to full training this week after missing the last five games due to a hamstring injury and head coach Marco Silva must decide whether to recall him or stick with Harry Maguire and Andrea Ranocchia in central defence.\nDefender Curtis Davies is back in contention for the clash with Swansea\nMidfielder Evandro (calf) is still not available, while Michael Dawson (calf), Markus Henriksen (shoulder), Dieumerci Mbokani (hamstring) and Ryan Mason (fractured skull) are still out.\nProvisional squad: Jakupovic, Marshall, Robertson, Maguire, Ranocchia, Davies, Elabdellaoui, Huddlestone, N'Diaye, Clucas, Meyler, Grosicki, Elmohamady, Markovic, Niasse, Hernandez, Diomande, Maloney, Tymon.\nSwansea\nKyle Naughton will miss Swansea's Premier League relegation battle at Hull.\nThe former Tottenham right-back suffered a hamstring injury in last weekend's 3-2 victory over Burnley and is likely to be replaced by Angel Rangel.\nJefferson Montero (hamstring) and Ki Sung-yueng (knee) are set to return to the squad.\nProvisional squad: Fabianski, Rangel, Fernandez, Mawson, Olsson, Cork, Carroll, Fer, Narsingh, Sigurdsson, Llorente, Nordfeldt, Kingsley, Amat, Van der Hoorn, Britton, Fulton, Ayew, Routledge, Borja, McBurnie.\nDefender Kyle Naughton will miss the clash for Swansea after picking up a hamstring injury\nKey match stats (supplied by Opta)\nHull have beaten Swansea twice already this season, both by a 2-0 scoreline (in the Premier League and FA Cup).\nSwansea won their last Premier League game at the KCOM Stadium (1-0 in December 2014) but have since lost there in the League Cup and FA Cup.\nAbel Hernandez has scored in both meetings between these sides in all competitions this season.\nAll four goals Hull City have scored against the Swans this season have come in the final 15 minutes of games.\nGylfi Sigurdsson has already been in more league goals this season than any previous others\nSince Paul Clement was named Swansea City manager on January 3rd 2017, the Swans have won 15 points (W5 D0 L3) – three more points than they’d won in their 19 games beforehand in 2016-17 (12).\nHowever, Swansea have also conceded 15 goals in the Premier League since January 3rd – a tally only Bournemouth (21) have conceded more than.\nFernando Llorente has scored three goals in his last two Premier League appearances. The Spaniard hasn’t scored in three successive league appearances since 25th January 2014 for Juventus in Serie A.\nGylfi Sigurdsson has already been involved in more Premier League goals this season (18 – eight goals, 10 assists) than in any other previous PL campaign, while he’s already matched his tally of chances created from the entire 2015-16 season (57).\nSigurdsson has been involved in a goal in each of his last six Premier League appearances, scoring three and assisting four more in this run.\nThese two clubs have conceded the most goals in the final 30 minutes of Premier League matches this season: Hull City (28), Swansea City (27).","url":"https://www.dailymail.co.uk/sport/football/article-4300746/Hull-vs-Swansea-Team-news-kick-probable-line-ups.html"}
