{"authors":["Ryan O'Hare For Mailonline"],"date_download":"2018-10-22 23:40:46","date_modify":"2018-10-22 23:40:46","date_publish":"2016-01-29 12:01:46","description":"Analysis by scientists from the University of Colorado of burnt eggshell fragments indicates that ancient humans were cooking the bird's eggs, rather than them being wiped out by wildfires.","filename":"data/vaneerConsumption/HumanswipedoutancientAustraliandodobirdbyeatingitsgianteggs.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B1EB0600000578-0-image-a-62_1454071939400.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3422497_It-s-no-yolk-Humans-wiped-ancient-Australian-dodo-like-bird-feasting-giant-eggs_1540251646.html","title":"Humans wiped out ancient Australian dodo-bird by eating its giant eggs","title_page":"Humans wiped out ancient Australian dodo-bird by eating its giant eggs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A human hankering for eggs may have led to the extinction of a giant dodo-like bird in Australia almost 50,000 years ago.\nScientists have revealed that early humans developed a taste for roasting its huge eggs on their campfires, leading to the bird's demise.\nThe gigantic 500lb (227kg) flightless bird, known as Genyornis newtoni, stood 7ft (2 metres) tall and laid eggs roughly the size of a cantaloupe melon weighing 3.5lbs - heavier than an ostrich egg.\nA large flightless bird, known as Genyornis newtoni (illustrated), laid eggs roughly the size of a cantaloupe melon weighing 3.5lbs. Researchers believe the bird, which roamed the Outback the same time as megafauna including giant lizards and kangaroos, was helped towards extinction by humans eating its eggs\nNow, for the first time, researchers have found the first direct evidence our ancestors played in wiping them out.\nThe giant birds would have roamed the continent with a host of other extinct giants, including a 1,000 lb kangaroo, a two-tonne wombat, and a tortoise the size of a small car.\nA TASTE FOR ROASTED EGGS Genyornis newtoni was a gigantic flightless bird with tasty melon-sized eggs Genyornis newtoni was a gigantic flightless bird weighing 500lb (227kg) that stood 7ft (2 metres) tall. Its eggs were equally huge, believed to be the size of a cantaloupe melon and weighing 3.5lbs. Its demise coincides with the human colonisation of Australia, between 40,000 to 60,000 years ago.\nResearchers from the University of Colorado Boulder examined fragments of burnt egg shells to show humans were collecting and cooking the eggs, which would have caused numbers to plummet.\nAncient humans are thought to have reached Australia between 40,000 and 60,000 years ago. They're arrival coincided with the extinction of the majority of large species, more than 100lbs.\n'We consider this the first and only secure evidence that humans were directly preying on now-extinct Australian megafauna,' explained Professor Gifford Miller, a researcher in geological sciences at Boulder and lead author of the study.\n'We have documented these characteristically burned Genyornis eggshells at more than 200 sites across the continent.'\nThe egg fragments were found at 2,000 sites, primarily at sand dunes where the ancient birds nested, and none were found to be younger than about 45,000 years old.\nAnalysis confirmed the burnt shell fragments from more than 200 sites were caused by very hot campfires rather than wild fires and were no younger than about 47,000 years old.\nProfessor Miller added: 'We can't come up with a scenario that a wildfire could produce those tremendous gradients in heat.\n'We instead argue that the conditions are consistent with early humans harvesting Genyornis eggs, cooking them over fires, and then randomly discarding the eggshell fragments in and around their cooking fires.'\nScientists have debated whether climate change or human hunting lead to the demise of ancient megafauna in Australia and on other continents, including North America.\nAnalysis of burnt eggshell fragments (selection pictured) indicates that ancient humans were cooking the bird's eggs, rather than them being wiped out by wildfires\nThe gigantic Genyornis newtoni was like a cross between the stocky extinct dodo of Mauritius (left) and the emu (right), which still lives in Australia today\nDETERMINING THE BIRD'S DEMISE Researchers found egg fragments at 2,000 sites, none of which were found to be younger than 45,000 years old. Analysis confirmed the burnt shell fragments from more than 200 sites were caused by very hot camp-fires rather than wild fires and were no younger than about 47,000 years old. This indicates ancient humans were cooking the bird's eggs, rather than them being wiped out by wildfires. Although Australia suffered from continental drying from about 60,000 to 40,000 years ago, it is unlikely that it was strong enough to wipe out the bird and other megafauna, such as giant kangaroos and turtles the size of a car.\nProfessor Miller added that although Australia suffered continental drying from about 60,000 to 40,000 years ago, it likely wasn't strong enough to wipe out the megafauna.\nHe argued that humans arriving on the northern coast on rafts from Indonesian islands several hundred miles away were to blame.\n'We will never know the exact time window humans arrived on the continent,' continued Professor Miller.\n'But there is reliable evidence they were widely dispersed across the continent before 47,000 years ago.'\nFinding evidence of hunting in Australia is difficult as its megafauna are much older than New World megafauna and fossil bones are easily destroyed by the chemistry of Australian soils.\nHe added: 'In the Americas, early human predation on the giant animals in clear - stone spear heads are found embedded in mammoth bones, for example.\n'The lack of clear evidence regarding human predation on the Australia megafauna had, until now, been used to suggest no human-megafauna interactions occurred, despite evidence that most of the giant animals still roamed Australia when humans colonised the continent.'","url":"https://www.dailymail.co.uk/sciencetech/article-3422497/It-s-no-yolk-Humans-wiped-ancient-Australian-dodo-like-bird-feasting-giant-eggs.html"}
