{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 20:05:11","date_modify":"2018-10-30 20:05:11","date_publish":"2015-10-28 03:51:46","description":"Human Rights Watch has published a report blasting Malaysia's government for clamping down on free speech in order to silence critics.","filename":"data/vaneerConsumption/HumanRightsWatchMalaysiaCriminalizesPeacefulExpression.json","image_url":"https://media.breitbart.com/media/2015/10/repeal-malaysia-sedition-act-protest-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_10_27__1540929911.html","title":"Human Rights Watch: Malaysia Criminalizes ‘Peaceful Expression’","title_page":"Human Rights Watch: Malaysia Criminalizes ‘Peaceful Expression’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The New York-based Human Rights Watch has published a report blasting the Malaysian government for clamping down on free speech in order to silence critics.\nThe report cites Yap Swee Seng, former executive director of Suara Rakyat Malaysia, in saying that Malaysia’s leaders “are creating a culture of fear” throughout the country, where ambiguously-worded laws are arbitrarily enforced to stifle opposition to the government or the Muslim majority.\n“If you engage in any talk of public interest, the police may come to your house, you may be arrested, taken to the police station, remanded. Even members of Parliament are treated that way,” he said.\nLast November, Prime Minister Najib Razak reneged on a promise he had made to repeal Malaysia’s notorious Sedition Act, announcing instead that the law would “be strengthened and made more effective,” with “a special clause to protect the sanctity of Islam.”\n“Prime Minister Najib came to power with the promise he’ll be a reformer,” said Brad Adams, HRW’s Asia Director, “but when the political situation became complicated, he reversed his course.”\nThe 143-page report titled, “Creating a Culture of Fear: The Criminalization of Peaceful Expression in Malaysia” documents attacks on freedom of expression since the election of Najib in 2013, noting how the government has suppressed peaceful protests, blocked websites, and jailed opposition leaders and academics.\nAmong many examples of authoritarian heavy-handedness, the report notes how in August 2014, Parliamentarian Khalid Samad was charged with sedition “after he called for review of the powers of the Selangor State Islamic Religious Council,” which had confiscated Bibles from the Bible Society of Malaysia and defied the attorney general’s decision that they be returned.\nEarlier this year, officials twice arrested human rights lawyer Eric Paulsen on charges of sedition. His crime was having publicly accusing the government’s Malaysian Islamic Development Department of promoted extremism through its sermons.\nAnd editor-in-chief of the online news portal Malaysiakini, Steven Gan, said that his organization faces regular harassment. Once, he said, the site published a letter criticizing the government. “The police came and asked who wrote the letter, which was under pseudonym,” he said. “We protect identity to encourage free opinion. We refused to provide details. The police confiscated our computers.”\nNow, he said, “the police come in at least once a month. It has become routine really. Someone files a complaint and they want a statement.”\nThe report was timed to be released shortly prior to a major meeting of world leaders to take place in Kuala Lumpur on November 18, 2015. Along with other heads of state, U.S. President Barack Obama will travel to Malaysia’s capital to take part in the conference, which rights activists consider a prime opportunity to press for reform of Malaysia’s “draconian” censorship laws.\nFollow Thomas D. Williams on Twitter @tdwilliamsrome.","url":"https://www.breitbart.com/national-security/2015/10/27/human-rights-watch-malaysia-criminalizes-peaceful-expression/"}
