{"authors":[],"date_download":"2018-10-30 01:22:18","date_modify":"2018-10-30 01:22:18","date_publish":"2016-09-03 00:00:00","description":null,"filename":"data/vaneerConsumption/HumaforActingPresidentin2017.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_09_huma_for_acting_president_in_2017__comments_1540862538.html","title":"Huma for Acting President in 2017?","title_page":"Articles: Huma for Acting President in 2017?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Has anybody noticed that Huma Abedin, lifelong Muslim Brotherhood symp, is now the acting Democratic candidate for President? I'll bet the DNC knows it. Hillary's condition could be fatal if she has as stroke, or takes a little too much Coumadin, one of her prescribed medications. The public has been told almost nothing about the specifics of her condition. But medical people have looked at the evidence and at her photos, which look dangerous. August 29,2016 The media know the truth, which is why they are hotly trying to deny it. All of them, in unison. Donald Trump is dropping hints, which is what he does a lot of the time. So please, please look again at Hillary's actual photos, and at the known facts about her only day-and-night companion, Huma Abedin. If you don't, you're missing the biggest and most dangerous political drama of our time. I would begin by wondering whether bad news about Hillary's health is a... (Read Full Article)","url":"https://www.americanthinker.com/articles/2016/09/huma_for_acting_president_in_2017__comments.html"}
 eyes. The New York Times sure won't tell you the truth.\nWhen you see what medical people all over the world are seeing, it'll be plain as day.\nBecause of Hillary's evident incapacity, her close companion Huma Abedin may represent the biggest strategic deception since D-Day. This is not a joke.\nThe Muslim Brotherhood, called the Ikhwan, should be remembered as the Nazi-era \"Islamischer Broederbund\" founded in 1928, as a Hitlerite organization, headed by the Mufti of Jerusalem.\nHuma's mother Saleh is only a figurehead, who supposedly runs the \"non-profit UK charity\" that owns the family propaganda mag. The whole Abedin family has been on the take from \"The Institute for Muslim Minority Studies,\" including Huma and Mom.\nIn Islam women are less than nothing without a man, so the family charity front was almost certainly started by her father, who is now dead. TIMMS is nothing but the family business, running as a nonprofit charity in the UK, and fronting for the Ikhwan, which is headquartered in the Gulf, now that they can't operate in Cairo any more. President Sisi of Egypt is running a hot war against them in that country, and their biggest Jihad op may be happening in Washington, DC.\nHillary's illness and Huma's influence over the 2016 Democratic campaign can be seen on YouTube and on major conservative and anti-Jihad websites. Anybody can check the facts.\nFor Heaven's sake, open your eyes, before it's too late.\nMohammed the Prophet of Islam (PBUH!) was a great war deceiver. The first European epic was the Song of Roland, which has the famous line \"He (the Saracen) lied with every word he spoke.\"\nThat wasn't poetic invention, it told the plain truth about the Muslim invaders of Europe. Sun Tzu wrote that \"war is deception,\" and the war theology of Islam agrees wholeheartedly.\nIslam was a hyperactive war creed until the 1922, when Turkey abolished the Ottoman Caliphate under Kemal Ataturk. Before that, Muslim Jihadist campaigns periodically attacked Europe, China, India, Russia, North Africa and the Middle East with very great success.\nThe key to resisting Jihad was never just arms and fighters, but a strategic understanding of Islam's fundamental deception operations. This article is about what now looks like the most successful Jihadist deception in human history.\nIf that sentence makes no sense to you, please read it again. If your friends don't get it, ask them to read it again. If your political debating partners don't get it, dittos for them.\nCivilizations that survived Jihad since he 7th Century learned about deception ops as the key for survival. In war, survival is not just a matter of firepower, but of word power.\nHuma Abedin is now perhaps the single biggest influence on the Democratic Candidate for President of the United States -- without having to go through all the fuss of running for office.\nHillary is visibly disabled, as any honest doctor or nurse will tell you.\nWhen she is asleep or having one of her bad turns, there is only one person who controls access to her. That person is Huma Abedin, a lifelong indoctrinee of the Ikhwan, der Islamischer Broederbund of historical infamy. Founded in 1928 by the Mufti of Jerusalem, among other Muslim bigwigs, who just loved the idea of killing all the Jews in the world. This is two decades before Israel's War of Liberation, giving the lie to the liberal delusion that it all started with the Founding of Israel as a State.\nIn the year 2016 Ikhwan is identical to the 1928 edition, because believing Muslims are all Fundamentalists. They interpret their scriptures much more literally than James Fallows has ever dreamed of doing.\nThe truth about the Moobers is not some paranoid conspiracy theory. History has many real conspiracies. Hitler ran a world-conquering conspiracy, and so did Lenin and Stalin. There are political ideologies that spin off real conspiracies like a bad case of dandruff.\nLook it up political conspiracies in Wikipedia or other reliable sources.\nWhether Huma has ever developed into a modern person we simply do not know, because childhood indoctrination is extremely powerful. Huma is a lifelong indoctrinee of the Ikhwan, as proclaimed in the year 1928 by real Arab Nazophiles using the slogan:\n\"Our only goal is to die in the way of Allah.\"\nLike all of their words, you have to think two or three times before you get the double meanings. The doctrines of Jihad are rife with double meanings.\nIn Jihad jargon, \"dying in the way of Allah\" means only one important thing: Jihadist suicide-murder. As they keep demonstrating to unbelieving Western eyes, while we remain in deep denial.\nA few examples.\n9/11?\nSuicide murder on a mass scale.\nThe Paris Jihad murders?\nDitto.\nSan Bernardino?\nDitto.\nThe beach bombings in Nice, France?\nDitto.\nThe London Underground bombing?\nDitto.\nThe suicide-murder of Egypt's Presiden Anwar Sadat, for signing the first and only formal Peace Treaty with Israel?\nJihad ***means*** willful suicide murder of infidels and ex-Muslims to sizable numbers of people. If you just murder infidels it's not nearly as good as dying as a martyr ***while*** killing infidels and traitors. Allah gives double points for suicide-murders, because they show your sincerity. Fundamentalist Muslims often celebrate your murder-martyrdom with an official wedding ceremony, complete with candies for the neighbors. Symbolically, martyrs are married to Allah.\n(Simply killing yourself for Allah does not count. Suicide will take you straight to Hell. There is no more praiseworthy way to become Allah's beloved in Heaven, complete with an endless supply of nubile virgins, who will never grow old. Even seventy-two virgins get boring.\nAmericans should remember Jim Jones and Guyana. Think about knife-stabbing Jihad murderers in Jerusalem today. Think about Bushido warriors with razor-sharp swords, carefully honed to cut off human heads. Think Sioux braves charging into enemy villages to count coup on enemy braves.\nBut most of all, think about Huma and her lifelong indoctrinators, beginning with Mom and Dad Abedin.\n(Please see MEMRI.org for numerous television videos of early child indoctrination by Hamas and the peace-loving Pals).\nTo most of us, Huma Abedin looks like an attractive young woman with everything to live for. To Muslim Fundamentalists she is a Muslima first. Nothing else counts.\nCults are what they are. They are amazingly common. In the famous Stanford experiments, Stanford students were easily indoctrinated by authority figures, wearing a lab coat.\nEvery human generation produces a small crop of Jim Jones cults.\nIn Fundamentalist Islam young girls are condemned to death, to protect the family honor and prestige. They are considered whores and traitors. By dating the wrong boys they have betrayed the faith, and their fathers and brothers have only one duty, which is to kill their daughters.\nPlease keep in mind that this ***is*** the belief system Huma was raised in. In radical Islam young children receive indoctrination long before they can think for themselves. Kids have no mental defenses, and -- as the Jesuits used to say -- \"give me a child before age ten, and we will have him for life.\"\nThat is still true today, because our basic nature has not changed.\nIslam is a war cult, not an unusual thing in human history. Japanese Bushido was also a war cult, and they came very close to killing off our Pacific Fleet at Pearl Harbor on that terrible day. Our aircraft carriers happened to be away at sea, but our great battleships were sunk, while our sailors died in the thousands.\nLiberals specialize in highly selective memory, and they never, ever remember how close America came to total defeat on that day.\nMohammed the Prophet (PBUH!) was a great deceiver in war, which is how he managed to surprise and kill his enemies time and time again. Today the worldwide media constantly fall for the war term \"hudna,\" which they translate as \"peace.\" Poor, deluded idiots.\n\"Hudna\" doesn't mean peace, but a temporary truce, to give the aggressors time to recover and organize another surprise attack. It's standard tribal warfare, as shown by perhaps the most important anthropologist of our time, Napoleon Chagnon. Chagnon is mandatory reading for intelligent adults. You will never understand human war and violence if you don't look him up, at least, on the web.\nBut back to Hillary and Huma.\nOn the fateful night of September 11, 2012, the appointed night for the Jihadist attack on our Benghazi facility, it may have been Huma Abedin, Hillary's personal companion, who made the decision not to wake her up.\nSince we now know that the Moobers were directly involved in the Benghazi murders, it is conceivable that Huma had prior warnings from President Morsi of Egypt, head of the MB's at that time.\nThe US Embassy compound in Cairo, Egypt, was also attacked on the same day, and the New York Times featured an amazingly well-timed front-page photo, showing the black flag of El Qaeda flying over part of the Embassy compound.\nYou can't just storm the US Embassy in Cairo without the active collusion of the regime, who were run by the Moobers at that time. Similarly, you can't order the cops on the beat in Benghazi, to run off in the days before 9/11/12, without the active collusion of whichever Libyan gang was in charge in Benghazi.\nWhich turned out, by some miracle, to be AQAM, Al Qaeda in the Maghreb, another Sunni terrorist gang just like the Moobers.\nWhat a coincidence. Two Sunni terror attacks on the same day, September 11, 2012, on two different US diplomatic compounds, one in Cairo, Egypt (then run by Mohammed Morsi, the head Moobster), and another simultaneous assault to murder our Ambassador to Libya, who just happened to be in Benghazi on September 11 of that year. Just before the second Obama election. The age of miracles is not over.\nDouble attacks at the same time are a war signature of Al Qaeda, as every American citizen should know by now. On September 11, 2001, Saudi-trained jihadists murderers butchered civilian US cabin personnel and pilots on American and United Airlines airplanes, and flew those giant jet planes with amazing precision into the Twin Towers and the Pentagon.\nIt's two terror targets every time.\nNow Hillary's health crisis may go back before September of 2012, the day of the Benghazi assault, just before Obama's second election.\nThat night, when the In Extremis alarm came into State (mandatory for any violent assault on US Flag Officers or diplomats), Huma might have told the SecState protective detail that her boss had to sleep, for fear of aggravating her medical problem. That alert should have arrived at the White House, the Pentagon, and State within three minutes of the AQAM-Moober attack in Benghazi, and maybe the Embassy attack in Cairo.\nSome senior official on duty may have called the White House, but Obama apparently wasn't answering the phone either.\nAnother coincidence? Maybe.\nSo they made up an incompetent lie for the media, and repeated it, all in unison, the way they always do. This is SOP for Obama, and they've practiced it thousands of times, long before September 11, 2012.\nIf our honest media somehow proclaim Hillary as the winner of the coming debates with Donald Trump, and if millions of our fellow Americans can raise their dead eyes to vote for her, Huma Abedin may well become the de facto Acting President of the United States in January of 2017. If Huma turns out to be a good and loyal American, can you imagine the blackmail material the Moobers have on her, her mother, and of course, on Tony the Wiener, former husband of Huma?\nThis not a movie.\nIt's not fiction.\nThis is real.","url":"https://www.americanthinker.com/articles/2016/09/huma_for_acting_president_in_2017_.html"}
