{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:21:31","date_modify":"2018-10-30 21:21:31","date_publish":"2016-02-25 13:54:39","description":"Israel's head of Military Intelligence warned that deteriorating conditions in Gaza endanger Israel's security amid threats by Hamas of more violence","filename":"data/vaneerConsumption/HumanitarianConditionsisGazaThreatenIsraelsSecurity.json","image_url":"https://media.breitbart.com/media/2016/02/tunnel.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_02_25__1540934491.html","title":"Humanitarian Conditions is Gaza Threaten Israel's Security","title_page":"Military Intelligence Chief: Humanitarian Conditions is Gaza Threaten Israel's Security","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Israel’s head of Military Intelligence warned that deteriorating conditions in Gaza endanger Israel’s security amid threats by members of Hamas that another outbreak of violence is on the horizon if an exit route isn’t provided, Ynet reported.\nAt a meeting with members of the Knesset Foreign Affairs and Defense Committee, Military Intelligence Chief Herzl Halevi said Wednesday that “the humanitarian situation in the Gaza Strip is deteriorating, and if it explodes, it will explode on Israel.”\nHowever, Halevi stressed that, despite what it may say, Hamas isn’t interested in a war with Israel at this time. The terror group is actively preventing other jihadist groups from firing rockets from the Strip.\nHalevi added that “the Palestinians are doing everything they can in order to press Israel unilaterally and internationally – through the UN Security Council and the French initiative – to impose a political solution upon Israel.”\nGeneral Halevi told the committee that he agrees with the UN assessment that the Gaza Strip will be uninhabitable by 2020 if the humanitarian situation doesn’t improve.\nOne of Turkey’s conditions for restoring ties with Israel is to establish a seaport in Gaza, something that Hamas says is a legitimate right of Palestinians.\nKnesset Member Issawi Frej (Meretz) said,\nThe Head of Military Intelligence is trying to pull the heads of the cabinet members out of the sand. They are hiding like ostriches in order to keep from dealing with the truth. His starting statement was that Palestinian youths are committing terror attacks because they have nothing left to lose, and stated that without a political process, the scope of terror will widen.\nHe continued,\nWhen he spoke of the dangerous consequences of poverty in Gaza, Halevi was one of the only people who spoke the truth. Instead of ignoring or shooting the messenger, it is worth it for the prime minister and his cabinet to internalize that the truth won’t change if they ignore the facts. As long as Israel continues to refuse dialogue and continues to make Gazan lives difficult, the violence directed at Israel will only increase.\nMeanwhile Knesset Member Merav Michaeli, who is also a member of the Knesset Foreign Affairs and Defense Committee, vouched for Halevi, saying, “This isn’t a political opinion; it is a professional stance which is based on reality. The fact that Netanyahu and his ministers don’t like the reality doesn’t give him the authority to lash out at the heads of the IDF and the security establishment.”","url":"https://www.breitbart.com/middle-east/2016/02/25/military-intelligence-chief-humanitarian-conditions-gaza-threaten-israels-security/"}
