{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:34:17","date_modify":"2018-10-30 20:34:17","date_publish":"2015-02-12 05:59:28","description":"Journalists in post-Gaddafi Libya are being threatened and even murdered \"with impunity\" for doing their job, according to a report by HRW.","filename":"data/vaneerConsumption/HumanRightsGroupJournalistsTargetedWithImpunityinPostGaddafiLibya.json","image_url":"https://media.breitbart.com/media/2015/02/journalists-kidnapped-Libya-rally-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_11__1540931657.html","title":"Human Rights Group: Journalists Targeted ‘With Impunity’ in Post-Gaddafi Libya","title_page":"Human Rights Group: Journalists Targeted ‘With Impunity’ in Post-Gaddafi Libya | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Journalists in post-Gaddafi Libya are being threatened and even murdered “with impunity” for doing their job, according to a report by the New York-based Human Rights Watch (HRW).\nThe 54-page report, titled “War on the Media: Journalists under Attack in Libya,” was posted online and physically released in Tunisia on Monday.\n“Various armed groups in Libya have violently attacked, kidnapped, intimidated, threatened, and killed Libyan journalists with impunity over the past two years, causing many to flee the country or impose self-censorship,” said HRW in summarizing the report.\nJournalists have resorted to “self-censorship” to avoid attacks and some have abandoned the country.\n“The climate of impunity has allowed militias to assault, threaten, kidnap, or even kill journalists because of their reporting or views,” said Joe Stork, the deputy director of Middle East and North Africa affairs at HRW.\n“This is a very dangerous time to be a journalist in Libya,” he later added. “Too many journalists in post-Gaddafi Libya face a situation where saying what you think can get you killed.”\nHRW documented “at least 91 cases of threats and assaults against journalists, including against at least 14 female journalists and media workers” between mid-2012 and November 2014.\n“This figure includes 30 cases of kidnappings or short-term arbitrary detentions of journalists, mainly by militias, and eight killings of reporters,” said the organization in the report.\nThe human rights group “also documented 26 cases of armed attacks against the offices of television and radio stations.”\nJournalists were among the “250 people in seemingly targeted killings in the eastern cities of Derna and Benghazi alone between January and September 2014.”\nOther victims include judges, members of the security forces, sheikhs, and activists.\nWhile “courts are prosecuting people, including journalists, for speech-related offenses,” HRW noted, “authorities failed to hold anyone accountable for attacks on journalists and media outlets since 2012.”\nMany of the journalists who were attacked were prominent critics of Islamic extremists, the organization pointed out.\nHRW reported that media outlets blossomed and enjoyed limited freedoms immediately after Muammar Gaddafi’s demise in 2011.\n“Libyan journalists started to report the news, express opinions, and criticize politicians like never before,” it mentioned. “In the first year after the 2011 uprising, private newspapers and magazines proliferated in a climate of newly found freedom.”\n“However this flourishing media now finds its new freedoms under threat as heavily armed militias have brought the post-Gaddafi state to its knees. Key institutions, including the judiciary, police and army, have collapsed in some major cities including Benghazi and Derna,” HRW added. “Officials are powerless to maintain security, or to apprehend or prosecute those who commit crimes, including murders and assassinations. Militia members have benefited from near immunity against prosecution since 2011, and very few cases have gone to court.”\nU.S.-backed militias toppled Gaddafi in October 2011.\nSince then, conflict has engulfed the country as rival governments and powerful militias battle each other for territory.\nThe Islamic State and al-Qaeda maintain a presence in the North African country.\n“The elected government of Libya as well as non-state actors and members of militias are bound by international law obligations to protect journalists, as much as they are bound to protect civilians, during armed conflicts,” proclaimed HRW in the report.","url":"https://www.breitbart.com/national-security/2015/02/11/human-rights-group-journalists-targeted-with-impunity-in-post-gaddafi-libya/"}
