{"authors":["Ben Nagle For Mailonline"],"date_download":"2018-10-23 03:37:56","date_modify":"2018-10-23 03:37:56","date_publish":"2017-03-10 13:17:42","description":"Mats Hummels headed to Twitter to take the Mkhi out of his former team-mate on Friday, giving him some stick after yet another Goal of the Month prize. 'Do they even nominate other players,' he wrote.","filename":"data/vaneerConsumption/HummelsabusesMkhitaryanafterGoaloftheMonthwin.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/045F9B8F000003E8-0-image-a-29_1489151572159.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301210_Hummels-abuses-Mkhitaryan-Goal-Month-win_1540265876.html","title":"Hummels abuses Mkhitaryan after Goal of the Month win","title_page":"Hummels abuses Mkhitaryan after Goal of the Month win | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mats Hummels headed to Twitter to take the Mkhi out of his former team-mate on Friday, giving him some stick after yet another Goal of the Month prize.\nHenrikh Mkhitaryan scooped Manchester United's title for February, but he could not get away with it without receiving some light-hearted abuse from a friend.\nReplying to Mkhitaryan's tweet, Hummels wrote: 'Come on, it's like the 8th time you win this.\nMats Hummels sent a tweet to Henrikh Mkhitaryan after his February Goal of the Month win\nMkhitaryan scooped the award after scoring United's first goal against Leicester last month\n.@HenrikhMkh's super strike v Leicester has been voted our Goal of the Month for February! pic.twitter.com/P2ul3wXkR3 — Manchester United (@ManUtd) March 9, 2017\n'Do they even nominate other players or do you just decide which goal you want to win with?'\nMkhitaryan's latest gong comes after a stunning solo goal in the 3-0 victory at Leicester back on February 5.\nThe midfielder started a flurry of goals either side of half-time when he rounded Robert Huth before sprinting towards goal and firing past Kasper Schmeichel.\nUnited went on to win 3-0, as Zlatan Ibrahimovic and Juan Mata secured the three points\nHummels played with Mkhitaryan at Dortmund for three years before his move to Bayern\nMkhitaryan beat off stiff competition from both United's senior side and youth teams to win the Goal of the Month.\nBoth of Zlatan Ibrahimovic's EFL Cup final goals were included, as well as Juan Mata's strike against Leicester and another of Mkhitaryan's goals - this time against Saint-Etienne.\nHummels and Mkhitaryan are good friends after their time together at Dortmund, when they played together for three years.","url":"https://www.dailymail.co.uk/sport/football/article-4301210/Hummels-abuses-Mkhitaryan-Goal-Month-win.html"}
