{"authors":["Flora Drury For Mailonline"],"date_download":"2018-10-23 03:19:28","date_modify":"2018-10-23 03:19:28","date_publish":"2016-01-29 18:11:17","description":"The BBC radio DJ, who died aged 74 on January 9 after suffering a stroke, was laid to rest at St Peter's Church in Bournemouth, Dorset, in front of a host of celebrity friends.","filename":"data/vaneerConsumption/HundredsofmournerscelebrateEdStewpotStewartatfuneral.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4BE9500000578-0-image-a-2_1454091566532.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423231_One-cry-Crackerjack-Hundreds-mourners-celebrate-beloved-children-s-TV-host-Stewpot-catchphrase-funeral_1540264768.html","title":"Hundreds of mourners celebrate Ed 'Stewpot' Stewart at funeral","title_page":"Hundreds of mourners celebrate Ed 'Stewpot' Stewart at funeral | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mourners let out one last cry of 'It's Crackerjack' as they said goodbye to the beloved children's television host, DJ Ed 'Stewpot' Stewart.\nThe BBC radio DJ, who died on January 9 after suffering a stroke, was laid to rest at St Peter's Church in Bournemouth, Dorset, on Friday afternoon.\nThe church was packed with hundreds of mourners, including celebrities like Mike Read, Carry On actress Anita Harris, Bobby Davro, John Virgo and DJ Adrian Juste.\nScroll down for video\nThe coffin of beloved DJ Ed 'Stewpot' Stewart is carried into the church in Bournemouth on Friday afternoon\nThe former Crackerjack presenter's funeral was attended by hundreds, including celebrities like Mike Reid\nAnita Harris and her husband Mike Margolis also attended the service, during which mourners called out the presenter's catchphrase, 'It's Friday, it's five to five, it's Crackerjack!'\nOnce seated, Mark Carolan, the husband of Stewart's daughter Francesca, led the mourners with a rendition of the presenter's catchphrase: 'It's Friday, it's five to five, it's Crackerjack!'\nHe added: 'Simple words that many millions remember him by, but a select few remember him for so much more than that, how positive he was about everything in life.'\nReading a eulogy from the family, Mr Carolan added: 'You are a true legend, your legacy will live on, your passion and love now lives on through all your grandchildren.'\nThere was also a valediction by the Grand Order of the Water Rats - an entertainment industry fraternity - of which Stewart was a member.\nThe service began with the song Morningtown Ride by The Seekers and ended with the congregation singing You'll Never Walk Alone.\nAnd, in a final tribute to the former DJ, someone called out Stewart's signature sign-off, 'Byeee!' as the coffin was carried out.\nBobby Davro and Vicky Wright at the funeral of the grandfather-of-four, described as a 'true legend'\nThere was also a valediction by the Grand Order of the Water Rats - an entertainment industry fraternity - of which Stewart was a member during the funeral\nStewart, pictured with a friend in 2007, recently appeared in a Christmas edition of Junior Choice for BBC Radio 2 in 2015\nStewart, here at Westminster Children's Hospital with Tony Wallace of Battersea and Micolino Santoro for the television programme he was recording, hosted Crackerjack from 1973 to 1979\nStewart with models (from left) Dawn Luther, Sally White, Alison Norfolk, Diana O'neill, Carole Bell and Rachel Buchan in a shot taken during the height of his fame in 1975\nStewart was one of the first presenters on Radio 1 when it was launched in 1967. The following year, he began presenting children's show Junior Choice, which became his trademark radio show.\nOn television, Devon-born Stewart was best known for children's favourite Crackerjack. He hosted the show from 1973 to 1979.\nMost recently, Stewart presented a Christmas edition of Junior Choice for BBC Radio 2 in 2015 and was credited with discovering Noel Edmonds.\nOn hearing of his death, Edmonds tweeted: 'In '67 Ed Stewart heard a DJ audition tape, liked it, passed it to Kenny Everett and my career was born. Stewpot I owe you everything xN'\nThe order of service from today's service highlighted Stewart's long career in broadcast\nStewart, radio and television presenter, pictured with his wife, Chiara and their nine-day-old son Marco in 1977. The couple also had a daughter together, but divorced in 2005","url":"https://www.dailymail.co.uk/news/article-3423231/One-cry-Crackerjack-Hundreds-mourners-celebrate-beloved-children-s-TV-host-Stewpot-catchphrase-funeral.html"}
