{"authors":["Jack Tonhaben"],"date_download":"2018-10-30 21:16:55","date_modify":"2018-10-30 21:16:55","date_publish":"2016-04-07 14:44:15","description":"Europe is flooded with hundreds of jihadists ready to strike at Western targets on European soil, Israeli Defense Minister Moshe Ya'alon said.","filename":"data/vaneerConsumption/HundredsofJihadistsToHitEurope.json","image_url":"https://media.breitbart.com/media/2016/04/Moshee.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_04_07__1540934215.html","title":"'Hundreds of Jihadists' To Hit Europe","title_page":"Israeli Defense Minister - 'Hundreds of Jihadists' To Hit Europe","title_rss":"NULL","source_domain":"breitbart.com","text":"JERUSALEM – Europe is flooded with hundreds of jihadists ready to strike, Israeli Defense Minister Moshe Ya’alon (pictured) said on Wednesday.\nSpeaking at a press conference with his Polish counterpart Antoni Macierewicz, who is visiting Israel, Ya’alon warned, “What we saw in Paris and Brussels is only the beginning, and efforts to carry out terror attacks in Europe will continue.”\nYa’alon and Macierewicz discussed the security situation in the Middle East and how it affects Europe, as well as ways to increase defense cooperation between Israel and Poland.\nCooperation between Israel and Poland, Ya’alon told Macierewicz, will benefit both countries. Ya’alon said that Israel “regrettably” has a lot of experience dealing with terrorism, but added that the Jewish state was willing to share the knowledge and technology it has developed to face this threat over the years.\nSpeaking of the civil war in Syria, Ya’alon told Macierewicz that Israel “did not expect there to be stability and an end to the bloodshed” anytime soon.\n“In the war there, there are many conflicting interests and too many players in the arena. Some of these players, the global jihad organizations for example, are determined to continue fighting,” Ya’alon said.\nOn Thursday, Israel and security agencies around the world significantly increased security measures at airports, tourist attractions, and seaports where Israeli cruise ships dock ahead of the holiday of Passover.\nThe move comes in the wake of the Israeli defense establishment’s assessment that terrorist groups will try to strike at Jewish and Israeli targets.\nChabad Houses around the world were briefed on how to prepare for any scenario and to use local security forces ahead of Passover, when the movement’s community centers in many countries hold massive Passover Seder rituals for Israeli backpackers and hikers.\nOver the past few weeks, Israeli security officials visited several locations in Europe and discussed means of increasing security and preventing any attempt by hostile elements to carry out attacks against Jews and Israelis.\nA travel warning issued at the end of March for Turkey remains in force, and Israel’s Counterterrorism Bureau still believes terror groups, especially the Islamic State, will try to attack synagogues in Turkey, especially in major cities like Ankara and Istanbul.","url":"https://www.breitbart.com/middle-east/2016/04/07/israeli-defense-minister-says-hundreds-of-jihadists-ready-to-attack-european-targets/"}
