{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 20:45:42","date_modify":"2018-10-30 20:45:42","date_publish":"2015-06-29 15:35:59","description":"The population of Spain has dropped for the third year in a row as hundreds of thousands leave to look for work elsewhere. But although the government has |","filename":"data/vaneerConsumption/HundredsofThousandsAbandonSpaintoLookforWorkElsewhere.json","image_url":"https://media.breitbart.com/media/2015/06/GettyImages-459819668-1024x683.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_06_29__1540932342.html","title":"Hundreds of Thousands Abandon Spain to Look for Work Elsewhere","title_page":"Hundreds of Thousands Abandon Spain to Look for Work Elsewhere | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The population of Spain has dropped for the third year in a row as hundreds of thousands leave to look for work elsewhere. But although the government has admitted to the population drop, groups representing Spanish migrants have accused it of drastically underplaying the scale of Spanish emigration for political reasons.\nSpain is currently struggling with an unemployment rate of 24.8 per cent, the highest in the European Union after Greece. Although Spain’s economy has rallied a little, growing 1.4 per cent in the last year, it has had little effect on the employment figures, prompting both Spanish citizens and migrants living in Spain to head abroad in search of work, The Local has reported.\nConsequently, according to official figures from the National lnstitute of Statistics, a net total of 102,309 people left Spain last year, bringing the total Spanish population to 46,439,864 as of 1st January 2015, or a net reduction in population after accounting for birth and death rates of -0.16 percent. This represents a slowdown in the population decline – it decreased by -0.46 per cent in 2013.\nThe vast majority of those leaving were not Spanish nationals but were immigrants, mostly from Ecuador and Morocco. Nearly 40,000 Ecuadorians left Spain, equivalent to 18.5 per cent of the resident population, while close to 32,000 Moroccans followed suit.\nThe largest immigrant population in Spain are Romanians, of whom 707,000 live across the country and nearly 21,000 left Spain in 2014. Britons are the country’s third highest immigrant population; of the 304,000 Brits living in Spain’s sunny climes, a net 6,276 decided to relocate.\nThe Institute has also reported that 78,785 Spanish nationals emigrated in 2014, 50,249 of whom were born in Spain. At the same time, 41,278 Spanish nationals immigrate, 19,638 of whom were born in Spain.\nHowever, organisations representing Spanish nationals abroad have questioned those figures, accusing the government of downplaying the numbers. One group, Marea Granate, says it believes that the true number is ten times higher.\nIt has compiled data on the number of Spaniards who registered with social security systems in just 12 other countries last year, and says that that figure alone came to 89,209, higher than the total for all emigration by Spanish nationals given in the official figures.\nMarea Granate has said that in the UK alone, 50,260 Spaniards registered for a National Insurance number in 2014, whereas the official figures record just 9,797 Spanish nationals coming to the UK.\nSimilar discrepancies in the statistics for Germany means that the Institute has “lost” more than 16,000 Spaniards who headed there last year.\n“The Popular Party government constantly minimizes the actual emigration figures,” the group has said. “The Spanish Government is well aware of the numbers of migrants and their magnitude.\n“We denounce the actions of the government in continuing to deliberately hide the numbers of people forced to leave.”","url":"https://www.breitbart.com/europe/2015/06/29/hundreds-of-thousands-abandon-spain-to-look-for-work-elsewhere/"}
