{"authors":[],"date_download":"2018-10-30 17:51:48","date_modify":"2018-10-30 17:51:48","date_publish":"2018-07-14 18:18:00","description":"Hundreds of job seekers attended a UPS job fair Saturday, applying for part-time positions as package handlers.","filename":"data/vaneerConsumption/HundredsattendUPSjobfairfornewAtlantahub.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/09/Videos/4434685.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_ups-holds-job-fair-for-new-hub-westside-atlanta__1540921908.html","title":"Hundreds attend UPS job fair for new Atlanta hub","title_page":"Hundreds attend UPS job fair for new Atlanta hub","title_rss":"NULL","source_domain":"ajc.com","text":"Hundreds of job seekers attended a UPS job fair Saturday seeking work as part-time package handlers at a new regional UPS hub to open on the westside of Atlanta.\nAbout 400 people pre-registered for the job fair at the Andrew & Walter Young Family YMCA, and more came as walk-ins. The job fair was scheduled to run through 3 p.m. Saturday.\nPhyllis McKenzie of Lithia Springs said she went to the job fair “seeking better job opportunities, and of course more money.”\nUPS is hiring 2,500 to 3,000 workers for the facility, including part-time package handlers that start at $10.35 an hour. The part-time jobs come with healthcare benefits, eligibility for a pension and up to $25,000 in tuition assistance.\nUPS partnered with United Way of Greater Atlanta’s High Demand Career Initiative to organize the job fair. The event was hosted by Fulton County commissioner Natalie Hall, whose district includes the Fulton Industrial Boulevard area where the new UPS facility is located.\n“It is going to change the whole face of the area,” Hall said. “This is going to kick off economic development that we need.”\nThe 1.2 million square foot facility will be able to process 100,000 packages per hour, and will be UPS’s second-largest ground hub in the United States.\nThe next UPS job fair will be Tuesday, Sept. 11 at the Rosel Fan Recreation Center.\nUPS is partnering with nonprofits including United Way to reach more people about the jobs and help tackle challenges for job seekers such as child care issues and transportation.\n“It’s a very complicated world out there for people trying to get jobs,” said Helen Slaven, a director for United Way’s High Demand Career Initiative. “There are significant barriers to people getting jobs.”\nMany job seekers don’t have access to a computer, said Africa Roberson, workforce development manager for the Center for Working Families, who organized the job fair. Mobile units at the job fairs have computers for people to fill out job applications.\n“When they come, the goal is for them to leave feeling empowered,” Roberson said.","url":"https://www.ajc.com/business/ups-holds-job-fair-for-new-hub-westside-atlanta/GZf3qGij0WKG8IYqO5pXDJ/"}
