{"authors":[],"date_download":"2018-10-22 22:06:22","date_modify":"2018-10-22 22:06:22","date_publish":"2014-06-03 17:31:41","description":"The first U.S. airport to open a let’s-get-the-party-started liquor store now also has an on-site clinic that offers help for hangovers.","filename":"data/vaneerConsumption/HungoverVegasAirportMedicalClinicCanHelp.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/484876/140603-las-vegas-sign-1441_3d6f5ce118fcd4b02497f6f074ecaa63.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_hungover-vegas-airport-medical-clinic-can-help-n121456_1540245982.html","title":"Hungover? Vegas Airport Medical Clinic Can Help","title_page":"Hungover? Vegas Airport Medical Clinic Can Help","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe first U.S. airport to open a let’s-get-the-party-started liquor store in the baggage claim area now has an on-site clinic that can help travelers recover from too much drinking.\nThe new McCarran Medical Clinic and Pharmacy at McCarran International Airport in Las Vegas is staffed daily by a doctor and a physician’s assistant and has a drugstore stocked with travel-sized health and convenience items. A full-service pharmacy opens on June 9.\n“We’re an urgent care center in the airport,” David Inman, the clinic’s owner and co-manager told CNBC. “If you’re feeling bad, we can make you feel better.”\nLocated pre-security in Terminal 1, the clinic’s target market includes the airport’s 15,000 employees and the 42 million national and international travelers who pass through McCarran — the country’s ninth busiest airport — each year.\n“We have a remedy to help people with hangovers. We can give you oxygen and an IV that includes some Vitamin B product, along with anti-nausea medication.”\nSome travelers arrive at the airport feeling under the weather after a long flight, said Inman. Others may need a flu shot, a travel immunization or a replacement for a prescription left at home. And, since this is Las Vegas, there may likely be a fair number of travelers feeling a little woozy as they head home following a night of partying.\n“We have a remedy to help people with hangovers,” said McCarran Medical Clinic co-manager Stan Wasserkrug. “We can give you oxygen and an IV that includes some Vitamin B product, along with anti-nausea medication.”\nFor those who have been indulging in excessive drinking, “there’s only so much we can do,” said Wasserkrug, “We’re urgent care, not a miracle cure. But we can help.”\nThere are health centers at Chicago’s O’Hare International Airport and in terminals at the San Francisco and Nashville airports, but the McCarran airport clinic claims to be the only one offering medical, pharmacy and over-the-counter services inside an airport.\nAnd while an IV filled with hangover relief isn’t the main treatment offered by McCarran’s clinic, it may turn out to be one of the more popular procedures. Beyond the heavy drinking that accompanies many “What Happens Here, Stays Here” Vegas visits, a recent study found that more alcohol is sold to passengers flying into Sin City than to any other city in the continental U.S.\nToronto-based GuestLogix, which supplies airlines with technology for in-flight payment systems, looked at in-flight sales figures for beverage, food and comfort items (such as pillows and in-flight entertainment) on five major U.S. airlines between November 2013 and February 2014.\nDuring that time, beverage sales (liquor, beer and wine) made up about 58 percent, or about $43.6 million, of all in-flight sales, with flights to Las Vegas bringing in close to $2.7 million, or about $93 per flight. Elsewhere in the continental U.S., the average for on-board sales of alcoholic beverages was $58 per flight during the period studied, according to Ilia Kostov, executive vice president, Global Sales & Product Strategy for GuestLogix.\nLong-haul flights to destinations such as Hawaii and the resort areas of Mexico and the Caribbean have higher sales per flight, in part because the planes are larger and the flights longer, said Kostov. “But a lot of people go to Las Vegas for leisure and there’s a lot of consumption on those flights.”\nGuestLogix reviews in-flight sales numbers every six months and found that, year over year, the sale of alcoholic beverages has gone up 5 percent, Kostov said.\nThat may be good for the airlines’ bottom lines, but worrisome for those concerned about the increased number of flight disruptions caused by unruly passengers.\nIn 2012, members of the International Air Transport Association, the trade group for most of the world’s airlines, voluntarily reported more than 5,200 incidents of unruly behavior by passengers. In 2013 that number exceeded 8,000.\n“Intoxication, often resulting from alcohol already consumed before boarding, ranks high among factors linked to these incidents,” IATA said in a statement issued this week at IATA’s annual general meeting in Doha, Qatar, where the group unanimously passed a resolution calling on governments and industry to work together to “effectively deter and manage the significant problem of unruly air passenger behavior.”","url":"https://www.nbcnews.com/business/travel/hungover-vegas-airport-medical-clinic-can-help-n121456"}
