{"authors":["Associated Press"],"date_download":"2018-10-23 01:46:59","date_modify":"2018-10-23 01:46:59","date_publish":"2016-01-28 16:17:39","description":"BUDAPEST, Hungary (AP) — A Hungarian court on Thursday acquitted 15 employees of a company whose burst reservoir in 2010 flooded three towns with toxic red s...","filename":"data/vaneerConsumption/Hungariancourtacquits15chargedin2010sludgefloodcase.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:3adbd468daec4629842c7c6e93072225-4vVdYopwYQ7f641721b07af0e587-891_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421026_Hungarian-court-acquits-15-charged-2010-sludge-flood-case_1540259219.html","title":"Hungarian court acquits 15 charged in 2010 sludge flood case","title_page":"Hungarian court acquits 15 charged in 2010 sludge flood case | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hungarian court acquits 15 charged in 2010 sludge flood case\nBUDAPEST, Hungary (AP) — A Hungarian court on Thursday acquitted 15 employees of a company whose burst reservoir in 2010 flooded three towns with toxic red sludge, killing 10 people.\nA court in the city of Veszprem said the spill, Hungary's worst environmental disaster, had been caused by the collapse of a reservoir wall due to \"loss of stability originating in the subsoil,\" Hungarian state media reported.\nThe court said that couldn't have been foreseen by the executives or employees of MAL, the Hungarian Aluminum Production and Trade company.\nFILE - In this Oct. 10, 2010 file photo a Hungarian firefighter wearing protective mask and clothing stands guard at the red sludge reservoir, where a rupture caused deadly sludge flood in Kolontar, Hungary. A Hungarian court has acquitted 15 employees of a company whose burst reservoir flooded three towns with toxic red sludge, killing 10 people in 2010 as it was reported by a Hungarian state media, Thursday, Jan. 28, 2016. (AP Photo/Bela Szandelszky, file)\nThe spilled sludge was a highly caustic waste product of aluminum production. More than 1 million cubic meters (35.3 million cubic feet) of the material poured out of the huge reservoir in minutes, flooding the western Hungarian villages of Kolontar, Devecser and Somlovasarhely. The sludge even reached the Danube River through tributaries, but was sufficiently diluted by then to avoid causing major damage.\nHundreds of people were evacuated. The houses most affected by the sludge flood were later demolished and entire neighborhoods were relocated and rebuilt.\nThe verdict cleared the accused of all criminal charges, including reckless public endangerment and violating waste management regulations, but the judge said it wouldn't affect lawsuits filed against MAL.\nEnvironmental groups and political parties said they were dismayed by the verdict.\n\"There is still no one responsible for the 2010 sludge flood,\" Greenpeace said in a statement. \"However, it is obvious that human negligence led to the catastrophe\" both on the part of MAL and the authorities in charge of permitting and overseeing the company's activities.\nThe governing Fidesz party said the court's decision was \"appalling\" and said that while it respected the court's independence, it wanted prosecutors to appeal the verdict. Opposition parties also criticized the ruling.\nFILE - The Oct. 8, 2010 file photo shows an aerial view of rescue team members crossing a pontoon-bridge replacing the original bridge washed away by a sludge flood in Kolontar, 167 kms southwest of Budapest, Hungary. A Hungarian court has acquitted 15 employees of a company whose burst reservoir flooded three towns with toxic red sludge, killing 10 people in 2010 as it was reported by a Hungarian state media, Thursday, Jan. 28, 2016. (Balazs Mohai/MTI via AP, file)","url":"https://www.dailymail.co.uk/wires/ap/article-3421026/Hungarian-court-acquits-15-charged-2010-sludge-flood-case.html"}
