{"authors":[],"date_download":"2018-10-22 20:55:06","date_modify":"2018-10-22 20:55:06","date_publish":"2014-06-03 16:28:48","description":"Thailand's military rulers are monitoring a new form of silent resistance to the coup — a three-fingered salute borrowed from \"The Hunger Games.\"","filename":"data/vaneerConsumption/HungerGamesSaluteEmergesasSymbolofResistanceinThailand.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/484531/thailand-hunger-games_d02f148903d131360356c2b32619cfa8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_hunger-games-salute-emerges-symbol-resistance-thailand-n121381_1540241706.html","title":"'Hunger Games' Salute Emerges as Symbol of Resistance in Thailand","title_page":"'Hunger Games' Salute Emerges as Symbol of Resistance in Thailand","title_rss":"NULL","source_domain":"nbcnews.com","text":"Protesters have varying explanations for what the symbol means. Some say it stands for the French Revolution's trinity of values: liberty, equality, fraternity. Others say it means freedom, election and democracy. A photo montage circulating online paired a picture from the science-fiction blockbuster \"The Hunger Games\" with a graphic of three fingers labeled, 1. No Coup, 2. Liberty, 3. Democracy.\nIn the movie series and the book trilogy it is based on, the salute is a symbol of rebellion against totalitarian rule and stands for: Thank you, Admiration and Goodbye to someone you love.\nDespite the warning to protesters, the junta offered a reprieve to the country's vital tourism industry. It lifted the military's curfew at three popular beach resorts — Phuket, Koh Samui and Pattaya — to ease the impact of the May 22 coup on tourists.\nA midnight-to-4 a.m. curfew remained in effect for the rest of the country, including Bangkok, where the raised arm salute was unveiled over the weekend.\n\"At this point we are monitoring the movement,\" Col. Weerachon Sukhondhapatipak, a spokesman for the junta, said. \"If it is an obvious form of resistance, then we have to control it so it doesn't cause any disorder in the country.\"\n—The Associated Press","url":"https://www.nbcnews.com/news/world/hunger-games-salute-emerges-symbol-resistance-thailand-n121381"}
