{"authors":["Carolyn De Lorenzo"],"date_download":"2018-10-31 01:51:32","date_modify":"2018-10-31 01:51:32","date_publish":"2018-08-27 16:39:17","description":"Long droughts in Central Europe this past summer have revealed some pretty creepy ancient relics. Record-breaking temperatures mean that water levels have seriously dropped throughout the drought-affected regions, and as a result, “hunger stones”…","filename":"data/vaneerConsumption/HungerStonesInTheCzechRepublicAreResurfacingBecauseOfDroughtTheyHaveAVeryCreepyHistoricalMessage.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/7e91cb24-228e-4270-996d-c24aeddee55e-getty-1013235472.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_hunger-stones-in-the-czech-republic-are-resurfacing-because-of-drought-they-have-a-very-creepy-historical-message-10244957_1540950692.html","title":"“Hunger Stones” In The Czech Republic Are Resurfacing Because Of Drought, & They Have A Very Creepy Historical Message","title_page":"“Hunger Stones” In The Czech Republic Are Resurfacing Because Of Drought, & They Have A Very Creepy Historical Message","title_rss":"NULL","source_domain":"bustle.com","text":"Long droughts in Central Europe this past summer have revealed some pretty creepy ancient relics. Record-breaking temperatures mean that water levels have seriously dropped throughout the drought-affected regions, and as a result, “hunger stones” from the 1600s have resurfaced in the Czech Republic's Elbe River. According to the Associated Press (AP), the stones, which date from 1616 or earlier, serve as a warning to prepare for the potential impact of major droughts. NPR reports that one of the stones on the Elbe River banks is inscribed with the words, \"Wenn du mich siehst, dann weine,\" which translates to \"If you see me, weep.\"\nThe AP further reports that more than a dozen of the super creepy hunger stones are now visible in the northern Czech town of Decin on the border of Germany, signaling alarmingly low water levels like those associated with severe droughts of the past. The Washington Post reports that one of the boulders dates back to 1616, and is considered the oldest method for measuring water levels Central Europe.\nNPR notes that a team of researchers wrote about the stone in a 2013 paper about the history of droughts in the Czech Republic. Researchers described the stone as declaring that “drought had brought a bad harvest, lack of food, high prices, and hunger for poor people.” The stone is also reported to record a number of severe droughts — all dating back before 1900, with the earliest inscription recording a severe drought in 1417.\nIt’s worth noting that, according to NPR, the hunger stones are seen more often now because of a dam on a tributary of the Elbe River, though the current water levels are still unusually low. NPR further states that droughts throughout Europe have increased in the past few years, and climate scientists warn that, even though not as severe as some droughts throughout the last 250 years, the current cycle of European droughts are linked to record-breaking heat waves.\nThe Guardian reports that unusually high temperatures are hurting crops throughout northern and central regions in Europe. Swedish farmers have seen only about 12 percent of the typical seasonal rainfall this past summer season. States of emergency have also been declared in Latvia and Lithuania, while crops have reportedly failed throughout the summer in the Netherlands, Poland, Belarus, and the Czech Republic. The World Meteorological Organization reports that these trends line up with rising global temperatures associated with climate change.\nThe Guardian further states that the European Drought Observatory (EDO) describes the current drought trend as “an extensive and severe anomaly,” and recommends that farmers take steps to adapt to warmer climates. The EDO also recommends switching out to crops better suited to higher temperatures, while aiming to use water more efficiently overall. The Guardian also notes that farmers who have invested in irrigation and diversified their crop varieties are better able to withstand the effects of rising temperatures. But farmers with less access to irrigation, and who also rely on one crop variety for income, are harder hit by the effects of climate change. The EDO is encouraging water suppliers to prepare “sustainable adaptation measures towards an increase in drought frequency and intensity in the future,” The Guardian further reports.\nDire warnings aside, there's no doubt that the effects of climate change are severe. But crop adaptation, and more sustainable agricultural and watering practices, might hold the key to helping us cope with these changes moving forward.","url":"https://www.bustle.com/p/hunger-stones-in-the-czech-republic-are-resurfacing-because-of-drought-they-have-a-very-creepy-historical-message-10244957"}
