{"authors":["Associated Press"],"date_download":"2018-10-23 01:30:53","date_modify":"2018-10-23 01:30:53","date_publish":"2017-04-26 11:55:25","description":"BRUSSELS (AP) - Hungary's prime minister on Wednesday dismissed concerns about his country's new higher education law after the European Union launched legal...","filename":"data/vaneerConsumption/HungarypremierdismissesuniversityfearasEUtakesaction.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/19/wire-467075-1493230266-805_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447264_EU-takes-legal-action-new-Hungarian-education-law_1540258253.html","title":"Hungary premier dismisses university fear as EU takes action","title_page":"Hungary premier dismisses university fear as EU takes action | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BRUSSELS (AP) - Hungary's prime minister on Wednesday dismissed concerns about his country's new higher education law after the European Union launched legal action amid fears the legislation is aimed at shutting down a university founded by billionaire philanthropist George Soros.\nWhile insisting that Hungary remains committed to the European project, Viktor Orban also launched a stinging attack on Soros, branding him \"an open enemy of the euro\" single currency who wants to open Europe's floodgates to a million migrants a year.\nEarlier, European Commission Vice President Valdis Dombrovskis said that the EU's executive arm has sent a \"letter of formal notice\" to Orban's government, which is a first step in legal action, over the education law approved earlier this month.\nHungarian Prime Minister Viktor Orban speaks during a plenary session at the European Parliament in Brussels on Wednesday, April 26, 2017. The European Union has launched legal action against Hungary over a new higher education law that critics say is aimed at shutting down a university founded by billionaire philanthropist George Soros. (AP Photo/Virginia Mayo)\nThe commission believes it could infringe on European rights to provide services, but also rights regarding academic freedom and the right to an education.\nThe Hungarian government has one month to respond, and based on Budapest's reaction, the European Commission will consider what steps to take next.\nThe president of the Soros-backed Central European University, Michael Ignatieff, says it means that his campus in Budapest \"has a gun pointed to its head\" and might not be able to accept new students after Jan. 1.\nBut speaking to EU lawmakers in Brussels, Orban said the law is only a \"minor amendment\", and that it applies to 28 universities, with the aim of introducing uniform rules, closing loopholes, introducing transparency and ending privileges.\nOrban has said the CEU is \"cheating\" because it issues diplomas accepted both in the U.S. and in Hungary, where it has been operating since 1993. The university is accredited in New York state but has no campus there. Orban says this gives it an unfair advantage over other Hungarian universities, but has denied that he wants to shut it down.\nIn a statement from Budapest, the CEU welcomed the legal action as confirmation of its belief that the law \"is discriminatory and runs counter to European values.\"\nIgnatieff said he hopes the move \"will lead the Hungarian government toward rapid negotiations so that we can resolve this matter.\"\nEuropean Commission First Vice President Frans Timmermans described the CEU as a \"pearl in the crown of post-divided Europe, of a Europe free and whole.\"\n\"The only thing the Central European University is asking is to be left alone, to do what it does well,\" he said.\nHe also criticized a new asylum law in Hungary, saying that it too \"raises serious doubts about compatibility with EU law\" and vowing to the lawmakers that \"the commission will not hesitate to take further action\" if necessary.\nOrban, meanwhile, said that Soros and nongovernmental organizations that he funds \"want to let 1 million migrants into the European Union every year. This is his publicly declared program and he offers financial loans to back this up.\"\nIndeed, the university dispute is part of a wider Hungarian government campaign against Soros. Orban claims Soros is undermining Hungarian interests because of his support for migrants.\nAbout 400,000 people crossed through Hungary in 2015, before Orban, determined to stop more from coming, built razor-wire border fences.\n\"The refugees issue is the reason why we are in strong confrontation with the commission, I suppose the majority of the parliament and Mr. Soros and his whole NGO empire,\" Orban told reporters after the debate in parliament. \"At the core of this whole disagreement is the migration issue.\"\nLiberal group leader Guy Verhofstadt accused Orban of harassing NGOs, trying to muzzle the media and now looking to close a university, and said to the Hungarian leader: \"How far will you go? What is the next thing, burning books?\"\nOrban said that despite the disputes, Hungary had no intention of exiting the EU, citing 70 percent support among Hungarians for EU membership.\n\"We come from 40 years of communist dictatorship and this is the land of freedom,\" Orban said. \"We could hardly wait to get here and don't have the slightest intention of leaving.\"\n___\nPablo Gorondi reported from Budapest, Hungary.\nHungarian Prime Minister Viktor Orban speaks during a plenary session at the European Parliament in Brussels on Wednesday, April 26, 2017. The European Union has launched legal action against Hungary over a new higher education law that critics say is aimed at shutting down a university founded by billionaire philanthropist George Soros. (AP Photo/Virginia Mayo)\nEuropean Commission Vice-President Frans Timmermans speaks during a plenary session at the European Parliament in Brussels on Wednesday, April 26, 2017. The European Union has launched legal action against Hungary over a new higher education law that critics say is aimed at shutting down a university founded by billionaire philanthropist George Soros. (AP Photo/Virginia Mayo)\nHungarian Prime Minister Viktor Orban arrives for a plenary session at the European Parliament in Brussels on Wednesday, April 26, 2017. The European Union has launched legal action against Hungary over a new higher education law that critics say is aimed at shutting down a university founded by billionaire philanthropist George Soros. (AP Photo/Virginia Mayo)\nHungarian Prime Minister Viktor Orban, center, arrives for a plenary session at the European Parliament in Brussels on Wednesday, April 26, 2017. The European Union has launched legal action against Hungary over a new higher education law that critics say is aimed at shutting down a university founded by billionaire philanthropist George Soros. (AP Photo/Virginia Mayo)","url":"https://www.dailymail.co.uk/wires/ap/article-4447264/EU-takes-legal-action-new-Hungarian-education-law.html"}
