{"authors":["Nick Hallett"],"date_download":"2018-10-30 19:32:47","date_modify":"2018-10-30 19:32:47","date_publish":"2015-11-13 09:55:33","description":"Hungarian Prime Minister Viktor Orbán has said his country and three other Eastern European nations will send 300 border guards to Greece to help stop the massive influx of migrants currently entering Europe.","filename":"data/vaneerConsumption/HungarysOrbnToSend300BorderPoliceToGreece.json","image_url":"https://media.breitbart.com/media/2015/11/GettyImages-4884782121.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_11_13__1540927967.html","title":"Hungary's Orbán To Send 300 Border Police To Greece","title_page":"Hungary's Orbán To Send 300 Border Police To Greece","title_rss":"NULL","source_domain":"breitbart.com","text":"Hungarian Prime Minister Viktor Orbán has said his country and three other Eastern European nations will send 300 border guards to Greece to help stop the massive influx of migrants currently entering Europe.\nSpeaking at the European migration summit in Valetta, Malta, Mr Orbán told Hungarian state TV that the so-called “Visegrad Group” (V4) of nations – Hungary, Poland, Czech Republic and Slovakia – were sending the guards “in the interests of stopping the refugee wave at the southern borders of Greece.”\nAlthough he did not specify exactly what the guards will do in Greece, he did comment on how Greek captains had stemmed the flow when they refused to transport migrants from Greek islands to the mainland.\nMr Orbán said the European Union (EU) has no will to fight the migrant invasion, and added that a Greek ferry strike last week had been more effective in stopping the migrants than anything European leaders had done, AP reports.\nMeanwhile, Mr Orban’s chief of staff, Janos Lazar, he also said that Hungary had approved just two out of 4,848 asylum requests since closing its border with Serbia in September.\nAs of Sunday, Mr Lazar said, 3,592 requests were still pending, 326 had been rejected and 928 were terminated because the asylum seekers had already move on to another country.\nEU and African leaders are meeting in Malta to discuss the ongoing migrant crisis, the worst since the end of the Second World War.\nThe Hungarian Prime Minister, who has taken an uncompromising stance in securing his country’s borders, has seen his popularity rise thanks to his efforts to stop the migrant flow.\nHis Fidesz party has seen its polling rating rise by four per cent since the installation of the razor-wire fence, solidifying its core vote and attracting around 300,000 swing voters.\nAustria has previously likened Mr Orbán’s policies to the Nazis, but many Hungarians appear not too worried about such criticism. Margit Tamas, a retired nurse, told Reuters: “The measures tackling the migration crisis were very positive.”","url":"https://www.breitbart.com/europe/2015/11/13/hungarys-orban-send-300-border-police-greece/"}
