{"authors":["John J. Xenakis"],"date_download":"2018-10-30 22:02:02","date_modify":"2018-10-30 22:02:02","date_publish":"2015-09-05 13:35:36","description":"After weeks of chaos, Hungary appears to be giving in to the flood of migrants.","filename":"data/vaneerConsumption/HungaryAppearstobeGivingintotheFloodofMigrants.json","image_url":"https://media.breitbart.com/media/2015/09/ap_ap-photo211-1024x628.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_09_05__1540936922.html","title":"Hungary Appears to be Giving in to the Flood of Migrants","title_page":"Hungary Appears to be Giving in to the Flood of Migrants","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nAfter weeks of chaos, Hungary appears to be giving in to the flood of migrants\nHungary’s PM Viktor Orbán: Muslim migrants threaten Europe’s Christian identity\nAustria agrees to allow migrants to pass through Austria\nAfter weeks of chaos, Hungary appears to be giving in to the flood of migrants\nHundreds of migrants traveling on foot\nThere are potentially millions of refugees from Syria, Iraq and Afghanistan who are trying to reach Europe, especially Germany, along a route that goes through Turkey, then through Greece, then through Macedonia, then Serbia, then Hungary, then Austria, and then Germany. There are men, women and children, including whole families. They’re traveling by whatever means are available — walking, buses, trains, or hitchhiking.\nQuite honestly, I have been (and am) puzzled by Hungary’s actions during the last few weeks. Everyone seems to agree that none of the migrants want to stay in Hungary; they all want to pass through, on their way to Germany or Sweden. So the easy solution for Hungary, I would guess, would be to do what Greece, Macedonia and Serbia have been doing — let them into the country, and provide ferries, buses and trains to get the out of the country as quickly as possible, so that the migrants become someone else’s problem.\nInstead, Hungary has been doing everything possible to impede the migrants’ travel during the last two weeks, including the following:\nHungary has placed razor-wire fencing all along the southern border with Serbia. However, migrants have been cutting holes in the fencing and passing through.\nMigrants have been arriving in Budapest, in north-central Hungary, usually by train. From there they buy a ticket for the train that travels west to Vienna, Austria. However, Austria discontinued all international train travel (to Austria) without proper papers, and even ticket-holders weren’t allowed to board trains.\nThousands of migrants were crowded around Budapest’s train station, getting angrier and angrier. Finally, Hungary let some of them on the train going west. But it was a trick. After the train traveled 20 miles west, the train stopped in the town of Bicske, and the migrants were herded out of the train into a nearby refugee camp.\nThe migrants climbed fences and left the refugee camps, and started walking along the railroad tracks to Vienna.\nHaving been trapped in Budapest for over five days, migrants from both Budapest and Bicske started walking along the M1 motorway, the main highway from Budapest to Vienna, about 200 miles. Police didn’t try to stop them, but warned them that traveling along the highway at night was dangerous because it was pitch black, and there were no lights along the highway. They were warned to wear white tee shirts so that they would be visible in headlights.\nAlong the M1 motorway, ordinary Hungarian citizens were offering food and water to the walking migrants.\nFinally, on Friday, Hungary’s government gave in, and is providing buses that will take the migrants to the town of Hegyeshalom, on the border with Austria, although there was no guarantee that they would be able to enter Austria.\nIt appears that, slowly but surely, Hungary is moving in the direction of taking the path of least resistance — just let the thousands of migrants pass through Hungary unimpeded, into Austria, and then let Austria deal with them. Hungary Today\nHungary’s PM Viktor Orbán: Muslim migrants threaten Europe’s Christian identity\nAccording to Hungary’s prime minister Viktor Orbán, Germany is responsible for the “mess” in Budapest, because Germany’s Chancellor Angela Merkel has offered to settle 800,000 migrants this year. According to Orbán, this announcement encourages thousands more migrants to attempt to reach Germany. According to Orbán, the current “Grand Migration” has unlimited supply and sooner or later, we could find that “we’ve become the minority on our own continent.”\nIn an article written on Thursday, he said:\nWe must not forget that those who are coming in have been brought up under a different religion and represent a profoundly different culture. The majority are not Christians but Muslims. That is an important question because Europe and European culture have Christian roots. Or is it not already, and in itself, alarming that Europe’s Christian culture is barely able to uphold Europe’s own Christian values? … The people want us to control the situation and protect our borders. Only when we have protected our borders can we ask questions about the numbers of people we can take in, or whether there should be quotas. [It is] pretty depressing that, aside from Hungary — or the Spaniards — no one wants to protect the borders of Europe.\nAngela Merkel responded:\nTo the extent that we have in mind Christian values, then I think it is important that the dignity of every human being … be protected everywhere it is in danger. … [On the asylum issue], Germany is doing what is morally and legally required, nothing more or less, [and the international refugee convention] is not only valid in Germany but in each European (Union) member state.\nIn Brussels, EU President Donald Tusk also reacted to the article, saying that “for me Christianity in public and social life means a duty to our brothers in need. Referring to Christianity in a public debate on migration must mean the humanity to our brothers … (and) readiness to show solidarity.” Hungary Today and AFP\nAustria agrees to allow migrants to pass through Austria\nSeveral hours after Hungarian officials announced that buses would transport thousands of migrants to Hegyeshalom, on the Austrian border, Austria’s Ministry of the Interior published a statement:\nVienna (OTS) – Hundreds of refugees are currently underway on foot from Hungary towards Austria. Police and Red Cross are prepared for the arrival of refugees. Every refugee in Austria can apply for asylum…. Each application for asylum is individually subjected to a procedural test. In according with EU and Austrian law, the validity of the application for asylum in Austria is checked under Dublin Regulations, and possibly the applicant will be transferred back to the relevant Member state. In the event that there is no protection in Austria, coercive police measures may be carried out, but only in the light of proportionality. … For the Austrian security authorities, what stands above all is to prevent human tragedies. The ultimate goal is therefore the maintenance of security and order. It’s further important that people seeking medicines or humanitarian care need to be treated immediately. The police officers will work closely with relevant charities. It also aims to prevent people falling into the hands of unscrupulous traffickers. A solution of the current situation can only be ensured in the spirit of European solidarity.\nThis talk of “procedural tests” and “coercive police measures” implies to me that the Austria will now face exactly the same chaos next week that Hungary dealt with during the last two weeks. Austria’s Interior Ministry (Translation)\nKEYS: Generational Dynamics, Hungary, Viktor Orbán, Budapest, Greece, Macedonia, Serbia, Austria, Vienna, Bicske, Hegyeshalom, Germany, Angela Merkel, Donald Tusk\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/09/05/world-view-after-weeks-of-chaos-hungary-appears-to-be-giving-in-to-the-flood-of-migrants/"}
