{"authors":["Oliver Jj Lane"],"date_download":"2018-10-30 21:56:53","date_modify":"2018-10-30 21:56:53","date_publish":"2016-03-16 17:58:11","description":"In speeches on Hungary's National Day, Viktor Orbán lashed out at European leaders for inviting the \"destruction of Europe\" by causing the migrant crisis.","filename":"data/vaneerConsumption/HungarianLeaderOrbanBlamesEUForMigrantCrisisForeseesTheDestructionOfEurope.json","image_url":"https://media.breitbart.com/media/2016/03/GettyImages-515689396.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_03_16__1540936613.html","title":"Hungarian Leader Orban Blames EU For Migrant Crisis, Foresees The 'Destruction Of Europe'","title_page":"Hungarian Leader Orban Blames EU For Migrant Crisis, Foresees The 'Destruction Of Europe'","title_rss":"NULL","source_domain":"breitbart.com","text":"In speeches on Hungary’s National Day, prime minister Viktor Orbán has lashed out at European leaders for inviting the “destruction of Europe” by causing the migrant crisis and has rejected European Union (EU) plans to resolve the situation.\nWarning “Europe will be destroyed”, Mr. Orbán said in Budapest yesterday he wanted to prevent further incidents of “gangs chasing our women”, especially in his own Hungary. Anti-mass migration political movements across Europe have been galvanised by the images and stories coming out of German cities like Cologne over New Year’s Eve, and his remarks reflect a preoccupation with preventing further sexual assault by migrant gangs.\nFalling short of actually naming Germany in his Hungarian National Day speech, Mr. Orbán criticised the “incorrigible fighter for human rights” who blindly welcomed migrants to Europe and who in turn brought “crime and terror” to the continent, reports Nachricten. Calling for unity among European peoples, while making a carefully worded attack on the cloistered leaders of the EU, Mr. Orbán said:\n“We are calling every citizen of Hungary and every nation of Europe into unity, regardless of political affiliation. Europe’s leaders and citizens cannot live in two separate worlds any-more, we must restore the unity of Europe. The people of Europe cannot be free on their own, if we are not free together.\n“If we stand together, we will succeed. Divided we will fall… The future of Europe is at stake. ‘Shall we be slaves, or men set free?’, that is the question”.\nIn another speech Mr. Orbán didn’t pull his punches on the EU, accusing it of threatening the very existence of European nations. Speaking on Tuesday, he said the EU was to blame for the migrant crisis and was working to create a “United States of Europe” that would inevitably “swallow up member states”.\nThe speed with which they were moving toward this goal meant it was now “time to ring alarm bells and gather allies” to stop the plans.\nAlthough Hungary, like many Eastern European states remains broadly in favour of the EU continuing to exist because of the large subsidies they receive from the political bloc, Mr. Orbán’s comments make it clear he believes in a strong change of direction, away from Euro federalism and unlimited mass migration.\nIndeed, he remarked yesterday: “If we want to stop the mass migration, we must first put the brakes on Brussels”, reports Politico.\nBreitbart London has reported at length on Viktor Orbán’s often outspoken criticism of the EU and on his own policies which have made Hungary one of the nations safest from the migrant crisis in Europe, despite lying directly on the migratory route from the Balkans into the heart of the continent.\nAfter completing the national border fence and seeing illegal migrants fall from 10,000 a day to just a couple of dozen, Mr. Orbán declared a national referendum on the EU’s migrant policies.\nThe vote, due to place this year is the first of its kind in Europe, and Mr. Orbán said it would be a major test of European democracy. Speaking of the disappointment with the top-down EU control which triggered his decision to launch the vote, he said:\n“Nobody has asked the European people so far whether they support, accept, or reject the mandatory migrant quotas… The government is responding to public sentiment now: we Hungarians think introducing resettlement quotas for migrants without the backing of the people equals an abuse of power”.","url":"https://www.breitbart.com/europe/2016/03/16/hungarian-leader-orban-blames-eu-for-migrant-crisis-foresees-the-destruction-of-europe/"}
