{"authors":["Chriss W. Street"],"date_download":"2018-10-30 22:11:38","date_modify":"2018-10-30 22:11:38","date_publish":"2017-01-25 20:11:44","description":"Huntington Beach’s proposed water desalinization plant made the list of President Donald Trump's top 50 proposed projects.","filename":"data/vaneerConsumption/HuntingtonBeachDesalinizationPlantMakesTrumpsTop50.json","image_url":"https://media.breitbart.com/media/2015/05/Israel-Desalinization-U.S.-Embassy-Israel-Flickr-CC-Cropped.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_01_25__1540937498.html","title":"Huntington Beach Desalinization Plant Makes Trump's Top 50","title_page":"Huntington Beach Desalinization Plant Makes Trump's Top 50","title_rss":"NULL","source_domain":"breitbart.com","text":"Huntington Beach’s proposed water desalinization plant made the list of President Donald Trump’s top 50 proposed public-private infrastructure projects.”\nThe Kansas City Star reported that a leaked document detailed the $137.5 billion initial infrastructure projects that the Trump Administration would seek to fund on a 50/50 split between the federal government and private developers. The proposals are estimated not only to generate tens of thousands of short-term construction jobs, but also to create 193,350 direct and 241,700 indirect long-term jobs.\nHuntington Beach’s $1 billion Poseidon Water desalination plant is on the list with 49 other projects that the Kansas City Star indicates has been circulated to Congress and regional business communities around the nation.\nAs Breitbart News has noted, Poseidon Water has been working for almost two decades to build a desalinization plant next to the AES power plant in Huntington Beach. The plant could produce 50 million gallons per day and supply 10 percent of Orange County’s drinkable water.\nFor centuries, sailors have used similar techniques to remove salt from sea water and supplement drinking water. There are more than 17,000 active desalination plants in 150 countries across the globe. The International Desalination Association estimates that approximately 21.1 billion gallons of water are desalinized each day to serve the needs of 300 million people, mostly in the Middle East.\nAlthough the project has tremendous local support after five years of California drought, the State Lands Commission, Santa Ana Regional Water Quality Control Board and the California Coastal Commission must approve the project before construction can begin.\nThe Sierra Club and other environmentalists have thrown up a barrage of opposition to the reverse-osmosis project based on the risk that seawater being drawn from the ocean through intake pipes in the open ocean or below the seafloor could result in destroying microorganisms, and the discharge of 50 million gallons a day of hypersaline brine water mixed with chemicals would cause increased ocean salinity and kill sea life.\nBut the real focus of local environmentalists’ opposition is to frustrate the Municipal Water District of Orange County’s effort to obtain the additional 91,846 acre feet a year necessary to continue the county’s approved build-out plan.\nPoseidon was acquired last year by Brookfield Infrastructure Partners of Boston, a publicly traded company that owns and operates infrastructure facilities on four continents. The company is represented by Susan McCabe, one of the state’s top coastal lobbyists, and the Law Firm of Manatt, Phelps & Phillips, where California Gov. Brown’s sister, Kathleen Brown, is a partner who oversees government and regulatory work.\nThe California Secretary of State’s political contribution website reveals that Poseidon has spent about $1.3 million lobbying the State Water Resources Control Board and the state Legislature on desalination matters since 2000.\nPoseidon also contributed another $324,000 to state and local politics. Beneficiaries include $38,500 for Jerry Brown’s gubernatorial, attorney general and ballot-measure campaigns; $8,900 to Democratic state Sen. Toni Atkins of San Diego, who appointed two coastal commissioners while Assembly speaker in 2014-2015; and $1,000 to state Senate President Pro Tem Kevin de León (D-Los Angeles), who is Chairman of the Senate Rules Committee, which appoints commissioners.\nWith the Sierra Nevada snowpack then at its lowest level since 1950, Poseidon Water announced in October an inter-agency agreement by the staffs of the California Coastal Commission, California State Lands Commission and the Santa Ana Regional Water Quality Control Board to streamline Poseidon’s desalinization permitting process.\nPublic-private partnerships to build desalinization plants appear to be a viable investment opportunity due to water prices across the United States rising by about 41 percent since 2010.\nPhoto: file","url":"https://www.breitbart.com/local/2017/01/25/huntington-beach-desalinization-plant-makes-top-50-trump-infrastructure/"}
