{"authors":["Molly Longman"],"date_download":"2018-10-31 01:45:19","date_modify":"2018-10-31 01:45:19","date_publish":"2018-09-14 14:01:10","description":"States on the East Coast have been hastily preparing for a storm of mass proportions. Now, those states are attempting to put those plans into action as high winds and flooding devastate North and South Carolina. Hurricane Florence made landfall…","filename":"data/vaneerConsumption/HurricaneFlorenceMadeLandfallInNorthCarolinaAndPlacesAreAlreadyFlooded.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/bd861c5f-f54a-44e0-94f3-dc1716219020-getty-1033074056.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_hurricane-florence-made-landfall-in-north-carolina-places-are-already-flooded-11918209_1540950319.html","title":"Hurricane Florence Made Landfall In North Carolina And Places Are Already Flooded","title_page":"Hurricane Florence Made Landfall In North Carolina And Places Are Already Flooded","title_rss":"NULL","source_domain":"bustle.com","text":"States on the East Coast have been hastily preparing for a storm of mass proportions. Now, those states are attempting to put those plans into action as high winds and flooding devastate North and South Carolina. Hurricane Florence made landfall near North Carolina’s Wrightsville Beach at about 7:15 ET Friday morning, CNN reported. The Category 1 storm hit just east of Wilmington, with harsh 90-miles-an-hour winds and 3 inches of rain an hour. The storm is expected to linger over the Carolinas for days, NPR reported.\nNorth Carolina’s Gov. Roy Cooper had some choice words for the storm. He told NPR's Morning Edition, \"Florence is an uninvited brute who doesn't want to leave.”\n\"We know we're in for a long haul here,\" Cooper told NPR. \"But I think we're ready.\" The governor said the number one mission in the state for the time being is to save as many lives as possible. About 200 people were rescued from the North Carolina town of New Bern, which experienced mass flooding, The New York Times reported. The flooding happened because the Neuse River overflowed, turning parts of the town into one big, unfortunate lake. CNN reported that 150 more people in the town had to wait to be rescued as the storm surge worsened, reaching 10 feet.\n\"In a matter of seconds, my house was flooded up to the waist, and now it is to the chest,\" New Bern resident Peggy Perry told CNN. \"We are stuck in the attic.\"\nNew Bern's mayor Dana Outlaw told The Times that such severe flooding hadn't happened to the town since the '50s. She noted that although she and other officials told people in the city's low-lying neighborhoods to evacuate, some didn't listen.\nOne city official, Jameesha Harris, told The Times that many people didn't evacuate because of pride:\nA lot of people, this is their whole lives and they had pride, and they did not want to leave. Those same individuals that I knocked on their doors had family members calling me to say they’re on their roof.\nMeanwhile as the flooding ensues, 60 more people had to be evacuated from Jacksonville hotel because of the hurricane's mighty winds, local new station WITN reported. Firefighters on the scene found that damage to the structure of the Triangle Motor Inn was life-threatening.\nAs all this is happening military officials and federal, state, and local governments are doing their best to help people. FEMA originally focused its efforts on helping state and local officials get ready for the storm, but now they're turning their attention to infrastructure damage and restoring services, The Times reported.\nPresident Donald Trump tweeted Thursday that he'd been briefed on Florence, adding, \"FEMA, First Responders and Law Enforcement are supplied and ready. We are with you!\"\nThe storm is slow-moving and the National Hurricane Center's director, Ken Graham, told CNN that flooding will be prolonged and catastrophic. \"You're going to have flooding miles and miles inland,\" he told CNN.\nAs rains pour and winds ravage, Eastern states are bracing and dealing with the destruction as well as they can as the rest of the country watches Florence closely.","url":"https://www.bustle.com/p/hurricane-florence-made-landfall-in-north-carolina-places-are-already-flooded-11918209"}
