{"authors":[],"date_download":"2018-10-30 19:07:06","date_modify":"2018-10-30 19:07:06","date_publish":"2018-09-12 00:00:00","description":"Waffle House is stepping into action ahead of Hurricane Florence.","filename":"data/vaneerConsumption/HurricaneFlorenceWaffleHouseIndexpreparedforstorm.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/09/12/Videos/4481698.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_hurricane-flo_c5dd835b35a9d751a79e4fdf956b6faf__1540926426.html","title":"Hurricane Florence: Waffle House Index prepared for storm","title_page":"Hurricane Florence: Waffle House Index prepared for storm","title_rss":"NULL","source_domain":"ajc.com","text":"Waffle House is stepping into action ahead of Hurricane Florence.\nJust as in previous storms and severe weather, the restaurant chain typically remains open. The latest hurricane is no different.\n>> Read more trending news\n“The ⁦@WaffleHouse⁩ Storm Center is activated and monitoring #Florence,” the restaurant tweeted Monday. “Plan ahead and be safe.”\nThe ⁦@WaffleHouse⁩ Storm Center is activated and monitoring #Florence. Plan ahead and be safe. pic.twitter.com/UOBi5oZRRi — Waffle House News (@WaffleHouseNews) September 11, 2018\nAnd the WaHo Storm Center is real, according to Waffle House. The photo was taken at the Norcross, Georgia, -based chain’s corporate office.\nRelated: Hurricane Florence: Download these apps for finding gas, hotel rooms, help\nIt’s such a noticeable trend that the Federal Emergency Management Agency unofficially has a Waffle House Index, in which locations are monitored based on menu offerings and whether a restaurant is open.\nThe Waffle House Index is used by FEMA to determine damage in neighborhoods after severe weather. (Photo by Joe Raedle/Getty Images) (Joe Raedle/Getty Images/Getty Images)\n“The index itself isn’t just about whether or not you can get pralines on your waffles or if you can get waffles at all, but rather about the damage in a neighborhood,” FEMA communications specialist Jessica Stapf wrote in 2017.\nThe Waffle House Index has the following indicators:\nA green index means a Waffle House is open and offering a full menu.\nmeans a Waffle House is open and offering a full menu. A yellow index means a Waffle House is open, but offering a limited menu.\nmeans a Waffle House is open, but offering a limited menu. A red index means a Waffle House has been forced to close.\nRed indexes are rare, and indicate very severe weather.","url":"https://www.ajc.com/news/national/hurricane-florence-waffle-house-index-prepared-for-storm/wl4whCbySKRRcTs59vmGxK/"}
