{"authors":["Sarah Friedmann"],"date_download":"2018-10-31 01:42:09","date_modify":"2018-10-31 01:42:09","date_publish":"2018-08-28 04:16:24","description":"Last year, Hurricane Harvey ravaged Texas, causing significant damage throughout the state. Unfortunately, Hurricane Harvey's aftermath one year later shows that Texas still hasn't recovered from the storm, as many residents are struggling to find…","filename":"data/vaneerConsumption/HurricaneHarveysAftermathOneYearLaterShowsTexasIsStillRecoveringAndYouCanHelp.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/7f76dac7-5937-44b2-9073-3ac4916a5df5-getty-841864004.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_hurricane-harveys-aftermath-one-year-later-shows-texas-is-still-recovering-you-can-help-10258655_1540950129.html","title":"Hurricane Harvey's Aftermath One Year Later Shows Texas Is Still Recovering - And You Can Help","title_page":"Hurricane Harvey's Aftermath One Year Later Shows Texas Is Still Recovering — And You Can Help","title_rss":"NULL","source_domain":"bustle.com","text":"Last year, Hurricane Harvey ravaged Texas, causing significant damage throughout the state. Unfortunately, Hurricane Harvey's aftermath one year later shows that Texas still hasn't recovered from the storm, as many residents are struggling to find safe and reliable shelter. For a lot of Texans, there is still a long way to go before full recovery is realized — but you can help speed up this process.\nAs the Washington Post reported last week, many in Texas are still not able to return to their pre-storm way of life. At least 197,000 homes endured significant damage from Harvey's floodwaters. Moreover, nearly 80 percent of houses affected by Hurricane Harvey did not have flood insurance — and the average FEMA payout for a homeowner post-Harvey was only around $4,200. Thus, the cost of fully repairing damaged homes is insurmountable for many people.\nSome people have opted to stay in only one room of their homes while the rest of the house remains in disrepair, as the Washington Post reported. Others stay with family and friends while their homes remain unlivable. Still, many people are completely homeless and struggling to find any type of shelter.\nIndeed, as the Houston Chronicle reported, a significant spike in homelessness in the city occurred post-storm. A 2018 survey revealed that 18 percent of unsheltered homeless individuals in Houston said they were living on the streets because of Harvey.\nThus, many Texans potentially stand to be impacted by Harvey for years to come. As Mary Comerio, a professor at the University of California at Berkeley and expert in disasters told the Washington Post,\nThis is not a one-year process for most folks ... Those without huge savings or backup plans will likely live in poor conditions until they can fully raise the funds to completely build back. We have seen this around the world. Life will really never be the same.\nHowever, there are certainly many organizations seeking to help accelerate the recovery process. If you wish to contribute to the ongoing post-Harvey recovery as well, you can help out by supporting these organizations.\nFor example, the Rebuild Texas Fund is invested in the state's long term recovery, noting on its website that it \"was set up with the specific intent to work alongside communities [across the state] for up to three years after the storm.\" Among other areas, the fund is dedicated to helping rebuild homes and to finding housing for those who have been displaced by the storm. You can donate to the Rebuild Texas Fund here.\nGlobal Giving, a nonprofit that conducts charitable crowdfunding, is holding a Hurricane Harvey one year anniversary matching campaign. The Global Giving site lists a host of national and local organizations working on Harvey recovery and includes donation links for each. If you donate to one of the organizations listed, your donation will be doubled as part of the anniversary funding campaign. You can make a donation or donations to the campaign via this link.\nThe Red Cross is also still very actively involved in helping people recover from Hurricane Harvey. It recently released a one-year update regarding the aid it has provided thus far and the remaining levels of assistance needed. You can donate to the Red Cross here and select a disaster relief designation for your funds.\nOf course, these are just a few of the the many organizations working diligently to help those in Texas — and beyond — during a difficult post-storm recovery. If you wish to help, consider supporting these organizations (and others) by contributing funds and encouraging others to do the same.","url":"https://www.bustle.com/p/hurricane-harveys-aftermath-one-year-later-shows-texas-is-still-recovering-you-can-help-10258655"}
