{"authors":["Chriss W. Street"],"date_download":"2018-10-30 19:23:48","date_modify":"2018-10-30 19:23:48","date_publish":"2016-03-15 19:55:42","description":"Hyperloop's CEO just promised the L.A.-to-San Francisco commute time will be 36 minutes--and only cost $30.","filename":"data/vaneerConsumption/HyperloopPromisesLAtoSFCommutefor30.json","image_url":"https://media.breitbart.com/media/2016/03/Dick-Ahlborn-and-Hyperloop-Jack-Plunkett-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_03_15__1540927428.html","title":"Hyperloop Promises L.A.-to-S.F. Commute for $30","title_page":"Hyperloop Promises L.A.-to-S.F. Commute for $30 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"With the audacious, crowdsourced “Hyperloop” meeting all its technical design milestones, the company’s CEO just promised the L.A.-to-San Francisco commute time will be 36 minutes–and only cost $30.\nDuring a keynote at the South by Southwest Interactive conference (SXSW) held in Austin, Hyperloop Transportation Technologies CEO Dirk Ahlborn told the gathering that the “loop” will work as efficiently for intercity travel as for long distances, since it can literally bolt onto existing freeway right of ways without the massive expense of subway tunneling.\nFounded in 2013 by Elon Musk’s SpaceX, the Hyperloop design is structured as an open competition. At a competitive award weekend held on the campus of Texas A&M University over the January 29 and 30 weekend, 188 domestic and international teams presented technical applications that were judged by a consortium of SpaceX and Tesla engineers, plus 60 academic professors from around the world.\nThe contestant submissions only had to conform to Hyperloop’s “vactrain” design, which features a magnetic levitating pod in a tube that has had all the air removed, making it a vacuum. Having no air in the tube means there is almost no aerodynamic drag on the projectile.\nThe winning design for the Hyperloop pods to carry passengers and cargo at about 700 miles an hour was submitted by a student-led design team from the Massachusetts Institute of Technology. Teams from Delft University in the Netherlands, The University of Wisconsin-Madison, Virginia Tech, and University of California at Irvine rounded out the top five finishers.\nBreitbart News has reported extensively that most Californians now believe the “High-Speed Rail Authority” has become a $93 billion boondoggle and now favor repurposing the $10 billion in bonds approved by voters in 2008 to fund water mitigation projects to help manage the five-year drought.\nAlthough California High Speed Rail was approved in 2008, they have only acquired 7 percent of the 1,100 Central Valley parcels needed start building the first quarter of the project. With a completion now looking like 2043, the agency estimated one-way trip for the not-so-bullet-train has been extended to about 3.5 hours. High Speed rail is still pretending the ticket price will be between $83 and $105, despite the costs tripling.\nBy comparison, the 50-acre half-mile track for prototype “Propulsion Open Air” testing broke-ground in December and is already in final construction. Soon, Hyperloop will begin sending its electrical motors down the track at some 300-miles per hour.\nCEO Ahlborn told the SXSW crowd that the first commercial client for Hyperloop is the Eastern European city of Bratislava, Slovakia, whose system will be completed for $200-300 million by 2020. The second stage is set for construction two years later and will connect Vienna and Budapest.","url":"https://www.breitbart.com/local/2016/03/15/hyperloop-promises-la-to-sf-commute-for-30/"}
