{"authors":["Cheyenne Macdonald For Dailymail.Com"],"date_download":"2018-10-23 04:48:49","date_modify":"2018-10-23 04:48:49","date_publish":"2016-01-29 20:26:30","description":"The visualization released by EUMETSAT was created through international efforts, using data from meteorological agencies in Europe, the United States, and Japan to map global conditions.","filename":"data/vaneerConsumption/Hypnotichighspeedvideoshowsallof2015sweatherinjustnineminutes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/30B4E8DA00000578-0-image-a-6_1454096593207.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3423339_Hypnotic-high-speed-video-shows-2015s-weather-just-nine-minutes_1540270129.html","title":"Hypnotic high speed video shows all of 2015s weather in just nine minutes","title_page":"Hypnotic high speed video shows all of 2015s weather in just nine minutes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A new video shows the hypnotic movements of weather systems around the world over the course of the past year.\nThe visualization was created through international efforts, using data from meteorological agencies in Europe, the United States, and Japan to map global conditions.\nBy monitoring weather over last thirty years, and continuing to do so in the future, researchers can predict storms to warn populations ahead of time, and track changes in the climate over time.\nScroll down for video\nA new video shows the hypnotic movements of weather systems around the world over the course of this past year. The visualization released by EUMETSAT was created through international efforts, using data from meteorological agencies in Europe, the United States, and Japan to map global conditions\nTHE EFFECTS OF EL NIÑO In 2015, weather around the world saw the effects of a record-breaking El Niño. El Niño is caused by a shift in the distribution of warm water in the Pacific Ocean around the equator. Usually the wind blows strongly from east to west, due to the rotation of the Earth, causing water to pile up in the western part of the Pacific. This pulls up colder water from the deep ocean in the eastern Pacific. However, in an El Niño, the winds pushing the water get weaker and cause the warmer water to shift back towards the east. This causes the eastern Pacific to get warmer. But as the ocean temperature is linked to the wind currents, this causes the winds to grow weaker still and so the ocean grows warmer, meaning the El Niño grows. This change in air and ocean currents around the equator can have a major impact on the weather patterns around the globe by creating pressure anomalies in the atmosphere\nThe video, posted to YouTube, is narrated by Mark Higgins, Training Manager at European Organisation for the Exploitation of Meteorological Satellites (EUMETSAT).\nImagery from the geostationary satellites of EUMETSAT, along with the National Oceanic and Atmospheric Administration (NOAA) and the Japan Meteorological Agency (JMA) were pieced together to create the animated map.\nAt the beginning of the year, the map shows the weather in the Northern Hemisphere winter, and Southern Hemisphere summer.\nDuring this time, storms move from west to east in the North, and bringing weather patterns across continental landmasses.\nWhen meteorological spring begins in March, Higgins explains, the sun moves toward the North from where it previously hovered over the Southern Hemisphere.\nThis time period shows cyclone activity northeast of Australia, and storms flowing steadily toward the Philippines.\nTracking these storms with satellites allows researchers to view them clearly as they develop and move.\n'This shows the importance of having these data, so that forecasters are able to predict the storms and effectively warn the populations that they're coming,' Higgins says in the video.\nHiggins notes that April 1st marks the birthday of monitoring the Earth and Space, as the first meteorological satellite TIROS-1 was launched on this day in 1960.\nAs spring progresses, the western Pacific Ocean becomes active with tropical storms, which require warm sea surface temperatures to thrive.\nOne of the challenges of these methods, the narrator explains, is effectively warning populations of the oncoming storms. But, as the satellites provide images for the weather at any given moment, meteorologists can view the developments and changes as they occur\nThe map shows the storms of 2015 with great clarity, and Higgins points out the simultaneous formation of three cyclones in late August, early September. These storms were 'well-structured,' becoming Ignacio, Jimena, and Kilo.\nThe animation also shows the fast development and progression of other destructive storms like Hurrican patricia, which turned inland and hit Mexico, and the named storms that struck Europe at the beginning of November.\nThese storms began with Abigail and continued with Barney, Clodagh, Desmond, Eva, and Frank, bringing severe flooding to Ireland and the UK.\nOne of the challenges of these methods, the narrator explains, is effectively warning populations of the oncoming storms.\nBut, as the satellites provide images for the weather at any given moment, meteorologists can view the developments and changes as they occur.\nInformation collected from these satellites can also provide the model for future understanding of climate conditions.\n'Satellites are an important part of monitoring Earth's climate,' Higgins explains in the video.","url":"https://www.dailymail.co.uk/sciencetech/article-3423339/Hypnotic-high-speed-video-shows-2015s-weather-just-nine-minutes.html"}
