{"authors":["Wendy Lu"],"date_download":"2018-10-31 01:41:25","date_modify":"2018-10-31 01:41:25","date_publish":"2018-08-28 13:00:53","description":"This year, Bustle is celebrating Rule Breakers — the women and non-binary individuals among us who dare to be themselves no matter what. In the lead-up to Bustle's Rule Breakers 2018 event happening Sept. 22, we are featuring stories from an array…","filename":"data/vaneerConsumption/IAlmostDidntTellMyChineseParentsIWasGoingToTherapyHeresWhyIDidAnyway.json","image_url":"https://imgix.bustle.com/uploads/image/2018/7/13/6000fab4-3701-4073-85c6-e03b1ad5982c-mentalhealth.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_i-almost-didnt-tell-my-chinese-parents-i-was-going-to-therapy-heres-why-i-did-anyway-8834052_1540950085.html","title":"I Almost Didn't Tell My Chinese Parents I Was Going To Therapy - Here's Why I Did Anyway","title_page":"I Almost Didn't Tell My Chinese Parents I Was Going To Therapy — Here's Why I Did Anyway","title_rss":"NULL","source_domain":"bustle.com","text":"This year, Bustle is celebrating Rule Breakers — the women and non-binary individuals among us who dare to be themselves no matter what. In the lead-up to Bustle's Rule Breakers 2018 event happening Sept. 22, we are featuring stories from an array of individuals about critical moments when they didn't do as they were told. In a world that encourages us to conform unquestioningly, they refused to look or act the part, and we're all better for it. Click here to buy tickets for the event.\nWhen I walked into my psychotherapist's office for the first time in April, I felt like I wasn't supposed to be there. I'm Chinese, and Chinese people don't seek mental health services, I thought. A voice inside me said that it was a sign of weakness. But I also knew that I needed a better way to deal with anxiety and depression. I wasn't sure how my parents would respond when I told them I was seeing a therapist — mental health stigma among Asian Americans is still a taboo subject — but I couldn't let that stop me.\nIt's been four months since I started going to psychotherapy, and it's one of the best decisions I've ever made. Therapy doesn't make all of my anxiety and depression go away, but it has helped me to manage both in a healthy way and in a judgment-free zone. Since mental health is a silent stigma in many Asian American and Pacific Islander (AAPI) cultures, I was scared of telling my parents that I'd started going to psychotherapy. Mental health was never really talked about much at home. Were they going to tell me that therapy was a sign I wasn't mature or grown up enough, or that I should let therapists deal with people who had real issues? As a Chinese American woman, I grew up believing that crying made me fragile, and that expressing sadness on a bad day meant I was an attention-seeker. Reading books like Memoirs of a Geisha that perpetuated tired tropes about strong, silent Asian women who endure emotional pain taught me that being quiet and obedient was a sign of resilience.\nThese cultural messages came from all sides: family, western and eastern media, and the greater society. Over the years, I've given myself the permission and space to express my emotions and grow from them. Still, when I finally told my parents that I'd found a therapist and had started seeing her twice weekly, I wasn't expecting them to be cool with it — in fact, I thought they might suggest that it was a waste of time. But, their response was encouraging. \"That's great! You can let it all out,\" they teased. I breathed out a quiet sigh of relief. Since then, I've mentioned therapy multiple times to them. Even though they don't always seem to understand why I go, I'm grateful that they at least seem to respect my decision to do it — because the reality is not the same for many AAPI folks.\nWendy Lu / Bustle\nRates of mental health issues among Asian Americans and Pacific Islanders vary, but they are generally three times less likely than white people to seek mental health services, according to the American Psychological Association. Asian American college students are more likely to have suicidal thoughts and attempt suicide than white people. And while suicide is the second leading cause of death for people ages 15 to 34 across all demographics, including Asian Americans, mental illness is rarely treated like the serious public health issue that it is among AAPI communities, according to Dr. Helen Hsu, president of the Asian American Psychological Association and a staff psychologist at Stanford University. Cultural stigma, lack of family support, language barriers, and few culturally sensitive therapists can all prevent AAPI people from seeking the mental health services they need. Unfortunately, this often means that \"Asian Americans tend to enter the mental health care system only when it becomes severe,\" Dr. Hsu tells Bustle.\nWhitney Hu, 27, says she never had a single conversation with her family about sadness or grief when she was growing up, even when it was a visible emotion. \"It was always being pushed back on. Like oh, you have to be resilient, you have to rely on yourself. You can have this moment of weakness, but don't be weak,\" Hu, who is mixed-race and identifies as being of Chinese, Korean, Irish, and Italian descent, tells Bustle. \"I think I spent so much time trying to live up to all these standards and images that I would never achieve in a lifetime. I don’t think anyone could.\"\nAAPI women in particular are often conditioned by their cultures to remain silent about depression, and can experience low self-esteem due to being unable to meet familial — and often sexist — expectations that are a result of a patriarchal society. This creates a trickle-down effect where AAPI women of older generations teach their children to have thick skin, be strong, and take responsibility for upholding the family honor because that's what they had to do, but then younger generations don't always learn how to actually cope and manage their mental health. It's a cycle of trauma that can harm AAPI people of all generations.\n\"I've heard really cringe-worthy tales of clients saying, 'I felt like I had to educate my white therapist.'\"\nFor first- and second-generation AAPI folks (like me), the lack of Asian representation in western conversations about mental health can make it feel even more challenging to speak up. Zhan Yun, 28, a Chinese American teacher based in Rochester, N.Y., says that, as a child, she never saw an AAPI person on screen whenever her school showed educational videos about mental health. And her non-Chinese friends were much more open about their mental health issues than she'd been taught was appropriate, she tells Bustle. It was a major contrast that sent a harmful message — that mental illness was something that affected everyone else in America except Asians.\nThis attitude not only further deepens misconceptions among non-AAPI people, but may also be internalized by AAPI people. Carlynn de Joya, 24, a Filipino woman based in Los Angeles, remembers talking to a psychiatrist in Los Angeles. She recalls that the psychiatrist, who's also Filipino, said to de Joya of the patients at her clinic, \"I don't understand why there are so many Filipino girls in here. This is for white people.\"\nWendy Lu / Bustle\nEven if Asian Americans decide they do want to seek help, the lack of AAPI psychiatrists in the mental health profession can affect the quality of care, Dr. Hsu says. For many, it can be supremely difficult to find a therapist who mirrors their background and has the innate cultural understanding and insight to treat their AAPI patients with respect and without judgment. (It's worth noting that the shortage of AAPI mental health professionals could be due to the taboo itself.) I remember this was an issue for me as a Chinese American woman. I had to opt for a white therapist primarily because she accepted my health insurance. While things have worked out so far, I admittedly would've preferred a therapist of color, especially a therapist who had a more innate understanding of collectivist cultures and Chinese family values like filial piety.\n\"I've heard really cringe-worthy tales of clients saying, 'I felt like I had to educate my white therapist,' or 'My white therapist said something that felt like a microaggression.' It didn't allow for that safe space, which is so important,\" Dr. Hsu says. Add in geography limitations, health care costs, and long wait lists, and access becomes a major issue — especially for AAPI folks with middle or low incomes who literally cannot afford to be choosy. And that's if they get any access to care at all.\nRohana Kuyavar, 21, a junior at the University of California, Berkeley, says they found a South Asian therapist at the university who understands the cultural context they come from, but the counseling is only temporary until they graduate since it's provided by the school. Kuyavar's biggest concern for the future is whether they'll be able to find affordable, long-term therapy with a mental health professional who also lives at the intersection of queer and South Asian identities, they tell Bustle.\nTo combat mental health stigma, Dr. Hsu says grassroots efforts to develop community events, support groups, and educational organizations specifically for AAPI communities are integral. There also needs to be more services aimed at managing specific issues, like the fact that South Asian immigrants, including refugees, are especially at risk for depression, post-traumatic stress disorder, and other mental health issues associated with immigrating to the United States.\n\"I feel like mental health is more about maintenance rather than one issue you're just trying to fix. Even if you're the happiest person, you need mental health coping strategies.\"\nResearchers studying mental health among AAPI communities should also dis-aggregate data rather than lumping all Asians together. For example, when data on AAPIs with low incomes is merged with data on extremely wealthy AAPIs, Dr. Hsu says, it perpetuates the assumption that Asian Americans and Pacific Islanders are a homogeneous group of people. The result is that health care services aren't allocated properly. Of course, just because you have money or higher education doesn't mean you're immune to mental illness — but access to mental health care is even worse for people with low incomes. \"If you look at a monolithic group, those who are really in need become invisible,\" Dr. Hsu said. \"It's a systemic problem.\"\nAs young AAPI folks continue to grow and reconcile with their family's cultural differences, they're learning how to redefine self-care and mental health on their own. For some people, like Yun, mental health is an integral part of who they are and a lifelong process that everyone can benefit from. \"I feel like mental health is more about maintenance rather than one issue you're just trying to fix. Even if you're the happiest person, you need mental health coping strategies. It's a part of growing and developing as a person throughout life,\" Yun says. As for me, I've learned that taking care of my mental health means accepting my emotions rather than fighting against them, and putting myself first before being there for other people. And I'm not going to let stigma stand in my way.","url":"https://www.bustle.com/p/i-almost-didnt-tell-my-chinese-parents-i-was-going-to-therapy-heres-why-i-did-anyway-8834052"}
