{"authors":["Kat Haché"],"date_download":"2018-10-30 22:28:56","date_modify":"2018-10-30 22:28:56","date_publish":"2014-08-15 15:57:13","description":"I’ve been visible online talking about feminism for about two years now. As a result, I’ve received rape threats, death threats, and a great deal of horrible comments directed at me for daring to question aspects of the status quo. I’ve had men…","filename":"data/vaneerConsumption/IAmaTransWomanandaFeministSoWhyDoSomeRadicalFeministsWantToExcludeMe.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/06c4d81e-503c-4e44-bd38-82647f405065.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34058-i-am-a-trans-woman-and-a-feminist-so-why-do-some-radical-feminists-want-to_1540938536.html","title":"I Am a Trans Woman and a Feminist, So Why Do Some Radical Feminists Want To Exclude Me?","title_page":"I Am a Trans Woman and a Feminist, So Why Do Some Radical Feminists Want To Exclude Me?","title_rss":"NULL","source_domain":"bustle.com","text":"I’ve been visible online talking about feminism for about two years now. As a result, I’ve received rape threats, death threats, and a great deal of horrible comments directed at me for daring to question aspects of the status quo. I’ve had men violate my boundaries with creepy sexual comments both online and offline, and I don’t feel safe around strange men by myself. If I walk alone at night, I make sure to have my Maglite and cell phone at the ready, just in case I’m assaulted.\nThese experiences are sadly fairly common for most of the women I know, and since transitioning, they have become a daily reality for me as well. Nevertheless, there are women and feminists who would assert that I, as a trans woman, am still a man benefiting from male privilege who is not welcome in their spaces.\nThese people are commonly referred to as TERFs (Trans Exclusionary Radical Feminists), a term they consider a slur. Their ideology can be seen reflected in trans-exclusionary clubs and events, like the Michigan Womyn's Music Festival for \"womyn-born-womyn,\" which wrapped up just this week.\nTheir perspective, as I understand it, is that women are oppressed on the basis of sex, which they differentiate from gender, and that gender is a tool of the patriarchy used to keep them women subservient roles. TERFs argue that those designated female at birth are relegated to navigating life within the constraints of male dominance. According to them, trans women cannot understand what it is like to be a woman, and we reproduce the patriarchy by reducing womanhood to socially performed, stereotypical roles.\nI, like most women, don't perfectly conform to the social expectation of what a woman should be. And in that way, I sometimes feel that gender is bullshit. Or, more specifically, the fact that we are expected to perform gender to some arbitrary standard at all times in order to be seen as valid is bullshit.\nEnabled by the medical establishment, TERFs argue that trans women have erased the lived experience of women and upheld sex-based oppression of women by claiming womanhood for ourselves. A lot of their ideas hearken back to those of Janice Raymond, who, stated in her book The Transsexual Empire that all “transsexuals rape women’s bodies by reducing the real female form to an artifact, and appropriating this body for themselves.”\nThere is an underlying assumption in these ideas that trans women themselves view being a woman as nothing more than performed rituals of docility and appealing to the male gaze, when in my experience, this is almost never the case. We engage in a lot of these rituals in order to be seen as we are, and in a world that denies us that privilege at every turn, there is even more pressure for us to conform in order to be accepted.\nOne of the fears that kept me from transitioning was the expectation that I would have to present myself as a 1950s housewife just so my doctor to allow me to transition. This was a legitimate fear, because, as writer and trans advocate Brynn Tannehill says, “There are still therapists out there who won't give recommendation letters for HRT (hormone replacement therapy) to transgender women unless they show up to every appointment in a dress and heels.”\nAdherence to socially constructed gender norms is mandated by our society for trans people just as much as it is for cis people, and our wellbeing hinges on our ability to “do gender” in a way that satisfies the standards of cis people. When I put on makeup and wear clothing that our society reads as feminine, that safety is always in the back of my mind. Deviance from gender norms means unwanted attention and scrutiny, and for trans women, the consequences can be incredibly harsh.\nI, like most women, don't perfectly conform to the social expectation of what a woman should be. And in that way, I sometimes feel that gender is bullshit. Or, more specifically, the fact that we are expected to perform gender to some arbitrary standard at all times in order to be seen as valid is bullshit.\nNo one fits neatly into one of two little boxes, and I've felt restricted by the label of \"woman\" just as I felt restricted by the label of \"man,\" albeit to a lesser extent.\nBut gender does not have to be done this way, and it is certainly not a unique experience for cis women. As the great gender theorist Judith Butler said, \"It's a phenomenon that's being produced all the time and reproduced all the time.\"\nOur society privileges masculine gender expressions and those who embody those expressions. We position all other expressions as deviant and inferior. We don't have to do that.\nI don't accept that there is anything inferior about a feminine gender identity. Within the restrictive system that we live in, I have found that I am able to navigate life in a way that makes sense within the category of \"woman\" more than I could as a \"man,\" and for me the navigation of my gender identity within the restrictions that have been structured around it has been an exercise in challenging subjugation and restriction, not enabling it.\ntransamazon73 on YouTube\nThe vocabulary of gender in our society is inadequate in describing the entirety of our being. Yes, some of us are men, some of us are women, some of us are another gender, or neither, but that is not the totality of our being. Nevertheless, that part of our identity is important. Gender is one of the vocabularies we have that allow us to understand who we are, and even if it's imperfect, we all deserve the right to be seen as who we are and to define ourselves in the best way we know how.\nTo again quote Judith Butler:\n...all of us, as bodies, are in the active position of figuring out how to live with and against the constructions — or norms — that help to form us. We form ourselves within the vocabularies that we did not choose, and sometimes we have to reject those vocabularies, or actively develop new ones.\nI don't disagree that I experienced privilege in being gendered as male for the majority of my life thus far. I don't disagree that gendered violence occurs as a result of women being subjugated within an artificial gender hierarchy. I condemn anyone who uses any kind of similar violence or intimidation against any woman, trans or cis, regardless of what her beliefs may be.\nHowever, my experiences now are the experiences of a woman — even if that means that in navigating my life, I have to develop a new understanding of what it means to be a woman. I have an understanding of my body that I feel comfortable with, at long last, and I think that should be respected. Like anyone else, I deserve safety and to be recognized as I am, and that struggle is not in conflict with the struggles that cis women face.\nAs I continue to fight both for trans equality and women's equality, I hope that we can come to a mutual understanding and a respect for not only the experiences that unite us as women, but those that make us unique as well.","url":"https://www.bustle.com/articles/34058-i-am-a-trans-woman-and-a-feminist-so-why-do-some-radical-feminists-want-to"}
