{"authors":["Jerome Hudson"],"date_download":"2018-10-30 22:04:51","date_modify":"2018-10-30 22:04:51","date_publish":"2016-04-12 18:08:41","description":"Hillary Clinton's participation in a racially-charged skit over the weekend at the New York City press dinner has set social media on fire, with some liberals denouncing the Democratic party's presumptive presidential nominee. | Politics","filename":"data/vaneerConsumption/IAmNoLongerADemHillaryClintonBlastedOverRacistSkit.json","image_url":"https://media.breitbart.com/media/2016/04/Clinton-de-Blasio-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_04_12__1540937091.html","title":"'I Am No Longer A Dem': Hillary Clinton Blasted Over Racist Skit","title_page":"'I Am No Longer A Dem': Hillary Clinton Blasted Over Racist Skit | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hillary Clinton’s participation in a racially-charged skit over the weekend at the New York City press dinner has set social media on fire, with some liberals denouncing the Democratic party’s presumptive presidential nominee.\n“I just have to say thanks for the endorsement, Bill. Took you long enough,” Clinton said jokingly to New York City Mayor Bill de Blasio.\n“Sorry, Hillary, I was running on C.P. time,” de Blasio responded to the deafening sound of gasps from the audience.\n“Hamilton” star Leslie Odom Jr., who is black, responded to de Blasio by saying, “I don’t like jokes like that.”\n“Cautious politician time,” Hillary said, going along with the joke.\n“C.P. time,” for the uninitiated, translates to “colored people time.” The phrase refers to a negative stereotype that when arriving to an event, black people generally tend to show up late. It’s a stereotype commonly joked about between black people and other minorities.\nHillary’s line was meant to clarify what de Blasio meant by “C.P. time.” But the damage, it appears, had already been done.\nAnd it didn’t take long before social media was rife with ridicule toward the Clinton camp.\nIf a white Republican even thought of making a joke on 'CP time', Salon and Fusion wouldn't be able to get out a racism piece quick enough. — Britt (@brittaufait) April 10, 2016\nSorry, there is no rational explanation for this blunder #NotFunny https://t.co/3JJM0hJm5E — Lorm (@lormzic) April 11, 2016\nBREAKING POINT: I AM NO LONGER A DEM\nHILLARY & de Blasio … joke about Colored People Timehttps://t.co/cvuZ5xAoQ0 pic.twitter.com/CPK2iU0IB9 — Michael Allen Martin (@michaelallenmar) April 11, 2016\nHillary Clinton and Bill de Blasio made a racist joke together.\nHow much information do you need to prove she ain't here for us? — Venus Selenite (@venusselenite) April 11, 2016\nCOLORED PEOPLE TIME? WRONG CENTURY, HILLARY https://t.co/4CHiQV8iXX — London for Bernie (@London4Bernie) April 11, 2016\nThis is the moment where Hillary is trying to figure out how to diffuse de Blasio’s joke about “CP time\" pic.twitter.com/2YRizp5waf — Katherine Krueger (@kath_krueger) April 11, 2016\nSorry Hillary I was running late…on colored people's time. Do people call black people colored anymore? #freak https://t.co/4QYXEKm0WW — PasqualeCruz2016 (@Depasquallers) April 11, 2016\nWas the Clinton/De Blasio racist joke really a planned skit? I feel like I'm missing some context bc this is awful. https://t.co/jlbRpnZHAU — Lucy Idaya (@LucyIdaya) April 11, 2016\nHillary’s blunder with de Blasio came at a bad time. Bill Clinton created negative press for his wife’s campaign after he was caught on tape clashing with Black Lives Matter protesters about black-on-black crime.\nThe headlines after Hillary’s colored people joke were about as bad as they’ve been throughout the Democratic primary.\n“Hillary Clinton Tries to Prove She’s Not Racist With Awkward Joke About ‘Colored People Time'” read one headline.\n“Hillary Clinton and Bill de Blasio Set Off Cringing With Painful Joke About ‘Colored People Time,'” read another.\nNeither Hillary nor de Blasio have commented further on the brewing controversy.\nFollow Jerome Hudson on Twitter: @jeromeehudson","url":"https://www.breitbart.com/politics/2016/04/12/i-am-no-longer-a-dem-hillary-clinton-blasted-over-racist-skit/"}
