{"authors":[],"date_download":"2018-10-30 01:07:29","date_modify":"2018-10-30 01:07:29","date_publish":"2018-10-29 00:05:50","description":"Picture eastern Texas, and your mind may conjure up images of cattle ranchers, chicken fried steaks, or maybe even a select few country artists. But if you ask people who work in the realm of patent policy, the images evoked by the phrase “eastern Texas” resemble something more akin to The Crucible. Why? Because the Eastern Texas District Court is infamous as a place where merely the accusation of infringing a patent can bring judgments down that destroy people and businesses","filename":"data/vaneerConsumption/IancuGaslightsAmericasInventors.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/10/Iancu2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861649.html","title":"Iancu Gaslights America’s Inventors","title_page":"Iancu Gaslights America’s InventorsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Picture eastern Texas, and your mind may conjure up images of cattle ranchers, chicken fried steaks, or maybe even a select few country artists. But if you ask people who work in the realm of patent policy, the images evoked by the phrase “eastern Texas” resemble something more akin to The Crucible. Why? Because the Eastern Texas District Court is infamous as a place where merely the accusation of infringing a patent can bring judgments down that destroy people and businesses, often with flagrant disregard for precedent. It is, in short, a Star Chamber for patent defendants, presided over by a judge who is either too besieged with cases to do his job properly, or fully aware that his judgments bring a gravy train to the area.\nWhy? Well, imagine you put all your savings into building a new bike that is easier to control and goes faster than all other bikes because of some contraption or other you put in the pedals that increases their responsiveness to slight movements of a person’s legs. Then you try to sell the bike, only to be served with a lawsuit because someone, years ago, filed a vaguely worded patent for “objects that make bikes go faster,” and because you didn’t pay to license it, you are now infringing it. But no worries, you can make the lawsuit go away, if you just pay $50,000 to the law firm that now owns it, but has no intention of ever developing anything like what you’ve built.\nThis is precisely the sort of shakedown that inventors face every day, thanks to the actions of the dreaded so-called “patent trolls,” i.e., the firms that spend money to buy up unused patents, that they have no intention of developing, purely for the purpose of suing others who do develop the inventions only described in print.\nAnd, judging by the recent speech that U.S. Patent and Trademark (USPTO) Director Andrei Iancu gave on the subject in Eastern Texas itself recently, Iancu is not only in favor of this process, but wants everyone who realizes the dangers of it to shut up and take it.\nI won’t sugarcoat this: Imagine spending years sounding the alarm about crime, only to wake up one day and see the local District Attorney dedicate an entire speech to extolling the local Mafia Godfather’s virtues — in the Godfather’s own house — and you have roughly the response that average Americans should have to the USPTO director’s recent speech to the Eastern District Court of Texas. Except the criminals in this case are not shaking down businesses with guns, but lawsuits, and the people telling citizens “your money or your life” are not highwaymen, but drug companies.\nIancu compares those who warn about the patent troll menace to storytellers telling children the story of Red Riding Hood. “There are actually many meanings that people banter about, but the crux of the story, in my view, is that little children growing up in medieval villages must stay in the village. Do not venture into the woods, and if you do, for Heaven’s sake, don’t take any risks,” Iancu says, before smugly brushing the lesson off. “Now, this may have been an appropriate lesson for Europeans in the Middle Ages, but what’s surprising is to witness this type of message being delivered nowadays, in 21st century America, with respect to innovation and intellectual property protection.”\nHe explains further, “The goal of this narrative is the same as that of stories such as Little Red Riding Hood: don’t leave the village. Don’t take risks. Stay in your lane! Because if you do take risks, if you do have the gall to get out of your lane, you may encounter big bad wolves or other scary monsters. And horror of horrors, you may encounter ‘patent trolls!’”\nPlease note: Iancu never actually refutes this warning. For him, simply the fact that the people saying it are warning people to be careful is a priori evidence of their malevolence and un-Americanism. What he does do, however, is go out of his way to try to discredit the idea of patent trolls, ironically enough even with reference to Thomas Edison, whose lightbulb was the product of the ideas of multiple people, most of whom could sue Edison under the very legal regime that Iancu purports to defend.\nAnd it’s fitting that Iancu gets the lightbulb’s origins wrong, because the rest of the speech is pure gaslighting. Its goal is to make those who want to strip away impediments to innovation out to be enemies of innovation because we refuse to accept the rhetorical sleight of hand that treats filing a patent for something, and actually creating it, as the same thing. “When you hear some people argue that they tell scary monster stories because they are ‘pro-innovation,’ you may want to look at them quizzically and say, ‘Why grandma, what big eyes you have,’” Iancu smarms.\nI have a better idea for what you might consider saying, not least of all to Iancu himself: Despite sensible court precedent paring back its power, the Eastern Texas District Court still accounts for a vastly disproportionate share of patent cases in the United States due to its flagrantly pro-plaintiff reputation. For this, the town where it has located has received massive infusions of cash from companies terrified that the court will find against them. In a sane world, this would be a scandal, but because large licensee-based interests like Qualcomm benefit from the same abusive process, Washington politicians and bureaucrats like Iancu either ignore or downplay it.\nMy, Grandma, what big bribes you have!\nIt gets worse: Iancu was appointed by President Trump, who has made the scourge of high drug prices a central target of his administration. Yet drug prices are often kept artificially high due to the process of “evergreening,” by which pharma companies try to extend the shelf life of previously valid patents using invalid means, so as to preserve their monopoly pricing powers. Trying to crack down on bad patents endangers this practice, which is one reason why Pharma wants to shut down the most effective means by which improvident granted patents can be challenged, the Inter Partes Review. Director Iancu, coincidentally, is also happy to down talk the process, even though it probably has made the difference between buying medicine and not for many of America’s seniors.\nMy, grandma, what big prices you’ll pay!\nOh, and Director Iancu? You’re right: we shouldn’t have to be afraid of wolves before going into the woods. That’s why we kill wolves, not talk about how they don’t exist while the pack howls around you.\nMy, Director Iancu, what big whoppers you tell!","url":"https://spectator.org/iancu-gaslights-americas-inventors/"}
