{"authors":["Raheem Kassam"],"date_download":"2018-10-30 22:01:58","date_modify":"2018-10-30 22:01:58","date_publish":"2016-02-01 16:22:56","description":"Democratic Unionist Party (DUP) MP Ian Paisley Jr has predicted today that Britain's European Union membership referendum is set to take place on June |","filename":"data/vaneerConsumption/IanPaisleyJrEUReferendumWillBeOnJune23rd2016.json","image_url":"https://media.breitbart.com/media/2016/02/GettyImages-471610930.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_02_01__1540936918.html","title":"Ian Paisley Jr: EU Referendum Will Be On June 23rd 2016","title_page":"Ian Paisley Jr: EU Referendum Will Be On June 23rd 2016 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Democratic Unionist Party (DUP) MP Ian Paisley Jr has predicted today that Britain’s European Union membership referendum is set to take place on June 23rd 2016, echoing predictions made by UK Independence Party leader Nigel Farage, who has previously claimed that the pivotal vote may be “as early as June”.\nTweeting this afternoon, Mr. Paisley, the son of the famous, loyalist Northern Irish politician Lord Bannside (Dr. Ian Paisley) said: “EU referenda will be on Thursday 23 June. Im voting to get out!” before adding: “Mr Cameron has hours to publish his deal!”\nHis prediction, say referendum campaigners, is possibly on the back of both the Labour Party and the DUP wishing for an early referendum. “He’s probably done the maths and realised everyone wants it in June. That’s the earliest date possible,” said a UKIP source.\nEU referenda will be on Thursday 23 June. Im voting to get out! @NoThanksEU @BrexitWatch — Ian Paisley (@ianpaisleymp) February 1, 2016\nThe news comes just hours after European Council President Donald Tusk announced, “No deal” with British Prime Minister David Cameron after rushed talks in 10 Downing Street last night. Mr. Tusk’s statements were contradicted by Number 10, which claimed that a deal on migrant benefits was in fact forthcoming. The discrepancy in the announcements has prompted mockery from Eurosceptic campaigners.\nPaul Nuttall MEP, UKIP’s deputy leader, said today: “Despite entering February the Westminster panto season continues. The theatrics and drama of David Cameron’s sham renegotiation continues and he is playing us for fools.\n“On the one hand we have Donald Tusk leaving a set piece dinner saying “No deal” and on the other hand Cameron’s assertion after that same meeting that it had been a good one.\n“In 24 hours when, to no doubt great fanfare, Cameron returns with a “Deal” with Brussels it’ll looks like it’ll be nothing more than tinkering round the edges of our relationship with the European Union and will not go any way to dealing with the wholesale loss of sovereignty to the EU, the eye-watering cost of it, or indeed go any way to bring back genuine control of our borders from the EU.\n“In short, don’t be fooled, again, by Cameron’s ongoing charade.”","url":"https://www.breitbart.com/europe/2016/02/01/ian-paisley-jr-eu-referendum-will-be-on-june-23rd-2016/"}
