{"authors":["James Dutton For Mailonline"],"date_download":"2018-10-22 23:52:21","date_modify":"2018-10-22 23:52:21","date_publish":"2016-01-29 12:29:31","description":"The British golfer had a mixed 2015, only finishing in the top three once and missing the cut five times in 26 events, and has not won a tournament since 2012.","filename":"data/vaneerConsumption/IanPoulteraddsrestoredFerrari275tohiscarcollectionandshowsoffhisnew200000SpecialeAperta.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B3200A00000578-0-image-a-13_1454084898947.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_golf_article-3422701_Ian-Poulter-adds-restored-Ferrari-275-car-collection-shows-new-200-000-Speciale-Aperta_1540252341.html","title":"Ian Poulter adds restored Ferrari 275 to his car collection and shows off his new £200,000 Speciale Aperta","title_page":"Ian Poulter adds restored Ferrari 275 to his car collection and shows off his new £200,000 Speciale Aperta | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ian Poulter has taken to Instagram to show off the latest additions to his car collection.\nThe world No 55 added the new £200,000 458 Ferrari Speciale Aperta earlier this month and has now had a Ferrari 275 from the 1960s restored.\nThe Ryder Cup legend had a mixed 2015 on the course, only finishing in the top three once and missing the cut five times in 26 events, and has not won a tournament since 2012.\nIan Poulter shows off his new £200,000 Ferrari 458 Speciale Aperta on his Instagram page\nThe British golfer has also had his Ferrari 275 from the 1960s restored after two years away\nIan Poulter took to Instagram to show off his new custom made Ferraro 458 Speciale Aperta\nThe new addition to his collection has been specially designed and will show off at a Ferrari convention.\nThe 39-year-old said of his new expensive toy: 'It's been a busy week with cars arriving for my museum.\n'The new @ferrariusa 458 Speciale Aperta looks beautiful with the backdrop of Enzo Ferrari sitting at his desk. He would approve I'm sure.'\nThe 39-year-old is a known sports car fan and owns a plethora of expensive vehicles\nThe 39-year-old Ryder Cup winner suffered a poor run of form over the calendar year of 2015\nPoulter returned to the golf course in January for the 2016 Abu Dhabi HSBC Golf Championship\nIn a separate photo he showed off his restored 275, hailing it as 'one of the best looking cars ever Ferrari have ever made.'\nThe caption reads: '2 years away being restored and it's finally taken pride of place in the museum.\n'It's looks so good with my @ijp_design tartan background on the walls.'\nPoulter is a well-known Ferrari fan and posted a photo back in August showing his ever-growing collection.\nHe also boasts a 10,000-plus-square-foot mansion near Florida's Lake Nona Golf & Country Club, which has seven bedrooms and a three-bay garage.","url":"https://www.dailymail.co.uk/sport/golf/article-3422701/Ian-Poulter-adds-restored-Ferrari-275-car-collection-shows-new-200-000-Speciale-Aperta.html"}
