{"authors":["Aaron Klein"],"date_download":"2018-10-30 21:03:56","date_modify":"2018-10-30 21:03:56","date_publish":"2017-03-05 16:21:56","description":"Congressman Ron DeSantis believes Pres. Trump will announce the move of the U.S. embassy from Tel Aviv to Jerusalem before the end of May.","filename":"data/vaneerConsumption/IBelieveTrumpWillMoveUSEmbassytoJerusalemBeforeJune.json","image_url":"https://media.breitbart.com/media/2017/03/Ron-DeSantis.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_03_05__1540933436.html","title":"I Believe Trump Will Move U.S. Embassy to Jerusalem Before June","title_page":"Rep. Ron DeSantis: I Believe Trump Will Move U.S. Embassy to Jerusalem Before June","title_rss":"NULL","source_domain":"breitbart.com","text":"JERUSALEM – Speaking from Jerusalem in a Breitbart News exclusive interview, Congressman Ron DeSantis (R-FL) said he believes President Trump will announce the relocation of the U.S. embassy from Tel Aviv to Jerusalem before the end of May.\nDeSantis further stated that he identified a facility in Jerusalem – the current site of a U.S. Annex in the city’s Arnona neighborhood – that could potentially serve as a “plug-and-play” location for the Embassy “where you are literally just changing the sign to the U.S. Embassy.”\nDeSantis, chairman of the subcommittee for National Security for the House Oversight Committee, was is Israel as part of a small delegation on a fact-finding tour to study the possibility of relocating the U.S. Embassy to Jerusalem.\nU.S. law requires the relocation of the Embassy to Jerusalem. However, President Obama signed successive waivers delaying the move. The current waiver expires on June 1.\nRegarding Trump’s campaign pledge to move the embassy, DeSantis stated:\n“A lot of people thought that he was going to do it on day one. And then when he didn’t, they said, ‘Oh well; he’s not going to do it. He’s not going to keep his word.’ Actually, the waver that President Obama signed at the beginning of December 2016 expires at the end of May this year. And that happens to coincide with the 50th anniversary of Jerusalem Day.”\n“And I think president Trump has proven that he is a man of his word. I do not think he is going to sign a waiver for the Embassy. And by that point, we will already have our Ambassador, David Friedman, in place. So, I think this is going to happen.”\nDeSantis said he came to Israel to send a message that Congress is “engaged and we are looking at the various sites and we are developing knowledge on the Committee about any of those sites should the president go ahead and choose one of them.”\nDeSantis had a briefing at the U.S. Embassy in Tel Aviv and then visited numerous U.S. government sites in Jerusalem. He also met with Prime Minister Benjamin Netanyahu and numerous Israeli lawmakers.\nHe said that he was most impressed with the expansive U.S. Consulate in the Arnona neighborhood of Jerusalem.\n“Great security, very big and nice facility,” he said. “So, that is something that could potentially be a plug-and-play. Where you are literally just changing the sign to the U.S. Embassy. And that obviously depends on what the president wants to do. So, he could potentially do that.”\nDeSantis explained that, in some ways, the Arnona facility may be more secure than then current Embassy location on a busy street near the bustling Tel Aviv beach.\n“The current Embassy in Tel Aviv, Israel is right on a busy street. You don’t have that much protection from people just passing by. Obviously, they fortified the embassy in various ways. But in terms of security some of these sites we looked at are actually much more secure.”\nHe said that while the Arnona building does have some security issues, “There is a lot of space. I think clearly that could house an American embassy.”\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.","url":"https://www.breitbart.com/middle-east/2017/03/05/exclusive-rep-ron-desantis-believe-trump-will-move-u-s-embassy-jerusalem-june/"}
