{"authors":["James Delingpole"],"date_download":"2018-10-30 20:58:11","date_modify":"2018-10-30 20:58:11","date_publish":"2016-02-25 13:11:48","description":"A Zimbabwean game reserve has warned that it may have to cull 200 lions because of what it calls \"the Cecil effect.\"","filename":"data/vaneerConsumption/IBlameRickyGervais.json","image_url":"https://media.breitbart.com/media/2016/01/Ricky-Gervais-GettyImages.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_02_25__1540933091.html","title":"I Blame Ricky Gervais","title_page":"'Cecil Effect' Leads To African Lion Cull: I Blame Ricky Gervais","title_rss":"NULL","source_domain":"breitbart.com","text":"A Zimbabwean game reserve has warned that it may have to cull 200 lions because of what it calls “the Cecil effect.”\nUnder normal circumstances, the rights to shoot those lions would have been sold to big game hunters – bringing many hundreds of thousands of dollars into the local economy, providing livelihoods for people and boosting the wildlife conservation budget.\nInstead, most likely, those lions will now have to be destroyed to no purpose. I blame Ricky Gervais.\nNot just Ricky Gervais, obviously. After the world-infamous death of Cecil the Lion there was certainly no shortage of bloviating bleeding hearts announcing to anyone who would listen just how outraged they were that a beast they’d never heard of till two seconds ago had been shot for sport by a Minnesota dentist.\nIt’s just that Gervais, with his several million Twitter followers and his shark-toothed Hollywood presence and his (still-not-quite-totally-decayed) cultish comedy credibility, was probably the most influential of the bunch.\nWell, welcome to the world of unintended consequences, Funny Little Fat Man, chubby little loser with the pug nose face. You, Gervais, must now bear partial responsibility for the senseless slaughter of 200 of those big cats you claim to care about so much.\nYou could, I suppose, argue that unlike those 200 common-or-garden lions Cecil was special because he had a name and was – apparently – beloved by visitors to Hwange national park because of his distinctive black mane and friendly disposition.\nBut I would counter that 200 nameless lions killed to no purpose is a far greater crime against nature than a single lion called Cecil dying an honourable, lucrative and productive death as a game trophy.\nI also think that the kind of childish anthropomorphisation with which Gervais and his fellow celebrity bunny huggers indulge themselves takes us down a very dangerous path, as I tried to argue at the peak of the Cecil hysteria.\nLet me stress at this point that I’m by no means averse to the charm of lions.\nOne of the earliest films I remember going to see at the cinema was Born Free. I think Simba in The Lion King is a really great kid. I have seen more lions on more safaris than anyone I know who doesn’t actually live in Africa and if ever I had to enter into a Lion Off with Ricky Gervais I would win hands down.\nBut it’s precisely because I know so much about lions, wildlife and Africa generally that I was never taken in by all that hysterical nonsense at the time of Cecil the Lion’s death.\nRecently I travelled to Zimbabwe, not far from where Cecil was shot, and I spoke to local conservationists. Here is what I discovered.\nBut for most people who actually live in Africa, it’s a different story, as Zimbabwean conservationist Trevor Lane explains. Lane runs the Bhejane Trust, a charity dedicated to preserving the black rhino in parks including Hwange. ‘I’m a great fan of Prince William, but he’s got it completely wrong on trophy hunting,’ he tells me. ‘Not only does it provide a large chunk of our national park budget, but it gives local people a vested interest in preserving wildlife.’ Take elephants — one of the big five species most favoured by trophy hunters (the others being lion, leopard, Cape buffalo and rhino). To a squeamish urban Westerner, it might seem a monumental tragedy when — as happened in Zimbabwe in October — a massive bull elephant gets shot by some fat German trophy hunter. To a starving African villager, though, it’s a lifeline. ‘Suppose you’re a subsistence farmer and you’ve got $200 of crops which have to last you the whole year. Well that elephant can destroy them in one night. So that elephant has really no value to you, except as poached ivory — which will get you imprisoned for nine years, if you’re not shot on the spot — or as meat. Unless, of course, a professional game hunter comes along and tells you that that elephant is worth $10,000 to your community. Then suddenly you’ve got a reason not to kill it.’ And no, the argument about sparing game for the more lucrative photo tourism doesn’t wash. Not when southern Africa has so many elephants — 108,000 in Botswana’s Chobe park alone — that it doesn’t know what to do with them. Besides which, those national parks make up just a tiny fraction of the country. ‘A lot of the rest is so rough, sparse and remote you could drive all day and see almost nothing,’ says Lane. ‘No photo tourist would want to go there, but thanks to game hunters these barren regions become economically viable.’\nThis is what made me so angry at the time of the Cecil the Lion hysteria and what still makes me angry now. I see it in exactly the same nauseating mix of sentimental ignorance, virtue-signalling, dishonesty, cry-bullying and rampant greed I see in so many political debates of our time on everything from Israel/Palestine to the European Union to climate change.\nSome get it completely wrong just because they are mawkish, stupid, ill-informed, puritanical and left-wing. Others because they are corrupt. I’m sure most of the people who set up wildlife charities do so initially because they genuinely want to make a difference. But the wildlife charity industry is a whole is riddled with dishonesty and has long since lost sight of its original objective. It’s there – in many cases: and I don’t mean the small, genuinely worthwhile, on-the-ground organisations like the Bhejane Trust above – mainly to help rich people who fancy themselves as animal lovers to feel better about themselves by enabling them to donate large wodges of their cash to saving big cats, rhinos and such like. And they’re certainly not averse to telling the odd flagrant lie in service of their cause. This notion that floated about at the time of peak Cecil that African’s lions were somehow endangered: you really need to have lost your moral compass to be involved in African game and make a claim as specious as that. Breeding lions is easy. There’s never going to any shortage of them. The simple issue is one of space – which is why those captive bred lions mentioned at the beginning are going to have to be culled. It’s a question of carrying capacity not rarity.\nLike most successful comedians, Ricky Gervais has followed the usual trajectory from underrated cult genius to flabby, overindulged, Establishment kiss-ass luvvie. All right, so he can still be quite catty at Hollywood awards ceremonies – and I respect him for that – but what I don’t respect is the way he has bought himself the right to do so: by adopting one of those pet liberal causes all Hollywood types have to adopt in order to validate themselves within the nauseatingly right-on Hollywood system.\nBy all means make shit comedies that no one wants to watch, Ricky. By all means shed private tears when Simba’s Dad dies in The Lion King. But if you’re going to use your celebrity to start championing animal rights, at least try to make sure first that what you’re campaigning for doesn’t have exactly the opposite effect to the one you intend.\nI’ve said this before and I’ll say it again: if you care about the future of African wildlife (not to mention African people: though I realise that for most animal lovers humans come pretty low in their priorities), then you should be supporting game hunting not condemning it.","url":"https://www.breitbart.com/europe/2016/02/25/3142016/"}
