{"authors":["Business Insider Intelligence"],"date_download":"2018-10-31 00:24:54","date_modify":"2018-10-31 00:24:54","date_publish":"2016-12-01 00:00:00","description":null,"filename":"data/vaneerConsumption/IBMiscontinuingitsblockchainpush.json","image_url":"https://amp.businessinsider.com/images/58406f64e02ba78f1c8b6dcb-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ibm-is-continuing-its-blockchain-push-2016-12_1540945494.html","title":"IBM is continuing its blockchain push","title_page":"    IBM is continuing its blockchain push - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence This story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nTech giant IBM has been working on making itself a global leader in developing blockchain use cases for financial services, and on Wednesday, it announced yet another project.\nIBM will develop a blockchain-based supply chain finance solution with Mahindra Group, one of India's largest conglomerates, according to Bezinga.\nThe new platform will use a permissioned blockchain and be designed to optimize processes involved in supply chain finance, with particular emphasis on invoice discounting.\nSupply chain financing is typically laborious. Many transactions between suppliers, buyers, and any financing parties involve paper invoices that have to be mailed and require the manual inputting of documents into each participant's respective system. This greatly increases processing times and the risk of human error.\nBlockchain technology is well placed to help mitigate both issues as it can be used to create a shared, immutable ledger that each participant can update instantly, while also limiting each party's access to the parts of the contract related to them. This can reduce human error and operating costs, as well as ensure transparency and the protection of sensitive data.\nIBM has long been upping its blockchain offerings. It's been particularly focused on producing real-world applications for the technology — including in the areas of financial services and trade finance. IBM has made open-source contributions to the Hyperledger Fabric, and in April, it made blockchain services available to its IBM Bluemix cloud users so they could build and test blockchain-based solutions.\nWe think it likely that its real-world approach will give IBM an edge over groups or consortiums working on blockchain technology. In addition, its structure is less fractious, which may make it easier for the firm to specialize and focus on particular use cases.\nBlockchain technology, which is best known for powering Bitcoin and other cryptocurrencies, is gaining steam among finance firms because of its potential to streamline processes and increase efficiency. The technology could cut costs by up to $20 billion annually by 2022, according to Santander.\nThat's because blockchain, which operates as a distributed ledger, has the ability to allow multiple parties to transfer and store sensitive information in a space that's secure, permanent, anonymous, and easily accessible. That could simplify paper-heavy, expensive, or logistically complicated financial systems, like remittances and cross-border transfer, shareholder management and ownership exchange, and securities trading, to name a few. And outside of finance, governments and the music industry are investigating the technology's potential to simplify record-keeping.\nAs a result, venture capital firms and financial institutions alike are pouring investment into finding, developing, and testing blockchain use cases. Over 50 major financial institutions are involved with collaborative blockchain startups, have begun researching the technology in-house, or have helped fund startups with products rooted in blockchain.\nJaime Toplin, research associate for BI Intelligence, Business Insider's premium research service, has compiled a detailed report on blockchain technology that explains how blockchain works, why it has the potential to provide a watershed moment for the financial industry, and the different ways it could be put into practice in the coming years.\nBII\nHere are some key takeaways from the report:\nSpending on capital markets applications of blockchain is expected to grow at a 52% compound annual growth rate (CAGR) through 2019, according to Aite Group, to reach $400 million that year.\nBanks and major financial institutions are working both collaboratively and independently to develop blockchain tech. Over 50 major financial institutions are involved with collaborative blockchain startups, like R3 CEV or Chain. And many are investing in the technology on their own as well.\nPutting blockchain to use for real-world transactions is likely not that far off. If working groups' tests are successful, firms could be using it to transact real value as early as the end of this year and we could see widespread industry application within the next few years.","url":"https://www.businessinsider.com/ibm-is-continuing-its-blockchain-push-2016-12"}
