{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 23:04:24","date_modify":"2018-10-30 23:04:24","date_publish":"2016-12-08 00:00:00","description":null,"filename":"data/vaneerConsumption/IBMtouseAItohelpbankswithcybersecurity.json","image_url":"https://amp.businessinsider.com/images/57c45bc1b996eb97008b4f3c-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ibm-to-use-ai-to-help-banks-with-cybersecurity-2016-12_1540940664.html","title":"IBM to use AI to help banks with cybersecurity","title_page":"    IBM to use AI to help banks with cybersecurity - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nIBM launched its IBM Watson for Cyber Security program in beta on Tuesday, and announced that it already has 40 clients signed up, including global leaders in the banking and insurance industries.\nCompanies like Sun Financial and Sumitomo Mitsui Banking Corporation will test the ability of Watson — IBM's artificial intelligence (AI) — to identify and fight cyberattacks. Watson will help them more easily identify specific malware programs and provide background on known cybercrime campaigns, as well as more accurately pinpoint suspicious behavior. At the same time, Watson will better learn how to interpret cybersecurity data and improve its analytical capabilities.\nOne problem the program aims to solve is a lack of accessible information on past cyberattacks. By working with a wide range of companies, Watson will be able to gather information on how different attacks impact different industries, and how individual firms respond. This will enable it to add to the store of information it has already been fed by developers, making it a central repository for information on cyberattacks. This may help IBM overcome a significant hurdle to fighting cybercrime, particularly in financial services — the difficulty of accessing and interpreting data on previous attacks. Historically, financial firms have been reluctant to divulge details on security breaches, but they may be more willing to do so if data can be anonymously fed into Watson.\nCybersecurity is a persistent and growing problem for financial services institutions, in particular.In early November, Tesco Bank suffered a £2.5 million ($3 million) hack, and last week, Russia's central bank was breached to the tune of 2 million rubles ($31 million). As banking becomes ever-more digital, banks will be at greater risk of suffering hacks if they do not up their cybersecurity efforts.\nWe will therefore likely see more solutions such as IBM's Watson for Cyber Security emerging. However, these programs will only work if there is a network of stakeholders in place willing to share information with each other.\nBI Intelligence, Business Insider's premium research service, has compiled a detailed report on cybersecurity that details the current landscape for companies in critical infrastructure sectors, as well as how companies can protect their control systems from hackers.\nHere are some of the key points from the report:\nCompanies that operate critical infrastructure sites reported 295 cyber incidents in 2015, up from 245 in 2014.\nHackers are targeting the industrial control systems that operate critical infrastructure because of the enormous damage they can cause by crippling such infrastructure.\nIndustrial control systems typically weren't designed to be connected to the internet, so they weren't built with cybersecurity capabilities to ward off hackers.\nThe hack that caused a blackout in the Ukraine could serve as a blueprint for other hackers that want to target critical infrastructure, helping them succeed in future attackers.\nThe Ukraine hack highlighted the importance of training employees about cybersecurity and placing additional access controls on industrial control systems beyond firewalls.","url":"https://www.businessinsider.com/ibm-to-use-ai-to-help-banks-with-cybersecurity-2016-12"}
