{"authors":["Breitbart News"],"date_download":"2018-10-30 19:09:43","date_modify":"2018-10-30 19:09:43","date_publish":"2016-10-19 21:17:26","description":"David Sirota writes in the International Business Times that a Wall Street executive who could be Hillary Clinton’s choice for Treasury Secretary has a plan to give the financial industry control over billions in taxpayer funds for retirement savings. This plan, Sirota notes, would “enrich” the Wall Street hedge fund and private equity industries “that have donated millions to support Clinton’s presidential bid.” | Politics","filename":"data/vaneerConsumption/IBTHillaryClintonCouldTurnTaxpayerFundsintoRevenueStreamforHerWallStreetDonors.json","image_url":"https://media.breitbart.com/media/2016/10/Hillary-Clinton-Capitol-Hill-Hyatt-Oct-5-2016-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_19__1540926583.html","title":"IBT: Hillary Clinton Could Turn Taxpayer Funds into Revenue Stream for Her Wall Street Donors","title_page":"IBT: Hillary Clinton Could Turn Taxpayer Funds into Revenue Stream for Her Wall Street Donors | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"David Sirota writes in the International Business Times that a Wall Street executive who could be Hillary Clinton’s choice for Treasury Secretary has a plan to give the financial industry control over billions in taxpayer funds for retirement savings. This plan, Sirota notes, would “enrich” the Wall Street hedge fund and private equity industries “that have donated millions to support Clinton’s presidential bid.”\nFrom IBT:\nWhile Hillary Clinton has spent the presidential campaign saying as little as possible about her ties to Wall Street, the executive who some observers say could be her Treasury Secretary has been openly promoting a plan to give financial firms control of hundreds of billions of dollars in retirement savings. The executive is Tony James, president of the Blackstone Group.\nThe investment colossus is most famous in politics for its Republican CEO likening an Obama tax plan to a Nazi invasion. James, though, is a longtime Democrat — and one of Clinton’s top fundraisers. The billionaire sculpted the retirement initiative with a prominent labor economist whose work is supported by another investment mogul who is a big Clinton donor. The proposal has received bipartisan praise from prominent economic thinkers, and James says that Clinton’s top aides are warming to the idea.\nIt is a plan that proponents say could help millions of Americans — but could also enrich another constituency: the hedge fund and private equity industries that Blackstone dominates and that have donated millions to support Clinton’s presidential bid.\nThe proposal would require workers and employers to put a percentage of payroll into individual retirement accounts “to be invested well in pooled plans run by professional investment managers,” as James put it. In other words, individual voluntary 401(k)s would be replaced by a single national system, and much of the mandated savings would flow to Wall Street, where companies like Blackstone could earn big fees off the assets. And because of a gap in federal anti-corruption rules, there would be little to prevent the biggest investment contracts from being awarded to the biggest presidential campaign donors.\nRead the rest here.","url":"https://www.breitbart.com/politics/2016/10/19/ibt-hillary-clinton-turn-taxpayer-funds-revenue-stream-wall-street-donors/"}
