{"authors":[],"date_download":"2018-10-23 00:01:54","date_modify":"2018-10-23 00:01:54","date_publish":"2016-01-28 13:30:25","description":"International Criminal Court chief prosecutor Fatou Bensouda said Thursday her office has collected a \"vast body of evidence\" against former Ivorian presiden...","filename":"data/vaneerConsumption/ICCprosecutorsaysvastbodyofevidenceagainstGbagbo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g906-4vVdYopwYQ7f641721b07adba6e9-247_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420851_ICC-prosecutor-says-vast-body-evidence-against-Gbagbo_1540252914.html","title":"ICC prosecutor says 'vast body of evidence' against Gbagbo","title_page":"ICC prosecutor says 'vast body of evidence' against Gbagbo | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ICC prosecutor says 'vast body of evidence' against Gbagbo\nInternational Criminal Court chief prosecutor Fatou Bensouda said Thursday her office has collected a \"vast body of evidence\" against former Ivorian president Laurent Gbagbo, accused of fomenting post-poll violence in his west African nation.\n\"We have obtained a vast body of evidence against the two accused,\" Bensouda told the Hague-based court as the trial of Gbagbo and former militia leader Charles Ble Goude got underway five years after 3,000 people died in political upheavals following the bitterly disputed 2010 elections.\nGbagbo, 70, and 44-year-old Ble Goude earlier pleaded not guilty to four charges of crimes against humanity including murder, rape, and persecution.\nFormer Ivory Coast President Laurent Gbagbo attending a pre-trial hearing on charges of crimes against humanity at the International Criminal Court in The Hague ©Michael Kooren (Pool/AFP/File)\nViolence broke out when Gbagbo refused to stand down after losing elections in November 2010 to bitter longtime rival Alassane Ouattara.\n\"The Ivory Coast descended into chaos and was the theatre of unspeakable violence,\" some of which was orchestrated by Gbagbo, Bensouda said.\nThe former strongman had \"intended to stay in power by all means.\"\n\"Nothing would be allowed to defeat Mr Gbagbo, and if politics failed, violence was seen as politics by other means.\"\nArmed forces, mercenaries and youth groups transformed into militias were \"used to attack civilians,\" Bensouda said, adding that Gbagbo had exercised control through \"formal and parallel chains of command.\"\nGbagbo \"laid the foundations of the use of violence. When he understood that the presidency was going to escape him ... he began a campaign of violence orchestrated against those considered opponents,\" she added.\nDespite being \"in a position to do so,\" Bensouda maintained Gbagbo \"never ordered the violence to stop.\"\nBensouda also reacted to criticism that she was only prosecuting crimes committed by Gbagbo's camp during the violence.","url":"https://www.dailymail.co.uk/wires/afp/article-3420851/ICC-prosecutor-says-vast-body-evidence-against-Gbagbo.html"}
