{"authors":["Russ Swan For Mailonline"],"date_download":"2018-10-23 03:23:27","date_modify":"2018-10-23 03:23:27","date_publish":"2016-01-11 16:00:58","description":"Professor Grant Bigg from the University of Sheffield analysed 175 satellite images taken from 2003 to 2013. Iceberg C16 is shown centre with Blooms of phytoplankton are seen streatching around it.","filename":"data/vaneerConsumption/Icebergshelptosuckcarbondioxidefromtheatmosphere.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300CE9BD00000578-0-image-a-19_1452534454737.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3394071_Icebergs-help-suck-carbon-dioxide-atmosphere-Giant-ice-masses-fertilise-oceans-create-blooms-plankton-absorb-gas_1540265007.html","title":"Icebergs help to 'suck' carbon dioxide from the atmosphere","title_page":"Icebergs help to 'suck' carbon dioxide from the atmosphere | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Giant icebergs that break away from the ice sheets around the poles could be having a previously unknown effect on the atmosphere.\nResearchers have found that these giant bergs leave a trail of nutrients in their wake which help to generate massive blooms of ocean plankton.\nThese plankton blooms - which can stretch for hundreds of miles - then absorb a substantial amount of carbon dioxide from the atmosphere and lock it into the ocean depths.\nProfessor Grant Bigg from the University of Sheffield analysed 175 satellite images taken over an 11-year period from 2003 to 2013. He noticed blooms of phytoplankton stretching hundreds of miles. The giant iceberg C16 is seen in the centre of the picture, with levels of plankton spreading southwest and northeast\nThe surprise findings could have major implications for climate change predictions, as more carbon is 'sequestered' or locked away by the phytoplankton.\nThe revelation was made after researchers from the University of Sheffield studied the colour of the ocean from satellite images.\nProfessor Grant Bigg from the department of geography analysed 175 satellite images taken over an 11-year period from 2003 to 2013, discovering that the phytoplankton blooms showed up as tell-tale greenish tints over distances of hundreds of miles around melting icebergs.\nICEBERGS AND WAVES IN THE SKY Icebergs can often be so large they can create waves in their wake as they float across the oceans, but it appears they can also create them in the sky as well. Satellite images released by Nasa show how the floating frozen chunks can produce distinctive striped cloud patterns above them. Nasa scientists said the icebergs can often be so large they disrupt the flow of air over the ocean, causing it to produce strange ripples in the cloud cover above.\nThe giant bergs - measuring at least 18km (11 miles) long - calve off of the great Antarctic ice sheet each year and head northwards towards the equator.\nAs they do so, they melt and fertilise the ocean with trace elements including iron, scraped from the Antarctic land mass, which encourages the growth of huge clouds of phytoplankton.\nProfessor Bigg said: 'We detected substantially enhanced chlorophyll levels, typically over a radius of at least four to ten times the iceberg's length.'\nFurthermore, the effect was seen to persist for at least a month after a giant iceberg had passed by, giving the plankton more time to absorb atmospheric carbon and lock it into the ocean depths.\nThe finding is at odds with previous research, which suggested that ocean fertilisation from icebergs makes relatively minor contributions to the uptake of CO2 by phytoplankton.\nThe giant bergs - measuring at least 18km (11 miles) long - calve off of the great Antarctic ice sheet (pictured) and head northwards towards the equator. As they do so, they melt and fertilise the ocean with trace elements including iron which encourage the growth of huge clouds of phytoplankton\nThe images show the spread of phytoplankton spreading from between January and March in 2011 and the same months in 2014, taken by the Modis Aqua satellite. The iceberg is shown in the centre, in white. Plankton absorb atmospheric carbon and lock it into the ocean depths\nDespite being the Earth's coldest body of water, the Southern Ocean plays a significant part in the global carbon cycle.\nIt is thought to account for about 10 per cent of global oceanic carbon sequestration, driven by both biological and chemical processes including phytoplankton growth.\nProfessor Bigg said: 'This new analysis reveals that giant icebergs may play a major role in the Southern Ocean carbon cycle.\n'If giant iceberg calving increases this century as expected, this negative feedback on the carbon cycle may become more important than we previously thought.'\nThe research is published today in the journal Nature Geoscience.","url":"https://www.dailymail.co.uk/sciencetech/article-3394071/Icebergs-help-suck-carbon-dioxide-atmosphere-Giant-ice-masses-fertilise-oceans-create-blooms-plankton-absorb-gas.html"}
