{"authors":[],"date_download":"2018-10-30 21:38:37","date_modify":"2018-10-30 21:38:37","date_publish":"2018-10-30 21:10:00","description":"The Trump administration has begun detaining immigrants facing deportation in a privately operated p...","filename":"data/vaneerConsumption/ICEholdingdetaineesinClaytonprisonafterAtlantaturnedthemaway.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/newsEngin.23313484_Robert-A.-Deyton-Detention-Facility-photo-provided-by-GEO-Group.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_0c691f933997db1bb7bab4a9a730015d__1540935517.html","title":"ICE holding detainees in Clayton prison after Atlanta turned them away","title_page":"ICE holding detainees in Clayton prison after Atlanta turned them away","title_rss":"NULL","source_domain":"ajc.com","text":"The Trump administration has begun detaining immigrants facing deportation in a privately operated prison owned by Clayton County, The Atlanta Journal-Constitution has learned.\nU.S. Immigration and Customs Enforcement started holding people in the Robert A. Deyton Detention Facility in Lovejoy in August, two months after Mayor Keisha Lance Bottoms took her first step toward banning them from Atlanta’s jail. As of last week, there were 69 ICE detainees — 61 men and eight women — in the Clayton prison.\nIN-DEPTH: Emails reveal tension between ICE, Atlanta on immigrant jail decision\nThe move will apparently cost taxpayers more money. The U.S. Marshals Service said The AJC must file a Freedom of Information Act request to get the current cost. But the government was paying $114 for each federal detainee held at the Clayton prison per night last fiscal year, compared to $78 at the Atlanta jail.\nThe GEO Group, a Florida-based corrections company, leases the property from Clayton and runs the prison through a contract with the U.S. Justice Department. A provision in that contract allows ICE to use the space.\nICE started using the Clayton location because of its closeness to the Immigration Court in downtown Atlanta and Hartsfield-Jackson International Airport, where the agency can put them on deportation flights.\n“We are using this facility very much in the same way that we used the” Atlanta City Detention Center, ICE spokesman Bryan Cox said.\nICE made the move to Clayton after Bottoms announced the Atlanta jail would no longer accept new detainees from the federal agency. She took that step amid enforcement of the Trump Administration’s “zero tolerance policy,” which separated many immigrant families apprehended at the Southwest border. Bottoms strenuously objected to that policy, saying she did not want the city to be complicit in it. In September, she ordered all remaining ICE detainees out of the city jail.\nMayor Keisha Lance Bottoms on Thursday signed an executive order calling for all remaining U.S. Immigration and Customs Enforcement detainees to be transferred out of the city jail as soon as possible\nAs the mayor considered her move, some advocates for immigrants feared ICE would turn to the for-profit corrections industry. They worry about the checkered past of some of these privately run immigration detention centers, including Stewart Detention Center in southwest Georgia. It is operated by CoreCivic, a corrections company based in Nashville, Tenn. Three of Stewart’s detainees have died since May of last year, two by suicide and one from pneumonia. ICE also holds detainees in privately operated immigration detention centers in Ocilla and Folkston.\nEli Echols, an Atlanta-area immigration attorney, said he and others who served on a committee that advised the mayor studied the issue with their eyes wide open.\n“No one in that room thought that denying detainees from the (Atlanta jail) was going to mean ICE would detain fewer people,” said Echols, chairman of the Georgia-Alabama chapter of the American Immigration Lawyers Association. “Nobody thought that it would mean that ICE wouldn’t find more beds.”\nThe city’s decision, he said, amounted to taking a stand against detaining people solely for immigration violations, “when the overwhelming outcome of that is a lot of pain and suffering to people who don’t pose a threat to the community.”\nMORE: Federal immigration detainee dies in South Georgia\nAzadeh Shahshahani, the legal and advocacy director for an immigrant advocacy group called Project South, served on the same committee with Echols.\n“This is an extremely concerning and, yes, characteristic move by ICE,” she said. “Their decision to detain our community members in a corporate-run detention center, which was carried out in a most secretive fashion, is yet another reason why this agency needs to be abolished.”\nCox, the ICE spokesman, said officials from his agency attended the mayoral committee’s proceedings until they were asked to leave. Several committee members said the ICE officials were asked to leave so some of the agency’s former detainees — they had pending immigration cases — could share their experiences in private.\n“Far from acting in ‘secret,’ this agency acted in good faith and attempted to participate in the committee’s discussion of the issue,” Cox said. “It was the committee that instead chose to ask ICE to leave and exclude this agency from its process.”\nThe prison in Clayton, Cox said, is suitable for ICE detainees.\n“Persons in ICE custody are in civil immigration detention and are held in compliance with ICE detention standards,” he said.\nGEO Group referred questions to the U.S. Marshals Service and ICE.\nClayton first approved leasing the prison property — a former county jail — to GEO in 2007 for $166,667 a month, plus $25,000 a month for payments in lieu of taxes. GEO also agreed to pay Clayton $250,000 in community impact fees.\nClayton County Commission Chairman Jeffrey Turner, a former county police chief who wasn’t on the commission when the lease was signed, said GEO and its employees are contributing to Clayton.\n“They buy housing in Clayton County and they shop and eat in Clayton County. So that is always a plus,” he said. “GEO Group has been a great community partner. They have been clearly visible in our community when there are activities. And they are always willing to lend a helping hand in sponsorships and stuff like that.”\nAt the same time, Turner, like Atlanta’s mayor, opposes detaining people who are accused only of immigration violations.\n“That is just the Christian in me, I guess. And I am about family,” he said. “There has got to be a better way to deal with that situation than separating families. I never will agree with that policy.”\nTurner added he would study Clayton’s lease with GEO.","url":"https://www.ajc.com/news/state--regional-govt--politics/ice-holding-detainees-clayton-prison-after-atlanta-turned-them-away/QN3BqK4AofVTNAwMhgciPN/"}
