{"authors":["Associated Press"],"date_download":"2018-10-23 02:03:24","date_modify":"2018-10-23 02:03:24","date_publish":"2016-01-28 16:46:46","description":"WASHINGTON (AP) — Donald Trump, Ted Cruz and Bernie Sanders are energizing voters as the first balloting of the 2016 presidential race nears. The maverick co...","filename":"data/vaneerConsumption/IconoclasticpresidentialhopefulsworryDemsGOPinHouse.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:fa4b651ff55244f4a66ea0d12dcaeb7e-2vdWmEltwXfba0ce28e632ab6459-395_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420535_Iconoclast-presidential-hopefuls-worry-Dems-GOP-House_1540260204.html","title":"Iconoclastic presidential hopefuls worry Dems, GOP in House","title_page":"Iconoclastic presidential hopefuls worry Dems, GOP in House | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Iconoclastic presidential hopefuls worry Dems, GOP in House\nWASHINGTON (AP) — Donald Trump, Ted Cruz and Bernie Sanders are energizing voters as the first balloting of the 2016 presidential race nears. The maverick contenders also are alarming political operatives, fearing the damage each could wreak on House candidates come November.\nThe worry is that each man's take-no-prisoners appeals would alienate moderate voters in the two dozen to three dozen competitive House races expected in seats from Florida to California, often in the suburbs.\nIt seems unlikely that Republicans will lose House control. But some in the GOP envision a serious dent in the party's majority should Trump or Cruz win the nomination. Democrats worry that having Sanders atop the ticket would deflate their chances for sizable gains.\nIn this Jan. 26, 2016, photo, wearing the same shirt to show their support for Republican presidential candidate, Sen. Ted Cruz, R-Texas, Denny Swaim, left, and wife, Sandi share a laugh at a campaign event at Bridge View Center in Ottumwa, Iowa. Donald Trump, Cruz and Bernie Sanders are energizing grassroots voters as the first balloting of the 2016 presidential race draws near. Yet the three maverick contenders are also alarming political operatives over the damage each could wreak on their own parties¿ House candidates this November. (AP Photo/Jae C. Hong)\n\"Being able to talk passionately about democratic socialism may be a virtue,\" said Rep. Steve Israel, D-N.Y., who formerly led House Democrats' campaign organization and is backing Hillary Clinton in the White House race. \"I'm not sure that resonates to swing voters in the suburbs and exurbs, and those are the districts we have to win to take back the House.\"\nSanders describes his political philosophy as democratic socialism. The Vermont senator is surging among liberal and young voters with calls for universal health care and broadsides against income equality.\nCruz, a Texas Republican senator and unyielding conservative, is popular among evangelicals and tea party backers. Trump's assaults on all things establishment are resonating with working-class white voters.\nAll three have attracted support from those disaffected with Washington and the economy.\nBut political professionals think the trio's appeal to moderate voting groups such as suburban women could be weak, and that could influence races in competitive House districts.\nCruz's \"ideas are so far to the right, it makes it difficult for a swing district message to be coupled with that,\" said Tom Reynolds, a former House Republican from upstate New York who headed House GOP political operations.\nReynolds' advice to House candidates from such areas if Cruz or Trump is the nominee: \"Define what you're about so they identify you for what you are, even with all the atmospherics of what's above you.\"\nSeemingly agreeing, House Speaker Paul Ryan, R-Wis., has said his chamber will map its own conservative agenda by the party's July nominating convention.\nRepublicans control the House 247-188, including one vacant Ohio seat the GOP is certain to win; it's their biggest majority since 1930.\nSo the November balloting gives Democrats a good chance to recapture seats with the additional turnout of minority and younger voters expected in this presidential election year — an outcome they believe Trump or Cruz would enhance.\n\"Donald Trump and Ted Cruz have both shifted the conversation to the extreme right,\" improving Democrats' pick-up opportunities, said Rep. Ben Ray Lujan, D-N.M., who heads his party's House campaign committee.\nRoughly two-thirds of the contested districts are held by Republicans, including seats in the Chicago and Denver suburbs, South Florida, upstate New York and Texas. Democrats face tough fights to defend districts in Arizona; Omaha, Nebraska; New York's Long Island; Sacramento, California and Florida.\nHouse Democrats' nervousness about Sanders seems tempered by doubts that he will best Clinton for the nomination, despite his recent surge in polls.\nEven so, they acknowledge they would have to emphasize their differences with Sanders should he become their party's pick to succeed President Barack Obama. They already are distancing themselves from his socialist label and his plan to broadly increase taxes to finance his proposal for the government to provide health care for everyone.\n\"We're not running on any platform of raising taxes,\" said House Minority Leader Nancy Pelosi, D-Calif. Noting that Democrats enacted Obama's health care overhaul in 2010, she said, \"It's no use having a conversation about something that's not going to happen.\"\nEach party's ever-improving use of computer-drawn congressional districts locks in most House seats and provides a firewall against a catastrophic loss. But the concerns are widespread.\nThat's especially true about Cruz, who helped steer the GOP into a losing 2013 government shutdown battle against Obama. That fight remains politically poisonous with moderate voters and House Republican freshmen who won 2014 elections, in part, by opposing such tactics.\n\"He's taken some votes on the extreme side, and that makes them a little bit concerned,\" said Sarah Chamberlain, president of the Republican Main Street Partnership, which represents 72 congressional GOP pragmatists.\nMany Republicans view Trump's comments on Mexicans, Muslims and women as incendiary and damaging in House swing districts. But they say it's unclear whether that would be outweighed by Trump's celebrity and the attraction that his brusque approach has had for disgruntled lower-earning voters.\n\"He's said some very provocative statements, and obviously the campaigns are going to have to work through those,\" said David Winston, a consultant to House Republicans.\nIn this Jan. 26, 2016, photo, Kittie Weston-Knauer and her husband Max Knauer of Des Moines, Iowa, listen as Democratic presidential candidate, Sen. Bernie Sanders, I-Vt. speaks during a stop at the United Steelworkers Local 310L union hall in Des Moines, Iowa. Donald Trump, Ted Cruz and Bernie Sanders are energizing grassroots voters as the first balloting of the 2016 presidential race draws near. Yet the three maverick contenders are also alarming political operatives over the damage each could wreak on their own parties¿ House candidates this November. (AP Photo/Charlie Neibergall)","url":"https://www.dailymail.co.uk/wires/ap/article-3420535/Iconoclast-presidential-hopefuls-worry-Dems-GOP-House.html"}
