{"authors":[],"date_download":"2018-10-22 22:20:48","date_modify":"2018-10-22 22:20:48","date_publish":"2014-06-09 19:41:50","description":"Antarctica is a land of ice. But dive below the West Antarctic Ice Sheet, and you'll find fire as well, in the form of subglacial volcanoes.","filename":"data/vaneerConsumption/IcyHotHiddenVolcanoesMeltAntarcticGlaciersfromBelow.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/498451/140610-antarctic-glacier-4a_3e502655c00e77b880f54b1ffcedd577.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_icy-hot-hidden-volcanoes-melt-antarctic-glaciers-below-n126631_1540246848.html","title":"Icy Hot: Hidden Volcanoes Melt Antarctic Glaciers from Below","title_page":"Icy Hot: Hidden Volcanoes Melt Antarctic Glaciers from Below","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAntarctica is a land of ice. But dive below the West Antarctic Ice Sheet, and you'll find fire as well, in the form of subglacial volcanoes.\nNow, a new study finds that these subglacial volcanoes and other geothermal \"hotspots\" are contributing to the melting of Thwaites Glacier, a major river of ice that flows into Antarctica's Pine Island Bay. Areas of the glacier that sit near geologic features thought to be volcanic are melting faster than regions farther away from hotspots, said Dustin Schroeder, the study's lead author and a geophysicist at the University of Texas at Austin.\nThis melting could significantly affect ice loss in the West Antarctic, an area that is losing ice quickly.\n\"It's not just the fact that there is melting water, and that water is coming out,\" Schroeder told Live Science. \"It's how that affects the flow and stability of the ice.\"\nAntarctic heat\nResearchers have long known that volcanoes lurk under the ice of West Antarctica. This is a seismically active region, where East and West Antarctica are rifting apart. In 2013, a team of scientists even found a new volcano beneath the West Antarctic Ice Sheet.","url":"https://www.nbcnews.com/science/environment/icy-hot-hidden-volcanoes-melt-antarctic-glaciers-below-n126631"}
