{"authors":["Frank Chaparro"],"date_download":"2018-10-31 00:36:51","date_modify":"2018-10-31 00:36:51","date_publish":"2018-07-07 00:00:00","description":"Vitalik Buterin had some choice words for centralized exchange such as Coinbase and Gemini. These middlemen are some of the most powerful players in crypto.","filename":"data/vaneerConsumption/IdefinitelypersonallyhopecentralizedexchangesburninhellEthereumfounderblaststhemostpowerfulplayersincrypto.json","image_url":"https://amp.businessinsider.com/images/5ac386467a74af28008b4606-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bitcoin-may-return-to-decentralized-roots-threatens-powerful-crypto-players-2018-5_1540946211.html","title":"'I definitely personally hope centralized exchanges burn in hell:' Ethereum founder blasts the most powerful players in crypto","title_page":"    'I definitely personally hope centralized exchanges burn in hell:' Ethereum founder blasts the most powerful players in crypto - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty/John Phillips\nVitalik Buterin, the 24-year-old founder of the cryptocurrency Ethereum, had some choice words for centralized crypto exchanges.\n\"I definitely personally hope centralized exchanges burn in hell as much as possible,\" Buterin said speaking to TechCrunch.\nWhen bitcoin, the original cryptocurrency, was founded in 2008 by the anonymous Satoshi Nakamoto, the point was to create a decentralized financial future that renders middlemen useless.\nNearly 10 years later, the centralized exchanges — those folks sitting in the middle of buyers and sellers — are among the most powerful players in the market for digital currencies such as ethereum and bitcoin.\nBloomberg News estimates they brought in $3 million a day last year. And exchanges such as Gemini and Coinbase are expanding at a clip, bringing on talent from Wall Street.\n\"It's hard to ignore the irony that an asset created to allow decentralization is currently almost completely traded on centralized exchanges,\" Peter Johnson, a vice president at Jump Ventures, said in an interview.\nButerin, however, wants the crypto community to focus more on decentralization so that cryptos can more frequently trade peer-to-peer. Buterin's remarks come as so-called decentralized exchange gain more attention.\nExchanges facilitate a number of functions in trading, including holding funds, matching buyers and sellers, and settling trades between traders. The more of those functions that occur peer-to-peer, the more decentralized an exchange is. The appeal of decentralized platforms is that since more functions occur on the blockchain there is less of a chance that hackers can steal funds. Notably, one-third of centralized crypto exchanges have been hacked, according to JPMorgan.\nRadar Relay, a type of decentralized exchange, has raised approximately $10 million from a number of investors including Blockchain Capital, sources tell Business Insider. With Radar Relay, settlement occurs on the blockchain, but the company is centralized in some aspects.\nOn some decentralized exchanges, such as Ether Delta, matching is decentralized and settlement occurs directly on ethereum's blockchain. Elsewhere, Coinbase bought decentralized exchange Paradex. And venture capital investors tell Business Insider decentralized exchanges have been a hot investment idea recently.\nThis post has been updated from its original form to correct the spelling of Radar Relay.","url":"https://www.businessinsider.com/bitcoin-may-return-to-decentralized-roots-threatens-powerful-crypto-players-2018-5"}
