{"authors":["Jack Tonhaben"],"date_download":"2018-10-30 21:19:10","date_modify":"2018-10-30 21:19:10","date_publish":"2017-02-05 13:05:28","description":"The IDF conducted a five-day drill simulating a confrontation with Hamas including infiltrations by Hamas fighters from the land, sea and air.","filename":"data/vaneerConsumption/IDFConductsDrillSimulatingHamasInfiltrationinSouthernIsrael.json","image_url":"https://media.breitbart.com/media/2017/02/IDF-drill.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_02_05__1540934350.html","title":"IDF Conducts Drill Simulating Hamas Infiltration in Southern Israel","title_page":"IDF Conducts Drill Simulating Hamas Infiltration in Southern Israel","title_rss":"NULL","source_domain":"breitbart.com","text":"JERUSALEM – The IDF last week conducted a five-day drill simulating a confrontation with Hamas including infiltrations by Hamas terrorist commandos on land, sea and air.\nThe Gaza Division’s large-scale exercise, held once a year, included hundreds of reserve soldiers.\nAccording to a report in Hebrew-language website Ynet, it included scenarios in which dozens of terrorists enter Jewish communities through several entry points – attack tunnels, paragliders, and the sea.\nForces also drilled operating under incessant rocket and mortar fire on the Gaza periphery communities and the cities of Ashdod and Ashkelon.\nAccording to Ynet, there are fears Hamas may begin its next confrontation with a heavy barrage of bombs on border communities in an effort to debilitate army forces from responding.\nDuring Operation Protective Edge in 2014, five Hamas marine commandos tried to infiltrate Kibbutz Zikim before they were killed by the IDF.\nIsrael’s defense establishment has warned that the army must especially prepare for the strengthening of Hamas’s marine commando unit, which is believed to have more divers today than during the 2014 war.\nThe drill included special units of the IDF, as well as the mandatory service battalions that routinely patrol and secure the Gaza Strip border fence and the communities close to the border.\nThe army also practiced an orderly evacuation of communities close to the border according to a plan formulated over the past year by the IDF’s Home Front command and Southern Command.\n“The Gaza Division drill was an excellent opportunity to strengthen the readiness and capabilities of the division’s men in mandatory and reserve service. The division simulated various scenarios in its entire territory,” said IDF Division Commander Brig.-Gen. Yehuda Fuchs.\nThe large-scale exercise was planned in advance as part of the IDF’s annual training program.","url":"https://www.breitbart.com/middle-east/2017/02/05/idf-conducts-drill-simulating-large-scale-hamas-infiltration-southern-israel/"}
