{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:01:44","date_modify":"2018-10-30 21:01:44","date_publish":"2016-09-18 15:19:16","description":"Following five terror attacks in two days in Jerusalem and the West Bank, the IDF deployed an extra infantry battalion to Hebron.","filename":"data/vaneerConsumption/IDFDeploysReinforcementsToWestBankFollowingFiveWeekendTerrorAttacks.json","image_url":"https://media.breitbart.com/media/2016/07/west-bank-police.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_18__1540933304.html","title":"IDF Deploys Reinforcements To West Bank Following Five Weekend Terror Attacks","title_page":"IDF Deploys Reinforcements To West Bank Following Five Weekend Terror Attacks","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Following six terror attacks in two days in Jerusalem and the West Bank, the IDF deployed an extra infantry battalion to the West Bank city of Hebron on Saturday evening in preparation for a continued surge in violence.\nThe IDF said reinforcements from the Kfir Brigade’s Shimshon Battalion were sent “in accordance with situation assessments following recent terror attacks” in which two soldiers and four civilians were wounded in four separate locations.\n“The motivation and inspiration to carry out attacks against Israelis remains strong. That’s why the IDF is strengthening its operational and intelligence efforts to stabilize the situation on the ground and deter these acts of terror,” the Times of Israel cited a military official as saying.\nThe weekend attacks included three stabbings, a car ramming and a rock throwing, raising fears among the Israeli public that the wave of violence that has abated in recent months is on the rise again.\n“[The Muslim holiday of Eid al-Adha] and September are always more susceptible to spikes in violent Palestinian activities,” the official said.\nHe added, however, that even though the attacks were “a change from recent weeks, we cannot currently point to any major change on the ground that indicates it will increase.”\nPublic Security Minister Gilad Erdan charged that Palestinian incitement – particularly on social media in the run-up to the holiday period when Jews visit the flashpoint Temple Mount – is to blame for the surge of attacks.\n“These are tense days,” Erdan told Channel 2 on Friday.\nOn Saturday morning, an IDF soldier was lightly wounded in a stabbing attack in the West Bank city of Hebron committed by 25-year-old Hatem Abdel-Hafiz al-Shaloudi, who was shot and killed by security forces.\nA video of the attack was broadcast on the internet and television, and shows al-Shaloudi approaching a soldier at a checkpoint and presenting him with his identification papers. The soldier looks down at the paper at the same time as al-Shaloudi is seen pulling out a knife and lunging at him. Al-Shaloudi proceeds to run in the direction of another soldier before being shot and killed.\nWatch the video here:\nAl-Shaloudi’s family said in the aftermath of the attack, “The army executed him in cold blood.”\nFriday saw four attacks against Israelis.\nIn the morning, a terrorist visiting from Jordan was shot and killed as he attempted to stab police officers at the Damascus Gate in Jerusalem, marking the first time a Jordanian national attempted a terror attack in the wave of violence that began last September.\n“The Ministry of Foreign Affairs condemns the savage act of the Israeli occupation army in premeditatedly shooting Saed Amro, a Jordanian citizen, on Friday near the Damascus Gate in occupied Jerusalem, leading to his immediate death,” Jordanian Foreign Ministry spokesman Sabah al-Rifai said.\nAround the same time, a soldier shot and killed a Palestinian man and seriously wounded a Palestinian woman, both 18 years old, who carried out a car-ramming attack near a Jewish settlement next to Hebron, wounding three Israeli teenagers.\nIn the afternoon, a bus driver was also lightly wounded while driving outside Jerusalem near the Ma’ale Adumim settlement when Arab assailants hurled rocks and glass canisters full of paint, shattering his windshield. A 15-year-old boy was arrested the following day.\nOn Friday evening, a terrorist stabbed a soldier in Hebron. The soldier was lightly wounded and the assailant was shot and killed by security forces.","url":"https://www.breitbart.com/middle-east/2016/09/18/idf-deploys-reinforcements-west-bank-following-weekend-terror-attacks/"}
