{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:05:29","date_modify":"2018-10-30 21:05:29","date_publish":"2018-06-26 14:23:03","description":"Israeli military has set up a \"war room\" to handle the wave of \"kite terror\" emanating from the Gaza Strip.","filename":"data/vaneerConsumption/IDFEstablishesWarRoomToFightKiteTerror.json","image_url":"https://media.breitbart.com/media/2018/05/gaza-kite.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_06_26__1540933529.html","title":"IDF Establishes 'War Room' To Fight Kite Terror","title_page":"IDF Establishes 'War Room' To Fight Kite Terror","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – The Israeli military has set up a “war room” to handle the wave of “kite terror” emanating from the Gaza Strip, which the IDF says the Hamas terror group is coordinating.\nSince the end of April, thousands of kites, balloons and latex condoms have been flown over the border sparking hundreds of blazes and destroying thousands of acres of agricultural farmland, causing millions of shekels in damage.\nUsing advanced radar technology, the war room aims to gather as much information as possible on incendiary devices being flown over the border into Israel, Hebrew news site Walla reported. Drones and other defense measures are dispatched to the devices’ location. The war room, which will include volunteers as well as professionals, also aims to send emergency fire services to put out blazes before they have the chance to cause serious harm.\nThe IDF on Sunday accused the Hamas terror group of being behind kite terror from the Gaza Strip, and revealed the identities of key Hamas operatives suspected of organizing the launch of incendiary kites, balloons and condoms into Israel to spark fires.\n“Hamas is leading this phenomenon of explosive and incendiary kites, it is behind the launching of them and it will bear the responsibility of this terrorist activity,” the army said.\nThe IDF identified Bassem Hatem Abd Hazin, Mutasim Fathi Atia Nabahin, Muhana Ibrahim Abd Hamdan and Amro Hussein Muhammad Abu Deif as being the ringleaders of the kite terror.\nThe army also released surveillance footage showing masked Hamas operatives taking balloons from an observation post belonging to the terror group.\n“The preparation of these kites is being done in large numbers and in an organized way by terror operations of the Hamas terror group,” the army said.\nAccording to the military, Hamas appropriated the kite tactic from the Palestinian masses.\n“After the phenomenon began as a form of popular terrorism, in recent weeks it has been noticed that Hamas is leading this process as an organized action in which incendiary and explosive kites and balloons are launched from the border of the Gaza Strip toward Israeli territory,” the IDF said.\n“The IDF is working with increasing force against these terror cells — by shooting near them — against the terrorist infrastructure that belongs to them and against Hamas targets deep in the Gaza Strip,” the army said. “We will not allow this terror to be a threat to the citizens of Israel and its land.”\nAttorney General Avichai Mandelblit said last week that incendiary devices are a “legitimate military target.”\nThe devices are either outfitted with burning coal or petrol, or explosives.","url":"https://www.breitbart.com/middle-east/2018/06/26/idf-establishes-war-room-to-fight-kite-terror/"}
