{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:21:36","date_modify":"2018-10-30 21:21:36","date_publish":"2016-01-24 13:40:34","description":"TEL AVIV - The Gaza-based terror group Hamas has rehabilitated itself with cross-border terror tunnels and rocket firing systems, and is ready for a new |","filename":"data/vaneerConsumption/IDFOfficialHamasReadyforFreshHostilitiesWithNewTerrorTunnelsandRockets.json","image_url":"https://media.breitbart.com/media/2015/06/Hamas-terror-tunnel-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_01_24__1540934496.html","title":"IDF Official: Hamas Ready for Fresh Hostilities With New Terror Tunnels and Rockets","title_page":"IDF Official: Hamas Ready for Fresh Hostilities With New Terror Tunnels and Rockets | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – The Gaza-based terror group Hamas has rehabilitated itself with cross-border terror tunnels and rocket firing systems, and is ready for a new round of hostilities, a senior defense official said Friday.\n“Hamas in Gaza has recovered, and (its military wing) is ready to confront Israel again if it is asked to do so,” the Israeli official told leaders of local authorities of communities on the border with Gaza, according to a report on the Ynet news website.\n“They have restored their tunnels, rocket firing systems, intelligence gathering operations, and observation posts,” he added.\nHowever, the official added that the Israeli security establishment does not believe that Hamas is seeking another major round of conflict with Israel in and around Gaza. Instead, the Islamist terror group hopes to gain control of rival Salafist groups that have launched a number of attacks on Israel from the Palestinian territory in recent months.\nHamas is currently believed to have as many terror tunnels reaching under the Gaza border into Israel as before the summer 2014 conflict.\n“The reasonable assessment is that the number of tunnels that extend beneath the border (into Israel) is now close to the number prior to (2014’s) Operation Protective Edge,” Haaretz reported.\nThe IDF has said that it destroyed more than 30 Hamas terror tunnels during the summer conflict, about one-third of which extended beneath the Gaza border into Israel and were going to be used for a series of coordinated attacks against the Jewish state. “They planned to send 200 terrorists armed to the teeth toward civilian populations,” an IDF spokesman said in the wake of the 50-day conflict. “This was going to be a coordinated attack. The concept of operations involved 14 offensive tunnels into Israel. With at least 10 men in each tunnel, they would infiltrate and inflict mass casualties.”\nEarlier this month, Breitbart Jerusalem reported that Hamas leader Ismail Haniyeh had warned that the movement’s military wing will “stun the whole world with its power of resistance.”\nThe group is also cooperating with local branches of the Islamic State to smuggle weapons.","url":"https://www.breitbart.com/middle-east/2016/01/24/idf-official-hamas-ready-for-fresh-hostilities-with-new-terror-tunnels-and-rockets/"}
