{"authors":[],"date_download":"2018-10-22 21:07:27","date_modify":"2018-10-22 21:07:27","date_publish":"2014-06-04 09:56:16","description":"Marisol Serrato chose not to walk at her high school graduation on Tuesday without her twin sister, Marisa, killed in a bus crash two months ago.","filename":"data/vaneerConsumption/IDiedWithHerTwinWontAttendGraduationWithoutSister.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_i-died-her-twin-wont-attend-graduation-without-sister-n122076_1540242447.html","title":"'I Died With Her': Twin Won't Attend Graduation Without Sister","title_page":"'I Died With Her': Twin Won't Attend Graduation Without Sister","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy Tony Shin, NBCLosAngeles.com\nWhat was supposed to be a day of celebration for Marisol Serrato was another day of sadness as she chose not to walk at her high school graduation on Tuesday without her twin sister, Marisa, who died in a tragic Northern California tour bus crash two months ago.\n\"The pain was unbearable and unimaginable. I'd never think I'd feel the pain that strong,\" Marisol said. \"And I still walk, I eat, and sometimes I smile, but I feel dead inside. I feel like I died with her.\"\nMarisa was one of 10 people killed in horrific April 10 crash. The 17-year-old was traveling with a large group of Southern California high school students for a spring tour at Humboldt State University.\n\"The sun can't shine the same way,\" Marisol said. \"Sometimes I feel like because of the pain, I feel in this world it's almost as if I've been living in hell, and inch by inch, we have to crawl out to the light. She just got ahead of us.\"\nMarisol was on the same trip, but she took a different bus.\n\"As the days go by, the pain subsides a little because I feel like I'm getting closer to her,\" Marisol said. \"I cry in the nights and I still call for her name.\"\nMarisol still plays her guitar, something the two shared. But now she plays alone, her twin's guitar next to her.\n\"(Having a twin) is a bond that's almost unexplainable because it's a person that knows your every thought and understands you in a way that no other person can understand you perfectly,\" she said.\nBoth Marisol and Marisa were outstanding students at Norte Vista High School. And they were both accepted to several colleges. Since the crash, Marisol hasn't returned to school. But she will still get her diploma, as will her sister, posthumously.\n\"Me and my sister waited so long for this (graduation) day, and also for my birthday, which was three days ago, to turn 18,\" Marisol said. \"I didn't even celebrate it. I was at the cemetery all day that day just hanging out with my sister. I can't...I've never blown candles out on my own.\"\nMarisol has decided not to attend her high school graduation.\n“I imagined and envisioned walking next to her, and I can't find the strength to walk there alone without her,\" Marisol said.\nFamily members understand why Marisol is choosing not to go, but they also feel tremendous sadness because of how hard the twins worked to get good grades.\n\"That was my dream to see them graduating,\" Luis Miguel Serrato said.\n\"It was supposed to be a big day...to finally reap the rewards of those four years they struggled,\"said the twins' sister, Cristina Serrato.\nAlthough she won't be at her graduation ceremony, Marisol is planning to attend the first day of college at La Sierra University to carry on her and her sister's dream of getting a college degree.\n“Mostly I could say our dreams, because we shared the same goals,\" Marisol said.","url":"https://www.nbcnews.com/news/us-news/i-died-her-twin-wont-attend-graduation-without-sister-n122076"}
