{"authors":[],"date_download":"2018-10-30 14:24:06","date_modify":"2018-10-30 14:24:06","date_publish":"2015-07-24 00:00:00","description":null,"filename":"data/vaneerConsumption/IdontneednostinkingCongress.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_i_dont_need_no_stinking_congress_1540909446.html","title":"I don't need no stinking Congress","title_page":"I don't need no stinking Congress","title_rss":"NULL","source_domain":"americanthinker.com","text":"The president has found out that he can get his way by bypassing congress, and unfortunately, like Fred C. Dobbs, Boehner and McConnell are not up for the fight.\nImplement green energy policies? Easy. Use the EPA to implement CO 2 emissions to favor green energy.\nImplement sub-prime loan policy? Easy. Use the DOJ to threaten lawsuits.\nImplement immigration policies? Easy. Use U.S. Citizenship and Immigration Services (USCIS) and Immigration and Customs Enforcement (ICE) to implement amnesty for so-called DREAMers, which includes work permits and medical benefits for low-income illegal aliens funded by citizen taxpayers.\nImplement gun control policies? Easy.\nIn March, Breitbart said, the NRA warned that Loretta Lynch would be \"Eric Holder 2.0.\" Nevertheless, 10 GOP Senators joined with Democrats to make her the top law enforcement officer in the country. Among those voting for Lynch was Sen. Lindsey Graham, R-S.C., who now wants to be president. Lynch’s DOJ, Breitbart said, \"now has the Second Amendment in its sights.\"\nAnd so it goes:\nObama's unilateral actions will also include issuing federal rules and regulations at an accelerated pace. A survey by Politico, released Monday, finds that, \"The Obama administration is preparing another active year of executive action in 2015, pumping out new rules and enforcing others for the first time – setting tougher standards on everything from air pollution to overtime pay to net neutrality, food safety, commercial drones, a college ratings plan and a crackdown on for-profit colleges that don't prepare their students for well-paying jobs. There's even going to be the first draft of a rule for organic pet food.\nForeign policy:\nUnilateral intervention in Syria? Libya? Easy.\nBut now comes the whopper. Approve the Iran “treaty.” Obama doesn’t need no stinking congressional approval. Obama goes to the U.N. for approval. Makes you wonder the “unthinkable” question posed by Thomas Sowell:\n… the Constitution makes it necessary for the President to get a two-thirds majority in the Senate to make any treaty valid. Yet he has maneuvered the Republican-controlled Congress into a position where they will need a two-thirds majority in both Houses to prevent his unilaterally negotiated agreement from going into effect -- just by not calling it a treaty. If he is that savvy at home, why is he so apparently incompetent abroad? Answering that question may indeed require us to “think the unthinkable,” that we have elected a man for whom America’s best interests are not his top priority.\nUnder Obama, the U.N. has become the fourth branch of government, superseding Congress. “I pledge allegiance to…?”","url":"https://www.americanthinker.com/blog/2015/07/i_dont_need_no_stinking_congress.html"}
