{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 22:10:40","date_modify":"2018-10-30 22:10:40","date_publish":"2015-12-08 13:06:50","description":"Former California governor Arnold Schwarzenegger says he \"doesn't give a ***\" if you agree with him on climate change.","filename":"data/vaneerConsumption/IDontGiveaifWeAgreeAboutClimateChange.json","image_url":"https://media.breitbart.com/media/2015/02/Arnold-Schwarzenegger-Hydrogen-Highway-Ann-Johannson-Associated-Press.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_12_08__1540937440.html","title":"'I Don't Give a **** if We Agree About Climate Change'","title_page":"Schwarzenegger: 'I Don't Give a **** if We Agree About Climate Change'","title_rss":"NULL","source_domain":"breitbart.com","text":"Former California governor Arnold Schwarzenegger says he “hears” the concerns of those who question the “science of climate change”–but he still “doesn’t give a ***” if you agree with him.\nIn a post to Facebook Monday, Schwarzenegger, who is currently in Paris attending the Cop21 international climate change conference, said that he receives regular correspondence from individuals who doubt the veracity of scientists’ global warming claims.\n“I want you to know that I hear you,” the former governor and actor writes. “Even those of you who say renewable energy is a conspiracy. Even those who say climate change is a hoax. Even those of you who use four letter words.”\nSchwarzenegger adds that he has three questions of his own:\n“First – do you believe it is acceptable that 7 million people die every year from pollution? That’s more than murders, suicides, and car accidents – combined. Every day, 19,000 people die from pollution from fossil fuels. Do you accept those deaths? Do you accept that children all over the world have to grow up breathing with inhalers? Now, my second question: do you believe coal and oil will be the fuels of the future?","url":"https://www.breitbart.com/local/2015/12/08/schwarzenegger-dont-give-agree-climate-change/"}
