{"authors":["Merrill Hope"],"date_download":"2018-10-30 21:19:57","date_modify":"2018-10-30 21:19:57","date_publish":"2015-09-18 13:05:41","description":"Council of American-Islamic Relations (CAIR) Dallas-Fort Worth director Alia Salem said that is Ahmed Mohamed's name was \"Jimmy,\" school district officials in Irving, Texas, would not have jumped to the conclusion that his clock project was a hoax bomb.","filename":"data/vaneerConsumption/IfAhmedWasJimmyNoOneWouldJumptoHoaxBombConclusionsaysCAIRDFWDirector.json","image_url":"https://media.breitbart.com/media/2015/09/ap_ahmed-mohamed_ap-photo1-wi-420x2951.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_09_18__1540934397.html","title":"If Ahmed Was 'Jimmy' No One Would Jump to 'Hoax Bomb' Conclusion, says CAIR DFW Director","title_page":"If Ahmed Was 'Jimmy' No One Would Jump to 'Hoax Bomb' Conclusion, says CAIR DFW Director","title_rss":"NULL","source_domain":"breitbart.com","text":"Council of American-Islamic Relations (CAIR) Dallas-Fort Worth director Alia Salem said that if Ahmed Mohamed’s name was “Jimmy,” school district officials in Irving, Texas, would not have jumped to the conclusion that his clock project was a bomb hoax.\nNot everyone gets invited to the White House when they get in trouble at school but that is exactly what happened to Texas high school freshman Ahmed Mohamed. His digital suitcase clock was perceived to be a“hoax bomb” by school administrators. CAIR Dallas-Fort Worth director Salem decried “They automatically jumped to a conclusion that I don’t believe they would’ve jumped to had he been ‘Jimmy.'”\nSadly, on a regular basis, “Jimmy” comes face-to-face with the very same stringent zero tolerance policies as did Ahmed Mohamed. A 2011 Texas A&M University study identified that 30 percent of Texas students in grades 7-12 have received out-of-school suspension (OSS), while 15 percent were either suspended or expelled at least 11 times. Education Commissioner Michael Williams called this rate too high.\nBreitbart Texas reported the case of nine-year-old Aiden Steward, accused of a terroristic threat for allegedly “terrorizing” his classmates. No suitcase clock for this budding magician. He brought a Lord of the Rings “magic ring” to a Kermit, Texas, elementary school. He told the other kids that he would make them “disappear” with a Hobbit prop.\nWhen it comes to perceived threats, 14-year-old Ahmed stands among a long list of other public school students from around the country who inadvertinently terrorized school authorities with poptart guns, Nerf guns, Lego guns, pointed “pow pow” finger guns, a Hello Kitty bubble gun, and a plastic cap gun incident that remained on one boy’s permanent records.\nEven doing the right thing can go wrong in zero tolerance times. Bryan, Texas, school officials suspended high school senior Christian Tumax for intervening when bullies roughed up a special needs boy last year.\nIn Houston, teen Chaz Seale got suspended for three days when he accidentally packed a beer with lunch when rushing to school. Once he realized Coors Lite sat in his lunch bag, he told his teacher. Livingston High School said thank you for his honesty by handing Seale the maximum 60 days for disciplinary alternative school even though Seale had no prior criminal record or history of trouble.\nSometimes students have no idea they broke a code of conduct. Officials barred a Texas high school senior from his own graduation after beer-sniffing dogs found an unopened beer can his mother forgot to remove from a cooler in the family truck the teen parked on campus.\nOther times, self-defense is no defense. In the Dallas suburb of Lewisville, high school officials suspended a straight-A student, who acted in self-defense when he was bullied, and spit and urinated upon while in the school showers last April. Administrators based their decision on “discipline clearly laid out in our Student Code of Conduct.”\nThe Student Code of Conduct outlines infractions and punishments, all written in accordance with the Texas 1995 Safe Schools Act and Chapter 37 of the Texas Education Code. They address threats, hoaxes, plus perceived and discretionary threats. Their bring harsh blanket consequences. But zero tolerance is the backbone of federal “safe schools” and “threat assessment” plans which came in response to Columbine (1999) and later Sandy Hook (2012). The resulting Safe School Initiative, a project of the US Department of Education and the US Secret Service, intends to prevent school shootings. It influences zero tolerance policies, some that started under Title IV of the Clinton Administration’s Improving America’s Schools Act of 1994, part of Goals 2000, which later emerged as Democrat Senator Ted Kennedy’s brainchild, No Child Left Behind Act, which was signed into law by President George W. Bush.\nIn Texas, zero tolerance policies have broad discretionary leeway and the education code gives school districts the authority to refer students for discretionary offenses deemed “disruptive.” The problem is, “disruptive” is a broadly used and relative term in compliance-seeking times.\nMinors in Texas can be charged with juvenile versions of class A, B, and C misdemeanors. Advocacy groups pushed Texas legislators to downgrade or eliminate some of the lesser class C charges over the past few years including chewing gum in schools, disrupting class, profanity, fighting with other students, talking back to the teacher, failure to follow school rules and the reckless damaging of school property. This year, lawmakers decriminalized truancy.\nUnforgiving zero tolerance policies most affect boys, something else Ahmed has in common with “Jimmy”. Over a decade ago, Christina Hoff Sommers first introduced the war against boys, the emasculation of the classroom as a result of misguided feminism. More recently, she pondered if public school was too hostile towards boys. “In grades K-12, boys account for nearly 70% of suspensions, often for minor acts of insubordination and defiance,” she wrote.\nEven former U.S. Attorney General Eric Holder noted these policies “too often inject the criminal justice system into the resolution of problems.” The high incidence of minorities on the school-to-prison pipeline concerned him.\nThis kind of negative contact with the law enforcement process can radically impact any student’s future. Organizations such as Texas Public Policy Foundation (TPPF), Texas Appleseed, and the Texas ACLU focus on this school-to-jail pipeline because it creates paper trails. Although juvenile records can be sealed, they can also be opened for “limited purposes.” College and career ready applications no longer ask if “Jimmy” was convicted of a crime, they ask if he was ever charged with one.\nLast school year, frustrated parent Angela Abella, in the Fort Worth-based Northwest Independent School District (ISD), told Breitbart Texas, “My son has been in [In-School Suspension] so many times for being late to class or being in the hall after the bell rings or listening to his music during class when he’s not supposed to. It’s been ridiculous.”\nMohamed described questioning by a principal and school resource officers (SRO) as: “They were like ‘So you tried to make a bomb?” even though the teen insisted he it was a clock. Similarly, a Texas parent, in the throes of a pending action, told Breitbart Texas about their teenaged son under condition of anonymity. A school administrator and an SRO detained the student over an alleged offense, pressuring him for almost an hour to give a written confession. The parents learned of this questioning after the fact.\nInterestingly, while Salem and others continue to bang the Islamophobia drum, the Dallas Morning News now says zero tolerance policies “may have been a factor” in Ahmed Mohamed’s case. Tell that to “Jimmy“.\nFollow Merrill Hope on Twitter @OutOfTheBoxMom.","url":"https://www.breitbart.com/border/2015/09/18/ahmed-jimmy-no-one-jump-hoax-bomb-conclusion-says-cair-dfw-director/"}
