{"authors":[],"date_download":"2018-10-30 14:31:17","date_modify":"2018-10-30 14:31:17","date_publish":"2015-07-20 00:00:00","description":null,"filename":"data/vaneerConsumption/Ifbeinggayisnotachoicewhysomuchproselytizing.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_if_being_gay_is_not_a_choice_why_so_much_proselytizing_1540909877.html","title":"If being gay is not a choice, why so much proselytizing?","title_page":"If being gay is not a choice, why so much proselytizing?","title_rss":"NULL","source_domain":"americanthinker.com","text":"If being gay is not a choice, why so much proselytizing?\nScott Walker was asked whether being gay was a choice. This was important to ask, because homosexuals are an estimated 1%-2% of the population (not including transvestites who declare themselves gay, which actually makes them straight), so I understand the need to constantly talk about this little group at the expense of issues affecting the other 98%. So Walker was asked whether being gay is a choice, and so far, unlike other gay-topical questions, he has given only one answer, which is \"I don't know.\"\nBut what I want to know is, if being gay isn't a choice, why is there such an incredible amount of gay proselytizing in the schools and in the media and on film and TV and in books? After all, if people are born gay, why do we need these steady streams of reminders how great it is to be homosexual? Whether it’s an American University art exhibit made with homosexual blood, cartoons for toddlers featuring princes marrying each other, articles in the media about gay events like a homosexual rodeo, the State Department picking an \"ambassador to homosexuality,\" product advertisements like Tylenol promoting lesbianism, forcing firefighters to march in a gay parade, or letting soldiers fly the homosexual flag over military bases, there seems to be a tremendous propaganda effort to promote this behavior which is supposedly preset at birth. I don't know for sure if being gay is a choice, but I will tell you one thing I do know for sure: having gay sex is most definitely a choice, just like the choice of smoking or drinking alcohol. People can have impulses and choose to resist them. All these messages do is promote very risky behavior that can cause hepatitis, AIDS, and anal incontinence – yes, too much poking down there, and you'll have to wear a diaper the rest of your life. This is the kind of behavior that is being promoted. I think some people may have these urges and choose to act on them or not to, but when society promotes this behavior, all things being equal, more people will choose to act on them and get terrible sicknesses. And that's not gay. If anything, that's sad. This article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/07/if_being_gay_is_not_a_choice_why_so_much_proselytizing.html"}
