{"authors":["Elizabeth Aguilera","Laurel Rosenhall","Dan Morain"],"date_download":"2018-10-30 23:30:09","date_modify":"2018-10-30 23:30:09","date_publish":"2017-01-21 12:52:00","description":"The state Department of Motor Vehicles reports it has issued more than 792,000 licenses to undocumented drivers. Now California is preparing for the possibility that the administration of President-elect Donald Trump—who campaigned on a promise to deport at least 2 million people—might demand access to various state databases that would reveal the names and locations of undocumented immigrants, such as the one maintained by the DMV. But in a state where Democrats hold the governor’s office and supermajorities in both houses of the Legislature, lawmakers say if the Trump administration does come knocking for such state data, their answer will be a vociferous “no.”","filename":"data/vaneerConsumption/IffedstrytoIDdeportableimmigrantsusingCaldatastatewillblockaccess.json","image_url":"https://calmatters.org/wp-content/uploads/favicon-150x150.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_trump_california__1540942209.html","title":"If feds try to ID deportable immigrants using Cal data, state will block access","title_page":"If feds try to ID deportable immigrants using Cal data, state will block access | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"It wouldn’t be election season without a bunch of big-money interests trying to tell you how to vote. This year, with hundreds of millions of dollars rolling into initiative campaigns over housing and health care, California has hit a new record.\nThe $111 million campaign against Proposition 8 on kidney dialysis clinics amounts to the most money poured into a single side of a ballot measure in the United States—at least since electronic record-keeping began in 2002, and possibly ever.\nHere are three industries spending huge sums to influence your vote:\nLandlords and real estate agents outraising rent-control advocates 3-to-1\nLandlords are largely bankrolling the campaign against Proposition 10, which would allow local governments to expand rent control.\n“They don’t want to see their property values decline, it’s that simple,” said Steve Maviglio, spokesman for the No on Prop. 10 campaign, which has raised $74.7 million.\nProp. 10 would repeal a 1995 state law that forbids cities from applying rent control to single-family houses, or any type of home built after 1995, and allows landlords to raise apartment rent any time a tenant moves out. Instead the ballot measure would give cities the option to expand rent control to cover more homes—making it harder for landlords to turn a profit.\n“It’s about their future, their bottom line. That’s why they’re spending so much,” said Charly Norton, spokeswoman for the Yes on prop. 10 campaign, which has raised $25.9 million, mostly from the AIDS Healthcare Foundation.\nSupporters say Prop. 10 is necessary because homelessness is on the rise and a growing share of Californians spend more than half their income on rent. Opponents say it will worsen the state’s housing shortage by discouraging developers from building more homes.\nDonors against Prop. 10 include corporate property owners like Blackstone, Essex and Equity Residential, as well as many individual landlords. The biggest donor is the California Association of Realtors, which has given $8 million to the campaign.\nThe Realtors association also has poured $13.2 million into the campaign for Proposition 5, making it the sole funder of that push to change California’s property tax law.\nCalifornians now generally pay much higher property taxes if they buy a new home after selling a house they’ve owned for many years. That’s because property taxes are based on the sales price of a house, not how much it’s worth as it appreciates over time.\nThis initiative would allow three categories of homeowners—those over 55, disabled or who lost their homes in natural disasters—would keep the property tax levels of the home they sold if they buy a new home.\nReal estate agents say it would encourage older Californians to sell their homes, making more houses available in our tight market. (Experts disagree.) Of course, it also would boost their commissions.\n“It will give a huge windfall to the real estate industry,” said Mike Roth, spokesman for the campaign against Prop. 5, which has raised about $3.2 million, largely from public employee unions that could see cuts if the government loses tax revenue.\nSteve White, president of the California Association of Realtors, insisted it’s about “meeting a need. The unaffordability of housing in California…is largely dictated by lack of availability,” he said. “We have tens of thousands of homes that could be waiting for all those tens of thousands of younger families.”\nDialysis clinics outraising labor opponents 5-to-1\nThe most expensive fight on the California ballot this year is over Proposition 8, which would limit profits for dialysis companies. The businesses are fighting back, pouring $111 million into the campaign against Prop. 8—most of it from two dialysis companies, DaVita and Fresenius.\n“Prop. 8 was designed to have a negative impact on dialysis clinics in California, and that’s why the groups that are opposed are fighting it so heavily,” said Kathy Fairbanks, spokeswoman for the No Prop. 8 campaign.\nShe said the measure wouldn’t allow dialysis clinics to be reimbursed by insurance companies for many routine business expenses. Ultimately, that would cause companies to close clinics, Fairbanks said, giving patients fewer places to seek treatment.\nWorkers at dialysis clinics are not unionized. A labor group that represents other health care workers has had its sights on organizing dialysis workers, and put Prop. 8 on the ballot as part of a much larger feud within the industry.\n“This record amount of (campaign) spending speaks to the priorities of the dialysis corporations which is to protect their profits,” said Sean Wherley, spokesman Service Employees International Union – United Healthcare Workers, the sponsor of Prop. 8.\nThe Prop. 8 campaign has raised $20.3 million, most of it from SEIU United Healthcare Workers. The union argues that dialysis clinic companies are netting huge profits while allowing shoddy health and safety conditions at some clinics. Limiting the companies’ profits to 15 percent, as Prop. 8 calls for, would encourage the clinics to put more money into improving patient care, the union argues.\nAmbulance companies outraising labor opponents more than 600-to-1\nColorado-based company American Medical Response put Proposition 11 on the ballot and contributed most of the $29.9 million raised to support it. The measure would allow private ambulance companies to require workers to remain on-call during breaks, so they can respond to an emergency even if it comes while they’re eating lunch. That’s already the common practice, but this measure comes in response to a court ruling that security guards cannot be required to stay on-call while they’re on breaks. Ambulance companies don’t want to be held to the same standard.\n“If applied to the ambulance industry, it would have a significant public safety risk,” said Marie Brichetto, spokeswoman for the Yes on Prop. 11 campaign.\nOpponents, the emergency responders who work on ambulances, aren’t raising much money—the American Federation of State, County & Municipal Employees union contributed just $47,000 to oppose Prop. 11.\n“This is a classic ‘big corporation against its own employees,’” said Jason Brollini, president of the United EMS Workers union that is affiliated with AFSCME.\nHe contends the ambulance companies’ real motive with Prop. 11 is to eliminate any liability they could face from employees who sue over not getting the extra pay they’re supposed to receive when their breaks are interrupted by an emergency call.","url":"https://calmatters.org/articles/trump_california/if-feds-try-to-id-deportable-immigrants-using-cal-data-state-will-block-access/"}
of pipeline—using information from state agencies, universities or local jurisdictions—would be “a political, legal and policy disaster….You’re going to confirm to immigrants that you can’t trust government and you shouldn’t be sharing information with government and you should stay as far away as possible from government.”\nBut advocates of stricter immigration enforcement insist that under the Immigration and Nationality Act, which outlines provisions for enforcement, the federal government has a right to the information held by any agency or state.\n“It’s a direct violation of federal law for California to have a policy that prohibits its agencies or officials from sharing immigration status information with immigration authorities,” said Dave Ray, spokesman for FAIR, the Federation for American Immigration Reform, which advocates for strict limits on immigration and increased enforcement and deportation.\nWith so much up in the air, the city of Los Angeles has stopped offering assurances. “We are in new territory,” said Linda Lopez, who heads the Los Angeles Mayor’s Office of Immigrant Affairs. “What we are hearing and learning from federal agencies and some partners is that while there will be some firewalls and protections…it’s still uncertain.”\nThat’s why, for now, the city is advising undocumented immigrants to hold off on new applications for programs. For those already enrolled in the system and up for renewal, officials recommend they renew as soon as possible.\nOf course, some data is already in the hands of the Obama administration, and soon, the Trump administration. The prime example is the Deferred Action for Childhood Arrivals database, a list of some 741,546 undocumented youth—one-third of them Californians—illegally brought into the country as children. In 2012, President Obama signed an executive order granting qualified applicants temporary reprieve from deportation and work permits.\nThat DACA database is held by the federal Citizenship and Immigration Services agency, which promises to keep applicants’ information secure from law enforcement although that could change in the future. This is the program President-elect Trump has pledged to cancel upon taking office.\nState leaders are urging Trump to keep the program but do not really have a say over what happens to that information.\nFor now, at least, California’s database holds more information about undocumented immigrants than the federal government is able to access. The largest example lives inside the computers of the DMV, and includes the names and addresses of three-quarters of a million people who were issued “AB60” driver licenses.\nNicknamed for the bill that created the program, the AB60 Driver License is nearly identical to a regular one except it says “Federal limits apply,” on the upper right corner.\nThe DMV said it does not maintain a separate database of AB60 license holders; instead all drivers are on one list. The agency noted in a statement that it keeps all personal information confidential, and that a law enforcement agency can access individual data only if there is an ongoing investigation and it provides a name for a search. No agency is allowed simply to peruse the database.\n“Databases available to law enforcement entities do not indicate whether a driver license was issued under AB 60,” the DMV statement said, “nor do they include any of the identification documents used to obtain a driver license, AB 60 or otherwise.”\nFor Maribel Solache, the San Diego driver’s ed teacher, her license was a gift. Before she got that plastic card, she recalled feeling terrified every time she drove her sons to school or soccer practice. She envisioned getting stopped and taken away in front of her children—or along with her children, who are also undocumented—and deported to Mexico.\nThe license program, she said, changed her life: “I’m able to drive without stress or panic.”\nEven with a Trump administration on the horizon, she said, “I can’t be paralyzed with fear. I am confident the Governor Jerry Brown and the Legislature are going to work to keep that information private and to protect the law they passed.”\nHer students are nervous about that too—but more anxious about the prospect of being pulled over by a police officer and not having a license under a Trump government.\nFieldworker Guadalupe Solano, who picks everything from pumpkins to flowers in the San Diego area, has been pulled over before. Twice she was let go with a warning, but the third time, her car was impounded.\n“My biggest fear when Trump takes office is that we will have more roundups in the area and I can be pulled over and deported,” said Solano, who made an appointment to take the test in early January. “I am afraid that they will now have all of my information, they will know what my face looks like, they will have my fingerprints, and they will know where I live. They will be able to pick me up whenever they want if they choose to.”\nFor some, the uncertainty is enough to deter them.\nIn the MacArthur Park neighborhood of Los Angeles, Francisco Caballero sells cell phone covers and men’s watches alongside other immigrant street vendors. Before the election, he intended to apply for a license. Now that plan is on hold.\n“We are still very fearful,” said Caballero, who first arrived from Mexico City in 1970. “(Trump) treats us like we are not worth anything.”\nThe state’s public university systems also hold information for thousands of undocumented students—in some cases, beyond what the federal government has because California has been offering benefits for so much longer.\nIn 2001 the state began allowing undocumented graduates of California high schools, or GED holders, who had attended at least three years of high school in the state to qualify for in-state tuition rates at public colleges. Previously they were required to pay the far higher out-of-state rates. Those who enrolled under the law became known as AB 540 students, named for the bill that created the benefit.\nOver a decade later, in 2012, the state began allowing California’s public colleges to grant private and non-state funded scholarships to eligible AB 540 students. A year later the state enacted what’s known as the California DREAM Act to allow those same students to apply for state-funded financial aid such as Cal Grants.\nThat’s how Alma Leyva, 27, was able to finish college this year. Leyva started college in 2007, qualifying as an in-state student and paying for school out of pocket. In 2013 she was able to apply for state grants through the Cal DREAM Act to continue her studies. In the meantime, she had also applied for and qualified for the federal Deferred Action program which allowed to stop worrying about deportation and granted her a work permit.\nNow she is in all of those databases.\n“I think it’s something we’re going to continue to put up a fight for, to make sure that’s protected,” said Leyva, who works at the Dream Resource Center at the UCLA Labor Center. “For ourselves and our families and other folks that might have put their information in any database.”\nSo far dozens of university presidents across the country have sent letters to the Trump administration urging it to maintain the Deferred Action program, which includes many students like Leyva, and to keep the data safe.\nHing, the legal expert at USF, said there is no federal law requiring universities to turn over information especially about students. But he also said that doesn’t mean the laws will not change under a new administration.\nAssemblyman Ricardo Lara (D-Los Angeles) just introduced a bill to keep any state agency from providing religious information to the federal government—a defense against Trump’s talk of building a database of Muslims. It’s unclear if any state departments even keep a list that would include religions. In response to a request for which agencies do, an aide to Lara replied “we’re still exploring that question.”\nCalifornia isn’t alone in scrambling to safeguard its databases. In New York City—which offers identification cards to anyone who wants one, including undocumented immigrants—officials have signaled they could delete the database if necessary. On Monday, in a sign of the conflict to come, two lawmakers there sued to stop the city from allowing the database to disappear.","url":"https://calmatters.org/articles/if-feds-try-to-id-deportable-immigrants-using-cal-data-state-will-block-access/"}
