{"authors":["Olivia Muenter"],"date_download":"2018-10-30 23:57:19","date_modify":"2018-10-30 23:57:19","date_publish":"2014-08-12 21:00:01","description":"There are few things I can do with consistency despite my mood. However, rain or shine, tragic event or life-altering stream of good news, some activities are just always going to seem like the right solution. Alongside eating chips and salsa in…","filename":"data/vaneerConsumption/IfIBuyThisDressItWillMotivateMeToWorkOutMoreAnd12MorePhasesOfOnlineShopping.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/71dcbe69-5491-4216-9c17-6381b67994df.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34936-if-i-buy-this-dress-it-will-motivate-me-to-work-out-more-and-12-more_1540943839.html","title":"\"If I Buy This Dress, It Will Motivate Me To Work Out More\" And 12 More Phases Of Online Shopping","title_page":"\"If I Buy This Dress, It Will Motivate Me To Work Out More\" And 12 More Phases Of Online Shopping","title_rss":"NULL","source_domain":"bustle.com","text":"There are few things I can do with consistency despite my mood. However, rain or shine, tragic event or life-altering stream of good news, some activities are just always going to seem like the right solution. Alongside eating chips and salsa in bulk, online shopping is my answer for pretty much every event. I'm going on a vacation? Seems like a good time to shop online. I just attended a funeral? Let's buy that new dress! It's 2 a.m. on a Tuesday and I have just started a new season of Scandal because why not? Let's celebrate by heading to ASOS! Or BaubleBar! Or literally anywhere that sells goods that I may/may not want in my life! The possibilities are endless, and the financial consequences are severe.\nBut let's face it, there's something oddly thrilling about being able to order a new pair of pants while you are not wearing pants at all. There's an odd sense of glory in purchasing 20 new lipsticks and a straw fedora just because you can. And if you haven't shopped an online blow-out sale yet, all I have to say is that you have been doing life wrong. All of it. Wrong. Even though you may now, unlike me, have money to save for, say, retirement or a wedding or the birth of a future child, you are still wrong. Because who needs all that financial security when you can have a handful of highly discounted mid- to low-end designer bags sitting in your closet, unused? Come on, guys.\nBut if you are like me and shop online pretty much daily just because you can, then you should probably understand the stages of online shopping that I will now describe.\n1. Something (Or Nothing) Happens\nYou got asked out on a super exciting date. You are getting promoted. You are getting fired. You just got home from a trip to the grocery store. You are going on vacation. You are wishing you are going on vacation. You feel great about yourself. You feel horrible about yourself. You are in the middle of writing a novel. You are in the middle of writing a tweet. It doesn't really matter. Online shopping is the answer to everything. Clearly.\n2. Okay, But I Really Do Need This For...\nPerhaps you are attending a wedding in five months. Eventually, you know you'll have a beach body, so the G-string bikini only makes sense. That's probably how Heidi Klum started too, right? Casually eating Bugels on her couch, buying G-strings that she knew would someday fit. And, I mean, I may not even be engaged, but I'm certainly not above pre-buying my wedding dress online at any given moment. I'm a monster, okay?\n3. What If It Doesn't Fit Me? OH WELL!\nWe have all done it. Deep down, in our heart of hearts, we know that whatever we're buying is either not going to fit us or not going to flatter us. But it just looks so good, sitting there on your browser, hanging off the model in the photo in just the right way. You need it. It has to happen. And if doesn't fit, well, AT LEAST YOU TRIED. I should add that when the item arrives and you try it on, realizing that it makes you look akin to the lovechild of a 2009 Lindsay Lohan and a dairy cow, you will most likely cry. But it's okay. You can always go buy something else.\n4. If I Buy This Dress, It Will Motivate Me To Work Out More\nNow, this one doesn't actually have to be a dress. It could a hat or a board game or a mega-size bag of gummy bears. It doesn't matter. It's simply the fact that you are searching for a reason, ANY reason, to weakly hold onto to justify what you are doing/buying. You WILL find that excuse and you WILL find a way that it makes sense in your life. You are determined.\n5. Okay, Should I Buy It In A Size Smaller Or My ACTUAL Size?\nThis always gets me. \"Okay, well if I buy a size smaller and it arrives in two weeks...I will PROBABLY be forced to work out and/or eat nothing but almonds until it arrives, and it will fit wonderfully.\" This never happens. This is why you always opt to go larger, not smaller. Worst case scenario — you have to get something taken in at an alternation shop. Although, let's face it, this never happens either. Basically, I just stick to buying shoes most days.\n6. If I Buy This, I'm Not Allowed To Spend Money On Starbucks For Two Weeks\nLet's just all take a second to laugh at the fact that we ever think this decision will pan out well. We never even had a chance.\n7. You Finally Do The Deed\nYou've filled your virtual shopping cart. You've frantically applied any discounts you could find. You've purchased that thing you just had. to. have. YOU ARE ELATED. Next step: Post about your purchase on all forms of social media so people can envy your impeccable taste and/or ability to find discounts.\n8. Immediate Regret\nThis comes in two forms. Sometimes, it's the second-guessing that comes when you've just chosen between two things online and you are convinced you made the wrong decision. \"Why didn't I just buy both?\" \"Ugh, I know that one is going to make me look pregnant.\" The agony. The other form of the regret is a more basic, \"How am I going to pay for dinner for the next two weeks?\" sort of thing. That one, oddly, isn't as bad.\n9. Waiting For It To Arrive\nFor however long it takes for your package to arrive, you have moments of excitement tinged with panic. \"Will it look good?\" \"Did I make the right choice?\" \"At least if I have to return it, I can start being able to afford produce again.\" You track that package's path online like you are Olivia Benson and that package is a scary, balding child molester hiding in an Internet cafe in Brooklyn (hope everyone understands that SVU reference because if not, I'm uncomfortable). It's a stressful time, but you get through it.\n10. IT ARRIVES\nThere is no better feeling than coming home to that package that you've been waiting for. Inside, your treasure awaits you. I would say it's one of the most satisfying feelings that there is. You are like a kid on Christmas, except you know what's in the package and YOU chose it and if you don't like it, then it's really no one's fault but your own. It's a lot of pressure, actually. But it's exciting.\n11. You Are Confused By What You Ordered\nThis always happens to me. Especially with clothes. Things always look different in person. I should know this by now simply by seeing what selfies I post online versus what I actually look like in real life, but oh well. There's almost always a moment of ultimate disappointment. I would describe this like the days after a birthday in middle school. It's just depressing. You aren't sure what to think anymore. Do you even know yourself at all?\n12. You Hate Everything\nComparing how the garment looks on you to how it did on the model you are now devastated. \"IF ONLY MY LEGS WERE ALSO EIGHT FEET LONG AND SHAPELESS!\" you will yell into your mirror, clutching your return receipt as the only form of dignity you are left with. Okay, I'm being a little dramatic, and no — this doesn't happen every time, but it definitely happens sometimes. And it is NOT a good feeling. But there's also a happier, more positive ending to shopping online....\n13. YOU ARE THE BEST PERSON IN THE WHOLE WORLD\nAlternatively, you may love (or grow to love) what you ordered. You are planning outfits. You are Instagramming the heck out of your new shoes/earrings/dress. You are a goddess. You shopped, and you won. Commence home-alone dance party to the sound track of your own satisfaction. My point is that you're really, really, really pleased with yourself.\nImages: Jack F/Fotolia; Giphy (15)","url":"https://www.bustle.com/articles/34936-if-i-buy-this-dress-it-will-motivate-me-to-work-out-more-and-12-more"}
