{"authors":["Lana Shadwick"],"date_download":"2018-10-30 17:56:53","date_modify":"2018-10-30 17:56:53","date_publish":"2015-10-16 14:06:22","description":"Ann Coulter warned that “If immigration continues the way it has been going, we are looking at 100 years of President Obamas.”","filename":"data/vaneerConsumption/IfImmigrationContinuesLikeThisWeWillHave100YearsofObamas.json","image_url":"https://media.breitbart.com/media/2015/10/12109983_997445526963721_1947425364506793281_o.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_16__1540922213.html","title":"If Immigration Continues Like This, 'We Will Have 100 Years of Obamas’","title_page":"Ann Coulter: If Immigration Continues Like This, 'We Will Have 100 Years of Obamas’","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas — Ann Coulter was in Houston promoting her book Adios, America! when she warned that “If immigration continues the way it has been going, we are looking at 100 years of President Obamas.” She explained, this is the reason “Immigration is the one overriding issue for the entire country for all-time.”\nCoulter was speaking to a large audience in a university auditorium who had gathered to hear her and Hugh Hewitt. The event was sponsored by AM1070 “The Answer” and the Sam Malone Radio Show. At the beginning of her speech she told them, “If you have been following my work, you know that I think there is one overriding issue for the entire country for all-time.” She quipped, “And no matter what the question is, you could ask me about my meatloaf recipe and I could turn it back to immigration.”\nShe expounded, “The American people are being out-voted, we can’t win anything, if immigration, legal and illegal … continues the way it has been going, we are looking at 100 years of President Obamas, and an entire Supreme Court of Ruth Bader Ginsbergs.”\nShe asked, “So tell me how you are going to win on any of these issues then Republicans? Tell me how you are going to win on the export-import bank, or how you are going to overturn Roe v. Wade when you can never elect another president? How is Israel going to be protected then, when we can never have another Republican president when we are looking at nothing but President Obamas?” She answered her own question -“It won’t be. That’s why everything comes down to immigration.”\nCoulter told the crowd gathered at Houston Baptist University that after the November 2012 election, “I think like a lot of us, I was deeply depressed.” She added, “That was when I thought maybe this is it, maybe this is over. Teddy Kennedy put in an evil, genius plan and has changed the country enough.” Coulter explained, “If you had the same country as in 1980, Romney would have won a bigger landslide than Reagan did against Carter in 1980 but the Democrats have brought in ringers, they haven’t changed anyone’s mind.” Coulter did not want to hear that the Democrats have reached Americans, she doesn’t believe that. She said, “If anything, Americans are moving to the right, but Americans are being out-voted by foreigners who Democrats have brought in.”\nThe author of ten New York Times bestsellers turned the discussion to the 2016 presidential candidates and referred to her new book Adios, America!: The Left’s Plan to Turn Our Country Into a Third World Hellhole. She said the last five pages of her book details the presidential candidates’ position on immigration.\nShe said she was “getting pretty pessimistic” about our candidates and was thinking that our only hope was to bring Mitt Romney into the race but added, “But that was before Trump came along.” Coulter said that Romney had been “by-far” the best candidate on illegal immigration and he had a 20-year record to prove it.\nOn Trump she said, “How do you like a wall and mass deportation?” She added, “I so love the idea of the ‘Great Wall of Trump.’”\nCoulter also addressed the claim that Trump would not give any details. She jabbed, “I haven’t heard any of the other candidates give any details about immigration and border security. They just have different ways of explaining why we can’t have a wall.” She said she would like to have an entire debate to hear the other candidates (besides Trump) discuss why walls don’t work. “Once they have done that,” she retorted, “perhaps they can tell us why buckets don’t work, why wheels don’t work.”\nReferring to Trump, Coulter told the crowd, “It’s given me a new lease on life.”\nThe syndicated columnist said that two years ago she emailed an immigration strategy to a presidential candidate. She added that she re-emailed the strategy to him last week and told him that if he had followed the strategy, he would be polling like Trump right now. She said with some excitement, I knew this was working, and it is working.\nTo those who object to Trump’s personality, she persuasively insists that the issue boils down to immigration. She was clear in her message that unless immigration stops, and controls are put into place, the Republican Party will not be able to accomplish any of its goals.\nCoulter warned about the control that the huge donors have and used Scott Walker as an example. She said Walker was “against anchor babies” but then Republican billionaire donor Stanley Hubbard got to him and said, “No, actually, we are for anchor babies. So suddenly Scott Walker did not have a position,” she said. Hubbard is a billionaire heir that is now the chairman and CEO of Hubbard Broadcasting.\nCoulter said the billionaire donors “don’t care about our country, our culture, they certainly don’t care about the Republican Party.” She said they just want to make their money and retire and move to an island.\nShe said that Trump is exposing the donors, the RNC, and the establishment, and he is forcing the Republican candidates to take “suicidal positions.” The billionaire presidential candidate is shining the light on the influence that the billionaire donors are having.\nThe author of Adios, America! said she could see Trump getting the nomination.\nTurning to the issue of winning the election, she said, “Liberals are always talking about turning Texas blue.” She said Texas has as many Hispanic voters as they do in California and that Hispanics block vote for Democrats. The difference she said is that white people in California split their vote among Republicans and Democrats, but Whites in Texas voted 80 percent for Mitt Romney.\n“A candidate that will run with the immigration positions that Donald Trump has put forward, is going to get a lot of people coming out.” She predicted that people who haven’t voted, used to vote Republican, and haven’t been voting at all, will come out and vote.\nCoulter said Republicans have a shot, and compared it to what Pete Wilson did in California in 1994 when he ran on an anti-immigration platform. She explained this was about the time California was “tipping,” when California had roughly the same demographics as the entire country does now. She said Wilson won from a come-behind victory but added, “Republicans are just going to have to stop being embarrassed for having white people vote for them.” She said Republicans need to get “a few more white people to vote Republican.” Once that is done she said, “then things will solve itself.” As Ronald Reagan said she added, you can always trust the American people. Coulter said she trusts the American people to make the right decision on a lot of things. She said things may swing left, but then they swing to the right.\nCoulter said she was looking very forward to the next eighteen months.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as a prosecutor and an associate judge in Texas. Follow her on Twitter @LanaShadwick2","url":"https://www.breitbart.com/politics/2015/10/16/ann-coulter-immigration-continues-like-will-100-years-obamas/"}
