{"authors":[],"date_download":"2018-10-30 01:18:02","date_modify":"2018-10-30 01:18:02","date_publish":"2018-08-29 00:35:35","description":"If Obamacare succeeded, then why do so many who had once regarded it as a panacea now enthusiastically back Senator Bernie Sanders’s Medicare for All bill?","filename":"data/vaneerConsumption/IfObamacareSucceededWhyBerniecare.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/1024px-Election_2016-_Bernie_Sanders_NYC_Fundraiser_Draws_Campaign_Supporters_Who_Are_Feelin_The_Bern_21668863331.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862282.html","title":"If Obamacare Succeeded, Why Berniecare?","title_page":"If Obamacare Succeeded, Why Berniecare?The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"If Obamacare succeeded, then why do so many who had once regarded it as a panacea now enthusiastically back Senator Bernie Sanders’s Medicare for All bill?\nSenators Tammy Baldwin, Jeanne Shaheen, and Tom Udall all voted for Obamacare in Congress only to co-sponsor Sanders’s bill. The support for the latter appears as an indictment of the former. A fix that inspires a multitude of fixes did not fix.\nOur cumulative doctor’s bill rose, drastically, in the wake of the Affordable Care and Patient Protection Act. Since Barack Obama took the presidential oath, healthcare expenditures increased by over a trillion dollars. According to the Centers for Medicare and Medicaid Services, the $3.8 trillion Americans now spend on healthcare rises to $5.6 trillion by the middle of the coming decade. Unlike, say, Social Security — a government program enjoying widespread support — Obamacare, nearly a decade after it became law, inspires numerous would-be replacements, of which Medicare for All comes as just one.\nThe senior-citizen junior senator from Vermont proposes for the federal government to pay for your abortions, stints in drug rehab, prescription drugs, and psychiatrist visits. In case you do not take advantage of any of the above, the bill forces you to pay for such services for other people. Atop this, the bill covers your annual teeth-cleaning at the dentist and the glasses you need — services typically included only in the Coupe de Ville of Cadillac Plans.\n“I am not the first President to take up this cause,” President Obama said in 2009 of healthcare reform, “but I am determined to be the last.” Events foiled this ambition.\nWith no deductibles, copays, or premiums, and coverage for every conceivable healthcare need, Sanders’s plan proves seductive. Free beats $3.8 trillion, right? So, it’s no surprise that many look forward to its passage the way your kids mark the days until December 25. But Christmas every day leaves everyone bankrupt. A Mercatus Center study estimates that enactment of Sanders’s plan would result in a near doubling of federal expenditures, with its pricetag roughly equal to what Washington receives in revenue. For a nation already $21 trillion in debt, this seems imprudent.\nThe Mercatus Center estimate seems conservative, in a cautious rather than a political sense. Consider the startling line in the study that notes that “in 2014, hospitals were reimbursed just 89 percent of their costs of treating Medicare patients and 90 percent of their costs of treating Medicaid patients — losses that were offset by hospitals collecting private insurance reimbursement rates equaling 144 percent of their costs.” What happens when the subsidy that private insurers and their customers provide for Medicare disappears?\nGiven that the bill decrees it “unlawful” for “a private health insurer to sell health insurance coverage that duplicates the benefits provided under this Act” or for “an employer to provide benefits for an employee, former employee, or the dependents of an employee or former employee that duplicate the benefits provided under this Act,” this dries up a major source of funding that keeps Medicare and Medicaid afloat — to say nothing of what the absence of competition does to prices.\nBerniecare contains the seeds of a good idea. Administrative costs, by some estimates, account for 31 percent of what Americans spend on healthcare. This nearly doubles what Canadians spend. The Mercatus Center review conceded that the Sanders plan would save money in administrative costs. Saving on bureaucratic expenses need not come as a package deal with eliminating competition, mandating coverage for every conceivable treatment, and abolishing the out-of-pocket expenses that provide a check on individual overuse of the system.\nThe Sanders plan repeats the primary mistake of Obamacare. The latter touted itself as a means of providing “affordable care.” Sanders taps into this very real desire by way of offering healthcare for free. But just as there’s no such thing as a free lunch, there’s no such thing as a free visit to the doctor’s office. Our tax bills, should this legislation become law, will eventually prove that.\nHunt Lawrence is a New York-based investor. Daniel Flynn is the author of six books.","url":"https://spectator.org/if-obamacare-succeeded-why-berniecare/"}
