{"authors":["Caroline Howe For Dailymail.Com"],"date_download":"2018-10-23 01:53:18","date_modify":"2018-10-23 01:53:18","date_publish":"2016-01-29 16:02:38","description":"They were the fourth most successful female group of all time but the Pointer Sisters' battle with addiction sent them into a downward spiral. Ruth Pointer says in new memoir 'Fame is a b***h'.","filename":"data/vaneerConsumption/IfreebasedsomuchIhallucinatedratsandspiderscrawlingontheceilingPointerSistertellshowshesurvivedfivemarriagesaddictionstocrackbrandyandTwinkies.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B4043500000578-0-image-a-26_1454082788259.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421166_I-freebased-hallucinated-rats-spiders-crawling-ceiling-Pointer-Sister-tells-survived-five-marriages-addictions-crack-brandy-Twinkies_1540259598.html","title":"'I freebased so much I hallucinated rats and spiders crawling on the ceiling.' Pointer Sister tells how she survived five marriages, addictions to crack, brandy and Twinkies","title_page":"'I freebased so much I hallucinated rats and spiders crawling on the ceiling.' Pointer Sister tells how she survived five marriages, addictions to crack, brandy and Twinkies  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is now happily married to her fifth husband, Mike Sayles, for more than 25 years. He was a trainer at the gym where she worked out in Malibu\nRuth Pointer, 69, also battled addiction with cocaine and alcohol for years\nThe Pointer Sisters became the fourth most successful female group of all time behind the Supremes, TLC and Destiny's Child.\nThey had fifteen Top 40 singles and won three Grammy Awards between 1973 and 1985.\nBut that fame came with a drug-riddled, perilous climb up the ladder and out of the Oakland ghetto for the three sisters.\nThat climb and the accompanying lure of drugs eventually took the life of the youngest sister, June Pointer.\nBonnie and June, the youngest and second to youngest, started singing together as Pointers Au Pair in 1969 and were joined shortly by sister Anita. They toured and sang studio backup vocals as a trio until Ruth, the oldest sister, joined in 1972,\nRuth got swept along by the trappings of success, money, fame and then, more darkly, cocaine, alcohol, food and sex.\nBonnie, June and Ruth pose on the red carpet at the 1985 American Music Award after winning for Favorite Soul/R&B video artist. The award was a high point professionally. The Sisters were no longer buying their 40s wardrobe at second hand stores and had moved over to a mainstream listening audience, thanks to visionary record producers\nRuth dubbed herself the 'black Elizabeth Taylor' having five husbands. Until Ruth met Mike, she considered that the Pointer Sisters were cursed because of all their bad luck with men and drugs\n'I was lost, but angry. I was bound by the notion that my lifestyle wasn't hurting anyone, yet deep inside I knew that if I didn't straighten myself out soon that I would die, leaving my kids without a mom', the 69-year-old writes in her memoir, Still So Excited, My Life as a Pointer Sister, published by Triumph Books.\nRuth Pointer saw the drug-addicted woman in the mirror but she was too caught up in a web of self-deception to change.\nHer drug consumption escalated to freebasing crack even in front of her children. She reveals she freebased so much that she hallucinated rats and spiders crawling on the ceiling.\nRuth is now with husband number five and for a long time called herself the 'black Elizabeth Taylor'.\nBut unlike Liz, who got the real diamonds from her eight marriages, Ruth says she ended up a junkie holding only fool's gold.\nInstead of learning righteousness and the beauty of God's mercy, love and grace, I learned failure and inadequacy.\nWhen she was finally able to kick the crack, she turned to Twinkies and gained so much weight, she could have played a linebacker position for the Green Bay Packers, the book reveals.\nThe Pointers' story began in West Oakland, the Harlem of the West and the destination of African Americans who headed out of the south to find jobs in urban industrial areas in the Northeast, Midwest and the West right before World War II.\nParents Elton and Sarah Elizabeth Pointer, both ministers, were caught up in that migration and hoped to find a new home where they could protect their family from eternal damnation and 'the devil's work'.\n'Instead of learning righteousness and the beauty of God's mercy, love and grace, I learned failure and inadequacy.\n'I felt I could never measure up to my parents' expectations and that I was unworthy of God's unconditional love,' says Ruth.\nWhat Ruth didn't know at the time was that her fire and brimstone preaching father had been ensnared in bootlegging, gambling, numbers running as well as more serious criminal activities dating back to the 1930's when his brother-in-law was gunned down in cold blood wearing Elton's coat after being mistaken for him.\nAnita (left) and Ruth (right) after Sunday service at the Church of God in their hometown of Oakland, California in the early 1950s. Oakland, some eight miles to the east of San Francisco, was viewed as the the Harlem of the West\nIn 1972, Ruth left her welfare dependent life behind and joined her sisters Bonnie and June who were already singing as the Pointers Au Pair. Sister Anita signed on shortly and with the help of their manager, became the biggest thing to come out of Oakland since the Black Panthers\nMusic Producer Richard Perry signed the trio to his newly formed company, Planet Records in 1978 and produced nine albums and more than a dozen Top 40 singles\nElton tried to change his ways and turned to the ministry. He drummed 'the apocalyptical visions of heaven and hell' into the little girls' heads so tirelessly Ruth suffered from reoccurring nightmares that she would be caught up in a punishing fire on Judgment Day.\nAnd she was - just not the way she had envisioned as a kid.\nAt eighteen, she lost her virginity to local boyLarry Woods in his parent's basement and after one 'lousy lay,' she found herself pregnant. Her mother said he, 'ain't gonna amount to nuthin'.\nMama was right but Ruth married Wood in 1964 and her first child, Faun was born the following year.\nI was most interested in getting high and hammered... sitting on a bar stool and drinking and snorting up a storm.\nThere was no preaching about birth control and Ruth became pregnant again after moving in with Larry and had her second baby in 1965.\nLarry was more than just a tomcat. He was a wife beater.\nHe put cigarettes out on her arms, beat her unconscious with the heel of shoes requiring nine stitches in her head.\nShe tried to cope by consuming Benzedrine (speed), Red Devils (barbiturates) and washing the pills down with Christian Brothers brandy.\nWhen that didn't numb her pain, she fled to the wild and crazy life in San Francisco's Haight and left her children with her parents.\n'I dove into the infamous Haight-Ashbury hippie/drug/free love scene, losing myself in a haze of alcohol and drugs, seamy relationships, and anything else to blot out my unhappy youth, rigid upbringing, and bad-girl guilt.'\nShe became a 'Welfare Queen' and lived off of food stamps and in subsidized low-cost housing while drowning herself in booze, cocaine and drugs.\nShe supplemented her income by selling weed.\n'I was most interested in getting high and hammered... sitting on a bar stool and drinking and snorting up a storm.\nHeavyweight champion Mohammad Ali, 'the Greatest', is the most memorable and awe-inspiring person that Ruth met during her career. She also saw him as 'an outrageously good-looking man' with magnificent charm and natural charisma\nPictured with Bruce Willis, they did an hour-long network television special, Up All Night, with the actor in January 1987 and viewed him as 'super cool'. Their success introduced them to presidents, aristocrats, royalty, diplomats, star athletes and the biggest names in the business\nThe Sisters made an appearance on the TV show, the Love Boat in 1981, but Ruth confesses 'I was coming down off a night of smoking crack and wanted to throw myself overboard after working all day on the set'\n'I was wild as hell, and as long as there was someone buying the endless rounds of Hennessy, Remy Martin, Christian Brothers, and Cristal and providing that magical white powder, I didn't ask to see a resume.'\nWhile Ruth was hanging out on that bar stool, the two youngest sisters, Bonnie and June started singing publicly together, calling themselves Pointers Au Pair.\nJune wasn't without her own debilitating psychological issues after being gang raped by neighborhood thugs years earlier.\nDepression, addiction and wild mood swings stayed with her until her death in 2006.\nPointers Au Pair morphed into the Sisters act when Ruth was called to fill in for June. Earning $100 a session, 'made me the happiest bitch on the planet'.\nRuth joined the group permanently in December 1972 and The Pointer Sisters emerged.\nWithin six months, the Welfare Queen was now a Pop Princess and in six months, they were at the top of the charts.\nTheir vintage 1940s wardrobe was all they could afford in secondhand and thrift stores and the Chicago nightclub dress style of retro gowns, waist-cinching jackets, wigs, teardrop wool hats, boa feathers, cocktail jewels, high heels and hankies became their trademark.\nTheir big break came in 1973 with a fill-in performance at the legendary nightclub, The Troubadour on Santa Monica Boulevard in West Hollywood.\nThe Pointer Sisters LP was released a month later and the song Yes We Can Can climbed up to number ten on the charts.\nAn early photo of the group shows them in their 'Superfly' phase taken on one of their first concert trips to Europe. Ruth writes that fame was a bitch. Behind the fantasy of that 'rocket ride to stardom' are misconceptions. 'It's not only lonely at the top, but it's also lonely on the road'\nA publicity photo shot in 1976. The Sisters were presenting themselves as the 'girls next door' but Ruth admits that she was heavily involved with drugs and alcohol at the time and far from that sweet and wholesome prototype they imagined they were projecting. They often passed around a flask filled with Remy Martin cognac between song takes in the studio\nThe cover photo for The Pointer Sisters 1986 album, Hot Together, shows Ruth, her first year sober after fifteen years of drug and alcohol abuse. She also lost all the weight she gained from binge eating and tipping the scales at 185 pounds\nTheir home-cooked recipe of hot scat, rock, jazz and bebop proved to be 'the biggest thing to come out of Oakland since the Black Panthers'.\nAs good as success tasted, Ruth was on a downward slide with drugs, alcohol and hard partying from the first note. It was lonely at the top and lonely on the road.\n'Despite the rocket ride to stardom and our high public profile, we played a lot of strange places and stayed in a lot of joints for which the word 'dump' would be a compliment,' she tells in her memoir.\nMoney was flying out as fast as it was coming in.\nWhat they thought and hoped were freebies - limos, hotel rooms, champagne, clothes and jewelry - all had a price tag.\nDespite the rocket ride to stardom and our high public profile, we played a lot of strange places and stayed in a lot of joints for which the word 'dump' would be a compliment.\nOne dry cleaner charged $1,200 to clean fifteen dresses.\nThe Sisters swept though mini-bars and room service and went on shopping sprees to outdo Imelda Marcos, the widow of the former Philippine President Ferdinand Marcos who made headlines for her collection of more than 3,000 pairs of shoes.\nBy 1973, Ruth was working on husband number three, Carl Abram and opted for an abortion when finding herself pregnant.\nThe endless touring and partying, 12-hour workdays and unlimited drug supply led to a downward spiral for the dysfunctional Sisters.\nThey got the worst reviews of their career with a gig at Caesars Palace in Vegas and came head to head with singer Paul Anka, 'an unmitigated p***k' with his 'little man's disease', 'a towering ego and insufferable my way attitude'. He made their two-week engagement rough with lousy introductions.\nRuth was now cheating on Carl and sleeping with Dennis Edwards, a singer with the Motown stars of the 1960s and 1970s, The Temptations she stole away from the Queen of Soul, Aretha Franklin who never let her forget the thievery.\nThe unlimited availability of booze, weed and drugs had Ruth in its grip and she began freebasing cocaine with Dennis after tasting 'the finest cocaine I ever snorted' at one of Richard Pryor's soirees.\nSan Francisco was a weed and acid town in the Seventies while Los Angeles was fueled by cocaine and 'turned this girl from the streets of Oakland into a full-on cocaine cowgirl. And I rode that sonuvab***hing horse non-stop well into the next decade,' she tells.\nRuth, still looking glamourous, has been happily married to her fifth husband, Mike Sayles, for more than twenty five years. He was a trainer at the gym where she worked out in Malibu. She admits that she used coke and men to cover up the self-doubt that consumed her for years\nBy 1975, the Pointer Sisters were 'torn, frayed and tattered' with their chemically induced harmonies.\nJune was the first to hit the wall with her ongoing panic attacks, her heart abnormality and her addiction to drugs.\nRuth had no clue about the depths of her depravity and crack addiction until years later when she got sober.\nShe had become a major crack addict and Dennis Edwards got kicked out of The Temptations.\nSmoking crack 24/7, Ruth began hallucinating an invasion of rats on the ceiling.\n'In addition to paranoia, psychosis, sensitivity to noise and light, irritability, and suppression of appetite - the drug did some serious physical damage'.\n'The crack infected my gums and sucked all the calcium out of my teeth, and I had to have a total dental reconstruction. Dark bags formed under my eyes and my skin turned dry and itchy.'\nCardiac palpitations followed and she could hardly catch her breath.\n'Fame is a b***h and can and will take you out unless you're constantly on guard. Sometimes it felt like the Pointer women were cursed, ' says Ruth.\nBy 1984, Ruth had contracted viral meningitis, inflammation of the tissue covering the brain and the spinal cord.\nRushed to the hospital, she was advised by doctors when she woke up that she would soon be dead if she continued drugging. She was only 38 years old.\nThree months later, she recovered from the viral meningitis and her system was clean of alcohol and drugs for the first time in fifteen years.\nRuth went back on the road with her sisters and now began mainlining junk food and hit 185 pounds on the scale.\nShe was eating up everything from room service, to take-out and 'the crack of candy – caramel corn'. In that crazed food consumption state, she walked down the aisle with Don Boyette and asked for an annulment three months later.\nIn the midst of their chaotic personal life, The Pointer Sisters won a Grammy for Best Pop Performance by a Duo or Group for Jump (For My Love).\nThey somehow held it together until November 1986, the downturn of the group's recording career.\nRuth entered a 12-step program for her eating problem and began eyeing up Mike Sayles, a partner at the gym where she was working out.\nHe wasn't her typical preference in men – 'flashy, charismatic and a little cocky'. Mike was nice, reserved, shy and white – an alien life form for Ruth but their love affair blossomed and he became husband number five.\nThe newlyweds decided they wanted children but Ruth had had her tubes tied years earlier so they tried in vitro fertilization (IVF). When that failed, they pursued an egg hunt to find a donor.\nThey found a woman who was able to provide seventeen eggs and five were implanted in Ruth's uterus along with Mike's sperm.\nThe Boston Globe's headlines screamed: 'Ruth Pointer is Pregnant with Test Tube Babies'.\nTwins arrived to the happy couple in 1993 when Ruth was 47.\nShe remains married to Mike twenty-five years later and the couple are living in Boston, Mike's hometown.\nBut it wasn't a happy ending for the other sisters.\nCrack got June. Gang bangs mixed with drugs brought druggies into her house, which escalated her own consumption of them. June died in April 2006.\n'My life is filled with both blessings and heartaches... but the blessings far outweigh the other. Life is far from perfect but it's still pretty damn good,' says Ruth.","url":"https://www.dailymail.co.uk/news/article-3421166/I-freebased-hallucinated-rats-spiders-crawling-ceiling-Pointer-Sister-tells-survived-five-marriages-addictions-crack-brandy-Twinkies.html"}
