{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:38:10","date_modify":"2018-10-30 21:38:10","date_publish":"2016-09-09 12:11:43","description":"Scandals would follow Clinton to the White House -- unless President Barack Obama pardons her, which looks both necessary and likely.","filename":"data/vaneerConsumption/IfSheWinsPresidentObamaWillHavetoPardonHillaryClinton.json","image_url":"https://media.breitbart.com/media/2014/12/Blue-State-Blues.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_09_09__1540935490.html","title":"If She Wins, President Obama Will Have to Pardon Hillary Clinton","title_page":"If She Wins, President Obama Will Have to Pardon Hillary Clinton","title_rss":"NULL","source_domain":"breitbart.com","text":"The polls show a narrowing gap between former Secretary of State Hillary Clinton and businessman Donald Trump, thanks in part to ongoing revelations about her secret email server, and the way the Clinton Foundation solicited foreign donations for favors from the State Department while in office.\nClinton is still the favorite to win in November, but the mounting scandals will follow her to the White House — unless President Barack Obama pardons her, which looks both necessary and likely.\nThere is already more than enough evidence to incriminate any other person not named “Clinton.” And Clinton’s continued lies, innovations and inventions about her secret email server, about Benghazi, and about the Clinton Foundation suggest that more evidence against her may be on the way.\nIt could come in new congressional investigations; or more documents from Judicial Watch lawsuits; or more Wikileaks emails. Regardless, it will continue until, and probably beyond, Election Day.\nThat means what if Clinton wins the election, she will have done so without the public ever seeing the full case against her, thanks to BleachBit and Cheryl Mills’ abuse of attorney-client privilege.\nBut even if she takes the oath of office next January, Clinton could still be prosecuted for perjury — as Congress has urged the Department of Justice to do — or for destroying federal records, or other violations. The president does not have immunity from criminal prosecution for prior acts.\nAre those prosecutions likely? Not with James Comey atop the FBI, and not with a new wave of Democratic appointees at Justice. But new evidence could emerge after November 8 that could force prosecutors to act.\nFor example, a “smoking gun” email showing a direct quid-pro-quo arrangement between a the State Department and a Clinton Foundation donor could well trigger new investigations, possible indictments, and prosecutions.\nNot a good way for a new president to start in office.\nIf that sounds unlikely, consider that the investigation against Illinois governor Rod Blagojevich only exploded in December 2008, after Obama won. While Blagojevich only tried selling Obama’s U.S. Senate seat after the election, he was already under investigation. Some of Blagojevich’s circle, including Tony Rezko — who was convicted on unrelated charges — were close to Obama, who was not a target of the FBI investigation into Blagojevich and other members of what Chicago Tribune columnist John Kass calls the “Illinois combine.”\nThe point is that revelations can, and do, happen after Election Day.\nTheoretically, if Clinton is charged with crimes relating to her e-mail server, or the Clinton Foundation, or the Benghazi cover-up, she could be impeached, though it would be unlikely, given the political risk. Article II, Section 4 of the U.S. Constitution provides for impeachment for “Treason, Bribery, or other high Crimes and Misdemeanors.”\nArguably, the Clinton Foundation was a vehicle for bribery–and the Constitution does not specify if impeachment applies only to acts committed while in office.\nAfter the experience of the first Clinton impeachment, Republicans are unlikely to go that route. Regardless, Hillary Clinton would begin her presidency under a cloud of suspicion. Her election would be tainted by a sense of illegitimacy, which would weaken her politically as well as diplomatically.\nThere is only one way to avoid that, and that is for President Obama to use his authority to pardon Clinton for all criminal acts that she may have committed until this point. He would be well within his constitutional authority to do so, even though Clinton has not yet been charged with specific crimes.\nObama could, and probably would, also pardon Clinton if she loses the election. The question is whether voters want to elect someone who needs the extraordinary remedy of a presidential pardon in order to serve effectively in the highest office.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle, is available from Regnery through Amazon. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/local/2016/09/09/blue-state-blues-president-obama-will-pardon-hillary-clinton/"}
