{"authors":["Kristine Fellizar"],"date_download":"2018-10-31 01:52:10","date_modify":"2018-10-31 01:52:10","date_publish":"2018-09-13 20:53:57","description":"When you're happily in love, it's so easy to miss signs that your partner isn't exactly on the same page. While things like name calling and cheating are obvious red flags, it's the little things you should pay attention to. Because according to…","filename":"data/vaneerConsumption/IfYourPartnerIsReallyInLoveTheyllNeverDoThese15SmallThings.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/3490c832-01c8-4a37-9e6c-41afe51f143a-zaeh_bustle_aug2015-479.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_if-your-partner-is-really-in-love-theyll-never-do-these-15-small-things-11909283_1540950730.html","title":"If Your Partner Is Really In Love, They’ll Never Do These 15 Small Things","title_page":"If Your Partner Is Really In Love, They’ll Never Do These 15 Small Things","title_rss":"NULL","source_domain":"bustle.com","text":"When you're happily in love, it's so easy to miss signs that your partner isn't exactly on the same page. While things like name calling and cheating are obvious red flags, it's the little things you should pay attention to. Because according to experts, the small things can clue you in to how in love your partner really is.\n\"The reason why it's so important to watch out for these seemingly small things is for the sake of kindness,\" Julia McCurley, Professional Matchmaker and founder of Something More, tells Bustle. \"Kindness, along with emotional stability, is the most important predictor of satisfaction and stability in a marriage.\"\nSmall gestures of kindness are what make people feel cared for, understood, validated, and loved in a relationship. \"Maybe you are OK with taking an Uber to the airport,\" McCurley says. \"But if it's important for your partner to have you drive them, then you're spending $100 of your time to make them feel like a million bucks.\"\nAlthough kind gestures are great and can make you feel loved, you don't want to overlook the small signs of disrespect either. So if you're curious about how your partner truly feels about you, here are some small things they likely won't do if they love you, according to experts.\n1 Say No To Driving You To The Airport Ashley Batz/Bustle In a true partnership, McCurley says both people should consider their partner a top priority. That means your partner should always be there to support you and try to meet your needs. If your partner really loves you, they won't flat out refuse favors, like taking you to the airport, without a legitimately good excuse. If something is important to you, then your partner should find it important too, she says. \"No questions asked.\"\n2 Tell You When They Think Someone Else Is Attractive, Even If You Feel Uncomfortable Andrew Zaeh for Bustle There's nothing wrong with finding other people attractive and talking about celebrity crushes once and a while. But if your partner actively comments on how attractive your friend, their friend or the server is when it makes you uncomfortable, they're likely not thinking about your feelings. \"When we're in love, we tend to have tunnel vision for the person we're with,\" Amica Graber, a relationship expert with TruthFinder, tells Bustle. \"If the eyes are wandering, it's a bad sign.\"\n3 Pick Petty Fights With You Regularly Ashley Batz/Bustle One petty fight may not make a huge impact on your relationship. But over time, \"frequent fighting can take a serious toll on your relationship,\" Graber says. These little fights over why someone didn't do this or why someone always does that can really add up. If your partner constantly finds ways to argue with you over the smallest things, there may be a deeper reason behind it.\n4 Forget The Details Andrew Zaeh for Bustle When we're in love, Graber says it's a lot easier to remember the details about someone like the color of their eyes, the names of their siblings, or their favorite pizza toppings. \"But if someone can't remember any of the little details about you, they may not be 100 percent invested,\" she says.\n5 Air Your Issues Out In Public Andrew Zaeh for Bustle You may do something that frustrates your partner, but that is no excuse for them to be putting you down in front of other people. \"If you're having a dispute about something, a loving partner will discuss it with you privately, and not in front of your friends,\" Graber says. That means no passive aggressive social media posts either.\n6 Criticize Your Lifestyle Choices Andrew Zaeh for Bustle \"Encouraging a healthy lifestyle is part of loving someone,\" life coach Rebekah Storm, tells Bustle. After all, when you love someone you'll obviously want them to live a long and healthy life. But that doesn't mean anyone should be criticizing what someone eats, drinks, or does to stay healthy. A partner who loves you will never make you feel bad for the choices you make in your life. According to Storm, shaming in any way is a sign of someone trying to feel superior, which can mean they feel insecure.\n7 Compare You To Other People Andrew Zaeh for Bustle A partner who truly loves you won't compare you to anyone else. Even seemingly positive comparison like, \"You're way better than my ex,\" can be problematic. \"Someone who loves you will not be thinking about ways you measure up against other people,\" Storm says. You exist independently of anyone they know or have known in the past, and creating a comparison may show your partner's mind is partially elsewhere.\n8 Lie To Avoid Hurting Your Feelings Ashley Batz/Bustle \"A partner who loves you will respect you enough to be honest, even when it might hurt a little,\" Storm says. When you ask your partner for their honest opinion, you should be able to trust that they're telling the truth and not just what you want to hear. Even though the truth is not always easy to tell, trust is important in a loving relationship.\n9 Keep You A Secret Ashley Batz/Bustle \"In my experience, partners who have never truly loved me have actively hidden me from their social media,\" relationship expert and writer, Gina Daniel, tells Bustle. \"If someone loves you enough to want to be with you, they should at least let people know you are involved, even if it's just at your request.\" It isn't \"needy\" or unreasonable for you to want to feel like your partner is proud to be with you. Even if your partner likes to keep it fairly private online, Daniel says they should still respect your desire to be seen with you, and you both can compromise to figure out what form that will take.\n10 Be Too Busy If You Really Need Them Andrew Zaeh for Bustle \"If your partner loves you, they’re going to be there for you no matter what,\" Bethany Ricciardi, relationship expert with TooTimid, tells Bustle. Someone who truly cares about you and wants you to be part of their life will never be too \"busy\" to be there for you. \"Don’t think just because they missed a call while at work that they don’t love you,\" Ricciardi says. \"You have to be respectful to their time and boundaries too.\" They don't need to drop whatever they're doing to be with you at any given time. But if you feel like you can truly count on them during your time of need, you have a keeper.\n11 Discourage You Andrew Zaeh for Bustle \"They might be realistic with you, and give an honest opinion about how they feel when it comes to what you’re doing, but they’ll never try and break your confidence,\" Ricciardi says. A person who loves you may challenge you in order to help you grow, but they'll always be your biggest cheerleader.\n12 Say Things That Put You Down Ashley Batz/Bustle When you're super close to someone, it's easy to make a critique \"out of love.\" But as Ricciardi says, a partner who's truly in love will appreciate you for who you are. They wouldn't want you to change yourself because that's who they fell in love with.\n13 Make You Feel Alone Ashley Batz/Bustle \"Surprisingly enough, many individuals feel like they’re in a relationship by themselves,\" Ricciardi says. \"If your partner cares about you, they’re going to make sure you’re drowning in their love.\" They'll make the effort to check in with you on a regular basis and you'll never be left wondering when they're finally going to see you. In short, they'll be putting in the effort.\n14 Monopolize Your Time Ashley Batz/Bustle If you're in a healthy relationship, there's room in your life for the other important people you love like your family and friends. \"If your partner loves you, they won’t try and keep you to themselves,\" Ricciardi says. \"They’ll want to be happy in and outside of the relationship.\" They might miss you when you're spending time apart, but they'll never try to make you feel bad about spending time with other people.","url":"https://www.bustle.com/p/if-your-partner-is-really-in-love-theyll-never-do-these-15-small-things-11909283"}
