{"authors":["Kate Erbland"],"date_download":"2018-10-30 23:41:37","date_modify":"2018-10-30 23:41:37","date_publish":"2014-08-13 14:07:01","description":"If there's one surefire way to exacerbate family troubles, it's to throw everyone together (mix in significant others for maximum drama), pack them off to a foreign country, and let everything and everyone stew for about two weeks. It's a recipe for…","filename":"data/vaneerConsumption/IfYouLovedTheVacationersTryReadingThese9BooksToo.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/f6402701-5c40-446d-90cf-1b876addd7ec.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34173-if-you-loved-the-vacationers-try-reading-these-9-books-too_1540942897.html","title":"If You Loved 'The Vacationers,' Try Reading These 9 Books, Too","title_page":"If You Loved 'The Vacationers,' Try Reading These 9 Books, Too","title_rss":"NULL","source_domain":"bustle.com","text":"If there's one surefire way to exacerbate family troubles, it's to throw everyone together (mix in significant others for maximum drama), pack them off to a foreign country, and let everything and everyone stew for about two weeks. It's a recipe for disaster, but it's also the narrative of Emma Straub's funny and feeling The Vacationers .\nThe Vacationers , $9, Amazon\nIn Straub's latest novel, the Post family (dad Jim, mom Franny, son Bobby, and daughter Sylvia), plus a motley crew of other hangers-on, hit the sunny Spanish island of Mallorca for two weeks of what should be a fun and relaxed time. Well, at least that’s how the fussy Franny pictured it when she planned the trip so many months before, but by the time the family arrives at their stunning rental villa, a series of upheavals and missteps have all but decimated the family. As what really happened — and with whom – is steadily and expertly revealed by Straub, the film flits between narrators and perspectives, unfolding out into a series of intersecting stories that consistently and constantly change the Post family (both to their readers and to each other).\nIf you’ve already read (and loved) The Vacationers and are eager to find other titles like it, there's plenty more to choose from, depending on what about Straub’s funny family dramedy most touched you:\n1. If you’re hungry for another book that lays the delicious food on thick, bite into Mark Kurlansky's Edible Stories: A Novel About Food in Sixteen Courses\nFranny is a well-regarded food writer, and her love for both crafting and consuming delectable meals for her family and guests is always at the forefront of The Vacationers. If Franny's first big trip to a local Spanish grocery store (oh, the sausage) has stuck with you, try Kurlansky's loosely connected set of stories. Like Franny, Kurlansky writes about food for a living, and this set of stories flows together to deliver a dynamic and creative narrative and descriptions of meals so rich and full that they almost leap off the page (where you could, presumably, eat them).\nClick here to buy.\n2. If you want to read more about troubled families on big vacations, look up J. Courtney Sullivan's Maine\nThe Posts are not prone to taking big vacations as a group — the Spain trip is kind of an anomaly for them, really — and while moving their issues to (literally) the other side of the globe might sound appealing, it still doesn't change what those issues are. No matter where they are, they are the Post family. A similar idea is explored in Sullivan's novel, which sees the sprawling group of Kelleher women (three generations full) attempting to navigate their way through yet another summer at their family cottage in Maine. Do your problems change as you change location? No, never.\nClick here to buy.\n3. If you want to spend more time in stunning literary Spain, pick up Ernest Hemingway's The Sun Also Rises\nFranny seeks out Spain because it's not as typical as some of the other locations the Manhattan native Post family could have visited — the South of France? of course not! — and because it comes complete with a stunning hillside mansion loaned to her by a friend of a friend. The Posts all fall for Spain in different ways (well, Bobby might just like it for its nightclubs and booze), but the country leaves a mark on each of them. Spain has long served as a draw for authors, and a bevy of classic novels are set in amongst its shores. Why not branch out into something classic while you're still feeling connected to Straub's modern material? It's hard to go wrong with Hemingway.\nClick here to buy.\n4. If you want to explore more narratives about well-adjusted girls losing their virginity, go for Kristen Tracy's Lost It\nWhen Sylvia decides early on in The Vacationers that she has to lose her virginity before the summer is over — and before she heads off to college and away from high school years who have left her not exactly scarred, but certainly not happy — it primes the reader for some mortifying situations. They don't really happen, because Sylvia is far more well-adjusted than she thinks she is, and her decision is a mature one. Tracy's novel is very much in the same vein, presenting her audience with the indomitable Tess Whistle, who is (just like Sylvia!) eager to lose her virginity, but not in any way defined by it.\nClick here to buy.\n5. If you’re looking for another novel about the effects of overeating, grab Jami Attenberg's The Middlesteins\nIn a number of ways, Attenberg's novel is a true companion to The Vacationers. There are the family troubles, the shifting narratives, the secrets, but there's mainly the eating. Both Franny Post and Edie Middlestein come from the \"food is love\" school of thought, and both are happy to consume as much love — er, food as possible, even if it might literally kill them.\nClick here to buy.\n6. If you want to go deeper into the tangles of adoption, look for Eric Shaw Quinn's Say Uncle\nAs the Posts' dramas play out, there's a whole other story unfolding just down the hall (well, down the stairs, this is a large vacation home, after all), as Franny's best friend Charles and his husband Lawrence are trying to endure family issues that are not their own while trying to hold on to the possibility that they could be parents soon, too, thanks to a drawn out adoption process that's long been wearing them thin. For something with a similar flavor, Quinn's Say Uncle goes deep inside another unexpected adoption by a gay man not entirely sure if being a parent is his calling. The book's second half then satisfying tackles what that adoption felt like to the person on the other side — the boy would become a stranger's son.\nClick here to buy.\n7. If you’re want to read another story about late-in-life (and life-changing) infidelity, seek out Courtney Maum's I Am Having So Much Fun Here Without You\nWhat's really going on with Franny and Jim is hinted at early on, and Straub doesn't balk at laying on the sordid details as the book winds on. Can Franny ever forgive her husband's transgressions? And does he even want her to? Maum's recent novel addresses a similar theme — a husband bent on winning back his wife after cheating on her for years, what that looks like, feels like, and amounts to. It even takes place in Paris and London to keep that European flair flowing.\nClick here to buy.\n8. and 9. If you want to settle into some more Straub fiction, it's time for you to buy Other People We Married and Laura Lamont's Life in Pictures\nOther People We Married, Straub's 2012 short story collection, is filled with the same kind of themes that run through The Vacationers: love, lust, confusion, drama, awkwardness. The book is filled with nice little bites of Straub's wit and attention to detail, a quick fix for anyone who is missing The Vacationers too much. Ready for a novel? Try out Laura Lamont's Life in Pictures , a period piece about a Hollywood starlet that still manages to hold fast to the family drama and trauma that marks The Vacationers.\nClick here to buy Other People We Married and Laura Lamont's Life In Pictures.","url":"https://www.bustle.com/articles/34173-if-you-loved-the-vacationers-try-reading-these-9-books-too"}
