{"authors":["Carolyn Steber"],"date_download":"2018-10-31 01:52:14","date_modify":"2018-10-31 01:52:14","date_publish":"2018-09-13 20:31:04","description":"How your partner acts behind closed doors can tell you a lot about your relationship, since that's when you're both in your most relaxed and natural states. If they seem to be laid back, or are super honest or direct, it may even indicate that you…","filename":"data/vaneerConsumption/IfYourPartnerEverDoesThese11ThingsBehindClosedDoorsYouHaveASecureRelationship.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/c71475a1-6466-4899-83c9-1d02ef395413-fotolia_219697549_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_if-your-partner-ever-does-these-11-things-behind-closed-doors-you-have-a-secure-relationship-11772746_1540950734.html","title":"If Your Partner Ever Does These 11 Things Behind Closed Doors, You Have A Secure Relationship","title_page":"If Your Partner Ever Does These 11 Things Behind Closed Doors, You Have A Secure Relationship","title_rss":"NULL","source_domain":"bustle.com","text":"How your partner acts behind closed doors can tell you a lot about your relationship, since that's when you're both in your most relaxed and natural states. If they seem to be laid back, or are super honest or direct, it may even indicate that you have a secure relationship.\nThis is especially true if your partner acts very comfortable, or truly seems to let their guard down, whenever you're alone. \"It's the things that happen in private that show the security of the relationship, because if it happened in public with everyone, it wouldn’t be special,\" therapist Erin Parisi, LMHC, CAP, tells Bustle. \"Your partner gets to know you in ways that most people don’t get to know you. When you see a difference between what they let most people see, and the vulnerability they let you see, then you know the relationship is pretty secure.\"\nOf course, if they have a hard time opening up, or seem a little on edge when they get home, it might be due to an external issue, such as problems at work, or stress, or anxiety. So if you think that may the case — or even if you aren't sure how your partner feels — be sure to talk about it. It's always possible to work on making a relationship even more secure by being open and honest, and supporting each other. Here a few things you have to look forward to, that are signs of a secure relationship.\n1 They're Cool With Your Alone Time Ashley Batz/Bustle While it's nice to greet each other after a long day, or chat for a bit over dinner, it's a sign of a truly secure relationship if your partner creates space for you to do your own thing every now and again. This might mean leaving you alone to read in a separate room for an hour, or taking a step back while you pursue hobbies or friendships. \"In a secure relationship, you and your partner don’t feel the need to peer over each other’s shoulders,\" Parisi says. Instead, you both acknowledge the importance of alone time, and make sure it happens.\n2 They're Open About Their Bodily Functions Andrew Zaeh for Bustle All couples are different when it comes to how open they want to be about their bodily functions, bathroom habits, and so on. But if your partner does these things without shame, there's a good chance they feel all sorts of secure. As Parisi says, \"If you’re both secure in the relationship, then you can move past pretending that you don’t fart. Same with pooping, although I don’t think your partner needs the visual, it doesn’t have to be a state secret that pooping happens.\" If you both want to talk about it, that's great.\n3 They Get Extra Comfy Ashley Batz/Bustle In a similar vein, Parisi says a very secure partner will, with time, likely let their hair down — both literally and figuratively. Think along the lines of walking around with zit cream, while wearing thread-bare pajamas, after having not showered for days. That's love.\n4 They Argue With You Andrew Zaeh for Bustle While you don't want to be fighting in a toxic way, or bickering 24/7, it's a great sign if you two can have the occasional healthy argument behind closed doors. And even better if your partner is open about their feelings during it. \"It isn’t possible for two people to want and need the same thing all the time, or to have the exact same opinion on every single thing,\" Parisi says. \"Arguments shouldn’t be a constant [...] but yes, there should be some arguing.\" Same goes for healthy debates, too, as it shows you're both secure enough to disagree.\n5 They Turn Down Sex Ashley Batz/Bustle It can be tough to turn a loving partner down, especially if you live together and/or are used to having sex regularly. But a secure partner will be able to talk about their needs, including when they do and don't want to have sex. As Parisi says, \"It’s not a fair expectation that your partner be ready to go every single second of the day, and sometimes one of you is in the mood, and one of you is not. It’s OK to communicate [to each other] that today is not a good day/time.\"\n6 They Maintain Their Boundaries Andrew Zaeh for Bustle As mentioned above, it's a sign of security if your partner leaves you alone to do your own thing, and even better if they seek alone time, too — especially if they have no problem asking for it. \"Just because you love each other doesn’t mean you need to be in each others’ faces all the time,\" Parisi says. \"It’s OK to have different favorite television shows, to need time alone, to want to read or work out or chat on the phone without your partner. A secure relationship can withstand partners having some alone time to do whatever their thing is.\" Secure relationships also have agreed upon boundaries that both partners respect, which may include a need for alone time every now and again.\n7 They're Honest With You Ashley Batz/Bustle If you two are walking on eggshells around each other, that's a surefire sign you need to work on building trust and security within your relationship, since obviously things are being left unsaid. But if you already do trust each other, you'll likely notice that your partner doesn't have any problem being honest. \"When you’re not avoiding arguments, and you feel like you will still be accepted even if your partner doesn’t agree with you, then it feels less scary to be honest with them,\" Parisi says.\n8 They Tell You Who They Find Attractive Hannah Burton/Bustle Let's say you're watching a TV show and your partner blurts out that they find the main star super attractive. While it might not be the most fun thing to hear, comments like these will take a funnier, more joking tone if you have a secure, trusting relationship. \"Just because you’re in a relationship together doesn’t mean you don’t have eyes,\" Parisi says. \"You can still find another person attractive.\" Saying it out loud shows that it's not threatening, but simply an observation.\n9 They Confide In You Andrew Zaeh for Bustle Whether they're venting about work, worrying about a friend, or sharing a family story, a secure partner will likely feel safe confiding in you. \"When your partner talks about hopes and fears regarding work, or troubles or good times with friends and relatives, it’s a sign of trust, which means your partner feels secure,\" Tina B. Tessina, PhD, psychotherapist and author of Dr. Romance's Guide to Finding Love Today, tells Bustle.\n10 They Ask Your Opinion Ashley Batz/Bustle It's great if your partner has a circle of people they turn to for advice and fresh perspectives. But even better if they include you as one of the first people they call. \"If your partner values your input, and asks for it, it’s a sign that you are trusted and respected,\" Dr. Tessina says. \"Both good signs for security.\"","url":"https://www.bustle.com/p/if-your-partner-ever-does-these-11-things-behind-closed-doors-you-have-a-secure-relationship-11772746"}
