{"authors":["John Nolte"],"date_download":"2018-10-30 18:51:20","date_modify":"2018-10-30 18:51:20","date_publish":"2015-04-23 20:12:08","description":"ADDED: 10 REASONS TO BELIEVE THE LEFT WILL EVENTUALLY BAN 'BLAZING SADDLES' 'BLAZING SADDLES' REVIEW: BUY A COPY BEFORE THE LEFT BURNS THEM ALL Offended |","filename":"data/vaneerConsumption/IfYoureSoSensitiveLeaveAmericanIndianActorsToldtoExitAdamSandlerComedy.json","image_url":"https://media.breitbart.com/media/2015/04/loren-anthony-adam-sandler.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_04_23__1540925480.html","title":"'If You're So Sensitive, Leave': American Indian Actors Told to Exit Adam Sandler Comedy","title_page":"'If You're So Sensitive, Leave': American Indian Actors Told to Exit Adam Sandler Comedy | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"ADDED:\n10 REASONS TO BELIEVE THE LEFT WILL EVENTUALLY BAN ‘BLAZING SADDLES’\n‘BLAZING SADDLES’ REVIEW: BUY A COPY BEFORE THE LEFT BURNS THEM ALL\nOffended by satire, incorrect costuming, and inappropriate feather placement, a group of about a dozen American Indian actors walked off the set of an Adam Sandler comedy Wednesday, according to a report in Indian Country. Apparently, the actors were shocked to learn that Indians would not be inoculated from satire in the “Ridiculous Six” Western spoof, and that a comedy film wasn’t terribly interested in historical accuracy.\nThings came to a head when one of the producers told one of the actors, “If you guys are so sensitive, you should leave.” [emphasis added]\nApproximately a dozen Native actors and actresses, as well as the Native cultural advisor, left the set of Adam Sandler’s newest film production, The Ridiculous Six, on Wednesday. The actors, who were primarily from the Navajo nation, left the set after the satirical western’s script repeatedly insulted native women and elders and grossly misrepresented Apache culture. The examples of disrespect included Native women’s names such as Beaver’s Breath and No Bra, an actress portraying an Apache woman squatting and urinating while smoking a peace pipe, and feathers inappropriately positioned on a teepee. “When I began doing this film, I had an uneasy feeling inside of me and I felt so conflicted,” she said. “I talked to a former instructor at Dartmouth and he told me to take this as finally experiencing stereotyping first hand. We talked to the producers about our concerns. They just told us, ‘If you guys are so sensitive, you should leave.‘ I was just standing there and got emotional and teary-eyed. I didn’t want to cry but the feeling just came over me.”\nThe key phrase is “the examples of disrespect.”\nHuh?\nWut?\nThis is an Adam Sandler comedy. Everything is mocked. Everyone is made to look foolish. Satire is not disrespect. It is not personal. Wanting an exemption from satire is a call for supremacy, not respect.\nDid these actors really think they had earned some special protection from Sandler’s crude satire, which takes no prisoners. There’s nothing racist or stereotyped about any of the complaints listed above. It’s just crude and silly. And my guess is that the cowboy costumes, and whatever the cowboy equivalent is for cowboy “feather placement,” also isn’t that accurate.\nGranted, I haven’t read the script but previous Sandler comedies have poked gentle fun at Southerners, Jews, Hawaiians, Arabs… It is always good-natured fun, never mean-spirited. Sandler’s track record here is pretty clear.\nI can’t imagine the relief on the set when these 12 humorless killjoys finally went away. Here you are trying to make a comedy, and you got a dozen actors creating all this tension over their imagined, sanctimonious snowflake status.\nThis buttercup attitude, which you see from so many “protected groups,” is destroying comedy and satire. It is the New Production Code, and much more stifling than the original Production Code, which you could at least work around.\nThe producers did the exact right thing telling these self-serious, censorious whiners to pack up their specialness and go home.\nNetflix, the company producing the spoof exclusively for its streaming service, stands behind Sandler and artistic integrity:\n“The movie has ridiculous in the title for a reason: because it is ridiculous. It is a broad satire of Western movies and the stereotypes they popularized, featuring a diverse cast that is not only part of—but in on—the joke,” the company spokesperson said.\nThink about this: A member of the legendary, badass Navajo Nation almost broke into tears over feather placement and jokes in an Adam Sandler comedy. That kind of makes me want to cry.\nFollow John Nolte on Twitter @NolteNC","url":"https://www.breitbart.com/entertainment/2015/04/23/if-youre-so-sensitive-leave-american-indians-actors-told-to-exit-adam-sandler-comedy/"}
