{"authors":[],"date_download":"2018-10-22 20:52:25","date_modify":"2018-10-22 20:52:25","date_publish":"2014-06-03 13:42:45","description":"It's not just the main highways that are congested, it's also the local roads.","filename":"data/vaneerConsumption/IfYouThinkNYCTrafficIsBadGetaLoadofThisCity.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/483856/140603-biz-kremlin-traffic_08187718056787443dd19c111c86d816.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_if-you-think-nyc-traffic-bad-get-load-city-n121176_1540241545.html","title":"If You Think NYC Traffic Is Bad, Get a Load of This City","title_page":"If You Think NYC Traffic Is Bad, Get a Load of This City","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMoscow is infamous for traffic jams which snake around its highways. Now, it has been named the world's worst city for car congestion.\nThe Russian capital has an average congestion level of 74 percent, topping the global traffic index released by Dutch GPS manufacturer Tom-Tom. The index compares travel times during non-congested hours with travel times in peak hours in 60 cities worldwide.\nJourneys on Moscow's highways during morning or evening peak times take around 74 minutes per hour longer, than at a time with no traffic delays. And the total yearly delay for a thirty minute commute was 128 hours.\n\"We know that over the last few years, car ownership has increased massively in Russia, and specifically Moscow,\" Nick Cohn, global traffic congestion expert at TomTom, told CNBC in a telephone interview.\n\"It's not just the main roads which are highly congested, but it's also the local roads. There are not a lot of quick alternatives if you're navigating through Moscow.\"\nIstanbul took second place with 62 percent for traffic congestion. Here drivers spent an extra 66 minutes per hour for journeys at morning or peak times compared to when there was no traffic. And the total yearly delay for a thirty minute commute was 120 hours.\nLatin American countries also posted high congestion levels—Rio de Janeiro (55 percent), Mexico City (54 percent) and São Paulo (46 percent).","url":"https://www.nbcnews.com/business/travel/if-you-think-nyc-traffic-bad-get-load-city-n121176"}
