{"authors":["Arielle Dachille"],"date_download":"2018-10-30 23:21:38","date_modify":"2018-10-30 23:21:38","date_publish":"2014-08-13 19:42:26","description":"Iggy Azalea loves herself some pop culture references when it comes to her music videos. \"Change Your Life\" takes cues from camp classic Showgirls. \"Fancy\" is basically a frame-by-frame recreation of Clueless . \"Murda Bizness\" pokes fun at the…","filename":"data/vaneerConsumption/IggyAzaleasBlackWidowVideoIsFullofKillBillReferencesProductPlacementVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/37182467-b020-4382-bcac-4f0cba1af391.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35643-iggy-azaleas-black-widow-video-is-full-of-kill-bill-references-product-placement-video_1540941698.html","title":"Iggy Azalea's \"Black Widow\" Video Is Full of 'Kill Bill' References & Product Placement - VIDEO","title_page":"Iggy Azalea's \"Black Widow\" Video Is Full of 'Kill Bill' References & Product Placement — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Iggy Azalea loves herself some pop culture references when it comes to her music videos. \"Change Your Life\" takes cues from camp classic Showgirls. \"Fancy\" is basically a frame-by-frame recreation of Clueless . \"Murda Bizness\" pokes fun at the child pageantry of Toddlers in Tiaras . Not to break the pattern, Iggy Azalea's new music video \"Black Widow\" with Rita Ora is festooned with Kill Bill references and peppered with a dash of product placement. Essentially, if you ever had one of those Ambien dreams where pop stars are magically dropped into the plot of a movie, and somehow there are commercials halfway though, this is kinda like that.\nThe plot of this nearly 5-minute long video is as follows: Rita Ora and her nasty \"older man\" significant other walk into a diner. Don't ask questions about why Rita Ora is dating this troll dude (who is no Calvin Harris) just accept that this was the casting choice made. Iggy Azalea waits on Rita and troll dude, and troll dude is very rude to Iggy. Also, he will not allow Rita Ora to eat anything but a bacon and cheese sandwich. Because this guy is such a lame-o control freak slime ball, Iggy and Rita put on Kill Bill-reminiscent catsuits and join forces to vanquish him. Their espionage leads them around the world, from Japan, to \"Big Mama's Diner\", to \"Texan Restaurant,\" culminating in a scene of Samurai sword-fight vindication.\nBrought to you by the newest HP phone!\nLet's dive in, break down the references, the highlights, and the corporate endorsements... shall we?\nGang's all here!\nIggy's working hard for her money, and Rita Ora's sugar daddy is making her day terrible!\nHere's the perpetrator. We're just going to go out on a limb and call him a \"Bill\" type. Also, he teaches us a very important lesson; always judge someone's character by how they treat customer service personnel.\nSamurai Swords in a Snowy Field\nRemember The Bride's fight with O-Ren-Ishii in that field of snow in Kill Bill ? This is bringing back memories of that...\nCatsuits\nSure, Uma Thurman technically wears a track jacket in both Kill Bill volumes, but the race car-driver-style of these ensembles is clearly inspired by Thurman's yellow and black color-blocked uniform. The life of an international assassin necessitates tight clothing with stripes on either side.\nWise Old Sensei\nIggy's sensei schools her in the ways of ancient Japanese death arts. This dude is basically the Pai Mei to her \"Bride.\" Sure, his beard is way shorter than Pai Mei's, but we're gonna see this as a cinematic allusion!\nTraining Day\nIggy Iggz must learn to wield the power of the sacred Samurai wisely, so she and her Mr. Miyagi have a lengthy workshop. If you're asking how she got here from Big Mama's Diner, I don't have an answer for you.\nRita Ora Plays Poker, Featuring T.I. and Paul Sorvino\nThis is her only escape from her horrific boyfriend. She's ready to clean house.\nWhat's T.I. gonna do?? He put his house up as a bet! I guess it makes sense that he's in this video. After all, he and Iggy are buds.\nWhat's Paulie from Goodfellas doing here?\nHP Phones Are Great For Assassin Business\nYou're never fully dressed without some product placement...\nNow we're gonna hop on our motorcycles, and get down to business\nJust like the Iggz and Rita, Tarantino loves his motorcycles...\nRestaurant fight scene\nTo top off the Kill Bill references, the outnumbered pair successfully fights off a gaggle of armed assailants in a restaurant. Kicking ass and taking names while maintaining perfect makeup is the name of the game.\nCheck the video out for yourself below!\niggyazaleamusicVEVO on YouTube\nImage: Iggy Azalea Vevo/ Youtube (12)","url":"https://www.bustle.com/articles/35643-iggy-azaleas-black-widow-video-is-full-of-kill-bill-references-product-placement-video"}
