{"authors":["Amy Lyall For Daily Mail Australia"],"date_download":"2018-10-22 20:53:11","date_modify":"2018-10-22 20:53:11","date_publish":"2016-01-29 04:25:10","description":"Iggy Azalea returned to Los Angeles on Thursday and opened up about her thoughts on Macklemore's song directed at her.","filename":"data/vaneerConsumption/IggyAzaleasayssheAGREESwithsomeofMacklemoressongWhitePrivilegeII.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/02/30AE70DE00000578-0-image-a-73_1454034479458.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422102_Iggy-Azalea-reveals-AGREES-aspects-Macklemore-s-song-White-Privilege-II_1540241591.html","title":"Iggy Azalea says she AGREES with some of Macklemore's song White Privilege II","title_page":"Iggy Azalea says she AGREES with some of Macklemore's song White Privilege II | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been involved in a very public Twitter feud with US singer Macklemore, after he took a stab at her in his newly released track White Privilege II.\nAnd jetting into Los Angeles on Thursday, Iggy Azalea surprised fans by revealing she actually agrees with parts of the song.\nSpeaking to TMZ as she touched down from her flight from Paris, the 25-year-old voiced her thoughts on the provocative record that addresses how white people appropriate black culture and accuses her in particular of exploiting and stealing hip-hop.\nScroll down for video\nBreaking her silence: Iggy Azalea made her way through LAX on Thursday and revealed that the she 'of course' agrees with some parts of Macklemore's song that mentions her\nDressed in a casual outfit with her strawberry tinged locks tied back into a ponytail she said 'of course' she agrees with some of the issues Macklemore addresses, just 'not the bad stuff about me.'\nWhen further asked if white people should be able to borrow from black culture the Australian-born hit-maker said: 'I think all culture takes from all culture.\n'We're so global now I think it's impossible for everybody not to take influence from everybody.'\nSee Iggy Azalea updates as she reveals she AGREES with Macklemore\nFriend or foe? Iggy and Macklemore have been involved in a very public feud after the release of White Privilege II where he takes a stab at the Australian rapper for appropriating black culture\nIggy isn't the only musician who was dissed in the recently released song with Miley Cyrus also receiving a mention in the lyrics that read: 'You've exploited and stolen the music, the moment.\n'The magic, the passion, the fashion, you toy with, the culture was never yours to make better. You're Miley, you're Elvis, you're Iggy Azalea. Fake and so plastic, you've heisted the magic.'\nThe 32-year-old rapper continues: 'You've taken the drums and the accent you rapped in. You're branded \"hip-hop,\" it's so fascist and backwards.'\nTwitter war: Iggy took to Twitter to respond after a asked if she had heard the song\nIggy took to Twitter at the weekend to respond to a fan who had asked her if she had heard the song.\nThe Fancy singer said: 'He shouldn't have spent the last 3 yrs having friendly convos and taking pictures together at events etc if those were his feelings.'\nFellow rapper Talib Kweli then weighted in on the argument, writing: 'I actually rooted for Iggy when she first came out. But she’s disrespected hip hop culture one too many times.'\nHe went on: 'The fact that @iggyazalea thinks the song was a diss to her instead of actually listening, is proof of her privilege. F**k Iggy Azalea.'\nIt's all about respect: Iggy believes cultures are constantly being appropriated\nIt isn't the first time Iggy has had to deal with criticism, or been involved in a feud with another star.\nIn December Erykah Badu made a comment about her at the BET Soul Train Awards, and said that what the Australian is doing, 'is definitely not rap.'\nAnd in September 2014 she had to deal with comments from US MC Rah Digga.\nThe New Jersey born MC, commented on ThisIs50, a rap and hip-hop blog, that she didn't see Iggy as a legitimate rapper because she's taken on the American rapping style.\nThey come after she had to withdraw from social media from a time after getting into similar feuds with Azealia Banks and Snoop Dogg.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422102/Iggy-Azalea-reveals-AGREES-aspects-Macklemore-s-song-White-Privilege-II.html"}
