{"authors":["Will Martin","Oscar Williams-Grut"],"date_download":"2018-10-30 23:34:50","date_modify":"2018-10-30 23:34:50","date_publish":"2016-12-06 00:00:00","description":"On Tuesday, the FCA announced that it will look to introduce a series of \"stricter\" rules on companies that sell so-called contract for difference products.","filename":"data/vaneerConsumption/IGPlus500andCMCMarketssharescrashonFCAsCFDcrackdown.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ig-plus500-cmc-markets-fca-cfd-crackdown-shares-leverage-2016-12_1540942490.html","title":"IG, Plus500, and CMC Markets shares crash on FCA's CFD crackdown","title_page":"    IG, Plus500, and CMC Markets shares crash on FCA's CFD crackdown - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The FCA found 82% of people lose money on CFDs. REUTERS/Jean-Philippe Arles LONDON — Shares in companies that let clients effectively bet on stocks and commodities are getting annihilated on Tuesday after the Financial Conduct Authority announced a major crackdown on the industry.\nThe Financial Conduct Authority (FCA) announced that it will look to introduce a series of \"stricter\" rules on companies that sell products known as \"binary bets\" or \"contract for differences\" (CFDs). The crackdown is driven by fears that customers are losing more money than is acceptable. The FCA found that 82% of people who use the products lose money, suggesting it is more akin to gambling than investing.\nThe FCA's Executive Director of Strategy and Competition Christopher Woolard said in a statement he \"has concerns that binary bets pose investor protection risks and question whether binary bets meet a genuine investment need.\"\nCFDs are essentially bets on whether a share price, a currency, or commodity price will up or down. The person making the bet wins or loses in increments depending on how close or far the asset is to the price predicted. The most controversial aspect of the industry is the amount of leverage it offers — customers can lose far more money than they initial bet as CFD providers effectively lend them money.\nThe FCA announced on Tuesday it plans to:\nIntroduce new risk warnings and make providers disclose the ratio of profits to losses;\nLimiting leverage for new clients to 25:1 in their first year;\nLimiting leverage to 50:1 for all clients. Some platforms currently offer 200:1;\nBanning accounting opening offers and other benefits designed to lure in new clients.","url":"https://www.businessinsider.com/ig-plus500-cmc-markets-fca-cfd-crackdown-shares-leverage-2016-12"}
