{"authors":["Will Martin"],"date_download":"2018-10-30 23:45:39","date_modify":"2018-10-30 23:45:39","date_publish":"2016-12-05 00:00:00","description":"IHS Markit's latest PMI data for the services sector of the British economy dropped on Thursday morning.","filename":"data/vaneerConsumption/IHSMarkitServicesPMIfortheUKinNovember.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ihs-markit-uk-services-pmi-november-2016-12_1540943139.html","title":"IHS Markit Services PMI for the UK in November","title_page":"    IHS Markit Services PMI for the UK in November - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters/Phil Noble Britain's services sector, which accounts for more than 75% of the country's GDP, accelerated in November, with the sector's post-Brexit revival continuing at speed. That's according to the latest PMI survey from IHS Markit.\nThe services sector — which includes everything from banking to waitressing — drew a reading of 55.1 in the month, well ahead of October's 54.5 reading, and even further ahead of the forecast 54.2 growth that economists had predicted.\nThe numbers from IHS Markit provided the best reading for the sector since January.\n\"November PMI survey data from IHS Markit and CIPS signalled that the UK service sector remained on a firm growth path towards the end of 2016,\" said IHS Markit in a statement.\n\"The rate of expansion of total activity accelerated further to the strongest since January. Employment growth picked up to the fastest since April, partly fuelled by the sharpest build-up of outstanding work since July 2015.\"\nThe purchasing managers index (PMI) figures from IHS Markit are given as a number between 0 and 100.\nAnything above 50 signals growth, while anything below means a contraction in activity — so the higher the number is, the better things look for the UK.\nHere is IHS Markit's chart of the PMIs longer-term trend (note the massive pick up since July):\nIHS Markit\nThe PMIs seem to suggest that British businesses are now shrugging off the initial shock of the vote, and are surprisingly strong in the face of Brexit turmoil. As Chris Williamson, Chief Business Economist at IHS Markit notes:\n\"The further upturn in the vast services sector shows that the pace of UK economic growth remains resiliently robust in the fourth quarter, despite ongoing uncertainty caused by Brexit.\n\"The three PMI surveys collectively indicate that the economy will grow by 0.5% in the fourth quarter.\n\"Rising prices - often linked to the weaker pound - are a big concern, however, and suggest that inflation is set to lift higher. The past two months have seen the steepest rise in businesses' costs for over five-and-a-half years. These higher costs will inevitably feed through to consumers in the form of higher prices.\"","url":"https://www.businessinsider.com/ihs-markit-uk-services-pmi-november-2016-12"}
