{"authors":["Jaime Dunaway"],"date_download":"2018-10-30 21:52:30","date_modify":"2018-10-30 21:52:30","date_publish":"2018-08-03 00:00:00","description":"A solo kayaker floating the length of the Arkansas River visited North Little Rock on Thursday after traveling nearly 1,500 miles on his way to the Gulf of Mexico.","filename":"data/vaneerConsumption/IjustwanttoexploreKayaker64traveling2000milesstopsinNorthLittleRock.json","image_url":"https://media.arkansasonline.com/img/photos/2018/08/03/TM_0802Kayaker_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_aug_02_kayaker-tr_986c9dbda20ffb0b12748326994ed7db__page=1_1540936350.html","title":"'I just want to explore': Kayaker, 64, traveling 2,000 miles stops in North Little Rock","title_page":"'I just want to explore': Kayaker, 64, traveling 2,000 miles stops in North Little Rock ","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A kayaker paddling the length of the Arkansas River visited North Little Rock on Thursday after traveling nearly 1,500 miles on his way to the Gulf of Mexico.\nHannes Zacharias made the 10 a.m. stop at the Arkansas Inland Maritime Museum months after beginning his journey May 23 at the mouth of the Arkansas River in Leadville, Colo. There, he gathered snow in small vials that he will pour into the Gulf when he reaches it Sept. 1. He must travel about 700 more miles to get there.\nThe 64-year-old, who grew up on the Arkansas River in Dodge City, Kan., said he is re-creating his last solo kayaking trip, when he delivered a message from the mayor of Dodge City to the mayor of New Orleans.\n\"Part of the reason I'm doing this trip is to tell people of my generation and age that you can still have adventures,\" Zacharias said. \"I don't need to prove to anybody that I can do it. I did it. There's a lot of joy in that. I just want to explore.\"\nMuch has changed since the kayaker first paddled the river in 1976. Zacharias noted a higher number of locks and dams, as well as decreased water levels, but he said people now view the river in a more positive way.\n\"People are starting to approach the river for its recreational value, opposed to just its commercial value,\" he said.\nThe trip is 2,060 miles long, with 1,469 miles of the Arkansas River and 582 miles of the Mississippi River from the mouth of the Arkansas to the Gulf.\nThe journey hasn't been without its perils. In addition to paddling through stormy weather, Zacharias said he's had several near-death experiences.\nWhile floating in Colorado, he came across an unmapped low-water dam where currents can suck kayakers under water and drown them. To avoid the structure, he floated toward the bank and encountered boulders, upon which his kayak got stuck at a 75-degree angle.\nHe lost his paddle, which he found downriver caught in a snag. After half an hour trying to retrieve it from the rapids, the risk of tipping over became too high, and he had to move on.\n\"That's one of the more challenging experiences,\" he said. \"You've got to be wise about it. Some days you just have to give up the paddle and get a new one.\"\nThe kayaker, who paddles about 4 miles a day, travels with six days' worth of food and stops to restock and camp at various cities along the way.\n\"That's one of the things I like about this trip,\" he said. \"Instead of trying to get water under my keel, I want to understand the communities. I'm stopping in as many as I can, learning about them and their history to the river. That's been a real joy for me.\"","url":"https://www.arkansasonline.com/news/2018/aug/02/kayaker-traveling-2000-miles-along-arkansas-river-/?page=1"}
