{"authors":["Mallory Carra"],"date_download":"2018-10-31 01:49:18","date_modify":"2018-10-31 01:49:18","date_publish":"2018-09-06 13:25:02","description":"The first lesson of the day is how to roll, and get right back up — across the entire mat. It’s a move that requires precision, control, and practice, setting the tone of the Academy of Movement Arts & Sciences’ weekly stunt fight choreography…","filename":"data/vaneerConsumption/ILearnedToStuntFightFromProfessionalsItsSoMuchMoreThanThrowingAPunch.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/5/ec3a2ded-3a38-4fc4-9c34-ac0a00ca2df6-149fbdfc-8bd2-48b1-b462-d9a5fe8f1f86-c01fffee-37db-4829-a3d5-e166c5251b20-20180828_150808.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_i-learned-to-stunt-fight-from-professionals-its-so-much-more-than-throwing-a-punch-11759520_1540950558.html","title":"I Learned To Stunt Fight From Professionals & It's So Much More Than Throwing A Punch","title_page":"I Learned To Stunt Fight From Professionals & It's So Much More Than Throwing A Punch","title_rss":"NULL","source_domain":"bustle.com","text":"The first lesson of the day is how to roll, and get right back up — across the entire mat. It’s a move that requires precision, control, and practice, setting the tone of the Academy of Movement Arts & Sciences’ weekly stunt fight choreography class. I’m one of seven students, some first timers and some regulars, learning what it takes to be a Hollywood stunt performer, and it was way harder and tougher than I expected.\nIt’s a hot and humid Sunday morning in Inglewood, California at the whimsical circus-themed training studio Le PeTiT CiRqUe. The class itself, though, is far more intense than the light-hearted hoops and curtains around us.\nLike many movie fans, the only experience I have with stunts is watching the impossible seem possible on the movie screen. I've had many running injuries — from pulling my hamstring to literally falling on my face — and I decided to take this class as part of my own personal fitness goal to learn how to work out safer and stronger. In June, I started doing strength training and cardio with two trainers at a Santa Monica gym several times a week. I thought the stunt class wouldn't be much different than my usual intense gym workout. But when I mentioned the class to my trainer Chris, he grimaced. \"Good luck,\" he told me during my Friday workout a few days before the stunt class. \"That's going to be hardcore.\"\nMallory Carra/Bustle\nEven so, I wanted to find out for myself the kind of \"hardcore\" work goes into being a stunt person. While one class definitely isn't enough to truly gauge the amount of training required, it gave me a rare glimpse at a little-known industry — one that doesn't usually have a ton of visibility in Hollywood or even in Los Angeles.\nThis Sunday morning class consists of three other women and three men, plus Academy of Movement Arts & Sciences owner Tim Storms and his instructor Lohan Buson. Before class begins, John says he's a former professional soccer player looking to get into stunts — he has already signed up for a month's worth of classes and this is his first one. The other man is an actor who wants to learn how to perform stunts; this is also his first class. Another first-timer to the class is Leah, a high school theater teacher who is taking the class as research for her students’ upcoming fall production, She Kills Monsters by Qui Nguyen. It's an action-packed play about that brings the world of Dungeons & Dragons to life through the eyes of the female protagonist.\nOur two other female classmates enter the studio and keep to themselves. They seem to know their way around this class very well without saying a word. Storms asks a regular student, Andrew, to lead the warm-up for the entire class.\nThe class' relatively equal ratio that seems to reflect women's emergence in the historically male-dominated stunt industry — a trend that Storms has also noticed.\n\"I would say in the past 10 years women have really come to the forefront. In fact, I see a huge influx ... of women that are getting into the stunt world than guys,\" he tells me several days later when we meet at a Coffee Bean & Tea Leaf in Los Angeles. \"Now, women are equal, or even superior, to guys because they're training as hard or harder to prove themselves.\"\nMallory Carra/Bustle\nStorms is a longtime professional stunt person who has been teaching stunt training classes for about 15 years. He is also a classically trained Shakespearean actor, and has been a competitive gymnast and martial artist for decades. He has worked as a stunt double for Patrick Stewart and J.K. Simmons, as well as other actors.\n\"That really worked!” I say, impressed with myself. “Now keep doing it,” he tells me.\nBefore the rolling lesson, Storms tells the group to warm up by running laps around the gray, cushioned mat — our home for the next hour and a half. The laps include some criss-cross footwork and backward movement, but it’s not as complex as the safety roll. Storms demonstrates the move for the class. He positions himself in a lunge variation, puts his palms in a “T” formation, and tells us to lean forward and roll over. The goal, he emphasizes, is to fall on the softest parts of our body – the upper arm and the upper thigh – as we bounce back up.\nWhen it’s my turn, Storms adjusts my hands and form, then tells me to roll. I lean forward onto my hands. I roll onto my upper arm and back. I’m upright again. I look back at him. “That really worked!” I say, impressed with myself. “Now keep doing it,” he tells me, pointing toward the rest of the mat. I tumble and roll across the mat, shocked that it worked for me every time.\n\"You have to know how to roll safely without injuring yourself,\" Storms tells me later on. \"Sometimes I'll highlight specific falls where we actually take reactions and hit the ground just onto mats in the gym, so you're not actually hitting the ground hard.\"\nThe rest of the warm-up is made up of the actions that will dominate the remainder of the class: punches and kicks. As a group, we form a line and move forward as we punch and kick air in different combinations across the mat. These moves soon make up Storms and Lohan’s choreography lesson of the day, which is a fight sequence that the class practices and practices with a classmate until the punches, kicks, and blocks are perfect and well-timed. The moves never land or hit as hard as they would in real life, but students are expected to go through the motions in a realistic way.\nTim Storms Creative Action Development on YouTube\nStorms and Lohan occasionally pair off together to come up with new moves to add to the lesson. Both instructors are welcoming and encouraging to beginners who take his class. The first student I’m paired up with, however, is far more advanced than myself. She dives right into the choreography without any introductions or small talk. She rolls her eyes when I miss a block or flub a kick. My punches are too quick and my blocks are too hard or not hard enough. I get it — working with a partner below your experience level is frustrating. But Storms says that occasionally working with someone below your skill level is actually very common challenge for a stunt person on a movie set.\n\"If you're more advanced with your skill set and you're paired with somebody that's not as good as you, you have to learn to accommodate them,\" Storms tells me. \"When I'm a stunt person on set and I'm working with an actor who's expected to do their own fights or basic stunts, I can guide them and I have to make sure things are safe because they can get out of control very quickly.\"\nBut during the class, me and my ego take a lot of hits and I walk away from my partner. I see her quietly ask for a more experienced partner, and I seek out another beginner to work with me. My new partner is Leah, the high school theater teacher.\nStorms helps us perfect our fighting stance and fists. Lohan instructs me on how to better control and refine my movements to make them look more realistic. “Think of the purpose behind each movement,” he tells me. “Like with acting, if you don’t believe each move, no one else will.”\nWith that in mind, my blocks are stronger and my punches more controlled. Leah and I finally have the moves down. But mastering it once isn’t enough. Lohan gives us an assignment: do that fight sequence 25 times, then call him back. Leah and I don’t keep count of our reps, but we notice that our timing for each punch, kick, and block improves. Across the mat, we see our former partners add a spinning, flying kick to their choreography, but we shrug and continue repeating our basic moves.\nLeah and I get better. We even earn Lohan's approval to move onto the next part of the lesson: the finale of our \"fight.\" For the final move in the sequence, I'm supposed to kick Leah in the abdomen to defeat her. It's the only kick of the sequence that isn't blocked — but this isn't a \"Finish her\" move from Mortal Kombat. For class, Lohan tells me to lift my left leg and deliver a small tap with my foot to her stomach.\n“Think of the purpose behind each movement. Like with acting, if you don’t believe each move, no one else will.”\nWe practice the move over and over again. Lohan approves of our moves and timing, but now, he says we need to work on the acting. He tells Leah that she needs to act like she got punched in the gut. Storms says that's the other key element in being a stunt person, because stunt coordinators are looking for stunt people who are able to act and recite dialogue in scenes.\n\"It's physical acting,\" Storms tells me later. \"I would say nowadays it's much more all encompassing. You have to know the business now, too. Whereas, before, you could get by and you had the skill set and you could do your job. That has been a big shift in the thoughts behind stunt work in the general community over the past decade. Now, every stunt coordinator out there is looking for a stunt person that can act.\"\nAfter class, Storms tells me I did well for my first time, though I'm just glad I survived. A thick layer of sweat coats my skin. I can already tell I'm going to be sore for the next few days. I'm so tired that I even forget my water bottle at the studio and I don't realize it until I get home.\nThe next day, my entire body was indeed sore and I decided to skip my usual Monday gym routine. Not because my trainer would probably say \"I told you so,\" but because I was exhausted. In the shower, I noticed a few bruises on my legs.\nThe class had a physical impact on me — but it also gave me a new respect for the stunt industry. Being fit and strong is just part of it, but stunt training is rooted in a foundation of safety, movement control, and acting. I realized that it takes a lot of hard work to just get the fundamental moves correct — and so much more effort is required to reach the level of a professional Hollywood stunt person who is ready for action.","url":"https://www.bustle.com/p/i-learned-to-stunt-fight-from-professionals-its-so-much-more-than-throwing-a-punch-11759520"}
