{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:27:17","date_modify":"2018-10-30 20:27:17","date_publish":"2016-12-03 08:56:52","description":"Bob Geldof has revealed he “led” a rally of abused directed at the U.S. Vice President-Elect in a theater last month.","filename":"data/vaneerConsumption/ILedtheBooingofMikePenceatHamilton.json","image_url":"https://media.breitbart.com/media/2016/06/GettyImages-540302350.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_12_03__1540931237.html","title":"I Led the Booing of Mike Pence at Hamilton","title_page":"Bob Geldof: I Led the Booing of Mike Pence at Hamilton","title_rss":"NULL","source_domain":"breitbart.com","text":"Bob Geldof, the singer who became renowned for hurling abuse at Brexit supporters, has revealed he “led” a rally of abuse directed at the U.S. Vice President-Elect in a theatre last month.\nMike Pence was heckled at a production of the play Hamilton on the 19th of November, after he was booed, jeered, and lectured by the cast at the Richard Rodgers Theatre on Broadway.\nThe election of Donald J. Trump and his vice president has been widely compared to the Brexit vote in the UK – as a revolt against the liberal cultural establishment and ruling elites.\nPerhaps fitting, then, that a celebrity who came to represent that sneering liberal elite in the UK, accused of “patronising” and “abusing” Brexit supporters, was also behind the grandstanding attack on Mr. Pence.\n“I was at Hamilton when Pence was booed, I stood up and vigorously led the booing!” Mr. Geldof told Guardian journalist Jessica Elgot when out campaigning for the Liberal Democrats in Richmond this week.\nMr. Geldof reportedly described the Hamilton cast as “respectful”, but added: “I wouldn’t have been!”\nDuring the Broadway production last month, telling the life story of founding father Alexander Hamilton, Mike Pence was lectured at from the stage by actor Brandon Victor Dixon.\n“We, sir, are the diverse America who are alarmed and anxious that your new administration will not protect us, our planet, our children, our parents, or defend us and uphold our inalienable rights,” Mr. Dixon ranted.\n“We truly hope that this show has inspired you to uphold our American values and to work on behalf of all of us,” he continued, as the crowd became excited and angered.\nDuring the UK’s European Union (EU) referendum campaign, Mr. Geldof mocked, shouted, and swore at a group of fisherman protest against EU imposed fishing quotas, which have crushed their industry.\nThis led to Labour party activists leaving the protest in “disgust” and later “apologis[ing]” for “jeering at fisherman worried about their livelihoods”.","url":"https://www.breitbart.com/europe/2016/12/03/anti-brexit-bob-geldof-led-booing-mike-pence-hamilton/"}
