{"authors":["Daniel Sandford For Mailonline"],"date_download":"2018-10-23 00:42:26","date_modify":"2018-10-23 00:42:26","date_publish":"2016-01-11 10:24:26","description":"The 25-year-old has been linked with a move to Italian champions Juventus, while Manchester City are also said to be fans of the Germany international.","filename":"data/vaneerConsumption/IlkayGundoganadmitshehasnotmadeadecisiononhisfutureasBorussiaDortmundmidfielderconsidersoptions.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/10/3007338600000578-0-image-a-8_1452507476823.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393582_Ilkay-Gundogan-admits-not-decision-future-Borussia-Dortmund-midfielder-considers-options_1540255346.html","title":"Ilkay Gundogan admits he has not made a decision on his future as Borussia Dortmund midfielder considers options","title_page":"Ilkay Gundogan admits he has not made a decision on his future as Borussia Dortmund midfielder considers options | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Borussia Dortmund midfielder Ilkay Gundogan insists no decision has been made on his future, despite continued interest from clubs across Europe.\nThe 25-year-old has been linked with a move to Italian champions Juventus, while Manchester City are also said to be fans of the Germany international, as they plan for life with Bayern Munich boss Pep Guardiola, who is leaving the club at the end of the season.\nThe German playmaker had been linked with a move to Manchester United last summer before penning a new contract with Dortmund, to keep him at Signal Iduna Park until 2017.\nBorussia Dortmund midfielder Ilkay Gundogan has admitted that no decision has been made on his future\nGundogan (left) was linked with a move to Manchester United but signed a contract with Dortmund until 2017\n'There is still no decision, and of course, everything has to be considered very carefully, because your career is limited in time,' Gundogan told German newspaper Bild.\n'But to be honest, everything is still open.'\nNo stranger to speculation, Gundogan was jeered by sections of the Dortmund fans last season, as talk about his future was again the subject of discussion.\n'I know what I have at my club, and I'm not going to lose sight of it. But again, a decision is definitely not made,' he said.\nA back injury forced Gundogan out of action for 17 months, causing him to miss out on the 2014 World Cup, but the Dortmund star has since bounced back, featuring 24 times so far this campaign.","url":"https://www.dailymail.co.uk/sport/football/article-3393582/Ilkay-Gundogan-admits-not-decision-future-Borussia-Dortmund-midfielder-considers-options.html"}
