{"authors":[],"date_download":"2018-10-30 14:34:10","date_modify":"2018-10-30 14:34:10","date_publish":"2015-07-24 00:00:00","description":null,"filename":"data/vaneerConsumption/IllegalaliencrimewaveinTexasNearly3000homicidessince2008.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_illegal_alien_crime_wave_in_texas_nearly_3000_homicides_since_2008_comments_1540910050.html","title":"Illegal alien crime wave in Texas: Nearly 3,000 homicides since 2008","title_page":"Blog: Illegal alien crime wave in Texas: Nearly 3,000 homicides since 2008","title_rss":"NULL","source_domain":"americanthinker.com","text":"PJ Media's legal editor, J. Christian Adams, has an exclusive report on statistics involving crimes committed by illegal aliens in Texas. The numbers are staggering. Nearly 3,000 homicides committed by illegal aliens since 2008, and more than 611,000 unique crimes. The information comes from an unreleased report by the Texas Department of Public Safety. PJ Media obtained a never-before-released copy of a Texas DPS report on human smuggling containing the numbers of crimes committed by aliens in Texas. According to the analysis conducted by the Texas Department of Public Safety, foreign aliens committed 611,234 unique crimes in Texas from 2008 to 2014, including thousands of homicides and sexual assaults. The report describes an alien crime wave of staggering proportions exacerbated by federal officials unwilling to enforce immigration laws. The Texas DPS report says well over 100,000 individual criminal aliens have... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/07/illegal_alien_crime_wave_in_texas_nearly_3000_homicides_since_2008_comments.html"}
fingerprinted. Arrests of illegal aliens who have not been fingerprinted prior to arrest are not included in these arrests numbers derived from the Secure Communities initiative.\nThat means that the already stratospheric aggregate crime totals would be even higher if crimes by many illegal aliens who are not in the fingerprint database were included.","url":"https://www.americanthinker.com/blog/2015/07/illegal_alien_crime_wave_in_texas_nearly_3000_homicides_since_2008.html"}
