{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:55:49","date_modify":"2018-10-30 21:55:49","date_publish":"2015-03-10 03:21:49","description":"An audit conducted by the Social Security Administration’s (SSA) inspector general finds that thousands of social security numbers of people who are long deceased were used by illegal immigrants to apply for work, and some numbers were also used to open bank accounts.","filename":"data/vaneerConsumption/IllegalsUsing1000sofSocialSecurityNumbersofDead.json","image_url":"https://media.breitbart.com/media/2015/03/living-112-year-old-man-AP-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_09__1540936549.html","title":"Illegals Using 1000s of Social Security Numbers of Dead","title_page":"Illegals Using 1000s of Social Security Numbers of Dead","title_rss":"NULL","source_domain":"breitbart.com","text":"An audit conducted by the Social Security Administration’s (SSA) inspector general finds that thousands of social security numbers of people who are long deceased were used by illegal immigrants to apply for work, and some numbers were also used to open bank accounts.\nCNSNews.com reports that the March 4 audit has identified 6.5 million social security number-holders who are aged 112 or older, for whom no date of death has been assigned in the electronic file known as Numident.\nAccording to the audit, for tax years 2006-2011, “SSA received reports that individuals using 66,920 SSNs had approximately $3.1 billion in wages, tips, and self-employment income. SSA transferred the earnings to the Earnings Suspense File because the employees’ or self-employed individuals’ names on the earnings reports did not match the number-holders’ names.”\nSimilarly, from 2008-2011, employers made over 4,000 E-Verify inquiries using nearly 3,900 social security numbers belonging to people who were born prior to June, 1901.\n“These inquiries indicate individuals’ attempts to use the SSNs to apply for work,” the audit report said.\n“It is incredible that the Social Security Administration in 2015 does not have the technical sophistication to ensure that people they know to be deceased are actually noted as dead,” said Sen. Ron Johnson (R-Wis.), chairman of the Homeland Security and Governmental Affairs Committee.\n“Tens of thousands of these numbers are currently being used to report wages to the Social Security Administration and to the IRS. People are fraudulently, but successfully, applying for jobs and benefits with these numbers,” Johnson continued. “Making sure Social Security cleans up its death master file to prevent future errors and fraud is a good government reform we can all agree on.”\n“It is simply unacceptable that our nation’s database of Social Security numbers of supposedly living people includes more than six and a half million people who are older than 112 years of age, with a few thousand having birth dates from before the Civil War,” said Sen. Tom Carper (D-DE). “Preventing agency errors by keeping track of who has died is a relatively simple problem that the government should pursue as a high priority.”","url":"https://www.breitbart.com/politics/2015/03/09/illegal-immigrants-using-thousands-of-social-security-numbers-of-deceased-to-apply-for-work/"}
