{"authors":[],"date_download":"2018-10-22 22:26:40","date_modify":"2018-10-22 22:26:40","date_publish":"2014-05-10 17:20:52","description":"National Park Service officials approved $3 million in illegal construction projects, but few have been punished.","filename":"data/vaneerConsumption/IllegalParkServiceProjectsDamagedSacredAmericanIndianSite.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/434161/140510-effigy-mounds-mn-1400_dfe5acef3819c995aa0fff41e6946fb4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_illegal-park-service-projects-damaged-sacred-american-indian-site-n102186_1540247200.html","title":"Illegal Park Service Projects Damaged Sacred American Indian Site","title_page":"Illegal Park Service Projects Damaged Sacred American Indian Site","title_rss":"NULL","source_domain":"nbcnews.com","text":"Regional officials in Omaha, Nebraska, uncovered the violations in 2009 but waited years to take disciplinary action against Ewing, whose attorney told The Associated Press she was fired Feb. 28 and is contesting the decision.\nWhile no human remains were affected, one tribal leader complained that officials treated his ancestors' cemeteries \"as places to walk your dog,\" records show. Another said the projects were \"monuments to government stupidity.\"\nThe Mississippi River Valley site was created by President Harry Truman in 1949 to preserve \"a significant phase of mound building culture of prehistoric American Indians.\" It contains 200 mounds — some shaped like bears and birds — affiliated with 12 tribes.\nNational Park Service employees blamed Ewing and Sinclair for pursuing the illegal developments in a misguided effort to make the site more accessible to those with disabilities. Some also blamed a lack of oversight for allowing construction that removed stone artifacts and impacted scenic views.\n\"We've tried to understand how a park can behave so badly. Wherever they had a chance to screw up, they did,\" one regional official said in a 2011 investigative interview, adding the actions \"destroyed the park and it will take decades of hard work\" to repair the damage.\nThe agency hasn't removed two of three boardwalks, years after acknowledging they wouldn't have been built had employees followed the National Historic Preservation Act and other laws.\nJeff Ruch, executive director of Public Employees for Environmental Responsibility, said Ewing oversaw \"a stunning pattern of cultural resource desecration.\"\n\"The park service may have set a new record in dithering by waiting five years to take any kind of formal action in a case that's this outrageous,\" said Ruch, who uncovered the records through the Freedom of Information Act.\nEwing's attorney, Mike Carroll, said the park service is making her a scapegoat to avoid deeper examination of what went wrong, saying she denies misconduct.\nAgency spokeswoman Patty Rooney said that the \"principal staff persons involved are no longer employed.\"\nFormer park employee Timothy Mason filed a 2010 complaint that sparked the criminal investigation by park service special agent David Barland-Liles after whistleblowers gave him information. The U.S. Attorney's Office declined to press civil or criminal charges against anyone in 2012.\nA lifelong park user, Mason called on the agency to \"remove all of that illegal, obtrusive junk.\" Rooney said the boardwalks' future would be decided soon.\nThe documents included a 2010 memo sent by Regional Director Ernest Quintana to the National Park Service Director Jon Jarvis warning that the illegal construction \"had major, adverse impacts to cultural landscapes and to aboriginal American Indian structures that (the site) was established to protect.\"\nQuintana later told Barland-Liles that he kept Ewing as superintendent after the 2009 audit uncovered widespread violations, saying he wanted to give her the chance to help the park recover and prove herself as a manager.\nQuintana, now retired, said he didn't consider firing Ewing because she had \"no devious design to do something wrong.\" In 2010, she agreed to transfer to a non-supervisory position in Omaha rather than resign, he said.\nCarroll said Ewing's recent firing was based on allegations that she failed to perform duties and follow guidelines dating to her tenure as superintendent, which began in 1999. She's pursuing an internal complaint alleging gender and age discrimination.\nEwing believed that subordinates were carrying the projects out legally and has taken responsibility for inadvertent errors, defense attorney Guy Cook said.\nSinclair, the former maintenance chief who recently left the agency, has no comment, his wife said. He urged prosecutors to \"have mercy\" in a 2012 interview with Barland-Liles, saying Ewing put him in charge of compliance even though he wasn't familiar with the law.","url":"https://www.nbcnews.com/news/us-news/illegal-park-service-projects-damaged-sacred-american-indian-site-n102186"}
