{"authors":["Katherine Hobson"],"date_download":"2018-10-23 00:54:26","date_modify":"2018-10-23 00:54:26","date_publish":"2016-08-25 00:00:00","description":"Fentanyl is showing up in heroin and counterfeit pain pills, and users may not even know they're taking the extremely potent drug.","filename":"data/vaneerConsumption/IllegallyMadeFentanylSeemsToBeFuelingASpikeInOverdoses.json","image_url":"https://media.npr.org/assets/img/2016/08/25/fentanyl_wide-1cf01d5afb13cfc2e50fc2f152c4352825b2e60a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2016_08_25_491340448_illegally-made-fentanyl-seems-to-be-driving-a-spike-in-overdoses_1540256066.html","title":"Illegally Made Fentanyl Seems To Be Fueling A Spike In Overdoses","title_page":"Illegally Made Fentanyl Seems To Be Fueling A Spike In Overdoses : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Illegally Made Fentanyl Seems To Be Fueling A Spike In Overdoses\nEnlarge this image toggle caption Tommy Farmer/Tennessee Bureau of Investigation/AP Tommy Farmer/Tennessee Bureau of Investigation/AP\nFederal data suggest illegally manufactured fentanyl, a drug that is 50 to 100 times stronger than morphine, is behind an increase in synthetic opioid deaths.\nA report from the Centers for Disease Control and Prevention says that there was a 426 percent increase in seized drug products that tested positive for fentanyl from 2013 to 2014. And separate data show the number of deaths involving synthetic opioids, a class that includes fentanyl and tramadol but not hydrocodone, rose 79 percent during that same period.\nAmong 27 U.S. states analyzed, there was a strong correlation between increases in synthetic opioid deaths and in seized fentanyl products, but not with changes in fentanyl prescribing, according to data published Thursday in the Morbidity and Mortality Weekly Report.\nThat suggests, the authors say, that illegally manufactured fentanyl is driving the spike in overdoses. (Deaths attributed specifically to fentanyl aren't reported in national data.)\n\"What concerns us here is the rapid increase, especially in a small number of states,\" says Matthew Gladden, an author of the report and a researcher at the CDC. In eight \"high-burden\" states, the death rate from synthetic opioids rose 174 percent, to 3.6 per 100,000, from 2013-14.\nFentanyl is available by prescription to treat severe pain. But the fentanyl that's currently on the streets — usually mixed into heroin and often without the user's knowledge — isn't from diverted pharmaceutical products. Instead it's being illicitly manufactured, according to the government.\n\"Starting in 2013, the production of illegally manufactured fentanyl increased to unprecedented levels, fueled by increases in the global supply, processing and distribution of fentanyl and fentanyl-precursor chemicals by criminal organizations,\" the report says. Between 2014 and 2015 alone, the number of seized fentanyl products rose from 5,343 to 13,882.\nFentanyl is cheaper to make than heroin and very potent, which means manufacturers can wring out more doses per batch. \"There's a huge profit margin,\" says Gladden.\nMore recently, the U.S. Drug Enforcement Administration said in July that fentanyl was also showing up in counterfeit pain pills. Prince died of a self-administered dose of fentanyl, and the Minneapolis Star Tribune recently reported that pills identified as hydrocodone found at the musician's Paisley Park studio actually contained fentanyl.\n\"It's quite a game-changer,\" says Carol Falkowski, CEO of Drug Abuse Dialogues, an education and training organization. \"It's imperative that the word gets out that prescription pills purchased on the black market can be deadly. It's an extreme case of buyer beware.\"\nThe report says an \"urgent\" response from law enforcement and public health is necessary to tackle the problem, including more testing for fentanyl in areas where it's a big problem. The government has advocated the expanded use of naloxone, an antidote to opioid drugs, as well as expanding the use of addiction treatment that includes medications.\nKatherine Hobson is a freelance health and science writer based in Brooklyn, N.Y. She's on Twitter: @katherinehobson","url":"https://www.npr.org/sections/health-shots/2016/08/25/491340448/illegally-made-fentanyl-seems-to-be-driving-a-spike-in-overdoses"}
