{"authors":["Associated Press"],"date_download":"2018-10-23 05:14:35","date_modify":"2018-10-23 05:14:35","date_publish":"2016-01-29 20:56:45","description":"ST. LOUIS (AP) — Dozens of southern Illinois families still awaiting new housing after they accepted government buyouts following the 2011 Mississippi River ...","filename":"data/vaneerConsumption/Illinoisbudgettiffmeansmoreflooddamagebeforebuyouts.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:6882f94e75de4afd826377392dabb2bb-4PuZeKVXE7cd9005b2c876e3a1b9-645_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423256_Illinois-budget-tiff-means-flood-damage-buyouts_1540271675.html","title":"Illinois budget tiff means more flood damage before buyouts","title_page":"Illinois budget tiff means more flood damage before buyouts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Illinois budget tiff means more flood damage before buyouts\nST. LOUIS (AP) — Dozens of southern Illinois families still awaiting new housing after they accepted government buyouts following the 2011 Mississippi River flood instead got socked by another round of damage amid the prolonged political fight over the state's budget.\nAlexander County officials estimate that several dozen homes approved for buyouts in spring 2015 suffered further damage from early-winter floods that toppled levees on the Mississippi and its tributaries in Missouri and Illinois in late December and early January. Officials say roughly one dozen of those homes were occupied at the time.\nThe Illinois Department of Natural Resources in June suspended a buyout program in which the state agreed to provide a 25 percent match to $9 million from the Federal Emergency Management Agency. The order came as Republican Gov. Bruce Rauner's administration cut back programs during a deadlock over the budget with Democratic leaders in the Legislature.\nFILE - In this Jan. 3, 2016, file photo, Illinois Gov. Bruce Rauner listens to Illinois Emergency Management Agency officials warn of the dangers of driving through high water of the south fork of the Sangamon River in Kincaid, Ill. Some southern Illinois residents who by now expected to live in new homes after agreeing to government buyouts following a 2011 Mississippi River flood instead got socked a second time amid a prolonged political fight over the state¿s budget. (AP Photo/Seth Perlman, File)\nRauner vowed Thursday to \"do everything possible to help people and communities\" in announcing that FEMA officials will come to Illinois next week to help assess the damage. His statement made no mention of the suspended buyout program.\n\"I am so stressed out,\" said Jean Ratliff, 76, whose home in Hodges Park was invaded by several inches of water in the recent flood after 4 to 5 feet of water overtook the house in the 2011 inundation.\nRatliff continues to wait on the government money promised to help elevate her home, which would allow her to stay put. While staying with a friend in Missouri, she said she is suffering from depression over the prospect of covering repairs that could have been avoided. During a tour after the recent floods, she said, she greeted Rauner and said he advised her to \"hang in there.\"\n\"I don't have money to put this house back together again,\" she said. \"I'm frustrated. I'm angry. I don't know what I'm going to do.\"\nThe delay has forced other families to tap their retirement accounts to pay for new homes while awaiting government demolition approval. That can mean two mortgages and twice as many property tax bills, utility bills and insurance policies. And homeowners whose properties are condemned as uninhabitable while their payments are in limbo can lose those benefits entirely.\n\"It's just another example of how the people in Springfield won't do the job they're supposed to,\" said Alexander County highway engineer Jeff Denny, who's overseeing the program for the county. \"And the people out in the state are suffering.\"\nOf the 137 properties FEMA agreed to buy, Illinois committed to share the cost of 111 of those properties, according to Denny. The DNR letter arrived after closings had already been held on about 35 properties and the county had laid out roughly $2.5 million in anticipation of state reimbursements that are made available only once demolition has occurred.\nLance Trover, a spokesman for Gov. Bruce Rauner, said the first-term Republican \"sympathizes with those who have been affected by the floodwaters.\"\nBut as with most issues that have emerged in the absence of a spending plan for the current fiscal year, the Rauner administration also blames the Legislature for not agreeing to business-friendly reforms the governor wants.\nA DNR spokesman said the agency \"remains hopeful that the program can resume once a balanced budget is approved.\"\nBetty Greenley, 57, described a feeling of \"here we go again\" when the Olive Branch home that she and her husband moved out of in anticipation of a buyout flooded for a second time.\n\"We took part of my husband's retirement money to buy (a new) house thinking that just in a matter of months we would do the buyout,\" she said. \"And it's been a year-and a half ... Fortunately we had somewhere to go this time.\"\n\"Our (buyout) money is being held as political ransom,\" said Shirley Dunn, 66, of Olive Branch, who borrowed $14,000 on a one-year, interest-free credit card to help buy a new home while awaiting a promised $62,000 buyout.\n___\nFollow Alan Scher Zagier on Twitter at http://twitter.com/azagier\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3423256/Illinois-budget-tiff-means-flood-damage-buyouts.html"}
