{"authors":["Associated Press"],"date_download":"2018-10-23 01:59:54","date_modify":"2018-10-23 01:59:54","date_publish":"2017-04-26 12:50:48","description":"SPRINGFIELD, Ill. (AP) - Trustees of an Illinois state retirement board on Wednesday terminated the pension that imprisoned former U.S. House Speaker Dennis...","filename":"data/vaneerConsumption/IllinoisboardterminatesHastertsstatelawmakerpension.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/19/wire-467361-1493232960-553_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447430_Illinois-board-consider-Hasterts-state-lawmaker-pension_1540259994.html","title":"Illinois board terminates Hastert's state lawmaker pension","title_page":"Illinois board terminates Hastert's state lawmaker pension | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SPRINGFIELD, Ill. (AP) - Trustees of an Illinois state retirement board on Wednesday terminated the pension that imprisoned former U.S. House Speaker Dennis Hastert received for his nearly six years of service in the Illinois General Assembly.\nThe General Assembly Retirement System's board of trustees voted 5-2 to end Hastert's $28,000 annual pension. Hastert, 75, is serving a 15-month prison term in a hush-money case that stemmed from his sexual abuse of students when he taught at an Illinois public school more than 35 years ago. The Republican pleaded guilty in 2015 to federal bank violations and is scheduled to be released Aug. 16.\nHastert's attorneys didn't immediately respond to a request for comment from The Associated Press on the decision. Hastert has the option of appealing in state court, and the Chicago Tribune reported that Hastert attorney Mark DeBofsky wrote a letter to the board last month saying Hastert intended to appeal any termination or reduction in benefits.\nFILE - In this April 27, 2016, file photo, former House Speaker Dennis Hastert who is is serving a 15-month prison term in a sexual abuse case departs the federal courthouse in Chicago. State officials are poised to consider the status of the pension Hastert receives for the time he served in the Illinois General Assembly Wednesday April 27, 2017 in Springfield, Ill. The Illinois General Assembly Retirement System's board of trustees are scheduled to consider Hastert's $28,000 annual pension. (AP Photo/Charles Rex Arbogast, File)\nIllinois law allows for the state to revoke the pensions of those convicted of felonies connected to their time serving in the state Legislature.\n\"Neither the indictment nor the disposition of the criminal case implicated any wrongdoing by Mr. Hastert during the time he served in the General Assembly,\" DeBofsky wrote.\nBoard member state Rep. Michael Zalewski, a suburban Chicago Democrat, argued that Hastert's crimes were designed to protect his political career.\n\"I would argue his political career is part and parcel with his career as a General Assembly member because his General Assembly career led to his congressional career,\" Zalewski said.\nBut state Rep. David Harris, a Republican from suburban Chicago, said the board should have followed a recommendation from the Illinois attorney general's office to reduce Hastert's pension.\nThe Illinois Teachers' Retirement System previously revoked the pension money Hastert earned for his time as a teacher in Yorkville. He still is eligible for pension funds from his time in Congress.","url":"https://www.dailymail.co.uk/wires/ap/article-4447430/Illinois-board-consider-Hasterts-state-lawmaker-pension.html"}
