{"authors":["John Hayward"],"date_download":"2018-10-30 19:35:00","date_modify":"2018-10-30 19:35:00","date_publish":"2017-04-14 01:12:34","description":"President Trump said he offered Chinese President Xi Jinping a \"far better\" trade deal if China \"solves the North Korean problem.\"","filename":"data/vaneerConsumption/IllMakeNotasGoodaTradeDealifChinaHelpswithNorthKorea.json","image_url":"https://media.breitbart.com/media/2017/04/trump-xi-jinping-handshake-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_04_13__1540928100.html","title":"I'll Make 'Not as Good a Trade Deal' if China Helps with North Korea","title_page":"Trump: I'll Make 'Not as Good a Trade Deal' if China Helps with North Korea","title_rss":"NULL","source_domain":"breitbart.com","text":"In an interview with the Wall Street Journal published on Wednesday, President Trump elaborated on a Twitter comment that he offered Chinese President Xi Jinping a “far better” trade deal if China “solves the North Korean problem.”\n“You want to make a great deal? Solve the problem in North Korea,” Trump recalled saying to Xi during their meeting last week. “That’s worth having deficits. And that’s worth having not as good a trade deal as I would normally be able to make.”\n“You cannot allow a country like that to have nuclear power, nuclear weapons,” Trump said of North Korea to the Wall Street Journal. “That’s mass destruction. And he doesn’t have the delivery systems yet, but you know he will.”\nTrump stressed that he told Xi he would not allow the United States to continue running “hundreds of billions of dollars a year” in trade deficits with China, even if he sweetened the deal to secure Beijing’s cooperation on the North Korean crisis. He spoke of having a “very open dialogue on North Korea” with his Chinese counterpart.\nThe New York Times is glum about the odds of getting China to solve the North Korean problem with any combination of carrots and sticks:\nOnly China, with its vast economic leverage over its reclusive neighbor, can realistically force a change in the behavior of North Korea’s dictator, Kim Jong-un. Yet despite its own rising frustration with Mr. Kim, the Chinese government has so far been unwilling to tighten the vise on him. President Xi Jinping of China did not offer Mr. Trump any public commitments on North Korea or trade when they held their first meeting last week at Mar-a-Lago, Mr. Trump’s club in Palm Beach, Fla. Even in private conversations, officials said, the Chinese leader was noncommittal.\nThe NYT quotes one of President Obama’s China advisers, Evan S. Medeiros, saying that Trump was “clearly groping for leverage over China” but linking the two issues won’t work. Even if it does, Medeiros warned that “linkage can also be counterproductive by reinforcing China’s worst instincts.”\nTrump brought up China and North Korea during his press conference on Thursday after the dropping of a massive “Mother of All Bombs” on Islamic State positions in Afghanistan.\nAsked if the Afghanistan bomb drop would send a message to North Korea, Trump replied, “I don’t know if this sends a message. It doesn’t make any difference if it does or not. North Korea is a problem. The problem will be taken care of.”\n“I will say, I think China has really been working very hard. I have really gotten to like and respect, as you know, President Xi. He’s a terrific person. We spent a lot of time together in Florida. And he’s a very special man. So we’ll see how it goes. I think he’s going to try very hard,” Trump added.","url":"https://www.breitbart.com/national-security/2017/04/13/trump-ill-make-not-as-good-a-trade-deal-as-i-would-normally-make-if-china-helps-with-north-korea/"}
