{"authors":["Amanda Chatel"],"date_download":"2018-10-30 23:41:29","date_modify":"2018-10-30 23:41:29","date_publish":"2014-08-13 14:31:32","description":"I was the last of my friends to lose my virginity. By the time I finally got around to doing the deed in college, they had long evolved past the missionary position and onto more exotic stuff like Doggie Style and Girl on Top. So adventurous! It…","filename":"data/vaneerConsumption/ILostMyVirginityMyFreshmanYearofCollegeandManWasItAwkward.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/6/29/76c365a5-55f3-4a63-baac-533f33a3e84d-getty-97444507.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35291-i-lost-my-virginity-my-freshman-year-of-college-and-man-was-it-awkward_1540942889.html","title":"I Lost My Virginity My Freshman Year of College, and Man, Was It Awkward","title_page":"I Lost My Virginity My Freshman Year of College, and Man, Was It Awkward","title_rss":"NULL","source_domain":"bustle.com","text":"I was the last of my friends to lose my virginity. By the time I finally got around to doing the deed in college, they had long evolved past the missionary position and onto more exotic stuff like Doggie Style and Girl on Top. So adventurous! It sounded like such an exciting place to be, a teenager with a sex life, but alas, my high school boyfriend (let’s call him Jake), always passed when the opportunity came up. He just wasn't ready.\nSo I continued to anxiously await the moment that I’d finally understand what all the fun was about and, ideally, experience the elusive orgasm. Because everything we’d been doing in my living room after my parents went to bed just wasn’t cutting it.\nI knew in my heart that sex = orgasm. It always did in the movies, and according to my friends, it always did for them, too. Basically, it was a guarantee.\nAfter high school, Jake and I went to colleges at opposite ends of our state. The distance between us was a grueling two-hour drive, made even more unbearable by the fact that neither one of us had a car. But we decided to make it work, knowing that sometimes we'd be able to hitch a ride with friends to each other's campuses.\nAnd so we proceeded to remove each other’s clothing. Jake struggled with my bra, as he always did, and I pretended not to be annoyed, as I always was. True to form, he placed his hand on my left breast and began to squeeze it as if it was a stress ball, completely disregarding my nipple.\nIt was about a month into the school year when Jake started talking about sex. A lot. He told me that he was ready and that the next time we were together we were finally going to do it. My initial thought upon hearing this was, \"Thank fucking God. It's about time, kid.\" It wasn't that I was pressuring him in any way, but I just had an itch, so to speak, that needed to be scratched. And I wanted him to scratch it.\nWe planned for me to get a ride with a friend for Jake’s birthday weekend with the intention of it being THE weekend that would change my life forever. I was stoked. I was going to become a woman! Or at the very least, a person with a sex life.\nIt was late by the time we reached Jake’s school. We'd gotten caught in a really bad rainstorm, so bad, in fact, that as we slipped and slid all over the road, I feared I would die a virgin. Here I was, on my way to finally lose it, and I was going to die. Luckily, we eventually got to Jake's campus.\nJake’s room stunk of patchouli. His roommate was one of those hippies who masked his lack of showering with patchouli, and lots of it. “He dumps half a bottle on his sheets,” explained Jake. The room was dirty and cluttered. They had bunk beds.\nJake lit some ugly, round purple candles and we talked for a few minutes about the drive. I told him how I not only feared I would die a virgin, but that I feared I would die listening to Dave Matthews Band, because that’s what Jared was really into in those days. That would be an unspeakable death that I imagined would haunt me even in the afterlife. Jake agreed.\nI pulled his birthday present from my bag, a Doors album I’d promised to get him, and he immediately put it on. He took his place next to me on the bed, and we both sat there awkwardly for some time. I remember thinking that maybe we shouldn’t have talked about it so much, because now there was this thing, besides the stench of patchouli, hanging in the air.\n“My roommate is going to be home soon … so, you know...” he said at one point. I took that as my not-so-subtle hint that it was time to get his party started. Jake put a note on the door for his roommate to knock before entering, and we started kissing.\nAnd so we proceeded to remove each other’s clothing. Jake struggled with my bra, as he always did, and I pretended not to be annoyed, as I always was. True to form, he placed his hand on my left breast and began to squeeze it as if it was a stress ball, completely disregarding my nipple.\nWe skipped all the other things we usually did — the hand job,the fingering, the part where I put my mouth on his penis for 30 seconds and pretended to like it — and went straight to the sex. I was on the pill, but for extra protection, we used a condom, too.\nMy heart was pounding. This was it! This was the moment! After this, I’d be different, I was sure of it. Like, maybe I’d have more color in my cheeks! You know, a rosy, new me!\nAt the magical moment he thrust himself into me, the Doors album switched over to a static-laden radio station that was playing, I kid you not, \"One of Us,\" by Joan Osborne.\nJosé Werbston on YouTube\nI was horrified. This could not be happening on my special night!\n“Why is it doing that?” I asked. But he was too focused on his task at hand. “Jake!” I all but screamed, “Why is that song playing?! What’s going on?”\nHe paused and looked at me funny. “It does that sometimes when the guys downstairs slam the door. It makes the CD jump, so it thinks it’s over and goes to the radio.”\nOh. My. Fucking. God. I was losing my virginity to one of the worst songs to come out of the '90s. If there was a God, I thought, he was a cruel God with a sick sense of humor.\nI tried to bring my attention back to the sex. It didn’t hurt, but it was uncomfortable; an aching-pressure sort of feeling. I had struggled to learn how to use a tampon at 12 because I was convinced it wouldn’t fit, and now this? As he pushed into me, I kept imagining his penis burrowing into my insides, as the wall of my vagina tried to push him out, like they were fighting. I wondered exactly how close the tip of his penis was to my stomach, and I found myself grateful that I hadn’t just eaten.\nWhen he asked me how I was doing, I gave a smile and some moans, and really let the disappointment set in: THIS IS IT?\nI stared at the springs of the bunk overhead and thought, “What a fucking letdown this is.” I couldn’t understand, for the life of me, how it was that all my friends were so gung-ho on this sex thing when it is clearly nothing to write home about. Maybe Doggie Style would be better?\n“You’re bleeding,” Jake said. I looked down and acknowledged the blood with a shrug. Everything about that moment deserved a shrug.\nWhen Jake finally came, I had no idea. There was complete silence on his end, so when he pulled out and rolled over; I had to ask, “Is it over?” It was. We put on our clothes to head out to a party, and that was that.\nWhat an overrated sack of shit. I couldn’t decide if I wanted to do it again in the hopes that it would be better. Maybe I would become asexual like Morrissey.\nI continued to try to enjoy having sex for the duration of our relationship, but it still wasn’t doing anything for me. I told my friends I loved it, and was excited to finally be able to share sex stories with them. But deep down I was hiding a dark secret: I thought sex was a bust. A. Total. Fucking. Bust.\nIt wasn’t until a couple years later that I finally started to enjoy sex. By then, I had met Timothy, my real first love, and was also finally in touch with what I wanted and needed to be sexually satisfied.\nI had a lot of growing up to do to get to the point where sex was enjoyable for me. It took a lot of practice with a few different men (and myself), but I finally got there. I can also say that as time has gone on, it’s gotten even better.\nSo if you're currently having crappy college sex, know this: It gets better. The first time you have sex isn’t supposed to be great. It’s going to be weird, and awkward, and not so fun, because everything is that way when you first try it out.\nIf you go into it with high expectations, as I did, you're going to be severely disappointed. You're going to catch yourself counting bunk bed springs, thinking about what's for dinner, and seriously questioning whether or not you ever want to do it again.\nIt may take awhile to get there, but if you do the work to figure out what you like, it will be worth it. I promise. It gets better.\nImage: Giphy(3)","url":"https://www.bustle.com/articles/35291-i-lost-my-virginity-my-freshman-year-of-college-and-man-was-it-awkward"}
