{"authors":["Alisha Buaya For Daily Mail Australia"],"date_download":"2018-10-22 23:20:51","date_modify":"2018-10-22 23:20:51","date_publish":"2017-03-10 02:54:07","description":"Radio shock jock Steve Price has revealed he was wasn't paid enough for his time on I'm A Celebrity.","filename":"data/vaneerConsumption/ImACelebritysStevePricerevealshowmuchhewaspaid.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/22/3E1EA7B400000578-0-image-a-9_1489099366184.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4298958_I-m-Celebrity-s-Steve-Price-reveals-paid_1540250451.html","title":"I'm A Celebrity's Steve Price reveals how much he was paid","title_page":"I'm A Celebrity's Steve Price reveals how much he was paid | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He was voted out of the jungle after six weeks.\nAnd speaking to The Kyle And Jackie O, radio host Steve Price has revealed he was not paid enough for his time on I'm A Celebrity... Get Me Out Of Here.\nSpeaking to the breakfast radio show, the 62-year-old also dismissed Tom Arnold's claims he was paid $600,000.\nNowhere near it! I'm A Celebrity's Steve Price revealed he was not paid enough by for his six-weeks on the jungle reality show\nWhen Kyle questioned the 2GB radio host on how much he was paid by the network to be on the show, Steve bluntly said 'not enough.'\n'Tom Arnold reckons he got [$600,000] - I said bulls**t,' the KIIS FM host said of the the American actor, with Jackie concurring.\nBut after a short pause Steve said: 'You were right Kyle - It wasn't that. A lot less.'\n'Of course it was,' Kyle chuckled.\nIt was a lot less! The 2GB shock jock dismissed claims Tom Arnolds was paid $600,000\nYou were right Kyle! Steve told the KIIS FM host that they were paid a far less than what the American actor claimed\nBefore ending the call he told the younger shock jock: 'It's not about the money Kyle, it's about the experience, and you could do with loosing ten kilos.'\nDaily Mail Australia has contacted Network 10 for comment.\nThe trio, even Kyle himself, poked fun at the thought of the radio host being in the jungle following Steve's incredible 10kg weigh tloss.\nRight after being voted off he spoke to I'm A Celebrity hosts Dr Chris Brown and Julia Morris and showed his emotional side telling them, 'It's the hardest thing I have ever done and emotional.'\n'It's not about the money' Steve said joining the show was about getting the experience and raising money for charity\nA different man: After he was voted off Steve spoke to Dr Chris Brown and Julia and told them, 'It's the hardest thing I have ever done and emotional'\n'I think what I have done is set an example for older Australians that you can change bad habits, stop things you shouldn't be doing and life's about meeting every challenge if you're mentally tough enough you can do it,' he told them.\nThe shock jock 'I have done stuff I never thought I would do.'\nSteve also became teary-eyed talking about failing to win the $100,000 for his chosen charity Beanies 4 Brain Cancer.\n'I didn't win the $100,000. But I'd just like to urge all of the corporate supporters associated to my radio show to make sure you chip in money and we get to the 100 anyway,' he added.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4298958/I-m-Celebrity-s-Steve-Price-reveals-paid.html"}
