{"authors":["Charlotte Foster For Daily Mail Australia"],"date_download":"2018-10-23 05:38:27","date_modify":"2018-10-23 05:38:27","date_publish":"2017-03-10 15:23:01","description":"She first shot to fame when she won the second season of Australian Idol.\nNow Casey Donovan been tipped to win I'm A Celebrity... Get Me Out Of Here!","filename":"data/vaneerConsumption/ImACelebrityAustraliasCaseyDonovantippedtowin.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E23887500000578-0-image-a-166_1489158145250.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301562_Casey-Donovan-tipped-win-m-Celebrity_1540273107.html","title":"I'm A Celebrity Australia's Casey Donovan tipped to win","title_page":"I'm A Celebrity Australia's Casey Donovan tipped to win | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Casey Donovan has been tipped by her fellow camp-mates as most likely to take out the winning title on I'm A Celebrity...Get Me Out Of Here!\nAfter Lisa Curry named the Australian Idol winner as her front-runner, Steve Price has now followed suit, telling Now To Love that he would love to see her win.\n'I’d love to see Casey Donovan win. I think she’d be a wonderful queen of the jungle and we need a woman to finally win this show, and she’s the one that I think should win it,' he said.\nWill she make the top spot? Casey Donovan has been tipped by most ex-campers to take the title of 'Queen Of The Jungle' on I'm A Celebrity... Get Me Out Of Here!\n'She’s incredible, she’s really great.'\nEarlier this week, Lisa Curry told News Corp that, 'Casey has had some real up and down years.'\n'She's the most divine singer. I think I'd like Casey to win.'\nReality star fame: Casey shot to fame after winning the second season of Australian Idol\nCasey is competing to win the $100,000 prize money for her charity, the Starlight Foundation.\nSpeaking to News Corp Australia on Friday, she confessed that making the top four had been 'beyond my wildest dreams,' but admitted the six week-challenge had been 'hard' but 'fun.'\nShe said: 'I don't expect much from the world and to be here, there's a little bit of confidence and a little bit of hope and smiles. It has been an experience.'\nA good cause: Casey is competing to win the $100,000 prize money for her charity, the Starlight Foundation\nThe singer is one of four campers left in the South African jungle, along with Dane Swan, Nazeem Hussain and Natalie Bassingthwaighte.\nIf she's not crowned the 'Queen Of The Jungle' next Monday, she has already topped the leader-board in weight loss on the show, having already lost 17kg during her time on the show.\nWith her chipper attitude, quirky sing-a-longs and impressive weight loss so far, she's also a favourite among fans of the show.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301562/Casey-Donovan-tipped-win-m-Celebrity.html"}
