{"authors":["Nicola Agius"],"date_download":"2018-10-31 01:38:47","date_modify":"2018-10-31 01:38:47","date_publish":"2018-08-29 09:42:56","description":"OK guys, it's official. On Wednesday morning, I'm A Celebrity bosses confirmed Holly Willoughby will replace Ant McPartlin when the series returns to ITV later this year. She will present the jungle-based reality show alongside regular host Declan…","filename":"data/vaneerConsumption/ImACelebrityConfirmsHollyWilloughbyWillReplaceAntMcPartlinToHostAlongsideDeclanDonnelly.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/29/c0e91365-5d10-45c1-b63a-82d014ad906f-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_im-a-celebrity-confirms-holly-willoughby-will-replace-ant-mcpartlin-to-host-alongside-declan-donnelly-10928471_1540949927.html","title":"'I'm A Celebrity' Confirms Holly Willoughby Will Replace Ant McPartlin To Host Alongside Declan Donnelly","title_page":"'I'm A Celebrity' Confirms Holly Willoughby Will Replace Ant McPartlin To Host Alongside Declan Donnelly","title_rss":"NULL","source_domain":"bustle.com","text":"OK guys, it's official. On Wednesday morning, I'm A Celebrity bosses confirmed Holly Willoughby will replace Ant McPartlin when the series returns to ITV later this year. She will present the jungle-based reality show alongside regular host Declan Donnelly live from Australia.\nCommenting on the news, Willoughby admitted she was over the moon to have been given the opportunity. She said: \"I couldn’t be more excited to have been asked to stand alongside Dec for the next jungle adventure.\n\"Honestly, I’m a huge fan of I’m a Celebrity and actually feel like I’ve won a competition to go and hang out on my favourite show. When is it a good time to tell Dec I’m scared of everything that moves?\"\nWilloughby has been asked to step in for McPartlin as he has decided to take a break from work until at least the start of next year. The star explained in a statement that he is taking a step back from work commitments as he is focusing on his continued recovery from prescription drug and alcohol problems.\n\"My recovery is going very well and for that to continue, having spoken to Dec and ITV, I have made the decision to take the rest of the year off,\" he said in a statement. \"I’d like to thank both Dec and ITV for their continued support and I look forward to getting back to work in the new year.\"\nITV/Shutterstock\nFollowing her decision to take on the job of replacing McPartlin on I'm A Celebrity, Willoughby admitted she has a big act to follow. However, she stressed that she has no intention of wanting to fill in for her pal permanently because she can't wait to see him back on the telly when he's feeling better. She added: \"I love Ant and want to send him my best wishes and support for a continued recovery. These are big shoes, not to fill, but just to keep warm for a little bit.\"\nMeanwhile, despite being gutted about his best friend not being able to join him in Australia this year, Donnelly has given McPartlin's replacement his seal of approval. Commenting on the news, he said: \"I am hugely grateful to Holly for agreeing to accompany me to Australia this year. She was at the top of my list and I’m thrilled she said yes. It will be a different kind of series but we will try our best to ensure it is no less fun and eventful for our loyal viewers. I am also pleased to hear Holly is scared of everything. I am almost stupidly excited at the thought of watching her during the eating trials.\"\nUnfortunately though, Twitter hasn't been quite as supportive as the lovely Donnelly. Following ITV's announcement that Willoughby had been given the job, people were quick to react the news, and to be honest, the comments were brutal AF. Check out what was said on Twitter:\nSeriously, people? Ouch!\nHowever, while the overwhelming majority of comments online seemed to disapprove of ITV's choice (despite the fact that Willoughby is surely one of the channel's safest pairs of hands), some were slightly more positive. And when I say slightly, I really do mean slightly. Here are some of the nicer reactions:\nPersonally, I think the nation should give Willoughby a chance. She's good friends with Donnelly, she has a brilliant sense of humour, and let's face it, it's going to be hilarious watching her reactions during those dreaded bushtucker trials.\nWilloughby, I've got your back. Ignore the haters and do us proud, girl.\nI’m A Celebrity…Get Me Out Of Here! returns to ITV this Autumn.","url":"https://www.bustle.com/p/im-a-celebrity-confirms-holly-willoughby-will-replace-ant-mcpartlin-to-host-alongside-declan-donnelly-10928471"}
