{"authors":["Kristy Johnson For Daily Mail Australia"],"date_download":"2018-10-23 01:39:21","date_modify":"2018-10-23 01:39:21","date_publish":"2017-03-10 10:05:29","description":"Journalist Steve Price, 62, admitted on Friday's The Project, that he is somewhat of a changed man, after appearing on I'm A Celebrity...Get Me Out Of Here!","filename":"data/vaneerConsumption/ImACelebritysStevePricerevealshesachangedman.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E22167B00000578-0-image-a-38_1489140285605.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300382_I-m-Celebrity-s-Steve-Price-reveals-s-changed-man_1540258761.html","title":"I'm A Celebrity's Steve Price reveals he's a changed man","title_page":"I'm A Celebrity's Steve Price reveals he's a changed man | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's the often uncompromising journalist and radio broadcaster, eliminated from I'm A Celebrity...Get Me Out Of Here! on Thursday night.\nBut an interview on Friday's The Project, saw Steve Price reveal that he's somewhat of a changed man: 'Don't worry, I haven't gone completely soft. But look, I think a softer side came out.'\nThe 62-year-old also added that by the end of his run in the reality competition, he formed a close bond with fellow contestant Nazeem Hussain, describing the 30-year-old as the son he never had.\nScroll down for video\n'I haven't gone completely soft': I'm A Celebrity's Steve Price, 62, revealed on Friday's The Project, that he's somewhat of a changed man, before adding that co-star Nazeem Hussain, 30, is like the son he never had\n'Don't worry, I haven't gone completely soft. But look, I think a softer side came out,' Steve admitted to co-host Waleed Aly.\n'Even you, Waleed, would accept that I'm a nicer person now that I've come out of there after 43 days, than what I was when I went in.\n'I had to put up with people I wouldn't normally cross the street to speak to and talk nonsense, nonsense for six weeks.\n'So, you know, it has softened me. Here I am. The new lighter, gentler, happier Steve Price,' he joked.\nBanter: 'So, you know, it has softened me. Here I am. The new lighter, gentler, happier Steve Price,' joked with Project co-host Waleed Aly (left), 38\nThe Melbourne-born personality also revealed that he formed a close bond with fellow contestant Nazeem Hussain, 30.\n'He's a naughty little boy, Nazeem. I had no idea who he was before he came in,' Steve admitted.\n'He then told me he's best mates with Waleed [Aly], so I was suspicious,' he joked.\n'Once I got over that, he is like the son I never had. He's a naughty little boy.\nUnlikely pals: The Melbourne-born personality also revealed that he formed a close bond with fellow contestant Nazeem Hussain, 30. 'He is like the son I never had. He's a naughty little boy,' Steve joked\nPraise: 'He is a genuinely really nice guy, very smart,' Steve continued\n'But he is a genuinely really nice guy, very smart,' Steve continued.\nNot only has Steve's personality changed, but also his waistline.\nWhile on KIIS FM's Kyle and Jackie O Show on Friday, he revealed to losing more than 10 per cent of his body weight.\nHost Kyle Sandilands was first to mention the media personality's changing appearance saying: 'You've lost weight, you look good!' while Jackie asked him to confirm the exact figure.\n'10kg! Can you believe that?' Steve revealed he lost more than 10 per cent of his body weight on I'm A Celebrity...Get Me Out Of Here! when interviewed by KIIS FM's Kyle And Jackie O on Friday\nSteve happily obliged: '10kg! can you believe that?'\n'On a sixty two-year-old short fat little body. It's amazing!' he spoke of his frame.\nLike his celebrity co-stars, Steve lost weight thanks to the show's food rations and sometimes strenuous tasks.\nSteve said they often were 'cooking beans and rice, you wouldn't seriously feed your dog.'\nAt his request, the star was reunited with a cold beer and a hearty steak for his first meal after exiting the jungle.\nThe I'm A Celebrity...Get Me Out Of Here! finale will air on Monday March 13 on Channel Ten at 7.30pm","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300382/I-m-Celebrity-s-Steve-Price-reveals-s-changed-man.html"}
