{"authors":["Alisha Buaya","Marta Jary For Daily Mail Australia"],"date_download":"2018-10-22 23:21:05","date_modify":"2018-10-22 23:21:05","date_publish":"2017-03-10 02:57:47","description":"Lisa Curry has taken some time out with her fiancé, Elvis impersonator Mark Tabone after 41 days in the South African jungle for I'm A Celebrity.","filename":"data/vaneerConsumption/ImACelebritysLisaCurrywithfiancMarkTabone.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1EBA3C00000578-0-image-a-26_1489102758745.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299266_I-m-Celebrity-s-Lisa-Curry-fianc-Mark-Tabone_1540250465.html","title":"I'm A Celebrity's Lisa Curry with fiancé Mark Tabone","title_page":"I'm A Celebrity's Lisa Curry with fiancé Mark Tabone | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's spent her first night of freedom with the man she has been dreaming of marrying for the past six weeks.\nAnd after her eviction on Thursday, Lisa Curry has taken some well deserved time out with her fiancé, Elvis impersonator Mark Tabone, after 41 days in the South African jungle for I'm A Celebrity.\nMark, who proposed to her last October, has been managing her Instagram for the past six weeks and posted a selfie of the two of them relaxing at the Manor House before heading back to Australia.\nScroll down for video\nA bit overwhelming! Lisa Curry and her fiancé Mark Tabone have shared their first selfie together since she was evicted out of I'm A Celebrity on\nThe 54-year-old former Olympian appeared content, and considerably fresher, in with her arms draped over her fiancé, with the sunset beaming at them.\nMark captioned the post: 'Hi everyone. Coming back to real life after 41 days in the jungle is a bit overwhelming for Lisa, she's very tired but will be with you all again soon.'\n'Just having some down time here at Manor House, absolutely beautiful at sunset. #imacelebrityau #celeblisa #markandrew,' the 50-year-old musician added.\n'Just having some down time': She is taking some time out to rest and recuperate with Mark after 41 days in the South African jungle\nFinally over: The Olympian was told that her ex-husband Grant Kenny had finally signed divorce papers while she was in the jungle (pictured with son Jami)\nFans of the swimming champion commented on the post and congratulated her for her effort on the show.\nOne said: 'Rest up Lisa. You have been through a lot'\nAnother wrote: 'Huge FAVE what an inspiration you were always staying true to yourself.'\nMeanwhile, fellow I'm A Celebrity evictee, Tegan Martin commented on the post: 'It takes a few days my loves. Hey Marc can't wait to meet you! I'm so happy my favourite is back in your arms ❤️❤️', the former Miss Universe added.\nReady to wed: She told the publication, 'Mark and I can actually go and start looking at a date because we weren't looking at anything until it (divorce) happened'\nThe couple's reunion comes after she was told her ex-husband former Ironman Grant Kenny finally signed their divorce papers while she was in the jungle, by Mark according to a report by news.com.au.\n'Grant has just been busy, it's been nearly nine years, I've been trying to get it done for a while,' Lisa said.\n'Mark and I can actually go and start looking at a date because we weren't looking at anything until it (divorce) happened,' she added.\nReunited:The 54-year-old is now free to marry Mark, 50, to whom she announced her engagement in October last year\nLisa and fellow athlete Grant split back in 2009, and are still friendly with one another, after 23 years of marriage and have three children together, Jaimi, Morgan and Jett.\nThe swimming star and Elvis-look-a-like began dating in December 2015 shortly after Lisa split with her much younger boyfriend of five years, Joel Walkenhorst, 35.\nMeanwhile, Grant had a brief fling with radio and television personality Fifi Box, 40, resulting in a child, three-year-old daughter Trixie.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299266/I-m-Celebrity-s-Lisa-Curry-fianc-Mark-Tabone.html"}
