{"authors":["Abc News","More Caterina"],"date_download":"2018-10-30 00:50:35","date_modify":"2018-10-30 00:50:35","date_publish":"2018-08-31 14:00:06","description":"I made everything from jalapeño mummy poppers to Frankenstein guacamole!","filename":"data/vaneerConsumption/Imadethetop10PinterestHalloweenrecipesof2018andtheywerespooktacular.json","image_url":"https://s.abcnews.com/images/GMA/HalloweenFood_GMA_v02_KS_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/GMA_Food_made-top-10-pinterest-halloween-recipes-2018_story_id=57532616_1540860635.html","title":"I made the top 10 Pinterest Halloween recipes of 2018 and they were spooktacular","title_page":"I made the top 10 Pinterest Halloween recipes of 2018 and they were spooktacular - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"October is here and that means Halloween is around the corner - and what's Halloween without some spooky recipes!? We asked Pinterest for the Top 10 Halloween Recipes of 2018 and I decided to make all ten of them to see how easy (or hard) they really were to pull off! With everything from appetizers to desserts on the top 10 list, the recipes were as boo-tiful as they were fangtastic to eat. So for all my fellow Pinterest witches out there - these recipes are the pick of the patch!\nJalapeño Popper Mummies\nInterested in Halloween? Add Halloween as an interest to stay up to date on the latest Halloween news, video, and analysis from ABC News. Add Interest\nRecipe IRL:\nABC News/Caterina Andreano\nIf you want an easy-to-make spicy bite for your Halloween party, definitely try this recipe out. I've never made jalapeños before so I was nervous when de-pithing them and I definitely used gloves, but the recipe came together easily. Once you de-pith the peppers and mix together the cheeses and scallions, all that's left to do is wrap your mummies which is the hardest part of it. Make sure to lay you your crescent roll dough in triangles and not do what I did which was accidentally pull the dough apart in pieces! Once you cut the dough in long strips you have to wrap the mummies which actually is pretty fun! The appetizer cooks super fast in the oven and was really tasty - even for an anti-spice person.\nIngredients\n10 jalapeño peppers, sliced in half lengthwise and pith/seeds removed (use rubber gloves so your hands don't burn). Leave the stem if you can on some or all of the halves.\n8 ounces cream cheese, room temperature\n8 ounces jack cheese, shredded\n1 scallion, chopped\n½ teaspoon salt\n1 package refrigerated crescent rolls\n2 eggs, beaten\ncandy eyeballs\nInstructions\nPreheat oven 400° F. In a small bowl, mix the cream cheese, jack cheese, scallion and salt until well blended.\nRoll out the crescent rolls and separate into 4 rectangles with a perforation in the middle of each. Press your fingers into the perforations to seal them. Using a pizza cutter, cut each rectangle into 10 long pieces lengthwise.\nFill each jalepeño half with the cheese mixture. Wrap each jalapeño half with the dough, leaving a space for the eyes. Use two pieces of dough if necessary. Brush with egg mixture and place on baking sheet.\nBake in oven for 8-10 minutes. Remove from the oven and press the eyes into the cheese where the opening is. Remove eyes before eating. You may also use a little cream cheese and a piece of black olive for the eyes. Serve immediately.\nRecipe reprinted courtesy of The Hopeless Housewife.\nPumpkin chicken and rice stuffed peppers\nABC News/Caterina Andreano\nThis actually ended up being my favorite recipe of the bunch. I'd never used a crockpot before (I know, I know) and while I had anxiety leaving it plugged in overnight, I woke up to the mouthwatering smell of chicken. I couldn't find Mexican rice in the supermarket to mix into the chicken and beans mixture so I used brown rice instead. Carving the peppers was actually easier than expected and even though my jack-o-lantern didn't come out perfect they were delicious all the same (I mean it, I ate it for dinner two nights in a row!) I also loved that this recipe was one of the few of the top 10 that I could actually eat as a meal for dinner. In hindsight I should have taken the photo before I cooked the peppers in the oven (oops!) but I'm telling you this recipe is a keeper.2 chicken breasts1 teaspoon cumin1 tsp garlic salt1 tsp chili powder1/2 tsp black pepper1 can diced tomatoes with green chilies4 orange bell peppers2 cups Mexican rice1 shredded chicken breast from the above recipe1 cup shredded cheddar cheese1 can black beans rinsed and drainedAdd chicken to the bottom of the slow cooker, sprinkle seasonings on top and then cover with diced tomatoes. Cook on low for 6-8 hours or high for 4-6 hours. Shred chicken and allow it to remain in sauce.Bring a large pot of water to boil. While you are waiting for the water to boil, rinse peppers, slice off the tops and hollow out the insides, be sure to remove any seeds and the white part inside. If desired, use a small paring knife to cut out a jack-o-lantern face.When water is boiling, put the peppers and tops in and allow to cook for about 5 minutes until peppers are tender. Remove from water and set aside to cool. Mix the cooked rice, shredded chicken, cheddar cheese, and black beans together in a large bowl.Fill each pepper with the chicken and rice mixture and top with extra cheese, if desired. Replace pepper top back on top.Bake at 350° for 30 minutes until cheese is melted and pepper is done to desired tenderness.Recipe reprinted courtesy of Everyday Jenny\nHalloween Pretzels\nABC News/Caterina Andreano\nI loved making these and the best part is that they don't go stale for days so you can make these well in advance of any Halloween get together. Instead of buying a chocolate melter or using the double boiler method, I used my crockpot to melt the chocolate. I put the different colored melting disks in different mason jars, put the mason jars in the crokpot and turned it on high, put the top back on and waited about 20 minutes for the chocolate to melt. For the owl recipe I didn't have sunflower seeds so I used yellow m&ms instead. Also instead of putting the ghost pretzels in the refrigerator to freeze before using the piping back to fill it in, I just used a fork to coat the entire pretzel the first time around and then refrigerated it. I will warn you that not all melting chocolate disks are the same. I bought a different brand for the chocolate owl cookies that melted much more easily and thus my owl pretzels looked a lot smoother than my pumpkin pretzels. But they all tasted great regardless!Pretzel twistsOrange chocolate melting disksWhite chocolate melting discsChocolate (milk or dark) melting disksMini chocolate chipsMini m&msCandy eyesSunflower seedsPumpkins: Use a fork to dip the pretzels into a small bowl of melted chocolate. Place the coated pretzel on a wax paper lined tray and place a green m&m stem on the unset chocolate. Put the tray into the refrigerator to set the chocolate for 5 minutes.Mummies: On a wax paper lined tray, use a disposable piping bag filled with ½ cup of melted chocolate to pipe lines across the pretzel for the mummy wrapping. Add the candy eyes onto the unset chocolate. Put the tray into the refrigerator to set the chocolate for 5 minutes.Owls: Use a fork to dip the pretzels into a small bowl of melted chocolate and place the coated pretzel on a wax paper lined tray. Put the tray into the refrigerator to set the chocolate for 5 minutes. With the coated pretzels on a wax paper lined tray, use a disposable piping bag filled with ½ cup of melted chocolate to fill in the eye holes and to pipe dots for the ears and nose. Add the chocolate chip ears, candy eyes, and sunflower seed beak. Return the tray to the refrigerator until the chocolate is set.Ghosts: Use a fork to dip the pretzels into a small bowl of melted white chocolate. Tap excess chocolate back into the bowl and place the coated pretzel on a wax paper lined tray. Put the tray into the refrigerator to set the chocolate for about 5 minutes. Continue until the desired number of pretzels have been dipped. With the coated pretzels on a wax paper lined tray, use a disposable piping bag filled with ½ cup of melted chocolate to fill in the holes. Use the piping chocolate to cover the top of the pretzel. Add the sequin sprinkles on top of the unset chocolate for the eyes and mouth. Return the tray to the refrigerator until the chocolate is set.Recipe reprinted courtesy of The Monday Box\nRotten Deviled Eggs\nABC News/Caterina Andreano\nI thought this recipe was one of the cutest and most creative of the bunch. This is a fun one to do with kids since no cooking is actually involved! I loved that you didn't have to worry about the eggs cracking when dying them because that's always the hardest part of any egg-dying process. My advice on this one is not to over crack the eggs because a lot of the dye bled into the crack and stained the egg whites too much instead of making it look like spider webs. Also a note to anyone trying this recipe - it's best to use a piping bag with an open star piping nozzle to pipe the deviled egg yolk mixture into the egg whites in a neat way. I just used a regular nozzle and it didn't come out nearly as nice. I also used regular green food dye instead of green gel which is why the color didn't come out quite the same. The eggs tasted pretty standard for deviled eggs, but I must admit I only had one bite because I'm not usually an egg fan!6 eggs hard boiled & sliced in halfBlack or blue food dyeVinegarWaterZiplock Bag2 tablespoons mayonnaise1 scant tablespoon mustard1 teaspoon Worcestershire sauceSplash of hot sauceGreen gel food dyeSalt & pepper to tastePaprika and chia seeds to garnish\nInstructions\nBoil your eggs in a pot of water. Once eggs are completely cooked remove from heat and run under cold water.\nGently crack the hard boiled eggs with a knife or by rolling them on the counter. Place them in an zip lock bag. Add food dye of choice to zip lock bag. Roll eggs around to make sure they are fully coated and place in your refrigerator overnight.\nThe next day rinse eggs in vinegar, peel and place your cooked egg yolks in a small bowl and mash them up with a fork. Stir in the mayo, mustard, worcestershire sauce, hot sauce, food dye, salt, & pepper.\nScoop the filling into the egg whites. Sprinkle with paprika and/or chia seeds.\nRecipe reprinted courtesy of Parenting Chaos.\nGhost Peep Brownies\nABC News/Caterina Andreano\nThese brownies turned out so decadent and delicious. I thought they were so adorable and overall were pretty simple to make - it was just the waiting between steps that prolonged the whole process. I did wait the two hours to let the brownies cool before topping them with marshmallows and melted frosting but instead of waiting further to use black gel to make the face, I used black sprinkles that I bought from Michael's to set into the frosting about 10 minutes after I let the melted frosting set instead. I don't have the steadiest hand when using colored gel (please see Happy Ghost Sugar Cookies below) so I decided this was the perfect alternative to solve for my impatience and clumsiness.1 box (1 lb 6.25 oz) Betty Crocker™ Supreme original brownie mixWater, vegetable oil and eggs called for on brownie mix1 1/4 cups Betty Crocker™ Rich & Creamy creamy white frosting (from 16-oz container)16 large marshmallowsBetty Crocker™ black decorating gel (from 0.68-oz tube)Heat oven to 350°F (325°F for dark or nonstick pan). Line 8- or 9-inch square pan with foil so foil extends about 2 inches over sides of pan. Spray foil with cooking spray. Make brownies as directed on box for 8- or 9-inch square pan. Cool completely, about 1 1/2 hours. Remove from pan by lifting foil; peel foil away. For brownies, cut into 4 rows by 4 rows.Heat frosting in microwavable bowl uncovered on High 30 seconds, stirring every 10 seconds, until frosting can be stirred smooth and fluid. If frosting becomes too firm while decorating, microwave 5 seconds; stir.Top each brownie with 1 large marshmallow. Spoon 1 tablespoon frosting over each marshmallow to coat. Let stand until frosting is set, about 30 minutes. Use black gel to make eyes and mouths.Recipe reprinted courtesy of BettyCrocker.com\nGraveyard Taco Dip\nCaterina Andreano/ABC News\nThis recipe was actually super simple and tasty! I mean who doesn't like taco party dip? Laying down the layers of deliciousness was easy and all that was left was to make the tombstones. I used a food marker to trace out the shapes on the tortillas first and then cut them out. Instead of doing this with a knife, I actually just washed a scissor and used that instead because it was much easier to maneuver. I brought the dip into the GMA studio the next morning and it was a hit! Definitely will go quick at any Halloween party.1 can refried beans or refried black beans2 cups sour cream1 pkg taco seasoning2 avocados, mashed1 clove garlic, minced2 Tbsp mayonnaise1 cup salsa1 bunch scallions (green onions), choppedTortillasIn a small bowl, mix the sour cream and taco seasoning. In another small bowl, mix the mashed avocados, minced garlic, and mayonnaise.In a small Pyrex dish or pie plate, layer the beans, sour cream mixture, avocado mixture, and salsa. Sprinkle the scallions on top.Chill at least an hour, or until ready to serve. (The dip can be made a day ahead and kept, covered, in the refrigerator.)To make the tombstones and tree, cut the shapes you want out of 2 large tortillas. Place the cut-out shapes on a parchment paper lined cookie tray and bake at 350 degrees until the tortillas are nice and brown. You can add text to the tombstones with a black food safe marker. Put the tombstones and tree in the dip just before serving.Recipe reprinted courtesy of The Chickabug Blog\nFrankenguac\nABC News/Caterina Andreano\nI actually made this recipe first when I set out to do this project and it was one of the most fun to make. This is another one that involved no cooking (hooray!) so is definitely a good one to make with kids or to use as an impressive appetizer at any Halloween bash. It's as simple as making guacamole and jazzing it up with some decorations. A word of advice on this one - use a piping bag to make the mouth and stitches out of the refried beans. I ended up just rolling refried beans with my hands into lines and it was much more time consuming and messier than using a piping bag would have been. I also prefer my guacamole a bit spicier and more flavorful than this recipe called for so if you make it I'd recommend adding a bit of salsa into the guacamole and mixing it up.3 medium ripe avocados, peeled and cubed1/4 cup finely chopped onion3 tablespoons minced fresh cilantro2 tablespoons lime juice1/8 teaspoon saltTortilla chipsSour cream, refried black beans and ripe olives, optionalIn a small bowl, mash avocado with a fork. Stir in the onion, cilantro, lime juice and salt.Spoon guacamole onto a platter; shape into a rectangle. Place chips near the top of the head. Decorate face as desired with sour cream, refried black beans and olives.Recipe reprinted courtesy of Taste of Home\nHalloween Witch Broom Pretzels\nABC News/Caterina Andreano\nThese were a dream to make - super easy and so cute! I can 100% see these as favors at Halloween parties or even plated next to a bunch of dips so that you have your own bag of pretzels to enjoy. I used pencils but if you're throwing a Halloween shindig I'd use the straws instead so that they can serve a purpose at the party.Pretzel SticksPlastic Sandwich BagsHalloween Pencils or StrawsScissorsTransparent TapeRibbonPlace a handful of pretzels into a plastic bag making sure each stick is facing up and down inside the bag.Using scissors cut the end of the bag off. Twist and then tape the top of the bag around the end of a pencil or straw.Finish by tying a decorative ribbon around the top of bag.Recipe reprinted courtesy of Hip2Save\nHappy Ghost Sugar Cookies\nABC News/Caterina Andreano\nI actually had a hard time with these ones. Whenever I tried to cut out the cookie dough using the cookie cuter and put it on a cookie sheet the dough kept crumbling apart. I had to add an entire half cup more flour than the directions called for before I was able to successfully cut out the cookies. They still tasted great though. I tried frosting them at first using a piping bag but then ended up using an icing spatula because it was easier. I also used black frosting to make the ghost faces instead of a food marker because I didn't want to wait the whole 24 hours to let the frosting dry!Betty Crocker Sugar Cookie MixMini tulip cookie cutterTub of royal icingBlack food markerMix sugar cookie mix according to directions on the box. Then roll your dough with a rolling pin until it’s about 1/4 inches thick. Use the cookie cuter to make shapes in the dough and cook them according to directions.Once done, frost them and give them about 24 hours to dry before using your food marker to draw faces on them.Allow the food marker to dry for about an hour.Recipe reprinted courtesy of Sarah's Bake Studio\nMummy Dogs\nABC News/Caterina Andreano\nThis one was by far the easiest of the bunch. All you have to do is cut the crescent roll into strips and wrap the mummy dogs and pop them in the oven. I'm not a huge fan of how my mustard eyes came out and think that if you really want to jazz this one up you can easily stick candy eyes on the mummy dogs instead. But everyone loves pigs in a blanket and these were delicious and a cute Halloween snack.1 pack Dietz & Watson Deli Beef FranksDietz & Watson Yellow Mustard1 pack crescent rollsPreheat oven to 375 degrees. Roll out crescent rolls onto one baking sheet. Using a pizza cutter, cut the dough into small strips.Wrap pieces of dough around each hot dog, leaving a small gap for the mummy’s eyes.Bake in the over for 20 minutes, or until crescent rolls turn golden brown. Allow hot dogs to cool. Using Dietz and Watson Yellow Mustard, add the eyes.Recipe reprinted courtesy of Dietz and Watson Have a very be-witching Halloween!","url":"https://abcnews.go.com/GMA/Food/made-top-10-pinterest-halloween-recipes-2018/story?id=57532616"}
