{"authors":["Alex Matthews For Mailonline"],"date_download":"2018-10-23 05:12:32","date_modify":"2018-10-23 05:12:32","date_publish":"2016-01-11 18:18:55","description":"They have suffered pain and destruction but refugees fleeing Syria, Afghanistan and Iraq show that the human spirit cannot be broken. Pictures show brave youngsters smiling through their strife.","filename":"data/vaneerConsumption/Imagesrevealhowmanymigrantsarestillabletofindjoydespitetheirplight.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300785CE00000578-0-image-a-24_1452535456039.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394296_Smiling-misery-going-Hell-reach-Europe-heartwarming-images-reveal-migrants-able-joy-despite-plight_1540271552.html","title":"Images reveal how many migrants are still able to find joy despite their plight","title_page":"Images reveal how many migrants are still able to find joy despite their plight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They have to live with the pain and suffering of leaving their war-torn countries behind but heart-warming pictures reveal that young refugees are still able to smile through the misery of their plight.\nHundreds of thousands of people are fleeing the Islamic state and opting for a safer life for their families and loved ones in Europe.\nMany will go through hell to reach the promised land, sleeping rough on streets sneaking onto public transport and doing their best to feed their families.\nTouching: A little girl smiles brightly in a Syrian long-term refugee camp in the Akkar District of Lebanon\nHowever, even with an uncertain future ahead of them the little ones, whose families often head to the Mediterranean to find their passage towards countries such as France or Britain, conjure a moment of light among the darkness.\nA touching photo shows a little girl smiling at a photographer among the hustle and bustle of a long-term refugee camp in the Akkar District of Lebanon, near the Syrian border.\nJust over 260,000 refugees are living at the camp as they try to piece back together lives devastated by conflict.\nHelping hand: A young girl smiles, as a volunteer helps her off a boat, after making the journey to Lesbos\nThe Greek island of Lesbos has also become a destination for swathes of migrants and refugees fleeing war-torn Iraq, Afghanistan and Syria.\nLast year 500,000 people fled into Europe and in October alone 200,000 came ashore at Lesbos.\nAround four-fifths of families, many of whom have young children with them, pay to be smuggled across to Greece from Turkey.\nSmiles: Despite enduring a no-doubt stressful journey, a young girl named Palia finds time for a moment of fun\nPalia, pictured playing with bubbles on Lesbos beach, was packed into a small rubber dingy as she made her way over the six-mile stretch of Aegean sea.\nThe journey is seen by many refugees as the main transit route into the EU.\nHowever, it is a dangerous one and hundreds have gone missing or died after striving for a safer life in Europe.\nA refugee boy hides under a blanket with his mother as he waits to be registered at Moria Camp in Lesbos","url":"https://www.dailymail.co.uk/news/article-3394296/Smiling-misery-going-Hell-reach-Europe-heartwarming-images-reveal-migrants-able-joy-despite-plight.html"}
