{"authors":[],"date_download":"2018-10-22 21:15:10","date_modify":"2018-10-22 21:15:10","date_publish":"2014-06-04 14:18:21","description":"Original sketches and poems by the late Beatle, John Lennon, sold for $2.9 million at Sotheby's auction house in New York.","filename":"data/vaneerConsumption/ImagineJohnLennonSketchesandWritingsFetch29MatAuction.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/487676/140604-140604-lennon-1432_6b2f38e63c22d31b053e58e7734cb7fa.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_imagine-john-lennon-sketches-writings-fetch-2-9m-auction-n122326_1540242910.html","title":"Imagine! John Lennon Sketches and Writings Fetch $2.9M at Auction","title_page":"Imagine! John Lennon Sketches and Writings Fetch $2.9M at Auction","title_rss":"NULL","source_domain":"nbcnews.com","text":"The final auction total of $2,899,000, including buyer's premium which varies from 12 percent to 25 percent depending on the value, was almost three times Sotheby's pre-sale estimate.\nThe hammer came down on four items for over $100,000 each. The most expensive was $209,000 paid for Lennon's nine-page Sherlock Holmes parody titled \"The Singularge Experience of Miss Anne Duffield.\" A nonsense poem, \"The Fat Budgie,\" sold for $143,000 and an ink drawing of a four-eyed guitar player went for $109,375.\nEven Paul McCartney's typed introduction to \"In His Own Write,\" in which he recalled meeting Lennon when they were 12, sold for $37,500. All the buyers were anonymous.\nBefore forming the Beatles with McCartney, Lennon attended Liverpool School of Art. Maschler called Lennon a man of \"extraordinary talent and imagination\" whose art has been underrated and he hoped the auction would \"redress the balance.\"\n\"In His Own Write,\" a collection of 31 short stories and poems, full of puns and spelling errors, published in 1964, was a big hit with reviewers, who compared Lennon to Lewis Carroll and Edward Lear. A year later, \"A Spaniard in the Works\" was published, containing more humorous and nonsensical stories.\nLennon once told the BBC his stories were short because he typed slowly: \"I couldn't be bothered going on.\"\nNBCNews.com","url":"https://www.nbcnews.com/business/business-news/imagine-john-lennon-sketches-writings-fetch-2-9m-auction-n122326"}
