{"authors":["Georgia Diebelius For Mailonline"],"date_download":"2018-10-23 00:43:13","date_modify":"2018-10-23 00:43:13","date_publish":"2016-01-28 14:46:44","description":"Rebecca Lillith Bathory, from London, has travelled to places including Italy, Belgium, Ukraine, the UK and Germany documenting haunting spaces.","filename":"data/vaneerConsumption/Imagesofabandonedchurcheshomesandhospitalsacrosstheworld.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA6BE700000578-0-image-a-114_1453988993633.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3420812_Bleak-condition-images-abandoned-churches-homes-hospitals-world-hit-Instagram_1540255393.html","title":"Images of abandoned churches, homes and hospitals across the world","title_page":"Images of abandoned churches, homes and hospitals across the world | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A fashion photographer turned urban explorer has swapped modelling shoots for the allure of abandoned buildings.\nRebecca Lillith Bathory, from London, travels around the world documenting haunting spaces such as derelict hospitals, schools and villas.\nThe fine art photographer has been capturing abandoned locations since 2012 and her work has been a big hit on social media, attracting nearly 100,000 dedicated followers across her accounts.\nDust gathers on an old armchair and piano left behind inside an abandoned manor house taken in 2014 in England\nAn old cot and dusty rusted pram lay untouched inside an abandoned house in this photograph taken in Belgium, 2014\nGetting inside an abandoned building can often be difficult and once inside there are rotten floor boards (as this shot taken in Italy shows), dust and sometimes asbestos to contend with\nIn the past four years, the passionate photographer has travelled around the UK, USA, Italy, Belgium, Ukraine (above), Germany and many other countries across the continent\nBut despite the beauty of her images, which are regularly posted on Instagram, she refuses to disclose the exact locations of her photographs in order to protect the space for other explorers and avoid tipping off security.\nRebecca first came up with the idea for her series scouting for locations while working as a fashion photographer, this then led her to finding abandoned locations during scouting for fashion shoots.\nShe said: 'It soon became much more to me and I now focus entirely on photographing abandoned buildings as opposed to people.\n'I find it so much more exciting and I feel very passionate about creating these images and sharing my art.'\nThis image of the ruins of an old stairway, which leads to an abandoned spa, was taken in Italy in 2015\nLight from above shines on a beautiful spiraling stair case left abandoned in an unknown location in the USA. Taken in 2014\nThis picture of an abandoned Communist Headquarters was taken in Bulgaria, 2013, and almost looks like a spaceship coming in to land\nAn old armchair sits in the corner of an abandoned room and the curtains still hang beside the windows in France, 2014\nExplorer Rebecca Bathory from London has been capturing abandoned locations around the world, like this one in Belgium, since 2012\nThe remains of an old horse carriage stand alone outside this overgrown area of a home in Italy\nIn the past four years, Rebecca has travelled around the UK, USA, Italy, Belgium and Germany - and many others.\nHowever the 33-year-old revealed that the abandoned buildings still make her nervous for a variety of reasons.\nShe said: 'I am nervous that the abandoned place will be impossible to get into as I never break and enter, so if all ways of getting inside have been closed, it is sad as I can't go inside.\n'I get a bit nervous that I will get caught, but this rarely happens as me and the people I go with are very quiet and we try to go unnoticed.\n'Most of the time I am just excited to be exploring such wonderful places that are hidden from the world. Their beauty takes my breath away - even after four years of doing this.'\nA stunning abandoned villa looks untouched and still as beautiful as when it was once lived in. It was taken in Italy in 2015\nA pile of abandoned gas masks lay piled up on the floor in this eerie image, which was taken in Ukraine last year\nThese images were shot in the last three years across a variety of buildings such as hospitals, schools, churches (above, in Italy) and villas\nRuins of an old forgotten building in Belgium. Rebecca said: 'I get a bit nervous that I will get caught, but this rarely happens as me and the people I go with are very quiet and we try to go unnoticed'\nA double staircase inside an abandoned Palace Casino in Italy\nThis incredible image shows an abandoned Soviet steam train covered in dust and greenery in Budapest\nOnce the adventurous photographer manages to enter an abandoned building she captures interesting details within the ruins, shooting a range of wide angle images to show decay and scale, as well as close-ups of important items left behind - all of which help tell the story of the location's past glories.\nRebecca's latest project, named Orphans Of Time, mainly focuses on houses, hospitals and schools around Europe.\nShe said: 'It is named Orphans Of Time because as time moves on these buildings get left behind. They have no families or owners to look after them any more and as time rolls on they are left for nature to claim back.'\nA bedroom inside an abandoned house looks untouched as the bed is still neatly made. This was taken in Luxembourg in 2014\nBathory's work has been a big hit on social media, attracting nearly 100,000 dedicated followers across her accounts.This picture was taken in an abandoned church in Belgium\nThis shot of the mesmerising view from below an abandoned cooling tower was taken in Belgium in 2013\nCaptioned 'Doorway to a New Realm' by the photographer, this image shows the entrance to an abandoned spa taken in Italy, 2015\nMoss and greenery starts to grow on the inside of a breathtaking abandoned villa. This image was taken in Italy in 2015\nOther projects that the professional photographer has worked on include a series that was turned into a book called Soviet Ghosts, which focuses on abandoned buildings of the former Soviet Union and its satellite states.\nShe is currently working on her second book, which will be ready to release in early 2018.\nRebecca added: 'This year I am going to be travelling to over 20 countries around the world to photograph more than 100 \"dark tourism\" sites.'\nWhat was once home to a wealthy English family lies forgotten in an unknown location in 2012 in England\nThe ruins of an abandoned, crumbling stairwell in Germany, taken in 2013\nThis creative photograph shows the moment the sun shines through the windows of an old abandoned chapel in Poland","url":"https://www.dailymail.co.uk/travel/travel_news/article-3420812/Bleak-condition-images-abandoned-churches-homes-hospitals-world-hit-Instagram.html"}
