{"authors":["Merrit Kennedy"],"date_download":"2018-10-22 21:48:58","date_modify":"2018-10-22 21:48:58","date_publish":"2016-11-11 00:00:00","description":"The funding, which is aimed at boosting investor confidence in the region's most populous country, comes after the government floated the currency and slashed fuel subsidies.","filename":"data/vaneerConsumption/IMFApproves12BillionBailoutForEgyptAfterAusterityMeasures.json","image_url":"https://media.npr.org/assets/img/2016/11/11/ap_16308411886200_wide-66900e22fd9f6971910c6442a3218c9a6d8777bd.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2016_11_11_501750268_imf-approves-12-billion-bailout-for-egypt-after-austerity-measures_1540244938.html","title":"IMF Approves $12 Billion Bailout For Egypt After Austerity Measures","title_page":"IMF Approves $12 Billion Bailout For Egypt After Austerity Measures  : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"IMF Approves $12 Billion Bailout For Egypt After Austerity Measures\nEnlarge this image toggle caption Amr Nabil/AP Amr Nabil/AP\nThe International Monetary Fund has given its final approval for a $12 billion bailout for Egypt over the next three years. The funding, which is aimed at boosting investor confidence in the region's most populous country, comes after the government imposed a series of austerity measures.\nThe IMF said the program \"will help restore macroeconomic stability and promote inclusive grown.\" According to The Associated Press, Egypt is set to \"receive a first installment of $2.75 billion immediately.\"\nThis comes after the government implemented several painful measures that have inspired praise from the IMF but frustrated many Egyptians, who have already navigated years of economic turbulence.\nOur Board has approved financing to support Egypt’s economic program: pic.twitter.com/D3zbL9zPi4 — Gerry Rice (@IMFSpokesperson) November 11, 2016\nLast week, Egypt made the surprise move of lifting currency controls and allowing the pound to float freely, as we reported. Immediately, the value of the currency dropped by almost 50 percent against the dollar and prices within Egypt have risen as a result.\nThe government has also slashed fuel subsidies, a move that the IMF said will \"contribute to lower budget deficits.\"\nEgypt's economy has faced turmoil since the start of the 2011 uprising, which ousted longtime dictator Hosni Mubarak. Tourism, a cornerstone of the economy, has essentially dried up. Investors have fled, and the country's currency reserves have dwindled. The country has also seen \"inflation hitting 14 percent and unemployment 13 percent while the percentage of the unemployed youth is around 30 percent,\" as The Associated Press reported.\nThroughout this time, Egypt's economy has been buoyed by billions of dollars in aid from Gulf countries, particularly Saudi Arabia. But as The New York Times reported, Egypt can \"no longer count on\" the Saudis.\n\"The relationship between the countries has deteriorated, and Saudi Arabia did not send expected shipments of discounted petroleum products for October and November,\" the newspaper reports. \"Egypt was forced to spend precious currency reserves to purchase them from other sources.\"\nThe IMF news comes on the same day that mass demonstrations calling for \"the revolution of the poor\" were scheduled, but largely failed to materialize amid heavy security. Egypt has banned demonstrations that are not approved by the government which has been cracking down on dissent.","url":"https://www.npr.org/sections/thetwo-way/2016/11/11/501750268/imf-approves-12-billion-bailout-for-egypt-after-austerity-measures"}
