{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 20:03:35","date_modify":"2018-10-30 20:03:35","date_publish":"2015-01-08 21:42:14","description":"Chgo Bears Tim Jennings DUI Excuse: I'm Late for My Kids' Parent/Teacher Conference","filename":"data/vaneerConsumption/ImLateforMyKidsParentTeacherConference.json","image_url":"https://media.breitbart.com/media/2015/01/Tim-Jennings-Photo-by-Jim-Prisching-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_01_08__1540929815.html","title":"I'm Late for My Kids' Parent/Teacher Conference","title_page":"Chgo Bears Tim Jennings DUI Excuse: I'm Late for My Kids' Parent/Teacher Conference","title_rss":"NULL","source_domain":"breitbart.com","text":"On Wednesday Chicago Bears cornerback Tim Jennings was arrested going 99 miles per hour in a 65 zone in Georgia. Police allege he was also drunk. But Jennings had an excuse: he was late for his 2-year-old child’s parent-teacher conference.\nA Georgia State Trooper pulled over the defensive back in Gwinnett County as he raced down Interstate 85. The officer that puled Jennings over said he could smell alcohol on the player’s breath.\nJennings ended up in the Gwinnett County jail, held on a $2,711 bond, which he paid. He was released a few hours later.\nThe player was charged with speeding, driving under the influence less safe, reckless driving. At that time, the authorities also took his license.\nPolice report that Jennings said he’d been drinking but had stopped about 10 hours before being pulled over. He also refused a breathalyzer test but did perform several field sobriety tests, which he failed.\nThe officer reportedly asked Jennings if he had recently used mouth wash or brushed his teeth to try and hide the smell of alcohol.\nJennings replied, “What kind of question is that?”\nThe officer answered saying, “Sir, you can brush your teeth and still have the smell of alcohol on your breath, you know that?”\nJennings supposedly told the officer “I have somewhere to be and am running late,” then gave his excuse of being late for a parent-teacher conference.\nLater that evening the Bears released a statement, saying, “We are aware of the reports regarding Tim Jennings’ arrest. We are currently gathering information to learn more about the circumstances surrounding the situation.”\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com","url":"https://www.breitbart.com/sports/2015/01/08/bears-tim-jennings-dui-excuse-im-late-for-parent-teacher-conference/"}
