{"authors":["Press Association"],"date_download":"2018-10-23 04:13:52","date_modify":"2018-10-23 04:13:52","date_publish":"2017-04-26 15:54:09","description":"Ibrahimovic´s contract at Old Trafford expires at the end of the season.","filename":"data/vaneerConsumption/ImnotinterestedintalkingaboutIbrahimovicfuturesaysMourinho.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/15/wire-465947-1493218454-951_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4448156_I-m-not-interested-talking-Ibrahimovic-future-says-Mourinho_1540268032.html","title":"I´m not interested in talking about Ibrahimovic future, says Mourinho","title_page":"I´m not interested in talking about Ibrahimovic future, says Mourinho | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester United manager Jose Mourinho insists it is “a waste of time” to speak about Zlatan Ibrahimovic, with the striker likely to be out for several months.\nThe Swede’s contract at Old Trafford expires at the end of the season and, with the knee ligament damage sustained in last week’s Europa League win over Anderlecht likely to sideline him until well into next season, the 35-year-old’s future has been thrown into doubt.\nHowever, Mourinho, who suffered another injury blow ahead of Thursday’s Manchester derby with the news midfielder Paul Pogba is out with a muscle injury, refused to discuss what comes next for the striker.\nZlatan Ibrahimovic (Martin Rickett/PA)\n\"He's not going to give up and he's going to fight.\"\nJose Mourinho on @Ibra_official... pic.twitter.com/z61sYWeA88 — Manchester United (@ManUtd) April 26, 2017\n“Now he has important surgery, so I think it is a waste of time to speak about what comes next,” said the United manager.\n“I don’t know, I don’t want to know, I’m not interested in it, I don’t care about it. I just want the difficult surgery to go well.\n“The future is a big surgery, long period of recovery.\n“But the future is also in the hands of a very strong guy, mentally very strong who wrote immediately in his social media he will stop when he wants, not when people think, so it looks to me that he is not going to give up, he is going to fight and I am really pleased with that. That is the Zlatan I know.\nMourinho says Valencia is ready to return for #MUFC on Thursday. Asked if Pogba and Herrera are fit, the boss replied: \"Paul no, Ander yes.\" pic.twitter.com/tGGuhLlfZI — Manchester United (@ManUtd) April 26, 2017\n“I told him, ‘You’ve fought all your life’, so I don’t see a reason not to fight.\n“We think he is in fabulous hands and he has to recover from the injury and prepare himself mentally for the next step.\n“I think the next step will be something he really wants, which is what I said before the injury in the period of doubt about his future.\n“I always thought he is much more important than myself or what I want, it is what he wants.\n“I always want players to be happy to choose their future and I think this is what is to happen.”\nPogba sustained a muscle injury in the win at Burnley at the weekend and will not be available at the Etihad Stadium, along with defenders Chris Smalling and Phil Jones, whom Mourinho on Sunday implored to “be brave” with their injuries.\nAsked whether Pogba would be fit, the Portuguese replied: “Paul? No.”\nA win on Thursday would lift United above Manchester City and into the top four, but Mourinho said stealing a march on their neighbours would only be relevant if it meant they secured Champions League football - which they can still achieve by winning the Europa League.\n“It means nothing. If we finish fifth and they finish sixth and we are above them it means nothing,” he added.\n“If they finish third and we finish fourth they are above us, but it means a lot.\n“This is not about Pep (Guardiola), this is not about City, it is about fighting for objectives.\n“We want to play Champions League football and we still have two doors open.”","url":"https://www.dailymail.co.uk/wires/pa/article-4448156/I-m-not-interested-talking-Ibrahimovic-future-says-Mourinho.html"}
