{"authors":["Naomi Ackerman","Isolde Walters For Mailonline"],"date_download":"2018-10-23 02:23:18","date_modify":"2018-10-23 02:23:18","date_publish":"2017-03-16 12:53:30","description":"CBB star and model Imogen Thomas shared a gym selfie from the Chelsea Harbour Club on Wednesday as her family - all kitted out in cute swimwear - headed to the pool","filename":"data/vaneerConsumption/ImogenThomassharesadorablegymselfiewithdaughters.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E5413E400000578-0-image-a-125_1489668959721.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319938_Imogen-Thomas-shares-adorable-gym-selfie-daughters_1540261398.html","title":"Imogen Thomas shares adorable gym selfie with daughters","title_page":"Imogen Thomas shares adorable gym selfie with daughters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is a Big Brother alum, glamour model and now a doting mother.\nAnd Imogen Thomas, 34, shares the varied aspects of her life on Instagram, from adorable family moments with her daughters to sexy lingerie snaps.\nOn Wednesday the mother-of-two posted a gym selfie from the Chelsea Harbour Club as the family - all kitted out in cute swimwear - headed to the pool.\nScroll down for video\nCute: Imogen Thomas shared a gym selfie from the Chelsea Harbour Club on Wednesday as her family - all kitted out in cute swimwear - headed to the pool\nImogen opted for a light orange suit with zip detail from her new range Chasing Summer for the healthy mid-week outing.\nHer daughters Ariana, four, and Siera, one, wore cute floral adorned one piece swimsuits and Ariana looked ready for the pool as she wore armbands and carried a towel.\nImogen, who has her two girls with Australian boyfriend Adam Horsley, posted the picture with the caption: 'Swimsuit Wednesday.... happy hump day!'\nThe adorable snap was the latest in a series of sweet family moments share with Imogen's more than 200,000 followers.\nFamily moments: Siera grinned and wore a tiny green bow in her hair, while Ariana looked directly into the lens and their mother smiled with delight in a selfie posted earlier in the week\nEarlier this week, the reality star posted a cute lying down selfie with both her children.\nSiera grinned and wore a tiny green bow in her hair, while Ariana looked directly into the lens and their mother smiled with delight.\nAnd model and entrepreneur Imogen is not averse to sharing the odd sexy lingerie and swimwear snap when promoting her fashion ranges.\nDifferent type of selfie: Model and entrepreneur Imogen is not averse to sharing the odd sexy lingerie and swimwear snap when promoting her fashion ranges\nThe flattering costume was cut high on the Welsh star's thighs in the image .\nImogen pouted in front of a mirror in the picture which looked like it was taken in her bedroom.\nShe wore her long brunette tresses half up-half down and added some baby pink lip gloss.\nAnd the day before she showed off a skin-tight plunging black number, which teased at her ample assets with its exposed zipper detailing.\nRacy display: Imogen displayed her womanly curves in a sexy plunging one-piece from her swimwear range Chasing Summer earlier this month\nA thick 90s inspired choker added an element of edginess to the look, while her centre-parted brunette locks hung loose.\nThe Welsh stunner also flaunted her svelte physique for her fans as she posed seductively in a candy-coloured swimsuit.\nThe former Miss Wales dared to reveal some cleavage in the sexy selfie.\nAnd the star had worked her jaw-dropping curves in another one-piece of deep scarlet earlier in the week.\nGorgeous: The former Big Brother star flaunted her svelte physique for her fans as she posed seductively in a candy-coloured swimsuit, with a daring plunge at the front\nRed hot: Imogen had embarked on a shoot for her new swimwear collection Chasing Summer\nSizzling display: The reality star worked her jaw-dropping curves in a sexy deep scarlet one-piece which flaunted her ample assets\nLike a pro! The short clip showed Imogen effortlessly working her angles as she put on a flirtatious display for the camera\nImogen donned two fishtail braids, which framed her heavily lined peepers and rosy cheeks.\nDespite having an envy-inducing figure, she recently revealed she 'hates' her newly voluptuous curves.\nSpeaking to MailOnline last month, Imogen explained: 'I'm totally body conscious. I have been on an extreme diet for today.\nSexy: The swimwear, from her new summer collection LA Swim, rested high on her hips and plunged excessively down the middle\nTitillating: Lace-up detailing down the middle injected a further racy element to the look\nLoving life: The Welsh beauty looked at ease as she showed off her gym-honed figure while sporting a huge smile on her face\n'It's so hard because I'm naturally a curvy woman, but after having kids and getting older it's hard to maintain your figure.'\nThe reality star added: 'I hate my hips. I hate my boobs, they're too big. I want the implants removed.'\nBut despite her insecurities the star maintains a gym-honed figure and posts many bikini selfies.\nPerfect figure: The reality star recently insisted she 'hates' her naturally voluptuous curves in an interview with MailOnline\nThe television personality has been with her partner, Australian city trader Adam Horsley, since 2011.\nThe couple live in London and regularly appear together at events.\nThe stunner began her career after being crowned Miss Wales in 2003 and then gained nationwide fame as a contestant on Big Brother in 2006.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319938/Imogen-Thomas-shares-adorable-gym-selfie-daughters.html"}
