{"authors":["Kristy Johnson","Greg Styles For Daily Mail Australia"],"date_download":"2018-10-23 01:06:04","date_modify":"2018-10-23 01:06:04","date_publish":"2017-03-10 08:39:14","description":"Glamour model and aspiring fashion designer Imogen Anthony, 26, took to Instagram on Friday, sharing controversial snaps while indulging in 'knife play', taken on Thursday.","filename":"data/vaneerConsumption/ImogenAnthonyindulgesinknifeplayinInstagramsnap.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E21BD7600000578-0-image-a-31_1489135502466.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300314_Imogen-Anthony-indulges-knife-play_1540256764.html","title":"Imogen Anthony indulges in 'knife play' in Instagram snap","title_page":"Imogen Anthony indulges in 'knife play' in Instagram snap | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Imogen Anthony marked International Women's Day on Wednesday by posting a picture of herself nude - with a nipple clamp on each breast.\nAnd never one to shy away from sharing controversial snaps, the glamour model took to Instagram again on Friday, this time indulging in 'knife play'.\nThe 26-year-old girlfriend of shock jock Kyle Sandilands donned a black wig with heavy bangs, and positioned a sharp blade over her very plump pout.\nScroll down for video\n'It's gonna be a killer year': Imogen Anthony, 26, indulged in 'knife play' earlier this week, posting a series of snaps to Instagram on Friday, after celebrating International Women's Day by wearing a pair of NIPPLE CLAMPS\nOne image shared with Imogen's 130,000 Instagram followers, saw the starlet resting a knife on her lips, staring intently at the camera.\nA black wig with heavy bangs framed her striking facial features, enhanced with a flawless complexion and a touch of bronzer on her cheekbones.\n'SALT took some fun piccies last night,' the Sydney-based personality captioned the snap, alongside three devil emojis.\nWhile a later snap saw Imogen turning her head to the side, the blade pushing down on her flesh, her mouth slightly agape.\nShe's not shy: A later snap saw the starlet turning her head to the side, the blade pushing down on her flesh, her mouth slightly agape\nDual action: The controversial antics took place alongside Imogen's model friend, Krystal Dawson (pictured), who posed in just a flimsy white top and pair of black high-cut briefs, while holding onto a heavy bladed knife\nThe controversial antics took place alongside Imogen's model friend, Krystal Dawson.\nActing as photographer, Imogen posted the results of an impromptu shoot with her gal pal.\nKrystal, sporting just a flimsy white top and pair of high-cut black briefs, also donned a thick black wig, and held onto a heavy bladed knife.\n'Took her to the dark side w/me,' Imogen captioned the snap.\nAll in a day's work: Imogen was sure to capture the day's festivities via her Instagram story on Friday\nFreeing the nipple: Imogen added her own unique tribute on International Women's Day on Wednesday, by posting a nude picture of herself, with a nipple clamp on each breast\nImogen's 'knife play' comes shortly after the bombshell paid tribute to International Women's Day in her own unique way.\nTaking to Instagram, the socialite posted a picture of herself nude - with a nipple clamp on each breast.\nImogen showed off her bare torso in the revealing image, accompanying it with a caption preaching equality between men and women.\nShe wrote: 'HPPY #InternationalWomensDay On this day we recognise #EQUALITY for women - we teach that we can have a pair of tits and be just as successful. Although, we should be practising EQUALITY every day and not just on a designated day (sic).'\nIn another effort to raise awareness, Imogen added the hash-tag 'equality for all'.\nLaid bare: Imogen is shock jock Kyle Sandilands' longtime girlfriend\nIn the picture, the fiery blonde is seen stretching upwards as she flaunts the clamps, which are joined by a single chain.\nHer face is not visible in the snap, which appeared to have been taken in a bathroom.\nImogen's impassioned post came hours after her partner made some crude remarks on his KIIS FM radio show.\nWhile giving relationship advice to content assistant Rohan Edwards, Kyle made some lewd comments about his own love life.\nConflict: The model's impassioned post comes hours after her partner made some crude remarks on his KIIS FM radio show\nShock jock: While giving relationship advice to content assistant Rohan Edwards, Kyle made some lewd comments about his own love life\nHe said: 'I've been through many thousands of women and they're all the same. They want you to be like a trained seal.'\nLater in the conversation, the 45-year-old told his colleague's girlfriend that Rohan had been faithful - despite his own advice.\n'I told him the only way to get over a woman is to get under another woman,' he recounted. 'And on International Women's Day, today's the day to do it!'\nPreaching: Later in the conversation, the 45-year-old told his colleague's girlfriend that Rohan had been faithful - despite his own advice\nImogen is no stranger to showing off her body - both in her personal pictures on Instagram and for professional photographers.\nThe busty beauty posed in lingerie as she graced the front cover of Maxim Australia's March issue.\nAnd three weeks ago, Imogen uploaded a completely topless picture to Instagram during her visit to the Whitsundays.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300314/Imogen-Anthony-indulges-knife-play.html"}
