{"authors":["Jo Scrimshire For Daily Mail Australia"],"date_download":"2018-10-23 02:07:00","date_modify":"2018-10-23 02:07:00","date_publish":"2017-03-16 12:25:29","description":"She's the model and fashion designer known for her relationship with Kyle Sandilands.","filename":"data/vaneerConsumption/ImogenAnthonywatchestheMyerrunwayshowinSydney.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E53E4AC00000578-0-image-a-58_1489666091133.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319966_Imogen-Anthony-watches-Myer-runway-Sydney_1540260420.html","title":"Imogen Anthony watches the Myer runway show in Sydney","title_page":"Imogen Anthony watches the Myer runway show in Sydney | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the model and fashion designer known for her relationship with Kyle Sandilands.\nAnd Imogen Anthony certainly made an entrance at the Myer fashion show in Sydney on Thursday night.\nThe 26-year-old socialite took style inspiration from Uma Thurman as she posed in a fringed black wig and white shirt.\nStylish: Kyle Sandilands' girlfriend Imogen Anthony certainly made an entrance at the Myer fashion show in Sydney on Thursday night\nImogen looked fantastic in a black wig which resembled Uma Thurman's famous hairstyle from Pulp Fiction.\nShe dressed to impress in a corset over an oversized white shirt, and finished off her look with fishnet tights and high heels.\nThe Australian department store unveiled its Autumn '17 fashion collection in-store on Thursday.\nStyle: The 26-year-old socialite dressed to impress in a corset over an oversized white shirt, and finished off her look with fishnet tights and black high heels\nTaking inspiration? Imogen wore a long black wig which resembled Uma Thurman's hairstyle from Pulp Fiction (pictured)\nMyer ambassadors Jennifer Hawkins and Kris Smith were among the models hitting the runway.\nFormer Bachelor star Tim Robards also made an appearance in his first catwalk show in a decade.\nImogen regularly makes headlines for her outspoken social media posts and daring sense of style.\nFashion parade! Myer ambassadors Jennifer Hawkins and Kris Smith were among the models hitting the runway in Sydney on Thursday night\nShe has long been the subject of engagement rumours, but previously claimed she and Kyle, 45, are not in a rush to get married.\nSpeaking to Daily Mail Australia last year, she said: 'There's rumours we've been engaged for three years, no we just chill, we don't need rings and stuff.'\nSaying the couple prefer to 'take things slow', Imogen added: 'It's just another little something that could be done if we wanted to.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319966/Imogen-Anthony-watches-Myer-runway-Sydney.html"}
