{"authors":[],"date_download":"2018-10-30 00:54:14","date_modify":"2018-10-30 00:54:14","date_publish":"2016-10-14 10:58:34","description":null,"filename":"data/vaneerConsumption/ImpendingPensionDisasterTheThreatThatMustNotBeNamed.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/10/440120169_4fbc158a44_o.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860854.html","title":"Impending Pension Disaster: The Threat That Must Not Be Named","title_page":"Impending Pension Disaster: The Threat That Must Not Be NamedThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"In the past six years, Pennsylvania taxpayers’ unfunded pension liability has more than doubled from less than $30 billion to $63 billion. The Keystone State’s pension debt is a large contributor to the $1.2 trillion shortfall in pension funding nationwide. A recent Moody’s report finds Pennsylvania is one of five states responsible for half of state unfunded liabilities. The others are California, Illinois, New Jersey and Texas.\nThe pension problem is nothing new, in fact, Pennsylvania lawmakers have been debating over various reforms for decades. Meanwhile, state taxpayers and state workers are sinking deeper into the pension crisis.\nMoody’s concludes states with large gaps, like Pennsylvania, will be forced to direct more and more money toward their pension systems just to keep unfunded liabilities from growing. That means fewer dollars for schools, roads, and other basic services.\nWhy are state pension shortfalls so large? A big reason is lower-than-expected investment returns.\nFor example, the Pennsylvania State Employee Retirement System (SERS) assumes a 7.5 percent rate of return for investments, but the actual rate of return was only 0.4 percent in 2015. In the first half of 2016, SERS reported a 2 percent investment return.\nThe much larger Pennsylvania State Education Retirement System (PSERS) isn’t fairing much better. The fund earned just 1.29 percent for the fiscal year, ending June 30th. Recognizing the reality of today’s economy, the system reduced its assumed rate of return from 7.5 percent to 7.25 percent starting July 2016.\nWhile most state debates have focused on replacing defined benefit plans with defined contribution plans, Pennsylvania lawmakers have pushed a wide variety of plans, yet consensus has proven elusive.\nGovernor Wolf vetoed reform back in June 2015 which included a defined contribution, alongside a “cash-balance plan”, for new employees only. By December, the Senate crafted a side-by-side hybrid pension model. The hybrid model allowed new employees to have both a (smaller) defined benefit pension and a defined contribution plan from dollar one.\nIn June, a different reform proposal passed the state house. This stacked-hybrid plan includes a defined benefit plan for workers until they reach $50,000 in salary (or 25 years of service), followed by a defined contribution plan. However, the $50,000 threshold would increase by 3 percent annually–greatly limits the number and extent of employees participating in the defined contribution plan.\nThere’s no question pension reform is urgent across the country. Earlier this year, the Wall Street Journal reported that California’s unfunded pension liability is nearly $64 billion—$20 billion more than previously thought. Meanwhile, New Jersey’s pension liability stands at an astounding $83 billion, Bloomberg reports.\nIn Pennsylvania and nationwide, lawmakers must prioritize proposals with a stronger defined contribution component while preventing political manipulation of pension payments. Anything less will keep government budgets squeezed and taxpayers exposed to tremendous risk.","url":"https://spectator.org/impending-pension-disaster-the-threat-that-must-not-be-named/"}
