{"authors":[],"date_download":"2018-10-30 01:13:54","date_modify":"2018-10-30 01:13:54","date_publish":"2018-08-28 00:05:30","description":"In January 1999, I had the privilege of spending an entire day at the Senate impeachment trial of President Bill Clinton.","filename":"data/vaneerConsumption/ImpeachmentDaleBumpersStillNeedstoBeHeededToday.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Bumpers.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862034.html","title":"Impeachment? Dale Bumpers Still Needs to Be Heeded Today","title_page":"Impeachment? Dale Bumpers Still Needs to Be Heeded TodayThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"In January 1999, I had the privilege of spending an entire day at the Senate impeachment trial of President Bill Clinton. In that brief time, I saw first-hand the grubby political realities that belie the ringing prose and high-sounding legal theories that purport to set the parameters for presidential impeachment. Now, with the incessant and angry demands by the Democrats and their mainstream media adjunct for the impeachment of President Trump, consideration of the simple political calculus that was on display at Clinton’s trial may serve to lower their fantastic expectations and cool their fevered brows.\nIn December 1998, a bitterly divided House of Representatives impeached Clinton on charges of perjury and obstruction of justice based on his grand jury testimony denying a sexual relationship with Monica Lewinsky and his obstruction of justice in a civil lawsuit by Paula Jones. Ms. Jones was but one of the numerous unwilling women who were subjected over the years to Clinton’s lewd, crude, and unwanted sexual advances. Her lawsuit was the genesis of Clinton’s legal problems.\nIn 1994, Jones filed suit accusing Clinton of sexual harassment when he was governor of Arkansas and she was a lowly state employee. According to the plaintiff, Governor Clinton had summoned her to his hotel room, exposed himself, and invited her to kiss his penis. She refused.\nInstead of simply settling the case as quietly as possible, Clinton elected to litigate. After three years of legal maneuvering by Clinton’s blue-ribbon legal team, the U.S. Supreme Court held that the president was subject to civil jurisdiction and that Jones’ case against the president could go forward. Since it was Ms. Jones’ word against that of the president, her counsel conducted pre-trial discovery to establish that Clinton had misbehaved sexually with other women. In the course of discovery, plaintiff’s counsel learned that one Linda Tripp had recorded conversations with Monica Lewinsky, a former White House intern, in which Lewinsky disclosed that she and the president had engaged in sexual relations. When plaintiff’s counsel listed Ms. Lewinsky as a trial witness, Clinton tried to cover up the affair by recommending that she file a false affidavit denying the relationship.\nWhile the cover up was underway, Independent Counsel Ken Starr was investigating Clinton’s involvement in the shady Whitewater real estate venture, the firing of the White House travel agents and their replacement by Clinton cronies from Arkansas, and the misuse of FBI files. In January 1998, Linda Tripp advised Starr that Lewinsky was preparing to testify falsely in the Jones’ case by denying that she had had a sexual relationship with the president. As a result, after his investigators interrogated Lewinsky, Starr sought to take Clinton’s grand jury testimony.\nFor reasons that remain utterly incomprehensible, Clinton’s lawyers allowed him to testify under oath before the grand jury via a closed-circuit television link from the White House.\nImmediately before Clinton’s testimony, Starr, the ultimate gentlemanly professional, voluntarily disclosed to Clinton’s lawyers that semen stains had been recovered from a dress worn by Lewinsky when she worked at the White House. The obvious import of this disclosure was that Clinton’s DNA could be — as, in fact, it later was — matched to the stains. Clinton should have then and there asserted his Fifth Amendment privilege against self-incrimination and fled the scene. Instead, before the grand jury, he put on a Jesuitically hair-splitting display of word parsing, obfuscation, and pirouetting evasion (“it all depends on what the meaning of ‘is’ is”) in which he denied having a sexual relationship — as of the day of his testimony — with Lewinsky.\nFor good measure, the evening after his grand jury testimony, Clinton appeared on nationwide television and contradicted his previous public declaration that he “did not have sexual relations with that woman, Ms. Lewinsky.” He admitted that he had had “an inappropriate relationship” with her and apologized for having previously misled his wife and the nation. Nevertheless, he insisted that he had given “legally accurate” answers to the grand jury and that he had never asked anyone to “lie, hide or destroy evidence or to take any unlawful action.” In short, Clinton continued to lie, deflect, and deceive.\nStarr did not charge Clinton criminally, but he did submit his investigative report to Congress. David Schippers, a widely respected protégé of former Attorney General Robert Kennedy, served as lead counsel for the House Judiciary Committee. After reviewing Starr’s report, Schippers concluded that it set forth grounds for impeachment. With this guidance, the House voted to impeach Clinton for obstruction of justice and of having given “perjurious, false and misleading” grand jury testimony. The votes were close. On the charge of perjury before the grand jury, the Republican controlled House voted 228 to 206. That article of impeachment charged that the president had lied to the grand jury regarding his relationship with Lewinsky, the testimony he gave in deposition in the Jones case, the false statements made by his lawyer with his permission regarding Lewinsky’s false affidavit, and witness tampering.\nThe obstruction of justice article of impeachment passed on a 221 to 212 vote. It charged Clinton with trying to obstruct justice in the Jones case by suborning Lewinsky to provide a false affidavit and false testimony, hiding subpoenaed evidence of gifts he had given to Lewinsky, and related matters.\nThe trial before the Senate commenced on January 7, 1999, and lasted five weeks. The prosecutors, called “House managers,” were led by Henry Hyde of Illinois. But the day that I attended the trial, Republican Congressman Asa Hutchinson of Arkansas led the charge. He was far and away the best lawyer in the Senate chamber that day. The competition for that title was stiff. Wheelchair bound Charles Ruff and Gregory Craig, two of Clinton’s learned and talented lawyers, were very impressive as were other House managers who rose to present and argue the case for impeachment. But it was Hutchinson who made the greatest impression. His arguments were focused, crystal clear, straightforward, and compelling. He swiftly and efficiently laid out in convincing detail the basis for the charges and did so without resort to hyperbole or bombast. As with all great trial lawyers, he let the sordid facts speak for themselves. His presentation was, in a word, devastating.\nNow understand that I was hardly a neutral observer. I went to the trial wanting to see Clinton get nailed. To me Clinton’s perjury and obstruction of justice were but part and parcel of his whole sleazy and corrupt career in public office. His efforts to pervert the course of justice were all the more outrageous because he had committed those offenses while he was the nation’s chief law enforcement officer. In short, I wanted his head on a stick. The House managers could have done bird calls and projected shadow animals on the walls of the Senate chamber, and I still would have declared them the victors. But, having said that, it was nevertheless true that Hutchinson not only had the better case on the evidence but was also far and away one of the best trial lawyers I have ever seen.\nBut, unfortunately for Hutchinson and his colleagues, there was a problem with the jury. The Senate’s party line split was 55 Republicans and 45 Democrats. Sixty-seven votes were needed for conviction. As Hutchinson and his colleagues masterfully presented the evidence and argued the law, I watched the Democrats seated just below me in the Senate chamber. Senator Chris Dodd (D. Conn.) was sotto voce exchanging one-liners with Senator Ted Kennedy (D. Mass.). They were both having a good laugh as Clinton’s perfidy was being spelled out. Other Democrats made no pretense of paying attention. One senator read the newspaper, another worked on correspondence. Others were walking about the chamber visiting one another. They made an elaborate show of ignoring the presentation by the House managers and made it clear that, regardless of the proof, there was no way that they were going to convict their party’s leader.\nThis naked and defiant disregard of the evidence — so out of sync with the gravity of the charges — angered me, but it shouldn’t have. Despite all of the legal talk about high crimes and misdemeanors and the purported constitutional basis for removing a president from office, the Democrat senators were merely demonstrating for us unsophisticated good-government rubes that the true criterion for convicting a president had nothing to do with the welfare of the country or the rule of law. Rather, the only real consideration was party affiliation and loyalty. The House managers could have shown a videotape of Clinton committing murder in the Oval Office, and it wouldn’t have changed a single Democrat vote.\nAlthough convinced by what I saw of the Democrats’ open disdain for the evidence and the law that Clinton’s acquittal was a forgone conclusion, I continued to closely follow the trial in the media. There were many fine and learned summations and arguments presented by both sides. But by far the best summation on behalf of the president was given by former Arkansas Senator Dale Bumpers, an old friend and political ally of the Clintons. Humble, self-deprecating, and utterly candid about his friendship and regard for the president, Bumpers delivered a powerful argument against removing Clinton from office. He reviewed the debates at the Constitutional Convention and brought them to bear in support of his friend Bill Clinton. Noting how “dangerous” impeachment was to the political process, he cited the words of Alexander Hamilton who had so long ago contended that “the greatest danger was that the decision [to convict the president] would be based on the comparative strength of the [political] parties rather than the guilt or innocence of the president.”\nBumpers then posed the question,\nHow did we come to be here? We’re here because of a five-year, relentless, unending investigation of the president. Fifty million dollars, hundreds of FBI agents fanning across the nation examining in detail the microscopic lives of people. Maybe the most intense investigation not only of a president but of anybody ever. I feel strongly about this… so you’ll have to excuse me, but that investigation has also shown that the judicial system in this country can and does get out of kilter, unless it’s controlled, because there are innocent people innocent people who have been financially and mentally bankrupt[ed]. One woman told me two years ago that her legal fees were 95,000 dollars. She said I don’t have $95,000 and the only asset I have is the equity in my home, which just happens to correspond to my legal fees of 95,000 dollars. And she says the only thing I can think of to do is to deed my home. This woman was innocent; never charged; testified before the grand jury a number of times. And since that time, she has accumulated an additional $200,000 in attorney fees. Javert’s pursuit of Jean Valjean in Les Misérables pales by comparison. I doubt that there are few people, maybe nobody in this body, who could withstand such scrutiny. And in this case those summoned were terrified not because of their guilt, but because they felt guilt or innocence was not really relevant. But after all of those years and 50 million dollars of Whitewater, Travelgate, Filegate, you name it, nothing, nothing, the president was found guilty of nothing, official or personal. We’re here today because the president suffered a terrible moral lapse, a marital infidelity; not a breach of the public trust, not a crime against society, the two things Hamilton talked about in Federalist Paper number 65 — I recommend it to you before you vote — but it was a breach of his marriage vows.\nBumpers then cogently overcame the House managers’ argument that Clinton’s perjury and obstruction of justice subverted the rule of law when he observed that\nthe rule of law includes presidential elections. That’s a part of the rule of law in this country. We have an event, a quadrennial event in this country which we recall “presidential elections.” And that’s the day when we reach across this aisle and hold hands, Democrats and Republicans. And we say, “Win or lose, we will abide by the decision.” It is a solemn event, presidential elections, and it should not, they should not be undone lightly; or just because one side has the clout and the other one doesn’t.\nHe closed with this peroration:\nColleagues, this is easily the most important vote you will ever cast. If you have difficulty because of an intense dislike of the president — and that’s understandable — rise above it. He is not the issue. He will be gone. You won’t. So don’t leave a precedent from which we may never recover and almost surely will regret.… But if you vote to convict, you can’t be sure what’s going to happen. James G. Blaine was a member of the Senate when Andrew Johnson was tried in 1868, and 20 years later he recanted. And he said: “I made a bad mistake.” And he says “as I reflect back on it, all I can think about is having convicted Andrew Johnson would have caused much more chaos and confusion in this country than Andrew Johnson could ever conceivably have tried.” And so it is with William Jefferson Clinton. If you vote to convict, in my opinion you’re going to be creating more havoc than he could ever possibly create. After all, he’s only got two years left. So don’t, for God’s sakes heighten people’s alienation that is at an all-time high toward their government. The people have a right and they are calling on you to rise above politics, rise above partisanship. They’re calling on you to do your solemn duty. And I pray you will.\nI have to tell you that, as much as I despised Clinton, I grudgingly admired Bumpers’ skill and the validity of his argument. He made an excellent and persuasive point about the potential harm to the nation and our faith in the inviolability of the electoral process that would result from Clinton’s removal from office. Bumpers’ words rang true then, and easily translate into a powerful and utterly prescient indictment of those who today seek to undo the outcome of the 2016 presidential election and to destroy the president and bankrupt and imprison his supporters and associates.\nAll of the media experts and talking heads parsing what constitutes “high crimes and misdemeanors” and the constitutional basis for impeachment are missing the point. In 1970, when the House of Representatives considered articles of impeachment of Supreme Court Justice William O. Douglas, then Rep. Gerald Ford (R.Mich.) proclaimed bluntly, “An impeachable offense is whatever a majority of the House of Representatives considers it to be at a given moment in history.” Sadly, Ford was correct. If the Democrats take control of the House, they will impeach Trump not because he has done anything even remotely warranting impeachment but simply because they will have the votes to do it. By that measure, Maxine Waters’ untethered and unhinged threats to impeach Trump for no particular reason fit well within Gerald Ford’s brutally realistic definition of what constitutes an impeachable offense.\nBut, if the Democrats vote articles of impeachment for whatever silly reason, they will face the same daunting jury problem that defeated the brilliant Asa Hutchinson and the other House managers in 1999 as they presented their well-founded and overwhelming case against Clinton. Impeachment in the House is one thing, but conviction by a two-thirds majority of the Senate is quite another. Regardless of its substance or lack thereof, the Democrats’ case against Trump will not succeed as long as there are 34 senatorial votes against conviction. Just as Republican party loyalty will dictate the outcome, the wise words of Dale Bumpers should comprise a compelling argument, regardless of party affiliation, as to why the removal of President Trump from office would be a national disaster.\nThe crazed Democrats should read and heed Bumpers’ summation and do a senatorial head count before they take the impeachment plunge. But, while that’s what intelligent, rational people would do, it remains to be seen whether the frenzied leftist herd that constitutes today’s Democrat party are capable of such rational reflection or concern for the welfare of the nation.\nGeorge Parry is a former federal and state prosecutor who practices law in Philadelphia. He blogs at knowledgeisgood.net and may be reached by email at kignet1@gmail.com.","url":"https://spectator.org/dale-bumpers-still-needs-to-be-heeded-today/"}
