{"authors":["Leana Wen"],"date_download":"2018-10-22 21:56:00","date_modify":"2018-10-22 21:56:00","date_publish":"2017-03-11 00:00:00","description":"Prenatal care costs more than $10,000 on average. Dr. Leana Wen wonders what choices she would make if she didn't have health insurance to cover that, and how those choices would affect her baby.","filename":"data/vaneerConsumption/ImPregnantWhatWouldHappenIfICouldntAffordHealthCare.json","image_url":"https://media.npr.org/assets/img/2017/03/10/pregnancy-cost_wide-c5d8dd9cdfef711ea22a4239d34a1592d9e17b15.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2017_03_11_519416036_im-pregnant-what-would-happen-if-i-couldnt-afford-health-care_1540245360.html","title":"I'm Pregnant. What Would Happen If I Couldn't Afford Health Care?","title_page":"What Would Happen To My Baby If I Couldn't Afford Prenatal Care? : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"I'm Pregnant. What Would Happen If I Couldn't Afford Health Care?\nEnlarge this image Hanna Barczyk for NPR Hanna Barczyk for NPR\nOn Christmas Day, I found out that I was pregnant. It was the best present I could have hoped for. My husband and I have wanted to start a family for years, and we could not wait to share the news with our loved ones.\nBut my initial exhilaration quickly turned to anxiety. As a physician, I knew many of the things that could go wrong. I wanted to do everything I could do to have a healthy baby.\nI found an obstetrician and made an appointment for my first prenatal visit. I was so relieved when I saw the baby's heartbeat on the ultrasound. My blood was drawn to check for anemia and thyroid problems. I had the rest of my recommended first trimester tests, including a Pap smear and testing for HIV and sexually-transmitted infections.\nThe appointment also provided other valuable information. I talked to my doctor and his nurse practitioner about combating morning sickness and eating nutritious meals. I don't smoke, but if I did (as 1 in 10 pregnant women do), they would have counseled on why and how to quit. My providers asked additional questions to assess for domestic violence, a concern for up to 1 in 6 pregnant women.\nEven though I'm a relatively healthy 34-year-old, I have several medical conditions that call for more frequent monitoring. My doctor recommended that I return every two weeks for a physical exam and ultrasound. Closer to delivery, I should plan to see him every week.\nI didn't hesitate to follow my doctor's recommendations. I have excellent health insurance with no copay for doctor's visits and a minimal cost for tests.\nBut what would I have done if I didn't have insurance?\nOne obstetrician visit would cost $150. With an ultrasound each time, it would be $400. A Pap smear would cost $53. One set of blood tests would add another $300. All told, my prenatal care with all visits and tests included would be over $10,000. This is not counting labor and delivery, which in my area is estimated to be up to $30,000 for a vaginal birth and $50,000 for a cesarean section.\nFacing these astronomical costs, would I be forced to pick and choose care based on my ability to pay, rather than the best available medical evidence? What services would I forgo, and with what consequences?\nThese are not hypothetical questions.\nThe Republican proposal to replace the Affordable Care Act would drastically cut Medicaid, which provides health coverage for women, children, seniors, and individuals with disabilities. In Baltimore, where I serve as the health commissioner, the majority of pregnant women are insured through Medicaid. Thousands of low-income women could lose coverage and have to pay out-of-pocket for services; others who have insurance may only be able to afford bare-minimum plans that don't cover needed services.\nAs a physician who worked in the ER before the Affordable Care Act went into effect, I have seen what happens when patients forgo needed interventions because of cost. I have treated patients who end up in irreversible comas because they couldn't afford seizure medications. I have treated people who died from drug overdoses because their insurance didn't cover addiction treatment. And I have treated women who were priced out of prenatal care, whose babies suffered the consequences in the form of preventable diseases, prematurity, birth defects, and even death.\nPrenatal and maternity care are considered an essential benefit under the Affordable Care Act; the American Health Care Act introduced in Congress last week doesn't address that because it can only cover fiscal topics. However, the bill does propose cutting essential benefits for Medicaid recipients. And it aims to defund services to Planned Parenthood clinics that provide birth control and reproductive services. That will only result in more unintended pregnancies.\nThere are those who attribute these consequences to choice: Isn't it a woman's choice to become pregnant? But nearly 1 in 2 pregnancies in the United States are unintended. For women whose insurance stops offering maternity coverage, and for the others who do not have at all, what kind of \"choice\" do they actually have, and at what cost?\nWomen without prenatal care are seven times more likely give birth to premature babies, and five times more likely to have infants who die. The consequences are not only poor health, but also higher cost passed down to taxpayers. The average medical cost for a baby with problems of prematurity is $79,000, compared to $1,000 for a healthy newborn. Hospitalizations for a preemie in the first year can be upwards of $500,000; intensive care can cost in the millions.\nConversely, studies have shown that for every dollar spent on prenatal care, there are expected savings of nearly $5. Early intervention saves lives and cuts cost. Our health care system should incentivize prevention and discourage rationing of needed services.\nLike other expecting moms, I hope more than anything to have a healthy child. I am fortunate to have access to high-quality, affordable health care. Unfortunately, that's not the case for all mothers of the nearly 4 million babies born in the U.S. each year. Our nation needs to safeguard the well-being of our families. The next generation, and the generations to come, depend on it.\nDr. Leana Wen is an emergency physician and the health commissioner of Baltimore City. She is the author of When Doctors Don't Listen: How to Avoid Misdiagnoses and Unnecessary Care. And she's on Twitter: @DrLeanaWen","url":"https://www.npr.org/sections/health-shots/2017/03/11/519416036/im-pregnant-what-would-happen-if-i-couldnt-afford-health-care"}
