{"authors":[],"date_download":"2018-10-22 21:20:06","date_modify":"2018-10-22 21:20:06","date_publish":"2016-12-26 00:00:00","description":"Officers were targeted and killed by gunmen, while police shootings spurred protests nationwide and prompted law enforcement agencies to take a hard look at use-of-force policies.","filename":"data/vaneerConsumption/In2016ViolencePervadedPolicingOnBothEndsOfTheGun.json","image_url":"https://media.npr.org/assets/img/2016/12/23/ap_960433805532_wide-de8d79587be46e5649cccaa4e8c062118b61bf46.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=506741658_1540243206.html","title":"In 2016, Violence Pervaded Policing On Both Ends Of The Gun","title_page":"In 2016, Violence Pervaded Policing On Both Ends Of The Gun : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ARI SHAPIRO, HOST:\nAcross the country in 2016, demonstrators protested the killings of civilians, often black men, at the hands of police. And Americans watched shocked as gunmen targeted and killed police officers in places like Dallas and Baton Rouge. All this is prompting law enforcement to examine its use-of-force policies. NPR's Cheryl Corley has our report - and a warning that it may disturb some listeners.\nCHERYL CORLEY, BYLINE: Early next year, the FBI will take the first steps in developing a national database to track officer-involved shootings. Currently, the country's 18,000 police departments report crime information voluntarily. So media outlets and academics like Philip Stinson, a criminologist at Bowling Green State University, work to create their own comprehensive list of police shootings.\nPHILIP STINSON: My best estimate is that about 1,000 times a year in this country, an on-duty police officer shoots and kills someone.\nCORLEY: Stinson says prosecutors consider most of those cases legally justified, and few officers face charges. Even so, several police-involved shootings this year drew massive protest and widespread attention.\n(SOUNDBITE OF ARCHIVED RECORDING)\nUNIDENTIFIED PROTESTERS: (Chanting) No justice, no peace, no racist police...\nCORLEY: In July, Baton Rouge was a hotbed of protest and mourning after police shot and killed 37-year-old Alton Sterling, who was selling CDs outside of a storefront. A bystander's graphic video of his death shows two white officers pinning Sterling to the ground.\n(SOUNDBITE OF ARCHIVED RECORDING, GUNFIRE)\nUNIDENTIFIED WOMAN #1: Oh, my God.\nUNIDENTIFIED MAN: They shot him?\nUNIDENTIFIED WOMAN #2: Yes, (unintelligible).\nUNIDENTIFIED WOMAN #1: (Crying) Oh, my God.\nCORLEY: The very next day, another shooting, this one in suburban St. Paul where a police officer shot 32-year-old Philando Castille during a traffic stop. His girlfriend, Diamond Reynolds, used her cell phone to livestream what was taking place.\n(SOUNDBITE OF ARCHIVED RECORDING)\nDIAMOND REYNOLDS: Please, officer, don't tell me that you just did this to him. You shot four bullets into him, Sir. He was just getting his license and registration, Sir.\nCORLEY: Protests flared after both shootings. Later, after a peaceful march in Dallas, a sniper targeting police officers killed five and wounded several before he was killed. During an interview on Fox TV, Texas Lieutenant Governor Dan Patrick talked about eroding respect for law enforcement.\n(SOUNDBITE OF ARCHIVED RECORDING)\nDAN PATRICK: And I do blame people on social media with their hatred towards police. I do blame former Black Lives Matter protests. Last night was peaceful, but others have not been. And we've heard the pigs in a blanket. This has to stop.\n(SOUNDBITE OF ARCHIVED BROADCAST)\nPATRISSE CULLORS: What happened in Dallas was a tragedy.\nCORLEY: That's Patrisse Cullors, one of the founders of the Black Lives Matter Movement, speaking with NPR about protest and the loss of police and civilian lives.\n(SOUNDBITE OF ARCHIVED BROADCAST)\nCULLORS: I think people are smart enough to be able to understand that both things are tragic and that we can't be deterred from fighting for black lives.\nCORLEY: There would be more police killings - three officers ambushed in Baton Rouge. And later in September, police shot and killed men in Tulsa, Okla. and Charlotte, N.C. That put the spotlight back on police use of force and set off days of protest.\nVanita Gupta, who heads the Justice Department's Civil Rights Division, says her agency is investigating the Tulsa shooting. Gupta says she's also aware, as the nation grapples with police shootings, many in law enforcement are taking a harder look at what needs to change.\nVANITA GUPTA: I have been, you know, encouraged by the fact that there is a lot of conversation in the field around de-escalation training and implicit bias and procedural justice.\nCORLEY: Chuck Wexler with the Police Executive Research Forum says he's working with police to develop better use-of-force policies and practices. The Forum's 30 guiding principles include calling for other officers to intervene and prevent their colleagues from using excessive force.\nCHUCK WEXLER: How many cases would've been prevented when someone is obviously getting upset and losing their cool if another officer said, hey, step back; let me take over? That's what you need. You need cool heads to prevail in some of these situations.\nCORLEY: It's changes like that that could begin to build trust and hopefully make deadly police-civilian encounters less likely. Cheryl Corley, NPR News, Chicago.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=506741658"}
