{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:06:05","date_modify":"2018-10-30 21:06:05","date_publish":"2017-01-02 21:11:16","description":"Education Minister Naftali Bennett is advancing legislation to extend Israeli sovereignty to the Jerusalem satellite city of Ma’ale Adumim.","filename":"data/vaneerConsumption/InAftermathOfUNVoteBennettToSubmitAnnexationProposal.json","image_url":"https://media.breitbart.com/media/2016/04/Naftali-Bennett.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_01_02__1540933565.html","title":"In Aftermath Of UN Vote, Bennett To Submit Annexation Proposal","title_page":"In Aftermath Of UN Vote, Bennett To Submit Annexation Proposal","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Education Minister Naftali Bennett on Sunday said he was advancing legislation to extend Israeli sovereignty to the Jerusalem satellite city of Ma’ale Adumim.\nBennett posted on Twitter that his Jewish Home party would present his plan to the Knesset later this month, in all likelihood after the January 20 inauguration of President-elect Donald Trump.\n“By the end of January, we will have submitted a proposal to apply Israeli law in Ma’ale Adumim,” Bennett wrote. “I expect every member of the government to support this law.”\nOn Saturday night Justice Minister Ayelet Shaked, also from the Jewish Home, extolled her party’s aspirations to annex all of Area C, the part of the West Bank with the largest Israeli settlements.\nOn Thursday, Bennett said that the incoming Trump administration would usher in a new era for Israel’s current policies regarding the West Bank, and the first step would be the annexation of Ma’ale Adumim, a city with some 40,000 residents.\n“I think the State of Israel can contain 90,000 Arabs. We don’t need to annex all of [the West Bank.] We want the international community to recognize Israel, as well as Israel’s future borders,” she said.\nHowever on Saturday, Regional Cooperation Minister Tzachi Hanegbi dismissed the notion outright, calling it “a disaster” for the country.\nIsrael captured the West Bank in the 1967 defensive war, until which point it was occupied by Jordan. Bennett’s annexation proposal includes some type of autonomy for the 90,000 Palestinians currently residing in Area C.\nOpposition figures have lambasted Bennett’s plan for being unrealistic and further isolating Israel in the international arena. Zionist Union chief Isaac Herzog said Saturday that Bennett et al were “brainwashing the public with lies, such as claiming that we can annex Area C and the world will allow it.” He also suggested Bennett take the plan to a referendum after polls suggested that only one-third of Israelis are in favor of annexing Area C.","url":"https://www.breitbart.com/middle-east/2017/01/02/in-aftermath-of-un-vote-bennett-to-submit-annexation-proposal/"}
