{"authors":[],"date_download":"2018-10-22 21:21:22","date_modify":"2018-10-22 21:21:22","date_publish":"2017-03-09 00:00:00","description":"As part of President Trump's promised crackdown on illegal immigration, he wants to bolster a program former Arizona Sheriff Joe Arpaio aggressively practiced.","filename":"data/vaneerConsumption/InArizonaProgramToRecruitPoliceToHelpICEAgentsGetsMixedReviews.json","image_url":"https://media.npr.org/assets/img/2017/03/08/gettyimages-163516023_wide-ec1c1b7f19b93143d450ffac9d82ca914c7b95e0.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=519283560_1540243282.html","title":"In Arizona, Program To Recruit Police To Help ICE Agents Gets Mixed Reviews","title_page":"In Arizona, Program To Recruit Police To Help ICE Agents Gets Mixed Reviews : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nAn Arizona county is taking a long second look at its cooperation with the federal government. Maricopa County, which includes Phoenix, was overseen for years by Sheriff Joe Arpaio. He promoted himself as the country's toughest sheriff.\nDAVID GREENE, HOST:\nHe embraced a federal program that deputized local law enforcement to help enforce immigration law. That program is called the 287(g) program, after the section of the law that allows it.\nINSKEEP: Now a new president, Donald Trump, wants to revive that program. But a lot has changed in Maricopa County, which is where we find NPR's Wade Goodwyn.\nWADE GOODWYN, BYLINE: It's one of the political ironies that while Donald Trump won a stunning electoral victory in November, one of his first and most ardent supporters, Sheriff Joe Arpaio, is, after 24 years in office, sheriff no more.\nJOE ARPAIO: This is sort of my political wall, just part of it.\nGOODWYN: The walls of Arpaio's office are a shrine to the persona of America's toughest sheriff.\nARPAIO: You'll see every major newspaper - Time magazine, New Yorker, you name it. So I have about 4,000 profiles.\nGOODWYN: Arpaio first became renowned for his severe and sometimes demeaning methodology with prisoners - pink underwear and thick, black and white horizontal prison stripes for men and chain gangs for incarcerated women - but it was in immigration enforcement that the sheriff started to acquire a degree of infamy. Around the country, a few dozen local law enforcement agencies designated a handful of their officers to pull double duty as deputized immigration agents.\nLocal departments had to pay the expenses for travel and weeks of lodging for their officers to get federally trained. So the 287(g) program wasn't all that popular nationally, but it sure was a hit in Maricopa County. By 2007, immigration enforcement had become Sheriff Arpaio's priority, with 160 of his deputies out raiding businesses and targeting Hispanic neighborhoods around Phoenix. Arpaio also formed what he called his posse, hundreds of predominantly white citizen volunteers.\nARPAIO: I was a little aggressive because when I enforce the law, I don't just do it. If you're going to do something, you do it. And it was working pretty good until they took that away from me.\nALESSANDRA SOLER: The federal government gave Arpaio his power, and it turned him into a monster that terrorized our community for years.\nGOODWYN: Alessandra Soler is executive director at the ACLU of Arizona. Soler says the agreements were meant to target unauthorized immigrants who are criminals.\nSOLER: People who are involved in narcotics trafficking, people who are involved in, like, gang activity that is resulting in criminal activity. The reality was that he was arresting, you know, corn vendors and day laborers.\nGOODWYN: The ACLU and the Mexican American Legal Defense Fund sued Sheriff Arpaio, accusing him of racial profiling on a mass scale. Brown skin had become probable cause. A federal judge eventually agreed with that assessment, and participation in the 287(g) program began to wither. But now President Trump wants to re-energize the program.\nMARK LAMB: We are a 287(g) partner. We're one of the few in the state.\nGOODWYN: Mark Lamb is sheriff of Pinal County. Pinal County only works with ICE on the incarceration side, so his deputies aren't out acting as immigration agents while on patrol. But when Lamb's deputies do arrest an unauthorized immigrant for an alleged crime...\nLAMB: That 287(g) allows us to hold those people until ICE can come in and take custody of those people. And so it does help us because we're able to protect our community and not put people that are committing crimes back out on the street.\nGOODWYN: It's the incarceration side of the program that's proved most effective. Local deputies trained to ask prisoners the right questions in their jails, the Department of Homeland Security reports, has helped to identify hundreds of thousands of unauthorized immigrants. But even in Arizona, the appetite for this is limited.\nMARK NAPIER: We have no reason to be involved in it.\nGOODWYN: Mark Napier is sheriff of Pima County, which includes Tucson and shares 125 miles of international border with Mexico. Napier says he doesn't need 287(g) on his streets or in his jails. He's never had a problem to get an ICE agent to come right over to pick up an unauthorized immigrant out of his jails. And with tens of thousands living and working in his county, Sheriff Napier wants complete cooperation, not fear.\nNAPIER: Let's say that a - an undocumented immigrant were to witness a bank robbery, get a license plate number, have great information. That person would not be amenable to coming - to contact local law enforcement out of fear of deportation.\nGOODWYN: Napier says he's happy with immigration agents doing their jobs and his deputies doing theirs.\nWade Goodwyn, NPR News, Phoenix.\n(SOUNDBITE OF LONG ARM'S \"PERFECT MORNING\")\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=519283560"}
