{"authors":[],"date_download":"2018-10-23 05:38:36","date_modify":"2018-10-23 05:38:36","date_publish":"2018-07-24 00:00:00","description":"Defense Secretary Jim Mattis prevailed on a number of policy decisions in the first year of the Trump administration, but his positions have been rejected many times in the second year.","filename":"data/vaneerConsumption/InATumultuousAdministrationDefenseSecretaryEndures.json","image_url":"https://media.npr.org/assets/img/2018/07/24/welna-mattis_wide-da7f105b22bbf5ee291718679c3c6e03641e881a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=631742060_1540273116.html","title":"In A Tumultuous Administration, Defense Secretary Endures","title_page":"In A Tumultuous Administration, Defense Secretary Endures : NPR","title_rss":"NULL","source_domain":"npr.org","text":"NOEL KING, HOST:\nAll right. So it's not just China and North Korea. President Trump has had a lot to say on matters of defense lately. He tweeted that Iran would suffer historic consequences if it threatened the U.S., he scolded NATO allies, and he discussed security privately with Russia's President Vladimir Putin. That is all clear. What's not clear is what role Defense Secretary James Mattis has had in any of this. So NPR's David Welna decided to ask, what is the status of Mattis in this administration?\nDAVID WELNA, BYLINE: Secretary Mattis kept an unusually low profile at the NATO summit in Brussels while President Trump stole the show, browbeating NATO allies over their defense spending. But as Mattis flew over Europe after the summit, he sardonically dismissed reports that he and the top brass back home were trying to patch things up with their friends in NATO.\n(SOUNDBITE OF ARCHIVED RECORDING)\nJAMES MATTIS: I just heard about this story that the Pentagon is in damage control. That was fascinating. I love reading fiction.\nWELNA: But Mattis and Trump's differences over NATO do go way back. Last year, in the first and only lengthy TV interview he has done as Pentagon chief, Mattis recalled on CBS his job interview with President-elect Trump, a man he'd never met before.\n(SOUNDBITE OF TV SHOW, \"FACE THE NATION\")\nMATTIS: And he brought up his question about NATO. And my response was that I thought that if we didn't have NATO, that he would want to create it because it's a defense of our values, it's a defense of democracy. He was very open to that.\nWELNA: For Trump, Mattis' renown as a battle-hardened Marine had a clear appeal, as did a nickname Mattis himself hates. Here's Trump revealing his choice for Pentagon chief to a crowd in Cincinnati.\n(SOUNDBITE OF ARCHIVED RECORDING)\nPRESIDENT DONALD TRUMP: We are going to appoint Mad Dog Mattis...\n(CHEERING)\nTRUMP: ...As our secretary of defense.\nWELNA: It was a job, Mattis said at his confirmation hearing, he was not angling to get.\n(SOUNDBITE OF ARCHIVED RECORDING)\nMATTIS: When this unanticipated request came, I was enjoying a full life west of the Rockies. I was not involved in the presidential campaign, and I was certainly not seeking or envisioning a position in any new administration.\nWELNA: James Carafano of The Heritage Foundation was on Trump's transition team. He says Mattis' politics hardly match Trump's.\nJAMES CARAFANO: He's not a conservative. He's actually probably more comfortable sitting in a cocktail lounge with people from the last administration. And he's certainly not comfortable at all in the political realm.\nWELNA: Unlike Trump's other Cabinet secretaries, Mattis conspicuously did not praise the president at the first full Cabinet meeting last year. Last week, he was a no-show at the first Cabinet meeting after Trump's Helsinki's summit with Russian President Vladimir Putin.\nCHUCK HAGEL: I think Secretary Mattis is in a more difficult situation than any secretary of defense we've ever had.\nWELNA: Chuck Hagel would know. This former Nebraska Republican senator was himself defense secretary during the Obama administration.\nHAGEL: You've got a president of the United States saying things that we've really never heard before from a commander in chief. And then the secretary of defense has to go back around and reassure our allies and our partners - well, the president really didn't mean that, or this is what he really did mean, or don't worry about it; we're going to be OK.\nWELNA: Mattis did chalk up some early wins as defense secretary. Trump says Mattis convinced him not to support torture. Mattis was also authorized to set troop levels in Afghanistan, and he managed to keep Trump on board with the Iran nuclear deal. But since then, Trump's dumped the nuclear deal, pulled out of the Paris climate accord that Mattis backed and established a U.S. embassy in Jerusalem, a move Mattis had opposed.\nMARA KARLIN: He's still being called the secretary of reassurance. That said, this is all just getting a whole lot tougher.\nWELNA: Especially after the Helsinki summit, says Mara Karlin, a senior adviser to five other defense secretaries. Karlin says Mattis has been trying to shift the Pentagon's focus from fighting terrorists to confronting great powers, namely China and Russia.\nKARLIN: So now Secretary Mattis and his team have some very hard questions to reconcile. Is it that China and Russia are still a top priority, or is Russia no longer top of the list?\nLEON PANETTA: The question is, how long can he continue to do this?\nWELNA: That's Leon Panetta, another defense secretary from the Obama administration.\nPANETTA: Knowing Jim Mattis, there is a line that he is not going to stand around and allow to be crossed, particularly when it comes to serious decisions regarding our U.S. forces.\nWELNA: Mattis got blindsided last month when Trump called off military exercises with South Korea. But Panetta thinks he can live with that as long as it's temporary. The Heritage Foundation's Carafano does not see why Mattis would quit.\nCARAFANO: So Mattis should resign because he doesn't like Trump's style? Mattis is much more of an adult like that, and he knows what's actually getting done. So I think the scenario of Mattis quits because he can't take it anymore - I think that's very unlikely.\nWELNA: It may come down to whether Mattis feels he's lost his say on the use of force with a commander in chief who is now threatening action against Iran.\nDavid Welna, NPR News, Washington.\n(SOUNDBITE OF TRICHOTOMY'S \"INBOX ZERO\")\nCopyright © 2018 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=631742060"}
