{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:37:52","date_modify":"2018-10-30 18:37:52","date_publish":"2016-12-20 21:00:27","description":"Opposition from Jeremy Ben-Ami and J Street is the highest endorsement that David Friedman can receive as ambassador to Israel.","filename":"data/vaneerConsumption/InAttackingDavidFriedmanJStreetCondemnsItself.json","image_url":"https://media.breitbart.com/media/2016/09/J-Street-president-Jeremy-Ben-Ami-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_12_20__1540924672.html","title":"In Attacking David Friedman, J Street Condemns Itself","title_page":"In Attacking David Friedman, J Street Condemns Itself | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"J Street president Jeremy Ben-Ami writes in the Washington Post that David Friedman, chosen by President-elect Donald Trump as the next ambassador to Israel, is unfit to serve.\nHe begins by sharing how wounded he feels that Friedman has referred to “me and Jews who share my politics on Israel as ‘worse than kapos’ and not really Jews.”\nWhat crocodile tears.\nFor several years, Ben-Ami and his group have tried to bully everyone less radical than J Street — which is to say, most of the rest of the American Jewish community.\nIt’s not enough to support the two-state solution — which Ben-Ami, disingenuously, claims to be the reason Friedman attacked J Street. No — J Street has cast even supporters of the two-state solution as enemies of peace if they dare to expect Palestinian concessions.\nIn 2010, J Street ran an advertisement describing supporters of the two-state solution like Alan Dershowitz and Sen. Joe Lieberman (I-CT) as part of the “chorus of no.” Unless you pressured Israel, you weren’t part of the “community of yes.”\nThen Ben-Ami and his organization began pressuring the U.S. Treasury to investigate Jewish charities — and only Jewish charities — whose beneficiaries may have included Jews living across the 1949 armistice line, i.e. in East Jerusalem or the West Bank.\nI confronted Ben-Ami — at a cocktail party J Street had thrown on the eve of Tisha B’Av, traditionally a Jewish day of mourning — and asked him why he didn’t make the same demand of Islamic charities, some of which might be operating in conflict zones, including the Middle East. “I don’t give a shit about Islamic charities,” he said.\nJ Street’s crusade against Jewish charities was part of the Democratic push that seems to have triggered the IRS scandal, which targeted, among other organizations, a group called Z Street that was set up to offer an alternative to J Street. Now, with the IRS scandal fading into memory, J Street is shamelessly renewing its call to single out Jewish charities for scrutiny.\n“No one should serve as an ambassador of this great country after leveling baseless charges of anti-Semitism against a sitting president, as Friedman has,” Ben-Ami continues in his complaint.\nThis from the leader of an organization that has fervently pumped false accusations that President-elect Trump encouraged antisemitism, and that is urging Trump to fire his adviser, Stephen K. Bannon (on leave as Executive Chairman of Breitbart News), based on false claims of antisemitism and bigotry.\nWhen Judge Richard Goldstone produced a slanderous UN report accusing Israel of war crimes, J Street did not object, but actually helped George Soros’s Open Society Institute bring Goldstone to Congress. (Goldstone later retracted his claims.)\nUnlike the inappropriate term “kapos,” accusing Israel falsely of literal war crimes had a real effect in terms of isolating Israel further at the UN, setting up attempts to prosecute and harass Israeli officials abroad, and deepening hatred against Jews.\nNo organization has hurt, defamed and divided the Jewish community as much as J Street — and no organization has done more to set back the cause of peace, by emboldening Palestinians to reject negotiations in anticipation of U.S. pressure on Israel.\nGiven that track record, opposition from Jeremy Ben-Ami and J Street is the highest endorsement that Friedman can receive.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle, is available from Regnery through Amazon. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/middle-east/2016/12/20/attacking-david-friedman-j-street-condemns/"}
