{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:51:29","date_modify":"2018-10-30 22:51:29","date_publish":"2017-04-03 22:32:56","description":"California Democrats are expected to face a key test of their unity this week, with Gov. Jerry Brown leaning on state lawmakers to pass a landmark tax","filename":"data/vaneerConsumption/InCaliforniaitsDemocratsstrugglingtokeeppartyunity.json","image_url":"https://calmatters.org/wp-content/uploads/170403Majorities-1024x798.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939889.html","title":"In California, it’s Democrats struggling to keep party unity","title_page":"In California, it’s Democrats struggling to keep party unity | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"California Democrats are expected to face a key test of their unity this week, with Gov. Jerry Brown leaning on state lawmakers to pass a landmark tax increase to fix what he calls a massive backlog of repairs to the state’s rutted roads and weakened bridges.\nThe $52 billion plan will only pass if two-thirds of lawmakers vote for it, putting the spotlight on the supermajority Democrats won in November. Even if Republicans reject the plan, it will pass if Democrats hang together.\nBut that is a big if.\nLike Republicans in Washington D.C. whose internal divisions killed the GOP health care bill last month, Democrats in Sacramento also come in a variety of flavors. There are coastal environmentalists and those shaped by urban poverty; Berkeley liberals and Central Valley moderates; some who answer to labor and some who are backed by business. And — a sticking point for the road repair plan that calls for raising gas taxes and vehicle fees — some Democrats come from swing districts where they could face voter backlash for supporting a tax increase.\nThough they have split on many issues over the years, Democratic Senate leader Kevin de León (D-Los Angeles) vowed that cracks in the party would not torpedo the transportation funding plan. “We are not Washington,” he said in announcing the funding deal legislative leaders reached with Brown last week.\nAnd yet the reality is that regardless of which party is in control, political majorities can be messy. Most of the time, of course, the ruling party gets its way. But on the most controversial issues, alliances can splinter, leaving the party elected to govern unable to advance its own plan.\nIt’s not a partisan phenomenon, but a dilemma that comes with being in charge, said Nathan Monroe, a political science professor at University of California, Merced, who has studied situations throughout history where the majority party in Congress failed to pass its own bills. While rare, it usually happens, he said, when centrists in the majority party don’t go along with a more extreme position being pushed by party leaders.\nAnd as a group grows in size, Monroe said, it tends to become less cohesive. That’s true of the Legislature’s Democratic supermajority.\n“It is a large party and partly by virtue of being large there are some blocs within the party,” Monroe said. “You get, in effect, what is some brinksmanship.”\nBrown, the Democratic governor, acknowledged the challenge of getting all members of his party on board, saying last week that “nothing is in the bag.” He was flanked outside the Capitol by dozens of legislative Democrats as well as union workers and business leaders who support the tax hike.\n“Is it possible to fail?” Brown said. “Yes, failure is always an option. But it’s not going to happen because we have a force here, and we’re going to join together.”\nRepublicans argue the state can fix its roads with existing money and have introduced a plan that would redirect funds now used for other purposes. The Democrats’ transportation funding bill could face a vote on Thursday.\nThe strength of California Democrats’ unity will also be tested this year on another crucial issue: housing. Sky-rocketing prices have brought home-ownership rates to their lowest level since the 1940s, a state report found, and the majority of tenants pay a precariously high portion of their income on rent.\nBills to pay for more affordable housing through borrowing and increased taxes and fees are moving through the Legislature, likely to face votes this summer. One of them would eliminate the mortgage-interest tax deduction on vacation homes, generating $220 million annually to build affordable housing. Another would put a measure on the ballot asking voters to approve $3 billion in housing construction bonds. A third would add a $75 fee to most real estate transactions to pay for housing assistance subsidies and development of affordable housing. The fee would apply to things like liens and deeds of trust, but not home sales.\nAll three bills require two-thirds approval to pass, and some of the ideas have failed before.\n“I’m getting ready to do the fourth try,” said Sen. Toni Atkins, the San Diego Democrat who is carrying Senate Bill 2 to add the fee on real estate transactions, an approach that has failed the last few years.\n“While I’m optimistic this time, it’s still not necessarily going to be easy.”\nEven on bills that don’t require two-thirds approval, Democrats have sometimes been hampered by the split between their liberal and moderate wings. Depending on the bill, the divide can reflect disagreements between business and labor, environmentalists and oil companies, doctors and lawyers, or coastal and inland communities. In recent years, moderate Democrats have killed proposals from progressive Democrats to limit use of arbitration, add health warnings on sodas and require double-pay for those who work on Thanksgiving Day.\nDavid Townsend, a political consultant who runs a business-backed PAC to elect moderate Democrats, said the bloc acts as a force to help steer policy toward the political middle.\n“It’s not so much that they are killing everything, they are often moderating things: ‘You’re going too far. How about we try it this way?’” he said.\nIn 2015, moderate Democrats opposed an environmental bill that would have required cutting petroleum use in half over the next 15 years. Their opposition was enough to force the removal of the petroleum reduction piece of Senate Bill 350, a shocking defeat for de León and Brown, who have used their positions to crusade against climate change.\nAtkins was the assembly speaker when Democrats in her caucus blocked the petroleum reduction bill. So there was a little piece of her that could relate to Republican House Speaker Paul Ryan when he announced in Washington last month that he was pulling back the health care bill. Hard-line conservatives and moderate Republicans objected to different aspects of the bill to repeal Obamacare, leaving Ryan without enough votes for it to pass.\n“You should never forget that even if you are the leader, even if there is consensus on a priority that needs to get done,” Atkins said, “something can go sideways.”","url":"https://calmatters.org/articles/california-democrats-struggling-keep-party-unity/"}
