{"authors":[],"date_download":"2018-10-22 21:57:18","date_modify":"2018-10-22 21:57:18","date_publish":"2014-06-07 00:51:54","description":"Catch up on all of the stories you missed this week, including a Florida student who excelled despite difficult circumstances.","filename":"data/vaneerConsumption/InCaseYouMissedItHomelessValedictorianInspiredbyMom.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/488241/florida_teen_615fce3916b073375b4c49a8179c1ba5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_case-you-missed-it-homeless-valedictorian-inspired-mom-n125056_1540245438.html","title":"In Case You Missed It: Homeless Valedictorian Inspired by Mom","title_page":"In Case You Missed It: Homeless Valedictorian Inspired by Mom ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTake a quick look at some of the most popular stories we've posted this week on the \"Nightly News\" website.\nA remarkable young man has chosen to take control of his future by studying hard and abiding by one simple motto: never give up. Despite being in and out of homelessness since he was 7, Griffin Furlong recently graduated from high school with a 4.65 GPA and now plans to study civil engineering at Florida State University. Hear more of his story from \"Nightly News\" correspondent Rehema Ellis.\nLast month, the unemployment rate held steady at 6.3 percent; but there are still employers out there struggling to find the right candidates. Find out which job categories are the most difficult to fill. Hint: they require specialized skills.\n3. Remembering D-Day: 70 Years Later\nJune 6 marked the 70th anniversary of the Normandy invasion, and \"Nightly News with Brian Williams\" was in France to commemorate the occasion. See NBC News' full coverage here.\n4. Bowe Bergdahl Controversy\nThe controversial prisoner swap involving Sgt. Bowe Bergdahl has generated heated debate as to whether or not Congress should have been better informed about the decision to release five high-ranking Taliban detainees.\nHear what President Obama had to say about it during his exclusive interview with Brian Williams.\n5. Wedding Party Falls Into Lake\nOn a lighter note, a Minnesota wedding went awry when a photo-op turned into a soaking wet mess. Fortunately, everyone had time to dry off before the ceremony.","url":"https://www.nbcnews.com/nightly-news/case-you-missed-it-homeless-valedictorian-inspired-mom-n125056"}
