{"authors":[],"date_download":"2018-10-23 01:08:21","date_modify":"2018-10-23 01:08:21","date_publish":"2014-08-22 00:00:00","description":"As attitudes toward homosexuality shift in the U.S., many gay men say that's created not just more legal freedoms but also greater freedom to express their gender identities.","filename":"data/vaneerConsumption/InChangingAmericaGayMasculinityHasManyDifferentShades.json","image_url":"https://media.npr.org/assets/img/2014/08/22/gay-rugby2_wide-c1d001f657587a6032661340b41b6f226656a877.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=339831032_1540256901.html","title":"In Changing America, Gay Masculinity Has 'Many Different Shades'","title_page":"In Changing America, Gay Masculinity Has 'Many Different Shades' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ROBERT SIEGEL, HOST:\nThis is ALL THINGS CONSIDERED from NPR News. I'm Robert Siegel.\nAUDIE CORNISH, HOST:\nAnd I'm Audie Cornish.\n(SOUNDBITE OF MOVIE CLIPS)\nUNIDENTIFIED ACTOR #1: (As Unidentified Character) What kind of man are you?\nUNIDENTIFIED ACTOR #2: (As Unidentified Character) I've tried to be a serious man, you know. Try to do right, be a member of the community.\nUNIDENTIFIED ACTOR #3: (As Unidentified Character) I don't know what to do. I don't know what to do.\nUNIDENTIFIED ACTOR #4: (As Unidentified Character) You can act like a man. What's the matter with you?\nUNIDENTIFIED ACTOR #5: (As Unidentified Character) You take your knife and you smear. Men smear. Smear - that's it. Yeah.\nCORNISH: Masculinity, how to be a man. We've been hearing about that this summer and today we're going to hear from gay men. Life for them in this country has changed a lot in the last decade. Cultural attitudes have shifted and so have laws. As Luke Runyon of member station KUNC reports, greater social and legal freedoms have changed the way gay men express their masculinity and femininity. And a moment of warning - this report contains language that some may find offensive.\nLUKE RUNYON, BYLINE: On a warm, breezy Saturday about two-dozen men in pink jerseys and shorts squat and lunge their way across a rugby field in Denver.\nUNIDENTIFIED MAN #1: Lunges. Ready. Running.\nRUNYON: Today's practice has the players tackling each other, running drills and jumping on each other's backs. The sport can be almost hyper-masculine with its traditionally bulkier players and brutal man-on-man tackles.\nUNIDENTIFIED MAN #2: I got one. I got one.\nRUNYON: They play for the Colorado Rush, a gay rugby team. And they range in age from millennial 20-somethings to 40-year-old gen X-ers. After practice, I pull group of guys aside to talk about masculinity and how gay men fit into it.\nJEREMY BALLARD: My name's Jeremy Ballard. I play scrum half. And I'm 33. What makes or breaks a rugby player is their attitude. It's a mental component. It's not, like, how buff they are or how big they are or whatever. It's all in your head and, like, what kind of attitude you bring to the pitch. And to me that's masculinity.\nRUNYON: So that's Ballard's definition of masculinity confined to the rugby field. But when the conversation broadens out to his daily life his definition broadens, too.\nBALLARD: I would say in a lot of ways, like, I definitely carry myself as a man. I feel like I'm a man but I definitely have feminine qualities, like, you know, my voice tends to be more feminine. I'm emotional.\nRUNYON: And that's at the heart of modern, gay masculinity - it's to spectrum. Ballard says, after he came out he felt a certain freedom to hold on to the traditionally masculine parts of himself by playing rugby but also to be open to expressing himself in other ways. Ways that might have been off-limits while still in the closet.\nFABIO CASTRO: There's all different types and shades of masculinity.\nRUNYON: 25-year-old Fabio Castro also plays for the Colorado Rush.\nCASTRO: Just because somebody, you know, listens to Mariah doesn't mean that they're not going to kick your ass on the field or, you know. There's so many different shades of masculinity. And I learned that it's OK, you know, it's OK to be who you are.\nERIC ANDERSON: What it means to be feminine varies both by the age that one is and the culture that one grew up in. And it's changing every year.\nRUNYON: Eric Anderson studies masculinity and sport at the University of Winchester in the U.K.\nANDERSON: Femininity is becoming more and more accepted. And as it comes accepted it's just not called femininity anymore.\nRUNYON: Even though mainstream attitudes have changed homophobia and violence towards gay men still exists, granted in some parts of the country more than others. Expressing gender across that spectrum comes at a cost. And embracing a more fluid identity can be a challenge. For 21-year-old rugby player Skyler Meyer, the youngest on the team, coming out of the closet meant his sexuality was settled, but his gender - the way he held himself and interacted with others - was still in flux.\nSKYLER MEYER: I fell into the stereotypes. I didn't have any big, gay role models. And I grew up always wanting to be a lawyer. And, you know, I realized I was gay. I was like, oh, well, now I've got to be a hairstylist or something. And it was just devastating to me.\nRUNYON: Meyer grew up in a Salt Lake City suburb. And says, his family was supportive while he came out.\nMEYER: You know, my dad sat me down and just kind of had the conversation with me that, you know, being gay never had to lead me into the room. You know, I've always thought of myself as the University student that happens to be gay, the rugby player that happens to be gay. I never want to be the gay man that also happens to play rugby.\nMIKE FULLER: I had to be a certain way. If I wasn't that way, then I was gay. I was a faggot.\nRUNYON: 30-year-old player Mike Fuller says, his upbringing played the biggest role in defining masculinity for him. He spent his childhood in a conservative, Florida home. Even today when people mistakenly think he's straight or he's hit on by a woman...\nFULLER: I can't help but take that as a compliment.\nRUNYON: But he doesn't like that he feels that way. While growing up, Fuller says, his family and friends imprinted on him a clear distinction between straight men and gay men.\nFULLER: The idea that I had in my head of what a gay guy was was a drag queen. That's what I thought I was supposed to be. That's what I thought that - if I'm gay then I'm obviously going to have to start wearing a dress at some point. And I have.\n(LAUGHTER)\nRUNYON: After the joking around, the guys then start plotting out practice dates for the upcoming season. They'll be playing rugby teams across the country this year. Some matchups are against other gay teams, but most are with ones that happen to be straight. For NPR News, I'm Luke Runyon in Denver.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=339831032"}
