{"authors":["James Tozer For The Daily Mail"],"date_download":"2018-10-22 22:39:24","date_modify":"2018-10-22 22:39:24","date_publish":"2017-03-10 01:19:47","description":"The Right Reverend Philip North (pictured) has dramatically announced he will not take up his position as Bishop of Sheffield because of outcry over his opposition to women priests.","filename":"data/vaneerConsumption/IncomingBishopofSheffieldquitsbeforeheevenstarts.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3AF71D0300000578-0-image-a-12_1489108662897.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299682_Incoming-Bishop-Sheffield-quits-starts_1540247964.html","title":"Incoming Bishop of Sheffield quits before he even starts","title_page":"Incoming Bishop of Sheffield quits before he even starts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bishop North has previously broken ranks with the Church of England on numerous controversial issues\nA Church of England bishop last night dramatically announced he wouldn’t be taking up his new post after a campaign sparked by his opposition to women priests.\nThe Right Reverend Philip North, who has previously accused C of E leaders of failing to stand up for the family and ignoring the causes of the Brexit vote, had been due to take over as Bishop of Sheffield later this year.\nHowever the 50-year-old – who is currently suffragan Bishop of Burnley – has attracted fierce criticism over his membership of a group opposed to women priests.\nDespite winning the support of 36 female clergy from Lancashire plus three women bishops, he last night said he would not be taking up his new post as a result of the ‘strong reaction’ his nomination aroused.\nIn a strongly-worded statement, Bishop North lambasted the ‘highly individualised attacks’ directed at him and questioned whether his critics had behaved in a Christian manner.\n‘There is clearly much to be done on what it means to disagree well and to live with theological difference in the Church of England,’ he said.\n‘The highly individualised nature of the attacks upon me have been extremely hard to bear.\n‘If, as Christians, we cannot relate to each other within the bounds of love, how can we possibly presume to transform a nation in the name of Christ?\n‘I hope though that this conversation can continue in the future without it being hung upon the shoulders of one individual.’\nBishop North has previously broken from the Anglican ranks by saying the Church should have sympathy with communities worried about immigration instead of dismissing such fears as xenophobic.\nIn an article last December for the Church Times he wrote that it had allowed gay rights to dominate its concerns while seeming ‘embarrassed to stand up for the sanctity of the family’.\nBishop North accused the Church of following an agenda set by 'academics, the moneyed elites and certain sections of the secular media'\nHe said that working class people were frozen out of the economy and suffered shrinking wages, but ‘they are routinely accused of xenophobia, or worse, when they express concerns about changes imposed upon their communities by those who live far away.’\nBishop North accused the Church of following an agenda set ‘by academies, the moneyed elites, and certain sections of the secular media’ and being out of touch with the concerns of working people who voted in favour of Brexit.\nSlamming how its ‘middle class clergy squirm nervously during Remembrance Sunday’, he wrote that ‘patriotic’ members of society were ‘fed up with having pride in their nation, its flag and its armed forces misrepresented as intolerance or racism’.\nIn 2012, Bishop North had stepped aside from his nomination as Bishop of Whitby over his views on women priests, but in January he was promoted to the diocesan role of Bishop of Sheffield.\nHe would have been the first bishop appointed to a senior role who did not agree with women’s ordination since the Church voted to allow women to become bishops in November 2014.\nHowever his membership of the Society – a Church of England group opposed to women priests – sparked fierce criticism of his nomination.\nMartyn Percy, the dean of Christ Church, Oxford, urged him to either quit the group or decline his nomination, saying its ‘rather fogeyish sacralised sexism’ clashed with the ‘thoroughly modern’ city of Sheffield, which he described as ‘go-ahead, vibrant, progressive’.\nMeanwhile a new group, Sheffield Action on Ministry Equality, was launched, expressing ‘distress’ at news of his appointment.\nIn yesterday’s statement, Bishop North said he had been given a period of leave to reflect and pray about the arguments that followed his nomination.\nSaying he had decided ‘with regret and sadness’ that he was unable to take up the post, he commented that his nomination had provoked ‘a strong reaction within the diocese and some areas of the wider Church’.\nHe added: ‘It is clear that the level of feeling is such that my arrival would be counter-productive in terms of the mission of the Church in South Yorkshire and that my leadership would not be acceptable to many.’\nIn response, The Archbishop of York, Dr John Sentamu, said he ‘sadly’ understood Bishop North’s reasons but said his treatment ‘clearly does not reflect’ the settlement under which supporters and opponents of women priests agreed to continue to work together within the Church of England.\nBishop North, who is unmarried, was born in London and became a priest in 1993.\nAn alternative candidate will now be put forward, Downing Street said.","url":"https://www.dailymail.co.uk/news/article-4299682/Incoming-Bishop-Sheffield-quits-starts.html"}
