{"authors":["Hannah Parry For Dailymail.Com"],"date_download":"2018-10-23 02:45:33","date_modify":"2018-10-23 02:45:33","date_publish":"2017-04-26 14:05:21","description":"Police bodycam footage captured Officer Justin Martin racing up the stairs of a six-story elderly care home in Hamden, Connecticut on April 21.","filename":"data/vaneerConsumption/IncrediblebodycamofpolicesavingsuicidalmaninHamden.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9FBAC500000578-0-image-a-6_1493211484676.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447716_Incredible-bodycam-police-saving-suicidal-man_1540262733.html","title":"Incredible bodycam of police saving suicidal man in Hamden","title_page":"Incredible bodycam of police saving suicidal man in Hamden | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the incredible moment a Connecticut cop saved a suicidal man from leaping to his death.\nPolice bodycam footage captured Officer Justin Martin racing up the stairs of a six-story elderly care home in Hamden, Connecticut.\nAs he reached the top floor and burst through the doors, the footage shows an unnamed man who was standing on the rooftop, ready to jump.\nThis is the incredible moment a Connecticut cop saved a suicidal man from leaping to his death\nOfficer Justin Martin's (pictured) quick thinking was able to save the life of the suicidal man\n'Hey, hey, hey!' Martin yelled out to the man before running forward to grab hold of the man just as he went to throw himself off the ledge.\nThe cop was able to haul the suicidal individual back over the side, to safety.\nThe man, who was described as 'emotionally disturbed,' continued to fight the officer during the rescue but was eventually taken to Yale-New Haven Hospital for evaluation, Fox 61 reports.\nPolice bodycam footage captured Officer Justin Martin racing up six flights of stairs of an elderly care home in Hamden, Connecticut\nAs he reached the top floor, the cop burst through the doors to reveal an unnamed man who was standing on the rooftop, ready to jump\nMartin reached the man just as he dove headfirst over the side of the six story building\nThe cop was able to haul the suicidal individual back over the side, to safety\nPolice had been called to the Whiney Center on April 21, for reports of a resident fighting with other people.\nMartin had been speaking with staff and an elderly male resident on the third floor, when the 'emotionally disturbed' man fled up the stairs.\nThe officer has chased him upstairs where he made the incredible rescue.","url":"https://www.dailymail.co.uk/news/article-4447716/Incredible-bodycam-police-saving-suicidal-man.html"}
