{"authors":[],"date_download":"2018-10-22 21:45:23","date_modify":"2018-10-22 21:45:23","date_publish":"2014-06-06 13:14:25","description":"\"Whenever the world makes you cynical, stop and think of these men,\" Obama says.","filename":"data/vaneerConsumption/InCynicalTimesObamaUrgesPausetoHonorDDayVeterans.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/491891/flags_dday_2097bcef8b7218dc68ce74b9a41e15a9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_cynical-times-obama-urges-pause-honor-d-day-veterans-n124351_1540244723.html","title":"In Cynical Times, Obama Urges Pause to Honor D-Day Veterans","title_page":"In Cynical Times, Obama Urges Pause to Honor D-Day Veterans","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nObama: “Whenever the world makes you cynical, stop and think of these men”\nThese are highly cynical and polarizing times in American politics. Whether it’s over Bowe Bergdahl, Benghazi, the VA, or even the newly announced EPA regulations, the country’s political actors are pointing fingers, shifting blame, and putting on their “D” or “R” uniforms whenever they get the chance. It’s partisan politics, all of the time. But this 70th anniversary of the D-Day invasion is a reminder that cynical and partisan times are often footnotes in American history; the true chapters of history -- at least those that are remembered fondly -- come when the country puts the cynicism and partisanship aside. “Whenever the world makes you cynical, stop and think of these men. Whenever you lose hope, stop and think of these men,” President Obama said today at the 70th anniversary remembrance of the D-Day invasion in Normandy, France. That’s a sentiment that most Americans can agree with, whether or not you agree with the president. Obama concluded, “We are on this Earth for only a moment in time. And fewer of us have parents and grandparents to tell us about what the veterans of D-Day did here 70 years ago. There isn't a time I miss my grandfather more than this day. So we have to tell their stories for them. We have to do our best to uphold in our own lives the values that they were prepared to die for.” It’s also the other important message of this non-political day: We have a duty to keep telling the story of D-Day, because we lose more firsthand witnesses every hour. Be sure to watch NBC Nightly News tonight for Brian Williams’ exclusive interview with the president.\nMistrusting Congress\nWhen it comes to the Bergdahl story, the true political problem the Obama White House is its distrust of Congress. The New York Times: “Since Mr. Obama first announced the prisoner swap from the Rose Garden of the White House on Saturday, there has been rising anger from members of Congress who say the administration ignored a statute requiring 30 days’ notice before prisoners are released from the detention center at Guantánamo Bay, where the five Taliban members were held. While the White House has said that the need for secrecy explained why it had to ignore the statute, Mr. Obama’s aides have had a difficult time explaining why they could not have warned a small group of Senate national security leaders, called the ‘Gang of Eight,’ that often receives briefings on covert or highly sensitive programs.” We understand that the White House was trying to prevent leaks. But the White House was also seeming to forget that Congress is a co-equal branch of government. And this White House filled with Democrats apparently is forgetting how angry they used to get when they were in Congress and the roles were reversed during the Bush years. Is it true that there are leakers in Congress? Yes. There are also leakers at the Pentagon, in the West Wing, at Langley. Many Democrats during the 2006 campaign when they wanted power to counter Bush argued that the legislative branch abdicated its responsibilities in providing a check on the executive branch -- and some of those Democrats now work in the executive branch. Consulting Congress may be inconvenient and yes, some members may end up acting irresponsibly. But if they do, punish them; don’t ignore them. The shoe will always some day be on the other foot.\nBergdahl story gets murkier\nAlmost a week after Bowe Bergdahl’s release from the Taliban, the story about him has only become more complicated -- as the truth often is. Here’s the New York Times on a classified Army report on his disappearance: “The roughly 35-page report, completed two months after Sergeant Bergdahl left his unit, concludes that he most likely walked away of his own free will from his outpost in the dark of night, and it criticized lax security practices and poor discipline in his unit. But it stops short of concluding that there is solid evidence that Sergeant Bergdahl, then a private, intended to permanently desert.” More: “Its portrayal of him as a soldier is said to be positive, with quotes from both commanders and squad mates — apparently including some of the men now criticizing him — describing him as punctual, always in the correct uniform and asking good questions.” Then there’s Fox News report: “U.S. Army Sgt. Bowe Bergdahl at one point during his captivity converted to Islam, fraternized openly with his captors and declared himself a ‘mujahid,’ or warrior for Islam.” Yet the same report goes on to say, “The documents show that Bergdahl at one point escaped his captors for five days and was kept, upon his re-capture, in a metal cage, like an animal.” In stories like this, partisans grab on to the facts they like and dismiss the ones they don’t. But as this story seems to prove, the real truth isn’t so simple.\nAnother positive jobs report\nSo much for that recently revised GDP report. Here’s more positive news for the economy. The AP: “U.S. employers hired at a healthy pace in May for a fourth straight month, fueling hopes the economy will accelerate after a grim start to the year. The Labor Department says employers added 217,000 jobs last month. That's down from 282,000 in April, which was revised slightly lower. But job gains have now averaged 234,000 in the past three months, up from only 150,000 in the previous three.”\nEarly highlights of Hillary Clinton’s new book\nCBS was the first to get a full copy of Hillary Clinton’s new book, “Hard Choices,” which officially comes out next week. (CBS’s parent company owns the publisher of Clinton’s book.) Here are some of the highlights:\nOn her 2002 Iraq war vote: “I wasn't alone in getting it wrong. But I still got it wrong. Plain and simple.\"\nOn Syria: “Wicked problems rarely have a right answer; in fact, part of what makes them wicked is that every option appears worse than the next. Increasingly that's how Syria appeared.\" More: “I returned to Washington reasonably confident that if we decided to begin arming and training moderate Syrian rebels, we could put in place effective coordination with our regional partners. No one likes to lose a debate, including me. But this was the president's call and I respected his deliberations and decision. From the beginning of our partnership, he had promised me that would always get a fair hearing. And I always did. In this case, my position didn't prevail.\"\nOn Putin: \"He also proved over time to be thin-skinned and autocratic, resenting criticism and eventually cracking down on dissent and debate...\"\nOn her secret meeting with Obama after the 2008 primary season had concluded: \"We stared at each other like two teenagers on an awkward first date, taking a few sips of Chardonnay. ... both Barack and I and our staffs had long lists of grievances. It was time to clear the air. ... One silver lining of defeat was that I came out of the experience realizing I no longer cared so much about what the critics said about me.\"\nWhat is MISSING from Hillary’s book\nThere’s an important thing missing from these highlights: direct criticism of President Obama or those in his team. (As we discovered with Robert Gates’ book, that kind of criticism is an easy way to get buzz.) Yes, Clinton above disagrees with the president on Syria, but it’s cordial and understanding. “[T]his was the president's call and I respected his deliberations and decision.” If that’s it, it looks like Clinton’s book will be very positive toward Obama -- and even Biden. \"Vice President-elect Joe Biden brought a wealth of international experience from his leadership of the Senate Foreign Relations Committee... Sometimes we agreed, sometimes we disagreed, but I always appreciated our frank and confidential conversations.\" Clinton’s book was always expected to be an important tell about her 2016 ambitions: If she aired dirty laundry, she probably isn’t going to run (because such criticisms wouldn’t help her with the Democratic base). But if she was 95% positive, she probably is going to run. Well, I think we have our answer here, right? This is someone who’s still involved in politics, rather than an ex-politician who’s ready to dish and tell.\nSenate easily confirms Burwell to head HHS\nRemember when most of the political world -- including us -- believed that President Obama’s nomination of Sylvia Mathews Burwell to succeed Kathleen Sebelius as HHS secretary would turn into a political fight and allow Republicans to re-litigate the health-care law? Well, so much for that idea. The Senate yesterday easily confirmed Burwell by a 78-17 vote, with 24 Republicans voting for her. Folks, that is more than half of the Senate GOP caucus. Some of the notable GOP votes especially in this primary (and runoff) season: Sen. Lindsey Graham (R-SC), whose primary is Tuesday, voted yes; Sen. Pat Roberts (R-KS), whose primary is in August, voted no; and Sen. Thad Cochran (R-MS), who’s in that runoff down in Mississippi, did not vote.\nSheriff’s office disputes McDaniel camp claim on entering county courthouse\nThe latest from the weirder and weirder Mississippi Senate GOP primary (and now runoff): It turns out the Hinds Co. Sheriff’s Office is disputing the McDaniel camp’s claim that “uniformed personnel” allowed the McDaniel folks entry to the courthouse on Election Night. \"It's a fabrication that someone pointed them to a door,\" Hinds County Sheriff's Department spokesman Othor Cain told the Clarion-Ledger. \"I think that's a total misrepresentation of fact. None of our guys let anybody in.\" Meanwhile, Politico reports that Democrats are preparing in case of a McDaniel win. “National Democrats have begun to take steps toward contesting the Mississippi Senate race, channeling money to their cash-strapped underdog challenger and preparing a deep research file on tea party candidate Chris McDaniel as Republicans duke it out in a runoff primary.”\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/cynical-times-obama-urges-pause-honor-d-day-veterans-n124351"}
