{"authors":["Associated Press"],"date_download":"2018-10-23 05:50:43","date_modify":"2018-10-23 05:50:43","date_publish":"2017-04-26 17:06:09","description":"NEW YORK (AP) - Through Jonathan Demme's freewheeling filmmaking life sounded a steady rock 'n' roll beat.Music was his first love and his first credit. Long...","filename":"data/vaneerConsumption/InDemmeseclecticcareeranonstoprocknrollbeat.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/23/wire-468423-1493244963-165_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448448_Jonathan-Demme-Silence-Lambs-director-dead-73_1540273843.html","title":"In Demme's eclectic career, a nonstop rock 'n' roll beat","title_page":"In Demme's eclectic career, a nonstop rock 'n' roll beat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - Through Jonathan Demme's freewheeling filmmaking life sounded a steady rock 'n' roll beat.\nMusic was his first love and his first credit. Long before he was an Oscar-winning director, he was music coordinator for a little-seen 1970 thriller called \"Sudden Terror.\"\nAnd Demme's death Wednesday morning at the age of 73 means that the final scenes he shot in his adventurous, hopscotching career were musical, too. His last full-length documentary was a Justin Timberlake concert film. The last scene of his final feature, \"Ricki and the Flash,\" was Meryl Streep, as an aging rocker, bringing down the house with Tom Petty's \"American Girl.\"\nFILE - In this May 31, 1992 file photo, director Jonathan Demme, left, holds his award for best director, actress Jodie Foster holds her award for best actress, and actor Anthony Hopkins holds his award for best actor for their work on \"Silence of the Lambs,\" at the Academy Awards in Los Angeles. Demme died, Wednesday, April 26, 2017, from complications from esophageal cancer in New York. He was 73. (AP Photo/Reed Saxon, File)\nFew filmmakers have been so drawn to the marrying of music and image the way Demme, a self-avowed \"fanatical rock 'n' roller,\" was. He stuffed 49 songs into \"Something Wild.\" Springsteen's \"The Streets of Philadelphia\" gave his \"Philadelphia\" its melancholy heart. And, of course, his seminal Talking Heads concert film, \"Stop Making Sense,\" deftly captured the swell of David Byrne's art-funk spectacular.\nDemme, and his films, were never so alive as when the music was playing - and playing loud.\n\"I've come to believe, and I kind of felt this when we did 'Stop Making Sense,' that shooting live music is kind of like the purest form of filmmaking,\" Demme told The Associated Press last year. \"There's no script to worry about. It's not a documentary, so you don't have to wonder where this story is going and what we can use. It's just: Here come the musicians. Here come the dancers. The curtain goes up. They have at it and we get to respond in the best way possible to what they're doing up there.\"\nThe filmmaker died Wednesday morning of complications from esophageal cancer in his New York apartment, surrounded by his wife, Joanna, and three children, said Demme's publicist, Annalee Paulo.\nDemme broke into moviemaking under the B-movie master Roger Corman in the early 1970s, and his prodigious, wide-ranging body of work always kept the agile curiosity of a low-budget independent filmmaker. His career spanned documentaries, screwball comedies and tales of social justice. Yet his most famous films were a pair of Oscar-winners.\n\"The Silence of the Lambs,\" the 1991 thriller starring Anthony Hopkins as Hannibal Lecter and Jodie Foster as an FBI analyst, earned him a directing Oscar, as well as best picture. He followed that up with \"Philadelphia\" (1993), with Tom Hanks and Denzel Washington, the first major Hollywood film to confront the AIDS crisis. It remains a landmark film in the portrayal of gay life and injustice, subjects Hollywood has previously largely turned a blind eye toward.\nHopkins, Foster and Hanks all earned Academy Awards for their performances in those films. Demme's sensitive, alert eye help produce countless other acclaimed performance, too, from Melanie Griffith (\"Something Wild\") to Anne Hathaway (\"Rachel Getting Married\").\n\"Just as passionate about music as he was about art, he was and will always be a champion of the soul,\" said Foster. Hanks called him \"the grandest of men.\" ''Jonathan taught us how big a heart a person can have, and how it will guide how we live and what we do for a living,\" said the actor.\nMartin Scorsese, in remembering \"my young friend,\" praised Demme's use of music, from Buddy Holly to Miklos Rozsa. \"His pictures have an inner lyricism that just lifts them off the ground - even a story like 'The Silence of the Lambs.'\"\nIf there was one commonality in Demme's varied filmography, it was music. He made films with Neil Young, the Pretenders and Robyn Hitchcock. (He also memorably documented Spalding Grey performing a monologue in \"Swimming to Cambodia.\")\n\"I can't play any instrument and I have a hideous voice,\" Demme said. \"But I've discovered that when I shoot music, I actually feel like I've become part of the band and I have something to do with the creation of music, which is a very good feeling for someone who loves music as much as I do.\"\nByrne said he was originally drawn to Demme for the way he'd \"slip a reggae artist's song or a Haitian recording into a narrative film in ways that were often joyous and unexpected.\"\nOn the making of 1984's \"Stop Making Sense,\" Byrne said: \"Jonathan's skill was to see the show almost as a theatrical ensemble piece, in which the characters and their quirks would be introduced to the audience, and you'd get to know the band as people, each with their distinct personalities. They became your friends, in a sense.\"\nRobert Jonathan Demme was born on Long Island on Feb. 22, 1944. After his family moved to Miami, he attended the University of Florida where he wrote movie reviews for the school paper. In 1971, he went to work for Corman, first as a unit publicist on \"Von Richthofen and Brown\" and later directing his own films: the women's prison movie \"Caged Heart\"; \"Crazy Mama\" with Cloris Leachman; and \"Fighting Mad,\" with Peter Fonda as a farmer.\nDemme's breakthrough came with the Oscar-nominated \"Melvin and Howard\" (1980), starring Jason Robards as Howard Hughes. It's about a Nevada service station owner who claims to be the beneficiary of the billionaire. From early on, music played a central role in his films, especially in 1986's music-stuffed road-trip comedy \"Something Wild,\" in which Jeff Daniels starred a tax consultant drawn into the wilder orbit of Melanie Griffith.\nSome films were misfires. Demme's 1988 adaptation of Toni Morrison's \"Beloved,\" didn't click with critics, nor did his 2004 big-budget remake of \"The Manchurian Candidate.\"\nBut 2008's \"Rachel Getting Married,\" starring Hathaway playing a young woman released from rehab for her sister's wedding, was a return to form that seemed to combine many of Demme's talents - his buoyant, natural humanism, his joy in music performance, his fondness for troubled outsiders.\nDemme most recently directed an episode of the Fox police drama \"Shots Fired,\" scheduled to air Wednesday, and a film for the Rock and Roll Hall of Fame, to debut July 1.\nDemme was initially married to Evelyn Purcell, before divorcing. He is survived by his second wife, artist Joanne Howard, and their three children: Brooklyn, Ramona and Jos. His family requests that in lieu of flowers, donations be made to the Americans for Immigrant Justice.\n___\nAP writer Lindsey Bahr and Mesfin Fekadu contributed to this report. Bahr reported from Los Angeles.\n___\nFollow AP Film Writer Jake Coyle on Twitter at: http://twitter.com/jakecoyleAP\nFILE - In this Jan. 24, 2006 file photo, filmmaker Jonathan Demme appears at the Sundance Film Festival in Park City, Utah. Demme died, Wednesday, April 26, 2017, from complications from esophageal cancer in New York. He was 73. (AP Photo/Carolyn Kaster, File)\nFILE - In this Sept. 13, 2016, file photo, Jonathan Demme, director of the concert film \"Justin Timberlake + The Tennessee Kids,\" appears at the premiere at the Toronto International Film Festival in Toronto. Demme died, Wednesday, April 26, 2017, from complications from esophageal cancer in New York. He was 73. (Photo by Chris Pizzello/Invision/AP, File)","url":"https://www.dailymail.co.uk/wires/ap/article-4448448/Jonathan-Demme-Silence-Lambs-director-dead-73.html"}
