{"authors":["Gareth Davies For Mailonline"],"date_download":"2018-10-23 01:28:19","date_modify":"2018-10-23 01:28:19","date_publish":"2017-03-10 09:47:27","description":"The unique feature from Japanese company Panasonic has been launched in India where customers had been moaning about not being able to remove curry stains.","filename":"data/vaneerConsumption/IndianwashingmachinesgetaCURRYbutton.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21EBCE00000578-0-image-a-6_1489139191952.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300570_Indian-washing-machines-CURRY-button_1540258099.html","title":"Indian washing machines get a CURRY button","title_page":"Indian washing machines get a CURRY button | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Panasonic has released a washing machine with a curry button designed to remove difficult stains caused by the Indian cuisine.\nThe unique feature has been launched in India where customers had been moaning about not being able to remove curry stains.\nThe Japanese company set up a specialist team to look into solving the seemingly wide-spread issue and have come up with the new machine after two years of research.\nCustomers in India take a look at the latest line of the newest Panasonic washing machines\nPeople in India had been complaining about not being able to remove curry stains\nExperts analysed water temperature, water flow and washing times suitable for removing curry and other stains to come up with the perfect formula, according to the Japan Times.\nHaving looked at what goes into curries, the team were able to work out the optimum conditions for the stains to be removed.\nThe machine will cost consumers up to £350, which is around 10 percent increase on a conventional washer.\nAround 5,000 units have already been sold in the country and Panasonic wants to sell around 30,000 by this time next year, according to the BBC.\nIt is not clear whether or not similar features will be launched in the UK or the US for other tough stains.\nMailOnline has contacted Panasonic for a comment.","url":"https://www.dailymail.co.uk/news/article-4300570/Indian-washing-machines-CURRY-button.html"}
