{"authors":["Mailonline India"],"date_download":"2018-10-23 02:17:34","date_modify":"2018-10-23 02:17:34","date_publish":"2017-04-26 13:16:24","description":"A global charity Wednesday launched a free condom store in India to try to reduce new cases of HIV/AIDS in a country with the world's third highest number.","filename":"data/vaneerConsumption/Indiagetsitsfirstfreecondomstore.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/13/wire-465077-1493208986-331_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/indiahome_indianews_article-4447588_India-gets-free-condom-store_1540261054.html","title":"India gets its first free condom store","title_page":"India gets its first free condom store | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A global charity Wednesday launched a free condom store in India to try to reduce new cases of HIV/AIDS in a country with the world's third highest number.\nThe AIDS Healthcare Foundation (AHF) said the initiative was the first of its kind.\nIt said organisations and individuals could place orders by phone or email to get a supply delivered to their doorstep, sidestepping any social taboos and quality issues.\nIn India condoms can be bought cheaply but sex workers and other vulnerable groups hesitate to purchase them from stores because of deep-rooted social taboos\nIn India 2.1 million people are infected with HIV according to the United Nations, although the rate of infection is falling.\nCondoms can be bought cheaply but sex workers and other vulnerable groups hesitate to purchase them from stores because of deep-rooted social taboos.\nThe government also distributes condoms for free through its health centres but activists say stocks are often unavailable or of poor quality.\n'The funding for condoms is bad, it's being cut around the world. We were getting desperate requests and it's then we realised India needs its own condom store,' said Terri Ford, chief of global advocacy and policy at AHF.\n'Condoms are the cheapest and the best way to prevent HIV infection so we were very upset about it (funding cuts),' she told AFP.\nKamathipura Red light district in Mumbai, India (file pic)\nIndia's AIDS programme has largely been successful but in 2014 the central government cut its share of funding, leading to a shortage of condoms and anti-retroviral drugs.\nThe government later restored the funding but vulnerable communities continue to be at risk of infection, as well as facing a stigma in a largely conservative society.\nLast month parliament passed the HIV/AIDS (Prevention and Control) bill, 15 years after it was introduced in the legislature, to safeguard the rights of sufferers and protect them from discrimination.\n'Imagine, one bill was on the table for 15 years,' said Ford. 'We feel very frustrated. We work with governments all over the world but there's nothing like Indian bureaucracy.\n'Slow bureaucracy is actually killing people. So many people are dying because of lack of timely testing and treatment,' Ford said.\n'India wants to be a global player in the world economy but if you can't even ensure basic healthcare to your people you can't become one.'","url":"https://www.dailymail.co.uk/indiahome/indianews/article-4447588/India-gets-free-condom-store.html"}
