{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:57:59","date_modify":"2018-10-30 17:57:59","date_publish":"2016-03-08 05:21:38","description":"Brothers in India burned their sister alive after she married a man in a different caste (social class) in the nation's most recent honor killing.","filename":"data/vaneerConsumption/IndiaWomanBurnedAliveforMarryingOutsideofHerCaste.json","image_url":"https://media.breitbart.com/media/2016/03/india-police-outside-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_07__1540922279.html","title":"India: Woman Burned Alive for Marrying Outside of Her Caste","title_page":"India: Woman Burned Alive for Marrying Outside of Her Caste","title_rss":"NULL","source_domain":"breitbart.com","text":"Brothers in India burned their sister alive after she married a man in a different caste (social class) in the nation’s most recent honor killing.\nRama Kunwar, 30, returned to her village after an eight-year absence. She eloped with her husband and hoped her family would accept him.\nKunwar belongs to the Rajput caste, which means “son of a king.” They believe their descendants come from the “ruling Hindu warrior classes of North India.” Her husband belongs to the Brahman caste, which specializes in teaching.\n“She thought that her parents would now accept her but as soon as her brothers came to know that she was in the village, they rushed to that house and dragged her out,” explained Brijran Singh, a senior administrative officer of Dungarpur district. “She cried for help but no one came to rescue her. They also conducted the funeral on the same night to destroy evidence.”\nThe police arrested her brothers and six cousins on Saturday.\nKunwar’s mother-in-law Kalawati filed a complaint with the police about the incident. They reached Kunwar and put out the fire. Kalawati told officials the couple lived with their three-year-old daughter. They took their child to meet Kalawati on March 3. They then decided to visit Kunwar’s family. From The Hudistan Times:\nOn March 4, when Kalawti, her younger son and daughter-in-law, and Rameshwari were sitting in the compound, Lakshman came with around 30 other people and dragged Rameshwari outside to a spot near the temple, poured kerosene on her and set her on fire. Ravi Shankar, ASI at Aspur police station, said they got a phone call on the night of March 4 that a woman had been burnt. Police reached the village and investigated the matter. Police are questioning others and more arrests are likely, said Shankar.\nIn January, a family killed their daughter and son-in-law after they married without the family’s permission. Five masked men hacked the couple to death with knives and axes in the middle of the night.\nLast May, a 30-year-old man and 16-year-old girl eloped without her family’s permission. From NDTV:\nA 30-year-old man and the girl, 16, were allegedly dragged to a square by 20 of the girl’s relatives and thrashed publicly before being killed. Others in the village allegedly watched and chose not to stop them. No one called the police either; the incident was reported by a neighbouring village. The man was allegedly married and a father of three children, and used to come to the village frequently to visit his in-laws. That is how he had reportedly met the teenager.\nThe relatives lynched and burned the couple alive.\nIndia’s Supreme Court ruled that courts can sentence those responsible for honor killings to death. They demanded local governments “stamp out” the honor killings and warned officials they will prosecute anyone “who fail to deal with the practice.”","url":"https://www.breitbart.com/national-security/2016/03/07/woman-burned-alive-in-india-after-she-married-man-in-different-social-class/"}
