{"authors":[],"date_download":"2018-10-23 03:08:06","date_modify":"2018-10-23 03:08:06","date_publish":"2017-03-16 13:53:40","description":"India captain Virat Kohli will undergo scans on his injured right shoulder after missing much of the opening day's action in the third test against Australia, his team said on Thursday.","filename":"data/vaneerConsumption/IndiacaptainKohlitohavescanaftershoulderinjury.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E5224AF00000578-0-image-a-16_1489671001123.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-4320358_India-captain-Kohli-scan-shoulder-injury_1540264086.html","title":"India captain Kohli to have scan after shoulder injury","title_page":"India captain Kohli to have scan after shoulder injury | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"India captain Virat Kohli will undergo scans on his injured right shoulder after missing much of the opening day's action in the third test against Australia, his team said on Thursday.\nThe 28-year-old dived in a successful attempt to stop a Peter Handscomb drive from reaching the boundary in the 40th over of the day, tumbling close to the long-on boundary.\n'In his intent to save that one run, he stopped the ball and landed on his right shoulder when he rolled over,' said India's fielding coach R Sridhar, who refused to speculate on Kohli's fitness for the rest of the match.\nIndia captain Virat Kohli injured his shoulder on day one of the third Test against Australia\nKohli (right) tumbled close to the long-on boundary in a bid to stop a Peter Handscomb drive\n'The impact was quite heavy because of the momentum he was carrying. There was shock on his right shoulder.\n'The exact status will be known by tomorrow morning. He's going to undergo some scans later today,' he added.\nKohli left the field clutching his shoulder, leaving deputy Ajinkya Rahane to lead the team in his absence.\nIndia will resume play against Australia and Ajinkya Rahane may lead in Kohli's stead\nRahane's subdued leadership was in stark contrast to Kohli's firebrand captaincy but Sridhar was impressed how the India vice-captain responded to the challenge.\n'He was taking advice from (Ravichandran) Aswhin and Ishant Sharma, the seniors in the team. It was quite democratic. Ajinkya did a good job there.\n'In Virat's absence, he kept the energy level, positioned himself in the outfield and made sure he was communicating well with the bowlers.'\nAustralia will resume day two of the penultimate test of the series on 299 for four in the first test at Ranchi's Jharkhand Cricket Association Stadium.\nAustralia captain Steve Smith salutes the pavilion after reaching his milestone on Thursday","url":"https://www.dailymail.co.uk/sport/cricket/article-4320358/India-captain-Kohli-scan-shoulder-injury.html"}
