{"authors":["Alexandra Thompson Health Reporter For Mailonline"],"date_download":"2018-10-23 05:50:48","date_modify":"2018-10-23 05:50:48","date_publish":"2017-04-26 17:07:00","description":"Shyamal Tirke, 49, from India, had a 44lb mass that was crushing his organs removed after a year of agony and vomiting. His family stopped talking to him after a witch doctor failed to help.","filename":"data/vaneerConsumption/Indianman49hadtumourremovedfromhisabdomen.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/17/3FA0BF6700000578-0-image-a-111_1493222615504.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4448326_Man-49-massive-tumour-removed-abdomen_1540273848.html","title":"Indian man, 49, had tumour removed from his abdomen","title_page":"Indian man, 49, had tumour removed from his abdomen   | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man has had a 44lb (20kg) beach ball-sized tumour removed from his abdomen.\nShyamal Tirke, 49, from India, was convinced by villagers that the mass was caused by a ghost that had possessed him.\nMr Tirke's impoverished family took him to a witch doctor. Yet, when his condition failed to improve, they stopped talking to him and locked him in a room.\nThe mass was slowly crushing his organs and made him vomit every time he ate.\nMr Tirke endured excruciating pain for a year before he finally had the tumour removed in a two-and-a-half hour operation.\nShyamal Tirke, 49, from India, had a 44lb beach ball-sized tumour removed from his abdomen\nMr Tirke went under the knife when his neighbours suggested his family take him to a free check-up at Seth Sukhlal Karnani Memorial (SSKM) Hospital in Kolkata in West Bengal, India.\nAn X-ray revealed a massive malignant mass, known as a Retroperitoneal Liposarcoma tumour.\nHis family stopped speaking to him and locked him in a room after a witch doctor failed to help\nA team of three doctors spent two-and-a-half hours removing the hefty cancer.\nDr. Partha Sarathi Ghosh, who led the surgery, said: 'It is a very rare tumour.\nA team of three doctors spent two-and-a-half hours removing the agonising cancerous tumour\n'In fact, it's the first time the doctors have removed such a large tumour in SSKM.\n'It took us two and a half hour to remove it.\nThe abdominal mass caused Mr Tirke excruciating pain and vomiting after each meal for a year\n'Shyamal is improving and will back to routine life very soon.'\nRetroperitoneal Liposarcoma tumours are a rare form of cancer that develop in the fatty tissues in a space deep in the abdomen near the kidneys, pancreas and bladder.","url":"https://www.dailymail.co.uk/health/article-4448326/Man-49-massive-tumour-removed-abdomen.html"}
