{"authors":["Pa Reporter"],"date_download":"2018-10-23 02:10:07","date_modify":"2018-10-23 02:10:07","date_publish":"2016-01-29 16:32:30","description":"India condemned a weakened Australia to back-to-back defeats to take the Twenty20 series with a 27-run victory in front of a 58,787 crowd at the MCG in Melbourne.","filename":"data/vaneerConsumption/IndiaflexmusclesaheadofWorldT20astouristsbeatAustraliaby27runstoclinchseriesinMelbourne.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B126C800000578-0-image-a-22_1454085129680.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-3423095_India-flex-muscles-ahead-World-T20-tourists-beat-Australia-27-runs-clinch-series-Melbourne_1540260607.html","title":"India flex muscles ahead of World T20 as tourists beat Australia by 27 runs to clinch series in Melbourne","title_page":"India flex muscles ahead of World T20 as tourists beat Australia by 27 runs to clinch series in Melbourne | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"India condemned a weakened Australia to back-to-back defeats to take the Twenty20 series with a 27-run victory in front of a 58,787 crowd at the MCG in Melbourne.\nVirat Kohli, who made his highest T20 score of 90 not out in his side's 37-run victory in the opening game in Adelaide on Tuesday, followed up his heroics with a knock of 59 as India posted a competitive 184 for three.\nAustralia captain Aaron Finch, leading the side in the absence of a rested Steven Smith, then struck 74 despite pulling a hamstring but the home side were restricted to 157 for eight in reply.\nRohit Sharma hit 60 before being run out as India beat Australia by 27 runs in Melbourne on Friday\nVirat Kohli, who made 90 in the first T20, scored 59 as India took a 2-0 lead to clinch three-match series\nIndia now lead 2-0 in the three-match series to send a powerful message ahead of the forthcoming World T20 on home soil.\nAustralia were without David Warner and Smith, both rested ahead of the tour of New Zealand, while Travis Head, Cameron Boyce, Shaun Tait and Kane Richardson were dropped and Scott Boland, Andrew Tye and Nathan Lyon were brought in for their T20 international debuts as the selectors experimented ahead of the World Cup.\nAfter being put into bat, India's openers Shikhar Dhawan and Rohit Sharma gave their side the perfect start, bringing up the 50 inside the first six overs.\nDhawan departed for 42, attempting a reverse sweep off Glenn Maxwell, but Sharma brought up India's hundred and his own half-century with a deflected shot to third man in the 12th over.\nAaron Finch helped Australia get off to a good start in reply scoring 74 off 48 balls before hosts collapsed\nSharma was run out for 60 and Kohli struck an unbeaten 59, off just 33 deliveries, to help India post the highest T20 international score at the MCG.\nFinch and Shaun Marsh got Australia off to an impressive start, putting on 94 for the first wicket before Marsh, who survived a stumping chance on 16, was caught at long-off for 23.","url":"https://www.dailymail.co.uk/sport/cricket/article-3423095/India-flex-muscles-ahead-World-T20-tourists-beat-Australia-27-runs-clinch-series-Melbourne.html"}
