{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:51:54","date_modify":"2018-10-30 20:51:54","date_publish":"2016-03-03 14:15:08","description":"Contents: India about to deploy its first nuclear-armed submarine, in challenge to China; China's military takes control of another Philippines fishing ground; Mideast Sunni-Shia split grows as GCC says Hezbollah is terrorist organization |","filename":"data/vaneerConsumption/IndiaAbouttoDeployitsFirstNuclearArmedSubmarine.json","image_url":"https://media.breitbart.com/media/2015/05/ap_xi-jinping-jacob-zuma-narendra-modi_ap-photo-e1457014500104.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_03__1540932714.html","title":"India About to Deploy its First Nuclear-Armed Submarine","title_page":"India About to Deploy its First Nuclear-Armed Submarine","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nIndia about to deploy its first nuclear-armed submarine, in challenge to China\nChina’s military takes control of another Philippines fishing ground\nMideast Sunni-Shia split grows as GCC says Hezbollah is terrorist organization\nIndia about to deploy its first nuclear-armed submarine, in challenge to China\nHistory of India’s Arihant nuclear submarine\nThe 6,000-ton, 110-meter long nuclear submarine Arihant, developed by India over the past three decades under a secret government program, is ready to become fully operational and could be commissioned in a few weeks, after completing in secret five months of deep sea diving drills and weapons launch tests.\nIndia says that the Arihant is “indigenously built.” It’s believed that work began in the 1980s with help from the Soviet Union, particularly on the vessel’s miniaturized reactors. A Russian diving support ship – the RFS Epron that arrived on October 1 – has been accompanying the Arihant on its deep sea dives and launch tests.\nThe deployment would complete India’s nuclear triad, which means that it could deliver atomic weapons from land, sea and air. Only the U.S. and Russia are considered full-fledged nuclear triad powers now, with China and India’s capabilities still largely untested. India would become the sixth country to have nuclear-armed submarines in operation, after the US, UK, France, Russia and China.\nAs we reported six weeks ago ( “27-Jan-16 World View — India deploying ‘submarine killer’ planes to counter China’s submarines”), India has detected Chinese submarines in the Bay of Bengal, close to India’s territorial waters around the Andaman and Nicobar Islands. Since the islands are largely undefended, India has been concerned that a lightning attack by the Chinese would be successful. With both Chinese and Indian nuclear submarines patrolling the Bay of Bengal, the possibility of dangerous miscalculations is growing. India Times and Bloomberg\nChina’s military takes control of another Philippines fishing ground\nPhilippine officials report that China’s warships are taking over yet another traditional fishing ground of Philippine fishermen in the South China Sea, and are preventing them from fishing there. The new acquisition is Quirino or Jackson Atoll, which has been a rich source of catch for a long time.\nAccording to China’s foreign ministry, China is doing the Philippine fishermen a favor:\nAccording to information from relevant departments in China, at the end of the year 2015, a foreign vessel was grounded near Wufang Jiao of China’s Nansha islands. The owner of the vessel tried many times to tow it away but failed. He then decided to abandon the ship and dismantled and took away its main equipment. If the vessel was left aground for a long time, it might cause possible impediment to navigation safety and damage to the marine environment. Therefore, China Rescue and Salvage of Ministry of Transport recently sent salvage ships to tug the grounded vessel out of the shallow water for proper disposal. During the operation, the Chinese side advised fishing boats near the waters to stay away for navigation security and operation safety. The Chinese ships have returned after the operation.\nIt is unclear whether China’s actions are really temporary. China has repeatedly said that it is planning to use its military to take control of the entire South China Sea, including the vast regions that have historically belonged to other countries, so it is unlikely Philippine fishermen are going to be doing much more fishing in this area, if any. Philippine Star and China’s Foreign Ministry and The Diplomat\nMideast Sunni-Shia split grows as GCC says Hezbollah is terrorist organization\nThe Gulf Cooperation Council (GCC) on Wednesday declared Hezbollah to be a terrorist organization. The GCC is an organization of most Sunni Arab nation, including Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates (UAE).\nHezbollah is a Lebanon-based Shia political and militia organization, funded and supported by Iran, recognized as a terrorist organization by the US and other Western countries, and now by the GCC.\nSectarian Sunni versus Shia tensions have been rising continuously since 2011, when Syria’s Shia/Alawite president Bashar al-Assad began his genocidal attacks on innocent Sunni protesters in Syria.\nRelations between Saudi Arabia and Iran took a major step towards increased hostility in January, when Saudi Arabia executed 47 alleged terrorists — 46 Sunnis and one Shia, Mohammad Baqir Nimr al-Nimr, infuriating Iran and Shias because it implied that Shia terrorism is equivalent to Sunni terrorism. Iranian mobs firebombed the Saudi embassy in Tehran, and attacked the consulate in Meshaad. Saudi Arabia and Iran broke diplomatic relations as a result. Other Saudi allies followed suit. ( “18-Jan-16 World View — Pakistan tries to mediate between Saudi Arabia and Iran”)\nAccording to Wednesday’s announcement, the GCC took its actions because of hostile acts being carried out by elements of those militias to recruit young people of GCC member states for carrying out terrorist acts, smuggling of weapons and explosives, and inciting sedition, disorder and violence in a flagrant violation of their sovereignty, security and stability:\nThe GCC states consider Hezbollah militias’ practices in the Council’s states and their terrorist and subversive acts being carried out in Syria, Yemen and Iraq contradict moral and humanitarian values and principles and the international law and pose a threat to Arab national security.\nUp until a few months ago, the Gulf states had a good relationship with Hezbollah, especially as long as they could talk about a common enemy, Israel. But Hezbollah’s alliance with Bashar al-Assad, attacking Sunni civilians in Syria, has turned them into enemies.\nHezbollah leader Sayyed Hassan Nasrallah said that Saudi Arabia seeks to instigate “strife” between Shias and Sunnis in the region. Arab News and Saudi Press Agency and Al Manar (Lebanon)\nKEYS: Generational Dynamics, India, Arihant nuclear submarine, Soviet Union, Russia, China, nuclear triad, Bay of Bengal, Andaman Island, Nicobar Island, Philippines, Jackson Atoll, South China Sea, Gulf Cooperation Council, GCC, Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, United Arab Emirates, UAE, Lebanon, Hezbollah, Iran, Sayyed Hassan Nasrallah, Syria, Bashar al-Assad\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2016/03/03/3-mar-16-world-view-india-about-to-deploy-its-first-nuclear-armed-submarine-in-challenge-to-china/"}
