{"authors":["John J. Xenakis"],"date_download":"2018-10-30 19:03:04","date_modify":"2018-10-30 19:03:04","date_publish":"2015-10-21 13:03:08","description":"Contents: India's Punjab state is 'on the boil' over violent Sikh protests; Origins of Sikhism; Militarization of Sikhism.","filename":"data/vaneerConsumption/IndiasPunjabStateIsontheBoiloverViolentSikhProtests.json","image_url":"https://media.breitbart.com/media/2015/10/GettyImages-492797166.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_10_21__1540926184.html","title":"India's Punjab State Is 'on the Boil' over Violent Sikh Protests","title_page":"India's Punjab State Is 'on the Boil' over Violent Sikh Protests","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nIndia’s Punjab state is ‘on the boil’ over violent Sikh protests\nOrigins of Sikhism\nMilitarization of Sikhism\nIndia’s Punjab state is ‘on the boil’ over violent Sikh protests\nParamilitary forces deployed in Punjab this week (india.com)\nWith India’s Punjab state “on the boil,” India is deploying 10 companies, about 1000 soldiers, of paramilitary forces to several cities in Punjab province where Sikhs have been conducting large marches, to protest an acts of desecration against Sikhism’s holy book, known as “Guru Granth Sahib.”\nThere have been at least five reports of copies of the Guru Granth Sahib being torn up or otherwise desecrated, in various cities across Punjab.\nIn one case of vigilante justice, a man who had allegedly committed a sacrilege at a gurdwada (Sikh temple) was taken and beaten up by three youths.\nIn one district last Wednesday, hundreds of angry protesters confronted police, who opened fire, killing two protesters and wounding dozens of others. The killings have further angered Sikh community members who have taken to blocking highways and bridges, demanding action against those who they say desecrated the holy book.\nThe fear is that the violence will grow and ignite the pro-Khalistan movement. The Khalistan Liberation Force (KLF) is a militant separatist movement to create a Sikh nation called Khalistan.\nIn view of the situation, the games of World Kabaddi Cup scheduled to be held in Punjab from November 14 to 28 were cancelled. I knew nothing about Kabaddi before researching this article, but apparently it is a major sport played around the world, including in the US. There are no balls involved in the game. A player from one court has to tag an opponent in the other court, and then return to his home court, all the while without inhaling. I’m not kidding. The Hindu and India Times and BBC and How to play Kabaddi\nOrigins of Sikhism\nSikh males are often confused with Muslims because they wear turbans to cover their long hair. It is thought that this confusion led to the August 2012 terrorist attack on a Sikh temple in Wisconsin, killing seven people.\nThere are 23 million Sikhs worldwide, making Sikhism the 5th largest religion in the world, with 19 million Sikhs living in India, primarily in the state of Punjab.\nThe word “Sikhism” derives from “Sikh,” which means a strong and able disciple. Sikhism emerged in 16th-century India in an environment heavily permeated with conflicts between the Hindu and Muslim religions. While Sikhism reflects its cultural context, having arisen out of Hinduism and Islam, it certainly developed into a movement unique in India. Sikhs regard their faith as an authentic new divine revelation.\nIn Hinduism and Buddhism, a Guru is a spiritual teacher. Sikhs follow the writings and teachings of the Ten Sikh Gurus. These teachings are collected in the Sikh holy book, the “Sri Guru Granth Sahib.”\nAccording to Guru Arjan Dev (1563-1606):\nI observe neither Hindu fasting nor the ritual of the Muslim Ramadan month; Him I serve who at the last shall save. The Lord of universe of the Hindus, Gosain and Allah to me are one; From Hindus and Muslims have I broken free. I perform neither Kaaba pilgrimage nor at bathing spots worship; One sole Lord I serve, and no other. I perform neither the Hindu worship nor the Muslim prayer; To the Sole Formless Lord in my heart I bow. We neither are Hindus nor Muslims; Our body and life belong to the One Supreme Being who alone is both Ram and Allah for us.\nThe founder of Sikhism, and the first of the Sikh Gurus, was Guru Nanak Dev (1469-1539), whose most famous saying is: “There is no Hindu, there is no Muslim, so whose path shall I follow? I shall follow the path of God.” Sikhs.org\nMilitarization of Sikhism\nSikhism emerged as a peaceful alternative to the wars between Hinduism and Islam, but the Sikh people are just as subject to generational crisis wars as any other group people.\nBy 1600, Sikhism was beginning to be seen as a threat to the state, and the last five Gurus began to militarize the Sikh community, so that they could resist oppression. Beginning in the early 1700s, the tenth Guru was followed by a series of military leaders, who captured more and more territory. In 1799, Sikh leader Ranjit Singh captured Lahore, and in 1801 established the Punjab as an independent state, with himself as Maharaja.\nDuring the 1800s, troops of the British Empire defeated the Sikh armies, and took over much Sikh territory. The climax occurred in 1849, when the Sikhs were decisively beaten by the British.\nBritish-Sikh relations were good until the Amritsar Massacre of 1919, when British troops opened fire on 10,000 Sikhs holding a protest meeting, killing hundreds. Some historians regard the massacre as the event that began the decline of British control.\nRelations between Sikhs and Hindus have not always been peaceful. In 1983, some Sikh activists took refuge in the Golden Temple Complex at Amritsar, the most revered place in the Sikh world. In June 1984 Indian troops launched ‘Operation Blue Star’. They attacked the Golden Temple Complex, killing many of those inside, and seriously damaging the buildings.\nThis infuriated the Sikhs. In October 1984, the world was shocked when India’s prime minister Indira Gandhi was assassinated by two of her Sikh bodyguards. Four days of anti-Sikh rioting followed in India. The government said that more than 2,700 people, mostly Sikhs, were killed, while newspapers and human rights groups put the death toll between 10,000 and 17,000. BBC\nKEYS: Generational Dynamics, India, Punjab, Sikhism, Guru Granth Sahib, World Kabaddi Cup, Khalistan Liberation Force, KLF, Guru Arjan Dev, Guru Nanak Dev, Ranjit Singh, Amritsar Massacre, Golden Temple Complex, Operation Blue Star, Indira Ghandi\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/10/21/world-view-indias-punjab-state-is-on-the-boil-over-violent-sikh-protests/"}
