{"authors":[],"date_download":"2018-10-23 02:29:27","date_modify":"2018-10-23 02:29:27","date_publish":"2017-03-10 11:38:10","description":"Dozens of workers are using cranes and jacks to shove and push a 1,000-tonne, 18th century armoury to make way for a new rail track in a southern Indian...","filename":"data/vaneerConsumption/Indiamoves1000tonnehistoricarmourytolayrailtrack.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195667-1489145893-809_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300920_India-moves-1000-tonne-historic-armoury-lay-rail-track_1540261767.html","title":"India moves 1000-tonne historic armoury to lay rail track","title_page":"India moves 1000-tonne historic armoury to lay rail track | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The historic armoury of Tipu Sultan being moved by workers at Srirangapatna near Mysore, in the southern Indian state of Karnataka, on March 9, 2017\nDozens of workers are using cranes and jacks to shove and push a 1,000-tonne, 18th century armoury to make way for a new rail track in a southern Indian state.\nThe armoury was one of the ten structures built to store gunpowder and weapons by warrior king Tipu Sultan who ruled the kingdom of Mysore between 1782 and 1799.\nWorkers are in process of lifting the 225-year-old brick and lime mortar monument and moving it nearly 130 metres from the original spot near Mysore city in Karnataka state.\nThe monument is expected to be safely relocated by the weekend, authorities said.\nThe semi-buried structure at Srirangapatna town was put on steel beams on Monday and moved using hydraulic push rams after experts said it was obstructing construction of a key rail link between Mysore and capital Bangalore.\n\"We could not alter the line as there were more important monuments in the vicinity where the tracks are being laid,\" Ravi Chandra, a senior railway official, told a local newspaper.\nSultan's kingdom included parts of present day states of Karnataka, Andhra Pradesh, Kerala and Tamil Nadu in southern India.\nThe powerful ruler was killed in the fourth Anglo-Mysore war in 1799 after defeating the British East India Company in previous battles.\nHe is credited with developing an indigenous rocket known as Mysorean rocket, a prototype of British Congreve rockets that was used in the Napoleonic wars.","url":"https://www.dailymail.co.uk/wires/afp/article-4300920/India-moves-1000-tonne-historic-armoury-lay-rail-track.html"}
