{"authors":["Edwin Mora"],"date_download":"2018-10-30 17:54:52","date_modify":"2018-10-30 17:54:52","date_publish":"2016-08-11 00:24:52","description":"India's anti-narcotics officials accused \"overlapping groups\" of drug smugglers from Pakistan of trafficking \"anti-India Muslim extremists.\"","filename":"data/vaneerConsumption/IndiaAccusesPakistaniDrugSmugglersofTraffickingJihadists.json","image_url":"https://media.breitbart.com/media/2016/08/india-pakistan-barbed-wire-border-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_08_10__1540922092.html","title":"India Accuses Pakistani Drug Smugglers of Trafficking Jihadists","title_page":"India Accuses Pakistani Drug Smugglers of Trafficking Jihadists","title_rss":"NULL","source_domain":"breitbart.com","text":"Anti-narcotics and intelligence officials from India have accused “overlapping groups” of drug smugglers, criminals, and jihadists from neighboring Pakistan of trafficking “anti-India Muslim extremists, counterfeit currency and weapons” into their country, reports the Wall Street Journal (WSJ).\nWSJ notes:\nNearly half of India’s heroin seizures… are made here in Punjab, a northern state that has become a conduit for drugs from the terror-funding opium fields of Afghanistan to markets across Asia, Europe and elsewhere, [Indian] authorities say… Overlapping groups of drug traffickers, criminals and Islamist fighters in Pakistan, they say, are ferrying anti-India Muslim extremists, counterfeit currency and weapons across the border. Authorities suspect the sale of heroin also helps finance jihadist attacks.\n“Once you’ve figured a way in through the border, it becomes a conveyor belt,” an unnamed senior Punjab police official told the Journal. “You can push drugs or terrorists or anything else.”\nBarbed-wire fencing reportedly lies along much of the 1,800-mile long international boundary between historical rivals India and Pakistan.\nThe border “is patrolled round the clock by heavily armed Indian guards,” reports WSJ, adding that problems along the India-Pakistan border, namely human and heroin trafficking, are not unprecedented.\nHowever WSJ notes:\n[A]uthorities say recent cases point to increasingly regular contact between smugglers and militants. Investigations into a 2014 case have outlined an extensive network that appears to range across Afghanistan, Pakistan and Kuwait. Police that year arrested a 26-year-old constable named Khurshid Alam while he was allegedly delivering 22 pounds of heroin, wrapped in cloth bags labeled ‘Dawat Basmati Rice,’ to two men. According to police documents and interviews with two officers involved in the case, Mr. Alam said his supplier was a [Pakistan-based] senior commander of Hizbul Mujahideen, an Islamist extremist group fighting for the separation of Kashmir, a disputed region both India and Pakistan claim.\nIndian authorities reportedly allege that Hizbul Mujahideen is one the terrorist organizations backed by the Pakistani military, a claim that Pakistan denies.\nThe Afghan and Pakistani Taliban as well as the regional branch of the Islamic State (ISIS/ISIL), known as the Khorasan Province (IS-KP/ISIL-K), have been linked to the heroin trade in Afghanistan, which generates billions of dollars in profits and is considered a major source of terrorist funding.\nCorruption in addition to “online mapping and instant-messaging services like WhatsApp” are helping smugglers, who are increasingly focusing on trafficking heroin because it is “much more lucrative” than other forms of contraband, points out WSJ, citing the anonymous senior Punjab police official.","url":"https://www.breitbart.com/national-security/2016/08/10/india-accuses-pakistani-drug-smugglers-trafficking-jihadists/"}
