{"authors":[],"date_download":"2018-10-30 20:42:06","date_modify":"2018-10-30 20:42:06","date_publish":"2015-06-09 13:36:43","description":"PATNA, India (AP) — Police killed at least 12 Maoist rebels in a clash early Tuesday in one of their strongholds in eastern India. |","filename":"data/vaneerConsumption/IndianPoliceKill12MaoistRebelsinEasternStronghold.json","image_url":"https://media.breitbart.com/media/2015/06/GettyImages-476411530.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_09__1540932126.html","title":"Indian Police Kill 12 Maoist Rebels in Eastern Stronghold","title_page":"Indian Police Kill 12 Maoist Rebels in Eastern Stronghold | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"PATNA, India (AP) — Police killed at least 12 Maoist rebels in a clash early Tuesday in one of their strongholds in eastern India.\nThe police attacked the rebels as they were on their way to extort money from several mining contractors in Palamau district in Jharkhand state, said police Inspector-General S.N. Pradhan.\nPradhan said the police recovered 12 bodies and eight automatic guns in a forested area, nearly 300 kilometers (200 miles) south of Patna, the capital of neighboring Bihar state. He said there were no police casualties.\nIn April last year, Maoist rebels ambushed a police vehicle in the same region in Jharkhand state and killed six police officers during voting in India’s national elections.\nThe rebels, who have been fighting for more than three decades demanding land and jobs for tenant farmers and the poor, say they are inspired by Chinese revolutionary leader Mao Zedong.\nThey are considered India’s biggest internal security threat, operate in 20 of India’s 28 states and have thousands of fighters.\n__\nThis story has been corrected to show the name of the police officer is S.N. Pradhan.","url":"https://www.breitbart.com/national-security/2015/06/09/indian-police-kill-12-maoist-rebels-in-eastern-stronghold/"}
