{"authors":["John Hutchinson For Mailonline"],"date_download":"2018-10-23 01:12:49","date_modify":"2018-10-23 01:12:49","date_publish":"2016-01-11 11:54:05","description":"The shocking incident is alleged to have happened on an IndiGo Airlines flight en-route from Delhi to Kolkata. After the woman began shouting at the man, the pilot asked for the pair to be separated.","filename":"data/vaneerConsumption/IndiGopassengerarrestedaftermolestingwomansittingnexttohim.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3007C5C800000578-0-image-a-8_1452511983648.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3393692_Passenger-arrested-molesting-woman-sitting-mid-flight-IndiGo-service-Delhi_1540257169.html","title":"IndiGo passenger arrested after 'molesting' woman sitting next to him","title_page":"IndiGo passenger arrested after 'molesting' woman sitting next to him | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A male plane passenger was arrested by police after he allegedly molested a woman sitting next to him mid-flight.\nThe shocking incident is alleged to have happened on an IndiGo Airlines flight en-route from Delhi to Kolkata in India.\nAfter the woman began shouting at the man next to her, the pilot took the decision to make sure the passengers were separated, and on landing in Kolkata, the police were called.\nThe shocking incident is alleged to have happened on an IndiGo Airlines flight en-route from Delhi to Kolkata in India\nIBNLive reports that a case has been filed with the Kolkata airport police, and the man was arrested at the time.\nLocal news sources have named the man as 50-year-old Sanjay Kanad, a businessman who works in Delhi. The victim is also believed to be from Delhi and is 30 years old.\nThe plane is believed to have landed on schedule despite the incident taking place.\nA spokesperson for IndiGo confirmed there was an incident of 'unruly behavior' which was reported today on IndiGo flight 6E-219, travelling from Delhi to Kolkata.\nThe woman is said to have launched a charge of molestation against the passenger seated next to her. Both gave evidence at Kolkata airport\nShe said: 'While the aircraft was descending, a woman passenger who was seated on 9F had raised a concern against the co-passenger of being touched objectionably. The crew on-board escalated the concern to the security staff and the CISF.\n'At IndiGo, any untoward act which compromises the dignity of passengers or crew is a serious concern.\n'IndiGo personnel accompanied the parties to the police station and a criminal complaint has been lodged. The matter is being investigated by the concerned authorities.\n'We deeply regret the inconvenience caused to the woman passenger on board.'","url":"https://www.dailymail.co.uk/travel/travel_news/article-3393692/Passenger-arrested-molesting-woman-sitting-mid-flight-IndiGo-service-Delhi.html"}
