{"authors":[],"date_download":"2018-10-23 00:31:51","date_modify":"2018-10-23 00:31:51","date_publish":"2016-01-29 13:31:55","description":"India took an unbeatable 2-0 lead over Australia in their three-match Twenty20 series with a 27-run win in the second match at the MCG on Friday. The tourist...","filename":"data/vaneerConsumption/IndiasealAustraliaT20serieswithwininMelbourne.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i0vt-4PuZeKVXE7cd9005b2c876a76fac-39_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422793_India-seal-Australia-T20-series-win-Melbourne_1540254711.html","title":"India seal Australia T20 series with win in Melbourne","title_page":"India seal Australia T20 series with win in Melbourne | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"India seal Australia T20 series with win in Melbourne\nIndia took an unbeatable 2-0 lead over Australia in their three-match Twenty20 series with a 27-run win in the second match at the MCG on Friday.\nThe tourists won the first match in Adelaide by 37 runs and the second encounter followed a remarkably similar script.\nAfter India made 184 for three, Australia looked in a strong position in the chase as they approached 100 with openers Aaron Finch and Shaun Marsh still at the crease.\nIndia celebrate victory against Australia in the second Twenty20 in Melbourne on January 29, 2016 ©Mal Fairclough (AFP)\nBut the home side faltered, with their middle order unable to continue the good work of the openers.\nAustralia were cruising at 94-0 in the 10th over, but the dismissal of Marsh for 23, caught off the bowling of Ravi Ashwin, turned the tide.\nWickets started to tumble and when the captain Finch, who was battling a recurrent hamstring strain but shaped up as Australia’s last hope, was run out for 74 from 48 balls the tourists were in total control.\nFinch had ridden his luck until then, having been dropped three times in quick succession just after reaching his half-century.\nTo make matters worse for the skipper, he appeared to severely aggravate the injury to his hamstring in being run out, placing his immediate playing future in doubt.\n-'Feels wonderful'-\nAustralia lost eight wickets for just 63 runs as the game and the series slipped away.\nShane Watson, who stood in for the injured Finch at the post-match presentation, said the home side blew a great foundation for the second time in as many matches.\n\"We got a really good start, but the middle order weren't able to get the momentum up,\" he said.\n\"We lost too many wickets through the middle.\"\nAgainst a weak-looking Australian sidd, missing star batsmen David Warner and Steve Smith, India’s top order batsmen again produced a commanding total.\nOpener Rohit Sharma took nine balls to get off the mark, but made good on the slow start to top score with 60 from 47 balls.\nVirat Kohli, who made an unbeaten 90 in the first game, backed that up with 59 not out from 33 balls.\nShikhar Dhawan chimed in with a personal best of 42 from 32 balls, putting on 97 with Sharma at the top of the order.\nKohli was named man of the match and said he was able to capitalise on the groundwork of the opening pair.\n\"Sealing the series feels wonderful,\" he said. \"Those two (openers) have been striking the ball well.\n\"They are taking the game away from Australia in the first few overs. I think it demoralises the bowlers a bit and they have been laying a great platform for me.\"\nAlthough Yuvraj Singh failed to get a bat for the second match in succession, he had a major impact with the ball, coming on in the middle overs and conceding just seven runs in two overs, and claiming the crucial wicket of Glenn Maxwell for one.\nSpinner Ravi Jadeja also played an important role with the ball, taking a stunning return catch to remove Watson and claiming two wickets.","url":"https://www.dailymail.co.uk/wires/afp/article-3422793/India-seal-Australia-T20-series-win-Melbourne.html"}
