{"authors":["Laurel Wamsley","Scott Neuman","Sushmita Pathak","Furkan Latif Khan"],"date_download":"2018-10-22 21:42:38","date_modify":"2018-10-22 21:42:38","date_publish":"2018-09-06 00:00:00","description":"The landmark decision overturns a long-standing provision in the country's penal code that dates back to British colonial rule and outlawed all anal and oral sex.","filename":"data/vaneerConsumption/IndiasSupremeCourtStrikesDownBanOnGaySex.json","image_url":"https://media.npr.org/assets/img/2018/09/05/gettyimages-629154538_wide-835970e92add3e984ee6cc9df045b34b6af88cc4.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_09_06_644970751_indias-supreme-court-strikes-down-ban-on-gay-sex_1540244558.html","title":"India's Supreme Court Strikes Down Ban On Gay Sex","title_page":"India's Supreme Court Strikes Down Ban On Gay Sex : NPR","title_rss":"NULL","source_domain":"npr.org","text":"India's Supreme Court Strikes Down Ban On Gay Sex\nEnlarge this image toggle caption Debajyoti Chakraborty/NurPhoto via Getty Images Debajyoti Chakraborty/NurPhoto via Getty Images\nUpdated at 2:50 p.m. ET\nCelebrations by India's LGBTQ community stretched into the night Thursday, after the country's Supreme Court struck down a long-standing ban on gay sex in a unanimous decision that marks a watershed in the socially conservative country of 1.3 billion people.\nIt is a landmark ruling in a nation where attitudes about gays and lesbians are beginning to change — and the decision points to more questions of how India will extend equal protections to the LGBTQ community.\n\"No one can escape from their individuality,\" Chief Justice Dipak Misra, who is due to retire next month, said, reading from the judgment.\n\"We have to bid adieu to prejudices and empower all citizens,\" said Misra, who also spoke on behalf of four concurring judges.\nThe central courtroom, under the Indian Supreme Court's iconic ivory dome, was packed with dozens of plaintiffs, lawyers and activists. Members of the public squeezed past security guards.\nThe ban, Section 377 of the Indian penal code, outlawed any sex that goes \"against the order of nature.\" The law dates to 1861, when the country was under British colonial rule. The law is interpreted as a ban on all anal and oral sex, though it is generally used to prosecute men for having sex with other men.\n\"It felt validating, exciting, emotional — I cried,\" said one of the plaintiffs, Keshav Suri, a prominent hotelier in Delhi. \"And more importantly, I felt an acceptance of my existence.\"\nThursday's ruling reversed a 2013 decision rescinding a Delhi high court order that sought to decriminalize homosexuality.\n\"Consensual sex between adults in [a] private space, which is not harmful to women or children, cannot be denied as it is a matter of individual choice,\" the court said. \"Section 377 results in discrimination and is violative of constitutional principles.\"\nOutside on the Supreme Court lawn, cheers went up through a crowd of mostly young activists, some of whom had traveled across the country to be there. They unfurled rainbow flags and took selfies.\n\"I'm feeling what most Indians must have felt at the time of independence,\" said Yashwindar Singh, who was wrapped against the sun in a multicolored scarf. He hadn't slept the night before, in anticipation.\n\"This is the dawn of freedom for me,\" he said.\nOne of the plaintiffs, Arif Jafar, was arrested in 2001 and charged with \"promotion and abetment of crime\" and criminal conspiracy under Section 377. He had been standing near a train station, handing out condoms with cartoons that demonstrated how to use them. He was beaten by police and spent 47 days in jail.\nThe law had also been a means to blackmail or assault gay and transgender people.\nIn India's largest city, Mumbai, a nonprofit group called the Humsafar Trust, which advocates for queer rights, hung a rainbow curtain across the facade of its office. Workers handed out rainbow flags and broke out into cheers.\n\"A golden morning has dawned! The era of 377 is gone!\" they chanted in the local language, Marathi.\nThe hearing fell on a rare day of sunshine in both Delhi and Mumbai, near the end of a torrential monsoon season.\n\"I was considered as a criminal just because the person with whom I wanted to make love was of the same gender,\" said Ankit Bhuptani, a gay rights activist and founder of the Gay and Lesbian Vaishnava Association. \"I am no longer a criminal now.\"\nIn recent years, pride parades have become more common in Indian cities, though they are not always understood, The Washington Post reports:\n\" 'Many watching the modest pride parade in Bhubaneswar did not understand what the slogans and posters meant. 'This is against society,' said Benudhar Baliavsingh, upon learning the purpose of the march. 'What's good about this?' \"Another puzzled onlooker was more positive when he was told the meaning of the rainbow flag. 'This is good. If people love each other freely, they will live together happily. They won't fight,' he said.\"\nFurkan Latif Khan is an NPR producer in New Delhi; Sushmita Pathak is an NPR producer in Mumbai.","url":"https://www.npr.org/2018/09/06/644970751/indias-supreme-court-strikes-down-ban-on-gay-sex"}
