{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:23:15","date_modify":"2018-10-30 18:23:15","date_publish":"2015-01-06 20:10:24","description":"At least 40 conservative groups in Indiana have signed onto an agenda for education reform that will be submitted to the state’s lawmakers Tuesday. Among the top planks of the coalition’s platform are cutting regulations for schools that agree to accept school choice vouchers and freedom to reject the state’s rebranded Common Core-aligned standards. |","filename":"data/vaneerConsumption/IndianaConservativesCoalitionSchoolChoiceWithStringsAttachedNotConservative.json","image_url":"https://media.breitbart.com/media/2014/12/Pence-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_06__1540923795.html","title":"Indiana Conservatives’ Coalition: ‘School Choice’ With Strings Attached Not ‘Conservative’","title_page":"Indiana Conservatives’ Coalition: ‘School Choice’ With Strings Attached Not ‘Conservative’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"At least 40 conservative groups in Indiana have signed on to an agenda for education reform that will be submitted to the state’s lawmakers Tuesday. Among the top planks of the coalition’s platform are cutting regulations for schools that agree to accept school choice vouchers and freedom to reject the state’s rebranded Common Core-aligned standards.\nThe coalition’s “Platform for Educational Empowerment” was launched by the grassroots organization Hoosiers Against Common Core, a group working to defeat federal overreach into education.\nAccording to a news release sent to Breitbart News, the coalition of groups will be urging Indiana lawmakers to address these priority issues in the new legislative session:\n[R]educing regulations on voucher-accepting schools; Freedom in testing and choice of non-Common Core-aligned/rebranded standards; Forgoing a renewal of Indiana’s federal No Child Left Behind waiver; Greater protection of student data; Empowering parents, as opposed to government-funded institutions, when it comes to the care of children too young for kindergarten; Equalizing basic per-pupil student funding for school; Taking a stand against the College Board’s new and controversial AP U.S. History framework.\n“This is a comprehensive document that sets a path for obtaining academic excellence in our schools, by empowering and liberating those closest to the students – local districts, schools, teachers, and parents,” Dave Read of The Central Coalition, a group of 20 central Indiana Tea Parties, says. “It is the antithesis of the failed policies of the last several decades, all of which have been geared toward centralizing government control over Indiana schools. It makes the case for unshackling schools, rather than tightening the government vice-grip.”\nAt the end of December, the Associated Press reported that Gov. Mike Pence (R) has worked to turn Indiana’s school choice initiative into the most extensive in the nation. Since 2011, when the state’s school choice program was launched, nearly five percent of Indiana students are now using vouchers to enroll in either private or charter schools.\n“Pence is pushing to expand it this year by lifting income caps for families seeking state money to send their children to a private school,” AP also reported.\nAdditionally, Pence would like to see school choice extended to preschools as well, and wants more state funding for charter schools.\nHowever, while many establishment Republicans tout “school choice” programs as a sign of their “conservative” credentials, in reality, many rank and file conservatives are against the idea, especially when the vouchers come with “strings” attached, requiring the voucher-accepting schools to conform to state regulations.\n“As conservatives and activists who have been at the forefront of the education debates in Indiana for the past two years, the groups represented here reject recent media reports that the expansion of school vouchers is a major priority for grassroots conservatives,” said Heather Crossin, co-founder of Hoosiers Against Common Core. “School choice needs freedom to thrive; therefore our first priority is to free voucher schools from the stifling regulations which bind them. We believed it was important to set the record straight.”\nSimilarly, Erin Tuttle, also a co-founder of Hoosiers Against Common Core, added, “Education policy should be driven by parents informed by academia and business, not lobbyists and government agencies informed by their own interests.”\nAccording to the Platform for Educational Empowerment, while Indiana has the largest school voucher program in the country, the Center for Education Reform finds the Hoosier State is “ranked as the second-worst state in the country at ‘infringing on private school autonomy’ due to our voucher program’s many suffocating and unnecessary regulations.”\nThe Platform continues:\nBecause of these regulations, Indiana’s voucher program has one of the lowest private-school participation rates in the nation, at one-third of Indiana private schools. State lawmakers should cut all but the most basic of transparency requirements on private voucher schools, given that parents and private accreditation agencies already place higher demands on private schools than any bureaucrat can generate. Particularly egregious is the requirement that voucher-accepting schools administer the new assessment aligned to Indiana’s rebranded/Common Core-aligned standards. Even states such as Florida, a leader in national reform efforts, grant voucher-accepting schools freedom in the selection of standardized assessments, since tests direct curriculum. If true school choice is to be realized, this issue must be addressed so that parents may have genuine and competing curriculum options.\nAs Breitbart News reported last April, Hoosiers Against Common Core and other groups criticized Pence for signing on to “new” academic standards that are strikingly similar to the Common Core standards the state legislature had repealed.\n“For all Pence’s claims of federalism, his signature legislation removing Indiana from the Common Core required the new standards to ‘comply with federal standards to receive a flexibility waiver,’” Tuttle told Breitbart News at the time, quoting from the legislation that had Indiana abandon the Common Core. “His Hoosier process was predicated on satisfying the federal government, thus resulting in a rebrand of the Common Core.”\n“The rebrand of Common Core standards in Indiana shows the system is broken,” added Micah Clark, President of American Family Association of Indiana, one of the coalition’s groups. “We will continue to advocate for the liberation of schools from the Common Core-aligned system that still controls them from Washington, D.C.”\nDan Thiele, a conservative activist from northern Indiana, also stated in the press release, “We won’t produce better, brighter students by creating more government programs and expanding the role of government.”\nThe coalition’s education platform appears timely as Pence said the agenda for this legislative season will be focused on K-12 education, according to WTHR.com.\nThe report indicates, however, that one of Pence’s agenda items is to urge that the members of the state Department of Education be allowed to elect their chair. Currently, Indiana voters decide who chairs the State Board of Education by electing the Superintendent of Public Instruction.\n“By allowing for a vote of the board, it allows a sitting Governor to use appointments to stack the Board in his or her favor,” states WTHR.com.\nPence is considered to be a 2016 presidential hopeful and may be preparing for a run. IndyStar reported that one of Pence’s supporters in the state legislature, Indiana State Sen. Mike Delph (R), submitted legislation that would allow a state lawmaker or sitting governor to seek both re-election to state office and to a federal office at the same time.\n“I think it’s good for the state of Indiana to have a sitting governor in the national conversation and because of that I think it’s in our interest to make the obstacles and roadblocks for Pence as minimal as possible,” Delph said.\nBreitbart News phone and email requests to Gov. Pence’s office for comments received no response.","url":"https://www.breitbart.com/politics/2015/01/06/indiana-conservatives-coalition-school-choice-with-strings-attached-not-conservative/"}
