{"authors":["Mailonline India"],"date_download":"2018-10-23 03:51:00","date_modify":"2018-10-23 03:51:00","date_publish":"2017-03-10 13:45:54","description":"Maternity leave in India is set to double, allowing work from home and require employers to have crèches to improve maternal and child health and boost a declining female workforce.","filename":"data/vaneerConsumption/IndiaDOUBLESmaternityleavetoboostchildhealth.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/22/3E2654B700000578-0-image-a-7_1489184341250.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/indiahome_indianews_article-4301318_India-doubles-maternity-leave-boost-child-health-female-workforce_1540266660.html","title":"India DOUBLES maternity leave to boost child health","title_page":"India DOUBLES maternity leave to boost child health | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This image showing a hardworking mother in India carrying six bricks on her head while balancing her baby on her back has astonished Reddit users\nMaternity leave in India is set to double, allowing work from home and require employers to have crèches to improve maternal and child health and boost a declining female workforce.\nA bill approved by parliament late on Thursday increases fully paid leave to 26 weeks from 12 weeks, provides leave for adoptive mothers for 12 weeks, and facilitates a work from home option for nursing mothers.\nIt also mandates organisations with more than 50 employees to provide crèche facilities and allow the mother at least four crèche visits daily to look after and feed her child.\n'The maternity bill is a historic step as it puts us in the top countries in the world that care for new mothers,' Maneka Gandhi, minister for women and children, said on Friday.\n'With 26 weeks to care for their newborns, both mother and child will be healthier,' she said in a video on the ministry's Facebook page.\nIndia has high rates of child malnutrition, yet only 55 percent of mothers exclusively breastfeed for the first six months, compared with 70 percent in neighbouring Nepal and 76 percent in Sri Lanka.\nUnion minister Maneka Gandhi\nFemale participation in the workforce in India has been declining in recent years, with only 22 percent of women in working in the formal economy, well below the global average of 47 percent, according to UN Women.\nExtending maternity leave will encourage more women to return to work and help close the gender gap in the labour market, gender experts say, as many women reluctantly drop out of work because they need more time for their newborns.\n'Women should not have to choose between becoming a mother and keeping their job, and the amendment of the Maternity Bill is a landmark step in this direction,' said Poonam Muttreja, executive director of Population Foundation of India.\nThe move puts India among the most generous countries globally in terms of the amount of maternity leave afforded to women. Canada allows for 50 weeks, while Norway gives 46 weeks.\nThe government says the law will benefit 1.8 million women in the formal sector, but activists point out around 90 percent of the India's female workforce is in the unorganised sector, and remains unprotected and at risk of labour exploitation.\nThomson Reuters Foundation","url":"https://www.dailymail.co.uk/indiahome/indianews/article-4301318/India-doubles-maternity-leave-boost-child-health-female-workforce.html"}
