{"authors":["Press Association"],"date_download":"2018-10-23 01:59:57","date_modify":"2018-10-23 01:59:57","date_publish":"2017-04-26 12:49:09","description":"The International Cricket Council (ICC) deadline for submitting squads for the June tournament passed on Tuesday.","filename":"data/vaneerConsumption/IndiamissICCdeadlineforannouncingChampionsTrophysquad.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/12/wire-464963-1493207352-593_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447472_India-miss-ICC-deadline-announcing-Champions-Trophy-squad_1540259997.html","title":"India miss ICC deadline for announcing Champions Trophy squad","title_page":"India miss ICC deadline for announcing Champions Trophy squad | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"India are the only team to miss the deadline for announcing their squad for this summer’s Champions Trophy in England.\nThe International Cricket Council (ICC) deadline for submitting squads for the June tournament passed on Tuesday, with the seven other nations registering their 15-man line-ups.\nThe ICC are understood to remain relaxed about India’s delays, however, with Tuesday’s initial squad submission deadline focused chiefly around promotional purposes.\nICC Champions trophy on display (Andrew Matthews/PA)\nIndia are not expected to face any penalty for missing the initial deadline, provided they move forward and submit their squad as anticipated.\nIndia have continued to object to ICC plans to cut their share of international revenue in a bid to boost the coffers of developing nations.\nThe ICC’s meetings held this week in Dubai on the future of Test cricket will conclude on Thursday.\nThe eight-team Champions Trophy will start on June 1 at the Kia Oval, with England having named fit-again pace bowler Mark Wood in their squad.","url":"https://www.dailymail.co.uk/wires/pa/article-4447472/India-miss-ICC-deadline-announcing-Champions-Trophy-squad.html"}
