{"authors":[],"date_download":"2018-10-22 22:13:11","date_modify":"2018-10-22 22:13:11","date_publish":"2014-05-09 14:05:32","description":"State attorneys also filed a formal notice of appeal Thursday following U.S. District Judge Richard Young's ruling.","filename":"data/vaneerConsumption/IndianaAsksJudgetoStayGayMarriageRuling.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/431861/140509-indiana-gay-marriage-quasney-mn-1030_fc1bdd159d9be71204ab0675bd30bc07.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_indiana-asks-judge-stay-gay-marriage-ruling-n101371_1540246391.html","title":"Indiana Asks Judge to Stay Gay Marriage Ruling","title_page":"Indiana Asks Judge to Stay Gay Marriage Ruling","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIndiana has asked a federal judge to stay his order requiring it to recognize the out-of-state gay marriage of a lesbian couple in which one woman is terminally ill.\nState attorneys also filed a formal notice of appeal Thursday following U.S. District Judge Richard Young's ruling. Indiana will ask the U.S. 7th Circuit Court of Appeals to review Young's decision.\nYoung issued a preliminary injunction Thursday extending last month's temporary restraining order forcing the state to list Amy Sandler as the spouse of Niki Quasney on a death certificate after Quasney dies of cancer. It applies only to them, not to other gay couples who were legally wed elsewhere and are seeking to have Indiana recognize their marriages.\nThe Indiana attorney general's office said in court documents that recognition of the couple's marriage now could raise false hopes for other gay couples because courts might eventually uphold the state's gay marriage ban.\nYoung's order \"cannot conclusively resolve the legality of same-sex marriages,\" the state said in its stay request, and said the best course of action would to be to wait for a final decision.\nAttorneys for both sides expect the lawsuit and several like it throughout the country to eventually land before the U.S. Supreme Court. Rulings striking down gay-marriage bans in Michigan, Oklahoma, Utah and Virginia were already being appealed.\nQuasney and Sandler were among five couples challenging the ban with help from the national gay rights group Lambda Legal. Lambda Legal did not immediately return messages from The Associated Press seeking comment Friday.\n--The Associated Press","url":"https://www.nbcnews.com/news/crime-courts/indiana-asks-judge-stay-gay-marriage-ruling-n101371"}
