{"authors":["Associated Press"],"date_download":"2018-10-23 02:41:20","date_modify":"2018-10-23 02:41:20","date_publish":"2017-03-10 11:59:26","description":"NEW DELHI (AP) - A court in north India convicted 31 factory workers Friday for taking part in violence at a factory run by the country's largest automobile...","filename":"data/vaneerConsumption/Indiacourtconvicts31autoworkersin2012factoryriots.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/12/wire-196005-1489150152-761_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300996_India-court-convicts-31-autoworkers-2012-factory-riots_1540262480.html","title":"India court convicts 31 autoworkers in 2012 factory riots","title_page":"India court convicts 31 autoworkers in 2012 factory riots | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW DELHI (AP) - A court in north India convicted 31 factory workers Friday for taking part in violence at a factory run by the country's largest automobile manufacturer Maruti Suzuki that led to the death of a manager, news reports said.\nAnother 117 men were acquitted of charges of criminal conspiracy and murder, New Delhi Television reported. A dispute between workers and management at the factory in Manesar in Haryana state ended in rioting in 2012.\nThe subsidiary of Japan's Suzuki Motor Corp. operates two factories in India.\nFILE - In this Thursday, July 19, 2012, file photo, security guards stand near a burnt down reception block of Maruti Suzuki factory in Manesar, near New Delhi, India. A court in north India convicted 31 factory workers Friday for taking part in violence at a factory run by the country's largest automobile manufacturer Maruti Suzuki that led to the death of a manager, news reports said. (AP Photo/Saurabh Das, File)\nA day after the violence erupted in July the body of Avnish Kumar, the human resources manager, was found badly charred in a conference room. Dozens of managers and executives were also injured with several suffering broken bones, the company had said at the time.\nAccording to the company, the unrest erupted when a worker beat up a supervisor and the workers union prevented management from disciplining the worker and blocked exit gates.\nThe Maruti Suzuki Workers Union said a supervisor had abused and made discriminatory comments to a low-caste worker, leading to the violence.\nThe convicted workers have not been sentenced but could face life in prison.","url":"https://www.dailymail.co.uk/wires/ap/article-4300996/India-court-convicts-31-autoworkers-2012-factory-riots.html"}
