{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 20:10:26","date_modify":"2018-10-30 20:10:26","date_publish":"2015-03-27 12:36:08","description":"Indiana Governor Mike Pence has declared a public health emergency for areas of southeastern Indiana hit with 79 cases of H.I.V., the virus that causes AIDS.","filename":"data/vaneerConsumption/IndianaDeclaresHealthEmergencyoverHIVOutbreak.json","image_url":"https://media.breitbart.com/media/2015/03/ebola-hospital-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_27__1540930226.html","title":"Indiana Declares Health Emergency over HIV Outbreak","title_page":"Indiana Declares Health Emergency Over H.I.V. Outbreak","title_rss":"NULL","source_domain":"breitbart.com","text":"Indiana Governor Mike Pence has declared a public health emergency for areas of southeastern Indiana hit with 79 cases of HIV, the virus that causes AIDS.\nAuthorities say that illegal use of the drug Opana is at the heart of the HIV outbreak in Scott County, Indiana, an area situated just north of Louisville, Kentucky. Cases have reportedly been building since last December.\n“This is all hands on deck,” Gov. Pence said at a press conference on Thursday. “This is a very serious situation.”\nDespite past opposition to the idea, one of the governor’s first moves was to start a 30-day program to give out new needles for free to cut down on the needle-sharing common among low-income intravenous drug users, a practice that helps spread the infection.\nPence insisted that his temporary approval of the program was not a reversal of his general stance against needle-sharing policies. The governor said that allowing the temporary program was an emergency measure aimed at halting the outbreak but that he does “not support needle exchange as an antidrug policy.”\n“I do not enter into this lightly,” Pence said. “In response to a public health emergency, I’m prepared to make an exception to my long-standing opposition to needle exchange programs.”\n“I’m going to put the lives of the people of Indiana first,” Pence said, adding, “It’s a commitment to law and order, but it’s a commitment to compassion.”\nBut Scott County Sheriff Dan McClain said he hopes that the governor will follow the temporary program with more action.\n“I think if you’re just flat out giving out needles, you’re not going to do much good,” McClain said, adding that he hoped that some sort of education and testing program is initiated along with the needle-sharing program.\nIndiana State Health Commissioner Dr. Jerome Adams also addressed the matter of testing and education, saying, “Everything’s on the table. We’re going to look at what works best.”\nWith cases officially at 79, Indiana deputy health commissioner Jennifer Walthall said that cases could quickly jump to over 100. “We know that the culture of IV drug abuse is communal use. All it really takes is one HIV positive user,” she said.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com","url":"https://www.breitbart.com/politics/2015/03/27/indiana-declares-health-emergency-over-hiv-outbreak/"}
