{"authors":[],"date_download":"2018-10-22 23:25:49","date_modify":"2018-10-22 23:25:49","date_publish":"2017-03-16 06:48:23","description":"Allrounder Glenn Maxwell hailed his \"awesome\" skipper Steve Smith after the duo's 191-run partnership helped Australia post a formidable first innings total...","filename":"data/vaneerConsumption/IndiareplystronglyafterSmithsepicTestknock.json","image_url":"https://i.dailymail.co.uk/1/2017/03/17/13/wire-234189-1489756698-662_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319050_India-strike-Renshaws-brisk-start_1540250749.html","title":"India reply strongly after Smith's epic Test knock","title_page":"India reply strongly after Smith's epic Test knock | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Indian batsman Murali Vijay plays a shot during the second day of the third Test match against Australia in Ranchi on March 17, 2017\nAllrounder Glenn Maxwell hailed his \"awesome\" skipper Steve Smith after the duo's 191-run partnership helped Australia post a formidable first innings total against India in the third Test in Ranchi Friday.\nMaxwell, returning to the five-day side after nearly three years in the wilderness, cracked his maiden Test century on day two but it was Smith's unbeaten 178 that was the bedrock of the tourists' 451.\nOpener Lokesh Rahul led India's strong reply in the final session with the hosts ending the day on 120 for one. India still trail the visitors by 331 runs.\nMurali Vijay (42) and Cheteshwar Pujara (10) were batting at the break after Rahul was out caught behind for 67 off fast bowler Pat Cummins.\nRahul, who hit 9 fours in his 102-ball stay, registered his fourth fifty of the series to put on 91 runs with opening partner Vijay.\nBut it was the epic partnership between Smith and Maxwell that steered Australia to the highest total of the series so far after the visitors resumed the day on 299-4.\n\"I think we were 4-140 and luckily I had Steve at the other end who is quite experienced,\" Maxwell told reporters.\n\"He probably lifts the team to another level because he makes the game look so easy.\n\"We watch him play and everyone's in awe of the way he goes about it.\n\"So he's a guy that people feed off. And he's a very inspirational leader with the way he's gone about his career,\" Maxwell said of his skipper who is the world's top-ranked Test batsman.\nLeft-arm spinner Ravindra Jadeja claimed his eighth five-wicket haul in his 29th match to return with figures of 5-124.\nIndian bowler Ravindra Jadeja (2nd right) celebrates with teammates after he dismissed Nathan Lyon (unseen) during the second day of the third Test against Australia in Ranchi, on March 17, 2017\nJadeja ran out last man Josh Hazlewood (0) to deny Smith the chance of posting the second double century in his 53rd match of his career.\nSmith though registered the highest score by an Australian captain on Indian soil after surpassing Michael Clarke's 130 in Chennai in the 2012-13 series.\nIt was an especially satisfying innings for the Australian captain after the build-up to the match had been dogged by accusations that he had systematically abused the decision review system (DRS) in the last Test.\n- Making it count -\nThe 28-year-old Maxwell set the tone for Australia's continued dominance with his first Test ton in just his fourth game since making his debut in 2013.\nThe right-handed allrounder, known for his explosive limited-overs exploits, was delighted to make an impression in the five-day format.\n\"I was so happy to be able to walk back on the field with the Australian Test team with the Baggy Green cap on,\" said an elated Maxwell.\n\"I know how bad it felt when I played that last game in Dubai (in 2014) and didn't play again... I just wanted to make it count, every opportunity I get.\"\nIndia's plight was deepened by the absence of skipper Virat Kohli who has been off the field since Thursday afternoon with an injured shoulder.\nAustralian captain Steve Smith in action during the second day of the third Test against India in Ranchi, on March 17, 2017\nWhile vice-captain Ajinkya Rahane stood in as skipper, Kohli is expected to don the pads and bat in what remains a crucial Test for the hosts.\nFast bowler Umesh Yadav, who took three wickets, said that Kohli \"is fit to play\" after having taken to the nets and added that the pitch has more runs to offer.\n\"Difficult to stop runs on this wicket. They took four-and-half sessions to score 450. It's a 100-run-a-session wicket. We also made 120 today...Plus minus 20-30 runs, but we'll try to get there,\" said Yadav.\nThe series between the world's top two sides is tantalisingly poised at 1-1 with India needing at least a draw to have any chance of winning back the Border-Gavaskar Trophy.","url":"https://www.dailymail.co.uk/wires/afp/article-4319050/India-strike-Renshaws-brisk-start.html"}
