{"authors":[],"date_download":"2018-10-23 02:27:36","date_modify":"2018-10-23 02:27:36","date_publish":"2017-04-26 13:31:25","description":"Authorities in Indian-administered Kashmir on Wednesday ordered internet service providers to block popular social media services including Facebook, Twitter...","filename":"data/vaneerConsumption/IndianKashmirblockssocialmediaafterclashes.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/14/wire-465511-1493214105-225_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4447626_Indian-Kashmir-blocks-social-media-clashes_1540261656.html","title":"Indian Kashmir blocks social media after clashes","title_page":"Indian Kashmir blocks social media after clashes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kashmiri students clash with Indian government forces in central Srinagar's Lal Chowk on April 24, 2017\nAuthorities in Indian-administered Kashmir on Wednesday ordered internet service providers to block popular social media services including Facebook, Twitter and WhatsApp after an upsurge in violence in the region.\nThe local government said the services were \"being misused by anti-national and anti-social elements\" and should be blocked for one month or until further notice \"in the interest of maintenance of public order\".\nIt is the first time the government has taken such a step, although it regularly blocks the mobile internet signal in the volatile Kashmir valley.\nIndian-administered Kashmir has been tense since April 9, when eight people including seven students were killed by police and paramilitaries during by-election violence.\nAnti-India sentiment runs deep in the Kashmir valley, one of the world's most heavily militarised spots where most people favour independence or a merger with mainly Muslim Pakistan.\nClashes between rebels and government forces have become more frequent since the killing of a popular rebel leader, Burhan Wani, by security forces last July sparked widespread unrest.\nAuthorities responded by imposing a curfew, suspending mobile networks in large parts of the territory and seizing newspapers to try to quell protests.\nThey say social media are being used increasingly frequently to rally crowds which then attack government forces, often by throwing rocks at them.\nSocial media are also being used by both sides in the conflict to spread images and video footage in a growing war of information.\nA video released on social media sites earlier this month showed a man tied to a jeep being used as a human shield against stone-throwers by soldiers in Kashmir.\nThe 11-second clip went viral and has sparked outrage and heated debate about the role of the military.\nRights activists say Indian forces in Kashmir have been using human shields since the late 1980s, when an armed insurgency against Indian rule erupted across the territory.\nRoughly 500,000 Indian soldiers are deployed in the region, which has been divided between India and Pakistan since the end of British rule in 1947. Both claim the territory in its entirety.\nOn Wednesday student protesters took to the streets, clashing with government forces who used shotguns to disperse them.\nStudents have staged almost daily protests in recent weeks, chanting slogans demanding freedom from India and throwing rocks at police.\nThey were angered by a raid earlier this month on a college in the southern district of Pulwama in which police tried to detain the alleged ringleaders of earlier protests.\nEarlier this week the chief minister of Jammu and Kashmir, the northern state that administers the area, held talks with Indian Prime Minister Narendra Modi on the developing crisis.\nMehbooba Mufti said after the meeting that dialogue was needed to calm the situation.","url":"https://www.dailymail.co.uk/wires/afp/article-4447626/Indian-Kashmir-blocks-social-media-clashes.html"}
