{"authors":[],"date_download":"2018-10-22 20:49:25","date_modify":"2018-10-22 20:49:25","date_publish":"2014-06-03 08:04:21","description":"New Prime Minister Narendra Modi had entrusted to Gopinath Munde the crucial task of spearheading his government's battle on poverty in the countryside.","filename":"data/vaneerConsumption/IndiasRuralDevelopmentMinisterDiesDealingBlowtoModi.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/483161/140603-munde-0355_4c241772ce51e4b5c2dbca89be3e90c4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_indias-rural-development-minister-dies-dealing-blow-modi-n120991_1540241365.html","title":"India's Rural Development Minister Dies, Dealing Blow to Modi","title_page":"India's Rural Development Minister Dies, Dealing Blow to Modi","title_rss":"NULL","source_domain":"nbcnews.com","text":"Gopinath Munde, 64, was on his way to the airport for a victory rally in his home state of Maharashtra, on India's west coast, when his sedan was hit by a car. He died later in hospital.\n\"My tributes to a dynamic leader whose premature demise leaves a void hard to fill,\" Modi said in a tweet, amid a flurry of tributes from allies and political opponents. \"Condolences to Munde's family. We stand by them in this hour of grief.\"\nModi had entrusted to Munde the crucial task of spearheading his government's battle on poverty in the countryside, home to more than half of India's population of 1.2 billion, but which contributes just 14 percent of gross domestic product in Asia's third-largest economy.\nThe minister was sitting in the back of his Maruti SX4 sedan when it was hit on the side by a Tata Indica saloon, whose driver police said was in custody. Munde's driver and a personal assistant survived.\nIndia is the world's capital of road deaths, thanks to a lethal brew of poor road planning, weak law enforcement, a surge in trucks and cars, and a flood of untrained drivers.\nMore than 230,000 people were killed on Indian roads in 2010, or a rate of almost 19 deaths per 100,000 people. As many as 15 people died in road accidents every hour in India in 2012 with 53 more injured, the National Crime Records Bureau says.\nMunde becomes at least the third senior Indian politician to die in a car crash in recent times.","url":"https://www.nbcnews.com/news/world/indias-rural-development-minister-dies-dealing-blow-modi-n120991"}
