{"authors":["Frances Martel"],"date_download":"2018-10-30 19:03:05","date_modify":"2018-10-30 19:03:05","date_publish":"2015-05-14 19:46:37","description":"An Indian national returned from Iraq after ISIS abducted him and 39 others, whom he claims are dead. His government denies their deaths.","filename":"data/vaneerConsumption/IndiasGovernmentDeniesReportISISSlaughtered39IndianCaptives.json","image_url":"https://media.breitbart.com/media/2015/05/Harjit-Masih-Indian-escaped-ISIS-Twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_14__1540926185.html","title":"India's Government Denies Report ISIS Slaughtered 39 Indian Captives","title_page":"India's Government Denies Report ISIS Slaughtered 39 Indian Captives | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Harjit Masih, a 25-year-old Indian national, returned from Iraq to his native country this week after he and 39 other Indians working in Iraq were abducted by the Islamic State. He claims he survived by playing dead after being missed in a firing squad lineup, and that his colleagues are all dead, but the Indian government is denying the report, insisting the men are still alive.\nMasih, a Christian from Punjab, held a press event in his hometown of Mohali upon returning and told his story. “The ISIS came and kidnapped us and took us to another place. We were 40 Indians and about 50 Bangladeshis. They assured us that our passports would come and we will be allowed to leave for India,” he said. Instead, Masih narrated, they kidnapped the men, locked them in a room, “and started firing.” He added, “Everyone around me fell. I kept lying there and later escaped.”\nMasih was allegedly kept in “Indian custody” in Iraq until his return home on Thursday.\nThe Indian government is strongly denying Masih’s version of events. Minister of External Affairs Sushma Swaraj told reporters that “there is no reason to believe” Masih, and that the Indian government was not going to stop searching for the missing workers. “We are hopeful that we will be able to find them and bring them back home. I have eight different sources who are saying they are alive,” Swaraj said on Thursday.\n“Earlier we had six sources who told us that the Indians are alive. Now we have two more sources to corroborate the same. Out of these two, one is so solidly reliable that there is no question of not believing. They have very clearly said that all the 39 Indian are alive,” she added.\nThe 40 Indian nationals were kidnapped on June 11, 2014, it is believed, while working in Mosul, Iraq. Mosul had been recently taken over by the Islamic State and remains under ISIS control. At the time, the Indian government responded to the abduction with reservation, stating that it was not yet clear what the captors’ intentions were or even who they were. It is now universally accepted that they were kidnapped by Islamic State jihadists, however.\nIt is estimated that at the time of the kidnapping, India had 10,000 workers living in Iraq and “hundreds of thousands” in neighboring countries in the Middle East, and that it imported 25 million tons of oil from Iraq annually.","url":"https://www.breitbart.com/national-security/2015/05/14/indias-government-denies-report-isis-slaughtered-39-indian-captives/"}
