{"authors":[],"date_download":"2018-10-23 00:27:05","date_modify":"2018-10-23 00:27:05","date_publish":"2017-04-26 10:01:26","description":"An award-winning Hindi film exploring women's sexuality that was blocked by India's censorship board for being \"lady-oriented\" has been cleared for release...","filename":"data/vaneerConsumption/IndianfilmLipstickUnderMyBurkhaclearedforrelease.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/10/wire-464141-1493197288-590_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446896_Indian-film-Lipstick-Under-My-Burkha-cleared-release_1540254425.html","title":"Indian film 'Lipstick Under My Burkha' cleared for release","title_page":"Indian film 'Lipstick Under My Burkha' cleared for release | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"India's censors have a long history of barring movies and cutting scenes, especially those deemed too racy or at risk of causing religious offence\nAn award-winning Hindi film exploring women's sexuality that was blocked by India's censorship board for being \"lady-oriented\" has been cleared for release by an appeals tribunal, officials said.\nIndia's Central Board of Film Certification (CBFC) sparked uproar in February when it refused to certify \"Lipstick Under My Burkha\", in a case that again raised fears over creative freedom in the country.\nDirector Alankrita Shrivastava appealed the decision and in a statement published late Tuesday the Film Certification Appellate Tribunal (FCAT) ordered the CBFC to release the movie, albeit with a few cuts.\n\"There cannot be any embargo on a women-oriented film or one containing sexual fantasies and expression of the inner desires of women,\" the FCAT said, according to the Press Trust of India news agency.\nIt ruled that \"Lipstick Under My Burkha\" was suitable for anyone aged 18 or over and should be given an adult certificate.\nIt accepted several cuts offered by the filmmakers and ordered a reference to \"prostitutes\" to be removed, as well as ruling that the length of some sex scenes should be reduced.\n\"Of course I would have loved no cuts, but the FCAT has been very fair and clear. I feel that we will be able to release the film without hampering the narrative or diluting its essence,\" Shrivastava told AFP.\nThe movie tells the secret lives of four women -- including a college student who wears a burkha, and a 55-year-old who rediscovers a sex life after the death of her husband.\nIt won an award at the Tokyo International Film Festival last year and aired at the MAMI Mumbai Film Festival in October. It also appeared at a film festival in Los Angeles earlier this month.\nThe CBFC had ruled that the movie was \"lady oriented, their fantasy above (sic) life\".\nIt complained of \"sexual scenes, abusive words, audio pornography (phone sex) and a bit sensitive touch about one particular section of society\", implying that it might offend Muslims.\nThe ruling was widely mocked on social media while Shrivastava described it as an \"assault on women's rights\".\nIndia's censors have a long history of barring movies and cutting scenes, especially those deemed too racy or at risk of causing religious offence.\nIn 2015 the CBFC blocked the release of a toned-down version of \"Fifty Shades of Grey\" and deemed two James Bond kissing scenes unsuitable for an Indian audience.","url":"https://www.dailymail.co.uk/wires/afp/article-4446896/Indian-film-Lipstick-Under-My-Burkha-cleared-release.html"}
