{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-23 00:17:52","date_modify":"2018-10-23 00:17:52","date_publish":"2016-01-11 09:14:53","description":"The girl, just 14, was shot twice and dumped in the well on the outskirts of New Delhi, but luckily, villagers later heard her screams and came to the rescue.","filename":"data/vaneerConsumption/Indianteenagertellshowshewasrepeatedlyrapedbyagangofmen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/2799966600000578-0-image-a-40_1452503608304.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393600_Indian-teenager-tells-repeatedly-raped-gang-men-held-two-weeks-shot-dumped-well_1540253872.html","title":"Indian teenager tells how she was repeatedly raped by a gang of men","title_page":"Indian teenager tells how she was repeatedly raped by a gang of men | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An Indian teenager has told how she was held captive for two weeks by a gang of men, raped, then shot and dumped in a well on the outskirts of New Delhi.\nThe victim, reportedly aged 14, was allegedly abducted on November 22 while walking to a market in western Delhi, in the latest case of sexual violence in the Indian capital.\nSpeaking of her heartbreaking ordeal to the NDTV news network, the teenager said she was held in a 'dark room' where three attackers took turns to rape her over a two-week period.\nScroll down for video\nThe victim, reportedly aged 14, was allegedly abducted on November 22 while walking to a market in western Delhi, in the latest case of sexual violence in the Indian capital, repeatedly raped, shot, then dumped in a well and left to die\n'After a fortnight of repeated abuse, one night they said they will let me go. They put me in the car and drove to a store to buy alcohol and then parked the car near a well,' she said.\n'They told me they will let me go but as I took a few steps back, they fired two shots. The first bullet hit my bone. I didn't feel a thing, my body just went numb. But after the second one I fainted.'\nShe woke shivering and wet inside the well where she said she had been left for dead.\n'When I regained consciousness... I could see a bullet in my chest, so I just yanked it out,' she said, showing a wound on her chest.\nNearby villagers pulled her out on December 6 after hearing her screams, before she was rushed to hospital.\nSeveral men have been arrested over the attack, according to local media reports.\n'I want the rapists to be hanged. No one should go through what I did,' she said.\nThe fatal gang-rape of a student on a bus in Delhi in 2012 shone a global spotlight on frightening levels of violence against women.","url":"https://www.dailymail.co.uk/news/article-3393600/Indian-teenager-tells-repeatedly-raped-gang-men-held-two-weeks-shot-dumped-well.html"}
