{"authors":[],"date_download":"2018-10-23 01:39:55","date_modify":"2018-10-23 01:39:55","date_publish":"2016-01-11 12:46:56","description":"An Indian court Monday sentenced 35 sailors, including several from Britain, Estonia and Ukraine, for illegally entering Indian waters carrying weapons aboar...","filename":"data/vaneerConsumption/Indiasentences35crewofUSantipiracyship.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z8ek-48qEJGFphM8d437f0aaf924e3827-47_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393833_India-sentences-35-crew-US-anti-piracy-ship_1540258795.html","title":"India sentences 35 crew of US anti-piracy ship","title_page":"India sentences 35 crew of US anti-piracy ship | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"India sentences 35 crew of US anti-piracy ship\nAn Indian court Monday sentenced 35 sailors, including several from Britain, Estonia and Ukraine, for illegally entering Indian waters carrying weapons aboard a US-operated anti-piracy boat in 2013.\nA judge in India's southern state of Tamil Nadu ordered all 35 crew present in the court to serve five years in jail, the prosecutor in the case, S Chandrasekar told AFP.\n\"The convicted crew members can approach the Madras High Court within 30 days for appealing against the verdict,\" Chandrasekar said.\nIndia's coast guard intercepted the Seaman Guard Ohio anti-piracy ship off the coast of Tuticorin in 2013\nIndia's coast guard intercepted the ship off the coast of Tuticorin in Tamil Nadu in October 2013 and arrested and charged the crew for failing to have the proper paperwork to carry weapons in Indian waters.\nAlmost all of the crew, comprising six Britons, three Ukrainians, 14 Estonians and 12 Indians, were given bail in 2014 on the grounds they remained in the state capital Chennai.\nThe captain, a Ukrainian, and another officer from Britain were refused bail and remained in prison.\nUS maritime security firm AdvanFort, which owns the Seaman Guard Ohio vessel, denies the charges against its crew, saying all firearms on board were legally purchased and properly documented.\nThe southern tip of India is close to major trading routes from Asia to Europe and many cargo ships have armed guards and vessels to deter pirates.\nThe British High Commission in Delhi told AFP it would continue to provide consular assistance to all six of its nationals but \"we cannot interfere in another country's judicial process\".\nAn Indian court quashed charges laid against the Seaman Guard Ohio crew in July 2014, but the Supreme Court overturned that ruling the following year and ordered their trial.\nJudge N Rajasekar on Monday found the crew guilty of illegally carrying weapons and entering Indian waters without a visa.\nIn addition to the jail sentence, the judge fined each crew member 3000 rupees ($45).","url":"https://www.dailymail.co.uk/wires/afp/article-3393833/India-sentences-35-crew-US-anti-piracy-ship.html"}
