{"authors":["Associated Press"],"date_download":"2018-10-23 00:02:12","date_modify":"2018-10-23 00:02:12","date_publish":"2016-01-28 13:31:21","description":"NEW DELHI (AP) — India took a step toward modernizing its cities on Thursday by awarding 20 with funds to solve problems from shoddy sewage treatment to snar...","filename":"data/vaneerConsumption/Indiacitiesgetfundstotacklewoesfromsewagetotraffic.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:90c6e6b5dd314b5da6a7febb309b333c-2vdWmEltwXfba0ce28e63291f59c-942_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420787_Indian-cities-tackle-woes-sewage-traffic-snarls_1540252932.html","title":"India cities get funds to tackle woes from sewage to traffic","title_page":"India cities get funds to tackle woes from sewage to traffic | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"India cities get funds to tackle woes from sewage to traffic\nNEW DELHI (AP) — India took a step toward modernizing its cities on Thursday by awarding 20 with funds to solve problems from shoddy sewage treatment to snarled traffic.\nThe government eventually plans to spend $15 billion to remake 100 cities over five years, Urban Development Minister Venkaiah Naidu said. The first 20 to receive financing include the capital of new Delhi, the western cities of Pune, Jaipur and Ahmadabad, and the southern cities of Chennai and Kochi.\nSince Prime Minister Narendra Modi first touted his vision for creating so-called smart cities across India, there has been little clarity over what \"smart\" actually means beyond a better life for the country's 400 million city dwellers.\nFILE - In this June 12, 2015 file photo, an Indian motorist rides past an overflowing roadside garbage-dumping site in New Delhi, India. India has taken its first multibillion-dollar step toward rebuilding its metro areas as so-called smart cities by awarding 20 with funds to solve problems from shoddy sewage treatment to constant power outages and snarled traffic. (AP Photo/Altaf Qadri, File)\nWhile India has rapidly urbanized in recent decades, most towns and cities still lack basic infrastructure like running water or stable electricity. Many feature huge slums housing millions of poor.\nThe cities were selected based on their proposals after more than 15 million Indian citizens weighed in on which problems should be solved first, marking \"a paradigm shift\" in having India's development guided by the public, Naidu said.\nSome sent ideas to city officials via social media. Others entered local contests for designing logos or writing essays. Bhubaneswar, the capital of the eastern state of Orissa, unfurled a 10-kilometer-long (6-mile-long) canvas banner across the city and invited residents to scroll down their suggestions.\n\"We are big believers in the power of competition to spur bottom-up creativity, citizen engagement, and stronger proposals,\" said James Anderson of Bloomberg Philanthropies, which advised the government on the program.\nSome of the proposals mentioned a need for better transportation, sewage treatment, security or trash management. Many envisioned funding through public-private partnerships.\nThe Rajasthani heritage city of Jaipur wants to improve waste management, while New Delhi plans to install underground fiber-optic cables for more Internet connectivity. The traffic-clogged city of Chennai has plans for improving public transportation as well as dealing with disasters like last year's devastating floods.\nFILE - In this June 12, 2015 file photo, a young Indian garbage collector unloads waste at a roadside garbage dumping site overflowing with filth in New Delhi, India. India has taken its first multibillion-dollar step toward rebuilding its metro areas as so-called smart cities by awarding 20 with funds to solve problems from shoddy sewage treatment to constant power outages and snarled traffic. (AP Photo/Altaf Qadri, File)","url":"https://www.dailymail.co.uk/wires/ap/article-3420787/Indian-cities-tackle-woes-sewage-traffic-snarls.html"}
