{"authors":["Chris Weller"],"date_download":"2018-10-30 21:29:24","date_modify":"2018-10-30 21:29:24","date_publish":"2016-12-20 00:00:00","description":"In the wake of Indian Prime Minister Narendra Modi announcing a ban on certain forms of cash, the country is giving citizens some incentive to go digital.","filename":"data/vaneerConsumption/Indiausesmassivelotteryofelectronicmoneytosolvecashcrisis.json","image_url":"https://amp.businessinsider.com/images/57580ee191058422008c756a-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_india-electronic-lottery-cash-crisis-2016-12_1540934964.html","title":"India uses massive lottery of electronic money to solve cash crisis","title_page":"    India uses massive lottery of electronic money to solve cash crisis - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Indian Prime Minister Narendra Modi cheers the crowd during a campaign rally ahead of the Maharashtra state elections in Mumbai, India, Thursday, Oct.9, 2014. AP/Rajanish Kakade Nearly a month after Indian Prime Minister Narendra Modi announced that 86% of his country's cash would become worthless due to suspicions of rampant illegal activity, the country has devised a digital solution to the widespread shortage of paper money.\nBeginning on Christmas Day, the Indian government will hold a daily lottery for anyone who buys into a new system of electronic payments.\nThe prize amounts vary from roughly $15 to $1,500, culminating in an April 14 draw for more than $1.5 million.\nModi's solution is an attempt to move India into the 21st century. While the US does about half of all transactions electronically, and Sweden about 98%, India only does about 5% of its payments digitally.\n\"Our objective is to make digital payments a huge mass movement in this country,\" Amitabh Kant, CEO of the state-run think tank NITI Aayog, told CNN. NITI Aayog is the organization that came up with the idea for an electronic-payment lottery.\nTo enter the lottery, citizens must enroll in the new system and obtain an ID number. Each day, the government will pull 15,000 numbers from the pool for $15 prizes. There will also be larger draws held each week, which vary from $73 to $1,472, and a final set of six draws next spring for between $17,000 and $1.5 million.\nIf all goes to plan, the lottery will persuade large swaths of India's billion 1.25 people to give up their dependency on cash, which is currently in short supply.\nOn November 8, Prime Minister Modi issued a ban on all 500 and 1,000 rupee notes — a ban that took effect just four hours later — over fears that most of the currency was earned illegally or used for illicit means. He called it \"black money,\" and has given Indians until December 30 to trade in their old notes for new ones.\nMass panic followed the announcement. There was an outpouring of people to ATMs to take out notes that were still legal tender. Even for people who could get the larger 2,000 rupee notes, customers and business owners alike complained that they couldn't make change. Many have feared how they'd pay for food and bills, as millions of Indians do not have bank accounts.\nGiven the country's lack of infrastucture for such a digital migration, economists believe consumers will need to wait a while before they see any tangible benefits to the cash ban. So far the only groups that have profited from it are e-payment companies. In poorer areas, entire markets have shut down.\nOver the next several months, Modi and his cabinet hope the lottery will smooth over what has been a tumultuous rollout. In order to rid India of its reliance on cash, the government sees a rocky start as the first step toward embracing its economic future.","url":"https://www.businessinsider.com/india-electronic-lottery-cash-crisis-2016-12"}
