{"authors":[],"date_download":"2018-10-22 21:50:15","date_modify":"2018-10-22 21:50:15","date_publish":"2016-01-28 09:05:52","description":"Indonesia said Thursday a decision by the country's biggest telecoms provider to block Netflix could be reversed if the global video-streaming giant obeyed l...","filename":"data/vaneerConsumption/IndonesiatelecomsfirmblocksNetflixoverlocallawscensorship.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g6hq-4vVdYopwYQ7f641721b07ab11df5-31_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420582_Indonesia-telecoms-firm-blocks-Netflix-local-laws-censorship_1540245015.html","title":"Indonesia telecoms firm blocks Netflix over local laws, censorship","title_page":"Indonesia telecoms firm blocks Netflix over local laws, censorship | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Indonesia telecoms firm blocks Netflix over local laws, censorship\nIndonesia said Thursday a decision by the country's biggest telecoms provider to block Netflix could be reversed if the global video-streaming giant obeyed local laws, particularly on \"porn\" and \"radicalism\".\nThe decision Wednesday to bar access to Netflix came just weeks after the California-based firm announced it was expanding its Internet TV services to 130 new markets, including Indonesia.\nState-owned Telekomunikasi Indonesia, or Telkom, said Netflix had not met existing regulations such as obtaining a local business licence and opening an in-country office, complaints echoed by officials.\nIndonesia's biggest telecoms provider decided to block Netflix after the company said it was expanding its Internet TV services to 130 new markets ©Ryan Anson (AFP/File)\nConcerns that films provided by Netflix could evade scrutiny by Indonesia's Film Censorship Board also appear to have been a driving force behind the ban.\nIsmail Cawidu, a spokesman for the ministry, said online companies were forbidden from broadcasting content that went against the \"public interest\", and Netflix was no exception.\n\"They must follow the rules. No porn, no radicalism and no copyright infringement,\" he told AFP.\n\"We informed them a while ago, and we are still waiting for Netflix's response.\"\nAll films screened in Indonesia are approved first by the Film Censorship Board, with offending sections removed.\nPornographic websites are also blocked, and blogs and other online content deemed either extremist or inappropriate are routinely shut down by the communications ministry.\nNetflix is not the first Internet-based company to run into regulatory obstacles in Indonesia, with video-sharing website Vimeo banned, and ride-sharing service Uber struggling to set up in Southeast Asia's largest economy.\nBut it is a blow for the streaming pioneer, which boasts 70 million subscribers and just this month heralded its expansion into 130 new markets as the birth of a new global Internet TV network.\nTelkom and government officials insist the block is only temporary, and would be lifted if Netflix obtained the required permits and agreed to censorship requirements.\n\"Just comply and we will reopen access,\" Telkom spokesman Arif Prabowo told AFP.\n\"We are not talking about the business, this is just a matter of abiding by the law.\"\nNetflix could not be immediately reached for comment.\nSome Telkom competitors were capitalising on the ban Thursday, promoting their Netflix packages in a bid to lure Telkom customers angered by the move.\n\"I felt cheated,\" Devi Asmarani, a Jakarta-based writer, told AFP after buying a new TV a fortnight ago specifically to enjoy Netflix.","url":"https://www.dailymail.co.uk/wires/afp/article-3420582/Indonesia-telecoms-firm-blocks-Netflix-local-laws-censorship.html"}
