{"authors":["John Hayward"],"date_download":"2018-10-30 20:09:34","date_modify":"2018-10-30 20:09:34","date_publish":"2017-04-23 23:10:35","description":"The Indonesian military filed suit over a story claiming protests against Jakarta's governor were part of a plot to overthrow the president.","filename":"data/vaneerConsumption/IndonesianMilitaryFilesLawsuitoverHoaxCoupStory.json","image_url":"https://media.breitbart.com/media/2015/12/police-officers-with-riot-gear-Jakarta-Indonesia-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_04_23__1540930174.html","title":"Indonesian Military Files Lawsuit over 'Hoax' Coup Story","title_page":"Indonesian Military Files Lawsuit over 'Hoax' Coup Story","title_rss":"NULL","source_domain":"breitbart.com","text":"The Indonesian military has filed a police report over a story originating at The Intercept, which claimed protests against the governor of Jakarta were actually part of a plot to overthrow President Joko Widodo.\nThe police complaint was actually filed against an Indonesian news site called Tirto, which translated The Intercept article with the blessing of its original author, Allan Nairn. The Indonesian military described the story as a “hoax.”\nIndonesia has aggressive laws against libel and “hate speech.” Another current case involves an online media company sued for allegedly spreading “false news” about the governor of Yogyakarta in the form of an article accusing the governor of dismissing ethnic Chinese citizens as “traitors” who are “not suitable to become leaders in the archipelago.”\nThe Intercept article found objectionable by the Indonesian military was titled, “Trump’s Indonesian Allies in Bed with ISIS-Backed Militia Seeking to Oust Elected President.” The article charges that associates of the U.S. president – including the vice speaker of the Indonesian House of Representatives and billionaire Hary Tanoe, who is building Trump resorts in Bali and Jakarta – worked with several active and retired Indonesian generals on a plot to overthrow President Joko Widodo.\nThe article describes an elaborate conspiracy to use massive Muslim protests against Christian (and ethnic Chinese) Governor Basuki “Ahok” Tjahaja Purnama, who is on trial for insulting Islam, as a tool for destabilizing the Widodo government. The coup plotters were accused of making common cause with groups linked to the Islamic State to achieve their political objectives.\nBasuki, considered a sure bet for re-election last year, was just defeated by a Muslim opponent in the gubernatorial race in a campaign where religion was used as a political weapon against him. Some Indonesian Islamist groups wanted him not just voted out of office or prosecuted for blasphemy, but executed. On the bright side, prosecutors are now asking for only two years’ probation on his blasphemy charges.\nThe Intercept article claims these coup plotters value their connections to Trump and his deregulation adviser Carl Icahn, who has holdings in a mining company with an Indonesian branch, but grudging concedes “it is unknown whether Trump or Icahn have any direct knowledge of the Indonesian coup movement.”\nAccording to The Intercept, the conspirators wanted to whip up gigantic protests against Basuki that would spiral out of control, either making Widodo look so ineffectual that the public would turn against him, or unleashing so much chaos that the military would have a pretext to step in and seize control. The masterminds of this effort are purportedly willing to accept bloodshed on the scale of the 1965 Indonesian coup d’etat, which led to hundreds of thousands of deaths.\nPresident Widodo has vowed to crack down on hoaxes, “fake news,” and “slander, hatred, and rude words on social media,” all of which have surged during the Islamist campaign against Basuki and the subsequent, bitter Jakarta gubernatorial contest.\nWhatever the truth of the Intercept’s coup allegations, observers say Widodo’s governing coalition has grown fragile. A Reuters analysis notes that Basuki was a major political ally of the president, having once served as deputy governor when Widodo was the governor of Jakarta.\nThe Islamist passions stoked by the anti-Basuki demonstrations are bad news for Widodo, a moderate Muslim committed to secular government. Reuters notes that a surprising number of voters said they voted for Basuki’s opponent Anies Baswedan primarily because Baswedan was a Muslim. A sizable number of voters from Widodo’s political coalition turned against Basuki, especially members of the explicitly Islamic parties in the Widodo coalition.\nThe result was the incumbent Christian governor’s decisive defeat by his Muslim challenger, even though Basuki notched a 76 percent approval rating as governor, in a poll taken just over a week before the election.","url":"https://www.breitbart.com/national-security/2017/04/23/indonesian-military-files-lawsuit-over-hoax-coup-story/"}
