{"authors":[],"date_download":"2018-10-23 01:09:02","date_modify":"2018-10-23 01:09:02","date_publish":"2017-04-26 11:11:22","description":"Indonesia´s football association pledged Wednesday that work permits for foreigners would be issued faster after high-profile moves by former English Premier...","filename":"data/vaneerConsumption/IndonesiavowonpermitsforfootballersafterEssiendebacle.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/11/wire-464437-1493201484-669_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4447106_Indonesia-vow-permits-footballers-Essien-debacle_1540256942.html","title":"Indonesia vow on permits for footballers after Essien debacle","title_page":"Indonesia vow on permits for footballers after Essien debacle | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former West Ham United striker Carlton Cole signed last month with Persib Bandung, one of Indonesia's best clubs\nIndonesia´s football association pledged Wednesday that work permits for foreigners would be issued faster after high-profile moves by former English Premier League stars Michael Essien and Carlton Cole were almost scuppered by red tape.\nThe two were signed with great fanfare last month by Persib Bandung, one of the country's best clubs, in a boost for Indonesian football as it seeks to bounce back from a FIFA suspension and launch a new league.\nBut they were banned from playing last week just days after making their debuts in Liga 1's first season when authorities discovered they did not have work permits required by foreigners in Indonesia.\nThe ban was short-lived -- they were granted permits a few days later and played at the weekend, with Essien immediately making his mark by scoring with a header in a 2-2 draw against PS TNI.\nHowever the debacle proved embarrassing for Indonesian football officials after years of problems, from the creation of a rebel association to foreign players dying after going unpaid and being unable to afford medical care.\nThe football association, known as the PSSI, said they had worked with the government to speed up the permit-issuing process in the latest case, and pledged to ensure it was fast in future.\n\"In the future we will work on the permits as soon as possible,\" Edy Rahmayadi, chairman of the football association, known as the PSSI, told AFP.\nHe said the body would work with clubs when they signed players from overseas, as well as the government, to guarantee the process is smooth.\n\"The clubs have to ensure proper planning from an early stage,\" added association deputy chairman Joko Driyono.\nWork permits for foreigners in Indonesia typically take around a month to process.\nSeventy-four foreigners currently work in Indonesia's football industry as players or coachers, according to Driyono.\nCole, who is English, used to play for Chelsea and West Ham.\nIndonesia's new top-flight Liga 1 replaces an old top-level league, which was halted in 2015 due to a row between the government and the PSSI which led FIFA to ban the country from playing internationally for a year.\nThe new league and big-name signings are a major boost for football in Southeast Asia's biggest nation.","url":"https://www.dailymail.co.uk/wires/afp/article-4447106/Indonesia-vow-permits-footballers-Essien-debacle.html"}
