{"authors":["Lucy Mae Beers For Mailonline"],"date_download":"2018-10-22 23:19:01","date_modify":"2018-10-22 23:19:01","date_publish":"2017-04-26 07:18:43","description":"The two-year-old boy who became an international sensation after he was found chain-smoking in an Indonesian village has kicked the habit, lost weight and is the 'champion' of school.","filename":"data/vaneerConsumption/Indonesianchainsmokingboynowschoolchampion.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D4A7400000578-0-image-a-2_1493193809696.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446390_Indonesian-chain-smoking-boy-2-school-champion_1540250341.html","title":"Indonesian chain-smoking boy now school 'champion'","title_page":"Indonesian chain-smoking boy now school 'champion' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The two-year-old boy who became an international sensation after he was found chain smoking in a remote village has kicked the habit, lost weight and is now the 'champion' of his primary school.\nAldi Rizal shot to fame in 2010 after he was discovered in a poor village in Sumatra, Indonesia, puffing 40 cigarettes a day while riding his tricycle.\nJust two years later the little boy managed to quit with the help of the Indonesian government providing special rehabilitation, but he replaced his smoking addiction with food and drastically gained weight.\nNow, at nine-years-old, Aldi has managed to keep away from cigarettes, lose weight and excel at school.\nThe two-year-old boy (pictured) who became an international sensation after he was found chain smoking in a remote village has kicked the habit, lost weight and is now the 'champion' of his primary school\nAt nine-years-old, Aldi Rizal has managed to keep away from cigarettes, lose weight and excel at school\nAldi's shocking smoking addiction led to the Indonesian government launching a campaign to tackle the problem\nAldi's shocking smoking addiction led to the Indonesian government launching a campaign to tackle the problem with many picking up the habit in smaller villages.\n'At first when we were weaning Aldi off the cigarettes he would have terrible tantrums,' Aldi's mother Diane Rizal, 32, said in 2013. 'But now he doesn't want them.'\nBut the little boy quickly developed a huge appetite without the 40 cigarettes a day, eating fatty foods and consuming three cans of condensed milk each day.\nMs Rizal said Aldi would bang his head on the wall for extra meals and found it was much harder to stop him getting his hands on more food.\nAldi Rizal shot to fame in 2010 after he was discovered in a poor village in Sumatra, Indonesia, puffing 40 cigarettes a day\n'At first when we were weaning Aldi off the cigarettes he would have terrible tantrums,' Aldi's mother Diane Rizal, 32, said in 2013\nThe family managed to wean the little boy off cigarettes through a rehabilitation program, but he then developed an addiction to food\nMs Rizal said Aldi would bang his head on the wall for extra meals after he stopped smoking, but has since lost weight and loves school\nAldi's family decided to take him to a nutritionist for medical checks and then started him on a strict diet in 2010\nThe little boy weighed 24 kilograms at just five years old - almost six kilograms above the recommended weight for a child his age\nAldi's family decided to take him to a nutritionist for medical checks and then started him on a strict diet.\nThe little boy weighed 24 kilograms at just five years old - almost six kilograms above the recommended weight for a child his age.\nPaediatric specialist Dr William Nawawi said the smoking could have also contributed to Aldi's weight issues.\n'The blood will not be able to break glucose from food. This will make Aldi become bigger and bigger,' he said.\nBut after four years on a strict diet of fresh fruit and vegetables, Aldi managed to lose most of the weight and has now turned his focus to finishing grade four.\nPaediatric specialist Dr William Nawawi said the smoking could have also contributed to Aldi's weight issues\nAfter four years on a strict diet of fresh fruit and vegetables, Aldi managed to lose most of the weight and has now turned his focus to finishing grade four\nAldi used to smoke 40 cigarettes a day when he was just two years old at his remote Indonesian village\nNow the nine-year-old is on a healthy path and enjoys spending time with his friends at school","url":"https://www.dailymail.co.uk/news/article-4446390/Indonesian-chain-smoking-boy-2-school-champion.html"}
