{"authors":["Charles Ortel"],"date_download":"2018-10-30 21:46:33","date_modify":"2018-10-30 21:46:33","date_publish":"2015-03-05 06:22:04","description":"A firestorm has erupted over the way Hillary Clinton trusted Huma Abedin and other aides to interact electronically on government business.","filename":"data/vaneerConsumption/InEmailScandalsHillaryClintonHumaAbedinEconomicsofPoliticalPrivilegeFinallyTakeCenterStage.json","image_url":"https://media.breitbart.com/media/2015/03/Huma-Abedin-Hillary-Clinton-AFP1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_04__1540935993.html","title":"In Email Scandals, Hillary Clinton, Huma Abedin, Economics of Political Privilege, Finally Take Center Stage","title_page":"In Email Scandals, Hillary Clinton, Huma Abedin, Economics of Political Privilege, Finally Take Center Stage | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A veritable firestorm has erupted over how Hillary Clinton trusted confidante Huma Abedin and other close aides to interact electronically on government business in risk-prone ways that, until now, were insulated from proper scrutiny, between January 21, 2009 and February 1, 2013, while Mrs. Clinton served as Secretary of State.\nThe former First Lady, Senator, and Secretary of State holds much bankable appeal as a Democratic candidate in 2016. Unfortunately for her, Americans are truly tired of scandals and you simply cannot take the mess out of Clintonland, no matter how hard the many whitewashers may try.\nDespite the best efforts of stalwart Hillary Clinton defenders, the email scandal definitely appears to have legs that seem solid enough to undercut the air of invulnerability once surrounding the presumed presidential frontrunner.\nWhat makes this latest turn quite different than others is that key information now sought by empowered investigators, once exposed, could finally explain several unsolved and gripping mysteries.\nThese include what actually happened in Libya and in Egypt from September through November 2012, why the Clinton Foundation financial disclosures remain so opaque, and how principals at Teneo Holdings made such astounding progress in business against determined competitors, likely on the strength of political connections.\nWhy missing electronic communications matter\nFacts matter and electronic records do not disappear as readily as paper ones seem to.\nNow, subpoenas are finally flying as part of a professional investigation led by experienced and hard-nosed former prosecutor and Congressman Trey Gowdy, whose record should give any who doubt his tenacity and integrity massive pause.\nAnd make no mistake, this scandal is not simply about apparent failure to follow sound communication and record-keeping procedures within the Department of State.\nCongressman Gowdy will get the emails and any other relevant information many have sought so long with little success.\nSimultaneously, energized organs in mainstream media will push investigators to unravel what almost was wholly obscured, thereby exposing the seamy underbelly of modern politics, where monetizing access to those holding high elected and appointed office yields outsized personal gain.\nConnecting the dots: Abedin, Teneo, and the hidden money trail\nFor more than a decade, Hillary Clinton has worked closely with an accomplished woman named Huma Abedin, whose antecedents and foreign ties have never been investigated closely enough.\nIn 2012, when several members of Congress asked tough questions about Huma Abedin, Democrats and even some Republicans took vocal umbrage against those seeking verifiable answers about Ms. Abedin’s background and paramount loyalties.\nLuckily for Hillary Clinton and Barack Obama, events conspired against those seeking the truth about Ms. Abedin until well after the November 2012 election.\nThen, trouble started in May 2013, when it was revealed that Huma Abedin had been granted status in June 2012 as a “Special Government Employee,” enabling her to hold down multiple jobs in the private sector while she also collected a State Department paycheck.\nWho approved this arrangement, over what time period, and what considerations were reviewed as Ms. Abedin gained and held these forms of employment?\nBack in 2013, critics could only growl about Ms. Abedin’s failure to make full disclosure of her employment arrangements even as her disgraced husband flirted with attempts to resuscitate his political fortunes.\nOne of Ms. Abedin’s extra jobs was working for a business now called Teneo Holdings, that rocketed from obscurity in a matter of months after June 2011 to become, in theory, a major merchant bank and advisory firm.\nA second extra job was helping in the Clinton Family philanthropic efforts, while a third was assisting Hillary Clinton in a personal capacity.\nAs these belated disclosures emerged regarding employment arrangements with Huma Abedin, concerns (which seem ongoing) heightened about the management and finances of the Clinton Family charities.\nThe person who controls access to America’s president holds enormous power as well as the ability to garner substantial wealth in a “post-presidency”—this is made plain by the meteoric rise of Douglas Band, a man who owes much of his financial fortune to his years serving Bill Clinton, especially after the 42nd president exited the White House in disgrace.\nAwaiting the final verdict on Hillary Clinton for 2016\nLast week, perhaps it seemed premature to suggest that HIllary Clinton might not even take the Democratic party nomination for president next year.\nIn recent days, one fair-minded journalist, Ron Fournier, has grown increasingly and justifiably frustrated with Hillary Clinton and with a family he has grown to know well since their days together in Little Rock, well before big-time.\nIn the end, investigators and historians will unwrap the nest of evidence concerning good and odiferous works carried out in the name of Bill, Hillary, and Chelsea Clinton.\nMeanwhile, the “know-nothing” wing of the Democrat party, those so invested in the seemingly inevitable coronation story, refuse to recognize the numerous braying, incontinent donkeys in the room—Americans who might be coaxed to vote against any nominated Republican are well and truly overdosed on Clinton ordure.\nUltimately for the Clintons, the punchline in 2015 will be worse than what happened in 2008. Big money Democrats are not going to blow billions on an imploding, scandal-ridden frontrunner, so they will move quickly to a Plan B that, coincidentally (of course), may also suit Valerie Jarrett to a tee.\nBill, Hillary, and Chelsea Clinton have already profited enough from “public service.” If they wish to spare themselves even more pain than is necessary, they will limit their own liability by beating a retreat from the domestic political stage soon, before they learn how expensive it can become to defend, against evidence, arguments that these sharp people ever earned honest livings.","url":"https://www.breitbart.com/politics/2015/03/04/in-email-scandals-hillary-clinton-huma-abedin-economics-of-political-privilege-finally-take-center-stage/"}
