{"authors":["Quoctrung Bui"],"date_download":"2018-10-23 05:25:23","date_modify":"2018-10-23 05:25:23","date_publish":"2014-08-12 00:00:00","description":"Yes, inequality is rising in the U.S. But it's falling when you look at all of humanity.","filename":"data/vaneerConsumption/InequalityIsFallingOnPlanetEarth.json","image_url":"https://media.npr.org/assets/img/2014/08/12/istock_000014833613large_wide-e984c487a508d3fa6611962e74ee4fff5f418df9.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_money_2014_08_12_338347325_inequality-is-falling-on-planet-earth_1540272323.html","title":"Inequality Is Falling On Planet Earth","title_page":"Inequality Is Falling On Planet Earth : Planet Money : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Inequality Is Falling On Planet Earth\nInequality is rising in the U.S. You know this. As the graph below shows, incomes since 1988 have been flat for poor and middle-class people, and rising for the upper-middle-class and, especially, for the wealthy.\nNotes Income includes household wages and government transfers. Special thanks to Colin Gordon for the analysis of Census data.\nA bunch of causes are commonly cited for rising inequality. One is globalization: Competition from foreign workers has kept a lid on wages for low-skilled workers, and added to gains for some at the top of the income ladder.\nBut globalization is also responsible for a decline in worldwide income inequality. In the past few decades, globalization has led to rising incomes for billions of very poor people, mostly in Asia. The economists Branko Milanovic and Christoph Lakner point this out in an interesting new paper on global income distribution.\nIn their paper, they ask a basic question: what does global inequality look like in a world without borders? What happens if you look at the change in income over the past few decades for everyone on Earth?\nNotes Income is defined as per-capita income.\nAs the graph shows, people in the middle of the global income distribution have had the biggest gains (in percentage terms). Most of those people are workers in China, India and, to a lesser extent, other developing countries in Asia.\nThe U.S., Europe and Japan combined — most of the developed world — represent a small share of the world population. The average American would fall at the far right of this graph, at the top of the global income distribution.","url":"https://www.npr.org/sections/money/2014/08/12/338347325/inequality-is-falling-on-planet-earth"}
