{"authors":["Frances Martel"],"date_download":"2018-10-30 20:32:47","date_modify":"2018-10-30 20:32:47","date_publish":"2014-07-28 19:42:46","description":"The Kurdish Peshmerga forces-- a co-ed military considered the most organized military force in Iraq-- have been largely responsible for limiting the |","filename":"data/vaneerConsumption/InFightforIndependenceIraqiKurdsLooktoAmericaforSupport.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Peace/2014/Middle-East/Iraq/kurdish-soldier-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2014_07_28__1540931567.html","title":"In Fight for Independence, Iraqi Kurds Look to America for Support","title_page":"In Fight for Independence, Iraqi Kurds Look to America for Support | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Kurdish Peshmerga forces– a co-ed military considered the most organized military force in Iraq– have been largely responsible for limiting the advance of the Islamic State in the nation. As the Kurds seek independence from a flimsy Iraqi government, they look toward the West, and America especially, for support.\nIn a riveting report from Vice‘s Sam Koebrich, Kurds in Erbil, Iraq– the capital of Iraqi Kurdistan and among the most stable cities in the nation– tell the magazine that they appreciate the work of American soldiers in stabilizing the country and ridding it of Saddam Hussein. Erbil, Koebrich writes, was largely protected by American forces during most of the second Iraq War, and Kurds were able to establish international trade in their region and keep it relatively free of the influence of jihadists, Baathist Saddam Hussein supporters, or the Shi’ite Iraqi government.\nThe result of this Kurdish support for America, in pictures, is what appears to be an interminable Fourth of July happening in a country the left in the media argue has been destabilized and inured into hating the United States. Kitschy American flag t-shirts and car decals abound, as do portraits of George W. Bush. Koebrich himself experienced it: “On one occasion a man told me he went to California on vacation for two weeks–‘the best two weeks in my whole life.'”\nThe Kurdish tie to America is especially important in their fight against the Islamic State, formerly the Islamic State of Iraq and al-Sham (ISIS). Under George W. Bush, the Kurdish regions of Iraq, particularly Erbil, were kept at a distance from the main fighting between Hussein’s forces and what became the Maliki government. That distance allowed the Kurdish regions of Iraq to flourish, both economically and culturally.\nIn the fight against ISIS, the Peshmerga are in the front lines, but the Obama administration appears wary to align with them or support their claims for independence. While Vice President Joe Biden urged the creation of a free Kurdish state in 2006, the Obama administration has been less than enthusiastic about the idea, with Secretary of State John Kerry instead insisting on “broad-based, inclusive government” for all under the current Iraqi state. Nor was the White House, according to reports, receptive to the idea of giving the Kurds a major role in holding back Islamic State mujahideen– a grave error in retrospect given not only the importance of the Peshmerga in holding back ISIS, but also the importance of Kurdish cities like Erbil in providing refuge for the thousands of Assyrian Christians ISIS expelled from Mosul.\nThe Kurdish Regional Government has decided to put Obama’s ambivalence to the test this week, sending a tanker with $100 million worth of oil to Galveston, Texas to provide to an as-yet-unknown buyer. As the Wall Street Journal explains, having an American oil company accept an oil shipment from the Kurdish government could increase the Kurds’ appearance of sovereignty internationally as well as incense the Iraqi government, which has previously threatened to blacklist nations that buy Kurdish oil. The tanker challenges Obama to stake his claim with either the Kurdish government or the crippled national government under al-Maliki.\nWhether the Kurds finally leave this current crisis in Iraq as a sovereign nation remains to be seen– as does whether the Obama administration will finally define its position on the Kurdish government, or simply stand back and watch the fireworks between ISIS and the Peshmerga through the eyes of surveillance drones. Many Kurds still hope Americans will support them– a Kurdish group even established a White House petition for Kurdish independence– and the ethnic minority has little choice but to continue filling the power vacuum left by a crippled Iraqi military.","url":"https://www.breitbart.com/national-security/2014/07/28/in-fight-for-independence-iraqi-kurds-look-to-america-for-support/"}
