{"authors":["Will Martin"],"date_download":"2018-10-30 22:23:52","date_modify":"2018-10-30 22:23:52","date_publish":"2016-12-13 00:00:00","description":"The ONS' latest data for consumer price inflation in the UK dropped on Tuesday morning.","filename":"data/vaneerConsumption/InflationspostBrexitsurgeisback.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_brexit-aftermath-uk-inflation-data-for-october-2016-2016-12_1540938232.html","title":"Inflation's post-Brexit surge is back","title_page":"    Brexit aftermath: UK Inflation data for November 2016 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"China Daily China Daily Information Corp - CDIC / Reuters UK inflation rose to its highest level since late 2014 in November, according to the latest data released by the Office for National Statistics on Tuesday.\nThe ONS said that the UK's consumer price index — the key measure of inflation — was 1.2%, up from 0.9% in October, and ahead of the 1.1% forecasted by economists.\nCore inflation figures, which strip out volatile goods like oil and food, rose to 1.4% in the month, up from 1.2% at the previous reading, and ahead of the predicted 1.3%.\nHere is how November's data looks like as part of the long-term trend:\nONS\nDespite increasing, inflation remains well below the long-term trend — as the chart shows, inflation was more than 5% as recently as 2011 — however after two years of negligible price growth, 1.2% is still substantial.\nNovember's reading is also a big jump from the shock fall witnessed in October, when prices dropped thanks largely to a fall in the price of food and non-alcoholic beverages. November's rise was driven largely by an increase in fuel prices, which itself was caused by the growth of oil prices in the month. As the ONS' release notes \"the upward contribution to the change in the rate came from motor fuels, with petrol prices rising by 1.6 pence per litre between October and November this year.\"\nHere is the chart, breaking down UK inflation by sector:\nONS\nPrior to the last few months, inflation stayed between -0.1% and 0.1% for 10 months due to a collapse in oil prices and a supermarket price war that led to slashed prices.\nPrices started to pick up following the Bank of England's decision to cut interest rates in the aftermath of the UK's vote to leave the European Union, and the fall in the value of the pound.\nExpectations remain that inflation will jump sharply in the coming months as the effects of the weaker pound — which has fallen roughly 14% since the Brexit vote, and sits at a 31-year low against the dollar— trickle into the real economy, pushing up the price of goods.\nAs a result, the Bank of England has said that it is willing to tolerate an overshoot in inflation beyond its 2% target over the coming months in order to protect jobs.\nInflation will more than double to overshoot the Bank of England's 2% inflation target in 2018, driven up by a falling currency, the central bank said in its quarterly Inflation Report in November.\n\"In the central projection, inflation rises from its current level of 1% to around 2.75% in 2018, before falling back gradually over 2019 to reach 2.5% in three years' time,\" the Bank said.\nConcerns about an increase in the price of goods and services in the UK since the Brexit vote came sharply into focus for many UK consumers in October, when Britain's largest supermarket Tesco briefly stopped stocking products made by Unilever, including Marmite, Colman's Mustard, and Hellmann's mayonnaise.\nThose fears then returned when it was announced that Toblerone would make its bars smaller in the UK in response to the increasing price of raw materials post-Brexit.\nSterling was largely unmoved on the news, but did tick a little higher against the dollar, as the chart below shows:","url":"https://www.businessinsider.com/brexit-aftermath-uk-inflation-data-for-october-2016-2016-12"}
