{"authors":["Charlie Nash"],"date_download":"2018-10-30 18:23:30","date_modify":"2018-10-30 18:23:30","date_publish":"2018-08-08 19:07:59","description":"InfoWars has become the number one trending app on the Google Play Store, following the mass purge of Infowars and Alex Jones from Big Tech platforms including Google's YouTube, Facebook, and many others.","filename":"data/vaneerConsumption/InfowarsBecomes1TrendingApponGooglePlayStore.json","image_url":"https://media.breitbart.com/media/2018/07/wi/ap/23/f91943_newtown-shooting-inforwars-46404-in-17-2017-file-photo-infowars-host-alex-e1533755270458.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2018_08_08__1540923810.html","title":"Infowars Becomes #1 Trending App on Google Play Store","title_page":"Infowars Becomes #1 Trending App on Google Play Store | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"InfoWars has become the number one trending app on the Google Play Store, following the mass purge of Infowars and Alex Jones from Big Tech platforms including Google’s YouTube, Facebook, and many others.\nThe app is currently at the top of Google Play Store’s trending list, beating all mainstream media outlets.\nThe Apple version of its App is also currently at number three on Apple’s App Store most popular news app chart, behind Twitter and News Break.\nIn the U.K., Infowars is at number four on the App Store’s free news chart, beating Sky News, Mail Online, the Sun, the Guardian, BuzzFeed, and the Telegraph. In Canada, Infowars is at number three under the same chart, just behind Twitter and Reddit.\nOn Tuesday, Infowars was the fourth most popular free app on the App Store, overtaking CNN, which prompted CNN to lobby for the app’s removal.\nFollowing a pressure campaign led by CNN, Infowars was banned from Facebook, Google’s YouTube, Spotify, Apple podcasts, Pinterest, Linked In, MailChimp, and Disqus this week.","url":"https://www.breitbart.com/tech/2018/08/08/infowars-becomes-1-trending-app-on-google-play-store/"}
