{"authors":[],"date_download":"2018-10-22 22:31:42","date_modify":"2018-10-22 22:31:42","date_publish":"2014-06-10 03:44:06","description":"Millennials are overwhelmed by debt and student loans are their biggest financial concern.","filename":"data/vaneerConsumption/InfographicOverHalfofMillennialsLivePaychecktoPaycheck.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/498386/140610_cover_6235ef9d2f4893ec213cefbc8a1e4443.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/nightly-news_infographic-over-half-millennials-live-paycheck-paycheck-n127021_1540247502.html","title":"Infographic: Over Half of Millennials Live Paycheck to Paycheck","title_page":"Infographic: Over Half of Millennials Live Paycheck to Paycheck","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPresident Obama signed an executive order Monday that will allow five million additional student-loan borrowers to put a ceiling on their monthly payment plans. The measure is an expansion of a 2010 law, and some question whether these changes go far enough in easing student-loan debt, which now tops $1.2 trillion.\nFour in 10 millennials say they are overwhelmed by debt, and student loans are their biggest financial concern, a study by Wells Fargo found. Less than half of millennials are saving for retirement, and 81 percent of those not currently saving say that they need to pay off their debts before they can begin to do so.\nBut despite the growing burden of debt, most millennials are optimistic – 72 percent said they are confident in their future.\nWells Fargo surveyed more than 1,400 millennials aged 22-32 to conduct this study.\nPresident Obama, who has held Twitter town halls in the past, will hit social media Tuesday by appearing on Tumblr for the first time to talk about student loans at 4 p.m. EDT.","url":"https://www.nbcnews.com/nightly-news/infographic-over-half-millennials-live-paycheck-paycheck-n127021"}
