{"authors":["Jeff Poor"],"date_download":"2018-10-30 18:23:28","date_modify":"2018-10-30 18:23:28","date_publish":"2018-08-08 17:19:27","description":"Tuesday on Fox News Channel's \"The Ingraham Angle\" during her show's monologue, host Laura Ingraham questioned the motives of tech companies, including | Video","filename":"data/vaneerConsumption/IngrahamonTechCorporateCensorshipThisIsntAboutAlexJonesItsAboutFreedomandAccesstoInformation.json","image_url":"https://media.breitbart.com/media/2018/08/Ingraham88.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2018_08_08__1540923808.html","title":"Ingraham on Tech ‘Corporate Censorship’: ‘This Isn’t About Alex Jones — It’s About Freedom and Access to Information’","title_page":"Ingraham on Tech 'Corporate Censorship': 'This Isn't About Alex Jones --- It's About Freedom and Access to Information' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tuesday on Fox News Channel’s “The Ingraham Angle” during her show’s monologue, host Laura Ingraham questioned the motives of tech companies, including Facebook and Apple, banning Alex Jones and Infowars from its platforms.\nIngraham argued the focus shouldn’t be on what was banned but the idea that the public’s freedom to make these choices on their own was being infringed upon.\nPartial transcript as follows:\nINGRAHAM: Remember what Facebook CEO Mark Zuckerberg told the Senate hearing back in April?\n(BEGIN VIDEO CLIP)\nMARK ZUCKERBERG, CEO, FACEBOOK: There’s certain content that clearly, we do not allow. Hate speech, terrorist content, nudity, anything that makes people feel unsafe in the community. From that perspective, that’s what we generally try to refer to what we do as a platform for all ideas.\n(END VIDEO CLIP)\nINGRAHAM: A platform for all ideas. Really? Over the past few months, Facebook and other tech giants have given us ample reasons to doubt that proclamation. The latest example started early yesterday morning when Apple pulled several podcasts associated with the controversial and incendiary Alex Jones. Facebook followed suit, unpublishing four of Jones’ pages, claiming that the videos on those pages violated that hate speech policy. Hours later YouTube decided it wasn’t going to miss out on all that censorship fun and YouTube suspended the Alex Jones channel with its 2.4 million subscribers.\nWell, it’s easy to dismiss concerns about big techs actions all coordinated it seems to shut down Jones, because of course, he’s the media’s poster child for conspiracy theories. But this isn’t about Alex Jones. This is about freedom and our access to information from the sources we as individuals trust and like. If big tech can control the information flow, then they can also perhaps even influence the outcome of the midterms and even future presidential elections.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: Essentially, Alex Jones has been deleted, digitally deplatformed from these websites, you wonder if he’ll have any influence going forward because these private companies do have an incredible amount of control over the internet.\n(END VIDEO CLIP)\nINGRAHAM: And that’s the point, controlling who has a voice and who doesn’t on these monster platforms is tantamount to limiting speech. And as you’ll see in a moment, it’s also viewpoint discrimination. Back in February, Facebook launched a new algorithm that would cause top conservative pages to see a dramatic drop in traffic. And this included personal pages, by the way. President Trump’s Facebook page saw a 45 percent drop. Diamond and Silk said their content was similarly blocked on Facebook.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED FEMALE: Facebook, along with other social media sites have taken aggressive actions to silence conservative voices such as ourselves by deliberately restricting and weaponizing our page with algorithms that censor and repress our free speech.\n(END VIDEO CLIP)\nINGRAHAM: Next it was YouTube, who let conservative influencers build up an audience for years, only to end up limiting their channel temporarily, demonetizing them with no warning at all. This has happened to conservative commentators like Ben Shapiro, Dave Ruben and Dennis Prager.\nFor many on the left, the view seems to become if you can’t beat them, prevent them from speaking. Just look at what’s happened on the conservative speakers on college campuses. And after liberal radio hosts flopped on Air America — remember them — well, some Democrats thought to revive the fairness doctrine to snuff out conservative talk radio. Thankfully that went nowhere. But now they’ve moved onto the internet and squelching political speech there.\nA leaked proposal circulating amongst democrats outlines a detailed plan to take over the internet by regulating digital platforms and purging content they deem harmful or inaccurate. In other words, information they don’t like. They would require social media users to be tracked and labeled according to how reasonable their content is deemed to be. Democrat Senator Chris Murphy even hinted at this yesterday, tweeting, Infowars is a tip of a giant iceberg of hates and lies, that uses sites like Facebook and YouTube to tear our nation apart. These companies must do more than take down one website. The survival or our democracy depends on it.\nHow dramatic. Translation: the survival of the democratic party depends on it. There’s an old saying in TV and radio that content is king. Same goes for the internet. If they can shut down political speech on the grounds that it’s hateful, you have to ask where does this end? If you want to see hate, check out some of the comments on my Twitter feed after the show tonight. Then you’ll see hateful.\nWhy do leftists always seem to escape big techs censors? I don’t know Louis Farrakhan comes to mind. He’s a casual racist, of course, and an anti-Semite who called white people “potential humans,” praised Hitler and blamed Jews for 9/11.\nWell, he’s still standing tall on his Facebook page — has a million followers. And what about those who traffic in violence? If Facebook really cares about standards or safety, I don’t think they would be granting ANTIFA chapters from coast to coast where their pages can plug their next thuggish beat down of conservatives with their black hoods and all. And by the way, if there’s so much concern over conspiracy theories like the one Alex Jones peddles, well, do moments like this give social media kings pause?","url":"https://www.breitbart.com/video/2018/08/08/ingraham-on-tech-corporate-censorship-this-isnt-about-alex-jones-its-about-freedom-and-access-to-information/"}
