{"authors":["Kirk Siegler"],"date_download":"2018-10-22 21:43:10","date_modify":"2018-10-22 21:43:10","date_publish":"2016-12-01 00:00:00","description":"The state is a Republican stronghold, but even Idahoans have doubts on whether President-elect Donald Trump can help the timber industry recover after job cuts and a series of mill closures.","filename":"data/vaneerConsumption/InIdahoLumberCountryTrumpVotersWaitToSeeIfHeCanJumpstartJobs.json","image_url":"https://media.npr.org/assets/img/2016/12/01/siegler-tri-pro-mill-1_wide-84bd7863543299f1096a7f27fb19217e2a67a2ea.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_12_01_503984040_in-idaho-lumber-country-trump-voters-wait-to-see-if-he-can-jumpstart-jobs_1540244590.html","title":"In Idaho Lumber Country, Trump Voters Wait To See If He Can Jumpstart Jobs","title_page":"In Idaho Lumber Country, Trump Voters Wait To See If He Can Jumpstart Jobs : NPR","title_rss":"NULL","source_domain":"npr.org","text":"In Idaho Lumber Country, Trump Voters Wait To See If He Can Jumpstart Jobs\nEnlarge this image toggle caption Kirk Siegler/NPR Kirk Siegler/NPR\nA few weeks before the election, the Tri-Pro lumber mill in north Idaho shut down. It was the second mill to close in the area in six months, putting more than a hundred people out of work.\nWhile that's big economic loss for any community, it was especially tough for the tight-knit town of Orofino and its 3,000 or so residents.\n\"It's going to be a struggle, quite honestly,\" says Mike Reggear, the supply manager and only employee left on the Tri-Pro payroll.\nThe mill officially closed Oct. 4, after operating on the site in one incarnation or another for nearly 60 years. The shuttered lumberyard is now eerily quiet as Reggear ties up some loose ends; the old mill, kilns and saws are ready to be hauled out.\n\"There were living-wage jobs [with good benefits] that have now been lost,\" Reggear says, shaking his head.\nEnlarge this image toggle caption Kirk Siegler/NPR Kirk Siegler/NPR\nThe story behind Tri-Pro's closure is an all-too-familiar one lately in north Idaho: Reggear says there just wasn't a steady enough supply of logs available locally to keep the sawmill running and profitable. The amount of federal land open to logging has dwindled since the 1980s, and imports from Canada are cheaper.\nBut just like any economic story in rural America today, it's more complicated than that. And even in Idaho's deeply conservative timber country, there are mixed feelings over whether President-elect Donald Trump can do much to turn things around.\nChanging Times\nTimber towns like Orofino, situated along railroad lines and rivers, were put on the map more than a hundred years ago when it seemed like there was a limitless supply of timber in the Northwest woods. The federal government — and specifically the U.S. Forest Service, run as an extension of the U.S. Department of Agriculture — was in the business of actively promoting logging.\nEnlarge this image toggle caption Kirk Siegler/NPR Kirk Siegler/NPR\nThe environmental mood of the country is significantly different today. So is the economy — mechanization, for instance, has meant that fewer people are needed to log in the woods or work in the mills.\nAt best, logging is a seasonal occupation, says Jerry Spencer, \"so you try to diversify a little bit — because you can't live on [work] eight months a year.\"\nOne night over Coors Lights at the Ponderosa Restaurant, Spencer says he feels lucky he still can find work as an independent contractor, logging in the woods when he can.\nSpencer and one of his buddies had been splitting time between north Idaho and the oil fields in North Dakota and Wyoming, where they drove trucks. Then oil prices tanked.\nHe's not too eager to talk politics, but Spencer says he's glad Donald Trump won.\nU.S. Indiana Working-Class Voters Hope Trump Will Deliver On Jobs Promises Indiana Working-Class Voters Hope Trump Will Deliver On Jobs Promises Listen · 3:52 3:52\n\"I'm Republican, almost everybody in this county's Republican,\" he says. \"It's a logging, resource-based county and that's how it is.\"\nNow that the election is over, Spencer says he's hopeful things can get better — \"but I'm not going to bet on it, just yet.\"\nThe main reason for his pessimism, he says, is that even if Trump were to open up more federal land to logging, there are hardly any mills left here to handle all that wood.\nStill, the president-elect's talk of returning to a time when natural resources — mining, timber and oil — were king resonates here.\n\"Those resources is what built this country,\" Spencer says. \"You can say what you want, but it was all built off of mining, timber, oil ... the United States wasn't built off of tech companies.\"\nUrban-Rural Divide\nIn the rural West, it's not unusual to hear jabs like that directed at city dwellers. But the divide seems even more pronounced since the election.\nFolks in Orofino are proud of their heritage as loggers and miners, but today, Clearwater County routinely has one of the highest unemployment rates in Idaho.\nEconomy Idaho Counties' Economic Fate Tied To Industry Idaho Counties' Economic Fate Tied To Industry Listen · 5:14 5:14\nIn Orofino's quaint, small downtown, there are for-lease signs in empty store fronts. Locals will tell you they have to work two or three jobs — at the school, the Best Western, or for one of the local outfitters. Some are forced to commute 40 miles downriver to Lewiston.\nStill, when it comes to the latest mill closure, many of the same locals grudgingly say they saw this coming for years.\n\"The first thing you do is cuss and kick the ground and rant a little bit, but the second is, you pull yourself up by those bootstraps and figure, OK, where do we go from here?\" says Chris St. Germaine.\nIn the 1980s, St. Germaine moved to Orofino to take a job with the U.S. Forest Service after ski-bumming her way across the West. Today she runs the county's one-person Office of Economic Development.\nSt. Germaine's arrival in Orofino coincided with the time that the amount of federal lands available for logging started shrinking. The local timber economy subsisted because of logging on private lands, but even that has flat-lined. So St. Germaine and other civic leaders are pushing to diversify.\nDespite the mill closures, it hasn't been all doom and gloom: A rifle scope manufacturer opened recently, as did a company that makes jet boats. The hope is to draw more companies that cater to the fishing and hunting economy, and retrain mill workers.\n\"Clearwater County is a place where you can build it here, and test it out your back door,\" St. Germaine says.\nAn Industry 'Strangled'\nBut these are all long-term projects that likely won't help people like Pat Goetz, who is scrambling to find jobs right now.\nAfter working mostly as a bookkeeper in the timber industry since 1986, Goetz was laid off when Tri-Pro closed. So far the only jobs she's seeing advertised are minimum wage.\nEnlarge this image toggle caption Kirk Siegler/NPR Kirk Siegler/NPR\n\"Once you take timber out of the equation in counties like Idaho County, Clearwater County, there isn't much else,\" she says.\nLosing her health insurance was the biggest shock. At 63, she's not yet eligible for Medicare, and she's not sure whether she can afford to go on the exchanges to buy a replacement plan.\nGoetz says she gets depressed watching, as she puts it, an industry being strangled to death.\n\"Young kids have to go somewhere else in order to make a living,\" Goetz says. \"My children had to move out.\"\nLike a lot of people in town, Goetz also didn't think twice about voting for Donald Trump. She's hoping he can help bring back timber towns like hers.","url":"https://www.npr.org/2016/12/01/503984040/in-idaho-lumber-country-trump-voters-wait-to-see-if-he-can-jumpstart-jobs"}
