{"authors":["Associated Press"],"date_download":"2018-10-23 02:20:17","date_modify":"2018-10-23 02:20:17","date_publish":"2016-01-11 14:14:03","description":"JOHANNESBURG (AP) — South Africa paceman Dale Steyn was ruled out of the third test against England on Monday after failing to recover from a shoulder injury...","filename":"data/vaneerConsumption/InjuredSteynoutof3rdSouthAfricaEnglandtest.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393796_Injured-Steyn-3rd-South-Africa-England-test_1540261217.html","title":"Injured Steyn out of 3rd South Africa-England test","title_page":"Injured Steyn out of 3rd South Africa-England test | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Injured Steyn out of 3rd South Africa-England test\nJOHANNESBURG (AP) — South Africa paceman Dale Steyn was ruled out of the third test against England on Monday after failing to recover from a shoulder injury, depriving the Proteas of the world's top-rated fast bowler as they attempt to even the four-match series.\nSteyn missed the drawn second test in Cape Town with the injury, but was retained in the squad for the final two matches and was expected to be available. He was hurt during the first test, won by England.\nSouth Africa coach Russell Domingo said Steyn is not ready to return and will undergo further scans, although downplayed any long-term concerns about a player who will be missing his fifth test in his team's last seven.\n\"I don't think it is the end of Dale Steyn's career at all,\" Domingo said. \"All players are going to experience some type of niggles at some stage. He's just had a few of late.\n\"He's a great athlete. These things happen and I'm sure he'll get through it.\"\nKyle Abbott is fit to return to South Africa's squad for the match in Johannesburg starting Thursday after a hamstring injury, and will compete with fellow pacemen Morne Morkel, Chris Morris, Kagiso Rabada and Hardus Viljoen for a place in the team. Vernon Philander has already been ruled out for the series.","url":"https://www.dailymail.co.uk/wires/ap/article-3393796/Injured-Steyn-3rd-South-Africa-England-test.html"}
