{"authors":["Associated Press"],"date_download":"2018-10-22 22:32:58","date_modify":"2018-10-22 22:32:58","date_publish":"2016-01-11 03:20:02","description":"BOSTON (AP) — Denna Laing, the professional women's hockey player who has been hospitalized with severe spinal damage since crashing into the boards during a...","filename":"data/vaneerConsumption/Injuredhockeyplayerwouldnevertakethosemomentsback.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393302_Injured-hockey-player-never-moments-back_1540247578.html","title":"Injured hockey player 'would never take those moments back'","title_page":"Injured hockey player 'would never take those moments back' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Injured hockey player 'would never take those moments back'\nBOSTON (AP) — Denna Laing, the professional women's hockey player who has been hospitalized with severe spinal damage since crashing into the boards during an exhibition before the NHL Winter Classic, said that the injury didn't spoil \"the best day of my life.\"\n\"We made history that day and I would never take those moments back,\" she wrote in a Facebook post, accompanied by a dozen pictures of her and her teammates trying on her Winter Classic gear and taking the ice at Gillette Stadium.\n\"For a long time I have been looking for a new challenge,\" she wrote. \"Even though I was not expecting it be this, here we go.\"\nThe 24-year-old Laing was taken off the ice on a stretcher during the game between the Boston Pride and the Montreal Canadiennes, a day before the Boston and Montreal NHL teams met in the annual New Year's Day game. Laing's parents said on Friday that she \"suffered a severe spinal cord injury playing the sport she loves.\"\nJerilyn and Dennis Lang said their daughter \"has limited movement of her arms and no feeling in her legs.\"\nIn the Facebook post, Laing described the events leading up to the injury.\n\"Let's start from the beginning, the best day of my life,\" she wrote, describing her morning iced coffee ritual and arriving at the team's rink to find her name on a locker filled with merchandise from the NHL. \"All I could think about was it was like Christmas.\"\nArriving at the home of the New England Patriots with a police escort, Laing said, she and her teammates were hoping to bump into quarterback Tom Brady. Then they walked onto the field and saw the rink.\n\"It was the most beautiful hockey rink I've ever seen,\" said Laing, who is from the Boston suburb of Marblehead. \"After those first few minutes of skating around tragedy struck. You know the rest.... but I don't want you to feel bad for me. This is a moment to remember for Women's Hockey. We made history that day and I would never take those moments back.\"\nLaing works as a witness victim advocate at the Essex district attorney's office. She is being treated at Massachusetts General Hospital.\nSince the injury, women's hockey teams across the country have posted pictures of themselves on the ice in the formation of the No. 14, Laing's uniform number when she played at Princeton. All of the teams in the National Women's Hockey League will wear helmet patches with the No. 24 she wore with the Pride.\n\"We have received an incredible outpouring of love and support from countless friends and family members while we try to navigate this overwhelming situation,\" Laing's parents said. \"We are eternally grateful to everyone who continues to offer support as we take on this challenge together.\"\nAmong those offering support was Travis Roy, the former Boston University player who was paralyzed in 1995 when he crashed into the boards 11 seconds into his first college shift.","url":"https://www.dailymail.co.uk/wires/ap/article-3393302/Injured-hockey-player-never-moments-back.html"}
