{"authors":[],"date_download":"2018-10-30 17:50:31","date_modify":"2018-10-30 17:50:31","date_publish":"2018-10-30 17:42:00","description":"America was sliding into a recession in 2007, and Teak Wilson, a San Diego-native-turned-Atlanta tra...","filename":"data/vaneerConsumption/InjuredArmyvetTeakWilsonsaysshewishesshecouldhavedon.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/IMG_0070-U44178353774uly-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_vet-profile-teask-wilson__1540921831.html","title":"Injured Army vet Teak Wilson says she wishes she ‘could have don","title_page":"Injured Army vet Teak Wilson says she wishes she ‘could have don","title_rss":"NULL","source_domain":"ajc.com","text":"America was sliding into a recession in 2007, and Teak Wilson, a San Diego-native-turned-Atlanta transplant was struggling to find work.\nWilson previously worked as a state corrections officer and flight attendant.\nBut now television commercials and emails were nudging her to join the Georgia Army National Guard.\n“I told myself I can do this one weekend a month and two weeks in the summer, and it will look good on my resume,” Wilson recalls thinking.\nShe was called to active duty and signed on to work two years as a medic. The requirements for that position were too tough, and she wound up requesting to work in unit supply.\n“I never got to do the weekend a month,” Wilson said.\nIn 2009, she was sent to Fort Polk in Louisiana, training to go to Afghanistan, Wilson said.\nHer main job overseas was ordering food and supplies for all the American camps.\nWilson was in Afghanistan from June 2009 to April 2010 and celebrated her 30th birthday there.\nWhen she returned stateside, she said, she felt out of touch. Many of her friends had married and had babies. MySpace was no longer the social media craze. People were texting and using abbreviations, such as LOL for laugh out loud, she said.\n“My life was on park for a whole year,” Wilson said.\nHer service in the National Guard ended abruptly after a post-deployment medical exam.\nA doctor told her both her ankles were broken and hanging on by a thread.\nShe said this was the result of a fall she took early in her tour of Afghanistan while on guard duty.\n“Adrenaline keeps you going,” Wilson said.\nAfter the fall down a flight of watch tower stairs, she kept walking and running. Her pain was apparently blunted somewhat, she said, by “lacing my boots so tight.”\nWilson also found out that she had a brain injury, apparently as the result of a vehicle-born bomb that exploded near a building in where she was working in Afghanistan, she said.\nWilson medically retired in 2013.\nIn 2014, she graduated from SHARE Military Initiative, a program launched in 2008 by Atlanta’s Shepherd Center to help veterans with mild-to-moderate traumatic brain injuries reintegrate into their communities, workplaces, and homes.\nSince then, she’s worked with the Wounded Warrior program, been a volunteer with Habitat for Humanity, fed the homeless and been certified to assist in a suicide prevention program, she said.\nIn the last few months, she’s had what she hopes will be the last of four surgeries to repair her ankles. She also just recently became a homeowner.\n“It’s been baby steps,” Wilson said. “I never thought I was going to be a disabled veteran. But I’m a proud veteran, and I’m proud of my service. I wish I could have done more.”","url":"https://www.ajc.com/news/vet-profile-teask-wilson/5IowZPXrzclVzEozMLrw2M/"}
