{"authors":[],"date_download":"2018-10-23 00:22:57","date_modify":"2018-10-23 00:22:57","date_publish":"2017-03-10 06:38:09","description":"Four-time Masters winner Tiger Woods said Thursday he would miss the Arnold Palmer Invitational, putting his participation in next month's Masters tournament...","filename":"data/vaneerConsumption/InjuryplaguedWoodstomissArnoldPalmertournament.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/06/wire-194391-1489127893-321_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300150_Injury-plagued-Woods-miss-Arnold-Palmer-tournament_1540254177.html","title":"Injury-plagued Woods to miss Arnold Palmer tournament","title_page":"Injury-plagued Woods to miss Arnold Palmer tournament | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tiger Woods, who has not played since withdrawing from the Dubai Desert Classic, said he was out of next week's PGA Tour tournament because of back problems\nFour-time Masters winner Tiger Woods said Thursday he would miss the Arnold Palmer Invitational, putting his participation in next month's Masters tournament seriously in doubt.\nThe American made the announcement via Twitter saying he was out of next week's PGA Tour tournament because of back problems. He has not played since he withdrew from the Dubai Desert Classic on February 3.\n\"Unfortunately, due to ongoing rest and rehabilitation on my back, I won't be able to play in this year's Arnold Palmer Invitational,\" the 41-year old Woods said. \"I'm especially disappointed because I wanted to be at Bay Hill to help honor Arnold.\n\"This is one event I didn't want to skip. Arnold has meant so much to me and my family; I thought of him as a close friend .... He will be greatly missed and can never truly be replaced.\"\nPalmer died at age 87 in September.\nThe 14-time major-winner Woods returned from a 15-month injury lay-off in December and has slumped in the world rankings.\n\"I have no timetable for my return to golf, but my treatments are continuing and going well.\"\nSpeaking at a news conference prior to the Genesis Open in Los Angeles in mid-February, Woods said he was hopeful he could make a successful return in 2017 but also admitted that during the latest long layoff he wondered whether he would ever return to golf.\n\"There was a time when I didn't know if I could ever swing a golf club again and play with my kids,\" he said.\nWoods last won a major title at the 2008 US Open.","url":"https://www.dailymail.co.uk/wires/afp/article-4300150/Injury-plagued-Woods-miss-Arnold-Palmer-tournament.html"}
