{"authors":[],"date_download":"2018-10-22 21:26:18","date_modify":"2018-10-22 21:26:18","date_publish":"2014-05-07 09:48:01","description":"\"I'm hoping to join back up with the tour and show the world that I'm OK, and I'm hoping some of the other girls will do the same,\" she says.","filename":"data/vaneerConsumption/InjuredRinglingBrosAcrobatVowstoReturnAfterAccident.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/425381/140507-circus-pitard-5a_a1fb346b093bf0013a4241caa9f1f667.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_circus-accident_injured-ringling-bros-acrobat-vows-return-after-accident-n99001_1540243578.html","title":"Injured Ringling Bros. Acrobat Vows to Return After Accident","title_page":"Injured Ringling Bros. Acrobat Vows to Return After Accident","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPROVIDENCE, R.I. -- One of eight circus acrobats who plunged about 20 feet to the ground during a hair-hanging act witnessed by thousands says she'll perform the stunt again.\n\"For me, you gotta get back up and do it again,\" Samantha Pitard told The Associated Press after being released from a hospital Tuesday.\nPitard and seven other acrobats were in an act described as a \"human chandelier,\" hanging from an apparatus by their hair. They were injured during a Sunday performance of the Ringling Bros. and Barnum & Bailey circus when a clip at the top of the chandelier-like apparatus snapped, dropping them to the ground.\nThe other women are still hospitalized and Pitard said she plans to stay in Providence to support her friends as they work to regain their health.\nThen she'd like to return to the circus.\n\"I'm hoping to join back up with the tour and show the world that I'm OK, and I'm hoping some of the other girls will do the same,\" she said.\nPitard, 23, a native of Champaign, Illinois, said she's the only one of the troupe who can walk on her own. The others need assistance or haven't tried to walk because they're undergoing operations.\nBut she said the others are expected to fully recover and are in good spirits after receiving an outpouring of support.\nPitard said it had been a normal performance Sunday. The curtain dropped to reveal the eight women suspended in the air, but it went wrong when they did their third leg position.\nThe 350-pound chandelier landed on them. She said rescue crews got to them quickly to free them from the apparatus, then gave them medical attention.\n\"I was sitting up, and once I caught my breath, I was looking at all the girls,\" she said. \"I wanted to know that everybody was OK. I saw my troupe leader (Viktoriya Medeiros), she was right next to me, and I heard her say that she couldn't feel her legs.\"\nPitard described her injuries, including fractures on her spine, a cut on her head that required three stitches and a badly bitten tongue, as minor.\nLocal investigators are turning over the broken clip and other material to federal workplace safety authorities. Fire investigator Paul Doughty said they have narrowed down the cause of the broken clip to two possibilities: a manufacturing defect or improper use.\n- The Associated Press","url":"https://www.nbcnews.com/storyline/circus-accident/injured-ringling-bros-acrobat-vows-return-after-accident-n99001"}
