{"authors":[],"date_download":"2018-10-22 22:09:45","date_modify":"2018-10-22 22:09:45","date_publish":"2016-01-28 10:01:08","description":"On a freezing winter's day in a remote Kashmiri village, Begum Jan and her 10 children huddle around a wood burner inside their dimly-lit home, worried about...","filename":"data/vaneerConsumption/InKashmirmissingmenrevivefearsofdisappearances.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5ik-4vVdYopwYQ7f641721b07ab829e8-747_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420647_In-Kashmir-missing-men-revive-fears-disappearances_1540246185.html","title":"In Kashmir, missing men revive fears of 'disappearances'","title_page":"In Kashmir, missing men revive fears of 'disappearances' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In Kashmir, missing men revive fears of 'disappearances'\nOn a freezing winter's day in a remote Kashmiri village, Begum Jan and her 10 children huddle around a wood burner inside their dimly-lit home, worried about the fate of their missing father.\nThe 42-year-old labourer has been missing since November and his family fears he may have been taken by the Indian army, whose presence in the disputed Himalayan territory many locals resent.\nJan, 38, says she has no hope of her husband returning.\nRights groups say as many as 8,000 people, mostly young men, were \"disappeared\" in Indian Kashmir from 1989, when an armed insurgency against Indian rule erupted in the Muslim-majority region ©Tauseef Mustafa (AFP/File)\n\"If the army has taken him, they must have killed him,\" she told AFP, her children sobbing in the background.\nIndian government forces deployed in Kashmir have for decades faced charges of killing locals in faked gun battles to claim cash rewards and win promotion.\nRights groups say as many as 8,000 people, mostly young men, were \"disappeared\" in Indian Kashmir from 1989, when an armed insurgency against Indian rule erupted in the Muslim-majority region.\nThe has been a sharp decline in such cases in the past decade but fresh incidents continue to be reported.\nThe latest incident has brought back memories of a 2010 incident in which soldiers killed three young Kashmiri men and branded them as Pakistani militants.\nTheir deaths triggered months-long mass demonstrations across Indian Kashmir that ended with government forces killing 120 civilians.\nA rare police investigation later found the three had been lured away by the soldiers and killed in a staged gun battle.\n- 'I keep waiting' -\nSituated close to the Indian side of the de facto border with Pakistan known as the Line of Control (LoC), Dardpora is a Himalayan picture postcard, surrounded by glittering pine trees and sparkling streams.\nBut it has also been the scene of some of the ugliest episodes of the decades-long Kashmir insurgency.\nJan's husband Ghulam Jeelani Khatana has been missing since November 17 when he and another villager, Mir Hussain Khatana, left home with a soldier from the Indian army.\nLocals say the men were lured away by a soldier who was arrested three weeks later on suspicion of abducting them.\nBut the exact circumstances of their disappearance remains unclear.\nLeft alone with 10 children to support, Begum Jan has been trying to trace her husband herself, with the help of relatives.\nThis led them to Hassina, wife of a former rebel, Ali Mohammad, who went missing around the same time.\nThe same soldier repeatedly called Mohammad the day before he left home in a hurry, Hassina told AFP as she wept at her home.\n\"I keep waiting all the time, like my three small children, hoping he might just come back,\" she said.\nLocal police superintendent Aijaz Ahmed Bhat confirmed to AFP that a soldier had been arrested and remanded in custody on abduction charges.\nPolice have also arrested a cab driver who said he took the soldier and three men to a spot near an army camp around 30 kilometres (20 miles) from the village. He has identified two as the men from Dardpora.\n- Bitter memories -\nThe army is conducting its own internal investigation.\nBut the families say neither they nor police are doing much to find the missing men -- even though Jan has gone to a local court 15 times since her husband disappeared to seek help.\n\"Police are not asking the army what the soldier has done with the three men,\" said Ghulam Jeelani Khatana's nephew, Imamdin Poswal, for whom the latest disappearances have revived bitter memories.\n\"My father was taken away similarly in 1992. There has never been any news of him since,\" he told AFP.\nTroops in Kashmir benefit from the Armed Forces Special Powers Act, a draconian law introduced in 1990 that gives the army legal impunity and rights to kill suspects and seize property.\nThe state government disputes the 8,000 figure and says most of those claimed as missing likely crossed into Pakistan for arms training.\nBut rights organisations and families of the missing point to the existence of 7,000 unmarked single and mass graves in the region.\n\"The government's own forensic investigations have revealed that out of 53 bodies exhumed from these graves, 48 were found to be of disappeared local civilians who were buried as unidentified foreign fighters,\" said Khurram Parvez, coordinator of the Jammu Kashmir Coalition of Civil Society.\nHis group wants authorities to DNA test all the bodies so they can be cross-checked against the families of missing locals.\nThe federal government has said India does not have the technical capability to undertake such widescale forensic investigations.\nIn Kashmir, a senior police officer recently told reporters that the three missing men worked for the Indian army and had crossed over the LoC to Pakistan.\nBut the families accuse the police of \"spreading rumours\" to defame the missing men as spies and neutralise public sympathy towards them.\n\"This is to cover it all up,\" said Poswal.\n\"Police and army are always hand in glove in such cases. Who would leave 10 children and a wife behind to cross the deadly LoC?\"\nBegum Jan with some of her children at their home in Dardpora, a Himalayan village on the Indian side of the de facto border that divides Kashmir between India and Pakistan on December 22, 2015 ©Tauseef Mustafa (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3420647/In-Kashmir-missing-men-revive-fears-disappearances.html"}
