{"authors":[],"date_download":"2018-10-22 21:07:38","date_modify":"2018-10-22 21:07:38","date_publish":"2014-06-04 12:01:19","description":"Prosecutors trying to convict Hernandez in two homicide cases could try to use his tattoos against him: They are seeking the artists who did them.","filename":"data/vaneerConsumption/InkMurderLinkProsecutorsEyeAaronHernandezsTattoos.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_27/486216/aaron-hernandez-tattoos_4ca431f61ccea7268ae5a67e804b084d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_ink-murder-link-prosecutors-eye-aaron-hernandezs-tattoos-n122126_1540242458.html","title":"Ink Murder Link? Prosecutors Eye Aaron Hernandez's Tattoos","title_page":"Ink Murder Link? Prosecutors Eye Aaron Hernandez's Tattoos","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHARTFORD, Conn. — Teardrops for murders. Spider webs for prison time. Penal code numbers for crimes committed.\nCriminals have long used tattoos as indelible ink on their own bodily rap sheet. And for just as long, police have used tattoos as a way to identify suspects, a distinguishing characteristic to jog a memory or catch the public's eye.\nBut only rarely does body art play a pivotal role as evidence posited as proof of wrongdoing.\nProsecutors trying to convict former New England Patriot Aaron Hernandez in a pair of homicide cases could try to use the one-time football star's tattoos against him: they are seeking the artists who worked on Hernandez, saying they could be witnesses.\nCriminal justice experts, however, say it's hard for law enforcement to determine whether someone with a tattoo linked to a kind of crime actually did the deed. As Todd Bettencourt, a tattoo artist in North Attleborough, Massachusetts - the town where Hernandez was living at the time of the killings - said, \"Some people just get it because it's cool.\"\nMuch of Hernandez's upper body is covered in tattoos: The open-mouthed face of a lion sits atop his right bicep, ringed by the words \"It's about the fight in you;\" \"1989,\" his birth year, spans the fingers of his left hand and a 10-word phrase favored by his father, \"If it is to be it is up to me,\" runs down his left forearm.\nIt is Hernandez's right forearm that has piqued the interest of investigators, though they will not specify exactly which design they have focused on.\nHernandez is accused of fatally shooting two men - Daniel de Abreu and Safiro Furtado - and wounding a third in Boston in July 2012. He also is charged in last year's killing of Odin Lloyd, whose body was found near Hernandez's home. And he is being sued by an associate who says Hernandez shot him in the eye in Miami last year.\nPhotos of Hernandez show he has had five stars and other tattoo work added to his right forearm over the past few years. While many star tattoos have nothing to do with crime, they can sometimes be used to represent killings, said Kevin Waters, a criminal justice professor at Northern Michigan University and former agent with the federal Drug Enforcement Administration.\n\"I would say the cops probably see the stars and know in some circles that a star does represent a kill and want a tattoo artist to come in and see if he (Hernandez) said anything about that,\" Waters said.\nEvery once in a while, criminal investigators do hit the jackpot. That was the case with Southern California gang member Anthony Garcia, who was convicted of murder and sentenced to 65 years in prison in 2011 after a homicide investigator discovered that Garcia had the scene of an unsolved 2004 murder inked on his chest.\nIn April, an Indiana judge ordered William Clyde Gibson to grow out his hair to cover a new tattoo - \"Death Row X 3\" - before the twice-convicted murderer went on trial for allegedly killing a third person. That same month in Kansas, Jeffrey Chapman was given permission to wear a turtleneck to cover a tattoo of the word \"murder\" spelled backward on his neck, amid concerns it would prejudice the jury at his upcoming murder trial.\nIn Hernandez's case, officials said they have received several responses to their plea for information for tattoo artists who worked on him, but they wouldn't elaborate. Boston police and the Suffolk County District Attorney's Office said the artists would be considered witnesses and are not accused of any wrongdoing.\nEven if investigators do find the artists who created the tattoos they are interested in, it's not clear they would talk. Artists say clients do often share personal information, but there is a split within the tattoo community about whether there is artist-client confidentiality.\nBettencourt, who said he never worked on Hernandez, said there are no clear rules and, besides, the stars on Hernandez's arm could have been added just as part of a design to make the tattoo work appear fuller.","url":"https://www.nbcnews.com/news/crime-courts/ink-murder-link-prosecutors-eye-aaron-hernandezs-tattoos-n122126"}
