{"authors":[],"date_download":"2018-10-30 20:25:43","date_modify":"2018-10-30 20:25:43","date_publish":"2015-10-30 11:51:45","description":"DeKalb County Sheriff Jeffrey Mann is investigating how a group of inmates were able to shoot a rap video inside the county’s jail recently.","filename":"data/vaneerConsumption/InmatesrecordrapvideoinsideDeKalbCountyjail.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/30/Videos/4587263095001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_inmates-rec_a0fbf6bd076c4671a6c159b7fc1d19d3__1540931143.html","title":"Inmates record rap video inside DeKalb County jail","title_page":"Inmates record rap video inside DeKalb County jail","title_rss":"NULL","source_domain":"ajc.com","text":"DeKalb County Sheriff Jeffrey Mann is investigating how a group of inmates were able to shoot a rap video inside the county’s jail recently.\nThe video, titled “Thuggin’ Live from DeKalb Jail,” was posted on YouTube Saturday.\nMann told Channel 2 Action News the inmates recorded the video on the jail’s video visitation system, which allows callers to see one another without having to be at the jail.\nHe said the visitation system is only supposed to be used by inmates and visitors who have registered and been approved to use it.\nDuring the 2 minute and 27-second video, about a half dozen inmates can be seen dancing about and gyrating wildly, with several taking off their shirts and one flicking a cigarette lighter.\n“That lighter can be used to light a fire,” former jail Lt. Kyle Jones, who is currently running for DeKalb County Sheriff, told Channel 2. “It can be used to create a diversion.”\nMann said the inmates will be disciplined and prohibited from using the video visitation system.\nJones said the system needs to be overhauled to prevent such actions in the future.\n“At some point and time,” he told Channel 2, “somebody’s eyes should have seen that and some action should have been taken.”","url":"https://www.ajc.com/news/crime--law/inmates-record-rap-video-inside-dekalb-county-jail/cf1OEvsl9spleE6kYp5HtJ/"}
