{"authors":["Associated Press"],"date_download":"2018-10-23 01:08:28","date_modify":"2018-10-23 01:08:28","date_publish":"2016-01-29 14:52:02","description":"BEIRUT (AP) — In a Middle East torn apart by war and conflict, fighters are increasingly using food as a weapon. Millions of people across countries like Syr...","filename":"data/vaneerConsumption/InMideastwarshungergripsmillionsacrosstheregion.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:9dc41516819840de8256ba130f125b70-3bmscybNe842cce83474b56eb850-999_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422285_In-Mideast-wars-hunger-grips-millions-region_1540256908.html","title":"In Mideast wars, hunger grips millions across the region","title_page":"In Mideast wars, hunger grips millions across the region | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In Mideast wars, hunger grips millions across the region\nBEIRUT (AP) — In a Middle East torn apart by war and conflict, fighters are increasingly using food as a weapon.\nMillions of people across countries like Syria, Yemen and Iraq are gripped by hunger, struggling to survive with little help from the outside world. Children suffer from severe malnutrition, their parents often having to beg or sell possessions to get basic commodities including water, medicine and fuel.\nThe biggest humanitarian catastrophe by far is Syria, where a ruinous five-year civil war has killed a quarter of a million people and displaced half the population. All sides in the conflict have used punishing blockades to force submission and surrender from the other side — a tactic that has proved effective particularly for government forces seeking to pacify opposition-held areas around the capital Damascus.\nIn this Sunday, Jan. 24, 2016 photo, a malnourished child lies in a bed waiting to receive treatment at a therapeutic feeding center in a hospital in Sanaa, Yemen. This child is one of millions of people across countries like Syria, Yemen and Iraq are gripped by hunger, struggling to survive with little help from the outside world. (AP Photo/Hani Mohammed)\nSince October, Russian airstrikes and the start of yet another winter have exacerbated a humanitarian crisis and led to deaths from starvation in some places.\nHumanitarian teams who recently entered a besieged Syrian town witnessed scenes that \"haunt the soul,\" said Secretary-General Ban Ki-moon. He accused both the government of President Bashar Assad and the rebels fighting to oust him of using starvation as a weapon, calling it a war crime. Although sieges are an accepted military practice that are often carried out by forces seeking to avoid intense urban conflict, the conduct of forces carrying them out and their behavior toward civilian populations are regulated by international humanitarian law. Past cases include the sieges of Gorazde and Sarajevo during the Bosnian war. The Hamas-ruled Gaza Strip, home to 1.8 million people, has also been under an Israeli and Egyptian blockade, restricting the flow of many goods into the war-torn Palestinian territory.\nThe U.N. and aid agencies have struggled with funding shortages and growing impediments to the delivery of humanitarian assistance despite Security Council resolutions insisting on the unconditional delivery of aid across front lines.\nIn Yemen, the Arab world's most impoverished nation, nearly half of the country's 22 provinces are ranked as one step away from famine conditions.\nHere's a look at major areas in the Middle East under siege or suffering starvation:\nSYRIA\nThe United Nations estimates more than 400,000 people are besieged in 15 communities across Syria, roughly half of them in areas controlled by the Islamic State group. In 2014, the U.N. was able to deliver food to about five percent of people in besieged areas, while today estimates show the organization is reaching less than one percent.\nIn 2015, the World Food Program was forced to reduce the size of the food rations it provides to families inside Syria by up to 25 percent because of a funding shortfall. The agency says it has to raise $25 million every week to meet the basic food needs of people affected by the Syrian conflict.\nSome of the hardest hit blockaded areas in Syria are:\nMadaya: A town northeast of Damascus with a population of 40,000. The town has been besieged by government and allied militiamen for months and gained international attention after harrowing pictures emerged showing emaciated children. Doctors Without Borders says 28 people have died of starvation in Madaya since September. Two convoys of humanitarian aid were delivered to the town last week. Aid workers who entered described seeing skeletal figures; children who could barely talk or walk, and parents who gave their kids sleeping pills to calm their hunger.\nFouaa and Kfarya: Two Shiite villages in the northern province of Idlib with a combined population of around 20,000. The villages have been blockaded by rebels for more than a year. Pro-government fighters recently evacuated from the villages describe desperate conditions there with scarce food and medicine, saying some residents are eating grass to survive and undergoing surgery without anesthesia. Aid convoys entered the villages simultaneously with the aid to Madaya after months-long negotiations between the government and armed groups.\nDeir el-Zour: An estimated 200,000 people living in government-held parts of this city in eastern Syria are besieged by the Islamic State group. The U.N. says most of the residents are women and children facing sharply deteriorating conditions due to the ban on all commercial or humanitarian access, as well as the inability of residents to move outside of the city. While government stocks continue to provide bread, there are severe shortages of food, medicine and basic commodities. Opposition activists say they have documented the death of 27 people from malnutrition. Water is available only once a week for few hours.\nYEMEN\nThe humanitarian situation has dramatically deteriorated, nearly 300 days after the Saudi-led coalition began its air campaign aimed at driving Yemen's Shiite rebels from cities under their control. Coalition naval ships are blockading traffic in Yemen's ports and rebels are besieging several areas, particularly the southern city of Taiz.\nSome 14.4 million Yemenis, more than half of the population, are food insecure, an increase of 12 percent in the last eight months, the U.N.'s Food and Agriculture Organization said Thursday. In late December, the WFP said 7.8 million of Yemen's 24 million people are in even more dire condition, \"facing life-threatening rates of acute malnutrition,\" up by more than 3 million in less than a year. It said 10 of the country's 22 provinces are in \"the grip of severe food insecurity\" at the \"emergency\" level, one step short of famine on the agency's 5-level scale of food security.\nIn Taiz, with a population of about 250,000, residents have been going hungry for weeks, the WFP said. The United Nations humanitarian coordinator for Yemen Jamie McGoldrick said recently that basic services in Taiz are scarce, including access to water and fuel.\nThe severe shortage of food, fuel and medicine across Yemen led to an increase in the number of children suffering from malnutrition while the destruction of health facilities treating them led to deaths.\nSome 3 million children under five years require services to treat or prevent malnutrition, according to a UNICEF report on Jan. 13.\nA new report by a U.N. panel of experts, obtained this week by the AP, said civilians in the Arab world's poorest country are suffering under tactics in the conflict that \"constitute the prohibited use of starvation as a method of warfare.\"\nIRAQ\nMassive population shifts in Iraq due to violence has made it more difficult for millions of people to access food, medicine and safe drinking water. More than 3 million Iraqis are displaced within the country by violence and instability. \"They've lost their livelihoods, their jobs, and hunger and the inability to purchase food is a reality in their everyday life,\" said Marwa Awad, with the World Food Program. In total 8.2 million Iraqis are in need of humanitarian assistance: food, water, shelter or medicine, she said.\nOngoing violence in many of Iraq's provinces that are also home to people who have been uprooted by conflict is of the greatest concern, Awad said. In Anbar, Ninevah and Salahuddin the price of food has risen by as much as 38 percent in the last month, and in some cases the Iraqi government has had to airlift families out of towns and villages besieged by fighting between Iraqi government forces and Islamic State group fighters.\nIn Ramadi, families who had been held by IS fighters as human shields said they survived for days on just rice and flour.\nWhile conflict in Iraq hasn't led to cases of starvation, Awad said WFP has seen an increase in cases of malnutrition as people eat less to conserve the little food they do have.\nSYRIAN REFUGEES IN NEIGHBORING COUNTRIES\nAccording to the U.N. children's agency, malnutrition is a major threat among millions of refugees. A UNICEF report last year showed that almost 2,000 Syrian refugee children in Lebanon are suffering from severe acute malnutrition, and need immediate treatment to survive. It warned that situation could deteriorate even further as malnutrition is linked to such factors as poor hygiene, unsafe drinking water, lack of immunization, diseases and improper infant and young child feeding practices.\n___\nAssociated Press writers Susannah George in Baghdad, Maggie Michael in Cairo and Cara Anna at the United Nations contributed to this report.\nFILE - In this Jan. 31, 2014 file photo released by the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), shows residents of the besieged Palestinian camp of Yarmouk, queuing to receive food supplies, in Damascus, Syria. That year, the U.N. was able to deliver food to about five percent of people in besieged areas including Yarmouk, while today estimates show the organization is reaching less than one percent.(UNRWA via AP, File)\nIn this Sunday, Jan. 24, 2016 photo, a Syrian boy walks in Kawergosk refugee camp in northern Iraq carrying a plate with boiled potatoes. According to the U.N. children¿s agency, malnutrition is a major threat among millions of refugees, as people eat less to conserve the little food they do have. (AP Photo/Alice Martins)\nFILE - In this Saturday, Jan. 16, 2016 file photo, anti-Syrian government activists hold up placards during a sit-in against the ongoing siege imposed on the Syrian town of Madaya in front of the European Union embassy in Beirut. The town has been besieged by government and allied militiamen for months and gained international attention after harrowing pictures emerged showing emaciated children.(AP Photo/Hassan Ammar, File)\nFILE - In this Monday, Jan. 11, 2016 file photo, people wait to leave the besieged town of Madaya, northwest of Damascus, Syria, where Doctors Without Borders says dozens of people have died of starvation since September. (AP Photo, File)\nFILE - In this Feb. 24, 2014 file photo released by the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), a resident of the besieged Palestinian camp of Yarmouk weeps as she waits to receive humanitarian aid from UNRWA in Damascus, Syria. Over the past two years, the ability of humanitarian groups to deliver aid to Syrians has become increasingly difficult. (UNRWA via AP, File)\nIn this Jan. 24, 2016 photo, a malnourished child lies in a bed at a therapeutic feeding center in a hospital in Sanaa, Yemen. Some 3 million children here under five years require services to treat or prevent malnutrition, according to a UNICEF report on Jan. 13. (AP Photo/Hani Mohammed)\nIn this photo taken on Sunday, Jan. 17, 2016, Yemenis carry relief supplies as they walk along a path after Shiite rebels, known as Houthis besieging the city of Taiz, Yemen. Residents have been going hungry for weeks, the WFP said. (AP Photo/Abdulnasser Alseddik)\nFILE - In this Tuesday, March 11, 2014 file photo, Mervat, 31, speaks during an interview with The Associated Press as she holds her 9-month-old daughter Shurouk inside their tent camp for Syrian refugees camp in Kab Elias, in Lebanon's Bekaa Valley. Trapped in her northern Syrian village by fighting, Mervat watched her newborn baby progressively shrink. When they finally escaped to neighboring Lebanon, a nurse told her the girl was starving. (AP Photo/Bilal Hussein, File)\nIn this image made from video posted online on Jan. 8, 2016, by Madaya Medical Corps, an emaciated Syrian boy receives treatment at a local field clinic, in Madaya, Syria. The town has been besieged by government and allied militiamen for months ; aid workers who entered described seeing skeletal figures; children who could barely talk or walk, and parents who gave their kids sleeping pills to calm their hunger.(Madaya Medical Corps via AP video)\nFILE - In this Wednesday, July 22, 2015 file photo, Syrian refugee Hannan Mohammed, 12, holds a picture of herself and her sister Warda, 5, and the youngest Jawahir, 1, who died after suffering from chronic malnutrition, outside their tent at an informal tented settlement near the Syrian border on the outskirts of Mafraq, Jordan. Jawahir is one of millions of people across countries like Syria, Yemen and Iraq are gripped by hunger, struggling to survive with little help from the outside world. (AP Photo/Muhammed Muheisen, File)\nIn this Saturday, Jan. 23, 2016, a displaced girl waits for donated food at al-Takia camp in Baghdad, Iraq. More than 3 million Iraqis are displaced within the country by violence and instability. ¿They¿ve lost their livelihoods, their jobs, and hunger and the inability to purchase food is a reality in their everyday life,¿ said Marwa Awad, with the World Food Program. (AP Photo/Karim Kadim)\nIn this Sunday, Jan. 24, 2016 photo, old vegetables sit outside a shop in Kawergosk refugee camp in northern Iraq. Massive population shifts in Iraq due to violence has made it more difficult for millions of people to access food, medicine and safe drinking water. (AP Photo/Alice Martins)\nFILE - In this Tuesday, March 11, 2014 file photo, an aid worker measures the upper arm circumference of 9-month-old Shurouk as her mother Mervat, 31, holds her inside their tent at a camp for Syrian refugees camp in Kab Elias, in Lebanon's Bekaa Valley. The measurement is an immediate indicator of malnourishment. (AP Photo/Bilal Hussein, File)\nIn this image made from video posted online on Jan. 7, 2016, by Qasioun News Agency, an emaciated Syrian man receives treatment at a local field clinic, in Madaya, Syria. The town has been besieged by government and allied militiamen for months and Doctors Without Borders says dozens of people have died of starvation in Madaya since September. (Qasioun News Agency via AP video)\nIn this Monday, Jan. 25, 2016 photo, a boy walks on the rubble of a house damaged during a clashes between tribal fighters and Shiite militia known as Houthis, in Taiz. A lack of food and shelter is leaving civilians vulnerable in a Middle East torn apart by war and conflict. (AP Photo/Abdulnasser Alseddik)\nIn this Sunday, Jan. 24, 2016 photo, a doctor touches a malnourished child at a therapeutic feeding center in a hospital in Sanaa, Yemen. In the Arab world¿s most impoverished nation, nearly half of the country¿s 22 provinces are ranked as one step away from famine. (AP Photo/Hani Mohammed)","url":"https://www.dailymail.co.uk/wires/ap/article-3422285/In-Mideast-wars-hunger-grips-millions-region.html"}
