{"authors":[],"date_download":"2018-10-22 22:39:53","date_modify":"2018-10-22 22:39:53","date_publish":"2014-05-12 13:13:32","description":"New NBC News-Marist polls show candidates still matter, even in the toughest of environments","filename":"data/vaneerConsumption/InMidtermsCandidatesCanTrumpNationalNarrative.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/435876/arkansas_senate-jpeg-0c370_7cea07da2eea1ccdc98ce4221da09d86.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_midterms-candidates-can-trump-national-narrative-n102981_1540247993.html","title":"In Midterms, Candidates Can Trump National Narrative","title_page":"In Midterms, Candidates Can Trump National Narrative ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nCandidates matter\nThere are several headlines from our batch of NBC-Marist polls out of Arkansas, Georgia, and Kentucky, which are all May 20 primary states. One, Democrats are holding their own so far in the general-election matchups in these Southern states. Two, the national environment (Obama’s approval, view of nation’s direction) is still a potential drag on these same Democrats. And three, the GOP establishment is besting the Tea Party in the upcoming Republican primaries in Georgia and Kentucky. But to us, the biggest headline from our poll is this: Candidates still matter, even in the toughest of environments. That explains why incumbent Sen. Mark Pryor (D) leads Tom Cotton (R) by 11 points among registered voters in Arkansas, 51%-40%. Pryor has a 50%-35% fav/unfav among registered voters in the state, versus Cotton’s 38%-39% score. What’s more, Pryor is getting the support of 32% of voters who disapprove of President Obama’s job in Arkansas. Bottom line: Arkansas voters, per our poll, seem comfortable separating Pryor from Obama (it probably helps when Bill Clinton’s fav/unfav in the state is 68%-28%. And Cotton’s goal over the next five-plus months will be to make the case that a vote for Pryor is a vote for Obama (whose approval rating is just 34% in the state). Indeed, there’s still a path to victory for Cotton, one that many a Republican rode to success in 2010. But at the beginning of the year, many didn’t think there was such a path for Pryor. Ours is now the third poll since April to have him up double digits in Arkansas.\nMcConnell is coasting his primary, but faces a competitive general election\nThat candidates matter also explains why Asa Hutchinson (R) is leading Mike Ross (D) in Arkansas’ gubernatorial contest, 49%-42%. (While Pryor leads Cotton by seven points among independents, Hutchinson’s lead among indies is 15 points.) And that candidates matter also explains why Senate Minority Leader Mitch McConnell is leading Tea Party challenger Matt Bevin by a whopping 32 points among likely GOP voters in next week’s primary race, 57%-25%. What McConnell has done in his primary has worked. He’s put the spotlight on Bevin a bit -- doing his best to make the primary a choice rather than a pure referendum on him. The question for McConnell, however, is if he can make the full transition to the general election in what looks like to be a VERY competitive race. According to the poll, McConnell leads Alison Lundergan Grimes by just one point, 46%-45% among registered voters. The entire general-election game will hinge on whether McConnell can keep the GOP voters in his column: Right now, per the poll, McConnell is getting support from 66% of likely Republican primary voters, while Grimes is getting 25%.\nGeorgia, Georgia…\nMeanwhile, in Georgia, the two more establishment-backed Republicans in the GOP Senate primary -- David Perdue and Jack Kingston -- are ahead in this crowded field, with Perdue getting the support of 23% of likely voters and Kingston getting 18%. Karen Handel is in third place with 14%, while Paul Broun and Phil Gingrey are tied at 11%. The Georgia primary heads to a runoff if no one gets above 50% on May 20, and Perdue also leads as the top second choice among likely voters. So when you combine this GOP contest with McConnell-vs.-Bevin in Kentucky, it’s another example of how the establishment is besting the Tea Party -- at least right now. In the general election in Georgia, Democrat Michelle Nunn is running competitive against these five Republicans:\nNunn gets the support of 41% of registered voters, versus 45% for Perdue;\nIt’s Nunn 43% against 43% for Kingston\nIt’s Nunn 42% versus 39% for Handel;\nIt’s Nunn 42% against 43% for Broun\nAnd it’s Nunn 44% against 42% for Gingrey.\nGiven those numbers in Georgia, the makeup of the general electorate is going to mean EVERYTHING in that contest. Do African Americans and young voters come out? Or is the electorate disproportionately white and elderly? That will make all the difference. Democrats have been spending a bunch of early money on the ground in Georgia trying to do in the state what Obama’s campaign didn’t do in 2008 and 2012 because it wasn’t thought of as a swing state, make a concerted effort to register new voters.\nIn polling Obamacare, a label makes a big difference\nWhen it comes to views of the new health care law, sometimes it’s all in a name. In Kentucky, our NBC-Marist poll found that 57% of registered voters have an unfavorable view of “Obamacare,” the shorthand commonly used to label the 2010 Affordable Care Act. That’s compared with only 33% who give it a thumbs up -- hardly surprising in a state where the president’s approval rating hovers just above 30%. By comparison, when Kentucky voters were asked to give their impression of kynect, the state exchange created as a result of the health care law, the picture was quite different. A plurality -- 29% -- said they have a favorable impression of kynect, compared to 22% who said they view the system unfavorably. Twenty seven percent said they hadn’t heard of kynect, and an additional 21% said they were unsure.\nWhy the VA story -- not Benghazi -- is the bigger story\nFor all the political sound and fury over Benghazi, the mismanagement at the Department of Veterans Affairs has been (and will be) the bigger story, in our opinion. “Amid increasing patient loads and an exodus of disenchanted employees, VA medical centers in Phoenix and elsewhere became overwhelmed over the past few years, with new patients sometimes waiting a year to see a primary-care physician and facing months-long delays for specialist appointments,” the Arizona Republic reported last week, adding that 40 veterans “died awaiting care and that administrators falsified records on the timeliness of appointments.” Why it’s the bigger story: There’s bipartisan outrage (unlike regarding Benghazi), and it cuts at the heart of the “competency” issue for the Obama administration (see the health-care website). Yes, VA hospitals have been a mess for years. Then again, we’re now in Year Six of the Obama presidency.\nRand Paul: Time to ease up on voter ID laws\nWe’ve said it before, and we’ll say it again: Rand Paul -- win or lose -- will be one of the most fascinating stories come 2015, if he decides to run for president. Here’s the New York Times from over the weekend: “Sen. Rand Paul of Kentucky broke Friday with fellow Republicans who have pushed for stricter voting laws as a way to crack down on fraud at the polls, saying that the focus on such measures alienates and insults African-Americans and hurts the party. ‘Everybody’s gone completely crazy on this voter ID thing,’ Mr. Paul said in an interview. ‘I think it’s wrong for Republicans to go too crazy on this issue because it’s offending people.’” On the one hand, Paul’s outreach toward African Americans appears intended to blunt some of the more unsavory associations that his father has had. On the other hand, Paul is challenging his party here and is asking his party to change. Some Republicans believe they have to be a change candidate and campaign just in the general election, Paul clearly is believing there needs to be a “change the GOP” candidate in the primaries.\nGOP poll: Scott is leading Crist in Florida\nAnd while our NBC-Marist polls are mostly good news for Democrats, here is some good news for Republicans from one American Future Fund (R) poll out of Florida conducted by McLaughlin & Associates (R): It shows incumbent Gov. Rick Scott leading Charlie Crist, 42%-38%.\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/midterms-candidates-can-trump-national-narrative-n102981"}
