{"authors":["Kirk Siegler"],"date_download":"2018-10-23 00:47:36","date_modify":"2018-10-23 00:47:36","date_publish":"2016-08-18 00:00:00","description":"National monument designations that bypass Congress are hugely controversial. In this presidential election year, the politics in a state like Nevada are even more sensitive.","filename":"data/vaneerConsumption/InNevadaTribesPushToProtectLandAtTheHeartOfBundyRanchStandoff.json","image_url":"https://media.npr.org/assets/img/2016/08/18/natncover_wide-a5009d64c3fe354f63cb064501da17b769d37f63.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_codeswitch_2016_08_18_490498442_in-nevada-tribes-push-to-protect-land-at-the-heart-of-bundy-ranch-standoff_1540255656.html","title":"In Nevada, Tribes Push To Protect Land At The Heart Of Bundy Ranch Standoff","title_page":"In Nevada, Tribes Push To Protect Land At The Heart Of Bundy Ranch Standoff : Code Switch : NPR","title_rss":"NULL","source_domain":"npr.org","text":"In Nevada, Tribes Push To Protect Land At The Heart Of Bundy Ranch Standoff\nEnlarge this image toggle caption Kirk Siegler Kirk Siegler\nWhen rancher Cliven Bundy claimed his family of Mormon pioneers had \"ancestral\" rights to the federal land in and around Gold Butte, Nev., Vernon Lee scoffed.\n\"As a native, and as the tribe that actually had that land granted by the federal government back in the 1800s, he really doesn't got a right at all,\" Lee says. \"If anybody's got a right it would be the Moapa Band of Paiutes.\"\nLee, who is a former tribal councilman, is sitting on a lawn chair in the shade of his mobile home on the Moapa River Reservation.\nAn air conditioner hanging from a side window hums. He swats away flies as he recalls how the tribe's land once included all of Gold Butte, but was later shrunk tenfold by the U.S. government. Today the reservation is just this small sliver of desert north of Cliven Bundy's place and adjacent to a coal-fired power plant.\n\"To be quite candid I wish they would give it all back, but realistically that probably won't happen,\" Lee says.\nSo the Southern Paiute tribes in Nevada are proposing another plan. Now that Bundy and many of his militia followers have been arrested by federal authorities, they sense a small window of opportunity before President Obama leaves office. They want him to designate Gold Butte as a national monument.\nEnlarge this image toggle caption Kirk Siegler Kirk Siegler\n\"We want to protect the lands, we want to protect the animals and we want our sacred sites protected,\" Lee says. \"Right now the best thing we can think of is to go on the side of this creation of a monument.\"\nVandalism of sacred sites\nSuch a designation would be a bittersweet end to an especially rough few years for the tribes. After the armed standoff on the Bundy Ranch, the federal government stopped managing Gold Butte entirely due to safety concerns. Until recently, it was lawless.\nKenny Anderson, cultural director for the Las Vegas Paiute tribe, recounts a recent walk through Gold Butte with a group of elders.\nHe noted that the Bundy family's cows are still trespassing in the area.\n\"There was petroglyphs that they were walking on, there was cow patties everywhere,\" Anderson says. \"And I'm saying, dang, what the heck?\"\nEnlarge this image toggle caption Kirk Siegler Kirk Siegler\nIt's not just the cows that Anderson and other tribal members are concerned about. They've documented evidence of people shooting at ancient petroglyphs carved into rocks, theft of pottery and arrowheads. There are photos of off-road vehicle tracks cutting across plants native people have gathered for centuries to make paint and baskets.\n\"I don't know if it's because of they weren't told about things like this or maybe they weren't concerned with what history is,\" Anderson says. \"It's a mystery.\"\nThursday in Las Vegas, tribal leaders joined U.S. Sen. Harry Reid and other conservationists to issue a more detailed report of what they say is extensive damage and vandalism in Gold Butte. The event followed a recent announcement that the federal Bureau of Land Management has resumed its field work in the remote area east of Las Vegas, after a more than two year absence.\nSeizing the moment\nIn the end, the irony is that the Bundy standoff may end up helping the tribes' cause. There's a lot more public attention being paid to these historical lands than in recent memory. And not just in Nevada, either. There's a plan to transfer ownership of the National Bison Range to tribes in Montana. In Utah, five tribes that want to create a massive, jointly managed national monument have the ear of the Obama Administration.\nNational monument designations that bypass Congress are hugely controversial. University of Colorado historian Patty Limerick says it's not uncommon for a president to wait until the very last minute.\n\"Bill Clinton and his Secretary of the Interior Bruce Babbit had quite a realistic recognition that the Democrats were not going to be carrying Utah in the 1990s,\" Limerick says. \"So they could go ahead with national monuments, whether or not the people of Utah thought that was a cool idea or not.\"\nEnlarge this image toggle caption Kirk Siegler Kirk Siegler\nIn this presidential election year, the politics in a state like Nevada are even more sensitive. And that has a lot of tribal activists like Vernon Lee feeling pessimistic.\n\"I don't think anybody wants to move and do anything for Indian Country because it's not a popular thing to do,\" Lee says. \"And it's all about the votes.\"\nLee says in Indian Country, justice is slow to come, if it comes at all.","url":"https://www.npr.org/sections/codeswitch/2016/08/18/490498442/in-nevada-tribes-push-to-protect-land-at-the-heart-of-bundy-ranch-standoff"}
