{"authors":[],"date_download":"2018-10-22 22:39:31","date_modify":"2018-10-22 22:39:31","date_publish":"2014-05-12 10:59:46","description":"When it comes to views of the new health care law, sometimes it’s all in a name.","filename":"data/vaneerConsumption/InPollingObamacareALabelMakesABigDifference.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/435516/obamacare_c1f661c29cbfa012679f98cfb759f820.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_polling-obamacare-label-makes-big-difference-n102861_1540247971.html","title":"In Polling Obamacare, A Label Makes A Big Difference","title_page":"In Polling Obamacare, A Label Makes A Big Difference","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWhen it comes to views of the new health care law, sometimes it’s all in a name.\nIn Kentucky, a new Marist poll conducted for NBC News finds that 57 percent of registered voters have an unfavorable view of “Obamacare,” the shorthand commonly used to label the 2010 Affordable Care Act. That’s compared with only 33 percent who give it a thumbs up – hardly surprising in a state where the president’s approval rating hovers just above 30 percent.\nBy comparison, when Kentucky voters were asked to give their impression of \"kynect,\" the state exchange created as a result of the health care law, the picture was quite different.\nA plurality – 29 percent – said they have a favorable impression of kynect, compared to 22 percent who said they view the system unfavorably. Twenty-seven percent said they hadn't heard of kynect, and an additional 21 percent said they were unsure.\n“Call it something else, and the negatives drop,” said Marist pollster Lee Miringoff.\nHalf of Kentucky voters in the poll were asked about “Obamacare”; the other half were asked about kynect.\nKynect itself is one of the new law’s state success stories; more than 413,000 residents signed up for health coverage under the new law before March’s enrollment deadline. Last month, Kentucky Gov. Steve Beshear called the implementation of the Affordable Care Act in the state an “indisputable success” and noted that 75 percent of the applicants were previously uninsured.\n(Beshear, by the way, has an impressive 63 percent approval rating in the state, with just 22 percent of registered voters disapproving of his job performance, according to Marist.)\nIt may prove to be a tricky narrative for the state’s senior senator, Senate Majority Leader Mitch McConnell, who’s running neck-and-neck with Democrat Alison Lundergan Grimes in November’s general election. McConnell, one of the health care law’s leading opponents, is underwater statewide but remains popular with his own party.\nThe margin of error for registered voters asked about either Obamacare or kynect was +/- 2.9 percent for 1160 registered voters. The margin of error for questions about McConnell, Beshear and Obama’s approval ratings was +/- 2.0 percent for 2353 registered voters. The poll was conducted April 30 through May 6, 2014.","url":"https://www.nbcnews.com/politics/first-read/polling-obamacare-label-makes-big-difference-n102861"}
