{"authors":[],"date_download":"2018-10-30 18:39:37","date_modify":"2018-10-30 18:39:37","date_publish":"2016-09-12 18:23:25","description":"Welcome to the first of many installments of \"In Progress,\" a regular column wherein I – Becca Godwin – will try my damnedest to provide answers to your – my beloved AJC readers – questions.","filename":"data/vaneerConsumption/InProgressWhatisgoingupbehindAcademyinSnellville.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/09/12/Images/photos.medleyphoto.11344440.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_progress-what-going-behind-academy-snellville__1540924777.html","title":"In Progress: What is going up behind Academy in Snellville?","title_page":"In Progress: What is going up behind Academy in Snellville?","title_rss":"NULL","source_domain":"ajc.com","text":"Welcome to the first of many installments of \"In Progress,\" a regular column wherein I – Becca Godwin – will try my damnedest to provide answers to your – my beloved AJC readers – questions. Your queries can be about anything related to developments in Cobb, DeKalb, Gwinnett and North Fulton. What are they building on that one corner? Why did they tear down that historic building? Are we ever going to get an In and Out?\nFor now, I’ll answer a question that I came across while scouring the interwebs. But in the future, you can reach me at becca.godwin@ajc.com, or on Twitter at @BeccaJGGodwin, with anything you may want to know. There's also a submission form below. Seriously, try me. You just might be surprised.\nAlright, away we go...\nDear Becca-by-way-of-Reddit: “What is going up behind Academy in Snellville? What isn't going up there really. But yeah, off Janmar behind Academy. Did a lot of clearing.”\n—fishandgrits\nFirst, you should know that I got side-eyed by my colleagues for being overly excited about your username. Secondly, fishandgrits, I would like to thank you for allowing me to borrow your question from Reddit. It should be a win-win situation since last I checked, your brilliant question hadn’t yet been answered. (The comment from someone who hopes an incinerator is going up there is, while thought-provoking, not exactly helpful.)\nSO. You’re absolutely right that there’s a lot going on — or trying to go on — in that area: A proposal for 99 single-family homes and 300 apartments down the road from Academy Sports + Outdoors was rejected Tuesday. But, I digress. Back to the matter at hand.\nWhat’s going up behind Academy is… drum roll please… Brookwood Walk, a single-family residential community with 27 detached homes.\nNow, fishandgrits, hopefully that isn’t a letdown for you. Hopefully talk about new communities gets you as excited as does seafood paired with coarsely ground corn kernels.\nIn fact, I can just hear the gears in your mind turning now...\nYou: Well, well, how many square feet will these homes be?\nMe: An area of 2,300 or more. Bonus answer: they’ll be laid out on 12.10 acres. Bonus bonus answer: they will be \"a size, quality and price point commensurate with or exceeding homes in nearby communities,\" the application tells us.\nYou: Okay, but I bet you don’t know what the general architectural style and composition of the exterior of the homes shall be.\nMe: Wow, your faith in me is disappointing. They will be made up of brick, stacked stone, cedar shake-type, hardi-plank shake-type or hardi-plank siding or combinations thereof.\nYou: Color me impressed. What else can you tell me?\nMe: Just that the application from Corridor Property Group was received in August 2015 and approved in October.\nAnd that the development should be completed by the second quarter of 2017, according to a developer. (Construction on streets and infrastructure has started, you see.)\nOh, and that if you’re ever in Thomasville, Georgia, you can find your presumed favorite meal at a place called Jonah’s.\n—\nI, Becca Godwin, am a staff writer with the AJC and a lover of metro Atlanta. To submit “In Progress” questions, contact me at becca.godwin@ajc.com, @BeccaJGGodwin on Twitter or via the form below.","url":"https://www.ajc.com/news/local/progress-what-going-behind-academy-snellville/UMS4vffpYqmyeuJ0fSu2fM/"}
