{"authors":["Bethanne Patrick"],"date_download":"2018-10-23 01:19:48","date_modify":"2018-10-23 01:19:48","date_publish":"2018-08-25 00:00:00","description":"Lea Carpenter's new novel combines literary sensibility with genre readability, for a dark spy thriller about a young woman finding out all kinds of strange truths about her father's past in the CIA.","filename":"data/vaneerConsumption/InRedWhiteBlueHighPeaksAndLowBlows.json","image_url":"https://media.npr.org/assets/img/2018/08/24/2018-08-23-redwhiteblue-0553-ebogle_wide-587823f40c5b5fb6e00c11f6d62a7ea09b296c61.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_25_641557246_in-red-white-blue-high-peaks-and-low-blows_1540257588.html","title":"In 'Red, White, Blue,' High Peaks And Low Blows","title_page":"In 'Red, White, Blue,' High Peaks And Low Blows : NPR","title_rss":"NULL","source_domain":"npr.org","text":"In 'Red, White, Blue,' High Peaks And Low Blows\nA book combining literary sensibility with genre readability: It happens, but not as often as I'd like. So when I cracked open Lea Carpenter's Red, White, Blue a few weeks ago, I was thrilled to find that this second novel from the author of 2013's Eleven Days is a dark spy thriller with plenty of plot but even more meaning – and no hint of sophomore slump.\nIf you're accustomed to devouring these kinds of books, even the smartest and most sophisticated from the likes of Alan Furst, Jason Matthews or Daniel Silva, you'll have to slow down a little, at least at first, to take in Carpenter's modus operandi. Her protagonist is Anna, a young woman whose delayed honeymoon along the Cote d'Azur is interrupted by a stranger who turns out to be a CIA colleague of her father's — a father she believed ran a Manhattan advertising behemoth. Given that Anna's father died in a freak avalanche just before her Alpine wedding, she is willing to listen to the stranger — and many of the book's brief, taut chapters are narrated by him as he attempts to glean information from Anna without alerting her to the fact that there's a serious exfiltration in place, in China, and Anna's public acknowledgement of any suspicion around Noel's death might jeopardize that operation.\nWhile that is a seriously good setup, I found myself much more captivated by the nameless narrator's descriptions of CIA life (which may or may not be accurate; Carpenter says at the end that her book is \"fiction\" and that none of her interviewees disclosed classified information. She doesn't claim to reveal the truth about CIA (insiders never refer to it as \"the CIA,\" by the way); rather, her narrator's talk about \"The Farm\" (Camp Peary, near Williamsburg, Va.), his many different cell phones, and his long explanation of how a source is cultivated become their own kind of truth.\nIf what he says isn't really the way things happen, it matters not. There's still an internal coherence to Carpenter's \"information,\" and true or not, the way the narrator and his colleagues operate supports the exercise they're involved in. If you're accustomed to reading fat spy novels in which every dotted i and crossed t has been cross-checked with government sources, you'll need to engage your willing suspension of disbelief.\nWhat doesn't work as well as the espionage talk is the character development. Anna, despite her stellar education (Princeton), languages (French and Russian), and career (Ford Foundation), remains a cipher, a sort of intelligence-world \"Flat Stanley\" whose life reflects the spooks around her. However, that may be deliberate. Carpenter is concerned with truth — and not in a simple way. She has characters discuss that concept's slipperiness, how truth and fact can diverge, especially when it comes to things we construct to \"measure\" truth, like the polygraph machine (if you ever take one, be sure to curl your toes while you're hooked up to the device). Carpenter's chosen epigraph is from Norman Mailer's essay \"A Harlot High and Low,\" here in part: \"It is painful, nonetheless, to relinquish one's hope for a narrative, to admit that the study of the CIA may not lead to the exposure of facts so much as to the epistemology of facts.\"\nCarpenter is concerned with truth — and not in a simple way.\nThe clouds on the book jacket, a nod to Anna's post-avalanche obsession with weather, will remind the reader of how difficult any kind of grief is, how it obscures truth and facts and memory. Her father was obsessed with \"spectral evidence,\" the kind that colonial judge Increase Mather declared inadmissible during the Salem Witch Trials in 1692. (As many will remember, his son Cotton Mather believed in spectral evidence and in its admissibility, so much the pity for the women tried in his \"court.\") Says the narrator: \"Some things are elegant in theory, Anna, but bloody in practice. Like believing in witches. Or evil.\"\nSome novels are elegant in theory, but bloody in practice, too — Red, White, Blue tries something new in mashing together high concepts and low blows. It doesn't always succeed, and a few loose ends are left (again, that might be a deliberate choice Carpenter has made). But I'd rather experience the rough edges of a book like this than the smoother ones of something simplistic.\nBethanne Patrick is a freelance writer and critic who tweets @TheBookMaven.","url":"https://www.npr.org/2018/08/25/641557246/in-red-white-blue-high-peaks-and-low-blows"}
