{"authors":["Will Martin"],"date_download":"2018-10-30 22:53:19","date_modify":"2018-10-30 22:53:19","date_publish":"2018-07-27 00:00:00","description":"Two new students at the Insead, the French university, complained they were made to undertake 'humiliating' initial rituals during the school's 'welcome week.'","filename":"data/vaneerConsumption/Inseadsuspendswelcomeweekafterstudentscomplainofhumiliation.json","image_url":"https://amp.businessinsider.com/images/553fbf326da8110a05a27559-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_insead-suspends-welcome-week-humiliation-2018-7_1540939999.html","title":"Insead suspends welcome week after students complain of humiliation","title_page":"    Insead suspends welcome week after students complain of humiliation - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Facebook/insead\nInsead, one of the most prestigious business schools in the world, has suspended the \"welcome week\" for its MBA program after two students complained they were made to undertake \"humiliating\" initial rituals during the week.\nThe school, based in Fontainebleu, just outside of Paris, took the decision to suspend the introductory week after the students said they were \"tricked\" into the initiations, although details of what these entailed have not yet been made public.\nAs first reported by the Financial Times, the incident has now been referred to the so-called Comité National Contre le Bizutage, or National Committee against Hazing.\nAccording to the FT, the incident is believed to pose a threat to the renewal of Insead's academic accreditation, which is soon up for renewal.\nInsead, ranked second in the world for MBAs by both QS and the FT, has a long tradition of unofficial initiations for students, with the practice generally undertaken in an attempt to deflate the egos of new starters, many of whom have begun successful and lucrative careers in the business world, before stepping back to embark on the MBA program.\nInitiation rites reportedly include tricking students into joining fake sports clubs which require their initiates to undertake gruelling physical challenges, often involving exercising until they are sick.\nWhile the university is taking the complaints seriously, the decision to suspend the welcome week has not gone down well among many of the university's alumni. According to eFinancial Careers, some alumni have started to refer to the year's new class as \"'Weicheier und Heulsusen' or 'wimps' (literally 'soft eggs') and crybabies.\"\nOne alumnus quoted by eFinancial Careers said that \"the only ones humiliated by the Welcome Week were those who were too full of themselves.\"\nAlumni approached by the Financial Times had a similar view. Reshma Sohoni, who graduated in 2003, told the paper: \"There are always one or two people who get upset about being humiliated but I think it builds character. It is about not taking yourself too seriously.\"\nThe school has acknowledged the feelings of alumni, but said that the wellbeing of students must be prioritised at all times.\nIn a letter to alumni, dean Ilian Mihov said that the school needed to shut down welcome week in order to comply with the investigation into the complaint.\n\"We understand that there is strong support for the welcome week tradition in the alumni community,\" Mihov wrote, according to the FT's report.\n\"However, student health and wellbeing are our top priority and welcome week cannot continue if it moves students to file a formal complaint.\"","url":"https://www.businessinsider.com/insead-suspends-welcome-week-humiliation-2018-7"}
