{"authors":[],"date_download":"2018-10-30 21:46:41","date_modify":"2018-10-30 21:46:41","date_publish":"2018-10-30 21:20:00","description":"When confronted by deputies, Paul Hamilton admitted, “I shot that boy deader than (expletive),...","filename":"data/vaneerConsumption/InshockingdecisionBarrowjudgegrantsnewtrialinmurder.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/Local_Wsbtv/2018/10/30/Images/863204980_paul%2520hamilton_web_1540931235883.jpg_13536428_ver1.0_640_360.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_barrow-judge-gra_6874a7970091cf6f3f63fb789b7a5289__1540936001.html","title":"In shocking decision, Barrow judge grants new trial in murder","title_page":"In shocking decision, Barrow judge grants new trial in murder","title_rss":"NULL","source_domain":"ajc.com","text":"When confronted by deputies, Paul Hamilton admitted, “I shot that boy deader than (expletive),” according to a report filed by the Barrow Sheriff’s Department.\nHamilton, a former Barrow County magistrate judge, was soon charged with the October 2015 murder of Brandon Lay, whom Hamilton believed had recently broken into one of his mobile homes near Winder. Earlier this month, Hamilton stood trial and was convicted of murder by a jury.\nAt Hamilton’s sentencing hearing on Thursday, Chief Judge David Motes sentenced him to life in prison. But, in an extremely unusual decision, the judge immediately made his own motion for a new trial for Hamilton and granted it. Then, he granted Hamilton bond and allowed him to be released from custody.\nThe decision stunned both the prosecution and defense.\nBarrow Sheriff Bud Smith, whose office investigated the case, is not happy with Motes’ ruling.\n“A human being lost his life at that man’s hands,” Smith said Tuesday. “You depend on the system to do the right thing. I just think this was a gross misuse of power.”\nMotes, who is retiring from the bench on Wednesday, could not be reached for comment.\nAccording to a transcript of the sentencing hearing, Motes told Hamilton he was not finished after he imposed the life sentence. He said he was so surprised when the jury convicted Hamilton of murder and aggravated assault he couldn’t even remember what the appropriate sentence was.\n“I don’t know how you felt, Mr. Hamilton, but I could not sleep Friday night,” the judge said.\nThe judge said he believed he’d made mistakes in rulings during the trial. He also described himself as the “13th juror” in the case and didn’t believe the evidence presented at trial supported a conviction.\nMotes, who’s been a judge for more than two decades, told Hamilton he determined “a new trial is consistent with the principles of equity and justice. … I cannot end my career with what I believe to be an injustice.”\nWhen Motes was finished, Hamilton thanked the judge and then said, “Your honor.”\nBut Motes cut him off. “It might be best to say nothing,” he said.\nAssistant District Attorney Sarah Griffie then told Motes, “The state obviously objects to everything that just happened.”\nTo which Motes replied, “I’m sure you do. And there are ways that the state of Georgia can appeal. … You are as surprised as I was the day Mr. Hamilton was convicted.”\nAtlanta defense attorney Don Samuel, who has written books on Georgia criminal case law, said Motes’ decision to grant a new trial based on the judge’s own court motion was highly unusual.\n“But it doesn’t strike me as being problematic,” Samuel said. “One of the grounds for granting a new trial can be that the judge was unhappy with the verdict. And the judge does indeed sit as the 13th juror.”\nDistrict Attorney Brad Smith declined to comment on Motes’ ruling.\nSmith said his Sheriff’s Office investigators had built a strong case against Hamilton. “I felt the evidence was insurmountable that Hamilton was guilty,” he said.\nAccording to incident reports, Hamilton had allowed hunters onto his property and at one point they saw Lay and two women driving away from Hamilton’s unoccupied trailer. When spotted by the hunters, Lay sped off, Smith said.\nAfter 911 was called and officers responded, Hamilton, 75 at the time and a resident of Hoschton, showed up at the scene and said: “I’m going to be searching for him.”\nHamilton then said if he found Lay before the deputies found him, “You’ll have to call the coroner,” Smith said.\nAbout 30 minutes later, deputies, responding to a new 911 call, found Lay, 34, inside his truck at the intersection of Old Hog Mountain Road and Charlie Hall Road, according to reports. He’d been fatally shot in the head.\nIf Lay did break into Hamilton’s place, he made off with a plastic bucket or two and some eating utensils, Smith said.\nLay’s mother, who lives in Michigan, had flown down to watch the trial and returned home before the unusual sentencing hearing, Smith said. “Now she’s found out her son’s convicted killer has been let go. I feel sorry for her.”\nJarret Sliz, one of Hamilton’s lawyers, said the defense is pleased with Motes’ decision.\n“We were certainly surprised,” Sliz said. “We’re still researching the way he did it. It was definitely unusual.”","url":"https://www.ajc.com/news/local/barrow-judge-grants-new-trial-murder-case-highly-unusual-ruling/E4kYnr0Irz3vv1SvoT3djO/"}
