{"authors":["Kenneth Dickerman","Photo Editor"],"date_download":"2018-10-21 03:01:21","date_modify":"2018-10-21 03:01:21","date_publish":"2018-08-08 10:00:51","description":"Associated Press photographer Ben Curtis documents the effort to curb elephant deaths in Tanzania.","filename":"data/vaneerConsumption/InsidetheefforttosaveAfricaselephantpopulation.json","image_url":"https://www.washingtonpost.com/resizer/A1GWchnDk4Fm5JwckiAp3Ugl5K4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HIMCXHHGTAZSPOPSHSD3PK3JXY.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_08_08__1540090881.html","title":"Inside the effort to save Africa’s elephant population","title_page":"Inside the effort to save Africa’s elephant population - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Photo Editor\nA team of wildlife veterinarians uses a vehicle and a rope to turn over a tranquilized elephant so they can attach a GPS tracking collar and remove the tranquilizer dart at Mikumi National Park, Tanzania. (Ben Curtis/AP)\nTwo young elephants play in Mikumi National Park. (Ben Curtis/AP)\nAccording to the World Wildlife Fund, between 20,000 and 30,000 African elephants are killed each year. They are mostly killed for their tusks, which are sought after in Asia. To help curtail elephant poaching, the WWF has teamed up with the government of Tanzania in a program to collar elephants in that country’s Selous Game Reserve area. With the help of satellite collars, the program is monitoring 60 elephants in an effort to better protect them against poachers.\nThe collars are fitted with technology that receives information from satellites. That information can be accessed by rangers on their mobile phones. This helps rangers track the elephants’ movements so that they can help them if they enter an area where a lot of poaching has happened or if they drift into human settlements. The program is the largest collaring effort that has been carried out in Tanzania.\nIn March, the Associated Press took a look at how the collaring program is working. The AP traveled to the Selous Game Reserve and its neighboring Mikumi National Park. The AP says that, according to the Tanzanian government, the area saw a decline in its elephant population of 60 percent to 43,000 between 2009 and 2014. Most of the killings happened in the Selous-Mikumi area.\nThe AP also found that the effort to save elephants is working, at least partly. It reported that killings of elephants have started to decline, and some of the herds that had previously been devastated have shown signs of recovery. While this is a positive turn of events, there is still a lot of work to be done because there is still an illegal market there that is hungry for ivory. According to the AP, “it’s far too early to declare a turnaround. Poachers are moving to new areas, and traffickers are adapting, aided by entrenched corruption. The rate of annual elephant losses still exceeds the birthrate. And the encroachment of human settlements is reducing the animals’ range.”\nWildlife veterinarian Ernest Mjingo, center, runs as an elephant starts to charge toward him after being darted with a tranquilizer. (Ben Curtis/AP)\nA small herd of elephants is seen from an airplane in Mikumi National Park. (Ben Curtis/AP)\nWildlife veterinarian Justin Shamancha prepares to fire a tranquilizer dart at an elephant. (Ben Curtis/AP)\nA dart containing the elephant tranquilizer etorphine hydrochloride strikes the side of an elephant. (Ben Curtis/AP)\nWildlife veterinarian Ernest Mjingo walks toward a tranquilized elephant. (Ben Curtis/AP)\nA team of wildlife veterinarians uses a vehicle and a rope to turn over a tranquilized elephant to attach a GPS tracking collar. (Ben Curtis/AP)\nA team of wildlife veterinarians transports a GPS tracking collar as they walk through thick bush in search of an elephant to tranquilize. (Ben Curtis/AP)\nVeterinarians prepare darts containing an elephant tranquilizer. (Ben Curtis/AP)\nA wildlife veterinarian stands over the trunk of a tranquilized elephant. (Ben Curtis/AP)\nA tranquilized elephant on the ground. (Ben Curtis/AP)\nAn armed wildlife ranger stands guard near a tranquilized elephant in case others approach. (Ben Curtis/AP)\nA herd of elephants forms a protective circle against a perceived threat, just after one was shot with a tranquilizer dart. (Ben Curtis/AP)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nArtist Omar Victor Diop’s work ‘recasts history and the global politics of black resistance’\nFor these underprivileged young women in France, rugby provides strength, resilience and empowerment\nAn intimate, lyrical and poetic portrait of wrestling in Senegal","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/08/08/inside-the-effort-to-save-africas-elephant-population/"}
