{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 05:41:56","date_modify":"2018-10-23 05:41:56","date_publish":"2016-01-29 21:24:55","description":"Italian police say they have arrested 'dangerous fugitives' Giuseppe Ferraro, 47 and Giuseppe Crea, 37, who both face long prison sentences, after raiding an underground bunker.","filename":"data/vaneerConsumption/InsidetheundergroundMafiabunkerwherepolicearrestedtwofugitives.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/20/30B5291700000578-0-image-a-23_1454098954195.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423425_Inside-underground-Mafia-bunker-decked-guns-tomatoes-ricotta-police-arrested-two-Italy-s-dangerous-fugitives_1540273316.html","title":"Inside the underground Mafia bunker where police arrested two fugitives","title_page":"Inside the underground Mafia bunker where police arrested two fugitives | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Officers also found weapons, food and even ricotta in Calabria stronghold\nItalian police say they have arrested two of the country's 'most dangerous fugitives' after raiding a secret underground bunker.\nPolice said they are now trying to find a network of accomplices they suspect helped 'Ndrangheta clan bosses Giuseppe Crea and Giuseppe Ferraro elude capture for 10 years and 18 years respectively by hiding in the stronghold in southern Calabria.\nCrea, 37, faces 22 years in prison for Mafia association; Ferraro, 48, was sentenced to life imprisonment, including for a murder conviction.\nAn unidentified man, left, being arrested by Italian police after the raid on an underground bunker\nTwo fugitive 'mobsters', Giuseppe Ferraro, 47, and Giuseppe Crea, 37, were found at the bunker, pictured\nA huge cache of weapons was also found in the stronghold in the countryside of southern Calabria, Italy\nThe two had a dozen firearms, including a Kalashnikov, neatly hung up on a wall, video released by police of the bunker's interior showed.\nAlso hanging from a wall was a pasta pot. Tomatoes, salad and what looked like a plate heaped with ricotta were on the counter.\nDespite it being dug deep into the ground the hideout was furnished with electricity, and the mobsters had a satellite TV and a computer, police said.\nVines and bushes camouflaged the hideout in the province of Reggio Calabria.\nAnother man arrested in the sting on the bunker, which had food such as tomatoes and ricotta, pictured,\nThe raid, pictured, was designed to capture two of the country's 'most dangerous' men\nCrea had been a fugitive since 2006 when he was convicted of mafia association while Ferrera had been on the run for 18 years after being sentenced to life in prison for murder\nAn image released by Italian police shows the bunker was furnished and stocked with food and wine\nFerraro is considered one of the last survivors of a decades-long ferocious 'Ndrangheta clan feud that claimed at least 20 lives, according to police.\nAmong those victims was a mobster whose body was fed to pigs and a nine-year-old boy who was accidentally shot when his grandfather's car was mistakenly fired on, daily Corriere della Sera reported.\nAnnouncing the capture of the pair, Italian interior minister Angelino Alfano noted they were \"both on Italy's list of most dangerous fugitives\".\nAuthorities described the two as being clan bosses from 'Ndrangheta territory near Gioia Tauro, a port on the Tyrrhenian coast which, investigators have long maintained, the syndicate frequently uses as a base for activities such as drug and arms trafficking.\nOfficers are now searching for a network of accomplices who helped hide the mobsters for so long\nItalian authorities say they hope the double capture will send a message to organised crime in nearby areas\nPolice officers went in armed and dressed in camouflage and body armour for the dangerous mission, pictured\nHelicopters were also used to ensure no one managed to evade the authorities and escape the bunker\nThis hideout was in remote farm country. But many of the bunkers discovered by police hunting for other 'Ndrangheta mobsters in Calabria have been found tunnelled under farm buildings or reached through hidden trapped doors leading from kitchens, bedrooms or other rooms in homes.\nFugitive mobsters prefer to stay close to their power bases, where they can count on logistical support and rely on the reluctance of locals to tip police, turning on its head the expression to \"being on the run\".\nAfter convicted Cosa Nostra chieftain Bernardo Provenzano was captured in 2006 in a farmhouse near Corleone, Sicily, after 43 years as a fugitive, prosecutors said he was able to live on farmland right near his home base because family and friends brought him food and freshly laundered clothes and bedding.\nInvestigators hope the latest capture will send a message to people in the nearby town of Rizziconi, whose city council was sent packing by the Italian central government because of infiltration by organised crime.\nThe cocaine-trafficking 'Ndrangheta is one of the world's most powerful criminal organisations.","url":"https://www.dailymail.co.uk/news/article-3423425/Inside-underground-Mafia-bunker-decked-guns-tomatoes-ricotta-police-arrested-two-Italy-s-dangerous-fugitives.html"}
