{"authors":["Kenneth Dickerman","Photo Editor"],"date_download":"2018-10-21 02:56:32","date_modify":"2018-10-21 02:56:32","date_publish":"2018-06-22 10:00:46","description":"Photographers Paul Kranzler and Andrew Phelps explore Green Bank, West Virginia.","filename":"data/vaneerConsumption/InsidetheUSsNationalRadioQuietZonewheretheresnoWiFiorcellphoneservice.json","image_url":"https://www.washingtonpost.com/resizer/gs94bBqxFpy2luSY_B9h0wcgoGc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CLZHDSGNCQYUJCBKVOKBHVVFDQ.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_06_22__1540090592.html","title":"Inside the U.S.’s ‘National Radio Quiet Zone’ where there’s no WiFi or cellphone service","title_page":"Inside the U.S.’s ‘National Radio Quiet Zone’ where there’s no WiFi or cellphone service - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Photo Editor\n(Paul Kranzler and Andrew Phelps/Fountain Books)\n(Paul Kranzler and Andrew Phelps/Fountain Books)\nIn 2015, after seeing a photo of the giant Green Bank Telescope in West Virginia, photographers Andrew Phelps and Paul Kranzler became intrigued and traveled to the area to see it for themselves. They would eventually spend weeks photographing the area and getting to know the residents and scientists. The result is a new book, “The Drake Equation.” In the book, the Drake Equation is defined as the following:\n“The Drake equation, created in 1961, is an assumption of our chances of finding extraterrestrial life from other star systems. Astrophysicists use this equation, and the highly sensitive radio telescopes, to search the edge of the universe looking for signs of life. The equation encapsulates all of the variables relevant to establishing the number of intelligent civilizations in the Milky Way galaxy which may be broadcasting radio signals at a particular time.”\nIn the 1950s, the U.S. government created a “National Radio Quiet Zone” to protect radio telescopes from interference by electromagnetic radio waves. The telescopes, located in West Virginia, are used for both scientific and military purposes. The zone encompasses an area of about 13,000 square miles. But the restrictions are strongest in Green Bank, W.Va., where the world’s largest steerable radio telescope resides at the Green Bank Observatory. Scientists from around the globe use the telescope to explore the universe, searching for signs of extraterrestrial life.\nThe restrictions mean the area does not have widespread WiFi or cellphone access. People use landlines to communicate. While this would be a problem for many of us at a time when everything seems to be connected by electronics, there are people who welcome it. Those who believe they suffer from “electromagnetic hypersensitivity,” (some even claiming to be allergic to WiFi, for example) have relocated to the zone, and it has become a haven for them.\nThe zone is a fascinating place, and the work of Phelps and Kranzler introduces us to it. Journalist Alard von Kittlitz, who worked alongside the photographers, says in the book, “I think that while the work you are holding in your hands is about many things, about time and science and technology and nature, at least to me it is essentially a work about America.” Here are some of the photos from the book.\n(Paul Kranzler and Andrew Phelps/Fountain Books)\n(Paul Kranzler and Andrew Phelps/Fountain Books)\n(Paul Kranzler and Andrew Phelps/Fountain Books)\n(Paul Kranzler and Andrew Phelps/Fountain Books)\n(Paul Kranzler and Andrew Phelps/Fountain Books)\n(Paul Kranzler and Andrew Phelps/Fountain Books)\n(Paul Kranzler and Andrew Phelps/Fountain Books)\n(Paul Kranzler and Andrew Phelps/Fountain Books)\n(Paul Kranzler and Andrew Phelps/Fountain Books)\n(Paul Kranzler and Andrew Phelps/Fountain Books)\n(Paul Kranzler and Andrew Phelps/Fountain Books)\n(Paul Kranzler and Andrew Phelps/Fountain Books)\n(Paul Kranzler and Andrew Phelps/Fountain Books)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nWhat life is like in the coal-mining boomtowns of Appalachia\nDeeply poetic photos focus on the nexus of ‘chronicle and fiction’\n‘That world where veils, blood and smoke go hand in hand with cosmic philosophy.’ Photographs from the black metal scene in Iceland.","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/06/22/inside-the-u-s-s-national-radio-quiet-zone-where-theres-no-wifi-or-cellphone-service/"}
