{"authors":["Associated Press"],"date_download":"2018-10-22 22:24:40","date_modify":"2018-10-22 22:24:40","date_publish":"2016-01-11 03:11:36","description":"BEVERLY HILLS, Calif. (AP) — \"Inside Out\" was on the mind of the Hollywood Foreign Press Association. The colorful tale from Pixar about a team of emotions c...","filename":"data/vaneerConsumption/InsideOutwinsGoldenGlobeforbestanimatedfilm.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:3fef08c0fabc44008c92fd9ca22a2c7d-56CX32zFKLb7123928b84c985a6c-135_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393285_Inside-Out-wins-Golden-Globe-best-animated-film_1540247080.html","title":"'Inside Out' wins Golden Globe for best animated film","title_page":"'Inside Out' wins Golden Globe for best animated film | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'Inside Out' wins Golden Globe for best animated film\nBEVERLY HILLS, Calif. (AP) — \"Inside Out\" was on the mind of the Hollywood Foreign Press Association.\nThe colorful tale from Pixar about a team of emotions coexisting inside a young girl's noggin won the Golden Globe for best animated film on Sunday night.\n\"When I was in junior high, literally, my goal was to make it through the day without no one noticing me,\" said \"Inside Out\" writer-director Peter Docter. \"Obviously, something went horribly wrong tonight.\"\nPete Docter, left, and Jonas Rivera pose in the press room with the award for best motion picture - animated for ¿Inside Out¿ at the 73rd annual Golden Globe Awards on Sunday, Jan. 10, 2016, at the Beverly Hilton Hotel in Beverly Hills, Calif. (Photo by Jordan Strauss/Invision/AP)\nAmy Poehler, Bill Hader and Mindy Kaling portray the characters Joy, Fear and Disgust in the film.\nDespite the movie's success, Docter and producer Jonas Rivera told reporters backstage that they have no plans for a sequel to \"Inside Out.\" Instead, they're working on an entirely new project.\n\"We'll put some thought into it,\" joked Doctor.\nThe other animated nominees Sunday were \"Anomalisa,\" ''The Good Dinosaur,\" ''The Peanuts Movie\" and \"Shaun the Sheep Movie.\"\n___\nOnline:\nhttp://www.goldenglobes.com\n___\nFollow AP Entertainment Writer Derrik J. Lang on Twitter at http://www.twitter.com/derrikjlang.","url":"https://www.dailymail.co.uk/wires/ap/article-3393285/Inside-Out-wins-Golden-Globe-best-animated-film.html"}
