{"authors":["Kenneth Dickerman","Photo Editor","Charlie Cordero"],"date_download":"2018-10-21 03:01:27","date_modify":"2018-10-21 03:01:27","date_publish":"2018-08-15 10:00:58","description":"Photographer Charlie Cordero explores 'Generation Z' in Colombia.","filename":"data/vaneerConsumption/InsidetheworldofColombiasGenerationZ.json","image_url":"https://www.washingtonpost.com/resizer/Z3q9sDwtbnk8GDTe25u_ReESH4c=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3RFXLRJXYAZMVOTX6ECJHHKI5E.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_08_15__1540090887.html","title":"Inside the world of Colombia’s ‘Generation Z’","title_page":"Inside the world of Colombia’s ‘Generation Z’ - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Twenty-year-old Effy has been attracted to women for as long as she can remember. She studies art at the Universidad del Atlántico. She was raised by her grandparents after her parents separated because of drug addiction. (Charlie Cordero)\nGirls watch the sunrise on a beach just outside the city of Santa Marta, Colombia. (Charlie Cordero)\nPhotographer Charlie Cordero had always been interested in what he calls the world of the image. Even while studying social communication at a university, he wanted to be a storyteller. In 2013, Cordero realized he wanted to tell stories with a camera. He ended up working at El Heraldo, the paper for the city of Barranquilla, Colombia, as a photographer and documentary photographer.\nDelving into the world of photography, Cordero was motivated by its social nature and “the possibility of being able to give voice to those who do not have it, and more in a country like Colombia, one of the most unequal countries in the world,” he said.\n“I felt the need to go to places where nobody dared to go and tell what happened there,” he said. “And not only the bad but also the good, the dreams and the hopes of the population. . . . I was also attracted to the possibility of learning about things I do not know — personally, the best way to know about something I do not know is to photograph it.”\nCordero also teaches photography at a university. Most of his students are between 16 and 20, a generation sometimes referred to as “Generation Z.” From an early age, they have been immersed in technology and the Internet. As a teacher, Cordero noticed that his students approached the world differently than even he did, at 28.\n“This project was born under the need to be able to understand them, to approach their ways of seeing the world, to understand how they relate to each other and society. . . . I perceived profound differences in the way they faced issues such as sexuality and privacy, so I decided to photograph them and learn about them,” he said.\nCordero told In Sight that this generation is the key to the future of Colombia: They are the first generation that will live in a Colombia at peace and be responsible for maintaining that peace and for issues such as the economy and environment.\nIn the end, Cordero said, the goal of his project is “to give testimony to the way in which future generations relate to the societies in which they live. I was also interested in showing those new features that differentiate us or make us equal — conceptions about privacy or sexuality — and to explain how they relate to each other in a virtual and personal way.”\nHarold greets his best friend, Osiris, through a door in his building. This was the first time they had seen each other in two years. (Charlie Cordero)\nLaura, 23, at a gas station outside Barranquilla, a place that has become a meeting spot for her group of friends. (Charlie Cordero)\nEffy and Melanie sit in a parking lot on the outskirts of the city. (Charlie Cordero)\nInside one of the clubs where teenagers hang out. (Charlie Cordero)\nJessica Cepeda, 19, studies foreign languages at the Universidad del Atlántico. She said that she is addicted to marijuana, consuming it multiple times a day. (Charlie Cordero)\nEffy’s neck shows the effects of drug use. (Charlie Cordero)\nTeenagers enjoy a Halloween party. In Colombia, most of this generation tends to listen to electronic music or Latin rap. (Charlie Cordero)\nMary is best known by the name “La Guasona” because of her hair color. This 19-year-old dreams of being a hip-hop singer; her first song talks about the role of women in today’s society. (Charlie Cordero)\nA teenager dances at a party. (Charlie Cordero)\nA teen wears sneakers and colorful socks. (Charlie Cordero)\nEffy, Maria Laura and Elena eat fried chicken. This generation is characterized by having an uncomplicated style. Comfort and practicality are important for them. (Charlie Cordero)\nAngelo shows off his tattoo. (Charlie Cordero)\nPipe celebrates his 22nd birthday with his friends. A marijuana blunt serves as the candle on his cake. (Charlie Cordero)\nBecause they are constantly connected to technology, some in Colombia say that this generation is living more “virtual” lives — and that they have very short attention spans. (Charlie Cordero)\nThis generation is the first to be born with the ability to find information immediately through the Internet, which has influenced the way they see the world. (Charlie Cordero)\nMelanie and her girlfriend celebrate her 19th birthday at a nightclub. (Charlie Cordero)\nAlvaro Santrich, or “Itto,” hangs out with friends. He is 23, a drummer for a local rock band and a student. (Charlie Cordero)\nEffy stands in the ocean. (Charlie Cordero)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nConfronting depression with photos, this artist’s works are ‘keen emotional witnesses to this broken world of ours’\nArtist Omar Victor Diop’s work ‘recasts history and the global politics of black resistance’\nInside the effort to save Africa’s elephant population","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/08/15/inside-the-world-of-colombias-generation-z/"}
