{"authors":["Kenneth Dickerman","Photo Editor","Terje Abusdal"],"date_download":"2018-10-21 03:00:45","date_modify":"2018-10-21 03:00:45","date_publish":"2018-07-20 10:00:34","description":"Norwegian photographer Terje Abusdal documents the \"Forest Finns.\"","filename":"data/vaneerConsumption/InsideamostlyfadedcultureonNorwaysborderwithSweden.json","image_url":"https://www.washingtonpost.com/resizer/KExVngJ_xBbWKCwiglZJFPxQk1Q=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/T4M7CBA3746WJCXEJMAEHH2KZ4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_07_20__1540090845.html","title":"Inside a mostly faded culture on Norway’s border with Sweden","title_page":"Inside a mostly faded culture on Norway’s border with Sweden - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Woman with a shaman drum. Svullrya 2015. (Terje Abusdal)\nLindalstorpet farm by Lake Skasen, one of the first farms to be settled in Finnskogen. Grue Finnskog 2016. (Terje Abusdal)\nA new book coming out this year from the publisher Kehrer Verlag, called “Slash & Burn,” tackles a unique subject — a mostly faded culture situated on the border between Norway and Sweden. The book is about a group of people who came to be called “Forest Finns.” Norwegian photographer Terje Abusdal became interested in documenting the culture when he was a student at the Danish School of Journalism. What began as his final project in school soon expanded, and he would eventually spend several years immersing himself in what was left of the culture.\nThe Forest Finns live in a forested area in southeast Norway near the border with Sweden. They started settling in that area, from Finland, in the 1600s. The families who were making their new homes there were farmers. They employed the slash and burn method of farming, burning down parts of the forested area so that they could grow rye. This group of people also had shamanistic roots and were often associated with magic and mystery. Most of that culture has evaporated, but there are still some around, trying to preserve some of their traditions and rituals, such as Jan Oddvar Storberget. Storberget is one of the people introduced to us in Abusdal’s book as he delves into what remains of the Forest Finns’ culture. Storberget lives on a farm in the forest and still hand milks his cows every morning. DNA tests have confirmed that he is the only person in Norway who is 100 percent Forest Finn.\nWhen making the photographs for “Slash & Burn,” Abusdal tried to incorporate some of the mystery that has surrounded the Forest Finns. The work began with a straightforward approach but evolved as Abusdal interacted more with the people in the communities. Some of the work is collaborative with his subjects; it’s not a traditional journalistic approach. In the book, writer Aaron Shuman addresses some of this:\n“Throughout Slash & Burn, the conventional clarity of the photographic image is often blurred and obscured — by smoke, mist, vapor, dust and darkness — which transform the solidity of the world we think we know into something much more ethereal and atmospheric…. And in a sense, when it comes to this field, Abusdal’s artistic approach is in itself a form of slash-and-burn cultivation, in that through various forms of photographic disorientation, deconstruction and destruction, he creates a new, fertile layer of information and meaning; photographic ashes which are rich with the nutrients needed for newfound notions of personal understanding and cultural identity to grow.”\nBefore being published as a book, “Slash & Burn” was the winner of the Nordic Dummy Award in 2017, and the project also won the prestigious Leica Oskar Barnack Award in 2017. Abusdal lives and works in Oslo. You can see more of his work on his website.\nPortrait of Sissel Borg on the ice at Vermundsjøen. Åsnes Finnskog 2016. (Terje Abusdal)\nRed bush at Lindalstorpet farm. Grue Finnskog 2016. (Terje Abusdal)\nBorder between Sweden, left, and Norway at Moldusen. An approximately 20-meter wide clearing in the forest separates the two Scandinavian nations, consequently cutting Finnskogen in two. Grue Finnskog 2016. (Terje Abusdal)\nPortrait of Rahilii, a healer and clairvoyant living in the Swedish part of Finnskogen. Sunne 2016. (Terje Abusdal)\nShooting range target. Svullrya 2016. (Terje Abusdal)\nPortrait of Frank Rismoen (1952—2016). Svullrya 2014. (Terje Abusdal)\nAbandoned house in Tiveden National Park, one of the southernmost areas populated by Forest Finns. Sweden 2016. (Terje Abusdal)\nSkid marks in the Savonia region, the epicenter of the Forest Finn migration in the 17th century. Finland 2015. (Terje Abusdal)\nPortrait of Jan Oddvar Storberget from the Karhinen bloodline. Storberget lives on Hytjanstorpet farm deep in the forest and still milks his cows by hand every morning. His DNA test shows he is 100 percent Forest Finn — the only person in Norway known to be so. Grue Finnskog 2016. (Terje Abusdal)\nA declaration of independence for the Republic of Finnskogen has taken place every second weekend in July since 1970. It is a three-day celebration of the region’s Finnish heritage, complete with an outdoor theater play. Svullrya 2016. (Terje Abusdal)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nThousands entered the iPhone Photography Awards contest. These are the winners.\nHaunting images of life on the St. Lawrence River in Canada\n‘I photograph life, not death, because death cannot be seen’","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/07/20/inside-a-mostly-faded-culture-on-norways-border-with-sweden/"}
