{"authors":["Graham Rapier"],"date_download":"2018-10-30 22:46:54","date_modify":"2018-10-30 22:46:54","date_publish":"2018-07-29 00:00:00","description":"In a nasty, two-year-long and still running divorce battle, Sue Gross alleges her ex-husband, bond titan Bill Gross, has made her life a living hell through an army private spies, harassment, and even fake farts in their California mansion. Here's the inside story of the couple's fall from grace.","filename":"data/vaneerConsumption/InsideBillGrosshighprofilebillionairedivorcecase.json","image_url":"https://amp.businessinsider.com/images/5b4f6debfd0b911b008b46f7-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_bill-gross-pimco-divorce-2018-7_1540939614.html","title":"Inside Bill Gross' high-profile billionaire divorce case","title_page":"    Inside Bill Gross' high-profile billionaire divorce case - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bill Gross, cofounder and cochief investment officer of Pacific Investment Management Co., or Pimco, at the Morningstar Investment Conference in Chicago, June 19, 2014. REUTERS/Jim Young\nThe text came in at 7:23 a.m. on Valentine's Day 2018:\n\"Good morning ... checking in at Newport Beach.\"\nLater that afternoon the private investigator texted his boss again:\n\"She left the house around 8:00 am while Joseph came back from jogging around 8:30 am, than she came back home around 10:00 it was quiet most of the day, she just left with her sister at 3:50 pm 'in a black Mercedes Benz' sedan.\"\nThat conversation is one of hundreds between Empire Intelligence agents, hired by billionaire bond investor Bill Gross, to monitor the whereabouts of his ex-wife, Sue Gross and her family members.\nThe texts were revealed in court documents from an ongoing suit between the two in which Sue alleges the 74-year-old billionaire has stalked, harassed, and threatened her and her relatives.\nBill, in reciprocal filings, alleges his ex-wife has also harassed him and his assistant over the course of the couple's yearslong, high-profile divorce case — one that has involved public spats, dead fish, and a fake Picasso painting.\nIt wasn't always this way\nBill Gross in his 1965 Duke yearbook. Duke University Archives Bill Gross, a young Vietnam veteran in Los Angeles by way of Middletown, Ohio, founded the Pacific Investment Management Co. in 1971 after graduating from Duke University just five years before.\nAs business was beginning to take off, Bill, a recent divorcé, was set up on a blind date with Sue Frank, then a clerical worker. They were married shortly after, in 1985.\nOver the course of the next decades, the firm, known as Pimco, would grow to $2 trillion by making bond investing accessible to the masses of retail investors. Gross' Total Return Fund hit a peak of $293 billion, in April 2013, and by the next year, Pimco funds would eventually account for 14 cents of every dollar invested in taxable bonds, according to Morningstar data.\n\"Gross is one of those high-profile names that contributed to the explosion of bond trading and innovation back in the '70s and into the '90s with other names like Ron Ryan of Ryan Labs, Lew Ranieri at Salomon Brothers, and Larry Fink with First Boston, and then obviously BlackRock,\" Rich Sega, global chief investment strategist for Conning, which oversees about $132 billion in assets, told Business Insider.\nAs Pimco grew, so did Gross' bank balance. When the company was purchased by German insurer Allianz in 1999, Gross locked in a $200 million annual salary, more than 20 times the pay of Allianz's chief executive at the time.\nOver time his riches ballooned to as much as $2.5 billion, according to Forbes.\nAfter seeing a heart-wrenching \"60 Minutes\" report in 2012, the couple reportedly started writing anonymous $15,000 checks to workers laid off from the Space Shuttle program after NASA ended it. Gross subsequently made a pledge to donate $2 billion of his wealth, telling Bloomberg at the time that the amount was \"staggering, even to me.\"\nTogether, the couple became synonymous with Southern California philanthropy, with Sue leading their eponymous foundation. Hospitals and research wings throughout the state bear the Gross family name, as well as a $10 million Smithsonian Institution stamp-collecting gallery in Washington, DC, where the avid philatelist's collection is on display. Sue is no longer connected to the foundation, a representative said, and runs another under her own name.\nEventually, the high-flying bond market took a turn. Gross' fund performance stuttered alongside falling yields on US Treasuries. In 2013, the fund would post its second-worst annual performance in more than a decade. What's more, dissension was growing among the Pimco ranks — especially after Gross gave a speech while wearing sunglasses and sent clients an investment update that was mostly a eulogy for his recently deceased cat.\nWell before sunrise on a Friday in September 2014, at 5:30 a.m., the news flashed on Bloomberg Terminal screens and newspaper websites around the world: Gross had been fired.\nNot to be deterred — though he would later sue his former employer for wrongful termination and breach of contract — Gross joined Janus Partners, a much smaller firm, effective the very next Monday. His new office is visible from Pimco's Newport Beach headquarters, and just a five-minute walk away.\nBill Gross' new Janus office, just steps from Pimco's Newport Beach headquarters. Google Maps\nInvestors yanked $23.5 billion from Pimco's total return fund, previously managed by Gross, following his departure in what Morningstar said were withdrawals of \"unprecedented magnitude.\" The outflows were so great that Pimco eventually ceded its title of world's largest bond fund to Vanguard. A representative for Pimco declined to comment for this article.\n\"Some people will look at a firm and trust the process without attaching their faith so much to an individual,\" Sega said. \"Other times it's the cult of personality that takes over. You really trust the guy instead of the firm. If the guy goes somewhere else you figure that same process will be replicated.\"\nWhile Gross was getting settled into hit new job, his marriage was unraveling\nA text message filed by Sue Gross in her application for a restraining order against her ex-husband. Court Documents\nBy the summer of 2016, Sue had moved out of the couple's $31 million seaside mansion in Laguna Beach, opting to split her time among their other two homes in the Los Angeles area because of Bill's \"increasingly erratic and abusive behavior,\" she alleged in court documents filed later that year.\nStill, Bill was convinced their matrimony was reconcilable and asked her multiple times to move back in, she claimed, even taking her to dinner at the upscale Bandera restaurant in October 2016. What happened at that Italian dinner was the final straw, Sue said in filings.\n\"Bill became livid with me while we were at the restaurant, and demanded, 'Are you coming back or not?!'\" Sue claimed. \"I was embarrassed and decided to leave the restaurant. Bill pursued me aggressively to my car. I was able to avoid him and quickly shut the car door. He stood with his face at the driver's side window, screaming at me. He said: 'That's what you always do — you run!' I was terrified.\"\nShe filed for divorce on November 22, 2016.\n\"After I filed the petition, Bill commenced a rampage against me and members of my family,\" she alleged in court filings. Sue and her attorneys filed copies of these emails with the court as part of her evidence in an application for a temporary restraining order against Bill.\n\"You are a piece of work and surely not a friend — for a long time — a coward too to not say why you really wanted a divorce. I feel utterly betrayed and will not shy from letting people know,\" Bill said in an email to Sue dated December 4, 2016 that was filed as evidence by Sue. \"You are disgusting — all will know — and I do mean all.\"\nIn September 2017, one month before the couple's divorce was finalized, Bill was invited by his adult son Nick to watch his rock band, Half the Animal, perform in Costa Mesa. Bill invited his girlfriend, Amy, to attend, and Sue was also in attendance.\n\"Bill saw Sue from afar,\"one of the hired guards claimed in court papers filed as part of Bill's application. A moment later, the guard claimed, Sue was making a beeline for Bill and Amy — and \"appeared to have her phone in one hand and a silver object in the other, which may have been a knife, although Bill is not certain.\"\n\"She was flailing her arms and was screaming other words that Bill and Amy could not understand,\" the testimony continues. \"Sue was acting irrationally as Bill had seen her act many times before. Bill was anxious and agitated about what Sue might do to him or Amy, who appeared fearful.\"\nBill later hired Empire Intelligence — a Los Angeles-based security, investigation, and protection firm — to keep tabs on all of Sue's whereabouts, as well as her twin sister, Susan Warpinski, her husband, Joseph Warpinski, and other sister, Sandra Stubban. He claimed in court the move was \"due to Sue's violent erratic, and threatening behavior\" toward him and his friends.\nSue has denied those claims in court and through a representative to Business Insider.\nAgents were posted outside at least four addresses frequented by Sue and her family members, according to text messages filed in court and pieced together by Business Insider. Sue's request for a temporary restraining order alleges that the agents were hired by Bill, showed up most days between 7 a.m. and 8 a.m., and detailed anyone entering or leaving those properties to a boss named Tony. Agents texted the manager to check out every evening about 7 pm\nEmpire Intelligence declined requests for comment through a representative.\nSue claims this behavior amounted to harassment, and that after the couple's divorce was finalized, she claims Bill's harassment only continued. Even though she had not been living in the couple's family home for two years, it was still jointly owned by both of them. But Sue claimed in court that Bill had been blocking her access to the house, keeping her from doing routine things like watering plants and tidying up.\n\"When I was finally able to obtain access to this house,\" she said in a filing last month. \"I was disgusted to see that Bill had left in a state of utter chaos and disrepair.\"\nThe filing added:\n\"I found empty bottles of 'puke' smell, and 'fart' smell in the garbage; the houseplants smelled foul and had to be replaced. The carpets were stained, and there was water damage throughout the house. A one of a kind art installation piece had been dismantled and removed. The remote controls for the televisions, drapes, and other technology were all missing. There were balls of human hair in the drawers. The electrical cord on a treadmill was severed and the tops of potted flowers were cut off. I even found fish and dirt stuffed into the air vents.\"\nSue also filed photos with the court of empty bottles of \"fake fart\" spray and similar bottles she says Bill sprayed in the home to make it reek. Through his lawyer Bill Gross denied these allegations to Business Insider.\nThe couple's prized Picasso\nPablo Picasso's \"Le Repos\" at Sotheby's auction house in London. Photo by Dan Kitwood/Getty Images\nSue is a noted fan of fine art. Bill even praised her abilities in a 2015 letter to investors, saying she loved to trace her own versions of famous works by projecting them onto a blank canvas.\nWhen it came time to divvy up their assets, in August 2017, Sue won a coin flip for \"Les Repos,\" a sensual 1932 painting of Picasso's \"golden muse\" and lover, Marie-Thérèse Walter.\nBut it turned out Sue had already had the painting. The piece on Bill's wall was a fake painted by Sue.\n\"Bill was shocked Sue already had the piece,\" an anonymous source told the New York Post, adding that Bill said, \"She stole the damn thing.\"\nThrough a representative, Sue claimed there was no way Bill could have been fooled by her imitation — no matter how pristine — because it had a different frame than the original Picasso.\n\"Le Repos\" finally sold this spring for $36.92 million at the Sotheby's auction house in New York.\nThe other priceless heirlooms acquired by Bill and Sue during their three-decade marriage — the antique clocks, luxury cars, and houses — have been divvied up.\nBut the couple's next court hearing doesn't take place for another seven months, in February 2019.\nAnd the private security guards are still on hire by Bill, a spokesperson confirmed.","url":"https://www.businessinsider.com/bill-gross-pimco-divorce-2018-7"}
