{"authors":["Kenneth Dickerman","Photo Editor"],"date_download":"2018-10-21 03:05:27","date_modify":"2018-10-21 03:05:27","date_publish":"2018-09-12 10:01:19","description":"Photographer Boris Leist goes inside the world of live action role players.","filename":"data/vaneerConsumption/Insidethefantasticalworldofliveactionroleplaying.json","image_url":"https://www.washingtonpost.com/resizer/85NZ6LTja5ST_5BHWm1OaVAn9co=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LE2JLR2NWE64PEAKSDX3DXIG7M.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_09_12__1540091127.html","title":"Inside the fantastical world of live-action role playing","title_page":"Inside the fantastical world of live-action role playing - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Photo Editor\nWhat is LARP? It is an acronym for live-action role playing, a phenomenon inspired by fantasy board games, films, literature and computer games. People who are into LARP outfit themselves as their favorite characters such as orcs, dwarfs, zombies and vampires, among others. Photographer Boris Leist takes us into this world with his latest book, “LARP,” which will publish this year by Kehrer Verlag.\nA few years ago, Leist met a man in the LARP community. The man was dressed as a dwarf, and Leist was impressed by the quality of the man’s costume and the passion he had for role playing. Although the man was an IT professional in real life, he was so committed to LARPing that he was taking a welding class so that he could build armor for himself. This passion and commitment inspired Leist to go deeper into the LARP community and meet more of its members. Leist ended up spending three years delving into that world and compiling portraits.\nWriting in the introduction to “LARP,” English American video game developer Richard Garriott de Cayeux, who also goes by the moniker Lord British, gives us a little more insight into what motivates people to enter the world of role playing. He says:\n“Early in my career, I realized the power of role playing. Players of my early games would tell me about some deeper meaning they found in my games that I had never, at least consciously, put there. Quickly I realized that at the very least I had an opportunity, maybe even a responsibility, to insure that the content I put into my role-playing scenarios would have a positive influence on the people who experienced it. Combine this with the innate human desire to be whisked away to lands fantastical and new, escaping the trials of this life in exchange for a new set of rules, new adventures, new possibilities, and you have the best conditions for fantastic live action role playing.”\nLeist’s portraits give us a glimpse of this world.\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nInside the Swedish military presence on Gotland, the most strategic island for defense against Russian aggression\nCelebrating 30 years of photojournalism at Visa pour l’Image\nVoices of African photography: Reclaiming the black body","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/09/12/inside-the-fantastical-world-of-live-action-role-playing/"}
