{"authors":[],"date_download":"2018-10-22 21:39:05","date_modify":"2018-10-22 21:39:05","date_publish":"2014-06-05 22:21:32","description":"A journalist describes his visit to an Air Force base set up to house the thousands of unaccompanied minors who have been crossing the U.S. border.","filename":"data/vaneerConsumption/InsideLacklandAFBAMassiveShelterForBorderChildren.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/490671/140605-joint-base-san-antonio-lackland-1602_64a6bbfcf36b678fbbd7e519594ed71c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_inside-lackland-afb-massive-shelter-border-children-n124036_1540244345.html","title":"Inside Lackland AFB, A Massive Shelter For Border Children","title_page":"Inside Lackland AFB, A Massive Shelter For Border Children    ","title_rss":"NULL","source_domain":"nbcnews.com","text":"We’re told that a total of 102 Spanish speaking case workers meet with 300 children in this room every day. Their primary task is to connect the kids with family. One key requirement - their family member or sponsor must agree to guarantee the children will show up at all of their immigration court appearances.\nNext we’re taken to a classroom where a group of 30 or so students are learning basic English. We’re told the kids also are taught math, and that religious studies are available for those who are interested. Arts and crafts are also offered – and as a result, the walls of the classroom, just as in the dorm areas, have several drawings of flags of the children’s home countries. I see one with the caption ‘La Bandera De Guatemala’. Nearby are several flag drawings of Honduras, El Salvador, a few from Ecuador, and even one from Oaxaca, Mexico.\nAfter that, we’re shown a very elaborate medical clinic. A row of staff work busily at laptops, although we don’t see anyone being treated. We’re told that new arrivals are given medical check-ups, vaccinations, and treatments twice for scabies and lice. They are also given mental health assessments before being allowed into the shelter.\nArts and crafts are also offered. As a result, the walls of the classroom, just as in the dorm areas, have several drawings of flags of the children’s home countries.\nThere are ample resources to ensure the children's health; 58 medical professionals are now on staff here, including an emergency room pediatric physician, nurse practitioners, registered nurses, LVNS, EMT paramedics and an advanced life support EMS unit. A pharmacy has been established on base and even a clinical psychiatrist is available. Sick children who may be contagious are taken first to a well-equipped mobile medical unit – and then to a hospital if necessary.\nAt the dormitories, there is literally a paramedic available on each floor. Here again, the feeling is more attuned to a summer camp experience. Seventeen 'House Rules' are posted, including ‘No Bad Words, Please’. There is a staff member for every 12 kids in the dorms, which have open sleeping areas with rows of beds. We see boys hanging out, talking, playing board games. A few make eye contact and smile. Others seem very curious as to who we are, while one sits alone to the side, reading a Bible. We notice that the dorms are warmer than what we’re typically used to as Americans. We’re told that’s because most of these child refugees are not used to air conditioning in Central America. Instead fans are used to cool areas of the large room.","url":"https://www.nbcnews.com/news/latino/inside-lackland-afb-massive-shelter-border-children-n124036"}
