{"authors":["Sophie Williams For Mailonline"],"date_download":"2018-10-23 00:14:14","date_modify":"2018-10-23 00:14:14","date_publish":"2016-01-29 12:55:28","description":"Images of factories in northern China reflect the downfall of steel and coal industries. Tangshan once produced more steel than the United States until the industry started to take a downward turn in 2014.","filename":"data/vaneerConsumption/InsideChinaszombiefactorysteelplantscompletelyabandoned.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1974700000578-0-image-a-30_1454068068351.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3422491_Inside-China-s-zombie-factories-Grim-pictures-bustling-steel-plants-completely-abandoned-nationwide-slashing-production_1540253654.html","title":"Inside China's 'zombie factory' steel plants completely abandoned","title_page":"Inside China's 'zombie factory' steel plants completely abandoned | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"China's steel industry was once a thriving area and a good source of employment for the country, but as the industry struggles with the declining economy, former plants have been left deserted.\nTangshan in north China's Hebei province has been hit hard with the downturn as steel plants have been left deserted and become 'zombie factories', the People's Daily Online reports.\nThis week, the Chinese government announced plans to cut down on steel and coal production in a bid to tackle overcapacity in the business.\nDeserted: Factories in Tangshan, 124 miles from the Chinese capital Beijing, has been left deserted as the country's steel and coal industries slash production capacity\nZombie factory: The character for the word emissions is written on the wall of the abandoned Qingquan Steel Plant\nEmpty: Workers lockers left deserted in Tangshan's Qingquan steel plant which closed in 2014 amid the industry's decline\nDesolate: Hebei province, long regarded as China's steel belt, once accounted for nearly a quarter of the country's steel output\nThis week, the Chinese government reported its slowest economic growth rate in 25 years and announced the slashing of production capacity in the country which could result in a loss of up to 400,000 jobs.\nThe government is planning to cut down steel production by up to 150 million tonnes reports the country's central news agency Xinhua.\nOfficials in the country are blaming excessive industrial capacity, a slump in demand and plunging prices as China's economy struggles.\nThese grim pictures show the desolated workshops and offices at the Qingquan Steel plant in Tangshan, which closed in 2014. It is just one of many factories in north China's Hebei province.\nThe area was once home to China's thriving Steel Belt and accounted for nearly a quarter of the country's steel output.\nTangshan is around 124 miles east of Beijing and at one point, produced more steel a year than the US.\nIn recent years, state-owned steel mills have been shut down and dozens of small privately owned plants in the area have gone bankrupt.\nIn Hebei, iron production will be cut to 10 million tonnes, steel will be cut to 8 million tonnes and cement will be cut to 1.5 million tonnes. While glass production will be cut to 6 million tonnes.\nOfficials point to excessive industrial capacity, a slump in demand and plunging prices as they attempt to restructure China's economy.\nAbandoned: State-owned steel mills have been shut down and dozens of small privately-owned plants in the area have gone bankrupt\nLeft behind: Machinery sits inside Qingquan Steel plant in Tanghan, northern China's Hebei province after it closed down in 2014\nThe central government announced that it will spend 100 billion yuan every year for the next five years to address overcapacity\nThe World Steel Association announced on Monday that global production of steel fell the most in six years during 2015. China accounted for the biggest decline.\nChina's central government says that it will spend 100 billion yuan every year for the next five years to address overcapacity in certain sectors including steel and coal.\nAccording to China International Capital, three million employees face layoffs if the steel, coal, cement, aluminium and glass industries cut production by 30 per cent over two to three years.\nAccording to Chinese media, most of the money will be used to help relocate and help workers.\nWhile addressing a Central State Composium on Wednesday, Premier Li Keqiang said: ''The steel and coal sectors should take the lead in cutting overcapacity, reducing costs and improving efficiency.'\nThe country is also turning towards more greener energy methods as it tries to tackle its problem with air pollution.\nLast year China invested £76billion in clean energy in a bid to tackle its air pollution issues according to Michael Liebreich, founder and chairman of the advisory board of Bloomberg New Energy Finance who spoke at a climate summit this week in Paris.\nPremier Li Keqiang said: ''The steel and coal sectors should take the lead in cutting overcapacity, reducing costs and improving efficiency.'\nGhost town: A task board is seen in the abandoned plant in Tangshan which was once the main steel production town in Hebei\nCleaner energy: Last year China invested £76billion in clean energy in a bid to tackle its air pollution issues","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3422491/Inside-China-s-zombie-factories-Grim-pictures-bustling-steel-plants-completely-abandoned-nationwide-slashing-production.html"}
