{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-23 01:12:57","date_modify":"2018-10-23 01:12:57","date_publish":"2016-01-11 11:55:06","description":"It has been revealed that honoured nominees and A-listers were gifted a goodie bag worth over £1,000, and judging by the contents, everyone really is a winner.","filename":"data/vaneerConsumption/InsidetheGoldenGlobesgoodiebagsAlistgueststakehomeluxuriousbeautygiftsaCaribbeanholidayandpersonalisedConversebutcanttheyafforditalready.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/300839E400000578-0-image-a-4_1452512722381.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393670_Inside-Golden-Globes-goodie-bags-list-guests-home-luxurious-beauty-gifts-Caribbean-holiday-personalised-Converse-t-afford-already_1540257177.html","title":"Inside the Golden Globes goodie bags: A-list guests take home luxurious beauty gifts, a Caribbean holiday and personalised Converse (but can't they afford it already?)","title_page":"Inside the Golden Globes goodie bags: A-list guests take home luxurious beauty gifts, a Caribbean holiday and personalised Converse (but can't they afford it already?)  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It is one of the most coveted awards in Hollywood - reducing winners and losers in equal measure to tears when the iconic gold statue is handed out.\nBut even the stars who don’t win a Golden Globe at Sunday night's ceremony didn't go home empty handed.\nIt has been revealed that honoured nominees and A-listers were gifted goodie bags worth over £1,000, and judging by the contents, everyone really is a winner.\nScroll down for video\nKate Winslet, left, and Jennifer Lawrence, right, may have been lucky enough to take home coveted Golden Globes but even the stars who didn't win at Sunday night's ceremony didn't go home empty handed. FEMAIL looks at the luxury contents of the goodie bags and treats offered to stars in the luxury gifting suites\nAccording to People, the goodie bag was packed with luxurious beauty treats crammed into a luxurious leather tote.\nInside the B Low The Belt Mila Leather Tote, which costs around $300 (£206), was the 3Lab Skin Care Hydra Day SPF 20, $87 (£60), Elizabeth and James Nirvana Black & Nirvana White Perfume Oil, $78 (£54), and Le Metier de Beaute – Kaleidoscope Travel Collection (cheek) for $100 (£69).\nThe men, meanwhile, apparently received a duffle bag full of male grooming products, headphones, candles and socks.\nIt has been revealed that honoured nominees and A-listers were gifted a goodie bag worth over £1,000, and judging by the contents, everyone really is a winner. There was the 3Lab Skin Care Hydra Day SPF 20, $87 (£60), Elizabeth and James Nirvana Black & Nirvana White Perfume Oil, $78 (£54), and Le Metier de Beaute – Kaleidoscope Travel Collection (cheek) for $100 (£69).\nAlso packed into the luxury leather tote goodie bag was a $24 (£17) body cream, left, and $10 (£6.99) L'Oreal lip gloss\nIf that wasn't enough, guests were invited to attend two luxury gifting suites to enjoy beauty treatments, take home luxury jewels and even a Caribbean holiday.\nGuests were invited to attend the pre-Golden Globe gifting suite at SLS Hotel, where they were gifted a three night stay for two at the Caribbean's Belmond La Samanna on the island of St. Martin, as well as luxury make-up and jewellery.\nOther gifts up for grabs included luxurious silk pillow cases, leather bound diaries and toothpaste made exclusively for teeth with porcelain veneers.\nAcross town, guests were also invited into the HBO Luxury Lounge at the Four Seasons Hotel in Los Angeles.\nThe likes of Golden Globe nominee Viola Davis, Aldis Hodge and O’Shea Jackson Jr. from Straight Outta Compton, the cast of Black-ish, Jodie Sweetin of Full House and Moore from Orange Is the New Black were treated to luxurious beauty treatments by Marc Jacobs Beauty.\nThere were also plenty of brands - including Victorinox, Nautica, Boiron, and KEEP Collective UPPAbaby - that were offering visitors freebies.\nThe men, meanwhile, apparently received a duffle bag full of male grooming products, including this shaver set, left, as well as headphones, candles and digital luggage scale, right\nActor Aldis Hodge - best known for portraying Alec Hardison on Leverage and MC Ren in Straight Outta Compton - gets a manicure at the HBO Luxury Lounge at the Four Seasons Hotel Los Angeles at Beverly Hills\nActress Jasmin Savoy Brown, left, and comedian Carrot Top, right, enjoyed being lavished in the suite, where they received beauty treatments from Marc Jacobs and personalised Converse\nActress Kelly Stables - known for her roles as Melissa on Two and a Half Men, and as Eden Konkler on The Exes - attended the HBO Luxury Lounge at the Four Seasons Hotel where she perused watches\nGifting suits are the best promotion luxury brands can't buy, especially if the celebrity is snapped with the product.\nBritt Johnson, founder of Mediaplacement Inc., the company that produces the event, told Forbes: 'The whole idea of it is to make it something like a junket for the brands so they can really showcase their product.\n'It’s not about who got what for free, who got this, who got that. For us it’s always been about introductions and creating new contacts for people.'\nBut free goods still remains the big appeal, and it is mostly lesser known stars that flock to these.\nTV personality/Creative Director of Marie Claire Magazine Nina Garcia, left, and comedian Carrot Top, right, attended the HBO Luxury Lounge at the Four Seasons Hotel where beauty treats, products and free totes were up for grabs\nThe biggest names in film and television joined forces on Sunday for the 2016 Golden Globe Awards - one of the biggest nights on the A-list calendar.\nHollywood's best and brightest descended upon the Beverly Hilton Hotel in Beverly Hills, and were dressed to the nines for the star-studded occasion.\nThe Revenant was the big winner of the evening in the drama category, with Leonardo DiCaprio taking home Best Actor, Alejandro González Iñárritu being named Best Director and the film taking home the biggest award of the night - Best Picture.\nIn the comedy category, The Martian took home Best Picture, with Matt Damon also winning Best Actor.\nMeanwhile, Sylvester Stallone won Best Supporting Actor in a Drama for the latest Rocky movie, Creed, and Steve Jobs went home with two gongs - one for Kate Winslet for Best Supporting Actress, and the other for Best Screenplay.\nActor Leonardo DiCaprio arrives to the 73rd Annual Golden Globe Awards held at the Beverly Hilton Hotel\nWill Smith, Jada Pinkett Smith and Taraji P. Henson arrive to the 73rd Annual Golden Globe Awards","url":"https://www.dailymail.co.uk/femail/article-3393670/Inside-Golden-Globes-goodie-bags-list-guests-home-luxurious-beauty-gifts-Caribbean-holiday-personalised-Converse-t-afford-already.html"}
