{"authors":["Associated Press"],"date_download":"2018-10-23 03:04:50","date_modify":"2018-10-23 03:04:50","date_publish":"2016-01-29 17:52:26","description":"KRUGER NATIONAL PARK, South Africa (AP) — A top U.S. official on Friday witnessed the ugly results of a rhino-poaching epidemic in South Africa and denounced...","filename":"data/vaneerConsumption/InSouthAfricatopUSofficialseespoachedrhino.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:122ee99598004c49a9b24f3ebeb3b119-4PuZeKVXE7cd9005b2c876cd51ad-922_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423021_In-South-Africa-US-official-sees-poached-rhino_1540263890.html","title":"In South Africa, top US official sees poached rhino","title_page":"In South Africa, top US official sees poached rhino | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In South Africa, top US official sees poached rhino\nKRUGER NATIONAL PARK, South Africa (AP) — A top U.S. official on Friday witnessed the ugly results of a rhino-poaching epidemic in South Africa and denounced the slaughter of the threatened species.\nU.S. Secretary of the Interior Sally Jewell saw the poached rhino in Kruger National Park, South Africa's biggest wildlife reserve and scene of some of the heaviest killing of rhinos, whose horns are coveted in some parts of Asia, particularly Vietnam.\nPark rangers escorted Jewell on a drive through the bush to see the body of the male rhino, estimated to be about 15 years old. It lay on the edge of a dry stream bed, its torso torn open by vultures and other scavengers. Flies buzzed and maggots squirmed. The smell of rotting flesh was pungent. The horns had been hacked off.\nInvestigators in South Africa¿s Kruger National Park stand on Friday, Jan. 29, 2016 near the carcass of a rhino that was killed by poachers for its horns. South Africa, home to most of the world¿s rhinos, is struggling to contain the slaughter of the threatened species. (AP Photo/Christopher Torchia)\n\"It's a terribly sad scene,\" said Jewell, who is visiting Africa to discuss ways to combat the illegal wildlife market, estimated to be worth billions of dollars globally.\nRangers were treating it as a crime scene, cordoning the area with tape. They used a metal detector to search for bullets and any other evidence that could be used in an eventual prosecution of suspected poachers, and carved out rhino flesh samples for DNA testing.\nFrik Rossouw, a senior investigator, said authorities found the rhino on Wednesday, and believe it had been shot on Tuesday.\n\"It's horrifying on the ground to see what poachers do to an iconic species of Africa for money that's being generated by an international market,\" Jewell said.\nJewell, also traveled to Gabon and Kenya this month to liaise on wildlife matters. In South Africa, U.S. initiatives include the donation of night-vision goggles and portable housing for rangers in Kruger.\nSouth Africa, home to most of the world's rhinos, reported 1,175 poached rhinos in 2015, a slight decrease from the previous year. In contrast, poachers killed nine rhinos in South Africa in 2007.\nThere are 22,000 rhinos in South Africa, said Edna Molewa, the country's environment minister. She accompanied Jewell to see the rhino carcass, saying it was important to erode the \"myth\" that rhino horn is an effective medicine.\nPublic relations campaigns in Vietnam have sought to reinforce the message that rhino horn, often consumed in powder form, cannot cure the sick. The horn consists of keratin, the same substance found in human fingernails.\nIn the fight against elephant poaching, last year the United States announced steps that would lead to an almost total ban on the domestic ivory trade there. China has made similar moves aimed at curbing the mass killing of African elephants.\nThe knife of a worker at South Africa¿s Kruger National Park rests on Friday, Jan. 29, 2016 on the hoof of a rhino that was killed by poachers several days previously. Workers treat such carcasses as crime scenes, searching for evidence that can be used in any prosecution of suspected poachers and collecting DNA samples from the dead rhino. (AP Photo/Christopher Torchia)","url":"https://www.dailymail.co.uk/wires/ap/article-3423021/In-South-Africa-US-official-sees-poached-rhino.html"}
