{"authors":[],"date_download":"2018-10-30 17:53:05","date_modify":"2018-10-30 17:53:05","date_publish":"2016-10-31 20:25:51","description":"A new report said airports don’t always account for employee badges properly, creating a risk...","filename":"data/vaneerConsumption/Inspectorgeneralrecommendsbetteroversightofairportbadges.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/31/Images/newsEngin.16648697_employee-screening.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_inspector-general-_4f8ff589396ae602e45e19e18177cf35__1540921985.html","title":"Inspector general recommends better oversight of airport badges","title_page":"Inspector general recommends better oversight of airport badges","title_rss":"NULL","source_domain":"ajc.com","text":"A new report said airports don’t always account for employee badges properly, creating a risk that unauthorized people could gain access to off-limits areas.\nThe report, prompted in part by missing badges at the Atlanta airport, recommended that the Transportation Security Administration improve its oversight of airport badges, particularly those that have been lost, stolen or are otherwise unaccounted for.\nThe report was issued this month by the U.S. Department of Homeland Security’s inspector general’s office. It began an inspection after reports last year of employee badges that had gone missing from U.S. airports, notably Hartsfield-Jackson International.\nThe Atlanta airport acknowledged last year that some 1,450 badges were missing over a period of about two years, out of about 39,000 such badges in use at the world’s busiest airport. The airport said the badges are de-activated once reported lost or stolen, and each displays a photo of the employee and is assigned a unique PIN, reducing the risk of illicit use.\nFour U.S. Senators sent a letter last year to the TSA asking for an accounting of lost or stolen badges at Hartsfield-Jackson.\nThe airport said at the time that no one with a lost or stolen badge had successfully gained access to secured areas, and that officials did not see the issue as a security threat.\nIn August 2015, Hartsfield-Jackson began screening workers at a new employee security checkpoint in response to a gun-running scheme involving a baggage handler uncovered in late 2014.\nThe inspector general’s report found that the issue of badges goes beyond Atlanta, with discrepancies in the numbers of active and unaccounted-for badges. A test found 62 badges were incorrectly listed as active and had to be deactivated. Those badges belonged to people who were no longer employed, whose employers had not reported the change to the airport, the report said. In some cases, the employers had collected the badges, but in others they had not.\n“Unless airport operators and employers properly account for the access media badges of individuals no longer employed at the airport, as well as lost and stolen badges, there is a risk that former aviation workers or unauthorized individuals can access nonpublic areas,” the report concluded. The public version of the report, which had “sensitive security information” redacted, did not cite any instances of misuse.\nTSA agreed with report recommendations to to conduct tests of badge controls, to better explain rules for lost and stolen badges, and to share best practices some airports use to mitigate the risks.\nTSA said it is adding more auditing and inspections, and continues to work with the IG’s office and the aviation industry to improve practices and oversight.\nHartsfield-Jackson said it will comply with any recommendations from the report.","url":"https://www.ajc.com/business/inspector-general-recommends-better-oversight-airport-badges/YnigyBs3NGPqnXOWLOZC3K/"}
