{"authors":[],"date_download":"2018-10-22 22:14:00","date_modify":"2018-10-22 22:14:00","date_publish":"2014-06-09 00:00:00","description":"Author, advocate, and Saddleback Church co-founder, Kay Warren, shares the moments that inspired her and changed the trajectory of her life.","filename":"data/vaneerConsumption/InspiredWithKayWarren.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/488281/140604-kay-warren-1809_91cb864c52cf28a4ef4c0c1a0695e4e6.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_maria-shriver_inspired-kay-warren-n126201_1540246440.html","title":"Inspired With Kay Warren","title_page":"Inspired With Kay Warren - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"Kay Warren Scott Tokar / Courtesy of Kay Warren\nThere are moments that cut through the churn of daily life, experiences that inspire action, prompt reflection, spur emotion and creation, and in this feature we ask individuals to share their own such moments.\nKay Warren is a mom and author, as well as an advocate for those living with HIV and AIDS, orphaned and vulnerable children, and those affected by a mental illness. She is also, alongside husband Pastor Rick Warren, the co-founder of Saddleback Church. Here, Warren shares love, loss, and a moment that called her to advocacy.\nI read a quote by Eric Liddell, Scottish Olympian in the 1924 Paris Games. He said, “Circumstances may appear to wreck our lives, but God is not helpless among the ruins.” I am comforted when I remember that God rebuilds the “ruins” of our lives, brings beauty from the ashes, and even restores forgotten joy.\nI saw an article in a news magazine about AIDS in Africa in 2002 that changed the trajectory of my life. AIDS became real to me in that moment and I chose the path of global advocacy for people living with HIV&AIDS and for the orphaned children left behind. I understood in a new way the power of words and photographs to convey reality.\nI visited a woman dying of AIDS who was living under a tree in rural Mozambique. I was stunned by the hospitality she offered when she invited me to sit with her on a torn plastic mat. I had nothing to offer her but my presence, my willingness to share her suffering. She is long gone, but I will never forget Joanna.\nI experienced catastrophic loss when my 27-year-old son took his life in 2013. Nothing could have prepared me for the depth of sorrow or the crushing grief that encompassed my soul when he died. Our family will never be the same, but we are slowly learning what this new “normal” looks like. My hope is firmly planted in the reality of Heaven.\nI met my husband when we were 17; he did a Billy Graham imitation (that he still does), and I thought, “That guy is really funny!” Forty three years later, some of the jokes are a little worn out, but there is no one who can make me laugh like he does.\nI heard Andrea Bocelli last summer at the Hollywood Bowl – one of the first times I went out in public after the death of my son a few months before. With each song Bocelli’s voice soared to the heights, and I closed my eyes and wept – the sound was so exquisitely beautiful that all I could do was cry in response.\nFor more information and inspiration visit MariaShriver.com","url":"https://www.nbcnews.com/feature/maria-shriver/inspired-kay-warren-n126201"}
