{"authors":["Laura Freeman For Daily Mail"],"date_download":"2018-10-23 00:14:33","date_modify":"2018-10-23 00:14:33","date_publish":"2016-01-29 13:02:13","description":"Take inspiration from the new 360-degree tour of Buckingham Palace's state rooms and give your home some Royal sparkle.","filename":"data/vaneerConsumption/InspiredbythenewvirtualtourofBuckinghamPalaceThengiveyourhomeatouchoftheRoyaltreatment.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30AC3DB400000578-0-image-a-29_1454072509692.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/property_article-3422762_Inspired-new-Buckingham-Palace-online-tour-home-touch-Royal-treatment_1540253673.html","title":"Inspired by the new virtual tour of Buckingham Palace? Then give your home a touch of the Royal treatment!","title_page":"Inspired by the new virtual tour of Buckingham Palace? Then give your home a touch of the Royal treatment! | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When the 18-year-old Queen Victoria came to the throne in 1837, she was enchanted with her new home.\n‘I rejoice to go into Buckingham Palace,’ she wrote, ‘my rooms are so high, pleasant and cheerful ... the garden is so large and very pretty.’ Alas, her delight did not last.\nGilded glory: The White Drawing Room at Buckingham Palace is interior design at its most flamboyant\nThe drains below the fashionable, new, indoor water closets did not drain and Londoners were in the habit of dumping their rubbish against the palace walls.\nThe chimneys belched smoke and the servants’ passages were so maze-like that hot water for baths was cold by the time it reached the royal rooms.\nVictoria’s courtiers complained bitterly. Her dresser Frieda Arnold wrote that she had ‘never been so cold in my whole life as I was for two days at the palace’.\nPrince Albert took matters in hand, building nurseries and a family chapel. But the couple still found their new home sooty, chilly and cramped. Frieda called the atmosphere ‘tomb-like’. Anyone looking at the palace today may find this incredible. Cramped? Chilly? Tomb-like? The rooms are splendid.\nVictoria moved to the Isle of Wight to escape her prying subjects. Our modern royal family have invited us in with a virtual through-the-keyhole tour.\nThe Royal Collection Trust, the charity that manages Buckingham Palace, has worked with Google to film a 360-degree tour of seven state rooms.\nMake an entrance: The beautifully symmetrical and decorative Grand Staircase at Buckingham Palace\nYou start in the Grand Entrance, climb the Grand Staircase, then enter the Green Drawing Room, the Throne Room, the Picture Gallery and the Ballroom.\nThe architect responsible for these sumptuous interiors was John Nash, who was engaged by George IV in 1822 to remodel what the king considered a rather modest ‘pied-à-terre’ into a palace fit for his court.\nGeorge had high ambitions. He once boasted that he wanted to ‘quite eclipse Napoleon,’ who had been magnificently remodelling much of Paris.\nIf the rooms on the Google tour look unpatriotically French with their rococo mouldings, swagged curtains and mirrored doors, it’s because Nash was under orders to out-Napoleon Napoleon.\nMirrored doors and walls are a clever way of making a modest room more palatial. Mirror Works (antiquemirrorglass.com) take on commissions for wardrobes, halls and bathrooms.\nFor acanthus leaf carvings of the sort Nash installed at the palace, try Andy Thornton (from £49, andythornton.com).\nRegal seating: The elegant Lille sofa by Swoon Editions emulates the ones in the Picture Gallery\nNash had flair, but no talent for managing a budget. Parliament had agreed to refurbishing costs of £150,000, but George talked them up to £450,000. In the end, they exceeded £500,000.\nA Parliamentary Select Committee accused Nash of ‘inexcusable irregularity and great negligence’ in the keeping of accounts.\nDesigners Guild has a smart set of wallpapers and fabrics inspired by the palace. Its linen toile de jouy Buckingham House is based on an engraving of the facade.\nThe upholstery fabric Royal Promenade is printed with lithograph reproductions of Queen Victoria, Albert and her children on horseback (designersguild.com).\nZoffany’s damask wallpapers such as Crivelli and Tours capture something of the look of the Green Drawing Room. Swoon Editions has a sofa — The Laurence (£799, swooneditions.com) — like the ones that line the Picture Gallery. Many of the Queen’s rugs are Axminsters.\nSevres porcelain, marble mantelpieces and gilded picture frames may be the stuff of when-I-marry-a-Prince fantasy, but the richness of colour at the palace, from the scarlet curtains to the yellow silk chairs would warm any home.","url":"https://www.dailymail.co.uk/property/article-3422762/Inspired-new-Buckingham-Palace-online-tour-home-touch-Royal-treatment.html"}
