{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-23 01:45:54","date_modify":"2018-10-23 01:45:54","date_publish":"2016-01-11 12:58:52","description":"A crop of Instagram pages celebrate women who refuse to shave their underarm hair. But the pages including Armpit Museum have proved controversial, with some calling it 'unattractive'.","filename":"data/vaneerConsumption/Instagramaccountsshowwomenproudlyshowingofftheirarmpithair.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/10/3007A51200000578-0-image-a-4_1452509397177.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393650_Women-proudly-flaunt-armpit-hair-trend-sees-Instagram-pages-devoted-going-au-naturel_1540259154.html","title":"Instagram accounts show women proudly showing off their armpit hair","title_page":"Instagram accounts show women proudly showing off their armpit hair | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A crop of Instagram pages have sprung up to celebrate women who refuse to shave their underarm hair.\nThe popular accounts post photos of women showing off their armpits in all their unshaven glory.\nThe latest addition, Armpit Museum, which launched just three days ago, posts images of women with their arms held high, proudly showing off wisps of hair - some even dyed in bright colours.\nA series of Instagram accounts aims to celebrate women going au naturel by sharing photos of them showing off their unshaven underarm hair. But despite thousands of followers between them, reactions are mixed\nThe latest addition, @armpit_museum, has been around for less than a week but posts regular photos of a range of women showing off their underarm hair, some of whom have dyed theirs in bright colours\nThe candid photos have proved controversial, with some followers proclaiming them 'beautiful' while others label them 'unattractive', and some even suggesting the women are taking feminism 'too far'\nAlthough it has a modest fan base of just 26 followers, and labels its photos with hashtags such as #armpitgirl and #armpitfetish, Armpit Museum is bound to flourish if other anti-shaving accounts are anything to go by.\nAnother account, PitAngels, posted its first photo just four months ago but has already attracted nearly 5,000 followers.\nIt shares photos taken from other girls' Instagram pages, showing women fully-dressed or frolicking in bikinis on the beach while showing off their pits.\nLady Pit Hair has been around since 2014 and has more than 5,000 followers. However, its decision to post the striking images is frequently met with criticism.\nOne user, elishbeahan, wrote beneath one photo: 'Some people take feminism to far, eww.'\n@pitangels also shares images of women's armpit hair, some of which is dyed in bright colours\nEqually unsure was another user, mapcab, who commented on a recent post: 'Why do you refuse to shave your hair? It's unatractive and dosent give u any benefits. Men shave for you.'\nThe page's owner replied: 'just because you're personal choices are based on what your culture tells you to do doesn't mean ours have to be.\n'we don't shave because we DO find it attractive. your opinion is not fact, and frankly we don't give a single f***.'\nYet despite the critics, it seems the pages also command a loyal band of supporters who are happy to jump on board, calling the look 'beautiful'.\nMany cite their personal reasons for not shaving, from 'I hate how it feels' to 'it hurts' and 'it's time consuming'.\n@ladypithair has more than 5,000 followers but its underarm hair photographs often prove controversial\nCommenting below this photo one user, elishbeahan wrote: 'Some people take feminism to far, eww'\nIt comes as a growing number of women eschew their razors in favour of going au naturel.\nLast year alone, Miley Cyrus and Jemima Kirke walked the red carpet with hairy pits.\nCommenting on the trend last summer, Refinery29's beauty editor Maria Del Russo said: 'I think the reason more and more women are using social media to show off their body hair choices is connectedness.\n'Since the idea of women having body hair is not considered the \"norm,\" women who feel that it is their norm are likely attempting to make connections with other women who feel the same way.","url":"https://www.dailymail.co.uk/femail/article-3393650/Women-proudly-flaunt-armpit-hair-trend-sees-Instagram-pages-devoted-going-au-naturel.html"}
