{"authors":["Jennifer Brett"],"date_download":"2018-10-30 17:53:48","date_modify":"2018-10-30 17:53:48","date_publish":"2016-01-21 16:38:43","description":"Brock O’Hurn, dubbed Hottest Guy on Instagram by BuzzFeed, will appear in a new Tyler Perry fi...","filename":"data/vaneerConsumption/InstagramhottieBrockOHurnandTylerPerryteamupfornewmovie.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/01/21/Images/WPIMAGE_cmgajcbuzz_8378.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_instagram-hottie-_5d8e014729950a7326fb9dd1b11d0d55__1540922028.html","title":"Instagram hottie Brock O’Hurn and Tyler Perry team up for new movie","title_page":"Instagram hottie Brock O’Hurn and Tyler Perry team up for new movie","title_rss":"NULL","source_domain":"ajc.com","text":"Brock O’Hurn, dubbed Hottest Guy on Instagram by BuzzFeed, will appear in a new Tyler Perry film. He announced the news - where else? - via Instagram.\nTyler Perry posts buff bod beach photos\nTyler Perry's $25 million estate still on the market\nTyler Perry and his newest leading man, Instagram hottie Brock O'Hurn (center).\nTyler Perry, Usher in Washington for Kennedy Center honors\nTyler Perry meets a special group of children grateful for his help\nO'Hurn will play a character named \"Horse\" in the upcoming \"Boo! A Madea Halloween.\" The site imdb.com lists a few past credits - “The Experience,” “Amphibious” and “Laguna Rising” - although they are all listed as \"in development.\"\nThe towering hunk is mostly known for standing around looking huge and hot. Notes BuzzFeed in a piece titled \"The Super Charmed Life of Instagram's Hottest Guy\": \"Brock O’Hurn is ... 6’7”, 250 pounds, tan, muscular, blue-eyed, with a light-brown, tousled mane that, when not grazing his often shirtless chest, sits in a perfectly messy topknot.\"\nBut he struck a humble chord in his Instagram post announcing the Tyler Perry movie:","url":"https://www.ajc.com/blog/buzz/instagram-hottie-brock-hurn-and-tyler-perry-team-for-new-movie/0ELUxTVnJ02Wgec0rMABpL/"}
