{"authors":[],"date_download":"2018-10-22 21:07:42","date_modify":"2018-10-22 21:07:42","date_publish":"2014-06-02 13:19:40","description":"Former Bush administration official Josh Valdez alleges his ex-employer cheated the government out of millions annually, charges the company denies.","filename":"data/vaneerConsumption/InsuranceCompanyCheatedMedicareOutof1BillionSaysLawsuit.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_investigations_insurance-company-cheated-medicare-out-1-billion-says-lawsuit-n120186_1540242462.html","title":"Insurance Company Cheated Medicare Out of $1 Billion, Says Lawsuit","title_page":"Insurance Company Cheated Medicare Out of $1 Billion, Says Lawsuit","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThis story was published by The Center for Public Integrity, a nonprofit, nonpartisan investigative news organization in Washington, D.C.\nJosh Valdez took an executive level job in April 2010 expecting to improve medical services at two Puerto Rican Medicare Advantage health plans owned by a subsidiary of New Jersey company: Aveta Inc.\nBut a few months after coming on board, the former government health official claims, he discovered that the plans -- MMM Healthcare and PMC Medicare Choice -- had been cheating Medicare out of hundreds of millions of dollars for years, according to a whistleblower lawsuit he filed in federal court.\nValdez accuses the health plans of “rampant fraud,” alleging they overcharged Medicare $300 million to $350 million a year from 2007 through 2010. He claims that Aveta Chief Executive Officer Richard Shinto fired him “in retaliation for his outspoken opposition to these illegal practices.” Valdez filed the lawsuit in Santa Ana, California, in April 2011, but it remained under court seal until February of this year. The case is pending.\nMEDICARE ADVANTAGE BILLING ERRORS COST TAXPAYERS BILLIONS\nIn a May 23 statement to the Center for Public Integrity, the health plans called Valdez a “former disgruntled employee” and added that the company “categorically denies the allegations in the former employee’s lawsuit and is highly confident that it will prevail in the case.”\nValdez is a veteran health care executive and consultant who headed the California regional office of the U.S. Department of Health and Human Services from 2001 through 2003 under President George W. Bush. He also was a health policy adviser to Republican Mitt Romney during the 2012 presidential race.\nClick here to read the Center for Public Integrity's version of this story.\nValdez said in court papers that he served as president of MSO of Puerto Rico, also owned by a subsidiary of Aveta, for eight months until his dismissal in December 2010. MSO worked with local doctors to coordinate coverage for some 230,000 elderly and disabled people then enrolled in those two Aveta-related Medicare Advantage health plans. In a press release touting his hire, Aveta said Valdez would enhance medical care while “effectively managing healthcare costs.”\nAveta’s Puerto Rico health plans and MSO are now operated by InnovaCare Health Solutions, according to the firm’s website. InnovoCare has the same Fort Lee, New Jersey office and phone number as Aveta. Several members of the Aveta board, including founding principal investor Daniel E. Straus, have been affiliated with both companies. Innovacare general counsel Christopher J. Joyce declined to discuss the corporate structure.\nStraus, a prominent investor in several health-care businesses, also has worked with hedge funds and as a New York City real estate developer. Joyce said Straus would have no comment.\nClick here to read the Center's investigation of Medicare Advantage overbilling.\nThe whistleblower suit is significant not only for the magnitude of overbilling it alleges. It also raises questions about federal oversight of billing practices by health plans that contract with the government to cover nearly 16 million Americans, at a cost expected to top $150 billion this year.\nThe federal government paid the two Puerto Rico plans a total of between $1 billion and $1.8 billion annually from January 2007 through December 2010, according to the suit. Up to $350 million a year was for bills that were “improperly inflated,” according to Valdez.\nValdez argues that the health plans sought out chronically ill patients, who command the highest Medicare payment rates, but overcharged for them by manipulating a billing formula known as a “risk score.” Medicare sets risk scores for all patients based on medical data submitted by the health plans that indicates how sick patients are. Sicker patients mean higher rates.\nThese scores “were false or fraudulent because they were based on diagnosis codes that were not substantiated by the medical records or by the medical conditions of the Medicare beneficiaries served by the plans,” the suit states.\nValdez said he was told by top executive Shinto in May 2010 that an internal audit of medical records had confirmed that two-thirds of patient risk scores could not be supported.\nAccording to Valdez, the audit results were discussed at several executive-level meetings, including some at which top brass talked about setting up a reserve fund in case federal officials should conduct their own review and demand refunds.\nAt a July 2010 meeting, Penelope Kokkinides, Aveta’s chief operating officer, allegedly said the company would be “screwed” if it was audited by the federal Centers for Medicare and Medicaid Services (CMS), especially if the review reached back to 2007. She said overcharges had been “particularly egregious” that year, as the suit paraphrased her alleged remarks.\nKokkinides estimated the liability to the government was as high as 20 percent of its total Medicare payment, or about $350 million a year, Valdez alleges. Kokkinides declined to comment on the suit.\nDuring his tenure there, Valdez said, company officials gave no indication they would “notify CMS of the problem or return the improperly obtained funds to the government,” according to the suit. CMS regulations not only require Medicare Advantage plans to attest that risk data they present for payment are accurate but also obligate them to return any overpayments they discover.\nStill, CMS largely trusts the nation’s 700 Medicare Advantage plans to report risk scores accurately and honestly -- and conducts only a smattering of yearly audits. There’s no indication that CMS officials reviewed the risk scores for the two Puerto Rican plans. In its 2012 annual financial report to insurance officials in Puerto Rico, MMM Healthcare stated that it had not been subject to a CMS payment audit.\nHowever, in late March of 2011, Valdez said he took his allegations to the U.S. Attorney’s Office for the Central District of California, which has since launched an investigation. That investigation “has not been completed,” government lawyers wrote in a January 2014 court filing.\nValdez blamed the faulty risk scores on errors in “medical status visit” forms filled out by the plans’ doctors. The visits were done to help identify “high risk” members and maximize payments for them. Doctors participated in a profit sharing arrangement that paid them 50 percent to 60 percent of surplus money that came in from Medicare as a result of the annual visits, according to the suit.\nThe lawsuit alleges that company officials failed to take “corrective measures to delete or filter out” inaccurate codes, although they knew the doctors had an incentive to inflate them.\nIn July 2010, executives decided to hold onto millions of dollars in these payments to the doctors in case CMS auditors required the company to repay money, according to the suit.\nThat concern didn’t dissuade company officials from borrowing $100 million, which was used to pay a dividend to investors, “the largest of whom was founder and Chairman Daniel E. Straus,” according to the suit. Valdez said he objected to paying the dividend while the potential liability to the government “remained unaddressed.”\nThe Center for Public Integrity is a nonprofit, nonpartisan investigative news organization in Washington, D.C.","url":"https://www.nbcnews.com/news/investigations/insurance-company-cheated-medicare-out-1-billion-says-lawsuit-n120186"}
