{"authors":[],"date_download":"2018-10-22 21:54:13","date_modify":"2018-10-22 21:54:13","date_publish":"2014-06-04 21:33:17","description":"A recently withdrawn lawsuit against Chicago-area cities for failure to prepare for climate change was likely the first of many to come, experts say.","filename":"data/vaneerConsumption/InsurersMessagePrepareforClimateChangeorGetSued.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/493301/140606-floods_1612_c1e59df9ff4c328df6a48475add92bcb.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_insurers-message-prepare-climate-change-or-get-sued-n122856_1540245253.html","title":"Insurer's Message: Prepare for Climate Change or Get Sued","title_page":"Insurer's Message: Prepare for Climate Change or Get Sued","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTo insurance companies, there’s no doubt that climate change is here: They are beginning to file lawsuits against small towns and cities who they say haven’t prepared for the floods and storms that will cost the companies billions in payments.\nEarlier this week, the U.S. arm of a major global insurance company backed away from an unprecedented lawsuit against Chicago and its suburbs for failing to prepare for heavy rains and associated flooding it claimed were fueled by global warming. While legal experts said the case was a longshot, its withdrawal didn't alter the message it contained for governments: prepare now for climate change or pay the price.\nAfter several days of ground-saturating rain last April, an early-morning train of intense storm cells passed over the greater Chicago area and overwhelmed the region's stormwater and sewage systems. Water gushed out of sewer inlets and backed up into basements.\n\"There was just nowhere for this water to go,\" Marilyn Sucoe, the stormwater administrator for the Village of Lisle, a ring suburb west of Chicago that was affected by the flooding, told NBC News.\nThe village was among about 200 municipalities named in the nine class-action lawsuits filed in March by Farmers Insurance Group.\nIt was \"the first loud shot in what I think will be a long-term set of litigation battles over failure to prepare for climate change,\" Michael Gerrard, who directs the Center for Climate Change Law at Columbia University in New York, told NBC News.\nThe subsidiary of the international firm Zurich Insurance Group argued in its lawsuit that the cities knew climate change had raised the frequency, duration, and intensity of regional rainfall since the 1970s and acknowledged vulnerabilities to increased flooding by adopting a Climate Action Plan in 2008.\nMore lawsuits to come?\n\"We hoped that by filing this lawsuit we would encourage cities and counties to take preventative steps to reduce the risk of harm in the future,\" the company said in a statement issued Tuesday by spokesman Trent Frager. That message, according to the statement, was heard. Going forward, Farmers said it would continue to work with the cities \"to build stronger, safer communities.\"\nAlthough Farmers' dropped its case against Chicago and the surrounding communities, it does little to alter the prospects for similar lawsuits in the coming years, according to Gerrard. This is especially true for private companies that lack legal protections which provide government agencies immunity from liability for discretionary decisions such as delaying infrastructure upgrades due to budget constraints.\n\"One could easily imagine architects and engineers being accused of professional malpractice for designing structures that don't withstand foreseeable climate-related events,\" he said.\nCities could become liable for negligence too if they, for example, decide to ignore new vulnerabilities exposed by a changing climate, according to Sean Hecht, a co-director of the Emmett Institute on Climate Change and the Environment at the University of California at Los Angeles' law school.\nWhile protecting citizens against damages from the type of storm that occurs once every 10,000 years may be unreasonable, \"whether they ought to be building and planning for a 10-year or 50-year or 100-year risk is a different question,\" Hecht told NBC News.\n'Power and influence'\nFarmers' decision to pull the case less than two months after filing may signal the insurer has shifted to a \"less legalistic approach\" to raise awareness among city planners of the need to prepare for climate change, Andrew Logan, who studies the insurance industry for Ceres, a Boston-based non-profit that advocates for a sustainable global economy, told NBC News\n\"It did seem like the lawsuit from the get-go was a way of raising awareness of the issue among cities,\" he said. \"Clearly, they achieved that very quickly and so, perhaps, they saw no need to go forward.\"\nHomeowners, too, need to hear this message, noted Sucoe, the stormwater administrator from the Village of Lisle. Stormwater, she explained, can just as easily infiltrate the sewage system from cracked pipes on private property as through the public drainage systems. \"So if you are really going to start throwing blame around … I don't know that you can point to the municipality,\" she said.\nFarmers', noted Logan, may have realized the complications in the case and opted to take a different route to buttress communities for a stormier future. Nevertheless, he added, the lawsuits and the attention they received underscore \"the power and influence that insurers have to truly change the calculus with which we all approach climate change.\"","url":"https://www.nbcnews.com/science/environment/insurers-message-prepare-climate-change-or-get-sued-n122856"}
