{"authors":["Brian Naylor"],"date_download":"2018-10-22 21:26:03","date_modify":"2018-10-22 21:26:03","date_publish":"2017-01-05 00:00:00","description":"A Senate hearing on the cybersecurity threat comes as intelligence agencies prepare to issue their report on Russia's involvement in the fall presidential campaign.","filename":"data/vaneerConsumption/IntelligenceChiefsStandMoreResolutelyBehindFindingOfRussiaElectionHacking.json","image_url":"https://media.npr.org/assets/img/2017/01/05/ap_17005531440915_wide-5444f7c0f85a6f9e85f5a3147ba24ea74e676d71.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2017_01_05_508355408_intelligence-chiefs-stand-more-resolutely-behind-finding-of-russia-election-hack_1540243563.html","title":"Intelligence Chiefs 'Stand More Resolutely' Behind Finding Of Russia Election Hacking","title_page":"Intelligence Chiefs Stand Behind Finding That Russia Hacked U.S. Political System : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Intelligence Chiefs 'Stand More Resolutely' Behind Finding Of Russia Election Hacking\nEnlarge this image toggle caption Evan Vucci/AP Evan Vucci/AP\nUpdated at 2:15 p.m. ET\nIntelligence agency leaders repeated their determination Thursday that only \"the senior most officials\" in Russia could have authorized recent hacks into Democratic National Committee and Clinton officials' emails during the presidential election.\nDirector of National Intelligence James Clapper affirmed an Oct. 7 joint statement from 17 intelligence agencies that the Russian government directed the election interference — and went further.\n\"We stand more resolutely on that statement,\" Clapper said during a Senate Armed Services hearing with the intelligence chiefs into the politically charged issue.\nClapper noted that the intelligence officials would not dive into many more details at this hearing, deferring to a broader, unclassified report on the election interference to be released next week.\nCommittee Chairman John McCain, R-Ariz., said there is no national security interest \"more vital to the U.S. than the ability to hold free and fair elections without foreign interference,\" and that \"every American should be alarmed by Russia's attacks on our nation.\"\n\"We will ascribe\" a motive for the Russian cyberattack in the upcoming report, Clapper said. He wouldn't say Thursday what it is, but it has been widely reported that the intelligence agencies agree that Russia was trying to get Donald Trump elected.\nClapper also said he will \"push the envelope\" to make much of that report unclassified without jeopardizing sources or intelligence-gathering details.\n\"The public should know as much about this as possible,\" Clapper said.\nIn addition to Clapper, testifying before the committee were Defense Undersecretary Marcel Lettre and Adm. Michael Rogers, commander of the U.S. Cyber Command of the National Security Agency. All three will be leaving their positions at the end of the Obama administration.\nOne of the first questions from McCain was about the involvement of Julian Assange, the founder of WikiLeaks. WikiLeaks published emails — from the account of Hillary Clinton's campaign manager John Podesta — that the intelligence community says were hacked by the Russians.\nAssange has denied the Russian government gave WikiLeaks the emails. McCain asked Clapper if Assange had any credibility.\n\"Not in my view,\" Clapper said, adding that Assange \"has put people at risk\" with revelations about U.S. intelligence gathering. \"I don't think those of us in the intelligence community have a whole lot of respect for him,\" Clapper said.\nPresident-elect Trump, however, has openly questioned whether Russia was involved in the hacking, pointed to errors the intelligence community made over the existence of weapons of mass destruction in Iraq and has appeared to back Assange in tweets.\nClapper also said there is a difference \"between skepticism and disparagement\" of the intelligence community. Trump has taken to Twitter, referring to \"Intelligence\" and its officials in quotations.\nClapper also testified that there is no evidence the Russian hacking changed vote tallies \"or anything of that sort.\" He did say, however, there is no way of gauging the impact of Russia's actions \"on choices the electorate made.\"\nMcCain asked Clapper if the Russian cyber-intrusion constituted \"an act of war.\" Clapper responded that constitutes \"a very heavy policy call,\" which, he said, \"I don't think the intelligence communities should make.\"\nBut he did say what was done carried \"great gravity.\"\nClapper added that Russia deployed more than just cyberattacks in its effort to disrupt the election, calling it a multifaceted campaign. \"The hacking was only one part of it,\" he said. \"It also entailed classical propaganda, disinformation, fake news,\" which he said was still going on.\nThere was a fair amount of talk about rocks and glass houses, with Republican Sen. Lindsey Graham of South Carolina calling the Obama administration's response to the hacking, a set of limited economic sanctions, just \"a pebble.\"\n\"When it comes to interfering with our election,\" Graham said, \"we better be ready to throw rocks.\"\nSen. Thom Tillis, R-N.C., noted the U.S. has also attempted to interfere in other nations' elections. \"We live in a big glass house,\" Tillis said, \"and there are a lot of rocks to throw.\"","url":"https://www.npr.org/2017/01/05/508355408/intelligence-chiefs-stand-more-resolutely-behind-finding-of-russia-election-hack"}
