{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 20:42:27","date_modify":"2018-10-30 20:42:27","date_publish":"2015-02-20 13:49:37","description":"As this horrible winter rages on, record low temperatures are being set from Chicago to Washington, D.C.","filename":"data/vaneerConsumption/IntenseColdSettingRecordsFromChicagotoDC.json","image_url":"https://media.breitbart.com/media/2014/12/snow-shovel-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_20__1540932147.html","title":"Intense Cold Setting Records From Chicago to D.C.","title_page":"Intense Cold Setting Records From Chicago to D.C.","title_rss":"NULL","source_domain":"breitbart.com","text":"As this horrible winter rages on, record low temperatures are being set from Chicago to Washington, D.C., and snow is still piling up in places like Maine and Vermont. It all adds up to dangerous winter conditions for much of the country, and it will continue for the next week.\nFor instance, on Thursday in Chicago the subzero cold broke records set back in the 1930s. Chicago’s O’Hare airport registered a brutal 8 degrees below zero with wind chills as cold as 30 below as winds gusted to 20 miles per hour.\nThe temperature broke a record set in 1936, besting the 79-year-old 9-below stat by one degree.\nDespite the record-breaking chill, though, Chicago Public Schools will open again on Friday allowing kids to renew their class work.\nChicago isn’t alone with record breaking cold. In Both Baltimore, Maryland and Washington, D.C., the bitter cold set records. D.C.’s Dulles Airport recorded a 15-degree high for the day, which broke the 1933 record of 28. Baltimore’s high was 18 degrees, beating the 19 degrees set in 1903.\nIn New York the cold was so harsh it froze part of Niagara Falls in place over night from Wednesday to Thursday.\nThe Arctic freeze is spreading from Canada south into the Midwest and near south and is pushing east from there, covering nearly half the country in bone chilling cold.\nBut it isn’t just cold temps that the front is bringing. A band of snow is also threatening to cover an 1,800 mile corridor in fresh, icy powder.\nMore snow is something that Portland, Maine doesn’t need. The area has already been hit so hard that it built a snow pile so high that it nearly broke FAA regulations and became a hazard to landing airplanes. Now the city is trying to find another place to dump more snow to avoid the problem.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com","url":"https://www.breitbart.com/politics/2015/02/20/intense-cold-setting-records-from-chicago-to-d-c/"}
