{"authors":["Associated Press"],"date_download":"2018-10-22 22:36:28","date_modify":"2018-10-22 22:36:28","date_publish":"2017-04-26 05:05:44","description":"NEW YORK (AP) - Internet companies are readying for a showdown with telecoms and a Republican-controlled government over a policy near and dear to their...","filename":"data/vaneerConsumption/Internetfirmswindingupforafightonnetneutrality.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446286_Internet-firms-winding-fight-net-neutrality_1540247788.html","title":"Internet firms winding up for a fight on 'net neutrality'","title_page":"Internet firms winding up for a fight on 'net neutrality' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - Internet companies are readying for a showdown with telecoms and a Republican-controlled government over a policy near and dear to their hearts: net neutrality.\nNet neutrality basically prevents broadband providers from playing favorites or steering users toward (or away from) particular internet sites. Under rules enacted during the Obama administration, the likes of Comcast and Verizon - which offer their own video services they'd very much like subscribers to use - can't slow down Netflix, can't block YouTube, and can't charge Spotify extra to stream faster than Pandora.\nBroadband companies hate the net neutrality rules, and they have an ally in new Federal Communications Commission chairman Ajit Pai, who has repeatedly called the regulations a mistake. Pai could launch the process of unwinding the rules as early as Wednesday, according to reports.\nEARLY TECH RESISTANCE\nThe government may downgrade federal prohibitions on anti-consumer and anticompetitive actions to voluntary commitments by internet service providers. The internet industry, which considers net neutrality essential for its business, isn't standing still - and it may be keeping some of its most potent tactics in reserve.\nMany internet companies are already running the Washington playbook - lobbying Congress, schmoozing government regulators, and signing letters of protest. Boston tech companies and venture capitalists met with Sen. Ed Markey, a Massachusetts Democrat, last Friday to discuss defending net neutrality.\nSmaller companies have made the loudest noises so far. Engine, a policy group for startups, is calling up small internet companies to keep them updated and asking them to sign a letter that urges the FCC not to dismantle the net neutrality rules.\nEtsy brought sellers to meet with legislators or their staff members in Washington last month, although the company says the visit involved other issues in addition to net neutrality. Roku, the streaming-video gadget maker, hired lobbyists to set up D.C. meetings for the first time.\nCALM BEFORE THE STORM\nThe industry's giants, however, have mostly stayed silent beyond offering blanket statements of support for net neutrality. The Internet Association, which speaks for Facebook, Google, Amazon, Microsoft, Netflix and Uber, did call on Pai to support net neutrality earlier this month. Things could get noisier if and when the FCC begins to formally review a rollback.\nMeanwhile, the FCC chairman has also been looking for allies. Pai traveled to Silicon Valley last week to meet with big tech companies, a visit that was \"extremely well received,\" according to Oracle senior vice president Ken Glueck. (Oracle sides with the telecom industry in opposing net-neutrality rules.)\nPai attended an event held at Cisco, with attendees from Oracle, Apple, Facebook, HP, Salesforce and Intel, Glueck said. (Pai said he met with Oracle, Cisco, Intel, Facebook and other companies.)\nAt least one big supporter of net neutrality - Netflix - has tempered its rhetoric recently. The streaming-video company said in January that weaker net neutrality wouldn't hurt it because it's now too popular with users for broadband providers to interfere with its service. The company added that it still supports net neutrality \"on a public policy basis.\"\nWHAT COMES NEXT\nThe tech industry is pretty good at getting consumers on its side when it decides to fight for a cause.\nIn 2012, internet companies took on the entertainment industry in a fight over online piracy. Thousands of websites, including Wikipedia, one of the internet's most well-trafficked sites, temporarily went dark to protest legislation that would have given the government power to \"blacklist\" sites from the internet.\nCompanies collected millions of signatures and asked users to protest to lawmakers. The bills, which aimed to curb illegal downloads and sales of movies and songs as well as other products, were dropped.\nIn 2014, smaller companies held an \"internet slowdown\" event to remind users of the net-neutrality fight. Sites such as Reddit, Etsy and WordPress displayed a \"site loading\" icon intended to signify the slowdowns users could theoretically expect without net neutrality. John Oliver also dedicated a show segment to the topic, which raised awareness of an otherwise jargon-y, abstract issue.\nFor the moment, though, there's no net-neutrality development to rally around, and won't be until there's an actual FCC proposal up for debate.\nAnd no one is saying exactly what might happen once there is. \"Next steps haven't been figured out yet,\" Kickstarter general counsel Michal Rosenn said in an interview two weeks ago.\n\"I certainly think we will try every possible avenue, including reaching back out to John Oliver,\" said Engine's executive director, Evan Engstrom.","url":"https://www.dailymail.co.uk/wires/ap/article-4446286/Internet-firms-winding-fight-net-neutrality.html"}
