{"authors":["Victoria Woollaston For Mailonline"],"date_download":"2018-10-23 01:18:57","date_modify":"2018-10-23 01:18:57","date_publish":"2016-01-11 12:10:43","description":"Figures from London-based Brandwatch show more than 1.3 million tweets were posted on social media last week making direct reference to the Consumer Electronics Show in Las Vegas.","filename":"data/vaneerConsumption/IntelandNetflixstealtheshowatCES2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/2FD9280700000578-0-image-a-26_1452514066841.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3393698_Intel-Netflix-steal-CES-2016-Stats-reveal-brands-talked-tech-conference_1540257537.html","title":"Intel and Netflix steal the show at CES 2016","title_page":"Intel and Netflix steal the show at CES 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Consumer Electronics Show is over for another year and Brandwatch has revealed the winners and losers from the conference.\nThe social monitoring firm tracked more than 1.3 million mentions of CES on social media over the past seven days.\nMentions peaked on 6 January and the awards for the most talked-about brands of this year's event went to Intel, with 51,000 mentions, followed by Netflix on 31,000.\nSocial monitoring firm Brandwatch tracked more than 1.3 million mentions of CES on social media over the past seven days. Mentions peaked on 6 January and the awards for the most talked-about brands of this year's event were Intel, with 51,000 mentions, followed by Netflix on 31,000 (pictured)\nAt the event, Intel showcased an extendable, ride-on Segway (pictured) that doubles up as a robo-butler and is fitted with Intel's RealSense camera\nBoth companies made keynote speeches on the opening day of the conference.\nAt the event, Intel showcased an extendable, ride-on Segway that doubles up as a robo-butler and is fitted with Intel's RealSense camera.\nThis gives the robo-butler a greater sense of spatial depth when tracking and mapping, while the machine is powered by Intel's Atom processor.\nThe firm also said it has partnered with drone experts Yuneec to put its RealSense technology on the new Typhoon H drone.\nIt also demonstrated a pair of ski goggles with built-in GPS technology.\nElsewhere, Intel boss Brian Krzanich announced collaborations with ESPN and Red Bull Media House to design Intel-powered gadgets for athletes.\nDuring its own keynote speech, Netflix announced it is adding 130 new countries to its streaming service this year, taking the total up to 190.\nDescribing the service as a 'global internet TV network,' Netflix boss Reed Hastings revealed that users have watched 42.5 billions hours of content on the site.\nAnd during the final three months of 2015, subscribers watched 12 billion hours of programming - a nearly 50 per cent increase from the previous year.\nOther brands that received a large number of mentions included Samsung, which unveiled its next-generation Gear smartwatches as well as a range of smart appliances, including an internet-enabled fridge.\nWhile Google was the most negatively perceived brand of CES, potentially down to its absence from the show.\nDuring its keynote speech at CES, Netflix announced it is adding 130 new countries to its streaming service this year, taking the total up to 190. Describing the service as a 'global internet TV network,' Netflix boss Reed Hastings (pictured) revealed that users have watched 42.5 billions hours of content on the site\nOther brands that received a large number of mentions included Samsung, which unveiled its next-generation Gear smartwatches as well as a range of smart appliances, including an internet-enabled fridge. Its 'Family Hub' refrigerator will be able to help you do everything from message your family to virtually shop for food\nElsewhere, Netflix was the brand that dominated the hashtags used over the course of the past 7 days with its #netflixeverywhere hashtag achieving more than 11 million impressions and more than 1,000 tweets. This was only behind the hashtag for the show itself. The hashtag #intel also featured in the top 10 (pictured)\nTOP HASHTAGS FROM CES 2016 #CES2016 #netflixeverywhere #ces #netflix #netflixindia #intel #tech #periscope #jaiho #iot\nElsewhere, Netflix dominated the hashtags used over the course of the past 7 days with its #netflixeverywhere hashtag achieving more than 500 million impressions.\nBrandwatch found that the majority of people discussing CES on social media were overwhelmingly male with 68 per cent male compared to 32 per cent female.\nBreaking the discussion down by gender, the figures revealed men were more likely to discuss the Internet of Things and drones, whereas women were inspired by 4K TV and wearables.\nThese were the major trends of this year's CES, along with virtual reality and smarter, electric and self-driving cars.\nBelow is DailyMail.com's pick of the most promising technologies unveiled at the show.\nIntel also unveiled a pair of smart glasses CES that are built into a helmet and which allow the wearer to look inside objects. The X-ray glasses and helmet duo is powered by Intel's 6th Gen Core m7 processor and was co-developed with the virtual reality firm DAQRI\nBrandwatch found the majority of people discussing CES on social media were overwhelmingly male with 68% male compared to 32% female. Breaking the discussion down by gender, the stats revealed men were more likely to discuss Internet of Things and drones, while women were inspired by 4K TV and wearables (shown)\nDailyMail.com has selected its pick of the most promising technologies unveiled at the show. The 1,000-horsepower FFZero1, for example includes the ability to exceeed 200mph (321 kph) and accelerate from zero to 60mph in less than three seconds. It also includes a helmet to provide oxygen and water to the driver\nFaraday Future's 'Tesla-killer' electric car concept\nAfter months of secrecy and speculation, Faraday Future's FFZero1 concept car was finally unveiled to the world at CES.\nThe mysterious Chinese-backed firm described its creation as 'the most extreme iteration of what it can build', leaving many wondering how such a bizarre design would work in the real-world.\nSpeaking to DailyMail.com, chief designer Richard Kim has revealed that a production electric vehicle is currently being tested on the roads and said it will be revealed 'very soon'.\nAnd what's more, he claimed the road vehicle will feature many of the concepts currently showcased on the FFZero1.\nThe 1,000-horsepower FFZero1 includes the ability to exceeed 200mph (321 kph) and accelerate from zero to 60mph in less than three seconds.\nIt also includes a helmet to provide oxygen and water to the driver.\n'I promise the final model will have more than one seat, that's for sure,' he said. 'If we take all of the FF design DNA and crank the volume on it, and amplify those elements there will be a relationship to what you see here.'\nNth Degree Technologies wants to replace lights around the home with lights that can be printed on flexible surfaces. It makes its light sheets by first cutting up gallium nitride to produce millions of tiny LEDs. In this image, a model wears an outfit made with Nth-Light at CES\nAlpha 2, the world's first 'affordable humanoid butler', charmed the crowds at CES. The voice-controlled droid can do everything from turn on the lights, help with housework, organise your diary and read your children bedtime stories\nCONNECTED CARS AT CES Automakers and parts suppliers took further steps to make autonomous driving a reality. Quanergy, for instance, announced a low-cost version of laser-based sensors called Lidar that cuts the cost of outfitting autos with the technology to around $1,000 per car from about $70,000. Israeli company Mobileye and German company Here announced plans to start making super-detailed road maps based on cameras and sensors that exist in cars today. Those maps will help autonomous vehicles navigate in poor weather. Owned by Audi, BMW and Mercedes, Here said it plans to have detailed maps of the highway networks in North America and Western Europe by 2018.\nThe world's first affordable robot butler\nAlpha 2, the world's first 'affordable humanoid butler', has charmed the crowds at CES.\nThe voice-controlled droid can do everything from turn on the lights, help with housework, organise your diary and read your children bedtime stories.\nAnd thanks to its 20 servo motors that bend its joints, the robot can also move around like a human, allowing it to do things such as dance and teach yoga.\nThe 17 by 19-inch robot is the work of Chinese firm, UBTech, who launched as an Indiegogo campaign in November and raised over $1.3 million in funding.\nIt uses voice and facial recognition to identify who it is talking to and what they are asking it to perform.\nThe company revealed that it will begin selling Alpha 2 for around $1,300 when it's released in March.\nAlpha 2 has 2GB of RAM, 16GB of storage, and operates on Android. It has to be connected to Wi-Fi and its battery life currently only lasts an hour.\nThe company uses its own proprietary software, but it is now asking third-party app developers to contribute apps that will expand its capabilities even further.\nA range of 3D-printed food was unveiled by 3D Systems. Pictured is a cake decoration made from sugar. The company claims the products can be healthy and good for the environment because the technology can help to convert alternative ingredients such as proteins from algae, beet leaves, or insects into tasty products\nTHE RISE OF THE SMART HOME More intelligent home appliances that can tell people how well they're sleeping, order more dishwasher detergent and know how much ketchup is likely left in the bottle were among the gadgets on display at CES. Segway hopes that by next year people might add a personal robot to their homes to carry the groceries home. That's if the milk, butter and bread weren't already ordered and delivered with a touch of a button on a fridge door, a technology unveiled by Samsung and Mastercard.\nSamsung's 'Family Hub' fridge that orders food, plays films and lets you see inside it remotely\nYour fridge could become the most important appliance in your home, if Samsung has its way.\nThe firm's 'Family Hub' refrigerator will be able to help you do everything from message your family to virtually shop for food.\nThe heart of the 'Family Hub' fridge is a 21.5 inch full HD LCD resolution screen located on the upper right exterior door.\nThe huge screen allows you to use your phone to post, calendars, pin photos, share kids' works of art, and leave notes.\nOne of the most impressive features is the addition of three cameras inside the fridge to capture an image every time the door closes.\nYou can then access those images anytime using your smartphone and take a peek inside your fridge.\n'Even if you're at the store and forget to check on what you need for dinner that night, the Samsung Smart Home app can take a look inside your Family Hub fridge,' Samsung says.\nThe Family Hub fridge will be available this spring, but a price has yet to be announced.\nA major highlight of CES was the unveiling of a giant quadcopter big enough to fit a passenger by Chinese firm EHang. Called the 184, the all-electric vehicle has four arms with a total of eight propellers at the end. 'You know how it feels to sit in a Ferrari? This is 10 times better,' Ehang said in an interview with DailyMail.com\nThe megadrone capable of carrying a passenger\nA major highlight at CES was the unveiling of a giant quadcopter big enough to fit a passenger by Chinese firm EHang.\nCalled the 184, the all-electric vehicle has four arms with a total of eight propellers at the end.\n'You know how it feels to sit in a Ferrari? This is 10 times better,' George Yan, co-founder of Ehang said in an interview with DailyMail.com.\nThe company said the 184 is autonomous, so all the passenger has to do is enter in their destination in the smartphone app, sit back, and let the drone take over.\nThere's no option to take control of the 184 remotely. The cockpit is empty, apart from a stand to place a smartphone or tablet and a cup holder.\nEHang said the vehicle is primarily designed for traveling short-to-medium distances — around 10 miles — and will fly at around 60 miles per hour.\n'I think in all of us there is that little kid in all of us that says I want to fly,' said Yan. 'I don't want to get a pilot license after five or 10 hours of flying, I want to do it right away. We're making that dream happen.'\nDigitsole showcased the world's first smart shoe on the left. An app can be used to change the temperature of the shoe and tighten the laces. On the right is a an LED base spinning hologram from tech company Kino-m\nThe Somabar, which is the brainchild of US-based entrepreneurs Dylan Purcell-Lowe and Ammar Jangbawala, can make more than 300 different cocktails, which can each be mixed in just five seconds after being ordered via the machine's corresponding app\nA 'Keurig machine for cocktails'\nA clever new countertop cocktail machine was unveiled this week that allows drinks enthusiasts to create a variety of perfectly-mixed beverages using an app on their smartphone.\nThe Somabar, which is the brainchild of US-based entrepreneurs Dylan Purcell-Lowe and Ammar Jangbawala, can make over 300 different cocktails, which can each be mixed in just five seconds after being ordered via the machine's corresponding app.\n'Whether you are with your friends or just celebrating the end of a long work week, enjoying a craft cocktail is something that is easy to do - but making one is a pain, and requires time and preparation,' Somabar co-creator Dylan explains.\n'So we invented Somabar, to make delicious craft cocktails in under five seconds.'\nEach Somabar is fitted with WiFi, which is used to link the device with the user's smartphone, on which they can access the cocktail mixing app, which features a staggering 300 different beverage options, all of which can be customized according to each individual's tastes.\nIn total, the machine took over three years to perfect - but both Ammar and Dylan are convinced their creation will wow anyone who gives it a go.","url":"https://www.dailymail.co.uk/sciencetech/article-3393698/Intel-Netflix-steal-CES-2016-Stats-reveal-brands-talked-tech-conference.html"}
