{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-31 00:08:47","date_modify":"2018-10-31 00:08:47","date_publish":"2016-12-03 00:00:00","description":"Shane Williams had to pitch for investment, hire a full team, and built the product from the ground up within the world's biggest wealth manager.","filename":"data/vaneerConsumption/InterviewwithUBSSmartWealthheadShaneWilliamsonfintech.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ubs-interview-fintech-smartwealth-online-wealth-manager-startup-2016-11_1540944527.html","title":"Interview with UBS' SmartWealth head Shane Williams on fintech","title_page":"    Interview with UBS' SmartWealth head Shane Williams on fintech - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Shane Williams, cohead of UBS SmartWealth. UBS LONDON — How can big banks keep up with nimble fintech startups trying to eat their lunch? One strategy is to act like them — if you can't beat 'em, join 'em.\n\"What we tried to do with SmartWealth is to be like a fintech, to go at that pace but within a large organisation,\" UBS' Shane Williams told Business Insider during a recent interview. \"It's trying to get the best of both worlds.\"\nWilliams is the co-head of UBS' recently launched online wealth manager, SmartWealth, which lets people gain access to the Swiss bank's investment expertise with as little as £15,000 ($18,915) to invest. The previous investment threshold was £2 million.\nWilliams told BI: \"We went from me and my manager saying 'let's do it,' and then we built out the team, hiring people either internally or externally, everything from data scientists to marketing. All in the same place, on 3 Finsbury Avenue. Everyone is co-located on one floor. It's like a little startup and quite self-contained.\"\nWilliams and his team even had to pitch for investment internally in the same way as a startup would have to approach a venture capital fund. The team first pitched the bank's internal innovation board for \"seed funding\" — a little startup cash to show the project was viable — before pitching the executive committee for \"Series A\" funding, the first major cash injection to get it off the ground. Williams says: \"We had to prove that we knew what we were doing.\"\n'It's not just one person sat in a backroom'\nThe platform took a year to build — lightning quick by the standards of a big bank — and today SmartWealth is a team of 80 people in London. On the day we meet in late November SmartWealth has just opened its first real customer accounts.\nThe service is one of a number of so-called \"robo advisors\" that are springing up across the globe, offering people low-cost investment services online. Analysts at Bernstein said in a note earlier this year that there's \"a strong case to be made that assets run by such strategies will increase significantly,\" citing transparency, ease of use, and the marketing potential of the \"robo\" label.\nHowever, despite the name of the sector, SmartWealth is one of the few \"robo advisors\" that actually doles out advice — most competitors, such as MoneyFarm or Nutmeg, are discretionary services that manage clients' money for them.\nWilliams says: \"To do that [offer advice] we need to assess your financial situation, what you can afford to lose, and also your financial personality, how you react if you do have losses or gains for that matter. From those two things, we decide you should be in one of five strategies. They're manifested as funds. We give a suitability letter as well.\"\nA screenshot of UBS' SmartWealth online hub. UBS Customers get access to UBS' CIO (chief investment officer) notes as well as the funds. The funds themselves are also core to UBS.\nWilliams says: \"It's not just one person sat in a backroom working out asset allocation. There are 200 people looking at macroeconomics, 24-hours a day, working out what's the best, and constantly changing those allocations based on what's happening in the world. That is a very human element.\"\nWhat makes it a \"robo,\" rather than simply an online portal to access UBS' investment products, is the on-boarding process. A chatbot interface takes people through the sign-up process, measuring their risk tolerance and financial capability. This then informs the advice UBS gives. The whole thing can take as little as 10 minutes, Williams says.\n\"It's basically designed around people who own their own business or who are professionals,\" Williams says. \"They're very time poor but they know they should be dealing with their finances. A lot of people know they should do something but don't actually do it.\"\nThe system is geared around customer \"goals:\" putting kids through schools, paying off a car, buying a house in the country.\n\"Goals are the things you care about as a person,\" Williams says. \"UBS is a great engine for understanding wealth management and giving financial advice. We wanted to democratise that advice and make it more accessible.\"\nUBS is the world's biggest private wealth manager, with $2 trillion of client assets.\n'There are a whole load of things that are super exciting'\nWhile Williams talks the talk when it comes to acting like a fintech, he admits that there are some practical difficulties building a startup within an organisation on the scale of UBS.\n\"If you're a startup, you'd probably use Amazon Web Services or Azure or something similar [cloud-based hosting products provided by third parties]. Internally, we're constrained. We can't actually use those cloud-based services because we've got a higher level of security requirements.\"\nIn a big organisation they say, can't we finish it? By the time we finish it, it will be in 7 years. The world moves on.\nThe product is launching in the UK because of the relative high affluence of the population, favourable local regulation, and the advice gap. Williams says it will likely to rolled out in other countries at some point.\n\"We'll look at where the best places in the future are to go but we've not decided yet. But the design of the platform is there ready to move, whether that's language or different regulatory requirements.\"\nHe adds that there are more features and products coming too. \"We wanted to make sure we could get the MVP [minimum viable product] out the door. The first priority for us is ensuring we got something out but on the backlog there are a whole load of things that are super exciting.\n\"Sometimes in a big organisation, that's hard to do. We're going to go live with a MVP, which is what all startups do. But in a big organisation they say, can't we finish it? By the time we finish it, it will be in 7 years. The world moves on.\"\nUltimately, though, UBS won't do \"technology for the sake of technology,\" Williams says. \"We want to make sure it adds to the overall experience that the client will have with you. That's where we focus.\"","url":"https://www.businessinsider.com/ubs-interview-fintech-smartwealth-online-wealth-manager-startup-2016-11"}
