{"authors":[],"date_download":"2018-10-22 23:37:06","date_modify":"2018-10-22 23:37:06","date_publish":"2017-03-16 07:33:22","description":"Interpol has issued an international arrest warrant for four North Koreans wanted by Malaysian investigators in connection with the assassination of Kim...","filename":"data/vaneerConsumption/InterpolwarrantissuedforfourNKoreansMalaysia.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/07/wire-227117-1489649603-899_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319112_Interpol-warrant-issued-four-N-Koreans-Malaysia_1540251426.html","title":"Interpol warrant issued for four N. Koreans: Malaysia","title_page":"Interpol warrant issued for four N. Koreans: Malaysia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Interpol has issued an international arrest warrant for four North Koreans wanted by Malaysian investigators in connection with the assassination of Kim Jong-Nam\nInterpol has issued an international arrest warrant for four North Koreans wanted by Malaysian investigators in connection with the assassination of Kim Jong-Nam, the country's police chief said Thursday.\nThe estranged half-brother of North Korea's leader Kim Jong-Un was poisoned with the lethal nerve agent VX in a brazen Cold War-style killing on February 13 at Kuala Lumpur International Airport.\nTwo women -- one Vietnamese and one Indonesian -- have been arrested and charged with the murder. Airport CCTV footage shows them approaching the victim and apparently smearing his face with a piece of cloth.\nInvestigators are also seeking seven North Korean suspects, four of whom left Malaysia on the day of the murder. The police chief has said he believes they fled to Pyongyang while the other three are hiding in North Korea's embassy in Kuala Lumpur.\n\"We have... obtained a red notice for the four North Korean nationals who were at the airport on the day of the incident and who have since left,\" police chief Khalid Abu Bakar told reporters.\n\"We... are hoping to get them through Interpol.\"\nThe red notice alerts police in Interpol member countries to share any information on the suspects with a view to potentially arresting and extraditing them to face justice. North Korea is not part of that network.\nThe Interpol notice posted online shows four North Korean men aged between 32 to 56 years old. They are named as Hong Song Hak, Ri Ji Hyon, O Jong Gil and Ri Jae Nam.\nPyongyang has denounced the Malaysian investigation as an attempt to smear the secretive regime, insisting that the 45-year-old most likely died of a heart attack.\nSeoul has blamed Pyongyang for his death, but the North has rejected those claims and has never confirmed the identity of the victim, who was carrying a passport bearing the name of Kim Chol when he was attacked.\nMalaysia officially confirmed his identity on Friday, later revealing that authorities used his fingerprints and a DNA sample from one of his children to do so.\nThe killing has triggered a bitter row between Malaysia and North Korea, which have expelled each other's ambassadors.\nThree Malaysian embassy staff and six family members are stranded in Pyongyang after North Korea barred Malaysians from leaving the country last week, prompting a tit-for-tat move by Kuala Lumpur.\nKim's wife and children, who were living in exile in the Chinese territory of Macau, went into hiding after the murder. There are fears his 21-year-old son, Kim Han-Sol, could be targeted next.","url":"https://www.dailymail.co.uk/wires/afp/article-4319112/Interpol-warrant-issued-four-N-Koreans-Malaysia.html"}
