{"authors":["Andrew Court","Kristy Johnson For Daily Mail Australia"],"date_download":"2018-10-23 03:49:10","date_modify":"2018-10-23 03:49:10","date_publish":"2017-04-26 15:21:46","description":"Intern Pete confessed to fabricating a story about Neighbour's star Stefan Dennis projectile vomiting in a gutter after wild Logies after-party","filename":"data/vaneerConsumption/InternPeteadmitsheLIESoverStefanDennisLogiesstory.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA0077900000578-0-image-a-31_1493215961390.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447986_Intern-Pete-admits-LIES-Stefan-Dennis-Logies-story_1540266550.html","title":"Intern Pete admits he LIES over Stefan Dennis Logies story","title_page":"Intern Pete admits he LIES over Stefan Dennis Logies story | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's the Kyle and Jackie O staffer who made outlandish claims that Neighbours star Stefan Dennis projectile vomited in a gutter following a wild Logies after-party.\nAnd after publicly apologising on Wednesday, KIIS FM's 'Intern' Pete Deppeler has now divulged details about his fabrication.\nAfter initially claiming to see Stefan have a 'power spew' in the early hours of Monday morning, The Daily Telegraph quotes Intern Pete as conceding that his claims sound 'a lot worse' than any reality witnessed.\nIt was all word vomit! Intern Pete confessed to fabricating a story about Neighbour's star Stefan Dennis projectile vomiting in a gutter after wild Logies after-party\nThe KIIS FM employee stated,'I think it was 3.38am when I was walking out [of an after-party]....I didn’t see the spew, I saw him cough.'\nThe Daily Telelgraph reportedly contacted KIIS FM's parent company, asking whether disciplinary action would be taken against Intern Pete, to which they refused to comment.\nDaily Mail have reached out for further comment on these claims.\nIt comes after Stefan insisted on an apology live on-air during Wednesday's Kyle and Jackie O Show, before remarking that if lies are to be told 'you've got to make them legendary'.\nNot happy: Neighbours star Stefan Dennis has slammed Kyle and Jackie O's Intern Pete for lying that he tripped over and vomited in the gutter at the Logies\n'I've had all my friends all over the place ring and say, \"What's this about you vomiting after the Logies party?\". I want Intern Pete to apologise to me because it's not good enough guys,' Stefan told co-hosts Kyle Sandilands and Jackie 'O' Henderson.\nStefan remarked that if lies are to be told, then they ought to be legendary.\n'Just hang on a second Pete. You know what? If you're going to make a porky pie, you've got to make them legendary,' the soap star began.\n'It's no good saying, \"Stefan Dennis vomited after a party\".\nAntics: 'Here you go, \"vomiting inside the gold hat that Molly gave Sam\", Stefan remarked of what lie Intern Pete should have made up. Pictured with Neighbours co-star Mavournee Hazel\n'You say, \"Stefan Dennis was seen staggering and supported by four questionable, scantily-clad ladies. Seen to be bulging with illicit substances, completely unaware of what's happening and vomits on a passing poodle\".\n'Or better still, here you go, \"vomiting inside the gold hat that Molly gave Sam\", Stefan added.\nAfter questioning Stefan on whether he was still denying the report or whether he had a twin brother, Intern Pete finally did apologise.\nClaims: Wentworth's Danielle Cormack, 46, was reported by Intern Pete to have been involved in an altercation in the hallways of Melbourne's Crown Towers\nVocal: The actress reportedly yelled: \"You don't tell me what to do, I tell you what to do\"\n'Stefan Dennis, I Intern Pete would like to apologise for lying that you threw up in the gutter and projectile vomited and everything.'\nMeanwhile, Intern Pete also reported that Wentworth's Danielle Cormack and The Block judge Darren Palmer, were found in precarious situations.\nDanielle, 46, was claimed to have been involved in an altercation in the hallways of Melbourne's Crown Towers, where she yelled, \"You don't tell me what to do, I tell you what to do\".\nReports: Intern Pete also claimed that The Block's Darren Palmer got into an argument when his partner was denied entry to a Logies after party on Sunday night\nDarren, one of the judges on the Logie winning show The Block, also used the after-parties to commend their victory.\nBut the star had to do it solo, after his boyfriend was reportedly denied entry into the Crown building.\nAfter getting into an argument when staff said his partner could not enter, it was claimed the interior designer went on alone.\nThe star was all smiles however the following morning, as he fronted up at the Post Logies Recovery Brunch.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447986/Intern-Pete-admits-LIES-Stefan-Dennis-Logies-story.html"}
