{"authors":["Elizabeth Castillo","Laurel Rosenhall","Dan Morain","Byrhonda Lyons"],"date_download":"2018-10-30 23:43:58","date_modify":"2018-10-30 23:43:58","date_publish":"2018-07-17 00:31:51","description":"Parents may soon find it easier to send their kids to a different school. But only some students would qualify for interdistrict transfers.","filename":"data/vaneerConsumption/InterdistricttransfersforbulliedkidscouldbecomeeasierinCalifornia.json","image_url":"https://calmatters.org/wp-content/uploads/KesharaMikahi-1CMS.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540943038.html","title":"Interdistrict transfers for bullied kids could become easier in California","title_page":"Interdistrict transfers for bullied kids could become easier in California | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"After overcoming homelessness, Keshara Shaw has been determined to improve circumstances for her family. She got a job and a place to live. But she’s having a harder time getting her 8-year-old son into a good school.\nShaw doesn’t like the school he was assigned to in their Los Angeles neighborhood because students aren’t performing well and the surrounding streets are riddled with violence. Instead, she wants him to go to a different school where she thinks he’ll be safer and get a better education. But there’s a problem: That school is not in her district. And the district she lives in — Los Angeles Unified — wouldn’t allow him to leave.\n“We don’t feel safe in our neighborhood,” she said. “There’s a little bit of gang violence going on in the neighborhood, and recently, someone pulled a gun on my mom.”\nShaw told this story to a panel of legislators last year, testifying in support of a bill that would have allowed more children like hers to transfer to a school outside their own district. But school administrators and teacher unions opposed it, arguing that the bill would be disastrous for districts because so many students could change schools. Lawmakers on the Assembly Education Committee sided with them and killed the bill.\nNow Shaw, and some parents like her, are getting a second chance. The bill is back—but this time, in a much more limited form.\nLast year’s bill would have made it easier for all 3.6 million students from low-income families to transfer to another district, by prohibiting the family’s home district from denying the request if the chosen district accepts the student. This year’s version is narrower. It applies only to foster youth, those from migrant families, those currently or recently homeless—about 400,000 students in all—plus one other category with a broader scope: kids who are being bullied.\n“I’m someone who’s willing to find ways to move something forward even if I end up making less progress than I might like,” said Republican Assemblyman Kevin Kiley of Rocklin, the bill’s author.\nThe measure is advancing with little opposition this year, a sign that Kiley’s strategy seems to have worked. But the fight to get to this point reflects greater tensions in education circles over how much power parents should have to pick the school that’s best for their kids. And as in many education debates, it’s pitted the school establishment—district officials and labor unions—against activists who believe that shaking up the system will help more kids learn.\nWhile most debates over school choice pit private schools against public schools, or neighborhood schools against charters, the tension here is all within the traditional school system.\n“The idea of allowing parents to have choice shouldn’t be a scary thing because we’re not talking about anything other than going from one public school to another public school,” said Bill Lucia, president of EdVoice, an advocacy group that sponsored the bill.\nThe California Teachers Association and the California School Boards Association no longer oppose it. But last year, when the bill would have made transferring easier for all students from poor families, they worried it would allow more than half the student population to leave their districts. Letting so many kids switch schools could create financial problems for some districts since they are funded based on attendance.\n“Our concern was that this would be destabilizing to our public education system in California,” said Mike Myslinski, a spokesman for the California Teachers Association.\nStill, bullying impacts a large number of students. Nationwide, almost 30 percent of 6th to 12th grade students say they have been bullied at school, according to the U.S Department of Health and Human Services. In California, about 18 percent of high school students say they’ve experienced bullying on campus, according to the Center for Disease Control and Prevention.\nThe teachers union has endorsed Assemblyman Tony Thurmond in his campaign to be the next superintendent of California’s public schools. Thurmond, a Richmond Democrat who sits on the education committee, voted for Kiley’s transfer bill this year after voting against it last year.\nHe said the old bill could have created chaos by allowing so many students to transfer, disrupting both districts involved.\n“I wasn’t really opposed to the concept,” he said. “I really had concerns about the potential unintended impacts the bill could have for other students.”\nKiley argued that 100 percent of affluent families can change schools for their children because they have the means to move elsewhere.\n“That’s just the way it works under the current system where your zip code determines where you go to school,” he said. “You create opportunities for wealthier families to choose a school district that they like because they have the means to move. Whereas families who are not able to do so don’t have that choice.”\nShaw was back in Sacramento this spring for a second year in a row, telling the latest chapter of her story to a panel of lawmakers. She appealed the district’s decision not to let her son transfer, and won permission. But by then the school she wanted him to attend no longer had a seat for him. So she sent 8-year-old Mikahi to another school in her own district, but says she is now concerned that he’s being bullied.\nShaw is grateful that a new law could help her son, but she worries about other families that wouldn’t qualify under the more limited circumstances.\n“We just want to be able to provide our kids with a better education,” she said. “Just because we live in these low-income areas we still have dreams and aspirations and we still, I feel, want to be able to provide my child with quality education. Education is key to everything.”","url":"https://calmatters.org/articles/interdistrict-transfers-bullying-california-bill/"}
