{"authors":["Edwin Mora"],"date_download":"2018-10-30 19:56:36","date_modify":"2018-10-30 19:56:36","date_publish":"2016-06-10 17:45:34","description":"200 attend the funeral of Serina Vine, 91, a formerly homeless veteran who served during World War II, a funeral expecting only 4 attendees.","filename":"data/vaneerConsumption/InternetCampaignDraws200toFuneralofVeteranwithNoKnownRelatives.json","image_url":"https://media.breitbart.com/media/2016/06/Serina-Vine-veteran-funeral-ap-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_06_10__1540929396.html","title":"Internet Campaign Draws 200 to Funeral of Veteran with No Known Relatives","title_page":"Internet Campaign Draws 200 to Funeral of Veteran with No Known Relatives","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON, D.C. — The funeral for 91-year-old Serina Vine, a formerly homeless veteran with no known relatives, was supposed to be attended by only four people.\nRather than the expected four, an estimated 200 showed up to pay tribute to Vine, who served in the U.S. Navy during World War II, courtesy of a social media campaign organized by veterans’ groups, reports ABC News.\nAccording to the obituary published by A. L. Bennett and Son Funeral Home, Vine was a University of California (UC) graduate who served in the U.S. Navy from 1944 to 1946 as a radio intelligence officer and spoke three languages as a result.\nThe Washington, D.C., resident passed away on May 21, 2016, at the local U.S. Department of Veterans Affairs (VA) hospital.\nA graveside memorial was held at Quantico National Cemetery on Tuesday, the day she was laid to rest with full military honors in commemoration of her military service, including a 21-gun salute.\nABC News reports:\nVine’s story hit home for Army Maj. Jaspen Boothe, who used to be homeless herself. She found out about Vine’s funeral plans via a Facebook message from a Marine veteran and decided to get the word out. When she was told there were only going to be four people at the service, as Vine had no known relatives in the area she said, “That didn’t sit right with me.” Boothe then put the word out on social media, contacting several groups including Ms. Veteran America, who put out an appeal of their own.\nBoothe was reportedly in shock and disbelief when she arrived at the cemetery and saw the crowd that had gathered to honor Vine.\n“I thought they had three or four things going on,” she told ABC News. “Now she has 200 known family and friends in the area.”\n“I’ve never seen anything like it,” added Martin Fuller of the VA. “I felt like I had to go because I didn’t think anyone was going to show up. The information just went viral.”\nFuller linked Vine up with a legal custodian at the VA Community Living Center in the nation’s capital, where he met her.\nThe WWII veteran was born in Berkeley, California, to David and Harriet Vine, her obituary reveals, adding that she shared a love for the U.S. military with her father, who served in World War I after also attending UC.\nAlthough she grew up with a younger sister, Mary Vine, the Northern Virginia-based funeral home reports that “she has no known next of kin or relatives in this area.”\nBooth told ABC News she wanted people to remember the WWII warrior as more than just a homeless veteran.\n“She was an educated woman, she loved to dance and go to church on Sundays,” she said.","url":"https://www.breitbart.com/national-security/2016/06/10/internet-campaign-draws-200-funeral-formerly-homeless-wwii-veteran-no-known-relatives/"}
