{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:42:30","date_modify":"2018-10-30 20:42:30","date_publish":"2016-02-10 03:01:07","description":"The latest annual Worldwide Threat Assessment of the U.S. Intelligence Community (IC) indicates that 2016 may be the worst year in history for terrorism.","filename":"data/vaneerConsumption/IntelCommunityForeseesWorstYearEverforJihadiTerrorAgainstUS.json","image_url":"https://media.breitbart.com/media/2015/07/Chatanooga-shooting-site-AP-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_02_09__1540932150.html","title":"Intel Community Foresees Worst Year Ever for Jihadi Terror Against U.S.","title_page":"Intel Community Foresees Worst Year Ever for Jihadi Terror Against U.S. | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON, D.C. — The latest annual Worldwide Threat Assessment of the U.S. Intelligence Community (IC) indicates that 2016 may be the worst year in history for terrorism, primarily at the hands of Sunni extremist groups such as the Islamic State (ISIS/ISIL) and al-Qaeda (AQ).\nDirector of National Intelligence (DNI) James Clapper delivered the assessment, which highlights the perils facing the United States globally, during a Senate Armed Services Committee hearing on Tuesday.\n“The United States and its allies are facing a challenging threat environment in 2016. Sunni violent extremism has been on an upward trajectory since the late 1970s and has more groups, members, and safe havens than at any other point in history,” declares the IC report. “At the same time, Shia violent extremists will probably deepen sectarian tensions in response to real and perceived threats from Sunni violent extremists and to advance Iranian influence.”\nThe declaration comes after more than a year of U.S.-led military efforts against ISIS and more than a decade of war against al-Qaeda.\nU.S.-based homegrown violent extremists (HVEs) are described in the assessment as the top terrorist threat to the United States.\nHomegrown extremists “will probably continue to pose the most significant Sunni terrorist threat to the US homeland in 2016,” says the assessment. “The perceived success of attacks by HVEs in Europe and North America, such as those in Chattanooga [Tennessee] and San Bernardino [California], might motivate others to replicate opportunistic attacks with little or no warning, diminishing our ability to detect terrorist operational planning and readiness.”\n“ISIL involvement in homeland attack activity will probably continue to involve those who draw inspiration from the group’s highly sophisticated media without direct guidance from ISIL leadership and individuals in the United States or abroad who receive direct guidance and specific direction from ISIL members or leaders,” also says the U.S. intelligence community.\nAlthough al-Qaeda has proven resilient and is likely to make gains this year, ISIS has become the most dangerous terrorist group “because of its self-described caliphate in Syria and Iraq, its branches and emerging branches in other countries, and its increasing ability to direct and inspire attacks against a wide range of targets around the world,” notes the report.\n“[AQ] affiliates have proven resilient and are positioned to make gains in 2016, despite counterterrorism pressure that has largely degraded the network’s leadership in Afghanistan and Pakistan,” it adds. “They will continue to pose a threat to local, regional, and even possibly global interests…”\nAl-Qaeda remains intent on attacking the United States and its allies, warns the intelligence community.\nMarine Corps Lt. Gen. Vincent Stewart, director of the Pentagon’s Defense Intelligence Agency (DIA), predicted that ISIS will probably increase its attacks this year in the DIA’s own assessment of the threats facing the United States globally, which he delivered while testifying before the Senate panel alongside Clapper on Tuesday.\n“ISIL will likely increase the pace and lethality of its transnational attacks as infrastructure and capabilities mature,” declared the DIA. “It will purposefully attempt to stoke sectarian conflict between Shia and Sunni, and between the West and Islam, to create the chaotic environment in which it thrives. ISIL will probably conduct additional attacks in Europe and attempt to direct attacks on the US Homeland in 2016.”\nCiting a new assessment from the U.S. intelligence community, the White House last week said that the number of ISIS fighters in Iraq and Syria has dropped by about 20 percent to 25,000, from a previous estimate of 31,000, due to battlefield fatalities and desertions.\nMeanwhile, the DNI’s World Wide Threat Assessment, released Tuesday, mentions that “more than 36,500 foreign fighters — including at least 6,600 from Western countries — have traveled to Syria from more than 100 countries since the conflict began in 2012.”\nThe report does not highlight any reduction in the number of ISIS fighters.\nNevertheless, it warns that “foreign fighters who have trained in Iraq and Syria might potentially leverage skills and experience to plan and execute attacks in the West.”\nRecruits’ proficiency in information technology, social media, and online research will reportedly continue to benefit terrorist groups in 2016, namely ISIS.\n“Some terrorists will look to use these technologies to increase the speed of their communications, the availability of their propaganda, and ability to collaborate with new partners,” notes the intelligence community in its latest annual assessment. “They will easily take advantage of widely available, free encryption technology, mobile-messaging applications, the dark web, and virtual environments to pursue their objectives.”\n“Among Sunni violent extremist groups, ISIL is probably most proficient at harnessing social media to disseminate propaganda and solicit recruits among a broad audience,” it adds.","url":"https://www.breitbart.com/national-security/2016/02/09/intel-community-predicts-2016-to-be-worst-year-ever-for-terror-against-us/"}
