{"authors":["Virginia Hale"],"date_download":"2018-10-30 21:13:18","date_modify":"2018-10-30 21:13:18","date_publish":"2015-01-09 15:30:06","description":"Computer chip company Intel has been in the news this week after it announced it will be \"investing\" $300 million to \"improve workplace diversity\", having |","filename":"data/vaneerConsumption/Intelsdiversitydriveisdiscriminatory.json","image_url":"https://media.breitbart.com/media/2015/01/Intel.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_01_09__1540933998.html","title":"Intel's 'diversity drive' is discriminatory","title_page":"Intel's 'diversity drive' is discriminatory - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Computer chip company Intel has been in the news this week after it announced it will be “investing” $300 million to “improve workplace diversity”, having been pressured by activists. The money will go towards hiring and retaining more women, with the goal that women and under-represented minorities be “fully represented” by 2022.\nThe money will also go towards “funding programs that support the positive representation of women and minorities in technology and gaming industries”, one of which is Feminist Frequency, a.k.a. Anita Sarkeesian, an enterprising young woman who graduated from being seminar manager for a “handwriting expert” and “Pick-Up Artist”, to making money from being a walking Rorschach test subject; her response to everything she’s shown is to squeal “sexism”.\nWith Sarkeesian, having been one of the activists pressuring Intel for diversity, now due to receive funding from them, it’s easy to see how parts of feminism are accused of being a bit of a con job. The “diversity” industry has become huge and self-perpetuating. A feminist organisation or individuals seek funds to “research the extent of sexism” in x place, they inevitably “find” it; they then they seek to extort more money in order to “correct” it.\nBut there are also problems in Intel’s quest to make its company “representative of the population”. Evidently, fewer women than men have chosen technology for their careers so in order for Intel to meet the targets it’s set itself it’s going to need to apply “positive discrimination”. Aside from “positive discrimination” being wrong, as it’s still discrimination, against men, the obsession with “diversity” as an unassailable good that must be strived for should be questioned.\nFeminists claim the only reason there aren’t as many women as men in technology is because of sexism and gender stereotypes, yet a 2011 Norwegian documentary called “The Gender Equality Paradox” found that despite Norway being one of the most equal countries on Earth, where there have been huge drives for male nurses and female engineers year on year, the vast majority of nurses were women and engineers were men, and the ratios had remained stable since the 1980s.\nFeminists are obsessed with pushing women into fields they’re not necessarily interested in. If it’s so important to them to have more women in technology, perhaps they can pull themselves away from their jobs in “feminist critique”, do a relevant course and enter the industry themselves.\nPositive discrimination is also bad for women, because when in politics, for example, they are often promoted prematurely, it reflects badly on female politicians as a whole. Margaret Thatcher earned her place in the Conservative Party and was seen as a brilliant leader, whereas young politicians in skirts are handed Shadow Cabinet positions and parliamentary candidatures like chocolates, as “diversity” PR for the parties.\nMen and women seem to have different interests, in general, and so by lifting up every woman they can get interested in technology thousands of men, many of them more talented, will be left behind, just for a shiny “diversity” badge.\nWhile trying to present their “diversity” drives as something other than a good-guy badge to pin on their hair shirts, to shareholders and the public, companies will often claim that diversity is “good for business” because, “diverse groups of people bring to organizations more and different ways of seeing a problem and, thus, faster or better ways of solving it”. This assertion has found its way into myriad literature as a spurious excuse for “positive discrimination”, displayed by various universities, NASA and the even British government’s website.\nThe origin of these claims is a 2007 book entitled “The Difference: How the Power of Diversity Creates Better Groups, Firms, Schools and Societies”, and the author, Scott Page, claims that “the veracity of the diversity trumps ability claim is not a matter of dispute. It’s true, just as 1+1=2 is true.”\nThis is the sort of statement that sounds great and is greeted with unquestioning applause, high fives, and cries of, “I knew it!” in the offices of the Guardian and the New York Times. But actual mathematicians have been rather more sceptical. Professor Abigail Thompson, a mathematician at UC Davis, backed up by other senior mathematicians, has dismantled the entire book in a devastating peer-reviewed critique, pointing out that “not only is the purely theoretical study flawed in its theory and in its computer simulations, but it is entirely devoid of any empirical evidence that deals with flesh-and-blood human beings.”\nThe tests are “contrived” and the algorithms rigged, they say, so that the experiment can only ever return those results the authors wished them to show.\nHaving had his book roundly debunked, Page’s response acknowledges the myriad fatal flaws within, but defends his book for “provid[ing] a language with which intelligent, thoughtful people can discuss a variety of issues related to hiring, inclusivity, and opportunity.” Well it sure did that, but it would have been nice if it were marketed as what it is: a cheerleading manual for social engineering, rather than a factual investigation of how to improve a business or workforce, which claims its “findings” are “not a matter of dispute”.\nEven when it comes to careers that women dominate, and “positive discrimination” is being considered as an option, men as a group still aren’t entitled to a leg-up. 74 per cent of teachers are female, and the chief of Ofsted has said head teachers, when hiring, should consider “positive discrimination” when it comes to ethnic minority teachers.\nA gender gap that results in social crucifixion if one dares bring it up is healthcare. As girls mature faster than boys, and how “caring” a candidate comes across in the admissions interview is marked, significantly more women than men are now admitted to medical school, with devastating results for taxpayers and the NHS. Over 60 per cent of doctors under the age of 30 are women and the majority go part time when starting a family, usually in general practice, then retire early.\nAt £250,000 to train each doctor, it’s not cheap, and when Tory MP Anne McIntosh pointed out the burden this has on the NHS, the usual howls from the left-wing press whenever someone says something not blessed by the gods of political correctness were of course heard everywhere.\nSo whilst that gender gap has a material effect on people’s lives, we’re not to mention it except in the context of it being fabulous progress for women, whilst having fewer women than men in technology is apparently a catastrophe that needs immediate attention. Why? Because the new iPhone’s health application lacks a “period tracker”, apparently indicative of the hideous truth that 70 per cent of Apple’s global workforce are men. *headdesk*, as they say online.\nIntel is just another example of a company trading integrity for temporary accolades from professional moaners, and some flattering PR from the usual suspects. In reality, it’s done no favours for its shareholders, its customers, nor women in general. All it’s done is give further cash to sustain the self-perpetuating feminist victim racket.","url":"https://www.breitbart.com/europe/2015/01/09/intels-300m-diversity-drive-is-discriminatory-and-wrongheaded/"}
