{"authors":["Clemence Michallon For Dailymail.Com"],"date_download":"2018-10-23 03:57:31","date_modify":"2018-10-23 03:57:31","date_publish":"2017-03-16 14:58:53","description":"Jim Moroney (pictured), who lives in California, is looking for 'that special woman'. He was all set to go on a date Saturday night after his neighbor signed him up on Match.com.","filename":"data/vaneerConsumption/InternetralliesinsupportofMatchcomstoodupgrandpa.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54797200000578-0-image-a-3_1489673575897.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4320214_Internet-rallies-support-stood-grandpa_1540267051.html","title":"Internet rallies in support of Match.com stood-up grandpa","title_page":"Internet rallies in support of Match.com stood-up grandpa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 73-year-old grandpa who got all dressed up for a date and drove almost an hour to meet the woman has left internet users devastated after he got stood up.\nJim Moroney, who lives in California and is looking for 'that special woman', had even bought his date a dozen red roses and See's candies in preparation for the rendez-vous.\nHis granddaughter was heartbroken to see his efforts didn't pay off and shared a photo of Jim on Twitter, explaining what had happened. Four days later, thousands of users have expressed their support for the grandpa - and offered to take him on a date themselves.\nHeartbreak: California grandpa Jim Moroney (pictured), 73, was ready to go on a date Saturday and had put on a nice sweater, but the woman never showed up\nRomantic: The grandpa had even bought his date a bouquet of red roses (pictured) and was planning to bring her See's candies. He drove almost an hour for the rendez-vous\nJim, who told Buzzfeed he hopes to find 'someone truthful, loving, and that has compassion', isn't much of an internet user, but his neighbor signed him up on Match.com four months ago.\nThrough the website, he met the woman he was supposed to see on Saturday night — and he was prepared for their date like a gentleman.\n'I was dressed—a nice sweater on— and had a dozen roses and See's Candies,' Jim said.\nWhen the woman didn't show up, he went to his granddaughter's house to give her the roses.\nGabby Foresta, 16, took time to comfort him and told him she loved him. She also snapped pictures of her grandpa and of the flowers and posted them on Twitter, writing: 'My grandpa got all dressed up for his date, drove 45 minutes away, bought her chocolate and flowers and he got stood up.'\nCompassion: His granddaughter Gabby Foresta, 16, took time to comfort her grandfather afterwards and shared his photo on Twitter telling her followers what had happened\nRallying cry: Thousands of Twitter users have expressed their support for Jim and commended him for his generous manners. Some have even offered to take him on a date themselves\nHer message has since been retweeted more than 7,000 times and has received thousands of replies, with people commending Jim for his manners and wishing him luck on future dates.\n'Poor Grandpa. Salute to him for bringing such beautiful roses and chocolate,' one user wrote back.\nSomeone else said Jim was 'very handsome' and hoped he would 'find a lady who will treat him right'.\n'He looks like he's got swag, I'm sure he'll bounce back,' one person wrote.\nThat is precisely what Jim plans to do.\n'It was something that happens, and not just to me, but other people,' he told Buzzfeed. 'It's alright, I will kick myself in the a** and get going again.'\nSome compared Jim's ill-fated date with the plight of Papaw, an Oklahoma grandfather who made 12 burgers for dinner with his six grandchildren, before only one of them showed up.\nPapaw - real name Kenny Harmon - earned the compassion of hundreds who ended up showing up for a cookout in his honor.","url":"https://www.dailymail.co.uk/femail/article-4320214/Internet-rallies-support-stood-grandpa.html"}
