{"authors":[],"date_download":"2018-10-30 01:24:31","date_modify":"2018-10-30 01:24:31","date_publish":"2016-11-29 00:05:49","description":null,"filename":"data/vaneerConsumption/InternetGamblingandthe10thAmendment.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/11/1024px-Sheldon_Adelson_21_June_2010-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862671.html","title":"Internet Gambling and the 10th Amendment","title_page":"Internet Gambling and the 10th AmendmentThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Many on the left have taken Donald Trump’s surprise victory poorly, responding with considerable hand-wringing and emotional outbursts. Instead of simply focusing on the many evils that they anticipate will take place under President Trump, they would do well to look in the mirror and recognize that there would be far less cause for concern had they not spent the past eight years cheering on the expansion of executive power under President Barack Obama.\nRepublicans, soon to control all elected branches for the first time in a decade, ignore this lesson at their peril.\nA group of congressional Republicans has been trying to undo the Department of Justice’s acknowledgment in 2011 that the Wire Act — passed before the internet existed — never should have been interpreted to prevent all forms of online gambling (such as poker and lotteries), as opposed to the “bets or wagers on any sporting event or contest” that the statute explicitly addresses.\nThey’re worked up about it because billionaire casino owner Sheldon Adelson is a GOP megadonor and some states have begun authorizing online gambling within their borders. Adelson hates online gambling, as it competes with his bricks-and-mortar Las Vegas casinos for customers.\nMore than five years ago, on what has become known to the poker world as Black Friday, the federal government unleashed a legal jihad against online poker companies and their top executives. Online poker is not itself illegal — a fact clarified by the DOJ’s reinterpretation of the Wire Act — but the 2006 Unlawful Internet Gambling Enforcement Act made it illegal for payment processors to transfer funds to and from gambling sites.\nThe problem for Adelson and his allies is that the UIGEA and other federal statutes apply only when state borders are crossed. The 10th Amendment and the principles of federalism mean that federal lawmakers should have no say regarding activities that take place entirely within one state’s borders. So if state governments wish to authorize online gambling for their citizens, they are and should remain free to do so.\nAdelson’s gang has been trying for some time to pass the Restoration of America’s Wire Act to stop states from setting their own gaming rules. Despite its misleading name, RAWA would go even further than the original and erroneous interpretation of the Wire Act, as even that dealt only with interstate activity.\nRAWA has failed to muster enough support to move forward thus far, but another bill, SB 3376, was recently introduced by Sen. Tom Cotton, R-Ark., with very similar language, suggesting there may be an attempt to sneak it through during the lame-duck session. Trump’s campaign received significant support from Adelson, so Republicans might also try to take it up in the new Congress.\nDoing so would mean ditching their oft-claimed support for the 10th Amendment and state sovereignty. It would also set a precedent for Democrats, who will eventually hold power again, to similarly prohibit the forms of online commerce they find distasteful, such as gun and ammunition sales.\nRepublicans should learn from today’s dismayed Democrats and resist the temptation — while in power — to operate beyond constitutional limits so that such limits might still be around to keep the other side in check once control of the federal government inevitably changes hands again.\nCOPYRIGHT 2016 CREATORS.COM","url":"https://spectator.org/internet-gambling-and-the-10th-amendment/"}
