{"authors":["Jim Edwards"],"date_download":"2018-10-30 20:35:33","date_modify":"2018-10-30 20:35:33","date_publish":"2016-12-29 00:00:00","description":"\"I think whatever kind of institution you are the threat is evolving and it is significant,\" Hogg says.","filename":"data/vaneerConsumption/InterviewwithBankofEnglandCOOCharlotteHoggonFintech.json","image_url":"https://amp.businessinsider.com/images/5864e7d7dd089502208b4b8c-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_interview-bank-of-england-coo-charlotte-hogg-fintech-2016-12_1540931733.html","title":"Interview with Bank of England COO Charlotte Hogg on Fintech","title_page":"    Interview with Bank of England COO Charlotte Hogg on Fintech - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Web Summit\nThe Bank of England is not normally regarded as a font of innovation, but earlier this year it took steps to change that by starting its own fintech startup accelerator.\nThe BoE has chosen seven companies— BitSight, Privitar, PwC, BMLL, Anomali, ThreatConnct, and Enforcd — to generate proof-of-concept projects with the BoE. They are looking at machine learning, security threats, bitcoin and the blockchain, and data privacy, and how those issues might affect banking.\nThe BoE won't be investing in these companies, but in order to encourage involvement from startups it is allowing the selected companies to advertise the fact that the Bank is a client.\nThe accelerator is a significant cultural change for the BoE. Until now, its institutional role has largely been regarded as reactive not predictive: It does research to understand what is happening in the economy, it regulates banking to weed out bad behaviour, and of course it sets the base level interest rate on the pound through monetary policy. All the companies in the accelerator, however, are in one way or another focused on the future, identifying threats or opportunities that the Bank may need to deal with next.\n\"We don't want to be the wild west, and we don't want to strangle innovation at birth,\" BoE Chief Operating Officer Charlotte Hogg told Business Insider during an on-stage discussion at Web Summit in Lisbon. \"So we need to know what is going on and how it affects what we care about, which is the safety and soundness of banks, protection of insurance holders, and the resilience of the system.\"\nAmong those threats are hackers and bitcoin. Hackers proved that central banks are vulnerable to theft earlier this year when the Central Bank of Bangladesh lost $101 million in fraudulent transactions to a phishing scheme. The hackers had attempted to defraud the bank of $951 million in cash but the caper was interrupted before it was complete. Only $18 million has been recovered.\n\"I think whatever kind of institution you are the threat is evolving and it is significant,\" Hogg says. \"And so the onus is on every institution to be proactive in their defence and to be looking at all the new tools that have emerged to address that and respond to that.\"\nHogg has bad news for bitcoin libertarians who are hoping that the blockchain currency might one day render central bank fiat currency obsolete: There is no sign of that happening yet. We asked her if she saw bitcoin as a threat to plain-vanilla money and she replied: \"We think about threats to financial monetary stability, and at present we don't see that.\"\nYou can see a video of our discussion following Hogg's speech at Web Summit here.\nThis is the full text of our conversation:\nWeb Summit\nJim Edwards: Most people don't think of the Bank of England as a tech-startup accelerator, so just to be clear, you're not actually investing in these startups right?\nCharlotte Hogg: No\nEdwards: Why would any fintech startup want to be involved with the BoE, if they're not going to sell any equity out of it?\nHogg: They get a number of things from working with us, one is one of their first clients and someone who is willing to publicise that fact, and we've certainly found that has been a real attraction for the first set of firms.\nEdwards: I see, you're quite comfortable with the companies within the accelerator advertising the fact that the Bank is one of their clients?\nHogg: They do, yeah.\nEdwards:Sometimes fintech startups are not well behaved!\nHogg: We have our ways!\nEdwards: And what sorts of things do you offer them, other than \"you get to work for the Bank of England\"? Are there other specific problems that you're asking them to solve?\nHogg: Yeah, we pick the problems that we are most interested in solving and we open up to suggestions. When we first opened up we had over 150 firms apply to work on the problems that we identified. So they get to work with our policy teams and our business teams to solve issues that really matter.\nEdwards: One of the most interesting statements the Bank made, probably over a year ago now, was that the Bank was interested in bitcoin and blockchain — the sort of distributed-ledger aspect — and there are probably some people at this conference who would love to see fiat currency die. I noticed that bitcoin was up 3 or 4% on the morning of the Trump election. What is the bank's interest in blockchain?\nWeb Summit Hogg: We try and be interested in the activities and critical economic functions rather than any particular technology or any particular asset class. A number of my colleagues have made speeches both on the technology itself and on the application of the technology to a central-bank digital currency.\nSo it continues to be an area of interest, we continue to work on it, and it's been one we've had both research and experience. So we've built our own distributed ledger to understand where the challenges and opportunities are.\nEdwards: You don't see it as a threat to the pound?\nHogg: At present we think about threats to financial monetary stability, and at present we don't see that.\nEdwards: A couple of years ago I saw Bank of England Governor Mark Carney at Davos and he was on stage warning of \"an Uber-type situation in finance.\" And I think what he was referring to was the idea that companies would disrupt the finance world, disrupt banking, faster than regulations could keep up with it. Does the Bank have the tools, is it as fast as it needs to be, to keep an eye on fintech?\nHogg: I think Mark stated his position really clearly in June — we don't want to be the wild west, and we don't want to strangle innovation at birth. So we need to know what is going on and how it affects what we care about, which is the safety and soundness of banks, protection of insurance holders, and the resilience of the system.\nTo the degree those things we think are not affected then we won't act, to the degree we think they are, we will. The accelerator is actually quite a good way of making sure that we have enough knowledge to be able to make that judgement.\nEdwards: OK, so resilience is interesting because I think we've all seen news stories about individual commercial bank accounts being hacked, and anyone's personal bank account can be hacked. But a few months ago there was news that the central bank of Bangladesh was hacked, and I noticed that one of the companies in your accelerator, BitSight, is focused on security. Are hackers a threat to central banks?\nHogg: Three of the proof-of-concepts actually are related to cybersecurity. So the two new ones we've launched very recently as well as BitSight — Anomali and ThreatConnect — are also geared towards cybersecurity. I think whatever kind of institution you are the threat is evolving and it is significant. And so the onus is on every institution to be proactive in their defence and to be looking at all the new tools that have emerged to address that and respond to that.\nEdwards: I feel reassured, I feel like you're on top of it!","url":"https://www.businessinsider.com/interview-bank-of-england-coo-charlotte-hogg-fintech-2016-12"}
