{"authors":["Jack Gaughan For Mail Online"],"date_download":"2018-10-22 22:33:09","date_modify":"2018-10-22 22:33:09","date_publish":"2016-01-28 10:35:39","description":"Leicester City are battling Inter Milan hard to sign Sampdoria forward Eder, with a conclusion either way expected in the coming days. But what do we know about the 29-year-old?","filename":"data/vaneerConsumption/InterMilanandLeicesterCitybothwantEderbutwhoistheSampdoriaforward.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A971D000000578-0-image-a-11_1453977336016.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420701_Eder-subject-two-way-tussle-Leicester-City-Inter-Milan-striker-chasing_1540247589.html","title":"Inter Milan and Leicester City both want Eder, but who is the Sampdoria forward?","title_page":"Inter Milan and Leicester City both want Eder, but who is the Sampdoria forward? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Leicester City are battling Inter Milan hard to sign Sampdoria forward Eder, with a conclusion either way expected in the coming days.\nRoberto Mancini's Inter are leading the race for the £10million man, despite offering smaller wages, but the Premier League leaders still hold out hope landing him.\nBut what do we know about the 29-year-old? Sportsmail takes a look.\nSampdoria forward Eder (right) in action against Napoli midfielder Jorginho in Serie A on Sunday\nWhere does he play?\nEder is pretty versatile, able to play anywhere across the front three and has been utilised wide by Sampdoria.\nAntonio Conte has asked the same of him for Italy - Eder made his debut in March last year.\nHe impressed internationally and should be in the squad for Euro 2016.\nHang on, I thought he was Brazilian?\nEder was born in Brazil but of Italian heritage thanks to his grandfather, the call-up along with Franco Vazquez by Conte causing national uproar.\nHe did, however, endear himself to the public by bailing Italy out away at Bulgaria - his equaliser to clinch a draw was crucial in qualifying.\nEngland's Phil Jagielka (left) thrashes clear under pressure from Italy's Eder in Turin last March\nWhy are Leicester interested?\nHe's an international available for around £10m whose engine and work-rate is not too dissimilar to that of Jamie Vardy's.\nIt's a no-brainer, really. Eder will run tirelessly all game and would not compromise Leicester's style or ethos, looking for that extra injection to push on in their title bid.\nIs he effective on the ball as well?\nCertainly - Eder has 40 goals in 101 Serie A starts for Sampdoria, a large proportion of those not through the middle, either.\nA clever player, knowing when to drift into pockets of space at opportune times and not afraid of a pot-shot.\nDirect runner on the ball and is more productive on the left than right.\nEder (right) is available for around £10m and his work-rate is not too dissimilar to that of Jamie Vardy's\nWhy hasn't the Premier League been interested sooner?\nAt 29, Eder is only just starting to really hit his stride. He has always scored goals but flitted in between the top two divisions in Italy over the last 10 years before settling at Sampdoria in 2012.\nHe slipped under the radar until last season's partnership with Manolo Gabbiadini, who was bought by Napoli this time last year.\nBut it looks like Leicester will miss out?\nInter Milan vice-president Javier Zanetti indicated overnight that it looked as if they have beaten the Foxes to Eder's signature.\nIt was understood he always preferred to remain in Italy if possible, although it is interesting Roberto Mancini wants to land him - the very man who opposed the international stripes last year.","url":"https://www.dailymail.co.uk/sport/football/article-3420701/Eder-subject-two-way-tussle-Leicester-City-Inter-Milan-striker-chasing.html"}
