{"authors":["Andrew Hutchinson"],"date_download":"2018-10-30 19:24:51","date_modify":"2018-10-30 19:24:51","date_publish":"2016-06-26 00:00:00","description":"ROGERS -- Golf's return to the Summer Olympics after a 112-year absence has generated excitement across the LPGA Tour.","filename":"data/vaneerConsumption/InterestinOlympicsgrowing.json","image_url":"https://media.arkansasonline.com/img/photos/2016/06/26/resized_250499-4cstacylewis39pcolorbw_67-21422_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_jun_27__1540927491.html","title":"Interest in Olympics growing","title_page":"Interest in Olympics growing","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Former Arkansas All American Stacy Lewis signs an autograph for Haylee Lantz, 10, of Bella Vista on Sunday during the final round of the Wal-Mart LPGA NW Arkansas Championship at Pinnacle Country Club in Rogers. Lewis, who also handed out Arkansas Razorbacks footballs to fans, shot a fi nal-round 68 and finished nine shots off the lead at 8-under-par 205. - Photo by Ben Goff\nROGERS -- Golf's return to the Summer Olympics after a 112-year absence has generated excitement across the LPGA Tour.\nPhoto by Ben Goff\nXiyu Lin from China walks off of the 12th fairway after making her putt on Sunday June 26, 2016 during the final day of the LPGA Wal-Mart NW Arkansas Championship at Pinnacle Country Club in Rogers.\nKey hole NO. 2 PAR 5 YARDS 545 NOTE Lydia Ko needed one hole to tie the tournament record at 15 under with a birdie on No. 1, then began to pull away for good on No. 2. She laid up with her third shot before sticking her fourth to within a foot for a tap-in birdie to get to 16 under. Morgan Pressel, who came into the final round tied with Ko, had to punch her third shot under a tree and it landed short of the green. After another chip, she two-putted for bogey to fall three strokes behind Ko at 13 under. — Frankie Frisco\n\"When I started playing golf, I never thought one day I'd have a chance to be in the Olympics and play for my country,\" said China's Xi Yu Lin.\nLin was one of several players at Pinnacle Country Club this weekend for the Wal-Mart LPGA NW Arkansas Championship who will participate in the Rio de Janeiro games later this summer.\nThe 60-player field won't be official until July 11, but Lin is in good shape to make it. She is China's second-ranked golfer, and is No. 53 in the world.\nThere are two tournaments before that deadline, including the U.S. Women's Open.\n\"I still have to focus on my game,\" Lin said. \"I don't want to think about it [the Olympics] too much, but I'm definitely preparing for that and I'm very excited.\"\nThe top 15 players in the Rolex Rankings receive automatic bids to the Olympics, up to a maximum of four players per country, while other countries are limited to two players.\nThe United States has two players inside that top-15 line, with No. 4 Lexi Thompson and former Arkansas All-American and world No. 10 Stacy Lewis.\n\"The way I've worked it out in my head is that we have 20 opportunities to win a major championship every four years,\" Lewis said earlier in the week. \"You have one opportunity to win an Olympic medal in four years.\n\"If that doesn't make it special, then I don't know what it is.\"\nMany players feel the same as Lin and Lewis, but some have reservations about playing because of safety concerns in Brazil.\nThe Zika virus has caused athletes across all sports to drop out of the games and it poses a unique threat to women, as it could lead to birth defects.\n\"I'm married. I'd love to have kids one day,\" said Gerina Piller, who, at No. 16, is just outside of being an automatic qualifier for the U.S. \"I'm going to cross that bridge when I get there and make the decision when I'm on the team.\"\nDespite those uncertainties, former Razorback Gaby Lopez, who will represent Mexico, said most of the women she plays with are looking forward to the Olympics.\n\"I tell them how excited I am, and they tell me the same thing,\" Lopez said. \"We all share the same passion, and it's going to be great to represent our countries in the same event.\"\nStanford's success\nAngela Stanford, the No. 70 player in the world, has always played well at Pinnacle Country Club.\nThat continued this weekend, as she tied for fourth at 13 under. It was her third top-10 finish at the event, after runnerup finishes in 2009 and 2014.\n\"I think the golf course fits my eye,\" Stanford said. \"The greens remind me a lot of my greens at home. The community is great here, and it feels like home.\"\nStanford, from Saginaw, Texas, ended the tournament with a 6-under 65 Sunday, while playing with fellow Texan and Solheim Cup teammate Brittany Lang.\n\"It's nice to play with somebody you like,\" Stanford said. \"You can kind of get a rhythm going, and you're kind of rooting for them. It's nice to have that mojo in the group.\"\nFirst-round flash\nFirst-round leader Ayako Uehara tied the course record with an opening-round 9-under 62 on Friday, but she was nowhere near the top of the leaderboard the rest of the weekend.\nA 3-over 74 on Saturday dropped her into a tie for 24th after the second round and she ended the tournament with a 2-under 69, finishing 8 under and tied for 25th.\nLong, Short of It\nThailand's Pannarat Thanapolboonyaras, with 25 letters, had the longest name of those who made the cut; Australia's Su Oh had the shortest name.\nThanapolboonyaras, the No. 484 player in the world, finished 4 under and tied for 60th, while Oh, the No. 42 player in the world, finished the tournament 7 under and tied for 32nd.\nLow Round\nSydnee Michaels' 7-under 64 was the lowest score of the final round. She finished the tournament 12 under and tied for eighth.\nNext Year's Date\nThe Wal-Mart LPGA NW Arkansas Championship will return to Pinnacle Country Club next year the week of June 19-25, officials with Octagon confirmed on Sunday.\nSports on 06/27/2016","url":"https://www.arkansasonline.com/news/2016/jun/27/golf-golfers-excited-about-olympics-201-1/"}
