{"authors":[],"date_download":"2018-10-22 20:46:37","date_modify":"2018-10-22 20:46:37","date_publish":"2014-06-02 23:40:36","description":"ne of the six climbers presumed dead after a fall on Mount Rainier was a vice president of Intel Corp. in Southeast Asia.","filename":"data/vaneerConsumption/IntelExecutiveAmongMountRainierClimbersPresumedDead.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/482851/140602-mount-rainier-1937_79a82309c658a01af9130658b656ac63.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_intel-executive-among-mount-rainier-climbers-presumed-dead-n120821_1540241197.html","title":"Intel Executive Among Mount Rainier Climbers Presumed Dead","title_page":"Intel Executive Among Mount Rainier Climbers Presumed Dead","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nOne of the six climbers presumed dead after a fall on Mount Rainier was a vice president of Intel Corp. in Southeast Asia.\nIntel spokesman Bill Calder confirmed Monday that his colleague Uday Marty was among the group of climbers who likely plummeted to their deaths last week high on snow-capped mountain in Washington state.\nCalder says that the Marty was \"widely loved and respected at this company.\"\nThe bodies of the two guides and four climbers who fell to their deaths last week on the 14,410-foot glaciated peak may never be recovered because of the hazardous terrain, authorities say.\nPark rangers and rescuers often are able to retrieve bodies within days of an accident, but sometimes it takes weeks or months, when conditions have improved and snow has melted on parts of the mountain.\nIt's unclear whether the climbers were moving or camping at the time of the accident, Wold said this past weekend. Searchers located camping and climbing gear and detected signals from avalanche beacons buried in the snow at the top of the Carbon Glacier at 9,500 feet in elevation.\nIt's also not known what caused the climbers to fall from their last known whereabouts at 12,800 feet on Liberty Ridge, whether it was rock fall or an avalanche. They were last heard from at 6 p.m. Wednesday when the guides checked in with their Seattle-based company, Alpine Ascents International, by satellite phone. The group failed to return Friday as planned.","url":"https://www.nbcnews.com/news/us-news/intel-executive-among-mount-rainier-climbers-presumed-dead-n120821"}
