{"authors":["Darren Boyle For Mailonline"],"date_download":"2018-10-23 00:50:40","date_modify":"2018-10-23 00:50:40","date_publish":"2016-01-29 14:13:07","description":"Derek Ferguson, 51, pictured, is one of the first people to feature on Europol's new 'most wanted' list in connection with a murder in pub near Glasgow on June 28, 2007.","filename":"data/vaneerConsumption/InterpolreleasesimagesofEuropesmostwantedcriminals.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B22CC400000578-0-image-a-30_1454070877597.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422849_A-5ft-Scottish-murderer-deformed-ears-Finnish-blonde-fraudster-run-Paris-terrorist-Salah-Abdeslam-Interpol-releases-images-Europe-s-wanted-criminals_1540255840.html","title":"Interpol releases images of Europe’s most wanted criminals","title_page":"Interpol releases images of Europe’s most wanted criminals  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Europol has launched a new website featuring the 'most wanted' criminals in Europe, which features a suspected murder from Glasgow, a 29-year-old blonde from Finland and on-the-run Paris terrorist Salah Abdeslam.\nThe website was launched by the European Network of Fugitive Active Search Teams from across the 28 EU Member states. Those on the list have either been convicted or suspected of involvement in serious crime such as murder, terrorism, rape or major financial fraud.\nMembers of the public can provide information on the suspects, anonymously if necessary and in some cases there are rewards available for the capture of the criminals involved.\nDerek Ferguson, left, is the only Briton on the list and Marina Cecilia Kettunen, 29, right, is the only woman\nDerek Ferguson, 51, is wanted in connection with the murder of Thomas Cameron who was killed at the Auchinairn Tavern, Bishopbriggs, near Glasgow on June 28, 2007. He is describes as being between 5 feet and 5'2 in height with green/blue eyes and short, balding brown/grey hair. His main distinguishing feature are his 'deformed' ears.\nMarina Cecilia Kettunen, 29, is wanted by police in Finland on suspicion of aggravated fraud of significant amount of money.\nSalah Abdeslam, left, and Mohamed Abrini, right, are both wanted in connection with the ISIS Paris attack\nBelgian and French police have issued alerts for Salah Abdeslam and Mohamed Abrini in connection with last year's terror attacks in Paris. Some 130 people were murdered during the atrocity.\nAbdeslam is believed to be one of the leaders of the terror cell responsible for the attack. Investigators have linked Abrini to the attacks after examining CCTV footage from November 11, 2015, two days before the attacks, from a petrol station at Ressons, on the highway to Paris.\nAbrini was driving a Renault Clio that was used two days later by the killers. He is described as 1.75metres tall and athletic. Both ben are described as armed and extremely dangerous and members of the public are warned against taking any initiative against the men.\nRomanian national Gregorian Bivolaru, left and Hime Lufaj right, is wanted by police in Austria\nYoga teacher Gregorian Bivolaru from Romania, is wanted for sexual exploitation of children and child pornography. The 63-year-old suspect, who is also known as Magnus Aurolsson was sentenced to six years in prison.\nAccording to Europol, he acted as his underage female victim's spiritual mentor and used this power to sexually abuse the girl. To repeat the acts he gave the girl various amounts of money and other benefits.\nAustrian police are offering a €10,000 reward for information leading to the capture to Hime Lufaj.\nThe 31-year-old Albanian is suspected of stabbing a police officer several times in the chest and upper arms. He is also wanted in connection with the attempted robbery of a woman, where he is believed to have attacked a passer-by who tried to intervene\nPatrik Snajdr, left is believed to be a member of a gang, while Zeljko Bojanic, right, is wanted for drugs offences\nPatrik Snajdr, 35, is wanted by police in Slovakia for being a member of a crime gang, racketeering and extortion. He has already been sentenced to 21 years in prison but is currently on the run. Europol warns that he is a dangerous criminal and could well be armed.\nZeljko Bojanic is believed to have been involved in a drugs smuggling operation with an Austrian national known as KT between September 2014 and June 2015 in Slovenia, Brazil and Austria. According to Europol, members of the gang met up in Zagreb on September 7, 2014 and agreed to buy a yacht to enable them to smuggle cocaine into Europe.\nAhmed Numan Isaac Rahma, left and Armen Oganesjan, right\nDanish police are hunting for Ahmed Numan Isaac Rahma, 38, who is suspected of murdering a man in his apartment in Copenhagen sometime between March 25 and March 26 2005. After killing his victim, Rahma is suspected of dismembering his corpse and disposed of the body.\nAccording to Europol, the most identifiable feature is whenever Rahma smiles, he shows his gums.\nEstonian police are looking for Armen Oganesjan, 51, who is believed to have paid a hitman to kill a police officer Juri Lihharev in Narva.\nOganesjan is believed to have issued the order to an Aleksander Semjonov who was tasked with trying to find someone to kill the officer.\nFollowing the murder, Oganesjan gave $1,000 to Igor Sahharov and Jevgeni Bogomolov who carried out the killing.\nDimitri Allan Lindeman, 50, left, and Robert Hauer, 24, right\nDimitri Allan Lindeman, 50, is wanted for the 2012 murder of a man.\nPolice in the Czech Republic are searching for Robert Hauer. The 24-year-old from Prague is wanted on suspicion of the attempted murder of Premek Pup.\nOfficers said that Pup was stabbed four times with a knife with a blade of between 5-12cm. He was wounded in his chest and arms. Paramedics were able save his life and rush him to hospital for emergency surgery.\nRobert Nigut, 38, left and Giedrius Poderskis, 44,\nSlovakian police are looking for suspected gang member Robert Nigut, 38, who has international arrest warrants issued for first degree murder and trafficking firearms and explosives.\nMembers of the public are warned that Nigut is likely to be armed and is extremely dangerous.\nLatvian police are hunting for Giedrius Poderskis, 44, who is believed to be part of a gang who kidnapped a Lithuanian from a hotel room in Riga. The victim was tortured by the gang to force him to disclose his bank account details.\nAccording to Europol, the victim, who had been taken to the rural parish of Olaine, died during the torture session.\nHungarian Robert Farkas, 37, left, and Simon Arnamo, 24, right, from Sweden\nHungarian police want to find Robert Farkas, 37, who is nicknamed the crow. He is suspected of being involved in 17 armed robberies between 2000 and 2001 stealing and estimated €1.6m.\nSimon Arnamo, 24, is a member of the right wing Swedish Resistance Movement. Arnamo is accused of murdering a man on September 21, 2012 in Vallentuna, Sweden with an accomplice.\nPolice said\nEuropol has issued photographs of the most wanted criminals in Europe ARNAMO, SIMON Simon is a member of the right wing organization Swedish Resistance Movement. He is suspected of murdering a man on the 21 September 2012 in Vallentuna, Sweden in cooperation with another perpetrator by severely beating and stabbing him to death.\nDavid Gras, 45, left, and Rafal Czerwoniec, 45,\nDavid Gras is suspected of being involved in a string of armed robberies against armoured cars or bank vaults in commando-style raids using explosives and heavy weapons.\nThe main raid targeted a vault in Orly. The gang blasted their way into the vault using explosives, killing one security guard and wounding two other employees.\nThe gang took 'several million euro' from the safe and took one hostage. While making their escape the gang opened fire on the police.\nRafal Czerwoniec, 45, is wanted by Police police for importing and selling drugs in Warsaw where he faces up to 25 years in prison.\nRadomir Cvijanovic, 31, left, and Bojan Dragicevic, right\nRadomir Cvijanovic, 31, is believed to have been part of a gang who broke into the vault of an SKB bank at 22.40 on October 31, 2005. During the raid, the gang managed to break into 428 safe deposit boxes where they stole almost €20 million in cash. A further €13 million worth of valuables was also stolen.\nAccording to Europol, the gang tried but failed to get into an additional 29 boxes.\nBojan Dragicevic and his accomplice Zoran Svitlica were both convicted of two bank robberies in August 2005. The pair targeted banks in the town of Sibenik, Croatia. Dragicevic was on the run until May 2012 when he was arrested in Bosnia and extradited to Croatia.\nDragicevic was placed in Lepoglava, which is regarded as the safest in the country. However on September 25, 2013, he managed to escape. Authorities recaptured him later that same day and transferred to Pula prison to serve the remainder of his sentence, which was due to expire on July 28, 2016. However, on August 22, 2014, he once again managed to escape.\nErnesto Fazzalari, 45, left, and Matteo Messina Denaro, 53, right\nItalian police have released details of two high-ranking mafia figures who they want to arrest.\nErnesto Fazzalari, 45, is described as a 'key figure of a mafia clan dubbed Avignone-Zagari-Viola' which is 'at war with another clan'.\nHe is described as a 'ruthless killer' who linked to three murders.","url":"https://www.dailymail.co.uk/news/article-3422849/A-5ft-Scottish-murderer-deformed-ears-Finnish-blonde-fraudster-run-Paris-terrorist-Salah-Abdeslam-Interpol-releases-images-Europe-s-wanted-criminals.html"}
