{"authors":[],"date_download":"2018-10-30 01:13:06","date_modify":"2018-10-30 01:13:06","date_publish":"2015-10-14 00:00:00","description":null,"filename":"data/vaneerConsumption/IntheaftermathoftheIrandealbusinessasusual.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_10_in_the_aftermath_of_the_iran_deal_business_as_usual_1540861986.html","title":"In the aftermath of the Iran deal, business as usual","title_page":"In the aftermath of the Iran deal, business as usual","title_rss":"NULL","source_domain":"americanthinker.com","text":"Just weeks after President Barack Obama (D)'s possibly illegal Iran agreement passed Congress, Iran is still not willing to happily hold hands with the U.S. and skip down the world's streets singing Kumbayah. Indeed, they have been behaving more belligerently. Who could have predicted such a shocking, shocking, shocking, I say, outcome? Well, anyone with common sense.\nConsider the following:\nA Washington Post reporter has been in an Iranian prison for over a year, charged with spying. Shouldn't his release, and that of three other imprisoned Americans, have been part of the Iran deal negotiations? Apparently it was not:\nIranian media says Post correspondent Jason Rezaian convicted Washington Post correspondent Jason Rezaian, imprisoned in Tehran for more than 14 months, has been convicted following an espionage trial that ended in August, Iranian media reported Monday. The verdict — belated and opaque — was strongly condemned by the journalist’s family and colleagues, as well as the U.S. government.\nHis fate and the future of the other three American prisoners – Amir Hekmati, Saeed Abedini, and Robert Levinson – are still unknown, although Jonathan Tobin suggests:\nGiven Obama’s track record on Iran, it’s possible to imagine the regime getting just about anything from the president, so long as, in the end, he can hold a White House photo op where he can play the hero with one or more of the grateful hostages and their families.\nAnd then there is this recent unsettling development.\nIran Tests Long-Range Missile, Possibly Violating Nuclear Accord TEHRAN — Iran tested a new guided long-range ballistic missile on Sunday, hours before Parliament, in a rowdy session, approved the generalities of the nuclear agreement reached in July between Iran and world powers, the state news agency IRNA reported. The missile launch may have violated the terms of the agreement, reached in Vienna with six world powers. According to some readings of the deal, it placed restrictions on Iran’s ambitious missile program. Experts have been debating the interpretation of a United Nations Security Council resolution, adopted a few days after the accord was agreed upon, that bars Iran from developing missiles “designed to carry nuclear warheads.”\nWell, what is a little misinterpretation among friends? Iran wants to launch missiles, therefore Iran will launch missiles, agreement or not. And Obama and all the other countries panting to do business with Iran will ignore Iran's violation of the agreement.\nAll of this – and more – has prompted Obama to desperately remind the members of international community that gleefully signed on to the Iran deal\nU.S. warns governments, bankers Iran sanctions still in place The Obama administration has privately reminded foreign governments and U.S. bankers that sanctions against Iran remain in effect, cautioning against a rush by Western companies to invest in Iran's oil industry and other businesses until the country fully complies with the July nuclear agreement. The U.S. State Department recently cabled a message, known as a demarche, to embassies around the world to reiterate that sanctions on Iran are still in place, diplomatic and government sources told Reuters on Friday. The demarche stressed that sanctions on Iran would not be lifted until the International Atomic Energy Agency verifies that Tehran has complied with the terms of the deal. \"The United States wants to tell governments not to get ahead of themselves when dealing with Iran,\" said a London-based diplomatic source. It is uncertain exactly when the layers of Western sanctions might be lifted, but experts have said some international financial transactions with Iran would be possible sometime next year if Iran is found in compliance.\nOh, no problem. I'm sure Iran will be found \"in compliance\" with all of the deal's finer points and that foreign governments wouldn't even think of doing business with Iran if they're not.\nSo, as Amir Taheri predicts:\nObama Will Be the Only Person Sticking to Iran Deal Sometime this week, President Obama is scheduled to sign an executive order to meet the Oct. 15 \"adoption day\" he has set for the nuclear deal he says he has made with Iran. According to the president's timetable the next step would be \"the start day of implementation,\" fixed for Dec. 15. But as things now stand, Obama may end up being the only person in the world to sign his much-wanted deal, in effect making a treaty with himself. The Iranians have signed nothing and have no plans for doing so. The so-called Joint Comprehensive Plan of Action (JCPOA) has not even been discussed at the Islamic Republic's Council of Ministers. Nor has the Tehran government bothered to even provide an official Persian translation of the 159-page text.\nSo, all together, the U.S. and Iran hold hands and sing Kumbayah. You don't know the words? \"Death to America!\"","url":"https://www.americanthinker.com/blog/2015/10/in_the_aftermath_of_the_iran_deal_business_as_usual.html"}
