{"authors":["Dave Davies"],"date_download":"2018-10-23 01:07:53","date_modify":"2018-10-23 01:07:53","date_publish":"2016-03-24 00:00:00","description":"It's not just about winning states. Winning a presidential nomination includes mastering complex rules about delegates, and Pennsylvania's rules are among the most complicated.","filename":"data/vaneerConsumption/InThisGOPPrimaryYouCanWinTheStateButGetOnlyAFewDelegates.json","image_url":"https://media.npr.org/assets/img/2016/03/24/gettyimages-155661612_wide-d0e86516d94b7ca398ab2aa4bedcec115f47d8b4.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_03_24_471685045_in-this-gop-primary-you-can-win-the-state-but-only-get-a-few-delegates_1540256873.html","title":"In This GOP Primary, You Can Win The State But Get Only A Few Delegates","title_page":"In This GOP Primary, You Can Win The State But Get Only A Few Delegates : NPR","title_rss":"NULL","source_domain":"npr.org","text":"In This GOP Primary, You Can Win The State But Get Only A Few Delegates\nEnlarge this image toggle caption Jeff Swensen/Getty Images Jeff Swensen/Getty Images\nPennsylvania's presidential primary is still a month away, but Republican campaigns are starting to focus on the state because it could prove to be a vital store of delegates for the three remaining candidates.\nDonald Trump has a narrow path to clinch the 1,237 delegates needed to secure the GOP nomination. Rivals Ted Cruz and John Kasich are now primarily focused on scoring enough delegates of their own to deny Trump a majority of delegates on the first ballot at this summer's Republican National Convention in Cleveland.\nPennsylvania's unusual method of allocating delegates offers pitfalls and opportunities for each campaign. A candidate could crush his opponents by 30 points in the April 26 primary and come away with precious few delegates.\n\"This is a very complicated process. It is beyond confusing,\" said Terry Madonna, a political scientist at Franklin & Marshall College. \"There is no way to know for sure what's likely to happen.\"\nWinning the primary gives a candidate just 17 of the state's 71 delegates on a winner-take-all basis. The other 54 will be technically uncommitted — elected directly by voters, three from each congressional district.\n\"When voters go into the voting booth, they're going to see the word 'uncommitted' under every candidate for delegate,\" said Lowman Henry, state chair of the Ted Cruz campaign. \"So the ballot will not give you any direction as to which presidential candidates those delegate candidates are supporting.\"\nThe best way for presidential campaigns to get some of the delegates is to recruit their supporters to run in their congressional districts as candidates for delegate. And they had to be on that task early. The filing deadline was in mid-February.\nThe Trump campaign recruited 68-year-old insurance executive Jamie Klein to run for delegate in central Pennsylvania.\nHe's pretty enthusiastic about his candidate. To those who claim Trump is a threat to the Republican Party, Klein says, \"If we're killing the Republican Party, it's because they need killing.\"\nKlein is devoted to Trump but unknown to voters in Pennsylvania's sprawling 5th Congressional District, who will decide whether he gets to go to the convention.\nThere are eight other candidates on the ballot in that district, which includes parts of 16 counties.\nA presidential campaign's task is to somehow tell voters which candidates for delegate are theirs. If a campaign is lucky, it will get some recognizable names — mayors or state legislators — on its slate.\nIf not, it will have to spend time and money campaigning not just for the presidential candidate, but for their little-known candidates for convention delegate.\n\"They'll run grass-roots campaigns, they may do mailers, they'll probably consider digital advertising, hopefully radio advertising, maybe even some television,\" said Chris Bravacos, who chaired the Marco Rubio campaign in Pennsylvania.\nThe Trump, Cruz and Rubio campaigns all placed candidates for delegates on the ballot. John Kasich's campaign appeared to be less active. That's unfortunate for him; a new poll shows Kasich surging in the state.\nIf a campaign wasn't able to field a healthy slate of delegate candidates, there's another hope for picking up support.\nMany party loyalists backed by county organizations will be elected as truly undecided delegates. Presidential candidates will try to woo them.\nOne such delegate is Calvin Tucker of Philadelphia. Presidential hopefuls have already courted Tucker, who says he most wants to nominate an electable candidate.\nGiven Pennsylvania's idiosyncratic rules, it's unclear how many of its delegates will be allied with presidential candidates. Those who are truly uncommitted could have some leverage when the convention opens in Cleveland.","url":"https://www.npr.org/2016/03/24/471685045/in-this-gop-primary-you-can-win-the-state-but-only-get-a-few-delegates"}
