{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:06:21","date_modify":"2018-10-30 22:06:21","date_publish":"2016-12-15 00:00:00","description":"UK insurance companies, pension funds, and trusts pulled £15 billion worth of investments between July and September.","filename":"data/vaneerConsumption/InvestorsarepullingbillionsofpoundsinthewakeofBrexit.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ons-pension-funds-insurance-companies-trusts-investment-disinvestment-brexit-2016-12_1540937181.html","title":"Investors are pulling billions of pounds in the wake of Brexit","title_page":"    ONS: Pension funds, insurance companies, and trusts pulled £15 billion after Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Chancellor of the Exchequer Philip Hammond (left) and the Secretary of State for Exiting the European Union David Davis during a meeting with executives from the financial services at the Shard in central London. Jack Taylor PA Wire/PA Images LONDON — UK insurance companies, pension funds, and trusts pulled a collective £15 billion ($18.7 billion) worth of investments between July and September, new figures show.\nData from the Office for National Statistics (ONS) released on Thursday shows a net disinvestment in the third quarter, meaning Britain's biggest investors pulled more money out of the market than they invested.\nThis is highly unusual.\nA quarterly disinvestment has only occurred 5 times since 1987, showing just how unusual the sell-off is, and the ONS says: \"In terms of context, the 5-year quarterly average for this series is net investment of £6 billion.\" ONS\nThe figures are the first full investment numbers since the Brexit vote and the effect seems striking. However, the ONS cautions that \"only a very limited number of our survey respondents mentioned this [the EU referendum] as a factor in their returns.\"\nA spokesperson for the ONS said it couldn't give any further guidance on what was driving the change. The sell-offs could signal a change in investment strategies for the pension and insurance industries, both of which rely on long-term returns. However, it's not exactly clear what they would be cycling into.\nThe biggest sell-off came in the stock markets, with British investors selling off £11 billion worth of overseas shares and £8 billion of UK-listed shares.\nBut the ONS says: \"In Quarter 3 2016, net disinvestment was reported in overseas securities, UK corporate securities, other assets and UK government sterling securities.\" So pretty much across the board.\nThe ONS says the investment activities of the insurance, pension, and trust sectors are important because \"these institutions control £4 trillion of assets and engage in considerable volumes of investment activity to fund their operations.\n\"An understanding of their investments and assets is important in order to monitor the stability of the financial sector and is used in the compilation of the UK National Accounts.\"","url":"https://www.businessinsider.com/ons-pension-funds-insurance-companies-trusts-investment-disinvestment-brexit-2016-12"}
