{"authors":[],"date_download":"2018-10-30 21:28:09","date_modify":"2018-10-30 21:28:09","date_publish":"2016-12-20 00:00:00","description":"A sharp increase in profit at Jefferies Group, the investment banking unit of Leucadia National Corp, was driven by its equities and fixed-income business.","filename":"data/vaneerConsumption/InvestmentbankJefferiesfourthquarterprofitjumpsfourfold.json","image_url":"https://amp.businessinsider.com/images/58594af7a1a45e46008b6fd5-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_investment-bank-jefferies-fourth-quarter-profit-jumps-four-fold-2016-12_1540934889.html","title":"Investment bank Jefferies fourth quarter profit jumps four-fold","title_page":"    Investment bank Jefferies fourth quarter profit jumps four-fold - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Bryan Bedder / Stringer / Getty Images Dec 20 (Reuters) - Jefferies Group LLC, the investment banking unit of Leucadia National Corp, reported a sharp increase in quarterly profit on Tuesday, driven by strong revenue in its equities and fixed-income securities trading business.\nNet earnings attributable to Jefferies jumped to $87.18 million in the fourth quarter ended Nov. 30 from $19.96 million a year earlier, when investors were scared off by uncertainty over U.S. interest rates, a slowdown in China and a sharp drop in oil prices.\nEquities and fixed-income revenue more than doubled to $325.38 million as trading surrounding the U.S. presidential election added to the market volatility sparked by Britain's Brexit vote.\nJefferies' investment banking revenue rose 11.3 percent to $415.07 million in the quarter, boosted by higher fees from advising on mergers and acquisitions.\nNew York-based Jefferies traditionally kicks off the reporting season for investment banks and is often viewed as an indicator of the performance of bigger Wall Street banks. (Reporting by Richa Naidu in Bengaluru; Editing by Saumyadeb Chakrabarty and Ted Kerr)","url":"https://www.businessinsider.com/investment-bank-jefferies-fourth-quarter-profit-jumps-four-fold-2016-12"}
