{"authors":["Laurel Rosenhall"],"date_download":"2018-10-30 23:34:47","date_modify":"2018-10-30 23:34:47","date_publish":"2018-08-27 00:00:00","description":"The most explosive allegation to come out of the #MeToo movement in the California Capitol—a lobbyist's claim that then-Assemblyman Matt Dababneh pushed her into a bathroom and made her watch him masturbate—has been substantiated by an Assembly investigation.","filename":"data/vaneerConsumption/InvestigationsubstantiateslobbyistsMeTooclaimofsexualmisconductbyformerAssemblyman.json","image_url":"https://calmatters.org/wp-content/uploads/Screen-Shot-2018-08-27-at-6.53.07-PM-e1535421236561.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_blog__1540942487.html","title":"Investigation substantiates lobbyist's #MeToo claim of sexual misconduct by former Assemblyman","title_page":"Investigation substantiates lobbyist's #MeToo claim of sexual misconduct by former Assemblyman | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The most explosive allegation to come out of the #MeToo movement in the California Capitol—a lobbyist’s claim that then-Assemblyman Matt Dababneh pushed her into a bathroom and made her watch him masturbate—has been substantiated by an Assembly investigation. And legislative officials went even further by denying Dababneh’s request for an appeal of the findings, according to records released Monday.\nDababneh, a San Fernando Valley Democrat who resigned in December, has denied the allegation and sued lobbyist Pamela Lopez for defamation after she publicly accused him of trapping her in a bathroom, masturbating and asking her to touch him while they were both at a Las Vegas hotel in 2016 for a mutual friend’s wedding. The Assembly investigation was triggered by a formal complaint Lopez lodged after hundreds of women signed a letter last fall decrying a culture of sexual harassment in the California Capitol.\nSince then, the Legislature has approved a new policy for preventing and responding to harassment, and leaders agreed to make public certain records when investigations determine that elected officials and high-level staff members engaged in misconduct.\n“So far it seems like the process is working,” said Lopez on Monday. “I was sexually harassed by Dababneh, the legislature conducted an investigation and substantiated that claim, then denied his appeal.”\nWe are keeping track of the harassment records the Legislature is releasing with this spreadsheet; scroll to the right to see the documents.","url":"https://calmatters.org/articles/blog/metoo-investigation-substantiates-lobbyists-metoo-claim-of-sexual-misconduct-by-former-assemblyman/"}
