{"authors":[],"date_download":"2018-10-30 20:52:33","date_modify":"2018-10-30 20:52:33","date_publish":"2018-07-03 23:08:00","description":"State authorities are investigating whether members of the Glynn County Police Department or other l...","filename":"data/vaneerConsumption/Investigatorsreviewifkillercophadhelp.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/03/Images/newsEngin.22448557_Jason-Clark-photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_investigators-review-killer-cop-had-help__1540932753.html","title":"Investigators review if killer cop had help","title_page":"Investigators review if killer cop had help","title_rss":"NULL","source_domain":"ajc.com","text":"State authorities are investigating whether members of the Glynn County Police Department or other law enforcement agencies assisted Lt. Robert C. Sasser in locating his estranged wife and her boyfriend before he shot and killed them last week.\nThe Georgia Bureau of Investigation inquiry is potentially devastating for the coastal police department already reeling from intense public scrutiny in the wake of Sasser’s brutal murders. The killings took place at the estranged wife’s boyfriend’s home in neighboring McIntosh County on Thursday night.\nIn a letter to the GBI on Friday, Brunswick District Attorney Jackie Johnson raised the specter of possible illegal aid given to the officer, asking the special agent in charge of the Brunswick region “whether any charges are appropriate for individuals who may have assisted (Sasser) as a party to the crime.”\nThe inquiry is examining whether any Glynn officers or others with access to law enforcement information provided assistance that helped Sasser locate Katie Kettles Sasser or John Hall Jr. Sasser fatally shot Hall multiple times before killing Katie Sasser, then eluded officers on his way back to his home in Glynn County. There, while in his truck, he fatally shot himself in the chest during a SWAT standoff.\n“The letter speaks for itself,” said GBI Director Vernon Keenan. “We’re looking at whether anyone provided information that facilitated his actions.”\nOn Tuesday, Glynn police Chief John Powell acknowledged that Sasser tried to solicit information from at least one officer in the department. The chief said he initiated the plan to call in the GBI and supports its investigation.\nSasser “had made contact and was soliciting information,” Powell said without providing details.\nQuestions have swirled around criminal justice leaders in Brunswick since the killings last week. Long before the recent violence, Sasser was notorious in Georgia police circles. He and another officer shot and killed Caroline Small in 2010 after a low-speed chase, though her car was hemmed in with nowhere to go. Both he and the other officer, Michael T. Simpson, faced no consequences for what was considered one of the most questionable police shootings in recent Georgia history. The courts deemed their actions justified and both men continued to serve as officers.\nSasser’s career unraveled in May. He tried to assault officers after a nine-hour armed SWAT standoff on May 17 during which he was suicidal. Just days before, he’d been arrested in a domestic violence episode with his estranged wife.\nHe was out on bond last month, but a judge had banned Sasser from Glynn County as part the conditions of his release. He’d also been ordered to stay away from his wife and not possess any firearms. The Glynn County Police Department had suspended him and was in the process of terminating his employment when Sasser returned to Brunswick June 26 for a court hearing related to his divorce.\nThat evening, he saw his wife and Hall at a local restaurant, Moondoggy’s Pizza, where he allegedly threatened them. He allegedly used his hand to mimic a gun and made a motion as if he was pulling the trigger. That led Katie Sasser to file a complaint with the Glynn police, and Hall followed up the next morning with a meeting with Glynn investigators.\nHall’s attorney, Jason Clark, said he was with Hall when he met with Glynn investigators to discuss the threat. He said Hall was concerned that the police department would not take the threat seriously.\n“I don’t understand why they didn’t do anything,” Clark said. “We told the investigator at the meeting we suspected that, if something was not done, someone was going to get hurt.”\nThe killings occurred the day after that meeting.\nChief Powell said his agency thoroughly reviewed the complaint, but there was insufficient evidence to arrest. He said they were in conversation with the courts about the incident at the pizza restaurant that police viewed as a possible bond violation.\nClark expressed disbelief that Glynn police continue to maintain there was nothing more local authorities could have done to prevent the killings.\n“Anybody who read (Sasser’s) bond order …. if they didn’t see probable cause in this, they don’t know what probable cause is,” Clark said.\nThe pressure on local law enforcement has continued to mount, compounded by the legacy of special treatment Sasser and Simpson received following the Small shooting. A 2015 investigation by The Atlanta Journal-Constitution and Channel 2 Action News found Glynn police interfered with the GBI investigation of that shooting and tampered with the crime scene. The agency also concocted an inaccurate animation of the shooting that the district attorney showed to grand jurors.\nJohnson took unusual steps to help the officers, letting them know the state’s evidence weeks before the grand jury met in 2011. Her actions were so outside the bounds of convention that several former assistant district attorneys in her office later accused her of prosecutorial misconduct for her mishandling of the case. One called it a murder coverup after details of the case emerged.\nJohnson made no mention of the Small case last Friday in her two-page memo explaining Sasser’s release following the May arrests.\n“All of us involved in the Glynn County Court System are saddened by the tragic events occurring last night involving the loss of life for three individuals,” she said.","url":"https://www.ajc.com/news/crime--law/investigators-review-killer-cop-had-help/xBRH2v4nX0Ux84o7yRwFxJ/"}
