{"authors":["Jesse Felder"],"date_download":"2018-10-31 00:10:25","date_modify":"2018-10-31 00:10:25","date_publish":"2018-07-12 00:00:00","description":"Some argue that not including the most popular stocks in a portfolio is the biggest mistake today — but you won’t find value in anything that is the focus of the mania itself. It’s contrarianism that is really at the heart of sincere value investing.","filename":"data/vaneerConsumption/Investorsarelookingforvalueinallthewrongplaces.json","image_url":"https://amp.businessinsider.com/images/5b47a00f4b62561e008b492f-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_investors-are-looking-for-value-in-all-the-wrong-places-2018-7_1540944625.html","title":"Investors are looking for value in all the wrong places","title_page":"    Investors are looking for value in all the wrong places - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters / Andrew Burton\nBill Miller and others have recently argued that the real mistake value investors are making today is not including the most popular stocks in the market in their portfolios. I would argue just the opposite: that the real mistake value investors are making today, at least the ones really looking value, is trying to be contrarian by following the consensus.\nThe Felder Report\nThe first problem I have with Miller's thesis is that the foundation of value investing really is in risk management more than anything else. Ben Graham wrote, \"Confronted with a challenge to distil the secret of sound investment into three words, we venture the motto, Margin of Safety.\" It's very difficult to effectively assert that the most popular stocks in the market, at their most expensive valuations in history, offer any sort of \"margin of safety\" whatsoever. Value investing is about playing defense first and letting the offense take care of itself. Buying these stocks thus requires abandoning a value discipline in favor of something else entirely.","url":"https://www.businessinsider.com/investors-are-looking-for-value-in-all-the-wrong-places-2018-7"}
