{"authors":["Phoebe Weston For Mailonline"],"date_download":"2018-10-23 02:52:00","date_modify":"2018-10-23 02:52:00","date_publish":"2017-04-26 14:06:43","description":"A San Francisco-based dating app called The League - which has been dubbed Tinder for people who are attractive or famous - is launching in London today.","filename":"data/vaneerConsumption/InviteonlyTinderforbeautifulpeoplecomestoLondon.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9FA15100000578-0-image-a-32_1493210325680.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4447104_Invite-Tinder-beautiful-people-comes-London_1540263120.html","title":"Invite-only Tinder for beautiful people comes to London","title_page":"Invite-only Tinder for beautiful people comes to London | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The secretive dating app that's only for people who are rich, famous or attractive is coming to London.\nInvitations to join the exclusive club, called The League, have been sent out to a chosen few of the most successful singletons in the city.\nThe selective dating service already has a waiting list of 10,000 people in the UK and the company has selected 2,000 'model users' to get things started.\nScroll down for video\nInvitations to join the exclusive club, called The League, have been sent out to a chosen few of the most successful Tinder users in London, where it launches today\nARE YOU HOT ENOUGH? Founding members have to be between 24 and 36. The League will look at your degree, education institution, professional title (or past professions), industry and number of referrals. Before final admission, all applicants photos are reviewed and approved by the team (so you must be attractive as well). Ms Bradford says the app is for people who value 'ambition and intelligence above everything else'. The selective dating service already has a waiting list of 10,000 people in the UK. People can see if they pass the test by putting their phone number into their website.\nStanford graduate and The League CEO Amanda Bradford has been talking to single people in London over the last month to scout out potential users.\nGlamorous parties have been hosted across the city at locations including Shoreditch House, The Ivy Chelsea Garden and the Chiltern Firehouse.\nThe League will be available on Android and iPhone from today.\nMs Bradford told Business Insider the first 'model users' have 'obviously spent time creating their profiles'.\nFounding members have to be between 24 and 36 although this age range will expand as more people are selected to join.\n'Referrals move a lot faster, we want to encourage our London users to bring their networks, so that it grows with the right user base,' Ms Bradford said.\nApplicants were selected based on a variety of factors: degree, education institution, professional title (or past professions), industry and number of referrals from current members.\nBefore final admission, all applicants photos were reviewed and approved by the team - so beauty is an important asset.\nCEO Amanda Bradford (second from the left) and her team have been talking to single people in London over the last month to scout out potential users in London\nInvitations to join the exclusive club, called The League, have been sent out to a chosen few of the most successful singletons in the city\nHere is one of the adverts for the new app. Founding members will be given a complimentary lifetime membership worth $999 (£780) and for those who weren't selected, membership costs $179 (£140) a year\nMs Bradford says the app is for people who value 'ambition and intelligence above everything else'.\nFounding members will be given a complimentary lifetime membership worth $999 (£780) and for those who weren't selected, membership costs $179 (£140) a year.\n'Think of The League as a member's only club, but one with a killer singles scene', said Ms Bradford.\n'We're a community for intelligent, ambitious and high ­achieving people that are looking for an equal partner'.\nThe League says its mission is to create 'power couples' and uses data from Facebook and LinkedIn to feed into its algorithm, pictured is an advert\nThe League says its mission is to create 'power couples' and uses data from Facebook and LinkedIn to feed into its algorithm.\nThe app first launched in the US in 2015 and is available in San Francisco, New York, Los Angeles, Chicago, Washington D.C., and Boston.\n'London has an incredible pool of ambitious, well-educated men and women that are looking for someone who shares their drive', said Ms Bradford.\n'We do the scouting and the vetting, you do the matching and the petting,' The dating service wrote on its website.\nThe selective dating service already has a waiting list of 10,000 people in the UK and the company has selected 2,000 'model users' to get things started\nThe League will look at your degree, education institution, professional title (or past professions), industry and number of referrals\nTinder has launched a similar version of the selective app.\nThe services are intended for 'celebrities and people who do really well on Tinder,' according to a source who spoke to Tech Crunch.\nIt's not yet clear how the selection process works on Tinder Select, but all of the users to have been invited so far have been 'attractive' with relatively high public or social media profiles.\nTinder appears to choose the individual users it wants join the elite group, which has been operating under the radar for at least the past seven months.\nThe League has been contacted for comment.\nBefore final admission, all applicants photos are reviewed and approved by the team (so you must be attractive as well). Here is a picture of their exclusive London launch","url":"https://www.dailymail.co.uk/sciencetech/article-4447104/Invite-Tinder-beautiful-people-comes-London.html"}
