{"authors":[],"date_download":"2018-10-30 00:57:22","date_modify":"2018-10-30 00:57:22","date_publish":"2017-01-02 17:16:40","description":null,"filename":"data/vaneerConsumption/InVictoryMagnanimity.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/01/Magnanimity.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861042.html","title":"In Victory, Magnanimity","title_page":"In Victory, MagnanimityThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"As we begin a new year, those of us who astutely backed Trump from the get-go might want to ask ourselves how we might show magnanimity to our opponents. That’s what Churchill recommended, after a victory, and he was right about that as he was about most things.\nFor Hillary, things are understandably rough, and especially for the Clinton Foundation. The American Spectator has been on her case since 1992, and I think it’s time for us to be a little gracious. She no longer commands the $350,000 she used to demand for a speech, back when she had a quo to give for the quid, but I’d suggest that Bob Tyrrell invite her to speak at our next annual banquet. In return for a brand new toaster!\nFor Obama, it’s a little tougher to think of something he might need. What do give to the guy who has everything — except maybe a legacy. But there is one thing we can do, something we did for Churchill. How about granting him an honorary American citizenship?\nAnd then there are the NeverTrumpers. Curiously, like John Cougar Mellencamp’s Jack and Diane, they’re still around. “Oh yeah, life goes on. Long after the thrill of living is gone.” One of them commissioned a 4,000 word article from me, and then after I submitted it ignored my emails and phone calls to see what had happened to it. In between I had outed myself as a Trump supporter. Another NeverTrumper went out of his way to pour ridicule on me and my friends. A third, whom I had never met before, appeared on a radio show to debate me, and apologized to the audience for being 10 minutes late because he had to struggle with whether he wanted to talk to someone he held in such contempt.\nI’m not complaining about any of this. Many Trump supporters can tell similar stories. It was a matter of indifference then, and remains so today. I recall it all with a smile. I bear them no ill will, but I simply don’t know what magnanimity might mean with such people.\nF.H. Buckley’s latest book is The Way Back: Restoring the Promise of America (Encounter, 2016)","url":"https://spectator.org/in-victory-magnanimity/"}
