{"authors":["Associated Press"],"date_download":"2018-10-23 00:11:11","date_modify":"2018-10-23 00:11:11","date_publish":"2017-03-16 09:14:30","description":"PYEONGCHANG, South Korea (AP) - IOC board member Gian Franco Kasper apologized Thursday for comparing a ban on Russia from the 2018 Olympics to persecution...","filename":"data/vaneerConsumption/IOCboardmemberapologizesforlinkingRussianbantoNazis.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/10/wire-227837-1489661362-124_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319372_IOC-board-member-apologizes-linking-Russian-ban-Nazis_1540253471.html","title":"IOC board member apologizes for linking Russian ban to Nazis","title_page":"IOC board member apologizes for linking Russian ban to Nazis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PYEONGCHANG, South Korea (AP) - IOC board member Gian Franco Kasper apologized Thursday for comparing a ban on Russia from the 2018 Olympics to persecution of Jews in Nazi Germany.\n\"It was an inappropriate and insensitive comment,\" Kasper, the long-time International Ski Federation president, said in a statement.\nThe 73-year-old Swiss official had been speaking on the sidelines of an IOC board meeting in 2018 host city Pyeongchang. Kasper compared a potential Olympic ban for Russia - as punishment for state-backed doping and cheating at the 2014 Sochi Games - with indiscriminate persecution by the Nazis.\nFILE - The Feb. 7, 2011 file photo shows Gian Franco Kasper, President of the International Ski Federation (FIS) and member of the International Olympic Commitee (IOC) during a press conference in Garmisch-Partenkirchen, southern Germany. Kasper apologized Thursday, March 16, 2017 for comparing a ban on Russia from the 2018 Olympics to persecution of Jews in Nazi Germany. \"It was an inappropriate and insensitive comment,\" Kasper, the long-time International Ski Federation president, said in a statement. (AP Photo / Kerstin Joensson, file)\n\"I apologize unreservedly for any offence I have caused. I am truly sorry,\" Kasper said in the statement released by the IOC.\nThe IOC has set up two commissions to verify evidence - detailed in investigations appointed by the World Anti-Doping Agency - of Russia's doping program before deciding on the country's Olympic participation.\nLast July, the IOC board declined to impose a blanket ban on Russian teams and athletes competing at the Rio de Janeiro Olympics. Instead, the decision was left with the sports federations in a chaotic two weeks of legal debate and hearings before the games.\nKasper was not a board member at the time. He has since been promoted to represent winter sports on the IOC's policy-making committee.\nThe two IOC commissions, investigating claims of a Russian doping conspiracy and prosecuting disciplinary cases against individual athletes, are expected to work for several more months.","url":"https://www.dailymail.co.uk/wires/ap/article-4319372/IOC-board-member-apologizes-linking-Russian-ban-Nazis.html"}
