{"authors":[],"date_download":"2018-10-23 03:59:10","date_modify":"2018-10-23 03:59:10","date_publish":"2017-03-10 13:58:10","description":"The International Olympic Committee has frozen all cash funding for sport in Kenya as it battles the national Olympic body over its governance, a spokeswoman...","filename":"data/vaneerConsumption/IOCfreezesfundingforKenyaovergovernance.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/13/wire-196279-1489154293-864_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4301382_IOC-freezes-funding-Kenya-governance_1540267150.html","title":"IOC freezes funding for Kenya over governance","title_page":"IOC freezes funding for Kenya over governance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The IOC accused Kenyan officials of going against an accord reached with the national Olympic committee and the Kenyan government in September on reviving the Kenyan body\nThe International Olympic Committee has frozen all cash funding for sport in Kenya as it battles the national Olympic body over its governance, a spokeswoman said Friday.\nThe IOC could decide at a meeting next week in South Korea to definitively halt all grants and subsidies.\nThe National Olympic Committee of Kenya voted down proposed new statutes this week that could have ended the standoff with the global body.\n\"The IOC is extremely disappointed by the outcome of the NOC extraordinary general assembly which did not address governance issues in the appropriate way,\" said an IOC spokeswoman.\nThe IOC accused Kenyan officials of going against an accord reached with the national Olympic committee and the Kenyan government in September on reviving the Kenyan body.\n\"The IOC is now putting on hold all payments of subsidies to the NOC of Kenya until a decision of the IOC executive board is taken at its meeting next week.\"\nKenya has been added to a growing list of troubles for the IOC to be discussed at a meeting in Pyeongchang, South Korea on March 16-17.","url":"https://www.dailymail.co.uk/wires/afp/article-4301382/IOC-freezes-funding-Kenya-governance.html"}
