{"authors":["Associated Press"],"date_download":"2018-10-23 01:10:32","date_modify":"2018-10-23 01:10:32","date_publish":"2017-03-16 10:54:16","description":"GENEVA (AP) - Doping investigator Richard McLaren has been invited for talks with IOC President Thomas Bach amid ongoing tension between Olympic sports...","filename":"data/vaneerConsumption/IOCpresidentBachtomeetwithRussiadopinginvestigator.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/15/wire-229211-1489678159-151_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319672_IOC-president-Bach-meet-Russia-doping-investigator_1540257032.html","title":"IOC president Bach to meet with Russia doping investigator","title_page":"IOC president Bach to meet with Russia doping investigator | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"GENEVA (AP) - Doping investigator Richard McLaren has been invited for talks with IOC President Thomas Bach amid ongoing tension between Olympic sports bodies and anti-doping officials.\nThe offer, announced Thursday, to meet in Lausanne comes eight months after McLaren detailed evidence of a Russian doping conspiracy at the 2014 Sochi Olympics.\nMcLaren's work initially provoked calls for the IOC to ban Russia from the Rio de Janeiro Olympics. A total ban from the 2018 Winter Games is still possible.\nInternational Olympic Committee (IOC) President Thomas Bach, left, is escorted by South Korea's Prime Minister and acting President Hwang Kyo-ahn for a meeting in Seoul, South Korea, Tuesday, March 14, 2017. (Kim Kyung-Hoon/Pool Photo via AP)\nOn Monday in Lausanne, McLaren spoke of his frustration at \"nitpicking\" criticism of his work, including by the IOC.\nWhile McLaren and Russia's sports minister were keynote speakers at a WADA event in Lausanne this week, IOC leaders have been in South Korea inspecting the next Olympic host city.\nIOC spokesman Mark Adams said Thursday that Bach wants to meet McLaren and WADA President Craig Reedie to improve relations.\n\"Hopefully (we can) work on a better and tighter cooperation as we move forward on this issue,\" Adams said at a news conference on the sidelines of a two-day IOC board meeting in Pyeongchang.\nIn his letter to McLaren, Bach praised the Canadian lawyer's work, which revealed \"a massive doping program in Russia based on systematic manipulation of anti-doping,\" Adams said.\n\"This was supported by the findings of McLaren,\" said the IOC spokesman, suggesting it was a \"clear\" message of appreciation from Bach.\nThe IOC sent a different message last month in an open letter to sports bodies, noting \"a lack of consistent evidence\" in McLaren's investigation and suggesting \"translations used by (his) team were not adequate.\"\nMcLaren told The Associated Press on Monday that questioning translations was \"a complete red herring to obfuscate and disguise what is going on.\"\nAny IOC decision on Russia competing in Pyeongchang must await reports from two commissions it set up to analyze McLaren's work: One will try to verify claims of a Russian state-supported program of doping and cover-ups, and the second will prosecute disciplinary cases against individual athletes.\nAdams noted Thursday that McLaren himself says his mandate was not to provide complete evidence against more than 1,000 athletes.\n\"That work beyond the mandate has to be done to a level that can stand scrutiny in a court of law,\" Adams said.\nBach's invitation to McLaren follows the Canadian investigator confirming Monday that his cooperation has stalled over confidentiality issues with the first IOC commission created to verify the doping plot.\nMcLaren said he had replied to a 50-page spreadsheet sent by the IOC on behalf of the commission chairman, former Switzerland state president Samuel Schmid. The original spreadsheet was published last month after being leaked by Russian hackers.\n\"If we are going to move forward together, (Schmid) has got some conditions in my correspondence that he has to meet,\" McLaren told the AP.\nThe IOC also clarified its post-McLaren position Thursday by publishing a 12-point list of principles for a stronger and more independent anti-doping system.\nIdeas to install a neutral WADA president and create an independent global unit to oversee testing athletes are widely shared. Reedie's term ends in 2019, when WADA plans to host a world conference that can agree on reforms.\nHowever, while WADA wants the power to sanction non-compliant organizations - such as national bodies in a Russia-type investigation - the IOC says the Court of Arbitration for Sport should have that authority.\nAdams said that proposal to separate powers would avoid WADA being a \"judge and jury.\"\nIn other issues discussed Thursday, the IOC board declined to suspend the Kenyan Olympic committee and did not lift an 18-month suspension of Kuwait's Olympic body.\nLawyer Richard McLaren, investigator and report author for the world anti-doping agency , WADA, delivers his speech addressing his findings on Russian State-Sponsored doping systems during the opening day of the 2017 world anti-doping agency annual symposium, at the Swiss Tech Convention Center, in Lausanne, Switzerland, on Monday March 13, 2017. (Valentin Flauraud/Keystone via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4319672/IOC-president-Bach-meet-Russia-doping-investigator.html"}
