{"authors":["Associated Press"],"date_download":"2018-10-23 02:03:19","date_modify":"2018-10-23 02:03:19","date_publish":"2016-01-28 16:42:02","description":"ATHENS, Greece (AP) — A group of refugee athletes will march together in the opening ceremony of the Olympics in Rio de Janeiro in a symbol of hope for the w...","filename":"data/vaneerConsumption/IOCsBachRefugeeswillbehonoredatRioOlympics.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:ff463a45f1434a2788751065220535b2-2vdWmEltwXfba0ce28e632aaafe1-333_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420860_IOCs-Bach-Refugees-honored-Rio-Olympics_1540260199.html","title":"IOC's Bach: Refugees will be honored at Rio Olympics","title_page":"IOC's Bach: Refugees will be honored at Rio Olympics | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"IOC's Bach: Refugees will be honored at Rio Olympics\nATHENS, Greece (AP) — A group of refugee athletes will march together in the opening ceremony of the Olympics in Rio de Janeiro in a symbol of hope for the world's migrants, IOC President Thomas Bach said Thursday.\nOn a three-day visit to Greece, Bach also said a refugee would carry the torch during the Greek leg of the flame relay and that the route would include a stop at an Athens refugee camp. The flame lighting ceremony at Ancient Olympia will take place on April 21.\n\"We want to turn the attention of the world to the fate and the problems of the 60 million refugees in our world and their suffering,\" Bach said.\nIOC President Thomas Bach, plays soccer with refugees during his visit at a refugee camp in Athens on Thursday, Jan, 28, 2016. Bach says the torch relay for this year's Olympics in Rio de Janeiro will include a stop at a refugee camp in Athens. He also promised to build sporting facilities on the island of Lesbos that has been hard hit by the migrant crisis.(AP Photo/Petros Giannakouris)\nHe visited the refugee camp in Athens, played soccer with a group of young men, and met potential candidates who could compete for the first time as refugee athletes at the Rio Games.\n\"They have no hope, no flag to march behind, and no anthem,\" Bach said. \"We have invited them to participate, and these athletes will march behind the Olympic flag\" at the Aug. 5 opening ceremony.\nBach said he expected between five and 10 refugee athletes to qualify for the Olympics. He said he spoke to two potential Olympic competitors in Athens, who could compete in shooting events and karate.\nThe International Olympic Committee has already pledged $2 million to help refugees, and is asking authorities in refugee camps to identify any top-level international athletes.\nThe IOC said in December that three potential Olympic athletes had been identified so far from among the wave of refugees and migrants.\nGreece has been hard hit by the migration crisis that escalated dramatically in 2015 when more than 850,000 traveled in dinghies and mostly unsafe boats from Turkey to the Greek islands.\nDespite growing European pressure on Athens to toughen border controls, Bach described Greece's assistance to refugees as \"really extraordinary\" and promised funds for planned sports facilities on the Greek island of Lesbos.\nBach praised progress in Brazil's Olympic preparations despite the country's serious financial downturn and outbreak of the mosquito-borne Zika virus.\n\"Brazil is in financial and political crisis, and is facing a great corruption scandal,\" he said. \"And under these circumstances, it is even more remarkable what the Brazilians have done.\"\nBach said the timing of the games, during Brazil's winter, could limit difficulties caused by the virus outbreak, and he promised to have consultations with national Olympic Committees on safety guidelines by late Friday.\nBefore leaving Athens, Bach on Friday will visit the marble Panathinian Stadium, where the first modern Olympics were held in 1896.\n___\nIOC: Olympic Solidarity programs http://www.olympic.org/olympic-solidarity-commission/\n___\nFollow Gatopoulos at http://www.twitter.com/\nIOC President Thomas Bach, center, walks with two young refugees with former IOC President Jacques Rogge in the background, during their visit at a refugee camp in Athens on Thursday, Jan, 28, 2016. Bach says the torch relay for this year's Olympics in Rio de Janeiro will include a stop at a refugee camp in Athens. He also promised to build sporting facilities on the island of Lesbos that has been hard hit by the migrant crisis.(AP Photo/Petros Giannakouris)\nIOC President Thomas Bach, right, meets refugees during his visit at a refugee camp in Athens on Thursday, Jan, 28, 2016. Bach says the torch relay for this year's Olympics in Rio de Janeiro will include a stop at a refugee camp in Athens. He also promised to build sporting facilities on the island of Lesbos that has been hard hit by the migrant crisis.(AP Photo/Petros Giannakouris)\nIOC President Thomas Bach, plays soccer with refugees during his visit at a refugee camp in Athens on Thursday, Jan, 28, 2016. Bach says the torch relay for this year's Olympics in Rio de Janeiro will include a stop at a refugee camp in Athens. He also promised to build sporting facilities on the island of Lesbos that has been hard hit by the migrant crisis.(AP Photo/Petros Giannakouris)","url":"https://www.dailymail.co.uk/wires/ap/article-3420860/IOCs-Bach-Refugees-honored-Rio-Olympics.html"}
