{"authors":["Associated Press"],"date_download":"2018-10-23 03:47:59","date_modify":"2018-10-23 03:47:59","date_publish":"2016-01-29 19:10:13","description":"LONDON (AP) — The IOC advised national Olympic committees on Friday to follow the World Health Organization's guidance on dealing with the Zika virus ahead o...","filename":"data/vaneerConsumption/IOCsendsmedicaladvicetoOlympiccommitteesonZikavirus.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:d86f2f259f9b4eaa94bf43a1251e87f0-3bmscybNe842cce83474b590701a-894_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423152_IOC-sends-medical-advice-Olympic-committees-Zika-virus_1540266479.html","title":"IOC sends medical advice to Olympic committees on Zika virus","title_page":"IOC sends medical advice to Olympic committees on Zika virus | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"IOC sends medical advice to Olympic committees on Zika virus\nLONDON (AP) — The IOC advised national Olympic committees on Friday to follow the World Health Organization's guidance on dealing with the Zika virus ahead of the Olympics in Rio de Janeiro, asserting its confidence that the games will be safe.\nBrazil has been hit hard by the mosquito-borne virus, which has been linked to severe birth defects in infants, raising concerns about the outbreak's potential impact on South America's first Olympics in August.\nThe International Olympic Committee sent a note to all national Olympic committees outlining the latest medical advice concerning Zika, the most recent problem for a country already dealing with a severe economic crisis and a sprawling corruption scandal.\nIn this Jan. 27, 2016 photo, homes are lit by the setting sun in Ibura, one of the neighborhoods with the highest numbers of suspected cases of children born with microcephaly in Recife, Pernambuco state, Brazil. The Zika virus is the suspected culprit of 3,400 cases of microcephaly in the country. (AP Photo/Felipe Dana)\n\"All parties are taking action to address this topic, and are following developments closely,\" the IOC said.\nThe two-page note from the IOC medical commission repeated advice for travelers to take precautions against mosquito bites and for women who are planning to become pregnant to assess the potential risks of traveling to areas infected with the virus.\n\"The IOC remains in close contact with the WHO to ensure that we have access to the most up-to-date information and guidance, from now through to Games time,\" the IOC statement said. \"At the same time NOCs should consult with their national health authorities to get advice and guidance.\"\nThe IOC did not say the Olympics were threatened in any way and made clear it expects the Aug. 5-21 games to be secure for athletes and visitors.\n\"We remain confident that there will be a safe environment for successful and enjoyable games in Rio de Janeiro,\" the statement concluded.\nThe WHO, which declared Thursday that the Zika virus was \"spreading explosively,\" will hold an emergency meeting of independent experts Monday to decide if the outbreak should be declared an international health emergency.\nBrazilian President Dilma Rousseff on Friday announced a nationwide attack on the mosquito that spreads that Zika virus, vowing to \"win this war\" against the insect.\nThe mosquito has been linked by Brazilian researchers to a seemingly sudden upsurge in cases of microcephaly, in which children are born with abnormally small heads. The virus has also been linked to the paralysis-causing Guillain-Barre syndrome.\nBrazilian researchers believe the strain of Zika may have entered Brazil with visitors arriving for the 2014 World Cup.\nMario Andrada, spokesman for Rio's Olympic organizing committee, said there was no threat of the games being postponed or canceled because of the outbreak.\n\"We're not even thinking of that,\" he said. \"This has never been mentioned. No way. It's impossible to do that. There is no reason to do that.\"\nThe IOC reiterated the position that, because the games will be held during the southern hemisphere winter, the mosquito population will be smaller and the threat of the virus diminished.\nThe IOC cited current medical advice that all travelers should take measures to avoid mosquito bites, including wearing long pants and long sleeves and using insect repellent.\nWomen who are planning to become pregnant should discuss travel plans with their health providers to assess the risk, it said.\nThe IOC said the WHO does not recommend any change to travel plans, but noted that some national authorities have recommended \"on a precautionary basis\" that pregnant women should consider avoiding travelling to areas infected by Zika.\nThe IOC noted that plans had already been put in place by Brazilian organizers for daily inspection of Olympic venues to remove any puddles of stagnant water where mosquitoes breed.\n\"Rio 2016 will also continue to follow the virus protection and control measures provided by the authorities, and will provide the relevant guidance to games athletes and visitors,\" the statement said.\nAndrada, the Rio Games spokesman, said organizers held a conference call Friday with sponsors to explain preventive measures. He said officials had started inspecting the venues and already noticed an improvement.\n\"In the beginning, the first few days of inspecting, we found a lot (of stagnant water),\" Andrada said. \"Now it's dropped dramatically.\"\nThe Australian Olympic Committee said this week that any pregnant team members \"need to consider the risks very carefully\" before deciding whether to go to Brazil.\nThe U.S. Olympic Committee said it was monitoring the situation through the Centers for Disease Control and Prevention, the IOC, the WHO and infectious disease specialists.\nThe European Olympic Committees said it was following events and also expects that each individual country \"will be taking strict precautions and will be advised by their own health authorities.\"\n__\nAP Sports Writer Stephen Wade in Rio de Janeiro contributed.\nIOC President Thomas Bach plays with children during his visit at the marble Panathenian Stadium, venue of the first modern Olympics in 1896, in Athens on Friday, Jan, 29, 2016. Bach who is in Greece on a three-day visit said Thursday that a group of refugee athletes will march together in the opening ceremony of the Olympics in Rio de Janeiro in a symbol of hope for the world's migrants. (AP Photo/Petros Giannakouris)\nIn this Jan. 26, 2016 photo, Daniele Ferreira dos Santos, center right, stands outside her house as her ex-husband holds their son Juan Pedro, who was born with microcephaly, outside her house in Recife, Pernambuco state, Brazil. Almost from birth, Pedro cried ceaselessly, as do many babies with microcephaly. Her husband was annoyed by the baby¿s constant fussing, which distracted him from his television show, she said, and then within weeks of the baby's arrival, left the house with the family's flat screen TV. (AP Photo/Felipe Dana)","url":"https://www.dailymail.co.uk/wires/ap/article-3423152/IOC-sends-medical-advice-Olympic-committees-Zika-virus.html"}
