{"authors":["Associated Press"],"date_download":"2018-10-23 03:32:56","date_modify":"2018-10-23 03:32:56","date_publish":"2016-01-28 19:06:18","description":"ATHENS, Greece (AP) — The IOC will advise all national Olympic bodies on how to deal with the Zika virus ahead of the games in Rio de Janeiro. IOC President ...","filename":"data/vaneerConsumption/IOCtoadvisenationalOlympicbodiesonZikavirus.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:88c9e38c930e41a7b9d81648a4fdcb52-2vdWmEltwXfba0ce28e632bdf813-416_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421407_IOC-advise-national-Olympic-bodies-Zika-virus_1540265576.html","title":"IOC to advise national Olympic bodies on Zika virus","title_page":"IOC to advise national Olympic bodies on Zika virus | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"IOC to advise national Olympic bodies on Zika virus\nATHENS, Greece (AP) — The IOC will advise all national Olympic bodies on how to deal with the Zika virus ahead of the games in Rio de Janeiro.\nIOC President Thomas Bach said Thursday the committee is in \"close contact\" with Brazilian authorities and the World Health Organization about the mosquito-borne virus.\nThe World Health Organization said Thursday the virus — which has been linked to birth defects and neurological problems — is \"spreading explosively.\" The WHO will hold an emergency meeting of independent experts Monday to decide if the outbreak should be declared an international health emergency.\nIOC President Thomas Bach, chats with children during his visit at a refugee camp in Athens on Thursday, Jan, 28, 2016. Bach says the torch relay for this year's Olympics in Rio de Janeiro will include a stop at a refugee camp in Athens. He also promised to build sporting facilities on the island of Lesbos that has been hard hit by the migrant crisis.(AP Photo/Petros Giannakouris)\nBach said the IOC would send advice this week to all national Olympic committees.\nHe said the national bodies can then \"inform all their athletes (about the safety guidelines) to show that we will do everything to ensure the heath of the athletes and all the visitors.\"\nBach spoke during a visit to Greece where he promoted a $2 million international assistance program for refugee athletes.\nBach said the fact that the Olympics will take place in August, during Brazil's winter, could mitigate the impact of the Zika outbreak.\nRio de Janeiro Mayor Eduardo Paes says he doesn't believe the spreading Zika virus \"is a problem for the Olympics,\" which begin Aug. 5.\nSpeaking Thursday, Paes said the mosquito-borne Zika virus was unlikely to affect the Rio Olympics. The games take place in the drier, cooler South American winter season when the mayor says controlling the mosquito population \"will be much easier.\"\nAs he has with the fear of crime in Rio de Janeiro during the games, or the severe water pollution in the sailing venue Guanabara Bay, Paes called the Zika virus \"our problem, a problem of Brazil\" and attempted to distance it from the Olympics and subsequent Paralympics.","url":"https://www.dailymail.co.uk/wires/ap/article-3421407/IOC-advise-national-Olympic-bodies-Zika-virus.html"}
