{"authors":["Erica Tempesta For Dailymail.Com"],"date_download":"2018-10-23 04:09:32","date_modify":"2018-10-23 04:09:32","date_publish":"2016-01-28 20:03:33","description":"Alisha Morton, 31, from Ankeny, Iowa, admitted to going to Northview Middle School to confront an eight grade boy who has been allegedly tormenting her 14-year-old daughter Morgan Sellers.","filename":"data/vaneerConsumption/Iowamotherchargedwithassaultafterconfrontingaschoolbully.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30ACF6DD00000578-0-image-a-35_1454008310758.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3421384_Mom-confronted-school-bully-says-14-year-old-daughter-want-die-charged-ASSAULT-arm-girl-got-face_1540267772.html","title":"Iowa mother charged with assault after confronting a school bully","title_page":"Iowa mother charged with assault after confronting a school bully | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Alisha maintained that she only put her arm up to keep the girl out of her personal space, however, she has been charged with assault\nWhen Alisha went to speak with the ringleader of the bullying, she said a ninth grade girl got in her face and took a swing at her\nThe mother claims that she reported the bullying to the school repeatedly, but the situation was never rectified\nAlisha Morton, 31, from Ankeny, Iowa, admitted to going to Northview Middle School to confront her daughter Morgan Seller's alleged\nA mother has been charged with assault after she claims she was forced to protect her 14-year-old daughter from a bully.\nWhile Alisha Morton, 31, from Ankeny, Iowa, admitted to going to Northview Middle School to confront an eighth grade boy who has been allegedly tormenting her 14-year-old daughter Morgan Sellers, she claimed the school's inability to rectify the situation gave her no choice.\n'For my child to come home and tell me that she wants to die because this child is still doing something that I’ve confronted this school and this superintendent about - it kills me inside,' Alisha told WHOTV.\nProtective mom: Alisha Morton (R), 31, from Ankeny, Iowa, has been charged with assault after confronting the accused bully who allegedly tormented her 14-year-old daughter Morgan Sellers (L)\nMorgan, who is a ninth grader at the school, said a group of her peers have been making fun of her and calling her names since last fall, particularly a male student who is a grade below her.\n'It’s been stressful because I never know what name they’re going to call me each day,' she told the news outlet. 'It makes me feel bad about myself, like I’m not good enough.'\nAfter Morgan told her mom that the situation at school was so stressful that she wanted to 'just die', Alisha visited the school on Monday January 11 to confront the ringleader targeting her daughter.\nHowever, went she went to go speak with the boy, she said a ninth grade girl intervened and allegedly threatened her.\n'She had stood up and gotten in my face and said, \"I am going to beat your a**. Get the hell out of here,' Alisha claimed. 'I said, 'You are a child. You are not involved in this. I am talking to [him] sit back down.'\nOngoing issue: Morgan said a group of her peers have been making fun of her and calling her names since last fall, including an eighth grade boy who is allegedly the ringleader\nMorgan's mother went on to say that the young girl 'got in my face' and that is when she put her arm up to block her.\n'I put one arm out. It’s not like I took two hands and aggressively pushed her,' Alisha maintained.\nAlisha said the student wouldn't back down, and eventually 'took a swing' at her. That's when Morgan stepped in.\n'I told her when I grabbed her hands, I'm like \"You're not going to hit my mom,\"' Morgan explained.\nAccording to the complaint, Morton was charged with assault 'by admittedly shoving [the student] during a verbal altercation'.\nPhysical altercation: Alisha alleged that she was confronting Morgan's bully when a ninth grade girl intervened and allegedly took a swing at her. The mom said that was when she put her hand up to block the girl\nOne side of the story: Alisha maintained that she only put her hand up, stating that it wasn't like 'took two hands and aggressively pushed her'\nThe Ankeny School District told WHOTV in a statement that it does 'not comment on the specifics of student discipline matters', while noting that all inquiries regarding adult conduct and/or criminal charges should be directed to the Ankeny Police Department.\n'Ankeny Community School District has a policy of investigating all bullying and harassment charges brought forth,' the statement continued. 'There are currently no Ankeny Community School District Harassment/Bullying Complaint forms filed in the district, or open reports in the phone/web-based incident reporting tool “TIPS”.'\nMeanwhile, WHOTV reported that the Ankeny Police Department declined to comment.\nDaily Mail Online has reached out to both the Ankeny School District and the Ankeny Police Department for comment.\nNo help: Alisha said she asked the the principal, the teachers, and the superintendent at Northview Middle School (pictured) to put an end to the bullying but claimed the situation was never rectified\nTrying to stay strong: In November, Morgan took to her Facebook Page to stand up to her bullies and thank her family for their love and support\nIn November, Morgan took to her Facebook page to stand up to her bullies and thank her mother and her family for supporting her.\n'Hi, my name is Morgan as you all know. A little information about me. I have a mother who loves me so much. I have a step-father who at times can get on my nerves but I know he loves me very much,' she wrote.\n'I have a lot of siblings who I love but the best thing of all I am loved and I know I am loved. I am beautiful and no matter who sits there and calls me stupid immature names.","url":"https://www.dailymail.co.uk/femail/article-3421384/Mom-confronted-school-bully-says-14-year-old-daughter-want-die-charged-ASSAULT-arm-girl-got-face.html"}
