{"authors":[],"date_download":"2018-10-23 05:30:47","date_modify":"2018-10-23 05:30:47","date_publish":"2017-02-14 00:00:00","description":"About 180,000 state and local government workers would be prohibited from negotiating over issues such as health insurance and extra pay. The bill is high on the state GOP's legislative agenda.","filename":"data/vaneerConsumption/IowaMovesToRestrictCollectiveBargainingForPublicSectorWorkers.json","image_url":"https://media.npr.org/assets/img/2017/02/14/02132017_capitolrotundademonstrators_001_3x2_1080_wide-33257d958bb378d5b60bd6853b691590e861c68f.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=515242288_1540272647.html","title":"Iowa Moves To Restrict Collective Bargaining For Public Sector Workers","title_page":"Iowa Moves To Restrict Collective Bargaining For Public Sector Workers : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ROBERT SIEGEL, HOST:\nSix years ago, other states watched a bitter fight play out in Wisconsin between the state's Republican leaders and government workers. The workers lost that fight. Now the same thing might happen in Iowa. Lawmakers there are considering overhauling how public sector unions negotiate contracts, and they are likely to succeed, as Iowa Public Radio's Clay Masters reports.\nCLAY MASTERS, BYLINE: For the first time in nearly 20 years, Republicans here have control of the House, Senate and governor's office, and they've put the state's more-than-40-year-old collective bargaining law in its crosshairs. Last night, teachers, Teamsters, firefighters and others packed the Capitol in protest. Chants of kill the bill rang through the rotunda.\n(SOUNDBITE OF ARCHIVED RECORDING)\nUNIDENTIFIED CROWD: (Chanting) Kill the bill. Kill the bill.\nMASTERS: The bill was introduced last week and would affect 180,000 state and local government workers in Iowa. It would be prohibited from negotiating over issues including health insurance, seniority and extra pay, and it also leaves in place a provision that prevents workers from going on strike. Becky Pringle, vice president of the National Education Association, stood on a folding chair to rile up the massive crowd.\n(SOUNDBITE OF ARCHIVED RECORDING)\nBECKY PRINGLE: Enough of these misguided politicians and their billionaire buddies trying to take our voice and our rights. (Chanting) Enough, enough, enough...\nUNIDENTIFIED CROWD: (Chanting) Enough...\nMASTERS: Four people spoke in favor of the bill, including Drew Klein with the Iowa chapter of Americans for Prosperity. That's the nonprofit political advocacy group funded by conservative donors David and Charles Koch.\n(SOUNDBITE OF ARCHIVED RECORDING)\nDREW KLEIN: It's not the strength of the unions that makes our state a great place to live. It's the quality of our friends and neighbors and their willingness to tackle tough problems head-on.\nMASTERS: More than 1,100 people signed up to speak against the bill, but only 33 got the chance. Lindsey Herron says she left her old job with good pay to work as a correctional officer at a state prison for better benefits. If the bill becomes law...\n(SOUNDBITE OF ARCHIVED RECORDING)\nLINDSEY HERRON: The risk is no longer worth it. You may think that's fine until those offenders end up living next door to your family. And they learn nothing in prison because they no longer have professional, educated staff working there.\nMASTERS: This bill is modeled on legislation that passed in Wisconsin six years ago. Wisconsin Governor Scott Walker was the architect of that law. Last night, he tweeted that Iowa Republicans have the chance to pass big, bold reforms. The debate is expected to last days. For NPR News, I'm Clay Masters in Des Moines.\n(SOUNDBITE OF RATATAT SONG, \"BUSTELO\")\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=515242288"}
