{"authors":["Associated Press"],"date_download":"2018-10-22 20:28:26","date_modify":"2018-10-22 20:28:26","date_publish":"2016-01-29 01:49:23","description":"DES MOINES, Iowa (AP) — With just days to go until the Iowa caucuses, the state's longtime Republican governor said Thursday that the federal government has ...","filename":"data/vaneerConsumption/IowasBranstadsayssecuritytopconcernforGOPvoters.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:6882975af8604d37a9af290b0c4489b7-4PuZeKVXE7cd9005b2c87634d46b-755_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422047_Iowas-Branstad-says-security-concern-GOP-voters_1540240106.html","title":"Iowa's Branstad says security top concern for GOP voters","title_page":"Iowa's Branstad says security top concern for GOP voters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Iowa's Branstad says security top concern for GOP voters\nDES MOINES, Iowa (AP) — With just days to go until the Iowa caucuses, the state's longtime Republican governor said Thursday that the federal government has failed to assure the American people that they are safe.\nGov. Terry Branstad, who is likely serving out his last term in office, has declined to publicly endorse anyone in this year's crowded Republican field, but he applauded those who have made national security a central theme in their campaign platforms — anyone, that is, except Texas Sen. Ted Cruz.\n\"Security is a big concern — personal security for Americans because of the attacks that have occurred on our own soil, as well as Paris,\" the six-term governor said in an exclusive interview with Associated Press.\nIn this Jan. 28, 2016 photo, Iowa Gov. Terry Branstad speaks during an interview with The Associated Press in his office at the Statehouse in Des Moines, Iowa. Iowa¿s longtime Republican governor sees a national electorate very unhappy with government and financial institutions, but are ultimately most concerned about their nation¿s and their personal security. (AP Photo/Patrick Semansky)\nFormer Florida Gov. Jeb Bush, New Jersey Gov. Chris Christie, Florida Sen. Marco Rubio and billionaire Donald Trump have all put significant emphasis on the need to root out the Islamic State group from their safe havens in Iraq and Syria. The group has claimed responsibility for a number of attacks on foreign soil, including the deadly attacks in Paris in November, and has inspired a number of lone-wolf attackers to kill in its name.\nHowever, Branstad, who typically favors those with state or federal governing experience, admits that those running for office in 2016 haven't fared as well against those positioning themselves as anti-establishment, Washington outsiders.\n\"They've not done as well,\" he said of the more mainstream politicians. \"I've been surprised.\"\nIowans are gearing up for the country's leadoff vote on Feb. 1 — a contest that generally sets the tone for later races in the primary season and establishes the momentum for those who may go on to win their party's nominations.\nBranstad made headlines last week when he publicly urged Iowans to support candidates other than Cruz, who opposes the federal renewable fuel standard, which requires a minimum amount of petroleum additives such as corn-based ethanol. Iowa leads the nation in ethanol production and is a leader in other renewable energy sources.\nBranstad noted that Cruz also opposes an extension for the wind-energy tax credit.\n\"I want us to have a strong leader who is going to restore respect for America, somebody that's going to continue to improve our economy and create good jobs, and certainly recognize the importance of renewable energy in that process,\" Branstad said, speaking from his office in the Iowa Capitol.\nBranstad appeared to have no hard feelings against Trump, on the other hand, who remarked: \"How stupid are the people of Iowa,\" in response to Republican Ben Carson's brief lead in the polls.\nUnlike many Republicans who have spoken out against Trump, Branstad stopped short of declaring the GOP front-runner unfit for the presidency based on his brazen conduct.\nNot that he's one to mince words. Four years earlier, Branstad publicly questioned former U.S. House Speaker Newt Gingrich's discipline in the days leading up to the caucuses.\nOn Trump, Branstad said: \"Certainly, I don't agree with a lot of things he has to say. I don't agree with his decision not to participate in the debate.\"\nTrump denounced the Fox News Channel-sponsored Republican debate scheduled for Thursday evening, and declined to participate, in light of what he considered unfair questioning during the network's first debate in August.\n\"I just think a lot of people just respect a guy who's got the guts to tell people what he really thinks,\" Branstad said.\nBranstad noted that Florida Sen. Marco Rubio was attracting good-sized crowds to his events, but wondered if he'd spent enough time in the state. Rubio is in the midst of an uninterrupted nine-day Iowa sprint to the caucuses with about a dozen cities on his itinerary Friday, Saturday and Sunday.\nWhether a Republican in Congress can make the case that he or she is an outsider in this anti-Washington environment, as Rubio is attempting, is difficult to say, Branstad said.\nOverall, Branstad admitted, \"it's been an unusual year.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3422047/Iowas-Branstad-says-security-concern-GOP-voters.html"}
