{"authors":["Kenneth Dickerman","Photo Editor","Hannes Jung"],"date_download":"2018-10-21 02:56:48","date_modify":"2018-10-21 02:56:48","date_publish":"2018-07-06 10:00:52","description":"Photographer Hannes Jung visited Lithuania, where the suicide rate is among the highest in the world.","filename":"data/vaneerConsumption/Iphotographlifenotdeathbecausedeathcannotbeseen.json","image_url":"https://www.washingtonpost.com/resizer/I5VsR89VLvnGPiEtJoKQR-QPzdQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QNUYR7GF7UZEBC2QY6ITQKX6WE.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_07_06__1540090608.html","title":"‘I photograph life, not death, because death cannot be seen’","title_page":"‘I photograph life, not death, because death cannot be seen’ - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Mosquitoes hover above a lake near Kupiskis, Lithuania. Vilma, a woman who lives at the lake, lost her husband five years ago to suicide. She wrote: “After five-year-long grief, I have an interest in life again. I discovered a new feeling in myself — I am interested. I am interested in going to a theater or opera, canoeing and taking part in Rotary Club activities, even watching the sunset, again. This is my story.” May 9, 2016 (Hannes Jung)\nEdita sits with her husband, Darius, in their living room in Kaunas, Lithuania, on May 21, 2016. Edita’s father killed himself that January. Edita wrote: “I’m sitting exactly where I sat when I got your text and found out that you had killed yourself. This is the place where I sat, trembling and praying that this weren’t true. I am sorry for not being an ideal daughter. I WANT you to know that I love you. I miss you dearly. Sometimes I still call your number and wait for your call on Sundays. Sometimes I curl into a ball and cry in my bed, because I miss you so much. Why did you tell me that you’ll always stand by me? When you are gone, who should I go to? I remember you as I ride my bike — you gave me the freedom to ride it =) THANK YOU. I am happy, but I miss you so much. I no longer have a dad, and I’m angry at you. You left me. I love you and dream of you often. You are my daddy. Farewell. I love you.” (Hannes Jung)\nHannes Jung traveled to Lithuania to explore a country marked by a high rate of suicide. Below, the 32-year-old photographer writes about his project, “How is Life?”:\nDeath follows life. Always. A fact that unites all of us.\nAs a young person, I expect to die when I’m old, maybe when I’m sick, but definitely not now. So much still lies ahead of me. For the ones who are left behind, suicide always raises the question of life. Why did someone choose death over life?\nThe suicide rate in Lithuania is nearly three times as high as the average rate in the European Union. It is among the highest in the world.\nLooking at the bigger picture, suicides occur more frequently in bigger cities. Whereas in rural areas, where social ties are stronger, less people lose hope in life. But in Lithuania, more people commit suicide in the countryside. Men between ages 40 and 50 are at a high risk of suicide. Alcoholism and unemployment, among other reasons, are contributing factors.\nThe reasons for each suicide are different, but they are not an expression of personal freedom. They’re often attached to hopelessness and disease. Social and environmental factors also play a big role.\nSince World War II and starting with the Soviet occupation, the per-capita suicide rate for Lithuanian men at times has grown from 10 suicides per 100,000 to 90. Experts speak about a collective trauma and loss of identity — influenced among others by the forced collectivization of the farms in rural areas through the Soviets. But the reasons for suicide are always complex and personal, and they cannot mainly rest on the country’s trauma.\n“How is Life?” is not just about photography. It is about the people and their stories. I worked with the subjects and asked them to write down their personal stories. Their statements are an essential part of this project.\nI photograph life, not death, because death cannot be seen. It’s like the wind: You can’t take photos of the wind, but you can capture its consequences, the bending of trees, the rolling waves.\n(The research for the project was supported by the Robert Bosch Foundation. To protect the subjects’ privacy, only their first names are used.)\nVolunteers man the Youthline helpline on Feb. 10, 2016, in Vilnius, Lithuania. Antanas, a volunteer, wrote: “While working for the Youth Line, I keep meditating over the phenomenon of human free will. To what extent is suicide an impulsive, mechanical reaction to suffering, and to what extent is it a person’s choice to give up? Would all people, faced with immense suffering, choose suicide? I don’t know … But I increasingly want to respect the person’s choice, whatever it may be. To stand by them and to respect them.” (Hannes Jung)\nA well in the garden of “D” in Katiliskiai, Lithuania, on May 20, 2016. D’s husband attempted suicide in the well. D wrote: “When I saw my husband descending into the well, I got very scared, but I no longer remember what I thought. As I asked him to get out of there, he told me he could no longer do it. With the help of my mother and daughter we pulled him up.” (Hannes Jung)\nCar tracks on a road near Panevezys, Lithuania, on May 10, 2016. (Hannes Jung)\nAsta sits for a portrait on March 6, 2018, in Zarasai, Lithuania. Asta grew up under difficult circumstances. She wrote: “I once told my son how I wished to die, so that everything, all fears, would be gone. But my son burst into crying and asked me, ‘Mom, who will love me, who will need me then?’ It was heart-wrenching. Of course, nobody needs you, except for me. After all, whose fault is it in this life, maybe my parents? Since I repeat everything what they did.” (Hannes Jung)\nA cabinet in the living room of Eugenija in Panevezys on March 1, 2018. When Eugenija opens a door to the cabinet, she can see a picture of her son, Petra, who died by suicide. She wrote down: “Don’t be alone, we’re all from one and the same world. May no one take their own life voluntarily, because life is a gift.” (Hannes Jung)\nA portrait of Donata with her dog, Mikutis, in bed in Kupiskis, Lithuania, on Jan. 30, 2016. Donata has suffered from depression for many years, during and after her divorce. Her dog has been helpful. She wrote: “I thank Mikutis for bringing life back to me, and for the immense love he gave us. For sixteen years, we all shared daily life and festive moments, we grew, we lived, we learned. Mikutis is now in the hunting grounds of eternity, and we carry on living. My daughter studies at a university, I work and have her back, as the dog used to have our back at a certain point in time. It never asked questions, it never said anything, it never judged, only cuddled up to me and warmed me until all ‘ice’ melted.” (Hannes Jung)\nA forest near Varena, where the suicide rate is the highest in Lithuania. (Hannes Jung)\nBottles of alcohol fill the shelves of a small shop in Varena. According to the World Health Organization, Lithuania has one of the highest levels of alcohol consumption in the world. (Hannes Jung)\nA rally car drives at a makeshift training course in Varena, Lithuania, on Feb. 20, 2016. Gintautas, the founder of the local car/youth club wrote: “My favorite colors are black and white, so I dive head down, passionately, into all activities I engage in. I strive to help children under my guidance to learn to recognize and be guided by the road signs of life as soon as possible.” (Hannes Jung)\nBirute watches television in the living room of her home in Kupiskis, Lithuania, on Feb. 27, 2018. Birute doesn’t have a lot of contact with people; she describes herself as lonely. I got to know her because she’s regularly calling a help line for older people who are lonely. She wrote: “Demolished houses/Grass-overgrown paths/I can’t forget them/I don’t even know/What I’m waiting for” (Hannes Jung)\nThe living room of a farmers family’s home near Radeikiai, Lithuania, on Jan. 29, 2016. (Hannes Jung)\nTeresa dances in her kitchen in Varena on Feb. 21, 2016. Teresa’s husband killed himself 19 years ago. Teresa wrote: “When I’m sad, I sing, play and listen to music, I relax with a good mood, I dance, I love jokes. I try to smile at all times.” (Hannes Jung)\nA dog in the garden of Janina in the small village of Salamiestis, Lithuania, on Jan. 29, 2016. Janina’s family struggles with social problems. (Hannes Jung)\nEduardas, a priest, walks through the graveyard of his parish in Joniskis, Lithuania, on March 3, 2018. The suicide rate in the region was third-highest in the country in 2016. (Hannes Jung)\nEduardas, above, wrote:\nThe gate through which we see off our dead is like a boundary between two worlds — the time of the past, the present, and eternity. Every time I visit a cemetery I gaze at the signs of memory: crosses, stones and tiles, and fences, which mark the burial places of people we held important, cherished and loved so much. This space under a laconic line, usually consisting of two names and two dates, encompasses a whole life — with its successes and losses, joys and grievances, thousands of good deeds, fatherly hugs and childish hubbub. I often stop in my steps, remembering the stories of my parish members, as time carries them into oblivion day by day. What remains is what touches the hearth, what touches the depths of the soul and prompts asking, what do we live for? Only to have a mossy stone standing in the place of our eternal rest? As I gaze at the vast area of the cemetery, my memories take me back to the distant end of December 2003, when, having buried a deceased, I walked past a hole being dug by gravediggers, and I overheard them chatting that the son of the deceased, who will soon be buried, came by to ask them to dig a wider grave. The gravediggers did not understand why he asked for it, thinking that the son’s concern was to make sure that his mother is buried as beautifully as possible, and that frozen soil did not obstruct inserting the coffin beautifully. Unfortunately, as she went about the matters of the burial, his sister found the 45-year-old man at home, having killed himself. A wider grave proved to be necessary. The two were buried on the last day of 2003, together. Who can decide whether a person kills himself, or is killed by immaturity, egoism, failure to be independent, dependencies, fear of loneliness and responsibility, thinking that after the death of a close one nobody will need him anymore, because the most important bond is gone. And yet, that painful moment of bidding farewell to the most cherished ones would be easier to endure if we remembered God, who needs us all — the righteous and the mistaken. Instead of rejecting Life that his mother gave him, the son should have rather prayed for the soul of the mother — and lived on, to the joy of other people.\nWind and snow on the street near Kupiskis, Lithuania, on Feb. 27, 2018. (Hannes Jung)\nRimante sits in the room of her son, Mantukas, in Panevezys. Her son died by suicide two years ago. Rimante wrote: “When I stay at home alone, I make myself a coffee and walk into Mantukas’s room — this is where I find the best company. I can peacefully sip my coffee and talk to my son about everything, even the things I never dared to discuss while he was alive.” (Hannes Jung)\nThe audience watches Lithuanian rock star Andrius Mamontovas at Litexpo in Vilnius, Lithuania, on Feb. 27, 2016. Mamontovas wrote: “In 1992-1994 I worked for a radio program called Voices of the Night at M-1 radio. As the program’s host, I used to work there several times a week. The idea was simple — people would call my work phone and I would just put them on live. They could say whatever they wanted. Once a young guy called me and said that after talking to me live he was going to kill himself. The only thing I knew was that one must speak to a suicidal person as long as possible. This way the person may pass that critical limit when he is ready to harm himself. I talked to him for more than an hour. After that he suddenly hung up. I didn’t know how it all ended, but while talking to him live, I asked various things just to extend this conversation as long as possible. A few weeks later he called me and thanked me for our conversation. He said it had helped him. It was exactly that case when I clearly understood how powerful a simple conversation can be. Recently I got a message from him: ‘Do you remember how we talked on the phone 20 years ago? Well, I’m still alive.’ ” (Hannes Jung)\nThe Hill of Crosses, a site of pilgrimage near Siauliai, Lithuania, on Feb. 23, 2018. (Hannes Jung)\nVitalja, with her two daughters in Joniskis on Feb. 28, 2018. She wrote: “I tried to scare my husband by attempting to kill myself — he couldn’t care less. I only scared my children. I think you can’t change anything by suicide, you will only hurt and damage the ones you love, who are closest to you.” (Hannes Jung)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nWhat life is like in the coal-mining boomtowns of Appalachia\nHaunting landscapes taken from thousands of hacked surveillance cameras\nInside the U.S.’s ‘National Radio Quiet Zone’ where there’s no WiFi or cellphone service","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/07/06/i-photograph-life-not-death-because-death-cannot-be-seen/"}
