{"authors":["Thomas Colson"],"date_download":"2018-10-30 20:39:04","date_modify":"2018-10-30 20:39:04","date_publish":"2016-12-29 00:00:00","description":"Exponential improvements in new technologies are expected to radically transform social and economic life.","filename":"data/vaneerConsumption/IPPRAutomationcoulddestroy15millionUKjobsinnexttwodecades.json","image_url":"https://amp.businessinsider.com/images/562a62ffdd0895ab388b4588-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ippr-automation-robots-could-destroy-15-million-uk-jobs-in-next-two-decades-2016-12_1540931944.html","title":"IPPR: Automation could destroy 15 million UK jobs in next two decades","title_page":"    IPPR: Automation could destroy 15 million UK jobs in next two decades - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Employees check a manned biped walking robot \"METHOD-2\" during a demonstration in Gunpo, South Korea, December 27, 2016. Reuters / Kim Hong-Ji LONDON — Up to 15 million UK jobs are at \"high or medium risk\" of being replaced by automation in the next two decades, according to a new report.\nThe report, from centre-left policy group Institute for Public Policy Research (IPPR), says that the economy is close to hitting \"peak human\" — the point at which human labour is the most important factor of production.\nThe paper's author, Mathew Lawrence, says that exponential improvements in new technologies, such as machine learning, driverless cars, and artificial intelligence (AI) systems, will \"radically transform social and economic life,\" with low-paid jobs generally most at risk.\nHe estimates that 2 million jobs in retail will disappear by 2030, and 600,000 will go in manufacturing.\nLawrence says that a second machine age could create a \"Star Trek-like\" era of widespread abundance, but could alternatively \"radically concentrate economic power\" in a scenario more akin to the \"hierarchical machine world of the Matrix\" if the wrong type of institutions are created, and the wrong kind of politics are pursued.\nThe report forms part of a growing global consensus that advances in automation and robotics could destroy large numbers of jobs across a range of industries.\nObama's White House claimed in December that AI could drive up inequality, and wipe out the need for human labour in industries such as lorry-driving and manufacturing.\nThe World Economic Forum (WEF) predicted a \"Fourth Industrial Revolution\" in January this year, and said that automation would destroy 6 million jobs by 2020.\nLawrence argues that automating technologies risk entrenching a \"new form of economic feudalism,\" whereby \"those who own the robots will reap the rewards, the rest will struggle as human labour becomes less important in the production process.\"\nTo counter such an outcome, Lawrence says that automation must become \"politicised,\" with higher wage floors, an education system that promotes creativity and skills that complement machines, and a shorter working week to fairly share productivity gains, and potentially even a universal basic income to supplement labour market income.\nChanges to the labour market's make-up are already underway. Walmart, the US Department for Defence, and FoxConn, a key manufacturing partner for Apple and Google, and Amazon have all begun replacing parts of their labour force with automated processes.","url":"https://www.businessinsider.com/ippr-automation-robots-could-destroy-15-million-uk-jobs-in-next-two-decades-2016-12"}
