{"authors":["Euan Mclelland For Mailonline"],"date_download":"2018-10-23 02:02:17","date_modify":"2018-10-23 02:02:17","date_publish":"2016-01-11 13:35:17","description":"The pensioner can be seen falling to the ground after being struck unexpectedly as he tried to walk away from 40-year-old Shane Gull outside a newsagent in Ipswich. He was then kicked repeatedly.","filename":"data/vaneerConsumption/Ipswichpensionerrecallsmomentastrangerpunchedhimtothefloor.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300A942D00000578-0-image-a-55_1452518968036.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393926_Shocking-footage-shows-thug-punching-76-year-old-defenceless-victim-floor-kicking-18-times-unprovoked-attack_1540260137.html","title":"Ipswich pensioner recalls moment a stranger punched him to the floor","title_page":"Ipswich pensioner recalls moment a stranger punched him to the floor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A pensioner was subjected to the 'worst assault police had ever seen' when a total stranger punched him to the floor and then kicked him 18 times in an unprovoked attack.\nLout Shane Gull carried out a brutal beating on his 76-year-old victim as the man was reading a newspaper in Ipswich.\nThe savage assault was captured on CCTV and Gull was later jailed for seven years for inflicting grievous bodily harm.\nThe pensioner can be seen falling to the ground after being struck unexpectedly as he tried to walk away from attacker Shane Gull outside a newsagents in Ipswich. Once he is down, Gull then kicks him on the head and body 18 times before passers-by step in\nThe pensioner, who wished to remain nameless, said the experience was now 'water under the bridge' and he is just glad his attacker is behind bars.\nHe said: 'It wasn't very good at the time.\n'The next day I was standing in the same place reading my newspaper just like any other day - I was just a bit sore.\n'I had a few cuts and a glued eyebrow but life goes on - if it hadn't have been me he would have done it to someone else who was stood there quite innocently.\n'I didn't know him from Adam. He just came over and called me a 'peadophile' and then went straight into what is seen in the footage.\n'He hit me in the face first and my glasses flew off - they were very expensive glasses - but just a screw was needed to be put back in place.\n'It was one of those things - it was serious but if it was something that really affected me I wouldn't go out.\n'When I went to bed that night I had my usual night of sleep but just had a very sore hand which took eight weeks to go down.'\nIn the CCTV footage the pensioner can be seen falling to the ground after being struck unexpectedly as he tried to walk away from the 40-year-old outside a newsagent.\nLosing his balance, the man tumbles into another unit's glass exterior, where he then desperately tries to defend himself when his attacker aims repeated blows at his head and body.\nMr Gull was yesterday jailed for seven years with an an extended license period of five years after pleading guilty to the savage Suffolk assault\nThe vicious assault only ends when security staff from the newsagent step in.\nThe pensioner said said: 'It's a good job I faced forward because if those 16 kicks had gone into my back I would assume I would have had serious kidney and liver damage.\n'But fortunately I was the right way around because they were hard kicks.\n'According to the security man he thought I might have passed out for a short while because when I said 'somebody help me' he said it sounded rather distant.\n'Everybody was so kind afterwards from the security guard to the paramedics - they couldn't have done more for me.\n'The cuts cleared up pretty quickly but it didn't incapacitate me.\n'I thought it might have broken some bones but I was just very, very badly bruised - not so much on the outside but on the inside.'\nThe gentlemen was taken to hospital and then interviewed by Suffolk police the following day when his injuries were photographed.\nGull was yesterday jailed for seven years with an an extended licence period of five years after pleading guilty to the Suffolk attack.\nHe admitted inflicting grievous bodily harm with intent after the incident outside a newsagents at 7.30am on March 19 last year.\nAfter assaulting the man, security staff assisted by detaining the offender until the police arrived.\nHis victim sustained a laceration to his head, swelling and bruising to his face and significantly bruised hands.\nDetective Chief Inspector Barry Byford from Suffolk Police said: 'This is an extremely disturbing unprovoked attack where an elderly man was viciously assaulted in a public place.\n'The victim then tried to defend himself by shielding his face, whilst lying on the floor and was further subject to injury.\nBrutal Gull rained down blows on the helpless pensioner. He then lifted up his bag of shopping and threw it away\nThe attack only ends when security staff from the nearby newsagent confront him. They held Gull until police arrived and were able to arrest him\n'During interview, the offender was shown photographs of the victim's injuries, showing no remorse whatsoever and was completely unrepentant of his actions.\n'Not only did he harm the victim but he also caused distress to many children who were around at the nearby bus station on their way to school.\n'Violent offences like this will not be tolerated and we will make every effort to put offenders like Shane Gull before the courts.'\nSpeaking about Gull being put behind bars, the elderly man said: 'It's all water under the bridge.\n'The police said it was the worse assault they had ever seen.\n'I was actually surprised that he got as long as he did - I thought he might get three or four years but no I'm very pleased and surprised by what he has got.","url":"https://www.dailymail.co.uk/news/article-3393926/Shocking-footage-shows-thug-punching-76-year-old-defenceless-victim-floor-kicking-18-times-unprovoked-attack.html"}
