{"authors":["Associated Press"],"date_download":"2018-10-23 00:34:33","date_modify":"2018-10-23 00:34:33","date_publish":"2017-03-16 10:04:15","description":"COLOMBO, Sri Lanka (AP) - Tamim Iqbal scored 82 and shared a century partnership with Shabbir Rahman to take Bangladesh to the brink of a historic win in...","filename":"data/vaneerConsumption/IqbaltakesBangladeshclosetohistoricwinvsSriLanka.json","image_url":"https://i.dailymail.co.uk/1/2017/03/19/10/wire-244299-1489917863-970_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319532_Bangladesh-95-1-tea-day-2-vs-Sri-Lanka_1540254873.html","title":"Iqbal takes Bangladesh close to historic win vs. Sri Lanka","title_page":"Iqbal takes Bangladesh close to historic win vs. Sri Lanka | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"COLOMBO, Sri Lanka (AP) - Tamim Iqbal scored 82 and shared a century partnership with Shabbir Rahman to take Bangladesh to the brink of a historic win in their 100th test match, also their first ever victory against Sri Lanka.\nNeeding 191 to win, Bangladesh reached tea on the final day Sunday at 156 for four with a whole session to play.\nIqbal and Rahman stalled a potential collapse with a 109 partnership for the third wicket after Sri Lankan captain Rangan Herath took two wickets in successive deliveries to leave the tourists struggling on 22 for two.\nBangladeshi bowler Shakib Al Hasan unsuccessfully appeals for the wicket of Sri Lanka's Dilruwan Perera on day four of their second test cricket match in Colombo, Sri Lanka, Saturday, March 18, 2017. (AP Photo/Eranga Jayawardena)\nIqbal faced 124 deliveries for his 82 runs that included seven boundaries and a six. He was brilliantly caught by Dinesh Chandimal in the outfield off offspinner Dilruwan Perera. Rahman made 42 before being trapped lbw by Perera.\nShakib Al Hasan was batting on 12 with captain Mushfiqur Rahim on six.\nEarlier in the morning session Sri Lanka resumed their second innings on 268-8, a lead of 139 runs, and added another 51 valuable runs in the morning session to set Bangladesh a target of 191, thanks mostly to Dilruwan Perera and Suranga Lakmal, who put on 80 runs for the ninth wicket.\nPerera patiently completed his half-century but was then run out for 50 at the non-striker's end following a mix-up on a misfield.\nLakmal added one more to the total before he fell for 42 in the next over, bringing an end to the innings.\nBangladesh made a bright start to their run-chase, cruising along at three runs an over, before Herath struck twice in a row on his 39th birthday.\nThe veteran left-arm spinner had opener Saumya Sarkar caught at long on by Upul Tharaga for 10 with a cleverly disguised shorter ball, then he dismissed Imrul Kayes for a golden duck when he found a thick edge and Asela Gunaratne held a sharp chance at slip, leaving Iqbal and Rahman to rescue the innings.\nBangladeshi captain Mushfiqur Rahim, center, and Sabbir Rahman unsuccessfully appeal for the wicket of Sri Lanka's Suranga Lakmal, right, on day four of their second test cricket match in Colombo, Sri Lanka, Saturday, March 18, 2017. (AP Photo/Eranga Jayawardena)\nBangladeshi batsman Shakib Al Hasan plays a shot as Sri Lanka's Niroshan Dickwella watches on day three of their second test cricket match in Colombo, Sri Lanka, Friday, March 17, 2017. (AP Photo/Eranga Jayawardena)\nBangladeshi batsman Mushfiqur Rahim plays a shot as Sri Lanka's Niroshan Dickwella watches on day three of their second test cricket match in Colombo, Sri Lanka, Friday, March 17, 2017. (AP Photo/Eranga Jayawardena)\nSri Lanka's Suranga Lakmal delivers a ball against Bangladesh on day three of their second test cricket match in Colombo, Sri Lanka, Friday, March 17, 2017. (AP Photo/Eranga Jayawardena)","url":"https://www.dailymail.co.uk/wires/ap/article-4319532/Bangladesh-95-1-tea-day-2-vs-Sri-Lanka.html"}
