{"authors":[],"date_download":"2018-10-30 18:37:59","date_modify":"2018-10-30 18:37:59","date_publish":"2016-04-19 09:08:06","description":"Iran has so far seen only around $3 billion in previously frozen assets returned since it struck a nuclear deal with world powers.","filename":"data/vaneerConsumption/IranHasSeenOnly3bnReturnedSinceNukeDealKerry.json","image_url":"https://media.breitbart.com/media/2016/04/john-kerry.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_04_19__1540924679.html","title":"Iran Has Seen Only $3 bn Returned Since Nuke Deal: Kerry","title_page":"Iran Has Seen Only $3 bn Returned Since Nuke Deal: Kerry","title_rss":"NULL","source_domain":"breitbart.com","text":"Iran has so far seen only around $3 billion in previously frozen assets returned since it struck a nuclear deal with world powers, US Secretary of State John Kerry said.\nThe extent to which Tehran stands to gain from the agreement to place its nuclear program under tight controls has been a matter of fierce debate since Iran signed the accord last year.\nIn the United States, Republican opponents of the deal have alleged that it will allow Iran to get its hands on more than $100 billion with which it could fund “terrorism” against American allies.\nMeanwhile, in Iran, officials have complained that the country has yet to see much benefit from the end of nuclear sanctions, as banks and private companies have been slow to renew ties with the former pariah.\nThe US administration has been trying to find its way between the competing claims, insisting it has met its side of the bargain in lifting sanctions while vowing it will not tolerate Iranian backsliding.\nAnd so Kerry, who is to meet with his Iranian counterpart Foreign Minister Mohammad Javad Zarif in New York on Tuesday, hit back against critics of the deal, insisting their figures are wrong.\n“Remember the debate over how much money Iran was going to get?” he said to delegates at a dinner hosted by the progressive pro-Israel group J Street.\n“Sometimes you hear some of the presidential candidates putting out a mistaken figure of $155 billion. I never thought it would be that.\n“Others thought it would be about $100 billion, because there was supposedly about $100 billion that was frozen and so forth,” he continued.\n“We calculated it to be about $55 billion, when you really take a hard look at the economy and what is happening,” he said, giving the usual State Department estimate.\n“Guess what folks. You know how much they have received to date? As I stand here tonight, about $3 billion.”\nThe United States has not had diplomatic relations with Tehran since April 1980, but Kerry got to know Zarif while negotiating the nuclear deal, and the two speak fairly regularly.\nTuesday’s meeting in New York will be the pair’s first face-to-face encounter since January 16, when they met in Vienna to formally implement the accord.\nIranian officials have since begun to complain the United States has not lived up to its side of the agreement, as sanctions aimed at its missile program and financing of militias abroad have continued.\nBut Washington has also pointed the finger, warning that it retains the right to impose new sanctions if Iran’s ballistic missile tests breach separate United Nations resolutions not covered by the nuclear deal.","url":"https://www.breitbart.com/middle-east/2016/04/19/iran-seen-3-bn-returned-since-nuke-deal-kerry/"}
