{"authors":["Associated Press"],"date_download":"2018-10-23 04:10:00","date_modify":"2018-10-23 04:10:00","date_publish":"2016-01-29 19:49:32","description":"TEHRAN, Iran (AP) — Iran flew a surveillance drone over a U.S. aircraft carrier and published video of the encounter Friday, the latest in a series of edgy n...","filename":"data/vaneerConsumption/IranfliesunarmedmilitarydroneoverUSaircraftcarrier.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:4fd95402fde146079290278bfae506b7-3bmscybNe842cce83474b595d4b0-567_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423344_Iran-flies-unarmed-military-drone-US-aircraft-carrier_1540267800.html","title":"Iran flies unarmed military drone over US aircraft carrier","title_page":"Iran flies unarmed military drone over US aircraft carrier | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Iran flies unarmed military drone over US aircraft carrier\nTEHRAN, Iran (AP) — Iran flew a surveillance drone over a U.S. aircraft carrier and published video of the encounter Friday, the latest in a series of edgy naval incidents between the two countries in the Persian Gulf after the recent nuclear deal.\nWhile the U.S. Navy stressed it knew the drone was unarmed and the flyover didn't interrupt U.S. operations in the war against the Islamic State group, the incident underlined the continued tension over control of waterways crucial to global oil supplies. It follows a rocket test last month by the Islamic Republic near coalition warships and commercial traffic, as well as Iran's brief capture of American sailors who strayed into its territorial waters.\nIranian state television and the semi-official Fars news agency, which has close ties to the Revolutionary Guard, published identical images Friday both said came from the drone. The footage, which The Associated Press could not independently verify, purported to show the drone being launched and then hovering over an unidentified aircraft carrier, a targeting bracket briefly passing over a jet parked on the deck below.\nThis still image made from video broadcast on Iranian State television, friday, Jan. 29, 2016 shows what purports to be drone footage of a U.S. aircraft carrier. Iran flew a surveillance drone over a U.S. aircraft carrier and took \"precise\" photographs of it as part of an ongoing naval drill, state media reported Friday. The U.S. Navy said an unarmed Iranian drone flew near a French and American carrier earlier this month, but couldn't confirm it was the same incident.(Iranian State Television via AP) IRAN OUT\nThe Iranian reports suggested the footage was from Friday. However, Cmdr. Kevin Stephens, a spokesman for the U.S. Navy's 5th Fleet based in Bahrain, said an unarmed Iranian drone flew near the French aircraft carrier Charles de Gaulle and \"directly over\" the USS Harry S. Truman on Jan. 12 as the vessels were in international waters in the Persian Gulf.\nHe said the Navy launched a helicopter that determined the drone wasn't armed and \"posed no danger to the ship\" as the carrier wasn't conducting flight operations at the time. His comments implied that had there been active takeoffs and landings of U.S. aircraft, the situation might have changed.\nStephens called the drone's flight \"abnormal and unprofessional.\" He added that the U.S. Navy was \"not in a position to verify the authenticity of the video as there are countless examples of similar footage to be found on the Internet.\"\nThe nuclear-powered USS Harry S. Truman, based out of Norfolk, Virginia, is in the Persian Gulf region launching airstrikes and supporting operations against the Islamic State group in Iraq and Syria.\nAdm. Habibollah Sayyari, the commander of Iran's navy, called the drone overflight \"a sign of bravery.\"\nIt \"allowed our men to go so close to the warship and shoot such a beautiful and accurate footage of the combat units of the foreign forces,\" he told state television.\nState television and the state-run IRNA news agency said an Iranian light submarine also participated in the surveillance operation. When asked about the presence of a submarine, Stephens said: \"Iran has several submarines ... for its current exercise,\" but declined to discuss specifics.\nIn Washington, U.S. Navy spokesman Cmdr. William Marks stressed America remains ready to use force if necessary.\n\"We are confident in our force's ability to respond appropriately as the situation dictates and will defend ourselves should that prove necessary,\" he said.\nIran's navy began a naval drill this week over a 3-million-square-kilometer (1.16-million-square-mile) area including parts of the Strait of Hormuz, the Gulf of Oman and the Indian Ocean. Iran said Wednesday its navy warned a U.S. warship to leave an area of the naval drill. The U.S. Navy later denied its operations were affected.\nIran struck a nuclear deal with world powers, including the U.S., last year to limit its atomic program in exchange for the lifting of crippling economic sanctions. The sanctions ended this month and many average Iranians continue to wait to feel their effect.\nMeanwhile, in recent months, Iran has shown footage of underground missile bases on state television and conducted ballistic missile tests criticized by the U.S.\nIran has more than 2,000 kilometers (1,240 miles) of shoreline facing the Persian Gulf and the Sea of Oman. Control of that territory, including the Strait of Hormuz, through which nearly a third of all oil traded by sea passes, has remained a priority for Iran's military and it conducts regular drills in the region.\nThe U.S. has criticized some of those maneuvers, including what it called a \"highly provocative\" Iranian rocket test in December near U.S. warships and commercial traffic passing through the strait. Iran denied the test was provocative. The U.S. later released footage showing the rocket fire.\nEarlier this month, Iranian forces captured 10 U.S. Navy sailors who entered Iranian territorial waters near Farsi Island, an outpost in the middle of the Gulf. The sailors were released in less than a day, though Iranian state media aired footage of the sailors' capture, angering U.S. politicians.\nPast confrontations have been far worse.\nIn April 1988, the U.S. attacked two Iranian oil rigs and sank or damaged six Iranian vessels, including two naval frigates after the near-sinking of the missile frigate USS Samuel B. Roberts by an Iranian mine, laid amid the Islamic Republic's bloody 1980s war with Iraq.\nA few months later, in July 1988, the USS Vincennes in the strait mistook an Iran Air flight heading to Dubai for an attacking fighter jet, shooting down the plane and killing all 290 passengers and crew.\nIn this latest incident, however, Iran likely wanted to showcase its locally made drones, as well as appease hard-liners suspicious of the nuclear deal, said Joshua Shifrinson, a professor at the Bush School of Government and Public Service at Texas A&M University.\n\"They live in a competitive world and the U.S. might change its mind on the nuclear deal, especially if a different administration comes in,\" Shifrinson said. \"Iran also has other opponents in and around the Gulf, all of which means Iran wants to remind people that just because they cooperated does not mean they're turning belly up and are going to surrender everything.\"\n___\nGambrell reported from Dubai, United Arab Emirates. Associated Press writer Lolita C. Baldor in Washington contributed to this report.\n___\nFollow Jon Gambrell on Twitter: www.twitter.com/jongambrellap .","url":"https://www.dailymail.co.uk/wires/ap/article-3423344/Iran-flies-unarmed-military-drone-US-aircraft-carrier.html"}
