{"authors":["John Hayward"],"date_download":"2018-10-30 20:48:58","date_modify":"2018-10-30 20:48:58","date_publish":"2016-12-14 03:11:37","description":"President Hassan Rouhani declared that Iran's nuclear scientists have been ordered to draw up plans for a nuclear-powered surface fleet.","filename":"data/vaneerConsumption/IranOrdersScientiststoDevelopNuclearPoweredBoats.json","image_url":"https://media.breitbart.com/media/2016/12/iran-warships-ap-photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_12_13__1540932538.html","title":"Iran Orders Scientists to Develop Nuclear-Powered Boats","title_page":"Iran Orders Scientists to Develop Nuclear-Powered Boats","title_rss":"NULL","source_domain":"breitbart.com","text":"Enraged by the 10-year extension of America’s Iran Sanctions Act, which was recently voted through Congress and will likely be signed into law by President Obama, “moderate” Iranian President Hassan Rouhani declared that Iranian nuclear scientists have been ordered to draw up plans for a nuclear-powered surface fleet.\nThe Associated Press reports that Rouhani gave his Atomic Energy Organization in Iran just three months to devise these plans in his public announcement.\nHe said the nuclear navy initiative was “warranted in light of the United States’ foot-dragging in fulfilling its commitments under the multilateral nuclear deal… and the recent ratification of anti-Iran legislation in the U.S. Congress.”\nRouhani also wrote a letter instructing Foreign Minister Mohammad Javad Zarif to “follow up on the U.S. violations” of the nuclear deal. Zarif has already written two letters complaining about such alleged violations to the European Union.\nReuters notes that according to nuclear experts, Rouhani’s plans for nuclear ships would “probably require Iran to enrich uranium to a fissile purity above the maximum level set in the nuclear deal to allay fears of Tehran building an atomic bomb.”\nIn fact, although the Obama White House seems intent on pretending Iran can build these nuclear-driven propeller systems without trashing the deal, scientists told Reuters Iran is currently restricted from enriching uranium past 3.67 percent purity, and no technology in the world has yet been able to devise a propulsion system that would require uranium of less than 20 percent purity.\nIt is also possible Iran will resume work on a nuclear submarine, a project that seems to have stalled out since it was first announced in 2012.\nThe BBC’s analysts expressed doubt that the Iranian government’s big push for nuclear-powered maritime transportation would progress much beyond the rhetorical stage, describing the plan as “an extremely costly effort without strategic gain.”","url":"https://www.breitbart.com/national-security/2016/12/13/iran-scientists-nuclear-powered-boats/"}
