{"authors":[],"date_download":"2018-10-23 00:49:21","date_modify":"2018-10-23 00:49:21","date_publish":"2016-01-11 10:46:28","description":"Iran's Foreign Minister Mohammad Javad Zarif has accused Saudi Arabia of supporting extremists and \"promoting sectarian hatred\" and urged Riyadh to instead e...","filename":"data/vaneerConsumption/IransZarifsaysSaudimustchooseextremismorengagement.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z822-48qEJGFphM8d437f0aaf923a287f-763_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393688_Irans-Zarif-says-Saudi-choose-extremism-engagement_1540255761.html","title":"Iran's Zarif says Saudi must choose: extremism or engagement","title_page":"Iran's Zarif says Saudi must choose: extremism or engagement | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Iran's Zarif says Saudi must choose: extremism or engagement\nIran's Foreign Minister Mohammad Javad Zarif has accused Saudi Arabia of supporting extremists and \"promoting sectarian hatred\" and urged Riyadh to instead engage in promoting regional stability.\nWriting in The New York Times, Zarif said Saudi Arabia had devoted itself to trying to stop Iran's nuclear deal with world powers and blocked attempts at dialogue in the Middle East.\n\"Some in Riyadh not only continue to impede normalisation but are determined to drag the entire region into confrontation,\" Zarif wrote, arguing that the Sunni-ruled kingdom was \"driven by fear that its contrived Iranophobia was crumbling\".\nAn Iranian woman holds a portrait of Shiite Muslim cleric Nimr al-Nimr during a demonstration against his execution by Saudi authorities, on January 3, 2016 outside the Saudi embassy in Tehran ©Atta Kenare (AFP/File)\n\"Saudi Arabia seems to fear that the removal of the smoke screen of the nuclear issue will expose the real global threat: its active sponsorship of violent extremism.\"\nZarif's opinion piece in the US newspaper came a week after Riyadh severed diplomatic ties with Iran in a row over the execution of a Shiite cleric. The execution triggered protests and an arson attack at the Saudi Arabian embassy in Tehran.\nOther Arab countries followed their Sunni ally in cutting or reducing diplomatic relations with Shiite-dominated Iran.\nZarif said the execution of cleric Nimr al-Nimr had shown that Saudi Arabia's \"barbarism is clear\" and said Riyadh was promoting the kind of extremist views taken up by groups like the Islamic State organisation.\n\"At home, state executioners sever heads with swords, as in the recent execution of 47 prisoners in one day,\" Zarif wrote, describing Nimr as a respected religious scholar devoted to peace.\n\"Abroad, masked men sever heads with knives. Let us not forget that the perpetrators of many acts of terror... as well as nearly all members of extremist groups like Al-Qaeda and the Nusra Front, have been either Saudi nationals or brainwashed by petrodollar-financed demagogues who have promoted anti-Islamic messages of hatred and sectarianism for decades.\"\nZarif noted that Iran immediately condemned the violence at the Saudi embassy on January 2 and has since taken action against those who failed to protect the compound, stating a probe was under way.\nHe also said Iran showed restraint after events such as last year's hajj in Saudi Arabia, where 464 Iranians were among more than 2,000 pilgrims killed in a stampede, and had not cut or reduced its diplomatic relations with the kingdom.\n\"We have until now responded with restraint; but unilateral prudence is not sustainable,\" Zarif wrote, alluding to broader efforts at cooperation by President Hassan Rouhani's government, a nod to the nuclear deal likely to be implemented this month.\n\"This has fallen on deaf ears in Saudi Arabia,\" Zarif said.\n\"The Saudi leadership must now make a choice: They can continue supporting extremists and promoting sectarian hatred; or they can opt to play a constructive role in promoting regional stability.\"","url":"https://www.dailymail.co.uk/wires/afp/article-3393688/Irans-Zarif-says-Saudi-choose-extremism-engagement.html"}
