{"authors":["John Hayward"],"date_download":"2018-10-30 18:37:38","date_modify":"2018-10-30 18:37:38","date_publish":"2017-01-31 02:36:56","description":"Iran does not have direct diplomatic relations with the U.S., so it fell to Swiss Ambassador to Iran Giulio Haas to hear Tehran's complaints.","filename":"data/vaneerConsumption/IranSummonsSwissAmbassadortoProtestTrumpExecutiveOrder.json","image_url":"https://media.breitbart.com/media/2017/01/Iran-burn-us-flags-former-US-embassy-Tehran-2013-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_01_30__1540924658.html","title":"Iran Summons Swiss Ambassador to Protest Trump Executive Order","title_page":"Iran Summons Swiss Ambassador to Protest Trump Executive Order","title_rss":"NULL","source_domain":"breitbart.com","text":"Iran does not have direct diplomatic relations with the United States, so it fell to Swiss Ambassador to Iran Giulio Haas to hear Tehran’s complaints about President Donald Trump’s immigration executive order. Entry to the United States is halted for Iranians for 90 days under the order.\nPressTV reports that Iran’s Foreign Ministry summoned Haas on Sunday and presented him with an official letter of protest.\nIranian Director General for the Americas Mohammad Keshavarz-Zadeh complained that Trump’s order was “fictitious, discriminatory and unacceptable,” and “runs counter to human rights conventions and a legal and consular treaty signed between Tehran and Washington in August 15, 1955,” according to a Foreign Ministry spokesman.\nKeshavarz-Zadeh also claimed Iranians have “always been law-abiding citizens wherever they have settled,” “have been a victim of US-backed terrorist groups for decades,” and “have not been involved in any operation by extremist and terrorist groups.” That wouldn’t win much sympathy for the Islamic Republic if American critics of Trump’s action were actually paying attention to what Iran says and does, rather than being wholly focused on the new U.S. administration.\nSwiss Foreign Minister Didier Burkhalter denounced the Trump order on Sunday.\n“We are always opposed to discrimination of individuals due to their religion or country of origin. In this sense, the executive order taken by the U.S. clearly goes in the wrong direction,” Burkhalter said, adding that Swiss authorities were in contact with their American counterparts to “get as clear information as possible on modalities planned and reserve the right to any measures that defend the rights of Swiss citizens concerned.”","url":"https://www.breitbart.com/national-security/2017/01/30/iran-summons-swiss-ambassador-complain-trump-executive-order/"}
