{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:45:46","date_modify":"2018-10-30 19:45:46","date_publish":"2015-05-01 20:14:44","description":"Great Britain has revealed to a United Nations sanctions committee that Iran is attempting to purchase nuclear material through two “blacklisted” companies in direct violation of international sanctions, according to a Reuters report.","filename":"data/vaneerConsumption/IranAttemptingtoPurchaseNuclearTechDespiteSanctions.json","image_url":"https://media.breitbart.com/media/2015/05/Iran-President-Rouhani-visits-nuclear-power-plant-Mohammad-BernoAP.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_01__1540928746.html","title":"Iran Attempting to Purchase Nuclear Tech Despite Sanctions","title_page":"Iran Attempting to Purchase Nuclear Tech Despite Sanctions","title_rss":"NULL","source_domain":"breitbart.com","text":"Great Britain has revealed to a United Nations sanctions committee that Iran is attempting to purchase nuclear material through two “blacklisted” companies in direct violation of international sanctions, according to a Reuters report.\nThe news of Iran’s alleged campaign to sabotage the sanctions may affect the overall talks between Tehran and the P5+1 world powers (U.K., U.S., France, Germany, China, Russia). The parties have until a self-imposed June 30 deadline to reach an agreement concerning Iran’s nuclear weapons program.\nThe Reuters report quoted the UN panel’s assessment of Iran’s violation: “The UK government informed the Panel on 20 April 2015 that it ‘is aware of an active Iranian nuclear procurement network which has been associated with Iran’s Centrifuge Technology Company (TESA) and Kalay Electric Company (KEC),” said the U.N. Panel of Experts.\nAFP corroborated the report’s findings, stating in their report that if the claims were true, Iran would be in direct violation of UN sanctions.\nThe UN panel reportedly mentioned in its findings that Iran had previously found a way to conduct its business without demonstrating overt violations of UN sanctions.\n“It might be linked, inter alia, to a decrease in the Islamic Republic of Iran’s prohibited activities and restraint on the part of member-states so as not to affect the negotiations process,” the report added.\nState Department spokesperson Marie Harf has weighed in on the new revelations. Harf admitted that Iran has continued to seek ways to undermine the sanctions, but “played down the report’s significance,” Reuters reported.","url":"https://www.breitbart.com/national-security/2015/05/01/report-iran-attempting-to-purchase-nuclear-technology-in-violation-of-sanctions/"}
