{"authors":["Joseph M. Humire"],"date_download":"2018-10-30 19:29:19","date_modify":"2018-10-30 19:29:19","date_publish":"2015-01-23 16:10:46","description":"President Obama was clear in his message to Congress during this week's State of the Union: \"I will veto any new sanctions bill that threatens to undo this progress .\" While the room applauded, the President's praise echoed throughout Tehran, as the Ayatollahs realize they are inching closer to achieving international legitimacy. One major hurdle, however, stands in their way. |","filename":"data/vaneerConsumption/IransInvisibleShadowinaProsecutorsDeath.json","image_url":"https://media.breitbart.com/media/2015/01/Alberto-Nisman-justicia-signs-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_23__1540927759.html","title":"Iran’s Invisible Shadow in a Prosecutor’s Death","title_page":"Iran’s Invisible Shadow in a Prosecutor’s Death | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"President Obama was clear in his message to Congress during this week’s State of the Union: “I will veto any new sanctions bill that threatens to undo this progress [with Iran].” While the room applauded, the President’s praise echoed throughout Tehran, as the Ayatollahs realize they are inching closer to achieving international legitimacy. One major hurdle, however, stands in their way.\nIran is still considered one of the world’s leading state-sponsors of terror. One of their most atrocious acts took place 20 years ago in an attack on a Jewish cultural center in Argentina, known as AMIA, killing 85 and injuring hundreds more. The bombing in Buenos Aires is the largest Islamist terrorist attack in the Western Hemisphere prior to September 11th.\nIn 2013, shortly before Iran began its public negotiations with the West over its controversial nuclear program, it revealed a parallel public diplomacy campaign in Argentina to white wash its role in the AMIA attack. Be it with some help from the Argentine president Cristina Fernández de Kirchner.\nIn a recent 289-page report, the general prosecutor of the AMIA case, Alberto Nisman, formally charged the Argentine president with criminal conspiracy to cover up the truth and tragedy in Buenos Aires regarding the AMIA case in exchange for oil and other economic and military support from the Islamic Republic. Nisman was preparing to present his evidence before the Argentine congress this past Monday, but was found dead the day prior in his apartment in Buenos Aires.\nThe cause of death is still being confirmed, and evidence is being examined, but the Argentine government was quick to speculate that this was a suicide. An argument President Fernández de Kirchner recently backed down from because a “suicide” does not meet the facts or public opinion. Crime scene evidence reveals that there was no note, nor any gun powder residue on Nisman’s hand — even the murder weapon, a .22 caliber pistol, was not his. This leaves many Argentines crying conspiracy and pointing at their president, who has become inexplicably absent from the public domain (outside of an occasional Facebook post or Tweet). While President Fernández de Kirchner clearly has a motive, the main beneficiary of Nisman’s death is Iran.\nFor years, five of Iran’s high-ranking military officers, clerics and politicians have been forbidden to travel because an Interpol red notice requires they appear before an Argentine judiciary for their role in the AMIA attack. In a 2011 incident, the former Iranian Defense Minister, Gen.Ahmad Vahidi, made a hasty exit from Bolivia to escape extradition once the Argentine authorities notified Interpol that the Iranian general had illegally left his homeland. In another incident, a trip to South Korea was cancelled for fear of extradition. These Interpol red notices are an embarrassment for Iran, directly affecting some powerful individuals, including two recent 2013 presidential candidates of the Islamic Republic.\nMuch like its secret negotiations with the White House predating the Geneva interim agreement, Iran also created back-door channels to Argentina in an effort to sway the Fernández de Kirchner regime into their geopolitical orbit.\nFortunately for the Ayatollahs, Argentina’s dire economic situation, particularly its annual $7 billion energy deficit, nudged them in that direction. In what was described as an oil-for-grain scheme, the Iranian government decided to curry favor for Argentina only if the Fernández de Kirchner regime could remove the Interpol red notices on their accused. According to Nisman, this was Iran’s main sticking point in signing a controversial agreement with the Fernández de Kirchner government to reinvestigate the AMIA case, which ultimately led to the prosecutor’s death.\nNisman knew that to get Iran to face justice, he would have to force their hand. Herein lies the importance of his most recent work. In sifting through the voluminous pages of Nisman’s formal accusation against Fernández de Kirchner and her cronies, one comes to realize that a strategic shift is taking place on the AMIA case. What had historically been an Argentine judicial case prosecuted under the country’s anti-terrorism laws was now morphing into a criminal case potentially taken to an international court.\nIn reading Nisman’s report, one realizes that he not so subtly and repeatedly suggests the Kirchner-Iran connection is a “criminal plot” against Argentine justice. Moreover, he tips his hand in his last televised appearance on the program “A Dos Voces” (Two Voices) stating: “there exists a [new] method to extradite the Iranians, so that they can face justice in the Republic of Argentina” and goes on to say “but an international organization will have to intervene.” The International Criminal Court in Switzerland could be such an organization, where Iran has signed but not ratified the Rome Statute.\nMore importantly, however, Nisman seems to have had an ace up his sleeve to further indict Iran on the AMIA case. Knowing its history of political assassinations and the likelihood that they would go to great lengths to prevent their accused from standing before a criminal court, the Islamic Republic should be a prime suspect behind the Argentine prosecutor’s suspicious death.\nAs Iran tries cleaning up its international image and alleviating economic pressure from international sanctions, Nisman was about to cause them a significant setback potentially costing the regime billions of dollars. President Obama ignored this during his State of the Union speech. For those working to stop the U.S. misguided rapprochement with Iran — the late, courageous Argentine prosecutor, Alberto Nisman, may have shown us a way.\nJoseph M. Humire is the executive director of the Center for a Secure Free Society (SFS), a DC-based, global think tank. And the co-editor of “Iran’s Strategic Penetration of Latin America” published by Lexington Books.","url":"https://www.breitbart.com/national-security/2015/01/23/irans-invisible-shadow-in-a-prosecutors-death/"}
