{"authors":["Breitbart News"],"date_download":"2018-10-30 18:40:44","date_modify":"2018-10-30 18:40:44","date_publish":"2016-05-22 04:25:30","description":"Women in Iran are cutting their hair short and dressing as men in a bid to bypass state 'morality' police who rigorously enforce penalties for not wearing a hijab. | National Security","filename":"data/vaneerConsumption/IranianWomenCutHairoffDressasMentoAvoidMoralitypoliceTheIndependent.json","image_url":"https://media.breitbart.com/media/2016/01/Women-Protest-in-Hijab-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_05_21__1540924844.html","title":"Iranian Women Cut Hair off, Dress as Men to Avoid Moralitypolice–The Independent","title_page":"Iranian Women Cut Hair off, Dress as Men to Avoid Moralitypolice--The Independent | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"From the Independent Heather Saul writes:\nWomen in Iran are cutting their hair short and dressing as men in a bid to bypass state ‘morality’ police who rigorously enforce penalties for not wearing a hijab.\nA number of women have shared photos of themselves in public with their hair uncovered on Instagram and other social media.\nThe women have cut their hair short in some images and in others are dressed in clothes more typically associated with men.\nThe hijab is becoming an increasingly contentious issue in Iran as women step up their campaign against it and other oppressive, gendered laws. In recent months, women have been filmed walking through Tehran with their hair uncovered and activists have urged Western tourists to violate laws by refusing to wear the hijab during their visits to the Islamic republic.\nBut the response from authorities to this resistance has been severe.\nA politician was disqualified from Iranian parliament after photos purporting to show her in public without a headscarf emerged, despite her insistence they were fake.","url":"https://www.breitbart.com/national-security/2016/05/21/iranian-women-cut-hair-off-dress-men-avoid-moralitypolice-independent/"}
