{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 18:07:17","date_modify":"2018-10-30 18:07:17","date_publish":"2016-11-01 11:13:33","description":"Iran sentenced Golamreza \"Robin\" Shahini, a dual U.S.-Iranian citizen, to 18 years in prison for \"collaborating with a foreign government.\"","filename":"data/vaneerConsumption/IranGivesSanDiegoMan18YearPrisonSentenceforSpying.json","image_url":"https://media.breitbart.com/media/2016/07/Screen-Shot-2016-07-22-at-4.20.45-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_11_01__1540922837.html","title":"Iran Gives San Diego Man 18-Year Prison Sentence for 'Spying'","title_page":"Iran Gives San Diego Man 18-Year Prison Sentence for 'Spying'","title_rss":"NULL","source_domain":"breitbart.com","text":"An Iranian court has sentenced Golamreza “Robin” Shahini, a dual American-Iranian citizen from San Diego, to 18 years in prison for allegedly “collaborating with a foreign government” and for Facebook posts.\nObservers suggest the Iranian regime’s verdict is an attempt to use detained foreign nationals as bargaining chips for more ransom payments.\nAccording to the Associated Press, Shaini, 46, said “Whatever information they had is all the pictures I posted in Facebook, in my web blog, and they use all those (as) evidence to accuse me,” in a phone interview with Vice News during a phone call from prison.\nHe added that he “just laughed” when he heard of his sentence, which is reportedly the harshest one yet for foreign nationals detained by the Iranian regime.\nIran does not recognize dual citizenship and treats Iranian-Americans like Iranians, subject to Iranian Islamic laws.\nShahini, who first drew the regime’s attention due to his participation in and support for Iran’s 2009 Green Revolution, said he denied being involved in any sort of spying.\n“I do a hunger strike,” Shahini reportedly said in response to news of his sentence, and as a possible alternative to filing an appeal. “Until either they free me or I die.”\nShahini was first taken prisoner on July 11, during a visit to see his mother, who is suffering from Alzheimer’s. He had criticized Iran’s deplorable human rights record online.\nU.S. State Department spokesman John Kirby issued a statement on Tuesday regarding Shahini’s sentencing: “We reaffirm our calls on Iran to respect and protect human rights and fundamental freedoms, cease arbitrary and politically motivated detentions and ensure fair and transparent judicial proceedings in all criminal prosecutions consistent with its laws and its international obligations.”","url":"https://www.breitbart.com/national-security/2016/11/01/iran-hands-san-diego-man-18-year-prison-sentence/"}
