{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 19:42:13","date_modify":"2018-10-30 19:42:13","date_publish":"2015-08-16 16:28:56","description":"Over 200 Iranians convened in Downtown L.A's Grand Park on Saturday to show their support for the Iran deal.","filename":"data/vaneerConsumption/IranDeal200SupportersatLARallyPhotoShoot.json","image_url":"https://media.breitbart.com/media/2015/08/IMG_0276.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_16__1540928533.html","title":"Iran Deal: 200 Supporters at L.A. Rally, Photo Shoot","title_page":"Iran Deal: 200 Supporters at L.A. Rally, Photo Shoot","title_rss":"NULL","source_domain":"breitbart.com","text":"LOS ANGELES, California — Over 200 Iranians convened in Downtown L.A’s Grand Park on Saturday to show their support for the Iran deal, presenting it as a peace agreement between Iran and the world.\nA photo shoot and “peace” rally took place to coincide with other events similarly scheduled throughout America and the western world, including in Washington, D.C. and San Diego, California.\nAn estimated 800,000 Iranian Americans live in Los Angeles.\nAn eclectic Iranian-American mix showed up to participate in the photo shoot and enjoy some cookies and cake that were handed out shortly after the pictures were taken. It is traditional in Middle Eastern culture to celebrate with sweets–and nearly all present on Saturday viewed the deal as a victory.\nAt one point during the photo shoot, a woman could be heard directing those present, in Persian, that they should spread out and fill the gaps on the steps to “make the photo appear more full.”\nNearly all the day’s participants supported the deal.\nBreitbart News spoke with a woman, in her mid-20s, named Reyhaneh who said she moved to the United States from Iran two years ago.\nShe was wearing a head covering, as is required of women in the Islamic Republic, although in America she has the freedom to dress however she chooses. When asked if the deal will be beneficial to the majority of Iranians, she did not provide a clear answer but did say it would provide much-needed medicine to those in her country, including family members who have not had access due to sanctions.\nWhen it came to political matters, she was far less open to discussion. Asked if she believes the Holocaust happened, she said in Persian, “I can’t give my opinion on this because I’m not an expert in this area.” When pressed further, she said “I’m not an expert and I haven’t read anything on this topic… I can speak with you about computer science but not about things that I don’t know about.”\nIran’s Supreme Leader Ayatollah Ali Khamenei has denied the Holocaust, and the country has held Holocaust denial contests.\nAnother man named Hamid, who moved to Los Angeles from Iran nine years ago, said “I don’t know [the] Holocaust.” Breitbart News then informed him that it was the catastrophic event which resulted in the systematic execution of 6 million European Jews, among others, seen as being inferior to the Aryan race. “Yeah, yeah. Let me go… no no,” Hamid said before walking away.\nA group of three Iranians, two women and a man, who were just arriving at the event said they “have no idea” whether the Holocaust existed.\nOne Iranian woman named Megan, who is seeking citizenship in the U.S., told Breitbart News that she does believe the Holocaust took place, although she said she was not sure about the exact number of people killed.\nEvery Iranian Breitbart News spoke expressed some level of fear when it came to discussing their views on the regime and its leadership.\nWhen asked about the regime’s near-constant chants of “Death to America” and “Death to Israel,” Megan said “basically the regime doesn’t like Israel. But they’ve been saying it and I think they need to put an end to that. It’s terrible.”\nShe said she does not believe regime change is the best option but said “if they want to stay, let them stay. But they have to change… .It’s difficult to think about another revolution for Iran as much as I’d love for the system to change.”\nAli, who lives in San Diego, moved to California two years ago and said that “the main concern is to respect Iranian rights and that. It’s to make sure that Iran is having a relationship with other countries and it’s not isolated in the world.” He insisted Iran had not been looking to develop nuclear weapons under former President Mahmoud Ahmadinejad.\nMegan also told Breitbart News that many of the Iranians present were fearful of speaking out against the government because they are worried that regime agents are present and listening for dissidents who are against Khamanei and his gang.\nFollow Adelle Nazarian on Twitter @AdelleNaz and on Facebook.","url":"https://www.breitbart.com/national-security/2015/08/16/iran-deal-200-supporters-at-l-a-rally-photo-shoot/"}
