{"authors":[],"date_download":"2018-10-30 01:21:49","date_modify":"2018-10-30 01:21:49","date_publish":"2016-04-06 08:00:00","description":null,"filename":"data/vaneerConsumption/IransMissilesandObamasDoctrine.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/04/Screen20Shot202016-04-0520at205.44.0420PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862509.html","title":"Iran’s Missiles and Obama’s Doctrine","title_page":"Iran’s Missiles and Obama’s DoctrineThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The United States is facing a humiliation of the first order resulting from almost comically provocative Iranian test launches of nuclear-capable ballistic missiles earlier this month and the lack of any real response from Washington, save for largely symbolic sanctions. For the Obama Administration, a recent interview suggests it sees this humiliation and loss of credibility not as a serious problem, but as a successful application of the “Obama Doctrine.”\nIran’s missile launches violated the spirit of UN Security Council Resolution 2231, which lifted international sanctions on Iran when it agreed to the Joint Comprehensive Plan of Action (JCPOA) regulating its nuclear program. This suggests that the Ayatollahs in Iran have no intention of getting “right with the world” as Obama once suggested, and intend to continue their revolutionary goals. Lest anyone fail to grasp that point, the missiles were inscribed with the words “Israel must be wiped off the Earth,” in Hebrew.\nYet the Russians are blocking any attempt to invoke 2231 to sanction Iran on the grounds that its language does not explicitly forbid this behavior. They’re right. Paragraph 3 of Annex A of 2231 states, “Iran is called upon not to undertake any activity related to ballistic missiles designed to be capable of delivering nuclear weapons, including launches using such ballistic missile technology” for a period of up to eight years after the JCPOA goes into effect. Resolution 1929, a previous Iran sanctions resolution, did explicitly forbid it, stating, “Iran shall not undertake any activity related to ballistic missiles capable of delivering nuclear weapons.”\nOddly, when confronted with this discrepancy during a congressional hearing last July, Secretary of State John Kerry suggested that the language was indistinguishable. A skilled lawyer and a former chairman of the Senate Foreign Relations Committee, Secretary Kerry must have understood that the new language was non-binding. But he may well have considered the practical impact of the language change to be negligible. In the imagination of Kerry and Obama, the Islamic Republic was heeding their invitation to become a “very successful regional power” and be “reintegrated into the international community.” Thus, they may not have anticipated Iran’s willingness to push the limits of what it could do. Worse, they may not consider it a serious problem.\n“To a remarkable degree,” Jeffery Goldberg writes in the Atlantic, “[Obama] is willing to question why America’s enemies are its enemies, or why some of its friends are its friends.” Goldberg goes at lengths to explain how President Obama disdains traditional Sunni allies in the region, saying he is “clearly irritated” that he must “treat Saudi Arabia as an ally.” As Obama and Kerry see it, Iran is a rising power, while Israel and the Sunni states are not.\nThus, allowing Iran to freely develop ballistic missiles can be seen as an intentional strategic shift which disentangles the U.S. from potential conflict with Iran. Kerry’s statements to the contrary are merely acknowledgements of domestic political realities. The outcome of this incident concerning Iran’s test launches, far from a humiliation, are an anticipated result of the Obama Doctrine.\nGoldberg also notes that Obama is “very proud” of his widely criticized decision to allow an Iranian proxy, Syria’s Bashar al-Assad, to violate Obama’s own “red line” on chemical weapons use. Likening potential involvement in Syria to protect our credibility to getting sucked into Vietnam, he cites this as the moment that he was finally able to break out of the “Washington playbook,” which would require following through on his threat. “Dropping bombs on someone to prove that you’re willing to drop bombs on someone is just about the worst reason to use force.\nWhat can be gleaned from the entirety of “The Obama Doctrine” is that in Obama’s eyes, America’s credibility is inherent in its strength alone, not in its application, the greater risk is of entanglement, not disengagement, and that enemies can be placated at the expense of our allies.\nYet this doctrine is quite dangerous. American credibility is undermined when we let rivals grow and provoke us without response. The risk of imprudent action is serious, but the risk stemming from a lack of credibility is worse. This is particularly true when dealing with radical ideologies that believe they have a divinely inspired mission. The Iranian Mullahs will see America’s weakness not as a strategic realignment that could benefit their interests if they moderate and draw closer to the U.S., but as proof that they are following divine will in their struggle to dominate the Middle East and eventually beyond. This will not lead to American disentanglement, but deeper entanglement, and under worse circumstances.\nAnd once lost, America’s credibility will be much more difficult to regain.","url":"https://spectator.org/65976_irans-missiles-and-obamas-doctrine/"}
