{"authors":["John Hayward"],"date_download":"2018-10-30 20:47:14","date_modify":"2018-10-30 20:47:14","date_publish":"2018-08-27 23:06:21","description":"Iran pleads with Europe and the World Court for relief from U.S. sanctions while ominously teasing a Persian Gulf blockade.","filename":"data/vaneerConsumption/IranClaimstoControlPersianGulfNoNeedforPresenceofAliensLiketheUS.json","image_url":"https://media.breitbart.com/media/2018/08/wi/afp/25/f203eb_iranian-president-hassan-rouhani-has-called-unity-in-face-criticism-all-e1535411120825.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_08_27__1540932434.html","title":"Iran Claims to Control Persian Gulf, ‘No Need for Presence of Aliens Like the U.S.’","title_page":"Iran Claims to Control Persian Gulf, ‘No Need for Presence of Aliens Like the U.S.’","title_rss":"NULL","source_domain":"breitbart.com","text":"Iran on Monday ratcheted up both its threats and its pleas for rescue from American sanctions, belligerently claiming complete control of the Persian Gulf and seeking to expel the U.S. Navy while demanding European nations promise to alleviate sanctions against its banking and oil industries.\nIranian President Hassan Rouhani has been working the phones and demanding European nations step forward with commitments to shield Iranian oil sales, bank transactions, and other vital industries. On Monday, he placed a call to French President Emmanuel Macron, who conspicuously declined to offer the unconditional support Rouhani wanted, much as the Germans previously demurred.\n“Iran has acted upon all its promises in the nuclear agreement and, with attention to the one-sided withdrawal of America … expects the remaining partners to operate their programs more quickly and transparently,” Rouhani told Macron, as quoted by Reuters.\nMacron’s response was lukewarm:\nMacron reiterated France’s commitment to maintaining the accord, a remark aimed at soothing Tehran. But he repeated his earlier calls for broader discussions with all relevant parties that would include Iran’s nuclear program after 2025, its ballistics program and its influence in the wider Middle East region. “We will do everything so that the talks help avoid a serious crisis in the months ahead,” Macron said in an annual speech to French ambassadors.\nIran’s position is that the Obama nuclear deal, formally known as the Joint Comprehensive Plan of Action (JCPOA), remains binding on all parties and no renegotiation is necessary. Macron’s response, at the very least, broached the idea that Tehran will have to return to the negotiating table with Washington.\nWhile Rouhani begged Europe for help, Islamic Revolutionary Guard Corps naval commander General Alireza Tangsiri told Iranian media on Monday morning that his forces have full control of the Persian Gulf and Straits of Hormuz and can blockade shipping whenever they please.\nPressTV quoted Tangsiri at length, including his appeal for Islamic solidarity against the U.S. and other foreign powers:\nIn the Persian Gulf, the IRGC Navy and in the Sea of Oman, the naval forces of the Army are prepared to defend the waters with their intelligence dominance and monitoring of the enemy’s physical presence. We have a message to our Muslim neighbors: we have repeatedly stated that ‘we are extending our hand of brotherhood to you and believe that the Persian Gulf is our home for which we can provide security. In the Persian Gulf, we have no problem which the enemy might cause. The Persian Gulf is our home and we can provide security there. There is no need for foreigners such as the United States and the countries whose home is not here. In the Strait of Hormuz, we control the lanes and the arrival and presence of ships according to the protocol which exists for the country’s waters and coastal strips, where all military and civilian ships and vessels are controlled. We have a full command over the Persian Gulf and our presence in the region is physical, constant and round-the-clock.\nPressTV linked Tangsiri’s remarks to President Hassan Rouhani’s threat in July to close the Strait of Hormuz if the United States proceded with oil sanctions: “It would be meaningless that Iran cannot export its oil while others in the region can. Do this if you can and see the consequences.”\nIranian Supreme Leader Ayatollah Ali Khamenei, who has more direct control over the Islamic Revolutionary Guard Corps, was even blunter in late July: “If Iran’s oil export is blocked, no other country in the region will export oil either.”\nFox News on Monday noted that the Strait of Hormuz is only 21 miles wide and has shipping lanes just two miles wide, making it possible for Iran to credibly threaten shipping and potentially spark a world energy crisis. The Iranians recently conducted a large-scale exercise to practice “swarming” attacks with dozens of small boats.\n“It’s kind of a brinkmanship capacity of gaming with us. I think the United States is very much attentive to what they are doing, and will respond if the Iranians will cross that red line,” said Fox News analyst Walid Phares.\nIran hedged its bets by appealing to the International Court of Justice on Monday, arguing the Trump administration’s restored sanctions violate treaty agreements between the United States and Iran as well as violating the JCPOA, which Iran claims to have honored to the letter.\n“The US is publicly propagating a policy intended to damage as severely as possible Iran’s economy and Iranian national companies, and therefore inevitably Iranian nationals. This policy is nothing but naked economic aggression against my country,” Iranian lawyer Mohsen Mohebi told the court.\nThe BBC noted on Monday that since President Donald Trump withdrew from the JCPOA, the Iranian rial has lost half its value against the dollar, the monthly inflation rate is up to 10.2 percent, and unemployment is 12.5 percent.","url":"https://www.breitbart.com/national-security/2018/08/27/iran-claims-control-persian-gulf-presence-aliens-like-u-s/"}
