{"authors":["Samantha Raphelson"],"date_download":"2018-10-23 01:03:17","date_modify":"2018-10-23 01:03:17","date_publish":"2018-08-07 00:00:00","description":"The new sanctions, which were previously lifted under the 2015 nuclear deal, severely limit Iran's ability to buy U.S. currency and issue sovereign debt, and place restrictions on trade with Iran.","filename":"data/vaneerConsumption/IranBracesForNewUSSanctionsToFurtherCrippleEconomy.json","image_url":"https://media.npr.org/assets/img/2018/08/07/ap_18204479226451_wide-809fccdb2aa5698b3426b501ae11aa67329ae720.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_07_636370243_iran-braces-for-new-u-s-sanctions-to-further-cripple-economy_1540256597.html","title":"Iran Braces For New U.S. Sanctions To Further Cripple Economy","title_page":"Iran Braces For New U.S. Sanctions To Further Cripple Economy : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Iran Braces For New U.S. Sanctions To Further Cripple Economy\nEnlarge this image toggle caption Ebrahim Noroozi/AP Ebrahim Noroozi/AP\nThe U.S. reimposed a round of sanctions against Iran that went into effect early Tuesday, a move the Trump administration hopes will further damage the Iranian economy and force concessions from Tehran on a number of fronts.\nThe sanctions, which were previously lifted under the 2015 nuclear deal, severely limit Iran's ability to buy U.S. currency and issue sovereign debt, and also place restrictions on trade with Iran in aluminum and steel, and the automotive and airline industries.\nThe sanctions will also hurt Iran's ability to export goods like pistachios and its famous Persian rugs. The most significant impact of the sanctions may be the number of European companies that will stop doing business with Iran.\nThe measures mark the first of two rounds of sanctions set to be restored after President Trump announced his decision to withdraw from the nuclear deal in May. The second round planned for November is expected to further strain Iran's economy by targeting its oil sector and central bank.\n\"These are the most biting sanctions ever imposed, and in November they ratchet up to yet another level,\" President Trump said in a morning tweet. \"Anyone doing business with Iran will NOT be doing business with the United States. I am asking for WORLD PEACE, nothing less!\"\nEuropean Union officials said in a joint statement Monday they \"deeply regret\" the reinstatement of U.S. sanctions, and plan to provide a legal shield for European businesses with dealings in Iran. In 2017, EU trade with Iran was valued at $23 billion, with more than 75 percent related to energy deals, according to the European Commission.\nBut despite the promise of protection, many European corporations have begun to leave Iran, says Amir Paivar, a reporter for the BBC's Persian service.\n\"If you are a big multi-national with a massive exposure to U.S. market, and at the same time you have a small business in Iran, it's not a difficult choice to make quite frankly,\" he tells Here & Now's Robin Young. \"At the end of the day, it's a risk and reward calculation. They are more accountable to their shareholders and boards rather than being accountable to what the politicians in Brussels decide.\"\nU.S. aircraft manufacturer Boeing and Europe's Airbus will also lose contracts worth about $39 billion to refurbish Iran's crumbling stock of commercial airliners, U.S. Treasury Secretary Steven Mnuchin said in May.\nWhen the second round of sanctions take effect, Iran's oil industry could take a major dive. Oil exports, which were worth $36 billion in 2016, could plunge by two-thirds, according to the Council on Foreign Relations. However, some countries might still be determined to find ways around the sanctions to buy oil, including China and India, two of Iran's biggest customers.\nIran's economy had already begun to suffer in anticipation of the sanctions, Paivar says. The rial currency has lost half its value since April, triggering massive inflation that reached 13.7 percent in June.\n\"That in turn probably will trigger a recession because of fluctuating exchange rates, lack of financing means Iran cannot import machinery and technology, and manufacturing will suffer,\" Paivar says. Growing economic uncertainty coupled with charges of corruption have also sparked anti-government protests across Iran.\nSince the 1979 hostage crisis, the U.S. has imposed sanctions on Iran intermittently. The 2015 Joint Comprehensive Plan of Action, or JCPOA, paused sanctions in exchange for curbs and regular checks on Iran's nuclear program. The deal – which was negotiated by the Obama administration with the U.K., France, Germany, Russia and China – has been sharply criticized by Trump since he was a candidate for president.\nNational Security Adviser John Bolton said on Tuesday the sanctions are designed to pressure Iran to withdraw its support for international terrorism, roll back its military operations in the Middle East and its nuclear programs. Last month, President Trump said he was ready to engage in new talks with Iranian leaders \"without preconditions.\"\n\"We definitely want to put maximum pressure on the government, and it's not just to come back to discuss fixing a deal that's basically not fixable, dealing with the nuclear weapons aspect,\" Bolton told Fox News, according to the Associated Press. \"There's a lot going on here that Iran needs to be held accountable for.\"\nIn a televised speech from Tehran on Monday night, Iranian President Hassan Rouhani described new U.S. sanctions as \"psychological warfare\" and said he would only engage in new talks with the U.S. \"if there is sincerity.\"\n\"Someone who offers to hold talks should initially prove that they aim at resolving issues through talks,\" Rouhani said. \"What sense do negotiations make when they impose sanctions?\"","url":"https://www.npr.org/2018/08/07/636370243/iran-braces-for-new-u-s-sanctions-to-further-cripple-economy"}
