{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:44:26","date_modify":"2018-10-30 19:44:26","date_publish":"2015-04-20 12:50:42","description":"Continuing its tradition of providing a propaganda platform for America's enemies, the New York Times has published an op-ed by Iranian foreign minister Javad Zarif in which he demands that the United States choose \"between cooperation and confrontation, between negotiations and grandstanding, and between agreement and coercion.\" Enjoying the freedom of expression his government denies to its opponents, Zarif argues that the West should work with it toward regional peace. |","filename":"data/vaneerConsumption/IransForeignMinisterPublishesOpedinNYTimes.json","image_url":"https://media.breitbart.com/media/2015/04/Javad-Zarif-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_20__1540928666.html","title":"Iran's Foreign Minister Publishes Op-ed in NYTimes","title_page":"Iran's Foreign Minister Publishes Op-ed in NYTimes | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Continuing its tradition of providing a propaganda platform for America’s enemies, the New York Times has published an op-ed by Iranian foreign minister Javad Zarif in which he demands that the United States choose “between cooperation and confrontation, between negotiations and grandstanding, and between agreement and coercion.” Enjoying the freedom of expression his government denies to its opponents, Zarif argues that the West should work with it toward regional peace.\nNotably missing from Zarif’s op-ed is any mention of peace with Israel. Zarif also claims that “Good relations with Iran’s neighbors are our top priority,” while failing to mention its proxy war in Yemen; its effort to prop up the murderous Assad regime in Syria; its role in arming and funding Hamas and Hezbollah; its movement of troops to the border with Israel; and its ongoing terror operations around the world, including its recent efforts to blow up the Israeli embassy in Uruguay.\nZarif shows off the buzz words that he has used to charm American diplomats, offering a string of meaningless jargon that is music to the ears of the Obama administration: “A regional dialogue could help promote understanding and interaction at the levels of government, the private sector and civil society, and lead to agreement on a broad spectrum of issues, including confidence- and security-building measures; combating terrorism, extremism and sectarianism…” and so on.\nHe hints darkly that the U.S. should join Iran in “addressing the roots of the turmoil in the wider Persian Gulf region.” Iran itself, however, is at the heart of much of the conflict at the moment.\nWhat Zarif is daring the Obama administration to do is to abandon America’s traditional allies, especially those nations opposing Iranian hegemony–Israel, Egypt, the Saudis. And he suggests that a nuclear deal could more easily be reached if the U.S. would commit to changing its foreign policy.\nSo instead of the U.S. dictating the choices to the Iranian regime–a rogue totalitarian theocracy that was near collapse six years ago–the Iranian regime is dictating terms to America.\nThat shift, as Natan Sharansky observed in a recent op-ed in the Washington Post, is the result of “a tragic loss of moral self-confidence” in the United States, as Americans become less convinced, under Obama’s leadership, that our values are the best and that our interests are those of humanity at large.\nIn the past, the New York Times has offered platforms to other rogue regimes, including the new Hamas government in Gaza, shortly after it seized power from its Fatah rival in a 2007 coup. On that occasion, Hamas political adviser Ahmed Yousef promised: “Our stated aim when we won the election was to effect reform, end corruption and bring economic prosperity to our people. Our sole focus is Palestinian rights and good governance.”\nWe all know how that worked out.","url":"https://www.breitbart.com/national-security/2015/04/20/irans-foreign-minister-publishes-op-ed-in-nytimes/"}
