{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:51:50","date_modify":"2018-10-30 20:51:50","date_publish":"2016-10-05 03:35:21","description":"Iran-backed Houthi rebels in Yemen launched an airstrike against an aid ship owned by a company from the United Arab Emirates (UAE).","filename":"data/vaneerConsumption/IranAlliedShiiteHouthisAttackUAEShipCarryingAidtoYemen.json","image_url":"https://media.breitbart.com/media/2015/09/Yemeni-Houthi-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_10_04__1540932710.html","title":"Iran-Allied Shiite Houthis Attack UAE Ship Carrying Aid to Yemen","title_page":"Iran-Allied Shiite Houthis Attack UAE Ship Carrying Aid to Yemen","title_rss":"NULL","source_domain":"breitbart.com","text":"Iran-backed Houthi rebels in Yemen launched an airstrike against an aid ship owned by a company from the United Arab Emirates (UAE), a member of the largely Sunni Gulf Cooperation Council (GCC), and part of the Saudi-led Arab alliance fighting the Shiite rebels, according to the state-controlled Emirates News Agency (WAM).\nThe UAE also belongs to the 57-member Organisation of Islamic Cooperation (OIC), which condemned the attack, calling it a “terrorist act.”\nIn a statement, the OIC also urged “concerned agencies” to bring the Houthi attackers to justice. Moreover, the Arab League, of which the UAE is also a member, denounced the attack as well.\nWhen it was struck on Saturday, the ship, owned by the UAE’s National Marine Dredging Company, was on a trip “to deliver medical and relief aid and evacuate the wounded and injured civilians in order to complete their treatment outside Yemen,” notes WAM, citing a statement from the U.S.-backed Saudi-led coalition that is currently fighting to restore the internationally recognized Yemeni President Abd Rabbuh Mansur Hadi and defeat the Iran-backed Shiite Houthis.\n“This is a terrorist attack that violates the international laws. It is also a clear violation of humanity and a flagrant aggression against life,” declared the Hadi government.\nIt remains unclear if there were any casualties from the attack.\nCurrently, civilians in war-ravaged Yemen are facing a dire humanitarian situation and find themselves in desperate need of food and medicine.\n“Coalition air and naval forces had started chasing and targeting of boats, which carried out the attack,” the Saudi-led coalition said in a statement, according to WAM.\nThe Houthis took responsibility for the attack, which took place as the vessel was heading to Yemen’s southern port city of Aden — the de facto capital of the Saudi-backed Yemeni government after they were pushed out of Sanaa, reports CNN.\n“In any case, the Yemeni people consider the Emiratis and Saudis their enemies and so anything belonging to them is a legitimate target,” Mohammed Al Bukhaiti, spokesperson for the Shiite Houthis, told CNN.\nAl Araby reports, “The GCC defense charter states that an attack on one member is an attack on all.”\nSaudi Arabia, which has already been attacked by the Houthis across the border in Yemen, is considered to be the GCC’s most powerful member.\nExcept for Oman, all GCC members — Saudi Arabia, UAE, Kuwait, Bahrain, Qatar — have joined the U.S.-backed, primarily Sunni, coalition combating the Houthis and their allies. The U.S. State Department also condemned the attack, saying, “These provocative actions risk exacerbating the current conflict and narrow the prospects for a peaceful settlement.”\nThe vessel “came under fire in the Bab al-Mandab Strait — which lies between the southern tip of Yemen and Djibouti and Eritrea in the Horn of Africa,” notes CNN.\nLike Saudi Arabia, Oman shares a border with Yemen. However, the country has strong ties with Iran and a policy of no interference with other countries. Until now, Oman’s argument for staying out of the war against the Houthis is that the rebels have not attacked the GCC.\n“This should be clear to America and to the rest of the world: When one GCC state is targeted unfairly, the others stand around it,” Abdulkhaleq Abdullah, an Emirati Gulf specialist and professor of political science at United Arab Emirates University, told the Associated Press (AP), after the United States enacted a law allowing Americans to sue Saudi Arabia for any role it may have played in the September 11, 2001, attacks against the U.S. homeland.\nThe Houthi spokesman claimed to CNN that his fellow Shiite terrorists did not believe the vessel was carrying much-needed aid when they attacked.\nIn Yemen, the conflict has become a proxy war between regional rivals Sunni Saudi Arabia and Shiite Iran.\nSince March 2015, the Saudi-led coalition has been combating the Iran-backed Houthis and their allies, primarily armed groups loyal to Yemen’s former president Ali Abdullah Saleh. Fighters from Shiite Iran’s narco-terrorist proxy Hezbollah, which is based in Lebanon, have reportedly joined the Houthis.\nOman and Bahrain are the only non-Sunni majority members of the GCC. The majority of the people of Oman are adherents of the Ibadaya sect of Islam, which predates both Sunni and Shiite denominations. Meanwhile, the majority of Bahrainis are Shiite.\nIn recent months, the U.S.-backed Saudi-led coalition has been accused of killing and hurting civilians with airstrikes.","url":"https://www.breitbart.com/national-security/2016/10/04/iran-allied-shiite-houthis-attack-gcc-member-uae-ship-carrying-aid-yemen/"}
