{"authors":[],"date_download":"2018-10-23 02:56:10","date_modify":"2018-10-23 02:56:10","date_publish":"2016-01-28 18:15:25","description":"Iran agreed Thursday to buy 118 Airbus aircraft worth about $25 billion (22 billion euros), according to a memorandum of understanding signed during a visit ...","filename":"data/vaneerConsumption/Irantobuy118Airbusaircraftworth25billion.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h2eb-4PuZeKVXE7cd9005b2c87601977a-777_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421382_Iran-buy-118-Airbus-aircraft-worth-25-billion_1540263370.html","title":"Iran to buy 118 Airbus aircraft worth $25 billion","title_page":"Iran to buy 118 Airbus aircraft worth $25 billion | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Iran to buy 118 Airbus aircraft worth $25 billion\nIran agreed Thursday to buy 118 Airbus aircraft worth about $25 billion (22 billion euros), according to a memorandum of understanding signed during a visit to France by Iranian President Hassan Rouhani.\n\"The sky has brightened for Iranian passengers, and Airbus is pleased to welcome the return of Iran to the international civil aviation community,\" said the boss of the European aircraft maker, Fabrice Bregier.\nThe deal to purchase 73 long-haul and 45 medium-haul planes, to be finalised once international sanctions against Iran are fully lifted, was signed at a ceremony attended by Rouhani and French President Francois Hollande.\nAirbus chief executive Fabrice Bregier (R), Iran Air chief executive Farhad Parvaresh (L), Iranian President Hassan Rouhani (back L) and French President Francois Hollande in Paris on January 28, 2016 ©Stephane de Sakutin (AFP)\nThe deal covers \"new aircraft orders and a complete package of cooperation in the civil aviation sector,\" Airbus said in a statement.\nAn embargo dating from 1995 has prevented Western manufacturers from selling equipment and spare parts to Iranian companies.\nThe restrictions, which have been blamed for crippling the industry, were partly lifted by an interim agreement on Iran's nuclear programme that came into force in January 2014.\nThis allowed for the sale of spare parts, although direct sales of aircraft remained banned.\nRouhani's trip comes a week after Tehran's deal with world powers came into force, allowing the United States and the European Union to begin lifting economic barriers brought in over Iran's nuclear programme that have long hindered its growth.\nThe deal with Airbus was one of several major accords announced during the visit, including an oil contract with French giant Total, a partnership deal with carmaker Peugeot and a plan for construction giant Bouygues and Aeroports de Paris (ADP) to expand Tehran's airport.\nIran's civil aviation fleet is now around 140 aircraft, with an average age of around 20 years, and many are in desperate need of replacement.\n\"Today's announcement is a first step towards restoring the prestige of the civil aviation sector in the region, and alongside partners such as Airbus we will offer unparalleled services,\" said Iran Air's CEO Farhad Parvaresh.","url":"https://www.dailymail.co.uk/wires/afp/article-3421382/Iran-buy-118-Airbus-aircraft-worth-25-billion.html"}
