{"authors":["John Hayward"],"date_download":"2018-10-30 20:50:22","date_modify":"2018-10-30 20:50:22","date_publish":"2015-11-04 02:34:28","description":"Iran has begun threatening to quit Syria talks over what they describe as the \"negative role\" of Saudi Arabia.","filename":"data/vaneerConsumption/IranThreatenstoQuitSyriaTalksDuetoSaudiArabia.json","image_url":"https://media.breitbart.com/media/2015/11/Iran-Saudi-Talks-AP-640x480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_03__1540932622.html","title":"Iran Threatens to Quit Syria Talks Due to Saudi Arabia","title_page":"Iran Threatens to Quit Syria Talks Due to Saudi Arabia","title_rss":"NULL","source_domain":"breitbart.com","text":"The 17-nation talks held in Vienna on Friday were meant to begin an international dialogue about bringing an end to the Syrian civil war. The project has already run into significant trouble due to the longstanding animosity between two of the most important regional powers, Iran and Saudi Arabia. Iran has begun threatening to quit the talks over what they describe as the “negative role” of the Saudis.\n“In the first round of talks, some countries, especially Saudi Arabia, played a negative and unconstructive role,” said Iranian Deputy Foreign Minister Hossein Amir Abdollahian. “Iran will not participate if the talks are not fruitful.”\nHe also warned Saudi Foreign Minister Adel al-Jubeir – who survived an assassination plot linked to Iran four years ago – “not to test our patience.”\nReuters adds that Iranian President Hassan Rouhani obliquely chastised Jubeir, calling him “an inexperienced young man” who “will not reach anywhere by rudeness in front of elders.”\nJubeir, who is 50 years old, might be pleased to be called a “young man” in other social contexts, but soon after the Vienna talks, he accused Iran of smuggling weapons to insurgents in Saudi Arabia and Bahrain, as well as driving or influencing conflicts in Lebanon, Syria, Iraq, and Yemen. The Saudis are currently engaged in an air campaign against Iran-backed insurgents in the latter country.\nSaying that Iran was responsible for the “negativity” in its relationship with Saudi Arabia, Jubeir declared, “It is up to the Iranians whether they want to have relations with us based on good neighborliness, or if they want to have relations that are filled with tension. That is on Iran.”\nFor better or worse, Reuters portrays these Syria talks as a result of the Iranian nuclear deal, which gave Iran enough clout to overcome longstanding Saudi objections to accept Iran’s presence at Syria talks. Russia’s entry into the Syrian civil war is also cited as a reason Western powers gave Iran a seat at the table.\n“It was unclear whether the suggestion, carried via state-run news media, was serious or more akin to diplomatic posturing, since Iran would have much to lose if it were to leave talks it has long sought to attend,” the New York Times ventured.\nHowever, the Iranians are taking a very hard line in this early stage of their diplomacy with the Saudis. “If Saudi Arabia’s outlook on general regional issues is brought closer to realities and it renounces its meddling, many problems including those concerning relations can be solved in the new conditions,” said Iranian president Rouhani.","url":"https://www.breitbart.com/national-security/2015/11/03/iran-threatens-quit-syria-talks-due-negative-role-saudi-arabia/"}
