{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 21:34:42","date_modify":"2018-10-30 21:34:42","date_publish":"2016-12-19 00:00:00","description":"On Sunday, IranAir announced that its historic $25 billion Airbus order will be cut down to $10 billion and that the A380 will no longer be included.","filename":"data/vaneerConsumption/IranAirhasdroppedtheA380fromitshistoricAirbusorder.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_airbus-a380-superjumbo-iran-air-order-lost-2016-12_1540935282.html","title":"IranAir has dropped the A380 from its historic Airbus order","title_page":"    IranAir has dropped the A380 from its historic Airbus order - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Airbus A380 superjumbo. Airbus On Sunday, IranAir announced that it had downsized its historic order for 118 Airbus jets to just 100 planes — cutting the value of the deal from $25 billion to no more than $10 billion, Reuters reported.\nAmong the planes cut from the deal are 12 double-decker A380 superjumbos.\nThis is troubling news for the beleaguered A380 superjumbo program.\nThe IranAir order would have been the A380's largest airline order since 2013.\nAn Airbus spokesperson declined to comment. IranAir was not immediately available for comment.\n\"Although the nominal value of the contract for 118 Airbus planes had been announced at $25 billion, the A380 planes have been dropped from this contract, so the value of our Airbus contract will not be more than $10 billion,\" IranAir chairman and managing director Farhad Parvaresh told Iranian state news agency IRNA.\nGene Blevins/Reuters The news shouldn't have come as a surprise to Airbus. In June, Tim Hepher of Reuters reported that the A380 portion of the deal is an option instead of a firm order and that IranAir remained non-committal towards the plane.\nIn recent years, Airbus has struggled to secure new customers for the double-decker. Even though the company has taken 319 total orders for the A380, the backlog is down to just 119 planes. As a result, Airbus announced in July that it will cut production of the A380 from 27 planes a year down to just 12 starting in 2018.\nEmirates remains the A380's largest and most influential customer. With 140 of the 319 A380 orders coming from the Dubai-based airline, the future of the aircraft is essentially pegged to Emirates.\nIranAir Boeing 747. Flickr/Allen Watkin In addition to the A380, IranAir's January order included A320ceo- and A320neo-family narrow-body jets along with A330ceo, A330neo, and A350-1000 wide-body airliners.\nDue to economic sanctions levied against Iran over the past few decades, the country's national airline has been unable to expand its service and update its fleet. As a result, IranAir's current fleet of Airbus, Boeing, and Fokker jets has an average age of 27.5 years according to Airfleets.net.","url":"https://www.businessinsider.com/airbus-a380-superjumbo-iran-air-order-lost-2016-12"}
