{"authors":["Edwin Mora"],"date_download":"2018-10-30 19:39:09","date_modify":"2018-10-30 19:39:09","date_publish":"2016-06-08 00:20:09","description":"Shiite militias, many backed by Iran, have been accused of torturing “hundreds\" of Sunni civilians the battle for Fallujah.","filename":"data/vaneerConsumption/IranBackedShiiteMilitiasTortureHundredsinFallujah.json","image_url":"https://media.breitbart.com/media/2016/05/Iraqi-forces-battle-ISIS-Fallujah-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_06_07__1540928349.html","title":"Iran-Backed Shiite Militias Torture ‘Hundreds’ in Fallujah","title_page":"Iran-Backed Shiite Militias Torture ‘Hundreds’ in Fallujah","title_rss":"NULL","source_domain":"breitbart.com","text":"Shiite militias in Iraq, many of them backed by state sponsor of terror Iran, have been accused of torturing “hundreds” of Sunni civilians captured during the ongoing battle to retake Fallujah from the Islamic State (ISIS/ISIL).\nThe torture led to the death of at least four people described as “broken” corpses by an unnamed local nurse at a hospital that treated some of the victims, including dozens of severely wounded men, reports the Telegraph.\nLate last month, Iraqi forces, backed by the U.S. military and Iran-allied Shiite militias, launched an offensive to recapture Fallujah, considered one of two remaining strongholds held by ISIS in Iraq — the other being Mosul, the country’s second-largest city.\nBoth warring sides have been accused of human rights violations and executions in the fight for Sunni-majority Fallujah, located in Anbar, Iraq’s largest province, reports CBS News.\nSheikh Raja al-Issawi, an Anbar provincial council member, told several news outlets that “605” civilians had been recently detained by Shiite militias involved in the fight to recapture Fallujah and taken to the al-Mazraa army base near the town of Saqlawiya, which lies roughly five miles northwest of the city.\n“Dozens more who had been separated from their families as they fled the area” were also captured, reports the Telegraph.\nAustralia’s ABC news service identified the captured Iraqis as “local Sunni men.”\nBBC quotes Issawi as saying that detainees who were recently released “showed signs of severe torture.”\nThe Telegraph obtained photographs purporting “to show at least seven different people recovering from their detentions,” reports the U.K. news outlet. “All are bandaged and bloodied, with several bodies covered in deep welts and bruises. In at least one case, the surface of a man’s flesh appeared to have been removed.”\n“The men arriving at our hospital say they watched field executions and that militiamen mocked their suffering and used filthy sectarian slurs,” the local nurse told the Telegraph, adding that no bodies had been found.\nAccording to various news reports, the torture victims numbered in the “hundreds.” The nurse claimed, “other civilians appeared to have been taken [by Shiite militiamen Monday] for interrogation and torture in al-Garma, a city 10 miles northwest of Fallujhah.”\nAlthough the militias have denied the allegations of torture, the central Iraqi government has declared the Shiite fighters will not be participating in the final assault on Fallujah, amid the deep sectarian divide that threatens to undermine the fight against ISIS.\nOn Sunday, Haider al-Abadi, a spokesman for Iraq’s prime minister, reportedly announced that a human rights panel would investigate “any violation to the instructions on the protection of civilians.”\n“Fearing the central government’s inability to rein in the abuses of its allied militias, the United States has offered to increase the tempo of its [anti-ISIS] air campaign in the area if the groups hold back, as they did in the fight for the [ISIS-held] city of Ramadi last year,” notes the Telegraph.\nMeanwhile, citing “extremely distressing, credible reports,” the United Nations human rights chief conceded that Iraqis are facing physical abuse and even execution at the hands of ISIS as they try to escape Fallujah, where the jihadist group is reportedly using residents as “human shields.”\nThe Norwegian Refugee Council (NRC), an aid agency, recently reported that ISIS is shooting at Iraqis while they try to flee to safety, killing some of them.\nAs part of the legal security screening process aimed at preventing ISIS jihadists from escaping Fallujah among civilians, Iraqi security forces are detaining men and boys as young as 12 years old.\nThe process is supposed to take no longer than a week, Reuters reports, citing Iraqi troops.\n“But Amnesty International, a human rights organization says even civilians detained through the formal screening process are often held indefinitely without charge,” notes the Telegraph. “Tens of thousands of civilians are estimated to still be in the custody of Iraqi security forces following the string of recent anti-ISIS territorial victories in Anbar province beginning in December of last year.”\nISIS is holding captive up to 50,000 civilians, including 20,000 children, inside Fallujah, according to the UN.\nSerious abuses perpetrated by government-sanctioned Shiite militias against Sunni civilians in Iraq are not unprecedented.\nThe Shiite militias in Iraq, collectively known as the Popular Mobilization Forces (PMF), are backed by Iranian forces and advisors linked to the death of Americans, including the notorious Major-General Qassem Soleimani, head of the Islamic Republic’s elite Quds Force.\nIran’s increasingly prominent role in managing Iraq’s internal affairs is accentuated by the growing influence of its Shiite militia proxies in the country, including Hezbollah.\nIn March, the Associated Press (AP), citing figures from the PMF and the Iraqi government, reported that “the more than 50 Shiite militias in Iraq have between 60,000 and 140,000 fighters,” adding, “They are backed by tanks and weapons, and have their own intelligence agency, operations rooms and court of law.”","url":"https://www.breitbart.com/national-security/2016/06/07/civilians-tortured-iran-backed-shiite-militia-fallujah/"}
