{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 20:47:50","date_modify":"2018-10-30 20:47:50","date_publish":"2015-08-07 22:27:58","description":"Leftist Author Makes Dubious Claim that Iranian Jews Support the Iran Nuke Deal","filename":"data/vaneerConsumption/IranianJewsSupportTheIranNukeDeal.json","image_url":"https://media.breitbart.com/media/2015/08/Iranian-Jews-Pray-AP-Photo.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_07__1540932470.html","title":"Iranian Jews Support The Iran Nuke Deal","title_page":"Leftist Author: Iranian Jews Support The Iran Nuke Deal","title_rss":"NULL","source_domain":"breitbart.com","text":"After visiting Iran, Left-wing journalist Reese Erlich has concluded in his piece, “Iran’s Jewish community gets behind nuclear deal with the US,” that there is little to no dissent among Iran’s Jews on the supposed positive implications of the Iran nuclear deal.\nIn his article, which was reposted on Friday in USA Today, Erlich makes the case that Iran’s Jews are unified in favor of the deal.\nTo come to his consensus that the Jewish “community” supports the Iran deal, Erlich only cited three Iranian Jews– two who have been approved by the Mullahs as Jewish community representatives, and one who was seemingly afraid to give the author his full name, likely for fear of reprisal.\nDr. Siamak Morsadegh, the state-sponsored Jewish representative in the Iranian parliament, who had to be approved by the Ayatollah’s Council of Guardians before he was allowed to take his seat in the majilis, proudly told the author that Jews can pray at their synagogues without fear of being killed by a rogue jihadi. However, he then revealed that as a racist apartheid state, Iran prohibits Jews and other religious minorities from holding higher leadership positions in government.\nThe author also spoke to Dr. Homayoun Najafabadi, who leads the Tehran Jewish Committee– another state-approved body–to form his consensus on the Iran deal.\n“There was the possibility of war. With the deal signed, it will take war off the table and bring stability to the region,” Najafabadi told the author.\nOpponents of the Iran deal, which include the vast majority of Americans and Israelis, have warned that the agreement allows for Iran to acquire $150 billion dollars in unfrozen assets, which it would likely use to empower its terror proxies worldwide. The terror organizations which Iran openly supports, such as Hamas and Hezbollah, both seek the destruction of Israel as their chief goal.\nThere were signs throughout the piece that Iran’s Jews remain in tremendous fear of openly speaking their minds regarding geopolitical issues. One such man, who only identified himself by his first name, said that the Iran deal brought Jews in the country “lots of joy,” but then refused to give his full name.\nDefying the Islamic Republic of Iran and/or supporting Zionist movements has had deadly consequences for Iran’s Jews in the past.\nIn one such infamous example, in 1979, Iranian-Jewish businessman Habib Elghanian was executed before a “revolutionary court” simply because he allegedly happened to be a Zionist who supported the Jewish state of Israel.\nIn 2000, a professor studying Iran’s treatment of its religious minorities found that some members of Tehran’s Jewish community were quiet about Israel and their religion due to safety concerns. One unnamed Jewish Iranian told the professor: “We hear the Ayatollah say that Israel was cooperating with the Shah and SAVAK, and we would be fools to say we support Israel. So we just keep quiet about it… Maybe it will work out. Anyway, what can we do? This is our home.”\nAnd the Iranian regime has given Jews reason to continue to fear for their safety, as the Mullahs often engage in a balancing act. On some days, they express overt Holocaust-denial and anti-Semitism, and on others, their leaders simply oppose Zionism and pledge to destroy the Jewish State.\nBesides interviewing only three individuals to come to his consensus, readers should take Erlich’s stated conclusions–that most Iranian Jews are “anti-Zionist” and they unanimously support the Iran deal–with a grain of salt.\nThe reporter has in the past revealed himself as an apologist for the Iranian regime; has shown anti-Israel bias in his reporting; has written in anti-Israel publications, and he even had noted anti-Semite, Noam Chomsky, write the foreword for his most recent book.","url":"https://www.breitbart.com/national-security/2015/08/07/leftist-author-makes-dubious-claim-that-iranian-jews-support-the-iran-nuke-deal/"}
