{"authors":[],"date_download":"2018-10-23 01:14:23","date_modify":"2018-10-23 01:14:23","date_publish":"2016-01-29 15:00:29","description":"Iranian President Hassan Rouhani has voiced pessimism over the prospects for peace in Syria, ahead of talks set to open in Geneva on Friday. \"It's our hope t...","filename":"data/vaneerConsumption/IranpresidentpessimisticonSyrianpeaceprocess.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i0uq-3bmscybNe842cce83474b570282a-979_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422924_Iran-president-pessimistic-Syrian-peace-process_1540257263.html","title":"Iran president pessimistic on Syrian peace process","title_page":"Iran president pessimistic on Syrian peace process | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Iran president pessimistic on Syrian peace process\nIranian President Hassan Rouhani has voiced pessimism over the prospects for peace in Syria, ahead of talks set to open in Geneva on Friday.\n\"It's our hope to see these negotiations succeed as quickly as possible,\" Rouhani told French media late Thursday following a two-day visit.\n\"But I would be surprised if they succeed very soon, because in Syria there are groups fighting the central government but also fighting each other,\" said Rouhani, whose regime backs Syrian leader Bashar al-Assad.\nSyrian soldiers recaptured the town of Rabia during an offensive against in Latakia province, on January 27, 2016\n\"There is interference in the internal affairs of Syria,\" he added in the interview with France 24, Le Monde and France Culture.\n\"The solution should be political, but it will be difficult to arrive at a conclusion in the space of a few weeks, a few meetings. That would be too optimistic, because the Syrian question is too complicated.\"\nThe United Nations said it still expected the Syria peace talks to begin later Friday, despite uncertainty over whether key opposition groups would attend.\nIt said UN envoy Staffan de Mistura would hold \"proximity talks\" with the participants, beginning with the government delegation headed by Syria's UN ambassador Bashar al-Jaafari, who has arrived in Geneva for talks, a Syrian source said.\nDespite Western pressure the main opposition umbrella group, the High Negotiations Committee (HNC), has yet to decide whether to come to Geneva and was holding a fourth day of talks in Saudi Arabia on Friday.\nOn Thursday the Saudi-backed HNC, formed only last month, said it would not take part before an agreement is reached on aid to hundreds of thousands of people stuck in besieged towns.\nThe planned talks are the biggest push to date to end a five-year-old conflict that has killed more than 260,000 people, driven millions from their homes and facilitated the meteoric rise of the Islamic State group.","url":"https://www.dailymail.co.uk/wires/afp/article-3422924/Iran-president-pessimistic-Syrian-peace-process.html"}
