{"authors":[],"date_download":"2018-10-22 21:49:23","date_modify":"2018-10-22 21:49:23","date_publish":"2016-01-28 09:00:49","description":"Iranian President Hassan Rouhani will on Thursday agree a host of commercial deals during a visit to France that offers the clearest demonstration yet of the...","filename":"data/vaneerConsumption/IranianpresidentinFrancefordealsbonanza.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7f4br-4vVdYopwYQ7f641721b07ab07eff-457_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3418663_Rouhani-heads-France-Iran-rebuilds-relations-Europe_1540244963.html","title":"Iranian president in France for deals bonanza","title_page":"Iranian president in France for deals bonanza | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Iranian president in France for deals bonanza\nIranian President Hassan Rouhani will on Thursday agree a host of commercial deals during a visit to France that offers the clearest demonstration yet of the Islamic Republic's post-sanctions buying power.\nRouhani was formally welcomed to Paris by Foreign Minister Laurent Fabius with military honours and national anthems, for the first visit to France by an Iranian president for 17 years.\nIt is the second leg of a trip signalling Tehran's rapprochement with Europe following the lifting of the punishing sanctions imposed over its nuclear programme.\nIranian President Hassan Rouhani (C) attends a meeting with French ministers and representatives of the Movement of the Enterprises of France (MEDEF) in Paris on January 27, 2016 ©Eric Feferberg (AFP)\nThe real business of the visit will come when Rouhani officially signals Iran's intention to buy 114 passenger planes from European aircraft maker Airbus.\nRouhani will also rubber-stamp a deal paving the way for the return of French carmaker Peugeot to Iran, according to a French government source.\nAlthough the red carpet is being rolled out for Rouhani, the Iranian opposition will hold a human rights demonstration and Jewish groups also intend to protest in Paris.\nRouhani is to hold talks with President Francois Hollande which are expected to include Iran's role in Syria, where it is backing President Bashar al-Assad in a war that has killed 260,000 people.\nTalks are due to begin Friday in Geneva to take tentative steps towards ending the conflict.\nAfter arriving from Italy, where he sealed deals for steel and pipelines worth between 15 and 17 billion euros ($18.5 billion), Rouhani began his Paris visit on Wednesday by meeting top French business leaders.\nFrance's economy minister Emmanuel Macron said Rouhani had unveiled a new scheme to guarantee investment by French firms in Iran.\n- Huge boost -\nA source involved in the deal to buy Airbus planes said that only letters of intention will be signed at this stage, because some sanctions are still in place.\nHowever, Iran is said to be keen to bring its ageing fleet of mid- and long-haul aircraft up to date, so the deal is widely expected to go ahead soon, giving a boost to the European aviation industry.\nUnder the Peugeot deal, it will produce 200,000 vehicles a year in Iran from 2017, in partnership with Iranian manufacturer Khodro. The French carmaker pulled out of the country in 2012 as sanctions began to bite.\nIn another potential bonanza, French oil giant Total is said to be interested in buying Iranian crude.\nRouhani's meeting with Hollande is also expected to touch on Iran's bitter feud with regional rival Saudi Arabia.\nAt a press conference rounding off his Rome visit, Rouhani was defiant when asked whether Iran would apologise to Saudi Arabia for an attack on its embassy by demonstrators furious over Riyadh's execution of a prominent Shiite cleric, Nimr al-Nimr.\n\"Why should we apologise, because Nimr al-Nimr was executed? We are the ones to apologise because they are killing the people of Yemen? Apologise to them because they are helping terrorists?\" he asked.\nThe Paris visit was originally scheduled to take place after the November 13 jihadist attacks on Paris, but was postponed.\nIn Rome, Rouhani and Italian Prime Minister Matteo Renzi met at the Capitoline Museum where nude statues were covered up out of respect for the Islamic Republic's strict laws governing propriety.\nBut Rouhani denied he had asked his Italian hosts to cover up the statues and Italian Culture Minister Dario Franceschini, who accompanied Rouhani on the museum trip, called the move \"incomprehensible\".\nRouhani also visited the Vatican for the first time and met Pope Francis, who has urged Iran to work for peace in the Middle East.\nRouhani, a 67-year-old former academic and diplomat who is seen as a pragmatist, was elected in 2013 on a pledge to end sanctions and improve relations with the West.\nPope Francis smiles with Iranian President Hassan Rouhani at the end of their private audience on January 26, 2016, at the Vatican ©Andrew Medichini (POOL/AFP)\nFactfile on Iran ©S.Ramis/K.Tian/S.Malfatto, sim/abm/fh (AFP)\nIranian President Hassan Rouhani (C) arrives to his hotel in Paris on January 27, 2016 at the start of his two-day official visit to France ©Eric Feferberg (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3418663/Rouhani-heads-France-Iran-rebuilds-relations-Europe.html"}
