{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 19:43:54","date_modify":"2018-10-30 19:43:54","date_publish":"2016-12-14 14:01:54","description":"Iranian officials celebrated the impending defeat of rebels in Aleppo, saying it showed that Tehran is the leading power in the region.","filename":"data/vaneerConsumption/IranWarnsUSAleppoVictoryConfirmsLeadingPowerStatus.json","image_url":"https://media.breitbart.com/media/2016/06/syrian-forces.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_12_14__1540928634.html","title":"Iran Warns U.S.:Aleppo 'Victory' Confirms 'Leading Power' Status","title_page":"Iran Warns U.S.:Aleppo 'Victory' Confirms 'Leading Power' Status","title_rss":"NULL","source_domain":"breitbart.com","text":"TEHRAN (AFP) – Iranian officials celebrated the impending defeat of rebels in the Syrian city of Aleppo on Wednesday, saying it showed that Tehran had become the leading power in the region.\nDefence Minister Hossein Dehghan rang his Syrian counterpart Fahd Jassem al-Freij to congratulate him on the “victories of the Syrian army and resistance forces in liberating the city of Aleppo from the hands of takfiri terrorists.”\nIran uses the term “takfiri” to refer to Sunni extremist movements such as Al-Qaeda and the Islamic State group, which it says are leading the rebellion in Syria.\nTehran says its paramilitary Revolutionary Guards play only an advisory role in the conflict, and that any Iranians on the front lines are volunteers seeking to protect Shiite holy sites.\nBut with just a small pocket of rebel resistance left in Aleppo, officials say the offensive has underlined Iran’s increasing influence.\n“The coalition between Iran, Russia, Syria and (Tehran-backed Lebanese militant group) Hezbollah led to the liberation of Aleppo and will next liberate Mosul (in Iraq),” said Yahya Safavi, top foreign policy adviser to supreme leader Ayatollah Ali Khamenei.\nSafavi, a former head of the Revolutionary Guards, said a clear message was being sent to the incoming US president, Donald Trump, who has vowed to take a tougher line with Iran.\n“The new American president must accept the reality that Iran is the leading power in the region,” the Guards’ Sepahnews website quoted him as saying.\nIran accuses the United States and other Western powers of supporting “terrorists” in Syria.\nFresh propaganda panels had sprung up around Tehran on Wednesday, with one reading: “The fight against the United States has once again paid off. Aleppo is liberated. Oh martyr defenders of the shrines, your path will be followed.”\nWestern governments counter that Syrian President Bashar al-Assad is responsible for the deaths of hundreds of thousands of his own people in more than five years of war.","url":"https://www.breitbart.com/middle-east/2016/12/14/iran-says-aleppo-victory-confirms-leading-power-status/"}
