{"authors":[],"date_download":"2018-10-23 01:40:14","date_modify":"2018-10-23 01:40:14","date_publish":"2016-01-28 16:00:46","description":"President Hassan Rouhani hailed a \"new relationship\" between Iran and France during a visit Thursday that saw the signing of a host of post-sanctions busines...","filename":"data/vaneerConsumption/IranianpresidenthailsnewrelationshipwithFrance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g7gi-4vVdYopwYQ7f641721b07aef5e8f-375_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420683_Rouhani-ready-turn-page-Iran-France-relations_1540258814.html","title":"Iranian president hails 'new relationship' with France","title_page":"Iranian president hails 'new relationship' with France | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Iranian president hails 'new relationship' with France\nPresident Hassan Rouhani hailed a \"new relationship\" between Iran and France during a visit Thursday that saw the signing of a host of post-sanctions business deals.\n\"Let us forget the resentment,\" Rouhani said, calling for both countries to take advantage of the \"positive atmosphere\" following the removal of sanctions over the Islamic Republic's nuclear programme.\n\"We are ready to turn the page\" and establish a \"new relationship between our countries\", Rouhani told a meeting of business leaders.\nIranian President Hassan Rouhani arrives at the Invalides following his official welcoming ceremony in Paris, on January 28, 2016 ©Michel Euler (Pool/AFP)\nFrench Prime Minister Manuel Valls responded that \"Iran can count on France\".\n\"France is ready to use its companies, its engineers, its technicians and its many resources to help to modernise your country,\" Valls said.\nRouhani was welcomed to Paris with military honours and national anthems on the second leg of a trip signalling Iran's rapprochement with Europe since sanctions were lifted.\nThe real business of the visit will come when Rouhani officially signals Iran's intention to buy more than 100 passenger planes from European aircraft maker Airbus.\nFrench carmaker Peugeot said it will return to the Iranian market in a five-year deal worth 400 million euros ($436 million) that was announced Thursday.\nPeugeot will produce 200,000 cars a year in a joint venture with local manufacturer Iran Khodro, according to a statement.\nThe French carmaker was forced to pull out of Iran in 2012 as sanctions began to bite.\nIn another potential bonanza for France, the head of French oil giant Total said his firm would sign a deal to buy Iranian crude.\nAlthough the French state is rolling out the red carpet for Rouhani, the Iranian opposition will hold a human rights demonstration and Jewish groups also intend to protest in Paris.\nRouhani is to hold talks with President Francois Hollande which are expected to include discussions on Iran's role in Syria, where it is backing President Bashar al-Assad in a war that has killed 260,000 people.\nTalks are due to begin Friday in Geneva to take tentative steps towards ending the conflict.\nAfter arriving from Italy, where he sealed deals for steel and pipelines worth between 15 and 17 billion euros, Rouhani began his Paris visit on Wednesday by unveiling a scheme to guarantee investment by French firms in Iran.\n- 'A hand grenade' -\nA source involved in the deal to buy Airbus planes said that only letters of intention will be signed at this stage, because some sanctions are still in place.\nHowever, Iran is keen to bring its ageing fleet of mid- and long-haul aircraft up to date, so the deal is widely expected to go ahead soon, giving a huge boost to the European aviation industry.\nRouhani's meeting with Hollande is also expected to touch on Iran's bitter feud with regional rival Saudi Arabia.\nIn a reference to Saudi Arabia, the Iranian president told an audience in Paris that \"some countries had wanted to use terrorism for their own means\".\n\"But this is a hand grenade with the pin removed,\" he added.\nDuring his visit to Rome, Rouhani dismissed suggestions that Iran should apologise to the Saudis for an attack on its embassy by demonstrators furious over Riyadh's execution of a prominent Shiite cleric, Nimr al-Nimr.\n\"Why should we apologise, because Nimr al-Nimr was executed? We are the ones to apologise because they are killing the people of Yemen? Apologise to them because they are helping terrorists?\" he asked.\nIn the Italian capital, Rouhani and Italian Prime Minister Matteo Renzi met at the Capitoline Museum where nude statues were covered up out of respect for the Islamic Republic's strict laws governing propriety.\nBut Rouhani denied he had asked his Italian hosts to cover up the statues and Italian Culture Minister Dario Franceschini, who accompanied Rouhani on the museum trip, called the move \"incomprehensible\".\nRouhani also visited the Vatican for the first time and met Pope Francis.\nRouhani, a 67-year-old former academic and diplomat who is seen as a pragmatist, was elected in 2013 on a pledge to end sanctions and improve relations with the West.\nAn Iranian couple passing by a French Peugeot 307, produced by Iranian \"Iran Khodro\" company, during a 2004 car fair in Tehran ©Behrouz Mehri (AFP/File)\nCEO of European aerospace giant Airbus Group Thomas Enders (L) shakes hands with Iranian President Hassan Rouhani(R) ©Eric Fefferberg (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3420683/Rouhani-ready-turn-page-Iran-France-relations.html"}
