{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:47:10","date_modify":"2018-10-30 19:47:10","date_publish":"2015-01-14 21:16:34","description":"Iranian President Hassan Rouhani announced on Tuesday that Iran has broken ground on two new nuclear power plants in the country’s Bushehr province, Iranian state-news agencies reported. |","filename":"data/vaneerConsumption/IranBuildsTwoNewNukePlantsAsObamaAdminContinuesTalksWithRegimeBeratesCongressForAttemptsToImposeSanctions.json","image_url":"https://media.breitbart.com/media/2015/01/iran-nuclear-reactor-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_01_14__1540928830.html","title":"Iran Builds Two New Nuke Plants As Obama Admin Continues Talks With Regime, Berates Congress For Attempts To Impose Sanctions","title_page":"Iran Builds Two New Nuke Plants As Obama Admin Continues Talks With Regime, Berates Congress For Attempts To Impose Sanctions | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Iranian President Hassan Rouhani announced on Tuesday that Iran has broken ground on two new nuclear power plants in the country’s Bushehr province, Iranian state news agencies reported.\n“Construction of two new power plants will increase the capacity of Bushehr province’s power generation to 2,000 megawatts,” Rouhani said in an address in Bushehr province.\nThe expansion of Iran’s nuclear program has been made possible largely due to Russian cooperation. In March, Russia’s State Atomic Energy Corporation (AEOI) agreed to help build the two plants in Bushehr.\nMeanwhile, U.S. Secretary of State John Kerry and his counterpart, Iranian Foreign Minister Zarif, engaged in “substantive meetings” on Wednesday, according to the State Department. Kerry was expected to leave the Geneva-based negotiations with Iran on Wednesday, but stayed in order to engage with more conversation with Zarif, the Jerusalem Post reported. “Secretary Kerry is returning to Mandarin Hotel for another meeting with Foreign Minister Zarif,” a senior State Department official said of the unexpected change of plans.\nInstead of responding to Iran’s expansion of its nuclear program, the Obama administration has castigated Congress for introducing its upcoming bill to create additional sanctions against Iran. The State Department said earlier this week that any bill regarding sanctions on Iran will be immediately vetoed by President Obama.\n“Even with a trigger, if there’s a bill that’s signed into law, and it is US law, in our mind it is a violation of the Joint Plan of Action, which, as we’ve said, could encourage Iran to violate,” said State Department spokesperson Marie Harf on Tuesday. Harf warned that the Iranian government was extremely sensitive to bills in Congress, and that a bill passed through both chambers could “very well lead to a breakdown in these negotiations.”\nHowever, the Iran sanctions have overwhelming support in both chambers of Congress, with a reported veto-proof majority ready to pass the sanctions. Democratic Rep. Eliot Engel told Al-Monitor on Wednesday: “I respect and understand the White House arguing that sanctions — even triggered sanctions — could be counterproductive or even harmful. That’s their judgment. It’s not necessarily mine.”\nIran also announced on Wednesday that the regime has indicted Washington Post journalist Jason Rezaian and that he will stand trial, without speaking to what charges he will face. Rezaian’s fate remains unknown, but Iran reportedly executed 721 people in 2014, which marked a new high under President Hassan Rouhani’s tenure.\nTehran is also reportedly helping construct a nuclear plant in Syria, reported Der Spiegel earlier this week. The ruling Syrian regime under Bashar al-Assad remains a close ideological ally of Ayatollah Khamenei’s Islamic Republic of Iran.","url":"https://www.breitbart.com/national-security/2015/01/14/iran-builds-two-new-nuke-plants-as-obama-admin-continues-talks-with-regime-berates-congress-for-attempts-to-impose-sanctions/"}
