{"authors":["Deborah Danan"],"date_download":"2018-10-30 19:38:42","date_modify":"2018-10-30 19:38:42","date_publish":"2016-10-05 15:47:55","description":"Iran's Islamic Revolutionary Guard Corps warned that if the U.S. challenges the Islamic Republic, it is can deploy 9 million troops.","filename":"data/vaneerConsumption/IranWeCanMobilizeNineMillionFightersAgainstUS.json","image_url":"https://media.breitbart.com/media/2015/05/Ayatollah-Khamenei-and-Hassan-Firouzabadi-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_10_05__1540928322.html","title":"Iran: We Can Mobilize Nine Million Fighters Against U.S.","title_page":"Iran: We Can Mobilize Nine Million Fighters Against U.S.","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – The founder of Iran’s Islamic Revolutionary Guard Corps warned that if America tries anything against the Islamic Republic, the regime is capable of deploying nine million troops to fight U.S. forces in a matter of days.\nIn a speech delivered last month in Tehran and translated this week by the Middle East Media Research Institute (MEMRI), Mohsen Rafighdoost, who was minister of the IRGC during the 1980s and the Iran-Iraq War, added that IRGC ground forces are “five times better” than the U.S. Army.\n“Despite all the enemy media and cultural propaganda against us, if America wants to try its luck against us, [it should know that] we are completely capable of mobilizing nine million fighters” against it in under 10 days, Rafigdoost said.\n“The IRGC’s ground forces are perhaps five times better than the American army,” he said.\nRafighdoost also declared that Iran’s missiles are capable of reaching Israel and expressed his wish that Israel would launch its own missile at the Islamic Republic so that it could respond by “flattening Tel Aviv.”\n“We have warehouses full [of missiles] in Tehran, Zanjan [in northwest Iran] and Oshnavieh [in Western Azerbaijan Province in northwest Iran] that can strike Tel Aviv. If only a single [Israeli] shell would strike anywhere in this country, so that we can flatten Tel Aviv.”\nRafighdoost also claimed that the leader of the Islamic Revolution Ayatollah Khomeini established Hezbollah in Lebanon to promote Islamization in other countries. Rafighdoost himself was involved in Hezbollah’s creation as well as advancing Iran’s ballistic missile program.\nToday, Supreme Leader Ali Khamenei carries the torch and the army’s obedience to him has made the IRGC “a supreme force in the region.”\n“Despite all the criminal [plots], Iranian security forces grow stronger every day. Some of the statements being put out there are made out of lack of awareness, and anyone who makes them is ignorant,” Rafighdoost said.","url":"https://www.breitbart.com/middle-east/2016/10/05/irgc-founder-if-u-s-tries-anything-on-iran-well-mobilize-9-million-troops-against-it/"}
