{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:41:13","date_modify":"2018-10-30 20:41:13","date_publish":"2015-04-06 17:49:32","description":"A senior official from Iran reportedly called on the Saudi Arabia-led coalition to stop its bombing campaign against Shiite Houthi rebels in Yemen.","filename":"data/vaneerConsumption/IranCallsonSaudiledCoalitiontoHaltAirstrikesinYemen.json","image_url":"https://media.breitbart.com/media/2015/04/Saudi-airstrikes-in-Yemen-Hanni-Mohammed-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_06__1540932073.html","title":"Iran Calls on Saudi-led Coalition to Halt Airstrikes in Yemen","title_page":"Iran Calls on Saudi-led Coalition to Halt Airstrikes in Yemen","title_rss":"NULL","source_domain":"breitbart.com","text":"A senior official from Iran reportedly called on the Saudi Arabia-led coalition to stop its bombing campaign against Shiite Houthi rebels in Yemen.\nThe Iran-backed Shiite Houthis abducted more than 120 members from a rival Islamist Sunni political party over the weekend, reports The Associated Press.\nFurthermore, the Saudi Arabia-owned Al Arabiya News reports that the Houthi rebels targeted civilian homes with army tanks over the weekend, killing many people, including children.\nHouthi rebels have joined forces with security forces loyal to the ousted President Ali Abdullah Saleh.\n“We advise Saudi Arabia to learn from the fate of U.S. military interventions in the region and immediately stop military attacks against Yemen,” reportedly said Iran’s Deputy Foreign Minister Hossein Amir Abdollahian.\nThe Houthis arrested two senior members of the Sunni Islah party along with more than 120 others, reports AP.\n“The Islah party, the Muslim Brotherhood’s branch in Yemen and a traditional power player in Yemen, had declared its support for the Saudi-led coalition bombing campaign against the rebels and their allies,” the AP article notes.\nYemeni Houthis rebels also targeted civilian homes in Aden’s port district of Mualla using army tanks, residents told Al Arabiya News.\nThe Shiite rebels were also accused of executing seven civilians in the southern city of Dalea.\nAccording to AP, the Saudi-led coalition has also been blamed for civilian deaths.\n“Also on Sunday, medical officials said coalition airstrikes in Dhale, a southern city the rebels are trying to control in order to open a corridor to Aden, killed at least five civilians, apparently when an errant missile hit a residential area,” reports AP.\n“Coalition officials accuse the Houthis of hiding among civilians. Saudi military spokesman Ahmed Asiri said during Sunday’s briefing that jets targeted weapons and convoy supplies of Houthi militias heading toward Aden in the last 24 hours,” it adds.\nEarlier this year, the Houthis seized the presidential palace in the Yemeni capital Sanaa, eventually forcing U.S.-backed President Abed Rabbo Mansour Hadi to flee to Saudi Arabia.\nA Saudi-led coalition has been launching airstrikes against Houthi targets and their allies in Yemen.\nThe U.S. is only providing logistics and intelligence support. AP reports:\nCoalition planes on Friday began to airdrop weapons to fighters battling the Houthis in Aden. Military officials, speaking on condition of anonymity because they were not authorized to speak to reporters, complained that some of the airdrops have landed in neighborhoods controlled by extremist groups, a claim that couldn’t be immediately and independently verified.\n“Critics of the Houthis allege that the rebels are proxies for regional Shiite powerhouse Iran. Tehran has supplied the rebels with some logistical aid and supplies, but strongly denies any military support,” it adds.\nThe U.S. intelligence community has linked the Houthis to Iran.\nThe Yemen-based al-Qaeda in the Arabian Peninsula (AQAP), considered one of the most dangerous jihadist groups in the world, is reportedly benefiting from the security chaos in Yemen.\nFollow Edwin Mora on Twitter: @EdwinMora83","url":"https://www.breitbart.com/national-security/2015/04/06/iran-urges-saudi-led-coalition-to-stop-bombing-campaign-in-yemen/"}
