{"authors":[],"date_download":"2018-10-30 20:51:48","date_modify":"2018-10-30 20:51:48","date_publish":"2016-03-04 09:15:03","description":"Iran accused Gulf Arab neighbors on Thursday of jeopardizing Lebanon's stability by blacklisting the Iranian-backed Hezbollah group","filename":"data/vaneerConsumption/IranSaysBlacklistingHezbollahMayJeopardizeLebanonsStability.json","image_url":"https://media.breitbart.com/media/2015/11/Lebanon-Hezbollah-members-with-flags-Reuters-e1451077642611.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_03_04__1540932708.html","title":"Iran Says Blacklisting Hezbollah May Jeopardize Lebanon's Stability","title_page":"Iran Says Blacklisting Hezbollah May Jeopardize Lebanon's Stability","title_rss":"NULL","source_domain":"breitbart.com","text":"Iran accused Gulf Arab neighbors on Thursday of jeopardizing Lebanon’s stability by blacklisting the Iranian-backed Hezbollah group, state television said, a move likely to stoke tensions in the regional power rivalry between Tehran and Riyadh.\nThe six-member Gulf Cooperation Council (GCC) branded Hezbollah a terrorist organization on Wednesday, opening up the possibility of further sanctions against the group that wields influence in Lebanon and fights in Syria.\nLeading Sunni Muslim power Saudi Arabia and Shi’ite Muslim Iran compete for influence across the region and back different factions in sectarian-riven Lebanon and in Syria’s civil war.\n“Lebanon’s Hezbollah is the vanguard of resistance against the Zionist regime (Israel) and Iran is proud of the group, which is also the champion of the fight against terrorism in the Middle East,” Iranian state TV quoted deputy Foreign Minister Hossein Amirabdollahian as saying.\n“Calling Hezbollah a terrorist group … will harm the unity and security of Lebanon.”\nHezbollah’s leader said on Tuesday Lebanon had been pushed into a new phase of political conflict by Saudi Arabia but was not on the brink of civil war and its government of national unity, of which Hezbollah is a part, should survive.\nIn 2013, the Sunni-dominated GCC – representing Saudi Arabia, United Arab Emirates, Bahrain, Kuwait, Oman and Qatar – imposed sanctions on Shi’ite Hezbollah after it entered Syria’s war in support of President Bashar al-Assad.\nThe GCC did not specify on Wednesday what action might be taken against Hezbollah. But last week Saudi Arabia, the biggest power in the GCC, said it had blacklisted four companies and three Lebanese men for having links to the group.\nRelations between Lebanon and Saudi Arabia have been plunged into crisis since Riyadh halted $3 billion in aid to the Lebanese army – a response to the Beirut government’s failure to condemn attacks on Saudi diplomatic missions in Iran.\nIn January, Riyadh led several Arab countries in cutting diplomatic ties with Tehran after demonstrators burned its embassy and a consulate in protest against the execution of a prominent, dissident Shi’ite cleric by Riyadh.","url":"https://www.breitbart.com/middle-east/2016/03/04/iran-says-blacklisting-hezbollah-may-jeopardize-lebanons-stability/"}
