{"authors":[],"date_download":"2018-10-22 23:06:59","date_modify":"2018-10-22 23:06:59","date_publish":"2017-04-26 06:31:28","description":"Iran confirmed Wednesday upholding a five-year sentence for Nazanin Zaghari-Ratcliffe, a British-Iranian woman accused of sedition who has been in jail in...","filename":"data/vaneerConsumption/IranconfirmsupholdingBritishIranians5yearsentence.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/06/wire-463461-1493184690-797_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446350_Iran-confirms-upholding-British-Iranians-5-year-sentence_1540249619.html","title":"Iran confirms upholding British-Iranian's 5-year sentence","title_page":"Iran confirms upholding British-Iranian's 5-year sentence | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An undated handout image released by the Free Nazanin campaign in London on June 10, 2016 shows Nazanin Zaghari-Ratcliffe posing for a photograph with her daughter Gabriella\nIran confirmed Wednesday upholding a five-year sentence for Nazanin Zaghari-Ratcliffe, a British-Iranian woman accused of sedition who has been in jail in the country for more than a year.\n\"She had appealed and the appeals court reviewed her request,\" Tasnim news agency quoted Tehran province's justice chief Gholam Hossein Esmaeili as saying.\n\"The appeals court decided that the initial verdict was true and justified, so it was upheld.\"\nZaghari-Ratcliffe's British husband said on Monday that the jail term she received in September for participating in anti-regime protests in 2009 had been upheld.\nThe family was told the sentence was final as they had already lost an initial appeal in January.\nZaghari-Ratcliffe was arrested at Tehran airport on April 3, 2016, after visiting family in Iran with her British-born daughter Gabriella.\nAt the time of arrest, authorities confiscated her daughter's British passport. The girl has been living with her grandparents in Iran since her mother's arrest.\nIran does not recognise dual-citizenship, meaning that the accused are deprived of diplomatic counsel.\nBritain's foreign ministry said it was \"deeply concerned\" by reports the sentence had been upheld and said Prime Minister Theresa May and Foreign Minister Boris Johnson had raised the case with their Iranian counterparts.\nIran's elite Revolutionary Guards accused Zaghari-Ratcliffe of having taken part in the \"sedition movement\" of widespread protests that followed the 2009 re-election of former hardline president Mahmoud Ahmadinejad, charges which she denies.","url":"https://www.dailymail.co.uk/wires/afp/article-4446350/Iran-confirms-upholding-British-Iranians-5-year-sentence.html"}
