{"authors":["Associated Press"],"date_download":"2018-10-22 23:18:28","date_modify":"2018-10-22 23:18:28","date_publish":"2017-04-26 07:10:22","description":"TEHRAN, Iran (AP) - Iran has confirmed that the final appeal by a British-Iranian woman detained in Iran while on a trip with her toddler daughter of having...","filename":"data/vaneerConsumption/IranconfirmsrejectingappealbyheldBritishIranianwoman.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/07/wire-463601-1493187327-702_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446452_Iran-confirms-rejecting-appeal-held-British-Iranian-woman_1540250308.html","title":"Iran confirms rejecting appeal by held British-Iranian woman","title_page":"Iran confirms rejecting appeal by held British-Iranian woman | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TEHRAN, Iran (AP) - Iran has confirmed that the final appeal by a British-Iranian woman detained in Iran while on a trip with her toddler daughter of having her five-year prison sentence overturned has been denied.\nNazanin Zaghari-Ratcliffe's family earlier said that she learned of the development last weekend.\nThe judiciary's Mizanonline.ir on Wednesday quoted Gholamhossein Esmaili, head of Tehran's justice department, as saying the appeal was rejected and that the \"appeals court approved the verdict by the primary court.\" He didn't elaborate.\nFILE -- In this Jan. 16, 2017 file photo, Richard Ratcliffe, husband of imprisoned charity worker Nazanin Zaghari-Ratcliffe, poses for the media during an Amnesty International led vigil outside the Iranian Embassy in London. The family of Zaghari-Ratcliffe who was detained in Iran while on a trip with her toddler daughter says all efforts to appeal her five-year prison sentence in court have failed. Ratcliffe, who works for the Thomson Reuters Foundation, the charitable arm of the news agency, found out this weekend that her appeal to Iran's supreme court failed. (AP Photo/Alastair Grant, File)\nZaghari-Ratcliffe, who works for the Thomson Reuters Foundation, the charitable arm of the news agency was detained by security forces in Iran in 2016. Later, she was sentenced on security charges.\nIranian media have said Zaghari-Ratcliffe was convicted of plotting the \"soft toppling\" of Iran's government.\nIran doesn't recognize dual nationality.","url":"https://www.dailymail.co.uk/wires/ap/article-4446452/Iran-confirms-rejecting-appeal-held-British-Iranian-woman.html"}
