{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 18:42:05","date_modify":"2018-10-30 18:42:05","date_publish":"2017-03-26 11:51:02","description":"Iran will impose sanctions on 15 US companies for their support for Israel and its “terrorist actions,” state news agency IRNA said Sunday.","filename":"data/vaneerConsumption/IranSanctions15USCompaniesforSupportingIsrael.json","image_url":"https://media.breitbart.com/media/2017/03/ai.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_03_26__1540924925.html","title":"Iran Sanctions 15 U.S. Companies for Supporting Israel","title_page":"Iran Sanctions 15 U.S. Companies for Supporting Israel","title_rss":"NULL","source_domain":"breitbart.com","text":"(AFP) — Iran will impose sanctions on 15 US companies for their support for Israel and its “terrorist actions,” state news agency IRNA said Sunday.\nThe decision, which is largely symbolic because the firms do not do business with Iran, comes two days after the US announced new sanctions on a number of foreign firms accused of collaborating with Iran’s weapons program.\nIran’s sanctions target US firms that provide arms and equipment to Israel “for use against the Palestinians,” IRNA said.\n“All transactions with these firms are forbidden, their assets will be seized and their officials will not be able to obtain a visa,” it added.\nThe firms include United Technologies, ITT Corporation, Magnum Research INC, Military Armament Corporation and Bushmaster Firearms International.\nThe list also included Re/Max Real Estate, which Tehran accuses of “buying and selling homes in settlements located in the occupied territories.”\nTensions have mounted between Tehran and Washington since US President Donald Trump took office in January.\nOn Friday, Washington announced sanctions against foreign firms and individuals over allegedly collaborating with the weapons programmes of Iran and North Korea.\nTrump has repeatedly criticized a July 2015 deal between Iran and world powers that saw the Islamic republic curb its nuclear program in exchange for sanctions relief.\nWashington last month imposed new sanctions on individuals and companies supporting Iran’s ballistic missile programme and on its elite Revolutionary Guards.\nUS lawmakers are now seeking to further increase pressure, proposing a new law that would see Iran’s Revolutionary Guards listed as a terrorist organization.","url":"https://www.breitbart.com/middle-east/2017/03/26/iran-sanctions-15-u-s-companies-supporting-israel/"}
