{"authors":["John Hayward"],"date_download":"2018-10-30 19:44:21","date_modify":"2018-10-30 19:44:21","date_publish":"2015-04-14 20:25:00","description":"The Washington Post's bureau chief Jason Rezaian has been languishing in an Iranian prison cell for nearly nine months, with only the most cursory access to legal counsel.","filename":"data/vaneerConsumption/IranHoldsUSReporterforMonthsBeforeKafkaesqueEspionageTrial.json","image_url":"https://media.breitbart.com/media/2015/04/ap_jason-rezaian_ap-photo1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_14__1540928661.html","title":"Iran Holds US Reporter for Months Before 'Kafkaesque' Espionage Trial","title_page":"Iran Holds US Reporter for Months Before 'Kafkaesque' Espionage Trial","title_rss":"NULL","source_domain":"breitbart.com","text":"The Washington Post’s bureau chief Jason Rezaian has been languishing in an Iranian prison cell for nearly nine months, with only the most cursory access to legal counsel. The newspaper reports today that Rezaian is having significant problems being allowed to speak to his attorney, and will remain in prison until his trial begins for “espionage.”\n“Cursory access to legal counsel” means that Rezaian has only spoken to his lawyer once, “several weeks ago in the judge’s chambers, and they were prohibited from discussing his case or the charges he faces,” according to Washington Post executive editor Martin Baron. Attorney Leila Ahsan was somehow misquoted by the Associated Press as saying she Rezaian could meet with her at any time.\nBaron described Rezaian’s situation as “Kafkaesque.” The Washington Post’s editorial board described their imprisoned reporter as “a pawn in Iran’s domestic power struggle over the nuclear deal,” and called on Iranian president Hassan Rouhani to “demonstrate his ability to control his opposition by arranging Mr. Rezaian’s immediate release.”\nRezaian was arrested by Iranian “security forces” during a raid on his home in Tehran last July, along with his wife and an Iranian-American couple who were friends of theirs. The other couple also happened to be tied to President Rouhani’s family, and Iranian hardliners claim — without having filed any formal charges — that sensitive information was leaked to Rezaian by Rouhani’s nephew.\nIt has the look of a power play in which Rouhani’s family was the real target, but the UK Guardian quoted Iranian opposition sources saying that Rouhani’s nephew was sheltered from arrest by his job in the presidential office. Rezaian’s wife, journalist Yeganeh Salehi, made bail in October, and the other couple arrested with them were released shortly after the raid, but Rezaian has been held almost completely incommunicado for 266 days, without charges.\nNot only is this an outrage against an American citizen, but the editors note it is a violation of Iranian law.\n“Mr. Rezaian’s family and experts on Iran have been saying for some time that the delay and lack of transparency in the legal process likely reflect the fact that prosecutors have no plausible case against him and have been stalling while attempting to concoct one,” the editors write. “The [Iranian state-run media] Fars report lends credence to that view. It claims that the 39-year-old journalist sold ‘economic and industrial information’ to unidentified Americans. It then devolves into a long account of Mr. Rezaian’s relationships with exiled Iranian journalists and human rights activists. It cites as somehow significant the fact that two of them attended the 2011 funeral of Mr. Rezaian’s father — as if that could have had anything to do with espionage.”\nOminously, the Guardian relates the claim of an “influential hardline” member of the Iranian Parliament that Rezaian “had made a full confession on camera.” Coerced false confessions are a common tactic in Iran, obtained through such methods as “weeks of solitary confinement and psychological and physical torture,” in the words of Iranian journalist Omid Memarian, who was subjected to such treatment himself.\nThe hard-liners are still trying to insinuate that Rouhani’s nephew helped the reporter “bypass security barriers and gain access to materials for espionage,” and that Rouhani is pulling strings to protect his family members from arrest. Memarian described all this as a painfully transparent sham to the Guardian, saying that Rezaian has never actually met Rouhani’s nephew, and was permitted to attend exactly one press conference in the presidential office over the past eight years, at which he wasn’t even allowed to ask questions.\nThe Guardian adds that Iran does not recognize dual citizenship, so it is ignoring Rezaian’s American legal status and treating him strictly as a subject of the Iranian regime, to the extent Iranian law matters at all in this farce. The hostage reporter has been given no consular access to the U.S. government, a detail normally handled by the Swiss embassy, since the United States doesn’t have one.\nThe treatment of an American journalist at the hands of the Iranian government, immediately following the Iranian nuclear negotiations in which the Islamic Republic conceded nothing in exchange for being allowed to continue business as usual, highlights precisely why so much of the West continues to impose sanctions on Iran. Iran should be told sanctions relief is an absolute non-starter until all political prisoners like Jason Rezaian are released. That should have been a pre-condition for the beginning of serious negotiations, not just as a gesture of respect to Rezaian’s American citizenship, but to demonstrate that Iran is stable and mature enough to sit at the table.","url":"https://www.breitbart.com/national-security/2015/04/14/iran-holds-us-reporter-for-months-before-kafkaesque-espionage-trial/"}
