{"authors":[],"date_download":"2018-10-30 20:42:16","date_modify":"2018-10-30 20:42:16","date_publish":"2015-04-08 17:29:44","description":"SANAA, Yemen (AP) — Iran dispatched a destroyer and another naval ship to waters off Yemen on Wednesday, raising the stakes amid a Saudi-led air campaign","filename":"data/vaneerConsumption/IransendsnavyvesselstowatersoffYemenraisingstakes.json","image_url":"https://media.breitbart.com/media/2015/04/ap_ap-photo484-e1428605114643.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/news__1540932136.html","title":"Iran sends navy vessels to waters off Yemen, raising stakes","title_page":"Iran sends navy vessels to waters off Yemen, raising stakes - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"SANAA, Yemen (AP) — Iran dispatched a destroyer and another naval ship to waters off Yemen on Wednesday, raising the stakes amid a Saudi-led air campaign targeting Iranian-backed Shiite rebels fighting forces loyal to the country’s embattled president.\nThe Iranian maneuver came as the U.S. deepened its support for the Saudi-led coalition, boosting weapons supplies and intelligence-sharing and carrying out the first U.S. aerial refueling mission of coalition fighter jets.\nThe Iranian warships were sent to the strategic Bab al-Mandab strait as part of an anti-piracy campaign to “safeguard naval routes for vessels in the region,” Iranian Rear Adm. Habibollah Sayyari was quoted as saying by the English-language state broadcaster Press TV.\nSecuring navigation in the narrow strait was a key reason for the Saudi-led air and maritime blockade that began after Yemen’s internationally recognized president, Abed Rabbo Mansour Hadi, fled the country two weeks ago as the rebels closed in on Aden, Yemen’s second-largest city where he was based.\nThe fighting has pitted forces loyal to Hadi against the Shiite rebels, known as Houthis, and allied military units who back ousted President Ali Abdullah Saleh. Critics say Shiite powerhouse Iran backs the Houthis, though both the Islamic Republic and the rebels deny any direct military assistance.\nOn Wednesday, Iranian Parliament Speaker Ali Larijani condemned the Saudi government, accusing it of committing crimes against humanity in Yemen during airstrikes that hit civilian areas. His comments, carried by the official Iran news agency, came as Iranian diplomats worked to erode support among Sunni nations for the air campaign, visiting Pakistan and Turkey, both supporters of the Saudi-led coalition, and Oman, the only Gulf country that has abstained from participating in the military operation.\nPakistan’s parliament is debating a Saudi request to send soldiers to join the Saudi-led coalition.\nSpeaking in Islamabad, Iranian Foreign Minister Mohammad Javad Zarif said the Islamic Republic was ready to facilitate peace talks in Yemen to form a broad-based government and called for a cease-fire to allow for humanitarian assistance.\n“We need to work together to put an end to the crisis in Yemen. The people of Yemen should not suffer from aerial bombardment,” Zarif said.\nIn Washington, meanwhile, Pentagon spokesman Col. Steve Warren told reporters Wednesday that the U.S. had conducted its first military intervention in support of the Arab coalition, the aerial refueling of Emirati F-16s and Saudi F-15s. He did not provide details, except to say the refueling did not take place over Yemeni airspace.\nSpeaking a day earlier in the Saudi capital, Riyadh, U.S. Deputy Secretary of State Antony Blinken blamed the violence in Yemen on the Houthis and forces loyal to Saleh, saying the U.S. was committed to defending Saudi Arabia.\n“We have expedited weapons deliveries, we have increased our intelligence-sharing, and we have established a joint coordination and planning cell in the Saudi operations center,” he said after meeting with Saudi royals and Hadi, the Yemeni president who fled to Saudi Arabia two weeks ago.\nIntelligence-sharing includes making available raw aerial imagery the coalition can use to better strike anti-Hadi forces, said a U.S. defense official who was not authorized to comment publicly.\nWarren said the munitions, mostly “bombs and guidance kits,” were in the pipeline but had not yet been delivered.\nAnalysts said Wednesday’s move by Iran to send warships to Yemeni waters was posturing by the regional powerhouse.\n“The Iranian navy has regularly sent warships to the Gulf of Aden to protect its ships from pirates,” Iranian political analyst Davoud Hermidas Bavand said. “But given the timing, the dispatch of a destroyer is seen as … muscle-flexing by Iran.”\nMustafa al-Ani, a Gulf security expert with closes to the Saudi government, said the Iranian destroyer had been in the area before, as part of an anti-piracy force. But with its dispatch Wednesday, the Iranians were signaling that they have seaborne capabilities, he said.\n“They are sending messages that we are going to be involved sooner or later if the war is going on. We have the capability to do that,” he said.\nIn Abu Dhabi, the capital of the United Arab Emirates, a leading partner in the Saudi-led coalition, Emirati Foreign Minister Sheikh Abdullah bin Zayed Al Nahyan said Iran’s meddling in several Arab countries, including Yemen, left little hope for cooperation. He characterized the conflict as part of a broader pattern of Iranian efforts to expand its influence in the region.\n“It’s not about sectarianism. It’s about Iran believing in exporting the revolution. It’s a part of their regime, a part of their ideology. Until they choose to deal with us country to country, we will have suspicions,” he said.\nThe U.S. says the chaos in Yemen has allowed the local al-Qaida branch, which it considers the world’s most dangerous wing of the group, to make “great gains” on the ground, causing Washington to rethink how it prevents it from launching attacks in the West.\nSpeaking in Tokyo, Defense Secretary Ash Carter said the collapse of the central government in Yemen makes it harder to conduct counterterrorism operations against al-Qaida, which has ambitions to strike Western targets, including the United States.\nOn Wednesday, al-Qaida in Yemen, a staunch rival of the Houthis, posted a video offering a bounty of 44 pounds (20 kilograms) of gold for whoever captures or kills the rebel leader and his prime ally in Yemen, ousted president Saleh.\nAlong with the ongoing military campaign, Arab countries have lobbied members of the U.N. Security Council to adopt a draft resolution that would ban arms shipments to the rebels and their allies. The draft calls on all parties to resolve their differences through dialogue and accelerate U.N.-brokered negotiations on a political transition.\nMeanwhile, the first boats carrying medical aid to Yemen since the March 26 start of the Saudi-led bombing campaign arrived in the southern port city of Aden on Wednesday.\nThe head of Doctors Without Borders in Yemen, Marie-Elisabeth Ingres, said the ship carried some 2.5 tons of supplies from Djibouti for its hospital in Aden.\nThe Geneva-based spokeswoman for the International Committee of the Red Cross, Sitara Jabeen, said another boat carrying five of its staff and five medical workers as well as hundreds of pounds of medicine also made it into the embattled city.\nJabeen said a plane carrying tons of medical supplies has been held back by complicated negotiations for securing a safe landing in the capital, Sanaa.\nThe World Health Organization said Wednesday that at least 643 civilians and combatants have been killed in the fighting since March 19.\n___\nEl Deeb reported from Cairo. Associated Press writers Sagar Meghani in Washington, Ali Akbar Dareini in Tehran, Munir Ahmed in Islamabad, Adam Schreck in Dubai, Frank Jordans in Berlin and Brian Rohan in Cairo contributed to this report.","url":"https://www.breitbart.com/news/iran-sends-navy-vessels-to-waters-off-yemen-raising-stakes/"}
