{"authors":["Edwin Mora"],"date_download":"2018-10-30 19:39:56","date_modify":"2018-10-30 19:39:56","date_publish":"2016-03-23 01:02:43","description":"An Iran-backed Shiite militia, described as one of the deadliest, has threatened to “deal” with American Marines deployed to a new U.S. base in northern Iraq “as forces of occupation.”","filename":"data/vaneerConsumption/IranBackedShiiteMilitiaThreatensUSTroopsInIraq.json","image_url":"https://media.breitbart.com/media/2016/03/Asaib-Ahl-al-Haq-militia-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_22__1540928396.html","title":"Iran-Backed Shiite Militia Threatens U.S. Troops In Iraq","title_page":"Iran-Backed Shiite Militia Threatens U.S. Troops In Iraq","title_rss":"NULL","source_domain":"breitbart.com","text":"An Iran-backed Shiite militia, described as one of the deadliest, has threatened to “deal” with American Marines deployed to a new U.S. base in northern Iraq “as forces of occupation.”\nThe threat came as the Shiite-led Iraqi government expressed concern over the growing influence of Shiite militias in Iraq, collectively known as the “Hashd,” which is Arabic for “mobilization.”\nCiting estimates from the Iraqi government and the Hashd itself, the Associated Press (AP) reports that “the more than 50 Shiite militias in Iraq,” many of them backed by Iran, “have between 60,000 and 140,000 fighters… They are backed by tanks and weapons, and have their own intelligence agency, operations rooms and court of law.”\nAP adds:\nThe larger militias, like Asaib Ahl al-Haq, the Hezbollah Brigades, Badr and the Peace Brigades, have been in place since soon after the 2003 ouster of Saddam Hussein. They are linked to political parties, effectively forming armed branches for politicians. But the ranks of the militias swelled dramatically after [the Islamic State] overran nearly a third of Iraq in the summer of 2014 and Grand Ayatollah Ali al-Sistani, Iraq’s top Shiite cleric, called on able-bodied males to fight IS. At the time, tens of thousands turned out.\nThe Lebanon-based Hezbollah group is one of Iran’s terror proxy with an operational presence in the Western Hemisphere.\nOne of the Iran-backed Shiite militias, known as the Asaib Ahl al-Haq (League of the Righteous) has threatened U.S. Marines deployed to northern Iraq.\n“If the U.S. administration doesn’t withdraw its forces immediately, we will deal with them as forces of occupation,” the militia declared on its TV channel, al-Ahd, reports The Telegraph.\n“The forces of occupation are making a new suspicious attempt to restore their presence in the country under the pretext of fighting their own creation, Daesh,” the group said, using an Arabic name for the Islamic State (ISIS/ISIL).\nIn theory, the U.S. military and the Shiite militia are on the same side against ISIS.\n“The militia is backed by Iran and operates under the supervision of Qassem Suleimani, a Revolutionary Guard general in charge of most of Iran’s expeditionary missions in Syria and across the Middle East,” notes The Telegraph.\nA December 2012 report by the Institute for the Study of War revealed that between 2006 and 2011, the Iran-backed group claimed responsibility for more than 6,000 attacks on U.S. troops.\nThe militia threatened U.S. troops deployed to a new American outpost called Firebase Bell.\nIt “is the first independent U.S. base of its kind in Iraq since the return of American forces to the country in 2014 and is the latest sign of deepening U.S. military involvement in the conflict,” notes Reuters.\nThe “fledgling U.S. base in northern Iraq came under attack again on Monday from Islamic State and even drew a threat from an Iran-backed Shi’ite militia, two days after a U.S. Marine there was killed in a rocket attack,” it adds.\nThe existence of the base was meant to be kept a secret until it was declared operational, Reuters quotes the U.S. military as saying.\nHowever, ISIS learned of the base before the U.S. public did.\nOn March 19, the terrorist group launched an “attack with Katyusha rockets, killing Marine Staff Sergeant Louis Cardin and injuring others in Cardin’s company-sized detachment of less than 200 troops,” reports Reuters.\nIt adds:","url":"https://www.breitbart.com/national-security/2016/03/22/iran-backed-shiite-militia-threatens-u-s-troops-in-iraq/"}
