{"authors":[],"date_download":"2018-10-23 01:00:33","date_modify":"2018-10-23 01:00:33","date_publish":"2016-01-11 11:21:28","description":"Iran has sacked a senior security official over his failure to stop the ransacking of Saudi Arabia's embassy, which led the Sunni-ruled kingdom to sever dipl...","filename":"data/vaneerConsumption/IransacksseniorsecurityofficialoverSaudiembassyattack.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z8i5-56CX32zFKLb7123928b84cddf069-536_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3393745_Iran-sacks-senior-security-official-Saudi-embassy-attack_1540256433.html","title":"Iran sacks senior security official over Saudi embassy attack","title_page":"Iran sacks senior security official over Saudi embassy attack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Iran sacks senior security official over Saudi embassy attack\nIran has sacked a senior security official over his failure to stop the ransacking of Saudi Arabia's embassy, which led the Sunni-ruled kingdom to sever diplomatic relations.\nSafar Ali Baratlou's replacement as security deputy to Tehran's governor general was already under review, but the interior ministry said \"a blind eye could not be turned\" to what happened at the embassy.\nThe mission and the Saudi consulate in Mashhad, Iran's second city, were attacked and torched on January 2 in anger over Riyadh's execution of Nimr al-Nimr, a prominent cleric from the kingdom's Shiite minority.\nIranian protesters set fire to the Saudi Embassy in Tehran during a demonstration against the execution of prominent Shiite Muslim cleric Nimr al-Nimr by Saudi authorities ©Mohammadreza Nadimi (ISNA/AFP/File)\n\"After initial investigations, failures... were confirmed\" in connection with the \"assault on the Saudi embassy\", the ministry said late Sunday, cited by the official IRNA news agency.\n\"Because of the importance of the matter, the interior ministry cannot overlook the smallest failures and factors that led to this incident,\" the statement added of the attack and Baratlou's dismissal.\nRiyadh cut diplomatic ties with Tehran after the incidents, deepening the crisis over the execution.\nOther Arab countries followed suit and severed or reduced relations with Iran, a predominantly Shiite state.\nIranian President Hassan Rouhani strongly condemned the attacks as \"totally unjustifiable\", urging judiciary chief Ayatollah Sadegh Larijani to deal with wrongdoers immediately.\nAbout 50 people have been arrested over the attacks.\n\"Once and for all such assaults on the country's security, an insult to the establishment's authority and position, should be prevented by punishing perpetrators and those who ordered this blatant crime,\" Rouhani said in a letter to Larijani on Wednesday.\nFor his part, Foreign Minister Mohammad Javad Zarif, in an opinion piece in The New York Times, stressed Iran's determination to deal with the attackers.\n\"We took immediate measures to help restore order... We also took disciplinary action against those who failed to protect the embassy,\" wrote Zarif.\nBaratlou's sacking was followed by the replacement of General Hassan Arabsorkhi, head of police special forces in Tehran.","url":"https://www.dailymail.co.uk/wires/afp/article-3393745/Iran-sacks-senior-security-official-Saudi-embassy-attack.html"}
