{"authors":[],"date_download":"2018-10-22 20:48:58","date_modify":"2018-10-22 20:48:58","date_publish":"2014-05-02 14:13:23","description":"While nuclear talks could pave the way for more foreign investment in Iran, experts say it will be a long road before any major deals are inked.","filename":"data/vaneerConsumption/IranNuclearTalksOpenDoortoBusinessButOnlyaCrack.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/416136/140502-iran-economy-cover-11a_06b71e553a3c000ef805fb061a8761fa.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_iran-nuclear-talks-open-door-business-only-crack-n95621_1540241338.html","title":"Iran Nuclear Talks Open Door to Business, But Only a Crack","title_page":"Iran Nuclear Talks Open Door to Business, But Only a Crack","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTEHRAN, Iran - Like many businessmen in Tehran, Reza Dellavari struggles to give his customers what they want.\nCrippling sanctions imposed by the West over Iran’s nuclear program have hit this crystal glass importer’s business, with the 38-year-old sometimes taking a loss on his goods amid fluctuating prices.\nThe prospect of a nuclear deal to lift those sanctions could be grounds for relief. But few people – Dellavari included – are holding their breath or preparing for a quick influx of foreign investment and trade if negotiations for a nuclear deal succeed.\n“I have only seen small and cautious steps being taken,” he said. “Nobody is making big investments in the market yet because they are uncertain about the future.\"\nAs negotiators work to hammer out a permanent deal for Tehran to suspend its nuclear program in exchange for sanctions relief, Iran has been sounding an optimistic note that it is (almost) open for business.","url":"https://www.nbcnews.com/news/world/iran-nuclear-talks-open-door-business-only-crack-n95621"}
