{"authors":["John Hayward"],"date_download":"2018-10-30 20:48:55","date_modify":"2018-10-30 20:48:55","date_publish":"2016-12-27 19:37:15","description":"Donald Trump is doing more to hinder the terror state of Iran before he even takes office than Barack Obama managed in eight long years.","filename":"data/vaneerConsumption/IranianCurrencyHitsRecordLowAfterTrumpElection.json","image_url":"https://media.breitbart.com/media/2016/12/Iranian-rial-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_12_27__1540932535.html","title":"Iranian Currency Hits Record Low After Trump Election","title_page":"Iranian Currency Hits Record Low After Trump Election","title_rss":"NULL","source_domain":"breitbart.com","text":"President-elect Donald Trump is doing more to hinder the terror state of Iran before he even takes office than President Barack Obama managed in eight years.\nReuters reports that the value of Iran’s rial has fallen to a record low against the U.S. dollar, in part due to concerns about Iran’s “ability to attract foreign money after U.S. president-elect Donald Trump takes office.”\nThat is because Trump has talked about ripping up Barack Obama’s nuclear deal, and even if he settles on less drastic measures, the Iranians are already complaining incessantly about the slow pace of foreign investment in their post-sanctions economy.\nAccording to Reuters, “The rial was quoted in the free market at 41,500 to the dollar, weakening from around 41,250 on Sunday and 35,570 in mid-September. Before this month, the record low was about 40,000, hit in late 2012.”\nOther reasons for the rial’s slide are cited, including the strength of the American dollar, Iran’s increased money supply, and the presidential elections looming in Iran next year. Currency traders told Reuters they had not seen any recent surge of demand for American dollars.\nIranian officials went out of their way to deny that Trump apprehension was a major cause of the rial’s slide. One Iranian spokesman quoted by Reuters even tried blaming it on “psychological issues.”\nA comment in the Associated Press report about Iran’s currency woes might provide a reasonable clarification of the “psychological issues” remark: a Tehran resident notes that Iran’s increasing reliance on foreign goods is having a “very negative psychological effect on the people.”\nAnother Iranian man-on-the-street quoted by the AP said, “This is tragic to me. I have lost 20 percent of my purchasing power with this exchange rate because all prices are going up harshly.”\nReading between the lines in the Reuters report, Tehran’s efforts to manipulate currency value are probably a more important factor than Iranian officials want to admit. Radio Free Europe notes that Rouhani has been criticized by “hardline newspapers” on precisely these grounds.\nNot mentioned in the Reuters piece is Iranian President Hassan Rouhani’s push to rename the currency from “rial” to “toman” – a change that would actually change the denomination of the currency, despite the central bank’s protestations to the contrary, because one toman will equal ten rials. This is the kind of tinkering that can easily produce currency-devaluing anxiety, including concern about the costs and disruptions that will be imposed upon banking and business activities. What would happen if Washington announced that $10 bills shall henceforth be known as “dollars”?\nThe Iranian theocracy might have good reason to worry about its economic prospects under President Trump. Inspired by Trump’s tweaking of China over Taiwan, a group of prominent Iranian dissidents wrote Trump a letter last week, urging him to follow through on his promise to renegotiate what they called “that disastrous agreement,” and help the Iranian people “take back their country from the Islamist gang which has been in charge for the last four decades.”","url":"https://www.breitbart.com/national-security/2016/12/27/iranian-currency-record-low-trump-election/"}
