{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 19:40:46","date_modify":"2018-10-30 19:40:46","date_publish":"2016-07-26 09:03:19","description":"A top Iranian general said Iran’s ballistic missile program and the preparedness of Iran’s armed forces are deterring the US.","filename":"data/vaneerConsumption/IranGeneralOurMissileProgramDetersUSMilitaryStrike.json","image_url":"https://media.breitbart.com/media/2015/11/Iran.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_07_26__1540928446.html","title":"Iran General: Our Missile Program Deters U.S. Military Strike","title_page":"Iran General: Our Missile Program Deters U.S. Military Strike","title_rss":"NULL","source_domain":"breitbart.com","text":"The Times of Israel reports: Iran’s ballistic missile program and the preparedness of Iran’s armed forces are deterring the United States from launching a long sought-after military offensive against the Islamic Republic, a top Iranian general said Sunday, according to state-run media.\n“Do you think that the US isn’t interested in attacking the Islamic Republic of Iran? (of course it is) But when it sees the Iranian soldiers whose fingers are on the trigger and hears the roaring of our missiles and helicopters, this acts as a deterrence,” Brigadier General Ahmad Reza Pourdastan told reporters in Tehran.\nDescribing the US as Iran’s main enemy, Pourdastan, the Iranian army’s ground forces commander, said Tehran faced “new forms of threats from proxy mercenaries acting on behalf of the imperial powers in the region.”\nLast week, FOX News reported that Iran had conducted its fourth ballistic missile test since it signed the nuclear deal with world powers last year.\nTehran’s new ballistic missile, made using North Korean technology, exploded shortly after launch outside the city of Isfahan overnight Tuesday, intelligence officials told the media outlet.\nRead more here.","url":"https://www.breitbart.com/middle-east/2016/07/26/iran-general-missile-program-deters-u-s-military-strike/"}
