{"authors":["John Hayward"],"date_download":"2018-10-30 20:49:17","date_modify":"2018-10-30 20:49:17","date_publish":"2016-04-29 15:26:09","description":"Reuters took a look at the rocky relationship between Russia and Iran this week, noting that a stronger alliance always seems to fall apart.","filename":"data/vaneerConsumption/IranRussiaAllianceShakyBecauseRouhaniandPutinDontGetAlong.json","image_url":"https://media.breitbart.com/media/2016/03/putin-rouhani.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_04_29__1540932557.html","title":"Iran-Russia Alliance Shaky Because 'Rouhani and Putin Don't Get Along'","title_page":"Iran-Russia Alliance Shaky Because 'Rouhani and Putin Don't Get Along'","title_rss":"NULL","source_domain":"breitbart.com","text":"Reuters took a long look at the rocky relationship between Russia and Iran this week, noting that a stronger alliance between the two nations always seems to fall apart for one reason or another. For example, one Iranian diplomat described personality clashes between the Iranian and Russian leaders by saying, “Rouhani and Putin don’t get along that great.”\nReuters describes the Russia-Iran relationship as part of the ongoing power struggle in Iran between the “moderates” of President Hassan Rouhani, and the “hardliners” behind Supreme Leader Ayatollah Ali Khamenei.\n“The Iranian establishment is divided, with President Hassan Rouhani’s faction more interested in trading with the West than struggling against it, even if many U.S. policies are still condemned,” Reuters writes.\nRouhani was educated in the West, and his faction is interested in European money. As that Iranian diplomat mentioned, he and Russian President Vladimir Putin appear to actively dislike each other.\nThere are also some hard feelings among Iranians toward Russia, dating back to the First and Second World Wars. As a spokesman for former President Mohammad Khatami said, “Russians have always used us as a tool in their foreign policy. They never stayed committed to their alliance with any country.”\nKhamenei, on the other hand, has a “Look East” policy that calls for stronger ties with Russia and diminished Western influence in the Middle East. Iranian-Russian cooperation on the Syrian civil war seems to be paying off.\nRussia is lending Tehran $5 billion for infrastructure projects, and looking at some big oil supply deals with Iran. Iran is a big customer for Russian weapons, and would like to make some even bigger purchases, if the U.N. Security Council permits it.\nBut Russia seems reluctant to take its relationship with Iran any further, perhaps in part because Moscow is weighing the diplomatic cost of closer ties with Iran. There are limits to how much the Russians wish to antagonize the United States, Israel, and Saudi Arabia.\nPressTV reported that Russia and Iran have drafted a “military cooperation roadmap,” with Iranian Brigadier General Hossein Dehqan suggesting the Iranian nuclear deal means “bright horizons can be drawn for strategic cooperation between the two countries in various fields.”\nThat could be interpreted as a calculation that if Western resistance to Iran is fading, the diplomatic cost of a stronger alliance between Russia and Iran would be lower for Moscow. However, at the same summit meeting, Russian Defense Minister Sergei Shoigu talked about cooperating with Iran primarily to battle terrorism, which would seem to place a limit on just how close their relationship will be.\n(Since Russia and Iran both insist that their intervention in the Syrian civil war is all about “fighting terrorism,” Shoigu’s comments could be taken to mean the Iranian-Russian alliance is already as close as it is going to get, give or take a few big surface-to-air missile sales.)\nRussia Beyond the Headlines (RBTH) points out a big reason why the rhetoric between Russia and Iran is growing warmer than their actual diplomatic relationship: Russia’s pique at Iran for refusing to cap oil production.\nDescribing Iran’s oil minister as “intransigent” on the issue, RBTH says:\nThe preliminary deal, reached with a lot of sweat and pain by Russia, Saudi Arabia, Qatar, and Venezuela, was supposed to be signed in Doha, but Iran’s opposition led Saudi Arabia to torpedo the move, which might have been the first step to set up a more effective alliance to regulate the global oil market, sort of an OPEC-2.\nRBTH also dings Iran for interfering with some Russian infrastructure construction deals in Bandar Abbas, and for being insufficiently grateful for Moscow’s help in the nuclear negotiations. There is even a bit of tension over the seemingly successful Syrian project in this analysis. Iran is much more invested in the survival of Bashar Assad’s Alawite regime than Russia, which is primarily interested in protecting its assets in the country and making a point about the importance of respecting “legitimate” governments, even when they are run by characters like Assad.","url":"https://www.breitbart.com/national-security/2016/04/29/iran-russia-alliance-shaky-because-rouhani-and-putin-dont-get-along/"}
