{"authors":["Associated Press"],"date_download":"2018-10-23 04:01:07","date_modify":"2018-10-23 04:01:07","date_publish":"2016-01-28 19:51:53","description":"TEHRAN, Iran (AP) — Several European airlines aim to resume their flights to Iran following a landmark nuclear deal between Tehran and world powers, the stat...","filename":"data/vaneerConsumption/IranEuropeanairlinessettoresumeflightstoTehran.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420436_Iran-European-airlines-set-resume-flights-Tehran_1540267267.html","title":"Iran: European airlines set to resume flights to Tehran","title_page":"Iran: European airlines set to resume flights to Tehran | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Iran: European airlines set to resume flights to Tehran\nTEHRAN, Iran (AP) — Several European airlines aim to resume their flights to Iran following a landmark nuclear deal between Tehran and world powers, the state-owned IRAN daily reported on Thursday.\nThe newspaper quoted Mohammad Khodakarami, deputy head of Iran's civil aviation authority, as saying British Airways officials visited Tehran on Tuesday to discuss resumption of flights. He did not elaborate.\nKhodakarami also said both Air France and Dutch flagship KLM have already expressed their readiness to resume flights to Tehran.\nAir France said last month it would resume flights to Tehran for the first time in more than seven years starting in April.\nA KLM spokesman said the carrier always looks for opportunities for new destinations but has not yet make a decision about resuming flights that were suspended in 2013.\n\"At this moment there are no concrete plans to open Tehran. KLM follows the current situation concerning the lifting of sanctions against Iran closely,\" spokesman Joost Ruempol said.\nBA also has not announced any firm plans to return to Iran, though Willie Walsh, the chief executive of its parent International Airlines Group, reportedly told a recent conference the airline is interested in flying to Tehran soon.\nEuropean carriers stopped their flights to Iran after the West imposed sanctions on Iran over its nuclear ambitions. Currently Iran's national carrier, Iran Air, has three weekly flights to London as well as two weekly flights each to Paris and Amsterdam.\nEarlier this week, Iran said it is also considering direct flights to the United States. Direct flights stopped between the two countries more than three decades ago. Iran and the United States severed air links when Washington broke relations in 1979 after Iranian militants stormed the U.S. Embassy in Tehran and held the occupants hostage.\nAbout 1 million Iranians live in the United States, mostly in California. Thousands fly to Iran every year, often changing planes in London, Amsterdam, Frankfurt, Istanbul and Dubai.\nIran also plans to renew its aging passenger fleet. On Thursday it signed a deal to buy 118 aircraft from Airbus, valued at 22.8 billion euros ($25 billion). Tehran has also expressed interest in buying scores of new airplanes from American aircraft manufacturer Boeing.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3420436/Iran-European-airlines-set-resume-flights-Tehran.html"}
