{"authors":["John Hayward"],"date_download":"2018-10-30 20:49:09","date_modify":"2018-10-30 20:49:09","date_publish":"2016-10-11 04:26:44","description":"Iran's President Hassan Rouhani met with China's Vice President Li Yuanchao in Bangkok on Sunday for a reportedly successful meeting.","filename":"data/vaneerConsumption/IransRouhaniinBeijingtoFurtherEnhanceCooperationwithChina.json","image_url":"https://media.breitbart.com/media/2016/01/GettyImages-506375180.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_10_10__1540932549.html","title":"Iran's Rouhani in Beijing to 'Further Enhance Cooperation' with China","title_page":"Iran's Rouhani in Beijing to 'Further Enhance Cooperation' with China","title_rss":"NULL","source_domain":"breitbart.com","text":"Iran’s President Hassan Rouhani met with Chinese Vice President Li Yuanchao in Bangkok on Sunday, and according to China’s state-run Xinhua press agency, the meeting was a big success.\nIran wants to further enhance cooperation with China in connectivity, finance, energy, education and addressing regional problems by mapping out a 25-year cooperation agreement more quickly, said Rouhani. Iran and China agreed to upgrade bilateral relations to “Comprehensive Strategic Partnership” and also to “put consultations and discussions aimed at concluding a bilateral 25-year Comprehensive Cooperation Agreement ” during Chinese President Xi Jinping’s visit to Iran in January, according to the joint statement between China and Iran on the Comprehensive Strategic Partnership. China is willing to work with Iran in implementing the consensus reached by the two presidents and to deepen the strategic partnership, said Li, adding that President Xi’s visit to Iran made a strategic plan for the development of bilateral relations, which are now facing new opportunities for further development. Li also said he hopes there would be more frequent contact between high-ranking officials of two countries, deeper mutual political trust and more cooperation under the Belt and Road Initiative.\nThe “Belt and Road Initiative” is more formally known as “One Belt, One Road,” and more informally referred to as “the new Silk Road” — China’s attempt to rebuild the legendary Silk Road trade through Asia and Europe.\nThe Wall Street Journal notes that China — along with other Asian powers like India, Japan, and South Korea — has been an enthusiastic customer for Iranian oil since sanctions were lifted. Asian sales have accounted for 70 percent of Iran’s post-sanctions oil exports.\n“China has the best position because, in the past five years, they have been with Iran. They have the whole Iranian market in their hand,” said Mehdi Fakheri, Iranian consul general in Hong Kong and Macau. China and India are interested in making large investments in the Iranian oil industry.\n“We welcome Chinese investments in our oil and energy sectors, along a belief that scientific and cultural relations would also provide opportunities for strengthening ties,” Rouhani said after meeting with China’s vice-president, as reported by Mehr News.\nChinese President Xi Jinping visited Tehran in January, where he announced a deal that would increase trade between the two countries to $600 billion over the next ten years.","url":"https://www.breitbart.com/national-security/2016/10/10/irans-rouhani-visits-china-cooperation/"}
