{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:46:56","date_modify":"2018-10-30 19:46:56","date_publish":"2015-02-25 20:30:59","description":"Iran conducted drills in the Strait of Hormuz on Wednesday in which its military tested hundreds of missiles, Iranian and Arabic media have reported. Two ballistic missiles were also fired at an Iranian-built full-size replica of a U.S. aircraft carrier, which resulted in its destruction, reports stated. |","filename":"data/vaneerConsumption/IranDestroysMockUSAircraftCarrierAsExiledOppositionGroupRevealsNewNukeSite.json","image_url":"https://media.breitbart.com/media/2015/02/aircraft-carrier-AP-e1424896250710.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_25__1540928816.html","title":"Iran Destroys Mock U.S. Aircraft Carrier As Exiled Opposition Group Reveals New Nuke Site","title_page":"Iran Destroys Mock U.S. Aircraft Carrier As Exiled Opposition Group Reveals New Nuke Site | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Iran conducted drills in the Strait of Hormuz on Wednesday in which its military tested hundreds of missiles, Iranian and Arabic media have reported. Two ballistic missiles were also fired at an Iranian-built full-size replica of a U.S. aircraft carrier, which resulted in its destruction, reports stated.\nSenior Iranian officials were on hand to attend the military drills, including Iranian Revolutionary Guards Corps (IRGC) commander General Ali Jafari and Parliament Speaker Ali Larijani.\nAn Iranian Navy commander said that they built “a life-size replica of an American aircraft carrier, 202 meters long, in order to destroy it during military maneuvers.”\n“The Americans, and the entire world, know that the American Navy is one of our targets, and it will take us 50 seconds to destroy every US warship,” the commander claimed.\nThe military exercises were titled, “The Great Prophet,” the Jerusalem Post reports. The Iranian military reportedly tested surface-to-surface missiles with a range of almost 200 miles and surface-to-sea missiles that can purportedly avoid detection.\nSeparately, an exiled Iranian opposition group now claims that the regime is building up a secret nuclear site used for uranium enrichment and advanced centrifuge research in northeast Tehran.\nThe National Council of Resistance of Iran (NCRI) said on Tuesday that the secret nuclear facility had been a well-kept secret for years. Two NCRI officials held a press conference at the National Press Club in Washington, D.C., in which they showed satellite imagery of what is purportedly the nuclear site.\nAccording to NCRI, the facility, called Lavizan-3, is “buried deep underground in tunnels and underground facilities” and has “radiation-proof doors” to avoid detection by UN inspectors.\n“There is no way in the world you can assure Tehran is not developing nuclear weapons, if you can’t inspect those sites,” added Alireza Jafarzadeh of NCRI. “Especially if you are talking about a regime that has over two decades of a track record of lying and cheating and deceiving the whole world,” he added.","url":"https://www.breitbart.com/national-security/2015/02/25/iran-destroys-mock-u-s-aircraft-carrier-as-exiled-opposition-group-reveals-new-nuke-site/"}
