{"authors":["John Hayward"],"date_download":"2018-10-30 20:47:52","date_modify":"2018-10-30 20:47:52","date_publish":"2015-05-27 00:58:39","description":"The \"trial\" of Jason Rezaian — an American journalist brazenly held hostage by those trustworthy statesmen in Iran — has gotten under way, and it is exactly the kind of outrageous totalitarian farce you would expect.","filename":"data/vaneerConsumption/IranBeginsSecretTrialofAmericanHostageGivesHim90MinutestoMeetWithRandomDefenseLawyer.json","image_url":"https://media.breitbart.com/media/2015/05/Jason-Rezaian-YouTube-Washington-Post.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_05_26__1540932472.html","title":"Iran Begins Secret Trial of American Hostage, Gives Him 90 Minutes to Meet With Random Defense Lawyer","title_page":"Iran Begins Secret Trial of American Hostage, Gives Him 90 Minutes to Meet With Random Defense Lawyer | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The “trial” of Jason Rezaian — an American journalist brazenly held hostage by those trustworthy statesmen in Iran — has gotten under way, and it is exactly the kind of outrageous totalitarian farce you would expect.\nAfter holding Rezaian in a dungeon for nine months without formal charges, and only cursory contact with legal counsel, the Iranian government threw him into a secret courtroom, totally cut off from his family, government, and employers at the Washington Post. The presiding judge is “known for his tough sentencing” in “politically sensitive cases.”\nThe lawyer with whom Rezaian had only one meeting during the last 300-odd days is gone, replaced with an attorney randomly chosen by the court, who Rezaian got to meet with for a grand total of 90 minutes before the hearings began. As reported by Fox News and the Associated Press, Iran ignored visa requests from the Post for one of its senior editors to journey to Iran and meet with the captive reporter.\n“No evidence has ever been produced by prosecutors or the court to support these absurd charges,” said Washington Post executive editor Martin Baron. “There is no justice in this system, not an ounce of it, and yet the fate of a good, innocent man hangs in the balance. Iran is making a statement about its values in its disgraceful treatment of our colleague, and it can only horrify the world community.”\nThe Obama Administration has done nothing in regards to the case, despite urging from Republican Senators Marco Rubio and Mark Kirk to demand the journalist’s release as a condition for further progress on the nuclear talks.\nAs the Washington Post editorial board noted, Rezaian was born in California and has dual U.S.-Iranian citizenship but is being treated exclusively as an Iranian citizen by the court. “The Post reporter appears to be a pawn in Iran’s internal power struggles or in the leadership’s attempt to show that a prospective nuclear accord will not alter its enmity toward the United States, or perhaps both,” his editors write.\nThe Post continues:\nAs we have observed before, the treatment of Mr. Rezaian raises disturbing questions about a regime that Mr. Obama is counting on to implement a complex and multifaceted accord limiting its nuclear activities. If a U.S. citizen recognized by senior Iranian officials as a reputable journalist can be abruptly imprisoned on spurious charges, what treatment will be accorded the international inspectors who have to determine whether Iran is respecting its commitments? If [Iranian Foreign Minister Mohammad Javad] Zarif and President Hassan Rouhani either countenance or cannot stop such blatantly provocative behavior by the Iranian intelligence services and judiciary, how can they be expected to overcome the entrenched resistance to limiting Iran’s uranium enrichment?\n“Placing Mr. Rezaian on trial just 35 days before the deadline for completing the accord looks like yet another attempt at intimidation – one that relies on the blatant abuse of the human rights of an American journalist,” the WaPo editors conclude. “If Mr. Khamenei were serious about defusing Iran’s confrontation with the West, he would instead release Mr. Rezaian – and offer him the apology he deserves.”\nKhamenei smells capitulation in the White House and will milk it for all he can. If Jason Rezaian is lucky, he will be released after some courtroom theater as a show of Iranian “generosity,” and President Obama will be expected to bubble over with gratitude — expectations one can expect he will gladly meet, because Iran knows he cannot possibly walk away from this “nuclear deal,” no matter what they say or do.","url":"https://www.breitbart.com/national-security/2015/05/26/iran-begins-secret-trial-of-american-hostage-gives-him-90-minutes-to-meet-with-random-defense-lawyer/"}
