{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 20:45:05","date_modify":"2018-10-30 20:45:05","date_publish":"2018-07-09 13:02:06","description":"Iran's OPEC representative reportedly pled for President Trump to cease tweeting because his doing so has raised oil prices by at least $10.","filename":"data/vaneerConsumption/IranBegsTrumptoStopIndecentTweetingAboutOilPrices.json","image_url":"https://media.breitbart.com/media/2018/06/wi/afp/26/ab2669_twitter-is-online-platforms-pressure-do-safeguard-spread-misinformation-e1530136062851.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_07_09__1540932305.html","title":"Iran Begs Trump to Stop 'Indecent' Tweeting About Oil Prices","title_page":"'Please Stop': Iran Begs Trump to Stop 'Indecent' Tweeting About Oil Prices","title_rss":"NULL","source_domain":"breitbart.com","text":"Iran’s representative to the Organization of the Petroleum Exporting Countries (OPEC), Hossein Kazempour Ardebili, reportedly pled on Thursday for President Donald Trump to “please stop” tweeting because his doing so has raised oil prices by at least $10.\nAccording to the Associated Press, Iran’s Oil Ministry website quoted Ardebili telling Trump, “With your frequent and indecent tweets oil prices have gone up 10 dollars.”\n“Your tweets have driven the prices up by at least $10 per barrel,” Ardebili reportedly said. “Pls stop it, otherwise it will go even higher!”\n“Your Excellency, there are not that much oil [sic] available to respond to your orders; you are hammering on good guys in OPEC, which you are claiming,” Ardebili pleaded. “You are actually discrediting them and undermining their sovereignty, we expect you to be more polite.”\nHe closed his statements by suggesting Trump join Iranian President Hassan Rouhani, the Iranian delegation, and Britain, China, France, Germany, and Russia – the five remaining nations that are signatories to the nuclear deal – in Vienna, where discussions will take place to see how Iran can rescue the Joint Comprehensive Plan of Action (JCPOA). “Mr. President, we may have some differences with our brothers but have learned how to live together; You want to escalate the situation, I advise you to rush to join Vienna talks of tomorrow?!”\nBloomberg reported:\nOil is trading near $78 a barrel, holding most of a rally that saw prices rise to the highest level in more than three years after OPEC’s output increase plan was overshadowed by supply disruptions in Libya, Canada and Venezuela. While OPEC is facing mounting pressure from Trump to do more, America’s sanctions on group members Iran and Venezuela are adding uncertainties, just as U.S. tariffs on Chinese goods kick in on Friday.\nIran has blamed rising oil and the country’s economic woes on sanctions the United States reimposed on the Islamic Republic and Venezuela. In response to this, members of OPEC reportedly agreed to produce an additional one million barrels of crude oil on a daily basis to keep the prices stable on the market.\nIn response to this, Trump tweeted last week that Saudi Arabia “has agreed” to increase oil production, “maybe up to 2,000,000 barrels”:\nJust spoke to King Salman of Saudi Arabia and explained to him that, because of the turmoil & disfunction in Iran and Venezuela, I am asking that Saudi Arabia increase oil production, maybe up to 2,000,000 barrels, to make up the difference…Prices to high! He has agreed! — Donald J. Trump (@realDonaldTrump) June 30, 2018\nThen, on Wednesday, Trump tweeted the “OPEC Monopoly” is “doing little to help” rising gas prices, adding, “If anything, they are driving prices higher”:\nThe OPEC Monopoly must remember that gas prices are up & they are doing little to help. If anything, they are driving prices higher as the United States defends many of their members for very little $’s. This must be a two way street. REDUCE PRICING NOW! — Donald J. Trump (@realDonaldTrump) July 4, 2018\nTrump also threatened that the United States will sanction any nations that fail to stop importing Iranian oil by November 4.\nOn Wednesday, Iran’s deputy commander of the Sarollah Revolutionary Guards responded to Trump and said Iran would close the Strait of Hormuz at the sign of any attempts to thwart Iran’s oil exports.\nAdelle Nazarian is a politics and national security reporter for Breitbart News. Follow her on Facebook and Twitter.","url":"https://www.breitbart.com/national-security/2018/07/09/please-stop-iran-begs-trump-stop-tweeting-oil-prices/"}
