{"authors":["John Hayward"],"date_download":"2018-10-30 19:43:30","date_modify":"2018-10-30 19:43:30","date_publish":"2015-07-14 14:21:21","description":"Fireworks exploded over Iran as news emerged that President Obama's \"negotiating team\" had capitulated to nearly all of Iran's demands.","filename":"data/vaneerConsumption/IranCelebratesVictoryoverObamainNuclearCapitulation.json","image_url":"https://media.breitbart.com/media/2015/07/GettyImages-480181170.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_14__1540928610.html","title":"Iran Celebrates Victory over Obama in Nuclear Capitulation","title_page":"Iran Celebrates Victory over Obama in Nuclear Capitulation | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Fireworks exploded in the sky over Iran as word circled the globe that President Barack Obama’s “negotiating team” had capitulated to nearly all of Iran’s demands – lifting sanctions and arms embargos, and putting Iran on a path to nuclear weapons even sooner than the paltry ten years the President originally promised.\nIt is a stunning victory for the Iranians, who will gain both the prestige and nuclear arsenal of a superpower from the deal, and President Hassan Rouhani was not shy about celebrating it, with his comments translated into a string of tweets:\nMany people prayed for the #negotiating team during the holy month of Ramadan; I’m privileged to announce their prayers have been answered — Hassan Rouhani (@HassanRouhani) July 14, 2015\nI’m pleased to announce that after 23 months of negotiations this admin managed to reach a new point, a new chapter in history #IranDeal. — Hassan Rouhani (@HassanRouhani) July 14, 2015\nThe steadfastness, resistance, patience, perseverance & support of the great nation of #Iran were indeed key to this victory. #IranDeal — Hassan Rouhani (@HassanRouhani) July 14, 2015\nI thank the Iranian diplomats, lawyers & nuclear scientists whose extraordinary efforts have brought about this victory. #IranDeal — Hassan Rouhani (@HassanRouhani) July 14, 2015\nI thank all those who played critical role to reach this historic day, esp the great nation of #Iran for enduring these unjust pressures. — Hassan Rouhani (@HassanRouhani) July 14, 2015\nUpon #IranDeal implementation all sanctions will be lifted–not suspended. Otherwise,there was no need for 18-day round-the-clock #IranTalks — Hassan Rouhani (@HassanRouhani) July 14, 2015\nI thank the SL @khamenei_ir for shouldering this heavy burden and for his guidance & prudence which led us through these difficult days. — Hassan Rouhani (@HassanRouhani) July 14, 2015\nThat last is a reference to Supreme Leader Ali Khamenei–who just a few days ago declared Iran was still dedicated to fighting “global arrogance,” which the United States is “the true embodiment of.”\nRouhani wasted no time building on the prestige Obama gave him, issuing a combination of promises and dire warnings to Iran’s potential allies and regional enemies:\nTo our neighbours: Do not be deceived by the propaganda of the warmongering Zionist regime. #Iran & its power will translate into your power — Hassan Rouhani (@HassanRouhani) July 14, 2015\nRegion’s security is our security. Region’s stability is our stability. Likewise, our progress is that of the region & will only benefit it. — Hassan Rouhani (@HassanRouhani) July 14, 2015\nOf course, he wrapped it up with the standard ritual declaration that Iran does not want the nuclear weapons it will be detonating in eight years or less:\nWe do not seek #WMDs, nor exerting pressure on regional states. We call for greater brotherhood, unity and further expansion of ties. — Hassan Rouhani (@HassanRouhani) July 14, 2015\nAlso celebrating: Iran’s client in Syria, Bashar al-Assad:\nRT @AFP: #BREAKING Syria’s Assad congratulates key ally Iran on nuclear deal — Greg Brophy (@SenatorBrophy) July 14, 2015\nCNBC describes Rouhani as “triumphant,” although its analysis mostly focuses on how the deal, and the anticipated rebound of the sanctions-hobbled Iranian economy, will give him leverage over domestic opposition. The Obama administration is betting heavily on Iran “moderating” as its economy flourishes–an analysis that pointedly ignores what the theocracy actually does with most of its spare cash, such as sponsor terrorist operations across the world. It is easy to find the sort of statement from Iranian leaders that led Obama and his foreign policy brain trust to conclude that, despite their apocalyptic rhetoric, military aggression, and support for terrorism, the Iranians are actually a materialistic secular government primarily interested in the fruits of sanctions-free prosperity for their people–if not from the goodness of the regime’s heart, then because they want to keep the people content so they can remain in power. But all of those statements come with the ominous little stingers Obama has convinced himself the Iranians don’t really mean. For example, CNBC quotes Rouhani telling a rally last month, “We want the nation to be happy and productive, to have a bright economy and social welfare–and to have (uranium) centrifuges, too.” In the end, Obama obliged him.\nAnd AFP says Supreme Leader Khamenei kept hardliners on board throughout the negotiating process with promises that it would end pretty much the way it did (emphasis added):\nRather than representing submission to the West, the agreement is likely to consolidate Khamenei’s rule, according to Davoud Hermidas Bavand, a veteran political analyst at Tehran University. And whatever the evident contradictions of a pact with the “the great Satan,” the core of Iran’s nuclear programme has been preserved. The domestic imperative to end the deadlock was ultimately more important, Bavand said. “Ordinary Iranians felt involved in the negotiations and the leadership recognised that,” he said. “Economic sanctions had a huge impact on the population, more than on the regime.” The accord may also allow Khamenei to claim victory over Iran’s regional foes, who accuse Tehran of malign military intent and a regional power grab. “It probably amounts to a marginal win over Israel, Saudi Arabia and even Turkey,” said Bavand, describing the nuclear deal as a step forward for a war-wracked Middle East. “In coming years it may well be seen as the measure that reduced regional tensions.”\nIran created those tensions, then used them as leverage to get what it (and Russia!) wanted from the United States and Europe. That’s called victory in any handbook of military strategy.","url":"https://www.breitbart.com/politics/2015/07/14/iran-celebrates-victory-over-obama-in-nuclear-capitulation/"}
