{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:31:30","date_modify":"2018-10-30 20:31:30","date_publish":"2017-03-20 13:13:37","description":"Six armed Iraqi Kurdish parties have reportedly joined forces in advance of expected protests and clashes on Iranian soil on March 21.","filename":"data/vaneerConsumption/IraqiKurdishAlliancePreparesforGuerrillaFightAgainstIranianRegime.json","image_url":"https://media.breitbart.com/media/2017/01/iraqi-kurdish-peshmerga-hamed-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_03_20__1540931490.html","title":"Iraqi Kurdish Alliance Prepares for ‘Guerrilla Fight’ Against Iranian Regime","title_page":"Iraqi Kurdish Alliance Prepares for ‘Guerrilla Fight’ Against Iranian Regime","title_rss":"NULL","source_domain":"breitbart.com","text":"Six armed Iraqi Kurdish parties have reportedly joined forces in advance of expected protests on Iranian soil on March 21, the Kurdish New Year known as Newroz.\nThe Iraqi Kurdish parties expect to engage in armed clashes with the Iran’s hard-line Islamic Revolutionary Guard Corps (IRGC) in the Islamic Republic’s Kurdish-majority province of Kermanshah, reports Ryan Mauro, a national security analyst at the Clarion Project and professor of counterterrorism at Liberty University.\n“Both the Iranian regime’s Revolutionary Guards Corps and an Iranian Kurdish militia have held military exercises in preparation for expected conflict,” notes Mauro.\nSpecifically, the expert quotes an unnamed official from the Democratic Party of Iranian Kurdistan (PDKI) as saying they are preparing for a “full guerilla fight.”\nThe PDKI, described by Rudaw as “historically considered the most formidable Kurdish military organization opposing the Islamic Republic in Tehran,” has reportedly deployed an estimated 2,000 fighter to the border are between the northern Iraq’s autonomous Iraqi Kurdistan region and Shiite Iran.\nLast year, the Iranian Kurdistan party declared an end to a 20-year ceasefire with Iran, explicitly warning that it was sending its Peshmerga troops into Iranian Kurdistan.\n“There always have been activities in Kurdistan for celebrating Newroz and these activities always are opportunities for people to express their resistance against the fact that they have been denied of their basic rights,” explained Arash Saleh, the U.S. representative of the PDKI.\n“Using symbols, songs and gatherings, youth in Newroz have always shown their anger and resentment toward the lasting oppression of Kurds in Iran,” added the representative.\nIn October 2016, Mustafa Hijri, the party’s leader, said that the PDKI was no only fighting for Iranian Kurds, but also to topple the current theocratic Iranian regime with a secular democracy that serves all of the country’s inhabitants.\nHijir congratulated Donald Trump for his election victory in November 2016, adding, “The power of this regime [Iran] has to be curtailed in the region and tough pressure must be placed on it,” according to Rudaw.\n“Iran has unprecedentedly expanded its authority and identity in the Middle East to cause chaos, destruction, and conflict,” added the PDKI leader.\nIranian Supreme Leader Ayatollah Khamenei has accused the Islamic Republic’s regional foe Saudi Arabia of arming Kurdish opposition forces.\n“Kurds are an oppressed minority in Iran, representing about 10 percent of the population (between 8 and 10 million people),” notes Mauro. “According to the U.N., almost half of the political prisoners in Iran are Kurdish and about one-fifth of the executed prisoners last year were Kurdish.”\nEarly this year, Rudaw reported that fighters from the Popular Mobilization Units (PMU), an Iraqi state-sponsored coalition of mostly Iran-allied Shiite militias, have established a presence in northern Iraq’s Kurdish region, to the ire of the residents there.\nNorthern Iraq’s autonomous Kurdistan Region borders Iran. The Iranian side is unofficially known as Eastern Kurdistan, home to the country’s Kurdish-majority provinces.\nIran has long been opposed to Kurdish independence in Iraq, fearing it will embolden the Kurds within its border to do the same.\nThe Islamic Republic has accused Kurds on its soil of using Iraq’s Kurdistan region to launch attacks against the regime.","url":"https://www.breitbart.com/national-security/2017/03/20/report-iraqi-kurdish-alliance-prepares-for-full-guerilla-fight-against-iranian-regime/"}
