{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:12:25","date_modify":"2018-10-30 20:12:25","date_publish":"2016-11-03 02:01:12","description":"Baghdad has vowed to dismantle predominantly Sunni Turkey following Ankara’s military build along the Iraqi border.","filename":"data/vaneerConsumption/IraqThreatenstoDismantleTurkeyifTroopsDoNotLeave.json","image_url":"https://media.breitbart.com/media/2016/11/iraqi-tribesman-against-turkey-erdogan-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_11_02__1540930345.html","title":"Iraq Threatens to 'Dismantle' Turkey if Troops Do Not Leave","title_page":"Iraq Threatens to 'Dismantle' Turkey if Troops Do Not Leave","title_rss":"NULL","source_domain":"breitbart.com","text":"The Shiite-led government in Baghdad has vowed to dismantle predominantly Sunni Turkey following Ankara’s military build along the Iraqi border.\nAlthough Iraqi Prime Minister Haider al-Abadi has said that his country does not want war or confrontation, noting that the “door of diplomacy” remains open, he added, “If they enter, we are ready to face them… Any invasion of Iraq would lead to the dismantling of Turkey.”\nTurkish Deputy Prime Minister Numan Kurtulmus argues that the deployment is a precaution, not a threat, and urged Baghdad to lower tensions following Abadi’s warnings.\n“I regard Abadi’s words as overstepping the mark. Abadi must make statements lowering the tension… We are obliged to take measures to guard against threats from across Turkey’s border,” the deputy PM told the broadcaster NTV. “It is more of a precaution than a threat.”\nTurkey already has a military presence in Iraq. Baghdad has repeatedly called on Turkey to withdraw from Iraq, but Ankara has refused.\nOn Tuesday, Turkey announced that it had sent a convoy of 30 tanks and other heavy artillery to Turkey’s southeastern town of Silopi, located near the border with Iraq and Syria, a move that coincides with the ongoing U.S.-backed Iraqi offensive to retake Mosul from the Islamic State (ISIS/ISIL).\nDespite objections by the United States and Iraq, Turkey insists it will participate in the liberation of Sunni-majority Mosul.\nTens of thousands of U.S.-backed Iraqi Security Forces, Sunni tribesmen, Kurdish Peshmerga troops, and Shiite militiamen, many allied with Iran, are fighting in the operation to seize and secure Mosul, Iraq’s second-largest city and ISIS’s last major stronghold in Iraq.\n“Largely Sunni Muslim Turkey fears that Iraqi Shiite militias involved in a related offensive west of Mosul could trigger sectarian unrest, and is also concerned that Kurdish PKK [Kurdistan Worker’s Party] militants are trying to establish a foothold nearby,” notes Reuters.\nFor nearly three decades, PKK militants have been fighting for autonomy in Turkey’s mostly Kurdish southeast. The United States has designated the PKK a terrorist group, as well as Turkey and other NATO allies.\nAnkara’s recent deployment to the Turkish border town of Silopi came as Turkey announced that it is planning to form a professional armed border patrol organization next year to operate under the jurisdiction of its Interior Ministry.\n“With its new border plan, Ankara aims to gather and centralize different authorities for border services under the full command of the Interior Ministry,” reports Hurriyet Daily News.\nOn Tuesday, Turkish Defense Minister Fikri Isik said that the military build up near the Iraqi border was part of the fight against terrorism and that Turkey had “no obligation” to wait until PKK terrorists gained a foothold in Iraq’s Sinjar region, located about 70 miles south of Silopi.\n“Silopi is part of Sirnak province, one of the main areas of conflict between Turkey and the PKK, whose main bases are in the mountains of northeast Iraq,” explains Reuters, adding that “Ankara is also concerned about an offensive by Iraqi Shiite militias, backed by Iran and known collectively as the Hashid Shaabi (Popular Mobilisation Forces), to recapture the Iraqi town of Tal Afar, west of Mosul, from the Sunni militant group Islamic State.”\nTurkey has pledged to respond if the Shiite militias “cause terror” in Tal Afar, home to a large ethnic Turkmen community with historical and cultural links to Turkey. Abadi has reportedly noted that both Sunni and Shiite Turkmen reside in the Iraqi town.\nAlthough the Pentagon has denied that the United States is backing Iran-allied militias, a recent report by Reuters confirmed that American troops are fighting alongside the Shiite groups, including Tehran’s terrorist proxy Hezbollah.","url":"https://www.breitbart.com/national-security/2016/11/02/iraq-threatens-dismantle-turkey-ankara-deploys-tanks-heavy-artillery-border/"}
