{"authors":["Frances Martel"],"date_download":"2018-10-30 20:32:59","date_modify":"2018-10-30 20:32:59","date_publish":"2015-12-08 16:07:37","description":"The Kurdistan Regional Government (KRG) of Iraq, based in northeastern Erbil, has requested the Russian government keep its fighter jets out of its airspace when conducting missions against enemies of Syrian dictator Bashar al-Assad in Iraq.","filename":"data/vaneerConsumption/IraqiKurdstoRussiaKeepYourFighterJetsOutofOurAirspace.json","image_url":"https://media.breitbart.com/media/2015/12/Russina-jet-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_12_08__1540931579.html","title":"Iraqi Kurds to Russia: Keep Your Fighter Jets Out of Our Airspace","title_page":"Iraqi Kurds to Russia: Keep Your Fighter Jets Out of Our Airspace | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Kurdistan Regional Government (KRG) of Iraq, based in northeastern Erbil, has requested the Russian government keep its fighter jets out of its airspace when conducting missions against enemies of Syrian dictator Bashar al-Assad in Iraq.\nThe Russian government began an airstrike campaign in the region in September, allegedly to weaken the jihadi gangs of the Islamic State terrorist group. Studies conducted since using Russian government data have found that up to 80 percent of Russian airstrikes have not targeted the Islamic State, but anti-Assad Syrian rebel groups.\nFlying through Kurdish airspace can be the fastest route to finding those targets, whether ISIS or Syrian rebels. This forces the Kurdish government to ground commercial flights, however, and have begun affecting the regional economy. So said KRG Interior Minister Kareem Sinjari on Monday, reportedly requesting to the Russian Consul General to Erbil that the Russians find a new route to their targets to allow commercial planes into and out of Erbil to keep flying.\nSinjari brought up the request at a delicate time, as Consul General Victor Simakov brought with him the news of Russia’s first light arms shipment to the Kurdish Peshmerga, to be used against the United States.\nRussian military activity has kept commercial airliners grounded in both Erbil and Sulaimani airports on two separate occasions this month. Kurdish officials are concerned that Russia will make a habit of shutting down their airline industry. Simakov said at the meeting, Rudaw reports, that “currently there is no other way for Moscow to avoid Kurdish airspace.”\nRussia’s demands for air traffic to be shut down in Kurdistan has forced the region to cut business with Turkey. Turkish airlines canceled a number of flights on Monday unable to reach their destinations. Some flights Tuesday will also be postponed, the company announced.\nThe Iraqi Kurdish government maintains friendly relations with Turkey, despite Turkey’s ongoing struggle against Kurdish militants associated with the Marxist Kurdistan Workers’ Party (PKK) operating both within Turkey and on the Syrian border. The KRG has condemned the PKK’s actions against Turkey and called for its fighters to leave Iraq entirely, despite the fact that the PKK has significantly, and sometimes successfully, engaged the Islamic State in battle.\nThe KRG enjoys close economic ties with Turkey, particularly in the oil trade, and has defending Turkey from Russian claims that its government is buying illegal crude oil from the Islamic State, identifying trucks shipping the oil out of Iraq into Turkey as belonging to Erbil, not ISIS.\nThat Russia’s demands, via allies in the government in Baghdad, to shut down Kurdish commercial flights may damage Kurdistan-Turkey economic ties occurs as relations between Russia and Turkey directly appear to reach new lows in recent history. Russia has repeatedly violated Turkish airspace while conducting air strikes against Syrian rebels, initially referring to the first violation as a “navigation error” and providing little explanation for subsequent violations. After a warning from Prime Minister Ahmet Davutoglu that Turkey would take military action “even if it’s a flying bird” that once again violates its airspace, Russian jets once again illegally entered Turkish airspace, and Turkish jets shot one down.\nRussian President Vladimir Putin has since enacted economic sanctions against Turkey for killing a Russian pilot. The Turkish government has not yet decided whether to level its own sanctions against Russia.","url":"https://www.breitbart.com/national-security/2015/12/08/iraqi-kurds-to-russia-keep-your-fighter-jets-out-of-our-airspace/"}
