{"authors":["Associated Press"],"date_download":"2018-10-23 02:45:38","date_modify":"2018-10-23 02:45:38","date_publish":"2017-04-26 14:05:49","description":"BAGHDAD (AP) - Iraqi paramilitary forces said Wednesday that they have captured Hatra, a 2,000-year-old historical site near the northern city of Mosul,...","filename":"data/vaneerConsumption/IraqiforcessaytheyveseizedHatraantiquitiessite.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/16/wire-466077-1493219753-611_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447748_Iraqi-forces-say-theyve-seized-Hatra-antiquities-site_1540262738.html","title":"Iraqi forces say they've seized Hatra antiquities site","title_page":"Iraqi forces say they've seized Hatra antiquities site | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BAGHDAD (AP) - Iraqi paramilitary forces said Wednesday that they have captured Hatra, a 2,000-year-old historical site near the northern city of Mosul, where U.S.-backed forces have been battling the Islamic State group for months.\nThe media arm of the state-sanctioned force made up mainly of Shiite militias broadcast images of the site Wednesday afternoon, showing what appeared to be the ancient ruins in the distance as militia vehicles drove through open desert. It was unclear from the video if the forces had actually secured the ancient site.\nKarim al-Nouri, a spokesman for the paramilitary forces, told state TV they captured the UNESCO world heritage site and were around three kilometers (two miles) from a nearby town with the same name, without providing further details.\nFILE - In this July 27, 2005 file photo, a temple to the Shamash sun god still stands over 1,750 years after the Sassanian empire razed the Mesopotamian city of Hatra, 320 kilometers (200 miles) north of Baghdad, Iraq. Iraqi paramilitary forces said Wednesday, April 26, 2017, that they have captured Hatra, a 2,000-year-old historical site near the northern city of Mosul, where U.S.-backed forces have been battling the Islamic State group for months. (AP Photo/Antonio Castaneda, File)\nIraqi forces often claim to have driven IS from areas that are still far from secure, or that quickly fall back into the militants' hands.\nHatra is believed to have been built in the second or third century B.C. by the Seleucid Empire. IS militants destroyed it along with other major historical sites in and around Mosul after seizing much of northern Iraq in the summer of 2014. The extremist group believes antiquities promote idolatry, though it is also believed to sell artifacts on the black market to fund its operations.\nIn April 2015, IS released a video showed the extremists smashing sledgehammers into Hatra's walls and firing assault rifles at priceless statues. At one point, the video showed a militant on a ladder using a sledgehammer to bang repeatedly on the back of a carved face until it crashed to the ground and broke into pieces.\nHatra, located some 110 kilometers (68 miles) southwest of Mosul, flourished during the first and second centuries as a religious and trading center. It was a large, fortified city during the Parthian Empire and capital of the first Arab kingdom.\nThe site is said to have withstood invasions by the Romans in A.D. 116 and A.D. 198 thanks to its high, thick walls. The ancient trading center was surrounded by more than 160 towers. At its heart were a series of temples with a grand temple at the center - a structure supported by columns that once rose to 100 feet (30 meters).","url":"https://www.dailymail.co.uk/wires/ap/article-4447748/Iraqi-forces-say-theyve-seized-Hatra-antiquities-site.html"}
