{"authors":[],"date_download":"2018-10-23 05:11:56","date_modify":"2018-10-23 05:11:56","date_publish":"2016-01-11 18:16:28","description":"Iraqi Turkmen leaders on Monday accused the country's Kurds of exploiting the war on jihadists to dig a trench that would strengthen their grip on expanded t...","filename":"data/vaneerConsumption/IraqTurkmensalarmedbyKurdishtrench.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z7tr-48qEJGFphM8d437f0aaf927e54d2-846_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394370_Iraq-Turkmens-alarmed-Kurdish-trench_1540271516.html","title":"Iraq Turkmens alarmed by Kurdish trench","title_page":"Iraq Turkmens alarmed by Kurdish trench | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Iraq Turkmens alarmed by Kurdish trench\nIraqi Turkmen leaders on Monday accused the country's Kurds of exploiting the war on jihadists to dig a trench that would strengthen their grip on expanded territory.\nOfficials from the Turkmen minority said the Kurdistan Regional Government (KRG) was digging the trench roughly following conflict lines between the Islamic State group and Kurdish forces across northern Iraq.\nKurdish officials insisted the trench was not a political act but rather a purely defensive measure aimed at preventing attacks by IS suicide car bombers.\nA picture taken on January 11, 2016 shows trenches being dug by Kurdish peshmerga forces in the district of Daquq, south of Kirkuk ©Marwan Ibrahim (AFP/File)\n\"We see this move to dig a trench as suspicious,\" Arshad al-Salehi, the head of the Iraqi Turkmen Front, told AFP.\n\"It starts in Rabia... and ends in Khanaqin,\" he said.\nRabia is a northwestern town on the Syrian border and Khanaqin lies 400 kilometres (250 miles) to the southeast, near the Iranian border.\nThe Turkmens are one of Iraq's largest ethnic minorities and many of their hubs are in disputed areas, which are just beyond the KRG borders but claimed by the Kurds.\nThe Kurdish peshmerga took over many of those areas on the back of the June 2014 IS offensive that saw the Iraqi federal security forces collapse completely.\nSalehi said he wanted Iraqi Prime Minister Haider al-Abadi to clarify his position on the trench and said he would bring up the issue in parliament.\n\"We see it as the beginning of the division of Iraq. It gives reality on the ground to a redrawn geopolitical map,\" he said.\nJassem Mohammed Jaafar, a Turkmen MP, also accused the Kurds of using the war against IS as a pretext to further the expansion, and ultimately the secession, of their region.\n- 'Fait accompli' -\n\"It is against international conventions, it violates the rights of the people who end up on one or the other side of it,\" he told AFP.\n\"There is little doubt that this trench is part of a project to divide Iraq,\" Jaafar said.\nThe KRG acknowledged it had recently stepped up the fortification of its frontline with IS but it denied any political motive.\n\"The purpose of the trench is to build a defensive system against vehicles used by Daesh (IS) terrorists who blow up car bombs,\" peshmerga spokesman Jabar Yawar said.\n\"It is two metres deep and three wide. It is not everywhere, some areas don't need it. It is the military leadership that makes this decision,\" he said.\nTurkmen officials said their information showed that the planned path of the trench would include the town of Tuz Khurmatu in the Kurdish region and leave that of Amerli out.\nThe trench has not been dug there yet but work has begun in areas around the oil-rich city of Kirkuk and in the Jalawla region near the Iranian border, they said.\nMehdi Saadoun, an activist from the Turkmen Rescue Foundation, said the trench was being used to further Kurdish nationalist ambitions.\n\"Seventy to 80 percent of the areas to be included on the KRG side are Turkmen areas,\" he said.\n\"They will include Tal Afar, Kirkuk (and) Tuz Khurmatu if the government does not enforce the law on preserving the unity of Iraq,\" Saadoun said.\n\"Daesh is the excuse the Kurdish forces are using to impose a fait accompli by digging this trench,\" he said.\nThe governor of Kirkuk province, Najmeddin Karim, said he supported any measure making the area safer.\n\"We support the decisions and measures taken by the peshmerga because they guarantee the security and stability of all the people of Kirkuk, without any discrimination,\" he said.","url":"https://www.dailymail.co.uk/wires/afp/article-3394370/Iraq-Turkmens-alarmed-Kurdish-trench.html"}
