{"authors":[],"date_download":"2018-10-23 02:12:50","date_modify":"2018-10-23 02:12:50","date_publish":"2017-03-10 11:08:10","description":"Iraqi special forces battling the Islamic State group on Friday pushed deeper into west Mosul, where a commander said jihadist resistance is showing signs of...","filename":"data/vaneerConsumption/IraqforcesadvanceinMosulasISresistanceweakens.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/20/wire-198069-1489179493-64_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300864_Iraq-battles-IS-Mosul-commander-says-resistance-weakening_1540260770.html","title":"Iraq forces advance in Mosul as IS resistance 'weakens'","title_page":"Iraq forces advance in Mosul as IS resistance 'weakens' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A member of the elite Counter-Terrorism Service fires on Islamic group fighters in the Shuhada neighbourhood as goverment forces advance in west Mosul on March 10, 2017\nIraqi special forces battling the Islamic State group on Friday pushed deeper into west Mosul, where a commander said jihadist resistance is showing signs of weakening under repeated assaults.\nThe jihadists are also facing simultaneous offensives in Syria by government forces, Turkish-backed rebels and a US-supported alliance of Kurdish and Arab fighters, piling more pressure on IS.\nBut the battle for Mosul's Old City -- which could see some of the toughest fighting of the operation -- has not yet begun, nor has fighting inside the city of Raqa, IS's main bastion in Syria.\nIraq's Counter-Terrorism Service attacked the Al-Amil al-Oula neighbourhood of west Mosul early on Friday, and were battling the jihadists inside it, said Staff Major General Maan al-Saadi, a CTS commander.\nIraq's Joint Operations Command later announced that CTS had retaken that area along with another neighbourhood, Al-Amil al-Thaniyah.\nSaadi said that following a string of losses since the launch of the government's assault on west Mosul on February 19, IS resistance had diminished.\n\"After we broke the (first) defensive line, they lost many fighters,\" he said.\nIS group presence in Syria and Iraq\n\"The enemy has begun to collapse. They have lost many of their combat capabilities. Today, the enemy sent (suicide car bombs), but not in the numbers that they sent at the beginning of the battle.\"\nIn another sign that the jihadists are feeling the squeeze, their chief Abu Bakr al-Baghdadi was reported to have abandoned Mosul, leaving local commanders behind to oversee defence of the city.\nIraqi forces launched their operation to retake Mosul in October, and recaptured the whole east bank of the Tigris River that runs through it in January.\n- More than 215,000 displaced -\nThey then set their sights on the smaller but more densely populated west side of the city.\nMore than 215,000 people are displaced as a result of the battle for Mosul, according to the International Organization for Migration. Others fled their homes but later returned.\nSmoke billows from the Al-Amil neighborhood of west Mosul as Iraqi forces pound Islamic State group positions on March 10, 2017, in fighting that has prompted more and more civilians to flee\nAlmost a quarter of the displaced -- more than 50,000 people -- have fled west Mosul since February 25, the IOM said.\nBut that is only a small fraction of the 750,000 civilians estimated to have stayed on in west Mosul under IS rule.\nIn neighbouring Syria, the jihadists lost more ground to a Russian-backed offensive by government forces east of second city Aleppo.\nRussian warplanes and regime aircraft and artillery pounded IS positions around Jarrah airbase, held by the jihadists since January 2014.\nRussia's military said on Friday that it had carried out more than 450 air strikes in support of the offensive over the past week, killing more than 600 IS fighters, and destroying 16 infantry fighting vehicles and 41 machinegun-mounted pickups.\nWashington too has turned up the heat on IS in Syria, more than doubling its troop numbers in the country with the deployment of 400 reinforcements to back the offensive on Raqa.\nAround 500 US military advisers were already deployed alongside the Syrian Democratic Forces, an alliance of Kurdish and Arab fighters that Washington regards as the force best equipped to drive IS from its stronghold.\n- Feuding US allies -\nBut the operation is complicated by the implacable opposition to the SDF of US NATO ally Turkey, which is leading a rival offensive against IS in northern Syria.\nAnkara regards the dominant force within the SDF, the Kurdish People's Protection Units (YPG), as a terrorist organisation, because of its links to a Kurdish rebel group that has waged a deadly 33-year insurgency in southeastern Turkey.\nA convoy of US armoured vehicles passes near the Syrian town of Manbij, on March 5, 2017 as Washington moves to deter any further Turkish attacks on its Kurdish and Arab allies who control it\nAnkara has said its intervention is aimed as much against the YPG as IS, and there have been repeated clashes between Turkish forces and the Kurdish militia.\nAsked about the standoff at a hearing of the Senate Armed Services Committee on Thursday, the top US commander for the region, General Joseph Votel, acknowledged that tensions between Ankara and the Kurds were near breaking point.\nEfforts have been made to address the issue at a military level, \"and there has to be an effort at the political level to address this,\" Votel said.\nSome of the US troop reinforcements being sent to Syria are to be deployed to SDF-held areas near the front line to deter further clashes between Turkish forces and Washington's Kurdish-Arab allies.\nRelations between Ankara and Moscow, however, are much improved even though they have supported opposite sides in the conflict between the rebels and the regime.\nTurkish President Recep Tayyip Erdogan was in Moscow on Friday for a new round of consultations with President Vladimir Putin.","url":"https://www.dailymail.co.uk/wires/afp/article-4300864/Iraq-battles-IS-Mosul-commander-says-resistance-weakening.html"}
