{"authors":["Frances Martel"],"date_download":"2018-10-30 20:33:13","date_modify":"2018-10-30 20:33:13","date_publish":"2015-12-15 21:09:14","description":"The brother of PKK head Abdullah Ocalan claims Iraqi Kurdistan President Barzani turned down two opportunities to meet with Ocalan.","filename":"data/vaneerConsumption/IraqiKurdishLeaderRefusestoMeetJailedPKKHead.json","image_url":"https://media.breitbart.com/media/2015/12/Masoud-Barzani-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_12_15__1540931593.html","title":"Iraqi Kurdish Leader Refuses to Meet Jailed PKK Head","title_page":"Iraqi Kurdish Leader Refuses to Meet Jailed PKK Head","title_rss":"NULL","source_domain":"breitbart.com","text":"The brother of Abdullah Ocalan, the head of the Kurdistan Workers’ Party (PKK), claims Iraqi Kurdistan President Masoud Barzani turned down two opportunities to meet with the Kurdish guerrilla chief while visiting Ankara, Turkey to discuss the fight against the Islamic State.\n“President Barzani told me ‘Twice I got the chance to meet Ocalan,’” Osman Ocalan told Kurdish news outlet Rudaw. The head of Iraq’s Kurdistan Regional Government (KRG) based in Erbil allegedly told Ocalan’s brother that he would never meet with the group’s leader in prison. Ocalan is serving a life sentence for his leadership of the PKK, a Turkey- and U.S.-designated terrorist group.\n“Turkish officials offered me to see him, but in prison and I refused to meet him there… It is not morally right to visit him and talk to him in prison, I refused twice,” Barzani allegedly said, according to Osman Ocalan. Osman Ocalan says he met with Barzani before his trip to Turkey last week in Iraqi Kurdistan and asserted that he would only meet the head of the PKK outside of prison, adding, “the peace process will not succeed without Ocalan.”\nBarzani was asked at a press conference last week following his meeting with Turkish President Recep Tayyip Erdogan whether he would meet with Ocalan while in the country and answered, flatly, “no.”\nWhile the PKK and the KRG are both ethnically Kurdish, they are politically distinct entities that have recently found themselves at odds, particularly regarding the fight against the Islamic State (ISIS) and their relationship with the Turkish government. When the Turkish government began airstrikes against PKK targets in Syria and Iraq, Barzani called the PKK “arrogant.” He has repeatedly called for the PPK, a Marxist organization, to withdraw from Iraqi Kurdistan, although PKK guerrillas are fighting ISIS, which the KRG’s Peshmerga are also waging war against.\nUpon returning from his trip to Ankara, Barzani said he felt “satisfied” with the talks he held with Turkish officials. He did not give any details on what topics were covered in these talks, but noted he discussed with Turkish officials “the fight against ISIS, the deployment of Turkish troops near Mosul, economic relations with KRG and the Turkish-PKK peace process, as well as the easing of tensions between Baghdad and Ankara.” He also stressed the importance of American cooperation in the fight against ISIS.\nWhile in Ankara, Barzani visited the headquarters of the Turkish National Intelligence Organization (MIT) before meeting extensively with Erdogan in private. According to a source cited by the Agence France-Presse (AFP), the two discussed fighting terrorism, and “stressed that cooperation in the fight against terrorism is important to stability in the region.” The source did not specify which terrorist groups the two discussed. Turkey has made clear through extensive military and law enforcement activity that it considers the PKK the primary terrorist threat facing Turkey today.\nThe only major mention of the PKK during Barzani’s trip was made by the President himself, who offered to mediate talks between the group and the Turkish government while speaking to leaders of the Peoples’ Democratic Party (HDP), a Kurd-friendly opposition party. Peace talks ended in July, when the Turkish government began strategically bombing PKK targets following an attack on a Kurdish group in Suruç, Turkey.\nThe leadership of the PKK aside from Ocalan have condemned Barzani’s visit to Turkey. “We are not against the development of relations between the KDP and Turkey or another state, but in the face of [the relationship between Turkey and Kurdish separatists] he should deal with Kurdish freedom, not be against it,” said PKK leader Sabri Ok.","url":"https://www.breitbart.com/national-security/2015/12/15/iraqi-kurdish-leader-refuses-to-meet-jailed-pkk-head-it-is-not-morally-right/"}
