{"authors":[],"date_download":"2018-10-23 00:02:33","date_modify":"2018-10-23 00:02:33","date_publish":"2016-01-29 12:40:28","description":"Iraq has signed a $328 million deal with US company General Electric that will boost power output during peak summer months, officials said Friday, although ...","filename":"data/vaneerConsumption/Iraqinks328mndealwithGEtoboostpowerproduction.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i0ng-4PuZeKVXE7cd9005b2c8769e0bdc-399_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422719_Iraq-inks-328-mn-deal-GE-boost-power-production_1540252953.html","title":"Iraq inks $328 mn deal with GE to boost power production","title_page":"Iraq inks $328 mn deal with GE to boost power production | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Iraq inks $328 mn deal with GE to boost power production\nIraq has signed a $328 million deal with US company General Electric that will boost power output during peak summer months, officials said Friday, although it falls far short of the country's needs.\nThe deal will make only a small dent in the country's major summer production shortfall, which leaves Iraqis with just a few hours of government-provided power a day while temperatures can hit 50 degrees Celsius (120 Fahrenheit).\nElectricity ministry spokesman Musaab al-Mudarris told AFP that the deal, which involves maintenance and improvements on more than 10 power stations in multiple provinces, would add between 700 and 1,000 megawatts to production capacity.\nIraqi protesters wave a hangman's noose and their national flags during a demonstration against corruption and a lack of services, including electricity, in Baghdad's Tahrir Square on August 28, 2015 ©Haidar Mohammed Ali (AFP/File)\nThe US embassy in aghdad said he deal was \"valued at more than $328 million\", and that it \"will sustain and increase Iraq’s power generation by at least 700 megawatts for the peak summer period\".\nBut Electricity Minister Qassem al-Fahdawi told parliament last year that the summer production shortfall was over 7,500 megawatts, meaning the projected increase under the GE deal is still dwarfed by the scale of the problem.\nFahdawi also said that production is only part of the problem, as Baghdad's grid has a maximum capacity of 3,500 megawatts irrespective of how much is produced.\nAnger over poor services and widespread corruption sparked weeks of protests in Baghdad and other areas last year, pushing Prime Minister Haider al-Abadi to announce a reform programme.","url":"https://www.dailymail.co.uk/wires/afp/article-3422719/Iraq-inks-328-mn-deal-GE-boost-power-production.html"}
