{"authors":[],"date_download":"2018-10-23 04:04:48","date_modify":"2018-10-23 04:04:48","date_publish":"2017-04-26 15:41:29","description":"Iraqi forces seized the UNESCO-listed ancient site of Hatra from the Islamic State group Wednesday, the latest archaeological jewel to be wrested from the...","filename":"data/vaneerConsumption/IraqiforcesseizeancientsiteofHatrafromIS.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/18/wire-466919-1493228194-256_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4448126_Iraqi-forces-seize-ancient-site-Hatra-IS_1540267488.html","title":"Iraqi forces seize ancient site of Hatra from IS","title_page":"Iraqi forces seize ancient site of Hatra from IS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A displaced Iraqi man rides a donkey, followed by his dog, on April 26, 2017 as pro-government paramilitary forces advance on the ancient city of Hatra, southwest of of Mosul, during an offensive to retake the area from the Islamic State group\nIraqi forces seized the UNESCO-listed ancient site of Hatra from the Islamic State group Wednesday, the latest archaeological jewel to be wrested from the jihadists' grip.\nHashed al-Shaabi (Popular Mobilisation) paramilitary forces fighting IS around Iraq's second city Mosul said they had \"liberated the ancient city of Hatra... after fierce clashes with the enemy\".\nThe Hashed forces launched their offensive at dawn on Tuesday and swiftly retook villages in nearby desert areas and the Hatra archaeological site.\nNearby modern Hatra was not yet fully retaken but the Hashed said its forces had \"broken into the town after Daesh (IS) defences collapsed\".\nIt said in a statement that it killed 61 IS fighters in the two-day-old operation, including 19 suicide bombers, and evacuated around 2,500 civilians who fled their homes.\nAn AFP reporter with the forces said the advance was quick and supported by army helicopters. The Hashed al-Shaabi said they retook an area covering 800 square kilometres (300 square miles).\nLying 120 kilometres (80 miles) southwest of Mosul, the jihadists' last urban Iraqi stronghold, Hatra is one of a string of archaeological sites recaptured from IS in recent months.\nKnown as Al-Hadhr in Arabic, it was established in the 3rd or 2nd century BC and became a religious and trading centre under the Parthian empire.\nIts imposing fortifications helped it withstand sieges by the forces of two Roman emperors.\nAlthough Hatra finally succumbed to Ardashir I, founder of the Sassanid dynasty, it was well-preserved over the centuries that followed.\nBut after IS jihadists seized swathes of Iraq and Syria in a lightning 2014 offensive, they vandalised sculptures there as part of a campaign of destruction against archaeological sites they had captured.\nIt remains unclear how much damage has been done by jihadists to ancient sites in Hatra, such as the statue of \"The Lady of Hatra\" shown here in 2003\nThe jihadists see such destruction as a religiously mandated elimination of idols -- but they have no qualms about selling smaller artefacts to fund their operations.\n- Strategic town -\nThe full extent of the damage to Hatra remains unclear.\nBesides the huge heritage value of ancient Hatra, the nearby city is of particular strategic significance because it commands access to broads linking the provinces of Nineveh, Salaheddin and Anbar.\nIS has lost much of the territory it once controlled amid twin offensives in Syria and Iraq, including several ancient sites.\nIn November, less than a month into a vast operation to oust the jihadists from Mosul, Iraq said it had recaptured Nimrud, a jewel of the Assyrian empire founded in the 13th century BC.\nJournalists who visited immediately afterwards found shattered statues, wrecked ancient palaces and bulldozed structures in one of the region's most important archaeological sites.\nIS had smashed stone carvings and detonated explosives at the site.\nLast month, Syrian regime forces recaptured the famed desert city of Palmyra from the jihadists, who had destroyed priceless objects there too.\nAlso in March, Iraqi security forces recaptured Mosul's museum, where IS militants infamously filmed themselves smashing priceless artefacts.\nThe five-minute video from 2015 shows militants at the museum in Mosul knocking statues off their plinths and smashing them to pieces.\nIn another scene, jihadists used a jackhammer to deface an imposing granite Assyrian winged bull at the Nergal Gate in Mosul.\nThe destruction at the museum and the archaeological sites drew widespread condemnation internationally and inside Iraq.\nIraqi pro-government forces backed by a US-led coalition have been fighting since October to oust IS from Mosul.\nAn Iraqi-modified T-72M tank belonging to the pro-government Hashed al-Shaabi paramilitary forces advances on April 26, 2017 towards the ancient city of Hatra, southwest of Mosul, during an offensive to retake the area from the Islamic State group\nThe Hashed al-Shaabi, an umbrella group for militias that mobilised to fight IS, have focused their efforts on a front southwest of Mosul, aiming to seize the town of Tal Afar as well as desert areas stretching to the border with Syria.\nIraqi forces advanced in west Mosul this week, closing in on the Old City as the jihadists executed civilians in a desperate bid to hold on to the last major Iraqi bastion of their crumbling \"caliphate\".","url":"https://www.dailymail.co.uk/wires/afp/article-4448126/Iraqi-forces-seize-ancient-site-Hatra-IS.html"}
