{"authors":["Morgan Ribera"],"date_download":"2018-10-30 23:30:04","date_modify":"2018-10-30 23:30:04","date_publish":"2014-08-13 17:59:01","description":"All true book-lovers understand that a book underneath your arm is an everyday accessory — an item you thoughtfully select each morning as you would choose jewelry or a matching pair of shoes. It’s an object you have always at the ready in case you…","filename":"data/vaneerConsumption/IReadEverywhereHashtagShowcasestheManyPlacesWeLovetoRead.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/10/d662a592-a90d-4f40-875c-af9f6347fcce-getty-170948903.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35637-ireadeverywhere-hashtag-showcases-the-many-places-we-love-to-read_1540942204.html","title":"#IReadEverywhere Hashtag Showcases the Many Places We Love to Read","title_page":"#IReadEverywhere Hashtag Showcases the Many Places We Love to Read","title_rss":"NULL","source_domain":"bustle.com","text":"All true book-lovers understand that a book underneath your arm is an everyday accessory — an item you thoughtfully select each morning as you would choose jewelry or a matching pair of shoes. It’s an object you have always at the ready in case you find yourself waiting at various points throughout your day. You can’t resist opening one up on the subway platform or at the doctor’s office, before a film or sporting event begins, or while awaiting an habitually tardy friend to join you for cocktails — because, quite frankly, who has that kind of time to waste when there’s a riveting world waiting between the pages? And you’ll certainly always take one with you to enjoy on the beach, at the park, on the train, while walking the dog — hell, if they made waterproof books, you’d be reading in the shower, too.\nAnd this charming bookish habit is one the New York Public Library is currently honing in on with their latest summer literacy campaign, launched this month with #IReadEverywhere, a hashtag that touts just how much reading is a part of our everyday lives by encouraging readers to share their favorite reading spots. Like many great literary hashtags, #IReadEverywhere has taken off on Twitter as readers across the globe have been happily posting reading selfies, images of themselves consuming literature in various locales, from the classic to the rather peculiar.\nOne quick Twitter browse showcases book-lovers reading on planes, in boats, at bars, under desks, in foreign countries, while chowing down on fast food (sounds a little Seussian) — proving that the act of reading can indeed be enjoyed anywhere. Celebrities like Mindy Kaling, Neil Gaiman, and even Hillary Clinton joined in on the lit action, too, posting snapshots of themselves with their noses in a book.\nHere are just a few of my favorite tweets that the hashtag has churned out; they'll inspire you to pop out a book right away, regardless of your current location. And as I've already mentioned, this summer has been filled with fabulous new works, so you should be well equipped to read in every corner of your universe and post some selfies of your own.","url":"https://www.bustle.com/articles/35637-ireadeverywhere-hashtag-showcases-the-many-places-we-love-to-read"}
