{"authors":["Liam Heagney For The Irish Daily Mail"],"date_download":"2018-10-22 21:52:25","date_modify":"2018-10-22 21:52:25","date_publish":"2017-03-10 00:02:08","description":"Best has warned any loss of concentration under the closed roof in Cardiff will spell disaster for Ireland’s hopes of winning a third Six Nations championship in four seasons. England currently lead the way.","filename":"data/vaneerConsumption/IrelandcaptainRoryBestwantscompetitiveSixNations.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1CAAE200000578-0-image-a-97_1489104108668.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4299486_Ireland-captain-Rory-Best-wants-competitive-Six-Nations_1540245145.html","title":"Ireland captain Rory Best wants competitive Six Nations","title_page":"Ireland captain Rory Best wants competitive Six Nations | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Rory Best has warned any loss of concentration under the closed roof in Cardiff will spell disaster for Ireland’s hopes of winning a third Six Nations championship in four seasons.\nBeaten by Scotland in round one, Joe Schmidt’s men must defeat Wales to bring the title race down to next weekend’s final game in Dublin against title-holders England.\n‘People want to see a competitive [final] weekend like two years ago,’ said skipper Best.\nRory Best is determined to make sure the Six Nations remains competitive into the final round\n‘We want to be involved because we have a group of players and a coaching staff that want to win things, but we know that only happens if we perform [against Wales]… if we don’t win, the championship is dead for us,’ he said as Ireland go into their first Friday night Six Nations match.\n‘If you’re too emotional, you can’t focus on your set-piece or your core skills but at the same time in the first half against Scotland we weren’t where we needed to be. We were so focused on being at that ruck at the right time we forgot to make an impact at that ruck, for example.\n‘We know we need to start well because Wales are going to come out of the traps hard. It’s about making sure we control our emotions, that we are smart and disciplined… but we can’t be outdone like we were against Scotland.’\nHaving failed to recover from an early 12-point deficit in Wales in 2015, Ireland blew a 13-point first-half lead in Dublin last year to draw with the same opposition in Best’s first outing as full-time Ireland skipper. He says that setback was pivotal in inspiring the November win over New Zealand in Chicago.\n‘It was a big lesson. In a provincial game if we had got that start you would have been out of sight. But there are small moments in international rugby and at 13-0 we could have scored again to take it to 20 and then that was bordering on game over, as happened in Scotland, but we didn’t take it.\nBest and Ireland visit the Principality Stadium on Friday night to take on Wales\n‘We knocked the ball on, just weren’t as mentally as strong as we needed. That was the big lesson, to keep going. When you look at the game in Chicago that’s what we took into that.\n‘We came in at half-time and said the points we had accrued weren’t going to be enough to win, that we had to score again. The few new guys in (against Wales last year) didn’t have the same experience of the teams of 2014 and 2015.’\nBest says Ireland’s focus is with ensuring good conditions rather than fretting over handing their hosts any mental edge generated by increased noise levels under the closed roof.\n‘We know what the atmosphere in a Wales-Ireland game here is like anyway. We’ve played here at the World Cup with the roof closed, so we know how loud it’s going to get.\n‘I suppose you’ll not know until 10.30 (on Friday night) whether we were right to agree to have the roof closed or not, but I keep going back to the fact that we want to play in as close to perfect conditions as you can get.\n‘And closing the roof gives the guarantee of no rain,’ added Best. ‘There was a bit of rain forecast and Joe asked myself and Johnny (Sexton) first. And when you ask kickers and throwers if they want to take the weather out of the equation, I wouldn’t say it was an easy decision, but that was the real reason for us as players.’","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4299486/Ireland-captain-Rory-Best-wants-competitive-Six-Nations.html"}
