{"authors":["Associated Press"],"date_download":"2018-10-23 04:22:39","date_modify":"2018-10-23 04:22:39","date_publish":"2017-03-16 15:39:18","description":"WASHINGTON (AP) - Irish Prime Minister Enda Kenny is urging President Donald Trump to help Irish people living in the U.S. illegally, saying they just want...","filename":"data/vaneerConsumption/IrelandsleaderpushesTrumponIrishinUSillegally.json","image_url":"https://i.dailymail.co.uk/1/2017/03/17/00/wire-231537-1489710904-107_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320720_Trump-greets-Irish-leader-White-House_1540268559.html","title":"Ireland's leader pushes Trump on Irish in US illegally","title_page":"Ireland's leader pushes Trump on Irish in US illegally | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - Irish Prime Minister Enda Kenny is urging President Donald Trump to help Irish people living in the U.S. illegally, saying they just want to \"make America great.\"\nKenny spoke at a luncheon at the U.S. Capitol on Thursday as part of a series of events celebrating St. Patrick's Day, including a one-on-one meeting with Trump at the White House, where the two discussed immigration, trade and the Irish economy. In the evening, the pair participated in the annual shamrock ceremony, a decades-old tradition in which Trump was presented with a bowl of Ireland's famous greens.\nOn people living in the U.S. illegally, Kenny said: \"We would like this to be sorted. It would remove a burden of so many people that they can stand out in the light and say, now I am free to contribute to America as I know I can. And that's what people want.\"\nPresident Donald Trump, left, and Irish Prime Minister Enda Kenny, right, hold up a bowl of Irish shamrocks during a St. Patrick's Day reception in the East Room of the White House in Washington, Thursday, March 16, 2017. (AP Photo/Andrew Harnik)\nKenny also urged Trump to consider providing more work visas \"for young people who want to come to America and to work here.\"\nSome estimates put the Irish natives living in the country illegally in the tens of thousands. Kenny has made a similar pitch on immigration in the past, but the current U.S. administration's position on illegal immigration has heightened the underlying tension.\nTrump ran on a promise to curtail illegal immigration. His revised travel ban, affecting travelers from six Muslim-majority nations, was set to go effect Thursday before it was put on hold Wednesday by a federal judge in Hawaii.\nKenny also sought to impress upon Trump the difficulties Ireland will face as a result of Britain's decision to leave the European Union. During an evening reception at the White House, he described Ireland as \"a committed member\" of the EU.\nTrump supported the British vote to leave the 28-country bloc - known as Brexit - saying earlier this year that it would \"end up being a great thing.\"\nTrump welcomed Kenny to the White House, proclaiming his love for Ireland. At the luncheon, he called Kenny a \"new friend\" and quoted an Irish proverb to remember friends that \"have stuck by you.\" Trump added, \"Politically speaking, a lot of us know that.\"\nDuring the evening St. Patrick's Day reception, Trump hailed the relationship between the two countries and pledged to be \"an ever-faithful partner and an always loyal friend.\"\nKenny was the first EU politician to meet with Trump after British Prime Minister Theresa May. German Chancellor Angela Merkel was scheduled to come to the White House on Tuesday, but that visit was moved back to Friday because of the snow.\nThe St. Patrick's Day event at the White House dates back to the 1950s and has become an important standing engagement for Ireland, which has strong emotional and ancestral ties to the United States.\nSpeaking after Trump at the luncheon, Kenny showed off his country's famed wit.\n\"They say the Irish have the capacity to change everything,\" he said. \"I just saw the president of the United States read from his script, entirely.\"\nBut Kenny was also complimentary.\n\"Let me congratulate you, President Trump, on your election,\" he said. \"You beat them all.\"\n___\nAssociated Press writers Darlene Superville and Jill Colvin contributed to this report.\nPresident Donald Trump, center, Irish Prime Minister Enda Kenny, right, and House Speaker Paul Ryan of Wis., pose for photographs after a \"Friends of Ireland\" luncheon on Capitol Hill in Washington, Thursday, March 16, 2017. (AP Photo/Evan Vucci)\nIrish Prime Minister Enda Kenny leans over to talk with President Donald Trump during their meeting in the Oval Office of the White House in Washington, Thursday, March 16, 2017. (AP Photo/Pablo Martinez Monsivais)\nIrish Prime Minister Enda Kenny speaks to members of the media outside the West Wing of the White House in Washington, Thursday, March 16, 2017, following his meeting with President Donald Trump. (AP Photo/Pablo Martinez Monsivais)\nPresident Donald Trump shakes hands with Irish Prime Minister Enda Kenny as they meet in the Oval Office of the White House in Washington, Thursday, March 16, 2017. (AP Photo/Pablo Martinez Monsivais)\nIrish Prime Minister Enda Kenny, sporting a green tie and shamrocks in his lapel, speaks to members of the media outside the West Wing of the White House in Washington, Thursday, March 16, 2017, following his meeting with President Donald Trump. (AP Photo/Pablo Martinez Monsivais)\nIrish Prime Minister Enda Kenny waves as he walks to his vehicle after speaking to members of the media outside the West Wing of the White House in Washington, Thursday, March 16, 2017, following his meeting with President Donald Trump. (AP Photo/Pablo Martinez Monsivais)","url":"https://www.dailymail.co.uk/wires/ap/article-4320720/Trump-greets-Irish-leader-White-House.html"}
