{"authors":[],"date_download":"2018-10-22 21:26:47","date_modify":"2018-10-22 21:26:47","date_publish":"2014-06-05 09:56:23","description":"The alleged discovery by a local historian of 800 dead babies has prompted condemnation by officials and religious leaders.","filename":"data/vaneerConsumption/IrelandInvestigatesAllegedDiscoveryof800BabiesinSewerTank.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/488806/140605-ireland-infant-grave_1_3d6b5b7384a047db52f35a7a07427dff.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_ireland-investigates-alleged-discovery-800-babies-sewer-tank-n123236_1540243607.html","title":"Ireland Investigates Alleged Discovery of 800 Babies in Sewer Tank","title_page":"Ireland Investigates Alleged Discovery of 800 Babies in Sewer Tank","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGrim reports that nearly 800 dead babies were discovered in the septic tank of a home run by nuns has set off a round of soul-searching in Ireland and sparked calls for accountability from government and Catholic Church officials.\nFresh research suggests that some 796 children were secretly buried in the sewage tank of the home in Tuam, County Galway, where unmarried pregnant women were sent to give birth in an attempt to preserve the country's devout Catholic image.\nOfficials said they were \"horrified\" at the discovery and said it revealed \"a darker past in Ireland,\" a country often haunted by its history of abuse within powerful church institutions.\nThe home was run by nuns from the Bon Secours Sisters congregation between 1925 and 1961. It was one of the \"mother and baby\" homes across Ireland, similar to the Sean Ross Abbey, in Tipperary, where Philomena Lee gave her child up for adoption in a story that was this year made into the eponymous Oscar-nominated film \"Philomena.\"\nPeople who lived near the home said they have known about the unmarked mass grave for decades, but a fresh investigation was sparked this week after research by local historian Catherine Corless purportedly showed that of the hundreds of children who died at the home, only one was buried at a cemetery.\nSpeaking to the Irish Mail, which first reported her research, she also said that health board records from the 1940s said conditions at the home were dire, with children suffering malnutrition and neglect and dying at a rate four times higher than in the rest of Ireland.","url":"https://www.nbcnews.com/news/world/ireland-investigates-alleged-discovery-800-babies-sewer-tank-n123236"}
