{"authors":["Nick Purewal","Press Association Sport"],"date_download":"2018-10-22 20:35:08","date_modify":"2018-10-22 20:35:08","date_publish":"2016-01-28 01:54:19","description":"Ireland boss Joe Schmidt believes the reigning double champions may have to settle for a mid-table RBS 6 Nations finish. Schmidt's men can become first side to win three successive titles.","filename":"data/vaneerConsumption/IrelandrugbysJoeSchmidtwouldtakeamidtablefinishatRBSSixNations2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A0873D00000578-0-image-a-76_1453944038814.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-3420263_Ireland-year-secure-three-successive-Six-Nations-titles-Joe-Schmidt-mid-table-finish_1540240508.html","title":"Ireland rugby's Joe Schmidt would take a mid-table finish at RBS Six Nations 2016","title_page":"Ireland rugby's Joe Schmidt would take a mid-table finish at RBS Six Nations 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ireland boss Joe Schmidt believes the reigning double champions may have to settle for a mid-table RBS 6 Nations finish.\nSchmidt's men can become the first side to win three successive Six Nations titles this year - but the Ireland head coach insists a 'top-half finish' would represent a good return.\nIreland must do without injured contingent Cian Healy, Mike Ross, Marty Moore, Iain Henderson and Peter O'Mahony from their pack alone for the opening two clashes against Wales and France.\nIreland's Joe Schmidt (right) believes the reigning double champions may have to settle for a mid-table finish\nIreland must do without injured Mike Ross for the opening two clashes against Wales and France\nThat crippling catalogue of injuries, coupled with talismanic captain Paul O'Connell's Test retirement, has left Schmidt urging Ireland to be 'realistic' with this year's expectations.\n'To be as candid as I can, I think a top-half finish would be a good Six Nations for us,' said Schmidt, despite Ireland claiming the 2014 and 2015 titles.\n'We start with Wales and France in a six-day turnaround and then go to England. That could put us in a very tough position before we've even got our feet fully rounded in going forward.\n(L-R) Vern Cotter, Guy Noves, Eddie Jones, Schmidt, Warren Gatland and Jacques Brunel at a media launch\nMarty Moor will also miss Ireland's opening two clashes against Wales and France at the RBS 6 Nations\n'If we could be in the top half that means we'd have to be in front of three pretty good teams.\n'I think being realistic, our dream would be to do what no team has done before, and we're not going to give up the dream but we're also reasonably pragmatic and practical in what we try to deliver.","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-3420263/Ireland-year-secure-three-successive-Six-Nations-titles-Joe-Schmidt-mid-table-finish.html"}
