{"authors":["Ciara Farmer For Mailonline"],"date_download":"2018-10-22 20:25:45","date_modify":"2018-10-22 20:25:45","date_publish":"2016-01-29 01:31:30","description":"The 30-year-old supermodel proved the thigh's the limit in a raunchy asymmetric mini-dress as she joined Bella Hadid at the jewellery showcase","filename":"data/vaneerConsumption/IrinaShaykdonsthighbootsatRuedeLaBoetieinParis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AE3EA200000578-0-image-a-38_1454029709341.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422024_Irina-Shayk-sends-pulses-racing-sexy-thigh-boots-super-short-asymmetric-mini-jewellery-showcase-Paris_1540239945.html","title":"Irina Shayk dons thigh-boots at Rue de La Boetie in Paris","title_page":"Irina Shayk dons thigh-boots at Rue de La Boetie in Paris  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is one of the world's leading supermodels.\nSo Irina Shayk is rarely seen looking anything less than sensational - as proved when she attended the De Grisogono Photocall at Rue de La Boetie in Paris on Thursday.\nThe 30-year-old supermodel proved the thigh's the limit in a raunchy asymmetric mini-dress as she joined Bella Hadid at the jewellery showcase.\nScroll down for video\nRacy look: Irina Shayk is rarely seen looking anything less than sensational - as proved when she attended the De Grisogono Photocall at Rue de La Boetie in Paris on Thursday\nIrina showed off her incredible figure in the polo-neck mini-dress which appeared simple at first glance although featured a uniquely cut base which offered a flash of her toned legs.\nHer thigh-high boots added a racy edge to the simple look - which although bland in colour and cut - was super sexy over all.\nShe clutched a small patent handbag with a silver studded trim - the perfect accompaniment to her sleek, colour-free ensemble.\nStunner: The 30-year-old supermodel proved the thigh's the limit in a raunchy asymmetric mini-dress as she joined Bella Hadid at the jewellery showcase\nThe only bold statement was her jewellery - no doubt pieces from De Grisogono - as she wore a glimmering ring with coordinating earrings.\nThe Sports Illustrated star slicked her brunette tresses into an elegant chignon which perfectly exhibited her flawless features.\nIrina outlined her eyes in a smouldering bronze shadow while her stunning puckered pout outlined with a taupe lipstick.\nGlimmering jewels: The only bold statement was her jewellery - no doubt pieces from De Grisogono - as she wore a glimmering ring with coordinating earrings\nBella went for a similar look as she rocked a simple black dress with a slashed stomach.\nGiving a glimpse of her rippling abs she flaunted the flesh through the shredded panel in the middle.\nBella wore her hair in a similar style to Irina - yet again allowing the jewellery to speak for itself against the minimal colour-scheme of the look.\nChic: Bella wore her hair in a similar style to Irina - yet again allowing the jewellery to speak for itself against the minimal colour-scheme of the look\nIrina and Bella have been hitting up the hottest shows at the Paris Fashion Week Haute Couture - walking and attending some of the hottest shows of the week.\nThe pair were last spied together at the Versace fashion show earlier in the week.\nOther stars have descended on the French capital to attend the week including Rita Ora, Bella's sister Gigi and Cara Delevingne.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422024/Irina-Shayk-sends-pulses-racing-sexy-thigh-boots-super-short-asymmetric-mini-jewellery-showcase-Paris.html"}
