{"authors":["Paul Chavez For Dailymail.Com"],"date_download":"2018-10-22 23:43:49","date_modify":"2018-10-22 23:43:49","date_publish":"2017-03-10 04:20:28","description":"The 31-year-old model covered her baby bump in a long coat Thursday while out and about in Los Angeles.","filename":"data/vaneerConsumption/IrinaShaykconcealsbabybumpunderbulkybluecoatinLA.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/03/3E1FC4E000000578-0-image-a-91_1489117595209.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299934_Irina-Shayk-conceals-baby-bump-bulky-blue-coat-LA_1540251829.html","title":"Irina Shayk conceals baby bump under bulky blue coat in LA","title_page":"Irina Shayk conceals baby bump under bulky blue coat in LA | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Irina Shayk covered her baby bump in a long coat Thursday while out and about in Los Angeles.\nThe 31-year-old model sported the bulky blue coat despite temperatures hovering near 80 degrees.\nIrina also wore blue flats and had her dark brown hair up in a messy bun.\nCovering up: Irina Shayk covered up in a bulky coat Thursday while out and about in Los Angeles\nShe accesorized with sunglasses and also carried a bright red purse on her shoulder.\nThe Russian beauty and her actor beau Bradley Cooper, 42, are expecting their first child together later this year.\nIrina and Bradley have yet to publicly comment on the pregnancy.\nThey started dating in early 2015 and Irina has been seen on numerous occasion wearing an oval-cut diamond and emerald ring on her wedding finger.\nLarge coat: The Russian-born beauty wore the dark coat despite temperatures hovering near 80 degrees in Los Angeles\nFan favorite: Bradley is shown Thursday at the Shrine Auditorium in Los Angeles while Irina was relaxing at a day spa\nAccording to an E! News source, Bradley has been doting on Irina and 'taking her to her doctor visits.'\nThe insider also said the actor 'has been there for her and is loving seeing the baby grow inside her.'\nE!'s insider added that Irina 'can't wait to be a mom' and wants 'more kids after this.'\nCute couple: Bradley Cooper and Irina are shown in March 2016 in Paris\nRumors of a possible pregnancy ignited after she walked the Victoria's Secret Fashion Show in Paris last November wearing a knotted duster coat over her lingerie.\nBradley will again voice the genetically-engineered raccoon-based bounty hunger in the upcoming sequel Guardians Of The Galaxy Vol. 2.\nThe Marvel film starring Chris Pratt, Zoe Saldana and Dave Bautista is scheduled to be released May 5.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299934/Irina-Shayk-conceals-baby-bump-bulky-blue-coat-LA.html"}
