{"authors":["Rory Tingle For Mailonline"],"date_download":"2018-10-22 23:48:44","date_modify":"2018-10-22 23:48:44","date_publish":"2017-03-16 08:07:54","description":"Rob Lipsett, from Dublin, began his day by devouring seven pastries and three doughnuts, not to mention a pot of maple syrup. By then he had already got through 4,402 calories.","filename":"data/vaneerConsumption/Irishfitnessbloggerploughsthrough20000calories.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/16/3E4E1D0B00000578-0-image-a-16_1489596203696.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4316714_Irish-fitness-blogger-ploughs-20-000-calories_1540252124.html","title":"Irish fitness blogger ploughs through 20,000 calories","title_page":"Irish fitness blogger ploughs through 20,000 calories | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An Irish fitness vlogger has ploughed through 20,000 calories in a single day for a stomach-churning food challenge.\nRob Lipsett, 25, from Dublin, who filmed the video in a bid to boost his YouTube following, began his day by devouring seven pastries and three doughnuts, not to mention an entire pot of maple syrup.\nBy then he had already got through 4,402 calories - nearly double the recommended daily intake for a man, which stands at 2,500.\nThe clip, entitled 'EPIC Cheat Day', has earned the fitness-mad blogger 1 million YouTube views.\nRob tucks into a plate of pasties and doughnuts as part of his stomach-churning challenge. In the end, the blogger got through an incredible 20,185 calories with barely a whimper\nSpeaking after his first meal, which he finished at 8.40am, Rob said: 'Feeling pretty good after that, I just had a five minute lie down. The worst part were the cinnamon swirls, they were just a bit dry.'\nAfter a light training session in the gym, Rob was ready for lunch, which he picked up from a nearby Burger King.\nThe staggeringly large meal consisted of a double Texas steakhouse burger, large fries, 16 onion rings and some BBQ dipping sauce.\nBut Rob, who with more than 150,000 YouTube subscribers is one of Ireland's most popular vloggers, managed to keep a stiff upper lip.\nCommenting after 'lunch', he said: 'It was enjoyable. I might go for a little nap then I'm going to have some kind of dessert.'\nRob Lipsett, from Dublin, began his day by devouring seven pastries and three doughnuts, not to mention a pot of maple syrup\nRob broke up his epic eating challenge with two trips to the gym to burn off at least a few of the calories - but appears unfazed by the amount of calories consumed\nRob has over 150,000 YouTube subscribers, making him one of Ireland's most popular vloggers. Pictured: Rob preparing to polish off some Ben & Jerry's\n'Dessert' came in the shape of an Oreo cheesecake, which topped off the calories for lunch at 3,679.\nPlus, half a giant chocolate bar was melted on top, with the rest finished later, adding 5,610 calories to the total.\nBy 5.30pm, Rob was ready for dinner, so phoned up a local takeaway to order a giant pizza and some cookie dough.\nHe chomped through all 3,037 calories before rounding off with a Ben and Jerry's Sofa So Good - his second tub of ice cream that day.\nBREAKFAST (4,402 cals) Rob tucking into his breakfast spread 3 Oreo doughnuts - 978kcal 3 strawberry doughnuts – 711kcal 3 cinnamon swirls – 1,131kcal 3 maple and pecan plaits – 1,128kcal 1 chocolate twist - 279kcal 60g maple syrup – 175kcal\nLUNCH (3,679 cals) Rob eating Burger King for lunch 1 Oreo cheesecake – 1,330kcal 1 Double Texas Steakhouse burger - 1,173kcal 1 large fries - 395kcal 16 onion rings - 741kcal BBQ dipping sauce - 40kcal\nDINNER (4,138 cals) 1 pizza - 2,726kcal 1 cookie - 311kcal 1 Ben and Jerry's Sofa So Good - 1,101kcal\nSNACKS (7,966 cals) The Biggest Chunkiest – 5,610kcal Cookie Dough switch up – 1,160kcal Raspberry cheesecake pizza - 1,196kcal\nPudding came in the form of an Oreo cheesecake topped with melted chocolate, which topped off the calories for lunch at 3,679\nLater, reflecting on his achievement, he said: 'For me it's all about eating fast. It's like my brain doesn't have time to register what's going on.' Pictured: He tucks into the cheesecake\nIn the end, Rob smashed through an incredible 20,185 calories with barely a whimper.\nLater, reflecting on his achievement, he said: 'For me it's all about eating fast. It's like my brain doesn't have time to register what's going on.'\nRob will be attending the new fitness expo FitConUK at the Olympia in London from the 21st to the 23rd April. For more information on the expo or to purchase a ticket visit fitcon.co.uk.","url":"https://www.dailymail.co.uk/femail/article-4316714/Irish-fitness-blogger-ploughs-20-000-calories.html"}
