{"authors":["Associated Press"],"date_download":"2018-10-23 00:59:01","date_modify":"2018-10-23 00:59:01","date_publish":"2017-03-16 10:39:15","description":"MONACO (AP) - Led by the irrepressible form of teen forward Kylian Mbappe, Monaco is winning widespread admiration for a scintillating brand of attacking...","filename":"data/vaneerConsumption/IrrepressibleMbappeleadingrampantMonacotonewheights.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/10/wire-227769-1489660761-60_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319648_Irrepressible-Mbappe-leading-rampant-Monaco-new-heights_1540256341.html","title":"Irrepressible Mbappe leading rampant Monaco to new heights","title_page":"Irrepressible Mbappe leading rampant Monaco to new heights | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MONACO (AP) - Led by the irrepressible form of teen forward Kylian Mbappe, Monaco is winning widespread admiration for a scintillating brand of attacking football that has produced 126 goals so far this season.\nThe 18-year-old Mbappe, with his lightning speed, trickery and calm finishing, is the talk of European soccer. He made it 11 goals in 11 games when he scored the first goal in a 3-1 win on Wednesday night as Monaco knocked out Manchester City on the away goals rule to reach the Champions League quarterfinals.\nHe had scored in the first leg and so far this season has netted 17 goals. That is impressive enough given his young age, even more so considering he was still playing in the reserves until mid-October.\nMonaco's Tiemoue Bakayoko, right, celebrates his side side's 3rd goal with Kylian Mbappe during a Champions League round of 16 second leg soccer match between Monaco and Manchester City at the Louis II stadium in Monaco, Wednesday March 15, 2017. (AP Photo/Claude Paris)\nEurope's biggest clubs will be queuing up to sign Mbappe, whose skillful yet direct style of play is drawing early comparisons to France great Thierry Henry.\nHis reported value is already estimated at around 60 million euros ($65 million). But before going anywhere else, Mbappe has unfinished business with Monaco.\n\"I'm making the most of it and I hope it's just the beginning,\" Mbappe said. \"It feels incredible.\"\nMbappe's strength, skill and awareness when dropping deep into midfield helped to start the move that led to Monaco's second goal on Wednesday. Club vice-president Vadim Vasilyev praises him for having remarkable composure.\n\"What surprises me is the way he manages to keep a cool head despite all the media pressure he's under,\" Vasilyev said.\nMonaco finds out its quarterfinal opponent on Friday, but must not lose sight of its domestic ambitions.\n\"We're ready to face anyone,\" Vasilyev said. \"The Champions League is a bonus, our priority is the league.\"\nMonaco leads second-place Paris Saint-Germain the French league by three points - effectively four given Monaco's huge goal difference - and is also still involved in both domestic cups. Monaco faces PSG in the League Cup final next month.\nAlthough Mbappe is the brightest talent in Monaco's team, he's far from the only one.\nLeft back Benjamin Mendy (who is 22 years old), winger Thomas Lemar (21) and holding midfielder Tiemoue Bakayoko (22) were all outstanding against City.\n\"These players have huge talent,\" Vasilyev said. \"But they're also a close-knit squad.\"\n___\nSHARING THE GOALS\nIt is testimony to Monaco's sense of teamwork and the unselfishness of its players that the 126 goals have been largely shared around.\nTop scorer Radamel Falcao is the only one who has scored more than 20, with the Colombia striker netting 24.\nMpabbe is next with 17, while Lemar has 11 and midfielders Bernardo Silva and Fabinho have 10 each.\nA total of 14 different scorers have contributed to Monaco's 84 league goals, giving coach Leonardo Jardim many options - and opposing teams plenty to worry about.\n___\nLEFT FLANK\nThe way Mendy and Lemar combine down the left flank has been a major factor in Monaco's success so far this season.\nBoth are quick, attack-minded players and have a great understanding, which was perfectly illustrated on Monaco's second goal against City.\nCollecting a pass from Mbappe on the left, Lemar then circled around to gain a precious second as Mendy charged up the flank. Lemar then released a cushioned pass with perfect timing for Mendy to run onto and ping a precise low cross for Fabinho to score.\nLemar has already broken into the France squad and Mendy hoped to follow suit when coach Didier Deschamps named his squad later Thursday.\nMendy and Lemar have an intuitive feel for the way the other plays, and those two marauding down the left flank for France could be a regular sight in the years to come.\n___\nVERSATILITY\nMonaco's holding midfielders are also goal scorers, a rare bonus that Jardim is fully exploiting.\nBakayoko and Fabinho were both on target against City.\nWhile Bakayoko is a more traditional holding midfielder, protecting the defense and then starting attacks with his crisp passing, Fabinho has a huge range.\nWhen the 23-year-old Brazilian arrived from Real Madrid four years ago, he was a right back.\nGiven how skillful he is and his attacking style, Jardim switched him to midfield. But Fabinho can also play as an emergency center half, effectively giving Jardim three players for the price of one. He is also an excellent penalty-taker, scoring all 13 he has taken for Monaco.\nFabinho's versatility also increases options for others.\nIf Fabinho drops back to defense, or to right back, then France full back Djibril Sidibe can slot into midfield to use his pace and power.\nNo wonder other teams find Monaco hard to defend against.\nMonaco's Kylian Mbappe, left, celebrates after scoring his side's first goal during a Champions League round of 16 second leg soccer match between Monaco and Manchester City at the Louis II stadium in Monaco, Wednesday March 15, 2017. (AP Photo/Claude Paris)\nMonaco's Fabinho, right, reacts as he celebrates his side's 2nd goal during a Champions League round of 16 second leg soccer match between Monaco and Manchester City at the Louis II stadium in Monaco, Wednesday March 15, 2017. (AP Photo/Claude Paris)\nMonaco's head coach Leonardo Jardim directs his players during a Champions League round of 16 second leg soccer match between Monaco and Manchester City at the Louis II stadium in Monaco, Wednesday March 15, 2017. Midfielder Tiemoue Bakayoko's thumping header sent Monaco through to the Champions League quarterfinals as the home side beat Manchester City 3-1 on Wednesday to progress on the away goals rule in another pulsating match between two attack-minded sides. (AP Photo/Claude Paris)\nMonaco's Benjamin Mendy, left, challenges for the ball with Manchester City's Kevin De Bruyne during a Champions League round of 16 second leg soccer match between Monaco and Manchester City at the Louis II stadium in Monaco, Wednesday March 15, 2017. (AP Photo/Claude Paris)","url":"https://www.dailymail.co.uk/wires/ap/article-4319648/Irrepressible-Mbappe-leading-rampant-Monaco-new-heights.html"}
