{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 19:45:26","date_modify":"2018-10-30 19:45:26","date_publish":"2015-09-24 18:31:17","description":"Hurley's arrest is the latest report of misconduct by an IRS employee while working in an official capacity.","filename":"data/vaneerConsumption/IRSAgentArrestedforAcceptingBribe.json","image_url":"https://media.breitbart.com/media/2015/07/ap_ap-photo1153-e1438708507188.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_24__1540928726.html","title":"IRS Agent Arrested for Accepting Bribe","title_page":"IRS Agent Arrested for Accepting Bribe | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Paul G. Hurley, 42, an IRS agent based in Seattle, is facing charges of soliciting and accepting a $20,000 bribe from a marijuana shop owner Hurley was auditing.\nAccording to the Seattle Post-Intelligencer, Hurley “faces a federal charge of soliciting and agreeing to receive a bribe by a public official and two counts of receiving a bribe by a public official. He has been charged in U.S. District Court at Seattle.”\nEach charge is “punishable by up to 15 years imprisonment and a $250,000 fine.”\nHurley’s arrest is the latest report of misconduct by an IRS employee while working in an official capacity.\nRecreational marijuana stores have been legal in the state of Washington since July 2014, but selling pot remains a federal crime.\nOn Tuesday the case of another IRS agent, Samuel Garza, arrested earlier this month on charges of sexual battery of a woman whose business he was auditing, was bound over to a grand jury after a dramatic preliminary hearing highlighted by the victim’s riveting testimony.\nThe arrests of these two revenue agents suggest a troubling pattern of behavior within the IRS. Indeed, many critics believe its organizational culture is so damaged it may be unfixable.\nAt the highest level of the organization, IRS leaders are targeting and attacking conservative organizations with whom they disagree politically, as the Lois Lerner scandal showed. On the ground, however, the story is equally concerning. The agency appears to lack institutional control over its revenue agents who interact with taxpayers.\nLax management and poorly defined or rarely followed human resource policies appear to allow largely unsupervised rogue agents to exercise unbound authority over virtually helpless taxpayers. The two arrested agents seemed to act as if they had free rein to advance their personal financial or sexual desires without constraint or regard to the rights and liberties of the taxpayers they were auditing.\nHurley’s alleged conduct is stunningly corrupt if the federal charges reported in the Seattle Post-Intelligencer prove to be true:\nProsecutors say Hurley demanded $20,000 from the marijuana shop owner in exchange for granting him lenience in an audit, despite the business owner never requesting a break. After the bribe proposition, the pot shop owner reported Hurley to federal authorities, who supervised the subsequent handover of money, according to charging papers. The business owner met with Hurley on multiple occasions throughout the summer after the owner was notified of a coming tax audit, court documents say. During the pair’s first meeting, Hurley explained that no tax deduction or credit is allowed for businesses that traffic federally illegal substances such as marijuana. Over time, the pot shop owner grew to believe Hurley was sympathetic to the marijuana industry and sensed he was being lenient in the audit. Their last scheduled meeting occurred Sept. 11, at which time Hurley told the business owner he owed about $290,000 in taxes for 2013 and 2014. The business owner agreed to the audit results. However, Hurley later asked whether he could ask the owner a question “off the record” and then mentioned that he saved the owner more than $1 million in the audit, court records say. He went on to say he was living paycheck-to-paycheck and had previously talked about being unhappy at the IRS, but was working there to pay off student loans, according to the charging documents. The business owner was silent for a moment, at which time Hurley reportedly said, “20,” hinting at a demand for $20,000, prosecutors claim. Hurley is alleged to have gone on to say that he wanted the pot shop owner to pay off his student loans in small amounts over time.\nHurley was so confident of his position of power and authority over the taxpayer in question he apparently did not consider the possibility that the taxpayer might have a different point of view.\nIn that regard, Hurley was mistaken, as subsequent events demonstrated:\nThe business owner reported Hurley to authorities, who then supplied him with $5,000 cash and supervised the owner’s meeting at the Starbucks. Agents equipped the owner with a wire and also employed a video recording device to shoot footage of the deal, records say. During their meeting, the business owner mentioned he was afraid of getting into legal trouble for the payment, prosecutors say, to which Hurley allegedly responded, “You’re not in trouble. I brought this up to you. I’m the one that is going to get in trouble.” The pair then arranged to meet for the remainder of the payment on Monday. Federal authorities on Monday morning gave the business owner $15,000 and again supervised his meeting with Hurley, which took place in the business owner’s car in the Starbucks parking lot. During the exchange, the business owner told Hurley he had a friend being audited and hoped his friend could deal with an IRS agent like Hurley. Hurley reportedly said something to the effect of, “There’s no one like me,” according to the charging documents. Special agents closed in on Hurley at 8:10 a.m. and arrested him. They found $15,000 in Hurley’s backpack, as well as $80 in his wallet that came from the $5,000 he received last week, reports say.\nAs Breitbart News reported previously, Tennessee appears to be a particular hotbed of IRS agent misconduct. Jeremiah Beaty, for instance, an IRS agent based in Nashville, was arrested in August on child porn charges, and a whistleblower tells Breitbart News Beaty and Garza are “just the tip of the iceberg.”\nIn 2013, IRS senior manager Lois Lerner resigned in disgrace in the midst of charges she had abused her authority by targeting conservative groups for unfavorable treatment in their applications for non- profit status. The following year, in 2014, Lerner took the 5th Amendment and refused to answer questions at Congressional hearings. She was subsequently found in contempt of Congress.\nThe list of other recent misconduct by the IRS is long and worrisome. Pepperdine University Law School Professor Paul Caron has documented the ongoing problems at the agency, which he has tracked daily at his well respected Tax Prof blog. Caron began documenting “The IRS Scandal”more than two years ago. It has now reached Day 868.\nThere is little indication the ongoing scandal will do anything but expand throughout the remainder of President Obama’s term.\nThe constant onslaught of new stories of alleged criminal misconduct by IRS employees emphasizes the growing distrust of the public for the federal government. A recent Gallup Poll, for instance, found that half of Americans consider the federal government the greatest threat to “the rights and freedoms of ordinary citizens”:\nAlmost half of Americans, 49%, say the federal government poses “an immediate threat to the rights and freedoms of ordinary citizens,” similar to what was found in previous surveys conducted over the last five years. When this question was first asked in 2003, less than a third of Americans held this attitude.\nGiven the broad evidence of out-of-control behavior by the IRS management and its agents in the field, it is little surprise that a call for the agency’s abolition and the replacement of our current system with a flat tax or fair tax, made recently by at least one GOP Presidential contender, Ted Cruz, is resonating with Republican primary voters.","url":"https://www.breitbart.com/politics/2015/09/24/irs-agent-arrested-accepting-bribe/"}
