{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 19:46:37","date_modify":"2018-10-30 19:46:37","date_publish":"2015-02-06 08:34:19","description":"Tom Brady wants to give the 2015 Chevrolet Colorado truck he won as the MVP of Super Bowl 49 to game-winning hero Malcolm Butler, but the Internal Revenue Service is going to make him pay for that act of gratitude |","filename":"data/vaneerConsumption/IRSMayForceTomBradytoPay24KforSBMVPTruck.json","image_url":"https://media.breitbart.com/media/2015/02/Tom-Brady-Super-Bowl-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_02_06__1540928797.html","title":"IRS May Force Tom Brady to Pay $24K for SB MVP Truck","title_page":"IRS May Force Tom Brady to Pay $24K for SB MVP Truck | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tom Brady wants to give the 2015 Chevrolet Colorado truck he won as the MVP of Super Bowl 49 to game-winning hero Malcolm Butler, but the Internal Revenue Service is going to make him pay for that act of gratitude.\nBrady told WEEI Radio’s Dennis and Callahan Show on Tuesday he’s “going to figure out how to make that [giving the truck to Butler] work.”\nAs the more than 100 million Americans who watched the New England Patriots defeat the Seattle Seahawks 28-24 in Super Bowl 49 saw with their own eyes, reserve defensive back Butler’s interception of a Russell Wilson pass at the Patriots one yard line with less than a minute to go in the game sealed the victory.\nBut Brady’s gracious gesture is going to cost him when he files his 2015 taxes, and the Internal Revenue Service is eager to collect.\nAs first reported by Americans for Tax Reform, Brady will already have to pay taxes on the fair market value of the truck, which sells for at least $34,000. Under Section 74 of the IRS code, that amount is considered a “taxable prize.” It is therefore taxable at Brady’s marginal tax rate.\nWith an estimated net worth of $120 million and more than $9 million in 2015 earnings from his football contract alone (endorsements certainly will add to that number), Brady’s marginal income tax rate for 2015 is likely to be the highest rate of 39.6%, making his tax liability on the truck–before he gives it to Butler as a gift–about $15,600.\nWhat many Americans probably did not know until Americans for Tax Reform reported on it this week, is that gifts (other than those for school tuition and a few other items) are taxable, not to the recipient, but to the giver.\n“Brady definitely has a gift tax issue here as the fact of his intention as a gift is clear,” non-profit and gift tax attorney James V. Lacy, author of the 2014 book Taxifornia, told Breitbart News.\n“If Butler takes possession Brady will be liable for federal tax for the value above the exclusion,” Lacy said.\nIn 2014, the amount excluded and not subject to the gift tax was $14,000. In theory, then, Brady would have to pay an additional tax (beyond the $15,600 paid on the “income” of the truck) equal to his marginal tax rate (39.6%) multiplied by the fair market value of the truck above the exclusion, or $20,000 ($34,000 -$14,000). That tax totals about $8,000.\nBrady’s total tax liability related to the truck, then, would increase from about $15,600 if he keeps it for himself, to about $23,600 if he gives it to Malcolm Butler.\nBut hold on. Tax attorneys familiar with the law may be able to cut Brady’s tax bill a bit.\n“Working in Brady’s favor is that fact that a Chevy truck like all new cars depreciates greatly in value as soon as it is bought or in this case is received by Brady. His tax lawyer would likely be OK recommending representing to the IRS on Brady’s tax filing a depreciated value arrived at with reference to an independent widely accepted authority such as the Kelly Blue Book for a used Chevy Truck, same make and model, regardless of use or milage,” Lacy said.\nIn other words, though the fair market value of the new truck is estimated to be $34,000, the fact that Brady accepted the truck on Sunday means that it is already not new, and therefore has depreciated.\nThe accepted accounting rule-of-thumb that every new car loses 20% of its value the minute you drive it off the lot could help diminish Brady’s gift tax liability here. The truck, valued at $34,000 on Sunday, could be legitimately valued as low as $27,200 today.\nUnder that scenario, Brady’s gift tax liability would be reduced to $5,280 (39.6% multiplied by $27,200 minus $14,000).\nEven with that lower gift tax, Brady would still be hurt financially for giving the truck to Butler rather than keeping it. Instead of paying $15,600 for the truck, his new tax bill would be $20,880\nTax attorneys might offer Brady an option that could reduce his tax burden even further.\n“Of course if he took possession in his own name, didn’t announce he was giving it to Butler, and just loaned the truck to Butler for awhile there would be no tax event,” Lacy said.\nThat approach might not work out so well for Brady, however, if Butler were to have an accident in the truck and some or all of the liability for that accident reverted to Brady as the owner of the truck.\nIt’s hard to see the public benefit that arises from penalizing Tom Brady for giving his truck to Malcolm Butler, but the IRS and some current and former members of Congress think it’s a sound policy.\nLacy disagrees.\n“The law arises from the same type of thinking that generational transfers of wealth such as the death tax are good things for society. Personally, I completely disagree with the logic because in both cases someone has already paid taxes on the income,” Lacy told Breitbart News.\n“There is an old adage,” Lacy added, “that the only certain things in life are death and taxes. But people should not be taxed to death. Gift taxes, like estate taxes, are really penalty taxes on transfers of wealth that have already been taxed.”\n“Double taxation.” Lacy concluded,”is simply not a fair way to raise government revenue, it causes hardship particularly regarding family businesses, and the practice needs to be reformed and ideally eliminated.”\nThat’s a sentiment with which both Tom Brady and Malcom Butler might well agree.","url":"https://www.breitbart.com/sports/2015/02/06/irs-may-force-tom-brady-to-pay-24k-for-sb-mvp-truck/"}
