{"authors":[],"date_download":"2018-10-22 22:43:07","date_modify":"2018-10-22 22:43:07","date_publish":"2014-06-10 20:32:04","description":"The rights include the right to quality service, the right to confidentiality and the right to a fair and just tax system, the IRS says.","filename":"data/vaneerConsumption/IRStoPublicizeTaxpayersBillofRights.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_11/245911/140312-irs-jms-0037_10d07a5cf80d22431c2ec9acd489d796.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_taxes_irs-publicize-taxpayers-bill-rights-n127726_1540248187.html","title":"IRS to Publicize Taxpayers 'Bill of Rights'","title_page":"IRS to Publicize Taxpayers 'Bill of Rights'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Internal Revenue Service wants to read taxpayers their rights.\nThe agency is publicizing a \"Bill of Rights\" for taxpayers, including the right to quality service, the right to confidentiality and the right to a fair and just tax system, IRS Commissioner John Koskinen announced Tuesday.\nKoskinen acknowledged that none of the 10 rights is new. All are buried somewhere in the thick pages of the federal tax code.\nSign up for top Business news direct to your inbox.\nBut going forward, the IRS will post the rights at IRS offices, and include an explanation of each when the agency contacts taxpayers by mail. Koskinen said the list will be included in about 30 million mailings a year.\n\"We're not creating new rights here,\" Koskinen said. \"We're really trying to compile them in a simple understandable format for taxpayers.\"\nSome rights will be limited by budget constraints and the law.\nFor example, the right to quality service says, \"Taxpayers have the right to receive prompt, courteous, and professional assistance in their dealings with the IRS.\" However, Koskinen said, budget cuts have diminished the agency's ability to answer questions from taxpayers.\nAs for the right to a fair and just tax system, Koskinen said: \"We do the best we can with the code we have.\"\nKoskinen took over the top IRS job in January, tasked with stabilizing an agency that had spent much of the past year under siege. Several top officials, including the acting commissioner, were forced to resign last year after revelations that IRS agents had improperly singled out conservative groups for extra scrutiny when they applied for tax-exempt status.\nKoskinen said the new initiative is designed to improve taxpayer confidence in the IRS and the law. He said he got the idea from Nina E. Olson, the National Taxpayer Advocate. Olson has been lobbying for the taxpayer Bill of Rights since 2007. She runs an independent office within the IRS.\n-The Associated Press","url":"https://www.nbcnews.com/business/taxes/irs-publicize-taxpayers-bill-rights-n127726"}
