{"authors":["Taylor Maple"],"date_download":"2018-10-31 01:46:41","date_modify":"2018-10-31 01:46:41","date_publish":"2018-09-14 11:00:53","description":"If you're craving more faux documentary content focused on outrageous crimes committed within the walls of a high school, you're in luck — American Vandal Season 2 premieres this week, and there's a new culprit on the loose. As you might have…","filename":"data/vaneerConsumption/IsAmericanVandalSeason2BasedOnATrueStoryTheSatireTakesADarkerTurnInItsNewestEpisodes.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/12/8363ba31-694a-4771-abdb-0feeea4f029c-2a273b78-df32-4d4d-b2b5-8b563727cdf6.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-american-vandal-season-2-based-on-a-true-story-the-satire-takes-a-darker-turn-in-its-newest-episodes-11888905_1540950401.html","title":"Is ‘American Vandal’ Season 2 Based On A True Story? The Satire Takes A Darker Turn In Its Newest Episodes","title_page":"Is ‘American Vandal’ Season 2 Based On A True Story? The Satire Takes A Darker Turn In Its Newest Episodes","title_rss":"NULL","source_domain":"bustle.com","text":"If you're craving more faux documentary content focused on outrageous crimes committed within the walls of a high school, you're in luck — American Vandal Season 2 premieres this week, and there's a new culprit on the loose. As you might have guessed, there doesn't really seem to be any evidence to suggest that Season 2 of American Vandal is based on a true story, but that doesn't mean the showrunners didn't take plenty of cues from real life to make this show as authentic, and funny, as possible.\nCo-creator Tony Yacenda told Entertainment Weekly that the inspiration for this season's conflict — which swirls around the \"Turd Burglar,\" an anonymous figure within a Catholic high school who'se poisoned the lemonade supply with laxatives — came from a lot of differnt sources. \"We were looking at a bunch of different true-crime documentaries that we loved, and different tropes that we hadn’t hit, and the way these great documentaries steer us and manipulate us,\" he said. \"And one of the things that the particularly dark ones do is they show you these really brutal, dark crimes.\"\nThat darkness is why even the trailers for this new season seem a little more sinister than Season 1 might have. \"We thought, 'What’s the dark, horrific version of our show?' And that’s poop covering the halls of a Catholic school,\" he continued.\nEarly reviews for the newest season have noted its darker tone, and while critics seem to appreciate the change in certain ways, they note that it does create a more serious, less silly vibe than Season 1 had. Rolling Stone's Alan Sepinwall gave the fresh episodes 4 out of 5 stars, and said though the show lacks the level of humor of Season 1, \"it's more ambitious in scope and in its themes, and the mystery takes on a more concrete air of whodunnit than the matter of trying to clear poor, dumb Dylan Maxwell’s name of the d*ck-drawing.\"\nVinnie Mancuso of Collider wrote that \"American Vandal Season 2 is not only more ambitious than its predecessor but shockingly darker and more inventive. It’s a season of TV that proves that poop is funny, but it is infinitely more interesting to actually give a sh*t.\" This definitely sounds like a departure from Season 1, in which the levels of absurdist comedy reached new and unexpected heights, but it at least shows that American Vandal isn't afraid to adapt, and try to invoke different feelings in its viewers.\nNetflix on YouTube\nCo-creator Dan Perrault said in the Entertainment Weekly piece linked above that the showrunners are aware that this season is less of a playful romp and more of an intricate story. \"I think it’s fair to say that the story turns and evolves to a larger extent than we did in Season 1. In Season 1, we literally have Peter outline, 'Here’s what we know,'\" he said. \"Peter the character is rationing the story points in a more complex way in Season 2, where he as a documentarian knows things that we’re not going to know right off the bat.\"\nWith creators as interested in true crime as these guys seem to be, American Vandal is in good hands. It may not have you belly laughing as much as you were last season, but the new season sounds like an interesting depature that will have you guessing more than ever. And to be honest, that it's not based in reality is sort of a good thing in this case.","url":"https://www.bustle.com/p/is-american-vandal-season-2-based-on-a-true-story-the-satire-takes-a-darker-turn-in-its-newest-episodes-11888905"}
