{"authors":["Johnny Brayson"],"date_download":"2018-10-31 01:46:12","date_modify":"2018-10-31 01:46:12","date_publish":"2018-09-11 17:33:22","description":"A Simple Favor is a seriously unexpected film for a number of reasons. The Anna Kendrick and Blake Lively-starring thriller is directed by Paul Feig, who previously has only ever helmed comedies like Bridesmaids and Spy. The film also stars an Asian…","filename":"data/vaneerConsumption/IsASimpleFavorATrueStoryTheThrillerFeelsLikeAMysteryNovel.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/10/2446bfd2-1f89-4ed0-a5b4-c7d78ffa0443-simple_favor_crop.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-a-simple-favor-a-true-story-the-thriller-feels-like-a-mystery-novel-11864651_1540950372.html","title":"Is 'A Simple Favor' A True Story? The Thriller Feels Like A Mystery Novel","title_page":"Is 'A Simple Favor' A True Story? The Thriller Feels Like A Mystery Novel","title_rss":"NULL","source_domain":"bustle.com","text":"A Simple Favor is a seriously unexpected film for a number of reasons. The Anna Kendrick and Blake Lively-starring thriller is directed by Paul Feig, who previously has only ever helmed comedies like Bridesmaids and Spy. The film also stars an Asian male love interest, Henry Golding, for its non-Asian female stars, an extreme rarity in a Hollywood film. And while these factors make the film unique and interesting, its still probably the film's plot that's most intriguing. But is A Simple Favor a true story, or is it a work of fiction?\nThe movie's storyline sounds like a Lifetime movie dialed up to 11. It's about a mommy blogger (Kendrick) who seeks to uncover the truth behind the disappearance of her mysterious, high-class friend (Lively). It's filled with drama and unexpected twists, and if it feels like it can't possibly be true, that's because it isn't. The movie is based on the novel of the same name by author Darcey Bell. Released just last year, the book was Bell's debut novel and it remains her only published work to date. Having her first novel turned into a major motion picture within a year of it being published is quite the achievement, and speaks to how impressive Bell's story is, but where did she come up with the idea for said story?\nLionsgate Movies on YouTube\nIt seems as if Bell was largely influenced by other books she had read and enjoyed. In a wide-ranging interview last year with Joye Shepperd of the Washington Independent Review of Books, the author revealed a number of her inspirations. \"I’m obsessed with Patricia Highsmith (as you know, she makes some appearances in my novel!), and I learned a lot from reading her work,\" Bell told Shepperd. \"I think it’s in The Talented Mr. Ripley where she writes, 'Anticipation was more pleasant… than the experiencing.' The thrill in anticipation is a big part of writing suspense for me.\"\nBell also mentions Edgar Allen Poe as an influence on the character Emily (Lively in the film), stating to Shepperd, \"Edgar Allan Poe wrote this story, The Imp of the Perverse, about this imp-demon that stands in for our impulse to do the wrong thing in a situation simply because it is the wrong thing to do. I’ve been haunted/obsessed by this idea (and Edgar Allan Poe in general!) since I read it. Emily was so compelling to me because she learned how to use the pleasure in this impulse to gain power — and look good doing it.\"\nAs for real life inspirations, Bell relied at least somewhat on her job as a preschool teacher to gain some inspiration for her other main character, Stephanie (Kendrick). \"As a preschool teacher, I spend a lot of time talking with moms with young children who are often lonely, fiercely protective, and loving parents. To be honest, a lot of the mothers I meet are at least a little like Stephanie,\" she told Shepperd.\nSo although Bell may have drawn bits of inspiration from the works of other authors and from her own life, it appears that A Simple Favor was largely crafted from her imagination — and now she'll get a chance to see her creation play out on the big screen.","url":"https://www.bustle.com/p/is-a-simple-favor-a-true-story-the-thriller-feels-like-a-mystery-novel-11864651"}
