{"authors":["Caitlin Mahon"],"date_download":"2018-10-31 00:11:00","date_modify":"2018-10-31 00:11:00","date_publish":"2014-08-12 20:29:16","description":"Asbestos may be able to provide heat-resistant, durable insulation, among other things — but the risks of exposure far, far outweigh the benefits. That's why the mineral, which can lead to mesothelioma, scarring of the lungs, and lung cancer, has…","filename":"data/vaneerConsumption/IsAsbestosStillUsedInSomeDevelopingCountriesItsABoomingIndustry.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0314c9fa-b53d-4c20-995e-2440769559bf.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35438-is-asbestos-still-used-in-some-developing-countries-its-a-booming-industry_1540944660.html","title":"Is Asbestos Still Used? In Some Developing Countries, It's A Booming Industry","title_page":"Is Asbestos Still Used? In Some Developing Countries, It's A Booming Industry","title_rss":"NULL","source_domain":"bustle.com","text":"Asbestos may be able to provide heat-resistant, durable insulation, among other things — but the risks of exposure far, far outweigh the benefits. That's why the mineral, which can lead to mesothelioma, scarring of the lungs, and lung cancer, has been banned in much of the world. Unfortunately, even though many people want to see asbestos banned from their communities, its use in many parts of the world has no end in sight.\nCanada, for example, hasn't banned asbestos — and while the country uses very little of it, 96 percent is exported to countries in Asia. Russia is another huge producer and user, along with Brazil, Kazakhstan, and China. India, however, is the largest importer of asbestos from Canada.\nExperts believe the increased use of asbestos in the past two decades will enormously impact the health of its citizens, just as it did when the United States used asbestos. Although India added asbestos to its hazardous material list, it's still being widely used throughout the country. Why? Well, it's cheap, it provides shelter, and it creates jobs in some of the poorest parts of the world.\nThe Risks of Asbestos Exposure\nRobert Cianflone/Getty Images News/Getty Images\nAsbestos is known to set up shop in the lungs and cause deadly diseases. On an annual basis, nearly 125 million people are exposed to asbestos at work all around the globe, says the World Health Organization. According to The New York Post, the International Labor Organization (ILO) reports that approximately 100,000 people die each year from exposure to asbestos in the workplace.\nIn addition to the ILO, more than 50 countries — the WHO as well as the large part of the medical community — say asbestos should be banned completely. In the U.S. alone, roughly $1.3 billion has been paid out to people personally injured by asbestos in the workplace, according to a 2012 report by the Rand research corporation. Throughout the U.S. and Europe, billions have been spent to get rid of asbestos from buildings.\nThe Asbestos Problem In India\nPaula Bronstein/Getty Images News/Getty Images\nDuring an asbestos conference held in New Delhi, executives from India's Asbestos Cement Products Manufacturers Association said they're actually saving lives and sheltering people in India, where some of the globe's poorest individuals reside. Right now, the asbestos industry in India yields 300,000 jobs across about 100 plants. It's a $2 billion industry that has seen a lot of growth. Last year alone, India brought in $235 million worth of asbestos — half of the amount of asbestos traded around the world.\nDespite all evidence to the contrary, some asbestos association executives claim that studies showing asbestos causes cancer are simply making mountains out of molehills. According to asbestos lobbyists, nations in the West irresponsibly used asbestos and \"gave\" it a bad reputation. The same lobbyists also claim that one form of asbestos, known as chrysotile or white asbestos, is actually safe, and it's the only form used today.\nThis isn't true, obviously. According to a 2012 statement from the Joint Policy Committee of the Societies of Epidemiology, \"all types of asbestos fiber are causally implicated in the development of various diseases and premature death.\"\nIn the same statement, the committee says the asbestos industry is fishing for new markets and creating new groups to lobby for the use of asbestos in poor countries.\nCommunities Fight Back\nSandra Teddy/Getty Images News/Getty Images\nFortunately, not all agree with the asbestos executives, and some communities are fighting back. For example, an Associated Press report revealed that the dangers of asbestos in Vaishali — a farming village located in Bihar state — came to light after one boy brought home science textbooks, according to Business Insider. After the village, which consists of 1,500 people, learned what asbestos can do to the human body from the textbooks — knowing Indian doctors wouldn't test for or treat citizens who suffer from diseases caused by asbestos — villagers started taking matters in to their own hands.\nA petition was circulated that the factory be shut down, but to no avail. Ultimately, thousands on thousands of people protested in the streets, blocking traffic for several hours, speaking publicly about how asbestos causes cancer and other deadly diseases.\nOne person involved told the Associated Press:\nIt was a moment of desperation. No one was listening to us. There was no other way for us to express our outrage. Still, we did not feel triumphant. We knew it wasn't over.\nIt didn't end there, as the company that owns the asbestos plant filed lawsuits against many villagers that are still pending, according to the Associated Press. But last year, the Bihar chief minister canceled the permit for the asbestos plant, and the protest in Vaishali is moving other citizens to also protect against the use of asbestos, such as one in Bhojpur, which is close to Vaishali.\nWhat's Next For India\nValerio Pennicino/Getty Images News/Getty Images\nOfficials in India are divided on the risks of asbestos. In 1986, there was a moratorium issued on new asbestos plants, but the mineral was never banned — even though two orders were issued to stop using asbestos by the Supreme Court.","url":"https://www.bustle.com/articles/35438-is-asbestos-still-used-in-some-developing-countries-its-a-booming-industry"}
