{"authors":["Elizabeth Ballou"],"date_download":"2018-10-30 23:57:31","date_modify":"2018-10-30 23:57:31","date_publish":"2014-08-12 20:32:45","description":"When it comes to cultural standards for female body hair, especially in the nether regions, there are more opinions on the Internet than there are niche dating apps in the app store. Women should completely get rid of pubic hair! Shaving is a sign…","filename":"data/vaneerConsumption/IsBackHairUnattractiveAndIfSoIsThataFeministDoubleStandard.json","image_url":"https://imgix.bustle.com/uploads/image/2018/7/6/7462cc66-6991-45fc-8470-7ff6159ea4fc-fotolia_87840526_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35421-is-back-hair-unattractive-and-if-so-is-that-a-feminist-double-standard_1540943851.html","title":"Is Back Hair Unattractive? And If So, Is That a Feminist Double Standard?","title_page":"Is Back Hair Unattractive? And If So, Is That a Feminist Double Standard?","title_rss":"NULL","source_domain":"bustle.com","text":"When it comes to cultural standards for female body hair, especially in the nether regions, there are more opinions on the Internet than there are niche dating apps in the app store. Women should completely get rid of pubic hair! Shaving is a sign of bowing to the patriarchy! People should do whatever their partner wishes! Or they should do whatever they like (my own personal opinion)!\nBut what about men and back hair?\nAlthough it's a grooming subject that doesn't always get the same amount of publicity, it can involve a host of similar emotions: confusion, shame, pride, hurt, and so on. The Cut writer Kat Stoeffel, wrote about the subject this week, saying that what a man does with his back hair is an equal, or even greater, political/cultural act compared to what a woman does with her pubic hair. And in case you don't think that body hair can be a statement of some kind, refer to the full-bushed American Apparel mannequins that got so much buzz this spring. In a GQ article on how to remove body hair, groomer Thea Istenes (whose clients include Robert Downey, Jr. and 50 Cent), said, \"We never negotiate on [back hair].\" Meaning, of course, that it needs to go. (Also, groomer? I was under the impression that groomers worked in doggy spas and trimmed spoiled Pomeranians. Not, you know, men's backs.)\nRecent covers of GQ seem to demonstrate bizarrely hairless men. On the February 2010 cover, Johnny Depp grins rakishly, mustachioed of mouth and tousled of hair, but with no back or chest hair to be seen. The February 2011 cover, which features Muhammed Ali sans shirt, shows him with no body hair whatsoever. The same is true of the November 2011 cover, starring Dwyane Wade. Movies tend to parallel magazine covers — I can't think of the last flick I saw that included a dude with a hairy back. Chris Pratt certainly did not have one in Guardians of the Galaxy. Sam Claflin, as Catching Fire's Finnick Odair, didn't either. And the entire world probably knows that Taylor Lautner sported nary a back hair in all of his shirtless gallivanting during the Twilight movies.\nAnd the guy's supposed to be a werewolf, for chrissakes. If a werewolf is not hairy in his human form, then what kind of message is that sending?\nNow for some real talk: I tend to think back hair is, well, not that great. It is in no way a deal-breaker for me (I have dated men who have been generously gifted in the back hair department), but given the choice, I would not pick it. And realizing that after reading Stoeffel's article made me feel kind of like a dirtbag. After all, I have spent rather a lot of time pondering women's body hair. I even wrote about getting a bikini wax. My conclusion: that women should do whatever it is they want with their eyebrow, armpit, pubic, and leg hair. So how do I even have the right to be turned off by back hair? If I expect men to shut up and deal with the fact that I'm not going to get rid of all my pubic hair, and would think much of less of them for judging me about that (as would other Bustle writers), how can I not extend the same courtesy?\nBut it's also not something that I, or other people who prefer men, do intentionally. Not that I want to go slinging all the blame on cultural norms, but...yeah, that's about what I'm saying. I'm a product of a culture that tells me what level of body hair is acceptable and attractive...even if I myself don't always chose to hew to those norms, apparently I prefer if my romantic partners do. And the only way to break down those kinds of physical expectations is to have rational, open dialogue about them. One way to begin that is by getting across the message that plenty of folks like a hairy man.\n\"I love hair on men,\" said a friend of mine when I asked him about his opinion. \"That being said...I think [hair] is like clothing. You can wear whatever you damn well please.\"\nIn addition, there are plenty of Tumblrs out there that praise a good, hairy body, such as Hairy Is Good and Never Too Hairy (warning: both have some NSFW pictures).\nSo, if you're a gentleman (or a lady) with back hair, and you're troubled by what to do about it, realize that whatever decision you make, there will be people who find you sexy and desirable. Although it goes without saying that if they're judging you solely on body hair, you should probably get out of there, stat.\nImages: teen.com; 99 percent skins/Tumblr","url":"https://www.bustle.com/articles/35421-is-back-hair-unattractive-and-if-so-is-that-a-feminist-double-standard"}
