{"authors":["Alexis Rhiannon"],"date_download":"2018-10-31 01:40:40","date_modify":"2018-10-31 01:40:40","date_publish":"2018-09-14 20:51:09","description":"She's had such a busy week that you might think she'd fly under the radar for a bit, but one Bachelor Nation fan favorite isn't done making waves. Not only did she announce her pregnancy this week, but old Instagram posts are causing fans to winder…","filename":"data/vaneerConsumption/IsBekahMartinezAlreadyMarriedTheBachelorNationAlumIsExpectingButSheHasntTiedTheKnotJustYet.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/9a90129c-6cbd-461b-b08f-7c8305407675-bekah.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-bekah-martinez-already-married-the-bachelor-nation-alum-is-expecting-but-she-hasnt-tied-the-knot-just-yet-11920532_1540950040.html","title":"Is Bekah Martinez Already Married? The Bachelor Nation Alum Is Expecting, But She Hasn't Tied The Knot Just Yet","title_page":"Is Bekah Martinez Already Married? The Bachelor Nation Alum Is Expecting, But She Hasn't Tied The Knot Just Yet","title_rss":"NULL","source_domain":"bustle.com","text":"She's had such a busy week that you might think she'd fly under the radar for a bit, but one Bachelor Nation fan favorite isn't done making waves. Not only did she announce her pregnancy this week, but old Instagram posts are causing fans to winder if The Bachelor's Bekah Martinez is already married. That's the question on the minds of many fans after an Instagram post from her partner Grayston Leonard suggested the two may have secretly tied the knot. Coming just days after the announcement that the pair is expecting a child together after dating for just about seven months, it's a lot of information to take in, so let's get to the bottom of it.\nThe photo in question went live on Sep. 4, before she announced her pregnancy, and it shows the couple on a stretch of sand tagged as Ranchos Dos Pueblos Beach. Both are dressed in what could only be termed \"beach formal\" — Grayston wears a button-down linen shirt and rolled khakis, and Bekah is in a loose, gauzy white dress that hits below her knee, and clutching a straw hat. Both are barefoot, and Grayston looks back laughingly at Bekah as she grasps at his hand, appearing to chase him across the sand. Pretty normal so far, but it's the caption that raised eyebrows, so here it is: \"After 48 hours of marriage, I am foregoing a life with Rebekah for an annulment. she’s not happy about it.\"\nPretty confusing, no? That last part, about the annulment, is clearly a joke, but what does that say about the rest of it? It's possible that the marriage reference is meant to be taken as part of the joke, but the specific time frame makes that seem less likely. Paired with the photo posted right before this one, in which the pair pose under a leafy altar with the cheeky caption \"stuck with this beach,\" it looks very much like these two got quietly married over Labor Day weekend. And they're just staying close-lipped about it while the rest of us play catch-up.\nAnd there's a lot of catching up to do, because this relationship has been moving at lightning speed. (Which is probably hardly surprising, given where Bekah cut her teeth in the dating world.) The 23-year-old came to fame on Arie Luyendyk Jr.'s Season 22 of The Bachelor, and was announced early on as a contestant on Bachelor in Paradise Season 5, as well, after getting sent home in Week 5.\nBut the 23-year-old never actually showed up on that beach in Mexico, because as she later revealed, she wasn't quite as single as host Chris Harrison had assumed when he announced her participation. The Los Angeles native shared with PureWow in mid-July that she had a boyfriend — that would be Grayston — whom she'd met in February and been dating for about five months at the time.\nEver since the announcement, Bekah and Grayston have made frequent appearances on each other's social media, but no one was prepared for her announcement on Sep. 12 that she was 20 weeks into a pregnancy.\nBekah Martinez on YouTube\nGiven the immense, life-changing responsibility that's due to arrive in January 2019, an announcement of Bekah and Grayston's engagement would hardly have been a surprise. But Bekah in particular has been adamant that marriage might not be in the cards for them. The rock-climbing enthusiast told Us Weekly on the same day of the announcement that while she's sure about becoming a mom, she has a little more thinking to do on the topic of marriage.\n\"[Motherhood is] the one thing that I’ve known with certainty for so long. I’ve gone back and forth on the idea of marriage and relationships, but I’ve always felt sure that I want to be a mom.\"\nAnd she echoed that sentiment in an interview with Pure Wow, where she told the outlet:\n\"The last thing we need is to consider another commitment on top of what we’re already going through. Regardless, we’re bound together by sharing this little life.\"\nAnd Grayston has piped in with the same claims, as well. People noted that the dad-to-be filmed an Instagram story on Wednesday in which he told viewers, \"No, we aren’t married,\" while lying in bed with Bekah. But, perhaps this protesting is just for show. No one would blame the couple for wanting to keep some aspects of their relationship to themselves, a rumored secret wedding included.","url":"https://www.bustle.com/p/is-bekah-martinez-already-married-the-bachelor-nation-alum-is-expecting-but-she-hasnt-tied-the-knot-just-yet-11920532"}
