{"authors":["Danielle Kurtzleben"],"date_download":"2018-10-23 05:49:59","date_modify":"2018-10-23 05:49:59","date_publish":"2015-10-16 00:00:00","description":"Thanks to small donors fueling Bernie Sanders and Ben Carson, the campaign donation race last quarter got a lot tighter.","filename":"data/vaneerConsumption/IsBiggerReallyBetterSmallDonorsBoostInsurgentCandidates.json","image_url":"https://media.npr.org/assets/img/2015/10/16/gettyimages-492530778_wide-db4b0c2cc997e2295f08171c2cfe02931c99be7e.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_itsallpolitics_2015_10_16_449035273_clinton-no-longer-the-dominant-campaign-fundraiser_1540273799.html","title":"Is Bigger Really Better? Small Donors Boost Insurgent Candidates","title_page":"Is Bigger Really Better? Small Donors Boost Insurgent Candidates : It's All Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Is Bigger Really Better? Small Donors Boost Insurgent Candidates\nEnlarge this image toggle caption Joe Raedle/Getty Images Joe Raedle/Getty Images\nThe campaign fundraising race got a lot tighter last quarter. More specifically, Hillary Clinton's massive campaign fundraising lead over the rest of the field shrank. The fuel that helped other candidates catch her: small donors.\nShe's still in the lead — in the quarter ending Sept. 30, Clinton raised nearly $30 million. But she's trailed closely by Bernie Sanders' $26.2 million and Ben Carson's $20.8 million. Compare that to the prior quarter, when Clinton raised a huge $47.5 million, more than three times second-place Sanders' $15.2 million.\nHere's how the latest numbers stack up, as well as how total campaign fundraising looks thus far.\nThese bars are sorted by third-quarter fundraising totals. So you can tell something important by the bars that stick out the most from that ordering — Clinton, Marco Rubio and Rand Paul: those are candidates whose fundraising fell off sharply between the second and third quarters.\nBut not all dollars are created equal. The leading establishment candidates in either party — Jeb Bush, Clinton and Rubio — have been getting most of their campaign money from bigger donors. The upstart Tea Party and progressive candidates — Carson and Sanders — are fueled by donations of less than $200.\nHillary Clinton and Bernie Sanders are maybe the best illustration of this — they raised nearly equal totals last quarter, but a massive 77 percent of Sanders' receipts came from donations of less than $200, compared with Clinton's 17 percent.\nYou could say that's a good sign for Clinton, as individuals are willing to pony up more money for her, but this also gives Sanders (as well as Carson and other small-donor-heavy candidates) a different kind of advantage: lots of people to go back to. Those small donors haven't \"maxed out\" and given the legal limit of $2,700, meaning they could give again. Meanwhile, around half of Clinton's donors last quarter came from maxed-out donors, according to Politico.\nAmong candidates taking in $1 million or more last quarter, here's each one's total share of small-donor money. Sanders leads, with 77 percent, while Bush and Chris Christie notably have totals under 10 percent.\nOf course, these data provide only a limited look at a candidate's financial situation. Many of these candidates — Bush, notably — have been pulling in many millions more through their affiliated superPACs and other groups.\nCampaign money has some advantages over superPAC money — campaigns get preferential TV ad rates and also directly control their own spending. SuperPACs, meanwhile, have some legal hurdles to clear to avoid \"coordination\" with campaigns (though those hurdles are disappearing, by some accounts).\nSuperPACs, of course, can raise unlimited amounts, meaning they can have fundraising totals many multiples higher than a candidate's campaign itself — Bush's superPAC, Right to Rise, raised $103 million in the first half of this year alone.\nWe won't know what those unlimited fundraising numbers look like for a while, though; superPAC reports aren't due until the end of January.","url":"https://www.npr.org/sections/itsallpolitics/2015/10/16/449035273/clinton-no-longer-the-dominant-campaign-fundraiser"}
