{"authors":["James P. Pinkerton"],"date_download":"2018-10-30 19:54:29","date_modify":"2018-10-30 19:54:29","date_publish":"2016-08-21 22:42:51","description":"I read that all the time that Breitbart News Network (BNN) is “right-wing”—but that doesn’t make it true. | Politics","filename":"data/vaneerConsumption/IsBreitbartRightWingAndHowAboutDonaldTrump.json","image_url":"https://media.breitbart.com/media/2016/04/Meet-up-NYC.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_21__1540929269.html","title":"Is Breitbart Right-Wing? And How About Donald Trump?","title_page":"Is Breitbart Right-Wing? And How About Donald Trump? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"First in a series by James P. Pinkerton:\nI read that all the time that Breitbart News Network (BNN) is “right-wing”—but that doesn’t make it true. Indeed, we might consider who’s making the assertion:\nJust in the last few days, CNN has called BNN “far-right.” The Washington Post labeled it as “arch-conservative,” which one supposes is the same thing. The Huffington Post even equates BNN with the John Birch Society—that is, the old conspiratorial group that accused Dwight Eisenhower of being a communist.\nYou get the idea.\nBy now, folks in “flyover country” are familiar with the Main Stream Media’s favorite ploy of labeling anything that it doesn’t approve of as “right wing.” So just about every Republican politician this side of Sen. Susan Collins of Maine is smacked as “right wing.” Indeed, if you don’t live in New York City or the District of Columbia, you are vulnerable to the MSM accusation that you are some kind of troglodyte knuckle-dragger.\nSo as we can see, among the “smart set” in America today, “right-wing” is the term applied to whatever is deemed to be unlikable and undesirable.\nWe can further note, of course, that “right-wing” is commonly thrown around on the right, too; most of the time, it’s in casual chat, and there’s no real need for rigor or precision in the terminology. Indeed, some on the right seek to actively “own” the label, as in, Damn straight I’m a right-winger, you commie sumbitch, and what are you going to do about it?\nInterestingly, in much of the rest of the world, the phrase “right-wing” is seen as preferable to “conservative.” In continental Europe, for example, “conservative” summons up an association with aristocracy, even theocracy—and “theocracy” is disastrously out of fashion, except, of course, in the rapidly growing Sharia Zones.\nFor instance, France—which, like the US, had a revolution in the 18th century based on popular sovereignty—does not have a “conservative” party. The main party of the right is “small r” republican; that is, it upholds the French revolutionary tradition, going back to the storming of the Bastille in 1789. Even the party that’s further to the right, Marine Le Pen’s National Front, also salutes this revolutionary republicanism. Meanwhile, the word “conservative” is associated with the royal ancien régime, which only a tiny handful of reactionary monarchists wish to see restored.\nIndeed, around the world, it is simply easier to define the political parties—for instance, on such issues as taxing and spending—as being somewhere on the right-to-left spectrum. (In fact, the political usage of “right” and “left” actually began in revolutionary France.)\nYet here in America, as we have seen, “right-wing” is typically intended as an insult—“the right-wing Jerry Falwell,” “the right-wing Fox News,” and, more recently, “the right-wing Breitbart.”\nIndeed, the recent surge of anti-Breitbart invective is all the more interesting, as BNN has now become a hub—some would say the hub—of the new intellectual ferment on the right. While other publications and think tanks are still preoccupied with such issues as the proposed liberation of Syria, or opposition to gay marriage, or the elucidation of the fine points of theoretical constitutionalism, BNN has focused on newer, hotter, issues, such as immigration, homeland security, trade, and outsourcing. And as Donald Trump has demonstrated, these newer issues have proven to be far more compelling to the voters—including the all-important first-time voters—than the older ones.\nSo yes, it’s true, there has been a sort of ideological convergence between BNN and Trump. As Washington Post reporter Robert Costa said recently, “The beating heart of Trumpism started at Breitbart.” And now, of course, BNN’s Executive Chairman, Stephen K. Bannon, has taken a leave of absence to become CEO of the Trump campaign.\nBannon is undoubtedly pleased that BNN has been having so much impact, and yet, in the meantime, he is personally on the receiving end of the usual MSM “right-wing” treatment:\nCNN labels him “a right-wing media executive,” while Tablet describes him as “a right-wing polemical filmmaker.” And The New Yorker describes Bannon as a “right-wing enragé whose business is appealing to ultra-conservative Tea Party types.”\nAnd now, of course, Bannon is running the Trump campaign—and, to the MSM, this all the more horrible. As The New Republic explained to its lefty readership, “Trump’s campaign changes represent the triumph of the right-wing echo chamber,” and another piece in The New Republic further explained the “dangerous” political situation:\nBy all reports, Bannon wants to “let Trump be Trump”—to rile up the right-wing base with incendiary rhetoric and launch vicious attacks on Hillary Clinton.\nSo as we can see, the attempt to paint BNN as “right-wing” has now become the further attempt to paint Trump as “right wing.” In this reckoning, Bannon is the common thread: BNN is right-wing, Bannon is a right-winger, ergo, Trump must be a right-winger.\nNeedless to say, Trump’s political foes are fine with that simple formulation. For example, one of the leaders of the #NeverTrump Republicans, Rick Wilson, took time out from masterminding the Evan Mcmullin for President campaign to snipe,\nIf you were looking for a tone or pivot, Bannon will pivot you in a dark, racist and divisive direction. It’ll be a nationalist, hateful campaign.\nAnd of course, Hillary Clinton’s campaign declares itself to be delighted at this turn of events—hence the August 17 headline in Politico: “Clinton campaign: Bring on Breitbart/Long silent on Trump Tower turmoil, Clinton team casts new aide as a right-wing propagandist.”\nIndeed, the earnest hope of the #NeverTrump-Hillary Alliance is that if Trump is pigeonholed as a “right-winger,” he can’t possibly win.\nYet perhaps the #NeverTrump-Hillaryites have miscalculated. And why is that? For three reasons:\nFirst, the best propaganda efforts of their foes notwithstanding, it’s not at all clear that BNN, Bannon, or Trump are “right-wingers,” at least as the term is normally understood. Alas, the parsing out of this point will be complicated and protracted; we will take it up in subsequent installments of this series.\nSecond, in the here and now, we can observe that multi-party electoral contests change the political dynamic. The 2016 presidential election after all, is not a two-way race, but rather a four-way race; many people are so dissatisfied with the two major-party candidates that they are seriously considering, for the first time, voting for a third- or fourth-party candidate. And so today, the Libertarian Party nominee, Gary Johnson, is winning 8.6 percent of the vote, according to the RealClearPolitics polling average, and Jill Stein, the Green Party nominee, is winning 3.1 percent.\nAnd so we can see why Hillary, who has a five-point lead in the same RealClear average, is nonetheless polling down in the low forties—42.6 percent, to be precise.\nWe can further recall interesting things happen in multi-party races. For example, in 1860, the country was so divided that there were, in fact, four major-party candidates. Thus Abraham Lincoln, running as the candidate of a newbie party started only six years earlier, the Republicans, squeaked into the presidency with just 39.8 percent of the popular vote. More recently, other presidents, too, such as Woodrow Wilson and Bill Clinton, won with percentages in the low forties.\nSo yes, it’s a commonplace that national elections are won in the center and that outright fringe candidates never win. But in the new math of a multi-candidate field, victory can go to the candidate with the strongest and most motivated base.\nThird, this year, the center is definitely floating, as the issues-menu is shifting. Indeed, in 2016, both the Republican and Democratic nominees are talking about issues that were barely heard four years ago.\nIn 2012, Mitt Romney, for example, rarely if ever talked about crime, or closing the border, or undoing lousy trade deals. Indeed, his main claim to fame was his record at Bain Capital. And while he was proud of earning a fortune in private equity, his detractors easily defined him as an outsourcer/layoffer/profiteer. So it was no wonder that seven million white voters didn’t bother to show up at the polls in ’12: Were they really expected to vote for more outsourcing and more job-shrinking? Or for the occasional bit of vainglorious attempted foreign-nation-building?\nAs we well know, this year’s Republican nominee, Trump, is different. Yes, he has the personal edge of a “right-winger,” but except for crime and immigration, his policies are actually rather moderately right-of-center—Eisenhowerian, one might say. So whereas Romney actively repelled white working-class voters with his plutocratic financialism, Trump is attracted them with his Ike-like Main Street practicality—and attracting them in record-setting numbers.\nMeanwhile, on the Democratic side, in 2012, Barack Obama ran for re-election on a “four more years” platform; in his first term, he tightly embraced the “neoliberal” agenda of interventionist globalism and free trade, coupled with bailouts for banks and proposed cuts in earned entitlements such as Social Security.\nYet this year, Hillary Clinton, under pressure from Bernie Sanders, has shifted on many of the stances that she once shared with Obama. She is still an interventionist, open-borders globalist, of course, but she has flip-flopped on the Trans-Pacific Partnership, and she now says she supports expanding Social Security.\nSo we can fairly ask: As the issues have all changed around, where, now, is the center? It’s obvious: The middle has moved—on trade, on entitlements, on the overall attitude toward big banks, Wall Street, and much of Corporate America.\nAnd here again, shrewd observers have noted the impact of BNN and Steve Bannon. On August 17, the day Bannon’s new move was announced, the Post’s Robert Costa—a veteran of conservative journalism before he somehow got hired by the MSM—tweeted out,\nWhen I was with Bannon years ago in Pella, Iowa, with [Sarah] Palin, he predicted populism would take over GOP. Some people chuckled. He did not.\nIn a second tweet, Costa continued,\nFor Bannon, this is a career moment. He embraced Palin and populism, made Breitbart the HQ for what would become Trumpism.\nSo are Bannon and Trump to be defined as populists? At a time when two-thirds of the voters believe that the country is on the wrong track, a throw-the-bums-out populism might seem to be a strong message—especially when Hillary, the quasi-incumbent, is trying to win, in effect, a third term for Obama.\nYet in fact, BNN defines itself differently. BNN Editor-in-Chief Alexander Marlow, who has been at Bannon’s side for the past few years—thus helping the site to surge in readership and influence—declares that BNN is “populist-nationalist.”\nHmm. Populist-nationalist. Now what does that mean? We’ll take up the question in the next installment.\n###","url":"https://www.breitbart.com/politics/2016/08/21/breitbart-right-wing-donald-trump/"}
