{"authors":["Martha Sorren"],"date_download":"2018-10-31 01:35:44","date_modify":"2018-10-31 01:35:44","date_publish":"2014-08-12 19:39:44","description":"There are a lot of big purchases you can make in Kim Kardashian's iPhone game, like an apartment or house. Or some really expensive clothing. (This is a world where a plane ticket to London costs less than a pair of shoes.) But is it worth it to buy…","filename":"data/vaneerConsumption/IsBuyingaCarinKimKardashianiPhoneGameWorthItNopeAbsolutelyNot.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e0a92020-e68e-492d-b0e9-f64162ccc54f.PNG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35442-is-buying-a-car-in-kim-kardashian-iphone-game-worth-it-nope-absolutely-not_1540949744.html","title":"Is Buying a Car in Kim Kardashian iPhone Game Worth It? Nope! Absolutely Not","title_page":"Is Buying a Car in Kim Kardashian iPhone Game Worth It? Nope! Absolutely Not","title_rss":"NULL","source_domain":"bustle.com","text":"There are a lot of big purchases you can make in Kim Kardashian's iPhone game, like an apartment or house. Or some really expensive clothing. (This is a world where a plane ticket to London costs less than a pair of shoes.) But is it worth it to buy a car in Kim Kardashian: Hollywood? In a word: no. In order to have the option to purchase a car, one must first own a house with a garage.\nAfter forking over thousands of dollars on a place, you can scroll through your car options. The game allows you to ride in style in a number of luxury vehicles from Banshees to Roasters, but at a steep price. The cheapest car you can buy is a Range Rover for $20,000 while the fancier ones can run you 150 K stars.\nIt can take awhile to rack up that kind of cash. I didn't have the funds until after I'd played for several weeks. But now that I bought the car, I totally regret it. Not only does it say \"Kim Kim\" on the hood, but it's totally useless, and even hinders my game playing.\nHere are four reasons why you should totally not buy a car in Kim Kardashian's game.\nYOUR OPTIONS ARE PRETTY LIMITED\nDepending on how expensive your house was, your car choices change. At your Hollywood apartment, you can only have a Rover. But if you splurge for the Punta Mita mansion you get a few more options. Unfortunately that means you have to pay premium on the house and the car.\nTHEY'RE REALLY EXPENSIVE\nThe price of the cars basically guarantees that you'll have to fork over real dollars to buy K stars. After weeks of playing and lots of saving, the most K stars I've been able to rack up is 50. That's nowhere near the 100 required for a Banshee or heaven forbid the 320 K stars needed to buy a helicopter. (Available when you purchase the London loft.) I can't see myself ever being able to reach those kind of numbers, even with my tricks to getting K stars for free.\nYOU STILL HAVE TO PAY TO USE IT\nOwning a car basically allows you to stop using the bus system to get around. Unfortunately, it costs the exact same to use your car as it does to use the bus. What's the point of owning a vehicle if I have to pay the same amount to use it? At least I did't have to shell out $20,000 to start using the bus system.\nTHEY BLOCK ENERGY SPOTS\nHere's the absolute worst part of owning a car. Apparently once you purchase it, it never goes away. That means it blocks anything that was on the far left side of the screen and unfortunately in a few locations there were energy spots there. The pigeon in Tribeca? Blocked.\nIs this game seriously trying to tell me that the car I bought in Hollywood followed me to New York? Because I sure didn't drive it there. Nope, I still had to pay for the plane fee and now I can't even tap a pigeon for some money. (Yes, I'm aware I sound slightly ridiculous.)\nI'm not sure what happens when you buy a second car, or if it lets you interchange between the two of them. I'm not about to find out, either. Although, even I have to admit that owning a helicopter would be pretty sweet.\nIt's my inner Scott Disick coming out. But I'm sure it's just as lame as the cars are — expensive and in the way.\nImages: Kim Kardashian: Hollywood (5)","url":"https://www.bustle.com/articles/35442-is-buying-a-car-in-kim-kardashian-iphone-game-worth-it-nope-absolutely-not"}
