{"authors":["Ben Bradford","Capital Public Radio","Dan Morain","Byrhonda Lyons"],"date_download":"2018-10-30 22:51:53","date_modify":"2018-10-30 22:51:53","date_publish":"2018-07-06 00:46:41","description":"The California Environmental Quality Control Act is the focus of heated debate, with environmentalists saying it's a success but critics saying it's been weaponized to impede housing.","filename":"data/vaneerConsumption/IsCaliforniaslegacyenvironmentallawprotectingthestatesbeautyorblockingaffordablehousing.json","image_url":"https://calmatters.org/wp-content/uploads/Sedonaen-e1530837980564.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939913.html","title":"Is California’s legacy environmental law protecting the state’s beauty or blocking affordable housing?","title_page":"Is California’s legacy environmental law protecting the state’s beauty or blocking affordable housing? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Redwood City approved more than a year ago the kind of affordable-housing project California desperately needs: a 20-unit building, downtown, near transit lines, in the heart of Silicon Valley, where the state’s housing crisis is most severe. The developer was a nonprofit, Habitat for Humanity Greater San Francisco.\nBut today the lot remains vacant, except for a row of portable toilets, a trailer and a dumpster.\nAn attorney who works out of a two-story home behind the lot filed a lawsuit against the project last year, and it has since been stalled. He contends the city’s approval of the apartments violated a sweeping, decades-old environmental law, because the building could increase traffic. The Habitat building could also block the view from his home’s rear windows.\nIs he using the law to preserve California’s natural beauty, or is he merely denying someone else’s affordable home?\nFor critics of the California Environmental Quality Act, or CEQA, this case is a poster child for the need for reform. Signed by Gov. Ronald Reagan in 1970 and often referred to as “see-kwuh,” the law calls for “preventing environmental damage, while providing a decent home and satisfying living environment for every Californian.”\nEnvironmentalists say CEQA does just that, supplying some of the strongest protection and transparency in the nation.\n“CEQA is the fundamental law in California for environmental protection that also protects the right of the public to be informed about projects that are going into our neighborhood,” said David Pettit, an attorney with the Natural Resources Defense Council.\nBut critics, particularly developers, say court decisions and opportunists have broadened and weaponized the law so it actively impedes housing, particularly in urban areas.\n“This is not about the environment,” said Jennifer Hernandez, an attorney at Holland & Knight and one of the state’s most vocal advocates for change to the law. “This signature environmental law is being hijacked to advance economic interests.”\n“Conscience Of The Community’’\nCEQA requires that new public and private projects undergo rigorous reviews to prove they will not cause significant harm to the existing environment. If they will cause harm, developers can be forced to pay to mitigate it.\nGovernment agencies and planning departments certify projects have complied with the law when approved. But CEQA relies on another, atypical enforcement mechanism that critics call unbalanced: the public.\nAnyone can file a lawsuit challenging that a project has violated the approval process, even without disclosing their identities.\n“CEQA lawsuits can be filed anonymously. And they can be filed by people who have only economic competition at stake,” said Hernandez, whose firm is defending Habitat pro bono. “They can be filed by competitors, unions — frankly, racist neighbors. Anybody.”\nHernandez analyzed CEQA lawsuits in the Bay Area over a three-year period and found prominent environmental groups brought only 13 percent of the cases.\nThe lawsuit against Habitat for Humanity is Geoff Carr’s second, and the fourth he’s threatened. He’s an attorney who specializes in criminal defense, not environmental law. But he’s becoming something of an expert.\nInside his law office, he points out to a high-rise building across the street. “We got in late to fight that one,” he said of his CEQA threat against the apartments, “and we only got a floor off it and a little bit of change.”\nAcross the street from Habitat’s vacant lot, a developer canceled a 91-unit condo project outright. Carr says he threatened a CEQA suit and that once the developer “found out we were going to the mat with him,” he pulled the plug.\nBut Carr is most proud of a building down the block from his office, across the street from Redwood City’s historic courthouse.\nThe developer in that case, Steve Dostart, wanted to build a large office building. But Carr, who called the original plan “another plastic piece of crap,” says they negotiated a smaller, eight-story building.\n“We were the conscience of the community,” Carr said. “We gave and they gave, and I think they got an award for that building.” Dostart has said that the negotiated building is an improvement on the original proposal, according to a local media outlet.\nFor Carr, CEQA is the best tool to defend against what he sees as greedy developers and complacent city officials.\n“I don’t want to be too pejorative about the City Council of Redwood City, but I hate them,” he said. “They’re small-minded peeves, unfortunately.”\nMaureen Sedonaen, CEO of the Habitat for Humanity chapter, says Carr’s actions are not simply impeding encroaching development: They hurt needy residents.\n“It’s always easy to think about ‘It’s a lot and it’s a project and we’re stopping it,’ but we’re talking about 20 families being able to permanently stay in the Bay Area,” she said.\nRedwood City has sought to streamline housing approvals downtown in recent years by preemptively performing the in-depth environmental analysis CEQA requires, as part of a larger development plan. The city can declare that projects conform to the plan and are exempt from performing their own analysis — a common tactic by local governments to encourage development.\nBut citizens can still sue those exemptions.\n“The thing that works is you have to find some way where they’re violating their own plan, and it’s not that hard to do,” Carr said.\nHernandez says it’s so easy for plaintiffs to win that a project’s funding will immediately freeze once a suit is filed.\nThat’s partially because of the law’s sweeping definition of “environment,” which she sums up this way: “The view from a parking lot is a scenic vista protected under CEQA. … My environment is where I get to park, and what I get to look at through my front window, and if you change that, I’m going to object and I’m going to use CEQA.”\nHabitat for Humanity fronts its own money, and Sedonaen says she may greenlight construction on the Redwood City building even before the lawsuit is resolved. That’s a gamble. Losing a CEQA case can force a project to restart the approval process from scratch, sucking up time and money.\nIn the meantime, she says the price continues to rise anyway. The nonprofit originally estimated the project would cost $13 million. That has now risen to $17 million.\n“The delay in this process has cost us several million dollars out of a nonprofits pocket that we could be putting toward another housing development, and shame on the people that are doing it,” Sedonaen said.\n‘A Challenge Every Step Of The Way’\nCritics contend that CEQA is the most significant factor in California’s housing-affordability crisis — but the data does not show that.\nUC Berkeley environmental law professor Eric Biber is part of a team researching the barriers to new housing in California. The initial leg of the study looked at projects with five units or more approved in five Bay Area cities, how long it took for their approval, and what steps the cities required.\nIn San Francisco, Oakland, Redwood City, Palo Alto and San Jose, Biber says CEQA was not an overriding obstacle.\n“I think it probably gets more attention than it deserves,” he said. “I like to think of CEQA as a symptom, not a cause of the underlying challenges we face in producing more housing in urban areas in California.”\nOut of 254 projects approved over a three-year period, only seven faced CEQA lawsuits, according to the study’s most recent data, which is still preliminary. Most of those suits also allege other non-CEQA violations of state zoning and planning law.\nIn other words, the environmental law that has drawn so much ire from developers is used to litigate only a small portion of projects and, without it, those projects would likely end up in court, anyway.\nBiber thinks the barriers to development are more philosophical: Landowners are often resistant to new development near them.\n“The reason that CEQA is both triggered and used as a lawsuit is to respond to underlying political fights at the local level about development,” Biber said. “And those political fights would occur anyway.\nThe stalled Habitat for Humanity project in downtown Redwood City conforms to Biber’s findings almost perfectly. The lawsuit alleges violations of CEQA, but also other state zoning and planning law. And the project’s developer, despite building throughout the Bay Area for almost three decades, has rarely faced a CEQA lawsuit. In fact, Sedonaen says this is Habitat for Humanity Greater San Francisco’s first.\n“It’s so unique,” Sedonaen said. “We’ve never had a project stopped for this reason, and we’ve never had a CEQA lawsuit used against us in our history.”\nThe project faced other obstacles prior to the lawsuit. To win approval from the city, it has shrunk significantly from what Sedonaen envisioned in 2014. The six-story building is less than half the size of the original proposal.\n“It’s been a challenge every step of the way,” Sedonaen said.\nBiber says paring back CEQA would do little to change the political dynamics that drive up the cost of projects in cities, but could remove a check on development in less densely populated areas of the state. Put another way: It could promote sprawl.\n“I don’t think you’d see a major moving of the lever on [urban] development,” Biber said. “But you might open up for a lot more sprawling development that would significantly undermine the state’s climate goals.”\nBut Sedonaen and Hernandez think his findings do not capture how heavily the threat of litigation weighs on urban developers, starting when they propose projects.\n“We have to pick projects where we don’t think this is going to happen,” Sedonaen said.\nStudies have tracked the number of approved projects and filed lawsuits, for instance, but not threats of lawsuits used to win concessions or canceled projects.\nHernandez suggests the threats outnumber the actual lawsuits, comparing CEQA abuse to an iceberg. “The filed lawsuits are the tip,” she said. “Underneath the surface is the 90 percent of the iceberg, and it’s why we’ll spend three years trying to get a project approved. And every one of those days adds to the cost of housing.”\nBen Bradford is state government reporter for Capital Public Radio. The California Dream series is a statewide media collaboration of CALmatters, KPBS, KPCC, KQED and Capital Public Radio with support from the Corporation for Public Broadcasting and the James Irvine Foundation.","url":"https://calmatters.org/articles/is-californias-legacy-environmental-law-protecting-the-states-beauty-or-blocking-affordable-housing/"}
