{"authors":["Alice Broster"],"date_download":"2018-10-31 01:49:03","date_modify":"2018-10-31 01:49:03","date_publish":"2018-09-06 14:25:24","description":"From the murky streets of Peaky Blinders to the rolling hills in Wuthering Heights, Charlotte Riley looks comfortable in whatever role she is thrown into. She has been on our screens now for the last few years and established herself as one…","filename":"data/vaneerConsumption/IsCharlotteRileyMarriedThePressActressHasAnAListHubby.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/213dfb39-45fb-4193-aaf5-85fc9cf030b1-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-charlotte-riley-married-the-press-actress-has-a-list-hubby-11770963_1540950543.html","title":"Is Charlotte Riley Married? The 'Press' Actress Has An A-List Hubby","title_page":"Is Charlotte Riley Married? The 'Press' Actress Has An A-List Hubby","title_rss":"NULL","source_domain":"bustle.com","text":"From the murky streets of Peaky Blinders to the rolling hills in Wuthering Heights, Charlotte Riley looks comfortable in whatever role she is thrown into. She has been on our screens now for the last few years and established herself as one seriously talented actress. And she is set to show the nation what she's made of again as she stars alongside Tom Chaplin in new, gritty, BBC drama Press. She is definitely one busy girl which got me wondering, what is her off-screen life like and is Charlotte Riley married?\nThe short answer is, yes she is and she went where so many women have wanted to go. I know I am certainly jealous. She only went and married ridiculously cool and smoulderingly gorgeous Tom Hardy. Girl, if I had a hat I would take it off to you. I know. These two are serving serious couple goals.\nBut how did they meet? Well, The Sun reported that after Riley finished her degree at Durham University, she attended the London Academy of Music and Dramatic Art, graduating in 2007, her first big break was two years later in ITV’s adaptation of Wuthering Heights as Cathy. And who should play her Heathcliff, I hear you ask? Only her husband-to-be (not that they knew it then), Hardy. It is so perfect, it’s like it was written.\nJoe Maher/Getty Images Entertainment/Getty Images\nThe pair must have really hit it off as in July 2014, they tied the knot. In a very private ceremony in the south of France, a source told The Sun that whilst the couple didn’t want a big flashy wedding, “It was a beautiful, low-key day made even more special because they just had their closest friends and family around them. Tom's son, Louis played a key role during the ceremony, and they made certain to pick a stunning and private setting.\" Now that is a ceremony I would have liked an invite to.\nTristan Fewings/Getty Images Entertainment/Getty Images\nThey’re not just a dreamy romantic couple either. Wuthering Heights was just the first production that Riley and Hardy would appear alongside each other in. They went on to star in The Take and also, potentially most notably, Peaky Blinders, together years later.\nHowever, although they're happy to be on camera together when portraying fictional characters, the rules are different when it comes to their actual real lives. The couple are fiercely private about their relationship and their children. In fact, in 2015, Riley announced she was expecting her first child with Hardy in the most low-key way. Instead of writing a gushing Instagram post or featuring in a four-page photo. the actress merely turned up to the Mad Max: Fury Road red carpet, with her bump on show, and said nothing more.\nSpeaking to The Telegraph about her preference of keeping her private life just that, Riley said: \"I don’t feel the need to keep people updated regarding where I am and what I’m doing. I don’t want to put myself out there like that. I enjoy privacy and anonymity.\" All the power to you, girl.\nJohn Phillips/Getty Images Entertainment/Getty Images\nAhead of the premiere of Riley's latest project, BBC drama Press, it's been reported by the Daily Mail that she is expecting her second child. I contacted a representative for Riley to confirm the news but am yet to hear back.\nPersonally, I cannot wait to see Riley in her new role as deputy news editor of The Herald Holly Evans. And whilst they may keep their family life super private, Riley and Hardy may have melted my soul a bit. You only have to look at red carpet pics of them to know they’re completely loved-up.\nPress premieres on BBC One on Thursday at 9 p.m.","url":"https://www.bustle.com/p/is-charlotte-riley-married-the-press-actress-has-a-list-hubby-11770963"}
