{"authors":[],"date_download":"2018-10-23 00:02:05","date_modify":"2018-10-23 00:02:05","date_publish":"2016-01-28 13:30:38","description":"An Egyptian affiliate of the jihadist Islamic State group claimed responsibility Thursday for an attack that killed a colonel and three soldiers in North Sin...","filename":"data/vaneerConsumption/ISclaimsdeadlyattackonEgyptiansoldiersinSinai.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g9wa-2vdWmEltwXfba0ce28e63291cc6c-128_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420975_IS-claims-deadly-attack-Egyptian-soldiers-Sinai_1540252925.html","title":"IS claims deadly attack on Egyptian soldiers in Sinai","title_page":"IS claims deadly attack on Egyptian soldiers in Sinai | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"IS claims deadly attack on Egyptian soldiers in Sinai\nAn Egyptian affiliate of the jihadist Islamic State group claimed responsibility Thursday for an attack that killed a colonel and three soldiers in North Sinai, where it is spearheading a deadly insurgency.\nWednesday's bombing in North Sinai's provincial capital of El-Arish targeted the troops' armoured vehicle when it was engaged in a search operation, security officials and emergency services said.\nAnother 12 soldiers were wounded in the blast.\nJihadists in Egypt's Sinai Peninsula have pledged allegiance to the Islamic State group and killed hundreds of policemen and soldiers\nIn a statement posted on jihadist forums, IS affiliate the Sinai Province said its members used explosive devices to target the army west of El-Arish.\nJihadists have regularly attacked security forces in the peninsula since the army toppled Islamist president Mohamed Morsi in July 2013.\nThey say their attacks are in retaliation for a government crackdown targeting Morsi supporters that has left hundreds dead and thousands imprisoned.\nThe authorities say hundreds of policemen and soldiers have been killed in attacks, mainly in North Sinai, since 2013, although there have also been attacks in the Nile Delta and in Cairo.","url":"https://www.dailymail.co.uk/wires/afp/article-3420975/IS-claims-deadly-attack-Egyptian-soldiers-Sinai.html"}
