{"authors":[],"date_download":"2018-10-22 22:34:35","date_modify":"2018-10-22 22:34:35","date_publish":"2014-05-09 19:20:10","description":"For the Pentagon, climate change is \"a mission reality, not a political debate,\" and they're getting ready.","filename":"data/vaneerConsumption/IsClimateChangeRealThePentagonSureThinksSo.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/434921/140511-philippes-us-heli-survey-1245p_5713d74cd274e2630fe536dcc98497ff.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_military_climate-change-real-pentagon-sure-thinks-so-n101701_1540247675.html","title":"Is Climate Change Real? The Pentagon Sure Thinks So","title_page":"Is Climate Change Real? The Pentagon Sure Thinks So ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nU.S. military and intelligence agencies are increasingly monitoring and preparing for how, when and where the consequences of a warmer planet will collide with national security, requiring the eventual need to deploy American troops to weather-torn lands.\nAs climate-change arguments continue at home — including pundits who assert the scientific consensus on the issue is overblown or concocted — current and former Department of Defense officials are mapping future strategies to protect U.S. interests in the aftermath of massive floods, water shortages and famines that are expected to hit and decimate unstable nations.\n“For DoD, this is a mission reality, not a political debate,” said Mark Wright, a Pentagon spokesman. “The scientific forecast is for more Arctic ice melt, more sea-level rise, more intense storms, more flooding from storm surge, and more drought.\n“Those changes shape the future operating environment, help us predict missions we'll have to undertake, and create challenges and constraints on how we operate on our bases,” Wright said. “We're taking sensible measured steps to mitigate the mission risk posed by climate change.”\n“Therein is a recipe for the kind of instability that will inevitably involve the United States in humanitarian assistance, disaster relief or, indeed, in a regional conflict.”\nThe White House on Tuesday released an alarming litany of current and near-term weather calamities that Americans should plan to endure due to ongoing atmospheric shifts. That report also noted: “The implications of climate change for U.S. national security are significant.” And the White House cited a 2010 Pentagon review that, for the first time, acknowledged climate change would play a “significant role in shaping the future security environment.”\nBut inside and outside the DoD, many experts agree U.S. national security already is being tested by massive unrest, revolts and humanitarian calamities triggered, in part, by climate change.\nThe civil war in Syria, which has left an estimated 100,000 people dead, has its roots in a regional drought, said retired Navy Vice Adm. Lee Gunn, now a member of the military advisory board for CNA Corporation, a non-profit research and analysis organization in Alexandria, Virginia.\n“The current Syrian situation is linked in my mind, in part, to a food shortage and drought in the region, which among other things drove people from the farms to the cities,” Gunn said. “The cities were unprepared in Syria to deliver the services demanded by a rapidly increasing population. Whatever the other stresses were that the Syrian government was undergoing, this had the potential to accelerate that set of conditions.”\nThe 2011 Arab Spring — a torrent of civil wars, ruler ousters and riots that spread from North Africa into the Middle East — similarly can be tied, in part, to a colossal winter drought in China plus record heat waves and flooding in several other countries, including Russia, where much of the wheat for the Middle East is grown, Gunn said.\n“There was a drought and a wheat shortage that resulted in an increase in wheat prices and, therefore, a increase bread prices, a staple in North Africa,\" Gunn said.\n“For DoD, this is a mission reality, not a political debate.\"\nU.S. security experts are scoping a new potential hazard: the rice fields of Southeast Asia, and specifically Vietnam. The CNA military advisors already have predicted that melting of Himalayan glaciers would add to a sea-level rise that could ruin that rice-producing basket. The same flooding could ravage Bangladesh, creating a potential, mass refugee flow into India, and also threaten the fresh-water resources of India and Pakistan — nuclear-armed nations that need to share and collectively manage their water, Gunn said.\n“Our sense of that is it’s going to be the case where these people who need to cooperate are essentially going to be torn apart by the conditions that are changing,” Gunn said.\nAmong U.S. security and military strategists, perhaps an even higher concern involves already unstable governments and fragile societies that probably would not withstand mass weather disasters. If those governments crumble, terrorists could fill the resulting power voids, said Dennis McGinn, assistant secretary of the Navy for energy, installations and environment, and a retired Navy vice admiral.\n“We're taking sensible measured steps to mitigate the mission risk posed by climate change.”\n“The last thing in the world these nations need are the severe and more frequent effects of bad weather, including crop failures,” McGinn said. “Therein is a recipe for the kind of instability that will inevitably involve the United States in humanitarian assistance, disaster relief or, indeed, in a regional conflict.”\nMcGinn’s feel for the nexus of climate change and national security is based on his time as president of the American Council On Renewable Energy, and from his collaboration with Lee Gunn on the CNA military advisory board.\nShould weather disasters overwhelm and destabilize governments, ultimately wiping out the existing rule of law, “that’s where you get all manner of bad folks filling that vacuum,” McGinn said. “It could be terrorists. It could be paramilitary, crime syndicates in the absence of good governance. That’s the big concern.”\n“We (the military) have a strong history of being apolitical. We also understand risk. We deal with life-and-death risk,” McGinn said. “This gives us a credibility and a perspective that is necessary in dealing with all kinds of threats to national security, including threats due to climate change.”","url":"https://www.nbcnews.com/news/military/climate-change-real-pentagon-sure-thinks-so-n101701"}
