{"authors":["Associated Press"],"date_download":"2018-10-23 03:47:12","date_modify":"2018-10-23 03:47:12","date_publish":"2016-01-29 18:58:08","description":"WASHINGTON (AP) — It's fair game. It's ancient history. It's political. It's personal. Like it or not, the long-running drama of Hillary Clinton's marriage —...","filename":"data/vaneerConsumption/IsClintonmarriagearehashorrelevantVotersseemsplit.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:65c36240003b44aba478f98a87f27804-3bmscybNe842cce83474b58ed99a-544_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423269_Is-Clinton-marriage-rehash-relevant-Voters-split_1540266432.html","title":"Is Clinton marriage a rehash or relevant? Voters seem split","title_page":"Is Clinton marriage a rehash or relevant? Voters seem split | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Is Clinton marriage a rehash or relevant? Voters seem split\nWASHINGTON (AP) — It's fair game. It's ancient history.\nIt's political. It's personal.\nLike it or not, the long-running drama of Hillary Clinton's marriage — her husband's infidelity and how she dealt with it — is back as a subtext in this year's presidential race.\nFILE - In this Dec. 19, 1998 file photo, First lady Hillary Rodham Clinton watches President Clinton pause as he thanks those Democratic members of the House of Representatives who voted against impeachment. The long-running drama of Hillary Clinton's marriage _ her husband's infidelity and how she dealt with it _ is back as a subtext in this year's presidential race. (AP Photo/Susan Walsh)\nThe issue has a new, sharper edge this time: Voters are processing old events in an era of heightened concern about sexual assault and after Republican Donald Trump characterized candidate Clinton as an \"enabler\" of her husband's indiscretions and alleged that she had helped to discredit his accusers.\nBoth Clintons have tried not to engage, each uttering the identical \"I have no response\" when questioned separately about the matter.\nAnd plenty of Americans are right there with them on that: Bring up Bill's behavior and Hillary's coping techniques and they suddenly become monosyllabic and start glancing around for the exits.\nBut Hillary Clinton has plopped the question squarely in Americans' laps not long before the Iowa caucuses Monday open voting in the 2016 campaign.\n\"I'm going to let the American voters decide what's relevant and what's not relevant,\" she said when asked about Trump's accusations during a recent Democratic debate.\nInterviews with dozens of potential voters around the country reveal strong and opposing views about how — and whether — Clinton should be measured by how she dealt with her husband's behavior.\n\"The personal stuff is irrelevant,\" pronounces Brian Brown, a 56-year-old former professor and Democrat from Antrim, New Hampshire, who's having coffee with a friend at Dunkin' Donuts.\n\"I don't like how she swept it under the rug, but then again, you don't know what goes on behind the scenes,\" says Jeff Daignault, a 46-year-old independent from Largo, Florida, who's having lunch at a highway rest area.\n\"Hillary was an accomplice,\" says Amy Stricker, a 57-year-old conservative from Rochester Hills, Michigan, who's eating a sandwich in Denver, Colorado, on her way to visit family in the state.\nJudith Hoffman, a 64-year-attorney from Columbus who plans to vote in Ohio's Republican primary but isn't sure whom she'll support, gives voice to the conflicting impulses that are aswirl.\nShe thinks the thrice-married Trump, who's known to have had one affair and has hinted at others, is hypocritical for the raising the issue.\nShe thinks Bill Clinton's past is a distraction from more important matters.\nShe doesn't respect Hillary Clinton's decision to \"put up with\" her husband's infidelity.\nBut she pauses on the question of whether Clinton's handling of her husband's behavior diminishes her standing as an advocate for women.\n\"I don't know that anyone can be responsible for another person,\" she says. But then she concludes that her gut reaction to the question is \"yes,\" it does mar Clinton's reputation as a champion of women.\nBrad Johnson, a junior at the University of Cincinnati, where he is president of the College Republicans, sees the matter as a character question and thinks he sees hypocrisy.\nClinton is \"all about women's rights,\" he says, yet \"she was ruthless of women who accused her husband of rape.\"\nStill, he adds, \"my guess is that it doesn't change anybody's mind about her.\"\nClinton's campaign has rejected the notion that she was actively involved in aggressive efforts by her husband's presidential campaign and the Clinton White House to discredit women who claimed to have had affairs with her husband or to have been sexually assaulted by him.\n\"These are attempts to draw Hillary Clinton into decades-old allegations through fabrications that are unsubstantiated,\" campaign spokesman Brian Fallon said Wednesday. \"Hillary Clinton has spent her whole life standing up for women, and charges to the contrary are grossly unfair and untrue.\"\nAllegations of womanizing, extramarital affairs and abuse have trickled out over the course of Bill Clinton's political life, including a wave of what his campaign referred to as \"bimbo eruptions\" when he first ran for president in 1992 and still more allegations of misbehavior after investigators in 1997 started looking into Clinton's sexual encounters with White House intern Monica Lewinsky.\nClinton was impeached over the Lewinsky affair. In 1998, he agreed to an $850,000 settlement with state worker Paula Jones, who had accused Clinton of exposing himself and making indecent propositions when Clinton was governor. The settlement included no apology or admission of guilt.\nClinton also acknowledged in a deposition that he'd had a single sexual encounter with former TV reporter Gennifer Flowers, who claimed they had a 12-year affair while he was Arkansas governor. Among other accusers: Nurse Juanita Broaddrick in 1999 claimed she was raped by then-state Attorney General Clinton at a Little Rock hotel in 1978. Kathleen Willey, a White House volunteer, claimed Clinton fondled her when she met privately with him at the White House in 1993 to seek a job. Clinton denied the allegations by Broaddrick and Willey.\nFor much of that tumultuous time, Hillary Clinton stood by her husband publicly and cast his accusers as part of a \"vast right-wing conspiracy.\"\nWritings about the Clinton White House years suggest she was more active behind the scenes, helping to drive political and legal strategy to defend her husband during the Lewinsky investigation. Her friend Diane Blair wrote in her diary that Hillary Clinton had called Lewinsky a \"narcissistic loony tune.\" Former Clinton aide George Stephanopoulos, in his 1999 memoir, recalled Clinton in 1992 saying of one woman who claimed to have been propositioned by her husband, \"We have to destroy her story.\" Three people signed affidavits denying those allegations by Connie Hamzy.\nIt's no small matter for Clinton, who draws a lopsided share of her support from female voters and for decades has made advocacy for women a big part of her persona. It's especially important as she tries to attract a generation of younger women who only learned about the Clinton presidency in history class and have come of age in a time of different attitudes toward sexual harassment and abuse.\nClinton herself has made the treatment of sexual assault victims a key issue this campaign.\n\"I want to send a message to every survivor of sexual assault,\" Clinton said in one of her campaign ads last year. \"Don't let anyone silence your voice. You have a right to be heard and you have a right to believed. We're with you.\"\nWhen a young woman asked Clinton at a town-hall meeting in New Hampshire whether that message also applies to those who accused her husband of sexual impropriety, though, her answer was more convoluted.\n\"Everybody should be believed at first until they are disbelieved based on evidence,\" she said.\nIt's tricky territory for her, Republican presidential contender Rand Paul suggested when the matter was raised at the latest GOP debate. \"I don't blame Hillary Clinton at all for this,\" he said, meaning Bill's past. But \"she can't be a champion of women's rights at the same time she's got this that is always lurking out there, this type of behavior.\"\nThe Clintons' complicated marriage has been parsed and pondered for decades. By the 2008 campaign, it wasn't much of an issue.\nBut this time, Trump has shown he's willing to toss a match on the kindling: The GOP presidential contender put out an Instagram video that mashed together photos of Hillary and Bill Clinton, Bill Cosby, onetime White House intern Monica Lewinsky and disgraced former Rep. Anthony Weiner, and ended it with the sarcastic tag line \"true defender of women's rights.\"\nAdd to that, several of Bill Clinton's old accusers are re-airing their allegations now through Twitter, websites and appearances on conservative media outlets, and suggesting that Hillary Clinton was at least supportive of efforts at the time to discredit them.\nClinton's Democratic rival, Bernie Sanders, complains about being asked about the Clintons' \"personal stuff\" when he'd rather focus on issues. But he's also made clear he considers Bill Clinton's past behavior \"totally, totally, totally disgraceful and unacceptable.\"\nMany potential voters, too, seem loath to get into the \"personal stuff.\"\nDemocrat Richard Hoffman, 63, a retired chemist in Littleton, Colorado, thinks it's unfair to lay anything on Hillary Clinton.\n\"If anything, she was the injured party,\" he says.\nSelf-described progressive Rine Kasckow, a junior at the University of Wyoming, says it's time to look forward, not back.\n\"Why do I care if a woman does or doesn't leave her husband?\" she asks. \"It's just a ridiculous notion.\"\nBut the old Clinton baggage — a suitcase with different contents to different voters — still is a burden to be lugged by the former first lady.\nKay Sherman, a 70-year-old Republican from St. Petersburg, Florida, says she doesn't want to judge Clinton on how she handled a tough situation.\nStill, she says, Clinton \"could have stood up for women more.\" Her actions, Sherman says, \"kind of said to women, 'It's OK.'\"\n\"It will probably come up in the campaign,\" says Sherman. \"I'd rather it not, though.\"\n___\nAssociated Press writers Tamara Lush in Terra Ceia, Florida; Ann Sanner in Columbus, Ohio; Holly Ramer in Concord, New Hampshire; Kristen Wyatt in Denver and Emily Swanson in Washington contributed to this report.\n___\nFollow Nancy Benac on Twitter at http://twitter.com/nbenac\nFILE - In this Jan. 26, 1998 file photo, President Clinton emphatically denies having a sexual relationship with former White House intern Monica Lewinsky during a White House event. The long-running drama of Hillary Clinton's marriage _ her husband's infidelity and how she dealt with it _ is back as a subtext in this year's presidential race. (AP Photo/Greg Gibson)\nFILE - In this Nov. 6, 1996 file image taken from video, Monica Lewinsky embraces President Clinton as he greeted well-wishers at a White House lawn party in Washington Nov. 6, 1996. The long-running drama of Hillary Clinton's marriage _ her husband's infidelity and how she dealt with it _ is back as a subtext in this year's presidential race. (AP Photo/APTV)","url":"https://www.dailymail.co.uk/wires/ap/article-3423269/Is-Clinton-marriage-rehash-relevant-Voters-split.html"}
