{"authors":["Anam Syed"],"date_download":"2018-10-30 22:28:45","date_modify":"2018-10-30 22:28:45","date_publish":"2014-08-15 16:34:04","description":"If you like your period pieces a little more gruesome and gritty than the retro glamour of something like Mad Men, look no further than Cinemax's new series The Knick , starring Clive Owen as Dr. John Thackeray and directed by Steven Soderbergh. So…","filename":"data/vaneerConsumption/IsDrJohnThackerayARealDoctorCliveOwenTheKnickWereInspiredByAnotherVeryRealDoc.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/9de78492-baed-4727-868c-7c87aad20b87.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35774-is-dr-john-thackeray-a-real-doctor-clive-owen-the-knick-were-inspired-by-another_1540938525.html","title":"Is Dr. John Thackeray A Real Doctor? Clive Owen & 'The Knick' Were Inspired By Another Very Real Doc","title_page":"Is Dr. John Thackeray A Real Doctor? Clive Owen & 'The Knick' Were Inspired By Another Very Real Doc","title_rss":"NULL","source_domain":"bustle.com","text":"If you like your period pieces a little more gruesome and gritty than the retro glamour of something like Mad Men, look no further than Cinemax's new series The Knick , starring Clive Owen as Dr. John Thackeray and directed by Steven Soderbergh. So what's the scoop on this brand new show as the cable channel throws its hat into the respectable series ring? While it may make you titter to think of the time when Cinemax was almost exclusively associated with late night soft core skin flicks, the channel owes some gratitude to the likes of AMC and Netflix, who disrupted the television drama and made gripping content the only requirement for entry (as opposed to network prestige or having an established drama brand).\nThere's no doubt that a great subject and stellar cast will elevate The Knick into new favorite series territory and in turn elevate Cinemax into a respectable member of the television playing field. Set in the fictional Knickerbocker Hospital in early 1900s New York, the show will highlight the often gruesome history behind many modern medical innovations we take for granted. While the name John Thackeray is fictional, Owen's character has some roots in the truth.\nSeries Trailer MP on YouTube\nThe show portrays Thackeray as a drug addled though trailblazing medical professional; he's based on the real life surgeon Dr. William Stewart Halsted, who was hooked on both cocaine and morphine according to his Johns Hopkins biography. It all began when Halsted was experimenting on using cocaine as an anesthetic, experiments which would result in him injecting himself with the drug and becoming dependent.\nThe bio also reflects Halsted's move to cure his addiction by transitioning to morphine, which just resulted in a dual dependency that would last for the rest of his life. While he earned a reputation as an addict, he was very talented in his field, so much so that despite concerns he arose to position of Chief of Surgery n at Johns Hopkins becoming one of the \"Big Four\" founding professors of the hospital.\nHalsted was indeed forward thinking. According to the Johns Hopkins Institute, he was fond of aseptic techniques (basically contaminant prevention and ensuring sterility), introducing measures for careful tissue handling, wound closure, and introducing the use of rubber gloves in 1890. While sanitary surgery environments seem like a no brainer now, without innovators like Halsted, it wouldn't have been as commonplace.\nBreast cancer survivors also owe him a bit of gratitude as the gifted surgeon who created the Halsted radical mastectomy in the late 1800s. Prior to the Halsted method, treatments were cruel and lacked the surgeon's commitment to asepsis and anesthetic (that last one seems pretty vital because the last thing you'd want after a breast cancer diagnosis is the idea of your doctor prodding and hacking away at your chest without a numbing agent).\nHalsted went on to marry the first nurse to ever wear gloves in the operating room, Caroline Hampton, who did so at his insistence. Halsted commissioned the gloves be made for her after learning the routine disinfectants irritated her sensitive skin. The hospital staff took a liking to the gloves as well and they caught on. They married in 1890, and later took North Carolina to be their retreat away from the city, so perhaps Owen's character will similarly have an operation room romance and subsequent out of state retreat.\nIt's no easy task telling the story of a man who many outlets refer to as \"the father of American surgery,\" least of all in a murky era where rampant drug use flew and anesthesia was an afterthought, but if anyone was up to it, it would be Soderbergh and Owen.\nImage: Mary Cybulski/Cinemax","url":"https://www.bustle.com/articles/35774-is-dr-john-thackeray-a-real-doctor-clive-owen-the-knick-were-inspired-by-another"}
