{"authors":["Caitlin Gallagher"],"date_download":"2018-10-31 01:46:36","date_modify":"2018-10-31 01:46:36","date_publish":"2018-09-14 11:00:53","description":"The number one suspect of American Vandal Season 1 was Dylan Maxwell. The wrongfully accused high schooler won over viewers with his boneheaded antics and detailed phallic drawings, but will Dylan be in American Vandal Season 2? The new season has…","filename":"data/vaneerConsumption/IsDylanInAmericanVandalSeason2JimmyTatroHasBeenBusySinceHisSprayPaintingDays.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/12/e1e85745-d63f-4946-9937-c3b9421ed7e3-1309386-1871315-zoomed.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-dylan-in-american-vandal-season-2-jimmy-tatro-has-been-busy-since-his-spray-painting-days-11899128_1540950396.html","title":"Is Dylan In ‘American Vandal’ Season 2? Jimmy Tatro Has Been Busy Since His Spray Painting Days","title_page":"Is Dylan In ‘American Vandal’ Season 2? Jimmy Tatro Has Been Busy Since His Spray Painting Days","title_rss":"NULL","source_domain":"bustle.com","text":"The number one suspect of American Vandal Season 1 was Dylan Maxwell. The wrongfully accused high schooler won over viewers with his boneheaded antics and detailed phallic drawings, but will Dylan be in American Vandal Season 2? The new season has Peter and Sam investigating a different crime at a different school, so that probably means no Dylan when Season 2 premieres on Netflix on Sept. 14. But Jimmy Tatro is likely doing better than his fictional character, so you can still (kind of) see Dylan outside of American Vandal.\nIn Season 1, Dylan was expelled from Hanover High School when it seemed he was responsible for vandalizing 27 faculty cars with drawings of penises. But through their documentary, Peter and Sam discovered it wasn't possible for Dylan to have perpetrated the crime. Dylan was reinstated at school, but his life didn't actually improve. He and his girlfriend broke up, he didn't get accepted into college, and he felt insulted by the very documentary that exonerated him. By the end of American Vandal, Dylan was arrested for spray painting a penis on Ms. Shapiro's driveway — and this time, he really did commit the crime.\nAmerican Vandal left Dylan with a pretty depressing fate — and don't expect Season 2 to show how he's doing now. Co-creator Dan Lagana explained to Vulture how they wanted to separate Season 2 from this beloved character.\nTyler Golden/Netflix\n\"One of the questions we get most often is, 'Is Jimmy back? Is Dylan back?' We want each season to be its own crime, and we thought that even a cameo would just distract from the new case too much,\" Lagana said.\nBut don't feel bad for Tatro. He has been keeping busy since Dylan's d*ck-drawing days on American Vandal. So if you need your Dylan fix when American Vandal Season 2 premiere, here's where else you can check out Tatro.\nLife According To Jimmy LifeAccordingToJimmy on YouTube Before American Vandal, Tatro already had a fan base due to his YouTube channel Life According To Jimmy. He has more than three million subscribers, but, as he joked about on Instagram, he has been a bit busy in 2018 to post new videos.\n‘Modern Family’ jimmy on Instagram Tatro guest starred in Modern Family Season 9 as firefighter Bill — the \"sweet, chiseled dummy\" whom Alex briefly dates.\n‘Super Troopers 2’ Alberto E. Rodriguez/Getty Images Entertainment/Getty Images Tatro wrote on Instagram how he only had a 20-second cameo in Super Troopers 2. But his connection to Broken Lizard's Vermont state troopers goes back further since they guest starred on a Life According To Jimmy video.\n‘Madden 19’ jimmy on Instagram Besides internet, film, and TV, Tatro has also conquered the world of video games since he appears in Madden NFL 19.\n‘The Guest Book’ TBS Tatro will appear in TBS's anthology comedy series The Guest Book when it relocates to the Barefoot Retreat for Season 2.\n‘The Real Bros Of Simi Valley’ jimmy on Instagram While Tatro has been focused more on other projects, he hasn't given up on his YouTube channel completely since he wrote on Instagram how he wrapped filming Season 2 of his YouTube series, The Real Bros Of Simi Valley.","url":"https://www.bustle.com/p/is-dylan-in-american-vandal-season-2-jimmy-tatro-has-been-busy-since-his-spray-painting-days-11899128"}
