{"authors":["Nicole Pomarico"],"date_download":"2018-10-31 01:41:29","date_modify":"2018-10-31 01:41:29","date_publish":"2018-08-28 12:51:27","description":"Just as quietly as he got engaged last year, it seems like Ed Sheeran might have tied the knot the same way — or did he? In an interview with Access Hollywood on Monday, it appeared that Sheeran admitted he and Cherry Seaborn are already married,…","filename":"data/vaneerConsumption/IsEdSheeranMarriedTheSingerCherrySeabornMightveMadeThingsOfficial.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/d2a10653-0e64-47c9-b804-de536e6c42bb-getty-923472492.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-ed-sheeran-married-the-singer-cherry-seaborn-mightve-made-things-official-10268197_1540950089.html","title":"Is Ed Sheeran Married? The Singer & Cherry Seaborn Might’ve Made Things Official","title_page":"Is Ed Sheeran Married? The Singer & Cherry Seaborn Might’ve Made Things Official","title_rss":"NULL","source_domain":"bustle.com","text":"Just as quietly as he got engaged last year, it seems like Ed Sheeran might have tied the knot the same way — or did he? In an interview with Access Hollywood on Monday, it appeared that Sheeran admitted he and Cherry Seaborn are already married, but considering the conflicting information that's already coming out less than 24 hours later, it's hard to know what the truth really is. But for Sheeran, this is typical. Hasn't he always been the kind of guy who likes to keep his personal life private? (Bustle reached out to Sheeran's rep for comment, but did not receive an immediate response.)\nWhile talking to Access, Sheeran responded to a question asking about his wedding plans by pointing to a ring on that finger — the same one he earlier claimed is an engagement ring that Seaborn made him. At that point, the host, Scott Evans, asked him how he managed to pull that off without anyone finding out, his answer was pretty simple.\n\"I never do anything too public anyway,\" Sheeran said, thanking Evans when he congratulated him.\nThat interview on its own makes it sound like Sheeran's married, right? Maybe not. Later, Sheeran's rep told Access that he didn't \"confirm\" his marriage, so it sounds like we're back at square one.\nAccess on YouTube\nHowever, there are other clues. In a separate interview with Entertainment Tonight, Sheeran opened about his feelings about weddings without explaining if his has already happened or not. ET said they wanted to interview him \"as if you're not already married\" — a comment which Sheeran didn't even flinch at — and asked him about his wedding preferences, which he managed to talk about without giving anything away.\nSheeran said he did not plan to perform at his wedding or have anyone else famous perform either, and when asked about the size of the wedding he'd like to have (or has already had), he said he'd want to keep it small. He said,\n\"I don't like large groups of people at the best of times so... I never wanted a wedding that was lots of people.\"\nSheeran announced his engagement to Seaborn at the beginning of 2018, sharing a sweet photo of the two of them on Instagram, along with a caption that filled his followers in on the news. \"Got myself a fiancé just before new year,\" he wrote. \"We are very happy and in love, and our cats are chuffed as well.\"\nSeaborn has made a few appearances on Sheeran's Instagram since then, but they're not frequent — and he's never really been one to open up about his love life publicly, although she does appear in his new Apple Music documentary, Songwriter, which premieres on Tuesday.\nLet's just hope that Sheeran lets us know what's going on soon. And maybe, if we're lucky, he'll even throw a wedding photo or two out there. Whether they're married or not, it sounds like they're very happy together, and that's all that really matters.","url":"https://www.bustle.com/p/is-ed-sheeran-married-the-singer-cherry-seaborn-mightve-made-things-official-10268197"}
