{"authors":["Sarah Griffiths For Mailonline"],"date_download":"2018-10-23 02:43:29","date_modify":"2018-10-23 02:43:29","date_publish":"2016-01-28 17:53:25","description":"Around 30,000 people have come close to solving the five part puzzle, issued by GCHQ in Cheltenham, Gloucestershire. There are just three days to go to the deadline.","filename":"data/vaneerConsumption/IsGCHQsChristmasteaserthehardestpuzzleintheworld.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACDE6600000578-0-image-a-61_1454006200973.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3421294_Is-hardest-puzzle-world-30-000-people-submitted-entries-GCHQ-s-Christmas-teaser-no-correct-answers-three-days-solve-it_1540262609.html","title":"Is GCHQ's Christmas teaser the hardest puzzle in the world?","title_page":"Is GCHQ's Christmas teaser the hardest puzzle in the world? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There are just three days to go to the\nParticipants have to fill in a grid-shading puzzle to unveil a picture which is just the first of a series of increasingly complex game challenges\nAround 30,000 people have come close to\nInstead of the traditional Father Christmas and reindeer image emblazoned on the front, last year Britain's intelligence and security agency designed a card featuring a cryptographic challenge.\nBut more than a month since Christmas, no-one has managed to solve the tricky puzzles.\nMore than 30,000 have come close to cracking the code and there are just three days left to give it a final try.\nThe agency has even encouraged people by saying the answer is 'not as abstract as you think'.\nBegin by solving part one below. This will reveal how to proceed\nInstead of have the traditional Father Christmas and reindeer image emblazoned on the front, Britain's intelligence and security agency designed a festive card featuring a cryptographic challenge (pictured). But a month after Christmas, no-one has managed to solve the problem. Part one is pictured above\nThe puzzle, which was released on a Christmas card by GCHQ's director, Robert Hannigan, shows a grid.\nParticipants have to fill it in to unveil a QR code, which is the first in a series of increasingly complex challenges.\nThe code can be scanned with a phone which will take participants to the next round.\nPart two consists of six multiple choice questions, including 'which of these is not the odd one out?' with the options of: starlet, sonnet, saffron, shallor, torrent and suggest'\nAnd 'What comes after green, red,brown, red, blue, -, yellow, pink?\nPart two consists of six multiple choice questions, including 'which of these is not the odd one out?' with the options of: starlet, sonnet, saffron, shallor, torrent and suggest'. Another example is shown above\nPart three consists of four questions. The answer to each puzzle is a single word, which can be used to create a URL.\nOne example is: 'Complete the sequence: Buck, Cod, Dahlia, Rook, Cuckoo, Rail, Haddock, ?'\nFIVE PARTS OF THE PUZZLE Part one: Participants have to fill in a grid to reveal a QR code that will take them to the next level of the puzzle. Part two: They have to solve six multiple choice questions to progress. Part three: This part consists of four questions. The answer to each puzzle is a single word, which can be used to create a URL needed to tackle part four. Part four: A similar challenge where participants have to solve three number sequences to make an IP address. Part five: The part that has so far stumped all participants. It is thought to contain pictograms, but with unclear instructions people have to work out the questions, as well as the answers.\nPart four is similar, in that the answers to three questions can be combined to make an IP address.\nBut part five features pictograms without any instructions, meaning participants are not sure what is required, or if they have answered in full.\nGCHQ told The Telegraph the puzzle is not impossible, but admitted it had been set by its top cryptographers, who may well think in a different way to the rest of us.\n'There are solutions which are not immediately apparent,' a spokesman said.\n'You don't necessarily know if you have got all the answers or if there is something you have missed.'\nGCHQ has said that that although approximately 30,000 players have reached the final stage, none of them have managed to complete the brain teaser.\nThe closing date for entries is midnight on January 31 and the complete solution to all stages of the puzzle will be published on the GCHQ website in early February, after all entries have been received and the competition has closed.\nGCHQ's website attracted unprecedented levels of visitors eager to take the challenge over the Christmas period.\nPart four consists of three questions based on sequences (questions shown above). Approximately 30,000 players have completed them to progress to the final stage of the puzzle\nPart five features pictograms (example shown) without any instructions, meaning participants are not sure what is required, or if they have answered in full\nGCHQ told The Telegraph the puzzle is not impossible, but admitted it had been set by its top cryptographers, who may well think in a different way to the rest of us. This challenge is one of many in part five\nWhile 30,000 have come close to cracking the code, there are just three days left to give it a final try and the answer is apparently 'not as abstract as you think', according to the director of GCHQ (shown)\nNearly 600,000 people successfully completed the opening stage of the puzzle - a nonogram which when completed correctly, creates a 'quick response' code which leads to the next stage of the challenge.\nThe puzzle was designed to amuse recipients of the director's card, but also encouraged them to make a donation to his chosen charity this year, the NSPCC.\nMr Hannigan said: 'I'm delighted that so many people have tried the puzzle and made a donation to the NSPCC.'\nOffering the tiniest glimmer of hope to frustrated puzzlers, he added: 'With a few days to go no-one has cracked it all yet, so my one and only clue is: it's not as abstract as you think.\n'What I hope the stages of the puzzle show is that to deliver our mission and keep Britain safe, we need people from all backgrounds, with all skills, who look at problems from every angle'.\nGCHQ has said that that although approximately 30,000 players have reached the final stage, (one question from it is shown above) none of them have managed to complete the brain teaser\nNearly 600,000 people successfully completed the opening stage of the puzzle - a nonogram which when completed correctly, creates a 'quick response' code which leads to the next stage of the challenge, but far fewer have managed to find answers to puzzles in part five (one shown)","url":"https://www.dailymail.co.uk/sciencetech/article-3421294/Is-hardest-puzzle-world-30-000-people-submitted-entries-GCHQ-s-Christmas-teaser-no-correct-answers-three-days-solve-it.html"}
