{"authors":[],"date_download":"2018-10-22 21:50:06","date_modify":"2018-10-22 21:50:06","date_publish":"2014-05-08 13:50:26","description":"\"I believe that the primary with Obama and Clinton was an extremely healthy process,\" the Senate Majority Leader tells NBC's Chuck Todd.","filename":"data/vaneerConsumption/IsHarryReidReadyforHillary.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_21/310806/140408-hillary_clinton_rafferty-1826_f772cafc5341c52f7b83b087b35014ed.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_harry-reid-ready-hillary-n100286_1540245006.html","title":"Is Harry Reid Ready for Hillary?","title_page":"Is Harry Reid Ready for Hillary? ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIs Senate Majority Leader Harry Reid really ready for Hillary?\nIn an interview with NBC’s Chuck Todd on ‘The Daily Rundown,’ the top Senate Democrat appeared to joke about what some have grumbled would be Clinton’s coronation without a vigorous challenge from within her own party.\n“Why do you go to all the trouble? It'd be nice to just have people anointed and run off,” he said, adding, “I'm being facetious, you know.”\nAn early backer of Obama – but one who did not campaign for either Democratic rival in 2008 – the Nevada lawmaker was sure to praise the former secretary of state.\n\"Everybody knows I love the Clintons. And I don't need to say more,\" he said. \"Including Chelsea.\"\nBut he also said that the grueling 2008 primary that ended Hillary Clinton’s first run for the presidency was “extremely healthy.”\n“I believe that the primary with Obama and Clinton was an extremely healthy process,” he said. “I think it was wonderful. People learned about these two people … things they know about before.”\nReid has been mercilessly critical of the GOP-mega-funding Koch brothers, berating them nearly daily on the Senate floor for what he says is their undermining of democracy for corporate profit. But that criticism doesn’t apply to Las Vegas donor Sheldon Adelson, he told Todd.\n“I know Sheldon Adelson,” Reid said of the Nevada casino magnate. “He's not in this for money.\"\nNoting that Adelson is a former Democrat, Reid insisted that the donor has “certain ideological views” and “a beef” with organized labor but that he’s not seeking personal profit from his political giving.\nIn contrast, the Koch brothers “are in it to make money,\" he said. \"Anything that affects their bottom line, they oppose it.\"","url":"https://www.nbcnews.com/politics/congress/harry-reid-ready-hillary-n100286"}
