{"authors":["David Gorn","Dan Morain","Laurel Rosenhall"],"date_download":"2018-10-30 23:10:05","date_modify":"2018-10-30 23:10:05","date_publish":"2018-08-30 23:07:34","description":"Hundreds of thousands of California residents can't drink the water that flows to their homes. Here are some proposed solutions to the crisis.","filename":"data/vaneerConsumption/IshelponthewayforCalifornianswhosetapwateristainted.json","image_url":"https://calmatters.org/wp-content/uploads/clean-water-rally-at-Capitol-2-e1535591224212.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540941005.html","title":"Is help on the way for Californians whose tap water is tainted?","title_page":"Is help on the way for Californians whose tap water is tainted? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Karen Lewis knows about water problems. The 67-year-old lives in Compton, where the water coming out of her tap is tinged brown by manganese, a metal similar to iron, from old pipes.\nThe water is supplied by the troubled Sativa Los Angeles County Water District. The district has been plagued by administrative scandal and charges of mismanagement, and it hasn’t been able to generate the money needed to fix the brown water.\nLewis has sat through innumerable community meetings and heard years’ worth of explanations, and she’s had enough. “Nothing’s been changed,” she said. “They’re not going to change.”\nLewis is one of an estimated 360,000 Californians who can’t safely drink the water that flows to their homes. It’s not a new issue. In the Central Valley, in particular, excess amounts of arsenic, nitrates and other substances that can cause cancers and birth defects have tainted drinking water. In Compton, residents have been living with foul-smelling brown water because the cost of fixing the pipes is high, and many can’t afford to buy a constant supply of bottled water.\nNow, in the wake of the state’s prolonged drought and the notorious water crisis in Flint, Mich., a number of new solutions have been proposed in California.\nOn Friday, lawmakers shelved two bills that supporters said would have helped. Under one voluntary measure , nearly all water districts in the state would have charged customers an additional 95 cents a month, unless the customers opted out of paying it. First proposed by Democratic state Sen. Bill Monning of Carmel as a mandatory tax, it didn’t muster the necessary two-thirds vote for passage, and Monning scaled it back.\nMonning also advanced a tax on dairies and fertilizer makers, industries that are heavy contributors to the nitrates found in some of the state’s groundwater. Associations representing those industries endorsed the bill, in part because the paying companies would have been protected from having to clean tainted water of nitrates. Legislators estimated that together the two bills could have raised more than $100 million a year. Assembly Speaker Anthony Rendon, a Democrat from Paramount, declined Friday to put the two measures to a vote.\nIn November, California voters will decide on Proposition 3 , which would permit the state to borrow almost $9 billion to help fund all kinds of water infrastructure projects: storage, dam repairs, watershed improvements and restoration of fisheries and other habitat. Voters in June approved a bond measure for more than $4 billion, some of it for waterway cleanup.\nIn this summer’s state budget agreement, more than $23 million was set aside for safer drinking water, with another $5 million to address lead in water at child-care centers.\nThis week, activists rallied outside California’s Capitol, trying to build support for the two Monning bills. The measures wouldn’t have solved all the state’s drinking-water problems, but money from both could have been used for operations, not just infrastructure projects, said Phoebe Seaton, co-director of the nonprofit Leadership Counsel for Justice and Accountability, based in Fresno.\n“The reason they’re so important is they provide the revenue necessary for operations maintenance,” Seaton said. The ballot measure bond money could be spent only on infrastructure improvements.\n“That means helping … some districts get solvent so they can apply for grants,” she said. “They complement the bond funds.”\nThat was music to the ears of Compton residents. Their water district was the poster child for Monning’s bills. One crucial step for that district, Seaton said, is to get financially straight so it can secure the grants necessary to make improvements. Without the operational funding from the bills, she said, the Sativa district will continue to founder.\nCindy Tuck, deputy executive director of the Association of Water Agencies, a statewide trade group, said another tax is not the way to go and might cause more problems than it would solve.\n“This is a social issue for the state of California, and the state should do something about it,” Tuck said.\nThe opt-out provision of the voluntary fee, she said, could have caused chaos in water companies’ billing systems.\n“Water agencies have automated electronic systems,” Tuck said, and giving people a choice about paying one part of their bill runs counter to that. “I had one city tell me it would be over a million dollars just to change their system.”\nMany customers might not even have known they’d paid an additional fee, she said, particularly if they used an auto-pay feature.\nAnd if customers paid the voluntary charge without meaning to, they could have had their money refunded, setting off another complicated accounting procedure, Tuck said.\n“It’s just a logistical nightmare,” she said.\nSeaton had a different view: “There has been a lot of thinking on this. That’s why (there would have been) a notification period beforehand to include people.”\nAnd the bill wouldn’t have gone into effect until 2020, she noted—enough time for some of those logistical details to be ironed out.\nLewis just wants relief from the brown stuff dribbling from her faucet.\n“It’s not safe,” she said. “It can’t be safe.”\nEditor’s note: This article was updated to reflect legislative developments.","url":"https://calmatters.org/articles/california-contaminated-water-legislative-help/"}
