{"authors":["Laken Howard"],"date_download":"2018-10-31 01:53:14","date_modify":"2018-10-31 01:53:14","date_publish":"2018-08-27 16:09:59","description":"There’s no shortage of terrible things about going through a breakup, but if you had a great sexual connection with your now-ex, one of the worst parts of breaking up can be realizing you might never hook up with that person again. But if you’re…","filename":"data/vaneerConsumption/IsHookingUpWithAnExABadIdea7SignsItsNotAGoodMoveAccordingToExperts.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/dbaed48e-d9fe-4afa-b3b5-978e405a1603-2t4a9923.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-hooking-up-with-ex-a-bad-idea-7-signs-its-not-a-good-move-according-to-experts-10205414_1540950794.html","title":"Is Hooking Up With An Ex A Bad Idea? 7 Signs It's Not A Good Move, According To Experts","title_page":"Is Hooking Up With An Ex A Bad Idea? 7 Signs It's Not A Good Move, According To Experts","title_rss":"NULL","source_domain":"bustle.com","text":"There’s no shortage of terrible things about going through a breakup, but if you had a great sexual connection with your now-ex, one of the worst parts of breaking up can be realizing you might never hook up with that person again. But if you’re feeling bold (or maybe just horny), you might eventually start to wonder: when is it OK to hook up with an ex? Having sex with an ex can be messy and tough to navigate so, while it’s certainly not always a bad idea, you should nonetheless proceed with caution — particularly if your breakup was recent.\n\"It can be easy to fall into old patterns with an ex and forget about any hurt that was done,\" Dr Nikki Goldstein, sexologist, relationship expert, and author of Single But Dating, tells Bustle. \"If you have been lonely and enjoying the company of this past partner, then warning signs or red flags might be ignored. Someone might think that they can protect themselves from the emotional side of things, but there are not guarantees and feelings appear when they appear.\"\nBut is there ever a scenario when hooking up with an ex is a *good* idea? According to Goldstein, as long as you're both on the same page and don't have any lingering feelings or expectations, hooking up with an ex can be totally fine. \"The perfect scenario is if there has been an amicable breakup or if there has been some time since the breakup occurred,\" she says. \"If there are no feelings anymore and both people are looking for some no strings attached fun in a safe and familiar environment then an ex can be a great option.\"\nSo yes, it's certainly possible to have emotional-mess-free sex with an ex, but you should be on the lookout for signs that you’re not ready to get physical with a former lover. If you notice any unwanted feelings or negative thoughts arising as a result of your hookups, it's OK to take a step back and separate (again) if you feel that's best for you. Here are seven signs that hooking up with your ex might be a bad idea, according to relationship experts.\n1 You're Still Emotionally Attached To Your Ex Ashley Batz/Bustle The golden rule of having sex with an ex? If you’re in the process of getting over them or feel emotionally or romantically attached still, it’s probably not a good idea to hop back into bed with them — because that’ll only make your heart even more confused. \"If you are still emotionally attached to your ex and you hook up with [them] it will make it difficult for you to move on and find someone new,\" relationship expert and spiritual counselor, Davida Rappaport, tells Bustle. \"Also with emotional attachments, you will not give someone else a chance because you may still be unable to get over your ex.\"\n2 Your *Ex* Is Still Emotionally Attached Andrew Zaeh for Bustle On the flip side, you might be totally over your ex and just want to have some fun... but if your ex still harbors feelings for you, it's not fair to use them for sex knowing they're still into you. \"You might just view it as a chance to end a sexual dry spell or have some no-strings-attached fun, but if your ex still has an emotional bond or feelings of love, hooking up again could create a host of problems,\" Jonathan Bennett, dating and relationships expert at DoubleTrust Dating, tells Bustle.\n3 Your Ultimate Goal Is To Get Back Together Andrew Zaeh for Bustle If you’re hoping to eventually get back together with an ex and want to use sex to help you achieve that goal, that’s a risky move — and one that likely will wind up with you getting hurt in the long run. \"Often the problems you had in your relationship will surface if you succeed, which means you will have failed in the long run,\" Rappaport says.\n4 You're Trying To Make Someone Else Jealous Andrew Zaeh for Bustle Whether you’re seeing someone new and they’re not giving you the attention you crave, or whether your ex is with someone else and you want to break them up, if you’re considering hooking up just to get a rise out of someone else, that’s a telltale sign that you should *not* do it. \"Several things can happen if you try to make a new partner jealous by hooking up with your ex,\" Rappaport says. \"They may actually become jealous and try to win you back if they think they may lose you to your ex, they may think that you are playing them and they may dump you, [or] they may call you on it and you will have to be accountable for your actions.\"\n5 You Feel Lonely And Want Companionship Ashley Batz/Bustle Loneliness is a terrible and powerful feeling, which can often lead us to make questionable choices… like hopping in bed with an ex just to temporarily feel a sense of companionship again. \"If you feel like your dating life has stagnated and you’re out of options, it can be tempting to try for a blast from the past: your ex,\" Bennett says. \"At times like these, it’s better to seek the company of family and friends rather than risk getting entangled with someone you know is bad for you.\"\n6 Your Ex Didn’t Treat You Well In The Past Ashley Batz/Bustle When you’re looking in the rearview mirror at your relationship, it’s easy to conveniently overlook any of your ex’s less-than-ideal qualities, but if you’re thinking of having sex again, it’s worth examining what your relationship was really like — and then decide if it’s worthwhile to reopen that door. \"Before you hook up with an ex, consider who they were when you were together,\" Kayla Lords, sexpert for JackAndJillAdult.com and owner of Loving BDSM, a website and podcast that focuses on Dominance and submission (D/s) relationships, tells Bustle. \"How did they treat you, and how did that make you feel? Also, remember the breakup. Was it full of angst or anger? Hook up because sex is fun and feels good, but consider the person and how they've made you feel in the past. If they're someone you've put behind you for a reason, they may need to stay there.\"","url":"https://www.bustle.com/p/is-hooking-up-with-ex-a-bad-idea-7-signs-its-not-a-good-move-according-to-experts-10205414"}
