{"authors":["Dan Riehl"],"date_download":"2018-10-30 20:22:17","date_modify":"2018-10-30 20:22:17","date_publish":"2014-12-30 18:14:41","description":"Those familiar with what was once referred to as \"Clinton, Inc.\" are already pointing to Team Hillary as the source behind a political hit on potential Hillary challenger Democrat Jim Webb. |","filename":"data/vaneerConsumption/IsHunterWalkerTeamHillarysLatestHitMan.json","image_url":"https://media.breitbart.com/media/2014/12/Hillary-Clinton-ingratiating-ap.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_12_30__1540930937.html","title":"Is Hunter Walker Team Hillary's Latest Hit Man?","title_page":"Is Hunter Walker Team Hillary's Latest Hit Man? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Those familiar with what was once referred to as “Clinton, Inc.” are already pointing to Team Hillary as the source behind a political hit on potential Hillary challenger Democrat Jim Webb.\n(Hunter) Walker reports that “Born Fighting PAC” has continued taking donations, several years after Webb retired from Congress. He transferred some $100,000 from his Senate campaign account to the PAC.\nThe story was reported by Hunter Walker, now with Business Insider. A quick review of Walker’s employment and writing history will do little to dispel the notion that Hillary Clinton’s team was, in fact, behind the story coming out. His tenure at Talking Points memo alone is enough to suggest a close relationship with Democrat Hillary Clinton and his reporting suggests even more:\nHunter Walker is Business Insider’s politics editor. Previously, he worked at Talking Points Memo, The New York Observer, and The Daily, among others. Hunter is a native of Brooklyn, New York. He holds a master’s degree in journalism from Columbia University.\nWhen Hillary was taking heat over low turnout for her speech at Georgetown’s Gaston Hall in December of 2014, enter Hunter Walker to let people know it wasn’t Hillary’s fault.\nGeorgetown Blames Low Turnout At Hillary Clinton Speech On Final Exams Update (1:40 p.m.): Georgetown spokesperson Stacy Kerr sent a statement to Business Insider noting there has been large turnout for past events at the school with Clinton. She also suggested the fact it is the last week before final exams may have contributed to lower turnout this time.\nThere’s this by Walker at TPM in January of 2014: Hillary Clinton Allies Deny She’s ‘Coordinating’ With Super PACs\nThen in July of 2014, when Team Hillary wanted to go after journalist Ed Klein, who did it turn to? Why, Hunter Walker, of course:\nHillary Clinton’s Inner Circle Calls This Best-Selling Author The Most ‘Despicable’ Person In The World\nGiven the trajectory of Walker’s career, it’s not unusual that, from past to present he’s done so much material on Hillary Clinton. Just see here, here, here and most certainly a host of other items we well.\nBut given his obvious Team Hillary insider access and the timing of this new hit on Jim Webb — one of her potential rivals for the Democrat nomination in 2016 — there’s also every reason to believe “Clinton, Inc.” is back in the business of political career assassination and Hunter Walker just did a stint as their latest hit man du jour.","url":"https://www.breitbart.com/politics/2014/12/30/is-hunter-walker-team-hillarys-latest-hit-man/"}
