{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:28:31","date_modify":"2018-10-30 20:28:31","date_publish":"2015-11-13 14:11:05","description":"Contents: ISIS claims credit for suicide attack on Hezbollah in Beirut Lebanon; Commodities and stocks continue to plunge","filename":"data/vaneerConsumption/ISISClaimsCreditforSuicideAttackonHezbollahinBeirut.json","image_url":"https://media.breitbart.com/media/2015/11/ap_ap-photo917-wi-e1447423858524.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_13__1540931311.html","title":"ISIS Claims Credit for Suicide Attack on Hezbollah in Beirut","title_page":"ISIS Claims Credit for Suicide Attack on Hezbollah in Beirut","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nISIS claims credit for suicide attack on Hezbollah in Beirut Lebanon\nCommodities and stocks continue to plunge\nISIS claims credit for suicide attack on Hezbollah in Beirut, Lebanon\nSoldiers and civilians gather at site of Thursday’s suicide bombing in Beirut (AP)\nTwo coordinated suicide bombings on Thursday struck a neighborhood of southern Beirut, the capital city of Lebanon. The neighborhood was a Shia Muslim stronghold of Hezbollah, which was apparently the target. The bombs killed dozens and wounded hundreds, and were obviously designed to inflict as much carnage as possible.\nThere was a string of terrorist bombings in Beirut targeting Hezbollah following the announcement on April 30, 2013, by Hezbollah leader Sayyed Hasan Nasrallah that Hezbollah would militarily enter the fight in Syria on the side of the regime of Syria’s president Bashar al-Assad. The Abdullah Azzam Brigades and other al-Qaeda-linked terrorists claimed credit for one of those bombings.\nHowever, those were the days before the rise of the so-called Islamic State (IS or ISIS or ISIL or Daesh) in Syria. Credit for Thursday’s bombings was claimed by ISIS, and is presumed to be revenge for Hezbollah’s military intervention into Syria.\nHowever, it is not always clear what it means to say that ISIS claims credit for a terrorist bombing. ISIS also recently claimed credit for the recent downing Metrojet Flight 9268, the Russian passenger plane, over Egypt, saying that it was revenge for Russia’s military intervention into Syria.\nIt still has not been officially confirmed that flight 9268 was brought down by a bomb, but if it was brought down by an ISIS bomb, then it was actually brought down by the terror group Ansar Bayt al-Maqdis (ABM – Ansar Jerusalem – Champions of Jerusalem), which has conducted numerous attacks in Egypt’s Sinai, along the border with Israel and Gaza. ABM was originally pledged to al-Qaeda, but last year it repudiated that allegiance and declared allegiance to ISIS. At that time, it changed its name to Al Wilayat Sinai (Province of Sinai). BBC and AP and CNN\nCommodities and stocks continue to plunge\nAs I wrote three days ago in “11-Nov-15 World View — Global trade plunges as China’s economy becomes deflationary”, earnings and profits for Wall Street stocks have been falling sharply, as have indicators of global trade.\nAll of these factors continue to have their effects on Wall Street stock prices, which fell 1.4% on Thursday, the largest plunge in weeks. Stocks have fallen six out of the last seven days, though they have not yet fallen to the level that they reached in the huge slump that occurred in August.\nIt is a good idea to keep any idea on this situation. As I have been pointing out for years, the S&P 500 Price/Earnings ratio is astronomically high, indicating a huge Wall Street stock market bubble that is going to burst at some point, with the Dow Jones Industrial Average falling to 3000 or lower by the time it is over. It is impossible to predict exactly when the panic will occur that will begin that collapse, and it is not certain that the deteriorating global financial situation will cause it at this time. But one thing that we can say is that when this panic finally occurs, it will almost certainly follow exactly this kind of global situation.\nBecause of plunging commodity prices, many analysts are predicting that stocks will continue to fall in the next few days. AP and Reuters\nKEYS: Generational Dynamics, Lebanon, Beirut, Hezbollah, Sayyed Hassan Nasrallah, Syria, Bashar al-Assad, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Egypt, Sinai, Metrojet Flight 9268, Russia, Ansar Jerusalem, Ansar Bayt al Maqdis, ABM, Champions of Jerusalem, Sinai Province, Al Wilayat Sinai, Abdullah Azzam Brigades, commodities, earnings\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/11/13/world-view-isis-claims-credit-for-suicide-attack-on-hezbollah-in-beirut-lebanon/"}
