{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 03:35:20","date_modify":"2018-10-23 03:35:20","date_publish":"2017-04-26 15:00:08","description":"Damon Smith, 20, left the device packed with ball bearings to act like shrapnel in a rucksack on an eastbound Jubilee line train at London Bridge on October 20 last year.","filename":"data/vaneerConsumption/ISISinspiredDamonSmithleftbombontubetrain.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/21/3FA2B25200000578-0-image-a-44_1493237697937.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447800_Isis-inspired-student-left-bomb-tube-train_1540265720.html","title":"'ISIS inspired' Damon Smith 'left bomb on tube train'","title_page":"'ISIS inspired' Damon Smith 'left bomb on tube train' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chilling footage shows the moment that an 'ISIS inspired' student from Devon allegedly left a ball bearing bomb on a Tube train in London.\nDamon Smith, 20, allegedly packed a rucksack with explosives and ball-bearing shrapnel attached to a £2 Tesco clock timed to go off on the Jubilee Line.\nSmith allegedly left the bomb on a carriage before changing his clothes and going to a university lecture, on October 20 last year, the Old Bailey heard.\nCCTV shows him taking the rucksack off his shoulder and possibly putting the batteries in the device, then getting on the Tube on a Jubilee line platform.\nFour minutes later he is seen getting off the train at London Bridge without the bag, which contains the homemade bomb and is propped against a seat by the door.\nChilling CCTV footage shows the moment that an 'ISIS inspired' student from Devon steps off the train at London Bridge, with the homemade bomb propped up against the seat by the door\nDamon Smith, 20, allegedly packed a rucksack with explosives and deadly ball-bearing shrapnel attached to a £2 clock timed to go off within minutes on the Jubilee Line\nThe weapons-obsessed teenager wanted to cause carnage in the capital, his trial heard\nThe weapons-obsessed teenager allegedly photographed himself in front of a TV showing ISIS' Paris massacre mastermind Abdelhamid Abaaoud, the court heard.\nSmith had previously printed off an al Qaida article entitled 'Make a bomb in the kitchen of your Mom' and made notes in green ink before shredding the sheets of paper, jurors were told.\nHad the device worked, it would have exploded just as people were being ordered off the Jubilee Line platform at North Greenwich.\nThe court heard Smith had a keen interest in Islam, guns, explosives and gambling, and collected pictures of extremists, including the alleged mastermind of the 2015 Paris terror attacks.\nAfter he was arrested, the autistic student admitted making the device but claimed he only meant it to spew harmless smoke as a prank.\nProsecutor Jonathan Rees QC told how Smith grew up in Newton Abbot in Devon and moved to London with his mother in June last year before starting a London Metropolitan University computer course.\nAn only child, Smith was diagnosed with Asperger's syndrome, an autistic condition which can affect the way he interacts with people and result in a lack of empathy.\nHe also allegedly searched the internet for an Islamic State magazine featuring an article about the bomb said to have brought down a Russian airliner in October 2015.\nSmith photographed himself in front of a TV showing ISIS' Paris massacre mastermind Abdelhamid Abaaoud (pictured)\nA shopping list for 'pressure cooker bomb materials' was also allegedly found on an iPad ending in a note to 'keep this a secret between me and Allah #InspireTheBelievers'.\nOn October 20 last year, Smith boarded a train from Surrey Quays to Canada Water before getting on the westbound Jubilee Line, then going back on himself at Southwark.\nAt 10.49am, the defendant, who had a freedom travel pass, got off at London Bridge leaving behind his rucksack containing the bomb set to explode minutes later at 11.02am.\nThere were at least 10 passengers in the carriage at the time and some of them spotted the bag and reported it when they got to Canary Wharf.\nThe driver took the bag thinking it was lost property and carried on towards North Greenwich, Mr Rees said.\nIt was while he was en route to the next stop that he noticed wire poking out of a clock.\nHad the bomb gone off, it would have exploded just as passengers were evacuated from the area, the prosecutor said.\nMeanwhile, Smith went to his university campus at Holloway and searched for articles for the incident when he got home later.\nJurors were told of Smith's interest in poker, YouTube, Islam - as well as guns, explosives and other weapons.\nIt was also claimed Smith, pictured with his mother Antonitza, left, was a 'mummy's boy' who was 'bullied at school'\nOn his faith, Smith allegedly told police he was brought up Christian, but Islam was 'more true', although he denied being an extremist.\nA search of Smith's home in Rotherhithe, south London, uncovered a blank-firing self-loading pistol, a BB gun - both bought legally - as well as a knuckleduster and a knife which he showed off in an online video.\nPictures were also recovered of Smith with guns, including one on a laptop labelled '2016 an Islamic State fighter'.\nSmith watched YouTube videos on explosions and allegedly posted a picture of himself on Facebook in a Guy Fawkes mask holding handcuffs and a knuckleduster, jurors were told.\nHe also posed next to an image of the Brussels-born Islamic terrorist alleged to have masterminded the attacks in Paris in November 2015, the court heard.\nUnder 'other useful stuff' on the iPad mini, Smith had written: 'Face paint to blend into the LGBT crowd.'\nAn iPad mini was also seized from his Bermondsey home, pictured, which had a note called 'pressure cooker bomb materials'\nThe reference to Lesbian, Gay, Bisexual, and Transgender people, 'rather suggests that this device was not to be designed for a prank,' Mr Rees said.\nWhen he was arrested in Holloway Road at 12.25pm the next day, police found a copy of the Koran in Smith's sports bag along with notes about his university course.\nAt his home address were packs of 'monster sparklers', matches, and ball bearings similar to those in the device along with wire, glue, circuit boards and craft knives.\nThere was also a receipt from Tesco dated September 23 for a £2 wall clock, another copy of the Koran, and leaflets and books about Islam.\nAt his old address in Newton Abbot, police found another device in the loft which was wrapped in a plastic bag from the UK Islamic Mission but was not viable.\nSmith, now 20, denies possession of an explosive substance with intent, contrary to the Explosive Substances Act 1883 but has admitted the lesser offence of perpetrating a bomb hoax.","url":"https://www.dailymail.co.uk/news/article-4447800/Isis-inspired-student-left-bomb-tube-train.html"}
