{"authors":["Jennifer Newton For Mailonline"],"date_download":"2018-10-23 00:18:39","date_modify":"2018-10-23 00:18:39","date_publish":"2016-01-11 09:25:46","description":"Ismael 'El Mayo' Zambada, is from the same area of rural Mexico as 'El Chapo' and is considered by many as a close confidant of the drugs lord and the brains behind his trafficking operation.","filename":"data/vaneerConsumption/IsIsmaelElMayoZambadathemanwhowillreplaceJoaquinElChapoGuzman.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/3006405E00000578-0-image-a-16_1452503376386.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393581_Is-farmer-man-step-replace-El-Chapo-Ismael-El-Mayo-Zambada-68-tipped-leader-Sinaloa-drugs-cartel_1540253919.html","title":"Is Ismael 'El Mayo' Zambada the man who will replace Joaquin 'El Chapo' Guzman?","title_page":"Is Ismael 'El Mayo' Zambada the man who will replace Joaquin 'El Chapo' Guzman?  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"After the arrest of the world's most wanted man El Chapo, a 68-year-old former farmer is being tipped as the next leader of the Sinaloa drugs cartel.\nIsmael 'El Mayo' Zambada is from the same rural area of Mexico as Joaquin 'El Chapo' Guzman and is considered by many as a close confidant of the drugs lord and the brains behind his trafficking operation.\nHe is believed to have continued to run the cartel for 17 months while the group's leader was in prison before his escape in July last year.\nIsmael 'El Mayo' Zambada, who is being tipped to take over the running of the Mexican Sinaloa drugs cartel following the arrest of El Chapo last week\nEl Mayo is considered by many as a close confidant of the drugs lord and the brains behind his trafficking operation\nAnd even though El Chapo's sons Alfredo Guzman and Iván Archivaldo Guzman are active in the Sinaloa cartel, it is El Mayo, who is seen as the group's natural successor.\nRaul Benitez, a security expert at the National Autonomous University of Mexico explained: 'Sinaloa is not destroyed. It is weakened, but it can rebuild because it has 'Mayo' Zambada.'\nMeanwhile Mike Vigil, a former international operations chief at the US Drug Enforcement Agency says El Chapo's arrest means nothig for Sinaloa.\nHe added: 'The capture won't have a significant impact other than a moral victory.\n'It's going to continue to function. It's not even going to skip a beat.\n'The infrastructure has been developed through decades, and the fact of the matter is that just because they get rid of the CEO doesn't mean that it's going to collapse.'\nAccording to reports, El Mayo is seen as the logistics expert and security behind Sinaloa while El Chapo was the muscle power.\nEl Chapo, pictured, was arrested in north west Mexico last week after breaking out of prison in July last year\nMexico has formally started extradition proceedings against El Chapo in the strongest sign yet it intends to send him to the United States\nIn a 2010 profile on El Mayo in Proceso, a Mexcian magazine, he is described as respected by those both inside an outside of the organization, which is key in keeping it together.\nHe told the magazine that he and El Chapo, 58, are 'compadres' who 'talk on the phone regularly'.\nMeanwhile, an official told the Los Angeles Times last year: 'Everything indicates that El Mayo Zambada will stay at the front of the organization. What's less clear is whether, with the detention of [El Chapo], his business model will come to an end.\nAccording to the report, El Mayo prefers to hold back on drug supplies instead of flooding the market, an easy way to drive up both demand and prices, as well as influence.\nEl Chapo himself told US actor Sean Penn in an interview for Rolling Stone magazine that the business would go on without him\nHe is also believed to be violent, but much less out in the open than El Chapo.\nHe prefers to single out victims instead of leave the mass graves that have become a Sinaloa cartel hallmark in recent years.\nEl Chapo, who is blamed for thousands of deaths in Mexico and the United States from addiction and gang warfare, is facing open federal indictments in seven U.S. jurisdictions\nMeanwhile El Chapo himself told US actor Sean Penn in an interview for Rolling Stone magazine that the business would go on without him.\nHe said: 'The day I don't exist, it won't reduce drug trafficking.'\nIt comes Mexico has formally started extradition proceedings against El Chapo in the strongest sign yet it intends to send him to the United States.\nHe was arrested in north west Mexico on Friday, six months after he broke out of jail.\nEl Chapo has been taken back to the same facility over the weekend but, to avoid a repeat of the humiliation, which saw him escape, Mexico's government says it aims to hand him over to U.S. justice as soon as possible.\nThe U.S. government him tried on charges ranging from money laundering to drug trafficking, kidnapping and murder.\nEl Chapo, who is blamed for thousands of deaths in Mexico and the United States from addiction and gang warfare, is facing open federal indictments in seven U.S. jurisdictions.\nChicago and Brooklyn, New York are leading contenders to host what would be one of the most high profile U.S. criminal trials in years, former U.S. law enforcement officials said.","url":"https://www.dailymail.co.uk/news/article-3393581/Is-farmer-man-step-replace-El-Chapo-Ismael-El-Mayo-Zambada-68-tipped-leader-Sinaloa-drugs-cartel.html"}
