{"authors":["John Hayward"],"date_download":"2018-10-30 20:43:31","date_modify":"2018-10-30 20:43:31","date_publish":"2015-11-16 18:37:07","description":"There have been several claims material leaked by Edward Snowden helped ISIS terrorists conceal their operations from Western agencies.","filename":"data/vaneerConsumption/ISISStudiedSnowdenMaterialtoConcealOperations.json","image_url":"https://media.breitbart.com/media/2015/09/ap_edward-snowden_ap-photo-wi-e1447699014598.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_16__1540932211.html","title":"ISIS Studied Snowden Material to Conceal Operations","title_page":"Officials: ISIS Studied Snowden Material to Conceal Operations","title_rss":"NULL","source_domain":"breitbart.com","text":"There have been several high-profile accusations that material leaked by Edward Snowden helped ISIS terrorists conceal their operations from Western intelligence agencies, including planning and execution of the horrific terrorist attack in Paris on Friday.\nCIA Director John Brennan alluded to the Snowden leaks on Monday morning, complaining that “in the past several years, because of the number of unauthorized disclosures and a lot of hand-wringing over the government’s role in the effort to try to uncover these terrorists, there have been policy and other legal changes that make our ability to collectively find these terrorists much more challenging.”\nDaveed Gartenstein-Ross, senior fellow at the Foundation for Defense of Democracies, agreed that counter-terrorist surveillance has degraded. “The fact that an attack this big occurred suggests to me an erosion in surveillance capabilities compared to magnitude of the threat. A few years ago people hoped the age of mass-casualty incidents in Western states was gone because surveillance or interruptions from authorities could prevent attacks like this,” Business Insider quotes Gartenstein-Ross, who added that the Paris attack has put a “definitive end” to such hopes.\nArmin Rosen of Business Insider noted in response to Brennan’s comments that the Paris attack was “planned and executed within the capital of a country with a highly advanced anti-terrorism infrastructure,” which has been on high alert ever since the Charlie Hebdo massacre at the beginning of the year.\nThe notion that Snowden’s information proved useful to terrorists is not new. In a July article about Islamic State strategy, the New York Times cited intelligence and military officials who said ISIS has “studied revelations from Edward J. Snowden, the former National Security Agency contractor, about how the United States gathers information on militants.” As a result, the terror state’s top leaders “now use couriers or encrypted channels that Western analysts cannot crack to communicate.”\nAfter the Paris attack, current and former intelligence officials told Yahoo News that ISIS terror suspects have “moved to increasingly sophisticated methods of encrypted communications, using new software such as Tor, that intelligence agencies are having difficulty penetrating – a switch that some officials say was accelerated by the disclosures of former NSA contractor Edward Snowden.”\nYahoo News reports some specific allegations against Snowden from both the current and former heads of the National Counterterrorism Center (NCTC):\nJust three weeks ago, Nick Rasmussen, the current director of the NCTC, told a congressional committee that terrorist actors were displaying an increasing ability to communicate “outside our reach” and that the difficulty in tracking “particular terrorist plots is increasing over time.” Rasmussen, echoing the view of multiple U.S. intelligence officials, blamed the problem in part on “the exposure of intelligence collection techniques” — a clear reference to the tens of thousands of internal National Security Agency documents leaked by Snowden. “There’s no doubt that the disclosures overall created a situation in which we lost coverage of terrorists,” [former NCTC director Matthew] Olsen said at a Yahoo News sponsored conference, Digital Democracy, this week, on the day before the Paris attacks. “Specifically, we saw people that we were targeting with NSA surveillance stop using communications at all. We saw them go to different service providers. We saw them go to uses of encryption — different ways they were reacting to what they were seeing. It shouldn’t be any surprise — these guys are sophisticated . … They’re reading the newspapers and seeing what we can do.”\nIn the months after the Snowden disclosures, U.S. officials tell Yahoo News, some terror suspects — including those associated with IS in Iraq and Syria — were even overheard by U.S. intelligence making comments along the lines of “let’s not use that anymore,” one former official said. The terror suspects also increasingly began avoiding U.S. Internet providers, such as Google and Yahoo, and switching instead to foreign Internet providers, such as those in Russia.\nFormer CIA deputy director Michael Morrell charged that Snowden’s leaks “played a role in the rise of ISIS” in his memoir, The Great War of Our Time: The CIA’s Fight Against Terrorism – From al-Qaeda to ISIS.\n“Within weeks of the leaks, terrorist organizations around the world were already starting to modify their actions in light of what Snowden disclosed. Communications sources dried up, tactics were changed,” wrote Morrell, in an excerpt published by the Daily Beast in May. Several other current and former intelligence officials supported Morell’s contention that terrorists might have continued using American email providers for their communications, if Snowden had not revealed the ability of U.S. intelligence agencies to monitor those services.\nIn April 2014, the Middle East Media Research Institute published an extensive report on “Al Qaeda’s Embrace of Encryption Technology, and the Impact of Edward Snowden.” Included in this report were quotes from jihadists issuing warnings based explicitly on Snowden’s leaks.\nOf course, Snowden defenders vehemently reject allegations that his leaks were helpful to ISIS and other terrorist organizations. Snowden’s media partner Glenn Greenwald posted a fiery screed at The Intercept on Sunday, accusing Western intelligence agencies of scapegoating Snowden to cover for their own failure to detect the Paris terror plot.\n“One key premise here seems to be that prior to the Snowden reporting, The Terrorists helpfully and stupidly used telephones and unencrypted emails to plot, so Western governments were able to track their plotting and disrupt at least large-scale attacks,” Greenwald wrote. “That would come as a massive surprise to the victims of the attacks of 2002 in Bali, 2004 in Madrid, 2005 in London, 2008 in Mumbai, and April 2013 at the Boston Marathon. How did the multiple perpetrators of those well-coordinated attacks — all of which were carried out prior to Snowden’s June 2013 revelations — hide their communications from detection?”\nThis argument, which Greenwald makes at length, does not account for the idea that terrorists have been aware of basic surveillance-evasion techniques since the widespread adoption of cell phones and email decades ago, but have dramatically increased and refined their evasion techniques after Snowden exposed so many cutting-edge surveillance techniques.\nGreenwald accuses government agencies of using the public’s anxiety about terrorism to attack encryption and demand more extensive surveillance powers. People much less sympathetic to Edward Snowden than Greenwald have expressed similar suspicions. Even before Snowden came along, there were serious arguments about the growth of the Surveillance State. The flip side of these concerns is that without the ability of intelligence agencies to monitor Internet communications between militants, there is virtually no way to detect and neutralize terror operations before they are carried out.\nIf 100 percent secure instantaneous worldwide communications are readily available – a capability that never existed in all of history, prior to the Information Age – then it would be a sure bet criminals will use them. Contrary to Greenwald’s assertions, quite a few terrorists have shown they really are dumb enough to make mistakes, if they are not given specific warnings to avoid compromised communication platforms. A steady stream of terrorism busts in the United States, some of them occurring only hours before action was due to take place, have featured perpetrators who exposed their plans on ridiculously insecure channels, such as Facebook and Twitter. A bit higher up the terrorist ecosystem, there are sharper operators who would never make such foolish mistakes, but might slip up in smaller ways, absent specific warnings from knowledgeable sources. Also, it can be argued that consumer interest in more secure communications has been driven by the Snowden story, which has provided financial capital for the creation of systems useful to criminals.\nThere is no question the Paris attack required preparation and coordination. It is a chilling demonstration of how much damage a small group of coordinated operatives can inflict, without hatching the sort of massive 9/11-style plot our intelligence agencies are supposed to be much better at detecting. Western governments must choose now between permitting the sort of surveillance that might intercept such communications, with corresponding risk to the civil liberties of law-abiding people, or making such surveillance impossible, and putting a powerful tool in the hands of both decent people who value their privacy, and dangerous criminals. It is not an easy choice.","url":"https://www.breitbart.com/national-security/2015/11/16/intel-officials-say-isis-studied-snowden-material-conceal-operations/"}
