{"authors":["Larisa Brown","Defence Correspondent For The Daily Mail"],"date_download":"2018-10-22 20:29:17","date_modify":"2018-10-22 20:29:17","date_publish":"2016-01-29 01:51:48","description":"Vice Admiral Clive Johnstone, the UK's highest-ranking naval officer in Nato, said Islamic State's spread into Libya casts an 'uncomfortable shadow' over the Mediterranean sea.","filename":"data/vaneerConsumption/ISISnexttargetcouldbecruiseshipsintheMediterraneansaysCliveJohnstone.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/05/30ACDE3F00000578-0-image-a-82_1454046408614.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422044_Terrorists-target-cruise-ships-Med-ranking-commander-says-ISIS-s-spread-Libya-casts-uncomfortable-shadow_1540240157.html","title":"ISIS' next target could be cruise ships in the Mediterranean says Clive Johnstone","title_page":"ISIS' next target could be cruise ships in the Mediterranean says Clive Johnstone | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Chilling: Vice Admiral Clive Johnstone (pictured yesterday) revealed Islamic State are attempting to build a navy to wage war against the West\nCruise ships in the Mediterranean could be targeted in a terror attack by militant groups armed with Russian weapons, a top British commander warned yesterday.\nVice Admiral Clive Johnstone, the UK’s highest naval officer in Nato, said Islamic State’s spread into Libya had cast an ‘uncomfortable shadow’ over the sea.\nIn stark remarks, he revealed the IS terror group are attempting to build a navy to wage war against the West.\nHe said there was a ‘horrible opportunity’ that a ‘very high quality weapons system’ would be used to hit ships crossing the sea, having ‘extraordinary implications’ for the Western World.\nSpeaking onboard a Spanish Nato ship in London yesterday, Vice Adm Johnstone said that Nato must not get ‘hustled out’ of eastern Mediterranean water space.\nHe said: ‘Nato mustn’t think the Mediterranean is just about immigration. It is the spread along the North African seaboard, it is the Daesh entry into Libya, it is the Daesh control of Sirte and other places, which has an uncomfortable shadow over maritime trade and maritime access.’\nConflict and revolt across the region had made it more difficult for Nato countries, including Britain, to ‘ascertain what threats are there’, he said.\nHe added: ‘At the same time, we are tracking the spreads of really quite capable Korean, Chinese and Russian hardware, into bodies such as Hamas and Hezbollah and other places.’\nBlast: Flames rise from an oil storage tank in Libya's Ras Lanouf region following an ISIS attack this month\nWhile they were not targeted at Nato or commercial shipping at the moment, he said: ‘There is a horrible opportunity in the future that a misdirected, untargeted round of a very high quality weapons system will just happen to target a cruise liner, or an oil platform, or a container ship.’\nHe said: ‘The eastern Mediterranean has started to become a competed space.\n‘We are not in any war, we are not in any period of tension, but there are quite a lot of actors with a say there and we have just got to make sure we can access that, with all the freedom of navigation in international law we want. Does it worry me, yes, quietly it does worry me a bit.’\nHe said he believed an attack on ships such as cruise liners would be an act ‘which is almost a mistake…or it will be an act of random terrorism that will suddenly have extraordinary implications for the Western world’.\nWarning: Vice Adm Johnstone (centre, with Spanish Rear Admiral Jose Delgado, left, and Commander Ignacio Paz, right) said yesterday that Nato must not get ‘hustled out’ of eastern Mediterranean water space\nWhile there is not a threat to shipping from Islamic State currently, he said Nato had watched them ‘grow and morph in such extraordinary ways’, that he could not predict the future.\nDoes it worry me, yes, quietly it does worry me a bit Vice Admiral Clive Johnstone\n‘We know they have had ambitions to go off shore, we know they would like to have a maritime arm, just as al Qaeda had a maritime arm’, he said.\nLast year it was revealed that IS militants were building a ‘retreat zone’ in Libya to avoid international air strikes in Syria and Iraq.\nAs many as 3,000 jihadist fighters are believed to have travelled to the war-torn country to create a strategic hub for recruits unable to reach IS in its Syrian heartland.\nSpeaking about the Russian threat to Nato, Vice Adm Johnstone revealed how defence officials were looking to move submarines from the Gulf back to protect countries such as Britain.\nPrevious incident: In October 1985, Palestinian gunmen hijacked an Italian cruise liner in the Mediterranean and threatened to blow it up. The Achille Lauro (file picture) was on its way to the Israeli port of Ashdod\nHe said he was ‘worried’ about Russian submarines coming close to Britain’s waters. He said there was more activity from Russian submarines than Nato has seen since the days of the Cold War.\nDISNEYLAND SECURITY ALERT OVER GUNMAN A man with two handguns and a knife hidden in his baggage was arrested in Disneyland Paris yesterday. The 28-year-old, who was also carrying a guide to the Koran, sparked a terror alert when he set off a metal detector at the theme park’s New York Hotel. Security guards found two semi-automatic pistols and 20 bullets inside his bag. The man, a French national, had booked a room at the hotel, and was with a woman who has since disappeared. Police later ruled out any terror connection. A source said: ‘The man made it clear that he had the guns with him for personal protection. The inquiry is ongoing but it is not a terrorist inquiry.’ Yesterday’s alert follows warnings from Islamist terrorist groups that Disneyland, which is 20 miles east of Paris and attracts more than 14million visitors a year, was among their targets. Security has been stepped up there since the attacks on Paris in November which left 130 dead.\nHe said: ‘Indeed we are seeing that level of activity but with a level of Russian capability that we haven’t seen before.\n‘We were used to in the Cold War playing a game of cat and mouse… but it is very different from the period of quiet submarine activity that perhaps we’ve seen in the past.’\nHe said he was starting to see nations ‘who in the past had prioritised to have submarines in the Gulf or eastern Mediterranean’, ‘now looking to reinvest that capability’ to protect British, French and American waters.\nIn October 1985, Palestinian gunmen hijacked an Italian cruise liner in the Mediterranean and threatened to blow it up.\nThe Achille Lauro was on its way to the Israeli port of Ashdod with more than 400 holidaymakers and crew onboard.\nThe four heavily armed gunmen demanded the release of 50 Palestinian militants imprisoned in Israel.\nIf their demands were not met, they threatened to blow up the ship and kill the 11 Americans on board. The next morning, they also threatened to kill the British passengers.\nThey ended up shooting an American-Jewish pensioner in a wheelchair and then threw him overboard.","url":"https://www.dailymail.co.uk/news/article-3422044/Terrorists-target-cruise-ships-Med-ranking-commander-says-ISIS-s-spread-Libya-casts-uncomfortable-shadow.html"}
