{"authors":["Breitbart News"],"date_download":"2018-10-30 20:36:03","date_modify":"2018-10-30 20:36:03","date_publish":"2015-02-03 03:49:06","description":"Shocking images from LiveLeak show what appears to be a Syrian man sentenced to death by Islamic State terrorists for being gay. He is thrown from the top of a building and miraculously survives, but after that, the rest of the town can no longer claim ISIS as his killer. |","filename":"data/vaneerConsumption/ISISThrowsAccusedGayManfromRoofbutWhenHeSurvivesTownStonesHimtoDeath.json","image_url":"https://media.breitbart.com/media/2015/02/LiveLeak-dot-com-951_1422712680-B8rpMWDCEAMW051_1422712725.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_02__1540931763.html","title":"ISIS Throws Accused Gay Man from Roof-but When He Survives, Town Stones Him to Death","title_page":"ISIS Throws Accused Gay Man from Roof–but When He Survives, Town Stones Him to Death | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"From the Daily Mail:\nA man has reportedly been blindfolded and thrown off a tower block in Syria for ‘being gay’ before being stoned to death after surviving the fall.\nNew images have emerged appearing to show ISIS militants hurling the man off the seven-storey building in the town of Tal Abyad in Raqqa.\nThe man, who was supposedly being punished for having a ‘homosexual affair’, apparently survived the fall, but was stoned to death by a waiting crowd at the foot of the tower block.\nThe London-based Syrian Observatory for Human Rights, which relies on a network of activists on the ground, claims the man was thrown from the building before being beaten to death.\nPhotographs of the incident appear to show the man – who is thought to be in his 50s – sat on a white, plastic chair while blindfolded.\nHe is surrounded by at least two masked militants, who are dressed in black clothing and army fatigues.\nThe man is then thrown from the top of the tower block and one photograph shows him falling towards the ground, head first.\n…\nAn aerial photograph then shows the waiting crowd forming a circle around the injured man before hurling rocks and stones at him. It is understood he died from his injuries.\nShocking pictures of the execution, which were posted on Live Leak, are the latest to emerge of the horrific killing of men in Syria.\nRead the rest of the story here.","url":"https://www.breitbart.com/national-security/2015/02/02/isis-throws-accused-gay-man-from-roof-but-when-he-survives-town-stones-him-to-death/"}
