{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-23 01:45:16","date_modify":"2018-10-23 01:45:16","date_publish":"2016-01-11 12:52:17","description":"The manual, translated into English, is headed 'safety and security guidelines for Lone Wolf Mujahideen and small cells' and features mocked-up images of New York buildings on fire.","filename":"data/vaneerConsumption/ISISextremistsissueupdatetoalQaedaterrormanualforlonewolfattacks.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300A5A8200000578-0-image-a-36_1452520451558.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393864_ISIS-extremists-issue-chilling-update-al-Qaeda-terror-manual-explaining-carry-lone-wolf-attacks_1540259116.html","title":"ISIS extremists issue update to al-Qaeda terror manual for 'lone wolf' attacks","title_page":"ISIS extremists issue update to al-Qaeda terror manual for 'lone wolf' attacks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ISIS has issued a chilling guide describing how to carry out 'lone wolf' terror attacks - after updating a version originally produced by al-Qaeda.\nThe manual, translated into English, is headed 'safety and security guidelines for Lone Wolf Mujahideen and small cells' and features mocked-up images of New York buildings on fire on the front page.\nThe 64-page guide was first published by al-Qaeda but has been updated by ISIS extremists to include advice on how would-be attackers can avoid being detected.\nThe manual, translated into English, is headed 'safety and security guidelines for Lone Wolf Mujahideen and small cells' and features mocked-up images of New York buildings on fire\nAccording to the Sun, it explains which encrypted mobile phone apps to use and the ones to avoid.\nThe 12-chapter manual is also said to reveal how to go online without being detected and how to tell if a spy is trying to infiltrate a small cell.\nIt is not the first time an ISIS terror guide has emerged.\nIn June it was revealed how manuals outlining how to make bombs and use firearms effectively were being circulated by British extremists online.\nThe interactive guides, which also encouraged lone wolf attacks, were compiled by a militant from England who claims to have links to ISIS.\nThe 64-page guide was first published by al-Qaeda but has been updated by ISIS extremists (file picture) to include advice on how would-be attackers can avoid being detected\nThey included step-by-step instructions on how to make car bombs 'Iraqi style' and a piece on staying anonymous while using a smartphone.\nOne, titled the Book of Terror, contains a video of the murder of Fusilier Lee Rigby, who was killed while off-duty near the Royal Artillery Barracks in Woolwich in 2013.\nIt also features a clip of the 7/7 London terror attacks, which left 52 dead and more than 700 people injured.\nIn December, senior police figures warned Britain must be braced for lone-wolf terrorist atrocities.","url":"https://www.dailymail.co.uk/news/article-3393864/ISIS-extremists-issue-chilling-update-al-Qaeda-terror-manual-explaining-carry-lone-wolf-attacks.html"}
