{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:30:03","date_modify":"2018-10-30 20:30:03","date_publish":"2015-07-02 15:31:51","description":"ISIS made advances in Egypt, launching attacks in North Sinai province despite a government crackdown against jihadi elements in the country.","filename":"data/vaneerConsumption/ISISAttacksGrowinginEgyptDespiteGovernmentCrackdown.json","image_url":"https://media.breitbart.com/media/2015/07/Smoke-Egypt-North-Sinai-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_02__1540931403.html","title":"ISIS Attacks Growing in Egypt, Despite Government Crackdown","title_page":"ISIS Attacks Growing in Egypt, Despite Government Crackdown | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Islamic State (ISIS/ISIL) made advances in Egypt as it launched a wave of attacks in restive North Sinai province despite a government crackdown against jihadi elements in the country, various new agencies report.\nAn Egyptian military spokesman told the state-run news outlet MENA that the country’s armed forces are “100 percent in control” of the violent situation, which has left dozens dead.\n“Islamic State appears to have made small but unprecedented advances in Egypt, killing dozens of soldiers as it attacked multiple military checkpoints and attempted for the first time to control a small pocket of territory in the Sinai desert,” reports The Guardian.\n“Egypt’s army said more than 100 militants and 17 soldiers were killed in the deadliest fighting in years in the restive province,” it adds.\nIt remains unclear exactly how many people were killed in the attack. Egyptian officials tried to downplay the military fatalities, notes The Guardian. Some news outlets place the military death toll at 40.\nAn estimated 30 soldiers were injured, according to CNN. The fighting continues, said Mohammed Samir Abdelaziz Ghaneem, a spokesman for the Egyptian military, on Wednesday.\nOn his Facebook page, Ghaneem reportedly said that “70 terrorists attacked 5 checkpoints simultaneously in North Sinai.”\n“We have total control of many sites [in North Sinai], and have seized what was in them,” said ISIS in a statement, according to The Guardian.\nEgyptian President Abdel Fattah el-Sisi is struggling to maintain order and security in the most populous Arab country as he faces a rise in jihadist attacks.\n“Just two days after militants assassinated Egypt’s top prosecutor on a Cairo street, on Wednesday, the military called in F-16 war planes and helicopters to beat back a coordinated assault in Northern Sinai by a jihadist group affiliated with the Islamic State,” notes The New York Times. “Egyptian soldiers were killed, police officers were trapped in their posts, ambulances were paralyzed by booby-trapped roads and residents were warned to stay indoors by jihadists roaming on motorcycles.”\nWitnesses said remains of the jihadists were still sitting in vehicles pulverized by the Egyptian military, adds the NYT.\nQuoting experts, the article mentions that “the scale and complexity of the attack far exceeded any of the group’s previous strikes in Sinai, raising the possibility that it has begun to more closely coordinate with the Islamic State leadership based in Syria.”\nAn ISIS affiliate identified as Wilayat (province) Sinai was behind the string of attacks.\nMr. Sisi has launched “a campaign to marginalize mainstream Islamists like the Muslim Brotherhood — with the authorities outlawing the group, jailing thousands, sentencing hundreds to death and using lethal force to shut down protests,” the NYT article points out.\nThe president’s “crackdown” has resulted in “thousands of arrests, mass convictions and death sentences,” according to Fox News. The Muslim Brotherhood’s Mohammed Morsi, Egypt’s former president, is among those awaiting execution.\n“As the security crises mounted this week, though, there was little evidence that the government was preparing to change course,” reports the NYT. “Officials pushed for restrictive new laws, including antiterrorism legislation and amendments that would speed up criminal sentences, including executions.”\nThe fighting primarily took place in the towns of Sheikh Zuweid and Rafah, and the militants used vehicle-borne explosives and various weapons.\nReuters reports, “The militants’ assault, a significant escalation in violence in the [Sinai] peninsula that lies between Israel, the Gaza Strip and the Suez Canal, was the second high-profile attack in Egypt this week.”","url":"https://www.breitbart.com/national-security/2015/07/02/isis-attacks-growing-in-egypt-despite-government-crackdown/"}
