{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 20:40:12","date_modify":"2018-10-30 20:40:12","date_publish":"2015-03-24 18:43:00","description":"Last summer, when ISIS issued an ultimatum to Christians in northern Iraq to “convert, pay or die,” they carried out their reign of terror by marking the houses and properties of Christians with the Arabic letter “N,” a symbol for “Nazarenes” (Christians), which they intended as a slur. |","filename":"data/vaneerConsumption/ISISBrandofShameBecomesBadgeofHonorandSolidarityforChristians.json","image_url":"https://media.breitbart.com/media/2015/03/nun-reuters.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_24__1540932012.html","title":"ISIS Brand of Shame Becomes Badge of Honor and Solidarity for Christians","title_page":"ISIS Brand of Shame Becomes Badge of Honor and Solidarity for Christians | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Last summer, when ISIS issued an ultimatum to Christians in northern Iraq to “convert, pay or die,” they carried out their reign of terror by marking the houses and properties of Christians with the Arabic letter “N,” a symbol for “Nazarenes” (Christians), which they intended as a slur.\nIn Mosul, Islamic militants spray-painted the ن on all Christian property to be seized after the ultimatum, much as the Nazis marked Jewish homes and businesses with the word “Jude” during the Second World War.\n“Nun,” or ن​, is the first letter of the Arabic word for Christian, “Nasrani.”\nFrom that time, an online Christian solidarity movement began to raise awareness about the fate of Mosul’s Christians. Users began changing their profile pictures on Facebook and Twitter to pictures of the letter ن​, the same letter notoriously branding their Iraqi co-religionists, turning it into a symbol of support.\nAccording to reports, some sympathetic Muslims have also joined in solidarity, holding leaflets stating “I am Iraqi, I am Christian,” or marking themselves with the letter ن​​.\nThe ن is now being shared on social media as a symbol of solidarity with the Iraqi Christians and all those suffering under Islamic persecution. The Catholic blog Rorate Caeli wrote, that the Islamists “mean it as a mark of shame, we must then wear it as a mark of hope. . . You may kill our brethren and expel them but we Christians will never go away.”\nThe hashtag #WeAreN is also trending, along with pictures of people of all religions drawing the ن in red ink on their bodies.\nOne group, called Voice of the Martyrs, has started producing t-shirts with the symbol ن​​ to raise money for Iraqi Christians who have fled the jihadists. The group provides them with daily necessities as well as assisting them toward resettlement. Many of the persecuted Christians fled the area with only the clothes on their backs.\nThe group offers “i-am-n” shirts, together with the Arabic symbol, and uses the funds collected to assist the refugees.\nFollow Thomas D. Williams on Twitter @tdwilliamsrome.","url":"https://www.breitbart.com/national-security/2015/03/24/isis-brand-of-shame-becomes-badge-of-honor-and-solidarity-for-christians/"}
