{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-23 01:07:39","date_modify":"2018-10-23 01:07:39","date_publish":"2016-01-11 11:42:57","description":"ISIS used a complex system to monitor movements through the Syrian border town of Tel Abyad before the extremists were driven out by Kurds over the summer, documents reveal.","filename":"data/vaneerConsumption/ISISranimmigrationoperationallowingSyrianvillagersintoTurkey.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/30078A9900000578-0-image-a-6_1452512161606.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393755_ISIS-ran-sophisticated-immigration-operation-allowing-villagers-terrorism-hotbeds-Turkey-Syria-newly-documents-show_1540256859.html","title":"ISIS ran immigration operation allowing Syrian villagers into Turkey","title_page":"ISIS ran immigration operation allowing Syrian villagers into Turkey | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ISIS ran a 'sophisticated' immigration operation allowing villagers from terrorism hotbeds into Turkey from Syria, newly-found documents show.\nThe extremists used a complex system to monitor movements through the Syrian border town of Tel Abyad before the militants were driven out by Kurds over the summer.\nKurdish commanders found a series of passenger manifests dating from late 2014 to early 2015 showing how buses had passed through the town.\nThe extremists used a complex system to monitor movements to and from the Syrian border town of Tel Abyad (pictured during battles in June)before the militants were driven out by Kurds over the summer\nAccording to the Guardian, which obtained the documents, the papers show how the names, birth dates and identification numbers of passengers were taken down by ISIS operatives.\nThe seven papers were said to be marked up with stamps for the terror group's 'department of transport' and 'department of immigration'.\nMany of those registered were coming from territory held by ISIS, the Guardian reports, while one document shows a group of five Tunisians coming to the area.\nThe men and women were documented as having travelled from Kairouan, the Tunsian city where Seifeddine Rezgui, who murdered 30 British tourists on a beach in Sousse in June, was studying.\nThe Guardian says it was given the manifests by a Syrian Kurdish forces representative and that they show the records of 70 passengers - including seven babies.\nSome buses were recorded as being on their way to Raqqa and others were carrying families from the Iraqi city of Mosul following its fall to ISIS.\nTel Abyad was captured by Kurdish-led forces from ISIS in June with the help of US-led air strikes. At this point, Turkey closed the border crossing and it remains shut today.\nMembers of Kurdish People Defence Units (YPG) flash victory signs after arriving in Tel Abyad im June\nA Turkish government official told the Guardian the country was doing everything it could to 'stop the influx' of foreign fighters.\nHe added that between January 2014 and November last year, Turkey had detained more than 200,000 people for illegally crossing the border.\nSpeaking to MailOnline in November, a British YPG fighter based in Syria said Tal Abyad was once a key crossing point for ISIS.\nUsing his nom de guerre, Heval Botan said: 'Tal Abyad used to be the primary supply route between Raqqa and Turkey when Daesh controlled it and cross border traffic was huge.\n'When the city fell to the YPG, Turkey closed the crossing and it has remained shut ever since.'\nTurkey, which aspires to join the EU, has faced sustained pressure over its borders and has pledged to take steps to reduce the record number of illegal migrants trying to teach Europe in exchange for a 3 billion euro aid package.","url":"https://www.dailymail.co.uk/news/article-3393755/ISIS-ran-sophisticated-immigration-operation-allowing-villagers-terrorism-hotbeds-Turkey-Syria-newly-documents-show.html"}
