{"authors":["John Hayward"],"date_download":"2018-10-30 21:08:22","date_modify":"2018-10-30 21:08:22","date_publish":"2015-03-10 21:34:05","description":"Last month, the Islamic State's magazine Dabiq included an \"interview\" with a prisoner named Muhammad Said Ismail Musallam, who was supposedly a spy recruited by Israeli intelligence. Now it has been followed by a videotaped execution perpetrated by a pistol-packing child. |","filename":"data/vaneerConsumption/ISISUsesChildToExecuteMossadSpyInNewPropagandaVideo.json","image_url":"https://media.breitbart.com/media/2015/03/isis-libya-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_10__1540933702.html","title":"ISIS Uses Child To Execute 'Mossad Spy' In New Propaganda Video","title_page":"ISIS Uses Child To Execute 'Mossad Spy' In New Propaganda Video | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Last month, the Islamic State’s magazine Dabiq included an “interview” with a prisoner named Muhammad Said Ismail Musallam, who was supposedly a spy recruited by Israeli intelligence. Now it has been followed by a videotaped execution perpetrated by a pistol-packing child.\nThe new Islamic State video purports to tell “a story whose chapters begin in the corridors of Jewish intelligence in the land Israel, and conclude in Dar al-Islam at the feet of the Caliphate’s young lions.” Flashy computer graphics introduce the 19-year-old victim as a “Mossad agent” and target the location of his family home.\nAn interview is then conducted with Musallam, clad in an orange jumpsuit. He recounts essentially the same story told in Dabiq, about his father and brother encouraging him to work with Israeli intelligence. His father and brother appear in spy-movie computer graphic overlays, ominously labeled “Mossad agents” as well.\nMussallam calls on his family to “repent,” and warns that spying attempts against the Islamic State are doomed to failure, with captured spies like himself subjected to the “hadd” – the execution of apostates under Islamic law. The scene then shifts to Mussallam’s execution, where he is led into an open field by a young boy, who is described as a “cub of the caliphate” by an older French-speaking jihadi.\nThe older man praises the Charlie Hebdo massacre and kosher grocery hostage crisis in Paris – “Oh Jews, Allah has gifted us with killing your followers in your own stronghold in France” – and vows that the Islamic State will cleanse the Jewish “filth” out of Jerusalem, including a call for Muslims in Jerusalem to murder the “Mossad spies” in their midst. He also throws in a reference to the Crusades, as Islamists and certain Western politicians are wont to do.\nProceedings are then handed off to the boy, who is shown – with several theatrical edits, a musical soundtrack, and slow-motion footage – leveling a pistol at the prisoner’s head and pulling the trigger. The bloody corpse of the dead man is lingered upon at length, along with “heroic” footage of the young killer, seemingly towering over Jerusalem.\nThe final minutes of the video are supposed to reveal members of “Mossad cells” for ISIS followers to kill, beginning with Mussallam’s family, purportedly targeting both their homes and places of employment.\nThe Jerusalem Post reports that both news and intelligence services, including Israeli intelligence, are aware of the video, but could not confirm its authenticity. It’s been disseminated by the ISIS social media network. With all due appreciation for the risk of giving them what they want by watching it, and with the understanding that it includes graphic content, a copy of the video from The Right Scoop appears below.","url":"https://www.breitbart.com/national-security/2015/03/10/isis-uses-child-to-execute-mossad-spy-in-new-propaganda-video/"}
