{"authors":["John Hayward"],"date_download":"2018-10-30 21:08:21","date_modify":"2018-10-30 21:08:21","date_publish":"2015-03-12 19:58:02","description":"The Associated Press reports that the boy executioner and his adult mentor from the latest ISIS snuff film, in which the boy executes a 19-year-old Palestinian accused of being a \"Mossad spy,\" have been identified as French citizens. The older jihadi may be linked to a horrific attack on a Jewish school in France in 2012. |","filename":"data/vaneerConsumption/ISISExecutionVideoBoyKillerAndHisMentorIdentifiedasFrenchCitizens.json","image_url":"https://media.breitbart.com/media/2015/03/isis-boy-killer-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_12__1540933701.html","title":"ISIS Execution Video Boy Killer And His Mentor Identified as French Citizens","title_page":"ISIS Execution Video Boy Killer And His Mentor Identified as French Citizens | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Associated Press reports that the boy executioner and his adult mentor from the latest ISIS snuff film, in which the boy executes a 19-year-old Palestinian accused of being a “Mossad spy,” have been identified as French citizens. The older jihadi may be linked to a horrific attack on a Jewish school in France in 2012.\nCuriously, the French government seems quite certain about this, presumably based on much more than the man speaking French in the video, even though they do not appear to have identified either the man or boy personally. The report is written to suggest there are strong, but officially unconfirmed, suspicions as to the older individual’s identity: “Investigators are probing if he could be a person who has been identified variously as the step-brother or half-brother of Mohammed Merah, who killed seven people in attacks on a Jewish school and paratroopers in the south of France beginning on March 11, 2012 – exactly three years ago.”\n“In photos from Merah’s funeral after his death in a shootout with police, the relative is identified as Sabri Essid, whose father was married to Merah’s mother. Essid strongly resembles the man in the Islamic State video, notably in the shape of the eyes,” the Associated Press adds.\nAnother detail about the execution video related in this story is the slain Palestinian’s father – himself targeted for execution as a Mossad agent in the video, right down to graphics purportedly showing where he lives and works – claiming that his son was in fact an ISIS recruit who had soured on the terror state and wanted to come home, especially after learning his mother was ill.\nSaid Mussallam also called for divine retribution against ISIS chief Abu Bakr al-Baghdadi for the death of his son Mohammed: “I will leave it to God, and what happened to my son Mohammed, I hope God will do the same for you, your sons and your family. God knows that one day we’ll meet, whether in paradise or in hell, and we’ll settle the accounts.”\nThe “Mossad agent” cover would then have been a fabrication of ISIS, designed to make his death useful for propaganda purposes, because threatening to shoot your own troops if their morale doesn’t improve rarely improves morale. The White House claims to have heard increasingly reports of the Islamic State executing deserters, which is taken as an encouraging sign that the jihadi army is falling apart.\nAlso troubling is the emphasis ISIS is putting on using children as operatives, the “young lions of the caliphate,” as the older man refers to his youthful accomplice in the execution video. Another French citizen who died fighting for ISIS recently was described as a “young teen,” with two older brothers previously killed in the Syrian war zone. The recent video seems to be part of a series in which the Islamic State depicts young children as eager killers for the caliphate, although it’s questionable whether the children actually carried out the killings shown in these films – the UK Daily Mail notes that freeze-frame analysis of Mussallam’s execution shows an adult hand holding the gun to his forehead during the last moment before the shot is fired.","url":"https://www.breitbart.com/national-security/2015/03/12/isis-execution-video-boy-killer-and-his-mentor-identified-as-french-citizens/"}
