{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-23 00:33:26","date_modify":"2018-10-23 00:33:26","date_publish":"2017-03-16 09:57:09","description":"WARNING GRAPHIC CONTENT: The body was found in a mass grave of some 24 ISIS victims - mostly children - in Mosul, Iraq, after an area of the besieged city was seized back off the terror group.","filename":"data/vaneerConsumption/ISISmurdertinygirlasIraqsoldierisbroughttotears.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E52972100000578-0-image-a-103_1489657524471.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319438_Tiny-girl-murdered-ISIS-brings-Iraqi-soldier-tears_1540254806.html","title":"ISIS murder tiny girl as Iraq soldier is brought to tears","title_page":"ISIS murder tiny girl as Iraq soldier is brought to tears | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the harrowing moment a battle-hardened Iraqi soldier was brought to tears after uncovering the remains of a tiny girl murdered by ISIS.\nThe body was found in a mass grave of some 24 victims - most of them children - in Mosul, northern Iraq, after an area of the besieged city was seized back off the terror group.\nShocking pictures show the unknown youngster wrapped in a blanket and a soldier overcome with grief next to the burial site.\nThe images highlight the horrific reality of ISIS rule in the war-torn city where mass executions of civilians are carried out even for the 'crime' of trying to flee to a safer area.\nHarrowing pictures show the body of an unknown girl wrapped in a blanket after a mass grave of ISIS victims was discovered in Mosul\nHarrowing: An Iraqi soldier broke down in tears after his unit uncovered the body in a mass grave of 24 people - mostly children - after reclaiming and area of Mosul\nIraqi fighters came across the grave as they made further inroads in their battle to reclaim Mosul from ISIS.\nPictures show the bodies of adults and children covered with blankets next to a shallow grave in a remote patch of land about 100ft from a road.\nThey emerged as Iraqi government forces attempted to encircle Mosul's Old City on Thursday in a bid to bottle up ISIS militants.\nHowever, progress was slowed by car bombs and booby-traps in houses and alleyways, officers said.\nThe army and security forces have made significant gains in recent days in the battle that started back in October, seizing a main bridge over the Tigris river and advancing towards the mosque in the Old City from where ISIS leader Abu Bakr al-Baghdadi declared a caliphate in 2014.\nBut the fighting is expected to become even harder as the militants defend their last enclaves in what was once their stronghold in Iraq.\nThe images highlight the horrific reality of ISIS rule in the war-torn city where mass executions of civilians are carried out even for the 'crime' of trying to flee to a safer area\nAn Iraqi fighter looks into a blanket at the site of a mass grave containing some two dozen people. Government forces made the horrific discovery as they made further inroads in their battle to reclaim Mosul from ISIS\n'We have a plan to surround the Old City. Today we have advanced from the right and left sides and the only part left is right in the middle. God willing we will continue this plan today,' Federal Police Major General Haidar Dhirgham said.\nThe need to ensure the safety of civilians, many of them hungry from a lack of provisions and traumatised by living under Islamic State's harsh rule, was also a priority.\n'I expect the liberation of Mosul completely in one month. I will not tell you one or two weeks, because that's not true, but within one or two months it will be completely liberated,' Dhirgham told Reuters.\nSeveral more areas of western Mosul had been recaptured, including the hospital, over Wednesday and Thursday morning.\n'There are only some neighbourhoods that remain, like the Old City. This is too narrow but our forces will be able to enter soon.'\nAs many as 6,000 ISIS fighters remained in Mosul, including other Arab nationalities and foreigners, he said.\nSuicide bombers were driving explosive-rigged cars at troops. There had been three such attacks on Thursday morning, he said. Troops has also seized buildings in which suicide vehicles were being prepared.\nPictures show the bodies of adults and children covered with blankets next to a shallow grave in a remote patch of land about 100ft from a road\n'The enemy...has started to set fire to houses which means that are on the retreat. They have destroyed homes and have destroyed families,' Dhirgham said.\nMosul has served as ISIS's de facto capital since al-Baghdadi proclaimed himself head of a caliphate spanning Iraq and Syria from the Nuri Mosque in July 2014.\nThe recapture of the city by the government would drive the remnants of the ISIS army into the hinterlands. In neighbouring Syria, three separate forces are advancing on the city of Raqqa, the main Syrian city under Islamic State control.\nAs well as waging jihad in Iraq and Syria, the militants have inspired attacks in cities in Europe, Africa and elsewhere that have killed hundreds of civilians.\nU.S. and other Western countries have been providing air, artillery and other support to the Mosul offensive, reflecting the international concern over the IS threat.\nHowever, the presence of tens of thousands of civilians in ISIS-held areas means that simply pulverising them is a risky proposition. Thousands of residents have escaped to government lines in recent days but it has been impossible to tally the number of civilian casualties.\n'We will liberate civilians before liberating the land,' Dhirgham said. 'We will take them out of the neighbourhoods, if we have their consent. If they would like to flee to an area in the back flanks or if we could secure them within their neighbourhoods, we will secure them in their homes.'","url":"https://www.dailymail.co.uk/news/article-4319438/Tiny-girl-murdered-ISIS-brings-Iraqi-soldier-tears.html"}
