{"authors":["Corey Charlton For Mailonline"],"date_download":"2018-10-23 03:17:47","date_modify":"2018-10-23 03:17:47","date_publish":"2016-01-11 15:58:46","description":"It was reported Al-Jawhara Mall, in the Baghdad's north, was stormed by gunmen this afternoon after a car bomb nearby killed 18 people and injured 50.","filename":"data/vaneerConsumption/ISISclaimresponsibilityforattackonBaghdadshoppingmall.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300D662200000578-0-image-a-125_1452534335083.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394136_Seven-killed-gunmen-hostages-mall_1540264667.html","title":"ISIS claim responsibility for attack on Baghdad shopping mall","title_page":"ISIS claim responsibility for attack on Baghdad shopping mall | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gunmen killed at least 18 people and took an estimated 75 more hostage after blowing up a car bomb and storming a shopping mall in eastern Baghdad.\nAfter detonating the bomb then opening fire on crowds, the gunmen holed up in the shopping centre in the Baghdad al-Jadida district, amid fears they were wearing suicide belts.\nHowever, Iraqi commandos landed on the roof, where they clashed with attackers inside, killing two and arresting another four.\nISIS has now claimed responsibility for the attack, which would mark a step up in coordination for an attack in Baghdad, which ISIS has previously only subjected to crude suicide bombings.\nScroll down for video\nAt least 18 people are believed to have been killed in the gunmen's attack on a mall in Baghdad (pictured)\nFollowing the detonation of the bomb, the gunmen holed up in the shopping centre in the Baghdad al-Jadida district, amid fears they were wearing suicide belts\nA man pushes his damaged car away from the site of the car bomb attack\nISIS has now claimed responsibility for the bombing, which would mark a step up in coordination for an attack in Baghdad. Pictured right is the purported remains of the car bomb which started the assault\nA police official said the attackers entered the mall and when security forces got too close, they killed three hostages.\nHe described the mall as a building of four or five floors in a busy commercial area of Baghdad, in a populous Shiite-majority area on the eastern edge of the Iraqi capital.\nA large plume of black smoke could be seen billowing into the sky above the area where the mall was located.\nPolice said a counter-terrorism force from the intelligence services was dispatched and snipers posted on buildings around the mall.\nAn interior ministry source said the gunmen opened fire in the street after a car bomb exploded at the entrance to the mall and briefly clashed with members of the security forces before entering.\nThe bomb detonated at the entrance of Al Jawhara Mall (pictured) before the attackers stormed the centre\nAn Iraqi policeman inspects debris at the site of the attack. Most of the main roads in this part of Baghdad have been closed according to a police colonel\nPeople gather at the site of the car bomb. ISIS have claimed responsibility for the attack and the Iraqi intelligence services announced in December they had detained 40 ISIS members as part of major swoop in the Baghdad area\nISIS has carried out dozens of suicide car bomb attacks but Monday's hostage-taking would be the first of its kind since ISIS seized control of large parts of Iraq in 2014.\nThe spokesman for Baghdad Operations Command, Saad Maan, claimed the attack was over and the security forces 'in full control of the situation' but other security sources insisted the standoff was ongoing.\n'There is a major security deployment around the scene of the attack. Most of the main roads in this part of Baghdad have been closed,' the police colonel said.\nIraqi security forces gather at the site of the car bomb. ISIS claimed responsibility of the attack, they have suffered a number of military setbacks across Iraq in the past year\nPictured is the remains of the car bomb which detonated outside the shopping mall in Baghdad earlier today\nIraqi municipal workers clean debris at the site of the attack\nISIS has suffered a number of military setbacks across Iraq in the past year. Security officials say fierce battles and relentless air strikes have depleted its manpower.\nAnalysts see that a reason for the drop in attacks targeting civilians in the capital which were an almost daily occurrence two years ago.\nThe Iraqi intelligence services announced on December they had detained 40 ISIS members as part of major swoop in the Baghdad area.","url":"https://www.dailymail.co.uk/news/article-3394136/Seven-killed-gunmen-hostages-mall.html"}
