{"authors":["Vanessa Rancaño"],"date_download":"2018-10-23 05:45:15","date_modify":"2018-10-23 05:45:15","date_publish":"2015-12-22 00:00:00","description":"Fashion models feel pressured to be dangerously thin, and France has passed a law to fine fashion houses for hiring underweight models. Researchers say it's a workplace health issue in the U.S., too.","filename":"data/vaneerConsumption/IsItTimeToSetWeightMinimumsForTheFashionIndustry.json","image_url":"https://media.npr.org/assets/img/2015/12/22/models-1_wide-3577565c239563e0329775ddd7a1ccb0a9c26d1b.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2015_12_22_460682633_is-it-time-to-set-weight-minimums-for-the-fashion-industry_1540273515.html","title":"Is It Time To Set Weight Minimums For The Fashion Industry?","title_page":"Is It Time To Set Weight Minimums For The Fashion Industry?  : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Is It Time To Set Weight Minimums For The Fashion Industry?\nEnlarge this image toggle caption Marcin Kilarski/EyeEm/Getty Images Marcin Kilarski/EyeEm/Getty Images\nYou may have heard some of the fashion industry horror stories.\nModels eating tissues or cotton balls to stave off hunger. Models collapsing from malnutrition-induced heart attacks just seconds after they step off the runway. Even models growing a layer of downy fuzz as their bodies try to keep warm.\nExcessively skinny models have been a point of controversy for decades, and two researchers say their body mass should be a workplace health and safety issue. In an editorial released Monday in the American Journal of Public Health, Katherine Record and S. Bryn Austin make their case for government regulation of the fashion industry.\nThe average international runway model has a body mass index under 16 — low enough to indicate starvation by the World Health Organization's standard. And Record and Austin are worried not just about the models themselves but about the legions of girls and women their images influence.\nEnlarge this image toggle caption Ernesto Ruscio/Getty Images Ernesto Ruscio/Getty Images\n\"Especially girls and teens,\" says Record, who is a deputy director with the Massachusetts Health Policy Commission. \"Seventy percent of girls ages 10 to 18 report that they define perfect body image based on what they see in magazines.\" That's especially worrying, she says, given that anorexia results in more deaths than does any other mental illness, according to the National Institute of Mental Health.\nRecord and Austin, a professor of social and behavioral sciences at the Harvard T.H. Chan School of Public Health, want the Occupational Safety and Health Administration to step in and create worker protection standards like it does for other dangerous industries. It's commonly known that certain diseases are linked with occupations, they argue, like lung disease in coal miners. \"Professional fashion models are particularly vulnerable to eating disorders resulting from occupational demands to maintain extreme thinness,\" they write.\nTheir suggestion is to prohibit agents from hiring models with a BMI below 18. By that standard, a 5-foot-9-inch model would need to weigh at least 122 pounds. \"Which is still quite thin,\" Record notes, but not dangerously so.\nIn April, France passed a law setting lower limits for models' weight. Agents and fashion houses who hire models with a BMI under 18 could pay $82,000 in fines and spend up to six months in jail. Israel also has BMI restrictions for models, and local initiatives regulate models in Milan and Madrid. Those bans were imposed in 2006, after the high-profile deaths of two models, Ana Carolina Reston and Luisel Ramos. In 2010 French model Isabelle Caro, who had campaigned to curb anorexia, died of the disease at age 28.\nRegulating the fashion industry in the United States won't be easy, Record says. She likens the task to taking on Big Tobacco. But with the new rules in France, U.S. support could make a difference. A designer can't survive without participating in Paris Fashion Week, she says, adding, \"Our argument is that the same would be true of New York Fashion Week.\"","url":"https://www.npr.org/sections/health-shots/2015/12/22/460682633/is-it-time-to-set-weight-minimums-for-the-fashion-industry"}
