{"authors":[],"date_download":"2018-10-30 14:16:34","date_modify":"2018-10-30 14:16:34","date_publish":"2018-06-20 00:00:00","description":null,"filename":"data/vaneerConsumption/Isitreallytariffsthatarekillingnewspapers.json","image_url":"https://www.americanthinker.com/images/bucket/2018-06/206788.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2018_06_is_it_really_tariffs_that_are_killing_newspapers_comments_1540908994.html","title":"Is it really tariffs that are killing newspapers?","title_page":"Blog: Is it really tariffs that are killing newspapers?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Members of Congress and newspapers themselves are complaining that the tariff on paper from Canada is killing the newspaper press. In this Washington Examiner article, they give an example of a newspaper with 20,000 copies per day having an increased cost of $250,000 per year. I have to wonder why journalists don't tell us what that is per day for the cost of each paper. Why do they use the gross annual cost instead of the unit cost, which is the relevant number? The answer is 3.4 cents per day. Most newspapers cost around $2 per day and most are getting smaller in size, and we are supposed to believe that 3.4 cents per day is bankrupting them? These newspapers routinely support tax increases and certainly would not care if a tax increase cost someone 3.4 cents per day. Yet according to a headline in the Washington Examiner, \"Trump's tariff on Canadian newsprint is killing US newspapers, Republicans... (Read Full Post)","url":"https://www.americanthinker.com/blog/2018/06/is_it_really_tariffs_that_are_killing_newspapers_comments.html"}
n be done on how much those tariffs are crushing local newspapers around the country.\nThe bill, introduced by Rep. Kristi Noem, R-S.D., is a response to the 22-percent tariff that the Trump administration has imposed on some Canadian newsprint since the beginning of this year. Noem said that tariff has led to rising costs for local newspapers, and these are a threat to their survival. The Examiner reports her saying:\n\"In recent years, new tariffs on Canadian newsprint have increased paper prices by 20 to 30 percent,\" Noem said in a statement. \"That's significant. A paper that services around 20,000 customers, for instance, could see paper costs rise by about a quarter-million dollars annually, threatening the newspaper's survival.\"\nWe also heard how much harm the aluminum and steel tariffs would harm companies that sell soda, beer, soup, etc., and it turns out it is less than one cent per can.\nWe heard how much it would cost car-manufacturers, and it turns out to be less than 1% per car.\nAlmost all businesses have received huge tax cuts, and many have gotten regulatory relief under Trump. Why don't they quit complaining and use some of those savings to eat the minor cost increases due to the tariffs? The tariffs are also temporary until foreign countries stop charging so many tariffs and taxes on U.S. products.\nWhy don't newspapers list all the foreign tariffs and taxes instead of whining and blaming Trump every day? The economy is humming because of Trump's pro-business policies, and he is continually being trashed by ingrates. The U.S. has let foreign countries abuse the U.S. for a long time, and it is good that someone is finally addressing the problems.\nWould it be OK if Airbus lowered its prices to levels that would price Boeing out of the market, or would it be proper for a president to stop those obviously subsidized prices even though it might raise the price for airlines and consumers?\nBusiness have more money because of the tax cuts and reforms – enough to give individuals raises. Utilities throughout the country are cutting rates for businesses and individuals, especially helping small businesses, the poor, and the middle class. Instead of getting stories like that, we get daily stories trashing Trump and pretending he is hurting businesses and people.\nYou have to go to think-tanks to see the real story, it seems, such as this one: \"101 utilities have lowered electric, gas, or water rates due to the Tax Cuts and Jobs Act.\"\nThanks to the tax cuts passed by the Republican House and Senate, and signed by President Donald Trump, at least 101 utilities across the country are lowering rates for customers, according to a report from Americans for Tax Reform. This means lower electric bills, lower gas bills, and lower water bills for Americans. The Tax Cuts and Jobs Act cut the corporate rate from 35% to 21%. Utility companies are passing on the tax savings in the form of lower rates for customers.\nIt is a shame so many journalists would rather have a slower economy and a more powerful government. That is stupidity.\nNewspapers have been going downhill for years because of the internet, not tariffs. They've also hurt their credibility – and circulation numbers – through their devotion to one party. Now they blame Trump for their problems. What a crock. It is always someone else's fault – sort of like blaming Trump for what Samantha Bee said.","url":"https://www.americanthinker.com/blog/2018/06/is_it_really_tariffs_that_are_killing_newspapers.html"}
