{"authors":["Brandi Neal"],"date_download":"2018-10-31 01:47:28","date_modify":"2018-10-31 01:47:28","date_publish":"2018-08-27 18:50:30","description":"Walking into a pet store and trying to choose the best food for Fido can be overwhelming. Should you get kibble, dehydrated-human grade, wet, or raw food? Is it OK to feed your dog a raw diet? A new study published in the Journal of Animal Science…","filename":"data/vaneerConsumption/IsItOKToFeedYourDogARawDietItMightHaveHealthBenefitsANewStudySays.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/45024da9-b633-4ab0-b367-0cab459fb7d9-getty-160381778.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-it-ok-to-feed-your-dog-a-raw-diet-it-might-have-health-benefits-a-new-study-says-10250622_1540950448.html","title":"Is It OK To Feed Your Dog A Raw Diet? It Might Have Health Benefits, A New Study Says","title_page":"Is It OK To Feed Your Dog A Raw Diet? It Might Have Health Benefits, A New Study Says","title_rss":"NULL","source_domain":"bustle.com","text":"Walking into a pet store and trying to choose the best food for Fido can be overwhelming. Should you get kibble, dehydrated-human grade, wet, or raw food? Is it OK to feed your dog a raw diet? A new study published in the Journal of Animal Science found that while raw and fresh-food diets do have health benefits, it's really up to each individual pet parent to decide on a food based on what they know about their dog.\nAccording to a news release about the study, researchers tested the palatability and digestibility of three commercially marketed fresh and raw diets for dogs, as well as a traditional kibble diet on eight healthy beagles for 30 days. The foods included a raw diet, a lightly cooked and roasted refrigerated diet, a lightly cooked grain-free roasted-refrigerated diet, and traditional dry dog food.\n\"The roasted diets turned out to be more digestible than the kibble, and both the grain-free roasted diet and the raw diet resulted in lower blood triglyceride levels than the kibble diet, even though they were higher in fat,\" the news release noted. If you have a dog, Fido is likely part of your family, and you want to make sure you're giving him the most nutritious food available. If you do decide to try a raw diet, it's important to talk to your vet to make sure it's a good option based on your dog's overall health and dietary needs.\nFor example, if your dog has severe allergies, your vet might suggest a limited-ingredient, grain-free diet. And, not every diet is right for every dog. That being said, a lot of pet parents have also found success with raw diets, especially for dogs with skin problems.\n\"He was missing hair on the back of his spine and was slightly underweight, but since he's been on the raw diet his hair has evened out and he even gained a little weight,\" Jessica Winstead told PetMD about the results she saw from feeding her Chihuahua mix a raw diet. In general, veterinarians seem to have differing opinions about raw diets, and it can be hard to know whether or not it's something you should try.\nIf you do decide to go raw, PetMD noted that's important to understand the basics of nutrition so your dog is getting everything she needs to thrive. This is why — if you can afford it — it makes sense to start with a ready-made option versus making your own. However, even with out-of -the-fridge brands, you still might have to adjust Fido's diet over time based on the results you're seeing.\n\"The difference is not so much in how a nutritionist and an owner define raw, the difference is more in what is considered balanced,\" Dr. Judy Morgan, DVM, certified in acupuncture and food therapy and member of the Botanical Veterinary Medical Association, told PetMD. \"For example, some dogs lose too much weight on raw food diets and might need the help of a nutritionist to figure out what to add to the mix (such as cooked grains or additional fat) to solve the problem.\"\nNo matter which diet you choose, nutrition does matter. I've seen first hand with all of my dogs how the right diet makes all the difference in the world. What's more, getting Fido's nutrition right can mean less visits to the vet for things like yeast overgrowth, allergies, and ear infections. \"As far as diet format and market segment is concerned, it ultimately comes down to consumer preference and philosophy,\" Kelly Swanson, corresponding author on the new study, said in the news release. \"As long as a diet is shown to be safe and meets the nutritional needs of the pet in question, it is an acceptable option to me.\"\nUltimately, it's up to you. There's no one-size-fits-all approach to dog diets. Just like people, different dogs need different things based on their overall health. If you're not sure what's best for your dog, talk it over with your vet so you can offer Fido a food that'll let him strut down the sidewalk showing off his shiny coat like a boss.","url":"https://www.bustle.com/p/is-it-ok-to-feed-your-dog-a-raw-diet-it-might-have-health-benefits-a-new-study-says-10250622"}
