{"authors":["Carina Wolff"],"date_download":"2018-10-31 01:51:53","date_modify":"2018-10-31 01:51:53","date_publish":"2018-09-13 21:28:09","description":"We all know how important sleep is, so it would feel correct to assume that the more sleep you get, the better. However, it is possible to have too much of a good thing, and this includes sleep. There are a number of surprising things that can…","filename":"data/vaneerConsumption/IsItPossibleToSleepTooMuch6ThingsThatHappenWhenYouGetTooMuchRest.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/279d1199-0fa6-4858-9c82-dd69b803444a-fotolia_207450399_subscription_monthly_m.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-it-possible-to-sleep-too-much-6-things-that-happen-when-you-get-too-much-rest-11881833_1540950713.html","title":"Is It Possible To Sleep Too Much? 6 Things That Happen When You Get Too Much Rest","title_page":"Is It Possible To Sleep Too Much? 6 Things That Happen When You Get Too Much Rest","title_rss":"NULL","source_domain":"bustle.com","text":"We all know how important sleep is, so it would feel correct to assume that the more sleep you get, the better. However, it is possible to have too much of a good thing, and this includes sleep. There are a number of surprising things that can happen when you sleep too much, which is important to keep in mind if you're someone who likes to doze off deep into the day. Although this doesn't give you an excuse to stay up all night, you also don't want to overdo it when it comes to getting rest.\nWhen it comes to getting good sleep, it seems that between seven to nine hours is the sweet spot, according to research from the National Sleep Foundation. \"There is evidence that both long sleep of more than nine hours, and short sleep, of less than 5 hours, are associated with increases in all time mortality,\" sleep expert and psychiatrist Dr. Alex Dimitriu tells Bustle. \"So it does appear that sleeping too much, or too little, can be associated with negative health outcomes.\"\nEven though it might feel good to sleep for long periods of time, you don't want to put your risk at health. Here are six surprising things that can happen when you get too much sleep, according to experts.\n1 A Hangover-Like Effect Andrew Zaeh for Bustle Ever felt groggy and out of it after a long night of sleep? It's not in your head. \"In the short-term, sleeping too much can cause a hang-over like effect, with sleepiness lasting throughout the day,\" says Dr. Dimitriu. Some scientists even call this \"sleep drunkenness,\" according to Wired. This sleepy daze is a result of your body's natural circadian rhythm being thrown out of whack.\n2 Insomnia ALDECAstudio/fotolia When you sleep too much, you're far less likely be tired when it comes to bedtime, and this can lead to issues falling asleep. \"Getting too much sleep can result in subsequent insomnia on the following night,\" says Dr. Dimitriu. \"The body simply isn’t ready to go back to sleep, after, say, eight hours of wakefulness.\"\n3 Increased Risk Of Heart Disease And Stroke Hannah Burton/Bustle Sleeping too much each night can increase your risk of early death from heart disease and stroke, according to research published in the Journal of the American Heart Association. This is especially true if you are getting more than 10 hours of sleep per night. The study found that participants who slept for 10 hours were 30 percent more likely to die and nearly 50 percent more likely to develop cardiovascular disease. \"Sleeping too much often leaves too little time in the day for anything else, so productivity, exercise, and social networking can suffer,\" says Dr. Dimitriu. If you are having difficulty waking up after sleeping extensively, speak to your doctor about why you may be feeling so fatigued.\n4 Depression Andrew Zaeh for Bustle Just as too little sleep is linked with increased risk of depression, so is too much sleep, according to research published in the journal Sleep. In this case, it's hard to pinpoint causality, as sleeping a lot can also be a symptom of depression. \"Requiring too much sleep, in some cases, can be associated with medical conditions including illness, depression, sleep apnea, or endocrine problems, which will negatively impact health,\" says Dr. Dimitriu. \"In these cases, the long sleep pattern is likely an outcome rather than cause of poor health, but an important marker, nonetheless.\"","url":"https://www.bustle.com/p/is-it-possible-to-sleep-too-much-6-things-that-happen-when-you-get-too-much-rest-11881833"}
