{"authors":["Tai Gooden"],"date_download":"2018-10-31 00:02:40","date_modify":"2018-10-31 00:02:40","date_publish":"2018-10-28 11:00:29","description":"It only took three episodes for The Walking Dead Season 9 to confirm what fans with common sense already knew — Jadis/Anne is shady. She has been in contact with the helicopter person and admitted to Gabriel that she has traded people to this…","filename":"data/vaneerConsumption/IsJadisAWhispererOnTheWalkingDeadThisShadyCharacterIsHarboringAnIntriguingSecret.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/24/e8552084-b24f-402f-9748-e21bcc8d9c45-twd_903_gp_0525_0305_rt.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-jadis-a-whisperer-on-the-walking-dead-this-shady-character-is-harboring-intriguing-secret-12972483_1540944160.html","title":"Is Jadis A Whisperer On 'The Walking Dead'? This Shady Character Is Harboring An Intriguing Secret","title_page":"Is Jadis A Whisperer On 'The Walking Dead'? This Shady Character Is Harboring An Intriguing Secret","title_rss":"NULL","source_domain":"bustle.com","text":"It only took three episodes for The Walking Dead Season 9 to confirm what fans with common sense already knew — Jadis/Anne is shady. She has been in contact with the helicopter person and admitted to Gabriel that she has traded people to this mysterious group for supplies. She also knocked him out last episode, so his future is not looking really bright. But, fans are still speculating and want to know if Jadis is a Whisperer or just a shady pawn for some other group fans don't even know about yet? It’s not likely based on the group’s comic book history.\nThe Whisperers were a group of survivors who believed that the apocalypse happened to set humans back on a more animalistic path. They believed in blending in with the walkers by wearing walker skins and used their disguise to travel as well as build up massive herds of walkers. The Whisperers were against civilization and operated like a wolf pack with Alpha as their leader, Beta in second command, and everyone else as followers.\nBecause of their beliefs, there’s little to no chance that the Whisperers are the helicopter community. They live a nomadic lifestyle because of their primitive ideals and a helicopter is strongly tied with the \"old\" world. So, the group that Jadis works for is not the Whisperers. And, Jadis is not Alpha or Beta because those roles have been cast to other actresses per Comicbook.com.\nJadis has also been with Rick’s group since the war ended nearly two years ago. That means she would have to come across the Whisperers to integrate into their group this season. The Walking Dead's IMBD page suggests that Alpha and Beta will appear in Episode 6, so there is always a chance that she could be ex-communicated from Rick's group soon and run into them, but that seems like a stretch.\nGene Page/AMC\nIt logically doesn’t make sense for her to adopt the Whisperer way of life when she admitted to Gabriel that she wants to fulfill a mission to live in an established society. And, she said this location was far away, which doesn't line up with the local upcoming antagonists.\nIf anything, this unknown society is either a completely new creation in the TV show or possibly the Commonwealth, a massive and thriving Ohio group from the comics with a strict class system. This would explain why they have a helicopter, the abundance of supplies, and the reason they view people as an A (high class) or B (low class). A and B could be a reference to Alpha and Beta, but the Commonwealth makes more sense honestly.\nThe helicopter person said Jadis owes him an \"A\" and she thought Gabriel was a \"B\" before he threatened to snitch about her activities to Rick. It looks like Gabriel will be the key to discovering the truth about this mysterious group.\nHonestly, all of this could have been avoided if Rick had left Jadis crying in the trash heap where she belonged. She's been harboring secrets and being shifty since day 1 and there's only a matter of time before she gets other people kidnapped or worse. The only way she could redeem herself is to let the Grimes family fly away from all this mess in that fancy helicopter. Find out the truth about Jadis and her possible Whisperer connections on Sundays at 9 p.m. ET.","url":"https://www.bustle.com/p/is-jadis-a-whisperer-on-the-walking-dead-this-shady-character-is-harboring-intriguing-secret-12972483"}
