{"authors":[],"date_download":"2018-10-30 01:06:09","date_modify":"2018-10-30 01:06:09","date_publish":"2017-04-19 00:00:00","description":null,"filename":"data/vaneerConsumption/IsJaredKushnerreallythemanforthejob.json","image_url":"https://www.americanthinker.com/images/bucket/2017-04/198312.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_04_is_jared_kushner_really_the_man_for_the_job_1540861569.html","title":"Is Jared Kushner really the man for the job?","title_page":"Is Jared Kushner really the man for the job?","title_rss":"NULL","source_domain":"americanthinker.com","text":"Conservatives would be outraged. They would say Obama and Clinton are doing an end run around government, using nepotism to appoint unqualified envoys to do the jobs of government officials.\nWhat if former President Obama had sent Michelle to negotiate for him at a NATO summit? What if Bill Clinton had sent one of his half-brothers to make peace in the Middle East?\nBut when President Trump sent Jared Kushner to meet the leader of Iraq, not a sound can be heard. Not a conservative is stirring, not even a mouse. The photo-op of Jared Kushner going to Iraq and meeting with their prime minister is embarrassing. Foreign policy should be conducted by members of the State and Defense Departments who are confirmed by the Senate. By circumventing them, Trump is circumventing the constitutional requirement for Senate confirmation.\nPresident Trump can have whomever he likes to advise him – Jared Kushner, Ivanka, Tiffany, even Barron. But the Constitution says those who have executive authority, those who take action on behalf of the government outside giving advice to the president, are required to be confirmed by the Senate. President Trump is setting a terrible example for future presidents, who will know they can ignore Senate confirmation by having their personal representatives circumvent government and set policy. Trumpistas may be excited when Trump does it, but what about when the next Democrat president does?\nIn the meantime, who is Jared Kushner? By many accounts, he is a liberal Democrat – or, as Mark Levin puts it, \"some 32-year-old, liberal Democrat kid out of New York\" with \"an old-time liberal Democrat protectionist\" policy.\nHis limited life experience has been in real estate. What it is about real estate that gives him the experience to negotiate with the leader of Iraq? Absolutely nothing. In the meantime, here are the things we know about that Kushner has been put in charge of:\nThat trust has resulted in a vast portfolio that so far includes negotiating an Israeli-Palestinian peace deal, helping oversee relations with Canada, China and Mexico and, as of this week, reinventing the federal government through the new White House Office of American Innovation. \"He's saving the government and the Middle East at the same time,\" one senior administration official quipped. He involves himself in high-level discussions on all manner of policy priorities, ranging from health care and tax reform to trade policy. In foreign policy, he's been publicly tasked with solving Middle East peace, while also handling Canada, China and Mexico issues. In a move that's alarming the West Wing's hardline conservatives, Kushner is increasingly aligning himself with national economic adviser Gary Cohn, who's participating in Kushner's innovation office and a Democrat whose moderate political positions in some ways mirror Kushner's own. Kushner played a key role in arranging for health expert Zeke Emanuel, an architect of Obamacare, to meet at the White House three times with senior staff and at least once with the president himself to discuss healthcare[.]\nSubverting the constitutional requirement for confirmation.\nTotally inexperienced.\nHopelessly liberal.\nAll part, I'm sure, of President Trump's secret plan to save America. One thing is for sure: maybe we can't understand the plan now, but the end result will be big and beautiful.\nEd Straker is the senior writer at NewsMachete.com.","url":"https://www.americanthinker.com/blog/2017/04/is_jared_kushner_really_the_man_for_the_job.html"}
