{"authors":["Paige Tutt"],"date_download":"2018-10-30 22:24:25","date_modify":"2018-10-30 22:24:25","date_publish":"2014-08-15 19:47:35","description":"It has come to the attention of anyone with eyes that Chris Lilley is walking an incredibly thin and delicate line when it comes to his new HBO series Jonah From Tonga . On the show, Chris Lilley, a 39-year-old white Australian plays 14-year-old…","filename":"data/vaneerConsumption/IsJonahFromTongaRacistIfNotWhereDoWeDrawTheLineonRacialComedy.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/1f1d4d57-270b-407b-af9e-159e3870f856.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35887-is-jonah-from-tonga-racist-if-not-where-do-we-draw-the-line-on-racial-comedy_1540938265.html","title":"Is 'Jonah From Tonga' Racist? If Not Where Do We Draw The Line on Racial Comedy?","title_page":"Is 'Jonah From Tonga' Racist? If Not Where Do We Draw The Line on Racial Comedy?","title_rss":"NULL","source_domain":"bustle.com","text":"It has come to the attention of anyone with eyes that Chris Lilley is walking an incredibly thin and delicate line when it comes to his new HBO series Jonah From Tonga . On the show, Chris Lilley, a 39-year-old white Australian plays 14-year-old Tongan teenager Jonah Takalua. Now, right off the bat, some eyebrows should be raised and some alarm bells go off rather naturally.\nWe all remember how Julianne Hough came under fire for donning blackface and portraying Orange Is The New Black's Crazy Eyes for Halloween. The line there was drawn fairly clearly: white people putting on blackface is wrong, period — and trust there are a lot of people calling for HBO to cancel Jonah due to that controversial element. Bustle reached out to HBO for comment on the controversy, and the network sent the following statement:\nChris Lilley is an award-winning writer and performer whose work has delighted millions of people all over the world. He was first introduced to HBO viewers six years ago with his acclaimed series Summer Heights High. “Jonah from Tonga” is a spin off of that series (which is currently the best-selling TV show on DVD in Australian history). Chris is known for creating and performing a wide range of characters both male and female from the privileged young high-school girl Ja’mie, to rapper S. Mouse!, to Japanese mom Jen Okazaki and the elderly guard at a juvenile detention center, Gran, among others. His second series, Angry Boys, ran on the network two and a half years ago. He joins a long list of comic artists who have brought their original voices to the network.\nAnd that's true, Lilley has delved into characters of all races, classes, and genders. Still, when we look at Lilley's series within the context of other similar forms of racial comedy, the lines begin to blur regarding what type of humor is and isn't acceptable when speaking about race.\nThe New Zealand Herald's Paul Casserly brings a few good points into play, \"The most compelling rule regarding racism and comedy is that it's less acceptable when it comes from a member of a powerful majority and it makes fun of a less powerful minority.\" Think about the movie White Chicks starring Shawn and Marlon Wayans: Two black guys playing the stereotypical white valley girls while undercover as cops.\nI remember watching this movie when I was younger and laughing hysterically. Black people have been systematically downtrodden, demonized, and ridiculed for what seems like decades. Just take a look at the recent Mike Brown news. That's why it's funny when two black guys are flipping the switch. It's the little guy getting in a jab at the bigger guy. But does that make it okay?\nWhat if we look at it from another angle?\nRobert Downey Jr.'s forray into racial humor in Tropic Thunder wasn't really met with much protest, but that's more so because of the way it was presented. Esquire's Stephen Garrett dissected the issue:\nHow does Downey pull it off? Singular talent. The Oscar-nominated actor has spent his career perfecting humor and pathos in equal measure. Which means that when, in Tropic Thunder, he plays a dead-serious Australian Method actor who insists on taking a role originally written for a black man, what ends up parodied is the self-seriousness of Method acting and the Vietnam-movie trope of the chitlins-chewing Negro grunt. Blackface isn’t the subject; it’s the vessel.\nOK, so that makes sense. It becomes more of a social commentary, a satire if you will, because of the fact that it isn't necessarily RDJ himself in blackface playing a black character as a white man; it's his white Australian character who has chosen to play a black role in some misguided attempt at method acting. But is that the end of it?\nAt the time, Ben Stiller responded to RDJ's blackface role by saying, \"He recently screened a rough cut of the film and it scored high with African-Americans.\" But, that's dangerous territory to tread. Stiller's logic essentially says that if people of a particular racial group think something isn't racist, then it isn't. So let's apply this flawed \"logic\" to Jonah From Tonga, the reason all of this started in the first place.\nSince its premiere on August 8, there have been numerous outcries from a variety of groups for HBO to cancel the series. If you even Google the show's name, the first result is an article about its critical reception. So under Stiller's logic, the show is problematic.\nWe also cannot forget Lilley's other characters of different racial descent. You've got Jenny Okazaki, the stereotypical Asian mother:\nSerse1000 on YouTube\nThen you've got S.mouse from the same show, Angry Boys, a black recording artist:\nsab do on YouTube\nSome people are trying to make distinctions between racial minstrelsy, which is the act of putting on something like Lilley's brownface to ridicule and make fun of another race, and racial drag, which is (per this Daily Review user's take) something different:\nWhile it's not always ideal to mine comment sections for wisdom and information, this commenter makes an interesting point. He or she is arguing that \"racial drag\" is more of a type of observational humor. Lilley has pulled from his societal interactions — things he has seen or heard whether that's on TV or in the real world — and combined those facets into what you have seen above, the numerous characters of different racial descents.\nI admit that I have laughed at Lilley's character work. There was a time that because he wasn't making fun of anyone necessarily, I didn't really think that far into the issue. I laughed because the characters were funny, they were spot on, they were socially accepted because they were on TV. Well, weren't they? People like me who have those viewpoints, those situational acceptances of things like racial comedy are part of the problem. We cannot decide that certain types of racial humor are funny and that others aren't. It's a hypocritical double standard that has existed regarding these issues for quite some time.\nTo link back to what Casserly has said, if we are to be outraged against certain types of racial humor, we must protest them all:\nWe love it when we make fun of white South Africans don't we? Of course we do, they are seen as fair game, just like Germans - cue Nazi gag - and God help North Koreans or anyone pilloried by Sacha Baron Cohen. Some racist comedy we're good with, other stuff, we baulk at.\nIn the case of HBO's Jonah From Tonga, it's difficult to say what should be done. Is it racist? By definition, a white male putting on brownface and pretending to be someone of another race is racist, so yes. But audiences are split over how to handle the issue. Will the show be cancelled? It doesn't seem all that impossible. I personally doubt it will make it to a second season, on HBO at least, but will it fade into cultural obscurity and become another example of flawed comedic genius? That's difficult to say. What I do know, however, is I'll be keeping a close eye on the conversation and as of right now, those chattering are decidedly divided.\nImages: Ben Timothy/HBO; Giphy (2); Daily Review; NZ Herald","url":"https://www.bustle.com/articles/35887-is-jonah-from-tonga-racist-if-not-where-do-we-draw-the-line-on-racial-comedy"}
