{"authors":["Jordan Lauf"],"date_download":"2018-10-31 01:50:50","date_modify":"2018-10-31 01:50:50","date_publish":"2018-09-06 11:00:52","description":"What is the \"perfect murder\"? A crime committed without leaving even the smallest bit of trace evidence behind? A crime where the perpetrator escapes justice without a hint of suspicion? The Investigation Discovery show The Perfect Murder takes a…","filename":"data/vaneerConsumption/IsJudyValotStillInJailSheWasConvictedOfMurderButTheVictimsBodyWasNeverFound.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/5/e0687895-ace1-4158-a848-3b1f3256f85f-screen-shot-2018-09-05-at-41045-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-judy-valot-still-in-jail-she-was-convicted-of-murder-but-the-victims-body-was-never-found-11762434_1540950650.html","title":"Is Judy Valot Still In Jail? She Was Convicted Of Murder, But The Victim’s Body Was Never Found","title_page":"Is Judy Valot Still In Jail? She Was Convicted Of Murder, But The Victim’s Body Was Never Found","title_rss":"NULL","source_domain":"bustle.com","text":"What is the \"perfect murder\"? A crime committed without leaving even the smallest bit of trace evidence behind? A crime where the perpetrator escapes justice without a hint of suspicion? The Investigation Discovery show The Perfect Murder takes a closer look at these tricky cases, instances where someone almost got away with murder... until they didn't. This week's episode, airing on Investigation Discovery on Thursday, Sept. 6 at 9 p.m. ET, will cover the case of Judy Valot, who was convicted of murdering her boyfriend, according to The Los Angeles Times. So what makes Valot's crime fall into this category, and is Judy Valot still in prison?\nConviction's like Valot's are uncommon for one reason in particular: the body of her boyfriend, who she was found guilty of killing, was never found, according to another Los Angeles Times report. The report states that Valot first came under suspicion in 1998 when her boyfriend, then 51-year-old Peter Theriault, went missing. His family assured law enforcement that Theriault was by no means someone who would just vanish without a trace, and Valot's conflicting statements to the police gave them reason to suspect she might be behind his sudden disappearance, according to the same LA Times article.\nGerardo Mora/Getty Images News/Getty Images\nLaw enforcement became convinced that Valot was the one responsible for Theriault's possible murder after discovering blood in his Irving, California garage, and finding two of his guns loaded and in Valot's possession in her Blythe mobile home, per The Los Angeles Times. This, combined with the fact that Valot failed to report his disappearance for five days, led investigators to arrest Valot for Theriault's suspected murder a week after his disappearance, per the same report.\nA different Los Angeles Times report stated that prosecutors believed that Valot shot her boyfriend after a heated argument about an alleged affair she believed he was having with a 19-year-old co-worker. The report also states that prosecutors believed that Valot disposed of Theriault's body somewhere in the desert near Blyth, where Valot's mobile home was located and where she was spotted the day after Theriault vanished.\nJoe Raedle/Getty Images News/Getty Images\nThroughout a 2000 conviction of second degree murder (overturned due to a juror error), a second trial in August of 2004 that ended in a hung jury, and a second degree murder conviction at the end of her third trial in 2005, Valot has maintained her innocence, per The Los Angeles Times. \"Look somewhere else. Look for Pete.... Hate me all your life, but you guys shouldn't give up on [finding] Pete,\" the report noted that Valot said to Theriault's family at her sentencing hearing. \"I won't.\" Valot was sentenced to 15 years to life in prison in 2005, according to the same report.\nValot is currently serving her term in Central California Women's Facility in Chowchilla, according to a more recent LA Times piece. In 2013, Valot's appeal for parole was rejected by the board, which stated that her insistence on maintaining her innocence despite two convictions demonstrated she was not ready for early release, per the same report. Valot will not be eligible to come before the parole board again until 2020.\nMark Wilson/Getty Images News/Getty Images\nIn 2005, Valot's murder conviction was only one of four in 30 years in Orange County in a case in which no body was uncovered, according to The Los Angeles Times. Since then, a few more no-body cases have come before Orange County courts, including the suspected murders of Tom and Jackie Hawks in 2004, Mario Hernandez in 2005, and Robert Lee Vendrick in 2009, according to The Orange County Register. Though each of these murder cases were lacking a body, each resulted in a conviction for the suspected killers, according to the same report.\n“It is common sense that just because you are successful at disposing of a body, it doesn’t mean you can get away with murder,” Orange County Deputy District Attorney Ebrahim Baytieh told The Orange Country Register during his time prosecuting a man named Gary Shawkey for the alleged murder of Robert Lee Vendrick in 2009. The same holds true of Judy Valot, for though her boyfriend's body has never been found, she remains in prison for his murder.\nBut without Theriault's body, or a confession from Judy Valot, small doubt still remains regarding what actually happened to cause Peter Theriault's disappearance. The Perfect Murder will take a closer look at the case, and viewers will have to determine for themselves whether the lack of a body is enough to exonerate Valot, or whether her pleas have innocence have rightly fallen on deaf ears.","url":"https://www.bustle.com/p/is-judy-valot-still-in-jail-she-was-convicted-of-murder-but-the-victims-body-was-never-found-11762434"}
