{"authors":["Martha Sorren"],"date_download":"2018-10-31 01:52:38","date_modify":"2018-10-31 01:52:38","date_publish":"2018-09-06 11:00:52","description":"The Season 1 finale of Investigation Discovery's Someone You Thought You Knew airs Thursday, Sept. 6 at 10 p.m. and follows a seriously complicated case. Titled \"Pick Your Poison,\" it features the trial of Kaitlyn Conley who was convicted of…","filename":"data/vaneerConsumption/IsKaitlynConleyStillInPrisonIn2018InvestigationDiscoveryWillProfileThisTwistyCase.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/5/d00be876-a1ac-4a4f-8236-dfb97a1e9110-screen-shot-2018-09-05-at-125745-pm.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-kaitlyn-conley-still-in-prison-in-2018-investigation-discovery-will-profile-this-twisty-case-11490894_1540950758.html","title":"Is Kaitlyn Conley Still In Prison In 2018? Investigation Discovery Will Profile This Twisty Case","title_page":"Is Kaitlyn Conley Still In Prison In 2018? Investigation Discovery Will Profile This Twisty Case","title_rss":"NULL","source_domain":"bustle.com","text":"The Season 1 finale of Investigation Discovery's Someone You Thought You Knew airs Thursday, Sept. 6 at 10 p.m. and follows a seriously complicated case. Titled \"Pick Your Poison,\" it features the trial of Kaitlyn Conley who was convicted of first-degree manslaughter after her boss Mary Yoder died of poisoning, according to the Utica Observer-Dispatch. But she has maintained her innocence and plans to appeal, so is Kaitlyn Conley still in prison in 2018?\nConley's case is a tricky one, and several jurors have been unable to agree on verdicts. In fact, Conley's first trial ended with a hung jury in May 2017, according to the Observer-Dispatch. She was re-tried in November, but that jury also wasn't initially able to form a joint decision. Eventually they did, finding Conley guilty of first-degree manslaughter. However, the charge of second-degree murder was returned as not guilty.\nAnother Observer-Dispatch article clarified that the difference came down to whether the jury believed Conley planned to kill Yoder with the gout drug colchicine. The manslaughter verdict indicates that they instead believed the poisoning was intended only to injure Yoder, and that her death was accidental.\nConley knew Yoder because she worked as a receptionist in her chiropractor firm, but she also previously dated Yoder's son, Adam. A third Observer-Dispatch article reported that the prosecution argued Conley's motive was allegedly to frame Adam for his mother's poisoning to get back at him during the course of their on-again off-again romance.\nThe circumstantial nature of the evidence as well as the two juries' struggle to decide on a verdict suggests that Conley's planned appeal has a chance to reverse her conviction. All of the case's twists and turns will be documented in the Investigation Discovery episode, whose synopsis reads:\n\"Bill and Mary Yoder are a happy couple, running a medical practice outside of Utica, New York. But their world collapses when Mary becomes mysteriously sick, and detectives prove that her illness was no accident.\"\nConley's family stood by her side during her trial, and likely will continue to do so as she works towards an appeal. Per the Observer-Dispatch, her mother, Kathy Conley, claimed, \"She’s strong and we know she’s innocent. A mother knows.\" And according to Syracuse.com, her sisters have started a \"Free Kaitlyn Conley\" Facebook page.\nBut as of now, her sentencing of 23 years in prison stands, per WKTV. It's two years shy of the 25 year maximum, per the Observer-Dispatch. Conley is now half a year into her two-decade sentence, and resides at New York's Bedford Hills Correctional Facility, according to New York Department of Corrections inmate records. The same records state that she's up for parole in July of 2037, but her sentence maxes out in November of 2040 if she's not able to make parole. After her release, she'll have five years of supervision, according to WKTV.\nConley is currently 25 years old. If she's let out on parole, she'll be 44. If she's required to serve out her 23-year sentence in full, she'll be 46. At that time, she'll have spent nearly half her life in prison.","url":"https://www.bustle.com/p/is-kaitlyn-conley-still-in-prison-in-2018-investigation-discovery-will-profile-this-twisty-case-11490894"}
