{"authors":["Aaron Klein","Ali Waked"],"date_download":"2018-10-30 21:02:02","date_modify":"2018-10-30 21:02:02","date_publish":"2016-04-25 14:38:09","description":"An Islamic scholar tied to Hamas has completely denied Jewish ties to the Temple Mount, considered the holiest site in Judaism.","filename":"data/vaneerConsumption/IslamScholarClaimsJewsFabricatedTiestoTempleMount.json","image_url":"https://media.breitbart.com/media/2016/04/tmj.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_04_25__1540933322.html","title":"Islam Scholar Claims Jews ‘Fabricated’ Ties to Temple Mount","title_page":"Islam Scholar Claims Jews ‘Fabricated’ Ties to Temple Mount","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Ignoring the historical record and mainstream archeological evidence, an Islamic scholar tied to Hamas and speaking during a Breitbart Jerusalem exclusive interview, completely denied Jewish ties to the Temple Mount, considered the holiest site in Judaism.\n“The issue of Solomon’s Temple, or what the Jews call the Temple Mount, is nothing but a bundle of historically unfounded claims,” declared Khaled Elkhaldi, a professor at Gaza’s Islamic University.\n“It’s a dream, a legend that the Jews made up to claim exclusive ownership of the land, which religion and history refute time after time,” added Elkhaldi, who serves on Hamas’s Shura Council (Majlis al-Shura), the terrorist group’s main consultative body.\n“The historical and religious truth is that the Jews conquered Palestine as part of their religious perspective and so-called prophecy in the Torah around which the theory of the ‘Promised Land’ was built,” Elkhaldi claimed.\n“The fabricated temple was invented to serve this narrative,” he stated, without a trace of irony.\nElkhaldi claimed, wrongly, that mainstream Jewish opinion is divided on the historic whereabouts of the Temple.\n“Some say that it is in Nablus and not in Jerusalem, some say it’s in Beitin just north of Jerusalem, and others talk about other places. It only proves that all these claims are bogus.”\n“What’s more, until now, not a single piece of archaeological evidence of its existence has been found,” he claimed.\nNot only is Elkhaldi’s claim about lack of archaeological evidence false, the Islamic scholar glossed over the Palestinians’ own complacency in disposing of Jewish temple artifacts.\nAs Aaron Klein previously reported:\nIn 1997, the Waqf conducted a large dig on the Temple Mount during construction of a massive mosque at an area referred to as Solomon’s Stables. The Wafq at the time disposed of truckloads of dirt containing Jewish artifacts from the First and Second Temple periods.\nAfter the media reported the disposals, Israeli authorities froze the construction permit given to the Waqf and the dirt was transferred to Israeli archaeologists for analysis. The Israeli authorities found scores of Jewish Temple relics in the nearly disposed dirt, including coins with Hebrew writing referencing the Temple, part of a Hasmonean lamp, several other Second Temple lamps, Temple-period pottery with Jewish markings, a marble pillar shaft, and other Temple-period artifacts.\nThe Waqf was widely accused of attempting to hide evidence of the existence of the Jewish Temples.\nAnd in 2007, Klein personally reported from the site of an unusual dig on the Temple Mount in which the Waqf utilized heavy machinery to dig on one of the most sensitive archaeological compounds in the world and were once again caught red-handed destroying Temple-era antiquities.\nPalestinian leaders routinely deny Jewish ties to the Temple Mount\nIn 2007, Klein conducted an exclusive video interview with Waqf official and chief Palestinian cleric Taysir Tamimi, who used the occasion to claim the Jewish Temples “never existed”:\n“About these so-called two Temples, they never existed, certainly not at the Haram Al- Sharif (Temple Mount),” said Tamimi, who is considered the second most important Palestinian cleric after Muhammad Hussein, the grand mufti of Jerusalem.\n“Israel started since 1967 making archaeological digs to show Jewish signs to prove the relationship between Judaism and the city, and they found nothing. There is no Jewish connection to Israel before the Jews invaded in the 1880s,” said Tamimi.\nThe Palestinian cleric denied the validity of dozens of digs verified by experts worldwide revealing Jewish artifacts from the First and Second Temples, tunnels that snake under the Temple Mount, and more than 100 ritual immersion pools believed to have been used by Jewish priests to cleanse themselves before services. The cleansing process is detailed in the Torah.\nAsked about the Western Wall, Tamimi said the structure was a tying post for Muhammad’s horse and that it is part of the Al-Aqsa Mosque, even though the wall predates the mosque by more than 1,000 years:\n“The Western Wall is the western wall of the Al-Aqsa Mosque. It’s where Prophet Muhammad tied his animal, which took him from Mecca to Jerusalem to receive the revelations of Allah.”\nElkhaldi, meanwhile, spoke after UNESCO earlier this month adapted a resolution deploying language that ignored Jewish ties to the Temple Mount and Western Wall.","url":"https://www.breitbart.com/middle-east/2016/04/25/exclusive-islam-scholar-claims-jews-fabricated-ties-temple-mount/"}
