{"authors":[],"date_download":"2018-10-30 00:55:56","date_modify":"2018-10-30 00:55:56","date_publish":"2017-04-11 00:00:00","description":null,"filename":"data/vaneerConsumption/IslamistsAgainTargetCopticChristians.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2017_04_islamists_again_target_coptic_christians_1540860956.html","title":"Islamists Again Target Coptic Christians","title_page":"Islamists Again Target Coptic Christians","title_rss":"NULL","source_domain":"americanthinker.com","text":"Egypt’s Coptic Christians suffered another fatal attack on its churches during this morning’s (April 9) Palm Sunday celebrations. Many parishioners were killed and maimed in a dual-church attack during the Palm Sunday services.\nBy their fruits ye shall know them is a classic truth from the Bible which speaks volumes about the Islamist slugs who murdered more than 55 Coptic Christian worshippers as they clutched their bibles during Palm Sunday services in a church just outside of Cairo and another in Alexandria. There was no inflammatory video for the politically correct left to blame it on. As Dr. Ashraf Ramelah reported on his blog, Voice of the Copts :\nNorth of Cairo, a terrorist bomb struck the Church of Saint George in Tanta claiming the lives of more than 40 worshippers and injuring at least 65 attendees. Simultaneously, the Morkussia Church of Alexandria was bombed leaving at least 15 persons dead and many more injured. After leading the celebration mass, Coptic Pope Tawadros II left the Morkussia Church minutes before the planted bomb exploded. Aside from the casualties from the Coptic population, four police officers were killed.\nObama’s apology tour, which began, ironically enough, in Cairo, set the stage for a feckless foreign policy that allowed evil to triumph when an American president does nothing. Cairo 2017 is the legacy of his indifference to Islamist evil. It was his withdrawal from Iraq and his ignoring intelligence reports on ISIS that gave it time and room to grow. If the politically correct liberal left needs any more clarity on what radical Islamic terrorism is all about,\nwe saw once again in Egypt with the latest slaughter of Coptic Christians, Obviously, Islamist evil is not contained.\nWe saw Islamist cruelty in an underreported story by Islamic State butchers in a Catholic Church in Normandy, France when they beheaded 86-year-old French priest Jacques Hamel as they chanted -- wait for it “Allahu Akbhar” (God is great) As the Daily Mail reported:\nTwo ISIS knifemen who stormed a church in Normandy forced an elderly priest to kneel before filming themselves butchering him and performing a 'sermon in Arabic' at the altar, a terrified witness has revealed. The attackers, claimed as 'soldiers' by ISIS, were both known to French police before they cut the throat of 84-year-old priest Jacques Hamel at the church in Saint-Etienne-du-Rouvray near Rouen. Both were shot dead by police marksmen as they emerged from the building shouting 'Allahu Akbar' following the attack that also left a nun critically injured. French President Francois Hollande, who visited the scene today, said the country is now 'at war' with ISIS after the terror group claimed responsibility for the attack.\nIt is a war between civilizations and cultures. It is also a war between religions, although we like to tiptoe around the politically-correct “religion of peace” argument.\nThe war on Christians by Islamist fanatics worldwide by ISIS and its associated groups has been documented by Robert Spencer at Jihad Watch:\nWe have seen this before on several occasions in Kenya. In September 2013 at Nairobi’s Westgate Mall, Muslims murdered people who couldn’t answer questions about Islam. In June 2014, Muslims murdered people who could not pass an Islam quiz. In November 2014, Muslims murdered 28 non-Muslims who couldn’t recite Qur’an verses. In April 2015, Muslims screaming “Allahu akbar” stormed Garissa University College, and only shot those who couldn’t recite Qur’an. Now we see it in Mali. And this is coming to the U.S.\nAs for religious tests, as President Obama has condemned for admitting Moslem refugees, one is imposed by radical Islamic terrorists constantly, such as the one imposed on the residents of a luxury hotel in Mali. As BizPac Review reported:\nIslamic terrorists shouting “Allahu Akbar” have stormed a hotel in Mali, Africa, freeing only those who can recite the Quran. The gunmen, who took over the Radisson Blu Hotel in Mali’s capital of Bamako early Friday morning, have killed at least three people and taken 170 hostages, the Associated Press reported.\nThere’s a religious test for you, Mr. President, one you don’t care to point out or condemn. Some 30 people failed the religious test imposed by radical Islamic terrorists. You tell us such attacks have nothing to do with Islam, yet the radical Islamic terrorists always shout “Allahu Akhbar” before they kill those who are determined not to be Muslim.\nObama administration indifference to the war on non-Muslims by radical Islamic terrorists, who just might want to slip into the U.S. amidst a flood of refugees as they have already in Europe, has been well documented. As Investor’s Business Daily has pointed out:\n…we could find no such sentiment or statement by Obama condemning as a religiously motivated hate crime in the September 2014 beheading of an Oklahoma Christian woman by a former co-worker for not heeding his demand to convert to Islam or die. Dare we say it depends on whose ox is being gored? Obama -- who apologized to the United Nations after the Benghazi terrorist attack, saying a video offensive to Muslims prompted it -- also said, \"The future must not belong to those who slander the prophet of Islam.\" That declaration would seem to include the staff of the French satirical magazine Charlie Hebdo, who were accused of doing just that before a terrorist attack killed eight journalists. The massacre at Fort Hood was \"workplace violence,\" not a jihad terrorist attack by Maj. Nidal Hasan against Western \"crusaders.\" The lives of the four Jews killed in a kosher market in Paris were dismissed by Obama as \"a bunch of folks in a deli\" shot \"randomly\" as they happened to be in the wrong place at the wrong time. Detect a pattern here?.... Nor was the mass beheading of 21 Egyptian Coptic Christians by Islamic State terrorists in Libya, a failed state brought about by administration bungling and failure to acknowledge who our enemies are and why they're trying to kill us.\nHillary Clinton’s State Department refused to designate Nigeria’s terrorist group Boko Haram as an Islamic terrorist group for two years.\nFor two years on Hillary Clinton's watch, the State Department refused to designate a Nigerian Islamist group as a terrorist organization. This group has murdered thousands as it wages a real war on women… When the Global Terrorism Database of the University of Maryland's National Consortium for the Study of Terrorism and Responses to Terrorism compiled its list of terrorist organizations and ranked them by the number of their terror acts in 2012, Afghanistan's Taliban came in first. Boko Haram was not far behind. The world's attention is now focused on the kidnapping of some 300 girls from the Chibok Government Girls Secondary School in Lagos, Nigeria. \"I abducted your girls,\" a man claiming to be Abubakar Shekau, the group's leader, said in a video seen by the Guardian newspaper. \"I will sell them in the market, by Allah. I will sell them off and marry them off. There is a market for selling humans.\"… Yet for two years, the State Department refused to acknowledge the growing threat and barbarism of Boko Haram. As Josh Rogin at The Daily Beast reports, the Clinton State Department \"refused to place Boko Haram on the list of foreign terrorist organizations in 2011\" after the group bombed the United Nations headquarters in Abuja, Nigeria.\nWe saw the worldwide war on Christians in the capture of Mosul in Iraq by ISIS and the decimation of its Christian population:\nChaldean Catholic patriarch Louis Sako, who heads Iraq's largest Christian community, told Agence France-Presse: \"Christian families are on their way to Dohuk and Arbil (in Kurdistan). For the first time in the history of Iraq, Mosul is now empty of Christians.\"… From Nigeria to Egypt to Afghanistan and back, this story of Christian persecution continues without much notice from the White House. To his credit, British Prime Minister David Cameron, up against a political correctness and a rising Muslim population, said during his annual Easter reception at 10 Downing Street, that \"our religion is now the most persecuted religion around the world\" and \"we should stand up against persecution of Christians and other religious groups wherever and whenever we can, and should be unashamed in doing so.\"\nPerhaps the murder of the Coptic Christians on Palm Sunday at the hands of radical Islamic terrorists will finally cause the liberal left to stand up and condemn this worldwide war on Christians. Then again, don’t expect a miracle.\nDaniel John Sobieski is a freelance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/articles/2017/04/islamists_again_target_coptic_christians.html"}
