{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:40:57","date_modify":"2018-10-30 18:40:57","date_publish":"2016-02-02 20:17:08","description":"Some non-Muslim women in the United States and other countries voluntarily donned the “hijab” on Monday to show “solidarity” with Muslim women. |","filename":"data/vaneerConsumption/IslamicGroupsPushWorldHijabDaytoUndermineWesternOpposition.json","image_url":"https://media.breitbart.com/media/2016/02/GettyImages-506381730.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_02__1540924857.html","title":"Islamic Groups Push ‘World Hijab Day’ to Undermine Western Opposition","title_page":"Islamic Groups Push ‘World Hijab Day’ to Undermine Western Opposition | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Some non-Muslim women in the United States and other countries voluntarily donned the “hijab” on Monday to show “solidarity” with Muslim women.\nWorld Hijab Day is part of a major effort supported by radical Muslim Student Association (MSA) to foster empathy toward Muslims and Islam in America.\n“People see a veil, the hijab, but people don’t understand why we wear it,” said Doha Medani, a sophomore at North Carolina State University (NCSU), reports The Technician, the school’s newspaper. “My hijab is how I represent myself to the world: as a Muslim, first and foremost,” Medani said.\n“The first thing people see … is my hijab. It makes it clear to the world, or whoever else, that I’m Muslim… it tells people a lot about who you are,” she added.\nThe campaign, however, is spurring protests from Americans. For example, two Muslim women penned a December op-ed at the Washington Post in which they say the hijab campaign is intended to hide Islam’s sexist political agenda, and urged Americans to stand against Islam’s ideological oppression of women.\n“Journalists and media outlets must stop making the mistake of defining hijab as ‘headscarf,’ furthering a sexist propaganda campaign to equate the two,” wrote Asra Q. Nomani and Hala Arafa.\nIn the name of ‘interfaith,’ well-intentioned Americans are getting duped by the agenda of Muslims who argue that a woman’s honor lies in her ‘chastity,’ pushing a platform to put a headscarf on every woman,” the Muslim women added. “Please do this instead: Do not wear a headscarf in ‘solidarity’ with the ideology that most silences us, equating our bodies with ‘honor.’ Stand with us instead with moral courage against the ideology of Islamism that demands we cover our hair.\nHijabs are tight or loose headcloths that leave the face uncovered. They’re a less restrictive version of the face-hiding burkas imposed on Afghans women, or the eye-revealing niqabs forced on Saudi women, including Saudi journalists.\nAdvocates of the Hijab campaign downplay their Islamic political goals, and instead portray their campaign as a women’s solidarity event.\n“It’s like a ‘Walk a day in their shoes’ type of thing, for women to wear the hijab and see what happens, how things around them change when they are viewed as a Muslim woman — to step into that and get that perspective,” said NCSU senior Hoda Abrahim. “So you can empathize in a way, or just better understand it.”\nAt NCSU, the school’s MSA and Women’s Center jointly allowed non-Muslim women the opportunity to wear the hijab and share their stories about their experience.\nWorld Hijab Day was billed as “an open invitation to Muslims and non-Muslims to experience the hijab for a day.” Ads for the event were clearly aimed at attacking negativity toward Muslims and proposals to limit their immigration due to concerns about terrorism from Islamic jihadists.\n“Before you judge, cover up for a day,” read one ad. “Covered by choice, not force,” another read, trying to counter the widespread view that Islam oppresses women. Yet another featured a woman in a hijab with the message, saying “Beautiful, confident, empowered.”\nThe Penn State Berks MSA hosted “World Hijab Day” and advertised a “free scarf for female attendees, a tutorial on how to wear the hijab, and a free lunch for all who attend.” Participants were asked to wear the hijab for the entire day and send their stories about their experiences to the school’s MSA president, reports Penn State News. A prize was awarded to the woman who submitted the most “engaging submission.”\nAt Texas A & M, biology junior Salam Yamak told The Battalion, “Anytime you sit down with someone and you have a conversation and you show them what your religion is all about should be casual like this,” she said about marking the day. “It creates a better environment and so we can better show the true nature of Islam.”\n“Whenever you have Islamophobia or any other group that is seen as different it’s because of people not having enough knowledge or having enough experiences with Muslim people,” Yamak added.\nSimilarly, chemical engineering senior Danielle Gore said Islamophobia must be fought through dialogue that shows how peaceful Islam is as a religion.\n“Especially for people who have only seen negative portrayals of Islam in the media and that’s what this holiday [sic] is for, to create a dialogue and to ask questions and to humanize a group of people who have been dehumanized,” he said. “Even if we do get some crazy people who yell things at us when we’re walking around campus we have definitely seen the goodness come out from our fellow Aggies by showing us support, despite the rhetoric that’s been created.”\nIn their anti-hijab-day op-ed, Nomani and Arafa argued that the event hides a political goal.\n“Muslim special-interest groups are feeding articles about ‘Muslim women in hijab‘ under siege,” the authors say. “Staff members at the Council on American-Islamic Relations [CAIR], which has pressed legal and PR complaints against U.S. companies including Disney World and Abercrombie & Fitch, have even called their organization ‘the hijab legal defense fund.’”\nA federal judge concluded in 2009 that “the government has produced ample evidence to establish the associations of CAIR … with Hamas” the jihad-group based in Gaza that shoots rockets in Israeli towns and communities. Since then, FBI leaders have sharply reduced any connection to the group, which has also been and has been declared a terrorist organization by the United Arab Emirates.\nAccording to the Investigative Project on Terrorism (IPT),\nIslamic extremism is on the rise on college and university campuses across the United States. The spread of radical Islamism on campuses has proven to be an effective tool to garner support and gain legitimacy, exploiting the right of free association with academic institutions. International and domestic groups that advocate extremist or radical causes frequently host lectures and other events on campuses to shore up support and recruit members. Indeed, universities are a fertile field for radicals searching for the next generation of activists and sympathizers.\n“The Muslim Students Association (MSA) of the United States and Canada was incorporated in January 1963, when members of the Muslim Brotherhood came together at the University of Illinois Urbana-Champaign with the goal of ‘spreading Islam as students in North America,’” states IPT.\nWorld Hijab Day was launched in 2013 by Nazma Khan, a New York resident who hoped to change the image of the hijab as a sign of oppression of women of Islam. The day has been especially marked on college and university campuses.\nAmong World Hijab Day’s “endorsers” is Felixia Yeap, an ex-Playboy bunny and ex-Playboy model, who writes in support:\nI support world hijab day because I have heard enough stories of why hijabi women are being bullied and mocked just because they wear a hijab. I have been and still am being sarcastically mocked and insulted just because I chose to be a full time “hijabster” despite the fact that I have not reverted yet. Thanks for coming up with this 1st Feb!\n“Revert” is the Islam term for “convert,” and illustrates the orthodox Islamic claim that everybody is born a Muslim, but many are led away from the Islamic lifestyle, or “deen,” by their parents and non-Islamic societies.","url":"https://www.breitbart.com/politics/2016/02/02/muslim-student-associations-celebrate-world-hijab-day-to-foster-empathy-toward-muslim-women/"}
