{"authors":["Sarah Kocianski"],"date_download":"2018-10-31 00:09:39","date_modify":"2018-10-31 00:09:39","date_publish":"2016-12-02 00:00:00","description":"Research addressing the growing market for fintech in Islamic Finance and Sharia-compliant investment products.","filename":"data/vaneerConsumption/IslamicFinanceShariaCompliantInvestmentFintechProductsServices.json","image_url":"https://amp.businessinsider.com/images/58384e0de02ba75c658b52f6-2732-1366.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_the-islamic-finance-report-2016-11_1540944579.html","title":"Islamic Finance & Sharia-Compliant Investment & Fintech Products & Services","title_page":"    Islamic Finance & Sharia-Compliant Investment & Fintech Products & Services - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nFor many Muslims, their religious practice means they can't use conventional finance products and must instead use Sharia-compliant alternatives. Demand for these products is increasing across the globe, but legacy providers have failed to keep up. At the same time, advances in technology have made it cheaper and easier to create Sharia-compliant products. That's creating a huge opportunity for fintech.\nA new report from BI Intelligence highlights some of the key concepts in Islamic finance, explains Sharia-compliant financial instruments in use, and explores how and why these options are struggling to meet demand. It explains the drivers behind increasing demand for newer products, as well as wider trends enabling the fintech opportunity. Finally, it presents case studies that illustrate the ways fintech is already being used to service the global Islamic finance industry, and outlines the hurdles fintechs face in making the most of the opportunity.\nHere are some of the key takeaways from the report:\nSharia-compliant financial products are approved by Islamic scholars and meet certain requirements like not offering interest or involving any risk. But the legacy Islamic finance industry hasn't kept up with increasing demand for these products from new demographics and for more modern versions.\nThat, along with broader technical changes, is creating a huge opportunity for fintech. Some fintech concepts such as P2P lending and robo-advice are well suited to the Islamic market, while the agility of others means they can quickly adapt their services to achieve Sharia compliance.\nThere are still significant hurdles for fintechs to overcome, particularly in the form of education, marketing, and achieving Sharia certification. Fintechs that partner with a legacy Islamic finance institution will find it easier to overcome these hurdles and achieve success.\nThe biggest opportunity for fintechs in the Islamic finance market for now is in developed countries where awareness of conventional fintech products is high. In particular, fintechs should look to states with active governmental support for the fintech industry.","url":"https://www.businessinsider.com/the-islamic-finance-report-2016-11"}
