{"authors":[],"date_download":"2018-10-30 01:07:57","date_modify":"2018-10-30 01:07:57","date_publish":"2016-02-16 00:00:00","description":null,"filename":"data/vaneerConsumption/Islamandsocialismcreepilysimilar.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_02_islam_and_socialism_creepily_similar_comments_1540861677.html","title":"Islam and socialism creepily similar","title_page":"Blog: Islam and socialism creepily similar","title_rss":"NULL","source_domain":"americanthinker.com","text":"Socialist Bernie Sanders wants to take American backwards to the pre-Colonial times of the Pilgrims circa 1620, where Socialism failed miserably. Likewise, Democrats want to take America to its 21st-century progressive equivalent, the big-government nanny state. In fact, the Democrats' former reverential, almost cult-like treatment of Barack Obama – a dubious figure obviously anti-American, ultra-constitutional, and pro-Islamic – is reflective of the same blind devotion the purveyors of sharia law, the imams, expect of their followers. Although the method is different, the result is identical: the iron-fisted suppression of the individual's rights and freedoms in favor of the all-powerful State. That's why Democrats who bray about gender and racial inequity in America are silent as mice regarding the actual abuses of women in the Middle East, specifically Saudi Arabia. Today, a woman can't walk into Starbucks; rather, she must send a... (Read Full Post)","url":"https://www.americanthinker.com/blog/2016/02/islam_and_socialism_creepily_similar_comments.html"}
send your driver to order thank you.\" This isn't Arthurian chivalry; it's sexual discrimination and overt repression. While out-of-touch Hillary would be untroubled by the Islamic restriction on driving (she hasn't driven since 1996), most Westerners would not agree to mandated male chaperons whenever in public, wearing the identity- and body-obscuring burka, being forbidden to interact with men not family relations, et cetera. Certainly, the strictures of \"modern\" Islam would give the upper-crust women of Downton Abbey pause. It gets worse. Islam goes so far as to dictate the procedure by which one cleans up after human excretion. The ancient practice of flowing water (via a hose) was updated just last year when Turkey issued a fatwa allowing Muslims to use toilet paper. Per the Daily Mail, \"[t]he code also states that followers should not speak or read while on the toilet and should enter with their left foot and leave with their right, speaking a prayer.\" What does walking, reading, or prayer have to do with doing one's \"business\"? This isn't about honoring \"tradition,\" spiritual mindfulness, or hygiene. It is about complete, crushing state control over human decision-making and behavior. For Islam, \"religion\" is simply the sham justification for totalitarianism. Paralleling Islamists with religion, Democrats/Socialists use government in the same way and for the same reason. Indeed, as like attracts like, is it any wonder the failed Obama administration desires cozy relationships with leftist dictators? Democrats' political mindset mirrors that of backward Islam – in both intention and endgame.","url":"https://www.americanthinker.com/blog/2016/02/islam_and_socialism_creepily_similar.html"}
