{"authors":[],"date_download":"2018-10-30 00:56:54","date_modify":"2018-10-30 00:56:54","date_publish":"2016-06-15 00:00:00","description":null,"filename":"data/vaneerConsumption/IslamistHomophobiatheUnspokenTruthaboutOrlando.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_06_islamist_homophobia_the_unspoken_truth_about_orlando_1540861014.html","title":"Islamist Homophobia: the Unspoken Truth about Orlando","title_page":"Islamist Homophobia: the Unspoken Truth about Orlando","title_rss":"NULL","source_domain":"americanthinker.com","text":"Seddique Mir Mateen, father of Orlando gunmen Omar Mateen, posted a video on Facebook which expresses shock and surprise at his son’s actions, while giving us a clear indication of his son’s motive. As CBS News reported :\nAs sympathetic as one might be with a father whose son massacred nearly 50 people in an Orlando night club, part of the motive for the son’s atrocity may lie with the father’s embrace of the anti-gay tenets of Islam and the anti-gay mindset of the Arab world. The unspoken truth is that while Christians in the West, often accused of homophobia, view homosexuality as a sin, many if not most do not condemn the sinner. In the Arab world, homosexuality is viewed as a sin punishable by death.\nThe Orlando gay club gunman's father has well-known anti-American views and is an ideological supporter of the Afghan Taliban. A new message posted by the father on Facebook early Monday morning also makes it clear he could have passed anti-homosexual views onto his son. Seddique Mir Mateen, father of Orlando gunman Omar Mateen, who died in a shootout with police after killing at least 49 people early Sunday morning, regularly attended Friday prayers at a Florida mosque with his son. In the video posted early Monday, Seddique Mateen says his son was well-educated and respectful to his parents, and that he was \"not aware what motivated him to go into a gay club and kill 50 people.\" The elder Mateen says he was saddened by his son's actions during the Muslim holy month of Ramadan. He then adds: \"God will punish those involved in homosexuality,\" saying it's, \"not an issue that humans should deal with.\"\nThe Afghan Taliban, which embraces Sharia law and imposed it when it ruled the country, does not wait for God to punish gays. In February, 1998, for example, when the Taliban was in control, ordered the cruel execution of three men convicted of sodomy. As Reuters reported;\nOn Wednesday, the Taleban ordered the execution of three men for sodomy in the southern town of Kandahar, southern Afghanistan. They were ordered to be buried alive under a pile of stones and a wall was pushed on top of them by a tank.\nNot even those sexist, racist homophobic Republicans go that far. We see this deadly bigotry throughout the Islamic world. In its 1991 Constitution, Iran adopted the extreme punishment of execution for sodomy. Articles 108-133 say:\nSodomy is a crime, for which both partners are punished. The punishment is death if the participants are adults, of sound mind and consenting; the method of execution is for the Shari'a judge to decide.\nIn a video posted by ISIS, to which Omar Mateen pledged allegiance in a 911 call during his massacre, the harsh treatment advocated for homosexuals under Sharia are graphically shown:\nA new ISIS propaganda video has delivered a clear, chilling, terrifying warning to what happens to gay people in countries under their control. Purportedly released by the terror group, also named Da’esh, the 10 minute video is entitled The Voice of Virtue in Deterring Hell. It shows a life of prayer and brotherhood between the extremists. Women are barely seen. Then there is a series of punishments being carried out. One man accused of being gay is thrown off a roof in front of a baying mob on the ground. Blindfolded, he is thrown head first onto a pile of rocks. Writhing on the floor, he is finished off by being stoned to death by the mob. Another man, also accused of being gay, is beheaded with a bloody sword. Another shot sees a body lying twisted on the ground. The decapitated head is on the body’s back. People watch and do nothing.\nIt is this group and its anti-homosexual terror that Omar Mateen swore allegiance to. In an interview with NBC News on Sunday, Seddique Mateen said his son became enraged when he saw two men kissing in front of his wife and son during a visit to Miami a couple of months ago:\nOne wonders if this Islamist intolerance and homophobic slaughter of gays will be noticed by the politically correct left who repeatedly say, as they did after the Charlie Hebdo massacre in Paris in which a Jewish deli was deliberately targeted, that this massacre or that massacre by someone shouting “Allahu Akbhar” has nothing to do with Islam. They see homophobia only when American citizens try to exercise their religious liberty and not cater a gay wedding.\nOn March 3, 2014, the blog Jihad Watch, which covers Islamist terror and fanaticism, reprinted a Washington Free Beacon story on how “Iran executed two gay men for the crime of perversion...” Frontpage Magazine in August 2014 reported that two Iranian men were executed for “consensual sodomy” and noted that “under the Islamist and Sharia law of Iran and Iran’s penal code, the punishment for homosexuals ranges from public lashings to outright executions.”\nRennick Remley, a self-proclaimed gay American, took out a full-page ad in the New York Times which spoke of this unpleasant truth: “Hamas, ISIS, and Iran kill gays like me. If I lived in Iran or under Hamas’ ideological cousin ISIS chances are you’d be seeing my picture. Not in this ad, but hanging from a crane in a public square. That’s a regular practice against gay men by the Iranian regime.”\nIn Iran gay wedding cake and pizza requests are handled a bit more harshly and with more finality than a simple statement from a business owner that his or her faith won’t allow them to cater the affair. If two gays contemplating marriage had walked into a Tehran pizza shop like Memories Pizza in Walkerton, Indiana, the pizza shop that refused to cater a gay wedding, hanging in the public square would have been a likely outcome.\nIf you want tolerance, don’t look for it in the Islamist world.\nDaniel John Sobieski is a free lance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/articles/2016/06/islamist_homophobia_the_unspoken_truth_about_orlando.html"}
