{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 18:11:08","date_modify":"2018-10-30 18:11:08","date_publish":"2016-06-27 12:20:11","description":"The Islamic State in Mosul released a video on Sunday, during the Gay Pride parade, suggesting a plan to attack San Francisco and Las Vegas.","filename":"data/vaneerConsumption/IslamicStateTargetsSanFranciscoandLasVegasinNewVideo.json","image_url":"https://media.breitbart.com/media/2015/01/San-Franciscos-Golden-Gate-Bridge-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_06_27__1540923068.html","title":"Islamic State Targets San Francisco and Las Vegas in New Video","title_page":"Islamic State Targets San Francisco and Las Vegas in New Video","title_rss":"NULL","source_domain":"breitbart.com","text":"The Islamic State in Mosul released a video on Sunday, coinciding with the San Francisco Gay Pride Parade, foreshadowing what appears to be a plan to attack the city, as well as Las Vegas or “Sin City.”\nThe video shows footage of the Golden Gate Bridge and the 555 California Street tower in the financial district, which is the second-tallest building in the city, among other landmarks. It also shows the Las Vegas Strip at night, according to PJ Media and the Inquisitor.\nThe scene is believed to have been shot from the pedestrian bridge at Caesar’s Palace and is of a similar bridge connected to the Bellagio hotel and Casino.\nThe Inquisitor writes that the video “is accompanied by an English voiceover encouraging more attacks in San Francisco in the same vein as the Pulse incident in Orlando and Arab subtitles are superimposed on the footage being shown.”\nA voiceover by n member of the radical Islamic militant group, who introduces himself as Abu Ismail al-Amriki (or “The American”), plays in the background.\nThe footage also displays links of press conferences following the aftermath of the gay nightclub shooting, including one from the Council on American Islamic Relations (CAIR) — which has been declared a terrorist organization by the United Arab Emirates and was named by federal prosecutors as an unindicted co-conspirator in a Hamas-funding operation.\nCAIR leapt to assist the families of San Bernardino terrorists Syed Rizwan Farook and his accomplice wife Tashfeen Malik, including helping them receive traditional Islamic burials.\nIn the video, however, the Islamic State appears to group CAIR in with American Muslim leaders, accusing them of cooperating with disbelievers, PJ Media notes.\nDespite reports in the media suggesting that Mateen was gay, FBI officials have found no evidence that he ever actually used apps used to meet other gay men, contrary to early reporting.\nSimilarly, the Islamic State appears to be speculative about Mateen’s sexuality. Sunday’s video is reportedly the third the group has released taking ownership for the Orlando attacks and encouraging others to follow Mateen’s example.\nThe Islamic State video also shows footage of President Barack Obama speaking in the Oval Office and the White House briefing room, with his image surrounded by blood splattered across the screen around him.\nIn January of last year, ISIS had threatened to behead Obama and make America a Muslim province.\nPhoto: File\nFollow Adelle Nazarian on Twitter @AdelleNaz","url":"https://www.breitbart.com/national-security/2016/06/27/islamic-state-targets-san-francisco-in-new-video/"}
