{"authors":["John Hayward"],"date_download":"2018-10-30 20:41:10","date_modify":"2018-10-30 20:41:10","date_publish":"2016-06-24 01:36:58","description":"A group called the \"Islamic State Wolfs\" issued a call for more \"lone wolf\" attacks like the Orlando massacre.","filename":"data/vaneerConsumption/IslamicStateCallforMoreLoneWolfAttacksOnline.json","image_url":"https://media.breitbart.com/media/2016/05/islamic-state-isis-black-flag-mosul-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_06_23__1540932070.html","title":"Islamic State Call for More 'Lone Wolf' Attacks Online","title_page":"Islamic State Call for More 'Lone Wolf' Attacks Online","title_rss":"NULL","source_domain":"breitbart.com","text":"A group called the “Islamic State Wolfs” — clearly supportive of ISIS but not definitively linked to them — has issued a call for more “lone wolf” attacks like the Orlando massacre, and they produced a handy infographic depicting various methods of committing terrorist murder.\nThe Foreign Desk describes the graphic as encouraging Islamic State supporters to kill infidels by means such as shooting, stabbing, clubbing, and bombing, along with using cars to run them down, pelting them with rocks, and — least formidably — getting them drunk and screaming at them.\nThe “intoxicate them” graphic looks like chemistry equipment, so perhaps “intoxicate” refers to poison. It’s anyone’s guess how “individual wolves” are supposed to kill infidels by screaming at them.\n“Similar sentiments have been echoed in other video releases by ISIS this week, including one in Khursan province and another in the Philippines. On both occasions and in previous messages, Islamic State leaders encourage followers to act against the enemy wherever they are, even if they cannot reach Syria or Iraq,” The Foreign Desk writes.\nThe other byline on the poster, besides “Islamic State Wolfs,” refers to the “Caliphate Cyber Army.” This is one of the Islamist hacker groups, recently banded together into the “United Cyber Caliphate,” a unified force that was supposed to become a more credible cyber-war threat to the civilized world. Judging by this poster, they haven’t figured out spell check technology yet.","url":"https://www.breitbart.com/national-security/2016/06/23/isis-supporters-call-lone-wolf-attacks-provide-helpful-infographic/"}
