{"authors":[],"date_download":"2018-10-22 22:20:27","date_modify":"2018-10-22 22:20:27","date_publish":"2017-04-26 04:16:18","description":"Kasem bin Abubakar was told nobody would buy his chaste romance novels about devout young Muslims finding love within the strict moral confines of...","filename":"data/vaneerConsumption/IslamicromancenovelssetheartsaflutterinBangladesh.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/04/wire-463039-1493176580-20_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446242_Islamic-romance-novels-set-hearts-aflutter-Bangladesh_1540246827.html","title":"Islamic romance novels set hearts aflutter in Bangladesh","title_page":"Islamic romance novels set hearts aflutter in Bangladesh | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bangaldeshi novelist Kasem bin Abubakar's stories of devout young Muslims finding love are enjoying a renaissance as Bangladesh slides from the moderate Islam worshipped for generations to a more conservative interpretation of the scriptures\nKasem bin Abubakar was told nobody would buy his chaste romance novels about devout young Muslims finding love within the strict moral confines of Bangladeshi society.\nAnd yet his tales of lovers whispering sweet nothings between calls to prayer sold millions in the 1980s and proved a huge hit among young girls from Bangladesh's rural, conservative heartland.\nNow his work is undergoing something of a renaissance as Bangladesh slides from the moderate Islam worshipped for generations to a more conservative interpretation of the scriptures.\n\"Girls write me love letters with ink dipped in their own blood. Some were desperate to marry me\" Abubakar told AFP, recounting his surprise at young women making a traditional gesture of intense devotion to a greying author.\nHis debut novel \"Futonto Golap\" (Blossomed Rose), written more than three decades ago, has spawned an entire genre of fiction tinged with Islamic values.\nAbubakar was inspired to take up the pen in the late 1970s, when as a bookseller he lamented that most novels obsessed with the cosmopolitan lifestyles of modern, elite Bangladeshis.\nThese secular tales were a world removed from the largely rural and pious village existence lived by the majority of Bangladesh's 160 million people, and Abubakar sensed a gap in the market ripe for his fiction.\n- 'Mullah novels don't sell' -\n\"He tapped into a new readership that nobody thought existed before,\" said Bangladeshi journalist Qadaruddin Shishir.\n\"In rural villages, Abubakar's novels are the best gift a young lover can give to his fiancee.\"\nAbubakar wrote \"The Blossomed Rose\" -- a story about two mismatched young Muslims seeking consent for marriage from their families -- by hand in 1978, but it took almost a decade for a publisher to even look at it.\nSince his breakthrough, Abubakar has written dozens of works, most revolving around the mosque, veiled women and wayward youth abandoning so-called corrupt lifestyles after finding religion.\n\"They told me 'mullah novels' don't sell,\" he said.\nEventually he sold the copyright to a publisher for a mere 1,000 Taka (USD$12.50), and became an overnight sensation.\nSince his breakthrough, Abubakar has written dozens of works, most revolving around the mosque, veiled women and wayward youth abandoning so-called corrupt lifestyles after finding religion.\nSecular activists fear creeping conservatism could unwind many of the gains made by the impoverished nation in improving school attendance and gender equality.\nAn ever-increasing number of students attend madrassas, or religious boarding schools, in Bangladesh, where Abubakar's books have found \"become a favourite\", said fellow author Syed Mazharul Parvez.\n\"They can relate to these stories and are comfortable with the settings and language their protagonists speak,\" he said.\n- Inspiring new writers -\nAbubakar has inspired a new generation of Bangladeshi writers who are finding success with their own contemporary brand of Islamic fiction.\nPopular writers like Abdus Salam Mitul, Kawser Ahmed and Abdul Alim ecohed Abubakar in their own tales of \"piety, conservative attitudes and decency\", said Abubakar's son Mohammad Saifullah, a Dhaka-based publisher.\nMitul in particular shot to fame in the 2000s with his own story about a burqa-clad girl reminiscent of Abubakar's breakthrough \"The Blossomed Rose\".\nAbubakar wrote \"The Blossomed Rose\" -- a story about two mismatched young Muslims seeking consent for marriage from their families -- by hand in 1978, but it took almost a decade for a publisher to even look at it. Now it is a bestseller.\n\"I think a lot of people still think it was written by my father. But it was Mitul's work and it sold tens of thousands of copies,\" Saifullah joked.\nAspiring author Abdul Alim said Abubakar's works had motivated his own plotlines -- moral tales that in the end showed \"Islam has answers\" for society's ills.\n\"He is such a talented story teller. He showed us the way,\" Alim said of Abubakar.\nFor Abubakar, his fans keep him busy even two years into retirement. At a bookstore recently the octogenarian signed autographs for his readers, many women in full-face veils clutching his titles.\nThe fan mail keeps the postman busy, too. Apart from the marriage proposals and overtures of love, Abubakar has received confessions from corrupt bureaucrats thanking him for steering them down the honest path, he said.\n\"Everyday the postman would arrive with hundreds of letters. He became a permanent member of our family,\" Abubakar said.","url":"https://www.dailymail.co.uk/wires/afp/article-4446242/Islamic-romance-novels-set-hearts-aflutter-Bangladesh.html"}
