{"authors":["Frances Martel"],"date_download":"2018-10-30 17:53:00","date_modify":"2018-10-30 17:53:00","date_publish":"2016-08-04 15:11:47","description":"Boko Haram leader Abubakar Shekau released audio denying that Abu Musab al-Barnawi – whom ISIS identified as the \"governor\" of Boko Haram territory – has deposed him as head of the group.","filename":"data/vaneerConsumption/IslamicStateIdentifiesNewBokoHaramChiefOldChiefDenies.json","image_url":"https://media.breitbart.com/media/2016/03/boko-haram-leader-abubakar-shekau-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_08_04__1540921980.html","title":"Islamic State Identifies New Boko Haram Chief; Old Chief Denies","title_page":"Islamic State Identifies New Boko Haram Chief; Old Chief Denies","title_rss":"NULL","source_domain":"breitbart.com","text":"Boko Haram leader Abubakar Shekau has released audio denying that Abu Musab al-Barnawi – whom the Islamic State has identified as the “governor” of Boko Haram territory – has deposed him as head of the terrorist group.\n“People should know we are still around. We will never cause any discord among the people, we will live by the Koran,” Shekau says in a Hausa-language audio recording surfacing on social media and confirmed by experts for the Nigerian newspaper Vanguard as being legitimate. Shekau, who has repeatedly been claimed dead, only to resurface in jihadist propaganda, says in the audio that he is “still around” and goes out of his way to condemn al-Barnawi, though not by name.\n“They deceived me,” he says of certain segments of Boko Haram, implying those who chose to go with the Islamic State. “And now I find myself being forced to follow another character who practices disbelief.”\nThe audio is the most recent communication from Shekau since March, when he appeared in what observers deemed a “farewell video.” In the video, Shekau said, “For me, the end has come,” then said, “This is only the message I want to send to you for you to understand that this is certainly I. This is why I did this. May Allah protect us so that no hypocrite stands between us.”\nThe Nigerian military has reported killing Shekau on multiple occasions, only to later confirm that the person they killed was an impersonator, of which Shekau, at his peak, had many.\nBoko Haram announced in March 2015 that it would pledge allegiance to ISIS Caliph Abu Bakr al-Baghdadi and rename itself the “Islamic State West Africa Province.” A new Islamic State publication released Tuesday, Al-Naba, features an interview with al-Barnawi, who had previously been referred to as a Boko Haram “spokesman.” In the interview, he is referred to as the “governor” of the West Africa Province, which would make him leader of Boko Haram.\nThe New York Times notes that al-Barnawi does not mention Shekau during the interview, but does condemn some Boko Haram tactics that became increasingly common under Shekau, notably the bombing of mosques and markets. ISIS objected to these tactics because they targeted Sunni Muslims, the only group of people against whom they do not seek to commit genocide.\nAl-Barnawi does vow in the interview to continue “booby-trapping and blowing up every church that [they] are able to reach, and killing all of those who [they] find from the citizens of the Cross.”\nBoko Haram has been repeatedly named the deadliest wing of the Islamic State, largely because it continues to target high-population locations like mosques on Fridays and the crowded markets of its native Maiduguri, Borno State. And despite the Nigerian military’s repeated assurances, Boko Haram remains a threat to the region.\nPresident Muhammadu Buhari first declared Boko Haram defeated in December, at the end of a three-month deadline he had given the military for eradicating the group shortly after taking the nation’s top office. In July, military spokesman Sani Usman declared that the military had no reason to believe there was a Boko Haram presence in Borno State anymore, implying Boko Haram had stuck around for seven months following Buhari’s victory cry.\nBoko Haram remains present in Borno’s Sambisa Forest and in the border regions of Chad, Niger, and Cameroon.","url":"https://www.breitbart.com/national-security/2016/08/04/islamic-state-identifies-new-boko-haram-chief-old-chief-denies/"}
