{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 20:36:14","date_modify":"2018-10-30 20:36:14","date_publish":"2016-09-09 08:37:07","description":"Islamic extremists will continue to pose serious national security problems for the United States and Europe in coming years.","filename":"data/vaneerConsumption/IslamicStatestillMajorNationalSecurityThreatDespiteLossofTerritory.json","image_url":"https://media.breitbart.com/media/2016/09/FBI-Director-James-Comey.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_09__1540931774.html","title":"Islamic State still Major National Security Threat Despite Loss of Territory","title_page":"Islamic State still Major National Security Threat Despite Loss of Territory","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON (AP) — Despite the Islamic State group’s loss of territory, the Islamic extremists will continue to pose serious national security problems for the United States and Europe in coming years, the directors of the FBI and CIA said Thursday.\n“The threat that I think will dominate the next five years for the FBI will be the impact of the crushing of the caliphate, which will happen,” FBI Director James Comey (pictured) told a national security conference in Washington. “Through the fingers of that crush are going to come hundreds of hardened killers, who are not going to die on the battlefield. They are going to flow out.”\nHe predicted that many will head into western Europe and will try to duplicate recent attacks in Paris and Brussels to maintain IS’s credibility in the militant world. Others will try to bring the fight to the United States, making it imperative for the US to help its European allies share intelligence better among themselves and with the United States, Comey said.\nComey also said, however, that as IS loses territory, it also will lose its ability to produce slick propaganda “used to motivate screwed up people to engage in acts of violence.”\nCIA Director John Brennan also said that many fighters who don’t die on the battlefield will try to return to their native countries, where they could launch IS-inspired attacks. He said al-Qaeda in Iraq had been reduced to several hundred fighters, yet was able to re-emerge.\n“You have a lot of these foreign fighters who have come into the theater that will either stay and fight and die trying or they will try to return to their home countries,” Brennan said. “Now some of them may be rehabilitated and some of them may see that they were on the wrong path, but I think a number of them are going to remain a challenge for the United States and other governments for a number of years to come.”\nIS has been losing territory on the battlefield. Late last month, Iraqi forces retook a town 45 miles south of Mosul, the second largest city in Iraq. A string of towns south and southeast of Mosul have also been recaptured as part of an operation aimed at eventually unseating IS from Mosul itself.\nLt. Gen. Vincent Stewart, director of the Defense Intelligence Agency, said at the conference that the battle to retake Mosul will be arduous.\n“Urban warfighting is not easy,” Stewart said. “This is a large city that has had at least two years to prepare to defend its position.”\n“If an adversary is willing to stand and fight in an urban environment, and you are least limited in the amount of casualties you can impose, it is going to be a long and difficult battle as it unfolds.”\nStewart, who predicted the battle to retake Mosul would occur sometime in the next two or three months, also warned that there is a danger in succeeding too quickly on the battleground before governance and humanitarian resources are in place.\nAir Force Col. John Dorrian, a military spokesman in Baghdad, told Pentagon reporters on Thursday that the timing of the battle is up to the Iraqis. He said the key is ensuring that they have the right forces and training to both liberate Mosul and then continue to hold it and prevent militants from coming back. He said the assessment in Baghdad is that the fight to retake Mosul could begin earlier — within the next month or so.\nLt. Gen. Stephen Townsend first outlined that prediction to The Wall Street Journal.\nIraqi Prime Minister Haider al-Abadi “has come out and said that he would like to get this done within the year,” Dorrian said. “If the desire is to try to get it done around the end of the year, we’re going to have to start soon.”\nHe said there are an estimated 3,000 to 4,500 IS militants in Mosul. The number of US troops in Iraq has been increasing in recent weeks, and now total about 4,460. The cap authorized by President Barack Obama is 4,647.","url":"https://www.breitbart.com/middle-east/2016/09/09/u-s-officials-islamic-state-still-major-national-security-threat-despite-loss-territory/"}
