{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:31:40","date_modify":"2018-10-30 20:31:40","date_publish":"2017-02-28 14:02:41","description":"Contents: ISIS forces hundreds of Christians to flee Egypt's North Sinai; ISIS-linked Ansar Bayt al-Maqdis in Sinai continues to confound Egypt's army | National Security","filename":"data/vaneerConsumption/IslamicStateForcesHundredsofChristianstoFleeNorthSinai.json","image_url":"https://media.breitbart.com/media/2017/02/wi/ap/26/i01p3q-e1488290350326.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_02_28__1540931500.html","title":"Islamic State Forces Hundreds of Christians to Flee North Sinai","title_page":"Islamic State Forces Hundreds of Christians to Flee North Sinai","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nISIS forces hundreds of Christians to flee Egypt’s North Sinai\nISIS-linked Ansar Bayt al-Maqdis in Sinai continues to confound Egypt’s army\nISIS forces hundreds of Christians to flee Egypt’s North Sinai\nCoptic Christian families from El-Arish arriving at the Evangelical Church in Ismailia last week (Reuters)\nAt least 100 Coptic Christian families and 200 Coptic Christian academic students have been forced to flee from El-Arish, the capital city of Egypt’s North Sinai governate, after being threatened by the Sinai terror group called Ansar Bayt al-Maqdis (ABM – Ansar Jerusalem – Champions of Jerusalem), which changed its name to Al Wilayat Sinai (Province of Sinai) when it changed its allegiance in 2015 from al-Qaeda to the so-called Islamic State (IS or ISIS or ISIL or Daesh).\nThe hundreds of Copts left their homes for the Suez Canal city of Ismailia, 125 miles west, where they were received by a Protestant Church, the Evangelical Church of Ismailia.\nThis comes after seven Coptic Christians were killed this month ABM militants, including one who was burned alive. The killings occurred after ISIS on February 19 released a video calling Copts “our priority and our preferred prey.” According to reports, ABM has “kill lists” that include the names of at least 40 Copts living in Sinai.\nThe series of attacks is a major embarrassment to Egypt’s president Abdel al-Fattah al-Sisi, who has been promising to eradicate terrorism from Northern Sinai after a series of terror attacks in the last two years. On Saturday, he ordered the government to take all necessary measures to provide assistance to the Coptic Christians who were forced to flee, and renewed his pledge to eliminate ISIS from Sinai, where the “undermine security and stability in Egypt.”\nThe Muslim Brotherhood, not wanting to be blamed, has strongly condemned the killings in Sinai, but blamed them on the “military coup regime” of al-Sisi. This is an allusion to the 2013 coup, led by then-army chief al-Sisi, ousting Mohammed Morsi and his Muslim Brotherhood government. Christianity Today and Al Ahram (Cairo) and IkhwanWeb (Muslim Brotherhood) and Middle East Eye\nRelated Articles\nISIS-linked Ansar Bayt al-Maqdis in Sinai continues to confound Egypt’s army\nEgypt’s army on Monday announced that it had killed six militants in Northern Sinai since the Coptic families were forced to flee. “Law enforcement forces will continue carrying out their mission with determination to uproot terrorism and eliminate terrorist elements,” said the statement.\nHowever, this battle between Egypt’s army and Ansar Bayt al-Maqdis has been going on for years, and many people wonder why the army hasn’t defeated ABM by now.\nAccording to one analysis, Egypt’s army is ill-equipped to deal with guerrilla warfare in urban and mountainous areas. Even more important, ABM has been able to acquire sophisticated weapons from stockpiles of weapons that were up for grabs in Libya after Muammar Gaddafi was killed in 2011. A steady stream of these weapons was smuggled by a Libyan jihadist group, Ansar al-Sharia (“Partisans of Sharia law”).\nOne of these weapons was the Russian Kornet, an antitank guided missile, which was a game-changer. Other weapons included Grad missiles, anti-tank rocket-propelled grenades, air defense Strela missiles, the latest Kalashnikov rifles, the Austrian Steyr sniper rifles, and DShK Russian machine heavy guns. These weapons have changed ABM from a small terrorist group into a large, well-armed militia.\nAccording to another report, hundreds of trained fighters, including dozens of elite commandos, formerly in the al-Qassam Brigades, the military wing of Hamas in Gaza, have been defecting to ABM-ISIS in the Sinai. These same al-Qassam militants have been providing training to the ISIS fighters in Sinai. Al-Ahram (Cairo) and Jerusalem Post and PJ Media\nRelated Articles\nKEYS: Generational Dynamics, Egypt, North Sinai, El-Arish, Coptic Christians, Evangelical Church of Ismailia, Ansar Jerusalem, Ansar Bayt al Maqdis, ABM, Champions of Jerusalem, Sinai Province, Al Wilayat Sinai, Mohammed Morsi, Muslim Brotherhood, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Abdel Fattah al-Sisi, Gaza, Hamas, al-Qassam Brigades\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2017/02/28/28-feb-17-world-view-isis-forces-hundreds-christians-flee-egypts-north-sinai/"}
