{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:41:21","date_modify":"2018-10-30 20:41:21","date_publish":"2016-05-24 19:34:07","description":"The Islamic State, in a new propaganda message, is urging supporters to carry out violent attacks during the Muslim holy month of Ramadan.","filename":"data/vaneerConsumption/IslamicStateUrgesLoneWolfAttacksinUSEurope.json","image_url":"https://media.breitbart.com/media/2016/04/Islamic-State-ISIS-militants-jihad-jihadis-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_05_24__1540932081.html","title":"Islamic State Urges Lone Wolf Attacks in U.S., Europe","title_page":"Ramadan: Islamic State Urges Lone Wolf Attacks in U.S., Europe","title_rss":"NULL","source_domain":"breitbart.com","text":"The Islamic State (ISIS/ISIL), in a new propaganda message, is urging supporters to carry out violent attacks against civilian and military targets within the United States and Europe during the Muslim holy month of Ramadan, which begins in early June.\n“Ramadan, the month of conquest and jihad. Get prepared, be ready … to make it a month of calamity everywhere for the non-believers … especially for the fighters and supporters of the Caliphate in Europe and America,” said the audio message, urging ISIS sympathizers in the West to attack if they cannot travel to the group’s self-declared Caliphate in Syria and Iraq, Reuters reports.\n“The smallest action you do in their heartland is better and more enduring to us than what you would if you were with us. If one of you hoped to reach the Islamic State, we wish we were in your place to punish the Crusaders day and night,” the message reportedly added.\nISIS encouraged its supporters to launch lone wolf attacks “to win the great award of martyrdom.”\nThe authenticity of the 31-minute message, purporting to come from Abu Muhammad al-Adnani, an ISIS spokesman, and posted on Twitter over the weekend by alleged supporters and opponents of the group alike, could not be verified, notes Reuters.\nJust In: Audio by #ISIS spokesperson, Abu Muhammad al-Adnani just released by al-Furqan https://t.co/xSK8ne2Wug pic.twitter.com/iXLN86Vpcw — Aditya Raj Kaul (@AdityaRajKaul) May 21, 2016\nAccording to the International Business Times (IBTimes), the message was officially released on May 21 by al-Furqan, identified as the jihadist group’s media arm.\nDuring the month of Ramadan, Islam adherents abstain from eating, drinking, smoking, having sex, and other physical needs each day, starting from before the break of dawn until sunset.\nISIS has imposed strict Islamic law, sharia, in the large swathes of Iraq and Syria it still controls, which includes a rigorous observance of Ramadan.\nThe day that marks the birth of the United States, the 4th of July, will fall on Ramadan. In addition, the holy month will take place during the summer, the season for multiple music festivals and concerts across the nation.\nVarious presidential campaign and election events will also take place during Ramadan 2016, as June will mark the end of the contentious primaries and caucuses held by the states and parties during which ISIS and Islam were debated.\n“The period of Ramadan, which carries on into July, happens to coincide with a number of big events in Europe,” including the Euro Soccer Cup, Wimbledon, the Glastonbury Festival, and the London Gay Pride Parade, notes IBTimes.\nMillions of Muslims in the United States and Europe are expected to participate in Ramadan.\nIn June 2015, as ISIS commemorated the first anniversary of the establishment of its Caliphate, the jihadist group made similar “Ramadan calls for violence,” also via an audio message by its spokesman al-Adnani.\nISIS was linked to various terrorist attacks after the message, encouraging followers to make Ramadan a time of “calamity for the infidels,” was released, noted Fox News.\nBetween then and now, the jihadist group has been associated with several deadly attacks in the United States and Europe.\nFBI Director James Comey recently told reporters that the number of Americans who had attempted or successfully traveled to the Middle East to join ISIS had recently dropped dramatically from up to ten per month to an average of one.\nIn part, the decline has been attributed to ISIS’ recent focus on encouraging its supporters to carry out lone wolf attacks in their homeland.\nAir Force Maj. Gen. Peter Gersten, a top deputy commander for the U.S.-led coalition against ISIS, said in late April that the number of overall foreign fighters making the trip to join ISIS in Iraq and Syria had dropped by 90 percent within the past year to 200 per month.\nOther analysts have estimated that ISIS’ strength in Iraq and Syria is in decline, as the group loses fighters and territory.\nBrett McGurk, President Barack Obama’s envoy to the U.S.-led coalition against ISIS, declared that the jihadist group’s “perverse caliphate is shrinking.”\nGen. Gersten told reporters that ISIS fighters are increasingly deserting, their morale is low, and they are facing difficulty getting paid.\n“In every single way, their capability to wage war is broken,” the U.S. general declared.\nMaj. Gen. Najm Abdullah al-Jubbouri, a top Iraqi commander, recently told Breitbart News that ISIS is “weaker than it was three months ago.”\nNevertheless, Comey told reporters that the FBI is dealing with “north of 1,000” terrorism-related cases, of which 80 percent are linked to ISIS.\nMoreover, Gen. David Rodriguez, head of U.S. Africa Command, recently said that the number of ISIS jihadists in Libya who aspire to attack Europe or the United States has more than doubled to between 4,000 and 6,000 in the last 12 to 18 months.\nDespite the reported decline, Director of National Intelligence James Clapper estimated in February that nearly 36,500 foreign fighters seeking to engage in jihad have already traveled from more than 100 countries to Iraq and Syria, including approximately 6,600 from Western nations.","url":"https://www.breitbart.com/national-security/2016/05/24/ramadan-violence-islamic-state-urges-lone-wolf-attacks-in-u-s-europe/"}
