{"authors":["Mary Chastain"],"date_download":"2018-10-30 21:21:53","date_modify":"2018-10-30 21:21:53","date_publish":"2015-12-29 03:50:26","description":"Members of the female Islamic State (ISIS/ISIL) brigade mutilated and butchered a mom who breastfed her child in Raqqa, Syria.","filename":"data/vaneerConsumption/IslamicStateFemaleBrigadeMutilatesBreastfeedingMom.json","image_url":"https://media.breitbart.com/media/2015/04/ISIS-female-brigade-al-Khansaa-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_12_28__1540934513.html","title":"Islamic State Female Brigade Mutilates Breastfeeding Mom","title_page":"Islamic State Female Brigade Mutilates Breastfeeding Mom","title_rss":"NULL","source_domain":"breitbart.com","text":"Members of the female Islamic State (ISIS/ISIL) brigade mutilated and butchered a mom who breastfed her child in Raqqa, Syria, according to reports.\n“An [Isis] policewoman took the baby, gave it to another woman, and then killed the mother,” explained Aisha, who managed to escape the grips of ISIS after militants beheaded her husband in front of their child.\nThe mother attempted to shelter her son under her burqa while she hid under the tree, but she did not succeed for long enough to escape the female al-Khansaa brigade, which attacked her following the alleged exposition. ISIS Twitter accounts reported that the women mutilated her before the execution because she violated “public purity.”\nStories about the brutal brigade first hit the news in 2014. Stories of their abuse continue to surface as civilians escape ISIS-controlled areas.\nISIS established Raqqa as the capital of their self-declared caliphate. The men formed the brigade to terrorize women whom they cannot touch under Sharia Law.\n“I once saw a woman at a market and she lifted her niqab [face veil] to inspect the vegetables,” described Salih, 77. “An Isis policewoman saw her and beat her. She was bleeding so badly that she died on the way to hospital. I saw many things, but I would cry if I told you them all.”\nIn December 2014, the al-Khansaa Brigade unveiled the “biter,” which is a bear trap for women’s breasts. It is responsible for “causing severe pain and wounds [which] may lead women in some cases to be transported to the hospital.” They allegedly used it on a woman only known as Batol:\nI was in the market buying a few items when Khansa battalion came and arrested me on the grounds that the niqab [Islamic face covering] which I was wearing does not meet Sharia requirement because it was transparent[.] [T]hey took me to the “Hesba” headquarters in the city, and escorted me to the torture chamber, then they asked me to choose between a whip or a “biter”[.] I did not know what a “biter” was and I thought it is a reduced sentence, I was afraid of whipping, so I choose the “biter”, then they brought a sharp object that has a a lot of teeth and held me, placing it on my chest and pressing it strongly, I screamed from pain and I was badly injured. They later took me to the hospital. I felt then that my femininity has been destroyed completely, we no longer afford to live this way, I was not the only one that was tortured with this instrument, there were a lot of women in the headquarters and their situation was tragic.\nDress code violations are the most common violation in Raqqa, especially if the women have sequins on their burqa.\n“They will destroy any handbags that have beads or [fake] diamonds on them,” stated Huda, 19. “Only black is allowed.”\n“Women armed with electric shock sticks regulated our lives,” added Aisha. “If a woman is not totally covered they will lash her 80 times on the street.”\nDua, another mother, told The Sunday Times she lived next to a “proud” member of the brigade. The woman once “boasted about the stoning of a young woman caught running away with her lover.” She said many women lived in fear because they never knew if someone would lie about them for revenge. Adiba said that happened to Hadija al Hussain, a mother of seven.\n“She was innocent, but they accused her of prostitution,” she said. “They started to stone her, then took a huge brick and hit her on the head.”\nForeign women make up the majority of the vicious brigade. In August 2014, The International Business Times reported the majority of the women in the group are of Chechen descent, but women from Afghanistan and Yemen have also joined. There are allegedly over 50 women in the gang in Raqqa. These women “are wives of immigrants in Syria, of Tunisian, Moroccan, French and British nationalities.” British women Glaswegian Aqsa Mahmood, 20, and Khadijah Dare, 22, are among the women in the brigade.\nA woman known as “Khadija,” unknown if it is the same woman listed above, defected to Turkey and told CNN about her time in the brigade. At first, the idea of the brigade made her happy, but witnessing executions and arranged marriages soured her vision. The man in charge of the marriages was “one of the worst people” she knew. She also said that “the foreign fighters are very brutal with women, even the ones they marry. There were cases where the wife had to be taken to the emergency ward because of the sexual violence.”","url":"https://www.breitbart.com/national-security/2015/12/28/islamic-state-female-brigade-mutilates-kills-breastfeeding-mom/"}
