{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:33:52","date_modify":"2018-10-30 20:33:52","date_publish":"2016-12-02 01:23:24","description":"Islamic State (ISIS/ISIL) jihadists have claimed this week that they kidnapped two Turkish soldiers in northern Syria.","filename":"data/vaneerConsumption/IslamicStateClaimsItCapturedTwoTurkishSoldiersinSyria.json","image_url":"https://media.breitbart.com/media/2015/10/ISIS-in-Syria-Militant-website-via-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_12_01__1540931632.html","title":"Islamic State Claims It Captured Two Turkish Soldiers in Syria","title_page":"Islamic State Claims It Captured Two Turkish Soldiers in Syria","title_rss":"NULL","source_domain":"breitbart.com","text":"Islamic State (ISIS/ISIL) jihadists have claimed this week that they kidnapped two Turkish soldiers in northern Syria.\nCurrently, Turkey-backed Free Syrian Army (FSA) rebels are fighting to liberate the northern Syrian city of al-Bab from ISIS.\nThe ISIS-affiliated Amaq News Agency reports that the jihadist group abducted two Turkish soldiers Tuesday near the al-Dana village northwest of al-Bab in northern Syria.\nStopping short of confirming the allegations, the Turkish military says it lost contact with the pair of soldiers around 3:30 p.m. local time on November 29, adding that the search for the missing soldiers continues, reports Reuters.\nThe news agency notes that the whereabouts of a missing Turkish soldier believed to have been kidnapped by ISIS along the Turkish-Syrian border in the summer of 2015 remain unknown.\nWhen commenting on the recent incident involving the two missing Turkish soldiers, neither the Turkish army nor the U.K.-based Syrian Observatory for Human Rights has mentioned ISIS.\nThe Observatory, which uses a network of ground sources to monitor the Syrian conflict, reports:\nThe fate of two Turkish soldiers is still unknown, they went missing in the countryside of al-Bab city northeast of Aleppo province, where The Syrian Observatory for Human Rights was informed by reliable sources that both soldiers are from the Turkish forces that support the rebel and Islamic factions of “Euphrates Shield” operation… and it is unknown whether they were killed or they had been kidnapped.\nIn late August, the Turkish military in coordination with the FSA launched an operation in northern Syria, dubbed Euphrates Shield, to clear Turkey’s southern border with Syria of both ISIS and Syrian Kurdish Democratic Union Party (PYD) fighters, which Ankara considers terrorists linked to the Kurdistan Worker’s Party (PKK).\nThe armed wing of the PYD is known as the People’s Protection Units (YPG), a group of fighters leading a U.S.-backed Arab-Kurdish alliance — the Syrian Democratic Forces (SDF) — fighting to retake ISIS’s de-facto capital in Syria Raqqa.\nAlthough both Turkey and the United States have designated the PKK a terrorist organization, President Barack Obama’s State Department does not believe YPG fighters are terrorists.\nThe ongoing Euphrates Shield operation has placed two U.S. allies — the FSA and PYD — on opposing sides of the Turkish offensive.\n“Five Turkish soldiers were wounded in clashes against ISIL near al-Bab as part of the Euphrates Shield Operation on Nov. 30,” a day after the two soldiers went missing, reports Hurriyet Daily News, citing Turkey’s state-run Anadolu Agency.\n“The soldiers were hospitalized in the southeastern provinces of Gaziantep and Kilis after being brought to the cities by choppers,” it adds.","url":"https://www.breitbart.com/national-security/2016/12/01/islamic-state-claims-captured-two-turkish-soldiers-northern-syria/"}
