{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 20:27:48","date_modify":"2018-10-30 20:27:48","date_publish":"2017-04-19 09:44:14","description":"Islamic State claimed responsibility for an attack on an Egyptian police checkpoint near the famed Saint Catherine’s Monastery in Sinai.","filename":"data/vaneerConsumption/IslamicStateClaimsAttackonEgyptPoliceCheckpoint.json","image_url":"https://media.breitbart.com/media/2017/04/is-flag.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_04_19__1540931268.html","title":"Islamic State Claims Attack on Egypt Police Checkpoint","title_page":"Islamic State Claims Attack on Egypt Police Checkpoint","title_rss":"NULL","source_domain":"breitbart.com","text":"CAIRO (AP) — The Islamic State extremist group has claimed responsibility for an attack on an Egyptian police checkpoint near the famed Saint Catherine’s Monastery in Sinai late Tuesday which authorities said killed one policeman and wounded four.\nThe militants opened fire from an elevated hilltop overlooking the police checkpoint just outside the monastery, which is located in a remote desert and mountainous area in the southern part of the Sinai Peninsula, according to a statement by the Interior Ministry.\nAfter an exchange of gunfire, the attackers fled the scene, the ministry said, adding that some of the gunmen were wounded in the shootout.\nNo further details were immediately available.\nAccording to SITE Intelligence Group, which tracks online activity of militants, the IS-affiliated Amaq news agency announced that the group’s militants carried out the attack near Saint Catherine. This is the first time the IS has attacked a monastery.\nIt comes shortly before a planned visit by the Vatican Pope Francis to Egypt next week.\nThe attack on the monastery, built in the 6th century and a popular site for tourists visiting the Red Sea resorts along Sinai’s southern coast, comes just over a week after suicide bombers attacked two churches in the Nile Delta city of Tanta and the coastal city of Alexandria, killing 45 people on Palm Sunday. Egypt’s Sinai-based Islamic State affiliate claimed responsibility for those attacks.\nIS has vowed more attacks against Christians in Egypt, who make up 10 percent of the country’s population of over 90 million people.\nThe Palm Sunday attack prompted President Abdel-Fattah el-Sissi to declare a three-month state of emergency and deploy armed forces to help police in guarding vital installations, including churches across the country.\nA state of emergency already in place in northern Sinai has failed to halt near-daily attacks against police and security forces by IS in the volatile area. The extremist group has lately stepped up its attacks, moving its activities from Sinai to other parts of Egypt and is increasingly using sophisticated tactics that are likely to fuel sectarian tensions and embarrass el-Sissi.\nEgypt’s Copts, the Middle East’s largest Christian community, have also long complained of suffering discrimination, as well as outright attacks, at the hands of the country’s majority Muslim population.\nOver the past decades, they have been the immediate targets of Islamic extremists as Egypt’s Orthodox Coptic Christians strongly supported longtime autocratic President Hosni Mubarak until his ouster in 2011.\nThe attack and the church bombings threaten to deal a blow to Egypt’s struggling tourism industry, which has suffered from political instability and a fragile security situation since the 2011 uprising.\nThe US issued a travel warning on Wednesday, advising its nationals in Egypt to stay away from places of worship for the next two weeks and to avoid crowds as long as they remain in the country.","url":"https://www.breitbart.com/middle-east/2017/04/19/islamic-state-claims-attack-egypt-police-checkpoint/"}
