{"authors":["Edwin Mora"],"date_download":"2018-10-30 19:17:13","date_modify":"2018-10-30 19:17:13","date_publish":"2016-08-19 07:48:12","description":"The jihadi group Islamic State maintains a detailed store-like price list for selling Christian and Yazidi girls, including 1 year olds.","filename":"data/vaneerConsumption/IslamicStateKeepsPriceListforSellingSexSlavesAsYoungas1IntheNameofAllah.json","image_url":"https://media.breitbart.com/media/2016/08/sex-slaves.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_08_19__1540927033.html","title":"Islamic State Keeps Price List for Selling Sex Slaves As Young as 1 ‘In the Name of Allah’","title_page":"Islamic State Keeps Price List for Selling Sex Slaves As Young as 1 ‘In the Name of Allah’","title_rss":"NULL","source_domain":"breitbart.com","text":"The savage jihadi group Islamic State (ISIS/ISIL) maintains a detailed store-like price list for selling Christian and Yazidi girls, including 1 year olds, as sex slaves “in the name of Allah” to Turkish, Syrians, and Gulf Arabs, according to a document submitted to the U.S. State Department as evidence of the brutal practice.\nCustomers are prohibited from buying more than three victims, according to a translation of the document, which reveals that the price list is titled, “In the name of Allah, the Most Gracious, the Most Merciful Subject/Prices of Selling Spoils of War.”\nUnited Nations officials have authenticated the sheet, which was exposed as part of a 278-page investigative report submitted to State earlier this year by the Knights of Columbus, the world’s largest Catholic fraternal organization, and the nonprofit In Defense of Christians.\nThe document and recent assessments by State suggest that sex slavery perpetrated by ISIS may be spreading to areas outside Iraq and Syria where the terrorist group is also operating.\nIt states:\nWe have received news that the demand in women and spoils of war market has been experiencing a significant decrease, which adversely affects the Islamic State of Iraq revenue and the financing of the Mujahideen assaults. Therefore, the Committee of Treasury considered setting regulations and prices with regards to selling women and spoils of war. And it makes it compulsory that those who practice this business should abide by these prices. Otherwise, whoever violates the price controls will be executed… It is not allowed for any customer to purchase more than 3 spoils, except for foreigners like Turks, Syrians, and Gulf Arabs.\nThe price sheet resembles an a la carte food menu. It only lists Yezidi and Christian sex slaves, ranging from age 1 to 50. Prices ($42.30 to $169.21) vary by age. Younger sex slaves are sold for more.\nAnti-sex trafficking activists argue that the document has not received the attention it deserves, reports Circa.\nWhen the prices are converted from Iraqi dinars to U.S. dollars, they reveal:\nPrices Merchandise $169.21 ……………… Yazidi or Christian, all children, aged 1 to 9 years\n$126.91 ………………. A Yazidi or Christian woman, aged 10 to 20\n$84.60 .………………. A Yazidi or Christian woman, aged 20 to 30\n$63.45 .………………. A Yazidi or Christian woman, aged 30 to 40\n$42.30 .………………. A Yazidi or Christian woman, aged 40 to 50\nThe State Department has highlighted the perils of sexual slavery at the hands of ISIS in various reports issued this year.\nIn its Country Reports on Human Rights Practices for 2015, State notes:\nIn August international media reported that Da’esh [ISIS] had developed a detailed bureaucracy for sex slavery, including sales contracts notarized by Da’esh-run courts. According to the Yezidi Affairs Directory, Da’esh had captured and enslaved as many as 5,838 Yezidis, including 3,192 women, since August 2014.\nState’s most recent Trafficking in Persons Report adds:\nDa’esh militants continue to kidnap and hold captive thousands of women and girls from a wide range of ethnic and religious groups, especially from the Yezidi community, and sell them to Da’esh fighters in Iraq and Syria…There are reports Da’esh executes captives if they refuse to marry fighters… In December 2014, Da’esh publicly released guidelines on how to capture, forcibly hold, and sexually abuse female slaves. In April 2015, an international organization reported the system of organized sexual slavery and forced marriage—which can lead to commercial sexual exploitation and forced labor—by Da’esh militants is a central element of the terrorist group’s ideology.\nThe State Department explains that the majority of Christian and Yezidi sex slaves were abducted in Iraq and subsequently sold in Syria.\nIt adds:\nDa’esh routinely forces Iraqi and Syrian girls to undergo virginity tests before trading them in ‘slave bazaars’ and sending them to various Syrian provinces and other countries for sexual slavery…it [ISIS] captured as many as 30 Assyrian Christian women and forced them into sexual slavery.\nThe abducted Yazidi and Christian victims are subjected to various forms of sexual violence including gang rape, forced marriages, and coerced abortions.\nSecretary of State John Kerry has acknowledged and condemned the ISIS atrocities against Christian, Yezidis, and other ethno-minorities groups as genocide.\nHowever, it has become apparent to various representatives of the persecuted groups that invoking the genocide label has no serious consequences. Some members of the minority groups recently told Breitbart News the declaration amounts to all talk and no action.\nPolitico reported in late May that the Obama administration is “grappling with how to actually prosecute the terrorist network’s fighters for the crime,” adding that “any genocide prosecution, however, could be years away…”\nThe administration has yet to make a move on potentially prosecuting ISIS jihadists for genocide.","url":"https://www.breitbart.com/national-security/2016/08/19/islamic-state-keeps-price-list-selling-spoils-name-allah-christians-yazidi-sex-slaves-young-1/"}
