{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-23 02:47:16","date_modify":"2018-10-23 02:47:16","date_publish":"2017-03-10 12:02:59","description":"William Maguire Jnr, 54, left his father in his car with a bottle of whisky and a cocktail of lethal drugs in Cowes, Isle of Wight, and was later arrested but released without charge.","filename":"data/vaneerConsumption/IsleofWightmanhelpedfatherwithMNDkillhimself.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22A4D000000578-0-image-a-35_1489147296303.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301026_Coroner-s-sympathy-son-helped-father-kill-himself_1540262836.html","title":"Isle of Wight man helped father with MND kill himself","title_page":"Isle of Wight man helped father with MND kill himself | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The son of a motor neurone disease sufferer reluctantly helped his father commit suicide after a heartfelt plea left him in an 'impossible position', an inquest heard.\nFormer prison governor William Maguire, 74, was warned by doctors that he would become totally incapacitated by the disease and unable to eat or drink.\nHis health deteriorated to such an extent that he spoke to his cleaner about visiting Dignitas, an assisted suicide clinic in Switzerland where people take their own lives.\nFormer prison governor William Maguire, 74, committed suicide at his home in Cowes, the Isle of Wight, in his Mazda (pictured)\nBut on the evening of March 1 2015, the inquest heard Mr Maguire instead enlisted the help of his son, William Jnr, to end his life at his home in Cowes, Isle of Wight.\nMr Maguire Jnr, 54, aided his father into his car, leaving him with a bottle of whisky and a cocktail of drugs, then told him he loved him as he closed the door, an inquest heard.\nA suicide note written by Mr Maguire Snr was left by his body which read: 'I do not wish to be resuscitated. I just want to die. I cannot live with this illness.'\nLater that night his son returned to the car, and saw his father - who had worked at HMP Winchester, Hampshire - had consumed the pills.\nHe called the police who found the elderly man in the driver's seat of his car, Isle of Wight Coroner's Court heard.\nMr Maguire Jnr was arrested on suspicion of assisting a suicide, at first denying any involvement but later told officers: 'You already know. I helped my dad commit suicide.'\nHe also told officers that he 'loved his father very much'.\nThe inquest heard he was later released without charge when no further action was taken.\nSpeaking to Mr Maguire Jnr, Assistant Coroner John Matthews expressed great sympathy for the son, who he said was put in 'an impossible position'.\nMr Matthews said: 'I express my sympathy and condolences to you, you were in a distressing situation.\nAn inquest heard how his son, William Jnr, handed him a bottle of whisky and a cocktail of drugs, told him he loved him, then shut the door of his car and walked away\n'I am sorry you have been placed in the position you find yourself in. You did it out of great love.\n'May I pay tribute to your father, he served for a long period in the prison service as a governor. He served with some distinction.'\nTowards the end of 2014, Mr Maguire Snr, a keen golfer, was finding it more difficult to get around and complained of back pain.\nAs well as having a severe lung disease, raised blood pressure, bowel inflammation, an enlarged prostate, carpal tunnel syndrome and depression, he was diagnosed with Motor Neurone Disease in early 2015.\nHe previously tried to take his own life with a mix of pills and alcohol on January 19 2015 - six weeks before his death.\nMr Maguire Snr also tried to gas himself in his black Mazda 6 Sport car, as his son left him in his vehicle parked in the garage.\nPathologist Dr Basil Purdue said he died from a mix of drug intoxication and alcohol, and ruled out gassing as the cause of death.\nRecording a conclusion of suicide, Mr Matthews said: 'This court has heard the sad and very distressing circumstances of William Maguire's death.\nWilliam Jnr called the police when he returned and found his father had consumed the pills. He was arrested but then released without charge\n'It must almost be at the top end of a horrible condition to happen to anyone. Maybe even more so than cancer.\n'It's an extremely depressing condition not only for the sufferer, but for the family of the sufferer. I'm not in the least bit surprised Mr Maguire acted in the way he did.\n'I'm satisfied that on March 1 he was quite determined to be successful in his suicide attempt, so a belt and braces operation was undertaken by him using the somewhat resistant assistance of his son.\n'He put his son in an almost impossible position, in my view.\n'Mr Maguire was determined to carry out the actions that he did and had Mr Maguire Junior not been there, he would have done it on his own in some way..'\nEuthanasia, or assisted dying, is against the law in the UK, but attempting to take your own life is not a criminal act.\nSarah Wootton, Chief Executive of Dignity in Dying which campaigns for assisted dying, said: 'Tragically, this is not an isolated incident.\n'Around 300 terminally ill people end their own lives in this country every year. Every eight days someone from Britain travels to Dignitas for an assisted death.\nAt the inquest into his death today, the coroner said he had great sympathy for Mr Maguire's son, who was left in an 'impossible position' and helped his father out of 'great love'\n'The UK's current blanket ban on assisted dying denies dying people the choice and control they deserve at the end of life.\n'It forces many people like William to take matters into their own hands, ending their own lives behind closed doors in traumatic circumstances. The effect this has on their loved ones can be devastating.\n'People who are well enough, wealthy enough and have loved ones willing to risk prosecution in accompanying them, can travel hundreds of miles to have an assisted death abroad. That choice is not open to everyone.\n'People with motor neurone disease deserve better - they deserve a compassionate law that respects individual choice and allows people to wrestle back control from an illness that has robbed them of so much.\n'Noel Conway, also living with MND, is currently fighting for these rights in the courts. When will Parliament finally listen to the pleas of dying people and take action?'\nA spokesman for Hampshire Constabulary confirmed they arrested a 52-year-old man on suspicion of assisted suicide at the time of his death, but he was released and told he faced no further action.","url":"https://www.dailymail.co.uk/news/article-4301026/Coroner-s-sympathy-son-helped-father-kill-himself.html"}
