{"authors":["Rebecca Santiago"],"date_download":"2018-10-30 22:46:25","date_modify":"2018-10-30 22:46:25","date_publish":"2014-08-14 19:05:11","description":"As an only child with introvert tendencies, going off to college was a little overwhelming for me at first. I had a roommate! In the same room as me! She was cool and tolerated my weird vampire hours and watched a lot of good Bravo shows, thank god,…","filename":"data/vaneerConsumption/IsLivingWithYourFriendsaGoodIdeaHereAre15ThingsYoullLearnWhenYourBFFsBecomeYourRoommates.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/6/14/e7c8d863-5c86-46a5-af72-70008dd9d816-getty-456450654.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_34402-is-living-with-your-friends-a-good-idea-here-are-15-things-youll-learn-when-your_1540939585.html","title":"Is Living With Your Friends a Good Idea? Here Are 15 Things You'll Learn When Your BFFs Become Your Roommates","title_page":"Is Living With Your Friends a Good Idea? Here Are 15 Things You'll Learn When Your BFFs Become Your Roommates","title_rss":"NULL","source_domain":"bustle.com","text":"As an only child with introvert tendencies, going off to college was a little overwhelming for me at first. I had a roommate! In the same room as me! She was cool and tolerated my weird vampire hours and watched a lot of good Bravo shows, thank god, but still. Sharing a small space meant that I had to share a lot of things about myself with her that I hadn't even let my closest high school friends in on — that I bleach the hair above my lip, for instance, because, what, was I supposed to do that under the covers?\nAnd it goes both ways. A few years later, when I was living in a house with a bunch of my ride or die bestests, I found myself privy to a bunch of small facts and habits I for sure would not have known about otherwise. For better or for worse, living with peers and friends is truly a bonding experience like no other. If you're about to make the big move, here are some things you can expect to learn about your roommate-friend. Friendmate? No, froommate ! We're coining it.\n1. Your froommate will only be able to wake up to Coldplay or Taylor Swift\nTrue story. Great girl, one of my best friends to this day, extremely inexplicable taste in alarm-clock ringtones.\n2. Your froommate doesn't give a damn about your lavender hand soap\nShe might have liked it before you moved in together, but please note that the brands you love are officially irrelevant if you and your froommate are splitting expenses, unless they happen to be the cheapest ones Market Basket has to offer.\n3. Your froommate is weird about food\nI'm not sure how specifically your froommate will be weird about food. She might make all of her meals on a George Foreman or eat all of your stuff and act like it's totally cool (that one's me) or literally split the last cracker in half so she doesn't feel rude for eating it, but she's going to be weird about food in a way that you most certainly couldn't ascertain without cohabitating.\n4. Your froommate has a vibrator\nYou will jump into her bed one morning to gossip or eat pancakes or do homework, and there it is — big, purple, and daring you to judge.\n5. Your froommate has oddly specific beauty routines\nMy most sentimental college memories are of me and my housemates getting ready to go out to a party or a bar on a Friday night. I miss clomping around dorm rooms with awful mixed drinks with my roomies, who respectively were trying on two different earrings at once and applying liquid liner and fluffing on blush and eyebrow-grooming and sink-shaving and, sure, mustache-bleaching.\n6. Your froommate has a lot of bodily functions\nShe'll talk about 'em, too.\n7. Your froommate sounds like a jerk when she talks to her parents on the phone\nBut she definitely thinks you do, too.\n8. Your froommate NEVER DOES THE GODDAMNED DISHES CORRECTLY\nDishes are a scary blame-game, man. I ate with disposable plates and utensils as often as possible just to avoid the drama. (Sorry, environment/grandchildren.)\n9. Your froommate has at least one disgusting grooming secret\nShe looked pretty clean before you moved in together. But whether she showers less than is generally considered socially acceptable in the winter, harbors a tower of dirty tissues in her room at any given time, or skips flossing altogether (guys, I was just told at the dentist that I have three cavities. Floss!), there is something very, very gross about her, and you will learn it quickly.\n10. Your froommate's got a late-night Domino's habit\nHer green juices were a clever ruse all along! BTW, this will soon become your shared late-night Domino's habit, and it is not necessarily a bad thing.\n11. Your froommate has really loud sex\nOr really, really quiet sex. Not sure which is weirder.\n12. Your froommate's gonna break into your toiletries\nYep, your makeup, lotion, and conditioner is now our makeup, lotion, and conditioner. I almost accidentally used one of my froommate's toothbrushes once, incidentally.\n13. Your froommate will spontaneously invoke Topless Tuesdays\nSo like is walking around in bras just how we live now or . . . ?\n14. Your froommate's all-nighter is your all-nighter\nUgh, what, no, B, the light's not keeping me up, don't even worry about it. Don't even worry about that Taylor Swift-Coldplay mix you've been blasting for the past three hours because it helps you stay up as well as wake up. I think that's really cool and great. Yes, I would like a nacho.\n15. Your froommate's hair gets everywhere\nEv-er-y-where.\nImage: Giphy (6), Tumblr (1), Giphy (1)","url":"https://www.bustle.com/articles/34402-is-living-with-your-friends-a-good-idea-here-are-15-things-youll-learn-when-your"}
