{"authors":["Sam Ramsden"],"date_download":"2018-10-31 01:48:19","date_modify":"2018-10-31 01:48:19","date_publish":"2018-09-14 09:28:20","description":"Actor Matthew Goode is best known for his roles in hit television dramas including The Good Wife, The Crown and Downton Abbey - but what about the dashing man behind the acting? Is Matthew Goode married? Sadly for those hoping they were in with a…","filename":"data/vaneerConsumption/IsMatthewGoodeMarriedTheDowntonAbbeyActorLikesToKeepHisPrivateLifeOnTheDL.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/13/93fe9ed7-caa3-45d8-8a53-b77693ab5096-getty-458770838.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-matthew-goode-married-the-downton-abbey-actor-likes-to-keep-his-private-life-on-the-dl-11903999_1540950499.html","title":"Is Matthew Goode Married? The 'Downton Abbey' Actor Likes To Keep His Private Life On The DL","title_page":"Is Matthew Goode Married? The 'Downton Abbey' Actor Likes To Keep His Private Life On The DL","title_rss":"NULL","source_domain":"bustle.com","text":"Actor Matthew Goode is best known for his roles in hit television dramas including The Good Wife, The Crown and Downton Abbey - but what about the dashing man behind the acting? Is Matthew Goode married? Sadly for those hoping they were in with a chance, Goode is well and truly off the market, and has been since 2005 when he and his now wife Sophie Dymoke first began dating.\nAlthough the couple mostly seems to prefer to keep details of their personal life out of the spotlight, Goode has spoken about the relationship a few times. In an interview with HitFix the 40-year old implied he tied the knot back in 2014 after the birth of his second child. During their 13-year relationship the pair have gone on to have three children, and in an interview with Red magazine it appears he has every intention of maintaining a healthy work-life balance. When discussing the prospect of leaving the UK to work on projects overseas, Goode said “I have three children and a lovely wife and I just don’t like being away from them. Of course, needs must occasionally. But I’m very lucky. I’ve been able to mix work and family.\"\nIan Gavan/Getty Images Entertainment/Getty Images\nWhen further discussing married life, The Imitation Game star commented on his secret to a happy marriage, the actor revealed \"You have to have something for yourself. I’ve always had a hobby\", and continued \"When the kids go to school, I go fishing. Sophie used to ride a lot when she was a child and she recently got back into that. So we have a bit of fun on the side\". Goode also confessed that married life for a celebrity is often just as mundane as it can be for the rest of us, when he joked that life with his better half is \"happily boring\".\nIn addition to family life and an already impressive resumé of on-screen roles, Goode is set to star in the upcoming Sky One drama A Discovery of Witches, a brand new series based on the novel of the same name. Instead of the usual dapper attire viewers are used to seeing Goode sporting in period dramas likeThe Crown, the actor will this time play a vampire opposite Australian actress, Teresa Palmer.\nThis Morning on YouTube\nFans will also be pleased to hear that Goode will reprise his role as Henry Talbot in the Downton Abbey film, and when discussing his new series A Discovery of Witches on This Morning — which host Holly Willoughby described as \"Twilight for grownups\" — Goode didn't escape a grilling about his role in the upcoming release.\nDisappointingly, the actor remained tight-lipped, saying, \"I can’t say anything about it. I can’t give any plot away. I’m in it\". And when asked how much of his character moviegoers can expect to see in the film Goode replied, \"No comment. Not a huge amount, I’ll tell you that much. It’s a very brilliant new story, the cast has gotten bigger.\" Hmm, very intriguing.","url":"https://www.bustle.com/p/is-matthew-goode-married-the-downton-abbey-actor-likes-to-keep-his-private-life-on-the-dl-11903999"}
