{"authors":["Taylor Maple"],"date_download":"2018-10-31 01:47:50","date_modify":"2018-10-31 01:47:50","date_publish":"2018-09-11 16:21:12","description":"Usually when people leave the beaches of Mexico on Bachelor in Paradise before the final roses are handed out, it's not a good thing. Take Astrid and Kevin, and Kendall and Joe, all of whom departed Monday night with plenty of confusion and…","filename":"data/vaneerConsumption/IsOliviaSingleAfterBachelorInParadiseSheVenmoJohnLeftTheShowEarlyButNotOnABadNote.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/8a5a438f-d645-4f76-9882-3168ee102195-777ebe09-bbbc-4450-aab8-81d73586d4dc.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-olivia-single-after-bachelor-in-paradise-she-venmo-john-left-the-show-early-but-not-on-a-bad-note-11868791_1540950470.html","title":"Is Olivia Single After ‘Bachelor In Paradise’? She & Venmo John Left The Show Early, But Not On A Bad Note","title_page":"Is Olivia Single After ‘Bachelor In Paradise’? She & Venmo John Left The Show Early, But Not On A Bad Note","title_rss":"NULL","source_domain":"bustle.com","text":"Usually when people leave the beaches of Mexico on Bachelor in Paradise before the final roses are handed out, it's not a good thing. Take Astrid and Kevin, and Kendall and Joe, all of whom departed Monday night with plenty of confusion and heartbreak swirling around them. But one pairing seemed solid, even though they opted out of staying til the end — so is Olivia single after Bachelor in Paradise?\nThere aren't any clear answers right now, and won't be until we see the rest of the finale, but right now, my money is on Olivia and John still being together. Neither of them have a ton of photos of each other on their Instagram feeds; John mostly features his dog, and his Bachelor in Paradise bromances, while Olivia's has a picture of their date, and not much more other than selfies and photos with friends. And, neither of them have tweeted since their departure or given any hints to what came after.\nBut things looked good for the laid-back couple when they left the show. John and Olivia took a road out of Paradise that too few people utilize — they didn't want to rush into fantasy suites, or put pressure on themselves to get engaged on TV at the end of the road. They just left, literally hand in hand, and allowed themselves the opportunity to pursue the relationship in a more authentic environment, away from the producers and the cameras.\nWhen John and Olivia sat down to discuss their future on the show, it was clear that they were into each other, but they weren't ready for the new expectations Paradise was about to place on them. Which, by the way, makes total sense! If you find someone on BiP that you love spending time with, but you don't feel comfortable putting a ring on it after three weeks, congratulations — you're a sane human being. For those who feel prepared to make that jump, it's great, but not everyone is going to want that, and that's OK too. John said it all perfectly:\nI know we haven't had many of these sit down deeper conversations but the truth is that I really, really like you. You are such a breath of fresh air in my life. You're such a sweetheart. You always look beautiful every time I see you. On the flip side, though, I do feel a little bit of pressure to go into something like the Fantasy Suite. I don't feel ready for that, and it comes with connotations and opinions of what would happen in the Fantasy Suite, but I want to keep hanging out with you. I'm not ready to say goodbye.\"\nThat's honestly how more people should approach the show. You're not going to go to Bachelor jail if you find someone you want to date, but don't want to fulfill everything required by the show's wildly accelerated timeline. Couples like Astrid and Kevin, and Kendall and Joe could have done well by this kind of decision.\nAstrid and Kevin seemed solid, but Kevin was obviously stressed about putting so much weight onto the relationship so soon. Instead of taking the Olivia and John route, they broke up and left separately. Kendall is still apparently figuring out if she's ready to commit, and she and Joe definitely didn't appear to be communicating their feelings in the clearest way, but they could have given it a shot without tearfully leaving in different vans.\nI truly hope that the aforementioned couples make their ways back to one another, because they seemed like good matches who just couldn't thrive in the Paradise environment. That shouldn't be a point of shame — the Paradise environment is completely bananas! Hopefully when Olivia and John reemerge at the finale special, they're still moving forward, as adorable as ever.","url":"https://www.bustle.com/p/is-olivia-single-after-bachelor-in-paradise-she-venmo-john-left-the-show-early-but-not-on-a-bad-note-11868791"}
