{"authors":["Sophie Mcevoy"],"date_download":"2018-10-31 01:50:43","date_modify":"2018-10-31 01:50:43","date_publish":"2018-09-06 12:04:09","description":"Whilst you're probably struggling with those feels left by the second season of Dr. Foster, thankfully creator Mike Bartlett has another fiery series up his sleeve. Press, a six-part BBC drama starring Ben Chaplin, and Charlotte Riley, will traverse…","filename":"data/vaneerConsumption/IsPressBasedOnATrueStoryTheBBCDramaExploresTheBritishNewspaperIndustryLikeNeverBefore.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/5d8f9d98-e205-4cf9-ae63-793fc7527c00-9256da01-0b9f-477b-85ba-092d1015daa7-16260311-low_res-press.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-press-based-on-a-true-story-the-bbc-drama-explores-the-british-newspaper-industry-like-never-before-11770864_1540950643.html","title":"Is 'Press' Based On A True Story? The BBC Drama Explores The British Newspaper Industry Like Never Before","title_page":"Is 'Press' Based On A True Story? The BBC Drama Explores The British Newspaper Industry Like Never Before","title_rss":"NULL","source_domain":"bustle.com","text":"Whilst you're probably struggling with those feels left by the second season of Dr. Foster, thankfully creator Mike Bartlett has another fiery series up his sleeve. Press, a six-part BBC drama starring Ben Chaplin, and Charlotte Riley, will traverse the complicated — and real — world of the British newspaper industry. And with that, only one question comes to mind — is Press based on a true story?\nThe answer is, yes and no. The series tells the stories of two newspapers; The Post, a tabloid headed up by editor Duncan Allen (Ben Chaplin), and The Herald, which is headed up by editor Amina Chaudury (Priyanga Burford) and news editor Holly Evans (Charlotte Riley). As the BBC explains, the drama \"follows their lives as they attempt to balance work and play, ambition and integrity, amid the never-ending pressure of the 24-hour global news cycle and an industry in turmoil.\" As the two papers compete against one another for sales and readership, the show gets pretty dark, and the scenes that unfold are shocking to say the least. But is it based on true events?\nWell, according to The Times, Bartlett visited plenty of newsrooms in real life to get an accurate feel of the job at hand. The writer visited the HQ of the Evening Standard, The Independent (when it still had a print edition), the Guardian, The Sun and The Mirror. Apparently, he \"just spent a day in each of those places, hanging out in the newsroom, trying to figure out what they were doing, asking journalists — suspicious journalists — what they do.\"\nBBC on YouTube\nBartlett said: \"These random stories I've been told about what journalists have got up to and what has happened, I've gone, 'Really?' The ones [I've used in the show] that make you go, 'I can't believe that,' or 'that can't be true,' are the ones that have come from real life.\"\nIn that case, I wonder if any of the journalists Bartlett spoke to will be tuning in to the launch episode to discover some pretty familiar scenes played out on the telly. Talk about awks.\nBBC/Lookout Point\nHowever, as Bartlett explained in a press pack sent to Bustle UK, Press is set in \"an entirely fictional world, with fictional papers and fictional stories.\" Rather than documenting the \"drama\" within the newsrooms of real newspapers, Bartlett has instead tried to work out what stories and subjects the papers are always fascinated by, and what kind of events tend to always trip them up in a fictional setting.\nSo, whilst The Post and The Herald aren't real, nor are they based on specific newspapers (although, in a way, they kinda are), the narrative arcs and stories that the editors and staff of these fictional papers will be subjected to are actually somewhat genuine.\nBBC/Lookout Point\nIf Doctor Foster is anything to go by, Press is going to be a wild ride, that's for sure.\nPress will premiere on Thursday on BBC One at 9 p.m. and will continue weekly thereafter.","url":"https://www.bustle.com/p/is-press-based-on-a-true-story-the-bbc-drama-explores-the-british-newspaper-industry-like-never-before-11770864"}
