{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 22:08:05","date_modify":"2018-10-30 22:08:05","date_publish":"2016-08-16 15:11:51","description":"The Shin Bet security service said several groups of Palestinians have been detained as suspects in plotting attacks for Hezbollah.","filename":"data/vaneerConsumption/IsraelBustsHezbollahCellsinWestBankPlottingTerrorAttacks.json","image_url":"https://media.breitbart.com/media/2016/02/Hezbollah-in-South-America-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_08_16__1540937285.html","title":"Israel Busts Hezbollah Cells in West Bank Plotting Terror Attacks","title_page":"Israel Busts Hezbollah Cells in West Bank Plotting Terror Attacks","title_rss":"NULL","source_domain":"breitbart.com","text":"Haaretz reports: The Shin Bet security service said on Tuesday that several groups of Palestinians have recently been detained as suspects in plotting attacks at the instructions of Hezbollah.\nA group from Qalqilyah in the West Bank was instructed to perpetrate an attack against soldiers, according to the Israeli security service. The Shin Bet identified the head of that ring as Mustafa Hindi, 18, from Qalqilyah, and says he was recruited via his Facebook profile.\nHindi was allegedly in touch with his Hezbollah operator, dubbed “Bilal” on Facebook, and later via an email account that he opened on Hezbollah’s instructions.\nAccording to the Shin Bet, Hindi was instructed to recruit a group of activists to carry out activities against Israeli targets including shootings at an IDF patrol in the Qalqilyah area.\nHindi is said to have recruited a number of Palestinians from his hometown, and began collecting information about army patrols in the area and to train activists in shooting and the use of improvised explosives.\nMembers of that group were arrested at the start of June before carrying out any of the attacks they had plotted. Indictments against them have been submitted to military tribunals.\nRead more here.","url":"https://www.breitbart.com/middle-east/2016/08/16/israel-busts-hezbollah-cells-west-bank-plotting-terror-attacks/"}
