{"authors":[],"date_download":"2018-10-30 14:35:00","date_modify":"2018-10-30 14:35:00","date_publish":"2014-07-14 00:00:00","description":null,"filename":"data/vaneerConsumption/IsraelgetsAnotherBlackEye.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_07_israel_gets_another_black_eye_1540910100.html","title":"Israel gets Another Black Eye","title_page":"Israel gets Another Black Eye","title_rss":"NULL","source_domain":"americanthinker.com","text":"The Telegraph headlines its article by Robert Tait “ Israel Kills two handicapped Palestinian women in air strike on home for disabled. ”\nIn their weekend editions, the New York Times and the London Daily Telegraph ran stories about a fatal attack by Israel on a center for the disabled in Gaza.\nThe Times headlines its article by Steven Erlanger: “As Israel Hits Mosque and Clinic, Air Campaign’s Risks Come Home.”\nBoth versions agree that two residents of the clinic for the disabled were killed in an Israeli air strike. Both versions also mention that Israel fired a warning shot on the building before bombing it.\nBut they disagree sharply about who else might have been in the building.\nTait, in the Telegraph, reports that two Gaza terrorists -- one belonging to Hamas and the other to Islamic Jihad -- resided in the upstairs floor of the clinic. Tait’s article also cites a neighbor who mentions that the two terrorists were absent when the bomb hit. In this version, Hamas and Islamic Jihad clearly used disabled residents as human shields.\nErlanger, in the Times, rejects Tait’s account of the clinic building harboring terrorists. He quotes the center’s founder, Jamila Elaiwa, as declaring “no one lived there except us. There was no one else in the building.” Erlanger also reports that the IDF is looking into what happened at the center for disabled\nAs for the bombed mosque in the Times article, Erlanger reports that in this instance, there was “no mistake. Here Israeli intelligence was convinced, and issued photographs to support its case, that the mosque also served as a Hamas rocket cache and a gathering point for militants.”\nBut why the great disparity in accounts about the bombing of the clinic for disabled? The Times version insists on portraying it as a horrific event without any redeeming factors. The Telegraph portrays the building as a residence of terrorists.\nWho is right? The gross disparity might be attributed to the fog of war or to the questionable reliability of witnesses.\nWho really knows? Erlanger and Tait were not present. Both had to rely on hearsay.\nIn the next days or so, the IDF may release its investigative report.\nIn the meantime, another knock on Israel.\nLeo Rennert is a former White House correspondent and Washington bureau chief of McClatchy Newspapers","url":"https://www.americanthinker.com/blog/2014/07/israel_gets_another_black_eye.html"}
