{"authors":["Corey Charlton","Julian Robinson For Mailonline"],"date_download":"2018-10-22 23:39:41","date_modify":"2018-10-22 23:39:41","date_publish":"2016-01-28 12:49:07","description":"Filmed by one of the men, the clip shows the off-duty pair driving past a camel by a sand dune near the Dead Sea in Israel while one of them fires at the helpless animal.","filename":"data/vaneerConsumption/IsraeliDefenceForcesoldierjailedforkillingcamelindrivebyshooting.json","image_url":"https://i.dailymail.co.uk/i/pix/2015/12/16/11/2F6BFE3F00000578-0-image-a-10_1450266092022.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420877_Israeli-special-forces-soldier-jailed-killing-camel-drive-shooting-friend-filmed-him_1540251581.html","title":"Israeli Defence Force soldier jailed for killing camel in drive-by shooting","title_page":"Israeli Defence Force soldier jailed for killing camel in drive-by shooting | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An Israeli special forces soldier has been jailed for killing a camel in a drive-by shooting as his friend filmed him.\nThe soldiers, from the feared Duvdevan Unit, were charged with animal cruelty and firearms offences after a video of the incident surfaced.\nFilmed by one of the men, the clip shows the off-duty pair driving past a camel by a sand dune near the Dead Sea while one of them fires at the helpless animal.\nVideo of the incident appeared to show one of the men shooting the camel with a handgun (pictured)\nThe soldier fired one shot at the animal, which later died, sparking hysterical laughter from inside the car\nAccording to the Times of Israel, the soldier who fired the shot was sentenced to four months while the comrade who filmed it was jailed for two months. Both have reportedly been demoted to the rank of private.\nAs the bullet hits the unsuspecting camel - which later died - hysterical laughter can be heard coming from the car.\nAt a preliminary hearing, the soldier who fired the fatal shot was asked about the laughter and admitted: 'We were in a kind of euphoria. It was exciting.'\nThe incident took place in November while the two men - now suspended from duty - were on leave before they began officer training in the commando unit.\nThe two men, from Israel's feared Duvdevan Unit, have both been jailed and demoted to the rank of private\nAn Israeli army spokesman said: 'This was a serious incident that does not meet the standards expected from IDF [Israel Defence Force] soldiers.'\nLawyers for the pair acknowledge the severity of the incident, but said they should be credited for confessing their actions.\nThe Duvdevan Unit, part of Israel's West Bank is one of the most feared throughout the Middle East and often works as an undercover plain clothes squad fighting terrorism.","url":"https://www.dailymail.co.uk/news/article-3420877/Israeli-special-forces-soldier-jailed-killing-camel-drive-shooting-friend-filmed-him.html"}
