{"authors":["Aaron Klein"],"date_download":"2018-10-30 20:58:45","date_modify":"2018-10-30 20:58:45","date_publish":"2017-01-24 15:43:08","description":"Two days after PM Benjamin Netanyahu and President Donald Trump spoke by phone, Israel announced the approval of 2,500 West Bank homes.","filename":"data/vaneerConsumption/IsraelApproves2500WestBankHomesFollowingNetanyahuCallWithTrump.json","image_url":"https://media.breitbart.com/media/2017/01/west-bank-homes.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_01_24__1540933125.html","title":"Israel Approves 2,500 West Bank Homes Following Netanyahu Call With Trump","title_page":"Israel Approves 2,500 West Bank Homes Following Netanyahu Call with Trump","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Two days after Prime Minister Benjamin Netanyahu and President Donald Trump spoke by phone, Israel on Tuesday announced the approval of 2,500 homes in the West Bank, most of which are to be built in already existing Jewish communities.\nThe Times of Israel reported:\nThe decision came two days after a Jerusalem planning committee approved the construction of 566 housing units in East Jerusalem, and on the heels of a phone conversation on Sunday between Netanyahu and US President Donald Trump, where the two discussed their plans for the region.\nMost of the housing units will be built in the large settlement areas, notably in the city of Ariel and in Givat Ze’ev, outside Jerusalem. But some will also go up in settlements outside the larger blocs, due to prior agreements and court decisions.\n“We’re building — and will continue to build,” Prime Minister Benjamin Netanyahu said following the announcement.\nLast month, a U.S. abstention under President Obama allowed the passage of UN Security Council Resolution 2334, which refers to the entire West Bank and eastern Jerusalem as so-called occupied Palestinian territories while demanding a complete halt to all Israeli construction in those areas.\nSome of the holiest sites in Judaism are located in eastern Jerusalem and the West Bank, including the Western Wall and Temple Mount in Jerusalem’s Old City; the Cave of the Patriarchs and Matriarchs in Hebron, which was home to the oldest continuous Jewish community in the world until the Jews of Hebron were massacred and expelled; the Tomb of Rachel in Bethlehem; and Joseph’s Tomb in Nablus – biblical Shechem.\nThe UN measure entirely contradicts a Bush administration commitment to allow some existing Jewish settlements to remain under a future Israeli-Palestinian deal. That U.S. commitment, which the Obama administration has repeatedly violated by condemning settlement activity, was reportedly a key element in Israel’s decision to unilaterally evacuate the Gaza Strip in 2005.\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.","url":"https://www.breitbart.com/middle-east/2017/01/24/israel-approves-2500-west-bank-homes-following-netanyahu-call-trump/"}
