{"authors":["Associated Press"],"date_download":"2018-10-23 00:36:05","date_modify":"2018-10-23 00:36:05","date_publish":"2016-01-11 10:08:01","description":"JERUSALEM (AP) — Israeli authorities said Monday they were investigating a fire at the Jerusalem offices of an Israeli human rights group that caused extensi...","filename":"data/vaneerConsumption/Israelinvestigatingfireatofficesofhumanrightsgroup.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393471_Israel-investigating-fire-offices-rights-group_1540254965.html","title":"Israel investigating fire at offices of human rights group","title_page":"Israel investigating fire at offices of human rights group | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Israel investigating fire at offices of human rights group\nJERUSALEM (AP) — Israeli authorities said Monday they were investigating a fire at the Jerusalem offices of an Israeli human rights group that caused extensive damage and raised suspicions of arson.\nA spokesman for Israel's fire and rescue authority said early indications showed the fire at the offices of B'Tselem was caused by an electrical fault. He said it was \"apparently not arson,\" following initial suspicions that the building had been targeted.\nThe blaze erupted late Sunday on the first floor of a building where B'Tselem's offices are located. The group had been the target of recent accusations that it and other dovish groups critical of the government undermine the state with their support for Palestinians and criticism of revered state institutions such as the military.\nB'Tselem had expressed concern earlier that the fire may have been caused intentionally, citing what it and other dovish groups say is an atmosphere of incitement fostered by hard-line legislators and activists against the rights groups.\nHawkish non-governmental group Im Tirtzu recently released a video accusing the heads of some dovish groups, including B'Tselem, of being foreign agents because their organizations receive funding from foreign governments.\nBut fire and rescue authority spokesman Yoram Levy said it the cause of the fire appeared to be an electric short-circuit in the ceiling. He said there were no signs of forced entry in the building. Still, he said the investigation had not been completed.","url":"https://www.dailymail.co.uk/wires/ap/article-3393471/Israel-investigating-fire-offices-rights-group.html"}
