{"authors":[],"date_download":"2018-10-22 22:06:18","date_modify":"2018-10-22 22:06:18","date_publish":"2014-06-08 13:06:56","description":"Israelis and Palestinians expressed measured optimism Sunday as their respective leaders prepared for an historic joint prayer meeting with the Pope.","filename":"data/vaneerConsumption/IsraelisPalestiniansExpressHopeOverHistoricVaticanMeeting.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/494976/140608-vatican-mideast-9a_9fffeb39aad6a65f0537e83366dfc659.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_israelis-palestinians-express-hope-over-historic-vatican-meeting-n125556_1540245978.html","title":"Israelis, Palestinians Express Hope Over Historic Vatican Meeting","title_page":"Israelis, Palestinians Express Hope Over Historic Vatican Meeting","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIsraelis and Palestinians expressed measured optimism Sunday as their respective leaders Shimon Peres and Mahmoud Abbas prepared to take part in an historic joint prayer meeting with Pope Francis at the Vatican.\nCatholic officials played down the significance of the meeting, saying it was not intended to be a political event.\nBut the unusual summit — with Jewish, Christian and Muslim prayers intoned in the shadow of St. Peter's Basilica — could take on great significance on the ground.\nAs the leaders gathered in Rome, people on both sides of the divide told NBC News of their hopes that it could lead to progress in the deadlocked Middle East peace process.\n“I am very happy about this meeting,” said Ahron Reshef, 65, a lawyer in Jerusalem. “I would be very happy if real progress happens after this meeting.\n“I’m an optimist but it's very difficult to be optimistic in this area … but I hope and I pray that something will happen.”\nAliza Ashkenazi, 50, a carpenter from Jerusalem, said the Pope was an ideal person to bring the rival leaders together.\n“He is not for the Palestinians or the Israelis, so is the right person to do it,” Ashkenazi said. “I like to think that it's possible to have peace with both countries, nations. Hopefully something will happen but I'm not really sure it can be happening.”\nShe added: “It’s a beginning, it's a start. “It’s better than nothing.”","url":"https://www.nbcnews.com/news/world/israelis-palestinians-express-hope-over-historic-vatican-meeting-n125556"}
