{"authors":["Aaron Klein"],"date_download":"2018-10-30 18:57:51","date_modify":"2018-10-30 18:57:51","date_publish":"2016-04-20 07:29:08","description":"Former U.S. official Lawrence Wilkerson used a recent radio interview to claim that Israeli behavior will see it “eliminated\".","filename":"data/vaneerConsumption/IsraelWillBeEliminatedByInternationalCommunitySaysExUSOfficialWhoAdvisedSanders.json","image_url":"https://media.breitbart.com/media/2016/04/wilkerson.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_04_20__1540925871.html","title":"Israel Will Be ‘Eliminated’ By International Community, Says Ex-U.S. Official Who Advised Sanders","title_page":"Israel Will Be ‘Eliminated’ By International Community, Says Ex-U.S. Official Who Advised Sanders","title_rss":"NULL","source_domain":"breitbart.com","text":"Former U.S. official Lawrence Wilkerson, who has reportedly advised Sen. Bernie Sanders’s presidential campaign, used a recent radio interview to claim that Israeli behavior will see the Jewish state “eliminated by the international community if not the 350 to 400 million people around it who are opposed to it.”\nHe used the interview to call for a total reassessment of the U.S. relationship with Israel, claiming that “Israel is becoming such a strategic liability for us, that it’s detrimental to our own national security.”\nWithout citing any specific evidence, Wilkerson espoused a conspiracy theory that Prime Minister Benjamin Netanyahu has designs for a “greater Israel” that would encompass parts of Lebanon and Syria, and possibly all of Jordan.\nIn the interview, Wilkerson recognized that his words would probably ensure against his working in American politics in the future.\n“The last time I spoke this way on your show, I compromised my ability to work for the Bernie Sanders campaign,” he said in his interview with The Real News Network.\nHe continued:\nSo now I’ve probably foreclosed my ability to work for anyone. It’s very hard to see how, at present pace, this situation is going to change, because the ultra right-wing of Israel has captured AIPAC, and AIPAC has captured the United States Congress. And to a certain extent the oval office as well.\nA full video of Wilkerson’s comments can be seen below:\nIn February, Politico reported that Sanders is being advised by Wilkerson, a retired U.S. Army colonel who served as chief of staff to Secretary of State Colin Powell and later became a staunch opponent of the war in Iraq.\n“Of late, I’ve been asked by quite a number of people or groups to advise on national security and foreign policy. The Sanders campaign has been one of these and I have spoken directly to the senator on one occasion, at this point,” Wilkerson told Politico.\nSince then, Wilkerson’s views have come under closer scrutiny, including his previous assertion, as Breitbart Jerusalem reported, that Israel may have carried out chemical attacks in Syria as a false-flag operation against the Bashar al-Assad regime.\nThe Sanders did not respond to a Breitbart Jerusalem request seeking comment about whether Wilkerson continues to advise the campaign.\nIn his latest interview cited above, Wilkerson made new, highly controversial comments about Israel.\nOn reassessing the U.S.-Israel relationship, Wilkerson stated:\nI spoke at the National Press Club on Friday 18 March and I spoke under the title of “Israel: A Strategic Liability of the First Order.” And I believe Israel has become just that, a strategic liability. There are of course, reasons other than grand strategy to maintain the relationship with Israel, and I would support most of those reasons – but I think it’s important that we begin a serious review of the relationship because Israel is becoming such a strategic liability for us, that it’s detrimental to our own national security. And this covers a whole gamut of actions by both Israeli and U.S. that need to be reviewed.\nHe baselessly claimed that Netanyahu has designs for Syria, Lebanon, and Jordan to be included in a “greater Israel.”\nSo the future for Israel, as contemplated by Netanyahu, is a greater Israel. Having secured the West Bank. Jerusalem as its capital, perhaps gotten Gaza back, maybe the Sinai, parts of Lebanon, parts of Syria that’s now looking like it’s falling apart, and parts if not all of Jordan. This is Netanyahu’s ultimate goal. This is the Zionist ultimate goal. And so, that’s very dangerous because it’s not tenable. What you’re going to have is you’re going to have a one state solution. That state is going to be increasingly apartheid as the West Bank and Jerusalem are now.\nWilkerson claimed Israel’s “apartheid” policy will eventually see the Jewish state “eliminated” by Israel’s regional enemies or the international community:\nAnd as Israel proper is becoming more and more alike, that state’s going to be apartheid, it’s going to be untenable, it’s going to be eliminated by the international community if not the 350 to 400 million people around it who are opposed to it.\nSo this is a situation that is okay for Israel’s short term security as Netanyahu conceives it, chaos in the region and so all of Israel’s enemies being in chaos can’t attack it, but it’s not very conducive, it’s not conducive at all, to the future security of Israel where it becomes this one state solution that is an apartheid state and is gradually forced to become something that will look very different from what it is today, even if it exists at all. That’s not good for Israel’s long-term security.\nAs Wilkerson himself noted, this is not the first time his interview with the radio network caused controversy.\nWilkerson said:\nIsrael has an enormous impact on U.S. foreign policy, but it’s beginning to be so detrimental to U.S. foreign and security policy that people like (Senators) John McCain and Lindsey Graham, with their hands out to the Jewish lobby for more donations to their PACs and so forth, just simply need to shut up and go back into the dark shadows from whence they emerged.\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.\nWith research by Brenda J. Elliott.","url":"https://www.breitbart.com/middle-east/2016/04/20/sanders-adviser-israel-will-eliminated-international-community/"}
