{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:19:07","date_modify":"2018-10-30 21:19:07","date_publish":"2016-08-25 15:25:38","description":"The Israeli army has cleared troops in four cases of allegations of killing Palestinian civilians during the 2014 war with Hamas in Gaza.","filename":"data/vaneerConsumption/IsraeliArmyClearsTroopsOfWrongdoingDuring2014GazaWar.json","image_url":"https://media.breitbart.com/media/2016/08/gaza-rocket-attack.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_08_25__1540934347.html","title":"Israeli Army Clears Troops Of Wrongdoing During 2014 Gaza War","title_page":"Israeli Army Clears Troops Of Wrongdoing During 2014 Gaza War","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – The Israeli army on Wednesday cleared troops accused of killing Palestinian civilians during the 2014 war with Hamas in Gaza.\nThe IDF, the UN Human Rights Council, and the International Criminal Court have been investigating war crimes related to the death of over 2,000 Palestinians during the war, including an unknown number of civilians.\n73 Israelis were killed and hundreds of thousands more fled their homes in an attempt to escape rocket fire from Gaza.\nThe report by the IDF included eyewitness testimonies from both IDF personnel and Gaza residents.\nThe deadliest incident occurred in the southern Gaza town of Rafah where 15 members of the Zoroub family were killed in an airstrike.\nAccording to the report, the building they were in was also a Hamas command and control center, and the strike was therefore permitted by international law. The army added that one of the family members, Nazmi Zoroub, was a senior commander of the terror group and other Hamas agents were present as well.\n“The attack complied with the principle of proportionality, as at the time the decision to attack was taken it was considered that the collateral damage expected to arise as a result of the attack would not be excessive in relation to the military advantage anticipated from it,” the report said.\n“This assessment was not unreasonable under the circumstances, despite the discovery, in the wake of the strike, of discrepancies between the reality prevailing on the ground and the information available at the time,” it added.\nThe IDF denied allegations that the attack was an attempt to prevent Hamas from stealing the body of Lt. Hadar Goldin, noting that it was nothing more than a coincidence that the incident happened in the same area that day.\nIn another case, seven civilians were killed on July 20, 2014. The IDF stated that the target was Hamas and, out of the seven, three were Hamas agents – including two high-ranking operatives. The IDF said that all the necessary precautions had been taken to avoid the deaths of the four civilians but that the security threat posed by the three Hamas members prevailed.\nThe IDF rejected allegations that 12 family members were killed in Rafah on July 21, saying that no strikes were carried out in that area on that day.\nInstead, the IDF said, there was ample evidence that Hamas had fired rockets and mortars from the vicinity, and some of the shells and rockets misfired, killing the Gazans.\nThe report also addressed the August 3 attack that caused an outcry from the international community due to the deaths of 15 civilians in a courtyard adjacent to a UN school. The target was three Hamas agents on motorcycles who sought refuge in the school.\nThe IDF was not aware of the civilians near the school and therefore troops cannot be prosecuted.\nIncluding the four cases above – which resulted in 49 deaths – the IDF has reviewed 360 incidents from the war so far. 31 have led to full criminal investigations, 13 have been closed, and one, a case of theft, has led to an indictment.","url":"https://www.breitbart.com/middle-east/2016/08/25/israeli-army-clears-troops-of-wrongdoing-during-2014-gaza-war/"}
