{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 21:04:48","date_modify":"2018-10-30 21:04:48","date_publish":"2017-04-02 15:30:16","description":"Defence Minister Avigdor Lieberman said Sunday Israel did not seek \"adventures\" in Gaza after Hamas accused it of assassinating an official.","filename":"data/vaneerConsumption/IsraelSaysNotSeekingGazaAdventuresAfterKillingClaim.json","image_url":"https://media.breitbart.com/media/2015/03/israeli-foreign-minister-avigdor-lieberman-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_04_02__1540933488.html","title":"Israel Says Not Seeking Gaza 'Adventures' After Killing Claim","title_page":"Israel Says Not Seeking Gaza 'Adventures' After Killing Claim","title_rss":"NULL","source_domain":"breitbart.com","text":"JERUSALEM (AFP) – Defence Minister Avigdor Lieberman said Sunday Israel did not seek “adventures” in Gaza after Hamas accused it of assassinating an official, and suggested the group itself could have killed him.\nHamas, which runs the Gaza Strip, has blamed Israeli intelligence agency Mossad and its “collaborators” for the March 24 killing of Mazen Faqha in the Palestinian territory.\nIsraeli officials had previously not commented on the killing.\n“We are not looking for adventures,” Lieberman said during a visit to the Israeli city of Sderot near the Gaza border, according to his office.\n“We are conducting security policy with responsibility and determination.\n“It does not matter what Hamas says, it’s important what the Jews do.”\nHe added: “Let Hamas do what it wants and we will do what we need to do. Hamas is known for internal assassinations, for settling accounts. I suggest that they look there for it.”\nIn response, both Hamas and its armed wing, the Ezzedine al-Qassam Brigades, accused Lieberman of seeking to evade responsibility for the killing.\n“The Israeli occupier bears all responsibility for the assassination of Mazen Faqha and the ensuing results,” Hamas spokesman Fawzi Barhum said in a statement.\nThe killing has raised the possibility of a response from Hamas and a fresh escalation of violence.\nOn Saturday, Hamas vowed “radical measures” against Palestinians who “collaborated” with Israel, with interior ministry spokesman Iyad al-Bozum saying that could mean arrests, trials and even executions.\nIsrael and Palestinian militants in Gaza have fought three wars since 2008. The enclave has been under an Israeli blockade for 10 years.\nAccording to Hamas, Faqha formed cells for the Islamist group’s military wing in the West Bank cities of Tubas, where he was born, and Jenin.\nIt said he played an important role in preparing two major incidents.\nThe first was a suicide attack in the Israeli settlement neighbourhood of Gilo in east Jerusalem in 2002 that killed 19 people.\nThe second was a suicide bus attack later that year that killed nine people in the northern Israeli city of Safed.\nBoth were part of a wave of suicide attacks that killed hundreds of Israelis during the second intifada, or uprising, between 2000 and 2005.\nIsrael sentenced Faqha to nine life sentences plus 50 years, but he was released in 2011 along with more than 1,000 other Palestinians in exchange for Gilad Shalit, an Israeli soldier Hamas had detained for five years, and transferred to Gaza.","url":"https://www.breitbart.com/middle-east/2017/04/02/israel-says-not-seeking-gaza-adventures-killing-claim/"}
