{"authors":[],"date_download":"2018-10-22 22:31:49","date_modify":"2018-10-22 22:31:49","date_publish":"2014-06-10 12:12:24","description":"The legislation now goes to committee for possible amendments before parliament votes on it again.","filename":"data/vaneerConsumption/IsraeliLawtoForceFeedPalestinianHungerStrikersGetsInitialNod.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/496696/140509-hunger-strike-palestinians-1145a_3fbecf301ca651a8a3329012f619e9b1.1200;630;7;70;5.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_mideast_israeli-law-force-feed-palestinian-hunger-strikers-gets-initial-nod-n127151_1540247509.html","title":"Israeli Law to Force-Feed Palestinian Hunger-Strikers Gets Initial Nod","title_page":"Israeli Law to Force-Feed Palestinian Hunger-Strikers Gets Initial Nod","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIsrael's parliament has given initial approval to a law to enable the force-feeding of Palestinian prisoners on a hunger strike, drawing defiance from activists who said on Tuesday it would not deter the inmates.\nSome 120 Palestinians held by Israel began refusing food on April 24 in protest at their detention without trial. Since then the number has risen closer to 300. Israel's Prisons Service say 70 have been hospitalized.\nIsrael says Palestinians suspected of security offences are sometimes jailed without trial to avoid any court proceedings that could expose sensitive intelligence information -- a practice that has drawn international criticism.\nLegislation that would permit authorities to seek a court order to force medical treatment on prisoners whose health was at serious risk on Monday passed the first of four votes needed to become law.\nThe measure, which is opposed by the Israeli Medical Association (IMA) that represents most Israeli doctors, is backed by Prime Minister Benjamin Netanyahu's government.\nQadoura Fares, chairman of the Palestinian Prisoners Club, which advocates on behalf of Palestinians in Israeli custody, said the strike would continue and that the proposed law \"will not break the will of prisoners.\"\nHe said \"forced feeding could kill prisoners,\" citing the deaths in 1980 of two Palestinian prisoners whom he said died in an attempt to force-feed them during a hunger strike.\nThe IMA says \"forced medical treatment, including force-feeding is forbidden,\" and that implementing such a measure would violated internationally accepted medical ethics.\nIsrael holds about 5,000 Palestinian prisoners in its jails. Palestinians regard them as heroes in a struggle for statehood. Israel says prisoners involved in attacks against Israelis are terrorists.\nThe legislation now goes to committee for possible amendments before parliament votes on it again.\n- Reuters","url":"https://www.nbcnews.com/news/mideast/israeli-law-force-feed-palestinian-hunger-strikers-gets-initial-nod-n127151"}
