{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 20:57:45","date_modify":"2018-10-30 20:57:45","date_publish":"2017-03-15 08:18:53","description":"Israeli Defense Minister Avigdor Lieberman said Arab List Knesset members suspected of incitement to violence against Jews should leave Israel.","filename":"data/vaneerConsumption/IsraeliDefenseMinisterLiebermanArabMKsSympathetictoTerrorismShouldMovetoAnyFuturePalestinianState.json","image_url":"https://media.breitbart.com/media/2017/02/Avigdor-Lieberman.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_03_15__1540933065.html","title":"Israeli Defense Minister Lieberman: Arab MKs Sympathetic to Terrorism Should Move to Any Future Palestinian State","title_page":"Israeli Defense Minister Lieberman: Arab MKs Sympathetic to Terrorism Should Move to Any Future Palestinian State","title_rss":"NULL","source_domain":"breitbart.com","text":"The Algemeiner reports: JNS.org – Israeli Defense Minister Avigdor Lieberman said Monday that, in any future peace deal with the Palestinians, Arab List Knesset members suspected of incitement to violence against Jews or of harboring terrorist sympathies should leave Israel.\nLieberman posted on his Facebook page, “There is no reason that…[MKs] Ayman Odeh, Bassel Ghattas or Haneen Zoabi will continue to be citizens of Israel.” The defense minister also said the leader of the Islamic Movement in Israel’s Northern Branch, Sheikh Raed Salah, should be expected to emigrate.\nLieberman called population and land swaps the “only way to a sustainable agreement,” and added that it would be unacceptable in a two-state solution for Israel to be a “bi-national state with 22 percent Palestinians” while a “hegemonic Palestinian state will be established, without a single Jew — 100 percent Palestinian.”\nRead more here.","url":"https://www.breitbart.com/middle-east/2017/03/15/israeli-defense-minister-lieberman-arab-mks-sympathetic-terrorism-move-future-palestinian-state/"}
