{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 20:25:01","date_modify":"2018-10-30 20:25:01","date_publish":"2015-07-13 16:56:29","description":"Israel to Arm Some Commercial Jets with Missile-Defense Systems","filename":"data/vaneerConsumption/IsraeltoArmSomeJetswithMissileDefenseSystems.json","image_url":"https://media.breitbart.com/media/2015/07/Missile-Defense-System-Attached-to-Israeli-Jet-Photo-Israeli-Defense-Ministry.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_13__1540931101.html","title":"Israel to Arm Some Jets with Missile-Defense Systems","title_page":"Israel to Arm Some Jets with Missile-Defense Systems","title_rss":"NULL","source_domain":"breitbart.com","text":"Due to the increasing threat coming from rocket strikes from both the Sinai Peninsula and the Gaza Strip, Israel has decided to harness planes bound for its resort city of Eilat with anti-missile defensive systems.\nIsrael’s defense industry will attach the SkyShield missile defense systems to Israeli carriers Arkia and Israir, following an increase in the Islamic State terror group’s presence in the Sinai, Yedioth Ahronoth reported Monday.\nTerror groups have continued to infiltrate the Sinai, with proven success in attacking Egyptian military posts and launching rockets into Israel.\nResearch for the system kicked off shortly after the turn of the century, after Islamic militants in Kenya attempted to take down an Israeli charter jet with surface-to-air missiles in 2002.\nLast year, Eitan Eshel, who was the leader of research and development for the SkyShield system, lauded the defensive measures as “100 percent” accurate in its testing phase.\nSkyShield utilizes thermal and laser technology that acts as a jammer and ultimately redirects the course of an incoming missile, causing the projectile to miss its target, according to its developers. It costs approximately $1 million dollars to install on each plane, according to reports.\nIsrael’s Rafael Advanced Defense Systems claims that SkyShield can also engage “enemy radars in hostile environments providing comprehensive countermeasures against enemy threats.” The system can “operate autonomously, and automatically detecting, collecting, measuring, identifying and engaging radar emitters,” Rafael claims.\nThe Israeli defense industry has invested $76 million dollars in arming commercial jets with SkyShield, the Times of Israel reported Monday.","url":"https://www.breitbart.com/national-security/2015/07/13/israel-to-arm-some-commercial-jets-with-missile-defense-systems/"}
