{"authors":[],"date_download":"2018-10-23 01:19:09","date_modify":"2018-10-23 01:19:09","date_publish":"2016-01-28 15:35:26","description":"An Arab Israeli who killed three people in a January 1 shooting spree in Tel Aviv may have been inspired by the Islamic State jihadist group, the internal se...","filename":"data/vaneerConsumption/IsraeliattackerinspiredbyISofficials.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h11b-2vdWmEltwXfba0ce28e632a328cb-932_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421182_Israeli-attacker-inspired-IS-officials_1540257549.html","title":"Israeli attacker 'inspired by IS': officials","title_page":"Israeli attacker 'inspired by IS': officials | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Israeli attacker 'inspired by IS': officials\nAn Arab Israeli who killed three people in a January 1 shooting spree in Tel Aviv may have been inspired by the Islamic State jihadist group, the internal security agency said Thursday.\nShin Bet released a video and information shedding light for the first time on the motives of Nashaat Melhem, 31, who was shot dead during his arrest after a week on the run.\nHe had previously been described by Israeli authorities only as a \"terrorist\".\nPeople gather at the site where Israeli special forces shot an Arab Israeli, who was wanted for the murder of three people in a Tel Aviv shooting spree, in the northern Arab Israeli city of Arara, on January 8, 2016 ©Jack Guez (AFP/File)\nBefore fleeing Tel Aviv, Melhem hung a banner on a rooftop on which he wrote \"Daesh,\" the Arabic acronym for the Islamic State (IS), and another marked \"There is no god but God and Mohammed is the messenger of God\", the Shin Bet told AFP.\nIt was the first time the agency has explicitly suggested a direct potential link between IS and a specific attack in Israel.\nIn videos shot by Melhem himself, he swears and curses broadly at a range of targets, apparently under the influence of drugs and alcohol.\n\"The language used is similar to that used by the Islamic State and Salafi jihadists,\" Shin Bet said in a statement.\nMelhem used a semi-automatic weapon to kill two Israelis and wound seven others seated at a Tel Aviv bar and neighbouring cafe.\nHe then killed an Arab Israeli taxi-driver as he fled, fearing he would have exposed him.\nHe was shot on January 8 after a week in hiding in his village of Arara, north of Tel Aviv, after opening fire at police who had attempted to arrest him.\nIn the videos, which were found on a phone he lost on the day of the attack, Melhem films himself in what appears to be his village and home at unspecified times before the attack.\nIn the first video, he strolls through the streets wearing glasses and a hoodie drinking beer and talking about smoking hashish.\nIn a later video talking to the camera, he calls on Christians to convert to Islam, while attacking Jews and Shiite Muslims.\nIsrael has so far largely avoided IS-inspired attacks, though around 50 of its citizens have travelled to Syria to fight with Sunni rebels, according to Israeli estimates.\nSeveral Arab Israelis have been arrested on suspicion of links with IS and plans to carry out attacks inspired by the Sunni extremist group.\nThe security services have faced criticism over accusations they missed an opportunity to catch Melhem earlier after dismissing evidence.\nThree men, including two members of Melhem's family, have been charged with helping him to escape, the Shin Bet said.","url":"https://www.dailymail.co.uk/wires/afp/article-3421182/Israeli-attacker-inspired-IS-officials.html"}
