{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 20:57:33","date_modify":"2018-10-30 20:57:33","date_publish":"2017-02-19 12:31:29","description":"A two-state solution to the Israel-Palestinian conflict must include exchanges of people and land, Israeli Def. Min. Avigdor Lieberman said.","filename":"data/vaneerConsumption/IsraelsLiebermanInsistsLandSwapsKeytoTwoStateSolution.json","image_url":"https://media.breitbart.com/media/2017/02/Avigdor-Lieberman.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_02_19__1540933053.html","title":"Israel's Lieberman Insists Land Swaps Key to Two-State Solution","title_page":"Israel's Lieberman Insists Land Swaps Key to Two-State Solution","title_rss":"NULL","source_domain":"breitbart.com","text":"MUNICH (GERMANY) (AFP) – A two-state solution to the Israel-Palestinian conflict must include exchanges of people and land to ensure the two sides are completely separated, Israeli Defence Minister Avigdor Lieberman said on Sunday.\nThe two-state solution has been on the table for years, backed by the United States and other major powers, but peace efforts have stalled and US President Donald Trump recently appeared to put Washington’s commitment in doubt.\nLieberman told the Munich Security Conference he believed the end-game to the conflict involved a two-state solution but not as many people now understood it.\n“I believe that what is necessary for us is to keep the Jewish state,” he told a conference panel.\n“My biggest problem is that today on the table we have a proposal (which) will establish a very homogenic Palestinian state without even one Jew and we will become a bi-national state with more than 20 percent of the population Palestinians,” he said.\n“I think the basic principle of a solution must include (the) exchange of land and population. It does not make sense to create one homogenic Palestinian state and a bi-national state of Israel.”\nThe future of Israel’s growing Arab population is hugely sensitive amid fears it will eventually dilute the Jewish nature of the state.\nLieberman has previously said Arab towns in Israel near the border could be transferred to a future Palestinian state, while Israeli settlements including in the occupied West Bank would become part of Israel.\nThe United Nations in December adopted a resolution that demanded an end to Israeli settlement building, and Lieberman’s proposals have long been criticised.\nBut they have begun to gain some traction as Israeli Prime Minister Benjamin Netanyahu presses the idea of an overall peace settlement based on a deal with moderate Sunni Arab regional powers such as Saudi Arabia in the interests of countering a shared enemy, Shiite Iran.\nLieberman opened his remarks to the conference by saying there were three challenges in the region: “Iran, Iran and Iran.”","url":"https://www.breitbart.com/middle-east/2017/02/19/israels-lieberman-insists-land-swaps-key-two-state-solution/"}
