{"authors":[],"date_download":"2018-10-30 21:11:24","date_modify":"2018-10-30 21:11:24","date_publish":"2016-06-17 13:49:05","description":"As European defence budgets rise in the wake of increased threats, Israeli companies are seeing a boost in sales.","filename":"data/vaneerConsumption/IsraeliFirmsBenefitasEuropeBoostsDefenceSpending.json","image_url":"https://media.breitbart.com/media/2016/02/canvas.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_06_17__1540933884.html","title":"Israeli Firms Benefit as Europe Boosts Defence Spending","title_page":"Israeli Firms Benefit as Europe Boosts Defence Spending","title_rss":"NULL","source_domain":"breitbart.com","text":"NETANYA (ISRAEL) (AFP) – As European defence budgets rise in the wake of increased threats, Israeli companies are seeing a boost in sales, further solidifying the country’s image as an arms industry leader.\nThe increases have come despite, and perhaps partly aided by, Israel’s continuing occupation of Palestinian territory — with Israeli firms themselves highlighting that their products have been tested in conflict.\nEuropean spending on defence and security had remained roughly static in the past decade, but Russia’s annexation of Crimea in 2014, Islamist attacks in France and a wave of refugees from the Middle East have encouraged a spike.\nAcross the continent, defence budgets are expected to increase by 8.3 percent this year, according to a recent report by a group of think tanks including the French Institute for International and Strategic Affairs.\nIsraeli companies, many of which have strong backing from the state, are capitalising by pushing new products.\nTwenty-nine of them displayed technologies this week at the global conference in Paris, one of the world’s largest land defence exhibitions.\nExports to France, which has strongly criticised Israeli settlement building in the occupied West Bank and is overseeing a peace initiative that the Israelis oppose, have spiked.\nIn 2014, the total number of exports of both homeland security and defence technologies from Israel to France amounted to slightly over $150 million, according to the Israel Export Institute.\nThat figure more than doubled to $355 million in 2015, when France was hit by two major jihadist attacks.\nIn 2016, Israel is projected to overtake Italy to become the world’s seventh-largest defence exporter — by far the smallest country in the top 10, according to arms industry analysts IHS Jane’s.\nThere has been a “substantial increase” in European interest in Israeli technologies, said Ran Kril, vice president of international marketing at Elbit Systems, one of the country’s largest weapons companies, with profits of just under $900 million last year.\nThat has come “after long years in which the defence budgets in Europe were declining,” he said.\n– Seeing through trees –\nAt a media exhibition of Elbit’s new technologies last week in the Israeli city of Netanya, products on display included a radar system the company said was first specifically designed to locate people through trees.\nA salesman pitched it as being perfect for European countries seeking to locate migrants hiding in forests.\n“Maybe you are not going to shoot them, but you want to bring the police forces or other means,” he added.\nKril confirmed that Elbit, which provided drones to protect stadiums during the 2014 World Cup in Brazil, was also involved in the ongoing Euro 2016 football tournament in France, though he would not specify how.\nOther Israeli firms, too, are finding increasing interest.\nSaul Gold from AgentVI, which specialises in smarter CCTV technologies, said they had seen a five to 10 percent increase in inquiries in the past six months from northern Europe.\nAmong those they had met with about their systems was Brussels airport, the scene of an April suicide bombing that, along with an attack at a metro station, left 22 people dead.\nGold said European airports were increasingly interested in learning about security measures at Israel’s Ben Gurion Airport, often cited as having the highest security measures globally — though critics allege blatant racial profiling.\n– Israeli edge? –\nThe desire for Israeli technologies can also pose an ethical challenge for European nations that have long criticised its policies towards Palestinians.\nLate last year, the European Union introduced labelling on all products from settlements in the occupied West Bank and Elbit’s 2015 annual report identifies “calls in Europe and elsewhere to reduce trade with Israel” as among the threats to its growth.\nMany of the technologies being sold to Europe are first used in conflict with Palestinians, including the 2014 war with Hamas and other militant groups in Gaza.\nIndeed for companies, this experience is often a major selling point.\n“These countries very much admire the operational experience of these systems,” Kril said.\n“Most of these products and technology are fielded and are bringing results daily. This is very important for the customers, especially the ones that need immediate technology and immediate solutions.”\nGilles Perez of the Israel Export Institute said: “The Israeli edge is where the security ecosystem allows the Israeli companies to have many pilots, many tests at home.”\n“They can test it with the (Israeli military), with the special security forces.”\nSari Bashi, Israel and Palestine director at Human Rights Watch, said during the 2014 Gaza war the watchdog had documented “violations of the rules of war that appear to rise to the level of war crimes in Gaza using some of these weapons.”\n“That kind of field experience is not something I would be proud of,” she added.","url":"https://www.breitbart.com/middle-east/2016/06/17/israeli-firms-benefit-europe-boosts-defence-spending/"}
