{"authors":[],"date_download":"2018-10-30 21:20:48","date_modify":"2018-10-30 21:20:48","date_publish":"2016-07-13 07:03:25","description":"An Israeli from the country's Bedouin Arab minority illegally crossed into Gaza on Tuesday, Israel's military said.","filename":"data/vaneerConsumption/IsraelSaysArabCitizenIllegallyCrossesIntoGazaStrip.json","image_url":"https://media.breitbart.com/media/2016/03/bord-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_07_13__1540934448.html","title":"Israel Says Arab Citizen Illegally Crosses Into Gaza Strip","title_page":"Israel Says Arab Citizen Illegally Crosses Into Gaza Strip","title_rss":"NULL","source_domain":"breitbart.com","text":"An Israeli from the country’s Bedouin Arab minority illegally crossed into Gaza on Tuesday, Israel’s military said, an incident that may affect a proposed prisoner swap with the Palestinian enclave’s Hamas authorities.\nHamas says it is holding two Israeli soldiers whom the army declared dead after they were lost in action in the 2014 Gaza war. The Islamist militant group also says it has two Israeli civilians who previously walked into the fenced-off enclave.\nThe man who entered Gaza on Tuesday was not authorized to do so and was believed to be inside Palestinian territory, a military spokeswoman said. She declined to say how she knew he is a Bedouin Arab citizen, or to elaborate on the incident.\n“This matter is under investigation,” the spokeswoman said.\nPalestinian authorities did not immediately comment, but witnesses in the Gaza Strip reported Israeli spotter aircraft overhead.\nIsraeli officials previously said they sought to recover the two soldiers’ remains and the two civilians held by Hamas, signaling willingness to repeat past amnesties of jailed Palestinians in a trade. Hamas has conditioned any discussion of the four on a preliminary release of detainees by Israel.\nRelatives of the two Israeli civilians who previously entered Gaza, one of whom is Jewish and the other a Bedouin, have described them as suffering from psychological problems.","url":"https://www.breitbart.com/middle-east/2016/07/13/israel-says-arab-citizen-illegally-crosses-gaza-strip/"}
