{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 20:55:24","date_modify":"2018-10-30 20:55:24","date_publish":"2016-09-06 07:16:15","description":"Iran is systematically testing the boundaries of the nuclear deal it struck with the West, and the Obama administration has repeatedly swept this under the carpet, acting as “Iran’s lawyers” instead, a senior Israeli security expert has warned.","filename":"data/vaneerConsumption/IsraeliExpertUSSilentasIranTestsBoundariesofNuclearDeal.json","image_url":"https://media.breitbart.com/media/2016/04/iran-ballistic-missile-program.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_06__1540932924.html","title":"Israeli Expert: U.S. Silent as Iran Tests Boundaries of Nuclear Deal","title_page":"Israeli Expert: U.S. Silent as Iran Tests Boundaries of Nuclear Deal","title_rss":"NULL","source_domain":"breitbart.com","text":"The Jerusalem Post reports: Iran is systematically testing the boundaries of the nuclear deal it struck with the West, and the Obama administration has repeatedly swept this under the carpet, acting as “Iran’s lawyers” instead, a senior Israeli security expert has warned.\nDr. Emily Landau, head of the Arms Control Program at the Tel Aviv-based Institute for National Security Studies, told The Jerusalem Post on Monday that a string of incidents over the past six months has proven that “there is a continued struggle between Iran and the US. It is real, and is here. Iran is continuing to push the envelope, trying to get as much as it can, even within the confines of this deal,” she said, referring to the Joint Comprehensive Plan of Action (JCPOA), which was reached last year.\nThe upcoming elections in the US represent an opportunity for Israel to establish a new dialogue with the next administration to formulate a response to Iran, Landau argued. While the US has stated that Iran is implementing its side of the deal, “Israel can’t be satisfied with that,” Landau said, due to a host of “worrying dynamics and other issues” that Washington is ignoring, as well as the fact that “the JCPOA is tremendously flawed.”\nLandau referred to a report published last week by the Institute for Science and International Security (ISIS), headed by former IAEA inspector David Albright, who has sought to maintain a neutral stance on the Iran nuclear deal, she said.\nRead more here.","url":"https://www.breitbart.com/middle-east/2016/09/06/israeli-expert-u-s-silent-iran-tests-boundaries-nuclear-deal/"}
