{"authors":[],"date_download":"2018-10-30 01:07:50","date_modify":"2018-10-30 01:07:50","date_publish":"2016-12-09 00:00:00","description":null,"filename":"data/vaneerConsumption/IsraelShowsHowtoStopTerrorists.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_12_israel_shows_how_to_stop_terrorists_1540861670.html","title":"Israel Shows How to Stop Terrorists","title_page":"Israel Shows How to Stop Terrorists","title_rss":"NULL","source_domain":"americanthinker.com","text":"Israel Shows How to Stop Terrorists\nBuild a wall, secure the border, and vet Muslims to stop the infiltration of terrorists. This is not Donald Trump speaking – it is what has actually been done in Israel. Americans can take a page from Israel's Border Guard to protect themselves. American Thinker interviewed author Samuel M. Katz regarding his book The Ghost Warriors, about Israel's elite force of undercover operatives. They are drawn from the nation's diverse backgrounds and ethnicities, united in their ability to walk among the enemy as no one else dared. They are called Ya'mas and use many undercover tactics.\nKatz wrote the book to emphasize how \"Israelis learned about using counter-terrorism inside city, street, and neighborhoods. The United States now realizes it is also something they will have to contend with, a struggle of civilizations. The book covers a period of Israeli history and is relevant to Americans because both nations must battle terrorism on a daily basis. It is a warrior's tale of a select group of individuals who accepted the challenge of going daily, nightly into enemy-controlled territory, usually in disguise. The enemy wonders who to trust or where the Israelis are lurking. \"Part of the Border Guards' strategy is to inflict 'terror' on the terrorists. They had to spend just as much time in watching their backs as planning terrorist attacks. Part of the Border Guard's duties is to capture the extremists to ensure the flow of information continues.\" This is something American intelligence experts have been calling for since Obama became president – to capture instead of kill with drones. Katz says the motto of the Border Guards is, \"'We would rather snatch you than scratch you.' You can get a lot more information from the person, their cell phone, or computer than by a missile, drone that goes into the terrorist's house.\" Israelis have a deep respect for \"the Border Guard, which is the paramilitary arm of Israel's national police. They are perhaps the most professional of any of Israel's security element. During the second Intifada operations, the Border Guard fell under the direct command of the military. Now operations must be approved by the Army Chief of Staff.\" Similar to the recent terrorist attacks in America, Katz describes how the terrorists attacking Israelis hid among the civilian population. The Border Guard had separate forces in the different regions: one unit in the West Bank, another in Jerusalem and the surrounding areas, and a third in the Gaza Strip. The key, according to Katz, was \"enlisting the Druze, Bedouins, and Jews whose parents are from Arab nations. They were native Arabic speakers who understood the customs, mind-set nuances, and vulnerabilities of the Palestinians.\" This is something needed in America, where informants can work within the Muslim community to find those who want to bring harm to Americans. Israelis used military, intelligence, technology, and law enforcement for preventive and proactive deterrence. The former was to make sure the jihadists never reached their target, while the latter destroyed the terrorist infrastructure. As in this country, terrorism is done to make people scared and to suffer. They want to make people fear their day-to-day lives. Katz argues that we should be penetrating the mosques. \"Here in the homeland, we can also prevent terrorist attacks if we learn to speak, understand, and communicate, but we limit ourselves because we suffer from the disease of political correctness. Law enforcement needs an understanding of people who live in these neighborhoods and can see the signs of radicalization. This includes understanding what is said in the mosques. After all, terrorism is defeated by intelligence, precision, and lightning-fast action raids.\" The Israeli experience is a valid area for study for those in the U.S. By getting inside the enemies' heads and their areas, more terrorist attacks can be thwarted. The U.S. should stop being blind to these real threats and learn to prevent them by speaking the language, and understanding the culture, through listening, talking, and discussing. The Ghost Warriors is a book that shows a working strategy that can and should be applied to today. The author writes for American Thinker. She has done book reviews and author interviews and has written a number of national security, political, and foreign policy articles.","url":"https://www.americanthinker.com/articles/2016/12/israel_shows_how_to_stop_terrorists.html"}
