{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:03:51","date_modify":"2018-10-30 21:03:51","date_publish":"2016-12-29 15:09:42","description":"TEL AVIV – A member of the Israeli cabinet on Wednesday slammed the countries that supported the anti-settlement resolution at the UN Security Council, saying that Israel was betrayed by the very nations that asked it for assistance in fighting terror. | Israel / Middle East","filename":"data/vaneerConsumption/IsraeliMinisterIsraelBetrayedatUNByCountriesWhereWeHelpedStopTerror.json","image_url":"https://media.breitbart.com/media/2016/12/jkerry.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_12_29__1540933431.html","title":"Israeli Minister: Israel Betrayed at UN By Countries Where We Helped Stop Terror","title_page":"Israeli Minister: Israel Betrayed at UN By Countries Where We Helped Stop Terror | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – A member of the Israeli cabinet on Wednesday slammed the countries that supported the anti-settlement resolution at the UN Security Council, saying that Israel was betrayed by the very nations that asked it for assistance in fighting terror.\n“Countries to which Israel has been providing intelligence to aid them in preventing terrorist attacks on their own soil sat there and voted against us at the UNSC,” Transportation, Intelligence and Atomic Energy Minister Yisrael Katz said.\nSome lawmakers from the opposition defended the resolution, which declares all land captured by Israel in the 1967 defensive war as “occupied Palestinian territory.”\nZionist Union MK Tzipi Livni blasted Prime Minister Benjamin Netanyahu for his harsh response towards countries that supported the resolution, including threats to cease aid and the summoning of 12 ambassadors for reprimand.\n“In the sea of curses that the Netanyahu government is hurling at the world, it is our job to distill the truth,” Livni said. “The entire world is not against the State of Israel, but rather against the settlement policy of the Israeli government. In times of war against enemies, we will stand by the government’s side, but we will not stand beside a government that turns our friends into enemies through its policies.”\nLivni added that in the past, when she was part of negotiations with the Palestinians, the Western Wall was always going to stay within Israel’s sovereign territory.\n“Now with Netanyahu acting [against] the UN, the Western Wall has come up for dispute,” she said.\nLeader of the settler movement Oded Revivi said Secretary of State John Kerry was “disconnected from reality.”\n“John Kerry is a stain on American foreign policy who is ignorant of the issues. He has chosen to eternalize his legacy as the worst secretary of state in history who chose to stab his closest ally in the back while rivers of blood flowed like water across the Middle East. I can personally attest to the fact that he knows very little about the realities in Judea and Samaria [i.e. the West Bank] and instead chooses to defame us from afar by repeating fictitious mantras against us.”\n“Our rights to this land are fully legal and cannot be refuted; this is the reason that proclamations are being made instead providing solid legal arguments against us. Nearly half a million Israelis currently reside on the strategic highlands of Judea and Samaria overlooking 70 percent of Israel’s population and industrial base; no amount of speeches or resolutions can reverse this reality,” he added.\nKerry delivered a speech on Wednesday outlining his vision for a Palestinian state based on the 1967 lines.\nDeputy Foreign Minister Tzipi Hotovely said Kerry’s parameters were unrealistic.\n“The formula proposed by Secretary Kerry is impossible and does not correspond with reality. For 25 years Israel tried similar formulae but instead of peace we got islands of terror,” she said.","url":"https://www.breitbart.com/middle-east/2016/12/29/israeli-minister-the-un-resolution-was-what-we-got-in-return-for-helping-countries-stop-terror/"}
