{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:45:32","date_modify":"2018-10-30 19:45:32","date_publish":"2015-08-25 19:09:17","description":"An unnamed IDF senior Israeli official claims Israel is \"more ready than ever\" to strike Iran's nuclear facilities.","filename":"data/vaneerConsumption/IsraelMoreReadyThanEvertoStrikeIransNukeSites.json","image_url":"https://media.breitbart.com/media/2014/12/israeli_jet_reuters-e1449418014363.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_08_25__1540928732.html","title":"Israel 'More Ready Than Ever' to Strike Iran's Nuke Sites","title_page":"Israel 'More Ready Than Ever' to Strike Iran's Nuke Sites","title_rss":"NULL","source_domain":"breitbart.com","text":"A senior Israel Defense Forces (IDF) official said late Monday that the Jewish state is more prepared than it has ever been to strike Iran’s nuclear sites if called upon.\n“Every year that passes, the IDF improves,” the unnamed senior official told Israel’s Walla news, according to a translation provided by The Times of Israel.\nThe official spoke to Israel’s increasing qualitative capabilities. “We never stand still. The professional level increases. In the coming year we will receive another submarine, F-35 fighter jets and other platforms. Intelligence is improving as well,” he added, while also mentioning that Israel’s defensive apparatus continues to improve.\nThe Walla news report mentioned that Israel would not likely strike Iran’s facilities unless a major geopolitical development, such as Iran’s thwarting its recent agreement and making the sprint towards developing a nuclear weapon, had forced Jerusalem to take preemptive measures.\nIn related news, Iran’s intelligence minister claimed Monday that Israel, the U.S. and the UK continue to attempt to overthrow the regime in Tehran.\n“The intelligence services of the U.S., Israel, Mossad, MI6 and certain regional states are making attempts to challenge the Islamic Republic’s security,” the intel chief told state-run Fars News Monday.\nIran continues to pursue a policy that openly seeks the destruction of the Jewish state.\nOn Tuesday, a senior Iranian official told Tehran state-media, “Our positions against the usurper Zionist (Israel) regime have not changed at all; Israel should be annihilated and this is our ultimate slogan.”\nMoreover, Iran’s “Supreme Leader,” Ali Khamenei, who has ultimate authority in the country, has called for the Muslim world to “unite and destroy Israel.”\nLast month, Khamenei said:","url":"https://www.breitbart.com/national-security/2015/08/25/israel-more-ready-than-ever-to-destroy-iranian-nuclear-facilities/"}
