{"authors":[],"date_download":"2018-10-22 20:49:29","date_modify":"2018-10-22 20:49:29","date_publish":"2014-06-03 07:24:10","description":"Fatah identified the man as Alaa Odeh, a mobile phone shop owner, and along with relatives accused soldiers of killing him in cold blood.","filename":"data/vaneerConsumption/IsraelTroopsKillPalestinianGunmanatWestBankCheckpoint.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/483171/140603-idf-gun-4a_af9775edf3a418c42ddab4bbab75b109.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_mideast_israel-troops-kill-palestinian-gunman-west-bank-checkpoint-n120976_1540241369.html","title":"Israel: Troops Kill Palestinian Gunman at West Bank Checkpoint","title_page":"Israel: Troops Kill Palestinian Gunman at West Bank Checkpoint","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nRAMALLAH West Bank - Israeli troops on Tuesday shot dead a Palestinian who the military said had opened fire and wounded a soldier at a checkpoint in the occupied West Bank.\nThe Palestinian mainstream Fatah group identified the man as Alaa Odeh, a 30-year-old mobile phone shop owner, and along with relatives accused soldiers of killing him in cold blood.\nIn a statement, the military said \"a Palestinian gunman opened fire and wounded a border policemen, and the force returned fire, killing the perpetrator.\"\nIt posted on Twitter a photograph of a pistol on the ground and said the attacker had fired six shots. Odeh's family was quoted as saying in media reports that he was at the checkpoint awaiting a delivery of phones.\nThe night-time incident came hours after Palestinian President Mahmoud Abbas swore in a new unity government, healing a rift with Hamas Islamists in Gaza, and raising tensions with Israel.\nThe shooting occurred at the same checkpoint where troops, four days ago, arrested a Palestinian who the military said was wearing an explosives belt.\nU.S.-led peace talks between the Israelis and Palestinians collapsed in April and some analysts have warned of a possible spike in violence given the lack of any clear way forward to resolve the generations-old conflict.\n- Reuters","url":"https://www.nbcnews.com/news/mideast/israel-troops-kill-palestinian-gunman-west-bank-checkpoint-n120976"}
