{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 20:29:57","date_modify":"2018-10-30 20:29:57","date_publish":"2015-07-03 13:15:11","description":"Israel has closed border crossings into Egypt and shut off a highway running along the border. This follows a wave of attacks by ISIS in Egypt which have |","filename":"data/vaneerConsumption/IsraelClosesEgyptianBorderCountryonHighAlertAfterISISClashesinSinai.json","image_url":"https://media.breitbart.com/media/2015/07/GettyImages-479229912-1024x713.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_03__1540931397.html","title":"Israel Closes Egyptian Border, Country on High Alert After ISIS Clashes in Sinai","title_page":"Israel Closes Egyptian Border, Country on High Alert After ISIS Clashes in Sinai | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Israel has closed border crossings into Egypt and shut off a highway running along the border. This follows a wave of attacks by ISIS in Egypt which have been described as “full-fledged war”. Hamas is believed to be working with the jihadist insurgents.\nAs the world mourned the victims of the terrorist atrocities in France, Tunisia and Kuwait which between them claimed dozens of lives, Egypt was fighting its own battles with a home-grown ISIS insurgent group known as “Sinai Province”.\nOn Monday, the Egyptian state prosecutor Hisham Barakat was killed when a car bomb detonated as his motorcade made its way from the Misr al-Jadida quarter of Cairo to his office. A number of Barakat’s security personnel and passers-by were injured, and 30 cars damaged in the blast, the first in many years to successfully claim the life of a senior official, according to Haaretz.\nThen on Wednesday, Sinai Province unleashed a wave of attacks on towns all along the coast, including Rafah on the Gaza border, Sheikh Zuweid and El-Arish. There are conflicting reports on the numbers of casualties; The Guardian reported a source in the Egyptian army putting the death toll at 17 soldiers and 100 militants, although both figures are likely to have been massaged for PR purposes. The paper notes that others have estimated the military’s death toll at around 30, while Haaretz puts the total death toll at at least 50.\nA spokesman for the Egyptian military, Mohammed Samir Abdelaziz Ghaneem posted to his Facebook page: “70 terrorists attacked 5 checkpoints simultaneously in North Sinai.” The jihadists appear to be adopting techniques used in Syria and Iraq by ISIS, in which towns are laid siege to and overtaken, allowing the group to then lay claim to the surrounding villages and rural areas.\nHaaretz said that the battles have gone further than mere insurgency, noting: “the fighting raging in Sinai since Wednesday has crossed the line between combating “terror cells” and turned into a full-fledged war. This is a war on many fronts – similar to the war waged in Iraq against Islamic State (also known as ISIS or ISIL). Some of this war is taking place in the big cities like Cairo, Faiyum, El Arish and Rafah; and some in open areas. It’s like a war against a foreign enemy, although most of the enemy consists of Egyptian citizens.”\nMost of Wednesday’s fighting was based around Sheikh Zuweid on the Mediterranean coast, where all military posts were hit simultaneously. Security forces have reported that the attack was repelled, but other sources have said that the town has already been taken over, and that militants have been lining the roads approaching the town with bombs in order to deter Egyptian forces attempting to regain control.\nEl Arish may also have come under ISIS control. If they are being run by Sinai Province, the region is likely to witness the sorts of severe punishments for infringement of religious rules already witnessed in Islamic State territory.\nOne of the attacks near the town of Rafah took place just four kilometres from Israel, prompting the Israeli government to close off two checkpoints along the border and also the closure of Israel’s Highway 12, which runs along the length of the border between Israel and Egypt.\nYesterday an Israeli general told Al Jezeera that Hamas is working with Sinai Province, and had provided the group with weapons and logistical support, even smuggling wounded fighters across the border for medical treatment. The group is also noted to be using sophisticated weaponry, including Russian-made missiles.\nIsrael has “clear information that Hamas is supporting the Wilayat Sinai, which belongs to Daesh,” claimed Maj. Gen. Yoav Mordechai, referring to ISIS by their Arabic acronym. “I am confident in this [information] and I have proof,” he added.\nAn Egyptian source has said that if the ISIS affiliated group comes near to invading Gaza, President Abdel-Fattah al-Sissi may “invite” the Israel Defense Forces to act against it. This would not be seen as being in breach of any agreements, as Gaza is considered Israel’s problem.\n“The two armies may already be coordinating in preparation for such a possibility,” the source told Haaretz. “The Egyptian problem is that a military campaign inside Gaza could lead to breaking down the fences and a mass flight of civilians from Gaza to Sinai.”\nAccording to that paper, ISIS in Syria released a video this week threatening to destroy Hamas and install a religious government like that currently running Islamic State territory. That would pose serious questions for both the Israeli government and the US as her foremost ally.","url":"https://www.breitbart.com/national-security/2015/07/03/israel-closes-egyptian-border-country-on-high-alert-following-isis-clashes-in-sinai/"}
