{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:46:50","date_modify":"2018-10-30 19:46:50","date_publish":"2015-04-02 19:59:44","description":"Israeli officials have condemned the basic nuclear framework reached by the P5+1 world powers and Iran, calling the deal one that is “detached from wretched reality.” |","filename":"data/vaneerConsumption/IsraelObamasIranDealDetachedFromWretchedReality.json","image_url":"https://media.breitbart.com/media/2015/02/netanyahu-serious-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_02__1540928810.html","title":"Israel: Obama's Iran Deal ‘Detached From Wretched Reality’","title_page":"Israel: Obama's Iran Deal ‘Detached From Wretched Reality’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Israeli officials have condemned the basic nuclear framework reached by the P5+1 world powers and Iran, calling the deal one that is “detached from wretched reality.”\nOn Thursday, negotiating parties revealed that they had struck a basic framework for an accord that capitulated to most of Iran’s initial demands. In the deal “fact sheet,” the State Department agrees to lift sanctions against Iran in exchange for a promise not to enrich uranium over a certain level.\nThe State Department memo reveals that U.S. officials believe Iran is only 2 to 3 months away from making enough material for a nuclear weapon. It remains unclear how fast officials would be able to determine that Iran has violated its agreement if the regime proceeds to race towards nuclear weapons development.\n“The smiles in Lausanne are detached from wretched reality in which Iran refuses to make any concessions on the nuclear issue and continues to threaten Israel and all other countries in the Middle East,” said Israeli Minister Yuval Steinitz. “We will continue with our efforts to explain and persuade the world in hopes of preventing a bad (final) agreement,” he added.\nIsraeli Prime Minister Benjamin Netanyahu said in a statement on Thursday that he hoped world powers would try to “significantly roll back Iran’s nuclear capabilities.”\n“One cannot understand that when forces supported by Iran continue to conquer more ground in Yemen, in Lausanne they are closing their eyes to this aggression,” said Netanyahu. “But we are not closing our eyes and we will continue to act against every threat in every generation, certainly in this generation,” he added.\nPresident Obama has welcomed the nuclear accord with Iran, calling it a “historic” deal that would prevent Iran from attaining a nuclear weapon. Obama said the deal will “cut off every path” for Iran to get the bomb.\nMr. Obama seemed to openly question the Israeli Prime Minister’s motivations on Iran, stating, “If in fact Prime Minister Netanyahu is looking for the most effective way to ensure Iran doesn’t get a nuclear weapon, this is the best option.”","url":"https://www.breitbart.com/national-security/2015/04/02/israel-obamas-iran-deal-detached-from-wretched-reality/"}
