{"authors":[],"date_download":"2018-10-22 21:57:49","date_modify":"2018-10-22 21:57:49","date_publish":"2014-06-06 14:21:34","description":"Personal stories from Israeli soldiers enforcing the occupied territories have been shared in a project celebrating its 10th anniversary this week.","filename":"data/vaneerConsumption/IsraeliSoldiersBreakSilenceWithTalesofWestBankOccupation.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/491861/140606-baruch-israel-soldier-02_f201df873cec0ce31f57ef9f8d6301d4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_israeli-soldiers-break-silence-tales-west-bank-occupation-n124471_1540245469.html","title":"Israeli Soldiers Break Silence With Tales of West Bank Occupation","title_page":"Israeli Soldiers Break Silence With Tales of West Bank Occupation","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBefore he became a paratrooper in the Israeli army, Avner Gvaryahu saw himself as a good person.\n“I was raised in a family and in a society, in a country that educated me to be good and to help people around me, and to not look the other way when you see someone suffering,” the 29-year-old said.\nAll that changed when he had to enforce Israel’s occupation of territory the country captured in the 1967 war with Egypt, Jordan and Syria.\n\"By definition, our job is to spoil the party. It is our job to remind everyone that even though Tel Aviv is very nice and beautiful and normal, so to speak, there is also a Hebron in our country.”\n“Suddenly I was ‘that’ figure, that it was enough for me to enter a Palestinian home, and little children peed in their pants in fear,” Gvaryahu told NBC News.\nThat realization changed him forever.\nNow Gvaryahu is one the driving forces behind Breaking the Silence, a human rights organization made up of combat veterans that has collected nearly 1,000 testimonials from soldiers and vets on the occupation and military actions in the West Bank and Gaza Strip. It also conducts tours of the West Bank, including Hebron, a Palestinian city that has been a frequent flash point for violence.\nBreaking the Silence marked its 10-year anniversary on Friday by the public reading of testimonials in Tel Aviv. And for the first time, they have begun publishing video clips, shot by troops themselves, showing different aspects of the 47-year occupation.\nThe organization was born in 2004 when Yehuda Shaul and 64 members of his unit, fresh from fulfilling their national service, held an exhibit showcasing their testimonies in a Tel Aviv gallery.\n“The response was crazy. Thousands came to see the exhibit in the three weeks it was on. People were shocked by our stories,” said Shaul, 31-year-old an observant Jew from a politically conservative family.\n“We kept getting into the realization that people back home had no clue about what we were doing. “So we decided to bring Hebron to Tel Aviv.”\nA decade later, the group's personal accounts -- sometimes banal, occasionally harrowing -- have garnered stark criticism.\n\"They are breaking their silence about the only democracy in the Middle East that has an independent legal system and an investigative press that does not cease dealing with these issues,\" Israeli Prime Minister Benjamin Netanyahu told reporters in one of his sharpest attacks on the group in 2009. \"There is no silence to break -- what are they talking about?\"\nBut while Breaking the Silence has come under fire from those who think them disloyal, the veterans’ personal stories garner widespread respect in a country where almost everyone serves in the military.\nOne such account tells of a 11-year-old Palestinian boy killed by an Israeli sniper.","url":"https://www.nbcnews.com/news/world/israeli-soldiers-break-silence-tales-west-bank-occupation-n124471"}
