{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 20:11:33","date_modify":"2018-10-30 20:11:33","date_publish":"2018-07-28 01:33:06","description":"Israel confirms President Donald Trump asked for a Turkish woman's release as part of a deal to free Pastor Andrew Brunson.","filename":"data/vaneerConsumption/IsraelConfirmsTrumpHelpedwithTurkishDetaineesReleasetoFreePastorBrunson.json","image_url":"https://media.breitbart.com/media/2018/07/ebru-ozkan-andrew-brunson-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_07_27__1540930293.html","title":"Israel Confirms Trump Helped with Turkish Detainee's Release to Free Pastor Brunson","title_page":"Israel Confirms Trump Helped with Turkish Detainee's Release to Free Pastor Brunson","title_rss":"NULL","source_domain":"breitbart.com","text":"Israel on Friday confirmed U.S. media reports that President Donald Trump asked Israeli Prime Minister Benjamin Netanyahu during a July 14 phone call to release Ebru Özkan, a Turkish woman accused of Hamas ties, in exchange for Turkey’s release of imprisoned American Pastor Andrew Brunson, who has been detained on terror and espionage charge. Turkey had denied these reports.\n“I can confirm that there was such a request by President Trump,” an Israeli official said on condition of anonymity, according to Reuters.\nÖzkan, who was arrested on July 8 for smuggling money and goods to Hamas during a trip to Israel, was released from Israel on July 16, two days after President Trump’s phone call.\nUpon arriving in Istanbul, Özkan reportedly thanked Turkish President Recep Tayyip Erdoğan for being “kind enough to be very interested in my case.”\nHowever, Brunson remains, languishing in a Turkish prison cell and Ankara said it had not agreed to any prisoner swap.\n“Those reports are completely baseless,” a senior Turkish official reportedly said. “The Turkish government has no intention of meddling in the affairs of the country’s independent judiciary.” The same official reportedly claimed that Ozkan is being held by Israel on “bogus terrorism charges.”\nErdoğan has reportedly linked Brunson’s fate with that of exiled, United States-based Muslim cleric Fethullah Gulen, who has been accused of coordinating a failed military coup against the country’s leadership. Gulen denies the allegations, and the United States has denied Turkish demands to extradite Gulen to Turkey.\nOn Thursday, President Trump threatened “impost significant sanctions” on Turkey if they do not release Brunson immediately.\n“The United States will impose large sanctions on Turkey for their longtime detainment of Pastor Andrew Brunson, a great Christian, family man, and wonderful human being,” Trump tweeted. “He is suffering greatly. This innocent man of faith should be released immediately!”\nA spokesman for Erdoğan responded by saying Trump’s threats were unacceptable and damaging to the U.S.-Turkey alliance.\nThe United States will impose large sanctions on Turkey for their long time detainment of Pastor Andrew Brunson, a great Christian, family man and wonderful human being. He is suffering greatly. This innocent man of faith should be released immediately! — Donald J. Trump (@realDonaldTrump) July 26, 2018\nA spokesman for Erdoğan reportedly responded to Trump’s threats saying they were unacceptable and damaging to the U.S.-Turkey alliance.\nAdelle Nazarian is a politics and national security reporter for Breitbart News. Follow her on Facebook and Twitter.","url":"https://www.breitbart.com/national-security/2018/07/27/israel-confirms-turkey-denies-trump-helped-with-turkish-detainees-release-as-part-of-deal-to-free-pastor-brunson/"}
