{"authors":["Aaron Klein"],"date_download":"2018-10-30 21:06:25","date_modify":"2018-10-30 21:06:25","date_publish":"2016-07-13 17:40:24","description":"Members of Prime Minister Benjamin Netanyahu’s ruling Likud party reacted harshly to the involvement of a State Department-financed nonprofit in efforts | Israel / Middle East","filename":"data/vaneerConsumption/IsraeliLawmakersFumeOverObamaAdministrationInterventiontoDefeatNetanyahu.json","image_url":"https://media.breitbart.com/media/2016/07/US-department-of-state-building.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_07_13__1540933585.html","title":"Israeli Lawmakers Fume Over Obama Administration ‘Intervention’ to Defeat Netanyahu","title_page":"Israeli Lawmakers Fume Over Obama Administration ‘Intervention’ to Defeat Netanyahu | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Members of Prime Minister Benjamin Netanyahu’s ruling Likud party reacted harshly to the involvement of a State Department-financed nonprofit in efforts to defeat Netanyahu during last year’s elections.\nThe Senate on Wednesday found that the State Department provided more than $300,000 in funds to the nonprofit OneVoice “to support peace negotiations between Israel and Palestine over a 14-month grant period ending in November 2014.”\nOneVoice in turn supported and financed V15, short for Victory 2015, an activist movement that worked to defeat Netanyahu during last year’s election.\nV15’s strategy room was based out of OneVoice’s Tel Aviv office space, a headquarters visited by this reporter during the height of last year’s controversy surrounding the initial disclose of the State financing to One Voice.\nThe Senate’s investigation did not find evidence that any U.S. government monies were directly utilized by OneVoice to influence the elections. However, as JTA pointed out, OneVoice utilized “campaign infrastructure and resources built, in part, with State Department grants funds to support V15” during the election season.\nThe Times of Israel reports on Likud lawmakers’ reactions:\nZe’ev Elkin, Likud’s minister of Jerusalem affairs, slammed the “callous intervention in the Israeli democratic process, which only proves the necessity for transparency laws for foreign state funding of political organizations.” He added: “The people in Israel choose a government that will look after the national and security interests of the citizens of the State of Israel, and not to carry out the dangerous plans that foreign states are trying to arrange for us.” The inquiry findings “prove conclusively that there was a crude, clear intervention from the US State Department in the internal affairs of Israel,” MK Yoav Kisch (Likud) said in a statement. “This is scandalous, a callous attempt to replace the government of Israel through funding from the US government.”\nOneVoice allegedly previously deleted the State Department’s logo from the list of “partners” on its website.\nAfter the controversy first erupted last year, this reporter took the below snapshot in February 2015 of OneVoice’s website, which showed the U.S. Department of State, replete with a logo, listed as a “partner” of the movement.\nInternet Archive’s Wayback Machine also has a cache image taken in 2014 showing the State Department listed on the same “partner” page.\nOneVoice is also openly partnered with Google, the U.K. Labour Party and the Rockefeller Brothers Fund.\nThis is not the only alleged scrubbing of the State-OneVoice relationship.\nThe Free Beacon reported on Tuesday that, according to the Senate inquiry, a State Department official deleted emails that included information about the campaign to defeat Netanyahu.\nReported the Free Beacon:\nA senior State Department official admitted to congressional investigators that he deleted several emails pertaining to the administration’s coordination with OneVoice.\n“The State Department was unable to produce all documents responsive to the Subcommittee’s requests due to its failure to retain complete email records of Michael Ratney, who served as U.S. Consul General in Jerusalem during the award and oversight of the OneVoice grants,” the report states.\nInvestigators “discovered this retention problem because one important email exchange between OneVoice and Mr. Ratney … was produced to the Subcommittee only by OneVoice,” the report continues. “After conducting additional searches, the Department informed the Subcommittee that it was unable to locate any responsive emails from Mr. Ratney’s inbox or sent mail.”\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.","url":"https://www.breitbart.com/middle-east/2016/07/13/israeli-lawmakers-fume-obama-administration-intervention-defeat-netanyahu/"}
