{"authors":[],"date_download":"2018-10-30 21:18:40","date_modify":"2018-10-30 21:18:40","date_publish":"2016-01-21 10:37:55","description":"Israel has charged five Palestinians who it says were being recruited by Hezbollah to monitor Israel's military activity and carry out a suicide attack","filename":"data/vaneerConsumption/IsraelChargesPalestiniansitSaysWereRecruitedbyHezbollah.json","image_url":"https://media.breitbart.com/media/2015/11/Lebanon-Hezbollah-members-with-flags-Reuters-e1451077642611.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_01_21__1540934320.html","title":"Israel Charges Palestinians it Says Were Recruited by Hezbollah","title_page":"Israel Charges Palestinians it Says Were Recruited by Hezbollah","title_rss":"NULL","source_domain":"breitbart.com","text":"Israel has charged five Palestinians who it says were being recruited and funded by powerful Lebanese faction Hezbollah to monitor Israel’s military activity and carry out a suicide attack, police said on Wednesday.\nSuicide bombings were frequently mounted by Palestinian militants against Israel during a 2000-2005 uprising but are now rare. Hezbollah usually does not comment on such cases and officials at their offices in Beirut were not immediately available for comment.\nPolice spokeswoman Luba Samri said the cell leader, Mahmoud Zaaloul, from the West Bank town of Tulkarm, was contacted and instructed by Jawwad Nasrallah, the son of Iran-backed Hezbollah head Sayyed Hassan Nasrallah, via e-mail.\nShe said the cell, which had been wired $5,000 to begin their activities, were instructed to recruit suicide bombers and prepare explosive belts, monitor Israeli military activities in their area and buy weapons.\nTwo of the five charged have previously been jailed in Israel. They will all stand trial in a military court.\nSamri said Hezbollah’s attempt to plan an attack “was most unusual” and that the group appeared to be trying to take advantage of the Palestinian population and “entice young assailants with money while they kept a low profile”.\nIsrael and Hezbollah guerrillas fought a 34-day war in 2006 in which 1,200 people in Lebanon, most of them civilians, were killed, according to the United Nations. Hezbollah killed 160 Israelis, most of them soldiers, within Lebanese territory.\nThere have been no large scale confrontations since, but there are intermittent skirmishes along the 80 km (50-mile) frontier and Israel keeps a close eye on Hezbollah activity in Syria.","url":"https://www.breitbart.com/middle-east/2016/01/21/israel-charges-palestinians-it-says-were-recruited-by-hezbollah/"}
