{"authors":[],"date_download":"2018-10-30 20:48:00","date_modify":"2018-10-30 20:48:00","date_publish":"2015-07-13 17:46:30","description":"JERUSALEM (AP) — Israel's prime minister opened a Twitter account in Farsi on Monday, seeking to reach out to the Iranian public as world powers were |","filename":"data/vaneerConsumption/IsraeliPMLaunchesTwitterAccountForIranians.json","image_url":"https://media.breitbart.com/media/2015/07/Netanyahu-glare-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_13__1540932480.html","title":"Israeli PM Launches Twitter Account For Iranians","title_page":"Israeli PM Launches Twitter Account For Iranians | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"JERUSALEM (AP) — Israel’s prime minister opened a Twitter account in Farsi on Monday, seeking to reach out to the Iranian public as world powers were getting closer to a nuclear deal with the Islamic Republic.\nBenjamin Netanyahu strongly opposes the emerging deal, and he used his inaugural tweet to criticize it and what he described as Iranian hypocrisy.\nHis first tweet included an image of Iranian President Hassan Rouhani and said Supreme Leader Ayatollah Ali Khamenei “has said Iran should fight the U.S. regardless of the agreement, while Rouhani leads demonstrations expressing hatred.”\nNetanyahu’s office said the Farsi account will publish content similar to his English and Hebrew accounts to engage the Iranian people directly. Netanyahu has a popular following on Twitter and often tweets videos and photos with messages critical of the Iranian government and nuclear negotiations.\nMeir Javedanfar, an Iranian-born Israeli analyst, said Netanyahu’s aggressive rhetoric could backfire with his Iranian audience.\n“I’m worried … Netanyahu is going to cause more damage if he continues with the same messages,” he said.\nThe account quickly gained more than 600 followers, with many users mocking him and saying there was a grammatical mistake.\nTwitter, Facebook, and other popular social media sites are technically banned in Iran but Iranians are active on Twitter through proxy servers.\nKey leaders, including Khameini, Rouhani, and Foreign Minister Jared Zarif, all have large followings and tweet official statements.\nNetanyahu’s office said it has not decided whether to interact with politicians on the new Twitter feed.\nNetanyahu has lobbied against the emerging deal, saying it would leave too much of Iran’s nuclear infrastructure intact. On Monday, he complained in Jerusalem that world powers are ready to make an agreement “at any price.”\nEarlier Monday, Israeli Defense Minister Moshe Yaalon said the deal with Iran will force the Jewish state to “defend itself, by itself.”\nYaalon said Israel’s assumption was that a “bad nuclear deal” was imminent — one that would not succeed in closing a single reactor or destroy a single centrifuge in Iran.","url":"https://www.breitbart.com/national-security/2015/07/13/israeli-pm-launches-twitter-account-for-iranians/"}
