{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:12:36","date_modify":"2018-10-30 21:12:36","date_publish":"2016-01-18 13:30:18","description":"An Israeli minister blasted the European Union for its threats and boycotts against Israel, saying that no EU decision will \"remove us from our land.","filename":"data/vaneerConsumption/IsraeliMinisterTellsEUYourThreatsDoNotImpressOrFrightenUs.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_01_18__1540933956.html","title":"Israeli Minister Tells EU: Your Threats Do Not Impress Or Frighten Us","title_page":"Israeli Minister Tells EU: Your Threats Do Not Impress Or Frighten Us | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV — An Israeli minister blasted the European Union for its threats and boycotts against Israel, saying that no EU decision will “remove us from our land,” the Jerusalem Post reported.\nSpeaking at a ribbon-cutting ceremony for a new heritage center in the West Bank city of Ariel on Sunday, Science, Space, and Technology Minister Ophir Akunis sent a message to the EU ahead of a meeting in Brussels on Monday, at which the EU Foreign Affairs Council is expected to debate additional steps against settlements in Judea and Samaria such as Ariel.\n“I want to send the EU ministers a message from here, the city of Ariel. No step or decision that you take will remove us from our land,” said Akunis. “Do not lecture or threaten us; this does not impress or frighten us. Do not label or boycott us; you already did that.”\n“Learn from history and be embarrassed,” he added.\n“We are in Ariel, in Judea and Samaria, in the Negev and the Galilee, and we are here to stay,” Akunis continued. He added that those who want to destroy the city located in the heart of Samaria will not succeed.\nThe heritage center was dedicated to the former mayor of Ariel, Ron Nachman, who held the post until his death in January 2013 from cancer.\nNachman was one of Ariel’s founders and a great believer in the Jewish people’s right to settle the West Bank.\n“He was the embodiment of the prosaic phrase, he could move mountains. He did it on a daily basis,” Akunis said at the ceremony.\nEven while undergoing chemotherapy, Nachman never stopped working for his city.\n“The city of Ariel was his great love and pride,” said Akunis. “There are not that many people about whom you can say, he built a city with his own hands.”","url":"https://www.breitbart.com/middle-east/2016/01/18/israeli-minister-to-eu-your-threats-do-not-impress-or-righten-us/"}
