{"authors":["Associated Press"],"date_download":"2018-10-23 02:00:37","date_modify":"2018-10-23 02:00:37","date_publish":"2017-03-16 12:14:17","description":"JERUSALEM (AP) - Israel declared the Palestine Liberation Organization's main financial body a terrorist organization on Thursday, infuriating the...","filename":"data/vaneerConsumption/IsraelblacklistsPalestinianfundasUSenvoyvisits.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319948_Netanyahu-vows-new-settlement-ahead-meeting-US-envoy_1540260037.html","title":"Israel blacklists Palestinian fund as US envoy visits","title_page":"Israel blacklists Palestinian fund as US envoy visits | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"JERUSALEM (AP) - Israel declared the Palestine Liberation Organization's main financial body a terrorist organization on Thursday, infuriating the Palestinians as U.S. President Donald Trump's envoy wrapped up his first visit to the region.\nThe fund makes monthly payments to about 35,000 families of Palestinians killed and wounded in its long-running conflict with Israel, including suicide bombers and other militants who targeted civilians and soldiers.\n\"The decision to declare the fund a terrorist organization stems from its continuing and ongoing activity in providing massive support for elements responsible for committing severe acts of terrorism against Israel,\" Defense Minister Avigdor Lieberman said.\n\"As of today, all necessary actions will be taken in Israel and overseas in order to seize and confiscate property and assets designated for, or belonging to, the fund,\" he added.\nThe Palestinian National Fund's main offices are in Jordan, and it was not immediately clear how the measures would be implemented.\nPalestinian President Mahmoud Abbas condemned the move, which came after U.S. envoy Jason Greenblatt wrapped up several days of meetings with both sides aimed at reviving the peace process, which last collapsed in 2014.\nAbbas called it \"an Israeli attempt to obstruct and sabotage U.S efforts\" to relaunch peace talks. He said it is a \"fundamental violation\" of interim agreements signed between the PLO and Israel two decades ago, and called on \"all countries of the world to reject this declaration to preserve the agreement.\"\nThe \"martyrs' fund\" was set up in 1967 by the Palestine Liberation Organization, the group that formally represents all Palestinians. It and another fund supporting families of Palestinians imprisoned by Israel are nominally PLO institutions, but are funded by the Western-backed Palestinian Authority, which governs parts of the West Bank.\nThe fund for families of several thousand Palestinians held for alleged anti-Israeli activities, from stone-throwing to shooting attacks and bombings, had a 2016 budget of $125 million, according to the website of the Palestinian Authority's Finance Ministry.\nIsrael argues that such stipends promote violence, and stepped up a campaign against the fund after a wave of Palestinian attacks began in September 2015. The stabbing, shooting and vehicular attacks were a near-daily occurrence for several months, but have subsided recently.\nEarlier Thursday, Israeli Prime Minister Benjamin Netanyahu met with U.S. envoy Jason Greenblatt for a second time this week to try to reach an agreement on settlements, one of the most contentious issues in decades-old peace efforts.\nThe Israeli leader said they \"made progress on the issue of Israeli settlement construction\" and \"discussed concrete measures that could help support and advance Palestinian economic development,\" without providing further details.\nNetanyahu had earlier vowed to keep a promise to build the first new official West Bank settlement in two decades, to replace an illegal settlement outpost that was dismantled last month following an Israeli Supreme Court ruling.\nThe Palestinians view the building of settlements on land they want for their future state as one of the main obstacles to peace, a position largely supported by the international community.\nTrump voiced support for Israel's position on the campaign trail but has since asked it to hold off on settlement construction as he seeks to restart the peace process.\nGreenblatt also met with the chief foreign envoy of the Yesha council, which represents the settlements. The council said it was a \"fruitful and positive\" meeting, without providing details.\nTrump campaigned on promises that he would depart from decades of U.S. foreign policy on the Israeli-Palestinian conflict.\nHis platform made no mention of Palestinian statehood, a key goal of U.S. and international diplomacy for more than two decades, and he vowed to move the U.S. Embassy from Tel Aviv to disputed Jerusalem.\nHowever, he seems to have backed off on both since assuming office. In an interview with an Israeli newspaper last month, Trump said settlements \"don't help\" promote peace. Several days later, he told Netanyahu at the White House that he would like to see Israel \"hold back\" its settlement construction. Plans to move the embassy appear to have been put on hold.\nThe international community views settlements built in the West Bank and east Jerusalem - territories captured by Israel during the 1967 war and claimed by the Palestinians as part of their future state - as illegal.\nIsrael says the issue of settlements should be resolved along with other core disputes in direct peace negotiations with the Palestinians.","url":"https://www.dailymail.co.uk/wires/ap/article-4319948/Netanyahu-vows-new-settlement-ahead-meeting-US-envoy.html"}
