{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:45:48","date_modify":"2018-10-30 19:45:48","date_publish":"2015-04-07 21:59:19","description":"Israel Strategic Affairs Minister Yuval Steinitz said Tuesday that President Barack Obama’s promise to have Israel’s back is meaningless if he allows Iran to procure a nuclear weapon.","filename":"data/vaneerConsumption/IsraelIfIranGetsNukeObamaPromisesMeansNothing.json","image_url":"https://media.breitbart.com/media/2015/04/obama_netanyahu-Jim-Young-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_07__1540928748.html","title":"Israel: If Iran Gets Nuke, Obama Promises Means Nothing","title_page":"Israel: If Iran Gets Nuke, Obama Promises Means Nothing","title_rss":"NULL","source_domain":"breitbart.com","text":"Israel Strategic Affairs Minister Yuval Steinitz said Tuesday that President Barack Obama’s promise to have Israel’s back is meaningless if he allows Iran to procure a nuclear weapon.\nObama’s support for Israel is “pleasant-sounding,” but “no assistance and no backing will help if Iran acquires nuclear weapons,” Steinitz told Israel’s Channel 2 News.\nThe Israeli minister was likely responding to an interview President Obama conducted over the weekend with the New York Times, in which he stated, “I would consider it a failure on my part, a fundamental failure of my presidency, if on my watch or as a consequence of work that I’ve done, Israel was rendered more vulnerable.” Obama added that allowing for Israel to be weakened would “not just” be a “strategic failure,” but also a “moral failure.”\nHowever, the President has rejected Israeli Prime Minister Benjamin Netanyahu’s suggestion that an Iranian nuclear deal should come with the stipulation that the regime in Tehran also recognize Israel as a sovereign state. U.S. National Security Advisor Ben Rhodes responded on behalf of the President, stating that the deal meets the U.S. “core objectives.”\nObama told the New York Times that it should be enough to “clarify that if Israel were to be attacked by any state, that we would stand by them.”\nSteinitz’s comments come on the heels of a Monday interview in which he stated that Israel is continuing to consider a military option against the Iranian regime. On Monday, he laid out a plan on behalf of the Israeli government that displayed a list of 10 recommendations Jerusalem believed could strengthen a final deal. If Israel’s suggestions are implemented, “It might become a much better deal and a more comprehensive and trusted deal than it is today,” explained Steinitz.\nOver the weekend, Israeli Prime Minister Benjamin Netanyahu weighed in on the basic framework agreed upon by the P5+1 World Powers and the Ayatollah’s regime in Tehran. “I think this deal is a dream deal for Iran and its a nightmare deal for the world,” remarked the Israeli Prime Minister","url":"https://www.breitbart.com/national-security/2015/04/07/israel-if-iran-gets-nuke-obama-promises-means-nothing/"}
