{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 18:58:31","date_modify":"2018-10-30 18:58:31","date_publish":"2018-09-07 11:26:05","description":"Ron Dermer expressed “confidence” that US President Donald Trump’s Mideast peace plan will capitalize on thawing ties.","filename":"data/vaneerConsumption/IsraeliAmbassadorRonDermerArabStatesNoLongerReflexivelyDancingtothePalestiniansTune.json","image_url":"https://media.breitbart.com/media/2016/12/ron-dermer.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_09_07__1540925911.html","title":"Israeli Ambassador Ron Dermer: Arab States ‘No Longer Reflexively Dancing to the Palestinians’ Tune’","title_page":"Israeli Ambassador Ron Dermer: Arab States ‘No Longer Reflexively Dancing to the Palestinians’ Tune’","title_rss":"NULL","source_domain":"breitbart.com","text":"The Jerusalem Post reports: Ron Dermer, Israel’s ambassador to Washington, expressed “confidence” on Wednesday that US President Donald Trump’s Mideast peace plan will capitalize on thawing ties between the Jewish state and the Arab world.\nAddressing guests at a Rosh Hashanah reception, including members of the peace team, Dermer said that Israel is ready for the release of Trump’s long-awaited peace proposal and believes it will “try to use the new realities taking shape in our region to help us forge a new path to peace and reconciliation.”\nThe administration has repeatedly denied or dodged rumors that the plan – spearheaded by Jared Kushner, the president’s son-in-law, and Jason Greenblatt, his special envoy to the peace process – would offer Palestinians a confederation with their Arab neighbors, diminish the identifying status of Palestinians as refugees, or lower Arab League standards for a complete resolution of the conflict focused on the establishment of an independent Palestinian state with east Jerusalem as its capital.\nRead more here.","url":"https://www.breitbart.com/middle-east/2018/09/07/israeli-ambassador-ron-dermer-arab-states-no-longer-reflexively-dancing-to-the-palestinians-tune/"}
