{"authors":["Jack Tonhaben"],"date_download":"2018-10-30 21:04:31","date_modify":"2018-10-30 21:04:31","date_publish":"2016-04-12 12:46:15","description":"The Israeli prime minister was reportedly furious on Monday over an agreement that might specify that the Golan Heights is Syrian.","filename":"data/vaneerConsumption/IsraelFumesasSyriaDealDesignatesGolanHeightsasSyrian.json","image_url":"https://media.breitbart.com/media/2016/04/golan-heights.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_04_12__1540933471.html","title":"Israel Fumes as Syria Deal Designates Golan Heights as Syrian","title_page":"Israel Fumes as Syria Deal Designates Golan Heights as Syrian","title_rss":"NULL","source_domain":"breitbart.com","text":"JERUSALEM – Israeli Prime Minister Benjamin Netanyahu was reportedly furious on Monday over indications that an agreement intended to bring peace to Syria might specify that the Golan Heights, including the part held by Israel, is Syrian land.\nAccording to a report by Israel’s Channel 10, Russia is the main party pushing to designate the Golan Heights as part of Syria. Apart from Russia, the U.S. and other major world powers are involved in talks intended to hammer out an agreement that would bring an end to the civil war in Syria.\nIsrael captured the Golan Heights in 1967 during the Six Day War. The territory was annexed in 1981, but the annexation is not recognized by most countries.\nIsraeli voices calling on Jerusalem to return the territory to Syria as part of a peace deal have faded since the collapse of Bashar Assad’s regime.\nAccording to Channel 10, Netanyahu discussed the Russian initiative in a telephone call with US Secretary of State John Kerry several days ago. He is expected to raise the issue with President Vladimir Putin when he visits Moscow next week.\nThe Channel 10 report said Netanyahu made clear that Israel would “act to ensure” that any agreement over the fate of Syria would not designate the Golan Heights as Syrian land.\nThe territory served Syria as a launching pad for attacks on the Jewish State in its first two decades. After Israel captured the territory, which contains historic Jewish sites, the attacks ceased.\nThe Syrian border has been quiet since the 1973 Yom Kippur War, but an official state of war continues to exist between Syria and Israel.","url":"https://www.breitbart.com/middle-east/2016/04/12/israel-fumes-as-draft-of-syria-deal-designates-golan-heights-as-syrian-land/"}
