{"authors":[],"date_download":"2018-10-22 22:26:06","date_modify":"2018-10-22 22:26:06","date_publish":"2016-01-28 10:31:35","description":"Israel arrested a Palestinian parliamentarian from the Islamist group Hamas, the army said Thursday, raising the number of detained Palestinian lawmakers to ...","filename":"data/vaneerConsumption/IsraelarrestsPalestinianlawmakerfromHamasarmy.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g6xv-2vdWmEltwXfba0ce28e632743609-302_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420614_Israel-arrests-Palestinian-lawmaker-Hamas-army_1540247166.html","title":"Israel arrests Palestinian lawmaker from Hamas: army","title_page":"Israel arrests Palestinian lawmaker from Hamas: army | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Israel arrests Palestinian lawmaker from Hamas: army\nIsrael arrested a Palestinian parliamentarian from the Islamist group Hamas, the army said Thursday, raising the number of detained Palestinian lawmakers to seven.\nMohammed Abu Tir was taken to custody on suspicion of being \"involved in terrorist activities\", an army spokeswoman told AFP.\nHe was arrested in an overnight raid in the east Jerusalem village of Kafr Aqeb, just south of the West Bank city Ramallah.\nIsraeli soldiers monitor Palestinian protesters during clashes in the West Bank village of Silwad, north of Ramallah, on April 11, 2014 ©Thomas Coex (AFP/File)\nAbu Tir is a Hamas member of the Palestinian Legislative Council from east Jerusalem.\nHe was previously held by Israel for a year without charge, eventually being released in 2012.\nHamas confirmed on the Twitter account of its armed wing, Ezzedine Al-Qassam Brigades, that Israeli forces \"re-kidnap Palestinian Legislative Council member\" Abu Tir.\nSix other members of the 132 member Palestinian Legislative Council are currently detained by Israel, according to the Palestinian human rights organisation Addameer.\nAccording to Addameer, three of them are Hamas members, one is from Fatah and two others from the leftist Popular Front for the Liberation of Palestine (PFLP), which Israel considers to be a \"terrorist organisation\".","url":"https://www.dailymail.co.uk/wires/afp/article-3420614/Israel-arrests-Palestinian-lawmaker-Hamas-army.html"}
