{"authors":[],"date_download":"2018-10-22 21:23:25","date_modify":"2018-10-22 21:23:25","date_publish":"2014-06-05 08:15:11","description":"Housing Minister Uri Ariel said in a statement that the move was a \"fitting Zionist response to the formation of a Palestinian terror government,\" adding that the housing plans were \"just the beginning.\"","filename":"data/vaneerConsumption/IsraelAnnouncesSettlementExpansioninResponsetoPalestinianUnityGovernment.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/488761/140605-israel-settlement-4a_9125eb2200419581d5c4ab466618d32e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_israel-announces-settlement-expansion-response-palestinian-unity-government-n123216_1540243405.html","title":"Israel Announces Settlement Expansion in Response to Palestinian Unity Government","title_page":"Israel Announces Settlement Expansion in Response to Palestinian Unity Government","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nJERUSALEM - Israel's housing ministry said Thursday it was advancing plans for nearly 1,500 new settlement housing units in the West Bank and east Jerusalem in response to the new Palestinian unity government backed by the Islamic militant group Hamas.\nHousing Minister Uri Ariel said in a statement that the move was a \"fitting Zionist response to the formation of a Palestinian terror government,\" adding that the housing plans were \"just the beginning.\"\nTenders were issued late Wednesday for about 900 housing units in the West Bank and about 560 units in east Jerusalem, territories that Israel captured in the 1967 war and which the Palestinians claim for their future state. The tenders represent the final governmental approval before construction can begin.\nChief Palestinian peace negotiator Saeb Erekat said the settlement announcement is \"a clear sign that Israel is moving toward a major escalation\" and that the Palestinians were weighing their response to the announcement.\nIt was the first announcement of settlement construction after nine months of U.S.-mediated Israeli-Palestinian peace talks officially ended in April. U.S. Ambassador to Israel Dan Shapiro told Army Radio Thursday that the U.S. opposes the planned settlement construction.\nJustice Minister Tzipi Livni, who was Israel's chief negotiator in the last round of peace talks, told Army Radio the announcement was a \"political mistake... that will only distance us from the ability to recruit the world against Hamas.\"\nLior Amichai, of the Israeli settlement watchdog Peace Now, also condemned the announcement, saying: \"It shows the government's policy is moving us toward one state.\"\nAs the peace talks ended with few if any visible signs of progress, rival Palestinian factions Hamas and Fatah moved to end their seven-year rift. The two groups last week agreed to a new unity government comprised of independent technocrats but backed by the two groups.\nIsrael had vowed to take action in response to the new Palestinian unity government because it is supported by Hamas, which is pledged to the destruction of the Jewish state and has carried out scores of deadly attacks against Israelis since it was founded in the late 1980s.\nThe Construction and Housing Ministry announcement said the settlement tenders were \"part of the reaction efforts\" to the new Palestinian government.\n- The Associated Press","url":"https://www.nbcnews.com/news/world/israel-announces-settlement-expansion-response-palestinian-unity-government-n123216"}
