{"authors":[],"date_download":"2018-10-30 20:52:02","date_modify":"2018-10-30 20:52:02","date_publish":"2014-07-14 14:44:31","description":"Israel is to indict three Jewish extremists with murder over the brutal killing of a Palestinian teenager, officials said Monday, as it emerged their","filename":"data/vaneerConsumption/IsraeltochargethreeJewsoverPalestinianteenmurder.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/news__1540932722.html","title":"Israel to charge three Jews over Palestinian teen murder","title_page":"Israel to charge three Jews over Palestinian teen murder - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Israel is to indict three Jewish extremists with murder over the brutal killing of a Palestinian teenager, officials said Monday, as it emerged their initial target was an eight-year-old child.\nAccording to a statement given to Petah Tikvah magistrates court near Tel Aviv, a 29-year-old man and two minors aged 17 are to be charged on counts of murder, kidnapping with intent to murder, arson and attempted arson, all committed “on racist-nationalistic grounds,” police said.\nMohammed Abu Khder, 16, was kidnapped from east Jerusalem on July 2 and burned to death by Jewish extremists in a suspected revenge attack for the abduction and killing of three Israeli teenagers.\nThe brutal murder triggered days of violent protests in east Jerusalem that quickly spread to Arab towns across Israel, with stone-throwers fighting pitched battles with riot police.\nA police statement, issued after a court lifted the gag order on the case, said all three suspects had confessed to the killing and carried out a reenactment for investigators.\nSeven arrests were made in connection with the case, although four people were released after police and the Shin Bet internal security agency determined they were not directly involved.\nIn a separate statement, Shin Bet said the three suspects confessed to killing Abu Khder in revenge for last month’s kidnap and murder of the three Israeli teens by Palestinian militants.\nThe three had decided to kill an Arab, and equipped themselves with cable ties, petrol and other materials, and had randomly chosen Abu Khder as their victim, it said.\nShin Bet said the suspects were all related.\nOn July 1, the suspects had tried to kidnap an eight-year-old child elsewhere in east Jerusalem, but were thwarted by the child’s mother.\n– Defence of insanity? –\nPolice said the three had searched several east Jerusalem neighbourhoods in search of a victim before happening on Abu Khder.\nAfter forcing him into the car, they struck him on the head and drove to a forest in west Jerusalem, where they poured flammable liquid on him and set him alight.\nAn initial forensic report showed smoke in his lungs, indicating he was alive when set alight. A lawyer for the family told AFP his body had been burnt beyond recognition.\nIsraeli media said the defence strategy of the 29-year-old prime suspect would be mental instability, with reports saying he had previously been in psychiatric treatment after trying to strangle his infant daughter.\nA spokesman for Honenu, a legal organisation which defends right-wing Jewish extremists, said the indictment would be filed on Friday.\nA spokeswoman for the state attorney’s office told AFP the indictment could be earlier, noting the exact clauses of the charge sheet could still change.","url":"https://www.breitbart.com/news/75b2a5e2-efc0-46f4-8e08-d0ba367020e5/"}
