{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:04:37","date_modify":"2018-10-30 21:04:37","date_publish":"2016-02-18 15:50:05","description":"Israel should take preemptive, \"brief but forceful\" action against Hamas, the executive director of the Institute for National Security Studies (INSS) wrote","filename":"data/vaneerConsumption/IsraelMustPreemptivelyStrikeHamasTerrorTunnelsPrepareforBriefbutForcefulConflict.json","image_url":"https://media.breitbart.com/media/2016/01/Screen-Shot-2016-01-28-at-11.34.07.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_02_18__1540933477.html","title":"Israel Must Preemptively Strike Hamas Terror Tunnels, Prepare for Brief but Forceful Conflict","title_page":"Israeli Security Chief: Israel Must Preemptively Strike Hamas Terror Tunnels, Prepare for Brief but Forceful Conflict","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Israel should take preemptive “brief but forceful” action against Hamas, the executive director of Israel’s Institute for National Security Studies (INSS) wrote in a new analysis.\nMaj. Gen. (ret.) Amos Yadlin, who served as the IDF’s chief of Military Intelligence until 2010, further stated that Israel must devise a technological solution to deal with the cross-border underground terror tunnels that Hamas is building.\nAccording to Yadlin, an “underground Iron Dome” would postpone the next round of fighting with Hamas. However, he added that since no such solution currently exists, Israel must take defensive measures to destroy the tunnels – which are, in Yadlin’s words, Hamas’ “only strategic tool.”\nYadlin also said that the repeated rounds of conflicts with Gaza since 2009 – the last of which occurred in the summer of 2014 with Operation Protective Edge – did not advance Israel’s strategic goals.\nThose goals include “long term deterrence; severe damage to the Hamas military wing; the weakening of the organization; and effective constraints on its future military buildup.”\nYadlin notes that both Hamas and Israel do not wish to be dragged into another round of fighting at this stage. For its part, Israel is following a “policy of imposed passivity.” This policy is challenging, as Israel must walk a fine line between allowing provisions to reach Gaza while at the same time ensuring that those goods– especially construction materials – are not used for terror purposes.\n“The tools currently available to Israel are not sufficient to deter Hamas from continuing its military buildup, including tunnel excavation. While reconstruction activity might affect Hamas’s willingness to confront Israel militarily in the short term, it will not eliminate the organization’s military ambitions in the medium to long terms,” Yadlin writes.\nHe explains that Israel must first determine the red line that, once crossed by Hamas, will demand a proactive military operation against the tunnels. He adds that over Israel’s nearly 68-year history, many preemptive measures were taken against perceived threats, including the 1967 Six Day War and the attack on the Iraqi nuclear reactor in 1981.\nThe problem, however, is that preemptive strikes do not have the same legitimacy for Israel in the 21st century. For one thing, the international community has little tolerance for offensive initiatives – especially in light of the fact that the target in this case is so heavily embedded in a civilian population.\nIsrael must therefore proceed with caution in order to avoid international condemnation and extensive harm to Gazans. The optimal solution would be to find a technological response to the tunnels in order to maintain calm for as long as possible. However, Yadlin asserts that “as long as such technologies are not yet operative and intelligence detects signs of an imminent attack by Hamas, a preemptive strike is essential.”\nAccording to Yadlin, there is little doubt that eventually Hamas will drag Israel into another round of conflict, and when it does Israel must ensure that this time the fighting will not simply be another case of “deadlock[ing the two sides] in their asymmetrical strategic draw.”\nIf Israel’s preemptive action should escalate into a full blown conflict, it must be “brief but forceful, based on a clear strategic objective that unlike all previous military encounters has the potential to effect a fundamental change in the balance of power and the dynamics between the sides.”\n“Any other choice will see Israel engaged in the same discussion in 2016 after yet another conflict with Hamas in the Gaza Strip,” Yadlin concludes.","url":"https://www.breitbart.com/middle-east/2016/02/18/former-chief-idf-intelligence-israel-must-preemptively-strike-hamas-terror-tunnels-prepare-brief-forceful-action/"}
