{"authors":["Deborah Danan"],"date_download":"2018-10-30 19:40:23","date_modify":"2018-10-30 19:40:23","date_publish":"2017-02-21 01:03:02","description":"The UN Security Council must “publicly condemn” Hezbollah chief Hassan Nasrallah’s threat to strike nuclear plants and other sites in Israel.","filename":"data/vaneerConsumption/IsraelsUNEnvoyCallsOnSecurityCouncilToCondemnHezbollahsThreatAgainstNuclearSites.json","image_url":"https://media.breitbart.com/media/2017/02/dano.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_02_20__1540928423.html","title":"Israel's UN Envoy Calls On Security Council To Condemn Hezbollah's Threat Against Nuclear Sites","title_page":"Israel's UN Envoy Calls On Security Council To Condemn Hezbollah's Threat Against Nuclear Sites","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – The United Nations Security Council must “publicly condemn” Hezbollah chief Hassan Nasrallah’s threat to strike a nuclear plant and other sites in Israel, the country’s UN ambassador said over the weekend.\nIn a letter addressed to UN Secretary-General António Guterres and the president of the Security Council, Israeli envoy Danny Danon wrote, “Silence is not an option in the face of such severe threats from a terrorist organization against a [UN] member state.”\n“The gravity of this threat is magnified by Hezbollah’s ongoing militarization of the towns and villages of Southern Lebanon, in clear violation of Security Council Resolution 1701,” he said in reference to the vote that ended the 2006 Second Lebanon War.\nDanon called on the Lebanese government to “uphold its commitments and fully implement Security Council Resolution 1701,” which mandates the disarmament of “all armed groups” in Lebanon.\nOn Saturday, Lebanese President Michel Aoun responded to Danon, saying, “Any attempt to hurt Lebanese sovereignty or expose the Lebanese to danger will find the appropriate response.”\nHe added that it was Israel, not Lebanon, that needed to adhere to the 2006 Security Council resolution, saying, “Israel still refuses to implement Resolution 1701, moving from the cessation of hostilities phase to the ceasefire stage, despite more than 11 years having passed since the resolution was released.”\nEarlier this week, Nasrallah warned that his organization was capable of firing missiles into an ammonia plant in Haifa and the nuclear reactor in Dimona, saying his terror group could “turn the ammonia tanks in Haifa into our atomic bomb.”\nMeanwhile, Arabic-language media reported that Arab leaders have cautioned Nasrallah against taking any steps that would provoke a “forceful” response from Israel.","url":"https://www.breitbart.com/middle-east/2017/02/20/israels-un-envoy-calls-on-security-council-to-condemn-hezbollahs-threat-against-nuclear-sites/"}
