{"authors":[],"date_download":"2018-10-22 20:34:14","date_modify":"2018-10-22 20:34:14","date_publish":"2014-05-02 15:04:48","description":"The public hearing at which the subpoena requires Kerry to appear is scheduled for May 21.","filename":"data/vaneerConsumption/IssaSubpoenasKerryforBenghaziDocs.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/416211/aptopix_irs_investigation-jpeg-067e7_e5bca8d731bd1591272622b86b0a7c46.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_congress_issa-subpoenas-kerry-benghazi-docs-n95676_1540240454.html","title":"Issa Subpoenas Kerry for Benghazi Docs","title_page":"Issa Subpoenas Kerry for Benghazi Docs","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHouse Oversight and Government Reform Committee head Darrell Issa, R-Calif., announced Friday that he has issued a subpoena to Secretary of State John Kerry as the panel continues its aggressive inquiry into the 2012 attacks in Benghazi.\nThe public hearing at which the subpoena requires Kerry to appear is scheduled for May 21.\nIssa has accused the State Department of withholding crucial documents from Congress.\n“Because your Department is failing to meet its legal obligations, I am issuing a new subpoena to compel you to appear before the Committee to answer questions about your agency's response to the congressional investigation of the Benghazi attack,” he wrote in a letter to Kerry.\nRanking Member Elijah Cumming, D-Md., slammed Issa's actions as politically motivated.\n\"These actions are not a responsible approach to congressional oversight, they continue a trend of generating unnecessary conflict for the sake of publicity, and they are shockingly disrespectful to the Secretary of State,\" he said.\nThe news comes as the White House and the State Department face new questions about its handling of the September 11, 2012 attacks after the release of new email correspondence. Democrats have said that Republicans are politicizing the issue to cast the Obama administration and then-Secretary of State Hillary Clinton in a negative light.","url":"https://www.nbcnews.com/politics/congress/issa-subpoenas-kerry-benghazi-docs-n95676"}
