{"authors":["Johnny Brayson"],"date_download":"2018-10-31 01:49:08","date_modify":"2018-10-31 01:49:08","date_publish":"2018-09-06 14:00:52","description":"Fans of the Conjuring franchise are no doubt familiar with the work of Vera Farmiga. Along with Patrick Wilson, the actress is the star of the franchise, portraying paranormal investigator Lorraine Warren in The Conjuring and The Conjuring 2. But in…","filename":"data/vaneerConsumption/IsSisterIreneInTheNunARealPersonTheHorrorFilmTellsAStoryThatsSoScaryYouWontForget.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/f37d1b8a-aef5-447e-913d-748c10b048e9-nun-04795r.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-sister-irene-in-the-nun-a-real-person-the-horror-film-tells-a-story-thats-so-scary-you-wont-forget-11769251_1540950548.html","title":"Is Sister Irene In 'The Nun' A Real Person? The Horror Film Tells A Story That's So Scary, You Won't Forget","title_page":"Is Sister Irene In 'The Nun' A Real Person? The Horror Film Tells A Story That's So Scary, You Won't Forget","title_rss":"NULL","source_domain":"bustle.com","text":"Fans of the Conjuring franchise are no doubt familiar with the work of Vera Farmiga. Along with Patrick Wilson, the actress is the star of the franchise, portraying paranormal investigator Lorraine Warren in The Conjuring and The Conjuring 2. But in the series' latest installment, The Nun, it's Farmiga's younger sister, Taissa Farmiga, who takes over starring duties with her portrayal as the inquisitive young nun Sister Irene. Her character is sent to Romania to investigate the mysterious suicide of another nun, and she ends up running afoul of the demon Valak. And given the franchise's history of drawing inspiration from real people, like Lorraine Warren, does that mean The Nun's Sister Irene is a real person, too?\nIn the movie, Irene isn't quite a full-fledged nun yet; she's a novice, meaning she's basically a nun-in-training. And what better way to get into the habit (pun intended) than by confronting a demonic nun? But unlike the two Conjuring movies and the Annabelle films, all of which were at least somewhat inspired by the purported investigations of Ed and Lorraine Warren, The Nun is a wholly fictional tale. And with that being the case, that means Sister Irene is a fictional person. In other words, there is no real life Sister Irene on which the character is based.\nWarner Bros. Pictures on YouTube\nSister Irene is chosen by the Vatican to investigate the nun's suicide at the Romanian Carta Monastery because of her own mysterious visions; visions in which she sees a scary nun. It just so happens that the film's antagonist, the demonic Valak, who takes the form of a nun, has taken up residence at the monastery (which is a real place by the way, though it's nothing like what's seen in the film), setting these two on what seems like a predestined collision course. And since The Nun is a prequel to the rest of the Conjuring movies, the film marks the first chronological appearance of Valak, who will go on to appear in visions to Lorraine Warren in The Conjuring 2.\nAlthough Sister Irene is not based on an actual person, there have been plenty of nuns over the years who have claimed to have scary religious visions, so she's not a total outlier in the world of Catholicism. There was Sister Lucia of Fatima, who claimed to have seen and conversed with an apparition of the Virgin Mary on numerous occasions in the early twentieth century. That may not sound so scary, but during one such sighting on July 13, 1917, Lucia claims the apparition showed her a vision of Hell, complete with demons and tormented souls in a sea of fire, according to the National Catholic Register. Then there's the tragic story of Romanian nun Sister Maricica Irina Cornici, who claimed the devil spoke to her in 2005 and was subsequently killed during an attempted exorcism performed by a priest and four other nuns.\nThe Nun's main nun, Sister Irene, isn't a real person, but the idea of a nun who experiences strange visions or hallucinations — even frightening ones — is hardly a new one, and one that feels right at home in the Conjuring movie universe.","url":"https://www.bustle.com/p/is-sister-irene-in-the-nun-a-real-person-the-horror-film-tells-a-story-thats-so-scary-you-wont-forget-11769251"}
