{"authors":["Rebecca Patton"],"date_download":"2018-10-31 01:46:38","date_modify":"2018-10-31 01:46:38","date_publish":"2018-09-14 11:00:53","description":"Netflix's pseudo-crime documentary, American Vandal, captivated audiences last year with one simple question: Who drew the d*cks? And now that the Netflix show is returning for Season 2 on Friday, Sept. 14, a new mystery needs solving: Who made the…","filename":"data/vaneerConsumption/IsStBernardinefromAmericanVandalaRealHighSchoolItsStudentsWerePrankedByTheTurdBurglar.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/975a6c85-1a41-4915-931a-0f284795926a-av_206_unit_00654_r.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-st-bernardine-from-american-vandal-a-real-high-school-its-students-were-pranked-by-the-turd-burglar-11897717_1540950398.html","title":"Is St. Bernardine from 'American Vandal' a Real High School? Its Students Were Pranked By The Turd Burglar","title_page":"Is St. Bernardine from 'American Vandal' a Real High School? Its Students Were Pranked By The Turd Burglar","title_rss":"NULL","source_domain":"bustle.com","text":"Netflix's pseudo-crime documentary, American Vandal, captivated audiences last year with one simple question: Who drew the d*cks? And now that the Netflix show is returning for Season 2 on Friday, Sept. 14, a new mystery needs solving: Who made the St. Bernardine student body poop their pants? It's a valid question, as viewers see iPhone footage in the trailer of students running the halls, slipping in excrement, and sitting in their own refuse. Another equally valid question? Is St. Bernardine on American Vandal real, so audiences can avoid its potentially contaminated campus at all costs? While it doesn't look like there's one specific school that it's based on, there are a few options that may have inspired the name.\nBut first, a bit of background about this installment of the Netflix show: Last season centered around local prankster, Dylan Maxwell (Jimmy Tatro), a senior at Hanover High School whom everyone believed drew phallic imagery on dozens of cars. But what started out as a funny mockumentary filled with penis jokes eventually became a sad and poignant show as fans learned more about Dylan's sad background and his failure to get into a good college.\nUnfortunately for Dylan fans, American Vandal numero deuce doesn't feature the boyish prankster; however, it does involve the same investigative wunderkinds: Peter (Tyler Alvarez) and Sam (Griffin Gluck). The pair are recruited by a student at St. Bernardine High School, who sends them a video. \"I'm contacting you because we have a vandal,\" she says in the trailer. \"He goes by the name 'The Turd Burglar.'\"\nScott Patrick Green / Netflix\nThat's right, the cafeteria lemonade was contaminated at the Catholic high school, which caused students everywhere to soil themselves. \"Most of us just sh*t our pants right in front of everyone,\" an unidentified student says in the Season 2 trailer. What's more, a police officer tells the camera, gravely, \"This was the worst thing I've seen in 20 years.\" In other words, this vandalism is no laughing matter. Or is it?\nAll of this takes place at St. Bernardine High School. So is it an actual school? Audiences will recall that Season 1's Hanover High School was set in Oceanside, California. That California school wasn't real, and neither is the St. Bernadine's in Season 2, which actually takes place in Washington state.\nNetflix on YouTube\nAccording to Vulture, the school is supposedly in Bellevue, Washington, though if you do a quick internet search, you won't turn up any results for a co-ed Catholic school in the area. The Oregonian, though, did report that much of the season was filmed in the Portland, Oregon area. They didn't even film in a high school, either. According to the show's IMDB page, they used a community college to stage \"The Brownout\" and other scenes set within the school's walls.\nSo while St. Bernadine's in American Vandal isn't a real place, it's definitely inspired by Catholic schools all over the country. Which is really all that matters anyway.","url":"https://www.bustle.com/p/is-st-bernardine-from-american-vandal-a-real-high-school-its-students-were-pranked-by-the-turd-burglar-11897717"}
