{"authors":["Ligaya Figueras"],"date_download":"2018-10-30 21:31:32","date_modify":"2018-10-30 21:31:32","date_publish":"2017-04-17 14:41:59","description":"Atlanta-based fast-food chicken chain Chick-fil-A has long upheld the practice of closing on Sundays...","filename":"data/vaneerConsumption/IstheChickfilAatSunTrustParkopenonSundays.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/04/25/Images/WPIMAGE_cmgajcfoodandmore_7868.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_th_51f0ca5bd4c889013f97faa23302e4f5__1540935092.html","title":"Is the Chick-fil-A at SunTrust Park open on Sundays?","title_page":"Is the Chick-fil-A at SunTrust Park open on Sundays?          ","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta-based fast-food chicken chain Chick-fil-A has long upheld the practice of closing on Sundays.\nChick-fil-A now has a presence at the new SunTrust Park, home to the Atlanta Braves. Even though the team will play many games there on weekends, the restaurant's policy remains in effect for all of its locations – even at the new stadium. On Sunday game days, Chick-fil-A's standalone concessions station (Concessions 143) and its portable concessions will be closed.\nChick-fil-A explains its closed-on-Sundays policy on its website:\n\"Our founder, Truett Cathy, made the decision to close on Sundays in 1946 when he opened his first restaurant in Hapeville, Georgia. Having worked seven days a week in restaurants open 24 hours, Truett saw the importance of closing on Sundays so that he and his employees could set aside one day to rest and worship if they choose - a practice we uphold today.\"\nRELATED STORIES\nHey, Cobb: Y’all know about that free Chick-fil-A tomorrow, right?\nHere’s the food lineup at SunTrust Park\nWhich food should you get at the Atlanta Braves’ new stadium?\nThe Battery Atlanta: Restaurants near SunTrust Park\nUnlimited chicken for 65-cent apiece at Church’s Chicken all week long\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following@ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/the-chick-fil-suntrust-park-open-sundays/QuAcAiA478lkfHzMmyrPSJ/"}
