{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 01:50:29","date_modify":"2018-10-23 01:50:29","date_publish":"2017-03-10 10:18:06","description":"Carrie Cort, 51, from Sussex gave up her high powered corporate job to focus on her eco friendly life and has save £33K and her family is happier than ever.","filename":"data/vaneerConsumption/IsthistheUKsmostecofriendlyfamily.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/17/3E1D65D400000578-0-image-a-149_1489081148416.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4298208_Is-UK-s-eco-friendly-family_1540259429.html","title":"Is this the UK's most eco-friendly family?","title_page":"Is this the UK's most eco-friendly family? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A mother and her nine-year-old son have been named the UK's most eco-friendly family after winning an award for their environmental initiatives.\nCarrie Cort, 51, from Sussex gave up her high powered corporate job running a video communication company in 2014 to focus on environmental campaigning.\nNow every aspect of her life is eco friendly, from her son Adam's birthday parties to her clothing, and she recycles everything from empty pens to milk bottle tops - but it's not just the environment reaping the rewards.\n'Changing our family lifestyle to green has saved us around £11,000 every year, which has given us more financial stability,' Carries told Femail. 'Living green has made us healthier and I feel younger now than I did twenty years ago, when I lived a less healthy lifestyle of processed and heavily packaged food.\n'However, the main benefit has been that our family has had such fun doing this. We are happier than ever before and we spend more quality time together than we ever did.\nCarrie Cort, 51, from Sussex and her husband Brian with their son Adam. She says their family is happier than ever since embracing a greener lifestyle\nCarrie with her husband Brian, and her mother, showing off the fun art projects children can enjoy with recycled materials\n'It’s just so nice knowing we have done this together, knowing that we are all helping not just Adam and his kids one day, but for many generations into the future.\n'There are many benefits to greener living, firstly you know that it is better for the environment, less natural resources taken, less energy and water used to manufacture goods or transport food.\n'Being frugal definitely saves you money, and it is fun seeing what you can make with unwanted or broken things, like reusing my old washing machine as a fantastic BBQ, wok cooker and log burner.\n'Growing your own food is great exercise, good for wildlife, the food is much more nutritious, tastier, no food miles and no packaging. It is a win, win all around.'\nAdam and his grandmother with two of the family hens\nTHROW A GREEN BIRTHDAY PARTY Carrie ensures her son's parties are environmentally friendly. Here's how she threw Adam a Super Mario party for his fourth birthday. Invitations: We designed A6 Super Mario invitations - no envelopes - which were hand delivered to nursery friends and walked to local friends. Children loved receiving these miniature cards. Decorations: We used a Christmas multi-coloured central table decoration and added little Super Marios which were printed on the back of used paper and stuck onto the Christmas stars. Banners: We made a Happy Birthday banner out of paper plates strung up with ribbon. The plates can be redecorated each year and eventually put in the recycling bin. I have also seen people making flags out of old maps and stringing them up, they look pretty neat. Lego bunting and decorations made from upcycled jars at one of Carrie's eco-friendly parties Cups and plates: Rather than using Super Mario one-time use paper cups and plates we used existing every day plastic colourful plates. Table cloth: We used a white paper tablecloth which the children decorated as part of the party fun. Paper tablecloths, as long as they are not wet or covered in food, can go in the paper recycling. If they are wet or dirty then tear them up and put them in your compost bin. Give children party food on plastic plates that can be washed and reused Secondhand presents: My son has a cousin who is 2 1/2 years older, so he often gets hand-me-down books and toys. I suggested a rather magnificent world educational globe, which was likely to be handed down any day, was wrapped up and given to him as his birthday present. I have decided not to buy any plastic toys new now, only secondhand. Lots of the plastic toys are made in the far east, so due to the transportation they come with a high carbon footprint. We found a beautiful ELC Castle of Doom from the Cancer Research charity shop for £10, rather than £80 new. Alternatively, a lovely present and a way of connecting children with the great green outdoors is to join them up to the Nature Detectives Club or why not buy them a butterfly kit. Wrapping paper and cards: Our family uses 'paper for life', passing it to and from each other for birthdays from year to year. The same goes for cards. Party bags: They get opened, emptied, put straight in the bin and then go off to the landfill. My husband bought me a beautiful Valentine bouquet which was wrapped in a sheet of clear plastic and several sheets of red and orange tissue paper. We cut this into oblongs and taped it into bags with a Mario character printed onto the back of some used paper. They included a paper colouring book, that can be recycled. The boys had a little Superman model which came from a jumble sale and the girls had the equivalent! Party Games: These included pass the parcel of course, using secondhand wrapping paper from an earlier birthday party. Lots of outdoor games thanks to some unusual February mild weather. Children enjoying outdoor games at a Green Play Arcade where they can learn to build their own robot Food: Most was bought locally from the market and small supermarket, avoiding packaging. Where packaging was required we selected products with recyclable packaging. Thank you cards: We saved the birthday wrapping paper and made our own recycled thank you cards. Even if you only put into place a few of these ideas, your child’s birthday party will be a little greener than last year's.\nCarrie and Adam were both And the pair have been honoured amongst the UK’s most inspiring environmentalists at the WWF Earth Hour Hero awards.\n'​I have always had a great empathy with nature and the environment. I studied and have worked in three Agricultural colleges,' Carried told Femail.\n'My concern for the way we humans are treating the planet which sustains us was really roused in 2008 when Adam was born.\n'With motherhood came serious concern about environmental sustainability and a burning desire to learn how we can live more environmentally friendly lifestyles, in harmony with nature.'\nCarrie wearing a waistcoat made out of old ties. She finds a new life for everything so that no old clothing goes to waste\nCarrie (right) and her mother foraging for wild herbs and nettles\nRECYCLE ALMOST ANYTHING!\nAlthough some waste resources can’t be put in household recycling bins sometimes they can be taken to the local Household Waste Recycling Facility run by the local authority.\nSearch the internet to find ways of recycling or donating waste resources which can’t go in people’s household bins.\nOffer your unwanted items on Freecycle, Freegle and Trash Nothing, or give to jumble sales and charity shops.\nRepurpose or upcycle the item, get creative, there is no such thing as rubbish just a waste resource in the wrong place.\nTerraCycle provides free waste collection programs for hard to recycle materials, turning them into affordable green products. With local collection points around the UK, it allows you to recycle items you might otherwise throw away, such as\nCoffee pods\nPackaging from baby fruit and vegetable pouches\nPens and writing correction fluid bottles\nHome care and air care products\nPlastic milk bottle tops\nToothpaste tubes and toothbrushes\nTextiles such as clothing and shoes\nMobile phones\nInk cartridges\nInhalers\nCDs and DVDs\nAluminium ring pulls\nBiscuit wrappers\nCarrie with recycling from her son's school, including pens and fruit pouches\nCarrie set up the local campaign group Sussex Green Living at the end of 2011 and three years later gave up her job to pursue her passion full time.\nAnd she's truly living her own message, including wearing her clothes until there's holes in them and even then she finds a way to repair them.\n'I refuse to be sucked into commercialism and the need to change my wardrobe with the season,' she said. 'I use clothes until they wear out.\n'I have been known to combine my favourite pair of jeans which were holey with another pair of jeans, I ended up with a rather creative merger of the two.\nTOP TIPS FOR GREEN LIVING 1. Use renewable energy: Either through investing in solar, geothermal for example or sign up to receive your energy from companies who supply 100% renewable energy. It takes less than five minutes and could save you money. 2. Reduce energy use: Turn off lights and appliances when you are not using them. Unplug devices when not in use. Replace standard bulbs with energy-efficient compact florescent bulbs. 3. Use high efficiency appliances. When replacing appliances, look for high efficiency units. Appliances with ENERGY STAR ratings, an international standard for energy-efficient consumer products, typically utilise a minimum of 20 % less energy. This means savings for you and the environment. 4. Review your transport. Walk or bike when possible. Use public transport or carpool whenever possible. When replacing your car consider an electric car (powered with 100 per cent renewable electricity), an electric plug in car or a hybrid car. Maintain your car well and drive economically. Avoid flying whenever possible. Take a train-cation and enjoy the countryside along the way. 5. Write to your local MP: Tell them what you want them to do on your behalf, whether it be lobby for clean energy, cleaners seas, protecting forests of the world or recycling etc. You can also sign petitions through organisations like Greenpeace and Friends of the Earth or write to the Secretary of State for Business, Energy and the Industrial Strategy, asking for action on emissions reduction. 6. Share your knowledge. About more environmentally friendly living with others. Encourage others to attend Climate Reality talks or organise a talk for their community 7. Plant a tree or lots of trees! Encourage others to do the same. Only buy wooden goods which come from sustainable forests. 8. Insulate yourself and your home: In winter, reduce your thermostat by 2°C to enjoy energy savings and a cosy sweater. Lowering the temperature on your water heater to between 55 and 60 °C and insulating your pipes also makes a difference. 9. Water conservation. Shower rather than bath, no dripping taps, turn off tap while cleaning teeth and shaving. Collect rainwater for your garden if possible. Treating and transporting water requires energy, while water conservation results in reduced energy requirements and carbon emissions. 10. Washing machine. Use it on the coolest wash and hang your washing out to dry. 11. Reduce and Recycle. Try to buy goods and food which has no packaging or minimal (and recyclable) packaging. Any packaging you have to buy, make sure you recycle as much as possible. For certain items with large amounts of packaging, ask retailers if they can recycle or re-use it. For electronics, facilities now exist that can dispose of electronics in an environmentally responsible manner. 12. Repurpose or Reuse: Rather than discarding or recycling clothing and household goods, give them a chance at a second life. Clothing or household items in good condition can be donated to charity, exchanged, sold at a garage sale or given away. 13. Grow your own fruit and vegetables: Even a window-ledge and hanging baskets can be used for herbs and salad. 14. Drought-Tolerant plants: Select plants that are well suited to your climate and require minimal watering and attention. Also make sure you include plants which are good for bees. 15. Ethical banking: Invest your money with an ethical bank who supports the green movement. 16. Avoid clothing and food waste going to landfill: They are some of the worst culprits for greenhouse gases, releasing methane as they decompose. Make your own compost with any food waste to help your garden grow! 17. Choose to buy from ethical companies: They aim to avoid damage to the environment, exploiting its workforce by paying low wages, using child labour, or producing products which are harmful or dangerous.\n'When time allows I visit the charity shop and often find some lovely clothes for a fraction of the cost and raise money for very worthy charities.\n'I have searched and found some fantastic companies who make clothes out of upcycled or reused materials, so I have bought items from them.\n'I have set up a community remake, redesign, repair creative group, and we run workshops to inspire and teach people how to make clothes out of unwanted material, repair or adapt clothes.'\nCarrie teaching school children about eco-friendly living\nLast year Carrie changed from a hybrid to a full electric car. Her car is powered by electricity, which she buys from a 100 per cent renewable energy provider\nCarrie with a younger Adam, holding one of the family chickens which they raise for fresh eggs\nThanks to their efforts, Carrie and Adam were both named amongst the UK’s most inspiring environmentalists at the WWF Earth Hour Hero awards\nAdam enjoying foraging for wild flowers on a walk in the countryside\nCarries only uses cleaning and household products which are recycled, upcycled, biodegradable and or environmentally friendly.\n'Every day the environment is being penetrated by loads of chemicals present in the air, cleaning products and around the home and workplace.\n'People often don’t think about what they are washing down the drain into our water system,' she said.\nShe shops very rarely from big supermarkets, and if she does she avoids food with packaging.\nAn old bath tub and an old boot repurposed as planters. Carrie recycles or finds a new use for everything she no longer needs\nCarrie's old washing machine has found a new life as an outdoor cooker\nAdam planting herbs in planters made from pieces of old guttering\nHomemade damson jam from the fruit that Carrie grows in her own garden\n'Whenever possible I buy from a local farm shop or farmers market. We are lucky we have a big garden enabling us to grow our own apples and damsons, vegetables and salad.\n'We have chickens so a great supply of fresh eggs. I stress to people on my journey that even small steps made by one person can help achieve an ecologically sustainable future.\n'I only buy Faith in Nature products for the bathroom and Ecover in the kitchen.\nFrom a young age, Adam - pictured watering the flowers - has been involved in green living\nCarrie keeps chickens so there's a constant supply of fresh eggs, and buys from local suppliers rather than big supermarkets\nAdam and his cousing proudly showing off a marrow grown in the garden of the family home\n'With reference to beauty products I choose Green People, they are based a mile from our home, so I collect leaving all the boxes for them to reuse.\nThanks to their efforts, Carrie and Adam were both named amongst the UK’s most inspiring environmentalists at the WWF Earth Hour Hero awards.\nWWF’s Earth Hour - the world’s largest demonstration of support for action on climate change, by signing up and switching off their lights at 8:30pm on Saturday March 25. Anyone can join in by simply signing up here.","url":"https://www.dailymail.co.uk/femail/article-4298208/Is-UK-s-eco-friendly-family.html"}
