{"authors":["Ben Christopher","Amita Sharma","Dan Walters"],"date_download":"2018-10-30 22:47:54","date_modify":"2018-10-30 22:47:54","date_publish":"2018-08-10 19:06:24","description":"California Republicans want to repeal a recent hike in the gas tax and say that drivers can have smoother roads, more reliable public transit—and lower taxes too. Should voters believe them?","filename":"data/vaneerConsumption/IstheRepublicanstoryaboutrepealingthegastaxhiketoogoodtobetrue.json","image_url":"https://calmatters.org/wp-content/uploads/IMG_2176-e1533925695436.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939674.html","title":"Is the Republican story about repealing the gas tax hike too good to be true?","title_page":"Is the Republican story about repealing the gas tax hike too good to be true? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"California Republicans say that drivers can have smoother roads, more reliable public transit—and lower taxes.\nIn November, voters will get the chance to repeal a recent increase in the state gas tax and assorted vehicle fees. That tax hike—an extra 12 cents per gallon of gasoline, 20 cents per gallon of diesel, and two new vehicle registration fees—was signed into state law last year, part of a Democratic-led transportation package that directs an extra $5 billion per year toward the state’s dilapidated roads and highways. Making voters pay more at the pump is a tough political sell, but Democrats and other defenders of the law argue that our infrastructure is long overdue for an upgrade. The gas tax hasn’t been increased in over 20 years while the cost of highway construction has tripled. And, they say, you can’t get something for nothing.\nNot so, say supporters of the repeal, Proposition 6. Chief among them is John Cox, the Republican running to be California’s next governor.\n“The Democrats decided to do the easy thing in their view, and that is just keep sticking their hands in the pockets of Californians,” he said, “instead of doing the hard work, which would have been standing up to the donors, standing up to the special interests, and using our money effectively and wisely.”\nCalifornia, he added, “spends multiples of what other states spend on a mile of road.”\nIn trying to sell voters on Prop. 6, which would also require voter approval for all future driving-related tax hikes, supporters like Cox make the following arguments:\nCalifornia transportation spending is out of whack with most other states.\nBloated transportation agencies, public sector unions, and red tape are to blame for those higher costs.\nPolitical leaders could cut that wasteful spending—saving taxpayers billions and rendering higher taxes unnecessary—if only they had the will and the courage.\nThese add up to a potentially enticing argument.\nThe question is: Should voters believe it?\nProp. 6 skeptics are right to say that repealing the new taxes and fees will necessarily mean cutting back on something. Supporters have so far been a little vague on what that something is. Wasteful spending or vital public services—it’s entirely in the eye of the taxpayer.\nThe cost of a California highway\nWhen asked for evidence that California can’t manage its transportation budget, the Cox campaign points to a recent report published by the libertarian Reason Foundation. According to its findings, the state government spends more than $471,000 per mile of road that it maintains. That’s nearly triple the national average of about $178,000. By this measure, California has the eighth most expensive state road system in the country.\nGiven that our roads are in such rough shape and California also has among the highest gas taxes in the country, one might reasonably wonder whether drivers and taxpayers here are getting a raw deal.\nThe California Department of Transportation (Caltrans) argues that the report inflates the state’s true costs by measuring each state’s highway system simply by totaling its length. According to Caltrans, California highways have an average width of over 3.4 lanes compared to a national average of 2.4, which makes the same length of highway more expensive to maintain. In effect, the report treats a two-lane highway in Oklahoma the same as an equally long stretch of California’s I-405, all 14 lanes of it.\nThe Reason report is a rare effort to compare across state agencies because it’s difficult to do. Different state agencies are responsible for different aspects of the highway system, subject to different rules, and operate in vastly different climates, terrains, and economies.\n“More than 40 percent of the nation’s freight is moved through California, which has three of the nation’s top five busiest ports in Los Angeles, Long Beach and Oakland,” a spokesperson for Caltrans said in an email. That extra wear and tear adds to the state’s overall maintenance tab.\nAsked if the federal government compares transportation spending across states, Doug Hecox, spokesman for the Federal Highway Administration said different methodologies will produce wildly different estimates.\n“There are many ways to bake a cookie and everyone has a different recipe,” he said. “Welcome to my personal hell.”\nWhat drives the cost?\nBaruch Feigenbaum, author of the Reason report, agrees there are many reasons California roads might cost more—some within the state’s control and some not.\nFalling into the latter category: It’s more expensive to build and maintain roads in high-density urban areas, and California has some of the biggest in the country. The Sierra Nevada and a constantly eroding coastline require challenging and expensive engineering. And yes, this is California after all, where wages and land values make everything cost more, transportation related or not.\n“Obviously, it’s going to be more expensive to build a mile of roadway in California with labor than it is in Mississippi, regardless of some of the union issues,” said Feigenbaum.\nBut the high cost of labor is exacerbated by the higher levels of unionization in California, he said. Likewise, the state has tighter environmental regulations than most, which can saddle a given project with delays and extra costs.\nBut where some see inefficiency, others see the preservation of the state’s most cherished values. And for every propeller of higher costs, there is a powerful constituency ready to defend it.\n“One of the things that Californians love, that is part of our birthright, is our beautiful state with our beautiful environment,” said Russell Snyder, executive director of the California Asphalt Pavement Association, a trade group that represents road pavers and asphalt producers and opposes Prop. 6. “Environmental rules are easy to demonize, but they’re there for a reason.”\nOther factors pushing up costs are less obvious, though no less fiercely guarded. In California, much of the major road work is done during off-hours to limit the impact on commuters, said Margot Yapp, vice president at Nichols Consulting Engineers, a firm that works on transportation projects across the American West.\n“Go travel in the summer in any other state and construction—even on the interstate—happens in the daytime,” she said. But given the amount of congestion in California, shutting down highways at rush hour would spell certain gridlock and political backlash.\n“As soon as you do pavings at night, every (cost) goes up—I would say, easily, by 30 percent,” said Yapp.\nFeigenbaum, the Reason Foundation author, still insists Caltrans can cut costs. His suggestions: Caltrans should enter into more partnerships with private companies or take on some of the responsibilities now delegated to local and county organizations, reducing duplicative bureaucracies. In theory, he concluded, passing Proposition 6 would force the state to find those efficiencies.\nBut maybe only in theory.\n“From a mathematical perspective the state can do it, but from a political perspective the state probably won’t,” he said.\nCan we cut the fat?\nCarl DeMaio begs to differ. This fall, the conservative talk radio host who chairs the political action committee pushing for the repeal plans to file papers for a 2020 ballot measure, which he says would recoup the state’s budgetary losses from passing Prop. 6, all without raising taxes.\nThe details have yet to be hashed out, but DeMaio proposes three savings: Dedicate all gas tax revenue solely to road maintenance and improvement (right now some goes to public transportation projects and debt repayments), divert all car sales tax revenue to state transportation (now that money is treated like other sales tax and goes to general government expenses), and enact “efficiency reforms,” such as mandating that Caltrans employ more independent contractors.\nBut many state finance experts say finding savings is not that easy.\n“It’s nonsense to the suggest that that’s just money that’s laying there not being used,” said Michael Coleman, fiscal policy advisor to the League of California Cities, which opposes Prop. 6. “If you’re going to be honest with the proposal, then you have to look at what the consequences of this are.”\nA little over half of sales tax revenue from auto purchases goes to the state’s general fund, for example. If voters decide to divert that money to highway repairs, what could lawmakers cut to make up the difference?\nPast ballot measures have placed spending requirements on K-12 education and budget reserves. Court orders and federal funding requirements put more restrictions on many health and social programs and corrections spending. Left on the chopping block are higher education, parks and recreation, public resources, and certain unprotected social welfare programs.\n“You’re talking about a fairly small part of the budget,” said Coleman. “It’s remarkable how little discretion the Legislature actually has.”\nThe remaining sales tax money that goes to cities and counties—a little under half of the total haul—mostly goes toward local law enforcement and emergency services, jails, welfare payments and local transportation.\nThose fighting against the new gas tax argue that because sales taxes on automobiles are levied on drivers they should be spent solely on transportation.\nAs for the savings that DeMaio proposes to unearth by forcing state agencies to rely more on contractors, the state’s nonpartisan fiscal analyst is skeptical.\n“When we’ve looked at the cost of contract versus state staff, we haven’t really been able to identify significant differences between the two,” said Paul Golaszewski, a transportation expert with the Legislative Analyst’s Office.\nBut DeMaio dismisses the idea that there isn’t at least $5 billion to be found somewhere in the state’s $139 billion general fund.\n“I don’t think any voter out there is going to accept the notion that government is in prime efficient condition and can’t figure out how to do more with less,” he said.\nHe, John Cox, and the entire national Republican Party are counting on it.\nWith many political pundits and data points projecting an electoral “blue wave” this November, opposition to the gas tax may be one of the GOP’s last breakwaters. In June, Democratic state Sen. Josh Newman was recalled from his north Orange County seat by a 16-point margin—a recall fueled by anger over his vote for the gas tax bill. If voters turn out against Newman’s fellow Democrats in equal measure this fall, that could keep Democrats from flipping some of the most vulnerable GOP-held congressional seats in California, allowing Republicans to keep control of the House of Representatives.\n“From a turnout and motivation perspective, this is a huge winner for Republicans,” said Jack Pandol, spokesperson for the National Republican Congressional Committee. “We’re going to make every Democrat in November own this tax.”","url":"https://calmatters.org/articles/california-gas-tax-repeal-too-good-to-be-true/"}
