{"authors":[],"date_download":"2018-10-22 22:55:53","date_modify":"2018-10-22 22:55:53","date_publish":"2014-08-01 00:00:00","description":"For the final program, host Michel Martin speaks with Neil Minkoff and Maria Cardona about the biggest political stories of the week.","filename":"data/vaneerConsumption/IsTheCurrentGridlockInCongressAsBadAsItLooks.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2014_08_01_337092364_is-the-current-gridlock-in-congress-as-bad-as-it-looks_1540248953.html","title":"Is The Current Gridlock In Congress As Bad As It Looks?","title_page":"Is The Current Gridlock In Congress As Bad As It Looks? : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Is The Current Gridlock In Congress As Bad As It Looks?\nMICHEL MARTIN, HOST:\nThis is TELL ME MORE from NPR News. I'm Michel Martin. It's our final program today, and we are going to begin with a topic we visited regularly - American politics. As you're probably aware, school's out for Congress - well, sort of. Today is supposed to be the first day of a five-week long recess, but the House is being called into session today to work out a plan on the border crisis, which has been the subject of intense discussion on Capitol Hill over the past few weeks. This is just the latest in a congressional term that has seen much tension and little action. Although, Congress did manage to approve a measure aimed at reforming the VA hospital system and extending highway construction funds. We wanted to talk about the political landscape at the moment so we've called upon two of our trusted contributors. Maria Cardona is a Democrat strategist at the Dewey Square Group. Before that, she was a top communications officer at the Department of Commerce, and what was then called the INS - the Immigration and Naturalization Service. Neil Minkoff is a regular contributor to our Barbershop roundtable. He'll probably be sticking around for that. But he's also a regular contributor to the National Review and he's a health care policy consultant. Welcome back to you both. Thank you for coming.\nMARIA CARDONA: Thank you so much.\nNEIL MINKOFF: Thank you for having us.\nMARTIN: So I want to begin with this big story in Washington. The House could not agree on a measure to provide funding to deal with this whole situation at the border, which we've been covering, you know, very closely over the last couple of weeks. Let me just - Maria - take a step back from this. You know, from the outside, it seems as though our politics at the moment are just toxic and personal and petty. You're closer to it than most of us are. Does it seem that way to you?\nCARDONA: Oh, there's no question about that, Michel. We are in a moment right now where the partisanship in Washington, I think, is worse than it ever has been. And it has gotten ugly and it has gotten personal, like you said. We see it in the polling. Congress' numbers could not be worse. Within that, the Republican Congress' numbers are, I think, in the toilet. And so I think what Americans are seeing is - and feeling...\nMARTIN: I would've preferred, like, the basement. But that's OK.\n(LAUGHTER)\nCARDONA: That's how bad it is, Michel.\nMARTIN: OK.\nCARDONA: Not mincing words here.\nMARTIN: (Inaudible) the basement - the parking - P3 - but, anyway, go ahead.\n(LAUGHTER)\nMARTIN: I took your point.\nCARDONA: Thank you. But what Republicans are expecting, still, from their leaders in Congress is for them to put politics aside and to actually get something done. Democrats and this president are ready to put politics aside and get something done. What we've seen from Republicans - and we saw was in the House yesterday - frankly, Speaker Cruz - I'm sorry, Senator Cruz - who wants to be speaker, obviously, is the one who actually pushed the Republicans in Congress to actually vote against a bill that Boehner wanted. So what we're seeing right now and what American voters do not deserve is a Republican Congress that is drenched in tea and drunk on the caffeine of obstruction. And we deserve more than that.\nMARTIN: Let me ask you about this because one person's obstructionism could be another person's principle disagreement. I mean, as I understand it, the crux of the matter is that the conservative Republicans - I mean, this was a minority within the Republican caucus...\nCARDONA: Right. Yes.\nMARTIN: ...That held this up because they felt that it doesn't deal with the real issue, which in their opinion is the Obama Administration's deferred action policy for young migrants which they feel - for people who were brought here as children by their parent - and it's an action to kind of address what a lot of people feel was kind of an unfair situation. And they feel that this what has kind of opened the green light to this movement. And so what's your take on this? Is it obstructionism or is it principal disagreement?\nMINKOFF: Well, can't it be both? I mean, there's a mixture there, I believe, though there are those who are clearly disagreeing in principle. But I think one of the issues here is that the timing is so horrific for this. It wasn't done two months ago, three months ago, four months ago. It's being done the day before or the week before. Those people are going to go back to their districts and face the even more conservative population that they represent. And they're going to be facing some very, very ugly public meetings and very ugly town halls if they're compromising today in a way that if this were February, maybe they could've gotten away with it and moved on and said, we've done the right thing and compromised because we had to and had some time to cool the passions the way the Senate was designed to do and go back to your home district and say, yes, I did that and you disagree with it, but here are the reasons why. If it's the day before, that's tough.\nMARTIN: So you're saying it's a tactical fail?\nMINKOFF: I think so.\nMARTIN: It's a tactical fail. Maria?\nCARDONA: But see, the problem with that is that crises do not follow election calendars. So these leaders were actually elected to deal with problems when they arise. And so our - the electorate expects their leaders to actually be grown-ups and try to put politics aside and deal with the problem at hand.\nMARTIN: Is you're issue here not that they disagree because they're attitude is I don't agree with this approach. I think it's the wrong approach. Is your issue that - what Neil said - they should have brought up these objections sooner or they should have offered an alternative? Or what is it?\nCARDONA: Sure.\nMARTIN: Because what I hear Neil saying is they're going - their constituents agree with them. They don't want them to move forward in a bill they don't agree with.\nCARDONA: Here's the problem. What the president offered - the 3.7 billion dollars emergency funding package - was to do exactly - to deal with this issue, right? To try to solve this problem. The problem at hand is that there is an influx of unaccompanied minors. We need to take care of them in a humane manner. These are children - our most vulnerable. We need to take care of them. We need to house them appropriately. We need to feed them. And then we need to figure out what their status is - whether we need to send them back, which some have been sent back, or whether they need protection because they're going back to violent countries. That was the package. The Republicans wanted to then put in an additional piece of legislation that would have taken away deferred action, like you said. Deferred action is not the problem here. And so that's where I think Republicans are focusing on politics.\nMARTIN: If you're just joining us, we're having our weekly political chat with Maria Cardona and Neil Minkoff - contributor to National Review. Maria Cardona - a long-time Democratic strategist, a former top official in the Department of Commerce and the - what was called the INS, the Immigration and Naturalization Service. So obviously this is a subject that you know quite a bit about. But I don't want to take another step back. Since we've been on the air since 2007, we've covered a number of really big political stories that we were very excited to be able to see up close. I wanted to ask each of you what do you think has been, like, the major political story that's kind of changed the world in the last seven years, which I know is an arbitrary figure that I'm picking just because that's the seven years that we've been on the air. I mean, I'm just thinking obviously the election of the first African American president and - I don't know. Neil, why don't you take that?\nMINKOFF: So it's not so much of a one-time story as much as a demographic issue. But I think it's affecting everything, including what we were just talking about. It's the number of seats in both Houses that are completely safe at all times. Where there's less competition, there's less purple districts, if you will. There are so many - where I live, the districts are blue. Where some of you live, the districts are red. And they're not purple anymore. And the level of ground where it's worth having political arguments is getting smaller and smaller and smaller and it's pushing for this type of Congress that's being more to the extreme on both ends from my opinion.\nMARTIN: Maria, what about you?\nCARDONA: I agree with that. And I think with that comes - with that comes, in 2010, the wave of the election of tea party candidates whose major philosophy is it's my way or the highway. They're complete ideologues. They don't know how to compromise. Compromise for them is a bad word.\nMARTIN: There's no ideologues on the Democratic side? They don't have any of those? No partisans there?\nCARDONA: No, no. There are. But what you have seen, even, is on our side it - our side pales in comparison to the ideologues on their side.\nMARTIN: Neil, do you agree with that?\nMINKOFF: I disagree. I mean, look, I'm the representative libertarian conservative who lives in the Boston suburbs. I walk around Cambridge, Massachusetts, and I'm not exactly seeing a hotbed of moderate compromise.\n(LAUGHTER)\nCARDONA: But see, what you're seeing is but what you're seeing is - you even see this in polls. And even moderate Republicans say that today's Republican Party - Ronald Reagan would've been chased out of it being called a liberal. So there's no question that the Republican party has moved to the right. And I think that the election of President Obama was part in parcel of making that happen.\nMARTIN: Your thought on that, Neil?\nMINKOFF: I think that's just a kind of fun, smart thing to say. In 1964, Barry Goldwater ran for election on abolishing Medicare. And in 2004, George W. Bush stood for reelection on expanding Medicare. That's not a party that's moved to the right.\nMARTIN: OK. We're going to have to leave that there for now. I just wanted to take our last couple of minutes here just for a final thought from each of you. We thought that it would be - we'd like to get some kind of wisdom from you. I mean, politics is about kind of winning and losing. The fact of the matter is, you know, to vote is to decide. And sometimes you're going to win. Sometimes you're going to lose. And we thought that we'd like to ask each of you if you had some advice about moving on.\nCARDONA: I think that in this country, the most important thing that voters can do to make sure that their leaders are held accountable is actually to go out and vote. And Neil brought up demographics. This country is changing in demographics. This country is changing so that the more that those changes are seen in policy and in politics, I think right now, the more partisan it's going to get. We need everybody to get out and vote - all the women, African-Americans, Latinos, young people, gays and lesbians. I think the more that people go out and vote - everybody - then the more robust - and I think the more honest it is that we are going to be able to keep our leaders.\nMARTIN: Neil, what about you?\nMINKOFF: I'd like to see us move our take from what matters in today, tomorrow, the next election cycle, and start thinking in four or five or ten-year blocks of time. You know, what scares me isn't demographic change so much. And it isn't some of those short-term problems with conflict wherever they sprout up. It's I don't have any idea how we're going to pay for Social Security. And I don't know how we're going to pay for Medicare. We need to start thinking about these 10 and 20-year down the road benchmarks if we're going to be able to address them without some sort of crisis.\nMARTIN: What would make that happen? What would make political leaders do that? It's interesting because in the corporate world, there's been a lot of conversation about the need to move the timeline, for people to think about long-term values as opposed to short-term gain. And there are various measures that, you know, shareholders institute to try to push that to happen. What would make a difference?\nMINKOFF: I think one of the things that would make a difference is if we're arguing about things like - what it was - $4 billion for aid to the border. We say $4 billion out of this gigantic federal budget which is X number of billions of dollars, more than half of which is related to entitlement spending. So we start putting everything in context.\nMARTIN: All right. Maria, final thought from you?\nCARDONA: I think that, again, Americans need to hold their leaders accountable. That is, right now, the most important thing. And unfortunately, what we're seeing from this Republican Congress is that they don't want to govern. And Americans really need to have a voice in that, and object if they object. And the way they object is by coming out to vote.\nMARTIN: Hold the line, Maria. Hold the line.\n(LAUGHTER)\nCARDONA: Maria Cardona is a Democratic strategist at the Dewey Square Group. Neil Minkoff is a contributor to National Review Online - a conservative outlet. He's also a health care policy consultant, a regular contributor to our Barbershop roundtable. He's sticking around for that. So thank you both so much for joining us. And our studio audience. Thank you so much for your contributions to the program over the years.\nCARDONA: Thank you. Thank you. Congratulations, Michel.\nMINKOFF: Thank you.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2014/08/01/337092364/is-the-current-gridlock-in-congress-as-bad-as-it-looks"}
