{"authors":["Alison Bruzek"],"date_download":"2018-10-23 05:51:52","date_modify":"2018-10-23 05:51:52","date_publish":"2014-12-06 00:00:00","description":"The iBill, a new currency reader being offered by the U.S. Bureau of Engraving and Printing, aims to change how the blind identify different kinds of bills.","filename":"data/vaneerConsumption/IsThat1or5AskThisMoneyReaderForTheBlind.json","image_url":"https://media.npr.org/assets/img/2014/12/04/ibill_wide-45f36901bc8aed7019f060c42275db4b72b91ba2.jpeg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_alltechconsidered_2014_12_06_368507201_is-that-1-or-5-ask-this-money-reader-for-the-blind_1540273912.html","title":"Is That $1 or $5? Ask This Money Reader For The Blind","title_page":"Is That $1 or $5? Ask This Money Reader For The Blind : All Tech Considered : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Is That $1 or $5? Ask This Money Reader For The Blind\nEnlarge this image toggle caption Claire Eggers/NPR Claire Eggers/NPR\nThe uniformity of dollar bills is great for shoving them all in your wallet after you buy a sandwich. It's not great, however, if you're one of the over 14 million Americans with vision loss and can't tell the denomination.\nFrom a $1 to a $100, \"it weighs the same initially, it's the same dimensions, it's made of the same material ... there is no distinguishing physical marks for individuals who need an alternative means of identifying their currency,\" explains Vencer Cotton, director of technology and training at the Columbia Lighthouse for the Blind in Washington, D.C.\n\"As a rehab therapist,\" he says, \"I always start my financial seminars off by telling my students ... nothing will ever be a trusted pair of eyes.\"\nYet, Cotton thinks there is something that comes pretty close.\nMeet the iBill, a black hunk of plastic about the size of a large cigarette lighter. Equipped with one AAA battery, a couple of buttons and a speaker, the iBill is designed to be simple. A single slot allows for a U.S. bill to be placed inside and upon scanning, the handheld device will say the amount the bill is worth.\nCreated by Orbit Research, it will be the first currency reader distributed by the U.S. Bureau of Engraving and Printing. The bureau will be shipping iBills, free of charge, across the country starting Jan. 2. The bureau has partnered with the National Library Service for the Blind and Physically Handicapped, which already provides braille and audio books to the visually impaired.\nYouTube\n\"This device is my No. 1 choice,\" Cotton says of the iBill, especially when it comes to sorting money as fast as possible without fumbling around after a transaction at the grocery store or the gas station. The other choices include folding bills with different creases to tell them apart or firing up a smartphone app.\nThere are actually a bunch of apps that can do what iBill can, made convenient by the iPhone's voiceover functions. In particular, EyeNote was also developed by the U.S. Bureau of Engraving and Printing to help identify bills. Another app, called LookTel, offers recognition for a multitude of countries' currencies and VisionHunt distinguishes different kinds of bills and offers many tools for the blind.\nBut, \"a lot of blind folks can't afford an iPhone,\" says Shawn Callaway, president of the National Federation of the Blind of Washington, D.C. Over 9 million people with vision loss in the U.S. have a family income of less than $35,000 according to the CDC's 2012 National Health Interview Survey.\n\"People have been very appreciative that we are providing these to them at no charge,\" says Len Olijar, deputy director at the Bureau of Engraving and Printing. He believes it's been received so well because it was already commercially available. \"It wasn't something new that was being developed specifically for [the Bureau],\" he says. \"It was tried and proven tech already in the marketplace.\"\nHowever, even though iBill can identify your money, it doesn't mean it'll tell you if it's counterfeit or even how much you have. As Cotton says: \"The rest of the mathematics is left up to you.\"\nAlison Bruzek is the science desk editorial intern at NPR.org.","url":"https://www.npr.org/sections/alltechconsidered/2014/12/06/368507201/is-that-1-or-5-ask-this-money-reader-for-the-blind"}
