{"authors":["Amy Sciarretto"],"date_download":"2018-10-31 01:50:35","date_modify":"2018-10-31 01:50:35","date_publish":"2018-09-06 12:47:31","description":"Ch-ch-changes are on the horizon. But trust us — these are going to be so, so good. They are upgrades and additional options rather than total overhauls or complete revamps! Kylie Jenner confirmed that the Kylie Cosmetics Lip Kit matte liquid…","filename":"data/vaneerConsumption/IsTheKylieCosmeticsLipKitFormulaChangingTheBrandIsAlwaysUpdatingEvolving.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/e9821a4a-b031-4978-93e2-851fb759f09b-screen-shot-2018-09-06-at-72142-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-the-kylie-cosmetics-lip-kit-formula-changing-the-brand-is-always-updating-evolving-11771135_1540950635.html","title":"Is The Kylie Cosmetics Lip Kit Formula Changing? The Brand Is Always Updating & Evolving","title_page":"Is The Kylie Cosmetics Lip Kit Formula Changing? The Brand Is Always Updating & Evolving","title_rss":"NULL","source_domain":"bustle.com","text":"Ch-ch-changes are on the horizon. But trust us — these are going to be so, so good. They are upgrades and additional options rather than total overhauls or complete revamps! Kylie Jenner confirmed that the Kylie Cosmetics Lip Kit matte liquid lipstick formula is changing. She did so via her brand's official Instagram Story. The makeup guru is also switching up the matching lip liners.\nDO. NOT. FREAK. OUT. RN. Mmmkay?\nIt's true that the original, mega matte, and immovable formula is the cornerstone for the brand and is that which launched a billion dollar beauty biz. It's also the reason that rich, pigmented, and precisely defined pouts have been an enduring and dominant lip trend for the past three years.\nHowever, remember that Jenner has tinkered with and added to her Lip Kit formulas before. There is a whole entire range of Velvet Lip Kits. Those exist separately from the originals. With the Velvets, the texture is lighter, softer, and wears more comfortably. The Velvet Lip Kits are not nearly as long-lasting as the OG LK formula, which doesn’t budge without an assist from a makeup remover! But the Velvets offer the same finish with less drying. They're meant to be re-applied through the day, since a fresh coat of lipstick alway feels good.\nAlso, some of the classic Lip Kit shades, like Candy K, are offered in both formulations. Choices, rather than replacements, abound in the Kylie Cosmetics universe! That's what happening with the new formula and liner edit.\nHere's exactly what Jenner revealed about the new formula. In the IG Story, she stated that she officially made a Kylie Lip Kit — \"a lip kit named after me.\" It's about time. Her Lip Kits are her signature and her hero product. Therefore, to christen one after herself is both a power move and a logistical one. It announces who is in charge.\nJenner described the color, which she confirmed that she is wearing in the Insta story, as a \"new, updated, perfect nude.\" She furthered, \"I am always changing up my nudes. I made my perfect lip liner and matte lipstick combo.\"\nShe is basically saying this is her signature shade and she is ready to share it with all of her customers, Kylie-philes, and makeupistas. It's such a pretty, dusty, and pinky nude.\nShe dropped the bombshell news regarding the formula by confessing, \"The matte lipstick is... although I love my formula, I switched this formula up a little bit. It's coming out pretty soon. I will keep you guys updated.\"\nThere's already a lot to unpack there. She also told viewers that she is launching more Lip Kits. But wait — there's more.\nJenner dropped another huge nugget of info regarding the Kylie Lip Kit, saying, \"I made the lip liner a little darker than the matte lipstick, which is the first time I’ve ever done that.\"\nAfter nearly three years and dozens of shades where the liner perfectly matched the liquid lipstick, she is now offering an accompanying liner that is slightly darker. That allows for more definition and artistic creativity with this Lip Kit.\nIt's a lot to process and to look forward to! Based on this cursory look at the shade, formula, and liner pairing in the Insta story, the nude Kylie Lip Kit is going to be awesome. Jenner did not confirm if the new formula and the different shade of liner is a one-off for this particular color only or if existing and additional new shades will get the same treatment. It's now a game of wait and see.\nRegardless, the brand is never stagnant. It's constantly evolving, innovating, and taking risks — even with its hero products.","url":"https://www.bustle.com/p/is-the-kylie-cosmetics-lip-kit-formula-changing-the-brand-is-always-updating-evolving-11771135"}
