{"authors":["Tai Gooden"],"date_download":"2018-10-31 01:45:23","date_modify":"2018-10-31 01:45:23","date_publish":"2018-09-14 13:50:25","description":"Lifetime is back with another addition to a series of movies about meeting the wrong people. There was The Wrong Crush, The Wrong Man, The Wrong Roommate, The Wrong Son, and most recently The Wrong Cruise. Now, one girl’s senior year of high school…","filename":"data/vaneerConsumption/IsTheWrongFriendBasedOnATrueStoryVivicaFoxSaysThisTerrifyingThillerIsRelatableInManyWays.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/b52fb85b-658a-4d99-a97a-06dfbd337934-vivica-a-fox-wrong-friend-vivica-master-seamless01_16_30_09still008.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-the-wrong-friend-based-on-a-true-story-vivica-fox-says-this-terrifying-thiller-is-relatable-in-many-ways-11906699_1540950323.html","title":"Is 'The Wrong Friend' Based On A True Story? Vivica Fox Says This Terrifying Thiller Is Relatable In Many Ways","title_page":"Is 'The Wrong Friend' Based On A True Story? Vivica Fox Says This Terrifying Thiller Is Relatable In Many Ways","title_rss":"NULL","source_domain":"bustle.com","text":"Lifetime is back with another addition to a series of movies about meeting the wrong people. There was The Wrong Crush, The Wrong Man, The Wrong Roommate, The Wrong Son, and most recently The Wrong Cruise. Now, one girl’s senior year of high school will make a downward spiral when The Wrong Friend debuts on September 14 at 8 p.m. ET. Fans of the franchise probably have one question in mind - is The Wrong Friend is based on a true story? Luckily, it's not based on any particular story, but Wrong franchise producer and actor Vivica A. Fox says this premise might be familiar (to an extent) for some women.\nIn a phone conversation with Bustle ahead of the movie’s release, Fox reveals that she has had some friends who turned out to be nightmares. “Now, you know I've met some wrong friends, child,” says Fox with a laugh. “I think all of us have and that’s why people love the Lifetime movies because they are thrillers that women can relate to.” And, based on The Wrong Friend’s synopsis, she definitely has a point.\nRiley (Li Eubanks) meets Chris (Jared Scott), a handsome and seemingly sweet stranger. He seems like the perfect guy, but she realizes that he might not be Prince Charming after all when she attends his house party. He becomes obsessed with Riley and she races to figure out his next moves before something tragic happens.\nLifetime\nChris is presumably a stalker who can't take no for an answer, which has been a scary and unfortunate reality for countless women. The website also features a clip that will have viewers on the edge of their seats. Riley is sleeping on her couch when a loud noise startles her awake. She checks around her living room and kitchen before she decides to lie back down.\nBut, all is not well because the camera pans to a shadowy figure on her steps. No one speaks in the clip, but there’s sure to be a major confrontation when Chris makes his presence known. It’s a classic Lifetime movie plot and it fits right into the Wrong franchise.\nSpeaking of the series, Lifetime Movies revealed via Twitter that there will be a “So Wrong, It’s Right” marathon starting September 13. Every wrong movie will be aired up until The Wrong Friend’s Friday night debut. Seriously though, if watching Vivica A. Fox movies is wrong, then who really wants to be right? Fox revealed tidbits about her role in this latest movie to Bustle and admitted that her character makes a bad judgement call about Chris.\n“I play Principal Atkins and I make the mistake of enabling someone who has a bad [reputation]. His family has a lot of money and they make a huge donation to a struggling school. So, I kinda look the other way and say “oh, thank you for the big donation and we’ll take him in.’ And he meets one of our students and turns out to be the wrong friend.”\nFox and Scott's onscreen interactions are teased in a Lifetime Twitter preview where she welcomes him into the school. It’s clear that Principal Atkins feels a bit uncomfortable with his disposition, but she says that “everyone deserves a second chance.”\nThe clip gives a deeper peek at Chris, who shows all the signs of a sociopath as he spies on Riley (while rocking shades, of course) and beats himself on the chest while staring in a mirror. At the end, Riley warns him that she will have a surprise for him if he ever touches her again. It all adds intrigue about what happened between them and how Riley is going to get rid of Chris. It’s Lifetime, so the conclusion will surely feature some shocking twists.\nRunning to a friendly guy who turns out to be a terrible person is a real-life issue, but thankfully this movie is not directly based on one woman’s experience. In the end, it’s all for entertainment purposes so don’t feel guilty about parking on the couch and getting caught up in the latest Wrong movie drama.","url":"https://www.bustle.com/p/is-the-wrong-friend-based-on-a-true-story-vivica-fox-says-this-terrifying-thiller-is-relatable-in-many-ways-11906699"}
