{"authors":["Pam Key"],"date_download":"2018-10-30 18:36:24","date_modify":"2018-10-30 18:36:24","date_publish":"2015-01-18 19:50:36","description":"'Is This For Real?' CBS’ Schieffer In Disbelief Over Obama SOTU Proposals","filename":"data/vaneerConsumption/IsThisForRealCBSsSchiefferinDisbeliefOverObamaSOTUProposals.json","image_url":"https://media.breitbart.com/media/2015/01/bobsch.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_18__1540924584.html","title":"'Is This For Real?': CBS's Schieffer in Disbelief Over Obama SOTU Proposals","title_page":"'Is This For Real?': CBS's Schieffer in Disbelief Over Obama SOTU Proposals | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sunday on CBS’s “Face the Nation,” host Bob Schieffer asked White House senior adviser Dan Pfeiffer several times if President Barack Obama was serious about his massive tax increasing policy proposals he plans to unveil in his State of the Union address.\nSchieffer said, “Let’s just start with what the president and the White House said overnight. The president is going to announce a plan in the State of the Union to raise $320 billion in new taxes on the wealthy. That is over ten years, capital gains taxes are going up with this new revenue. He is going to do such things as provide free community college and so forth, for people, new tax breaks for working families and increase childcare credit. I would just ask you this, Mr. Pfieffer, do you in any way, shape or form believe that a new Republican congress is going to do what a congress that had Democrats and Republicans in control would not do? I mean, is this for real? Do you really think there is a chance that something like this could pass?”\nSchieffer continued “Well, regardless of the merits of the plan, do you think this congress would really consider this? I mean, Marco Rubio, you heard his reaction. Paul Ryan, the Republican who is going to be the new chairman of the Ways and Means Committee, his folks have said it is not even serious. What I would ask you, are you laying this out because you think you have a chance to get it passed or just want to draw the contrast between Republicans and Democrats and paint republicans as being a party of the rich?”\nFollow Pam Key on Twitter @pamkeyNEN","url":"https://www.breitbart.com/politics/2015/01/18/is-this-for-real-cbss-schieffer-in-disbelief-over-obama-sotu-proposals/"}
