{"authors":[],"date_download":"2018-10-30 19:19:21","date_modify":"2018-10-30 19:19:21","date_publish":"2016-10-10 13:02:54","description":"Some students and faculty are upset that only one candidate for president is under consideration by...","filename":"data/vaneerConsumption/IsthisbestwaytopicknextpresidentofKennesawStateUniversity.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/10/Images/newsEngin.16411110_ksunight.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_this-b_434ad398337a42ba3b701081ec834fc5__1540927161.html","title":"Is this best way to pick next president of Kennesaw State University?","title_page":"Is this best way to pick next president of Kennesaw State University?","title_rss":"NULL","source_domain":"ajc.com","text":"Some students and faculty are upset that only one candidate for president is under consideration by the Board of Regents, Georgia Attorney General Sam Olens.\nIs this any way to pick a college president? Usually, colleges conduct national searches and consider candidates with backgrounds in higher education. Olens comes from the legal and political realm. The Regents will meet this week to vote on Olens, who has the support of the governor and Chancellor Hank Huckaby.\nWriting in the AJC Get Schooled blog, KSU faculty member Leonard Witt says, “If this secretive, mostly white and male fraternity, votes for a lone white male candidate they will be on the wrong side of history – in a state that has been on the wrong side so often before. Here perhaps is the most apropos example. It’s 1941, Eugene Talmadge is the hateful, racist governor of Georgia. He got word that a university dean and a president favored integration. He tells the BOR to fire them, they refuse. He reshuffles BOR members and then has these new cronies fire the president and dean. There is one problem, the Southern Association of Schools and Colleges accrediting body jumps in and pulls the accreditation of 10 Georgia institutions of higher learning. Their diplomas are worth nothing. The voters take notice and kick Talmadge out of office.”\nTo read more, go to the Get Schooled blog.","url":"https://www.ajc.com/news/local-education/this-best-way-pick-next-president-kennesaw-state-university/W2jyfUKEOgYuE6k63GSuLM/"}
