{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:47:12","date_modify":"2018-10-30 21:47:12","date_publish":"2016-01-22 11:48:11","description":"Among coffee drinkers, there never seems to be a short supply of opinions on what makes the perfect...","filename":"data/vaneerConsumption/IsthisthebestplaceforcoffeeinGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/05/22/Images/WPIMAGE_cmgajcfoodandmore_262.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_th_d94f64ac9b7e1b5152292987858ae7ad__1540936032.html","title":"Is this the best place for coffee in Georgia?","title_page":"Is this the best place for coffee in Georgia?","title_rss":"NULL","source_domain":"ajc.com","text":"Among coffee drinkers, there never seems to be a short supply of opinions on what makes the perfect cup. And whether you like drip or pourover, dark roast or light, you likely have a favorite spot to enjoy your cup of joe.\n<\nDiscovery app Foursquare recently released its list of top spot to get a cup of coffee in every state . The top pick in Georgia? Rev Coffee in Smyrna , which sources and roasts its own coffee, and serves up classic coffee drinks in addition to its pourover and drip options. The spot also features a breakfast and lunch menu, including a variety of baked goods, sandwiches and salads.\nFoursquare users site the coffee (duh), quiche and bacon and cheddar muffins, as well as the atmosphere, as reasons Rev ranks so highly.\n<<6 places to buy coffee beans in Atlanta\nOther top ranked independent spots include Chattahoochee Coffee Company in Atlanta , Reveille Cafe in Marietta and Ray's Donuts in Marietta . Krispy Kreme Doughnuts and Starbucks also got top marks.\nCheck out the full list of Foursquare's top spots for coffee in Georgia here, and let us know your pick for top spots for coffee in the comments.\nMORE:\nAJC's picks for top coffee in Altanta\nHow to make the perfect pourover coffee\n6 places to buy coffee beans in Atlanta\n6 essentials to make the perfect cup of coffee at home","url":"https://www.ajc.com/blog/atlanta-restaurants/this-the-best-place-for-coffee-georgia/SNhRqg339vquLojuzvER8M/"}
