{"authors":["Sophie Mcevoy"],"date_download":"2018-10-31 00:02:43","date_modify":"2018-10-31 00:02:43","date_publish":"2018-10-28 05:41:29","description":"As much as I adore the BBC for making short and succinct dramas, I can't help but get slightly irked when they inevitably end. I'm one of those people that gets incredibly wrapped up in the thrills and suspense of good television, so when it all…","filename":"data/vaneerConsumption/IsTheLittleDrummerGirlBasedOnATrueStoryThisBBCOneThrillerHasSomeIRLEspionageRoots.json","image_url":"https://imgix.bustle.com/uploads/image/2018/10/24/ead665f6-2579-4c3b-8a32-d5701530264b-16741490-low_res-the-little-drummer-girl.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_is-the-little-drummer-girl-based-on-a-true-story-this-bbc-one-thriller-has-some-irl-espionage-roots-12962048_1540944163.html","title":"Is 'The Little Drummer Girl' Based On A True Story? This BBC One Thriller Has Some IRL Espionage Roots","title_page":"Is 'The Little Drummer Girl' Based On A True Story? This BBC One Thriller Has Some IRL Espionage Roots","title_rss":"NULL","source_domain":"bustle.com","text":"As much as I adore the BBC for making short and succinct dramas, I can't help but get slightly irked when they inevitably end. I'm one of those people that gets incredibly wrapped up in the thrills and suspense of good television, so when it all comes to an end I'm left wondering what to do with myself. Thankfully, BBC's latest thriller, The Little Drummer Girl, will be debuting this Sunday (Oct. 26), and of course it's already got me wondering, is The Little Drummer Girl based on a true story?\nWell in a way, yes. The show itself is based on the 1983 John le Carré novel of the same name, which is a work of fiction. But, Carré actually had a career as a spy before he began writing novels, so it seems reasonable to assume he drew on his own knowledge and experience of the field. The author spoke of his past in a documentary about his life story for BBC2 in 2000, which was \"the first time the author [had] explicitly confessed to have been a spy,\" as the Telegraph reported. No wonder his stories feel so real.\nIn true spy fashion, John le Carré is actually the author's pseudonym — David John Moore Cornwell is his actually his real name. While he was working as an officer in MI5 and MI6 in the '40s and '50s, \"he wrote and published his first three novels under the le Carré pseudonym,\" which would see him leave his life as an undercover spy to a \"career as a writer of espionage thrillers which has continued for over six decades.\"\nBBC/The Little Drummer Girl Distribution Limited.\nAnyway, back to The Little Drummer Girl. As le Carré's tenth novel, it marked a departure in setting and style for the author and marked his \"move into fresh and more politically-charged territory,\" rather than another narrative centred around espionage during the Cold War, according to Waterstones.\nInstead, le Carré explores terrorism, seduction, and love through the eyes of a female protagonist, Charlie. Portrayed by Florence Pugh, the English actress is swept away into a life of secret intelligence after being seduced by the enigmatic Kurtz (Alexander Skarsgård) while on holiday in Mykonos.\nBBC/The Little Drummer Girl Distribution Limited\nAnd unlike the highly-successful adaptation of le Carré's The Night Manager, The Little Drummer Girl will stay within the novel's set period of the 1970s. And I don't know about you, but there's just something about the colour palette and stylisation of the '70s that creates a unique aura of magic.\nThat coupled with the legendary Park Chan-wook behind the camera, I feel like this is going to match — or even surpass — the success of The Night Manager. As Skarsgård pointed out in an interview with Digital Spy, the show has a \"very different tone, very different era, very different story. The similarities [to The Night Manager] are in the factory behind it, and obviously it's a John le Carré story,\" he explained.\nBBC/The Little Drummer Girl Distribution Limited.\n\"Park Chan-wook has a very unique style and a unique way of telling a story. So I think it'll set it apart from not only that, but from any other John le Carré work.\" Sign me up.\nThe Little Drummer Girl premieres on Sunday (Oct. 28) at 9 p.m. on BBC One.","url":"https://www.bustle.com/p/is-the-little-drummer-girl-based-on-a-true-story-this-bbc-one-thriller-has-some-irl-espionage-roots-12962048"}
