{"authors":[],"date_download":"2018-10-23 02:45:02","date_modify":"2018-10-23 02:45:02","date_publish":"2017-04-26 13:56:32","description":"The Islamic State group is using weaponised drones to hold off US-backed forces advancing in a key Syrian town, a monitor said Wednesday, a tactic the...","filename":"data/vaneerConsumption/ISusingweaponiseddronestodefendSyriasTabqamonitor.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/13/wire-465313-1493211393-704_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4447672_IS-using-weaponised-drones-defend-Syrias-Tabqa-monitor_1540262702.html","title":"IS using weaponised drones to defend Syria's Tabqa: monitor","title_page":"IS using weaponised drones to defend Syria's Tabqa: monitor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A member of the US-backed Syrian Democratic Forces (SDF) a downed drone, reportedly belonging to the Islamic State group near Raqa on March 29, 2017\nThe Islamic State group is using weaponised drones to hold off US-backed forces advancing in a key Syrian town, a monitor said Wednesday, a tactic the jihadists have also used in neighbouring Iraq.\nWith air cover from the US-led coalition, the Syrian Democratic Forces (SDF) were locked in clashes inside IS-held Tabqa on Wednesday, two days after entering the town for the first time.\nThey initially seized several positions in the town's south but have come up against fierce resistance from the jihadists, including with weaponised drones.\nIS fighters \"are dropping makeshift explosives from drones onto SDF positions,\" said Rami Abdel Rahman, who heads the Syrian Observatory for Human Rights.\nThe jihadist group's propaganda agency Amaq acknowledged several times in April that it was using weaponised drones against Kurdish fighters around Tabqa.\nIn Iraq, IS has used small commercial drones to drop explosives on advancing forces around second city Mosul.\nFighting raged on Wednesday in Tabqa's southern neighbourhoods as SDF forces tried to build on their advance into the town on Monday.\n\"They are progressing slowly because it's all street battles. IS is using suicide attackers and car bombs and have riddled the town with mines,\" said Abdel Rahman.\nThe SDF launched their offensive on Tabqa in late March, when they and allied coalition troops were airlifted behind enemy lines.\n\"US forces are trying to scramble all communication between IS fighters inside Tabqa and those outside,\" said Abdel Rahman.\nThe battle for Tabqa is a key phase of the broader offensive for Raqa, the Syrian heart of IS's so-called \"caliphate\" 55 kilometres (34 miles) to the east.\nThe Tabqa dam -- Syria's largest and just north of the town -- would also be an important prize for the SDF.\nThe assault on Raqa, dubbed \"Wrath of the Euphrates,\" was launched in November and is backed by the US-led coalition's warplanes and special advisors.\nSyria's conflict erupted in March 2011 with protests against the rule of President Bashar al-Assad, but it has since evolved into a multi-sided conflict that has witnessed the rise of jihadist groups.","url":"https://www.dailymail.co.uk/wires/afp/article-4447672/IS-using-weaponised-drones-defend-Syrias-Tabqa-monitor.html"}
