{"authors":["Keertana Sastry"],"date_download":"2018-10-30 23:27:24","date_modify":"2018-10-30 23:27:24","date_publish":"2014-08-13 18:09:58","description":"From day one of So You Think You Can Dance Season 11, this young lady was one of my favorite contestants. In fact, I even boldly stated that I thought Valerie Rockey could be one of SYTYCD's Top 2 girls and possibly even win the whole competition.…","filename":"data/vaneerConsumption/IsValerieRockeyStillAFrontrunnerOnSYTYCDItMightBeTimeToPanicFolks.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/58eafece-fa9a-4847-b2cb-81806419ffd9.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35561-is-valerie-rockey-still-a-frontrunner-on-sytycd-it-might-be-time-to-panic-folks_1540942044.html","title":"Is Valerie Rockey Still A Frontrunner On 'SYTYCD'? It Might Be Time To Panic, Folks","title_page":"Is Valerie Rockey Still A Frontrunner On 'SYTYCD'? It Might Be Time To Panic, Folks","title_rss":"NULL","source_domain":"bustle.com","text":"From day one of So You Think You Can Dance Season 11, this young lady was one of my favorite contestants. In fact, I even boldly stated that I thought Valerie Rockey could be one of SYTYCD's Top 2 girls and possibly even win the whole competition. But after last week's Top 8 competition, I might have to backtrack a bit. Even though her road to the Top 8 has been pretty smooth, her first performance with an all-star left me (and the judges) feeling disappointed to the say the least. So is Valerie still a frontrunner? Considering how much the other dancers are really starting to step it up, I'm worried Valerie's time on SYTYCD could end soon.\nEarlier in the competition, I could have easily told you who would stay and who would go. That's the nature of So You Think You Can Dance: not everyone in the Top 20 is strong enough to get better and there are always a few surprise standouts as the competition progresses. But as it always happens, the most talented dancers are the only few remaining, and now I don't know if I can choose a winner out of this lot anymore. Valerie had so much going for her until just last week, she was paired with a fan favorite, she was proving her talent consistently as being more than just a tapper, and she had an infectious spirit. But what went wrong? We can blame last week's routine with Ade.\nYouTube\nOne routine. That's all it takes to go from top to bottom. And now on Wednesday night, Valerie is seriously in danger of going home. Even dancers like Jessica and Casey, who have consistently been in the bottom, are pulling ahead of Valerie as they progress. While I didn't love Jessica's hip-hop number with Twitch (she clearly felt uncomfortable and didn't seem to have the right amount of fluidity in her body), it impressed the judges enough to give her good review. Plus, Twitch is so good, he can make anyone look better than they are.\nYouTube\nSo what's going to happen with Valerie? To be honest, I have absolutely no idea. She has to first make it through Wednesday night's Top 8 elimination into the Top 6 and simultaneously provide a fantastic routine with her new all-star for the week, Season 6 ballroom alum Ryan. I don't know if she'll get enough votes to stick out for another week, but man do I hope she does. I don't think Valerie is done showing us her talent. I still think there's more to her than meets the eye.\nImage: Adam Rose/Fox","url":"https://www.bustle.com/articles/35561-is-valerie-rockey-still-a-frontrunner-on-sytycd-it-might-be-time-to-panic-folks"}
