{"authors":["Rachel Krantz"],"date_download":"2018-10-30 22:49:23","date_modify":"2018-10-30 22:49:23","date_publish":"2014-08-14 18:03:10","description":"You know, we're marching in pride. This would be a perfect time to try wearing a dress, since you said you've always wondered what it would be like. As I said it, I offered my boyfriend, Alex, a few options, although inside I was rooting for my red,…","filename":"data/vaneerConsumption/ISwappedOutfitsWithMyBoyfriendandTheResultsWereNotQuiteWhatWeExpected.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/f676a31c-4c40-49a7-9bad-9e2dd6ae21f9.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_33200-i-swapped-outfits-with-my-boyfriend-and-the-results-were-not-quite-what-we-expected_1540939763.html","title":"I Swapped Outfits With My Boyfriend, and The Results Were Not Quite What We Expected","title_page":"I Swapped Outfits With My Boyfriend, and The Results Were Not Quite What We Expected","title_rss":"NULL","source_domain":"bustle.com","text":"You know, we're marching in pride. This would be a perfect time to try wearing a dress, since you said you've always wondered what it would be like. As I said it, I offered my boyfriend, Alex, a few options, although inside I was rooting for my red, stretchy halter dress. (It just felt like his color.) He grabbed the dress and threw it in his backpack with our water bottles and sunscreen. Yeah, good idea! I'll see how I feel when we get there.\nWhen we got to the parade, it was hot. Should I put on the dress? he asked. I encouraged him to go for it, and when he changed, I was shocked: I had been prepared to be supportive of Alex playing with gender presentation, but I hadn't expected to actually be attracted to him while he did it. After all, wouldn't he look kind of . . . like a woman?\nNope, not even close. My boyfriend looked like a hot man in a dress, with one progressive, fine ass. (An ass, as it turned out, that looked hotter in the dress than my own.)\n\"To feel that male gaze, and to feel like suddenly your motions, and physical body, and the way you walk and move through the world was sort of being watched ... it was weird.\"\nAlex got a look in his eye. What if you changed into my shorts and tee shirt? It was like he'd read my mind. I was reluctant to give up my dress — I looked cute in it, and it was rainbow — but our experiment was taking on a little life of its own. We wanted to see what it was literally like to walk a few miles in the other person's clothes, to try on — as temporarily and imperfect as it would be — the other person's gender identity.\nI have an idea, I said to Alex, taking our experiment a step further. What if we tried to not just switch outfits — but also perspectives? So, like, occupy the other's role in the relationship throughout the afternoon. Not imitating each other, but with each decision, asking ourselves, what the other person would do?\nBecause I am a very lucky lady, Alex was more than down. I changed into his baggy shorts and tee, and took off my bra. I felt at once invisible, and unconstricted. Nothing was digging into my skin, and no one looked at me.\nThe switch had begun.\nAlex and I talked a few days later about our experiment, and I recorded our reflections. Here's what we learned about gender, the male gaze, and our relationship.\nRachel: So, how did it feel to put a dress on?\nAlex: The first thing I noticed was how easy-breezy I felt. Like, the only thing that was really restrictive was the waistband. There was this feeling of lightness, kind of like wearing very little, which was nice.\nWas anything annoying about it?\nConstantly rearranging your clothing is just weird. There were moments where I was playing with straps and pulling up my dress— I don’t have cleavage so it's not that big of a deal — but being aware that this or that is showing was a little weird. For me, I just put on a T-shirt and go outside, and that’s me. I don’t have to play with the neckline and cover my chest. Let alone makeup and hair! I can’t imagine.\nSo how did it feel for people to see you in a dress?\nI felt very celebratory because people who I wouldn’t ordinarily make eye contact with on the street were giving me admiring and approving looks, and that caught me off guard at first. It made me smile; I was feeding off of their energy and waving back.\nI remember you turned to me at one point and said, \"The male gaze is weird.\" What did you mean?\nI was just feeling how many men were looking at me. Just walking down the street and catching those solicitous glances — they weren’t even glances, they were stares.\nOne guy winked at you, I saw.\nIt was empowering and disempowering at the same time. On the one hand, you’re receiving this attention, which is nice in a way — it was great to be like the center of attention, but there were moments, especially when I was burning out toward the end, where I really just didn’t want to put all this energy into seeming celebratory and attractive and sultry. I just wanted to walk and feel however I was feeling. And I don’t know whether it was being in the parade or wearing the dress, but I felt like I couldn’t really do that, which was weird.\nBecause you were on display.\nYeah. To feel that male gaze, and to feel like suddenly your motions, and physical body, and the way you walk and move through the world was sort of being watched . . . it was weird.\nSo, what, no more checking girls out?\nThe thing was that I had this revelation of the male gaze — but I still did it, even in a dress! I still checked other women out. [Being stared at] made me much more aware of how women must be feeling when they’re not into it, and that it's just sort of wrong. It was so weird to have that revelation, yet still catch myself doing it.\nHow did it feel to watch me act like you?\nWell, first of all, I was surprised at how good your understanding of the way I behave around you was. You were as chivalrous as I am, maybe even a little more. It took a lot of suspending disbelief to be able to just give you my backpack. And when you offered to put my purse in your bag, I was just like, Whoa, really? I kept on figuring you would get tired of the role and hand me my bag back. But you didn’t and I was surprised — but I was charmed by it.\nI got a taste of how it feels to receive that chivalry, and it does feel nice. I did feel taken care of, and I did feel that sense of abandonment when you went to dance with [your friend] Michelle. I felt like I was alone and on display, a little just . . . not protected.\nR: I was just going to go run off, but then I stopped to make sure you were OK, because I realized that’s what you would do, you wouldn’t just ditch me.\nA: You did run off at first. A part of me was resenting it, but then you stopped and turned around to make sure I was OK. And that made a huge difference. Still, it was a lot easier to be in a dress with you. It was fun in moments [alone], but I felt a little unprotected without you.\nWhat was different for you?\nI noticed the difference in how it felt to walk and how it felt to dance in your clothes. It was different for me walking in something that didn’t show off my body at all — and the freedom that came with the absence of what I’m usually always used to, which is being on some level of display. So I found myself dancing less as if my body was on display and a little more free-form, like you. It was a little easier to not give a shit what people thought of me.\nA: See, I felt that much more self-conscious and restricted dancing. I was trying to feel what it was like to move like a woman, and I found I had a little bit of trouble. I found it hard to play the feminine role and dance in this way that felt empowering. I felt like I was doing it for the crowd and not myself, which I think maybe sometimes women do when they dance.\nR: Or, not even dance, just move through the world. I’m really glad you got to experience that because that’s a fundamental difference that tends to come with being a woman. It’s having an awareness and self-consciousness of How does this look right now, and is it attractive?\nYeah, I almost never think about that.\nHow do you think this experiment will change the way you view gender?\nI think I’ll definitely be more conscious of the way that we interact [as a couple], and generally of how I interact with women in public. It’s weird, it’s like putting on someone else’s glasses — you see things differently. It’s one thing to understand or to listen to their experiences, but it’s another thing entirely to have the embodied experience of dressing like that person.\nWhat about you? How do you feel?\nR: I don't know why, but I feel a little ripped off, almost. It was so much easier for me to occupy being \"you.\" It was so little about the clothing and more about the absence of being on display, which freed me up to pay attention to your personality, and your mannerisms, and how I would behave toward you.\nAnd for you, being \"me\" was to be on display, and to be taken care of. But that’s not really who I am. That’s a lot of what is frustrating about being a woman sometimes — the external becomes the way you are defined.\nA: At the end of it all, it felt like we had gotten two different meals and swapped, and I was trying to figure out who liked their original meal better and who would ask for it back. I think I grew weary of pretending to be you for a few reasons.\nOne was the continual being on display — at first it was exhilarating, but after awhile, it lost [its appeal]. It definitely has its perks, but I just kind of had this recognition of how hard it must be on a daily basis to feel the pressure of maintaining so much consciousness of your physical appearance. That's why I was kind of burning out toward the end.\nSo at the end I was like, I don’t think I want to be a woman anymore.\nYeah, I've had days like that myself.","url":"https://www.bustle.com/articles/33200-i-swapped-outfits-with-my-boyfriend-and-the-results-were-not-quite-what-we-expected"}
