{"authors":["Tracey Cox For Mailonline"],"date_download":"2018-10-23 00:10:01","date_modify":"2018-10-23 00:10:01","date_publish":"2017-04-26 09:26:58","description":"Tracey Cox reveals that a survey of 4,500 people world wide found that couples are becoming more open to 'kinky' sex with preferences including biting, spanking, and indulging in 'nipple play'.","filename":"data/vaneerConsumption/Isyoursexlifelivinguptokinkymillennialstandards.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/25/17/3F98793600000578-0-image-a-81_1493138322959.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4444432_Is-sex-life-living-kinky-millennial-standards_1540253401.html","title":"Is your sex life living up to kinky millennial standards?","title_page":"Is your sex life living up to kinky millennial standards? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'Kinky' sex is more popular than it's ever been, judging by the results of a survey of 4,500 people world wide.\nThe survey by Lovehoney looked at the sexual habits of men and women to find out what their favourite bedtime activities were.\nSpanking, biting, bondage and blindfolds are now the new sexual norm.\nScroll down for video\nA new survey has revealed what the average couple is getting up to in the bedroom and kinky sex is gaining popularity with two thirds of couples revealing they use blindfolds\nWe've come a long way since the 1950s and TV show 'I love Lucy' (1951) when it was considered too rude to show married couples even innocently sitting up in the same bed.\nPre the 60s, oral sex was considered quite daring for the average married couple.\nHistorically and anthropologically, of course, oral sex is nothing new.\nBut it took until the late 50s for it to be seen as 'normal' and an accepted part of foreplay or something you did to your partner to give pleasure.\nBy the post-pill 70s, we'd sexually sprinted ahead to morally dubious 'key parties'.\nMale partners would put their car or house keys into a bowl and at the end of the night, the female partners would randomly select a set and leave with that key's owner.\nReading erotica has also become more acceptable thanks to E.L. James' Fifty Shades of Grey\nKey parties weren't nearly as common as legend would have it but they definitely existed.\nIn the year 2017, we're having more sexual partners, more casual sex, more gay and lesbian relationships and more experimental sex than ever before.\nSo what does the average couple or person get up to sexually these days?Well, any or all of the following…\nSpanking:\nSeventy-five per cent of women have tried spanking compared to 66 per cent of men, according to the study.\nTheories on why a slap on the bottom feels sexy abound and there's a long established link between pleasure and pain.\nPain is one of the strongest sensations you can feel and unlike stroking it doesn't diminish once you're accustomed to it.\nAll this explains why it's the most popular British bondage activity and continuing to enjoy a huge resurgence after publication of E.L.James' Fifty Shades trilogy.\nWhich leads me nicely into the next point…\nTracey Cox (pictured) says that biting has become a way indulging our 'primitive' side\nReading erotica:\nAnyone remember Shirley Conran's book Lace?\nOne of the first mainstream books to give women permission to be single, have sex and be successful, it used to be passed around 14 and 15 year-olds in brown paper bags.\nWomen have always read sexy books but books famous for their blatant sex content – like Lady Chatterley's Lover - were generally read in private.\nNot so these days.\nGo onto any tube during Fifty Shades peak popularity (just before digital books exploded) and both men and women could be seen reading the trilogy, shame free.\nBondage:\nSixty-seven per cent of women and 64 per cent of men have tied up their partner or been tied up themselves.\nFifty Shades helped push bondage from something adventurous couples did to what the average couple now do.\nTie-up games are about power: having it, relinquishing it.\nIt's especially arousing if you swap your usual sexual roles and the person who's the 'boss' is the one who's restrained.\nBlindfolds:\nTwo-thirds of couples world-wide report using blindfolds during sex and it's the third most popular 'kink' for men.\nRemoving the sense of sight works well for lots of couples, particularly if one or both are shy.\nNo eye contact generally means no embarrassment, so a blindfold means you're able to try out things you'd normally be too shy to.\nBiting:\nAnimals bite each other before and during sex and humans are no different: 56 per cent of us have bitten or been bitten by a partner.\nAs a teen, this meant telling, purplish bruises on the neck.\nAdults are less inclined to leave evidence but lots of people bit each other's lips, necks or other parts, indulging the primitive, 'animal' side in all of us.\nNipple play:\nBlame Miley Cyrus for this trend.\nAfter her 2015 appearance on Jimmy Kimmel's chat show wearing heart-shaped nipple 'pasties', nipple tassles moved from the strip clubs into bedrooms everywhere.\nSales of nipple clamps have also soared.\nUsing sex toys together:\nVibrators, previously relegated to being buried in a bedside drawer, are now being used regularly by couples during sex sessions.\nThe happy result is an evening of the orgasm scales which have always traditionally dipped severely on the woman's side.\nAcceptance of 'weird' fantasies:\nThe Journal of Sex Research (2016) reported that nearly half of all adults have 'unconventional' fantasies.\nThe same study showed a higher than usual interest in other 'kinks' like voyeurism (watching others have sex), fetishism (needing to wear or touch an object to become aroused) and frotteurism (secretly rubbing your genitals against someone else to become aroused).\nSexting:\nNearly 50 percent of US adults have used their mobile to send or receive explicit text messages or photographs from someone.\nTaboos around anal sex have also all but disappeared\nIt's becoming the norm for anyone in their early 20s or under.\nHaving grown up with pornography a click away, nakedness and sex isn't the big deal it was for previous generations.\nBottom obsessions:\nFor the first time butt implants are replacing breast implants with Kardashain-style exaggerated buttocks seen as sexier than the previously worshipped tiny bottom.\nTaboos around anal sex have also all but disappeared.\nBi-curiosity:\nMost of us live in a LGBT (lesbian, gay, bi-sexual and transgender) society that makes it more acceptable to explore sexual urges that aren't mainstream.\nThe Sunday Times ran a feature on Deborah Harry (the singer Blondie) last weekend and the fact she'd had relationships with both men and women warranted a mere one sentence.\nHaving sex with the same sex is no longer a big deal and the percentage of people admitting to bi-curious encounters is rising.\nTinder:\nHook up apps like Tinder have become so mainstream, they've moved into being dating apps.\nUnder 25s use them to find both love and sex and don't have an issue with either function.\nNetflix and chill:\nIf you're under 25, you'll know this is code for an invitation to have casual sex.\nThe new version of the old 'Would you like to come up for coffee?'\nIt reflects a generation that sees a 'booty call' as nothing to be ashamed of (though, not surprisingly, men embrace this attitude more readily than women).\nFind more of Tracey's articles about sex, love and relationships and her product range at traceycox.com.","url":"https://www.dailymail.co.uk/femail/article-4444432/Is-sex-life-living-kinky-millennial-standards.html"}
