{"authors":["Associated Press"],"date_download":"2018-10-23 04:36:25","date_modify":"2018-10-23 04:36:25","date_publish":"2016-01-28 20:41:05","description":"MILAN (AP) — French far right leader Marine Le Pen is in Italy headlining a convention of European far-right parties, just weeks after her National Front suf...","filename":"data/vaneerConsumption/ItalyhostsEuropeannationalistsat2dayconvention.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:dfef8beb37ef415194dde6ffd71fb396-4PuZeKVXE7cd9005b2c87611c242-193_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421657_Italy-hosts-European-nationalists-2-day-convention_1540269385.html","title":"Italy hosts European nationalists at 2-day convention","title_page":"Italy hosts European nationalists at 2-day convention | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Italy hosts European nationalists at 2-day convention\nMILAN (AP) — French far right leader Marine Le Pen is in Italy headlining a convention of European far-right parties, just weeks after her National Front suffered a stinging defeat in regional French elections.\nLe Pen was joined Thursday by Matteo Salvini, the leader of Italy's Northern League, which shares the Front's anti-immigrant and Euroskeptic line.\nIn opening remarks, Le Pen said the influx of migrants arriving on the continent would \"impoverish European nations and kill their civility forever.\"\nFrench National Front president Marine Le Pen, center, Italy's Northern League leader Matteo Salvini, right, and Chairman of the Freedom Party of Austria Heinz Christian Strache pose at the end of the Europe of Nations and Freedom movement meeting in Milan, Italy, Thursday, Jan. 28, 2016. (AP Photo/Antonio Calanni)\nThe rally is being billed by organizers as the first congress of the Europe of Nations and Freedom group within the European Parliament, which was formed last year.\nDemonstrators launch flares outside the building where the meeting of the Europe of Nations and Freedom movement is taking place, in Milan, Italy, Thursday, Jan. 28, 2016. (AP Photo/Luca Bruno)\nFrench National Front president Marine Le Pen, right, smiles with Italy's Northern League leader Matteo Salvini in background, at the end of Europe of Nations and Freedom movement meeting in Milan, Italy, Thursday, Jan. 28, 2016. (AP Photo/Antonio Calanni)\nItaly's Northern League leader Matteo Salvini speaks during the Europe of Nations and Freedom movement meeting in Milan, Italy, Thursday, Jan. 28, 2016. (AP Photo/Antonio Calanni)","url":"https://www.dailymail.co.uk/wires/ap/article-3421657/Italy-hosts-European-nationalists-2-day-convention.html"}
