{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:07:35","date_modify":"2018-10-30 21:07:35","date_publish":"2016-06-03 12:52:50","description":"Italian officials are defying calls to boycott Israel by sending the largest ever delegation of Italian academics and researchers to visit.","filename":"data/vaneerConsumption/ItalyCombatsAntiIsraelBoycottsBySendingDelegation.json","image_url":"https://media.breitbart.com/media/2016/02/netenyahu.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_06_03__1540933655.html","title":"Italy Combats Anti-Israel Boycotts By Sending Delegation","title_page":"Italy Combats Anti-Israel Boycotts By Sending Delegation","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Italian officials said they are defying calls to boycott Israel by sending the largest ever delegation of Italian academics and researchers to visit the Jewish state this week.\nA series of conferences and events will take place across the country over four days in which Italian researchers and their Israeli counterparts will share the latest innovations in a range of fields, from robotics to medical technology.\n“We thought that the best answer would be action: to concretely do exactly the opposite of what some people ask us to do and bring a significant number of Italian researchers and academics to Israel,” Francesco Talo, the Italian ambassador to Israel, told Haaretz. “Everybody is free to say what they want, but we will respond with actions.”\nThe Boycott, Divestment and Sanctions (BDS) movement has had less success in Italy than elsewhere in Europe. Nevertheless, 300 Italian professors and researchers signed a petition earlier this year to cancel academic cooperation agreements with Israel universities.\n170 scholars from 50 Italian universities signed the boycott to take a stand against “intolerable human rights violations” against the Palestinians.\nLast year, Italian Prime Minister Matteo Renzi spoke out in the Knesset against “stupid” boycotts, saying that that BDS supporters only harm themselves and their own futures.\n“It’s an unprecedented effort to respond concretely on a very delicate issue,” Ambassador Talo told Haaretz. “We believe that research and universities should be free and open to dialogue and exchange.”\nOn Thursday morning the delegation is scheduled to gather at the Peres Center for Peace in Tel Aviv, to sign three cooperation agreements in the fields of material sciences and biophysics between Italian and Israeli universities.\nAccording to Haaretz, the signing event was scheduled to coincide with Italy’s national day, and will also be marked with other celebrations including the presentation of the recent Italian translation of the Talmud and an Italian folk dancing festival in Tel Aviv.","url":"https://www.breitbart.com/middle-east/2016/06/03/bds-fail-italy-combats-anti-israel-boycotts-by-bringing-huge-academic-delegation-to-israel/"}
