{"authors":["Associated Press"],"date_download":"2018-10-23 01:48:45","date_modify":"2018-10-23 01:48:45","date_publish":"2017-04-26 12:30:48","description":"MILAN (AP) - Italy's economic development minister says that failing airline Alitalia will receive a government bridge loan to keep it operational while a...","filename":"data/vaneerConsumption/ItalypreparesbridgeloantokeepAlitaliaflying.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/12/wire-464845-1493206252-350_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447390_Italy-prepares-bridge-loan-Alitalia-flying_1540259325.html","title":"Italy prepares bridge loan to keep Alitalia flying","title_page":"Italy prepares bridge loan to keep Alitalia flying | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MILAN (AP) - Italy's economic development minister says that failing airline Alitalia will receive a government bridge loan to keep it operational while a new owner is sought.\nCarlo Calenda told Radio 24 on Wednesday that a loan of 300 million to 400 million euros ($326 million-$435 million) would keep the airline flying for six months under receivership.\nAsked if German airline Lufthansa was interested in buying the company, Calenda gave a quick \"I hope,\" then added more cautiously, \"It would be interesting to explore.\"\nFILE - In this Monday, Oct. 20, 2014 file photo, an Alitalia plane waits on the tarmac of the Malpensa international airport, in Milan, Italy. Alitalia says it's still flying normally for now, after employees rejected a government-brokered deal of salary cuts and layoffs cuts aimed at avoiding bankruptcy for Italy's financially troubled flagship airline. (AP Photo/Antonio Calanni, File)\nItaly's flagship airline is on the verge of bankruptcy after workers rejected a government-brokered deal that would have unlocked 2 billion euros in investments from its managing shareholder, Etihad, and a consortium of Italian businesses, led by Italian banks UniCredit and Intesa SanPaolo, that holds a 51-percent share.","url":"https://www.dailymail.co.uk/wires/ap/article-4447390/Italy-prepares-bridge-loan-Alitalia-flying.html"}
