{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 22:23:54","date_modify":"2018-10-30 22:23:54","date_publish":"2016-12-13 00:00:00","description":"UniCredit is cutting 14,000 jobs and raising €13 billion (£11 billion) in a record share sale as part of a plan to streamline its business.","filename":"data/vaneerConsumption/Italysbiggestbankistryinga13billionfixforitsbaddebtproblem.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_unicredit-cuts-14000-jobs-and-aims-to-raise-13-billion-in-restructuring-plan-2016-12_1540938234.html","title":"Italy's biggest bank is trying a €13-billion fix for its bad debt problem","title_page":"    Unicredit cuts 14,000 jobs and aims to raise €13 billion in restructuring plan - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The skyline of Porta Nuova's district is seen in Milan, northern Italy March 5, 2015. REUTERS/Stefano Rellandini UniCredit is cutting 14,000 jobs and raising €13 billion (£11 billion) in a record share sale as part of a plan to streamline its business and restructure its balance sheet.\nThe move comes at a pivotal moment for the Italian banking sector, which is weighed down with bad debt and low profitability and buffeted by political instability.\nThe bank, Italy's biggest will make the cuts over two years and will aim to boost its capital ratio - a measure of financial strength - and pay investors a dividend by 2019.\nThe lender plans shut down around a quarter of its 3,800 branches, while the 14,000 job losses represent around 11% of the lender's total staff.\nChief executive Jean Pierre Mustier said it was a \"pragmatic plan based on conservative assumptions, with tangible and achievable targets,\" according to a BBC report.\nThe Italian banking crisis is coming to a head after the resignation of former Prime Minister Matteo Renzi last week. Banca Monte dei Paschi, the world's oldest lender and Italy's third-biggest bank, is attempting to raise €5 billion by the end of the year to stay in business.\nThe sector is carrying more than €300 billion in non-performing loans and may ultimately need an injection of around €52 billion, according to Deutsche Bank analyst Paola Sabbione.\nRenzi resigned after losing a referendum aimed at restructuring the Italian parliament.\nMustier told the Financial Times: 'The referendum was a No but it doesn't change our business model. The Monte dei Paschi situation will be solved, and by the year-end. There will be no overhang from Monte dei Paschi.\"\nHere is what happened to Unicredit shares on the news:","url":"https://www.businessinsider.com/unicredit-cuts-14000-jobs-and-aims-to-raise-13-billion-in-restructuring-plan-2016-12"}
