{"authors":[],"date_download":"2018-10-30 20:10:36","date_modify":"2018-10-30 20:10:36","date_publish":"2016-01-24 08:59:05","description":"Italy's battle over legalising same-sex civil unions is about to get heated, with supporters and opponents ready to take to the streets as lawmakers address the issue.","filename":"data/vaneerConsumption/ItalyBattleOverGayCivilUnionsHeadsfortheStreets.json","image_url":"https://media.breitbart.com/media/2016/01/Screen-Shot-2016-01-23-at-16.37.12.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_01_24__1540930236.html","title":"Italy Battle Over Gay Civil Unions Heads for the Streets","title_page":"Italy Battle Over Gay Civil Unions Heads for the Streets","title_rss":"NULL","source_domain":"breitbart.com","text":"Italy’s battle over legalising same-sex civil unions is about to get heated, with supporters and opponents ready to take to the streets as lawmakers address the deeply divisive issue.\nItaly is the only major Western European country not to have enacted legislation allowing gay couples to have their relationships legally recognised and protected. A bill, which the Senate will start examining on Thursday, is the first to get to parliament.\nThe draft legislation will enable same-sex couples to commit themselves to one another before a state official, to take each other’s names and, in certain circumstances, adopt each other’s children and inherit each other’s residual pension rights.\n“It is the bare minimum,” said Marilena Grassadonia, chair of the Rainbow Families (Famiglie Arcobaleno) group.\nGabriele Piazzoni, the national secretary of Italy’s biggest gay rights group, Arcigay, calls it a first step towards Italy catching up with its neighbours and ending a situation “that does our country no credit whatsoever”.\nUnder the slogan “Wake Up Italy! It is time to be civil”, supporters of the reform are due to hold demonstrations in 90 towns and cities across the country on Saturday. “We are not trying to make a big impression, it is more about going out and meeting people,” Grassadonia said.\nOpponents of the bill, in contrast, are planning a show of strength at a demonstration scheduled for January 30 in Rome’s Circus Maximus. Hundreds of thousands are expected to attend the self-styled “Family Day,” organised by mainly Catholic groups under the battle cry of “Defend our Children”.\nMassimo Gandolfini, the neurosurgeon who is coordinating the planned rally, says the proposed law will undermine marriage. “It is unacceptable to think of our children, our grandchildren, being taught that there are different models of families,” he said.\nIn Gandolfini’s view, Italy cannot afford to extend the pension inheritance rights currently enjoyed by the married to gay couples who sign civil unions “when we have 1.4 million families living under the poverty threshold.”\n‘Grave and irresponsible’\nAbove all it is the draft legislation’s provision on adoption which provokes the ire of its opponents with the Catholic Church unwilling to accept the principle that, in the eyes of the law, a child can have two fathers or two mothers.\nAngelo Bagnasco, the chair of the Italian conference of bishops, has denounced the whole debate as a “grave and irresponsible distraction from the real problems of the country”.\nIn the world of politics, dividing lines cut across party loyalties. A minority faction within the ruling Democratic Party supports junior coalition partner the New Centre Right (NCD) in opposing a reform championed by Prime Minister Matteo Renzi.\nRenzi, who has allowed his allies a free vote on the “issue of conscience”, can however count on backing from most of the opposition Five Star movement, left-wing fringe parties and even sections of Silvio Berlusconi’s Forza Italia.\nMost observers anticipate Renzi will get the bill adopted in the end.\n“There might not be a government majority in favour, but there is a cross-party one,” said Piazzoni.\nThousands of amendments slowed the bill’s journey through the parliamentary committee stage and more of the same is expected when it goes before the Senate and the lower house Chamber of Deputies.\nOne group of senators has already tabled a revision to the text that would effectively criminalise gay couples who go overseas to obtain the services of a surrogate mother in order to have a child.\nWhatever the outcome of the parliamentary battle, that is unlikely to mark the end of the war.\nOpponents of the law have promised a legal challenge to any arrangements for same-sex couples that they consider to closely resemble marriage, defined by the constitution as being a contract between a man and a woman. Even if that fails, they will have the option of trying to initiate a referendum to get the law overturned.\n“Those who are convinced they would win a referendum will see a bomb go off in their hands,” Gandolfini predicts.\nOpinion polls are variable, but tend to indicate a slight majority of voters back the principle of gay civil unions. The electorate appears, however, to be more evenly divided on extending adoption rights.","url":"https://www.breitbart.com/europe/2016/01/24/italy-battle-over-gay-civil-unions-heads-for-the-streets-2/"}
