{"authors":["Associated Press"],"date_download":"2018-10-23 00:23:31","date_modify":"2018-10-23 00:23:31","date_publish":"2017-03-10 06:49:08","description":"GUADALAJARA, Mexico (AP) - John Andreoli capped Italy's five-run rally in the ninth with a two-run single , lifting his team to a wild 10-9 victory over...","filename":"data/vaneerConsumption/Italyscores5in9thtotopMexico109inGroupD.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300166_Italy-scores-5-9th-Mexico-10-9-Group-D_1540254211.html","title":"Italy scores 5 in 9th to top Mexico 10-9 in Group D","title_page":"Italy scores 5 in 9th to top Mexico 10-9 in Group D | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"GUADALAJARA, Mexico (AP) - John Andreoli capped Italy's five-run rally in the ninth with a two-run single , lifting his team to a wild 10-9 victory over Mexico on Thursday night in the first game of Group D in the World Baseball Classic.\nFrancisco Cervelli sparked Italy's big inning with a leadoff double against Roberto Osuna. Chris Colabello followed with a double, advancing pinch-runner Sebastian Poma to third. Alex Liddi then hit a two-run double to make it 9-7. Drew Butera reached on an error and Drew Maggi walked to load the bases.\nOliver Perez came in and allowed an RBI single to Brandon Nimmo to make it 9-8 before Andreoli's clutch swing.\n\"For some reason, any time Italy wins, it's a big surprise. It's been like that for eight years now. The only ones that are not surprised, it's these guys, because they're playing to win,\" Italy manager Marco Mazzieri said. \"They're playing to win every pitch. And sometimes we're able to make it, sometimes we don't make it. But they play to win, and they showed it tonight.\"\nItaly leads Group D. Venezuela and Puerto Rico will play on Friday night.\n\"We play until the last out, it's something we talked about from long before the tournament started,\" Colabello said. \"One of the things we have to do is we have to grind. We might not be as talented as other teams, but I think it's really important that we play every pitch, we play every inning, we play every out, and I think no matter what the scoreboard says, it's our responsibility to go out every day and give our best at-bats.\"\nMexico will try to get its first win of the tournament on Saturday against Puerto Rico.\n\"Next game is going to be like a Game 7 of the World Series. We cannot change the outcome, but we're going to try to stay positive,\" Mexico manager Edgar Gonzalez said. \"The next game is the most important game for us and I know that this team is not going to bow down.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4300166/Italy-scores-5-9th-Mexico-10-9-Group-D.html"}
