{"authors":["Jim Edwards"],"date_download":"2018-10-30 20:45:56","date_modify":"2018-10-30 20:45:56","date_publish":"2016-12-28 00:00:00","description":"In the US, anger of moral hazard failures led to Donald Trump. In the UK, it led to Brexit.","filename":"data/vaneerConsumption/Italy20billionMontedeiPaschibailoutisanexperimentinmoralhazard.json","image_url":"https://amp.businessinsider.com/images/5863b420dd08954f7f8b48d3-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_italy-monte-dei-paschi-bailout-moral-hazard-2016-12_1540932356.html","title":"Italy: €20 billion Monte dei Paschi bailout is an experiment in 'moral hazard'","title_page":"    Italy: €20 billion Monte dei Paschi bailout is an experiment in 'moral hazard' - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Beppe Grillo, the anti-moral hazard candidate. Reuters / Giorgio Perottino The price of the government bailout of Monte dei Paschi, Italy's oldest bank, went up from €5 billion to €6.5 billion euros ($6.8 billion) this week.\nThat happened after the European Central Bank discovered that MPS's capital shortfall was €8.8 billion, and not the expected €5 billion euros.\nThere has been a \"rapid deterioration\" in MPS's outlook, according to the Financial Times.\nThe government has so far allocated €20 billion to bail out all its banks — which are riddled with non-performing loans — but the actual amount the system may need to avoid collapse is probably nearer €52 billion, according to Barclays bank analysts Fabio Fois and Giuseppe Maraffino.\nThere are €360 billion-worth of impaired loans in the entire system, the equivalent of about 20% of Italian GDP. So the crisis is big enough to affect the entire Italian economy if it is mishandled.\nBut the more damaging fallout may be political rather than financial. The bailout is essentially a €20 billion bet that Italian voters don't care about \"moral hazard.\"\nMoral hazard is the concept that occurs when someone is protected from the consequences of the risks they are taking. It suggests that the more you are insulated from the downside of your risks, the more risks you are likely to take, exacerbating the consequences of your actions.\nHistory has some tough lessons for politicians who think moral hazard can be ignored. During the 2008 financial crisis there was a lot of discussion about moral hazard and banks, spurred by the great bailouts of AIG and Citi in the US, and Lloyds and RBS in the UK. The US \"troubled asset relief program\" cost $426 billion (£347 billion); the UK bank rescue package cost £500 billion.\nThe bailouts successfully stabilised the global economy. Much of the money has since been recovered from equity and asset sales (TARP actually made a profit).\nBut the political fallout turned out to be much more significant than the financial fallout. The political elite in London, New York and Washington DC assumed the bailouts solved the problem. But among ordinary people, the bailouts created a lasting resentment that some of the richest people on earth could tank the global economy, cause ruinous unemployment and mass evictions, and then somehow be rewarded for it with taxpayers' money.\nIn the US, anger at the bailouts was the spark that caused the creation of the Tea Party, the precursor to Donald Trump's alt-right moment. Rick Santelli's \"Tea Party\" speech in 2009, in which he said, \"the government is promoting bad behaviour,\" is arguably the founding moment of the Tea Party movement in the US.\nEight years later, president-elect Donald Trump's strategy adviser is Steve Bannon of Breitbart. Bannon is a Tea Party supporter who regards UKIP and France's National Front as allies. One of his driving ideological beliefs is that \"crony capitalism\" — where the state takes sides to help some capitalists but not others, as in bailouts — is the worst part of capitalism.\nIn the US the backlash to the bailouts has turned politics on its head. Trump defeated both the Republican party's elite and the Democrats in order to win — a previously unthinkable achievement.\nIn the UK, voters kicked the Labour party out of government in 2010 following the bailout. Then Nigel Farage and UKIP pushed for, and then won, the EU Referendum. That vote was largely interpreted as a big F-you from the working classes to the London elite.\nBut through the prism of the bailouts it was actually their second middle finger to the establishment following 2010. Post-bailout, UK politics has reshaped itself completely with the result that the Labour party and the Liberal Democrats — two former parties of government — are in the process of being wiped off the map.\nNow it is Italy's turn.\nHere is the progress of Beppe Grillo and his anti-establishment Five Star Movement in the polls so far, represented in yellow:\nWikimedia\nWikimedia, CC\nIf history is a guide, Italian voters will become increasingly furious as the government expands its bailout and the Italian economy falters. They will continue their shift toward the anti-establishment candidates — meaning Grillo and the 5 Star Movement.\nThat's why Barclays analysts expect the Italian government to fail to grasp the nettle, they wrote in a pre-Christmas note to clients:\n\"... as elections draw near we expect the government to remain mindful of political costs ‎associated to the eventual decision of injecting state funds in other weak institutions, even if they were to be only partial. In other words, we think the government will continue to tactically delay meaningful but politically costly interventions similar to the one which became inevitable for MPS ...\"\nThere could be snap elections in Italy 2017.\nFrance and Germany have elections in 2017, too.\nYou can see where all this is going because we have been down this road before, in the US and the UK.\nSo next year, expect surprises in Italy.","url":"https://www.businessinsider.com/italy-monte-dei-paschi-bailout-moral-hazard-2016-12"}
