{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 18:48:20","date_modify":"2018-10-30 18:48:20","date_publish":"2015-06-17 12:01:22","description":"Parents from the north of Italy have organized a massive demonstration against gender ideology in schools called “Defend Our Children.\"","filename":"data/vaneerConsumption/ItalianFamiliesProtestForcedCrossDressingofSchoolchildren.json","image_url":"https://media.breitbart.com/media/2015/03/empty-classroom-AP.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_17__1540925300.html","title":"Italian Families Protest Forced Cross-Dressing of Schoolchildren","title_page":"Italian Families Protest Forced Cross-Dressing of Schoolchildren | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Parents from the north of Italy have organized a massive demonstration, called “Defend Our Children,” against gender ideology in schools, which will be held this Saturday in the Saint John Lateran Square in Rome. The demonstrators will be protesting Italian educational programs that are meant to blur the sexual identity of children.\nIn the northern Italian city of Trieste, parents are in uproar over a taxpayer-funded elementary school program that includes dressing little boys as girls and girls as boys to overcome so-called “gender stereotypes.” Schools are calling the exercise “the game of respect,” which purportedly adopts many guidelines from the European standards on sex education, attributed to the World Health Organization.\nThe so-called “game of respect” consists in a box containing several cards, presenting the figures of different working roles: male and female housewives and husbands, male and female plumbers and firefighters, with the figures represented in exactly the same way to show that males and females are completely interchangeable.\nThere is also a card with a game called “If he were she and she were he,” where boys and girls are expected to exchange the clothes they are wearing: the boy dresses as a girl and the girl as a boy, and they discuss how they feel in that new “role.”\nParents are especially up in arms over the school district’s attempt to conceal the program and its contents from them. The father of one of the children, Amedeo Rossetti, said that in early February, he attended a PTA meeting where the program for the second semester was presented. When Rossetti posed specific questions on issues of gender, school administrators categorically denied the presence of gender-based activities at the school.\nOne of the goals of the protesters is the enforcement of European art. 26 regarding “informed consent,” whereby parents can ask the school to be informed before their children are introduced to courses with themes like those regarding gender theory.\nParents are also protesting a sex education program for kindergarten students intended to highlight the similarities and differences between boys’ and girls’ bodies. The program involves one child lying down and the others placing their hand first on the child’s heart to feel how it beats, then on the diaphragm to feel it rise and fall. The text reads that “obviously in the genital area children can see that they are made differently from one another.” Though the text does not specifically state that the children are to touch each other in the genital area, parents are complaining that it is “understood.”\nRossetti says that the upcoming demonstration in the Italian capital is “absolutely essential,” since it is “up to us as parents” to defend our right to oversee the education of our children. The primary responsibility for our children’s upbringing and education “depends on us and we cannot delegate it,” he said.\nThe spokesman for the protest, Prof. Massimo Gandolfini, said that Saturday’s demonstration was organized “to protect our children from the propaganda of gender theories that are appearing surreptitiously and in an ever more worrying way in schools.”\nThe event, he said, will defend the institution of marriage as composed of a man and a woman, the child’s right to have a mother figure and a father, without having to suffer as kindergarteners the propaganda of gender ideology that Pope Francis has defined as “an error of the human mind.”\nJust this past Sunday, Pope Francis spoke out yet again against gender ideology and the right and duty of parents to guide their children’s education, telling them that they are the ones “primarily responsible” for their children’s formation.\nThe Pope said that children today “are beginning to hear strange ideas, a sort of ideological colonization that poisons the soul and the family: we must act against this.”\nFrancis cited a recent case where a good Christian couple with children in the first and second grade had to “re-catechize” their children in the evenings, to counteract what they were receiving “from some teachers of the school or from the textbooks that they were using.”\n“This ideological colonization,” he said, “does great harm and can even destroy a society, a country or a family.”\nFollow Thomas D. Williams on Twitter @tdwilliamsrome.","url":"https://www.breitbart.com/national-security/2015/06/17/italian-families-protest-forced-cross-dressing-of-schoolchildren/"}
