{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 18:48:17","date_modify":"2018-10-30 18:48:17","date_publish":"2016-07-19 18:57:47","description":"Politicians, headed by openly gay senator Senator Sergio Lo Giudice of the Democratic Party (PD), presented the bill titled “norms countering sexual orientation conversion therapies for minors.” Lo Giudice says gender therapy looking to cure gays and lesbians is “medieval and anti-scientific.” | National Security","filename":"data/vaneerConsumption/ItalyProposesJailSentencesforGenderTherapy.json","image_url":"https://media.breitbart.com/media/2016/07/GettyImages-543007502.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_07_19__1540925297.html","title":"Italy Proposes Jail Sentences for ‘Gender Therapy’","title_page":"Italy Proposes Jail Sentences for ‘Gender Therapy’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A group of left-wing Italian senators and parliamentarians are promoting a bill that would impose harsh fines and jail sentences on anyone who would attempt to modify the sexual orientation of a child through so-called “conversion therapy,” even if the child or his parents request it.\nOn July 14, the politicians, headed by openly gay senator Senator Sergio Lo Giudice of the Democratic Party (PD), presented the bill 2402 titled “norms countering sexual orientation conversion therapies for minors.”\nLo Giudice slammed critics of the bill, saying that gender therapy looking to cure gays and lesbians is “medieval and anti-scientific.”\nThe bill comprises three articles, which lay out the scope of the proposed law and the sanctions to be applied in the case of its violation. The law specifies sanctions of up to 2 years in prison and fines ranging from 10,000 to 50,000 euros, along with suspension from the profession, in the case where the offender was a psychologist, psychiatrist, educator, therapist, counselor, teacher or social worker.\nBy “conversion” of sexual orientation, the bill understands “any practice aimed at changing the sexual orientation of an individual, including attempts to change behavior or gender expressions, or to eliminate or reduce the emotional attraction, emotional or sexual towards individuals of the same sex, the opposite sex or both sexes.”\nCritics of the bill have pointed out that the capaciousness of that definition means that parents refusing to dress their underage sons or daughters in outfits typical of the opposite sex would be criminally liable.\nOthers have noted that the group of legislators have bought into the ideological premise that homosexual tendencies are normal and psychologically healthy, tied to the 1973 decision of the American Psychiatric Association (APA) to remove homosexuality from the list of pathologies in the Diagnostic and Statistical Manual of Mental disorders (DSM). They further pointed out that the APA decision was not the result of any particular scientific findings but rather a political choice in response to insistence from pressure groups.\nTestifying as an expert witness, psychologist Vittorio Lingiardi stated that “‘reparative therapies’ should only be used on what is broken, and the homosexual orientation is a natural variation of sexual orientation.”\nMario Marco Canale, president of the LGBT lobby group ANDOS, took advantage of the situation to contrast the proposal to what was happening in the United States at the Republican National Convention.\n“It is significant that on the very day of Donald Trump’s delirium,” Canale said, “who in his governing program wishes to uphold conversion therapy and annul marriage equality, in Italy we see the first bill to counteract the ruin of the lives of hundreds or perhaps thousands of adolescents.\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/national-security/2016/07/19/italy-proposes-jail-sentences-gender-therapy/"}
