{"authors":["Valentina Za","Stephen Jewkes"],"date_download":"2018-10-30 21:28:13","date_modify":"2018-10-30 21:28:13","date_publish":"2016-12-20 00:00:00","description":null,"filename":"data/vaneerConsumption/Italyisplanninga20billionbailoutforitsstrugglingbanks.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_italian-government-seeks-approval-for-20-billion-bailout-for-banks-2016-12_1540934893.html","title":"Italy is planning a €20 billion bailout for its struggling banks","title_page":"    Italian government seeks approval for €20 billion bailout for banks - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"An outside shot of the headquarters of Banca Monte dei Paschi di Siena. Will Martin/Business Insider The Italian government decided on Monday to seek parliamentary approval to borrow €20 billion (£16.8 billion, $20.7 billion) to underwrite the stability of its wobbly banking sector, starting with a likely bailout of number three lender, Monte dei Paschi di Siena, as early as this week.\nMonte dei Paschi, recently judged the weakest of the European Union's major banks, needs to dispose of a mountain of bad loans and raise €5 billion (£4.2 billion, $5.1 billion) in capital by the end of this month or else face the risk of being wound down by the European Central Bank.\nItaly's Economy minister said on Monday the money it was seeking could be used to guarantee adequate liquidity in the banking system.\n\"These resources could also be used as part of a programme to boost capital at banks,\" he said in a press conference.\nA government bailout could come as early as this week, if Monte dei Paschi fails to pull off its own privately funded rescue plan.\nBut it could prove to be politically explosive for the week-old administration of Prime Minister Paolo Gentiloni, given that investors are required to bear losses under EU bailout rules.\nEarlier on Monday, however, the bank received some rare good news in relation to its faltering rescue plan. A key investor that was reconsidering its commitment to the plan issued a statement saying that its concerns had been resolved.\n\"(Quaestio)... has agreed to approve the Term Sheet for the senior bridge loan as agreed with the financing banks,\" the investor, private bank rescue fund Atlante, said.\nAtlante has committed to spending €1.5 billion (£1.2 billion, $1.56 billion) to buy some of Monte dei Paschi's bad loans, despite having expressed \"deep reservations\" in a December 17 letter over the terms of a bridge loan that Monte dei Paschi had secured as part of the sale of bad loans.\nEven with Atlante's commitment to participate in the private rescue bid, Monte dei Paschi is still not assured to raise enough money to avoid the need of a state bailout. Its €5 billion cash call is meant to conclude on Thursday but is not underwritten by a consortium of investment banks.\nMonte dei Paschi shares closed before both Atlante's statement and the government's announcement, having lost 11% and wiped out a week's gains.\nUnder a state bailout, the government would inject capital into Monte dei Paschi only after the forced conversion of €4.1 billion (£3.4 billion, $4.1 billion) worth of subordinated bonds into shares, a source said on Friday.\nAs part of its own rescue plan, Monte dei Paschi has taken out a €4.7 billion (£3.9 billion, $4.8 billion) bridge loan with JPMorgan, Mediobanca, Credit Suisse and HSBC, said another source, familiar with the loan.\nJPMorgan and Mediobanca have been working on the bank's rescue plan and have already come under fire from opposition politicians who object to them earning fees in the event of a state bailout, especially fees accruing on the bridge loan.\nMonte dei Paschi needs the loan to help complete the sale of €28 billion (£23.5 billion, $29 billion) of gross bad debts, which are to be repackaged as debt securities worth €9 billion (£7.5 billion, $9.3 billion).\nThe loan is worth around half of that, but it is secured against all the securities -- which was the source of concern for Atlante, said a source familiar with the matter.\nAtlante, whose shareholders include Italy's top banks and insurers as well as state-owned entities, is due to buy a €1.5 billion tranche of the securities.\nIt could see its notes claimed by the four banks if the bridge loan is not repaid. ($1 = 0.9579 euros)\n(Additional reporting by Paola Arosio and Crispian Balmer; Editing by Mark Bendeich/Keith Weir/Anna Willard)","url":"https://www.businessinsider.com/italian-government-seeks-approval-for-20-billion-bailout-for-banks-2016-12"}
