{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 18:21:10","date_modify":"2018-10-30 18:21:10","date_publish":"2018-08-03 16:30:10","description":"Italy’s Family Minister has called for the repeal of a hate speech law after aggression against a black athlete triggered claims of racism.","filename":"data/vaneerConsumption/ItalyFamilyMinisterCallsforRepealofHateSpeechLaw.json","image_url":"https://media.breitbart.com/media/2018/08/Lorenzo-Fontana.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_08_03__1540923670.html","title":"Italy Family Minister Calls for Repeal of Hate Speech Law","title_page":"Italy Family Minister Calls for Repeal of Hate Speech Law","title_rss":"NULL","source_domain":"breitbart.com","text":"Italy’s Minister for the Family has called for the repeal of a hate speech law after aggression against a black athlete triggered widespread accusations of generalized Italian racism.\nThe Nigerian woman, Daisy Osakue, was injured earlier this week when a man threw an egg at her from a moving vehicle, striking her in the face. According to Osakue’s own account, the aggressor had probably mistaken her for a prostitute. According to reports, some 80 percent of female Nigerian immigrants into Italy wind up in prostitution, often against their will.\nOsakue said she believed the men were “looking for a person of colour, a girl, because that is a zone where girl prostitutes are frequently found, and so usually they are there and they mistook me for one of them and they made this gesture.”\nAfter this aggression, which the General Procurator eventually determined not to be a racist incident, mainstream media began speaking generally of a “racist emergency” in Italy, tying it to the new populist government and its efforts to rein in illegal immigration.\n“The events of the past days make it increasingly clear that racism has become the ideological weapon of the globalists and their lackeys (some journalists and mainstream commentators, certain parties),” wrote Family Minister Lorenzo Fontana in a Facebook post on Friday.\nThe racism card is used “to point the finger at the Italian people, falsely accusing them of every abomination, to make the majority of the citizens feel guilty for their vote and for the intolerable distance from the rhetoric of the groupthink,” he said.\nWar on Free Speech: EU Demands Facebook and Google Censor ‘Illegal’ Speech in One Hour https://t.co/jV90BcG0Ic — Breitbart London (@BreitbartLondon) March 2, 2018\nMr. Fontana has called for the abrogation of the sweeping Mancino law, “which has been transformed into a normative beachhead used by the globalists to disguise their anti-Italian racism as anti-fascism.”\nThe Mancino law prohibits gestures, actions, and slogans supposedly linked to Fascist ideology, whose purpose is to incite violence and discrimination on racial, ethnic, religious, or national grounds.\nThe racism card, Mr. Fontana went on, is “a subtle and dangerous ideological weapon designed to sway opinions.” The front pages of all the newspapers “pointed the finger at the worrying wave of racism, to discover, in a tragic parody, that there was not even the shadow,” he said.\n“If there is any racism, today, it is primarily the one used by the mainstream media against the Italians,” he said. “The reason? A people that do not think all the same way and that are aware and conscious of their own identity and history are scary to the globalists, because they are not exploitable.”\nAmerican mainstream media were quick to denounce Mr. Fontana’s proposal, with the Washington Post claiming that Second World War fascist resistors had called for Fontana’s immediate dismissal.\nThe Post characterized Mr. Fontana as a member of “the far-right League party” who was “facing broad condemnation” after calling for the abolition of a “1993 law condemning racist violence, hatred and discrimination”\nHow they determined that the condemnation is “broad” was not revealed.\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/europe/2018/08/03/italy-family-minister-calls-repeal-hate-speech-law/"}
