{"authors":["Claire Lampen"],"date_download":"2018-10-31 01:39:48","date_modify":"2018-10-31 01:39:48","date_publish":"2018-08-31 16:16:49","description":"In my humble opinion, pads rank as the worst menstrual product available. Personally, I would rather have my blood pool inside me — stored up for release at a moment I can plan — than in my underwear, which obligates me to sit on/in it. As an adult…","filename":"data/vaneerConsumption/ITestedNannoPadMenstrualPadsToFindOutIfTheyCanReallyReducePeriodPain.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/31/1edb3d6e-10e3-494f-849e-14038dfe2390-nannocare-4-19-18_11254025x05x-1-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_i-tested-nannopad-menstrual-pads-to-find-out-if-they-can-really-reduce-period-pain-10057692_1540949988.html","title":"I Tested NannoPad Menstrual Pads To Find Out If They Can Really Reduce Period Pain","title_page":"I Tested NannoPad Menstrual Pads To Find Out If They Can Really Reduce Period Pain","title_rss":"NULL","source_domain":"bustle.com","text":"In my humble opinion, pads rank as the worst menstrual product available. Personally, I would rather have my blood pool inside me — stored up for release at a moment I can plan — than in my underwear, which obligates me to sit on/in it. As an adult woman who has of course used menstrual pads before, I harbor the irrational suspicion that placing the bulk of my body weight on a full pad will be like stomping on a saturated sponge: Blood oozing out all its pores. I anticipate this even though I, too, have seen the myriad commercials advertising liquid-trapping cores and despite the fact that I have never experienced such sanguine burbling in the roughly 17 years I've been menstruating and (when forced) using pads.\nSo when I received an email from Nannocare, a purveyor of menstrual pads that purportedly ease cramps, I felt equal parts irked and intrigued. Spend my next period swaddled in a demi-diaper? Pass. Potentially mitigate the monstrous, body-crimping pain that tends to accompany my periods? Ugh fine I'll do it, anything for science. And so the company kindly sent me some trial packages of their NannoPad, which I cracked open in early August.\nI did so with much skepticism, because how could a pad — an absorbent, adhesive strip that catches blood as it drips from your undercarriage — do anything to ease the internal workings of my uterus? I'm not meant to stick this puppy to my abdomen like a little, disposable heating pad, after all. Could this admittedly slim catch-all radiate heat powerful enough that I might feel it in my uterus? Do I want a small furnace so close to my vagina?\nHow Do NannoPads work?\nWanting answers, I asked the company how its product works; in response, they sent me a brief white paper detailing the effects of far infrared radiation (FIR), a form of radiant heat the skin detects and absorbs, on period pain. The paper contends that FIR has shown some promise in treating dysmenorrhea — or, uncommonly painful periods — and diminishing blood flow. With that in mind, the company designed a pad that incorporated FIR technology into its design, and tested it with 52 subjects in the UK (over the course of two to three menstrual cycles). Participants reported less intense period pain, lighter flow, less constipation, fewer mood swings, and a significantly reduced need for pain medication. Similarly, surveys of 24 U.S. and 161 Shanghai subjects found NannoPad use corollated with less pain.\nAll of which sounds great, but it doesn't entirely explain how the product actually works. What am I putting on my labia? The website points to hypoallergenic, all-natural, additive- and toxin-free fibers — still vague — with \"lab tested compounds\" and \"micron sized nanoparticles\" embedded in them. I do not know how that sounds to you, but it's word salad to my ears.\n\"The gray strip in the Nannopad is the source of the technology,\" Dr. Sherry Thomas, the aforementioned paper's author, tells Bustle. \"It contains proprietary material made of carbon and other organic particles that naturally absorb and also emit FIR energy.\"\nNannopad absorbs the FIR energy our bodies radiate, and zaps a more amplified version of it (thanks, proprietary strip) up into the pelvic floor muscles, \"much like a tiny, targeted heating pad,\" Thomas says.\n\"Have you ever seen one of those aluminum 'emergency' blankets that weigh about three ounces and fold into a pocket?\" she says. \"They work by holding in and reflecting your own body heat. The principle behind the Nannopad is similar.\"\nPutting NannoPad To The Test\nNannocare\nParticipants in the NannoPad studies charted their pain over multiple cycles, while I tracked only one. But, because I remember roughly five things from my high school science class, I did purchase a control: Always Ultra Thin Maxi Pads (Super, because I'm not here to play), which, of the selection available at my local bodega, seemed closest to the NannoPad in terms of thickness. And then I waited for the cramps to set in — and on Wednesday, Aug. 8, they made their extremely unsubtle entrance. I woke up with some preliminary spotting and grabbed one of the NannoPad panty liners I'd be sent (which are apparently intended for use in the days leading up to your period, but fine print has never been my jam). That held for most of the day, and although I did not feel particularly crampy, I cannot say whether or not that's thanks to the product or the fact that the storm was still gathering on the horizon. Regardless, it hit that evening.\nOn my way out the door around 7 p.m., a meaty, invisible fist clinched my uterus, doubling me over in the bathroom doorway. This was the first in an hours-long series of very uncomfortable cramps and, please note, I was wearing a NannoPad throughout. Assuming my period was about to get serious, I dialed things up to a regular pad, because the supers — which seemed to me more appropriate — are much longer than my active body could comfortably accommodate. I did use one for sleeping, though, and felt very protected.\nThe cramping continued throughout the evening, although with a lesser degree of pain than its initial onslaught. I grimaced my way through the night with my hands on my uterus, trying in vain to calm it with pressure. After this fail, I was prepared to write off the NannoPad as a gimmick.\nWhen I brought my control into the mix the next morning, however, I noticed something interesting. After wearing it for roughly the same time period (about four hours), I accumulated a much larger blood pool: It soaked the whole middle section of the pad. I also weathered some extremely rude cramps; cramps of a grade that make you yelp curses at the ceiling of your apartment, even though no one is around to hear you scream. When I switched back to NannoPad, however, the blood spot shrank (it did not disappear) and the cramps dulled. That respite reversed itself when I swapped in an Always four hours later. And so the trend continued into day three, throughout which I continued to experience a preternaturally heavy flow. My cycle continued that way for the next four days, eventually tapering off around day seven, which — for reference — made for a much longer haul than my typical four-day menses.\nThe Results Are In\nAfter my very scientific experiment, I do feel like this device eased my achy uterus and stemmed the tide somewhat; I also feel like we might chalk that up to placebo effect. When I ran the whole concept by Mary Jane Minkin, MD, a clinical professor of Obstetrics, Gynecology, and Reproductive Sciences at the Yale School of Medicine, she charted some skepticism.\nThere are some things menstruators can do to lessen the amount of blood the use with each sloughing of the uterine lining, she tells me. She points to two medications physicians use to control the flow: methergine, which \"works mechanically to squeeze the muscular wall of the uterus,\" and Lysteda, which promotes blood clotting. \"We can limit amount of blood lost,\" she says, \"but I'm not sure about their heat/infrared business.\"\nAt the end of this adventure, I would summarize my NannoPad trial as slightly more pleasant menstrual experience than usual, which went on longer than it need to. That may well be the trade-off: Would you like a rough and wild period that exhausts itself relatively quickly, or would you like a more gentle (if not necessarily painless) process that lasts for about three extra days (if you are like me)? Now seems like a good time to try for yourself and see: If you're curious about the NannoPad, head on over to their website — they'll send you a free box of product. Given the price of menstrual wares, why the heck not?","url":"https://www.bustle.com/p/i-tested-nannopad-menstrual-pads-to-find-out-if-they-can-really-reduce-period-pain-10057692"}
