{"authors":["Georgia Diebelius For Mailonline"],"date_download":"2018-10-22 23:46:48","date_modify":"2018-10-22 23:46:48","date_publish":"2016-01-29 12:18:00","description":"The incredible underground L’Albergo Diurno Metropolitano, which sits beneath Piazzale Venezia in Milan, Italy, was open between 7am and 11pm daily until the mid 1980s.","filename":"data/vaneerConsumption/IthadeverythingbutbedroomsTheincredible1920sdaytimehotelinMilanthathasremainedabandonedinallitsartnouveausplendour.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1A47700000578-0-image-a-2_1454065402921.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3420764_It-bedrooms-incredible-1920s-daytime-hotel-Milan-remained-abandoned-art-nouveau-splendour_1540252008.html","title":"It had everything but bedrooms: The incredible 1920s 'daytime hotel' in Milan that has remained abandoned in all its art nouveau splendour","title_page":"It had everything but bedrooms: The incredible 1920s 'daytime hotel' in Milan that has remained abandoned in all its art nouveau splendour | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"in the mid 1980s, but the last barber did not leave until 2003 - when he was evicted\nIt was called a hotel - but you couldn't check in.\nThe stunning L'Albergo Diurno Metropolitano was built between 1923 and 1925 and offered all the amenities you would find in a lavish Venetian hotel today - apart from a place to sleep. Hence it was known as a 'daytime hotel'.\nThe incredible underground space, which sits beneath Piazzale Venezia in Milan is not currently open to the public - but these photographs of the building, which has remained abandoned in all its art nouveau splendour, go some way to capturing what it might have been like to visit.\nIt was open between 7am and 11pm daily and was designed by architect Piero Portaluppi as a place to provide a moment of rejuvenation for people visiting the city - and those who needed somewhere to relax and wait for their check-in time at their hotel.\nL'Albergo was home to dozens of facilities including large comfortable lounges, public baths, a spa, ladies hairdressers, manicure salons and even ironing and wardrobe services. A newsagent, shoe-shiners, bicycle garage, travel agency and photography shop, were all also situated in the 12,916 sq foot space.\nAlthough the majority of the art déco's facilities closed in the mid eighties, some of the barber shops stayed in operation. The last surviving barber, Carmelo Aiello, kept his shop open to the public until 2003, when he was evicted by the council.\nThe Italian environment fund for the preservation of artistic heritage said that the location is likely to be open for visits later this year.\nL’Albergo Diurno Metropolitano was open between 7am and 11pm daily and was designed by architect Piero Portaluppi as a place for people visiting the city to rejuvenate\nThe main lobby of 'The Daytime Metropolitan Hotel', was home to dozens of facilities including large comfortable lounges, public baths, a spa, ladies hairdressers, manicure salons and even ironing and wardrobe services\nGuests visiting Milan could stop off at one of the barber shops in the underground space to freshen up before checking in to their hotel\nA newsagent, shoe-shiners, bicycle garage, travel agency and photography shop were all also situated in the 12,916 sq foot space\nThe last surviving barber, Carmelo Aiello, kept his shop open to the public until 2003, when he was evicted by the council\nThe hotel, which has remained largely unchanged since its grand opening in 1925, offered all of the amenities you would find in a lavish Venetian hotel today, apart from a place to sleep","url":"https://www.dailymail.co.uk/travel/travel_news/article-3420764/It-bedrooms-incredible-1920s-daytime-hotel-Milan-remained-abandoned-art-nouveau-splendour.html"}
