{"authors":["Sara Tan"],"date_download":"2018-10-31 01:42:23","date_modify":"2018-10-31 01:42:23","date_publish":"2018-09-14 17:12:25","description":"If you looked at my nightstand, you might assume I am a subscriber to the goop lifestyle. Next to my slew of antioxidant-rich skin care products are a smattering of crystals, an amber glass bottle of soothing essentials oils, my rose quartz Gua Sha,…","filename":"data/vaneerConsumption/ITookMoonJuicesSuperYouStressManagementSupplementEveryDayForAMonthItChilledMeOut.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/10/90cf4602-ca84-4306-9f35-38d84dda67a7-32001685_568217703564233_860236774922780672_n.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_i-took-moon-juices-superyou-stress-management-supplement-every-day-for-a-month-it-chilled-me-out-11785100_1540950143.html","title":"I Took Moon Juice's SuperYou Stress Management Supplement Every Day For A Month & It Chilled Me Out","title_page":"I Took Moon Juice's SuperYou Stress Management Supplement Every Day For A Month & It Chilled Me Out","title_rss":"NULL","source_domain":"bustle.com","text":"If you looked at my nightstand, you might assume I am a subscriber to the goop lifestyle. Next to my slew of antioxidant-rich skin care products are a smattering of crystals, an amber glass bottle of soothing essentials oils, my rose quartz Gua Sha, and a sage smudge stick. I must be the kind of person who consumes personalized vitamins, collagen powders, and herbal supplements, too, right? You're half right. I have these items in my possession, but I can't seem to get behind them, not in the same way I have with the other wellness trends I've adopted. But maybe I could if I really knew whether or not they actually worked, which is why I decided to take Moon Juice's new SuperYou Adaptogen capsule for 30 days straight.\nAsk anyone who follows the wellness space and they'll tell you that Los Angeles-based Moon Juice is an innovator in the industry. Since launching in 2011 (first as a juice shop in Venice Beach serving \"medicinal\" concoctions to help with ailments or health goals), the company's Moon Dusts have become a staple for those wanting to improve everything from their complexion to their sex life. What made it so special (and so marketable)? The \"dust\" blend's adaptogens, which are by definition non-toxic herbal substances (like ginseng or mushrooms) that are used to stabilize the body's physiology and resist stressors (like fatigue or anxiety).\nOne of the other reasons the brand has garnered so much success is Moon Juice's infamous founder Amanda Chantal Bacon. In 2015, the former fine dining chef-turned-wellness-guru shared her eccentric food diary with ELLE and quickly became the talk of the internet. Since then, Moon Juice has flourished and expanded its Instagrammable offerings to protein powders, skin care products, and daily supplements, including SuperYou.\nIt's not hard to find skeptics who would tear apart every one of Bacon's dusts or powders, but for every critic is a passionate fan who claims that one of her products has changed their lives tremendously, saving them from a mental breakdown or hormonal imbalances (Gwyneth Paltrow included). And then there's people in the middle, like me. As an Angeleno myself, I've definitely had my fair share of pricey Moon Juices and have added several packets of Moon Dusts to my drinks over the years. But if you asked me if it actually works, I'm not sure I could tell you, which is why I decided to embark on this 30 day challenge using one of Moon Juice's newest products to really find out for myself.\nThe Claims\nIn May, Moon Juice launched SuperYou, a daily adaptogenic capsule that features a proprietary blend of \"super-herbs\" to address the effects and signs of stress. It sold out within two days and racked up a 5,000 person waiting list (and a black market on eBay). According to the brand, the pill's ingredients are clinically shown to reduce cortisol levels (aka \"stress hormones\") by 24 percent, which can reduce levels of stress and anxiety. The four key ingredients in the supplement are Amla, Rhodiola, Ashwagandha, and Shatavari. Each of them are said to have their own unique health and stress-management benefits, according to Moon Juice. Moon Juice says that all ingredients in SuperYou are sustainably-farmed, harvested at peak season from their native region, imported whole, extracted with spring water in a wind powered facility in the Pacific Northwest, and triple tested for potency and purity.\nAmla (Indian gooseberry) is said to protect your skin from environmental stress and preserve natural collagen, while Rhodiola (an Arctic plant) has traditionally been used to reduce fatigue and increase alertness. Ashwagandha (Indian ginseng) is known for its calming benefits, helping the body cope with stress, and Shatavari (a type of asparagus) is said to support hormone balance. Previous to this, the brand offered adaptogen powders, but this is the first time they've created a capsule that can be more easily integrated into your routine (versus having to mix your own blend). Each bottle contains 60 capsules, which is good for a 30-day supply (if you take the suggested two-a-day dosage) and will cost you $49.\nBefore I started my experiment, I consulted Dr. Niket Sonpal, MD, an internist and professor of clinical medicine, to see whether SuperYou's claims were legitimate. While Sonpal confirms that the main ingredients in the capsule are very widely used herbal remedies, specifically in Ayurvedic medicine, he says that little scientific research and studies have been done to support Moon Juice's claims.\n\"The SuperYou supplement contains several very popular herbal components with claims that are yet to be proven. Most of the studies are small and have not been repeated in larger groups. There is limited evidence of efficacy for a number of compounds and extracts, but they will require rigorous, well-controlled, randomized trials to actually be proven safe and efficacious,\" Sonpal tells Bustle.\nI also spoke with dermatologist Dr. Ted Lain, about SuperYou's supposed skin-preserving benefits. \"There are three herbal extracts in this supplement that contain antioxidant ingredients. Antioxidants are known to quench free radicals in the skin, which are molecules that are responsible for premature aging of the skin,\" Lain explains. \"While I can't comment on each ingredient specifically, antioxidants as a class do help to preserve collagen by stopping the destructive ability of free radicals.”\nBoth doctors suggest consulting with your physician before incorporating SuperYou into your daily routine, especially if you are pregnant, nursing, or taking other medications. Sanpal notes that if you do take the supplement and experience any weird reactions, there could be a chance you are allergic to one (or more) of the ingredients.\nThe Experiment\nSara Tan\nA few things you should know about me: I don't suffer from debilitating anxiety, but I would consider myself a fairly stressed-out and anxious person (but who isn't these days?). I'm terrible at meditating, so my self-care moments instead involve working out or doing my skin care routine. I could definitely benefit from something like SuperYou, should it really deliver on its claims.\nThe first day I took SuperYou, I felt calmer than usual. I actually forgot I had taken it and was wondering why I was feeling so relaxed. Or maybe I was tired? I couldn't figure it out. Then, I remembered I had taken SuperYou that morning. I guess it was working, and quickly!\nOver the next couple of weeks, I felt a lot more zen. Still stressed from work and life, but not terribly anxious. One afternoon, I was driving from a meeting to an event and I was running late and found myself stuck in rush hour traffic. Typically, this would cause me to yell expletives toward my windshield, my shoulders to crawl up to my ears, and my fists to clench. But I noticed that even at peak stressful moments like this, I was a little bit calmer. A little less irritable.\nI didn't notice any changes to how my skin looked, but I felt good knowing that the ingredients I was consuming could potentially be helping with preserving the collagen in my face and protecting my skin from free radicals. Maybe it was a placebo effect, but I really felt like it was doing something.\nBy the third week, I felt like I was just going through the motions of taking SuperYou and couldn't really tell whether it was affecting me more than I had already noticed. Maybe I had just grown accustomed to its \"chill\" effects or maybe the effects are really just subtle. When I stopped taking SuperYou, I didn't really feel different, but I felt more aware of all the stressful moments in my day than I had over the past month.\nThe Verdict\nWhen I finished my SuperYou supply at the end of my 30 day trial, I felt pretty great, in large part because I felt like I did a good, consistent thing for myself and my body. Did I think SuperYou made all my anxiety and stress go away? No. But I think it certainly helped. And while I didn't see a huge difference in my skin either, I believed that all the antioxidants were doing their work underneath the surface.\nIf you've been thinking about getting into the buzzy world of adaptogens, but are unsure where to start, Moon Juice's SuperYou could be a great introduction. It's simple, straightforward, and has very subtle effects (or at least I thought so). And at the end of the day, who couldn't use an assist in the stress management department, no matter how small?","url":"https://www.bustle.com/p/i-took-moon-juices-superyou-stress-management-supplement-every-day-for-a-month-it-chilled-me-out-11785100"}
