{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:14:47","date_modify":"2018-10-30 21:14:47","date_publish":"2015-02-23 13:14:23","description":"Parenthood changes things, particularly a person's perspective on health and wellness. Such is the case with House of Lies star Kristen Bell, who recently revealed that before she had her two little girls she had been skeptical of vaccination. |","filename":"data/vaneerConsumption/ItsaVerySimpleLogicKristenBellBecameProVaccineWhenSheHadKids.json","image_url":"https://media.breitbart.com/media/2015/02/Kristen-Bell-Phil-McCarten-UPI.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_02_23__1540934087.html","title":"'It's a Very Simple Logic': Kristen Bell Became Pro-Vaccine When She Had Kids","title_page":"'It's a Very Simple Logic': Kristen Bell Became Pro-Vaccine When She Had Kids | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Parenthood changes things, particularly a person’s perspective on health and wellness. Such is the case with House of Lies star Kristen Bell, who recently revealed that before she had her two little girls she had been skeptical of vaccination.\nIn an interview with Entertainment Tonight, Bell said “I thought, oh well, I’m probably not going to vaccinate because we don’t need it, those diseases don’t exist. In the research I did, I found that there is actually a really big reason why we all need to. Which shocked me.”\nBell and husband Dax Shepard have two children together, Lincoln and Delta. After Lincoln’s birth in 2013, the couple reportedly insisted that friends and family get their shots before holding their then-newborn baby. They are reportedly doing the same with their new baby Delta, who was born this past December, notes ET.\nShe backed up her belief about the importance of vaccinating by pointing out that there are people who cannot receive immunizations because of autoimmune diseases or cancer treatment. “If we don’t get the vaccinations to keep them safe, then they’re screwed,” she told ET.\n“It’s a very simple logic: I believe in trusting doctors, not know-it-alls,” Bell recently said in an interview with the Hollywood Reporter.\nneed a reason to take vaccination seriously? meet Maggie. & keep your fingers crossed for her. @MotherJoneshttp://t.co/FMNdsu2No1 — Kristen Bell (@IMKristenBell) February 3, 2015\nCalifornia State Senators Ben Allen (D-Santa Monica) and Richard Pan (D-Sacramento) announced this month that they will be introducing a bill to end the ability of parents in the Golden State to exempt their children from school vaccinations based on personal beliefs and religion.\nFollow Adelle Nazarian on Twitter @AdelleNaz","url":"https://www.breitbart.com/entertainment/2015/02/23/its-a-very-simple-logic-kristen-bell-became-pro-vaccine-when-she-had-kids/"}
