{"authors":[],"date_download":"2018-10-23 05:50:42","date_modify":"2018-10-23 05:50:42","date_publish":"2015-05-03 00:00:00","description":"The former CEO of Hewlett-Packard once had a stint filing and typing for the company. She also dropped out of law school, survived breast cancer and once ran a campaign ad featuring demon sheep.","filename":"data/vaneerConsumption/ItsAllPolitics.json","image_url":"https://media.npr.org/assets/img/2015/05/01/ap984887413503_wide-53ddafd2dc0fbdb96b0c688ce9ca89914f703d5a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=403605737_1540273842.html","title":"It's All Politics","title_page":"5 Things You Should Know About Carly Fiorina : It's All Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nSome other news, the field of Republican candidates for president is growing today. Carly Fiorina announced this morning that she's running, and Ben Carson is expected to formally announce. Carson is a pediatric neurosurgeon. Fiorina, as you may recall, was CEO of Hewlett-Packard and ran unsuccessfully for the Senate in California in 2010. She was campaigning even before her announcement this morning. NPR's Brian Naylor caught up with her on a swing through New Hampshire.\nBRIAN NAYLOR, BYLINE: Carly Fiorina made all of the necessary stops on the New Hampshire culinary campaign - a spaghetti supper, a pancake breakfast and a serious policy luncheon. And while she passed on the buffet, Fiorina did have all the necessary ingredients for a Republicans stump speech down pat. There was a heaping portion of criticism of Democrat Hillary Clinton, who Fiorina said should not be president.\nCARLY FIORINA: And it's not because she's a woman. She shouldn't be president of the United States because she's demonstrated over and over again that she's not trustworthy, and she doesn't have a track record of accomplishment or leadership.\nNAYLOR: There was a pinch of spice as she alluded to Hillary's husband, former President Bill Clinton.\nFIORINA: I was asked whether a woman's hormones prevented her from serving in the Oval Office. Can you think of a single instance in which a man's judgment was clouded by hormones?\n(LAUGHTER)\nFIORINA: Ever, including in the Oval Office?\n(LAUGHTER)\nNAYLOR: And a dash of foreign policy.\nFIORINA: I've sat across the table from Vladimir Putin. He was about as close to me as you are right now. And you don't have to spend a lot of time with Vladimir Putin to understand, just as one example, that he has a lust for power, and he is consolidating it pretty effectively right now.\nNAYLOR: At age 60, Carly Fiorina has led a varied and at times challenging life. She was born in Austin, Texas, her mother an artist, her father a law school professor who became a federal judge. She went to Stanford, dropped out of law school, worked as a Kelly girl temp and a secretary before getting started in business, climbing a very tall ladder to the top at technology giant Hewlett-Packard.\nFIORINA: People have asked me, how do you go from secretary to CEO? And the truth is I never had a plan to become a CEO, but what I found out about myself is that I like challenges, and so I would run to problems.\nNAYLOR: The board at HP, however, believed Fiorina created too many of her own problems, including the controversial acquisition of rival computer maker Compaq. After HP's stock plummeted, she was ousted in 2005 after what she calls a board room brawl.\nOther personal setbacks followed - a diagnosis of breast cancer six years ago, and, soon after that, the death of a stepdaughter who succumbed to what Fiorina calls the demons of addiction. In 2010, she ran for the U.S. Senate, winning the Republican nomination against former Congressman Tom Campbell, aided by what became known as the demon sheep ad.\n(SOUNDBITE OF POLITICAL AD)\nUNIDENTIFIED MAN: Tom Campbell - is he what he tells us? Or is he what he's become over the years, a wolf in sheep's clothing?\nNAYLOR: But in the general election, Fiorina spent tens of millions of dollars only to lose to incumbent Democrat Barbara Boxer by 10 points. Now Fiorina has set her sights on an even higher office, one she insists is well within reach.\nFIORINA: I'm not a neophyte about how government operates. I'm not a political neophyte. I've helped a lot of other people win. So, in the end, you know, people are people (laughter), and it's about how you lead people.\nNAYLOR: At this point, Fiorina stands out as the only woman and only former CEO in a field that could approach as many as 20 Republicans. She's banking on that being enough to overhaul opponents with more political experience and more venture capital behind them. Brian Naylor, NPR News, Washington.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=403605737"}
tion.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=325489913"}
