{"authors":[],"date_download":"2018-10-30 20:52:52","date_modify":"2018-10-30 20:52:52","date_publish":"2018-08-30 23:45:00","description":"Mentally ill women are being detained in isolation for weeks at a time at a south Fulton County jail...","filename":"data/vaneerConsumption/ItsbarbaricformentallyillwomenatametroAtlantajail.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/30/Images/newsEngin.22895338_south-fulton-jail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_conditions-for-m_7cd38f259aa191703140bb52cb52ee8c__1540932772.html","title":"It's 'barbaric' for mentally ill women at a metro Atlanta jail","title_page":"It's 'barbaric' for mentally ill women at a metro Atlanta jail","title_rss":"NULL","source_domain":"ajc.com","text":"Mentally ill women are being detained in isolation for weeks at a time at a south Fulton County jail inside filthy cells that reek of feces, a civil rights attorney has told county officials in a letter that calls for change.\nMany of the women, held in chaotic and unsanitary conditions, are not receiving proper medical treatment and are deteriorating into states of psychosis, Sarah Geraghty, a lawyer with the Southern Center for Human Rights, wrote. Most of them face low-level misdemeanor charges and cannot post the $200 to $500 required for bail.\nRELATED: Lawsuit: Free jailed Atlanta man too poor to pay $500 bond\nRELATED: Decatur businessman pays bond to get stranger out of jail\nThe Aug. 17 letter was sent to Sheriff Ted Jackson, chief jailer Mark Adger and Fulton State Court Chief Judge Diane Bessen. It details squalid conditions at the South Fulton Municipal Regional Jail and offers recommendations “to avoid litigation.”\n“The conditions described are unacceptable,” Bessen said Thursday in a statement to The Atlanta Journal-Constitution. “We are coordinating efforts to address and ameliorate this situation.”\nThe resources required to house and treat the mentally ill are “woefully inadequate, particularly for the indigent,” the chief judge said. “However, the State Court is committed to remedying this situation.”\nIn a statement, the Fulton County Sheriff’s Office said, “Mental illness is of great concern to us, as there are increasing numbers of inmates who require care beyond the capacity of the (jail).”\n“Unfortunately, our abilities to provide this critical care are limited by human resources and training available for staff,” the statement said. Compounding the problem is that many new inmates were receiving no medical care before they were arrested, and then they refuse to take medication while in custody.\nThe sheriff’s office will ask the court system to order that medication be administered to these inmates for their benefit and so they can contribute to their defense, the statement said.\nIN-DEPTH: When inmates die: Georgia’s jails fail mentally ill\nThe jail, located in Union City, houses pretrial detainees and can hold up to 325 inmates, about 40 of whom are women. It has three wings for mentally ill women, and many reside in a single cell because they are deemed too ill to share space with another person, the Southern Center letter said.\nSouthern Center for Human Rights attorney Sarah Geraghty. (PHOTO HANDOUT)\nIn an interview, Geraghty said she compiled the information during visits to the jail this year. And she compared walking through the mental health areas to having a nightmare.\n“You see caged people screaming incoherently with the overwhelming smell of feces in the air,” she said. “It’s barbaric. We can’t permit these kinds of conditions to become normalized in our criminal legal culture. We have to be better than this.”\nThe prolonged isolation of the women is more restrictive than the most extreme solitary confinement in the state prison system, Geraghty said. “And these are women who are charged with the pettiest of offenses.”\nIn her letter, Geraghty acknowledged that many of the women are “unquestionably difficult to manage in a jail setting,” and she expressed sympathy for jailers who have to try to manage such a situation. But confining the women in their cells around the clock for weeks at a time, and removing them only when they must appear in court, violates the Constitution, she said.\nOne woman was held from May 8 to August 9 on a public indecency charge — for being partially unclothed at a MARTA bus stop — because she couldn’t post a $500 bond. “We observed her to be agitated, incoherent and filthy,” the letter said, citing concerns of fellow inmates that the woman rarely ventured out of her cell and had not bathed in months.\nAfter a Southern Center lawyer discovered the woman had not gone to court or been appointed a lawyer during her three months of confinement, her case was dismissed two days later.\nAnother woman inmate was observed in her cell with food smeared on her bed. Her toilet bowl was filled with waste, and the stench of vomit, urine and feces was overwhelming, the letter said.\nIN-DEPTH: Mentally ill woman in medical prison never convicted of a crime\nRELATED: Judge orders Georgia to move disabled woman from prison hospital\nOne woman held in a so-called “suicide cell” was seen standing completely naked behind her feces-covered window. She mouthed unintelligible words and intermittently cried and sang, the letter said.\nIt also noted that a 44-year-old schizophrenic woman had died at the jail in April 2017 after swallowing a plastic spoon and the bristle-half of a plastic toothbrush.\nKesha Brownlee, who died in April 2017 after swallowing a plastic spoon and part of a toothbrush while being held in the south Fulton County jail. (FAMILY PHOTO)\nKesha Brownlee, who had suffered from severe mental illness for more than 25 years, was being held on a felony probation warrant. At the time of her death, she was living in squalor in an isolation cell, the Southern Center letter said.\nBrownlee’s mother, Willie Ruth Myrick, said systemwide changes must be made.\n“These people can’t help it that they’re sick,” she said. “We as a people have got to do something about this. It won’t bring Kesha back, but if it will stop one more family from being hurt or one more inmate from dying, it’s worth it.”\nMany of these inmates don’t need to be in jail, Myrick said. “Their sickness needs to be treated.”\nThe letter asks the Fulton County court system to change its bail policy and ensure that inquiries are made promptly about a detainee’s ability to pay pre-set bond amounts. It asks the county to ensure that people who look like they may be incompetent to stand trial are evaluated by mental health officials within seven days of booking. And the county should require prosecutors to articulate a compelling reason why someone facing a nonviolent misdemeanor charge should be held longer than 30 days, the letter said.\nRELATED: Atlanta mayor signs ordinance changing cash bail system\nRELATED: Cash bail reforms easy to circumvent, critics contend\nAs for the sheriff’s department, it should hire a mental health expert to audit the care of jail detainees, ensure mental health care providers maintain adequate staffing levels, and ensure mentally ill women are housed in sanitary conditions and are allowed time outside their cells, the letter said.\nFulton County Commission Chairman Robb Pitts said he found the letter’s allegations to be “simply appalling” and said he will be talking to the sheriff to address the concerns.\n“At a minimum, the recommendations suggested by the Southern Center for Human Rights should be implemented immediately,” Pitts said. The letter highlights the need to end cash bail for indigent defendants and to find additional resources for mental health treatment, he said.\n“The public is not served and the community is not protected,” Geraghty wrote, “by warehousing people with serious mental illness in isolated confinement for long periods and then releasing them in a decompensated state, particularly when their offenses are nonviolent misdemeanors.”","url":"https://www.ajc.com/news/local/conditions-for-mentally-ill-women-fulton-jail-called-barbaric/5qKtmeVZiNleIn83A1uJzH/"}
