{"authors":["Tom Utley For The Daily Mail"],"date_download":"2018-10-22 20:28:42","date_modify":"2018-10-22 20:28:42","date_publish":"2016-01-29 01:48:13","description":"TOM UTLEY: Tthere is nothing new about the disclosure by Jordon Cox that it is often cheaper to get from A to B in Britain if you’re prepared to take the scenic route via C in another country.","filename":"data/vaneerConsumption/ItscheapertoflyviaBarcelonathantakethetrainfromNewcastletoLondon.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30A13D5D00000578-0-image-a-68_1454031998582.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-3422080_TOM-UTLEY-train-Newcastle-London-savvy-son-proved-cheaper-fly-Barcelona_1540240122.html","title":"It's cheaper to fly via Barcelona than take the train from Newcastle to London","title_page":"It's cheaper to fly via Barcelona than take the train from Newcastle to London | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When our second son was at Newcastle University, he would spare himself the expense of the 250-mile train trip home to London by flying via Barcelona.\nIf I remember rightly (though this is getting on for ten years ago), the 1,700-mile round trip by air worked out at about half the rail fare on the East Coast line.\nSo, no, there is nothing new about this week’s disclosure by young Jordon Cox that it is often cheaper to get from A to B in Britain if you’re prepared to take the scenic route via C in another country.\nJordon Cox in Berlin by the Brandenburg Gate on his trip home to Essex via Germany\nJordon is the obsessive money-saver, with the agreeably nerdy appearance (imagine a skinnier version of Harry Potter’s geeky sidekick Ron Weasley in thick-lensed specs), who spared himself the grand total of £7.72 by shunning the train home from Sheffield to Essex and flying instead via Berlin.\nTrue, the 1,017-mile detour added eight hours and ten minutes to his journey (Jordon, known as the ‘Coupon Kid’, is nothing if not scrupulous in detailing the precise facts and figures through his blog on website MoneySavingExpert.com).\nBut as he points out, the detour gave him seven hours to explore Berlin, a city he had not visited before, as well as the chance to enjoy a currywurst sausage for lunch. Conscientious fellow that he is, he includes the £1.50 cost of this delicacy in his total expenditure for the journey, which amounted to £44.07.\nMadness\nThe air fare itself was only £21.37, with the rest accounted for by train and bus fares to and from the airport.\nHad he instead taken the train from Sheffield in Yorkshire to Shenfield in Essex (£47), eating a ham and cheddar toastie for lunch (£2.99) before taking the bus from the station to his home at Hutton (£1.80), the cost of his trip would have been £51.79. So, well done, Jordon!\nAll right, the point he is making may have been an open secret among cash-strapped students for years. But I reckon we all owe a huge debt of gratitude to this enthusiastic and immensely likeable, authentic eccentric for highlighting so vividly the madness of fare structures and the exorbitant cost of rail travel in Britain today.\nThis is the unusual route, and over 1,000 miles further than he had to travel, that Jordon Cox took to get home to Shenfield from Sheffield\nThis shows how much the rail journey would have cost the 18-year-old, and how much he actually spent going by air via Berlin\nIndeed, prompted by Jordon’s blog, I’ve done some research of my own — and I discover that it’s still possible to save a packet by following our son’s route from Newcastle to London via the Pyrenees and north-eastern Spain.\nI grant that you can’t be too fussy about the dates and time of day when you fly (but then, with limitless time on their hands, and bodyclocks that make no distinction between day and night, how many students care?)\nI should also admit that, unlike Jordon, I think life’s too short to work out and factor in the relative costs of buses to the airport and station, or comparisons between the prices of a Virgin Trains toastie and a bocadillo in Barcelona. But if you take the cheapest available flights, and don’t mind delaying the onward journey for a few days’ sightseeing, you can get from Newcastle International Airport to London Gatwick, via Aeroport de Barcelona-El Prat, for as little as £66.\nBy contrast, the cheapest standard single Virgin rail fare from Newcastle to London King’s Cross, bought on the day of travel, is a cool £120.90. Now compare that with the cheapest coach fare of £12 (yes, our son often went by National Express, but he preferred to break his journey with a dip in the Mediterranean). Isn’t it a wonder why anyone, apart from the seriously rich, chooses to travel by rail these days?\nAround ten years ago, the 1,700-mile round trip by air from Newcastle University to London via Barcelona worked out at about half the rail fare on the East Coast line (file photo)\nSpeaking for myself, I take the 20-minute train from my home to Central London every working morning and evening (of which more in a moment). But I wouldn’t dream of taking a long journey by rail — unless, of course, the office happens to be paying. For me, as for so many others with families to cart around, it’s the car every time.\nSlog\nIndeed, I haven’t been on an inter-city train since last April, when my bosses sent me the 163 miles to Manchester during the election campaign, with orders to track down the elusive Ed Miliband. I almost fainted at the price of the standard return ticket: £245.10! For the same fare, I discovered yesterday, I could get a cheap return flight to Bahrain, 3,165 miles away — that’s 6,330 miles there and back.\nFancy a trip from Bristol to Newcastle? That’ll be £74, please, by cross-country train. Or, if you prefer, you could save £60 by making the journey by Ryanair via Dublin, for a mere £14. As for my trip to Manchester, I could have got there for £33 if I’d flown via Milan (though I dare say Mr Miliband might have finished his speech by the time I arrived).\nOf course, none of what I’ve said takes into account the huge inconvenience of modern air travel, with the slog to the airport, the interminable queues and the ridiculous business with belts, shoes, laptops and liquids at security.\nBut then, rail journeys aren’t all that much fun, either. Try asking the City worker pictured this week on his train home to Suffolk — season ticket, £6,208 a year — squashed into his regular seat beside buckets and mops in a tiny broom cupboard. For him, this is the height of luxury, since it’s standing room only for most of his fellow passengers on the cattle truck commute.\nI should also admit that, unlike Jordon, I think life’s too short to work out and factor in the relative costs of buses to the airport and station\nAnd it’s not only airports where we’re kept endlessly hanging around. Like so many of us, I’ve spent what must be an accumulated total of many hundreds of hours pacing up and down the platform at my local station, listening to ever more inventive explanations for delays.\nThe latest was a new one on me. Apparently, a train was held up at a station two stops down the line from me by ‘strong sunlight’, which meant drivers couldn’t see the full length of their trains in the mirror before pulling out.\nBargains\nAs for labyrinthine fare structures, airlines have nothing to teach the rail operators. Take my Manchester trip — £164.50 for the outward journey, £80.60 for the return. Precisely the same distance, but one fare double the other. What a difference the time of day makes.\nAdd the mind-boggling array of holiday promotions and special deals, with railcards for family and friends, students and the elderly, and you need a degree in ticketology to track down the bargains.\nWhich brings me to the greatest disparity of all. Our fourth and youngest son, poor boy, has to spend roughly a quarter of his wages as a teaching assistant on getting to the school and home. Like so many of his generation, he has to live with his parents, as he can’t possibly afford a place nearer his workplace on the other side of London.\nMeanwhile, his father — who earns, I blush to say, more than ten times the boy’s salary — commutes to and from work every day for precisely nothing.\nThis is because of the lunatic profligacy of London mayor Boris Johnson, who has ruled that every Londoner over the age of 60 (including many of us who have never been better off, and never will be again) must be allowed to travel for free.\nI know, I know. I’m not obliged to accept Boris’s bounty — and for six pious weeks after I became eligible, I resisted applying. But I’m not a ruddy saint. If you had the choice between shelling out £152 a month for your commute, or paying not a bean, which would you pick?\nOne last thought. In their efforts to promote a ‘Northern powerhouse’, ministers plan to spend between £50 billion and £80 billion on high speed, premium-fare trains to shave half-an-hour or so off the journey between London and Manchester (assuming it’s not too sunny).","url":"https://www.dailymail.co.uk/debate/article-3422080/TOM-UTLEY-train-Newcastle-London-savvy-son-proved-cheaper-fly-Barcelona.html"}
