{"authors":["Brian Naylor"],"date_download":"2018-10-23 05:45:27","date_modify":"2018-10-23 05:45:27","date_publish":"2015-05-11 00:00:00","description":"Money for federally funded road and bridge improvements is running low, and as usual, Congress is spinning its wheels trying to find a solution.","filename":"data/vaneerConsumption/ItsInfrastructureWeekMorePotholesThanTaxDollarsToFillThem.json","image_url":"https://media.npr.org/assets/img/2015/05/11/ap578795653006_wide-c15585b9b23b19690ab77b581e35945e3b6d6d6b.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_05_11_405961315_its-infrastructure-week-more-potholes-than-tax-dollars-to-fill-them_1540273527.html","title":"It's Infrastructure Week: More Potholes Than Tax Dollars To Fill Them","title_page":"It's Infrastructure Week: More Potholes Than Tax Dollars To Fill Them : NPR","title_rss":"NULL","source_domain":"npr.org","text":"It's Infrastructure Week: More Potholes Than Tax Dollars To Fill Them\nEnlarge this image toggle caption Susan Montoya Bryan/AP Susan Montoya Bryan/AP\nThis is National Infrastructure Week in Washington, D.C. That's when serious policy wonks, along with the construction, labor groups and other related industries, hold conferences, raise awareness and maybe most important, lobby Congress on behalf of road, bridge and other brick and mortar and concrete improvements.\nThere is added urgency to their efforts this year, as federal highway building money is set to run out, probably sometime this summer, and so is the government's authority to spend what little money it has left.\nAt a kickoff speech, Transportation Secretary Anthony Foxx said the challenge the government faces \"is actually worse than last summer,\" when Congress provided a temporary boost to highways using money from general revenues.\nThat's because the authorization bill that actually gives the government the green light to spend those funds is set to expire on May 31 after which, Foxx warned, \"we will not have the ability to spend the dollars we do have to support this nation's infrastructure. It is that serious.\"\nFoxx noted there have been 32 short-term extensions of the highway bill over the past six years. This, he said, has led to \"so much uncertainty at the federal level that it is crippling our system.\"\nLawmakers from both parties generally agree on the need to do something, but as usual these days in Washington, are unable to agree on the details. The federal gas tax is no longer keeping up with the demand for highway dollars. As The Hill newspaper points out:\n\"The gas tax, which is currently 18.4 cents-per-gallon, typically brings in about $34 billion. But the federal government typically spends about $50 billion on transportation projects. \"The gas tax has not been increased since 1993, and improvements in the fuel efficien[cy] of U.S. autos has sapped much of its purchasing power.\"\nThe Obama administration's preferred approach for transportation funding would tax U.S. companies' overseas profits. But it hasn't gained much traction either. How about Build America Bonds? That's a proposal in a new paper from The Hamilton Project, which suggests the bonds could be a short-term solution to the nation's infrastructure funding needs. More likely, Congress will come up with another short-term fix, kicking the proverbial can down the road.\nMeanwhile, Transportation Secretary Foxx is taking Infrastructure Week out for a spin, with stops planned over the next several days in Tennessee, Iowa and California to push for highway and bridge funding.","url":"https://www.npr.org/2015/05/11/405961315/its-infrastructure-week-more-potholes-than-tax-dollars-to-fill-them"}
