{"authors":[],"date_download":"2018-10-30 14:24:12","date_modify":"2018-10-30 14:24:12","date_publish":"2015-01-23 00:00:00","description":null,"filename":"data/vaneerConsumption/ItsIslamismstupid.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_01_its_islamism_stupid_1540909452.html","title":"It's Islamism, stupid","title_page":"It's Islamism, stupid","title_rss":"NULL","source_domain":"americanthinker.com","text":"When you don’t call things by their real name, you always get in trouble. And this administration, so fearful of being accused of Islamophobia, is refusing to make any link to radical Islam from the recent explosions of violence against civilians (most of them Muslims) by Boko Haram in Nigeria, by the Taliban in Pakistan, by Al Qaeda in Paris and by jihadists in Yemen and Iraq. We’ve entered the theater of the absurd.\nFor a moment there, I was hopeful. Reading the opening paragraphs of Friedman’s NYT op-ed entitled “Tell It Like It Is,” I thought that, at last, a major MSM commentator was going to break ranks and point out forcibly that we are in an ideological war with Islamism and that if we don’t commit to that, then we have lost the ideological war and jeopardized the ground war. Here is the paragraph I found hopeful:\nBut the rest of the article just brings up Islamists and jihadists and “angry young men” and never again mentions “radical Islam,” much less “Islamism.” It ends up being a rather timid step in the right direction.\nBy contrast, the French conservative leader Marie Le Pen – who some would argue would now win the presidency of France – has come out forcibly criticizing French President François Hollande for being unwilling to target Islamism as the ideology propelling violent jihad. “France, land of human rights and freedoms, was attacked on its own soil by a totalitarian ideology: Islamic fundamentalism.”\nHer statements stand in contrast to the strangely conflicted position advanced by the French prime minister Manuel Valls, who somehow maintains that France is at war with radical Islam but not with the Muslim faith or any religion – as if radical Islam = radical Islamists. But one mustn’t even mention “Islamism” for fear of contaminating Islam – the religion of peace.\nBut the phrase “radical Islam” is gaining traction in the discussion of terrorist organizations and, inadvertently or not, this is to admit the ideological component driving radical Islamists. At a certain point, it must be admitted that we are in an ideological war. Shall we say the camel’s nose is in the tent?\nThe bottom line is that whether or not Islam can really be divorced from Islamism, it is strategically important to target Islamism as the ideological driving force and justification for violent jihadists. It is not just a drones-in-the-air and boots-on-the-ground war; it is also an ideological war. If Islamism is not discredited as the violent, inhumane theo-fascist ideology it is, then no matter how many terrorist cells are destroyed, it will breed more and more jihadists committing gruesome acts of horror. It is reported that ISIS has now taken to beheading educated women.\nThe reason why there are Islamists is because there is Islamism. The reason why there are Islamo-fascists is because there is Islamo-fascism. There would have been no Marxists without Marxism. There would have been no Nazis without Nazism. How hard is that?","url":"https://www.americanthinker.com/blog/2015/01/its_islamism_stupid.html"}
