{"authors":["John Daley"],"date_download":"2018-10-23 05:53:20","date_modify":"2018-10-23 05:53:20","date_publish":"2015-11-09 00:00:00","description":"Families should rethink how seniors give up driving, researchers say. Figuring out transportation alternatives long ahead of time can help preserve independence and avoid painful confrontations.","filename":"data/vaneerConsumption/ItsNeverTooSoonToPlanYourDrivingRetirement.json","image_url":"https://media.npr.org/assets/img/2015/10/19/robert-m_wide-573dedd4211e01156c46092e0260007f816b1761.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2015_11_09_448845220_its-never-too-soon-to-plan-your-driving-retirement_1540274000.html","title":"It's Never Too Soon To Plan Your 'Driving Retirement'","title_page":"It's Never Too Soon To Plan Your 'Driving Retirement' : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"It's Never Too Soon To Plan Your 'Driving Retirement'\nEnlarge this image toggle caption John Daley/Colorado Public Radio John Daley/Colorado Public Radio\nHarriet Kelly has one word to describe the day she stopped driving four years ago: miserable.\n\"It's no fun when you give up driving,\" she says. \"I just have to say that.\"\nKelly, who lives in Denver, says she was in her 80s when she noticed her eyesight declining. She got anxious driving on the highway, so decided to stop before her kids made the move for her.\n\"I just told them I'd stop driving on my birthday — my 90th birthday — and I did. And I was mad at myself because I did it,\" she says, laughing. \"I thought I was still pretty good!\"\nKelly is now 94. She says her last traffic accident was in the 1960s. But, she says, \"I think it's just better to make up your own mind than have your kids go through trying to tell you, and end up with arguments and threats and everybody gets mad.\"\nHer daughter Leslie Kelly says she's grateful she and her siblings didn't have to have that tough conversation. Still, she knows it's been tough for her mom.\nEnlarge this image toggle caption John Daley/Colorado Public Radio John Daley/Colorado Public Radio\n\"It really cut down on her ability to feel independent,\" says Leslie. Harriet chimes in, \"It certainly did!\"\nBut Harriet Kelly is a great example of someone who planned for her \"driving retirement,\" says Dr. Emmy Betz, an emergency medicine specialist who does research at the University of Colorado School of Medicine on the safety of older drivers.\n\"Retirement is something that happens to all of us,\" Betz says. \"Maybe we even look forward to it. You prepare for it, you make financial plans, you think about what you're going to do.\"\nBut most seniors don't do that when it comes to driving, she says.\n\"It's sort of the elephant in the room that no one wants to talk about, but it's an issue that's coming for most of us and our family members and so denial isn't probably the most helpful option,\" she says.\n\"Transportation is a huge issue that we need to address,\" says Jayla Sanchez-Warren, director of the Area Agency on Aging for the Denver Regional Council of Governments. For seniors, she says, a lack of transportation also \"contributes to so many other things — like poor health care outcomes, isolation and depression.\"\nA recent report by researchers at Columbia University and the AAA Foundation for Traffic Safety found that older adults who give up driving are nearly twice as likely to suffer depression as those who stay behind the wheel.\nIn my family, we've had to have that conversation twice. When my dad talked to my grandmother, she hid another set of keys, and drove secretly until they found out. Then, 30 years later, \"hell\" and \"no\" were just two of the choice words that erupted from my dad when his Alzheimer's diagnosis led us to insist that he stop driving.\nBetz urges families to plan ahead, talk about it years before it happens and map out transportation alternatives.\n\"Imagine if I told you to give me your keys,\" she says. \"And you can no longer drive, starting right now. I mean, what would you do? It's totally unrealistic that we think that that's an OK thing to do to older people.\"\nIt will become an issue for lots of us and our families. Nationally, until 2030, roughly 10,000 baby boomers will turn 65 each day, according to the Pew Research Center.\nIn many cases, drivers age 50 and older can get a discount on their car insurance by taking a driver safety class.\nAt a senior center in a suburb of Denver, Chris Loffredo teaches just such a class. She asks the 20 attendees to think about everything from how medications might affect them to how new technologies in cars may help them. And, she wants them to strategize.\n\"You have to know when to give up your keys!\" she tells them.\nBut not a hand goes up when the group is asked if they're ready to talk about that. After the class, retirees Ralph Bunge, who is 72, and his wife, Paula, who is 67, say they're not ready.\n\"The conversation wouldn't be as difficult as doing it would be,\" laughs Ralph. Paula agrees.\nEnlarge this image toggle caption John Daley/Colorado Public Radio John Daley/Colorado Public Radio\n\"We're just not really at a place where we imagine that that decision is going to be made any time soon,\" she says.\nRobert McSherry, who is 72 and retired, says for now he's in denial.\n\"One thinks, well, that you'll live forever,\" McSherry says.\nHarriet Kelly says she's made adjustments since giving up the keys four years ago. She now hires a companion or calls Uber to take her on errands. She also gets rides from friends, but adds that there are \"fewer and fewer people that I'll drive with in their 80s.\"\nIn fact, scientific studies show that if older drivers present a danger, it's mostly to themselves and their passengers, Betz says. Fatal crash rates are higher for older drivers, she says, but that's mostly because they don't heal as well after a crash.\nThis story is part of NPR's reporting partnership with Colorado Public Radio and Kaiser Health News.","url":"https://www.npr.org/sections/health-shots/2015/11/09/448845220/its-never-too-soon-to-plan-your-driving-retirement"}
