{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 19:00:18","date_modify":"2018-10-30 19:00:18","date_publish":"2018-09-01 16:22:52","description":"WASHINGTON — The Trump administration announced Friday it is cutting nearly $300 million in planned funding for the UN agency that aids Palestinian refugees, and that it would no longer fund the agency after decades of support. Instead, it said it would seek other channels by which to aid the Palestinians. | Israel / Middle East","filename":"data/vaneerConsumption/ItsOfficialTrumpAdminAnnouncesEndofUSAidtoUNPalestinianRefugeeAgency.json","image_url":"https://media.breitbart.com/media/2018/04/gaza-protest.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_09_01__1540926018.html","title":"It’s Official: Trump Admin Announces End of U.S. Aid to UN Palestinian ‘Refugee’ Agency","title_page":"It’s Official: Trump Admin Announces End of U.S. Aid to UN Palestinian ‘Refugee’ Agency | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Times of Israel reports: The Trump administration announced Friday it is cutting nearly $300 million in planned funding for the UN agency that aids Palestinian refugees, and that it would no longer fund the agency after decades of support. Instead, it said it would seek other channels by which to aid the Palestinians.\nThe administration castigated the UN’s Relief and Works Agency for Palestine Refugees (UNRWA) for failed practices, and indicated that it rejected the criteria by which UNRWA defines Palestinian refugees, whereby the UN agency confers refugee status not only on original refugees but on their millions of descendants.\nThe State Department said in a written statement that the United States “will no longer commit further funding to this irredeemably flawed operation.” “The fundamental business model and fiscal practices that have marked UNRWA for years – tied to UNRWA’s endlessly and exponentially expanding community of entitled beneficiaries – is simply unsustainable and has been in crisis mode for many years,” the statement said, a reference to the fact that the agency grants refugee status to all the descendants of the original Palestinian refugees, something not granted by the UN to refugees from any other places.\nRead the full story here.","url":"https://www.breitbart.com/middle-east/2018/09/01/its-official-trump-admin-announces-end-of-u-s-aid-to-un-palestinian-refugee-agency/"}
