{"authors":["Kelly O'Mara"],"date_download":"2018-10-22 21:57:08","date_modify":"2018-10-22 21:57:08","date_publish":"2016-05-26 00:00:00","description":"California law now permits pharmacists to sell many types of hormonal birth control methods without a doctor's OK. But good luck finding a drugstore that will dispense the contraceptives that way.","filename":"data/vaneerConsumption/ItsStillHardToGetBirthControlPillsInCaliforniaWithoutAPrescription.json","image_url":"https://media.npr.org/assets/img/2016/05/25/birth-control_wide-c07b49ece027b985d160d46612cd3a5d611a8ad8.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2016_05_26_478878991_its-still-hard-to-get-birth-control-pills-in-california-without-a-prescription_1540245428.html","title":"It's Still Hard To Get Birth Control Pills In California Without A Prescription","title_page":"It's Still Hard To Get Birth Control Pills In California Without A Prescription : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"It's Still Hard To Get Birth Control Pills In California Without A Prescription\nEnlarge this image toggle caption Media for Medical/UIG via Getty Images Media for Medical/UIG via Getty Images\nIt has been more than 18 months since California's governor signed a law that allows pharmacists to distribute most types of hormonal birth control methods without a prescription.\nThat means that while women in the state still have to see a doctor to get an IUD, or a contraceptive implant, they should be able to simply walk into their local pharmacy and easily buy contraceptive pills, the patch or the vaginal ring — much like getting a flu shot, or buying over-the-counter medicine to fight a cold.\nBut good luck finding a pharmacy that will actually dispense birth control that way.\nCalls to eight pharmacies around the San Francisco Bay Area — including large corporate locations and smaller, independent stores — yielded no pharmacies delivering these services. Most pharmacists said they still needed to undergo the state-mandated training and that their stores were in the process of figuring out what the service would look like.\nThere's confusion, too. One person told me that the law hadn't yet passed; another told me prescription-free birth control was only an option in Oregon, where a similar bill went into effect on Jan. 1.\nPharmacy giants Walgreens and Rite Aid both confirmed that they are not yet providing birth control pills or a contraceptive patch without a prescription.\nJim Graham, a spokesperson for Walgreens, which operates 629 pharmacies in California, said the company is \"currently assessing\" the law's requirements. \"We plan to test the service in a small number of pharmacies,\" he said.\nCVS said it is testing the service at a few select locations in the Los Angeles area to determine customer demand.\nIt's hard to pin down exactly how many — or how few — pharmacies have implemented the new law, because there is no database of pharmacists trained to distribute these birth control methods without a prescription.\nSally Rafie, a pharmacist and medication safety specialist for the University of California, San Diego Health System, specializes in birth control training and access. She estimated that of the approximately 7,000 pharmacies in California, fewer than 100 are actually distributing these types of nonprescription birth control to customers.\nRafie has been involved in training pharmacists to comply with the new law. Under a protocol developed by the state Board of Pharmacy, pharmacists first have to be trained to do a short consultation with the customer and help her select the appropriate birth control option, as well as identify potential red flags in terms of her underlying health, such as a history of blood clots or uncontrolled high blood pressure.\nOnline classes are also available for practicing pharmacists, and students in pharmacy programs in California now get this training as part of their graduate school curriculum.\nAt the California Pharmacists Association's annual meeting two weeks ago, 150 people took the birth control training workshop, according to Rafie. There are 29,000 registered pharmacists in the state.\nBig players, like Rite Aid, Walgreens and CVS, have companywide processes that have to be standardized across all the stores, said Lisa Kroon, a professor at University of California, San Francisco's school of pharmacy, who has been involved in the implementation of the law.\n\"There are just a lot of hoops that a large corporation has to implement,\" she said.\nKroon spoke from experience. The Walgreens where she oversees pharmacy students on the UCSF campus has yet to implement the law.\nKroon said she is \"really pushing\" Walgreens to move the process along.\nStumbling blocks include: Who will answer incoming doctors' phone calls while the pharmacist provides the consultation, and where will the consultation happen? Rafie said that in the community pharmacy where she works in San Diego, a private consultation room has to be designed and remodeled.\nAll of this takes time. But there are other factors in play, pharmacists say.\nAlthough the law finally went into effect on April 8, the state spent the previous 18 months developing regulations. Those were finalized earlier this year. Pharmacies had all that time to prepare to hit the ground running last month.\n\"I think that they're being cautious,\" said Virginia Herold, head of California's Board of Pharmacy. \"They don't know what demand is going to be, and they're a little hesitant to ramp up.\"\nOffering the new service is optional, according to the law, not mandatory, and there's no reason for pharmacies to opt in if there isn't an incentive for them to do so. And right now, there's actually a financial incentive for them not to comply.\n\"They have the authority to furnish birth control, but it didn't come with the requirement that they get paid for these services,\" said Kroon.\nIf you go to a gynecologist for a regular appointment or consultation, your insurance pays for the service (in addition to paying for the medication itself). But, right now, most insurance providers won't pay your pharmacist for the consultation. Customers either have to pay out of their own pocket, or the pharmacist has to work for free. In Oregon, in contrast, that state's Medicaid program reimburses a pharmacist $35 for the service. Kroon says there are efforts toward a similar law in California.\nThe bill to make these types of hormonal birth control available without a prescription was put forward by Sen. Ed Hernandez, a Democrat from West Covina, and sponsored by the California Pharmacists Association as part of a larger effort to put more primary care in the hands of pharmacists and other nonphysician providers.\n\"Pharmacists are accessible, and they're underutilized,\" said Herold.\nEarly on, some physicians' groups voiced concern that a woman who bypasses a visit to her doctor for birth control will also be less likely to get screened for cervical cancer or STDs.\nIndeed, studies of U.S. residents living near the Texas border with Mexico found that women who obtained their birth control over the counter in Mexican pharmacies were somewhat less likely to go to the doctor for other preventive care, compared to women who got contraception at medical clinics. But women who had to go to a clinic were also more likely to stop using birth control, in part because of having to schedule a doctor's visit to get it.\nThe potential for controversy may be part of what has slowed some pharmacies from offering hormonal contraception to women directly. And, certainly, said Rafie, it requires a different marketing approach than flu vaccines or other services offered by pharmacists. Once it's clear that women want the service, though, she, Kroon and Herold all say they believe that pharmacies will get on board.\n\"By the end of the year, this will be very commonplace in California,\" Herold predicts.\nThis story was produced by KQED's State of Health blog.","url":"https://www.npr.org/sections/health-shots/2016/05/26/478878991/its-still-hard-to-get-birth-control-pills-in-california-without-a-prescription"}
