{"authors":[],"date_download":"2018-10-30 18:15:44","date_modify":"2018-10-30 18:15:44","date_publish":"2016-07-10 20:44:17","description":"The tension sweeping the nation after a week of death and protests in Baton Rouge, La., Dallas and a suburb of Minneapolis weighed heavily on Tommy Witcher’s heart.","filename":"data/vaneerConsumption/Itstimeforhealingracial.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_theme-across-atl_4b3b7702ad390918c557dd4861a0ff70__1540923344.html","title":"It’s time for healing racial...","title_page":"Theme across Atlanta churches: It’s time for healing racial...","title_rss":"NULL","source_domain":"ajc.com","text":"The tension sweeping the nation after a week of death and protests in Baton Rouge, La., Dallas and a suburb of Minneapolis weighed heavily on Tommy Witcher’s heart.\nSo when it was Witcher’s turn to give the opening prayer at the Church at Decatur Heights on Sunday, he felt he had to unburden his soul.\n“We have to take time out from hate, anger and violence and pray for our brothers and sisters,” said the former Gwinnett County police officer and Marine, who received two Purple Hearts in Vietnam.\n“I’ve been thinking about it a lot,” said Witcher, whose voice catches as he describes his feelings. “The fact is we have to find some way to get along, some way to communicate other than hate. We need to open up our hearts and forgive.”\nSimilar messages and prayers were heard throughout metro places of worship on Sunday. Sundays are often the most segregated times in the nation, but on this day, many expressed similar themes of unity and love.\nOn Saturday, the Rev. Dan Matthews Jr. tore up the sermon he had already prepared and spent much of the day writing a new one.\nSo much had happened during the week that Matthews, pastor of St. Luke’s Episcopal Church in Atlanta, knew his parishioners would want to hear something about the nightmares of the past few days.\nHe wanted to offer a “ray of light in the midst of chaos.”\nHe opted to preach on the Gospel message to love your neighbor as yourself.\n“We can actually reduce the Gospel reading to a simple four-word question,” Matthews said. “Who is my neighbor?”\nFor him, the killings were too much to bear.\n“There is too much hate,” he said. “There is too much bigotry. There is too much death in our society caused by our dehumanization of one another. And it will not change until we begin to change ourselves.\n“Speak to someone you would not have spoken to,” Matthews said. “Listen to someone you would not have listened to. Reach out a helping hand to someone you would not have previously offered assistance to. Look at somebody you would have normally dismissed or avoided and force yourself to see them as your God-created neighbor, as your God-given neighbor.”\nThe Rev. Martha Sterne, of All Saints’ Episcopal Church in Midtown, recalled the story of the Good Samaritan, who assisted a naked, half-dead stranger on the road to Jericho after a priest and others had passed him by. She said the road was dangerous and everyone had places to be, so it was not surprising that he was left for dead. “We get the ones who glance and go on, because we do it every day.”\nSterne, citing the recent events, said knowing how best to help is often difficult, but “for everyone, it starts by not glancing away.”\nNot every church, though, focused on last week’s killings.\nFirst Baptist Church of Dallas has an older congregation, and all those attending on Sunday were white. There was no mention of the officer-involved shootings, the five officers killed in Dallas or the protests sweeping the nation. Instead, Pastor Don Rackley preached about the “pitiful excuses” people give for not coming to church or giving their lives to God.\n“You need a church that is not ashamed to teach the Gospel,” he said.\nLater, he explained that he felt as if people already understood what was happening, without having to mention it in his sermon.\n“It’s not something people need to be reminded of,” he said.\nStill, he thinks his sermon did indirectly involve the killings.\n“If people would get right with God,” he said, “a lot of this wouldn’t be happening.”\nTen minutes down the street, West Ridge Church has a younger congregation.\nBefore the service began, church Elder Chuck Davis told those gathered that the world needed prayer, particularly this past week.\n“This has been a tough week for our nation,” he said. “There are wives who are without husbands, children who are without fathers.”\nDavis called on the church to be empathetic to those “who may not look like you.”\nThen the sermon began with a continuation of a series about finding joy.\nWill the spirit of those messages, though, continue in weeks and months to come?\nThe current turmoil is the reason the church is needed, said Ricky Temple, a visiting pastor at Word of Faith Family Worship Cathedral in Austell.\n“This is our purpose,” he said.\n“When we’re shooting each other, hurting each other and we talk so badly about each other” is when we need God, he added.\nTemple, the pastor at Overcoming by Faith Ministries in Savannah, led Word of Faith in prayer for the nation, cities and “young black men and police officers.”\n“I need to just pray for everybody,” he said. “Lord God, we pray for your hand to be upon us.”\nSuzii Paynter, executive coordinator of the Cooperative Baptist Fellowship, asked member congregations to join together in prayer and pursue racial reconciliation.\n“Seeking peace through justice is what we strive for as a fellowship and what we will redouble our efforts to do in the future,” she said in a recent statement. “We are moved to act with efforts of reconciliation and compassion.”\nShe drew upon the history of the church and faith community as a convening place.\nIn every community, she said, church can join with others to host community forums, including representatives of the community and law enforcement.\n“Reach out to African-American churches in your town and be a partner congregation in convening the community. We know that dialogue and resolution at times can begin and flourish in a sanctuary beyond what we can achieve in the streets. … In the face of violence and fear, movement toward a beloved community takes real work. It also takes prayer for a landscape of grace.”","url":"https://www.ajc.com/news/local/theme-across-atlanta-churches-time-for-healing-racial-wounds/UMDnoP35fVUrytttZaHcgI/"}
