{"authors":[],"date_download":"2018-10-30 14:31:20","date_modify":"2018-10-30 14:31:20","date_publish":"2015-06-19 00:00:00","description":null,"filename":"data/vaneerConsumption/Itstimeforthetailsofquarterstofeatureawoman.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_06_its_time_for_the_tails_of_quarters_to_feature_a_woman_1540909880.html","title":"It's time for the tails of quarters to feature a woman!","title_page":"It's time for the tails of quarters to feature a woman!","title_rss":"NULL","source_domain":"americanthinker.com","text":"It's time for the tails of quarters to feature a woman!\nI was delighted to hear that we are getting that very dead white man, Alexander Hamilton, off the ten dollar bill. What did he ever do to deserve being there anyway? (Aside from being the first Treasury Secretary and setting up our financial system. But really, what has he done for us lately?) But this move should only be the beginning. Women are sorely underrepresented on our currency. For example, we've had the penny for a long time, but why exactly is Abraham Lincoln is on it, rather than a girl named \"Penny\"? If that isn't sexism, what is?\nAnd what about the quarter? We have the head of George Washington on one side. Why do we not have a woman on the bottom or \"tails\" side? Do you think that would do a lot to promote gender equality in our coinage if we had a man on top of the quarter and a woman on the bottom? And of course we should have women on many other bills as well. We should have Michelle Bachmann on the $20 bill And we could put Bruce Jenner on the wooden nickle. And Star Trek's Lt. Uhura and Star Wars' Princess Leia, fictional characters, but women nonetheless, should be on the $50 and $100 bills respectively. But we should be thinking more broadly than currency. What about food stamps? I think Mrs. Obama, who has made nutrition the hallmark of her tenure as first lady, would be the ideal person to have on the face of EBT cards. More generally, why don't we have the faces of women on credit cards? There is not a single credit card today which bears the likeness of a woman on it--how sexist is that? Shouldn't we be doing something to acknowledge the role of women, who spend billions of dollars to keep the economy stimulated? Alternatively, if we wanted to recognize the role of both genders, we could make credit cards in the shape of men, and credit card readers in the shape of women, so when you swipe the man-shaped credit card into the women-shaped credit card reader both genders feel fully involved in this important kind of financial transaction. If you can find one arm of government that doesn't talk about race, sex, or sexual orientation, please let me know in the comments section. This article was produced by NewsMachete.com , the conservative news site.","url":"https://www.americanthinker.com/blog/2015/06/its_time_for_the_tails_of_quarters_to_feature_a_woman.html"}
