{"authors":[],"date_download":"2018-10-30 14:24:07","date_modify":"2018-10-30 14:24:07","date_publish":"2015-08-13 00:00:00","description":null,"filename":"data/vaneerConsumption/ItstheLegacyStupid.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_08_its_the_legacy_stupid_1540909447.html","title":"It's the Legacy, Stupid","title_page":"It's the Legacy, Stupid","title_rss":"NULL","source_domain":"americanthinker.com","text":"Meanwhile, hardworking middle class families see cities hauling out the welcome mat for people in our country illegally -- while their tax dollars provide those immigrants free education and other services. New York City is issuing ID card s that include free membership to 33 cultural institutions and discounts on movie tickets and prescription medicines. For millions of city residents whose wages are stuck and whose rents are soaring, the largesse is provocative.\nThis article in the Fiscal Times by Liz Peek, former Wall Street analyst and one of the first women to become a partner in a Wall Street firm, really nails it. Forget the part about Obama paving the way for Trump. Not that the author is wrong, It is just that her summary of the Obama team record on the socioeconomic issues important to most Americans is what is compellingly succinct and on target. And, as the author maintains, it is dismal. Our legacy obsessed president concentrates on fair (preferential?) treatment of illegals and transgenders and the LGBT community generally along with quixotic wars on bending the direction of climate change and the phobias (Islamo, homo) and “isms” (native, gender, race) of the constituency that elected him while sticking to the tax-paying public to pay up.\nAs a further case in point, recent poll results show that the majority of Americans regard the Obama Iran nuke deal as a bad deal but Obama, nonetheless, is intent on shoving it down the throats of the ignorant public who fail to understand that his legacy is at stake. What will be remembered is his success in passing his major legislative and foreign policy initiatives, not what the public thought about his initiatives at the time.\nSix years of Obama forcing unpopular policies down Americans’ throats; six years of lies and misdeeds by unaccountable bureaucrats; six years of lame growth and resulting wage suppression; six years of appeasing our enemies and facing down our friends; six years of dividing the country -- they have all taken their toll.\nThis article in the Fiscal Times by Liz Peek, former Wall Street analyst and one of the first women to become a partner in a Wall Street firm, really nails it. Forget the part about Obama paving the way for Trump. Not that the author is wrong, It is just that her summary of the Obama team record on the socioeconomic issues important to most Americans is what is compellingly succinct and on target. And, as the author maintains, it is dismal. Our legacy obsessed president concentrates on fair (preferential?) treatment of illegals and transgenders and the LGBT community generally along with quixotic wars on bending the direction of climate change and the phobias (Islamo, homo) and “isms” (native, gender, race) of the constituency that elected him while sticking to the tax-paying public to pay up.\nMeanwhile, hardworking middle class families see cities hauling out the welcome mat for people in our country illegally -- while their tax dollars provide those immigrants free education and other services. New York City is issuing ID cards that include free membership to 33 cultural institutions and discounts on movie tickets and prescription medicines. For millions of city residents whose wages are stuck and whose rents are soaring, the largesse is provocative.\nAnd here is the opening salvo.\nSix years of Obama forcing unpopular policies down Americans’ throats; six years of lies and misdeeds by unaccountable bureaucrats; six years of lame growth and resulting wage suppression; six years of appeasing our enemies and facing down our friends; six years of dividing the country -- they have all taken their toll.\nAs a further case in point, recent poll results show that the majority of Americans regard the Obama Iran nuke deal as a bad deal but Obama, nonetheless, is intent on shoving it down the throats of the ignorant public who fail to understand that his legacy is at stake. What will be remembered is his success in passing his major legislative and foreign policy initiatives, not what the public thought about his initiatives at the time.","url":"https://www.americanthinker.com/blog/2015/08/its_the_legacy_stupid.html"}
