{"authors":["Sebastian Shakespeare For The Daily Mail"],"date_download":"2018-10-22 22:31:56","date_modify":"2018-10-22 22:31:56","date_publish":"2017-03-10 01:01:12","description":"If ratings don't improve on the light entertainment programme The Nightly Show, News At Ten could be restored to its proper time, a source told Sebastian Shakespeare.","filename":"data/vaneerConsumption/ITVbossesrethinkreplacingNewsatTenwithNightlyShow.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1DFE7E00000578-0-image-a-22_1489107485397.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299630_ITV-bosses-rethink-replacing-NEws-Ten-Nightly-Show_1540247516.html","title":"ITV bosses rethink replacing News at Ten with Nightly Show","title_page":"ITV bosses rethink replacing News at Ten with Nightly Show | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bosses at ITV provoked an outcry when they shoved News At Ten out of its traditional slot to make way for The Nightly Show, a light entertainment programme that's been savaged by the critics.\nNow, however, I hear they are considering a humiliating U-turn.\n'If the ratings haven't improved dramatically by the end of next week, the News At Ten will be restored to its proper time,' an ITV source tells me. 'To spare our blushes, The Nightly Show will continue, but it will be broadcast after the news finishes. There's a recognition that we are destroying the news.'\nITV had previously spent a fortune improving News At Ten, which is presented by Prince William's confidant Tom Bradby.\nBBC star Robert Peston was poached to be political editor and Allegra Stratton was drafted in from Newsnight.\nIf ratings don't improve on ITV's The Nightly Show (pictured above), News At Ten could be restored to its proper time\nHowever, the revamp failed to boost the programme's audience significantly, compared with the far more popular BBC News At Ten, presented by Huw Edwards, so ITV chose to launch The Nightly Show.\nThe series, which is scheduled to last for eight weeks, has different presenters taking the reins for five days each.\nLittle Britain star David Walliams was paid £50,000 a day to present The Nightly Show with stand-up comic John Bishop following him this week.\nThough his first show had viewing figures of 2.9 million, Walliams's final programme was watched by just 1.2 million.\nHe said criticism was down to anger at the fact it has pushed back the news in the schedule.\nAn ITV spokesman is keen to play down suggestions that the programme will be switched to 10.30pm.\n'We are not moving The Nightly Show,' he insists. 'It's still very early days as we try something new that extends the prime-time entertainment feel of ITV beyond 10pm.'\nLocation Location Location presenter Kirstie Allsopp, 45, is almost unrecognisable in this unflattering selfie (left), which she posted online yesterday\nShe is one of the most familiar faces on television (below), but Location Location Location presenter Kirstie Allsopp, 45, is almost unrecognisable in this unflattering selfie, which she posted online yesterday.\n'When you have to put on your specs in order to work out which little packet is the conditioner,' she captions it.\nShe could have asked her partner to help and save her the bother.\nHowever, her boyfriend of 13 years, Ben Andersen — the father of her two children — has still to oblige her with a ring on her engagement finger.\nTwenty years after her untimely death, Princess Diana continues to outshine the Royal Family.\nAn exhibition of her dresses at her former home, Kensington Palace, is proving so popular that it's leading to daily queues of visitors.\nEleri Lynn, curator of Diana: Her Fashion Story, which opened last month and was expected to close in the autumn, says it could now stay open for 12 months.\n'I always thought there would be interest in the exhibition because the late Princess of Wales is such an iconic figure, but I never imagined the response would be so great,' she says.\n'We never set an exact closing date, and I thought we might remain open until the end of the summer, but, in fact, we are now thinking about a whole year.'\nCressida Bonas's boyfriend, Harry Wentworth-Stanley, posted this snap at the end of his charity row across the Atlantic to Antigua\nLike mother, like girlfriend? Cressida Bonas's boyfriend, Harry Wentworth-Stanley, posted this snap at the end of his charity row across the Atlantic to Antigua.\n'Some of the weird and wonderful women in my life,' Harry, 26, captions the picture, in which he stands beside his mother, the Marchioness of Milford Haven, who at 56 bears a startling resemblance to Cressie, 28, beside her.\nCressida's ex, Prince Harry, sported a noticeably smoother chest at his friend Tom Inskip's wedding celebrations in Jamaica last week, prompting speculation he'd waxed it to impress his girlfriend Meghan Markle.\nBut Cressie clearly has no aversion to the hirsute look.\nJeremy Corbyn's local Labour Party is holding a fundraising dinner in Islington this month with the Labour leader and Emily Thornberry MP.\nCosting a whopping £60 a head, at least the menu promises to be more scintillating than the company.\nThe dessert is 'hanky panky chocolate cake'.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299630/ITV-bosses-rethink-replacing-NEws-Ten-Nightly-Show.html"}
