{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:39:08","date_modify":"2018-10-30 21:39:08","date_publish":"2016-09-08 01:17:28","description":"Hillary Clinton invented a new alibi for her mis-handling of classified information, telling host Matt Lauer that she used a secure server.","filename":"data/vaneerConsumption/IUsedSecureEmailforClassifiedInfo.json","image_url":"https://media.breitbart.com/media/2016/09/Hillary-Clinton-commander-in-chief-forum-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_09_07__1540935548.html","title":"I Used Secure Email for Classified Info","title_page":"New Hillary Clinton Lie: I Used Secure Email for Classified Info","title_rss":"NULL","source_domain":"breitbart.com","text":"At the NBC News “Commander in Chief” forum on Wednesday night aboard the U.S.S. Intrepid in New York, former Secretary of State Hillary Clinton invented a new alibi for her mis-handling of classified information, telling host Matt Lauer that she used a secure server when she needed to send classified information.\nIn July, FBI director James Comey revealed that Clinton not only withheld and deleted work-related emails, but also sent classified emails — many marked as such — on her private, non-secure email server.\nClinton told Lauer on Wednesday evening:\nI communicated about classified material on a wholly separate system. I took it very seriously. When I traveled, I went into one of those little tents that I’m sure you’ve seen around the world because we didn’t want there to be any potential for someone to have embedded a camera to try to see whatever it is that I was seeing that was designated, marked, and headed as classified.\nIn fact, the FBI report released last week confirmed that Clinton declined to use a state.gov email account, and defied her own department’s policy to use an “authorized information system” for official business. She had no computer in her office, which was a secure environment, nor did she use a computer inside the secured area in her homes. (In her FBI interview, she said she could not recall receiving any advice about email policies.)\nThe report implies that the only time Clinton used a secure system for sending email was when she was traveling abroad — when State Department career staff, not her personal entourage, were responsible for setting up her communications.\nAs left-leaning PolitiFact noted in July:\nTo electronically transmit classified information, State Department employees must use a specific closed system, not their usual @state.gov email addresses. Clinton has said she viewed classified information in hard copy in her office, and she used other secure channels when traveling. Some emails now made public actually show Clinton’s team discussing how they couldn’t email each other classified information over the private server and instead had to move the conversation to a more appropriate venue.\nSo while it might be true that Clinton used a secure system when abroad, she did not use that system as a matter of routine when sending classified material.\nQuite the opposite, in fact: at least some of the time, she sent and received classified information and documents, including emails pertaining to drone strikes, on her private, secret, non-secure server.\nIf there is evidence she used a secure server to send email while inside the U.S., the public has yet to see it.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle, is available from Regnery through Amazon. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/politics/2016/09/07/new-hillary-clinton-claim-used-secure-server-classified-info/"}
