{"authors":["Isabel Schwab","Luxury Listings Nyc"],"date_download":"2018-10-30 22:23:16","date_modify":"2018-10-30 22:23:16","date_publish":"2016-12-14 00:00:00","description":"She also owns a penthouse in the building.","filename":"data/vaneerConsumption/IvankaTrumplists4millioncondo.json","image_url":"https://amp.businessinsider.com/images/58519eeca1a45e61008b5e7b-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ivanka-trump-lists-4-million-condo-2016-12_1540938196.html","title":"Ivanka Trump lists $4 million condo","title_page":"    Ivanka Trump lists $4 million condo - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Trump International Realty / Getty Images Jewelry isn't the only thing Ivanka Trump is hawking. According to city records, the soon-to-be First Daughter has listed an apartment at 502 Park Avenue (a Trump building) for $4.1 million.\nTrump purchased the condo in 2004 for $1.5 million, and listed it for a day in 2011. She later transferred it to an LLC that she controls in 2015. The 1,549-square-foot apartment has two bedrooms, two bathrooms, a corner living and dining room and a chef's kitchen.\nThe listing notes that the unit is a sponsor unit (meaning that it is being sold directly by the developer).\nTrump International Realty\nTrump also owns a penthouse in the building, which she also bought in 2011 for a rumored $16 million. That unit does appear to be listed at this time. Trump's husband, developer Jared Kushner, told the Wall Street Journal earlier this year that he and Ivanka might purchase a unit at the Puck Building, which he owns, and rumors were swirling earlier this month that the couple was house hunting for a home in D.C. to be closer to the White House.\nTrump International Realty Trump International Realty Trump International Realty Trump International Realty\nRead the original story on Luxury Listings NYC. Copyright 2016.\nMORE FROM LUXURY LISTINGS:\nSculptor Anish Kapoor picks up $13.5M unit at 56 Leonard, where his artwork is on display\nLargest 3D printed structure ever commissioned debuts in Miami\nFormer Sports Illustrated model nabs FiDi condo","url":"https://www.businessinsider.com/ivanka-trump-lists-4-million-condo-2016-12"}
