{"authors":["Sarah Mccammon"],"date_download":"2018-10-22 21:19:52","date_modify":"2018-10-22 21:19:52","date_publish":"2018-08-02 00:00:00","description":"The president's daughter said she's \"vehemently against\" separating families, while adding that she's concerned about policies that encourage parents to send children on dangerous journeys.","filename":"data/vaneerConsumption/IvankaTrumpFamilySeparationsALowPoint.json","image_url":"https://media.npr.org/assets/img/2018/08/02/gettyimages-1009577350ivanka_wide-adc58609b903aa810ae959bd924097caf7ac5d91.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_02_634898041_ivanka-trump-family-separations-were-a-low-point_1540243192.html","title":"Ivanka Trump: Family Separations A 'Low Point'","title_page":"Ivanka Trump: Family Separations A 'Low Point' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Ivanka Trump: Family Separations A 'Low Point'\nEnlarge this image toggle caption Alex Wong/Getty Images Alex Wong/Getty Images\nPresident Trump's daughter Ivanka Trump is again speaking out against the separation of children and parents accused of illegally crossing the U.S.-Mexico border.\nAt an Axios News Shapers event in Washington, D.C., on Thursday, Trump was asked for her thoughts on the separations that occurred as a result of her father's immigration policies.\nThe interviewer noted that some White House officials saw that as a \"low point\" in the Trump administration.\n\"That was a low point for me as well,\" she said. \"I feel very strongly about that. And I am very vehemently against family separation and the separation of parents and children.\"\nTrump also called illegal immigration an \"incredibly complex\" topic, and said that her mother, Ivana Trump, was an immigrant who came to the United States legally from a communist country. She added that \"we have to be careful about incentivizing behavior that puts children at risk,\" by encouraging dangerous journeys across the border.\n\"These are not easy issues; these are incredibly difficult issues,\" she said. \"And like the rest of the country, I experience them in a very emotional way.\"\nIn a tweet in June, Trump thanked her father for signing an executive order aimed at ending the separations brought about by his \"zero tolerance\" policy on illegal crossings on the southern U.S. border.\nEchoing statements by her father, she also called on Congress to take steps to reform the immigration system.\nIt's previously been reported that Ivanka Trump and first lady Melania Trump put pressure on the president to end the separation of families. The first lady has made two visits to immigration facilities to meet with children separated from their parents, with immigration officials and with the organizations tasked by the government with caring for the separated children.\nThe federal government said it had reunited all \"eligible\" children and parents in an effort to comply with a court-ordered deadline last week. But hundreds of children still remained in federal custody as of the June 26 deadline, and the Trump administration continues to face tough criticism over the policy and its impact on children.","url":"https://www.npr.org/2018/08/02/634898041/ivanka-trump-family-separations-were-a-low-point"}
