{"authors":["Madhuri Sathish"],"date_download":"2018-10-31 01:52:01","date_modify":"2018-10-31 01:52:01","date_publish":"2018-09-13 21:11:21","description":"Online markets like eBay are full of trinkets and memorabilia that nobody is ever completely sure they need, like antique vases or Trump family relics. As Refinery29's Natalie Gontcharova uncovered this week, Ivanka Trump and Jared Kushner…","filename":"data/vaneerConsumption/IvankaTrumpJaredKushnerMemorabiliaAreBeingSoldOnEBayForHundredsOfDollars.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/13/9ca49207-9a74-4e43-9018-00bd105a2aad-getty-950781052.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_ivanka-trump-jared-kushner-memorabilia-are-being-sold-on-ebay-for-hundreds-of-dollars-11913214_1540950721.html","title":"Ivanka Trump & Jared Kushner Memorabilia Are Being Sold On EBay For Hundreds Of Dollars","title_page":"Ivanka Trump & Jared Kushner Memorabilia Are Being Sold On EBay For Hundreds Of Dollars","title_rss":"NULL","source_domain":"bustle.com","text":"Online markets like eBay are full of trinkets and memorabilia that nobody is ever completely sure they need, like antique vases or Trump family relics. As Refinery29's Natalie Gontcharova uncovered this week, Ivanka Trump and Jared Kushner paraphernalia are on eBay now, and you can buy anything from their wedding prayer book to a birthday card they once sent.\nOne eBay seller is offering a birthday card that Ivanka and Jared reportedly sent to former White House communications director Hope Hicks in October 2016 — a month before Ivanka's father won the presidential election. The card is brief, but appears to be written on Ivanka's own stationery, and it is selling for $799.\n\"Dear Hope,\" the card reads. \"Happy happy birthday! We hope that the year to come brings you lots of love, laughter + adventure — and a big win next month! Love, Jared + Ivanka.\"\nThis card, though it costs hundreds of dollars, is on the cheaper end of the Ivanka and Jared memorabilia that you can find on eBay. Another item that is available for sale is a monogrammed prayer book from the couple's wedding back in 2009. According to the seller, the book is made of white leather and contains glossy pages; the starting bid is $1,500.\nAccording to Refinery29, the seller — who has chosen not to make their identity public — said that the personal letters and family name inscriptions found in the prayer book should prove its authenticity. The book is in new condition, the seller added.\n$1,500 is certainly a great deal of money to pay for a prayer book from a wedding you likely didn't go to — and if you had, you would have received it for free — but this amount pales in comparison to the last of Ivanka and Jared's personal items that Gontcharova was able to dig up. One eBay seller is offering a yearbook from Jared's high school — containing his senior photo as well as photos of his family members and friends — for $18,000. The seller clarifies that while this yearbook did not belong to Jared, the \"exceedingly rare\" book includes a photo of him on his high school's varsity basketball team, as well as a write-up of his accomplishments.\nYou could buy this yearbook for $18,000, Gontcharova writes, \"or you can, you know, buy a car, or feed your family for several months.\" However, this isn't the first item connected to the Trump family that went on sale for hundreds of dollars on eBay. Earlier this year, Melania Trump flew down to visit a detention center at the U.S.-Mexico border — but it was her outfit that garnered the most attention. The first lady was wearing a $39 green cargo jacket from Zara that had been painted with the words \"I really don't care, do u?\"\nThe jacket prompted significant criticism and controversy, and some sellers on eBay decided to take advantage of that, The Washington Post reported at the time. The original coat from Zara was sold out, but sellers who already owned it marketed secondhand versions on eBay for anywhere from $600 to $900.","url":"https://www.bustle.com/p/ivanka-trump-jared-kushner-memorabilia-are-being-sold-on-ebay-for-hundreds-of-dollars-11913214"}
