{"authors":["Lauren Holter"],"date_download":"2018-10-31 01:42:21","date_modify":"2018-10-31 01:42:21","date_publish":"2018-09-14 17:27:40","description":"President Donald Trump's children have tirelessly defended him against any and all criticism since he first launched his bid for office. But the release of Bob Woodward's White House exposé and the New York Times op-ed about \"the resistance inside…","filename":"data/vaneerConsumption/IvankaTrumpWorriesAboutImpeachmentForHerDadAccordingToANewReport.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/dd4d534e-4103-4e1c-be11-65088fdcdc46-getty-1001930764.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_ivanka-trump-worries-about-impeachment-for-her-dad-according-to-a-new-report-11921698_1540950141.html","title":"Ivanka Trump Worries About Impeachment For Her Dad, According To A New Report","title_page":"Ivanka Trump Worries About Impeachment For Her Dad, According To A New Report","title_rss":"NULL","source_domain":"bustle.com","text":"President Donald Trump's children have tirelessly defended him against any and all criticism since he first launched his bid for office. But the release of Bob Woodward's White House exposé and the New York Times op-ed about \"the resistance inside the Trump administration,\" as well as the continuing FBI probe into the Trump campaign, may have them a little rattled. In fact, Ivanka Trump worries about impeachment, a source close to the president's senior advisor told Vanity Fair.\n\"Trump believe's there a coup,\" a person close to the president told Vanity Fair, a concern that was echoed by another anonymous source. Outside of his own family, senior policy adviser Stephen Miller is apparently one of the only aides the president trusts. But even his daughter is reportedly concerned that the recent barrage of negative press, dwindling approval ratings, and numerous lawsuits could end with her father's impeachment. The White House did not return Bustle's request for comment.\nDemocrats taking hold of Congress would put President Trump at greater risk of impeachment, and experts predict that they have a shot at flipping both the House and the Senate this year. A Washington Post report last month revealed that White House aides were considering sending Ivanka to Democratic strongholds to help her dad campaign for Republicans in the midterm election.\nDespite President Trump's repeated claims that his campaign didn't break any laws during the 2016 election and that the FBI probe is nothing more than a \"witch hunt,\" special counsel Robert Mueller's investigation has resulted in five Trump campaign staffers pleading guilty to various charges. Just this week, former campaign manager Paul Manafort pleaded guilty to two counts of conspiracy and obstruction of justice in a deal that got his other federal charges for lobbying violations and money laundering dropped. Manafort was also found guilty on eight counts of tax evasion, bank fraud, and hiding foreign bank accounts on Aug. 21 — and that verdict proved that Mueller can successfully prosecute former Trump staffers.\nMultiple current and former Trump staffers told Politico the president will probably use his executive power to pardon Manafort, but legal experts have pointed out to Vox that pardoning Manafort might backfire. Julie O’Sullivan, a Georgetown University law professor, told Vox:\nIf the president pardons anyone involved in the Russian investigation, it may prove to be one of the stupidest things he has yet done. If the president were to pardon Kushner or Manafort or Flynn, presumably that pardon would extend to the Russia investigation because that is what concerns Trump. If — and this is a big if — the president is shown to have pardoned them to avoid his own personal exposure in the Russia investigation, that in and of itself could constitute obstruction of justice.\nEssentially, pardoning Manafort would increase the risk of Congress impeaching Trump. But what exactly is Ivanka worried will lead to her father's ouster? That remains to be seen, though there are myriad possibilities. For now, her public statements are focused on her day-to-day job.","url":"https://www.bustle.com/p/ivanka-trump-worries-about-impeachment-for-her-dad-according-to-a-new-report-11921698"}
