{"authors":["Bill Chappell"],"date_download":"2018-10-22 21:52:01","date_modify":"2018-10-22 21:52:01","date_publish":"2017-04-25 00:00:00","description":"The first daughter said women must have access to credit and mentors, \"to encourage this next generation\" of female business owners. But remarks about her father drew the biggest reaction.","filename":"data/vaneerConsumption/IvankaTrumpTalksFemaleEntrepreneursAndHerFatherAtW20SummitInBerlin.json","image_url":"https://media.npr.org/assets/img/2017/04/25/gettyimages-672712828_wide-3de0da5141db29b0ab86908812a4e260962fa0fa.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2017_04_25_525533779_ivanka-trump-discusses-female-entrepreneurs-and-her-father-at-w20-summit-in-berl_1540245121.html","title":"Ivanka Trump Talks Female Entrepreneurs And Her Father At W20 Summit In Berlin","title_page":"Ivanka Trump Talks Female Entrepreneurs And Her Father At W20 Summit In Berlin : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Ivanka Trump Talks Female Entrepreneurs And Her Father At W20 Summit In Berlin\nEnlarge this image toggle caption John MacDougall/AFP/Getty Images John MacDougall/AFP/Getty Images\nFirst daughter Ivanka Trump discussed female entrepreneurship, her father and feminism at the W20 Summit in Berlin on Tuesday, joining a panel that included German Chancellor Angela Merkel and the Netherlands' Queen Maxima.\nMerkel invited Trump to the G20-linked event during her visit with President Trump last month in Washington, D.C.\nFeminism was a central topic on the panel, as the moderator, who cited a \"reluctance\" to use the term, asked the panel to raise their hands if they consider themselves a feminist. Trump held up her hand, as did nearly everyone else on the stage.\n\"I do label myself a feminist, and I do think of that in broad terms,\" she said later.\nDiscussing her father, Trump said the president agrees with her about the need to empower women, saying that he had encouraged her \"to fully lean into this opportunity and come into the White House and be by his side\" — and to take part in discussions like the Women20 Summit.\nBut Trump's earlier description of President Trump as a \"tremendous champion of supporting families and enabling them to thrive\" was met with groans and hisses from the audience.\nIvanka Trump's high-profile visit caused a minor sensation in Germany, where her name was trending far higher than Merkel's on Twitter Tuesday. Both the Frankfurter Allgemeine and Suddeutsche Zeitung newspapers called the first daughter her father's \"ambassador\" to Germany.\nSome of the reactions were also complex: An Allgemeine article deemed the younger Trump \"Darth Vader's successor,\" with journalist Lorenz Hemicker saying Trump had replaced Steve Bannon as her father's most influential adviser.\nPolitician Lars Klingbeil, whose Social Democratic Party is in a coalition with Merkel's Christian Democratic Union, questioned the visit by asking, \"Am I the only one who finds it completely absurd that the Chancellor now makes foreign policy with the daughter of Donald Trump?\"\nThe summit panel's discussion had started with something of a jolt, as the moderator, journalist Miriam Meckel, asked Trump to clarify what her role was at the summit — and whether she was representing the U.S., her father, or her business interests.\n\"Certainly not the latter,\" said Trump, who has an office in the West Wing and has access to classified information. She added that she was still defining her role but was intent on furthering women's issues.\nSeeming to acknowledge those reactions, Trump took a moment in her closing remarks to acknowledge differences of opinion at the summit, saying it's important to engage with people who have views that are different from one's own.\nEarlier, Trump stressed the need for women to have access to credit and mentors, \"to encourage this next generation\" of female business owners. She also spoke about the importance of having affordable and safe child care to support women in the workplace, saying it's hard to find anywhere, including in the United States — and that her father is determined to tackle the issue.\nIn addition to Merkel, Trump and Queen Maxima, the panel included International Monetary Fund chief Christine Lagarde and Canadian Minister of Foreign Affairs Chrystia Freeland, as well as Nicola Leibinger-Kammüller, the president and chairwoman of German tool and electronics company Trumpf GmbH.\n\"The first daughter's visit comes at a time when the Trump administration has not yet appointed a new ambassador to Germany,\" NPR's Soraya Sarhaddi Nelson reports from Berlin. \"The American president spoke with Merkel by phone on the eve of his daughter's visit, his fourth call since their March meeting.\"\nOn Monday, Trump also published an opinion piece in The Financial Times about women's economic role, writing with her co-author Jim Yong Kim, \"Only 55 per cent of women participate in the paid labor force globally and they continue to be an untapped source of growth.\"\nBefore attending the Women20 summit, Trump visited the U.S. Embassy in Berlin. She's also scheduled to visit the Holocaust Memorial and a vocational training program at the Siemens company.","url":"https://www.npr.org/sections/thetwo-way/2017/04/25/525533779/ivanka-trump-discusses-female-entrepreneurs-and-her-father-at-w20-summit-in-berl"}
