{"authors":["Chris Spargo For Dailymail.Com"],"date_download":"2018-10-23 03:14:48","date_modify":"2018-10-23 03:14:48","date_publish":"2017-03-16 13:56:45","description":"Ivana Trump is set to share some never-before-heard tales in her new memoir 'Raising Trump,' which will be hitting bookshelves on September 12 and filled with inside scoop about her three children.","filename":"data/vaneerConsumption/IvanaTrumpwritingmemoirofunfilteredpersonalstories.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54797E00000578-0-image-a-2_1489671888527.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319978_Ivana-Trump-writing-memoir-unfiltered-personal-stories_1540264488.html","title":"Ivana Trump writing memoir of unfiltered personal stories","title_page":"Ivana Trump writing memoir of unfiltered personal stories | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A revealing new book that will detail the lives of President Donald Trump's three oldest children and provide a firsthand account of what the billionaire real estate scion is like behind closed doors has been set for release later this year.\nIvana Trump is set to share some never-before-heard tales in her new memoir 'Raising Trump,' which will be hitting bookshelves on September 12 and filled with inside scoop from Donald's first wife and the mother of Donald Jr., Ivanka and Eric.\nThe main focus of the book will be Ivana's children, and all three will be working with their mother to contribute their own memories to the memoir.\n'Every day, people ask me how I raised such great kids. They are truly amazed when I tell them that there was no magic to their upbringing,' said Ivana in a statement.\n'I was a tough and loving mother who taught them the value of a dollar, not to lie, cheat or steal, respect for others, and other life lessons that I’ll share now in 'Raising Trump.\"'\nScroll down for video\nFirst wives club: Ivana Trump will be releasing her second memoir on September 12, 'Raising Trump' (above with Don Jr., Eric and Ivanka in October 2011)\nThe Donald: Ivana will writ about her marriage to Donald (left in 1982, right in 1987) in the memoir, which will be 'non-political' and 'non-partisan'\nFamily time: The book will be about 'motherhood, strength and resilience,' with most of the stories about Ivana's three children, Don Jr., Eric and Ivanka (Ivana and Donald with Ivanka and Eric at Mar-a-Lagoin 1998)\nThe memoir will span the course of Ivana's entire life, from growing up in Czechoslovakia and her escape from the communist regime to marrying Donald and working for the Trump Organization.\nAnd while Ivana will write about how she raised two first sons and a first daughter with the man who is now commander-in-chief, the book promises to be non-political.\nThe memoir will also be non-partisan according to Gallery Books, who is publishing the work.\nThat comes as little surprise given that Ivana was a vocal supporter of her husband in his quest for the presidency, and predicted early last year that he would take the White House.\nAnd those looking for stories critical of President Trump will likely have to look elsewhere due to the strict nondisclosure agreement Ivana signed while finalizing their divorce.\nBestseller: Ivana's first memoir 'The Best Is Yet To Come' was released in 1995 (above)\nIn 1992, President Trump sued Ivana for $25million for allegedly violating that agreement on multiple occasions, and listed her second novel 'Free to Love' as an example.\nHe stated in court papers that parts of the book were based on their marriage. Ivana responded by countersuing, and a year later the two parties reached an agreement.\nThee years later Ivana released her first memoir, 'The Best Is Yet to Come.'\nRaising Trump will be about 'motherhood, strength and resilience' according to Gallery, who also published President Trump's recent book 'Crippled America,' whose title was later changed to 'Great Again.'\n'As her former husband takes his place as the 45th President of the United States, his children have also been thrust into the media spotlight– but it is Ivana who raised them and proudly instilled in them what she believes to be the most important life lessons: loyalty, honesty, integrity, and drive,' wrote Gallery in their release announcing the memoir.\nDon Jr., Eric and Ivanka released a joint statement after their mother's project was announced, saying: 'We are immensely proud of our mother and excited for the publication of her new book, Raising Trump. She is an amazing mom, teacher and inspiration to all of us. We are incredibly grateful to have grown up in such a loving and close family.'\nChipping in: The three oldest Trump children will also contribute to the book, sharing their own memories from their lives (Eric, Ivanka, Donald and Don Jr. above in January)\nMotherhood: 'I was a tough and loving mother who taught them the value of a dollar, not to lie, cheat or steal, respect for others,' said Ivana of raising her children (Don Jr. left in 2007, Ivanka right in early 90s)\nIvana was a 28-year-old model from Czechoslovakia in 1977 when she married Donald.\nThe couple went on to have three children before divorcing in 1992.\nShe was rumored to have gotten approximately $20million, their $15million estate and 49% ownership in Mar-a-Lago in Palm Beach in their divorce.\nShe also reportedly receives $350,000 a year in alimony and was able to keep all her jewelry.\nAt the time there was also much talk about Donald's relationship with Georgia beauty queen Marla Maples, and rumors that Ivana had it out with the other woman on the ski slopes of Aspen.\nDonald said around that time in an interview with Vanity Fair: 'To tell you the truth, I’ve made Ivana a very popular woman. I’ve made a lot of satellites. Hey, whether it’s Marla or Ivana. Marla can do any movie she wants to now. Ivana can do whatever she wants.'\nIvana told a much different story however to Liz Smith about the horrible impact the divorce was allegedly having on the couple's children.\n'The children are all wrecks. I don’t know how Donald can say they are great and fine,' said Ivana.\n'Ivanka now comes home from school crying, \"Mommy, does it mean I’m not going to be Ivanka Trump anymore?\" Little Eric asks me, \"Is it true you are going away and not coming back?\"'\nMoving on: Ivana split from Donald due to his relationship with Marla Maples (right in 1994) and went on to marry twice more, including to Rossano Rubicondi (left with Ivana, Donald and Melania in 2002)\nGrandma: Ivana posed with her son Don's three oldest children during her birthday last year (l to r: Donald III, Ivana, Kai and Tristan)\nMarla also spoke about her relationship with Ivana in People last year, responding to Ivana's comments to DailyMail.com that she did not accept Marla's apology for her role in the breakup of her marriage to Trump.\n'That makes me sad because I wish her nothing but love,' said Marla.\n'I love her kids, and if she's holding any kind of resentment toward me, I really hope, for her sake, that she can forgive me.'\nMaples also said of her time with Trump; 'If I had to do it over again, I would just live my life and not worry so much about what other people thought.\n'I wish I had had more fun. Even during the crazy times, I wish I’d laughed more.'\nIvana went on to get married two more times, first to Riccardo Mazzucchelli in 1995, a union that was dissolved after two years.\nShe was then married to Rossano Rubicondi in 2008, but that union lasted less than a year with the two divorcing in 2009, though they have been seen together many times since.\nDailyMail.com revealed earlier this month that Rubicondi was opening a new pizza restaurant in West Palm Beach, just a few miles from Mar-a-Lago.","url":"https://www.dailymail.co.uk/news/article-4319978/Ivana-Trump-writing-memoir-unfiltered-personal-stories.html"}
