{"authors":[],"date_download":"2018-10-22 21:57:29","date_modify":"2018-10-22 21:57:29","date_publish":"2014-06-07 01:15:52","description":"The stabbed child's parents praised their \"brave girl\" as the 12-year-old was released from the hospital, almost a week after she was nearly killed.","filename":"data/vaneerConsumption/IWantedtoLiveSlenderManStabbingVictimReleasedFromHospital.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/493891/140606-wisconsin-stabbing-2038_e1990a448667a5caae5dc1305aa05a75.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_slender-man-stabbing_i-wanted-live-slender-man-stabbing-victim-released-hospital-n125061_1540245449.html","title":"'I Wanted to Live': 'Slender Man' Stabbing Victim Released From Hospital","title_page":"'I Wanted to Live': 'Slender Man' Stabbing Victim Released From Hospital","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA 12-year-old Wisconsin girl who was stabbed 19 times last weekend mustered the resolve to crawl out of the woods because \"I wanted to live,\" her parents said Friday.\nThe girl, who isn't being named because she is a juvenile, was released Friday from Waukesha Memorial Hospital, her parents said in a statement.\n\"While we have kept discussions about the events of May 31, 2014, with her short, we did ask how she found the strength to crawl out of the woods,\" they said. \"Her response was simple: 'I wanted to live.'\"\nTwo other 12-year-old girls have been charged with first-degree intentional attempted murder. They are being tried as adults.\nPolice said they lured the victim into the woods and stabbed her 19 times in a gruesome attack meant to appease \"Slender Man,\" a spectral online character created in 2009 by Eric Knudsen.\n\"Our strong, brave girl loves school and her teachers,\" her parents said. \"She is looking forward to summer, but has voiced that she will miss attending classes even more.\"\nThe girl's favorite class is French, and \"teases her little brother by saying words he cannot understand,\" they said.\n\"Although the sparkle has dimmed for now, we know it will be back again brighter than ever because of the amazing support she has worldwide!\" they added.\n—M. Alex Johnson","url":"https://www.nbcnews.com/storyline/slender-man-stabbing/i-wanted-live-slender-man-stabbing-victim-released-hospital-n125061"}
