{"authors":[],"date_download":"2018-10-22 21:50:50","date_modify":"2018-10-22 21:50:50","date_publish":"2014-06-06 17:29:02","description":"Apple’s recently unveiled iOS 8 software places a big emphasis on health, and the purported iWatch would fit snugly within this ecosystem.","filename":"data/vaneerConsumption/iWatchHittingWristsfor200inSeptemberReport.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/492691/iwatch_8a7445a22d2dcaa95959966eb2c99a20.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gift-guide_iwatch-hitting-wrists-200-september-report-n124656_1540245050.html","title":"iWatch Hitting Wrists for $200 in September: Report","title_page":"iWatch Hitting Wrists for $200 in September: Report","title_rss":"NULL","source_domain":"nbcnews.com","text":"In a note published by Business Insider, White predicts that the first-generation iWatch will be a companion device that requires an iPhone for use. He estimates that the gadget will run consumers anywhere from $199 to $229, which is significantly less expensive than current smartwatches like the $299 Samsung Gear 2.\nMORE: 10 Tips Every iPhone Owner Should Know\nWhite also claims to have found more evidence supporting a 5.5-inch iPhone 6, which is also rumored to launch in September following the release of a 4.7-inch model (possibly in August). Apple has never launched a companion device during any of its annual iPhone reveals, so a simultaneous debut for the iPhone 6 and iWatch would certainly shake things up.\nThe iWatch is expected to run iOS and allow users to download applications. It will likely feature a curved display and biometric sensors to help users keep better tabs on their fitness. Apple just debuted an iPhone commercial that highlights several third-party health gadgets, but it looks as though the company will be stepping into the ring itself this fall.\nApple’s recently unveiled iOS 8 software places a big emphasis on health, and the purported iWatch would fit snugly within this ecosystem. There’s also Apple’s newly acquired Beats Electronics, a resource that the smartphone maker could be tapping to optimize the smartwatch’s audio and fitness features.","url":"https://www.nbcnews.com/tech/gift-guide/iwatch-hitting-wrists-200-september-report-n124656"}
