{"authors":["Amy Lyall For Daily Mail Australia"],"date_download":"2018-10-22 20:41:11","date_modify":"2018-10-22 20:41:11","date_publish":"2016-01-29 02:45:27","description":"Kyle Sandilands and his KIIS 106.5 FM co-host Jackie 'O' Henderson aren't shy when it comes to their on-air antics.","filename":"data/vaneerConsumption/JackieOHendersonstunnedasKyleSandilandsasksquestionsaboutherphysique.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/30AE306C00000578-0-image-a-21_1454028940047.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422019_Jackie-O-Henderson-left-stunned-Kyle-Sandilands-asks-questions-physique-filming-television-ad_1540240871.html","title":"Jackie 'O' Henderson stunned as Kyle Sandilands asks questions about her physique","title_page":"Jackie 'O' Henderson stunned as Kyle Sandilands asks questions about her physique | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kyle Sandilands and his KIIS 106.5 FM co-host Jackie 'O' Henderson aren't shy when it comes to their on-air antics.\nAnd now a behind-the-scenes video of their latest television commercial and photo shoot, released on Thursday, reveals that the partners in crime don't stop off-air.\nIn the clip, shock jock Kyle asks Jackie 'who do you think weights more, you or me?\nNo holding back: KIIS FM radio duo Kyle Sandilands and Jackie 'O' Henderson give fans a behind the scenes look of their latest advertising campaign in a video released on Thursday\nNot impressed: Jackie isn't happy when co-host Kyle Sandilands asks who weighs more out of the two\nThe blonde beauty is left stunned by the question and fires back 'is this a trick question?'\nWhen a straight faced Kyle tells her he isn't kidding, she answers 'you', before he hurls obscenities at her.\nThe controversial 44-year-old breakfast host is seen wearing a suit for the shoot, a move away from his usual casual attire that consists of black shorts, a large black T-shirt and a black baseball cap.\nThe finished product: Kyle and his work wife Jackie got through a long day of television filming and a photo shoot together\nHe makes sure to make an entrance for his day of work, arriving in his flashy Rolls Royce.\n'My most hated thing on earth, dancing around like an idiot getting pictures taken,' he says of the shoot.\nThe duo are then seen larking around while getting their hair and makeup done, the crew having a laugh as Kyle shoves a small blower fan in his mouth.\nFooling around: The duo are then seen larking around while getting their hair and makeup done, the crew having a laugh as Kyle shoves a small blower fan in his mouth\nTricks of the trade: Jackie sits in the make-up chair she reveals a trick that keeps her hair looking picture perfect\nAs 40-year-old Jackie sits in the make-up chair she reveals a trick that keeps her hair looking picture perfect.\n'Little trick of the trade is covering up my regrowth with this make-up, like an eye shadow that they're painting on,' she says as a stylist brushes the colour onto her roots.\nAnd she isn't the only one getting her hair done, at one point Kyle jokes around with a row of blonde hair extensions held up to his head.\nNew look for you? And she isn't the only one getting her hair done, at one point Kyle jokes around with a row of blonde hair extensions held up to his head\nA busty display: The mother-of-one also has an outfit change for a separate photo shoot, wearing a plunging black Carla Zampatti jumpsuit that leaves little to the imagination\nThe mother-of-one also has an outfit change for a separate photo shoot, wearing a plunging black Carla Zampatti jumpsuit that leaves little to the imagination.\nKyle, not one to hide his opinions, has only one thing to say when she steps on set, exclaiming: 'Jesus!'\nThe pair posed for promotional shots together, although it was later revealed that Jackie wasn't comfortable with the amount of cleavage that was exposed.\nShe said she was too shy to show off her bust and convinced the radio station to digitally alter the photo to make her cleavage look smaller for billboards.\nWhile on-air earlier this month Jackie's co-host Kyle, who likes to tease his partner-in-crime, demanded billboards be changed to the original shot for one hour to put her assets on display.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422019/Jackie-O-Henderson-left-stunned-Kyle-Sandilands-asks-questions-physique-filming-television-ad.html"}
