{"authors":["Rebecca Taylor For Mailonline"],"date_download":"2018-10-23 03:50:18","date_modify":"2018-10-23 03:50:18","date_publish":"2017-03-16 14:52:52","description":"A video of Elvis, a Jack Russell from Middlesborough, hanging off his owner Carl's back while the pair cycle around the town has gone viral when it was shared by a dog swimming pool owner.","filename":"data/vaneerConsumption/JackRussellcalledElvishitchesliftaroundtownonbike.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54780F00000578-0-image-a-55_1489670981223.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320134_Jack-Russell-called-Elvis-hitches-lift-town-bike_1540266618.html","title":"Jack Russell called Elvis hitches lift around town on bike","title_page":"Jack Russell called Elvis hitches lift around town on bike | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A dog that thinks it's a monkey has found fame in his hometown after hitching a ride on his owner's back while he rides a bike.\nElvis, the Jack Russell, is regularly spotted riding around Middlesbrough, North Yorkshire with owner, Carl Green.\nThe cute pooch is usually peeking over Carl's shoulder while holding on to his back as they cycle around the town.\nCarl and Elvis were spotted riding their bike by Lee Westwood, who runs the Diamond Dog Hydrotherapy Fitness Centre in Middlesbrough\nCarl shows how Elvis hangs off his back while the pair ride through the North Yorkshire town, left, and right, they ride off into the distance\nIn a sweet clip, Carl takes him for a swim at the Diamond Dog Hydrotherapy Fitness Centre, before they cycle off into the distance together, with Elvis looking a little disheveled.\nElvis has since become a local celebrity around the area after being spotted numerous times and has even been nicknamed 'shoulder dog'.\nElvis peeks over his owner's shoulder while the two ride around the town, and have been spotted out and about by other Middlesbrough residents\nLee Westwood, posted the video on Facebook on Sunday, writing: 'We had to give him a free swim and bath at Diamond Dog Hydrotherapy Fitness Centre.'\nCarl, a student, 31, said: 'He's two and a half years old and I've had him since he was a puppy.\n'He was actually the runt out the litter but I see him and was like \"I've got to have him\".\n'He's always liked going on my shoulders, he loves it. He does it when I'm off the bike as well.\n'I think it's because I take him out for walks every day and when he's been running and gets tired, he will just go on my back then.\nElvis has won the nickname 'shoulder dog' from many as he clings to Carl when they ride around. The video shared of the pair together has been viewed 6,100 times\n'He will put his head up in the air because he likes the wind in his face. When it's not too windy I can go quite fast, he likes it when there's more wind in his face. He hasn't fallen off once.\n'He's certainly got a good grip. People say \"does he not strangle you?\" but he doesn't at all, he just grips on well.\n'Everyone knows him around here, he's a great dog and the best thing about it is he's called Elvis so when I call on him, people are always looking round.\n'People are constantly stopping us and taking videos and sending them over to me so he's a bit of a celebrity round here, I think he's a bit of a diva and actually prefers it to walking now.'\nCommenting after spotting the video on Facebook, David Mackenzie said: 'I seen him peddle past with the dog on his shoulder yesterday. I thought I was tripping. Only in Boro.'\nNaomi Freeman wrote: 'This is cute and scary at the same time.\nNatalie Pattison said: 'What the actually f*** though. Piggy backing a dog.'\nSome people were left concerned about the dog, saying he could easily fall into the road because he isn't harnessed\nBut some people took to the video, concerned for the dogs safety.\nMarie Sayer said: 'Poor dog. What if it falls off on the road. I'd wear a backpack, put its hind legs in at least.'\nSince the video has been getting shared, Carl took to Facebook writing: 'Can't believe my little Mr Elvis has went viral. Hahaha. love it.'\nAnd one of Carl's friends even suggested the pair go on a talent show.\nRobbie Barker said: 'Britain's Got Talent mate. Learn to wheelie bike him on shoulders bro.'","url":"https://www.dailymail.co.uk/news/article-4320134/Jack-Russell-called-Elvis-hitches-lift-town-bike.html"}
