{"authors":["Arkansas Democrat-Gazette"],"date_download":"2018-10-30 14:37:03","date_modify":"2018-10-30 14:37:03","date_publish":"2015-11-26 00:00:00","description":"Arkansas' basketball team was the victim of a public mugging Thursday in New York.","filename":"data/vaneerConsumption/JacketswhupuponHogs.json","image_url":"https://media.arkansasonline.com/img/photos/2015/11/26/Arkansas_Georgia_Tech_Jone_1_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_nov_27__1540910223.html","title":"Jackets whup up on Hogs","title_page":"Jackets whup up on Hogs","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Arkansas head coach Mike Anderson, left, talks to Anthlon Bell (5) during the second half of an NCAA college basketball game against Georgia Tech Thursday, Nov. 26, 2015, in New York. (AP Photo/Frank Franklin II)\nArkansas' basketball team was the victim of a public mugging Thursday in New York.\nGeorgia Tech beat up the Razorbacks physically at the Barclays Center in an 83-73 victory in the Preseason NIT semifinals.\nGame sketch RECORDS Arkansas 2-2. Georgia Tech 4-1. STARS Georgia Tech: Senior forward Charles Mitchell (18 points, 18 rebounds) and senior guards Adam Smith (19 points) and Marcus Georges-Hunt (19 points). Arkansas: Junior guard Dusty Hannahs (17 points). TURNING POINT After Arkansas pulled to within 64-61 on Manny Watkins’ three-point play, Georgia Tech responded with a 7-1 run — started by Smith’s three-point basket — to push its lead to 71-62 with 2:44 left. KEY STAT The Yellow Jackets outscored the Razorbacks 26-5 on second-chance points. UP NEXT Arkansas plays Stanford at 11:30 a.m. Central today in the consolation game on ESPNU.\nThe Yellow Jackets outrebounded Arkansas 50-26, which helped Georgia Tech outscore the Razorbacks 26-5 in second-chance points.\n\"Early on, they established that they were going to attack the glass on us and I don't think we did a very good job of keeping them off the boards,\" Arkansas Coach Mike Anderson said.\nSenior forward Charles Mitchell, 6-8, 256 pounds, led Georgia Tech's assault with 18 points and 18 rebounds. He hit 5 of 8 shots and 8 of 10 free throws and had 3 assists.\n\"Nobody was better today than Charles,\" Yellow Jackets Coach Brian Gregory said. \"He's gotten himself in shape. He's able to play 32 minutes now, and he's able to do a lot of different things on the court for us.\"\nMitchell had almost as many offensive rebounds (seven) as Arkansas (nine).\n\"I don't know if that has ever happened, where a guy gets 18 and 18,\" Anderson said. \"I thought our lack of physicality was very evident, and they took advantage of us.\n\"There were times we played small ball -- not that we wanted to.\"\nMoses Kingsley, Arkansas' 6-10 junior, was limited to 23 minutes because of foul trouble. He had 13 points, 9 rebounds and 3 assists before fouling out with 1:17 left.\nThe Razorbacks lost 6-9 sophomore Trey Thompson when he suffered right ankle injury with 2:55 left. Thompson didn't play the rest the game and was scoreless with one rebound in seven minutes.\nArkansas 6-10 senior Willy Kouassi, a graduate transfer from Kennesaw (Ga.) State, had 5 points, 2 rebounds and 2 blocked shots in 15 minutes off the bench.\n\"I was really proud of Willy Kouassi,\" Anderson said. \"I thought that he went out and he played big for us. Maybe he's that guy that should be out there that could be another guy of size that could give us some rebounding.\"\nArkansas will play Stanford at 11:30 a.m. today in the consolation game. Villanova beat Stanford 59-45 Thursday to advance to the championship game against Georgia Tech.\nThe Arkansas-Stanford game will be televised on ESPNU.\nGeorgia Tech senior guards Marcus Georges-Hunt and Adam Smith scored 19 points each against Arkansas. Smith hit 5 of 7 three-pointers and Georges-Hunt made 3 of 5. Ben Lammers, a 6-10 sophomore, added 10 points and 8 rebounds in 15 minutes off the bench.\nYellow Jackets junior point guard Josh Heath -- the son of former Arkansas Coach Stan Heath -- had 5 assists, 4 points and 3 rebounds.\nJunior guard Dusty Hannahs led Arkansas (2-2) with 17 points in 24 minutes off the bench. He hit 2 of 3 three-pointers and 5 of 5 free throws. Hannahs has hit 13 of 19 three-pointers this season and 16 of 16 free throws.\nSenior guard Anthlon Bell scored 14 points for the Razorbacks, and freshman guard Jimmy Whitt added 10.\n\"We knew that we were going to have to play extremely well for 40 minutes,\" Gregory said. \"We had to keep our concentration, effort level, and energy up because that's the way Arkansas plays. They take advantage of every time you don't do that, and that's exactly what they did this afternoon.\n\"To our guys' credit, they responded well to some of the runs Arkansas made.\"\nArkansas led for a total of 33 seconds, going ahead twice in the first half, 35-33 on Hannahs' 15-foot jumper and 36-35 on a free throw by Kouassi.\nGeorgia Tech got a three-pointer and layup from Smith in the final 1:50 of the half to take a 41-38 lead into halftime. The Yellow Jackets pushed their lead to 54-44 on Lammers' tip-in basket with 13:30 left.\nArkansas pulled to within 55-53 at the 10:48 mark on a driving basket by junior guard Manny Watkins.\nGeorges-Hunt hit a three-point basket and two free throws as the Yellow Jackets went ahead 64-56.\nWatkins' three-point play -- on a drive and free throw -- cut Arkansas' deficit to 64-61 with 5:34 left, but the Razorbacks couldn't draw any closer the rest of the game.\nSmith's three-point basket started a 7-1 run for Georgia Tech that put it ahead 71-62 with 2:44 left. The Yellow Jackets hit 8 of 10 free throws in the final 1:54 to clinch the victory and finished 19 of 27.\nArkansas hit 15 of 23 free throws and was outscored 18-16 in points off turnovers.\n\"We left some free throws on the line, we turned the ball over, just unforced turnovers that led to baskets for them,\" Anderson said. \"It just seemed like we continued to play uphill, but that's the learning curve for our basketball team.\"\nSports on 11/27/2015","url":"https://www.arkansasonline.com/news/2015/nov/27/jackets-whup-up-on-hogs-20151127/"}
