{"authors":["Bobbie Whiteman For Dailymail.Com"],"date_download":"2018-10-23 02:16:18","date_modify":"2018-10-23 02:16:18","date_publish":"2016-01-29 16:41:33","description":"With his pale skin and dark centre-parted hair, the 40-year-old rocker appeared to be channelling the 52-year-old Pirates Of The Caribbean actor when he turned up in Park City, Utah on Thursday.","filename":"data/vaneerConsumption/JackWhitelooksthespittingimageofJohnnyDeppatSundance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B3E28F00000578-0-image-a-4_1454081388488.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422998_Jack-White-looks-spitting-image-Johnny-Depp-Sundance-s-promoting-American-Epic_1540260978.html","title":"Jack White looks the spitting image of Johnny Depp at Sundance","title_page":"Jack White looks the spitting image of Johnny Depp at Sundance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Just call him Jack Sparrow.\nRocker Jack White appeared to be channelling Johnny Depp when he turned up at the Sundance Film Festival in Park City, Utah, on Thursday.\nWith his pale skin and bobbed dark hair, he was a dead ringer for the Pirates Of The Caribbean actor.\nScroll down for video\nSeeing double: Jack White, right, looked the image of Johnny Depp when he turned up at the Sundance Film Festival in Park City, Utah on Thursday for the premiere of his American Epic\nThe ex-White Stripes frontman added to the effect by wearing a sharp dark suit, with an olive green shirt and black tie.\nHe also donned black and white brogues - a pop of eccentricity worthy of Johnny himself.\nAnd Jack has perfected the star's stony stare as he walked the red carpet.\nOf course, there are a few things about them that are very obviously different.\nThey even have the same taste in shoes: The rocker 40-year-old, pictured on the festival red carpet has pale skin and dark hair centre-parted and styled in a similar way to the Pirates Of The Caribbean actor\nJohnny is 52 and 5ft 10. Jack, who is 40, would tower over him at 6ft 2ins.\nThe musician was at Sundance to support American Epic: Out Of The Many The One, his first stab at producing.\nIt's a three-part documentary and feature film focusing on the US recording industry over almost 100 years when the invention of the first electric recording machine changed the world of music forever.\nHat's off: Jack posed with recording legend T-Bone Burnett for their three-part documentary and feature film focusing on the US recording industry over almost 100 years\nJack could be his stand-in: The likeness between the two men is obvious even with Johnny in character as Captain Jack Sparrow in this still from Pirates Of The Caribbean: Dead Men Tell No Tales, due out in 2017\nJack also took part in a panel discussion about American Epic.\nThere's no chance of the doppelgangers bumping into each other at Sundance even though Johnny's film. Yoga Hosers, played there.\nHe isn't in Park City but one of his co-stars, his 16-year-old daughter, Lily-Rose, is at the festival. Let's hope she doesn't get confused if she meets Jack.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422998/Jack-White-looks-spitting-image-Johnny-Depp-Sundance-s-promoting-American-Epic.html"}
