{"authors":["Erin Delmore"],"date_download":"2018-10-31 01:50:44","date_modify":"2018-10-31 01:50:44","date_publish":"2018-09-06 12:00:52","description":"When Rep. Jackie Speier (D-CA) spoke out about her abortion on the floor of the U.S. House of Representatives in 2011, she was the first woman elected to federal office ever to do so. Though she's been a leader on women's issues throughout her…","filename":"data/vaneerConsumption/JackieSpeierWantsBrettKavanaughToBeGrilledHarderOnAbortionHeresWhatShedAsk.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/5/cef387ac-be1c-4351-b130-c73f9e0cf7cd-getty-887729472.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_jackie-speier-wants-brett-kavanaugh-to-be-grilled-harder-on-abortion-heres-what-shed-ask-10235472_1540950644.html","title":"Jackie Speier Wants Brett Kavanaugh To Be Grilled Harder On Abortion - Here's What She'd Ask","title_page":"Jackie Speier Wants Brett Kavanaugh To Be Grilled Harder On Abortion — Here's What She'd Ask","title_rss":"NULL","source_domain":"bustle.com","text":"When Rep. Jackie Speier (D-CA) spoke out about her abortion on the floor of the U.S. House of Representatives in 2011, she was the first woman elected to federal office ever to do so. Though she's been a leader on women's issues throughout her Capitol Hill career, as a member of the House, Speier won't decide on Judge Brett Kavanaugh's nomination to the Supreme Court. She warns that Kavanaugh's appointment would tilt the balance of power on the court to its conservative justices, and abortion rights advocates worry that will lead to abortions being out of reach for women in many states, if not nationwide.\n\"This is a code blue, four-bell alarm issue that I don’t think we’re taking seriously enough,\" Speier tells Bustle.\nMembers of the U.S. House like Speier don't have a role in the Supreme Court confirmation process, which plays out entirely in the Senate. Speier isn't shy about saying that she thinks her colleagues in that chamber are messing it all up.\n\"It's alarming to me that pro-choice senators like [Susan] Collins and [Lisa] Murkowski can somehow rationalize this,\" she says.\nChip Somodevilla/Getty Images News/Getty Images\nHaving voiced support for Roe v. Wade, Republican Senators Collins and Murkowski are Democrats' best hope to defeat Kavanaugh's nomination. But Speier thinks they're not looking at Kavanaugh critically enough.\n\"Part of our job is as elected [officials] is to be suspicious of what people say, you know, to drill down,\" Speier says.\n\"There is no comfort in knowing that he said — if he said — that Roe v. Wade is settled law, because we have seen it happen over and over again where you can absolutely violate that court decision by a thousand cuts.\"\nBoth Collins and Murkowski met one-on-one with Kavanaugh and questioned him about his thoughts on Roe. However, both senators seemed placated by Kavanaugh's assurances that he believes Roe is \"settled law\" and thus not up for debate. Legal experts, though, point out that plenty of \"settled laws\" have been changed — and that Kavanaugh saying those magic words is no reason to believe Roe will be safe with him on the court.\n\"I don't know what their conversations with Kavanaugh were like, but I wouldn’t have stopped by saying 'What’s your position on Roe v. Wade,'\" Speier says. \"I would have said, 'How do you feel about limiting abortions to so many weeks, or requiring three day waiting periods?'\"\nIf she were sitting on the dais questioning Kavanaugh this week, Speier says that she would go through each states' abortion laws, one by one, and ask the judge for his thoughts on the legality of each statute.\n\"There is no comfort in knowing that he said — if he said — that Roe v. Wade is settled law, because we have seen it happen over and over again where you can absolutely violate that court decision by a thousand cuts, and that’s what happened around the country,\" Speier says. \"The state legislatures around the country have literally shut down a woman’s right to choose by the kinds of restrictions that have been put in place.\"\nSince a wave of Republican lawmakers came to power in 2010, more than 400 state laws to restrict abortion access have been passed. Twenty-one states ban abortions after 20 weeks, and six states have just one abortion clinic operating within their borders. Two of those six states are represented by Democratic senators facing tough re-election battles this fall: North Dakota's Heidi Heitkamp and West Virginia's Joe Manchin. They're part of a handful of Democrats who Republicans are eying as crossover votes in Kavanaugh's confirmation battle.\n\"Women need to make it very clear to those at-risk U.S. senators who are Democrats that if you vote for Kavanaugh, you’re going to lose my vote.\"\nThe conventional wisdom is that if Kavanaugh earns the vote of every Republican senator (currently there are 50, but there will be 51 once the late Sen. John McCain's replacement is seated), he'll be confirmed no matter what. That means red-state Democrats can shore up some conservative support in their home states by voting for Kavanaugh before everyone heads to the ballot box in November. Those Democrats would be able to appeal to their Republican-heavy constituency and brag about their bipartisan vote in election ads without actually changing the outcome of the vote.\nAlex Wong/Getty Images News/Getty Images\nSpeier warns that red-state Democratic voters won't stand for that gambit, and that elected leaders can't win re-election without their blue base.\n\"Their votes for Kavanugh I think are going to be more devastating than they think,\" Speier says, warning that Democratic senators who vote \"yes\" on Kavanaugh will see their base \"fall out from under them.\"\n\"Women need to make it very clear to those at-risk U.S. senators who are Democrats that if you vote for Kavanaugh, you’re going to lose my vote,\" she adds. \"And if you lose my vote, you’re going to lose 50 percent of your Democratic base. And then you’re going to lose your re-election.\"\nBut Speier acknowledges that up until this point, women aren't making it clear. She says that since President Trump nominated Kavanaugh in July, she hasn't seen the kind of large-scale protests that are the core of the resistance in the Trump era. While 65 percent of young people said that abortion should be legal in most or all cases, according to an April survey from the Public Religion Research Institute, reproductive rights advocates say young people aren't fired up about the issue because they've never lived without a constitutional right to an abortion.\n\"You’re not seeing women’s marches in D.C. right now\" on abortion rights, Speier observes. \"I think a lot of women are fatigued. A lot of them don’t believe that this is as dire as I think it is... because they haven’t lost it yet. And it’s tragic that they almost have to lose it before they realize how important it is.\"","url":"https://www.bustle.com/p/jackie-speier-wants-brett-kavanaugh-to-be-grilled-harder-on-abortion-heres-what-shed-ask-10235472"}
