{"authors":["Jj Nattrass For Mailonline"],"date_download":"2018-10-23 01:29:22","date_modify":"2018-10-23 01:29:22","date_publish":"2016-01-28 15:47:33","description":"Following a meal at luxury Italian restaurant, E. Baldi, on Wednesday night, the 78-year-old The Shining star and the Milk actor, 55, appeared in high spirits as they left the upscale eatery.","filename":"data/vaneerConsumption/JackNicholsonandSeanPennkeepalowprofileinBeverlyHills.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB3FB000000578-0-image-a-86_1453996013176.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421168_Hollywood-legends-Jack-Nicholson-Sean-Penn-low-profile-enjoy-boys-night-Beverly-Hills_1540258162.html","title":"Jack Nicholson and Sean Penn keep a low-profile in Beverly Hills","title_page":"Jack Nicholson and Sean Penn keep a low-profile in Beverly Hills | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They both belong to an elite club in the gilded world of Tinsel Town being Oscar-winners.\nSo it was little surprise to see Hollywood Legends Jack Nicholson and Sean Penn enjoying a quiet night out on the town together, on Wednesday night - possibly reminiscing over past glories.\nFollowing a meal at luxury Italian restaurant, E. Baldi, the 78-year-old The Shining star and the Milk actor, 55, appeared in high spirits as they left the upscale eatery.\nScroll down for video\nThe boys are back in town! Hollywood Legends Jack Nicholson and Sean Penn were seen enjoying a quiet night out on the town together, on Wednesday night - possibly reminiscing over past Oscar glories\nThe actors - who have worked in two movies together in their time, The Crossing Guard (1995) and The pledge (2001) - appeared to be relishing the chance to catch up with one another.\nLeaving the restaurant it appeared that Sean and Jack were sharing a ride that night, as the Batman actor was seen waiting for Sean to pay for car parking.\nJack - who earned his first Oscar for his rile in One Flew Over The Cuckoos Nest - had opted for a classic staple in his wardrobe - a slick dark suit.\nLow-key: Following a meal at luxury Italian restaurant, E. Baldi, the 78-year-old The Shining star and the Milk actor, 55, appeared in high spirits as they left the upscale eatery\nWearing an open-necked purple silk shirt, the actor cut a smart yet understated figrue as he lounged against a wall.\nJack rounded hi smart look off by wearing a pair of black brogues.\nDirector and actor Sean went for a much more low-key look, with the Mystic River star stepping out in a gunmetal bomber jacket, tee-shirt, jeans and sneakers.\nCatching up: The actors - who have worked in two movies together in their time, The Crossing Guard (1995) and The pledge (2001) - appeared to be relishing the chance to catch up with one another\nWith his greying hair in a slicked back centre-parting, the actor was instantly recognizable.\nHollywood's elite Sean Penn and Jack Nicholson leave a low-key dinner at E Baldi Italian restaurant in Beverly Hills. Penn has been doing his best to stay out of the limelight after the El Chapo Rolling Stone interview.\nThe duos outing comes not long after the actor sparked controversy by interviewing notorious Mexican gang leader Joaquin 'El Chapo' Guzman for Rolling Stone magazine.\nWhile the interview has been widley discussed - praised and lambasted in equal measure - the star told recently explained his motivation behind the meeting.\nSpeaking to CBS 60 Minutes he said Guzman was someone through whom 'I could begin a conversation about the policy of the war on drugs. That was my simple idea'.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421168/Hollywood-legends-Jack-Nicholson-Sean-Penn-low-profile-enjoy-boys-night-Beverly-Hills.html"}
