{"authors":["Jay Akbar For Mailonline"],"date_download":"2018-10-23 03:17:39","date_modify":"2018-10-23 03:17:39","date_publish":"2016-01-11 15:59:00","description":"University of Virginia (file photo) student Jackie is said to have made up 'Haven Monahan', who she later claimed instigated a gang rape, to 'earn the affections' of a fellow student","filename":"data/vaneerConsumption/JackieatcentreofRollingStonefalserapeclaimwantedtolureinloveinterest.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300AB36500000578-0-image-a-9_1452525982198.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393999_Female-student-centre-Rolling-Stone-false-gang-rape-claim-created-fake-identity-rapist-lure-love-interest_1540264659.html","title":"Jackie at centre of Rolling Stone false rape claim wanted to lure in love interest","title_page":"Jackie at centre of Rolling Stone false rape claim wanted to lure in love interest | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The University of Virginia student who falsely claimed she was gang raped made up a fictitious person to 'earn the affections' of a fellow pupil, court papers have claimed.\nThe freshman named Jackie claimed that a junior named Haven Monahan, who was later found to be made up, forced her to perform oral sex on five men at a university fraternity house in 2012.\nTwo year later, she became the main subject of a Rolling Stone expose about on-campus rape cases.\nThe magazine later retracted the story after the police determined Monahan was made up and the gang rape never happened.\n'All available evidence demonstrates that 'Haven Monahan' was a fake suitor created by Jackie in a strange bid to earn the affections of a student named Ryan Duffin that Jackie was romantically interested in,' lawyers of the university's associate dean wrote in court papers filed this week.\nUniversity of Virginia (file photo) student named Jackie made up someone called 'Haven Monahan' to earn the affections of her love interest, court papers stated\nThe fake rape case featured in Rolling Stone, who later retracted the story after the police determined Monahan was made up and the gang rape never happened\nIt all began when Duffin sparked up a friendship with Jackie. But when Duffin rejected her advances for a more romantic relationship, she goaded him into texting a boy from her chemistry class named Haven Monahan.\nOn September 28, 2012, Jackie told Duffin that her date with Monahan had gone horribly wrong and he forced her to perform oral sex on five other men.\nDuffin and some friends immediately rushed to see her, and later described her to be in a hysterical state, the Washington Post reported. He said she refused to report the crime to the police.\nTwo years later, Rolling Stone magazine wrote a 9,000 word story about the alleged attack in a campus fraternity house.\nBut an investigation by Charlottesville Police later determined that no one named Haven Monahan had attended the university.\nThe photos Jackie sent to Duffin, claiming they showed Monahan, were actually of a boy she went to high school with in Northern Virginia.\nEventually, the police said no gang rape had occurred that night and Rolling Stone retracted its story.\n'All available evidence demonstrates that 'Haven Monahan' was a fake suitor created by Jackie in a strange bid to earn the affections of a student named Ryan Duffin (pictured) that Jackie was romantically interested in,' lawyers of the university's associate dean wrote in court papers filed this week\nJackie told fellow student Ryan Duffin that Monahan forced her to perform oral sex at a University of Virginia (file photo) fraternity house\nWith hindsight, Duffin wondered how he did not see through Jackie's lies. He told the Washington Post he found Monahan's infatuation with Jackie odd.\nHe told of how he received a text from Monahan saying: 'Get this she said she likes some other 1st year guy who dosnt like her and turned her down but she wont date me cause she likes him [sic].'\nThe texts sent by Monahan alluded to Jackie's romantic feelings for Duffin, the lawyers of associate dean Nicole Eramo wrote in court documents.\nDuffin said Monahan once texted him to tell him Jackie was dying from a terminal illness, which she confirmed to him.\nDuffin became suspicious of Monahan after Jackie told him she had seen him in person and forgave him for the alleged attack.\nThe account of the gang rape in Rolling Stone are said to have differed greatly from the facts given to Duffin in 2012.\nCatfishing - a term made famous by a TV documentary series of the same name - is the act of creating a false social media profile or pretending to be someone else via a messaging service\nShe told the magazine the attack involved nine men - not five - and she identified Haven Monahan by a different first name.\nThe next time they spoke was after the Rolling Stone story was published and he confronted her over discrepancies in her account.","url":"https://www.dailymail.co.uk/news/article-3393999/Female-student-centre-Rolling-Stone-false-gang-rape-claim-created-fake-identity-rapist-lure-love-interest.html"}
