{"authors":["Kara Mcgrath"],"date_download":"2018-10-31 01:42:20","date_modify":"2018-10-31 01:42:20","date_publish":"2018-09-14 17:32:29","description":"CRASH. Something very large and made of metal has just fallen to the floor behind the press lounge where Jackie Aina and I are sitting on tall, white stools. After about 10 seconds of being frozen, Aina starts laughing. \"Well,\" she says, \"it went…","filename":"data/vaneerConsumption/JackieAinaExplainedHowSheCanTellIfABeautyBrandIsGenuinelyInclusive.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/c6696e25-6b36-4365-b4bb-59766cec35aa-olay-nyfw_jackie-aina_runway-3.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_jackie-aina-explained-how-she-can-tell-if-a-beauty-brand-is-genuinely-inclusive-11914077_1540950140.html","title":"Jackie Aina Explained How She Can Tell If A Beauty Brand Is Genuinely Inclusive","title_page":"Jackie Aina Explained How She Can Tell If A Beauty Brand Is Genuinely Inclusive","title_rss":"NULL","source_domain":"bustle.com","text":"CRASH. Something very large and made of metal has just fallen to the floor behind the press lounge where Jackie Aina and I are sitting on tall, white stools. After about 10 seconds of being frozen, Aina starts laughing. \"Well,\" she says, \"it went like that.\" She's talking about her experience testing out Olay products for 28 days to prepare for the makeup-free runway show the brand put on right after New York Fashion Week, which I'd asked about right before the mysterious racket interrupted us. Aina was one of 19 influencers who participated in the event that was designed to celebrate Olay's new #FaceAnything campaign.\nIn addition to finding a new fave in the brand's Daily Facial wipes, Aina says that the part of the challenge that stood out for her was the end result of the fashion show itself. \"I love the idea of doing [the show] without makeup,\" she explains. \"I love that it's different.\" And different it was: The models were all wearing the white robe-meets-cape Aina's pictured in above (a disembodied loudspeaker voice dramatically announced that they would be walking the runway \"without makeup... OR DRESSES\" ahead of the program) and represented a far larger variety of body types, skin tones, and hair textures than is typical for a New York Fashion Week event.\nJP Yim/Getty Images for Olay\nParticipating in this type of spectacle makes sense for Aina, who has built up her YouTube following of over 2.6 million subscribers by advocating for inclusion in the beauty industry and presenting incredibly honest (and hilarious) reviews of new makeup collections — especially ones that don't deliver a shade range that does right by people of color. Along with the Fenty Effect, Aina has undoubtedly made brands think twice about releasing foundations with mostly shades of beige.\nWhen I mention my concerns that some brands are performing inclusivity just to get the good press coverage without really taking the time to speak to the people they're ostensibly trying to serve, Aina agrees that she sees that sometimes too. \"Whether it's authentic [inclusivity] or not, you'll never really know,\" Aina explains. However, \"I always say it's never a bad thing to want to expand or create for more people,\" she continues.\nFor anyone hoping to spend their money on brands that are being as genuine as possible in their motives, Aina recommends looking at the people behind the scenes of the company. Some questions she asks herself when trying to determine that on her own: Who are the brands allowing opportunities to sit at the table? Who is making decisions about how the product is marketed? Does the company hire people of color? Do they market to people of color in the brand message and ad campaigns? \"Those are just the things that, to me, also reflect how they want to diversify their company as a whole, and not just what benefits them monetarily,\" Aina says.\nJackie Aina on YouTube\nAina also notes that some brands who have a smaller shade range are clearly still interested in diversity, and you can tell by looking at who they take on their brand trips or ask to be brand ambassadors. \"I've seen brands that completely, completely have whitewashed their brands holistically. You don't even see them associated with people of color, as far as influencers and who they work with,\" she says. If a company is in conversation with people of color, it's usually a good sign that their motives are genuine, according to Aina.\nBrands are starting to listen to this message, and some are even bringing Aina on as an expert to help them do better. Earlier this year, Too Faced launched an extended shade range for their Born This Way foundation that had been vetted by the YouTuber. While foundation gets the biggest buzz in the inclusivity convo, Aina says there are plenty of other products that people forget need to be adaptable to darker skin as well. SPF that blends in without leaving a white cast on any skin tone is notoriously hard to find (though there are more options now) but Aina also calls out eye shadow and lip color as two categories people are often surprised to hear aren't universal for all skin tones.\nWhich brings us, perhaps, to the cosmetics line Aina has been rumored to be working on ever since she teased the possibility in her Too Faced announcement video she released on June 22,2018. Aina previously told Bustle, \"I definitely have grown to realize that now I get where the gaps are in the industry, and how I feel like I can add to that. It’s definitely something that I want to do, and that I’m actively making some way for.\" At the Olay event, Aina appears to confirm that the line is indeed in the works, getting giddy when I ask her about the rumors.\n\"I can't tease too much yet, but there's definitely cool stuff going on and to offer you coming up,\" she says as she wrings her hands excitedly. I prod a bit more, asking if it's something we'll see in the next year. \"Oh yes, definitely by 2019,\" Aina confirms. \"Sooner than you think.\"\nWhatever Aina has up her sleeve, we can be pretty certain it'll be one of the most inclusive lines we've seen yet.","url":"https://www.bustle.com/p/jackie-aina-explained-how-she-can-tell-if-a-beauty-brand-is-genuinely-inclusive-11914077"}
