{"authors":["Joseph D. Lyons"],"date_download":"2018-10-31 01:51:27","date_modify":"2018-10-31 01:51:27","date_publish":"2018-08-27 16:43:24","description":"Another American community has been struck by gun violence, and this time it's a virtual one. Taylor Robertson and Eli Clayton, the victims of the Jacksonville shooting, according to CNN, have both been honored on social media by the gaming…","filename":"data/vaneerConsumption/JacksonvilleShootingVictimsAreBeingHonoredByTheGamingCommunityInAMovingWay.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/f144d3c2-8c35-4d94-bd9f-d1151ea52ba3-getty-1024402024.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_jacksonville-shooting-victims-are-being-honored-by-the-gaming-community-in-a-moving-way-10245205_1540950687.html","title":"Jacksonville Shooting Victims Are Being Honored By The Gaming Community In A Moving Way","title_page":"Jacksonville Shooting Victims Are Being Honored By The Gaming Community In A Moving Way","title_rss":"NULL","source_domain":"bustle.com","text":"Another American community has been struck by gun violence, and this time it's a virtual one. Taylor Robertson and Eli Clayton, the victims of the Jacksonville shooting, according to CNN, have both been honored on social media by the gaming community. They were recognized for their success in the competitive world of Madden football with hashtag #championsforever.\nRobertson was better known to online competitors as \"spotmeplzzz\" and Clayton as \"trueboy\" — their usernames in the game, according to Florida Today. According to EA Sports online profiles, each had reached levels of success in competitive play, and CNN reported that they had won sums in the tens of thousands of dollars. They died playing the game they were both so good at.\nThe shooting took place during a qualifying competition for Madden NFL 19 Classic. Winners of the Jacksonville event would go on to another tournament in Las Vegas with national attention and significant prize money.\nRobertson was 27 from West Virginia and was a husband and father. He had won the national Madden tournament two years ago. Clayton, 22 of California, was a former high school football player who then started playing the virtual version of the game. Police have not yet reported the identities of those killed, but their names were widely shared online by those paying tribute to them.\nClayton was honored online by his high school in California. \"Our hearts are broken as we learned that former Calabasas Football player @True__818 (Elijah Clayton) was senselessly murdered today during the mass shooting in Florida,\" the school's Twitter posted. \"We send our love, condolences, and deepest sense of sorrow to Elijah's Family and Friends.\"\nRobertson, in turn, was honored online by his gaming team, Dot City Gaming. \"We are shocked and deeply saddened by the senseless violence in Jacksonville and the tragic deaths of Dot City Gaming team member, Taylor 'SpotMePlzzz' Robertson, and Eli 'True' Clayton,\" Dot City Gaming's account posted.\nIn a follow-up tweet, the team wrote, \"They were great competitors and well-loved members of the Madden community. Our thoughts and deepest sympathies go out to their families, loved ones, and all of those affected by this tragedy.\"\nFriends and fellow gamers also took to Twitter, offering up their thoughts about the players. \"This is honestly heartbreaking, I would watch these guys stream all the time. RIP @spotmeplzzz @True__818,\" wrote user @nlewis48 with the #championsforever hashtag.\n\"kno i don't kno any of those guys personally at all but ive been watching them for couple years now and it really hurts my heart for them and their families. for everyone involved. RIP Spot and True,\" wrote user @smoothforreal with the hashtag and prayer emojis.\nEA Sports' online profile for each player included details about the players' success in the game. Robertson \"has the skill to completely take over any Madden tournament,\" his profile read. Clayton, meanwhile, \"remains one of the best around and can potentially win it all when it’s done.\"\nElectronic Arts, the maker of Madden, provided Bustle with a statement:\nThe tragic situation that occurred Sunday in Jacksonville was a senseless act of violence that we strongly condemn. Our most heartfelt sympathies go out to the families of the victims whose lives were taken today and those who were injured. All of us at Electronic Arts are devastated by this horrific event, and we also join the community in thanking the first responders who were quickly on the scene. Our focus right now is on those affected, and supporting law enforcement as they continue their investigation into this crime.\nIn addition to Robertson and Clayton, nine others were injured by gunshot wounds. Two more were hurt fleeing the scene. The gunman, who killed himself after the shooting, was also a gamer.\nThe significance of the loss of the gaming community was made clear online, and it demonstrated how a mass shooting has reached one more place of everyday life.","url":"https://www.bustle.com/p/jacksonville-shooting-victims-are-being-honored-by-the-gaming-community-in-a-moving-way-10245205"}
