{"authors":["Katie Storey For Mailonline"],"date_download":"2018-10-23 01:37:46","date_modify":"2018-10-23 01:37:46","date_publish":"2017-03-16 11:45:52","description":"The X Factor star, 26, left fans worried yet again after posting another troubling tweet on Thursday. He told his 586k followers that he was having a 'dark day' and asked his fans to 'pray' for him.","filename":"data/vaneerConsumption/JahmeneDouglasleavesfansconcernedwithtroublingtweet.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/11/21/3E2CBC2200000578-0-image-a-113_1489269005215.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319842_Jahmene-Douglas-leaves-fans-concerned-troubling-tweet_1540258666.html","title":"Jahmene Douglas leaves fans concerned with troubling tweet","title_page":"Jahmene Douglas leaves fans concerned with troubling tweet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He has caused concern after admitting his struggles with suicidal thoughts.\nAnd Jahmene Douglas left fans worried yet again after posting another troubling tweet on Thursday.\nThe X Factor star, 26, told his 586k followers that he was having a 'dark day' and added the words: 'Pray for me'.\nScroll down for video\n'Pray for me': Jahmene Douglas left fans concerned after revealing he was having a 'dark day' on Twitter on Thursday\nHe also wrote two days before: 'It was strange being on stage last night. Haven't been on stage in a while. I hope to be on more stages this year; I need to be better!'\nMailOnline have contacted a representative for Jahmene.\nHis posts gave his social media followers cause for concern, with many making sure to send Nicole Scherzinger's former mentee their well wishes and support.\nOne fan commented: 'Sending you healing thoughts and a hand to hold. Believe me you're not on your own today.'\nA second said: 'Hope it gets better today, there is always tomorrow x.'\nA third added: 'Always sending the love.'\nFans were quick to send their support: The X Factor star has received plenty of well wishes from his followers on Twitter, with many urging him to 'stay strong'\nWhile a fourth tagged Jahmene's friend and fellow X Factor star James Arthur - who has reached out to him before - and urged the star to get in touch.\nThey tweeted: 'Stay strong Jahmene,you are a fighter & you are worth winning this battle. Please call a friend,don't stay alone! @JamesArthur23.'\nJahmene had come runner up to James during the 2012 series of The X Factor.\nWhen he first revealed his battle with depression in a moving post titled 'This is me...' earlier this month, James replied by encouraging Jahmene to pick up the phone.\nShow of support: Fellow X Factor contestant James Arthur, 29, had replied to an earlier message by encouraging Jahmene to pick up the phone, saying 'Brother I'm here for you'\nFellow finalists: Jahmene was runner-up to James Arthur in the 2012 series of ITV's X Factor\nHe said: 'Brother, I'm here for you.'\nThe Say You Won't Let Go singer isn't the only celebrity to offer their support.\nJahmene previously received dozens of messages, including support from Aled Jones, Holly Hagan, Victoria Derbyshire and official mental health charity MIND.\nHis latest post, meanwhile, is just one of many that have been seen on his official account in recent weeks.\nStruggle: The former X Factor star, 26, posted a long message entitled Suicidal Possession, which appeared to be lyrics to a song or a poem\nOn March 10, he shared another post, which he said he hoped would help others 'distinguish the devils thoughts from your own'.\nThe singer posted a long message entitled Suicidal Possession, which appeared to be lyrics to a song or a poem.\nHe wrote in his tweet: 'For any of you struggling with suicide out there. Here's my perspective; I hope this helps distinguish the devils thoughts from your own.'\nIn the song, Jahmene speaks honestly about his struggle with depression.\nHe writes: 'You'll think you're doing well until that moment of doubt, that's when I'll step in.'\nHonest: Jahmene, pictured performing on The X Factor in 2012, speaks openly about his struggle with depression in the song\nJahmene also refers to his difficult childhood, and the years of violence his family faced at the hands of his father.\nFans immediately expressed their support for the former X Factor finalist on Twitter.\nOne fan @EllaJahmeneJLS_ wrote: 'Big hugs Jahmene, we're all here for you. You mean so much to me, all this just breaks my heart.'\nAnother added: 'That's beautifully written Jahmene. I hope with God you can slowly change your thoughts & make the positive ones stronger each day.'\nAnd Sarah-Jane Everard wrote: 'I hope you got the support from friends and family and we are all here if you ever need to offload'.\nSupportive: Fans immediately expressed their love and support for the former X Factor finalist on Twitter, after he posted the message\n'A blessing': One fan simply wrote 'I'm glad you're speaking out about how you feel'\nJahmene revealed in a post on Twitter that he feels 'broken, lost and worthless' and that his 'mind is plagued with suicidal thoughts whenever my defences are down'.\nHe ended the message by writing: 'All I am ever left with is the desire to die. I don’t want it, but I do. That’s the inner battle.\n'I’m scared the next time I try I will succeed because I have nothing in place any more.'\nRushing to his side: Messages from the famous and non-famous echo the same sentiment - that they are there for him, love him and urge him to get help\nJahmene had admitted to 'struggling daily' with suicidal thoughts on ITV's Lorraine in September over the impact of his father's 18 years of abuse.\nHe was candid about his feelings and encouraged other celebrities to come forward to discuss mental health issues.\nThe singer said: 'Suicide is a thing that you struggle with daily and I'm trying to be honest with that journey.\n'My foundations are built on abuse and I have to pick that apart and hopefully that comes across in the music that the strength is there and the love is there.\nBrave: Jahmene had shared his struggle with suicidal thoughts on Twitter last week\nMoving message: Jahmene, 25, wrote in a post on Twitter that he feels 'broken, lost and worthless' and that his 'mind is plagued with suicidal thoughts whenever my defences are down'\n'Brother I'm here for you': Fellow contestant James, 29, replied by encouraging Jahmene to pick up the phone\nJahmene continued: 'You can't let a bad situation define who you are, it shaped me into who I am now so I wouldn't take anything back.'\nThe Swindon born star's brother Daniel tragically committed suicide eight years ago, yet Jahmene remained optimistic about his journey, stating, 'I know everything was horrific but God has a purpose and I can uplift other people going through the same thing with my music.\n'I think it's really dishonest if you're in the public eye to say that everything is okay and everything is perfect.'\nSpeaking out: The singer has been candid about depression in the past, encouraging other celebrities to come forward to discuss mental health issues\nThinking positive: Jahmene was positive about his journey ahead, saying 'You can't let a bad situation define who you are'\nJahmene's mother Mandy Thomas has also made no secret of the fact she suffered years of torture at the hands of her convicted ex-partner Eustace.\nThe mother-of-five has stressed the importance that people 'understand the painful reality' of domestic abuse in a brutally honest blog post, posted on Mumsnet, referring to the recent storyline in The Archers involving the character Helen.\nShe wrote: 'I suffered every kind of abuse imaginable at the hands of my ex, including horrific physical attacks. My eldest son saw his father take a blow torch to me.\n'People need to understand the painful reality of domestic abuse': Jahmene's mother Mandy Thomas has written about her 18-year ordeal which has inspired a recent The Archers storyline\n'Many have their souls and minds broken – as has happened to Helen – even when the physical wounds have healed. Domestic abuse isn't just physical violence; it is mental abuse. It is coercive control that creates an invisible prison for the abused.\n'It is vital that domestic abuse is portrayed clearly, in all its ugliness!'\nCandid: In a Mumsnet blog post, the mother-of-five wrote: 'It is vital that domestic abuse is portrayed clearly, in all its ugliness – and The Archers has not shied away from that'\nShe added: 'It does not matter if people are uncomfortable when they listen to it; they need to understand the painful reality of domestic abuse, and how coercive control can envelop a victim, crushing her spirit'\nMandy's post follows on from her emotional appearance with her singer son Jahmene on Loose Women in March for a Mother's Day special.\nThe singer bravely spoke out on his childhood and his and his family's years of violence at the hands of his father, confessing that he might have killed himself - if his brother hadn't taken his own life first.\nThe former reality star also previously revealed his sibling's devastating death after his father was released from prison in 2008 aged 23 was the only thing preventing him from taking his own life.\nSpeaking out: X Factor star Jahmene made an emotional appearance on Loose Women in March with his mum Mandy as they talked about their experience of domestic abuse at the hands of his father\nFamily tragedy: Jahmene's older brother Daniel took his own life aged just 23 in 2008, and the singer says he was forced to stay strong for his family\nHe admitted: 'I think personally the difference is that he was first. He was first to take his life because I saw the effect on my family.\n'I think the demon that my family has struggled with is suicide. I think one of the hardest things afterwards, being abused and put into a box, is self worth and just trying to find a purpose for your living.'\nJahmene's revelation was all the more moving since he was saved by Daniel when he attempted suicide himself aged 15 by taking an overdose.\nTerrible loss: Jahmene's revelation was all the more moving since he was saved by Daniel when he attempted suicide himself aged 15 by taking an overdose\nShock confession: The former X Factor runner-up admitted he would have killed himself - if his older brother Daniel hadn't taken his own life first, aged just 23\nThe 25-year-old candidly admitted that he was 'lucky to have been brainwashed by the right person' as he and Mandy explained their close bond and how the family are using their experience to help others.\nJahmene explained how his father Eustace, who was eventually jailed, subjected the family to years of violence, including torturing Mandy with a blowtorch and cutting him with a knife as punishment for biting his nails.\nMandy told the Loose Women panel: 'It was basically 18 years of torture that got worse over time, and having children as well, going through the process of bringing them up and trying to give them a normal childhood was rather difficult.'\nMaking a difference: Mandy explained their close bond and how the family are using their experience to help others\nShe went on to explain how Jahmene, his older brother Daniel and their three younger siblings were affected by witnessing the abuse.\n'Mentally it transferred and it can’t not because they see, they hear things...Some that go through the domestic violence they don’t know what’s right and wrong but I was always explaining to them after he left what was right and wrong.'\nJahmene agreed that his mother set the best example she could, telling the hosts 'I think for me at home there was a clear divide between light and dark.'\nClose bond: The 2012 X Factor runner-up appeared on the ITV show alongside Mandy for a special Mother's Day edition\n'I if didn’t have my mum I could have fallen into addiction, been a rebel. But my mum never cussed my father, she was an example of what love should be. I was lucky to have been brainwashed by the right person.'\nMandy also explained that she did her best to take her children away from the violence, saying: 'I tried running away a few times. But he was a computer hacker, he would track us down. He did everything he could to track us down. People think we just stayed.'\nThe violence culminated in Eustace torturing Mandy for four days at the family home with knives and a blowtorch, after he found out she had got a job.\nHer experience: Mandy told the Loose Women, 'i was basically 18 years of torture that got worse over time'\n'My children thought I was dead,' Mandy explained. 'My daughter had gone to school and said to the teacher \"I think my dad killed my mum\". They phoned the police, they came and got a ladder and rescued me.'\nEustace was eventually imprisoned for nine years for the attack, with another six-year term to serve concurrently for rape.\nHe was later released after serving just five years of his sentence, with Mandy explaining how even when he was in prison he was threatening her and her children in letters.\nHis inspiration: Jahmene was keen to point out how his childhood has meant he has a very close relationship with his mother\nJahmene was full of praise for his mother during their appearance on Loose Women, explaining she's his biggest inspiration: 'So many times I’ve just seen my mum physically – I can’t believe she’s still here – she’s like a cat with nine lives,' he admitted.\nMandy was keen to urge others suffering abuse to seek help, telling viewers: 'Make the call and leave – you can ring Women’s Aid, and there's lots of local services up and down the country. And I do do a lot of work online with a lot of people to help them through the process.'\n'Leaving is a dangerous time, it’s the most dangerous time when they leave. You have to have a plan, a back-up of services.'\nThe National Domestic Violence helpline can be contacted 24 hours a day on 0808 2000 247.\nFor confidential support call the Samaritans on 116123 or visit a local Samaritans branch, see www.samaritans.org for details.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319842/Jahmene-Douglas-leaves-fans-concerned-troubling-tweet.html"}
