{"authors":[],"date_download":"2018-10-22 21:32:11","date_modify":"2018-10-22 21:32:11","date_publish":"2016-01-29 07:00:25","description":"California police arrested a prison English teacher accused of being a key accomplice in the escape of three men who used bed sheets to rappel from the jail ...","filename":"data/vaneerConsumption/JailteacherarrestedoverCaliforniatrioescape.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h6vt-3bmscybNe842cce83474b51aaea0-101_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422271_Jail-teacher-arrested-California-trio-escape_1540243931.html","title":"Jail teacher arrested over California trio escape","title_page":"Jail teacher arrested over California trio escape | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jail teacher arrested over California trio escape\nCalifornia police arrested a prison English teacher accused of being a key accomplice in the escape of three men who used bed sheets to rappel from the jail roof and are considered highly dangerous.\nThe woman, Nooshafarian Ravaghi, 44, had given classes at the Santa Ana jail to Hossein Nayeri, 37, one of the trio who escaped on Friday and the supposed mastermind, sparking a manhunt that has so far failed to unearth the men.\nAbout 10 people have now been arrested in connection with the spectacular jail bust, authorities say.\nImage obtained courtesy of the Orange County Sheriff's Department, shows a wanted poster for jail escapees Jonathan Tieu, Bac Duong and Hossein Nayeri ©HO (AFP)\nLieutenant Jeff Hallock, of the Orange County Sheriff's Department, a suburb of Los Angeles, tweeted of Ravaghi: \"Believed to have been key accomplice.\"\nRavaghi has been speaking with police and denied providing the escapees with anything beyond maps.\nInvestigators believe the men must have had \"outside help\" in obtaining cutting tools for the jailbreak.\nThe sheriff of Orange County, Sandra Hutchens, said that Nayeri -- charged with kidnapping and torture after setting his victim on fire, then pouring bleach on him and chopping off his penis -- was the brains behind the escape and had fled jail before.\nAuthorities are focusing their search on the Vietnamese community because one of the trio, Jonathan Tieu, 20, who was behind bars on a murder charge, is a Vietnamese gang member.\nBac Duong, 43, who is charged with attempted murder, was the third escapee.\nThe men are believed to be living out of a utility van they stole after their breakout.","url":"https://www.dailymail.co.uk/wires/afp/article-3422271/Jail-teacher-arrested-California-trio-escape.html"}
