{"authors":["Press Association"],"date_download":"2018-10-23 01:57:38","date_modify":"2018-10-23 01:57:38","date_publish":"2016-01-11 13:34:19","description":"An MP said it was a \"miscarriage of justice\" that six British ex-soldiers working on an anti-piracy mission have been jailed in India on weapons charges. Ian...","filename":"data/vaneerConsumption/Jailingofsixbritishexsoldiersinindiaamiscarriageofjustice.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-d7969b64-042a-41a3-9860-f3eb8629ed7d-48qEJGFphM8d437f0aaf9255442b-556_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393841_Jailing-six-British-ex-soldiers-India-miscarriage-justice_1540259858.html","title":"Jailing of six british ex-soldiers in india 'a miscarriage of justice'","title_page":"Jailing of six british ex-soldiers in india 'a miscarriage of justice' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jailing of six British ex-soldiers in India 'a miscarriage of justice'\nAn MP said it was a \"miscarriage of justice\" that six British ex-soldiers working on an anti-piracy mission have been jailed in India on weapons charges.\nIan Lavery, Labour MP for Wansbeck, said he will continue to campaign for constituent Nick Dunn and the other five men who have gone through what he called \"years of hell\".\nThey were security guards on a US-owned ship when they were arrested in October 2013 on illegal weapons charges.\nYvonne McHugh, centre, the girlfriend of Billy Irving, and other family members of the six ex-servicemen handed in a petition to Downing Street\nThere were hopes that the latest legal hearings in India would see them free to return to the UK.\nBut instead they have been jailed for five years.\nMr Lavery said: \"This verdict will have come as a hammer blow to Nick Dunn and the other men detained in India coming only a matter of months after a court had quashed all of the charges.\n\"The men and their families will be distraught at this news with all noises coming out of the courts in the last few days and weeks pointing towards them returning home in the near future after years of hell.\n\"Sadly this bizarre judgment, charging the former British servicemen with the maximum penalty for handling arms, means the nightmare continues.\n\"My thoughts this morning are with the men, their families and friends whose worst fears will this morning have been realised by the judgment.\n\"I will continue to work with Nick's family to fight for his release and return to the UK and am seeking urgent discussions on the way forward and seeking an early resolution to this miscarriage of justice.\"\nAs well as Mr Dunn, from Ashington, Northumberland, the detained men are Ray Tindall from Chester; Paul Towers, from Yorkshire; John Armstrong, from Wigton, Cumbria; Billy Irving, from Connel, Argyll, and Nicholas Simpson, from Catterick, North Yorkshire.\nThey were working for US maritime company AdvanFort providing anti-piracy protection when their ship - MV Seaman Guard Ohio, which had a crew of 35 - was detained and weapons were found.\nIn the following months the charges were dropped, but the Indian authorities appealed against the decision and the men were detained in India.\nThe authorities have now won their case.\nA Foreign Office spokesman said: \"Our staff in India and the UK have been in close contact with all six men since their arrest to provide support to them and their families, including attending court.\nMinisters have also raised this case at the highest levels, pressing for delays to be resolved.\n\"We recognise what a difficult time this is for those involved. There is now a 90-day window to appeal and we will continue to provide consular assistance.\n\"However, we cannot interfere in another country's judicial process.\"\nMr Irving's partner Yvonne MacHugh, from Glasgow, previously started a petition on Change.org - which attracted the support of tens of thousands of people - saying the men had been ''wrongly arrested and imprisoned by Indian authorities while working to protect ships from pirate attacks''.\nShe has visited her partner in India and the couple now have a 10-month-old son together, whom he has met but not yet had the chance to get to know properly.\nMs MacHugh said her partner used to serve in the Parachute Regiment and had been working hard to make money for his family after leaving the Army.\nSpeaking on Monday, she said: \"After two long years of fighting to get my partner Billy home I'm devastated with today's verdict. For the next five years our son won't have a father at home.\n\"Billy has passed on to me all of the evidence that we couldn't mention while the trial was going on. I intend to release this to the media so that the public can see that the boys did nothing wrong, that everything was legal and that this has been a miscarriage of justice.\n\"Nearly 300,000 people have signed my petition calling for the UK Government to help bring the boys home. I want to know what David Cameron is going to do - will he get these boys home or let these six ex-British soldiers, who gave so much to our country, spend five years in an Indian prison for something they didn't do?\"\nMr Dunn's sister Lisa told ITV News Tyne Tees the verdict bewildered the family and left her heartbroken.\nHer brother rang her in England to tell her the verdict from India.\nThe campaigner told the programme: \"Although it was a reality we were facing, it's certainly not the judgment that we were expecting and obviously hoping for.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3393841/Jailing-six-British-ex-soldiers-India-miscarriage-justice.html"}
