{"authors":["Brittany Valadez For Dailymail.Com"],"date_download":"2018-10-22 20:09:27","date_modify":"2018-10-22 20:09:27","date_publish":"2016-01-29 00:33:17","description":"Jaime King, 36, took an unusual turn as she covered up in a massive coat as she modeled on the streets of New York City.","filename":"data/vaneerConsumption/JaimeKingcoversupinlongthickcoatforaphotoshootinNewYorkCity.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/23/30ADF10700000578-0-image-a-29_1454023376941.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421830_Jaime-King-covers-long-coat-photo-shoot-streets-New-York-City_1540238967.html","title":"Jaime King covers up in long thick coat for a photo shoot in New York City","title_page":"Jaime King covers up in long thick coat for a photo shoot in New York City | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's known for her body confidence in photo shoots.\nBut on Thursday Jaime King, 36, took an unusual turn as she covered up in a massive coat as she modeled on the streets of New York City.\nThe beautiful blonde braved the cold as she attempted to nab the perfect pose.\nStrike a pose: On Thursday, actress Jaime King, 36, was a sight for sore eyes as she modeled on the streets of New York\nThe mother to sons James, two, and Leo, six months, was a classic beauty in navy.\nShe appeared to honour the '80s with a boxy, paneled overcoat layered on top of a black turtleneck.\nJaime added a pair of leather pants and rain boots before accessorizing with white, mirrored shades, earrings and a statement necklace.\nAmerican beauty: The mother to sons James, two, and Leo, six months, was a classic beauty in navy\nVintage style: She appeared to honour the '80s with a boxy overcoat layered on top of a black turtleneck\nFashionista: The actress added a pair of leather pants and rain boots before accessorizing with white, mirrored shades, earrings and a statement necklace\nFor her make-up, the former Hart of Dixie star chose a bold, red lip, in contrast to her dark ensemble.\nJaime's blonde hair was styled in an off-center part, waves cascading down her back.\nIn her series of shots, 5ft 9in model appeared to pose head on while making the perfect, pouty face.\nLong locks: Jaime's blonde hair was styled in an off-center part, waves cascading down her back\nAside from her career as on-screen talent and a mother, Jaime is making waves in the beauty and fashion world.\nThe stunning blonde partnered with ColourPop cosmetics of an upcoming make-up line, set to launch on the company's site later this spring.\nAdditionally, she has joined Kristin Nystrom of clothing company Gardner and the Gang for a children's launching in May 2016,\nBusy bee! Aside from her career as on-screen talent and a mother, Jaime is making waves in the beauty and fashion world\nNew venture: The stunning blonde partnered with ColourPop cosmetics of an upcoming make-up line, set to launch on the company's site later this spring","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421830/Jaime-King-covers-long-coat-photo-shoot-streets-New-York-City.html"}
