{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 00:17:30","date_modify":"2018-10-23 00:17:30","date_publish":"2017-03-10 06:32:18","description":"The blonde beauty's dress featured subtle stripes and colorful patterns decorated throughout the dress, including two long orange bows pinned to each shoulder.","filename":"data/vaneerConsumption/JaimeKingTiffaniAmberThiessenattendBaby2Babyevent.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/03/3E1F89A400000578-0-image-a-103_1489114922154.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299758_Jaime-King-Tiffani-Amber-Thiessen-attend-Baby2Baby-event_1540253850.html","title":"Jaime King, Tiffani-Amber Thiessen attend Baby2Baby event","title_page":"Jaime King, Tiffani-Amber Thiessen attend Baby2Baby event | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jaime King was the epitome of springtime glam on Thursday as she stepped out in a floral-printed maxi dress.\nThe 37-year-old mother-of-two attended the Little Marc Jacobs celebration of the nonprofit charity, Baby2Baby, in Los Angeles.\nThe star was accompanied by fellow mothers including 42-year-old actress Tiffani-Amber Thiessen and her family.\nScroll down for video\nSpringtime glam! Jaime King wowed in a floral-printed maxi dress for the Little Marc Jacobs event celebrating nonprofit Baby2Baby on Thursday in Los Angeles\nThe blonde beauty's dress featured subtle stripes and colorful patterns decorated throughout the dress, including two long orange bows pinned to each shoulder.\nShe paired her look with silver flats and tied her locks back in a sophisticated low bun.\nBy her side was former Saved By The Bell star who looked casual chic in a black jumpsuit, accentuated with a gold belt, and a denim jacket.\nBeauties: The 37-year-old star was accompanied by Kelly Sawyer-Patricof, Norah Weinstein and Saved By The Bell star Tiffani-Amber Thiessen\nThe brunette beauty was joined by her actor husband Brady Smith and six-year-old daughter Harper and one-year-old son Holt.\nMeanwhile, it looks as though Jaime's acting career is continuing to soar as she has just been cast to take on the lead role in the movie How To Cook Your Daughter.\nThe film, which is based on Jessica Hendra's memoir of the same name, has a 2018 release date.\nHappy family: The 42-year-old actress was joined by her husband Brady Smith, six-year-old daughter Harper and one-year-old son Holt\nChic: The brunette beauty looked good in a black jumpsuit, accentuated with a gold belt and a denim jacket\nJessica's book tells her story growing up as the daughter of National Lampoon editor Tony Hendra who she alleges sexually abused her from the age of six and also subjected her to emotional abuse.\nHer book was written in response to Tony's own tome Father Joe: The Man Who Saved My Soul, which was about his life-long friendship with a Benedictine monk who he credits with saving him from drug abuse, illicit sexual escapades and a dysfunctional family life.\nFollowing the publication of Jessica's text, Tony vehemently denied her accusations and he has never faced formal charges over her claims.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299758/Jaime-King-Tiffani-Amber-Thiessen-attend-Baby2Baby-event.html"}
