{"authors":["John Carney For Daily Mail Australia"],"date_download":"2018-10-22 21:53:57","date_modify":"2018-10-22 21:53:57","date_publish":"2016-01-11 01:55:21","description":"Jake Devenney-Gill (pictured), who has a very distinctive mullet hairstyle, escaped from Yatala prison and is on the loose in Adelaide's north-east. No details of his criminal history were released.","filename":"data/vaneerConsumption/JakeDevenneyGillescapedYatalaprisoninAdelaidesnortheast.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/02/300225FB00000578-0-image-a-2_1452478610191.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393200_Man-unique-mullet-hairstyle-loose-escaping-prison-despite-close-finishing-sentence_1540245237.html","title":"Jake Devenney-Gill escaped Yatala prison in Adelaide's north-east","title_page":"Jake Devenney-Gill escaped Yatala prison in Adelaide's north-east | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A prisoner with a very distinctive mullet hairstyle has escaped from prison and is on the loose in Adelaide's north-east.\nPolice are currently searching the Northfield and Valley View areas for Jake Devenney-Gill, who escaped from Yatala prison.\nThe prison break was unusual as the 26-year-old was reportedly close to finishing his sentence. No details of Devenney-Gill’s criminal history have been released, but as he was being held at a low security section of the prison, correctional services did state that his offence was a minor one.\nJake Devenney-Gill, who escaped from Yatala prison, sports a distinctive mullet hairstyle\n'The Adelaide Pre-release Centre (APC) is an important part of the South Australian correctional system,' David Brown, Chief Executive, Department for Correctional Services, told Daily Mail Australia.\n'APC provides low security prisoners with programs to facilitate their gradual release to the community, and prisoners are generally in the last 12-18 months of their sentence.\n'In accordance with normal practice, DCS will conduct an investigation into the matter.'\nThe Adelaide Advertiser reports that the Correctional Services Department on Monday morning clarified that he had escaped from cottages at the lower-security pre-release centre.\n‘Prisoners at the (pre-release) centre are generally in the last 12 to 18 months of their sentence and participate in accompanied and unaccompanied family leave, education, work release and community work programs,’ the department’s website states,' the department's website said.\nPolice or prison authorities would not comment on how the prisoner was able to escape from the jail.\nThe 26-year-old was last seen running north of the lower-security section of the prison\nHe was last seen running north of the low security section of the prison just before 8:00pm on Sunday.\nPolice described the 26-year-old as being 170 centimetres tall, of a slim build with blond hair and a mullet/rat's tail.\nDevenney-Gill was last seen wearing black shorts and a blue singlet.\nHe is not believed to be armed or considered dangerous but police warn not to approach him.","url":"https://www.dailymail.co.uk/news/article-3393200/Man-unique-mullet-hairstyle-loose-escaping-prison-despite-close-finishing-sentence.html"}
