{"authors":["Alex Martin For Mailonline"],"date_download":"2018-10-23 03:22:17","date_modify":"2018-10-23 03:22:17","date_publish":"2017-03-16 14:18:27","description":"Exeter Chiefs wing James Short has been named the Aviva Premiership Player of the Month for February after his stunning form helped them go the whole month unbeaten.","filename":"data/vaneerConsumption/JamesShortnamedAvivaPremiershipPlayeroftheMonth.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54A72400000578-0-image-a-111_1489673817178.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-4320446_James-Short-named-Aviva-Premiership-Player-Month_1540264937.html","title":"James Short named Aviva Premiership Player of the Month","title_page":"James Short named Aviva Premiership Player of the Month | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Exeter Chiefs wing James Short has been named the Aviva Premiership Rugby Player of the Month for February after his stunning form helped them go the whole month unbeaten.\nShort's best moment of the month came when he scored a hat-trick in Exeter's 48-32 win over Worcester Warriors, in which he also carried 21 times for 152 metres and beat nine Worcester defenders.\nIt was enough for England's World Cup winning Will Greenwood to say: 'James is a player I have long admired. He has great work rate, energy, desire.\nExeter Chiefs wing James Short poses with his Aviva Premiership Player of the Month award\nPREVIOUS WINNERS December – Tom Varndell (Bristol) November – Freddie Burns (Leicester) October – Mako Vunipola (Saracens) September – Jimmy Gopperth (Wasps)\n'James is a team player and has to wait for games sometimes. But when opportunities are offered he gobbles them up as well as the tries!'\nThe 27-year-old has started 25 matches for the Chiefs since joining from London Irish in 2015, touching down 19 times and accumulating 95 points.\nIn total, he has 170 Premiership points to his name.\nThe wing could be given a chance to impress on the big stage next weekend when Exeter take on Leicester Tigers in the Anglo-Welsh Cup final at the Stoop.\nShort was involved in a three-way battle for this month's title, eventually beating two other wings: Sale Sharks Denny Solomona and Vereniki Goneva from Newcastle Falcons.\nShort wins a trophy and a £250 donation to the charity of his choice.\nShort's hat-trick helped the Exeter Chiefs to a big victory over Worcester at Sixways\nShort wins a trophy and a £250 donation to the charity of his choice","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-4320446/James-Short-named-Aviva-Premiership-Player-Month.html"}
