{"authors":["Amanda Williams For Mailonline"],"date_download":"2018-10-23 02:20:40","date_modify":"2018-10-23 02:20:40","date_publish":"2016-01-11 14:23:03","description":"James Huggett, from Minster on the Isle of Sheppey in Kent, was walking his victim home after a night out when he pushed her to the ground and attempted to rape her.","filename":"data/vaneerConsumption/JamesHuggettwhotriedtorapeChanelPurchaseisjailedaftershetrackedhimdown.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300AF83600000578-0-image-a-14_1452522017866.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393985_Sex-attacker-tried-rape-woman-22-walking-home-jailed-seven-years-victim-tracked-Facebook_1540261240.html","title":"James Huggett who tried to rape Chanel Purchase is jailed after she tracked him down","title_page":"James Huggett who tried to rape Chanel Purchase is jailed after she tracked him down | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"James Huggett tried to rape a woman as she walked home. He has been jailed for seven years after he was found on Facebook by his victim\nA sex attacker who tried to rape a woman as she walked home has been jailed for seven years after he was tracked down on Facebook by his victim.\nJames Huggett, from Minster on the Isle of Sheppey in Kent, was walking his victim home after a night out when he pushed her to the ground and pulled down her underwear and leggings and attempted to rape her.\nHe fled when she struggled and screamed. His victim, Chanel Purchase, 21, who has waived her right to anonymity, immediately called the police who came and took DNA swabs following the attack in April 2014.\nBut her attacker was eventually brought to justice after she decided to track down him down on Facebook.\nAlthough she did not know his name, she knew they had mutual friends in common after he dropped a couple of names, and she proceeded to look for him on the social networking site.\nThe 21-year-old from Sheerness, Kent scoured the social media site until she found a picture with him in it which she handed to the police.\nHuggett, from Minster on the Isle of Sheppey in Kent, previously denied the charge of attempted rape, but was convicted at Maidstone Crown Court at an earlier hearing in November.\nToday he was sentenced in the presence of his friends and family as well as Chanel.\nAppearing in the dock at Maidstone Crown Court, Huggett, who was wearing jeans and a blue jacket spoke only to confirm his name.\nTom Stern, defending, wanted to apply for a psychiatric assessment to be made however this was thrown out by the judge, Martin Joy.\nThe court heard how Huggett, who has remained in custody since he was convicted at trial in November, has been suffering from extreme nightmares and is verging on the level of clinical depression.\nMr Stern said: 'He lost his brother in a motorbike accident and that has had a huge impact on him.\n'And it is apparent that since he has been remanded in custody he's felt very low and there has been a decline in his mental state.'\nHis victim, Chanel Purchase, 21, (left) who has waived her right to anonymity, immediately called the police who came and took DNA swabs following the attack in April 2014. Her attacker was eventually brought to justice after she decided to track down him down on Facebook and found this image of him (right)\nJudge Joy had also time to read several character statements which stated Huggett was a 'polite and pleasant and cooperative young man and a reliable, hardworking and honest person.'\nBut he noted that the traumatic accident involving his brother happened six months after the attack took place.\nPassing sentence Judge Joy told Huggett: 'I have come to the conclusion with all the material before me.\n'This was a young lone female walking home at night.\n'You spoke to her and she spoke to you however you would not leave it there and remained with her.\n'It was clear that she did not know how to shake you off or deal with you.\n'You tried to pressure her to come to your house and she refused and she decided to go home and walk home and you made the clear decision to walk with her.\n'It wasn't a short walk and you must have had the intention on that walk.\n'She did not give you an encouragement.\nThe 21-year-old from Sheerness, Kent scoured the social media site until she found a picture with him in it which she handed to the police. Huggett, from Minster on the Isle of Sheppey in Kent, previously denied the charge of attempted rape, but was convicted at Maidstone Crown Court at an earlier hearing in November\n'She got to four doors from her own house, it was a dark street and in one place a street light was not functioning and that is when you decided to attack her.\n'You forced her to the ground so she was on her back and pulled down her lower clothing as well as your own.\n'She was screaming and when her screams were heard you ran off.\n'You got very close to the completion of a rape.\n'What happened to her must have been terrifying and this is a manipulative and predatory offence.\n'I have no doubt whatsoever that you present a significant risk to the public.'\nHuggett was given an extended determinate sentence for ten years.\nHe was sentenced to seven years in jail and will have to serve two thirds of it before he will be eligible for parole.\nAnd he will also an extended licence period of three years.\nWhen judge joy passed his sentence Huggett's mother screamed 'I love you James' before he left the dock.\nMore than a dozen of Huggett's friends and family attended and started screaming at Miss Purchase in the court room who broke down in tears. She had to be ushered from the court room.","url":"https://www.dailymail.co.uk/news/article-3393985/Sex-attacker-tried-rape-woman-22-walking-home-jailed-seven-years-victim-tracked-Facebook.html"}
