{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-22 23:35:01","date_modify":"2018-10-22 23:35:01","date_publish":"2016-01-29 11:37:46","description":"James Corden, 37, and his wife Julia Carey enjoyed a romantic dinner date at Craig's restaurant on Melrose Avenue, West Hollywood.","filename":"data/vaneerConsumption/JamesCordencutsadapperfigureinavelvetnavyblazerashestepsoutforaromanticdinnerwithwifeJuliaCarey.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1B5D300000578-0-image-a-57_1454066163563.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422564_James-Corden-cuts-dapper-figure-velvet-navy-blazer-steps-romantic-dinner-wife-Julia-Carey_1540251301.html","title":"James Corden cuts a dapper figure in a velvet navy blazer as he steps out for a romantic dinner with wife Julia Carey","title_page":"James Corden cuts a dapper figure in a velvet navy blazer as he steps out for a romantic dinner with wife Julia Carey  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They were seen partying together at a star-studded bash for music manager Jeff Azoff's birthday on Saturday.\nBut it was a more reserved affair on Thursday as James Corden, 37, and his wife Julia Carey enjoyed a romantic dinner date at Craig's restaurant on Melrose Avenue, West Hollywood.\nThe Late Late Show host put on a dapper display in a velvet navy blazer worn over a plain navy top and teamed them with a pair of jeans and comfortable kicks.\nScroll down for video\nWining and dining: James Corden, 37, and his wife Julia Carey enjoyed a romantic dinner date at Craig's restaurant on Melrose Avenue, West Hollywood\nMeanwhile, Julia looked stunning in a knee-length black dress and a pair of modest nude heels.\nHer blonde hair was pulled back and tied up, while her fringe was styled to the side. It was clearly a mild night as she clutched her black jacket in her hand.\nThe British funnyman engaged with fans following the meal, posing for pictures and even high-fiving one, much to the delight of Julia.\nDressed to impress: Julia looked stunning in a knee-length black dress and a pair of modest nude heels\nUp high: The British funnyman engaged with fans following the meal, posing for pictures and even high-fiving one, much to the delight of Julia\nOnce he'd finished mingling, the pair made their to their car with James getting behind the wheel and Julia buckling up in the passenger seat.\nThe couple, who married in 2012, have two children together, four-year-old son Max and one-year-old daughter Carey.\nThe night was in stark contrast to Azoff's party at the Troubador club in LA.\nSmile! James was more than happy to lean in for a selfie with a delighted fan\nIt was a star-studded line-up on the night as James and Julia joined One Direction heart-throb Harry Styles.\nHarry was in the venue with his rekindled love interest Kendall Jenner, who brought her momager Kris Jenner.\nMeanwhile, supermodel Cindy Crawford, 49, and her husband Randy Gerber, 53, gave the youngsters a run for their money looking hot to trot in their youthful all-black ensembles.\nTime to go: The Late Late Show host put on a dapper display in a velvet navy blazer worn over a plain navy top and teamed with a pair of jeans and comfortable kicks\nDrive! Once he'd finished mingling, the pair made their to their car with James getting behind the wheel and Julia buckling up in the passenger seat\nJames is currently enjoying huge success in his role at the helm of the popular US show.\nHe was recently honoured with the prestigious Britannia Award at the British Academy Britannia Awards in LA.\nThe award is BAFTA Los Angeles' highest accolade and Bryan Cranston was on hand to present James with the honour, while Julia looked on proudly from the audience.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422564/James-Corden-cuts-dapper-figure-velvet-navy-blazer-steps-romantic-dinner-wife-Julia-Carey.html"}
