{"authors":["Press Association"],"date_download":"2018-10-23 00:45:04","date_modify":"2018-10-23 00:45:04","date_publish":"2016-01-29 14:06:31","description":"James Murdoch is to return to Sky as its chairman, almost four years after he resigned from the company in the wake of the phone-hacking scandal. The 43-year...","filename":"data/vaneerConsumption/Jamesmurdochreturnsasskychairman.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-7eb12226-6254-4707-9a31-194564bfeea7-4PuZeKVXE7cd9005b2c876acd875-402_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422585_James-Murdoch-returns-Sky-chairman_1540255504.html","title":"James murdoch returns as sky chairman","title_page":"James murdoch returns as sky chairman | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"James Murdoch returns as Sky chairman\nJames Murdoch is to return to Sky as its chairman, almost four years after he resigned from the company in the wake of the phone-hacking scandal.\nThe 43-year-old takes up his position after a short stint as chief executive of media giant 21st Century Fox, a role he only took up in July, succeeding his father, Rupert.\nMr Murdoch, the younger son of the 84-year-old media tycoon, has been a director of the pay-TV company since 2003 and previously served as chief executive from 2003 to 2007, before holding the position of chairman from 2007 to 2012.\nJames Murdoch is to return to Sky as chairman (Sky/PA)\nHe bowed to pressure to resign from the role in April that year following the scandal that erupted following phone-hacking involving the Murdoch-owned News of the World.\nHe takes over as chairman of Sky - which is 39% owned by Fox - from Nick Ferguson, who steps down from the Sky board at the end of July after 12 years as a director.\nSky's group chief executive, Jeremy Darroch, said: \"The entire board offers its warmest thanks to Nick for his leadership as chairman and the major contribution he has made to Sky over many years. We're delighted that James Murdoch has agreed to step into the role of chairman.\n\"James' deep knowledge of the international media industry and his passion for supporting Sky's ongoing success will make an even greater contribution to our business in the future.\n\"We're excited about 2016 and we start the year with good momentum. With an outstanding set of new initiatives and products for our customers, we are well positioned to deliver further strong growth and returns for shareholders.\"\nMartin Gilbert has been appointed as deputy chairman, while Andrew Sukawaty becomes Sky's senior independent director.\nMr Murdoch's appointment comes as Sky revealed its highest customer growth in the UK and Ireland for 10 years, with 337,000 people joining the broadcaster in the second quarter.\nThe pay TV giant also secured record first-half operating profits - up 12% to £747 million - while revenues grew 5% to £5.7 billion in the six months to December 31 2015.\nMr Darroch added: \"We have had another very strong half as we continue to transform Sky, broadening our business and expanding into new markets and customer segments.\"\nHe said the company's strategy was \"delivering today and opening up significant growth opportunities for the future\".\nThe return of Mr Murdoch will now pose questions as to whether 21st Century Fox will mount a takeover bid for Sky.\nAnalyst Roddy Davidson, at Shore Capital, said the return of Mr Murdoch was likely to \"rekindle speculation regarding 21st Century Fox's plans for its 39% stake\".\nSky shrugged off the mounting threat from rival BT in October when it notched up its best first-quarter UK customer growth for four years.\nCampaign group Hacked Off questioned the appointment of Mr Murdoch.","url":"https://www.dailymail.co.uk/wires/pa/article-3422585/James-Murdoch-returns-Sky-chairman.html"}
