{"authors":["Adam Shergold For Mailonline"],"date_download":"2018-10-22 23:35:31","date_modify":"2018-10-22 23:35:31","date_publish":"2017-04-26 08:01:04","description":"James Rodriguez is content with life at Real Madrid and wants to continue fighting for his place. The attacking midfielder has found minutes hard to come by under Zinedine Zidane.","filename":"data/vaneerConsumption/JamesRodriguezswifesaysheishappyatRealMadrid.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/07/3F9CFF3500000578-0-image-a-47_1493189815865.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4446536_James-Rodriguez-s-wife-says-happy-Real-Madrid_1540251331.html","title":"James Rodriguez's wife says he is 'happy' at Real Madrid","title_page":"James Rodriguez's wife says he is 'happy' at Real Madrid | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"James Rodriguez is content with life at Real Madrid and wants to continue fighting for his place in the team.\nThe Colombian attacking midfielder has found minutes hard to come by under Zinedine Zidane this season, starting just nine La Liga and four Champions League matches.\nIt has led to speculation that the 25-year-old may end his three years at the Bernabeu this summer, with Manchester United and Chelsea linked with him.\nJames Rodriguez's wife, Daniela Ospina, says he is keen to stay at Real Madrid\nThe Colombian scored Real's equaliser after coming off the bench against Barcelona\nDaniela, pictured with her husband at the 2014 Ballon d'Or, wants to stay in Madrid\nBut his wife Daniela Ospina insists he is happy to stay in Madrid for a little longer yet.\nDaniela, the sister of Arsenal keeper David, is quoted in Spanish papers AS and Marca saying: 'James is very focused, it is a very personal decision.\n'He is happy, but when he has to make the decision, he will do so.\n'I cannot promise anything, but James wants to continue with Real Madrid and I love Madrid too. I am really happy in Spain and I want to stay here.\n'He is super happy, always working and trying to improve himself, to do what he has to do.\n'Obviously I want him to play more, to say that wouldn't be a lie.'\nRodriguez has struggled for minutes in Real Madrid's matches this season\nThe Colombian has been linked with moves to Chelsea and Manchester United this summer\nHis fortunes may change after he came off the bench on Sunday night to score the equaliser against Barcelona, only for Lionel Messi's late goal to hand their rivals a 3-2 win.\nWith the two teams locked together on 75 points at the top of La Liga, Real travel to Deportivo La Coruna on Wednesday night, while Barcelona host Osasuna.","url":"https://www.dailymail.co.uk/sport/football/article-4446536/James-Rodriguez-s-wife-says-happy-Real-Madrid.html"}
