{"authors":["Laurie Whitwell For Mailonline"],"date_download":"2018-10-23 03:38:38","date_modify":"2018-10-23 03:38:38","date_publish":"2016-01-11 16:23:24","description":"The Leicester striker, who turned 29 on Monday, participated in some light training away from the main squad, as manager Claudio Ranieri proceeds with caution over his star man.","filename":"data/vaneerConsumption/JamieVardycouldbeavailabletofaceTottenhamafterLeicestertopscorerunderwentgroinsurgeryearlierthismonth.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300AC42200000578-0-image-a-20_1452529314434.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3394159_Jamie-Vardy-available-face-Tottenham-Leicester-scorer-underwent-groin-surgery-earlier-month_1540265918.html","title":"Jamie Vardy could be available to face Tottenham after Leicester top scorer underwent groin surgery earlier this month","title_page":"Jamie Vardy could be available to face Tottenham after Leicester top scorer underwent groin surgery earlier this month | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Broke the record by scoring in 11 consecutive games back in November\nVardy is the Premier League's joint top scorer with 15 goals\nJamie Vardy is back training with Leicester City but Claudio Ranieri will wait until Tuesday to decide the Premier League top-scorer’s involvement in the match against Tottenham.\nVardy, who turned 29 on Monday, underwent a minor groin operation last week and missed Sunday's FA Cup trip to White Hart Lane.\nThe Leicester manager said the problem had required rectifying for some period and was much improved after surgery.\nJamie Vardy was celebrating his 29th birthday with fiancee Rebekah Nicholson on Monday\nVardy (right) hopes to make his comeback from minor groin surgery against Tottenham on Wednesday\nThe Leicester striker has been in fine form this season and is the joint top-scorer with 15 goals\nVardy is vital for Leicester, having scored 15 goals to sit level with Romelu Lukaku at the top of the charts.\n'He is getting better,' Ranieri said on Monday.\n‘I think he could be available. The little problem he had with the little operation is done and he can run normally without any problem.\n'Jamie has had a problem for a month, more or less, and he continued to play. Now he is much better. I'll see if he starts from the beginning or if he is ready to come with me on the bench. Every time he wants to play, I know.’\nVardy’s form has seen Andrej Kramaric kept out and Ranieri will listen to offers for the Croatia striker, bought for £9million 12 months ago.\nVardy broke the consecutive goal scoring record with this strike against Manchester United\nNew boy Demari Grey, a £3.75million signing from Birmingham, should make his debut, as Leicester return to league action, after Ranieri made eight changes for the weekends FA Cup clash.\n'He wasn't 100 per cent but as a 19-year-old, having only had four training sessions with us, in his first match against a Premier League team, he was outstanding. He had a chance to score and worked hard, the Leicester boss said.\nGhanaian international Jeff Schlup is still sidelined with a hamstring injury as Ranieri considers his starting XI.","url":"https://www.dailymail.co.uk/sport/football/article-3394159/Jamie-Vardy-available-face-Tottenham-Leicester-scorer-underwent-groin-surgery-earlier-month.html"}
