{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 23:13:21","date_modify":"2018-10-30 23:13:21","date_publish":"2014-08-13 21:58:34","description":"I'm going to preface this post with the following: In my opinion, Jamie Dornan probably does not deserve an Oscar for his role as a sex-obsessed abusive CEO named Christian Grey. Nothing remotely associated with 50 Shades of Grey, the movie or the…","filename":"data/vaneerConsumption/JamieDornansFiftyShadesofGreyPerformanceIsOscarWorthySaysScreenwriter.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/ee85e39b-d70c-49ed-960a-fdf39d2375d6.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35692-jamie-dornans-fifty-shades-of-grey-performance-is-oscar-worthy-says-screenwriter_1540941201.html","title":"Jamie Dornan's 'Fifty Shades of Grey' Performance Is Oscar-Worthy, Says Screenwriter","title_page":"Jamie Dornan's 'Fifty Shades of Grey' Performance Is Oscar-Worthy, Says Screenwriter","title_rss":"NULL","source_domain":"bustle.com","text":"I'm going to preface this post with the following: In my opinion, Jamie Dornan probably does not deserve an Oscar for his role as a sex-obsessed abusive CEO named Christian Grey. Nothing remotely associated with 50 Shades of Grey, the movie or the book, deserves any sort of award except maybe a Razzie for worst everything ever. But the screenwriter of 50 Shades of Grey begs to differ, and Us Weekly reported on it, so here we go: According to screenwriter Kelly Marcel, Jamie Dornan deserves \"an Oscar\" for his 50 Shades of Grey role.\nRight.\nThe comments came during a Q&A for the An Evening in the Writer's Room series, hosted by Reza Aslan. Aslan quoted a real line from the book — \"Mmmm...he's soft and hard at once, like steel encased in velvet, surprisingly tasty, salty and smooth. He's my own Christian Grey-flavored popsicle...\" — and Marcel responded, \"She says that, 'You are my popsicle.' That line went in, it's genius. They apparently did that scene great. Apparently Jamie is great at being soft and hard at the same time.\" I will refrain making a joke here. \"Which is hard to do for an actor! He's going to get an Oscar!\" Do with this information what you will.\nAll joking aside: If Jamie Dornan does win an Oscar for 50 Shades of Grey, though, feel free to tell me I was wrong. But I'm pretty confident I won't be wrong, so this will probably not happen.\n50 Shades of Grey will hit theaters on February 13, 2015.","url":"https://www.bustle.com/articles/35692-jamie-dornans-fifty-shades-of-grey-performance-is-oscar-worthy-says-screenwriter"}
