{"authors":["Stuart Fraser For Mailonline"],"date_download":"2018-10-22 20:36:48","date_modify":"2018-10-22 20:36:48","date_publish":"2016-01-28 02:00:42","description":"STUART FRASER IN MELBOURNE: Jamie Murray booked his place in a third consecutive Grand Slam final as the Brit and Brazilian Bruno Soares cruised to victory.","filename":"data/vaneerConsumption/JamieMurrayandBrunoSoaresreachtheAustralianOpenfinalinmensdoubles.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/02/30A626CF00000578-0-image-a-32_1453946425726.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-3420298_Jamie-Murray-Bruno-Soares-reach-Australian-Open-final-men-s-doubles-emphatic-victory-56-minutes_1540240608.html","title":"Jamie Murray and Bruno Soares reach the Australian Open final in men's doubles","title_page":"Jamie Murray and Bruno Soares reach the Australian Open final in men's doubles | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jamie Murray booked his place in a third consecutive Grand Slam final as the Brit and Brazilian Bruno Soares cruised to victory in the last-four of the Australian Open.\nIt took all of 56 minutes for seventh seeds Murray and Soares to see off the unseeded French pair Adrian Mannarino and Lucas Pouille 6-3, 6-1 on Rod Laver Arena.\nMurray reached the final at both Wimbledon and the US Open last year with Australian John Peers before the pair split up at the end of the season.\nIt took 56 minutes for Jamie Murray and Bruno Soares to win their men's doubles semi-final in Australia\nMurray (right) made Wimbledon and the US Open final last year with Australian John Peers\nMurray's new partnership with Soares got off to a flyer after winning their first title in Sydney two weeks ago\nMurray acknowledges the crowd after sealing victory in under an hour to reach the Grand Slam final\nBut Murray's new partnership with Soares has got off to a flyer after winning their first title together in Sydney two weeks ago and now reaching the final in Melbourne.\nMurray, 29, said: 'I'm starting to get the hang of this thing I think. Took me a long time to understand what it took to win.\n'I had a great partner the last few years in John Peers. Starting a new journey with Bruno here and it's been a great two weeks here.'\nWhile both players are rock solid at the net, what has impressed most is their chemistry with each other as a partnership after being friends for many years.\nSoares said: 'We both were playing with our former partners for a long time. Jamie approached me at the end of last year and I accepted the offer. We've been good friends for a long time. So far so good.'\nJohanna Konta was unable to join Murray in the final, losing in straight sets to Angelique Kerber, but his younger brother Andy can get there by overcoming Milos Raonic on Friday.\nMurray said: 'Andy's been doing amazing things for a long time. What Jo's done this week is unbelievable.'\nMurray and Soares will contest the final on Saturday night on Rod Laver Arena against veteran pair Daniel Nestor and Radek Stepanek, who have a combined age of 80 with Nestor 43 and Stepanek 37.\nGreat Britain could potentially have both Murray brothers competing in Grand Slam finals this weekend\nMurray and Soares will contest the final on Saturday on the Rod Laver Arena in Australia\nMurray's mum, Judy, cheers on her son and Soares as they triumph in their semi-final in Melbourne\nJudy Murray celebrates with Davis Cup captain Leon Smith as Murray advances into the final\nMurray said: 'Those guys [Nestor and Stepanek] have been at the top of the game for longer than maybe I've been alive. They've won Grand Slams and Masters series', everything there is to win.","url":"https://www.dailymail.co.uk/sport/tennis/article-3420298/Jamie-Murray-Bruno-Soares-reach-Australian-Open-final-men-s-doubles-emphatic-victory-56-minutes.html"}
