{"authors":["Press Association"],"date_download":"2018-10-23 03:32:53","date_modify":"2018-10-23 03:32:53","date_publish":"2016-01-28 19:06:40","description":"Jamie Murray wants to make it third time lucky in a grand slam final after he and partner Bruno Soares beat French pair Adrian Mannarino and Lucas Pouille at...","filename":"data/vaneerConsumption/Jamiemurrayhopingtomakeitthirdtimeluckyinaustralianopenfinal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-68a7c502-ff08-472e-b533-c0fda9e5d24b-2vdWmEltwXfba0ce28e632be247c-134_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420414_Jamie-Murray-reaches-Australian-Open-doubles-final_1540265573.html","title":"Jamie murray hoping to make it third time lucky in australian open final","title_page":"Jamie murray hoping to make it third time lucky in australian open final | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jamie Murray hoping to make it third time lucky in Australian Open final\nJamie Murray wants to make it third time lucky in a grand slam final after he and partner Bruno Soares beat French pair Adrian Mannarino and Lucas Pouille at the Australian Open.\nMurray lost at the last hurdle with former partner John Peers at both Wimbledon and the US Open last year, but the Scot now has the chance to go one step further as he and Soares sealed a 6-3 6-1 victory.\nThey will now face the experienced duo of Canada's Daniel Nestor and Czech Radek Stepanek, and Murray believes his two final defeats last year will help him this time around.\nJamie Murray has reached the Australian Open doubles final\n\"I think I know what to expect,\" Murray said.\n\"Obviously I came up on the wrong side the last two times I was there but it wasn't like I played bad matches or anything like that.\n\"I fully trust myself that I can perform in those matches. I believe Bruno can as well. I think the mentality we've got and the chemistry we seem to have struck up these last couple of weeks will bode well for us.\n\"We'll give it all we've got. We know it's going to be a tough match.\"\nMurray linked up with Brazilian Soares after splitting with Peers at the end of last season and they have enjoyed an excellent start together, winning their first title in Sydney earlier this month and now earning the chance to clinch a second in Melbourne.\n\"I think we complement each other well,\" Soares said.\n\"Jamie is really good at the net, really fast, he puts on a lot of pressure. One of my abilities is to make balls from the back.\n\"When I'm playing well, I'm quite consistent on returns and second balls, so that allows Jamie to be aggressive and play his game really strong, and vice versa.\n\"He's got a great serve. He helps me a lot when I serve. I have a decent serve but it's not a weapon, so I need somebody at the net to help me out.\"\nMurray was the first of three British players playing semi-finals at the first major tournament of the year, as his brother Andy and Johanna Konta both reached the last four of the singles.\nKonta was beaten by Germany's Angelique Kerber later on Thursday while Andy Murray takes on Canada's Milos Raonic on Friday.\nIt is the first time Britain has boasted three players in the semi-finals of three separate events at a grand slam since 1935.\n\"Who'd have thought it? Someone must be doing something right back in the UK,\" Jamie Murray said.\n\"Andy as been doing amazing things for a long time and what Jo has done this week has been quite unbelievable.\"\nMannarino and Pouille had previously knocked out top seeds Jean-Julien Rojer and Horia Tecau - the pair who beat Murray and Peers in last year's Wimbledon final - but they were outclassed on Rod Laver Arena.\nNestor and Stepanek, with a combined age of 80 and 10 major doubles titles between them, will provide a tougher test.\n\"Those guys have been at the top of the game for longer than maybe I've been alive,\" Murray said.\n\"They've won Grand Slams and Masters series, everything there is to win.","url":"https://www.dailymail.co.uk/wires/pa/article-3420414/Jamie-Murray-reaches-Australian-Open-doubles-final.html"}
