{"authors":["Portia Crowe"],"date_download":"2018-10-30 22:01:07","date_modify":"2018-10-30 22:01:07","date_publish":"2016-12-15 00:00:00","description":"JPMorgan's CEO advocated for the kind of heavy-handed leadership and public policy that Singapore has seen in recent decades.","filename":"data/vaneerConsumption/JamieDimononwhypopulismisineffective.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_jamie-dimon-on-why-populism-is-ineffective-2016-12_1540936867.html","title":"Jamie Dimon on why populism is ineffective","title_page":"    Jamie Dimon on why populism is ineffective - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Jamie Dimon. REUTERS/Dylan Martinez JPMorgan CEO Jamie Dimon is a fan of Singapore.\nThe Wall Street executive, who was recently said to be under consideration for Treasury secretary, advocated for the kind of heavy-handed leadership and public policy that country has seen in recent decades while speaking with Bloomberg Businessweek in Detroit Thursday.\nDimon was answering a question about whether Detroit's revitalization is replicable elsewhere. He pointed to Singapore as a model.\n\"When it formed, it was partially Chinese, partially Malay, partial Indian; they didn't speak each other's languages,\" Dimon said. \"A prime minister came in with the same kind of vision and strength to get it done. Its GDP is now higher than the GDP of the average American.\"\nSingapore's GDP per capita was $55,182 in 2013, while GDP per capita in the US was $53,041 that year.\nDimon was describing the nation's first Prime Minister — Lee Kuan Yew — who turned the island city into a regional economic powerhouse in the years after its independence from Malaysia in 1965. Lee, who died last year at 91, is credited for the city's transformation from trading port into regional financial hub, but also sharply criticized by human rights groups for the policies that helped bring about that change, many of which persist after his death.\nFor example, Singapore imposes corporal punishment — specifically caning — for relatively minor crimes like vandalism. It also sharply curtails free speech and criticism of the government.\n\"The prime minister is pretty tough,\" Dimon said. \"He made them all learn English so it could become a back office for companies. He made sure the streets are clean. They have a lot of affordable housing, but he made sure there wasn't an Indian building and a Malay building and a Chinese building. He desegregated, not just by building and not just by floor, by apartment.\"\nDimon went on:\n\"I tell people, you put some of my liberal democratic friends responsible for Singapore, it would still be a backwater. 'Oh you can't force people to live where they don't want to live, you can't punish people for spitting on the streets, you can't make people learn English' — that's what would happen. So people have to think policy, what works and what doesn't work.\"\nHe pointed to a number of countries where he said populism has not worked, including Venezuela, Ecuador, Argentina, Cuba, and North Korea.\nOn the other hand, Dimon said, South Korea and Singapore — neither of which has much in the way of natural resources — are good examples of public policy experiments that have been successful. He also highlighted the success of Germany's vocational schools.\n\"I worry about bad public policy just causing constant damage out there,\" Dimon said. \"In America, you keep on hearing productivity is low, secular stagnation, it's a new normal. It's just not true: We've had multiple wars, we're not educating our kids, we had government shut downs, badly-spent money, failures in the health system, failures and an extreme amount of regulation — that's why we're going slow.\"\nWatch the full segment:","url":"https://www.businessinsider.com/jamie-dimon-on-why-populism-is-ineffective-2016-12"}
