{"authors":["Mieka Smiles For Mailonline","Anucyia Victor For Mailonline"],"date_download":"2018-10-23 01:18:28","date_modify":"2018-10-23 01:18:28","date_publish":"2016-01-11 12:03:30","description":"Jamie Oliver wants to help you cook from scratch with his new home delivered food box - but can his offering cut the mustard? Here mum-of-two Mieka Smiles and her family test it out.","filename":"data/vaneerConsumption/JamieOliversHelloFreshfoodboxisputtothetestwithpukkaresults.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/300872ED00000578-0-image-a-6_1452513252188.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_food_article-3393701_Does-Jamie-Oliver-REALLY-deliver-FEMAIL-tests-celebrity-chef-s-new-food-box-recipe-helps-families-cook-scratch-home-pukka-results_1540257508.html","title":"Jamie Oliver's HelloFresh food box is put to the test with pukka results","title_page":"Jamie Oliver's HelloFresh food box is put to the test with pukka results | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jamie Oliver wants more families to cook from scratch.\nAnd his recent collaboration with food box company HelloFresh aims to lessen the stress involved in home cooking by delivering everything you need to skip the supermarket scramble and just get on with it.\nThe company is one of an increasing number that home deliver food boxes with specially sourced, pre-measured ingredients along with easy to follow recipes.\nMieka Smiles, 34, from Middlesbrough, Teesside, tests out the kit on her husband Christopher, 34, and their two children George, four, and Harriet, two, for FEMAIL.\nScroll down for video.\nJamie Oliver's recent collaboration with food box company HelloFresh aims to lessen the stress involved in home cooking by delivering everything you need to skip the supermarket scramble\nMieka Smiles, 34, from Middlesbrough, Teesside, tests out the kit on her husband Christopher, 34, and their two children George, four, and Harriet, two\nWith two children under five our current tea time scene is not quite as picture perfect: chips flying through the air, demands of tomato sauce and vegetable negotiations.\nThe meal boxes sound like an ideal solution for time-pressed families wanting to enjoy a relaxed but freshly prepared evening meal around the dinner table.\nBut how practical is the cook-from-scratch box concept for a real family like ours?\nWe tested out a HelloFresh Family Box (£64 per week) which feeds a family of four or five for four nights, which included one Jamie recipe and three from HelloFresh.\nThe price includes the recipes and delivery and it promises a flexible service meaning you can 'pause' delivery if you go away on holiday.\nPricey option?: Boxes start from £29 for three meals to feed two people. Under the new collaboration one Jamie recipe is set to be put within one of the HelloFresh range of boxes a week\nPrepping the lamb koftas with tzatziki (left) took 40 minutes. The finished meal (right) was viewed with trepidation by the cihldren but Mieka and her husband loved it\nMeal One: Shirley's Lamb Koftas with Tzatziki\nEase of prep: 8/10\nAppearance: 9/10\nTaste: 8/10\nOverall: 25/30\nAfter the excitement of picking through our food box, the whole family was looking forward to our first HelloFresh meal.\nBut given that my version of 'from scratch' usually includes a sauce in a jar or a dig about in the chest freezer, seeing the ingredients all laid out was a bit daunting.\nThe preparation time probably took longer than it would for someone more adept in the kitchen - doubling the overall estimate of 40 minutes.\nThe children loved helping me out though, the recipes highlighting 'Little Hand' opportunities.\nTheir reactions when presented with the dish were priceless: 'Oh my God, what is that,' asked our worried four-year-old.\nThe lamb, spice and combination of flavours were probably suited to a more mature palate.\nHowever with a bit of coaxing (and dollop of tomato sauce) they gave the meal a good go.\nChris and I loved it, the cooling yoghurt dip a perfect partner to the spicy koftas.\nMieka's children Harriet (left) and George (right) loved helping out on the recipes'Little Hand' opportunities\nProtein-packed chorizo, quinoa and almond jumble proved to be a hit with the family\nMeal Two: Protein-packed chorizo, quinoa and almond jumble\nEase of prep: 9/10\nAppearance: 9/10\nTaste: 8/10\nOverall: 26/30\nI didn't think we were quinoa people as I presumed it a bit faffy.\nBut the actual prep for this dish was a lot less convoluted than the first and the quinoa very straight forward to sort. Just boil, drain and cover.\nThe children picked at the tasty chorizo and the cook-from-fresh-smells of tomato, pepper and onion fired up our appetites.\nI'm usually an 'it'll do' kind of person in the kitchen but following the recipe to the letter was pleasing, especially with the exact ingredients to hand.\nThe finished plates looked impressive…unfortunately the kids didn't share the same sentiment.\nBut to our absolute amazement, and after an initial standoff, they loved this dish.\nThe chorizo and the feta brought it to life.\nOnce again it was a hit with us, and we felt virtuous knowing it packed a healthy punch.\nCheeky chicken chow mein with oyster sauce and water chestnuts was the tastiest dish by far\nMeal Three: Cheeky chicken chow mein with oyster sauce and water chestnuts\nEase of prep: 9/10\nAppearance: 10/10\nTaste: 10/10\nOverall: 29\nNoodles are a firm favourite in our household, so we were looking forward to this meal.\nOur plan was to slightly adapt the recipe for the kids, holding back on the oyster sauce just before serving.\nThat's an added benefit to this plan: you can leave a component out to suit quite easily.\nOnce again, the prep involved a fair bit of chopping.\nAnother slight drawback was the amount of pots, pans and general mess the cook from scratch approach was making.\nThe kids enjoyed their deconstructed version, but I think the real seal of approval came from us.\nIt was the tastiest dish by far and perhaps the most simple to pull together.\nThe fresh chilli, garlic and ginger really warmed the dish and stood out, even with a rich oyster sauce.\nRestaurant standard for sure.\nJamie's cool Mexican bean wraps with peppers, tomatoes & chilli were a little too spicy for the children\nMeal Four: Jamie's cool Mexican bean wraps with peppers, tomatoes & chilli\nEase of prep: 7/10\nAppearance: 9/10\nTaste: 7/10\nOverall: 23/30\nThe one we'd been waiting for; a Jamie recipe.\nUnder the new collaboration one Jamie recipe is set to be put within one of the HelloFresh range of boxes a week.\nAfter a busy morning swimming we decided to pick this recipe for a late lunch.\nVeg chopped and organised (a key to success for these recipes I think) it was time to sort the bean paste.\nA bit tricky for lunch perhaps, at least for me. It all came together though - and certainly looked the part.\nSadly it wasn't to be for our kids, with back up sandwiches quickly served up. A bit spicy for little ones maybe?\nChris and I enjoyed the hearty wraps which had smoky paprika kick, but agreed more cheese would have made them tastier.\nWe also snuck in some guacamole and sour cream.\nThe family loved the HelloFresh experience and will try it again. Mieka says: 'The portion sizes are generous and I think a box for two adults would be enough to let small children explore new tastes alongside you'\nVerdict\nWe loved the HelloFresh experience and we'll certainly try it again. The portion sizes are generous and I think a box for two adults would be enough to let small children explore new tastes alongside you.\nThen, if the recipe is a success, you can always repeat it rather than wasting food or having a fridge full of leftovers. It would also give us a bit of leeway if we fancied a meal out, lazy pasta or occasional family takeaway.\nMy confidence in the kitchen has rocketed and the kids have loved sitting around the table as a family, despite not being keen on every recipe.\nFor older, more adventurous children I reckon the concept is a real no brainer.","url":"https://www.dailymail.co.uk/femail/food/article-3393701/Does-Jamie-Oliver-REALLY-deliver-FEMAIL-tests-celebrity-chef-s-new-food-box-recipe-helps-families-cook-scratch-home-pukka-results.html"}
