{"authors":["Portia Crowe"],"date_download":"2018-10-30 23:35:20","date_modify":"2018-10-30 23:35:20","date_publish":"2016-12-06 00:00:00","description":"\"I am a patriot,\" the Wall Street executive said.","filename":"data/vaneerConsumption/JamieDimononjoiningTrumpseconomicadvisoryteam.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_jamie-dimon-on-joining-trump-economic-advisory-team-2016-12_1540942520.html","title":"Jamie Dimon on joining Trump's economic advisory team","title_page":"    Jamie Dimon on joining Trump's economic advisory team - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"JPMorgan Chase CEO Jamie Dimon. Thomson Reuters JPMorgan CEO Jamie Dimon wants to help President-elect Donald Trump improve the lives of lower-wage workers.\nSpeaking at the Goldman Sachs Financial Services conference, the Wall Street executive, who was reportedly under consideration for Treasury secretary before the selection of Steve Mnuchin, said he wouldn't be very suited for a role in the administration.\n\"I've always been fairly consistent that I love my job,\" Dimon said.\nBut he said he did \"immediately\" join a special economic advisory team alongside other Wall Street titans like Blackstone CEO Steve Schwarzman and BlackRock CEO Larry Fink.\n\"I am a patriot — I want to help my country and help it grow,\" said Dimon, a lifelong Democrat. \"I want to help lower-wage people more than I want to help you,\" he said to the conference audience.\nHe added that he wanted to do his share to help America \"get better\" and had a lot of thoughts on how to do that.\n\"I might even be better off doing that from the outside than doing it from the inside,\" he said.\nThe advisory group will advise Trump on how to institute policies to encourage job growth and improve productivity. Its first meeting will be in the first week of February.","url":"https://www.businessinsider.com/jamie-dimon-on-joining-trump-economic-advisory-team-2016-12"}
