{"authors":["Joe Ridge For Mailonline"],"date_download":"2018-10-23 02:37:51","date_modify":"2018-10-23 02:37:51","date_publish":"2016-01-28 17:40:26","description":"Jamie Roberts and Jonathan Davies will, in all likelihood, start their 40th Test together for Wales in next weekend's RBS 6 Nations clash against Ireland in Dublin. It has been a long time coming.","filename":"data/vaneerConsumption/JamieRobertsisfuelledfortheSixNationsandreadytorekindlehisformidablepartnershipwithJonathanDaviesforWales.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30ACA81D00000578-0-image-a-70_1454002499525.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-3421331_Jamie-Roberts-fuelled-Six-Nations-ready-rekindle-formidable-partnership-Jonathan-Davies-Wales_1540262271.html","title":"Jamie Roberts is fuelled for the Six Nations and ready to rekindle his formidable partnership with Jonathan Davies for Wales","title_page":"Jamie Roberts is fuelled for the Six Nations and ready to rekindle his formidable partnership with Jonathan Davies for Wales | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jamie Roberts and Jonathan Davies will, in all likelihood, start their 40th Test together for Wales in next weekend's RBS 6 Nations clash against Ireland in Dublin.\nIt has been a long time coming after Davies suffered a serious knee injury last summer that ruled him out the World Cup but now the pair will re-forge arguably the most formidable centre partnership in international rugby at the moment - now Ma'a Nonu and Conrad Smith have hung up their All Blacks jerseys.\nAnd Roberts, for one, is looking forward to being reunited with his playing partner for so many years.\nJamie Roberts (pictured) is set to play a starring for Wales in the upcoming Six Nations Championship\nRoberts and Jonathan Davies (left) celebrate the British and Irish Lions' series win over Australia in 2013\nJAMIE ROBERTS' RUGBY CAREER CLUB Cardiff RFC (2005-07) - 28 games, 15 tries Cardiff Blues (2007-13) - 87 games, 18 tries Racing (2013-15) - 31 games, 4 tries Cambridge University (2015) - 5 games Harlequins (2015-) - 4 games, 1 try INTERNATIONAL Wales (2008-) - 74 games, 9 tries Barbarians (2009) - 1 games British and Irish Lions (2009, 2013) - 3 games, 1 try\n'Having gone through an ACL [anterior cruciate ligament] injury before I know how long a path and horrible a path that is, so it's great to see Jon back fit,' he said of the man who he also played alongside in the Lions' decisive third-Test win over Australia in 2013.\n'I'm sure he's been through some dark times - certainly missing the World Cup with that injury and watching the boys and not being a part of it.\n'He's a quality player on his day and someone I've enjoyed playing alongside and he's done some great things with Wales over the past years. I'm sure the boys are excited to have him back and hopefully I'll to play with him through the Six Nations and do the business.'\nAnd Roberts is confident the pair will pick up where they left off.\n'We've got a couple of weeks' prep,' he said. 'It's all about things becoming second nature and we've got preparation time to do that. That familiarity will hopefully give us a head start.'\nDavies and Roberts look set to start together for Wales for the 40th time against Ireland in Dublin next week\nFor all the confidence that the presence of Roberts and Davies together will bring back to the Wales side, Roberts echoed head coach Warren Gatland's sentiment that Ireland are the strong favourites for the match and the Championship.\n'Ireland have won the last two so I think they have to be (favourites),' he added. 'They're going for three in a row so that makes sense.\n'Ireland always pose a threat. I played with Jonny Sexton at Racing and he's a quality player when he's on his game and I played against Robbie Henshaw last year and he's a quality young player. He's a big part of what Ireland do now.'\nRoberts will turn 30 in November and as the oldest back in Gatland's 37-man squad he has become all to aware of the increasing importance of diet and recovery in the professional era.\nRoberts, who turns 30 in November, has earned 74 caps for Wales since his debut back in 2008\n'Diet is very important and it plays a huge part in professional rugby now,' said Roberts.\n'Certainly I have to look after my body a lot more now than I did when I was 20, 21. You feel the knocks a bit more and the recovery process becomes a bit longer.\n'I remember I used to be raring to go on the Monday after test matches whereas now it's not until Thursday I feel fully recovered, that's part and parcel of the game and that's part and parcel of getting a bit older as well!\n'But I still have the enjoyment for the whole process.'\nA photo of an enormous breakfast Roberts had earlier this month caused a stir on social media this month. 'That was a nice little treat of a breakfast I shared the other week,' he laughed.\n'We had it at Surrey Sports Park at Quins and I thought it was worth a tweet and went it bit viral - but it's not usually like that! The usual breakfast is eggs, whether that's on toast or with bagels, and beans and a nice protein smoothie, a bowl of fruit - I might get some yoghurt in there as well.'\nRoberts shared this picture of a hearty breakfast he had with Harlequins on Twitter earlier this month\nIn terms of recovery, Roberts' is not quite as meticulous as Wales captain Sam Warburton, who revealed he takes zinc, magnesium and a sleeping tablet.\n'Everyone recovers in different ways,' he added. 'I also struggle to sleep at night after games.\n'But I like to treat myself. If I've played on a Saturday, Sunday night usually comprises of Dominos pizza on the sofa.\n'But just staying hydrated - stretching, massage, ice baths - is very important and we have cryotherapy with Wales.'\nFor the best part of a decade now Roberts has been the premium crash-ball centre in rugby and he could be coming up against the heir to his throne, Manu Tuilagi, if the England man is fit, as hoped, in time for their March 12 clash.\n'Manu is very physical and he is a guy you have to stop,' said Roberts. 'I got to know him on the Lions tour in 2013 and he's a top lad and someone who will give a lot to England I'm sure if he's fit.\n'But that England game is quite a long way off yet and our first focus is on Ireland and hopefully we'll get to that England game in a good position and we'll have a look at that then.'\nRoberts (right) tackles England centre Manu Tuilagi during the 2013 Six Nations","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-3421331/Jamie-Roberts-fuelled-Six-Nations-ready-rekindle-formidable-partnership-Jonathan-Davies-Wales.html"}
