{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 01:35:32","date_modify":"2018-10-23 01:35:32","date_publish":"2016-01-28 15:57:17","description":"The actress stars in an episode of the CBS drama, which airs in early March, fighting internet crime, after she revealed she has been battling a neurological disorder for 15 years","filename":"data/vaneerConsumption/JamieLynnSiglerlandsnewroleonCSICyberafter15yearsecretbattlewithMS.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/3060EB5D00000578-0-image-a-45_1453997093277.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421161_Jamie-Lynn-Sigler-lands-new-role-CSI-Cyber-revealing-15-year-secret-battle-MS_1540258532.html","title":"Jamie-Lynn Sigler lands new role on CSI: Cyber after 15-year secret battle with MS","title_page":"Jamie-Lynn Sigler lands new role on CSI: Cyber after 15-year secret battle with MS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was on HBO's Sopranos for eight years.\nAnd now Jamie-Lynn Sigler is going back to TV to guest star on the show CSI: Cyber, People reported on Thursday.\nThis comes after the 34-year-old actress revealed she has been secretly battling MS for 15 years.\nScroll down for video\nPastures new: Jamie-Lynn Sigler, 34, has landed a new role on the other side of the law - fighting internet crime in CSI: Cyber, reports People.com on Thursday (pictured with husband Cutter Dykstra and son Beau last month)\nOn CSI: Cyber, the beauty will play Sasha, a director of content monitoring for a respected social media company.\nShe handles the responsibility for 'recruiting those monitoring for illegal content on the social media platform,' according to People. The site also noted her character is 'smart' and 'well dressed.'\nHer episode of the CBS drama airs in early March.\nHealth woes: The star has been signed up just a week after she revealed to People that she has been battling a neurological condition since she was 20 years old (pictured on January 9)\nThe star signed up for the show just a week after she revealed to People that she has been battling a neurological condition since she was 20 years old.\nJamie was diagnosed with Multiple Sclerosis after she felt a 'heaviness' and tingling in her legs.\nShe was symptom-free for quite some time but has got progressively worse over the last decade, and she now has weakness on the right side of her body and some loss in coordination.\nThe brunette told People she had been keeping it a secret after an industry insider warned her that it may hurt her career.\n'I'm sure they were just looking out for me', she explained to the publication: 'But they said, \"I'm going to pretend you didn't say that. I'm going to tell you right now that you should never tell anyone you have this.\"'\nOpening up: The brunette spoke with Maria Menounos on E! on Wednesday, and shared this picture of the pair\nShe added: 'And I just thought, \"Okay, that means a lot of things. That means I might not be accepted. That means people will have their own ideas of what my limitations are.\" I had a fear that it would all go away if people knew.'\nThe beauty has just returned from a mini-moon in Santa Barbara after marrying Cutter Sykstra, 26 in Palm Springs, California on January 16.\nShe tied the knot with the baseball player - with whom she has two-year-old son Beau - in a candlelit ceremony at the Parker Palm Springs hotel.\nCSI: Cyber airs Sundays (10 p.m. ET) on CBS.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421161/Jamie-Lynn-Sigler-lands-new-role-CSI-Cyber-revealing-15-year-secret-battle-MS.html"}
