{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-23 00:00:56","date_modify":"2018-10-23 00:00:56","date_publish":"2016-01-11 08:11:46","description":"Jamie Foxx gave Quentin Tarantino a public dressing down after he used the word 'ghetto' in a Golden Globes acceptance speech on Sunday.","filename":"data/vaneerConsumption/JamieFoxxchastisesQuentinTarantinooverGoldenGlobesghettocomment.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/08/30060E5300000578-0-image-a-47_1452499847809.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393522_Jamie-Foxx-chastises-Quentin-Tarantino-use-word-ghetto-Golden-Globes-acceptance-speech-Twitter-erupts_1540252856.html","title":"Jamie Foxx chastises Quentin Tarantino over Golden Globes 'ghetto' comment","title_page":"Jamie Foxx chastises Quentin Tarantino over  Golden Globes 'ghetto' comment | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jamie Foxx gave Quentin Tarantino a public dressing down after he used the word 'ghetto' in a Golden Globes acceptance speech on Sunday.\nThe director used the term as he collected the best original score gong on behalf of Ennio Morricone, who provided the soundtrack for his film The Hateful Eight.\nPulp Fiction filmmaker Tarantino, 52, said the Italian is 'my favourite composer,' and not just in 'that ghetto' of movie composition.\nScroll down for video\nSlumming it: Quentin Tarantino has been criticised for using the word 'ghetto' in a Golden Globes acceptance speech on Sunday\nHe added: 'I’m talking Mozart, I’m talking Beethoven, I’m talking Schubert.'\nHis use of the word seemed to be taken as a racial slight by award presenter Foxx, who after he left the stage walked up to the microphone and sternly said simply, 'ghetto?'\nIn the US, some associate the word ghetto with slum housing areas populated by African Americans.\nHowever it is an Italian word which originates in the 17th century, and was originally used in Venice to describe the part of the city to which Jews were restricted and segregated.\nFoxx in the box: Jamie was right behind the director as he used the word during the best original score acceptance speech\nAnger unchained: Foxx immediately chastised his old director when he got back to the microphone\nBy definition it means a part of a city, especially a slum area, occupied by any ethnic or other minority group or groups.\nAdditionally, it is used in slang speech to refer to something considered unrefined, low-class, cheap or inferior.\nThere was also an outcry on social media about Tarantino's use of the word.\nOne said, 'Tarantino will regret the \"ghetto\" comment when the alcohol wears off,' while another added he will, 'probably deserving get dragged a little for that... comment.'\nAnother user insisted the director, who is worth an estimated $100 milllion, should 'check your privilege.'\nOutrage: People on Twitter were soon voicing their disapproval over the fact he used a word they did not like\nCheck your privilege: Another got his point across by using a comical South Park image\nOthers praised Foxx for having the fortitude to 'call out' the filmmaker, who directed him in Django Unchained, over the term.\nMorricone has written more than 500 scores for cinema and television, as well as over 100 classical works.\nHe is perhaps best known for his work on the Dollars Trilogy, with his work for The Good, The Bad And The Ugly considered one of the most influential of all movie soundtracks.\nJust a few of the other films he has been involved in include The Untouchables, Once Upon a Time in the West and Disclosure.\nSilver screen legend: Ennio Morricone has written more than 500 scores for cinema and television","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393522/Jamie-Foxx-chastises-Quentin-Tarantino-use-word-ghetto-Golden-Globes-acceptance-speech-Twitter-erupts.html"}
