{"authors":["Emily Sheridan","Cassie Carpenter For Mailonline"],"date_download":"2018-10-23 01:07:10","date_modify":"2018-10-23 01:07:10","date_publish":"2016-01-11 11:39:57","description":"The model and aspiring actress changed out of her ethereal, pink Paolo Sebastian gown into a cute embellished little black dress.","filename":"data/vaneerConsumption/JamieFoxxhitsWeinsteinbashwithMissGoldenGlobe2016daughterCorinne.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3007D73E00000578-0-image-a-32_1452512010010.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393717_Jamie-Foxx-hits-Golden-Globes-parties-daughter-Corinne_1540256830.html","title":"Jamie Foxx hits Weinstein bash with Miss Golden Globe 2016 daughter Corinne","title_page":"Jamie Foxx hits Weinstein bash with Miss Golden Globe 2016 daughter Corinne | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sunday night was Corinne Foxx's big moment when she served as Miss Golden Globe 2016 at the star-studded ceremony.\nBut after sitting through the lengthy awards in her delicate couture gown, it was time for the 21-year-old to change into something a bit more comfortable to let her hair down.\nThe model and aspiring actress changed out of her ethereal, pink Paolo Sebastian gown into a cute embellished little black dress.\nScroll down for video and full list of winners\nThat's my girl: Proud father Jamie Foxx shows off his daughter Corinne as they attend the Weinstein Company and Netflix after-party following the Golden Globes on Sunday\nFollowing her quick wardrobe change, Corinne joined her father - who remained in his same black tuxedo - at the Weinstein Company and Netflix after-party sponsored by Heineken at the Beverly Hilton Hotel.\nDespite arriving together, it looks like the pair were typical parent and child and didn't spend the whole evening side-by-side cramping each others' style.\nOscar winner Jamie was spotted mingling with model Chanel Iman and actors Tyrese Gibson and Chris Tucker.\nSee full Golden Globes coverage on winners and red carpet moments\nAll change: The model and aspiring actress changed out of her ethereal, pink Paolo Sebastian gown into a cute embellished little black dress\nDon't cramp my style! Despite arriving together, the father-and-daughter did socialise separately for some of the evening\nMeanwhile, Corinne looked like she having a ball goofing around in a photobooth with her friends Austin Lantero and Taylor.\nIt appeared Corinne had picked up a bottle of Moet from the champagne vending machine at the Weinstein-Netflix bash as she posted a photo of herself bouncing on a bed holding one on her Instagram.\nCaptioning the image of her carrying the Moet, she wrote: 'Thank you for all your support and love. I'm in pure bliss right now. What a magical night! @goldenglobes @moetchandon.'\nMingling: Jamie cosies up to model Chanel Iman (left) and another glamorous female guest\nElated: Corinne shows off her giant bottle of Moet champagne after returning to her hotel room\nSharing the joy: Corinne was joined by two friends as they larked around at the Laura Mercier photobooth at the Weinstein-Netflix party\nEarlier that evening, the 48-year-old actor embraced his daughter onstage after an emotional introduction.\nHe enthused: 'This young lady never asked me for money. This young lady never asked me for anything. This young lady's never been in trouble. This young lady deserves this moment.\n'She was here when she was 10 years old when she was in the fifth grade, and she came with her father to this event. This young lady is absolutely the love of my life. This young lady is absolutely my heart. She is Miss Golden Globe. This young lady's name is Miss Corinne Foxx.'\n'This young lady is absolutely my heart': Jamie Foxx could not have been more proud of his daughter Corinne, who served Miss Golden Globe duties at Sunday's glitzy awards ceremony\nThe nepotistically-privileged position was previously held by Dakota Johnson, Rumer Willis, and Laura Dern.\nFoxx - born Eric Bishop - first made sure to coach his little debutante, who recently changed her surname to reflect her famous father.\nThe single father-of-two also has a seven-year-old daughter called Annalise, but it's unclear whether or not she was present.\n'She is Miss Golden Globe': The 48-year-old Oscar winner embraced the 21-year-old USC senior onstage the Beverly Hilton after an emotional introduction\nThe Annie actor told the A-list crowd: 'This young lady never asked me for money. This young lady never asked me for anything. This young lady's never been in trouble. This young lady deserves this moment'\nThe Horrible Bosses 2 star revealed: 'She was here when she was 10 years old when she was in the fifth grade, and she came with her father to this event. This young lady is absolutely the love of my life'\nThe sometime stand-up comedian later 'pulled a Steve Harvey' while announcing Straight Outta Compton as the winner for Best Original Score - which actually went to The Hateful Eight's Ennio Morricone.\nCinderella starlet Lily James grinned as Jamie apologised: 'I'm sorry folks, I made a mistake. It's right here on the card. I take full responsibility. It was right here on the card. I apologise to everyone in Compton. I apologise to Ice Cube.'\nFoxx's joke came three weeks after Harvey - who turns 59 next week - announced the wrong winner during the Fox-televised Miss Universe pageant.\nIntroduction to high society: The nepotistically-privileged position was previously held by Dakota Johnson, Rumer Willis, and Laura Dern\nFoxxy duo: Foxx - born Eric Bishop - first made sure to coach his little debutante, who recently changed her surname to reflect her famous father\nCalm before the storm: Corinne surveys the scene from a hotel balcony\nAfter crowning 22-year-old Ariadna, the Miss Universe title was then handed over to Miss Philippines, Pia Wurtzbach.\nTwo months ago, the two-time Grammy winner dropped his music video In Love By Now from his fifth studio album, Hollywood: A Story of a Dozen Roses.\nJamie - who once played Ray Charles - will next play heavyweight boxing champion Mike Tyson in a Paramount biopic helmed by Martin Scorsese (Raging Bull).\nThe Horrible Bosses 2 star will next be seen as Vincent Downs in a remake of the 2011 French thriller Sleepless Night alongside Michelle Monaghan, Dermot Mulroney, and Gabrielle Union.\n'I apologise to Ice Cube': The sometime stand-up later 'pulled a Steve Harvey' while announcing Straight Outta Compton as the winner for Best Original Score - which actually went to The Hateful Eight's Ennio Morricone\nCinderella starlet Lily James grinned as Jamie apologised: 'I'm sorry folks, I made a mistake. It's right here on the card. I take full responsibility. It was right here on the card. I apologise to everyone in Compton'\nA life on the red carpet: A young Corinne with her father at the 2005 Academy Awards","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393717/Jamie-Foxx-hits-Golden-Globes-parties-daughter-Corinne.html"}
