{"authors":["Meredith Turits"],"date_download":"2018-10-30 22:31:30","date_modify":"2018-10-30 22:31:30","date_publish":"2014-08-15 13:23:03","description":"I don't have to sit here and type out all the ways Jane Austen is cool, even obsession-worthy — but this little fact about the way she edited is maybe my favorite detail I've learned about her. According to Open Culture, Austen used pins to edit her…","filename":"data/vaneerConsumption/JaneAustenUsedStraightPinstoEditTheWatsonsBecauseofCourseJaneAustenDidSomethingElseAwesome.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/e7c35e20-65dd-493d-ba13-e728006cc935.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35897-jane-austen-used-straight-pins-to-edit-the-watsons-because-of-course-jane-austen-did-something_1540938690.html","title":"Jane Austen Used Straight Pins to Edit 'The Watsons,' Because of Course Jane Austen Did Something Else Awesome","title_page":"Jane Austen Used Straight Pins to Edit 'The Watsons,' Because of Course Jane Austen Did Something Else Awesome","title_rss":"NULL","source_domain":"bustle.com","text":"I don't have to sit here and type out all the ways Jane Austen is cool, even obsession-worthy — but this little fact about the way she edited is maybe my favorite detail I've learned about her. According to Open Culture, Austen used pins to edit her unfinished manuscript, The Watsons .\nYes, pins — like the ones with which you sew. Janeausten.ac.uk has noted that although she's corrected the novel in ink the way you'd expect, Austen didn't seem to anticipate having to give the work, which was without chapter divisions, another go, so she didn't leave big blank areas to expand. Therefore:\nshe had to find other strategies — the three patches, small pieces of paper, each of which was filled closely and neatly with the new material, attached with straight pins to the precise spot where erased material was to be covered or where an insertion was required to expand the text.\nSmart lady. There's a picture of Austen's crafty editing — a practice that actually dates back to 1617 — at the link above.\nWhen I was editing my first manuscript (the first time around... before it became a novel in a drawer for good...), I translated the entire thing onto Post-It Notes and stuck it up on my bedroom wall. Blue notes represented the existing, linear storyline; red notes stood for the existing flashback chapters; blue notes with red lines were existing linear chapters with references to the past; orange notes connoted new scenes I had to write, etc — it was complicated, and, needless to say, demonstrated why the whole thing was so damn unwieldy that the novel ended up failing.\nLooking back now, however, I like to consider myself a sort of modern-day Jane Austen.\nSort of.\nOK, not really. Forget I said that.\nh/t BlackBalloon\nImage: quinnanya/flickr","url":"https://www.bustle.com/articles/35897-jane-austen-used-straight-pins-to-edit-the-watsons-because-of-course-jane-austen-did-something"}
