{"authors":[],"date_download":"2018-10-30 01:21:34","date_modify":"2018-10-30 01:21:34","date_publish":"2014-06-30 21:56:04","description":null,"filename":"data/vaneerConsumption/JanetYellensBlueCollarSecurityDetailIrkingLimousineLiberalNeighbors.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/themes/amspec-v1/_img/favicon.ico?v=2","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862494.html","title":"Janet Yellen's Blue Collar Security Detail Irking Limousine Liberal Neighbors","title_page":"Janet Yellen's Blue Collar Security Detail Irking Limousine Liberal NeighborsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Here’s an amusing story you might have missed, given the big news day. Elizabeth Williamson of The Wall Street Journal reports that the security detail assigned to Janet Yellen is ticking off her neighbors in the tony Hillandale, a gated community in Georgetown. The guards assigned to the newly minted Federal Reserve Chairwoman–see what I did there?–have been accused of such behaviors as idling their engines during the twenty minute wait to pick their boss up in morning and leaving oil stains on the street. I’m not quite sure who to root for. The residents paid their three million bucks, fair and square, to live in a peaceful community that micromanages such aspects of their lives as how many dogs they can own (a maximum of two pets per household, please). The claim that a government agency shouldn’t breach their peace is sympathetic. On the other hand, Yellen’s neighbors are smug, liberal elite crybabies.\nPerhaps that might sound harsh, but according to WIlliamson’s report, “[n]eighbors seem especially put off by the aesthetics of the security detail, in particular their blue uniforms and—in the words of one resident—’doughnut bellies.'” Concerns have been raised that the officers wear uniforms, smoke, eat fast food in their van, and–gasp!–visibly carry firearms. This last bit, according to a list of grievances presented by the residents, is “uncomfortable for residents of various religious persuasions.” Left unsaid in Williamson’s piece is why those of the religious persuasions in question are so comfortable judging honest blue collar workers from the windows of their mansions.\nThe comments of one resident encapsulate the elitist argument nicely:\n“Now we have this group, overweight, wearing the most ridiculous blue uniforms with the most ridiculous blue caps, and they have guns that are visible.” She declined to be named because she is worried about federal-government reprisals.\nOf course an added benefit to not being named is that no one learns just how much of a snob you are. Another resident pooh poohs the counter-argument that the security presence is good for the neighborhood: “[T]hese characters are only here for Janet Yellen. They’re not going to be distracted by robbers, rapists or any other thing. Besides, these guys couldn’t catch a thief if their lives depended on it.” It is doubtful that a bunch of residents who are uncomfortable with tools of defense and the mere presence of those who look like they work for a living would do any better at catching criminals.\nThe funniest part of the story is that the residents are arguing that the government should investigate whether the security detail is necessary, because it’s a waste of taxpayer money. How do you turn a staunch liberal into a fiscal hawk? Inconvenience him.","url":"https://spectator.org/59818_janet-yellens-blue-collar-security-detail-irking-limousine-liberal-neighbors/"}
