{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 03:07:25","date_modify":"2018-10-23 03:07:25","date_publish":"2017-04-26 14:31:29","description":"The actress, 38, appeared on Wednesday's episode of Loose Women, confessing that filming the harrowing scenes with Kym was like 'therapy'.","filename":"data/vaneerConsumption/JaneDansonadmitsCorriestillbirthstorylinehelpedher.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA0848C00000578-0-image-a-15_1493220470410.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447790_Jane-Danson-admits-Corrie-stillbirth-storyline-helped-her_1540264045.html","title":"Jane Danson admits Corrie stillbirth storyline helped her","title_page":"Jane Danson admits Corrie stillbirth storyline helped her | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kym Marsh brought Coronation Street viewers to tears earlier this year with her moving portrayal of Michelle Connor's experience of losing a baby at 22 weeks.\nAnd Jane Danson, who plays Leanne Battersby on the ITV soap, praised her co-star for her sensitive depiction of the terrible time, admitting that it had helped her finally mourn the loss of her own baby.\nThe actress, 38, appeared on Wednesday's episode of Loose Women, confessing that filming the harrowing scenes with Kym was like 'therapy'.\nScroll down for video\nOn set therapy: Jane Danson appeared on Wednesday's episode of Loose Women, confessing that filming the harrowing stillbirth scenes with Kym Marsh on Coronation Street was like 'therapy' for her\nJane - who raises sons Harry, 10, and Alfie, eight with her husband Robert Beck - explained that because Kym had also experienced a miscarriage, the pair were able to help each other and share their stories.\nShe bravely said: 'I'd been through that experience, but I'd kept it to myself and hadn't spoken about it before that storyline came up.\n'Kym and I had never really worked together before, but we knew what we'd be going through as we'd both had those experiences.'\nEmotional: Jane that because Kym had also experienced a miscarriage, the pair were able to help each other and share their stories\nDrama: Leanne fell pregnant with Michelle's husband Steve McDonald's child - the fallout of which is still playing out onscreen\nShe bravely said: 'I'd been through that experience, but I'd kept it to myself and hadn't spoken about it before that storyline came up'\nKeeping it quiet: It was only last autumn that Jane spoke publicly about her own sad loss, revealing that she found it difficult shooting Leanne's pregnancy scenes on the soap\nJane revealed the bond between her and Kym was strengthened following their shared scenes and experiences.\n'In a way it helped me because I'd never talked about it before. It was like therapy', she continued.\n'And Kym was very supportive, even though she'd been through that sad experience herself.\nJane said: 'Kym and I had never really worked together before, but we knew what we'd be going through as we'd both had those experiences'\nLast year, Corrie viewers saw Leanne fall pregnant with Michelle's husband Steve McDonald's child - and the fallout is still playing out onscreen.\nMichelle was devastated to discover that the baby, which arrived weeks after the couple losing their own child, was actually her husband's.\nIt was only last autumn that Jane spoke publicly about her own sad loss, revealing that she found it difficult shooting Leanne's pregnancy scenes on the soap.\nShe said: 'I kind of feel in a good place to say it, but I actually did lose a baby a couple of years ago. So [Leanne's pregnancy] does make me quite sad.\n'I've been asked the inevitable questions over and over, \"Would you have another baby?\" and I just feel now it's a good time to say that it is close to my heart.'\nShe previously said: 'I kind of feel in a good place to say it, but I actually did lose a baby a couple of years ago. So [Leanne's pregnancy] does make me quite sad'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447790/Jane-Danson-admits-Corrie-stillbirth-storyline-helped-her.html"}
