{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-23 03:01:58","date_modify":"2018-10-23 03:01:58","date_publish":"2017-03-10 12:32:23","description":"Viewers on This Morning had little sympathy for Jane Park (pictured today), who complained that young lottery winners need more help, after she won £1million at the age of 17.","filename":"data/vaneerConsumption/JaneParkstillcomfortableafter1millionwinin2013.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E22F7A400000578-0-image-a-34_1489151510117.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301166_Jane-Park-comfortable-1million-win-2013_1540263718.html","title":"Jane Park still 'comfortable' after £1million win in 2013","title_page":"Jane Park still 'comfortable' after £1million win in 2013 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Britain's youngest EuroMillions winner says she is 'comfortable just now' but won't rule out going back to work one day - as she complained young winners need more help.\nSpeaking to Eamonn Holmes and Ruth Langsford on This Morning today, Jane Park discussed winning £1million at the age of 17 and how it left her feeling 'lonely' at such a young age.\n'I just feel like at 17 you're still in school or you've just left and you're at that stage in your life when it comes to what chapter you're going down next and you just need more help,' she said.\nScroll down for video\nBritain's youngest EuroMillions winner says she is 'comfortable just now' but won't rule out going back to work as she appeared on This Morning today (pictured on the sofa, left, and leaving the studio, right)\nShe was slammed on social media today, with viewers having little sympathy for her complaints that the win had 'ruined her life'\nBut when asked if suggestions she had flitted her winnings away were true, she admitted: 'I've got strong financial advisers and they advise me of where my money should go to make it work for me.'\nShe added: 'I'm quite optimistic, I'm always wanting to learn new things, I'm just excited now. I'm comfortable just now, I don't have to work, that's not me saying I'll never go back to work again.'\nMiss Park explained how she was so young when she won that organisers who handed her the cheque in a public announcement put Irn-Bru in her champagne flute as they celebrated.\nAsked about looking after the money since the win in 2013, she added: 'I think it's just about investing wisely and keeping an eye on it.'\nMiss Park, who has 34FF surgically enhanced breasts, also hinted that rumours she was seeing X-Factor star Sam Callahan were true\nDuring the interview on ITV this morning, she received little sympathy for her plight on social media, with one viewer writing: 'The real struggle of winning a million pounds at 17 #prayforjane #ThisMorning.'\nAnother wrote: 'Stupid girl doesn't know real problems. Starving people out there and she's complaining how winning the lottery ruined her life #ThisMorning.'\nJane Park, who got an 18-month ban for drink driving this week after being arrested at a McDonald's drive-through in her BMW, talked about buying a VW Beetle, then a purple Range Rover and a BMW since she won.\nShe was not asked about the conviction just days ago, leading some viewers to question why after the TV appearance.\nThe interview comes after she revealed she was considering legal action against Camelot, who run the National Lottery, in February, claiming that the win had 'ruined my life'.\nShe said today that she can 'understand' why some people are unsympathetic, adding: 'I'm not saying that I wish I had never won it, there are days when it is the best thing ever...'\nMiss Park also confirmed she is 'seeing someone', just days after rumours surfaced this week that she is dating former X-Factor singer Sam Callahan.\nJane Park, who got an 18-month ban for drink driving this week (pictured outside court) after being arrested at a McDonald's drive-through in her BMW, talked about buying a VW Beetle, then a purple Range Rover and a BMW since she won\nAsked about men, she said: 'I've got such a big guard for guys, I've been in previous relationships that just haven't worked and with new guys I never know what their intentions are. It can be difficult. I've got my options open but I'm seeing someone, early days.'\nThis week it was claimed that she has been dating former X-Factor star Sam Callahan after striking up a relationship by liking each other's pictures on social media.\nShe talked to the hosts about being too young to drink when she won the money and was given Irn-Bru instead of champagne\nA friend told The Sun Online: 'They've made no secret of how attracted they are to each other and have been on a couple of dates already. It's very early days yet but there's a real connection between them.'\nThe singer has liked numerous pictures of the lottery winner, who regularly poses on social media with revealing photos that make the most of her 34FF breasts, which she had surgically enhanced after winning the money.\nShe has also liked various pictures of Callahan, a fitness enthusiast with 260,000 followers, who shows off his muscle-bound physique on Twitter.\nWhen she won the lottery in 2013, Miss Park vowed to spend it on a customised white Range Rover with pink trim, a season ticket for her beloved Hibernian football team and a holiday in Ibiza with her friends.\nShe bought herself a house in Prestonpans, Scotland, for £169,995 but recently sold it at a £20,000 profit after four years because she wanted to move back in with her mother after feeling lonely living alone.\nMiss Park has previously bought a VW Beetle, a BMW, a purple Range Rover and is now shopping for a Mercedes. A friend said she would consider the £30,000-£50,000 a chauffeur would cost 'money well spent'.\nThe lottery winner has hit the headlines numerous times over the years, flashing her 34FF breasts on a Halloween night out in November last year.\nLast month she claimed she was considering legal action against Camelot, claiming her life would have been '10 times better' had she not won the money at such a young age.\nIt is also rumoured that she will appear on the next series of Love Island.","url":"https://www.dailymail.co.uk/news/article-4301166/Jane-Park-comfortable-1million-win-2013.html"}
