{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-22 22:09:13","date_modify":"2018-10-22 22:09:13","date_publish":"2016-01-11 02:37:59","description":"Clad in a furry teddy bear-style hat, the actor joined his 22 Jump Street co-star Channing Tatum to present the first award of the night at the ceremony, for Actress in a Supporting Role in a Motion Picture.","filename":"data/vaneerConsumption/JaneFondashootsunimpressedlookatChanningTatumatGoldenGlobes2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300AF41200000578-0-image-a-233_1452522123052.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393271_Jane-shoots-unimpressed-look-Channing-Tatum-Jonah-Hill-s-bear-gag-Golden-Globes_1540246153.html","title":"Jane Fonda shoots unimpressed look at Channing Tatum at Golden Globes 2016","title_page":"Jane Fonda shoots unimpressed look at Channing Tatum at Golden Globes 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Much has been written about the interaction between Leonardo DiCaprio and the bear in his new drama film The Revenant.\nAnd, poking fun at the rumours - which claimed that the actor's character was raped by the animal - Jonah Hill dressed as a bear for his on-stage stint at the Golden Globes on Sunday.\nClad in a furry teddy bear-style hat, the actor joined his 22 Jump Street co-star Channing Tatum to present the first award of the night at the ceremony, for Actress in a Supporting Role in a Motion Picture.\nScroll down for video\nBear skills: Jonah Hill poked fun at the infamous rumoured bear rape scene in The Revenant as he rocked up in a teddy bear hat on stage during the Golden Globes on Sunday, along with Channing Tatum\nAfter arriving on stage alone, Channing called up his colleague, who rocked up wearing the teddy bear hat.\nAs the two broke into a fit of giggles, Jonah - who appeared with Leonardo in The Wolf Of Wall Street - claimed to have played the bear who attacks the leading man in the gruesome scene in the revenge thriller, which one a handful of top awards on the night.\n'I’ve notoriously done zero press for the film,' he said. 'I’m a Daniel Day or Tom Hardy type of actor who doesn’t like my face out there very much.'\nHe also jokingly thanked the film's director Alejandro González Iñárritu for casting 'a two year old bear from the Sierra mountains'.\nIt was first claimed back in December that Leo's on-screen alter-ego was raped two times by the female bear.\nFoul-mouthed: As Leonardo DiCaprio's former Wolf Of Wall Street co-star made jokes about being The Revenant's bear, much of his speech was bleeped out due to the use of expletives\nIt's not a thing: Although it was widely reported in December that Leo's character Hugh Glass was 'raped twice' by a bear, these claims were quickly strenuously denied by the studio\nAccording to Drudge Report, 'the bear flips Leo over and thrusts and thrusts during the explicit mauling.'\nHowever, these claims were swiftly denied by Fox, the studio behind the project, as a statement read: 'As anyone who has seen the movie can attest, the bear in the film is a female who attacks Leo's character Hugh Glass because she feels he might be threatening her cubs.\n'There is clearly no rape scene with a bear.'\nMeanwhile, a lot of the rest of Jonah's speech was deemed too expletive-laden for broadcast, with the rest of it almost entirely bleeped out.\nChildish: As the two broke into a fit of giggles, Hill claimed to have played the bear who attacks Leo in the gruesome scene in the revenge thriller\nSilly humour: He also jokingly thanked the film's director Alejandro González Iñárritu for casting 'a two year old bear from the Sierra mountains'\nAccording to Us Weekly, producers decided to mask much of the speech as he used the word f**k frequently throughout.\nAlthough TV viewers at home were unable to get the full scope of his banter, nominated actress Jane Fonda was visibly shocked by his tirade.\nWhen the camera cut to the 78-year-old actress - who was waiting to find out if she landed a gong her her acclaimed turn in Youth - all it found was one stone faced stare.\nMeanwhile her boyfriend Richard Perry, seated to her left, looked even more confused, with his mouth agape.\nBecause much the speech was bleeped out because of profanity, it is unknown if the four-time Golden Globe winner was specifically the butt of a joke, or she just couldn't understand why people were laughing.\nIf looks could kill: Jane Fonda shot a very unimpressed look at the comedy duo's bear gag during the ceremony\nDoesn't get it: Because much of Hill's speech was bleeped out because of profanity, it is unknown if the four-time Golden Globe winner was specifically the butt of a joke, or she just couldn't understand why people were laughing\nTwitter was quick to pick up on it however, with dozens of viewers instantly tweeting grabs of her icy glare - with many of them proclaiming her expression summed up how everyone else felt about the skit.\nAfter congratulating Tatum on Magical Mike, he continued: I would just like to add, there's a few studio heads that I would like to take a swipe at... I'm just kidding... I am a bear though, you have to keep that in mind.'\nThe supporting actress award eventually went to Kate Winslet for Steve Jobs.\nNoticed: Twitter was quick to pick up on it however, with dozens of viewers instantly tweeting grabs of her icy glare - with many of them proclaiming her expression summed up how everyone else felt about the skit","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393271/Jane-shoots-unimpressed-look-Channing-Tatum-Jonah-Hill-s-bear-gag-Golden-Globes.html"}
