{"authors":[],"date_download":"2018-10-30 00:50:52","date_modify":"2018-10-30 00:50:52","date_publish":"2018-07-19 00:05:40","description":null,"filename":"data/vaneerConsumption/JanusIsOnlytheBeginning.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/1024px-California_Governor_Jerry_Brown_8578453890.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860652.html","title":"Janus Is Only the Beginning","title_page":"Janus Is Only the BeginningThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Sacramento\nThe U.S. Supreme Court’s recent ruling in the Janus v. AFSCME case has heartened conservatives throughout the nation, especially in non-right-to-work states such as California that require public employees to pay dues to their respective unions. Janus will, over time, reduce the power of these unions as they are forced to spend more time wooing members — and they will have less disposable cash to control state legislatures and city councils.\nThe 5-4 decision, with Donald Trump appointee Neil Gorsuch providing the crucial winning vote, has been described by union activists as an assault on their well-being. That’s good news. The majority has struck down the requirement that government employees pay dues to unions, even for collective-bargaining purposes. Since 1977, those employees could withhold dues from direct political purposes but still had to subsidize contract-related activities.\nBut why should an employee be forced to subsidize, say, the California Teachers’ Association’s or SEIU’s collective-bargaining efforts if that employee believes that those negotiations will undermine the quality of public services and unfairly strain public budgets? It is indeed a form of compelled speech to require any dues, as the court explained, and we should be thrilled at the new legal reality, especially from a freedom-of-conscience perspective.\nBut the heartening news should be tempered by reality: Unions already are gaining special organizing privileges. The California Legislature, for instance, has passed several laws that allow unions access to the job site to persuade government workers to remain members. Others make it tough for conscientious objectors to rescind their dues. Furthermore, unions remain the most powerful interest groups at the municipal level. And while some government employees will resist union membership, most of them will continue to support these groups.\nLike all political and legal victories, this one has simply — but importantly — sparked new battles, albeit on more level playing fields. In California, the main obstacle to every manner of reform is the power of public-employee unions. Unfunded pension liabilities are the result of these unions, which have secured six-figure pension payouts for government workers. The state’s crumbling infrastructure is the result of unions that have driven up the cost of road and bridge building here because of inflated salaries and opposition to outsourcing. The awful public schools are the result of union-secured tenure protections that keep bad teachers in the classroom.\nAnd the craziness continues. Here’s a headline from Sunday’s Los Angeles Times regarding some government employees: “Workers claim injuries all over their bodies for big payouts — but continue their active lives.” As the news story explained, workers’ compensation “claims involving at least five injured body parts have become by far the most common in California….” Basically, many police and firefighters are referred to doctors, who rack up the number of injuries for which they are entitled to gain public benefits. According to people quoted in the article, the Arnold Schwarzenegger administration had capped the amount that would be paid per body part. Since then the number of injured body parts has proliferated.\n“The strategy is common among veteran cops and firefighters who get up to a year off at their full salary, tax free, for each job-related injury their doctor diagnoses. Their employers also pay the associated medical bills and often a hefty cash settlement based on the extent and severity of the injuries, a cut of which goes to the injured officer’s attorney,” according to the newspaper.\nConsider that these are high-paid jobs in California, with salaries and pensions that often top $100,000 and even $200,000. Is it any wonder California continually raises taxes to maintain its already poor level of public service? Is it a surprise that nothing can ever be done about pay and benefit deals given that unions — especially public-safety unions — have such a hold on lawmakers?\nWe need to keep our expectations in line. Don’t get me wrong: Janus is a huge victory and the unions are smarting from it, but it will take other efforts to roll back the current level of pay and benefits, halt the pension-spiking deals and other giveaways, and get rid of the protections that make it impossible to get rid of public employees.\nOne of the most promising developments toward that end comes in an upcoming California Supreme Court case called Cal Fire Local 2881 v. the California Public Employees’ Retirement System. That case involves something known as the “California Rule.” It isn’t really a rule but a series of long-standing court interpretations concluding that public employees can never have their vested benefits reduced — even going forward. No one is proposing rolling back previously earned benefits, but the only way to reform the system is to reduce benefits starting tomorrow. Currently, pension deals cannot be reworked until all current employees and retirees have passed away.\nFortunately, union overreach has pushed this matter to the state’s high court. Gov. Jerry Brown has long been a friend of public-sector unions, but in 2013 — amid a massive budget shortfall and bad publicity about the pension crisis — he passed a modest pension-reform measure that, among other things, reined in giveaways such as “airtime.” That’s when an employee purchases future retirement time at a highly discounted price. After the reform, a California fire union sued and claimed that removing this benefit was a violation of the California Rule, which means the rule itself will be evaluated by the court.\nIn an admirable legal brief, Brown’s team argued that airtime was not a vested benefit. More significantly, the administration also called for a broader rollback of the California Rule, thus reinforcing a lower-court decision finding that while public employees are guaranteed a reasonable pension, they aren’t guaranteed “one providing fixed or definite benefits immune from modification.” This week, the governor sent a letter to the court urging that it quickly take up the matter. Good for him. It’s late in his term, but it’s better than never.\nIt seems likely, but by no means certain, that the court will ultimately uphold Brown’s pension-reform law. That would really start to shift the balance of power, as local governments and state employers would be free to start shaving benefits — and not only for new hires, who won’t be retiring for 30 years into the future. The state’s pension debt and service “crowd out” (pensions are consuming local budgets to the point that they are slashing services) are real, current problems that can’t be fixed until the California Rule is gutted.\nOf course, even a good decision wouldn’t be a panacea. Reformers will have to take their battles to local governments. But that’s where the benefits of Janus will kick in, as unions will be less able to raise the money to fight the latest political battle. I’m not totally optimistic that much will change quickly, but I’m not nearly as pessimistic as I used to be.\nSteven Greenhut is Western region director for the R Street Institute. Write to him at sgreenhut@rstreet.org.","url":"https://spectator.org/janus-is-only-the-beginning/"}
