{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 00:23:01","date_modify":"2018-10-23 00:23:01","date_publish":"2017-03-10 06:42:23","description":"The 39-year-old actress wants to find love on The Bachelorette.","filename":"data/vaneerConsumption/JanuaryJonessaysshedreamsofbecomingTheBachelorette.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/06/3E20665900000578-0-image-a-115_1489127488394.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300146_January-Jones-says-dreams-Bachelorette_1540254181.html","title":"January Jones says she dreams of becoming The Bachelorette","title_page":"January Jones says she dreams of becoming The Bachelorette | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"January Jones wants to find love on The Bachelorette.\nThe 39-year-old former Mad Men actress - who has a five-year-old son, Xander - during a chat show appearance Wednesday said she has been 'grooming' herself for the ABC reality show.\nJanuary said she liked the idea of dating former The Bachelor star Ben Higgins, but her publicist insisted she would 'ruin' her career if she ever took her reality TV dream seriously.\nReality dream: January Jones during a chat show appearance Wednesday said she dreams of being the Bachelorette\nShe told The Late Late Show host James Corden that's she's been preparing: 'I'm grooming myself for [The Bachelorette] now. I asked my publicist.'\n'I watch the show, have a couple of glasses of wine, Ben gets kicked off and I'm like -- ''Oh, I'm going to be the next Bachelorette and get that guy.''\n'And then [my publicist] says I would ruin my career. I get shot down. But that's my dream!,' she insisted.\nJanuary admitted she would like Ben to call her if he was watching, but suggested she's actually more interested in current Bachelor star Nick Viall.\nHer favorite: Nick Viall, shown last month in New York City, was singled out by January as her favorite\nShe said: '[Ben] is not even my favorite. Nick's pretty cute...'\nJanuary earlier this year admitted she is attracted to 'dirty' younger men.\nShe told Red Magazine: 'The moment I see someone I think is cute, I Google him and oh, he's 25, and I'm thinking, 'What's my problem?'\n'My sister too. She lives in LA and we both like tattoos, guitar, kinda dirty...'\nCareer move: January said that her publicist shot down her dream of being the Bachelorette\nLate night: The Late Late Show host James Corden welcomed January and Samuel L. Jackson as guests\nAnd as well as worrying about the emotional connection, January said she was unsure of the physical benefits of dating a younger guy.\nShe continued: 'Is the sex great though? Do they know what they are doing? I guess you can teach them.\n'But I want a manly man in flannel with a beard and an axe. But there's always something wrong. Like, he's a Republican.'\nTell all: Rachel Lindsay who will be the next Bachelorette appeared on the recent Women Tell All special with Nick","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300146/January-Jones-says-dreams-Bachelorette.html"}
