{"authors":["Associated Press"],"date_download":"2018-10-22 23:56:43","date_modify":"2018-10-22 23:56:43","date_publish":"2016-01-28 13:14:31","description":"The experimental X-2 is expected to make its maiden test flight in February and has radar-resistance features, including a canopy with special stealth-enhancing coating, and mobility.","filename":"data/vaneerConsumption/Japanunveilsstealthplanemaycombinewithnextgenjet.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:17d18f23c77a4153a6ca54be5ad056d0-4vVdYopwYQ7f641721b07ad9a18a-256_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-3420801_Japan-unveils-stealth-plane-combine-gen-jet_1540252603.html","title":"Japan unveils stealth plane, may combine with next-gen jet","title_page":"Japan unveils stealth plane, may combine with next-gen jet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Japan has unveiled its first homemade stealth plane.\nThe experimental X-2 is expected to make its maiden test flight in February, and boasts radar-resistance features, including a canopy with special stealth-enhancing coating.\nDefense officials said the aircraft is designed to test the stealth technology that would possibly be combined with the next-generation fighter jet, replacing the fleet of F-2 fighters as early as 2028.\nThe experimental X-2 is expected to make its maiden test flight in February and has radar-resistance features, including a canopy with special stealth-enhancing coating, and mobility.\nWHO ELSE HAS STEALTH JETS? The U.S. has flown stealth aircraft since the 1980s. Russia flew its first stealth fighter in 2010 and China followed a year later, though each country’s programs have experienced delays and other setbacks.\nIt comes as Japan tries to catch up on the technology and enhance its reconnaissance and intelligence capabilities as China expands its own military presence in the region.\nIt would become the fourth nation to test fly its own stealth jet, a move that could further antagonize neighboring Asian countries who have opposed Prime Minister Shinzo Abes bid to strengthen the role of its armed forces.\nRussia flew its first stealth fighter in 2010 and China followed a year later, though each country’s programs have experienced delays and other setbacks.\nThe U.S. has flown stealth aircraft since the 1980s.\nThe red-and-white aircraft, with a 14-meter (45-foot) -long fuselage and 9-meter (30-foot) -long wingspan, sat inside a hanger at the Nagoya Airport in central Japan.\nLed by Mitsubishi Heavy Industry, the stealth plane comes with radar-resistance features, including a canopy with special stealth-enhancing coating, and mobility.\nThe red-and-white aircraft, with a 14-meter (45-foot) -long fuselage and 9-meter (30-foot) -long wingspan, sat inside a hanger at the Nagoya Airport in central Japan.\nThe X-2—previously known as ATD-X, for Advanced Technology Demonstrator X—was manufactured by Mitsubishi Heavy Industries for the the Japan Air Self-Defense Force.\n'I cannot go into details, but we recognize it is technologically at a very high level,' said Takahiro Yoshida, an official in charge of the project at the Acquisition, Technology & Logistics Agency of the Defense Ministry.\nThe 40 billion yen ($340 million) project began in 2009.\nDefense Ministry officers stand in front of the first domestically-made stealth aircraft, X-2, at Nagoya Airport in Toyoyama town, central Japan.","url":"https://www.dailymail.co.uk/sciencetech/article-3420801/Japan-unveils-stealth-plane-combine-gen-jet.html"}
