{"authors":["Associated Press"],"date_download":"2018-10-22 22:36:09","date_modify":"2018-10-22 22:36:09","date_publish":"2017-04-26 04:55:20","description":"TOKYO (AP) - Japan's disaster reconstruction minister resigned over his remark that \"it was good\" that the March 2011 quake and tsunami had hit northern...","filename":"data/vaneerConsumption/Japanministerresignsoverremarkabout2011tsunami.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/05/wire-463369-1493182230-119_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446272_Japan-minister-resigns-remark-2011-tsunami_1540247769.html","title":"Japan minister resigns over remark about 2011 tsunami","title_page":"Japan minister resigns over remark about 2011 tsunami | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TOKYO (AP) - Japan's disaster reconstruction minister resigned over his remark that \"it was good\" that the March 2011 quake and tsunami had hit northern Japan instead of areas closer to Tokyo.\nPrime Minister Shinzo Abe accepted Masahiro Imamura's resignation Wednesday.\nImamura was replaced by Masayoshi Yoshino, former deputy environment minister from Fukushima, which was also hit by radiation leaks from a tsunami-hit nuclear power plant. Nobody died from radiation, but overall, the tsunami and the quake killed more than 18,000 people across northern Japan.\nMasahiro Imamura bows while speaking to journalists after submitting his resignation from his post, disaster reconstruction minister, to Prime Minister Shinzo Abe at Abe's official residence in Tokyo Wednesday, April 26, 2017. Imamura resigned over his remark that \"it was good\" that the March 2011 quake and tsunami had hit northern Japan instead of areas closer to Tokyo. Abe accepted Imamura's resignation. (Toshiyuki Matsumoto/Kyodo News via AP)\nImamura's resignation comes a day after he made the remark in a speech at a ruling party reception, which Abe also attended.\n\"It was good that (the disaster) hit the Tohoku region, up there. There would have been a massive, enormous damage had it occurred closer to the capital region,\" Imamura said, according to Kyodo news.\nImamura immediately retracted the comment and apologized, but Abe's face reportedly froze.\nImamura came under fire earlier this month over his outburst and a suggestion during a news conference that those who left voluntarily following the meltdown at the Fukushima nuclear plant should fend for themselves.\nHis blunder is the latest in a string of remarks and scandals that have plagued Abe's government in recent months, prompting opposition lawmakers to step up their effort to weaken Abe's grip on power.\nIn March, Abe's reconstruction adviser, who was criticized for having his underling carry him on the back to hop over a puddle while visiting a flooded town, resigned after making a joke over rubber boots.\nImamura's predecessor faced allegation he stole female underwear. Also, earlier this month, a trade vice minister was forced to quit over an adultery scandal.\nMasahiro Imamura speaks to journalists after submitting his resignation from his post, disaster reconstruction minister, to Prime Minister Shinzo Abe at Abe's official residence in Tokyo Wednesday, April 26, 2017. Imamura resigned over his remark that \"it was good\" that the March 2011 quake and tsunami had hit northern Japan instead of areas closer to Tokyo. Abe accepted Imamura's resignation. (Toshiyuki Matsumoto/Kyodo News via AP)\nMasahiro Imamura is surrounded by journalists after submitting his resignation from his post, disaster reconstruction minister, to Prime Minister Shinzo Abe at Abe's official residence in Tokyo Wednesday, April 26, 2017. Imamura resigned over his remark that \"it was good\" that the March 2011 quake and tsunami had hit northern Japan instead of areas closer to Tokyo. Abe accepted Imamura's resignation. (Toshiyuki Matsumoto/Kyodo News via AP)\nJapanese Prime Minister Shinzo Abe, left, walks to meet Masayoshi Yoshino, newly appointed minister for Reconstruction, at the prime minister's official residence in Tokyo, Wednesday, April 26, 2017. Japanese Disaster Reconstruction Minister Masahiro Imamura has resigned over his remark that \"it was good\" that the March 2011 quake and tsunami had hit northern Japan instead of areas closer to Tokyo. Imamura was replaced by Yoshino. (AP Photo/Eugene Hoshiko, Pool)\nMasayoshi Yoshino, left, newly appointed minister for Reconstruction, walks to meet Japanese Prime Minister Shinzo Abe at the prime minister's official residence in Tokyo, Wednesday, April 26, 2017. Japanese Disaster Reconstruction Minister Masahiro Imamura has resigned over his remark that \"it was good\" that the March 2011 quake and tsunami had hit northern Japan instead of areas closer to Tokyo. Imamura was replaced by Yoshino. (AP Photo/Eugene Hoshiko, Pool)","url":"https://www.dailymail.co.uk/wires/ap/article-4446272/Japan-minister-resigns-remark-2011-tsunami.html"}
