{"authors":["John Hayward"],"date_download":"2018-10-30 20:40:29","date_modify":"2018-10-30 20:40:29","date_publish":"2016-08-09 00:39:59","description":"Japan filed a protest against China, as six Chinese coast guard ships were spotted in the disputed Senkaku Islands.","filename":"data/vaneerConsumption/JapanFilesProtestAgainstChinesePresenceInDisputedIslands.json","image_url":"https://media.breitbart.com/media/2016/08/Senkaku-Islands-East-China-Sea-ap.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_08_08__1540932029.html","title":"Japan Files Protest Against Chinese Presence In Disputed Islands","title_page":"Japan Files Protest Against Chinese Presence In Disputed Islands","title_rss":"NULL","source_domain":"breitbart.com","text":"Japan filed a protest against China over the weekend, as six Chinese coast guard ships were spotted among a fleet of over 200 fishing boats in the disputed Senkaku Islands.\nChina also claims these islands, along with most of the South China Sea region. As Voice of America News notes, it is not illegal for Chinese vessels to operate in the Senkaku chain (which China calls the Diaoyu Islands.)\nHowever, Japan’s Foreign Ministry complained that least three of the Chinese coast guard ships sported gun batteries. Adding to the tension, China conducted a major combat air patrol over the region on Saturday, which by its own account included jet fighters and bombers.\nThe Wall Street Journal reports that Japan filed multiple protests with China, one of them concerning a powerful radar and camera surveillance system installed on an offshore gas-drilling platform in the East China Sea.\nJapan said it “cannot accept” the presence of this system and called for its “immediate removal.”\n“This series of actions by the Chinese side is a one-sided escalation that significantly raises tensions at the scene, and we absolutely cannot accept it,” Japan’s Vice Minister for Foreign Affairs, Shinsuke Sugiyama, said on Sunday.\n“We strongly hope that the Japanese side will honor its principled agreement with us, [and] deal with the current situation with a cool head instead of taking actions that may raise tension or make things complicated,” the Chinese Foreign Ministry declared through its website.\nReuters reports China also repeated that it claims “indisputable sovereignty” over the islands, despite a major international court ruling against it last month.\nOn Monday, Japan’s Chief Cabinet Secretary, Yoshihide Suga, said Japan would respond “firmly and calmly” to China’s actions. Reuters cites a source within the government who said Japanese patrols in the region were being increased, in response to China’s activity.\nChina’s state-run news service, Xinhua, was unsurprisingly contemptuous of Japan’s posture, accusing the Abe administration of “playing up the ‘China Threat’ for its own right-wing agenda,” which includes “easier arms trade, weaker civilian control over the military,” and “controversial security bills.”\nXinhua accused Japan of being the nation with a record of “stirring up regional trouble and enmity wherever and whenever it can.\n“The Abe administration is inching closer to its dream of replacing the country’s pacifist constitution with… a different kind of constitution,” Xinhua wrote ominously.\nAdding to regional tensions are China’s criticisms of Japan’s new Defense Minister, Tomomi Inada, for allegedly refusing to admit Japan massacred Chinese civilians during World War II; South Korea’s alarm over recent missile launches by China’s feral client North Korea; and China’s objection to the installation of American anti-missile systems in South Korea to protect against North Korean threats. The South Koreans have urged China to exercise more control over the Kim regime in North Korea.","url":"https://www.breitbart.com/national-security/2016/08/08/japan-files-protest-large-chinese-presence-disputed-islands/"}
