{"authors":[],"date_download":"2018-10-22 23:55:19","date_modify":"2018-10-22 23:55:19","date_publish":"2017-03-10 04:58:10","description":"The US and Japanese navies said Friday they completed a four-day joint exercise in the East China Sea, as tension intensifies in the region following North...","filename":"data/vaneerConsumption/JapanUSnaviesdrillinEastChinaSea.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195469-1489143792-84_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4299992_Japan-US-conduct-navy-drill-East-China-Sea-reports_1540252519.html","title":"Japan, US navies drill in East China Sea","title_page":"Japan, US navies drill in East China Sea | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Japanese media report the aircraft carrier USS Carl Vinson is expected to join South Korea-US drills after finishing exercises with Japan\nThe US and Japanese navies said Friday they completed a four-day joint exercise in the East China Sea, as tension intensifies in the region following North Korea's missile tests.\nThe training, characterised by Japanese media essentially as a show-of-force exercise, coincided with renewed tensions in the region after North Korea's latest ballistic missile launches earlier this week.\nThe aircraft carrier USS Carl Vinson and the guided missile destroyer USS Wayne E. Meyer from the US Navy joined the Japanese destroyers Sazanami and Samidare in the East China Sea to \"increase proficiency in basic maritime skills and improve response capabilities,\" the US Navy said in a statement.\nJapan's Maritime Self-Defense Force, the country's navy, said in a separate statement that the exercises focused on \"tactical training\", without elaborating\nBut Japan's conservative Sankei Shimbun newspaper said the drill was aimed at issuing a warning against nuclear-armed North Korea by \"exhibiting the strength and deterrent power of the Japan-US alliance.\"\nThe joint drill commenced a day after North Korea launched four ballistic missiles on Monday, with three landing provocatively close to Japan, which the US is obligated to defend under a security treaty.\nPyongyang has claimed the launch was a training exercise for a strike on US bases in Japan and supervised by leader Kim Jong-Un.\nSeoul and Washington are separately carrying out annual joint military exercises in South Korea.\nThe Japan-US training was also meant to display their joint presence in the East China Sea, where Japan and China are locked in a long-running dispute over uninhabited islets, the Sankei said.\nIn Japan they are known as the Senkakus, while China claims then as the Diaoyus.\nSuccessive US administrations have assured Japan that the islands fall under their security treaty, meaning if they are attacked the US will defend them.\nThe Carl Vinson was expected to join the South Korea-US drills after the exercise with Japan, the Sankei said.\nThe two sets of exercises come as US Secretary of State Rex Tillerson is set to visit South Korea, Japan and China next week for his first trip to the region since he became President Donald Trump's top diplomat.\nNorth Korea missile launch\nThe US Pacific Command said Monday that the Americans had begun deploying the THAAD anti-system to South Korea, which is designed to defend the US ally from a North Korean attack.\nThe deployment has outraged Pyongyang ally China, which strongly opposes it as a challenge to its security ambitions in the region.\nChina responded that it was \"firmly opposed\" to the deployment and vowed to \"resolutely take necessary measures\" to defend its security interests.\nChina has argued that the deployment would further destabilise the situation on the Korean peninsula.","url":"https://www.dailymail.co.uk/wires/afp/article-4299992/Japan-US-conduct-navy-drill-East-China-Sea-reports.html"}
