{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-30 23:59:47","date_modify":"2018-10-30 23:59:47","date_publish":"2018-07-12 00:00:00","description":null,"filename":"data/vaneerConsumption/Japaneseyenisntbehavinglikeasafehavencurrency.json","image_url":"https://amp.businessinsider.com/images/5b47e9dff4af9c1c008b46e2-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_japanese-yen-isnt-behaving-like-a-safe-haven-currency-2018-7_1540943987.html","title":"Japanese yen isn't behaving like a safe-haven currency","title_page":"    Japanese yen isn't behaving like a safe-haven currency - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Yuya Shino/Getty Images\nFor a currency regarded as being a safe-haven asset, the Japanese yen hasn't been behaving like one of late.\nIt's been weakening, rather than strengthening, despite persistent and growing trade tensions between the United States and China and what appears to be a modest slowdown in the global economy after a strong and synchronized acceleration throughout 2017.\nThe USD/JPY — a proxy many regard as being a barometer of investor risk appetite — currently sits at 112.60, the highest level since mid-January.\nUSD/JPY Daily Chart Investing.com\nIt's rallied 7.7% since late March, a quite remarkable performance given the wild gyrations seen in some markets over this period, according to Mallika Sachdeva, FX Strategist at Deutsche Bank.\n\"The resilience of USD/JPY has been very surprising,\" she says.\n\"Indeed, USD/JPY has remained supported above 110 despite trade war escalation hurting global equities and risk sentiment.\"\nWhile the outlook for monetary policy settings in the US and Japan goes someway to explaining the scale of the recent move, Sachdeva thinks there's another factor that's been contributing to the USD/JPY's resilience: Japanese pension funds are hoovering up stocks abroad.\n\"Pension funds appear to like adding to equities on value corrections, accelerating purchases after sell-offs,\" she says.\n\"We saw evidence of this behaviour in Q3 2015 and Q1 2016, where pension fund buying increased when US stocks cheapened. Although the overall trend of buying in 2014-16 was driven by a shift in Government Pension Investment Fund's (GPIF) policy mix towards overseas assets, there was a notable pick-up in pension fund buying in the months after equity weakness.\n\"A similar pattern has emerged this year with the value creation in Q1 appearing to prompt risk addition in Q2.\"\nDeutsche Bank\nSachdeva suggests the GPIF may be \"finally deploying its dry powder\" abroad following recent declines in stocks abroad.\n\"We know that GPIF's holdings of short-term assets, which are mostly cash, have been growing and sat at more than $US125 billion as of March,\" she says.\n\"Their greatest scope to increase allocations to risk-assets is in foreign equities, where their latest reported investment was still slightly below the target (23.88% vs. 25%), and where the upper bound on possible investment is wide (up to 33%).\n\"If the GPIF is keen to deploy its large holdings of cash, there could be more outflows to come.\"\nSachdeva says Japanese pension fund flows have historically been influential on movements in the USD/JPY, meaning their reappearance after almost two years of absence is an important factor that may be limiting downside moves.\n\"For Japanese pension funds with steadier hands, global market weakness might be seen as a buying opportunity, dampening the dips in USD/JPY on risk-off moves,\" she says.\n\"We will be closely monitoring the weekly flows data on Japanese purchases of foreign stocks which we believe have been an important force supporting USD/JPY amidst all the noise.\"","url":"https://www.businessinsider.com/japanese-yen-isnt-behaving-like-a-safe-haven-currency-2018-7"}
