{"authors":["Sara Tan"],"date_download":"2018-10-30 23:18:53","date_modify":"2018-10-30 23:18:53","date_publish":"2014-08-13 20:30:03","description":"Lady Gaga loves Tokyo. It's her \"favorite place,\" she proclaimed on Instagram. It makes sense — her ever bizarre and colorful style seems to suit the city's avant-garde fashions perfectly. And while it appears as though she has a huge Japanese…","filename":"data/vaneerConsumption/JapaneseLadyGagaFansAreNotPleasedWithHerLatestOutfit.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/11e0af1e-94c2-4ce1-9313-912968d8f3e1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35667-japanese-lady-gaga-fans-are-not-pleased-with-her-latest-outfit_1540941533.html","title":"Japanese Lady Gaga Fans Are Not Pleased With Her Latest Outfit","title_page":"Japanese Lady Gaga Fans Are Not Pleased With Her Latest Outfit","title_rss":"NULL","source_domain":"bustle.com","text":"Lady Gaga loves Tokyo. It's her \"favorite place,\" she proclaimed on Instagram. It makes sense — her ever bizarre and colorful style seems to suit the city's avant-garde fashions perfectly. And while it appears as though she has a huge Japanese fanbase, the pop star's recent ensemble faux-pas has made some of them really, really upset. According to Kotaku, Lady Gaga instagrammed two photos of herself in Japan wearing a bright jumpsuit with Korean characters on it. While that might not seem like a big deal, this really did not sit well with some of her Japanese followers.\nDisgruntled fans took to 2ch, the country's most popular online forum website, to voice their disappointment. There's even a thread called, \"Lady Gaga, Who's Visiting Japan, Is Wandering Around Roppongi in Clothes with Korean Characters. This Proves That From the White Person's Point of View, Japan and Korea are the Same.\" Kotaku translated some of the comments, which include remarks like, \"Wearing clothes with Korean characters and sauntering about Roppongi is giving hate to Japan\" and \"Yep, just a dumb American.\" Eek! Japanese fans be pissed!\nI'm certainly no expert on what's happening with Japanese-South Korea relations at the moment, but according to The Diplomat, things are not going so well right now. Of course, beyond that, the two countries have always had a rather complicated relationship. As a result, the Japanese fans are accusing Lady Gaga of mixing them up, when the last thing they want in the world is for people to think they're Korean (and vice versa).\nAs an Asian person, I can definitely tell you how aggravating it can be to have some ignorant person lump you together with the rest of the continent. However, I think Lady Gaga is completely innocent in this situation. I do not believe she is a racist and I'm confident she knows the difference between Japan and Korea. It's not as if she said, \"I love my new Japanese clothes that I am wearing in Japan\" or something blatantly uniformed. She is fully allowed to wear a jumpsuit with Korean characters in Japan as freely as she wants. Still, perhaps she should've been a little more sensitive to the situation and opted for a more neutral outfit (or at least crossed her arms to cover the characters).\nImage: LadyGaga/Instagram","url":"https://www.bustle.com/articles/35667-japanese-lady-gaga-fans-are-not-pleased-with-her-latest-outfit"}
