{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:41:00","date_modify":"2018-10-30 20:41:00","date_publish":"2015-12-28 14:04:06","description":"Japan says that armed Chinese ship infiltrates its territorial waters; Japan aggressively expands its military defense of the Senkaku Islands","filename":"data/vaneerConsumption/JapanSaysArmedChineseShipInfiltratesItsTerritorialWaters.json","image_url":"https://media.breitbart.com/media/2015/06/ap_ap-photo1490-e1451311237368.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_12_28__1540932060.html","title":"Japan Says Armed Chinese Ship Infiltrates Its Territorial Waters","title_page":"Japan Says Armed Chinese Ship Infiltrates Its Territorial Waters","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nJapan says that armed Chinese ship infiltrates its territorial waters\nJapan aggressively expands its military defense of the Senkaku Islands\nJapan says that armed Chinese ship infiltrates its territorial waters\nChinese coast guard patrol boats\nAccording to Japan’s coast guard, an armed Chinese coast guard vessel entered Japanese waters off the disputed Senkaku Islands for the first time on Saturday. That ship and two others had been sailing in the area since Tuesday. The Japanese government protested to the Chinese embassy in Tokyo and to China’s Ministry of Foreign Affairs in Beijing.\nChina’s sovereignty claims over islands in the South China Sea have been in the news a lot this year, but China also is in a simmering dispute with Japan over the issue of sovereignty over the Senkaku Islands (called the Diaoyu Islands by the Chinese) in the East China Sea. In 2005, the dispute became so bitter that military action was being threatened on both sides. (See “China and Japan head for military confrontation over disputed islands.”)\nIn November 2013, China escalated the confrontation by announcing the creation of an “East China Sea Air Defense Identification Zone” (ADIZ), claiming administrative responsibility for the entire East China Sea region, including the Senkaku/Diaoyu islands that have historically belonged to Japan.\nChina has been annexing regions in the South China Sea belonging to Vietnam and the Philippines without interference from the United States. But the situation in the East China Sea is potentially very different. The US and Japan have a Treaty of Mutual Cooperation and Security, signed on January 19, 1960. It commits the United States to help defend Japan if Japan came under attack, and it provides bases and ports for U.S. armed forces in Japan.\nSo the question arises whether the US would intervene militarily if China attempted to take the Senkaku Islands by military force, as it’s done in the South China Sea. In 2014, it was widely noted that the Obama administration was failing to clarify that commitment, despite several opportunities to do so.\nThen, in April 2014, President Obama visited Japan and said that the US would defend the Senkaku Islands:\nAt the same time, the United States is going to deal directly and candidly with China on issues where we have differences, such as human rights. I’ve also told [China’s] President Xi [Jinping] that all our nations have an interest in dealing constructively with maritime issues, including in the East China Sea. Disputes need to be resolved through dialogue and diplomacy, not intimidation and coercion. The policy of the United States is clear — the Senkaku Islands are administered by Japan and therefore fall within the scope of Article 5 of the U.S. — Japan Treaty of Mutual Cooperation and Security. And we oppose any unilateral attempts to undermine Japan’s administration of these islands.\nChina frequently runs patrols in territorial waters of the Senkaku Islands, but this is the first time that an armed Chinese vessel has entered waters claimed by Japan. Japan Times and Shanghaiist\nJapan aggressively expands its military defense of the Senkaku Islands\nJapan has announced an aggressive new military policy to defend the Senkaku Islands from Chinese incursions. Japan is preparing to deploy thousands of troops and build anti-aircraft and anti-ship missile batteries on 200 islands in the East China Sea located roughly 870 miles from the Japanese mainland toward Taiwan.\nThe announced follows adoption by the Japanese of new “collective defense” laws, partially departing from the pacifism that Japan adopted in its constitution after World War II. The old self-defense clause of the constitution permits military action only when Japan itself is being attacked. The new laws reinterpret the self-defense clause to include “collective self-defense,” which would permit military action under some circumstances when an ally (such as the United States) is attacked. I discussed the meaning of “collective self-defense” in detail last year in “5-May-14 World View — Japan debates ‘collective self-defense’ to protect America and Japan”.\nAlong with the collective defense laws, the Obama administration has been encouraging Japan to take greater responsibility for its own defense, in view of China’s growing military aggressiveness, reducing its dependency on the United States military. This announcement appears to be in response to the administration’s request.\nChinese ships sailing from their eastern seaboard will be forced to pass through this string of islands with its seamless barrier of Japanese missile batteries to reach the Western Pacific, access to which is vital to Beijing both as a supply line to the rest of the world’s oceans and for the projection of its naval power. Prime Minister Shinzo Abe’s broader goal is a strategy to dominate the sea and air surrounding the remote islands. Reuters and International Business Times\nKEYS: Generational Dynamics, Japan, Shinzo Abe, Senkaku Islands, collective self-defense, China, Diaoyu, Treaty of Mutual Cooperation and Security\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/12/28/world-view-japan-says-armed-chinese-ship-infiltrates-its-territorial-waters/"}
