{"authors":[],"date_download":"2018-10-22 22:33:58","date_modify":"2018-10-22 22:33:58","date_publish":"2016-01-28 10:40:58","description":"Japan's economy minister Akira Amari said Thursday he was stepping down over graft allegations, dealing a major blow to Prime Minister Shinzo Abe who faces a...","filename":"data/vaneerConsumption/JapaneconomyministerAmariquitsovergraftclaims.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g6v8-4vVdYopwYQ7f641721b07abf40c1-241_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420601_Japan-economy-minister-Amari-quits-graft-claims_1540247638.html","title":"Japan economy minister Amari quits over graft claims","title_page":"Japan economy minister Amari quits over graft claims | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Japan economy minister Amari quits over graft claims\nJapan's economy minister Akira Amari said Thursday he was stepping down over graft allegations, dealing a major blow to Prime Minister Shinzo Abe who faces a key leadership vote later this year.\n\"Considering my responsibility as a member of parliament... my duty as a cabinet member and pride as a politician, I will resign my post as of today,\" the 66-year-old told a packed Tokyo press briefing, choking back tears.\nThe surprise resignation comes a week after the veteran politician was hit by claims in a weekly magazine that he and his staff had improperly accepted a 12 million yen ($101,000) bribe from a construction firm.\nJapan's Economy Minister Akira Amari choked back tears as he announced his resignation during a press conference in Tokyo, on January 28, 2016 ©Toru Yamanaka (AFP)\nOn Thursday, Amari -- also a key face in Abe's bid to power the economy, dubbed Abenomics -- rejected claims he pocketed the money.\nHe admitted envelopes filled with cash had arrived at his office, but claimed to have ordered his secretary to deal with some of the money according to political donation rules.\nAmari added that the company refused to accept the return of some of the donations, while his secretary used about three million yen for \"private use\", without elaborating. He did not say how much was received in total.\n\"The economy is now on the verge of getting out of deflation after 15 years,\" Amari said.\n\"We need to enact a package of bills as quickly as we can to bring about a strong economy, and we need to avoid any obstacles to that -- I will not be an exception.\"\nAbe has lost three other ministers to political funding scandals since he swept to power in late 2012.\nSuch controversies are not uncommon in Japanese politics where the pork barrel reigns and rules on spending tend to be slightly opaque, barring little except explicit bribery and vote buying.\nIn 2014, two female ministers resigned over allegations that they had misspent money in what opponents insisted was an attempt to buy votes.\nLast year, farm minister Koya Nishikawa resigned after being accused of accepting illegal political funds.","url":"https://www.dailymail.co.uk/wires/afp/article-3420601/Japan-economy-minister-Amari-quits-graft-claims.html"}
