{"authors":["Associated Press"],"date_download":"2018-10-23 02:52:38","date_modify":"2018-10-23 02:52:38","date_publish":"2017-04-26 14:11:11","description":"TOKYO (AP) - Japanese Prime Minister Shinzo Abe visits Moscow on Thursday to meet with Russian President Vladimir Putin and pursue talks on joint economic...","filename":"data/vaneerConsumption/JapanPMtovisitRussiaBritainamidNorthKoreantension.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447804_Japan-PM-visit-Russia-Britain-amid-North-Korean-tension_1540263158.html","title":"Japan PM to visit Russia, Britain amid North Korean tension","title_page":"Japan PM to visit Russia, Britain amid North Korean tension | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TOKYO (AP) - Japanese Prime Minister Shinzo Abe visits Moscow on Thursday to meet with Russian President Vladimir Putin and pursue talks on joint economic projects aimed at a possible breakthrough in their decades-old island dispute.\nJapanese officials said Wednesday that North Korea is also likely to be discussed given the timing of Abe's trip, though the leaders' approaches remain different.\nJapan recently held talks with key allies the U.S., South Korea and Australia, agreeing that China and Russia are crucial in pressuring North Korea to end its nuclear and missile programs. While China is seen as more cooperative, U.S.-Russia ties have deteriorated over Syria.\nJapan and Russia both claim four islands north of Japan's northern main island of Hokkaido which came under Russian control at the end of World War II.\nThey remain at odds over the territorial dispute, but are now discussing joint development of fisheries, tourism and other areas that might help bridge the gap.\nAbe is to visit Britain next for talks with Prime Minister Theresa May. Defense cooperation, trade and Britain's exit from the European Union are among key issues to be discussed.","url":"https://www.dailymail.co.uk/wires/ap/article-4447804/Japan-PM-visit-Russia-Britain-amid-North-Korean-tension.html"}
