{"authors":["John Hayward"],"date_download":"2018-10-30 20:40:27","date_modify":"2018-10-30 20:40:27","date_publish":"2016-05-02 02:40:15","description":"Japan's Foreign Minister Fumio Kishida left for a visit to China on Friday, in a bid to restore the relationship between the two nations.","filename":"data/vaneerConsumption/JapansForeignMinisterVisitsChinatoImproveRelations.json","image_url":"https://media.breitbart.com/media/2016/04/Japan-Fumio-Kishida-China-Wang-Yi-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_05_01__1540932027.html","title":"Japan's Foreign Minister Visits China to Improve Relations","title_page":"Japan's Foreign Minister Visits China to Improve Relations","title_rss":"NULL","source_domain":"breitbart.com","text":"Japanese Foreign Minister Fumio Kishida left for a visit to China on Friday, in the opening bid to restore a damaged relationship between the two nations, even as the South China Sea grows increasingly tense.\nBloomberg News reports this is the first visit by a Japanese foreign minister to China in four and a half years, while China’s foreign ministers have not visited Japan since 2009.\nThere was a meeting between Japanese Prime Minister Shinzo Abe and Chinese President Xi Jinping one year ago, but relations are said to have decayed considerably since then. Another meeting between the two leaders at a nuclear security summit in Washington last month fell through.\n“The hiatus comes as Japan steps up its criticism of Beijing over its behavior in the South China Sea, where China has reclaimed more than 3,000 acres of land over the past two years as it builds a platform to assert its claims to more than 80 percent of the water,” Bloomberg writes. “China, for its part, regularly warns against Japanese interference in the dispute and chides the Abe government for not doing more to deal with the legacy of the country’s wartime past.”\nThe Chinese foreign minister accused Japan of dealing a “body blow” to relations between the two countries with its “wrong approach to history” last month. China’s approach to that history consisted of building a theme park based on the horrors of Japanese occupation. The version of the World War II story told in Japanese museums is considerably different.\nHowever bitterly the two nations might argue over past history, current events are fueling today’s tensions. Japan administers the Senkaku Islands, which are claimed by China, and occasionally receive tense visits from Chinese coast guard ships. Taiwan has claims on the Senkaku as well, prompting one of history’s strangest naval engagements in 2012, when Japanese and Taiwanese patrol boats fought a duel with water cannons. Ugly anti-Japanese demonstrations took place in China around the same time.\nJapan is also displeased with China’s ongoing indulgence of North Korea, which has a habit of shooting missiles in Japan’s direction, and has been attempting to develop ballistic missile technology that could do real damage to Japanese targets.\nChina wants to create as much distance between potential Pacific adversaries as possible, so it was concerned by strengthening ties between Japan and Australia, and delighted when Japan failed to secure a major Australian contract for submarines. Chinese Foreign Minister Wang Yi had specifically warned the Australians not to give the contract to Japan.\n“There is every possibility that the harsh auth­oritarian leadership under President Xi Jinping considers it has successfully bullied Australia to kowtow to its demands,” Professor Paul Dibb told The Australian, adding that Tokyo was “deeply hurt and, indeed, insulted” by losing the deal.\nThe Financial Times suggested on Friday that Chinese and Japanese leaders were somewhat constrained in their ability to mend fences, because their respective populations just plain dislike each other.\nIn fact, Chinese officials have voiced some exasperation with their own media for interfering with diplomatic efforts by whipping up too much “nationalistic coverage,” most definitely including harsh editorials directed at Japan.","url":"https://www.breitbart.com/national-security/2016/05/01/japans-foreign-minister-visits-china-improve-relations/"}
