{"authors":[],"date_download":"2018-10-22 23:54:52","date_modify":"2018-10-22 23:54:52","date_publish":"2017-03-10 04:53:10","description":"A senior Japanese politician criticised last year for being carried over flood waters while inspecting deadly typhoon damage was out of a job Friday after...","filename":"data/vaneerConsumption/Japanpiggybackofficialstepsdown.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/04/wire-194063-1489121593-328_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4299986_Japan-piggyback-official-steps-down_1540252492.html","title":"Japan 'piggyback' official steps down","title_page":"Japan 'piggyback' official steps down | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Shunsuke Mutai, Japan's parliamentary vice minister for reconstruction, resigns, March 10, 2017\nA senior Japanese politician criticised last year for being carried over flood waters while inspecting deadly typhoon damage was out of a job Friday after joking about the incident.\nShunsuke Mutai, parliamentary vice minister for reconstruction, in September visited the devastated northern town of Iwaizumi where 19 people were killed in Typhoon Lionrock.\nMutai was seen being carried piggyback-style by a younger man over streaming water while leading a central government damage assessment team.\nHe apologised at the time but on Wednesday joked at a fundraiser with supporters that the \"(rubber) boot industry made money\" -- implying that sales rose as people saw the need for such footwear.\nOn Friday, Yoshihide Suga, the government's top spokesman, said it accepted Mutai's resignation, which had been proffered the day before, over the blunder.\n\"We thought it was extremely regrettable as his comments were inappropriate, raising questions over whether he sincerely reflected on his behaviour last year,\" Suga said.\n\"We sincerely apologise to the Japanese people,\" Suga said when asked about the timing of the resignation -- the eve of the sixth anniversary of Japan's massive earthquake, tsunami and nuclear disaster on March 11, 2011.\nIn September, Mutai, clad in a blue work uniform and black shoes, was apparently trying to avoid getting his feet wet.\nMost other accompanying officials wore long rubber boots for protection.\n\"I'll be in trouble if this is caught on camera,\" Mutai was seen saying after being put down.\nDespite stepping down as a vice minister, Mutai remains a member of parliament.","url":"https://www.dailymail.co.uk/wires/afp/article-4299986/Japan-piggyback-official-steps-down.html"}
