{"authors":["Lianna Brinded"],"date_download":"2018-10-30 21:12:49","date_modify":"2018-10-30 21:12:49","date_publish":"2016-12-21 00:00:00","description":"Apparently they 'don't want to miss out' on cheap deals.","filename":"data/vaneerConsumption/JapaneseinvestmentandMAsalesinUKdespiteBrexitquittalks.json","image_url":"https://amp.businessinsider.com/images/585a424cdd0895387f8b47b5-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_japanese-investment-and-ma-sales-in-uk-despite-brexit-quit-talks-2016-12_1540933969.html","title":"Japanese investment and M&A sales in UK despite Brexit quit talks","title_page":"    Japanese investment and M&A sales in UK despite Brexit quit talks - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"LONDON — Japanese companies may have threatened to quit the UK post-Brexit but, according to a new report, they \"don't want to miss out\" on buying up lots of firms in Britain that are somewhat cheap due to sterling eroding against the Yen.\nWith only a couple of weeks to go until the end of 2016, Japanese companies spent $33.5 billion (£27 billion) to buy 37 UK-based firms, according to Dealogic data cited by The Financial Times. This is compared to 29 deals made last year worth $9.5 billion.\nThe British pound against the Yen has fallen over the last year, especially following Britain's vote to leave the European Union on June 23:\nInvesting.com\nBankers told the FT that it's a great time to buy up relatively cheap UK companies:\nHiroo Makino, managing director at DC Advisory — \"There is a lot of uncertainty following Brexit but with significant depreciation of pound against Japanese yen, Japanese companies are starting to feel that this may just be the chance that they don't want to miss out on.\"\nEdward Cole, managing partner at law firm Freshfields Bruckhaus Deringer— \"The timing now is good because from the Japanese perspective, there are certainly parts of the world where protectionism and other issues are making it harder to do deals.\n\"A number of Japanese companies have portfolios of brands that are missing a UK component, and despite some of the concerns about Brexit, they see this as a moment to correct an underweight position.\"\nJapanese companies are starting to feel that this may just be the chance that they don't want to miss out on.\nDeals over the last year have ranged from Nagatanien taking over the UK supplier of freeze dried fruits and vegetables Chaucer Foods for $130 million, all the way up to the massive $32 billion purchase of chip designer Arm Holdings by Japan's SoftBank.\nSince Britain voted to leave the EU in June, a number of international companies put investments on hold.\nJohn Veihmeyer, the global chairman of KPMG, one of the world's biggest accounting firms, confirmed this to us in an interview. However, he also noted that while there was an initial pullback in investment into the UK following the referendum, things are almost \"back to normal.\"\nMeanwhile, Japan issued a 15-page document about risks to trade with Britain in the wake of the Brexit vote and listed specific concerns and demands.\nIn addition, Japanese banks are preparing to move operations out of London in the next six months, unless they are given more clarity about Britain's Brexit ambitions. The UK government also \"assured\" massive Japanese carmaker Nissan to stay in the UK in a letter. While we don't know what was in the letter, all we know is that it persuaded Nissan to not close up shop in Britain.","url":"https://www.businessinsider.com/japanese-investment-and-ma-sales-in-uk-despite-brexit-quit-talks-2016-12"}
