{"authors":["Frances Martel"],"date_download":"2018-10-30 20:40:47","date_modify":"2018-10-30 20:40:47","date_publish":"2015-06-01 13:51:47","description":"Philippine President Benigno Aquino will land in Japan Tuesday following negotiations for new weapons trade deals and closer military ties.","filename":"data/vaneerConsumption/JapanPhilippinesForgeCloserMilitaryTiesinWakeofChineseLandGrab.json","image_url":"https://media.breitbart.com/media/2015/06/Aquino-Abe-shake-hands-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_01__1540932047.html","title":"Japan, Philippines Forge Closer Military Ties in Wake of Chinese Land Grab","title_page":"Japan, Philippines Forge Closer Military Ties in Wake of Chinese Land Grab | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Philippine President Benigno Aquino is set to land in Japan on Tuesday following initial negotiations for new weapons trade deals and closer military ties. Observers see the move as a preventative measure in the face of China’s expanded efforts in disputed South China Sea territory to build military facilities and artificial islands, violating international law.\nAquino will meet with Japanese Prime Minister Shinzo Abe during his trip, and Japanese newspaper The Mainichi reports there are plans to publicly “express concern about China’s attempts to change the status quo at sea.” The two nations are specifically looking to strike a deal for Japan to sell the Philippines P3-C patrol aircraft and radar-related equipment, Mainichi‘s sources claim, which would expand the Philippines’ capacity for surveillance over its territory in the South China Sea, specifically near the Spratly Islands.\nReuters notes that Aquino’s visit closely follows a similar meeting in Tokyo between Japanese leaders and Malaysian Prime Minister Najib Razak last week, in which the two nations also reportedly discussed trade in defense equipment. A senior Philippine official tells Reuters that the deal is already in motion, as the Philippines has “submitted a wish list to Japan, what equipment the Philippines needs urgently to boost our maritime security” in the region.\nPrime Minister Abe lowered restrictions on Japanese military trade last year, reinterpreting the self-defense restrictions on Japanese military activity not to prevent the nation from trading in military equipment with other nations. Japan still needs an official treaty to trade with the Philippines, which it already has with the United States, the UK, Australia, and France, according to Reuters.\nJapan has no territorial claims in the South China Sea but controls the Senkaku Islands in the East China Sea, which the Chinese government has attempted to claim as its own. In November 2013, the Chinese government established an Air Defense Identification Zone over the uninhabited but oil-rich Senkaku Islands, which would require Japanese vessels traveling in their own sovereign seas to identify themselves to the Chinese government or face physical force. The move outraged the international community and prompted President Barack Obama to issue an official statement that the mutual defense treaty between the U.S. and Japan covers the Senkaku Islands, which means any attack on a Japanese ship on Japanese waters would be treated as an act of war against the United States. The East China Sea has been increasingly quiet compared to the expansive construction in the Spratly Islands recently.\nNonetheless, Japan has a vested interest in helping curb Chinese expansion, and its military leaders have openly stated the nation is interested in boosting cooperation with Southeast Asia. “In order to ensure the safety of regional waters as a strategic focal point of our sea-lanes, it is with an extreme importance to enhance capabilities for maritime domain awareness and ISR (intelligence, surveillance and reconnaissance) with ASEAN countries,” Japanese Defense Minister Gen Nakatani said this weekend, referring to the Association of South-East Asian Nations.\nThe Philippines, meanwhile, is looking to expand its military options after signing a ten-year security pact with the United States in April 2014, also believed to be a preemptive measure to keep China from usurping its sovereign territory. While China’s construction in the islands was previously discovered through satellite images and done quietly, the Chinese government has taken to vocally notifying the international community of its latest constructions, holding a groundbreaking ceremony for two future lighthouses on the Spratly Islands. The lighthouses would increase China’s surveillance capability on the Philippine territory. China has also threatened to establish an Air Defense Identification Zone over the Spratlys.\n“In spite of the sufficient historical and legal evidence and its indisputable claims of rights and interests, China has exercised enormous restraint,” Sun Jianguo, deputy chief of the General Staff of the Chinese People’s Liberation Army, stated in a speech this weekend regarding the growing developments in the South China Sea. In an article on the dispute this week, Chinese state publication Xinhua claimed that “China’s sovereignty, rights and interests in the South China Sea have been consistently upheld by successive Chinese governments and established over a long history, with ample historical and legal basis.” The article does not mention non-Chinese official sources establishing the sovereignty.\nUnited States officials are calling on China to halt its “sandcastle” constructions and leave the region, noting that only China has claimed sovereignty over those islands, while the Philippines and Vietnam both have claims in the region that are mutually respected. Reports claim the United States is also considering sending military vessels to the region to protect Vietnamese and Philippine interests.\nWhile China’s Global Times newspaper has stated that “war is inevitable” with the United States over the Spratly Islands, many doubt China would take such a risk over such a small claim of land. Nonetheless, at least one Japan Times columnist, citing the Falkland Islands War, believes the risk is high because “stupid things do happen.”","url":"https://www.breitbart.com/national-security/2015/06/01/japan-to-forge-closer-military-ties-with-philippines-in-wake-of-chinese-land-grab/"}
