{"authors":["Associated Press"],"date_download":"2018-10-23 01:59:02","date_modify":"2018-10-23 01:59:02","date_publish":"2016-01-29 16:16:25","description":"TOKYO (AP) — Japan on Friday restarted a nuclear reactor that uses riskier plutonium-based MOX fuel, the first of that type to resume operations under strict...","filename":"data/vaneerConsumption/Japanrestartsnuclearreactorusingplutoniummixedfuel.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:ab2e8e31b58e46c0ac541b5bf7b08ed3-4PuZeKVXE7cd9005b2c876c20c53-404_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422749_Japan-restarts-nuclear-reactor-using-plutonium-mixed-fuel_1540259942.html","title":"Japan restarts nuclear reactor using plutonium-mixed fuel","title_page":"Japan restarts nuclear reactor using plutonium-mixed fuel | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Japan restarts nuclear reactor using plutonium-mixed fuel\nTOKYO (AP) — Japan on Friday restarted a nuclear reactor that uses riskier plutonium-based MOX fuel, the first of that type to resume operations under stricter safety rules introduced after the 2011 Fukushima disaster.\nJapan's large stockpile of plutonium has raised international nuclear security concerns, and the government has come up with the idea of burning it in reactors to reduce the amount.\nThe No. 3 reactor at Takahama nuclear plant in western Japan, operated by Kansai Electric Power Co., went back online Friday. Dozens of people protested outside the plant in Fukui prefecture, where preparations for a restart of another reactor, No. 4, are also underway.\nPolice officers stand guard near No. 3 nuclear reactor, bottom, at Takahama nuclear power station in Takahama town in Fukui prefecture, northwestern Japan Friday, Jan. 29, 2016. Japan has restarted a nuclear reactor that burns plutonium-based fuel for power generation, first under the post-Fukushima safety rules.(Kyodo News via AP) JAPAN OUT, MANDATORY CREDIT\nFukui has more than a dozen reactors, the biggest concentration in one prefecture, causing safety concerns for neighbors including Kyoto and Shiga, whose Lake Biwa is a major source of drinking water for western Japan.\nTwo reactors that use conventional uranium fuel were restarted last year in southern Japan.\nJapan started burning MOX, a plutonium-uranium hybrid fuel, in some of its conventional reactors in 2009. Experts say conventional reactors can safely burn MOX for up to one-third of their fuel, but it emits more radiation and could interfere with control rods when they are needed to suppress the nuclear chain reaction.\nJapan has enough plutonium, mostly from reprocessed spent fuel, to make 6,000 bombs.\nNearly five years since a massive earthquake and tsunami caused meltdowns at the Fukushima Dai-ichi nuclear plant, about 100,000 people still cannot return to nearby areas. Workers at the plant continue to struggle with its decommissioning, which will take decades.\nAiming to help business by generating energy, Japan's government is pushing to restart as many reactors as possible after they are deemed safe. Forty remaining workable reactors are still offline for safety checks.\n___\nFollow Mari Yamaguchi on Twitter at twitter.com/mariyamaguchi\nHer work can be found at http://bigstory.ap.org/content/mari-yamaguchi","url":"https://www.dailymail.co.uk/wires/ap/article-3422749/Japan-restarts-nuclear-reactor-using-plutonium-mixed-fuel.html"}
