{"authors":["Nelson Groom For Daily Mail Australia"],"date_download":"2018-10-23 03:50:53","date_modify":"2018-10-23 03:50:53","date_publish":"2017-03-16 14:57:15","description":"Fascinating images have surfaced from inside Japan's oldest 'love doll' factory Orient Industry, where $6,000USD human-sized silicone mannequins have been manufactured since 1977.","filename":"data/vaneerConsumption/JapanesefactoryOrientIndustrymakeslifelikelovedolls.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54025700000578-0-image-a-64_1489673546959.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320354_Japanese-factory-Orient-Industry-makes-lifelike-love-dolls_1540266653.html","title":"Japanese factory Orient Industry makes lifelike love dolls","title_page":"Japanese factory Orient Industry makes lifelike love dolls | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It could be a scene from a dystopian science-fiction movie: rows of hauntingly lifelike heads lined up on shelves.\nBut this is a working day like any other for staff at Japan's oldest 'love doll' factory Orient Industry.\nThe realistic human-sized silicone mannequins have been manufactured in the eastern Tokyo factory since 1977.\nImages show one make-up artist applying mascara to the life-sized dolls, as another puts the finishing touches on a row of bodies hanging from metal hooks.\nScroll down for video\nHeads of love dolls are seen on the shelf inside Japan's oldest 'love doll' maker Orient Industry\nA factory worker puts the finishing touches on a row of bodies hanging from metal hooks\nMake-up painters prepares the heads of the love dolls, which costs up to 600,000JPY ($6,000USD)\nThe factory produces approximately 500 life size hand-made dolls per year, and one doll costs up to 600,000JPY ($6,000USD),\nIt takes four to five weeks for the body parts to be pieced together like a puzzle to shape the dolls.\nThe more expensive models are made of silicon and boast up to 35 movable joints.\nThe process includes casting, airbrush painting, and other detailed touches that bring the dolls to life.\nThe company was originally marketing love dolls for disabled people who might find it harder to find a partner.\nOrient Industry continues to support the disabled community by providing discounts and consulting their sexual urges.\nHuman-sized silicone mannequins have been manufactured since 1977\nThe process includes casting, airbrush painting, and a string of detailed touches that bring the dolls to life\nThe eastern Tokyo factory produces approximately 500 life size hand-made per year\nThe more expensive models are made of silicon and boast up to 35 movable joints\nMost people who buy these dolls are single men and about 60 percent of them are over the age of 40, the company claimed previously.\nThe anonymity of buying a sex doll over the Internet helped boost business.\nOrient Industry also has a showroom displaying its numerous different dolls.\nMany have parted lips, exposed breasts and are shown reclining on beds or chairs in poses with a resemblance to those assumed by prostitutes in sex shops.\nThe company was originally marketing love dolls for disabled people who might find it harder to find a partner\nThe anonymity of buying a sex doll over the Internet has helped the business grow but Orient Industry also has a showroom displaying its wares","url":"https://www.dailymail.co.uk/news/article-4320354/Japanese-factory-Orient-Industry-makes-lifelike-love-dolls.html"}
