{"authors":["Will Martin"],"date_download":"2018-10-30 21:49:47","date_modify":"2018-10-30 21:49:47","date_publish":"2016-12-16 00:00:00","description":"Nomura and Daiwa Capital said that they might move operations out of the UK in a 'frank' meeting with government ministers.","filename":"data/vaneerConsumption/JapanesebanksplantomoveLondonoperationswithinsixmonths.json","image_url":"https://amp.businessinsider.com/images/5853cc3add089502208b4597-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_japanese-banks-plan-to-leave-london-brexit-article-50-2016-12_1540936187.html","title":"Japanese banks plan to move London operations within six months","title_page":"    Japanese banks plan to move London operations within six months - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters/Toru Hanai Japanese banks are preparing to move operations out of London in the next six months, unless they are given more clarity about Britain's Brexit ambitions, according to a report from the Financial Times on Friday.\nThe FT reports that in a meeting held at the start of December, executives from Japanese banks Nomura and Daiwa Capital Markets told government ministers that unless they get some clarity on the status of overseas financial institutions, they may be forced to set up operations elsewhere on the continent, and could start doing so before next summer.\nAn unnamed executive at one of Japan's banks reportedly said during the meeting that he was starting to consider that it \"would be better for our EU-based customers to have an alternative hub,\" other than London, as uncertainty reigns supreme in the City.\nJapan's four biggest banks employ more than 5,000 people in London.\nDuring the meeting, which was described as a \"frank exchange of realism,\" Japanese bankers allegedly told City Minister Simon Kirby, and international trade minister Mark Garnier that they fear for future market access following Brexit, and that they need guarantees that financial passporting will be retained once Britain leaves the EU.\nAccording to figures from the Financial Conduct Authority, released by the House of Commons' Treasury Select Committee in September, 5,476 UK firms have at least one passport that allows them to do business in other EU and European Economic Area nations. Many firms hold several passports, meaning that the total number in the UK stands at 336,421.\nThe loss of passporting rights following Brexit is probably the biggest fear in the City of London right now. If the passport is taken away, then London could cease to be the most important financial centre in Europe, costing the UK thousands of jobs and billions in revenues.\nChancellor Philip Hammond. WPA Pool/Getty Images\nAfter the meeting, Chancellor Philip Hammond said: \"It's fairly binary for them: they either have access to their markets or they don't have access.\"\n\"If they have full access to the markets from London they can continue operating as now. If they don't, they will have to restructure the way their operations address the European market.\"\nIt now appears that the City of London will not be given any special treatment during the UK's Brexit negotiations and the government is ready to let businesses leave.\n\"There was quite a blunt warning that politically the Government does not want to be seen to do a deal to favour rich bankers if it doesn't comply with Brexit voters' wishes - that there is more to the negotiation that just the City,\" an unnamed \"industry leader\" told The Daily Telegraph last week after a summit between ministers and key City figures.\nNumerous financial institutions are getting ready to shift at least some operations out of the UK as a result of the Brexit vote. On Thursday, it was reported that London's 328-year old Lloyd's insurance market will definitely create an office somewhere within the European Union and move some of its operations to the continent in reaction.\nThe Financial Times reports that the insurance market, the world's oldest, has created a shortlist of five possible destinations for the new subsidiary and will put a proposal before members of the market early next year, before the triggering of Article 50.\nThe European Union is also thought to be making fresh attempts to try and strip the City of London of its euro clearing business, one of its biggest jobs in its role as a hub for the global currency markets.","url":"https://www.businessinsider.com/japanese-banks-plan-to-leave-london-brexit-article-50-2016-12"}
