{"authors":["Associated Press"],"date_download":"2018-10-22 22:55:51","date_modify":"2018-10-22 22:55:51","date_publish":"2016-01-28 11:25:47","description":"TOKYO (AP) — Japan's economy minister resigned Thursday as he fended off corruption allegations, in a setback for Prime Minister Shinzo Abe's effort to rev u...","filename":"data/vaneerConsumption/Japaneconomyministerquitsovergraftallegations.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:95c237f9acbb4df7ae1b574f05985df2-4vVdYopwYQ7f641721b07ac7d749-165_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420578_Japan-economy-minister-quit-graft-allegations_1540248951.html","title":"Japan economy minister quits over graft allegations","title_page":"Japan economy minister quits over graft allegations | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Japan economy minister quits over graft allegations\nTOKYO (AP) — Japan's economy minister resigned Thursday as he fended off corruption allegations, in a setback for Prime Minister Shinzo Abe's effort to rev up growth in the world's third-largest economy.\nAkira Amari choked back tears as he announced his resignation in a televised news conference. He denied wrongdoing but apologized for causing \"concern and trouble\" and for undermining public trust in the government with a \"very embarrassing situation.\"\nThe corruption scandal surfaced last week after the magazine Weekly Bunshun reported that Amari and his aides accepted at least 12 million yen ($103,000) in cash and hospitality from the unnamed construction company.\nJapanese Economy Minister Akira Amari brows before answering questions at the upper house of the parliament in Tokyo, Thursday, Jan. 28, 2016. Later, Amari said he intends to resign due to allegations he accepted bribes from a construction company in a nationally televised news conference. (AP Photo/Shizuo Kambayashi)\nAs economy and fiscal minister since late 2012, Amari has been one of the most trusted members of Abe's Cabinet. He also served as Japan's top negotiator for the 12-nation Trans-Pacific Partnership trade pact. Amari, 66, is a career politician and son of a lawmaker who was first elected in 1983.\nWith Amari's departure, Abe has lost a key ally as he is gearing up for an upper house election in the summer.\nPolitical donations and their handling are perennial weak spots for Japanese lawmakers. The allegations against Amari have become fodder for attacks by Communist Party, Democratic Party of Japan and other members of the opposition, who otherwise are unable to effectively challenge the ruling Liberal Democrats' overwhelming majorities in the lower and upper legislatures.\nDuring questioning in parliament, Amari said he did not recall clearly the details of meetings in his office with the construction company.\nShukan Bunshun said that on one occasion, a construction company employee met with Amari in his office in November 2013, handing him an envelope containing 500,000 yen in cash and an expensive Japanese sweet called \"yokan.\"\nAsked about the gift, Amari said Thursday that he wasn't sure what was inside the bag, but that it was \"very heavy.\"\nHis resignation comes amid mounting signs Japan's economic recovery is faltering, raising pressure on its central bank to inject still more cash into the economy on top of its already massive monetary stimulus.\nData released Thursday showed weak retail sales in December. Other major monthly data are due for release Friday.\nAbe apologized over the scandal and said Amari's resignation was \"very regrettable.\" He said Nobuteru Ishihara, a former environment minister, would take on Amari's posts.\n___\nAssociated Press writer Mari Yamaguchi contributed to this report.\n___\nFollow Elaine Kurtenbach: twitter.com/ekurtenbach\nFind her stories at: bigstory.ap.org/content/elaine-kurtenbach\nJapanese Economy Minister Akira Amari folds his arms at the upper house of the parliament in Tokyo, Thursday, Jan. 28, 2016. Later, Amari said he intends to resign due to allegations he accepted bribes from a construction company in a nationally televised news conference. (AP Photo/Shizuo Kambayashi)\nJapanese Economy Minister Akira Amari arrives at the upper house of the parliament in Tokyo, Thursday, Jan. 28, 2016. Later, Amari said he intends to resign due to allegations he accepted bribes from a construction company in a nationally televised news conference. (AP Photo/Shizuo Kambayashi)","url":"https://www.dailymail.co.uk/wires/ap/article-3420578/Japan-economy-minister-quit-graft-allegations.html"}
