{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:04:08","date_modify":"2018-10-30 20:04:08","date_publish":"2016-05-30 12:59:38","description":"Japanese Prime Minister Shinzo Abe expressed “profound resentment” as he publicly lectured President Barack Obama.","filename":"data/vaneerConsumption/JapanesePMLambastsObamaforMurderofCitizenbyUSMarine.json","image_url":"https://media.breitbart.com/media/2016/05/Shinzo-Abe-finger-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_05_30__1540929848.html","title":"Japanese PM Lambasts Obama for Murder of Citizen by U.S. Marine","title_page":"Japanese PM Lambasts Obama for Murder of Citizen by U.S. Marine","title_rss":"NULL","source_domain":"breitbart.com","text":"Japanese Prime Minister Shinzo Abe expressed “profound resentment” and noted that he has “firmly lodged a protest” as he made the unusual move of publicly lecturing President Barack Obama for the murder of an Okinawa resident by a former U.S. Marine.\nIn response to the Japanese leader’s comments on Wednesday, President Obama reportedly apologized, expressing his “sincerest condolences and deepest regrets” and pledging full cooperation.\n“Kenneth Franklin Shinzato has already confessed to stabbing and strangling the 20-year-old Japanese woman who had been working as a contractor at Kadena Air Base,” reports Politico.\n“That’s not enough for Abe, who linked this to a long and bitter history of American personnel stationed here preying on Japanese citizens, most famously in the 1995 rape case when three American servicemen raped a 12-year old girl,” explains the report. “Just this past March, another Marine was arrested for raping a woman.”\nShinzato has been identified as a U.S. contractor who was working at the U.S. Kadena Air Base in Okinawa Prefecture at the time of the murder. He had previously served in the U.S. Marine Corp.\nJapanese PM Abe publicly took Obama to task for the murder in Okinawa.\n“I feel profound resentment for this self-centered and despicable crime,” said Abe, speaking through a translator, according to Politico. “This case shocked the entire Japan.”\n“I have asked the president to carry out effective measures to prevent a recurrence of such crimes,” added the Japanese leader.\nAbe warned that the incident could lead to future problems linked to America’s military presence in Japan.\n“I convey to the president that such feelings of the Japanese people should be sincerely taken to heart,” Abe told Obama. “I also urge the United States to make sure to take effective and thorough means to prevent a recurrence and rigorously and strictly address the situation.”\nObama became the first sitting U.S. president last week to tour Hiroshima, the site of the the world’s first nuclear bombing that helped bring about an end to World War II.\nPresident Obama did not explicitly apologize for America’s decision to drop atomic bombs on Hiroshima and Nagasaki during his visit, but he did declare that the move stemmed from humanity’s worst instincts, including “nationalistic fervor or religious zeal.”\nOn the contrary, as he reflected on the 1945 nuclear attack years later, President Harry Truman proclaimed, “That bomb caused the Japanese to surrender, and it stopped the war. I don’t care what the crybabies say now, because they didn’t have to make the decision.”\nTruman, Obama’s fellow Democrat, presided over the final victory of WWII.\nJoining other conservatives, Joel Pollak, senior editor-at-large at Breitbart News, has called on Congress to censure Obama over his Hiroshima remarks, which have sparked outrage for calling into question America’s motivation during the war.\n“The speech — delivered on the eve of Memorial Day weekend — was billed by the White House as anything but an apology, but Obama’s words betrayed his true sentiments,” wrote Pollak.\nCritics believe Obama’s visit to the nuclear attack site in Japan is a testament to the president’s weakness as the leader of the free world.\nIn responding to Abe’s lecture, Obama vowed that the United States will continue to ensure “justice is done under the Japanese legal system.”\n“This has shaken up people in Okinawa as well as people throughout Japan,”proclaimed Obama. “We consider it inexcusable and we are committed to do everything we can to prevent any crime of this sort. … The Japanese people should know how deeply moved we are about what has happened.”\n“I think the Japanese people should know we are deeply moved and working with the Japanese government to prosecute not only this crime but prevent these kinds of crimes from happening again,” he added.","url":"https://www.breitbart.com/national-security/2016/05/30/japanese-pm-lambasts-obama-murder-citizen-u-s-marine/"}
