{"authors":["Daniel J. Flynn"],"date_download":"2018-10-30 19:51:03","date_modify":"2018-10-30 19:51:03","date_publish":"2017-02-06 14:34:25","description":"Don’t look at Tom Brady next to Joe Montana or Otto Graham. Compare him to Freddy Krueger or Michael Myers. | Sports","filename":"data/vaneerConsumption/JasonVoorheesNotJoeMontanatheProperComparisonforTomBrady.json","image_url":"https://media.breitbart.com/media/2017/02/wi/afp/05/1p9opcc.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2017_02_06__1540929063.html","title":"Jason Voorhees, Not Joe Montana, the Proper Comparison for Tom Brady","title_page":"Jason Voorhees, Not Joe Montana, the Proper Comparison for Tom Brady | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Don’t look at Tom Brady next to Joe Montana or Otto Graham. Compare him to Freddy Krueger or Michael Myers.\nMark Wahlberg, no stranger to scary movies (Fear), left early believing the sequel’s box-office draw already dead. But killing Brady proves about as easy as killing Jason. He comes back, again and again and again.\nDown 25 points in the third quarter, the 39-going-on-29 quarterback engineered the greatest comeback in Super Bowl history. Like Ringo, he relied on a little help from his friends.\nJulian Edelman’s circus catch in triple coverage, Dont’a Hightower’s strip sack leading to a quick Danny Amendola touchdown, and the Pats D pushing the Falcons out of field-goal range to force a punt in the fourth quarter all made the impossible possible.\nBut mainly, it was Brady. And all the while, you could hear the creepy Halloween piano tinkling in the background.\nHe threw for 466 yards, shattering a Super Bowl record held for 17 years by Kurt Warner, and completed 43 passes to set another record. He threw for 195 yards in the fourth quarter, slashing the Atlanta Falcons secondary and cutting out the heart of the team’s long-suffering fanbase. By the time the silver dollar landed on heads, the conclusion, like so many horror endings, seemed a fait accompli.\nWe saw him kill the St. Louis Rams, Carolina Panthers, and Seattle Seahawks similarly. Fans of horror know that in the sequels the similar gets done more spectacularly. So, midway through the third quarter, when the Falcons enjoyed a 99.6 percent win probability, Tom Brady decided that he liked those odds and did what Tom Brady does. That was Super Bowl 51. That was the last 15 or so seasons.\n“We all brought each other back,” the Super Bowl MVP, reverting from slasher villain to his aw-shucks alter ego, reflected after the game. “We never felt out of it.”\nBut the surreal sight of Brady: Part 5, like watching any number of horror sequels, made everyone feel out of it.","url":"https://www.breitbart.com/sports/2017/02/06/jason-voorhees-not-joe-montana-the-proper-comparison-for-tom-brady/"}
