{"authors":["Melissa Ruggieri"],"date_download":"2018-10-30 20:02:51","date_modify":"2018-10-30 20:02:51","date_publish":"2015-10-19 00:50:02","description":"BY MELISSA RUGGIERI and YVONNE ZUSEL\nCool weather, a mature, respectful crowd and...","filename":"data/vaneerConsumption/JasonIsbellChrisStapletonhighlightsecondyearof.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/10/19/Images/WPIMAGE_cmgajcmusic_4569.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_music_concert-review-j_0ad9ceecea552a6130fdefa1706c1d83__1540929771.html","title":"Jason Isbell, Chris Stapleton highlight second year of","title_page":"Concert review: Jason Isbell, Chris Stapleton highlight second year of","title_rss":"NULL","source_domain":"ajc.com","text":"Jason Isbell and his four bandmates capped the second year of Parklife music festival. Photo: BRANDEN CAMP/SPECIAL TO THE AJC.\nBY MELISSA RUGGIERI and YVONNE ZUSEL\nCool weather, a mature, respectful crowd and a robust lineup heavy on Americana equated to a successful second showing of Atlanta’s Parklife music festival.\nA crowd of close to 3,500 – about 2,000 more than last year’s inaugural outing at Atlantic Station – nicely filled the Promenade at Piedmont Park to hear Jason Isbell, Chris Stapleton, Strand of Oaks and Natalie Prass during the seven-hour event (one minor quibble – maybe a bit less time between acts next year).\n“We’re going to learn a lot from this,” said Andrew Hingley, the talent buyer at Eddie’s Attic who created Parklife last year with regional concert promoter Bowe O’Brien.\nHingley also noted that the fest might expand – either seasonally or into a multi-day event – for future incarnations, and was optimistic about remaining at Piedmont.\n“I feel like people like the place,” he said in between sets by Strand of Oaks and Stapleton at Sunday’s gathering.\nIsbell showcased his formidable guitar chops throughout his two-hour set. Photo: BRANDEN CAMP/SPECIAL TO THE AJC.\nIndeed, there was much to like about a scenic area that offered pristine sound as well as access to a parking garage, the Beltline and MARTA.\nIsbell, the Alabamian with many ties to Georgia thanks to his six-year run in Athens-based Drive-By Truckers, capped the fest with a two-hour set of his beautifully lyrical songs.\n“Howdy, folks! How’s everybody doin’? I’m Jason Isbell and this is the 400 Unit,” he said by way of introduction (as if he needed one) as the band launched into the tempo-shifting “Palmetto Rose.”\nIsbell’s voice rang smoothly into the clear night on songs including “24 Frames” and “Stockholm,” performed under a pink-lighted stage and with soaring harmonies between Isbell and guitarist Sadler Vaden.\nDrummer Chad Gamble offered a locomotive beat on the snare-powered “Tour of Duty,” which tapered off in a lovely, floating fashion, while Isbell showcased his own guitar prowess with an expressive solo during the heartrending “Dress Blues.”\nIsbell is the Southern Springsteen, a master of musical storytelling with songs that namecheck collard greens, the Civil War and “Alabama Pines.”\nHis songs swing from the jangly pop hooks of “The Life You Chose” to the sweetly plucked acoustic guitar of “Different Days” to the intuitive “Speed Trap Town” – all delivered with steadfast emotion on Sunday.\nIsbell, a new dad and an ardent Atlanta Braves fan , drew cheers from the crowd with some of the lyrics in “Cover Me Up” and didn’t neglect his work with his former band.\nChris Stapleton and wife Morgane share a moment. Photo: BRANDEN CAMP/SPECIAL TO THE AJC.\nHe shared the background of writing “Declaration Day” at only 21 – a feat accomplished thanks to his family’s stories – before performing the song and its captivating slide guitar solo. He also chose to end his set with a nod to DBT – “Never Gonna Change.”\nPrior to Isbell’s substantial set, Chris Stapleton hit the stage looking like the lost member of the Oak Ridge Boys and sounding like a guy with soul music running through his veins.\nStapleton already has an established career as a songwriter – he’s penned No. 1 hits for Kenny Chesney and George Strait and written about 150 other songs for artists including Luke Bryan, Tim McGraw and Brad Paisley – but now he’s on a solo quest with his debut, “Traveller.”\nThe hirsute singer also handled lead guitar as well as guttural vocals, while a bassist and drummer anchored songs including “Nobody is to Blame” and the title track of his album.\nWith wife Morgane Stapleton (a Jefferson native) by his side to share harmonies and play tambourine, Stapleton demonstrated that his voice could swerve from booming to restrained within the confines of one song (“Fire Away”) and that he can faithfully deliver a cover tune (George Jones’ “Tennessee Whiskey”) or completely deconstruct a languid thumper into a barroom stomper (Tom Petty’s “You Don’t Know How it Feels”).\nNatalie Prass opened the 2015 edition of Parklife. Photo: BRANDEN CAMP/SPECIAL TO THE AJC.\nWhether he and Morgane were unleashing a swampy version of “You Are My Sunshine” or Stapleton was commanding the stage with the somber “Whiskey and You,” he proved himself a solid performer – as well as a guy with whom you’d like to knock back a few shots.\nOther highlights:\nNatalie Prass kicked things off with a smooth, sexy set that included a cover of Janet Jackson's \"Any Time, Any Place\" (a self-avowed Janet fan, Prass also wore a T-shirt with her R&B idol's face on it). Prass -- previously a keyboardist for rocker Jenny Lewis, who performed a stellar set at Music Midtown in September -- ably delivered songs off her self-titled debut album, which was released earlier this year (and was produced by her childhood friend Matthew E. White, who played his own well-received set at this year's Shaky Knees Music Festival). A wisp of a thing, Prass has a big voice that lends soul to her quirky tunes, including \"Bird of Prey.\" While she seems to thrive more on a smaller stage, as she did while opening for Son Lux over the summer at The Earl, Prass certainly held her own with the small but enamored Parklife crowd that gathered for her set, and set a nice tone for the harder rock of Strand of Oaks, who came on next. -- Y.Z.\nStand of Oaks (Timothy Showalter) lets loose onstage. Photo: BRANDEN CAMP/SPECIAL TO THE AJC.\nStrand of Oaks, the music project from Indiana native Timothy Showalter, started rocking from the minute the band hit the stage, with hard-drivers from Strand of Oaks' 2014 release \"HEAL\" including \"Goshen '97\" and \"Shut In.\" Showalter's songs are deeply-felt, personal stories, and he delivers them with such an emotional punch that it's not hard to see why \"HEAL\" made it onto so many \"Best Album of the Year\" lists last year. -- Y.Z.\nFollow the AJC Music Scene on Facebook and Twitter.","url":"https://www.ajc.com/blog/music/concert-review-jason-isbell-chris-stapleton-highlight-second-year-parklife-music-festival/SNskaiWp69SwDlK42BtDGK/"}
