{"authors":["Simone Amelia For Daily Mail Australia"],"date_download":"2018-10-22 21:27:08","date_modify":"2018-10-22 21:27:08","date_publish":"2017-04-26 01:51:59","description":"He's based in the Gold Coast to film Aquaman and Jason Momoa was spotted on Wednesday morning during an outdoor bike run, where he sipped from a large Guinness-branded mug.","filename":"data/vaneerConsumption/JasonMomoagrabscoffeeonabikerideintheGoldCoast.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B693100000578-0-image-a-7_1493167128089.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4445868_Jason-Momoa-grabs-coffee-bike-ride-Gold-Coast_1540243628.html","title":"Jason Momoa grabs coffee on a bike ride in the Gold Coast","title_page":"Jason Momoa grabs coffee on a bike ride in the Gold Coast | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's based on the Gold Coast to film his latest blockbuster, Aquaman.\nAnd Jason Momoa was spotted on Wednesday morning during an outdoor bike run, where he sipped from a large Guinness coffee mug.\nThe 37-year-old was also seen a day earlier on ANZAC Day having a casual pedal around town without his helmet, breaking a Queensland government rule.\nScroll down for video\nDrink riding! Jason Momoa was spotted on Wednesday morning during an outdoor bike run, where he sipped from a large Guinness-branded mug\nThe towering hunk rode the orange bicycle in a pair of thongs, dressed in khaki shorts and a tight-fitted singlet.\nHe smiled as he cycled the streets of Surfer's Paradise, sipping what was no doubt coffee from an oversize black mug branded with popular Irish beer Guinness.\nHis toned triceps and prominent tattoos were on display as he spent the morning getting some physical activity in.\nHot: The towering hunk rode the orange bicycle in a pair of thongs, dressed in khaki shorts and a tight-fitted singlet\nAccording to rules set by the Queensland government, cyclists 'must wear an Australian Standard (AS) approved bicycle helmet' that is securely fit and fastened.\nThe husband of actress Lisa Bonet, with whom he has two children, is set to start filming the anticipated Aquaman movie from next month.\nLets get physical: His toned triceps and prominent tattoos were on display as he spent the morning getting some physical activity in\nDouble duty: He smiled as he cycled the streets of Surfer's Paradise, sipping an unidentified drink from an oversize black mug branded with popular Irish beer Guinness\nThe superhero feature is set to be released in December 2018.\nThe film's production staff have applauded the actor for his professionalism.\n'He's made such a good impression on everyone. Everyone can't praise him enough, he already has so much respect,' a crew member recently told News Corp.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4445868/Jason-Momoa-grabs-coffee-bike-ride-Gold-Coast.html"}
