{"authors":["Melissa Ruggieri"],"date_download":"2018-10-30 01:15:24","date_modify":"2018-10-30 01:15:24","date_publish":"2018-08-31 16:33:00","description":"Jason ‘J’ Carter spearheads a cultural movement with Atlanta's One Musicfest","filename":"data/vaneerConsumption/JasonJCarterspearheadsaculturalmovementwithOneMusicfest.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/31/Images/J%20Carter%201-U86806268666NfE-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_music_jason-carter-spe_28cdb3829332468328532054635fce8d__1540862124.html","title":"Jason ‘J’ Carter spearheads a cultural movement with One Musicfest","title_page":"Jason ‘J’ Carter spearheads a cultural movement with One Musicfest","title_rss":"NULL","source_domain":"ajc.com","text":"No one thought it could work.\nAn outdoor, multi-stage experience with artists ranging from George Clinton to Jeezy to Nas?\nNope. Can’t happen.\nAt least that’s what seasoned festival producers told Jason “J” Carter when he expressed his desire to create “an urban cultural Woodstock” – an event that would offer musical diversity, as well as a “communal energy exchange” with fellow attendees.\nBut the naysayers only fueled Carter, who started attending other festivals – Bonnaroo, Lollapalooza – for research and learned that while they felt like “true, music lover festivals” with hip-hop, classic rock, classic soul and reggae, something was still missing.\n“You’d look around and say, ‘I see a lot of urban talent onstage, but I don’t see a lot of people who look like me,’” Carter noted.\nNext weekend, he will stage the biggest incarnation yet of the event so few believed would succeed – the One Musicfest, which happens to offer a lineup this year ranging from George Clinton to Jeezy to Nas as well as Miguel, Brandy, 2 Chainz, T.I., H.E.R. and dozens more.\nMiguel, shown at the Essence Festival in July, is a marquee name playing One Musicfest this year. (Photo by Bennett Raglin/(Getty Images for Essence)) (Getty Images for Essence)\nNine years in, Carter can finally exhale a bit.\n“We’re making money now. I think we’ve hit a level of success,” he said, seated in the plush environs of the Fox Theatre’s new Marquee Club on a recent August afternoon.\n“But,” he added, leaning forward, “we have so much more to do.”\nCarter is a boyish 45. He’s a husband to Amika and dad to a 3 and 5-year-old. Clad in designer jeans, a gleaming white Polo shirt and matching Air Jordans, he’s laid-back but with a simmering passion for his work as the founder of one of Atlanta’s now-celebrated music festivals.\n“J has a network that seems to just go beyond,” said Josh Antenucci, senior partner at Rival Entertainment, the Atlanta promoter working with One Musicfest this year. “Whether culture, fashion or politics, he has an active voice.”\nBefore achieving enough to expand One Musicfest to a two-day, three-stages event in the Fourth Ward’s Central Park, Carter utilized his entrepreneurial skills in several dues-paying experiences.\nA New Yorker transplanted in Atlanta since high school, Carter spent the early 2000s juggling his full-time job in the corporate world – legal consultant for Lexis Nexis – with his need to spark something in Atlanta’s nightlife scene.\n“Being from Brooklyn, we grew up listening to everything – funk to disco to reggae to rock to hip-hop. But you couldn’t really find spaces in Atlanta that would embrace all types of music, all types of people, all types of communities and backgrounds and different generations. I just couldn’t find it,” Carter said.\nHis first concept in 2001, SolFusion, commandeered then-downtown hotspot Karma with an array of DJs playing varied styles of music.\nIn 2005, he dabbled in live music promotion with the Underground Atlanta club, Sugar Hill.\n“It was phenomenal during its time,” Carter said. “We had everyone from Lil Wayne to Gil Scott-Heron; Bootsy Collins to Raphael Saadiq.”\nBut he still couldn’t shake the aspiration to go bigger.\n“You could play Nirvana’s ‘Smells Like Teen Spirit’ in a hip-hop club and guess what? They’re gonna know the words! And you can do ‘Baby Got Back’ in a Top 40 dance club, and they know all the words! We’re all listening to the same music. But what happens if you figure out a way to bring folks together to have that communal exchange?”\nJason Carter is looking forward to an expanded, two-day One Musicfest at its new location in Atlanta's Central Park. Photo: Ryon Horne/AJC\nThe inaugural One Musicfest – stamped with its eternal tagline, “Unity Through Music” – was staged in a hot, unshaded parking lot at King Plow Arts Center in July 2010.\nAn impressive-enough 2,500 people showed up.\nStill, Carter said, “We took it on the chin that year. We took it on the chin for five years, actually. But that’s some of the advice we got from the folks at Bonnaroo – if you can survive for five years, you might see daylight. Another person told us, if you don’t have $2 million in the bank to lose, don’t do it. I did not have $2 million in the bank to lose.”\nAntenucci and Rival Entertainment helped produce the third year of the event, which took place at the now-defunct Masquerade Music Park in Old Fourth Ward.\nBut Carter’s gamble started to inch closer to a jackpot in 2014, when he booked Kendrick Lamar to headline the festival, which was moved to the larger Lakewood Amphitheatre.\nLamar wasn’t the award-gobbling critical darling he is now, but he still commanded a hefty paycheck.\n“I said, he’s definitely the artist (we want to book), but it was all those zeroes he had after his name (that worried me),” Carter recalled with a laugh.\nHe lost money again. But the inclusion of a burgeoning marquee name, complemented by a bigger venue and more marketing dollars made people start to pay attention.\n“I would say it was a pivotal year for us,” Carter said.\nBy the time year five rolled around, just as those prognosticators from Bonnaroo suggested, Carter saw a glimmer of financial daylight after a One Musicfest featuring The Roots and Lauryn Hill.\nBut it was the 2016 edition at Lakewood that cemented the festival’s standing as a serious contender.\n“The Dungeon Family with Outkast,” Carter said with a knowing nod. “That was catching lightning. That was a unicorn.”\nBut it was also a bit nerve-wracking, as no one knew even on the day of the show if the unpredictable Andre 3000 would show up.\n(Spoiler alert – he did, and it was glorious.)\nCarter credits Andre’s Outkast partner Big Boi, along with Organized Noize founder Rico Wade and manager Orlando McGhee with spearheading the reunion of the Atlanta collective.\n“Big Boi thought the timing was right. They needed it. Atlanta needed it,” Carter said.\nDuring the performance, “It was literally grown men watching the show in tears behind the stage. You could see the emotions.”\nAtlanta rapper 2 Chainz is taking the slot originally reserved for Cardi B, who is taking some time with her new baby. Photo: Robb Cohen Photography & Video /RobbsPhotos.com\nCarter booked a similar “unicorn” this year – the sassy rap phenom Cardi B. Discussions with her agent began in March, and Carter was privy to Cardi’s pregnancy but asked to keep it quiet. Knowing she was due in early July, he asked, “Is two months enough (time for a return)? I saw what my wife went through with our children. But they said she wanted to do it.”\nDespite Cardi B’s best intentions to return to touring with Bruno Mars in September and squeeze in the One Musicfest date, she opted a few weeks ago to bow out of all upcoming commitments to spend time with baby Kulture, her daughter with husband Offset of Atlanta’s Migos.\nWhile Carter was obviously disappointed, he handled the news with the wisdom of an experienced man.\n“Who am I to tell somebody what they can or can’t do? Especially a woman after delivering a child!”\nCardi B’s slot is being filled by Atlanta’s 2 Chainz (upstart Ella Mai has also been added to the lineup), and Carter is energized about the “beast” that is Central Park, which he hopes will remain the festival’s home.\n“It’s the natural state of the festival,” said Antenucci. “The site has proven to work, and One Musicfest fits this part of town. With the reception it’s already gotten, it will be cool to see how that translates to a shady park setting.”\nCarter adds a final description of the essence of One Musicfest, just in case there are some who still don’t understand.\n“It’s a family reunion mixed with a homecoming,” he said. “You’d be hard-pressed to find a generational event like One Musicfest that highlights progressive urban music. You’d be hard-pressed to find a show that is unafraid to have what they call your conscious backpack rappers next to your die-hard trappers next to a 68-year-old funk legend. You really just can’t find that. It’s the music. It’s the local visual artists we empower. It’s the cultural food. It’s sensory overload in every direction.”\nAnd they said it wouldn’t work.\nFESTIVAL PREVIEW\nOne Musicfest\nWith Nas, 2 Chainz, Miguel, Big Sean, Jeezy, T.I., August Greene, Brandy, George Clinton & Parliament Funkadelic, H.E.R., Big K.R.I.T. and many more. Noon-11 p.m. Sept. 8; noon-10 p.m. Sept. 9. Two-day general admission $125 (increases to $140 on Sept. 7); single-day general admission $75; two-day VIP $250; two-day platinum experience $750. 1-800-745-3000, onemusicfest.com.\nFollow the AJC Music Scene on Facebook and Twitter.","url":"https://www.ajc.com/blog/music/jason-carter-spearheads-cultural-movement-with-one-musicfest/op6XJl7Yr30bLTUdExbXyK/"}
