{"authors":["Rachel Simon"],"date_download":"2018-10-30 23:21:30","date_modify":"2018-10-30 23:21:30","date_publish":"2014-08-13 20:03:36","description":"As history's proven, winning an Oscar doesn't necessarily mean an actor's going to go on to non-stop success; for every Jennifer Lawrence or Meryl Streep, there's people like Adrien Brody or Octavia Spencer, high-quality actors who, for some reason…","filename":"data/vaneerConsumption/JasonRitterOnWorkingWithHilarySwankDatingEmmyRossuminYoureNotYou.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/266ede59-aa87-4c40-ac33-2839b3ea5f61.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35662-jason-ritter-on-working-with-hilary-swank-dating-emmy-rossum-in-youre-not-you_1540941690.html","title":"Jason Ritter On Working With Hilary Swank & Dating Emmy Rossum in 'You're Not You'","title_page":"Jason Ritter On Working With Hilary Swank & Dating Emmy Rossum in 'You're Not You'","title_rss":"NULL","source_domain":"bustle.com","text":"As history's proven, winning an Oscar doesn't necessarily mean an actor's going to go on to non-stop success; for every Jennifer Lawrence or Meryl Streep, there's people like Adrien Brody or Octavia Spencer, high-quality actors who, for some reason or another, have had a hard time finding roles worthy of their talent. Sometimes even two Oscars doesn't promise long-term success; take Hilary Swank, who, despite winning for both Boys Don't Cry and Million Dollar Baby, has struggled in recent years to find good work. Now, though, she's back on the radar with You're Not You , an upcoming drama, and according to co-star Jason Ritter, it's a huge comeback for an actress who shouldn't have needed one in the first place.\n\"She was a complete transformation, not that anyone’s surprised,\" Ritter says. \"She’s one of those people that can just do that. But doing it right in front of you was pretty spectacular.\"\nIn the George C. Wolfe (Angels in America)-directed film, Swank plays Kate, a woman suffering from ALS, and who hires Bec (Emmy Rossum), a self-absorbed college student to be her caretaker. Ritter co-stars as a man who falls for Bec, only to discover he's being used by her as revenge on an ex.\n\"I play this guy who meets Emmy at this place and falls for her. I can’t imagine why,\" Ritter says, laughing. \"Her character in this is very wild and very impulsive, and so the first night we meet, she takes me home and kind of changes my life. I’m in love with her at that point, but she’s only really done that to get revenge on this guy that she’s been sleeping with.\"\nRitter says that it's Kate, Swank's character, who forces Bec to give the nice guy a chance.\n\"I'm kind of following her around and she's a little bit annoyed by it,\" he says, adding, \"getting to try to flirt with Emmy while she was rolling her eyes and shrugging me off was scary but fun.\nRitter says he was drawn to the film by its \"beautiful script,\" as well as the opportunity to work alongside such an acclaimed cast and crew.\n\"George was a wonderful director, and getting to work with Emmy Rossum and Hilary was... I had to keep on trying to remind myself to be in the scene and do my part, for so much of it I was looking at them,\" he says.\nAlthough the film currently has no release date, it was picked up for distribution in April, with plans to hit theaters before the end of 2014. Ritter says he's excited for the eventual release, and he hopes viewers don't get turned off by the movie's dark subject matter.\n\"It’s a beautiful movie, and at the center of it is Hilary Swank’s ALS and her slow decline,\" he says. \"It’s a heavy movie, but there’s also a lot of light in it.\"","url":"https://www.bustle.com/articles/35662-jason-ritter-on-working-with-hilary-swank-dating-emmy-rossum-in-youre-not-you"}
