{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 23:41:28","date_modify":"2018-10-30 23:41:28","date_publish":"2014-08-13 14:33:34","description":"When does the statute of limitations on worrying that Beyoncé and Jay Z are about to divorce expire? Is there ever going to be a time when we can all get back to relaxing? The rumors are still swirling about Jay Z's infidelity and, even though…","filename":"data/vaneerConsumption/JayZBeyoncesDivorceWouldBeFortheBestIfTheseRumorsAreTrue.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/b0768258-f3f4-4c71-b30f-1e814744254f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_33098-jay-z-beyonces-divorce-would-be-for-the-best-if-these-rumors-are-true_1540942888.html","title":"Jay Z & Beyonce's Divorce Would Be For the Best If These Rumors Are True","title_page":"Jay Z & Beyonce's Divorce Would Be For the Best If These Rumors Are True","title_rss":"NULL","source_domain":"bustle.com","text":"When does the statute of limitations on worrying that Beyoncé and Jay Z are about to divorce expire? Is there ever going to be a time when we can all get back to relaxing? The rumors are still swirling about Jay Z's infidelity and, even though Beyoncé's Instagram game is all about painting a portrait of a happy family and a loving couple, there's still a lingering shadow of doubt that all isn't really well between the Hollywood golden couple. If we reflect on their relationship to this point, there are plenty of signs that Beyoncé and Jay Z could be headed for divorce but I don't want to believe it and most Bey and Jay fans don't want to believe it either.\nThe signs are easy to ignore, but that doesn't change the fact that they are there. At this point, it seems that the most likely reason for why Beyoncé and Jay Z could be on the verge of splitting up is that Jay Z's been unfaithful. Not only have there been rumors flying about it, but Beyoncé herself is the one who set them off when she performed an improvised version of her song \"Resentment\" with the lyrics changed to apply to her 12 year relationship with Jay Z rather than the nameless abstract narrator.\nAs much as we might scoff at the idea that anyone would be insane enough to cheat on Queen Bey, there's a reason that these rumors have continued to persist even now. The music video released by Jay Z's alleged mistress called \"Sorry Mrs. Carter\" really didn't help. In fact, Jay Z's supposed infidelity is one of the biggest indicators that a divorce isn't as far-fetched as we want to believe.\nIn the past, Jay Z has been linked to LIV of the infamous music video, Rachel Roy, Mya, and even Rita Ora. In June alone he was linked to reality star Casey Cohen, although that was a Life & Style story that received a cease and desist from Cohen herself. Infidelity is not a crime that anyone, but especially Beyoncé, could easily forgive; after all, she severed professional ties with her father in 2011 after his 18 month affair with actress Alexsandra Wright. Another integral hint to a potential separation came in May 2014 when stories began to fly that Beyoncé was getting her wedding ring tattoo removed because the ink on the tattoo was faded and there was a picture on Beyoncé's website of her with a band-aid over it. With that in mind, Beyoncé and Jay Z could have been having marital problems for longer than we realized.\nThe thing is, with Jay Z being connected to a new woman every week and Blue Ivy finally entering toddlerhood, if Beyoncé and Jay Z have been thinking of this separation for a while then now would be as good a time as any. Beyoncé is back from her Mrs. Carter World Tour and they've just finished giving everyone what they've wanted since the first time Beyoncé and Jay Z did a song together: a joint tour starring the pair of them. They celebrated their relationship with style, flair, and amazing costumes so the timing would be right for them to go their separate ways.\nIt would be just like Beyoncé and Jay Z to keep this under wraps until it was physically impossible for them to hide it from people anymore. The unconfirmed rumor that Beyoncé and Jay Z were getting marriage counseling during the On the Run Tour probably had some measure of truth to it whether you believe they're about to divorce or not. Maybe they were working on their marriage, but it's also possible that they were working on their relationship so that they could remain on good terms, at least for Blue Ivy's benefit, after a divorce.\nKnowing Beyoncé and Jay Z, if they do end up separating then they're going to take a page from the Orlando Bloom and Miranda Kerr school of amicable divorcees and continuing to feature in adorable family pictures on Beyoncé's website and Instagram. After all, the two have been together for 12 years and in the time leading up to these divorce rumors they were still just as affectionate and loving toward each other as they've ever been. The '03 Bonnie and Clyde might still be on the verge of divorce, but I think they'll still remain a dynamic duo no matter what. At least, I hope they will.\nImage: beyonce/Instagram","url":"https://www.bustle.com/articles/33098-jay-z-beyonces-divorce-would-be-for-the-best-if-these-rumors-are-true"}
