{"authors":[],"date_download":"2018-10-23 05:37:17","date_modify":"2018-10-23 05:37:17","date_publish":"2015-06-02 00:00:00","description":"The Ritchies were one of the great folk song families of the Appalachians. They favored ballads and Jean Ritchie became a master, preferring to sing unaccompanied in a striking, crystalline voice. Alan Lomax recorded her, and she was known as \"The Mother of Folk.\" Ritchie died Monday at 92.","filename":"data/vaneerConsumption/JeanRitchieSingerKnownAsTheMotherOfFolkDiesAt92.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=411533533_1540273037.html","title":"Jean Ritchie, Singer Known As 'The Mother Of Folk,' Dies At 92","title_page":"Jean Ritchie, Singer Known As 'The Mother Of Folk,' Dies At 92 : NPR","title_rss":"NULL","source_domain":"npr.org","text":"MELISSA BLOCK, HOST:\nJean Ritchie carried hundreds of songs in her head, and she used her crystal-clear voice to introduce those songs to hundreds of thousands of listeners. She was a teacher, record label owner and instrument maker who helped popularize traditional music from Appalachia. Jean Ritchie died yesterday at her home in Kentucky at the age of 92. NPR's Mandalit del Barco has this appreciation.\nMANDALIT DEL BARCO, BYLINE: Jean Ritchie was born the youngest in a family of balladeers from the Cumberland Mountains of eastern Kentucky.\n(SOUNDBITE OF ARCHIVED BROADCAST)\nJEAN RITCHIE: Their family was (laughter) bigger than most. It's - Mom and Dad had 14 children and there was May (ph), Olly (ph), Matty (ph), Una (ph), Raymond (ph), Kitty (ph), Truman (ph), Patty (ph), Edna (ph), Jewel (ph), Opal (ph), Pauline (ph), Wilmer (ph), and Jean. I'm Jean.\nDEL BARCO: She told NPR in 1985 they grew up singing ballads their grandparents taught them, songs they sang as they did their chores or at family gatherings.\n(SOUNDBITE OF ARCHIVED BROADCAST)\nRITCHIE: (Singing) Brightest and best of the sons of the morning.\nDEL BARCO: Ritchie graduated from college Phi Beta Kappa and moved to New York City in 1947 to become a social worker at the famous Henry Street Settlement. There she taught some of the songs she knew to the children, and she came to the attention of folklorist Alan Lomax, who recorded her for the Library of Congress.\n(SOUNDBITE OF SONG, \"ALL THE PRETTY LITTLE HORSES\")\nRITCHIE: (Singing) When you wake you'll have some cake and all the pretty little horses. Blacks and the bays and dapples and the greys, so go to sleep you little baby before the boogerman gets you.\nDAN SCHATZ: Nobody was more important than Jean Ritchie in bringing the old songs to new audiences.\nDEL BARCO: Folk musician Dan Schatz co-produced a tribute album to Ritchie.\nSCHATZ: Songs that carried the tradition from England and Scotland and Ireland into the United States and into the mountains and very much shaped American music. I think Joan Baez called her the mother of folk.\nDEL BARCO: Bob Dylan was a fan. Ritchie said anyone could sing.\nSCHATZ: She didn't care who you were or how famous you were or what style of music you were making. She was unfailingly warm and encouraging.\nDEL BARCO: Ritchie was a Fulbright scholar and helped launch the first Newport Folk Festival. She often sang acappella, but she also introduced audiences to the mountain dulcimer and autoharp. And she wrote her own songs.\n(SOUNDBITE OF SONG, \"THE L&N DON'T STOP HERE ANY MORE\")\nRITCHIE: (Singing) For I was born and raised at the mouth of the Hazard Holler. Coal cars roarin' and a rumblin' past my door. Now they're standin' rusty, rollin' empty and the L and N don't stop here anymore.\nDEL BARCO: Whatever Jean Ritchie sang, she brought to it a part of her old Kentucky home. Mandalit del Barco, NPR News.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=411533533"}
 on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2015/06/02/411533533/jean-ritchie-singer-known-as-the-mother-of-folk-dies-at-92"}
