{"authors":["Ryan Smith","Jasmin Sahota For Mailonline"],"date_download":"2018-10-23 02:28:48","date_modify":"2018-10-23 02:28:48","date_publish":"2017-03-16 13:04:25","description":"In a bizarre twist of the fate, the lady he stepped out with happened to be Tamara Ralph - the woman who designed Cheryl's sweeping black wedding dress when she and Jean-Bernard celebrated their nuptials in the UK.","filename":"data/vaneerConsumption/JeanBernardFernandezVersiniseenwithCheryllookalike.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/17/11/3E5D0B9000000578-0-image-a-58_1489750475291.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319810_Jean-Bernard-Fernandez-Versini-seen-Cheryl-lookalike_1540261728.html","title":"Jean-Bernard Fernandez-Versini seen with Cheryl lookalike","title_page":"Jean-Bernard Fernandez-Versini seen with Cheryl lookalike | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He had a tumultuous break-up from Cheryl last year, following just two years of marriage.\nBut Jean-Bernard Fernandez-Versini, 36, looked like he was enjoying the single life as he was spotted leaving London's Chiltern Firehouse with a woman bearing a striking resemblance to his stunning ex-wife.\nAnd, in a bizarre twist of the fate, the lady he stepped out with happened to be Tamara Ralph - the woman who designed Cheryl's stunning wedding party dress after she and Jean-Bernard celebrated their nuptials in the UK, reports The Sun.\nScroll down for video\nEx factor: Jean-Bernard Fernandez-Versini was spotted at London's Chiltern Firehouse with Tamara Ralph - the woman who designed his ex Cheryl's wedding party dress - on Wednesday\nJean-Bernard looked in high spirits as he walked behind his mystery gal pal, before stopping to pose for awaiting cameras.\nThe handsome Frenchman cut a casual yet chic figure in a taupe-coloured jacket, paired with form-fitting blue jeans.\nMeanwhile, his companion looked elegant in a ruffled blush-pink frock, while wrapping up warm with a fur-covered overcoat.\nThe way they were: Cheryl was seen wearing the eye-catching dress at her wedding celebration at private London club The Library in July 2014\nA sheer delight: The flattering off-shoulder gown featured black sheer chiffon skirt\nAfter Jean-Bernard and Cheryl tied the knot in an intimate ceremony on the Caribbean island of Mustique in July 2014, they later jetted back to the UK and had a bigger celebration with 80 guests at private club The Library in London.\nIt was for the second round of celebrations that Tamara designed Cheryl's gown.\nThe designer, who co-owns fashion brand Ralph & Russo with Michael Russo told Vogue at the time: 'This gown was perfect for Cheryl on her special day. The play on fabrics and simple silhouette is what really makes this gown so striking.\n'The sumptuous, rich velvet and duchesse silk bodice contrasted with a delicate, sheer silk-chiffon skirt brought an element of fun to the overall look whilst still being romantic.\nSpecial: Tamara said at the time that the gown was 'perfect for Cheryl on her special day'\nThe way they were: Cheryl and jean-Bernard tied the knot on the Caribbean island of Mustique\n'Cheryl’s choice of black for a wedding celebration was so unexpected but I love the fact that she surprised everyone.'\nJean was spotted with yet another brunette beauty in January, where the pair enjoyed an art exhibition, Emotion In Motion, at The Den at 100 Wardour Street.\nHis latest outing comes as pregnant Cheryl's due date looms.\nThe French businessman and the former Girls Aloud singer were married for 18 months, between July 2014 and October 2016.\nJean was spotted with yet another brunette beauty in January, where the pair enjoyed an art exhibition, Emotion In Motion, at The Den at 100 Wardour St\nMoving on: Cheryl has since moved on, settling into a romance with Liam Payne, with whom she's expecting her first child\nSpeaking about the situation for the first time earlier this month, Jean Bernard admitted he found out through the media that his former spouse is having a child with Liam.\nJB told the London Evening Standard's ES magazine: 'Funnily enough that [the news] was how I heard.'\nThe restaurant owner had nothing but kind words to say about his ex's happy news and said having children makes the world a 'better place'.\nHe added: 'It's a great thing to have babies. There are so many sad things these days, if everyone was creating life, the world would be a better place.'\nBumping along nicely: Pregnant Cheryl's due date is looming","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319810/Jean-Bernard-Fernandez-Versini-seen-Cheryl-lookalike.html"}
