{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:25:03","date_modify":"2018-10-30 21:25:03","date_publish":"2014-12-06 18:54:17","description":"This past week, possible GOP 2016 presidential contender Jeb Bush doubled down on his support for the Common Core standards, scolding conservative critics |","filename":"data/vaneerConsumption/JebBushsEducationReformEmpire.json","image_url":"https://media.breitbart.com/media/2014/12/jeb-bush-visits-school-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_12_06__1540934703.html","title":"Jeb Bush's 'Education Reform' Empire","title_page":"Jeb Bush's 'Education Reform' Empire | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This past week, possible GOP 2016 presidential contender Jeb Bush doubled down on his support for the Common Core standards, scolding conservative critics of the controversial education reform by stating that he had “lost patience” with them and telling them they were not needed by moderate Republicans to win the White House.\nWith polls showing Republican support for Common Core plummeting, common sense would dictate that Bush call it a day with the nationalized standards, as has been done by other Republicans, such as Maine Gov. Paul LePage and U.S. Sen. David Vitter, who plans to run for governor of Louisiana next year.\nHowever, as a review of Bush’s history with the education initiative demonstrates, his interest in pushing onto the entire nation the reforms he introduced while governor of Florida – and his methods for doing so – have led his critics to claim he is more about big government crony capitalism than concern for children’s education.\nBush is the founder of several organizations that all play into a reported strategy that involves not only motivating “the people” at large for changes in education, but also using state education officials to administratively make some of those changes happen without the scrutiny or approval of the public.\nAs the founder and chairman of the Foundation for Excellence in Education (FEE), a national group which states its ambitious mission is “to build an American education system that equips every child to achieve his or her God-given potential,” Bush tapped for CEO Patricia Levesque, his former deputy chief of staff for education, enterprise solutions for government, minority procurement, and business and professional regulation while he was governor.\nChiefs for Change is an affiliate of FEE and describes itself as a “bipartisan coalition of current and former state education chiefs who believe that American public education can be dramatically improved.” Current members of Chiefs for Change include Mark Murphy of Delaware, Tom Luna of Idaho, John White of Louisiana, Hanna Skandera of New Mexico, Janet Barresi of Oklahoma – who was defeated in the state’s primary election this year, Deborah Gist of Rhode Island, and Kevin Huffman of Tennessee, former education commissioner and ex-husband of controversial Washington, D.C., schools chancellor Michelle Rhee.\nTony Bennett, the former Florida commissioner of education, who obtained that position after Indiana voters rejected his Bush-promoted reforms, is listed as a “member emeritus” of Chiefs for Change. As reported by conservative writer Michelle Malkin last year, Bennett stepped down from his Florida post in August of 2013 after the Associated Press reported he had interfered in charter school accountability ratings – better known as “grade-fixing” – in Indiana in the fall of the prior year. Malkin noted that mega-GOP donor Christel DeHaan, founder of DeHaan’s Christel House Academy charter school, benefited from Bennett’s maneuver that magically turned his charter school from a “C” to an “A” grade rating, despite abysmal math scores.\nAs it happens, some of the Chiefs for Change are also members of the Partnership for the Assessment of Readiness for College and Careers (PARCC), one of the two federally funded interstate consortia that are developing tests aligned with the Common Core standards.\n“Cronyism and corruption come in all political stripes and colors,” wrote Malkin at Townhall. “As a conservative parent of public charter school-educated children, I am especially appalled by these pocket-lining GOP elites who are giving grassroots education reformers a bad name and cashing in on their betrayal of limited-government principles.”\nBush is also the founder and chairman of Foundation for Florida’s Future, a statewide group that says its mission is to “make Florida’s education system a model for the nation.”\nThose familiar with Common Core will note that FEE’s “reform agenda” includes college and career readiness; digital learning; effective teachers and leaders – a goal that observes the need to eliminate tenure and utilize student assessments to determine teacher performance ratings; K-3 reading assessments; outcome-based funding; school choice; standards and accountability – which includes “high academic standards with their progress measured,” and grading schools on an A-F scale.\nNot surprisingly, the reform agenda for Foundation for Florida’s Future is nearly identical to that of FEE.\nAdditionally, Bush has joined with former president of the pro-Common Core Fordham Institute Chester Finn and the U.S. Chamber of Commerce in Conservatives for Higher Standards, a group that promotes the Common Core standards but whose supporters still call themselves “conservatives.” Among the organization’s supporters are Sen. Lamar Alexander (R-TN), soon-to-be head of the Senate committee that oversees education; former Mississippi Gov. Haley Barbour (R); former U.S. Secretary of Education Bill Bennett; Iowa Gov. Terry Branstad (R); Tennessee Gov. Bill Haslam (R); former Arkansas Gov. Mike Huckabee (R); and New Mexico Gov. Susana Martinez (R).\nThe Fordham Institute, the U.S. Chamber of Commerce, and Bush’s national organization have all been awarded grants by the Bill and Melinda Gates Foundation, the primary private backer of the Common Core standards.\nIn 2013, Bush’s FEE itself received $3,500,000 from the Gates Foundation. Two million dollars of that was awarded to FEE “to support Common Core implementation,” and $1.5 million was “for general operating support.”\nIn 2012, FEE received $151,068 from Gates, essentially for PR funding “to complete a statewide communications campaign in Florida delivering the message on why there is a drop in school grades, why it is temporary, and how raising the bar on education standards leads to greater student success.”\nThe year before saw a $1 million grant from Gates, once again “for general operating support,” and in 2010, FEE was awarded $501,485 “to launch the Digital Learning Council in an effort to bring digital learning to every school, every classroom, and every child.”\nIn addition to the Gates Foundation, FEE’s donor list includes names not unfamiliar to critics of the Common Core standards: the GE Foundation, the Helmsley Charitable Trust, News Corp, the Walton Family Foundation, Bloomberg Philanthropies, Carnegie Corporation, the Schwab Foundation, Microsoft, Exxon Mobil, Paul Singer Foundation, Houghton Mifflin Harcourt, Intel, K12, Pearson, Scholastic, and Target.\nBook publishers such as Pearson, Houghton Mifflin Harcourt, K12, and Scholastic are all poised to reap billions off the sale of Common Core-aligned textbooks and instructional materials that school districts are forced to purchase if they want their students to succeed on the Common Core-aligned assessments. Similarly, technology companies will benefit from the online assessments and student data collection.\nAs the Tampa Bay Times reported in May, the potential market for textbooks and instructional materials required for Common Core is as much as $8 billion, according to the Fordham Institute.\nFEE’s board of directors includes Joel Klein, former New York City schools chancellor, and former Secretary of State Condoleezza Rice. Klein is now the CEO of Amplify, a subsidiary of Rupert Murdoch’s News Corp.\nIn January of 2013, In the Public Interest, a project of labor advocacy group The Partnership for Working Families, published a press release in which it revealed emails between FEE and state education officials. The release stated the emails – all available for viewing and obtained through public records requests – demonstrate FEE was “writing state education laws and regulations in ways that could benefit its corporate funders.”\nIn the Public Interest claimed that FEE, sometimes working though its affiliate Chiefs for Change, “wrote and edited laws, regulations and executive orders, often in ways that improved profit opportunities for the organization’s financial backers.”\nCorrespondence between FEE and state education officials from Rhode Island, Oklahoma, New Mexico, Maine, Louisiana, and Florida revealed several findings, though it’s important to remember the source is a labor advocacy group whose goal is to keep teachers in jobs and funding flowing to public schools.\nIn New Mexico, In the Public Interest found FEE to have “acted as a broker to organize meetings between its corporate donors and individual Chiefs,” while in Florida, emails showed Bush’s organization helped to write legislation that would increase the use of a proprietary test – the FCAT – under contract to mega publisher Pearson.\nMaine’s legislature and governor, through executive order, approved FEE’s agenda, removing barriers to online education and, as In the Public Interest notes disapprovingly, “allowing public dollars to flow to online schools and classes,” and blocking the “ability of local school districts to limit access to virtual schools.”\nThe project group observes also that, in the emails, Levesque called upon state officials, such as state Superintendent Barresi of Oklahoma, to introduce SendHub, a communications technology tool, into the schools in their respective states.\nHowever, as Techcrunch reported in October of 2012, Bush was an investor in SendHub:\nSendHub, the messaging startup backed by $2 million in seed funding from Y Combinator, Kapor Capital, Menlo Ventures, 500 Startups and others, is today announcing a highly in-demand new feature with the launch of Shared Groups, as well as a notable new investor: Jeb Bush, 43rd Governor of Florida. This is the first startup investment for the former Republican governor, and one which saw the politician approaching SendHub, instead of the other way around.\nThe report states that Garrett Johnson, who founded SendHub with Ash Rust in 2011, “first got his start in politics working for Bush and still serves on the board of one of Bush’s foundations,” a reference to Foundation for Florida’s Future.\nJohnson reportedly sent Bush an article about SendHub, and Bush responded with whether there was an opportunity to invest. The amount of Bush’s investment was undisclosed, but “in the five-figure range – neither at the low end or the high-end of the spectrum.”\nTechcrunch continued:\nIt’s somewhat unusual to see politicians playing the role of investor in early stage startups, but in Florida, area leaders have been pushing to see how the state can harness startup momentum to create jobs and boost the economy. There are even a couple of members in Florida’s legislature who have launched startups, Johnson points out.\nLevesque sent an email about SendHub to the Chiefs. Note her “full disclosure” is not quite so “full”:\nDear Chiefs for Change, If you have anyone on your agency staff who is assigned to provide assistance/support/communications for teachers in your state, please share this new service with them so they can share with your teachers. SendHub is a new mobile messaging system that will allow teachers to have easier, more effective communications with their students and parents. The system is free for teachers. Beauty of the system is that teachers will not have to give out their personal cell numbers to students/parents, but instead can get a free SendHub number that can be used for texting and/or voice communication… Patricia p.s. full disclosure, I know the creator of the system. Fine young man, FSU student, Rhodes scholar. He designed the system to help the teachers at his nephew’s charter school.\nBush’s interest in expanding his education empire came under recent scrutiny in September, when the St. Augustine Record reported that the St. John’s County School District found numerous “errors” in the charter application of New World Academy.\n“I think we identified a number of errors in the application because it was a generic application that was applied to seven different districts,” said Tim Egnor, executive director for curriculum services for the district. “The numbers for enrollment didn’t make sense, the budget aspects didn’t make sense, and so now we see that those projections were probably for larger counties.”\nAdditionally, district officials questioned a possible conflict of interest with corporations that were involved in New World Academy’s application process. Ultimately, the officials were unsure of who was backing the charter school’s application.\nAccording to the Record, Stephanie Velez, manager of operations for InterVisual Technology, had been appointed a board member of New World:\nInterVisual Technology is the parent company of InterVisual Education, which founded the iGeneration Empowerment Academy in Palm Beach County. The charter opened 11 days after the start of the 2013-2014 academic year and was shut down shortly thereafter. Representatives for New World said Scholastic Ventures Management Services, a Georgia-based company incorporated in July, would be the executive management office of the charter. Dana Williams, a board member for the academy, said Scholastic Ventures had gone through a series of different names and that it was finalized with the completion of the application, submitted to the district on Aug. 4.\nGlobeNewswire reported in February of 2013 that RVPlus, Inc., a holding company of ECCO2 Tech, a global green energy group, would partner with InterVisual Technology to expand the Liberia Institute for Global Studies (LINGS), a green education program, throughout Africa, Micronesia, Asia, West Indies, and Latin America.\nAccording to GlobeNewswire, “The projected sales revenue to be generated from the partnership with Intervisual Technology are in the billions due to eligible grants and debt financing from United Nations financial aid partners, who are encouraging the new addition to the ECCO2 Civil Society Programme.”\n“This deal has been in talks and in works for almost two years,” RVPlus CEO Cary Lee Peterson said. “There was much to negotiate and comprehend in the development stages of this engagement but I think now is the perfect opportunity to take our ideas into action to help educating the youth that will be taking care of the planet thirty to forty years from now, and generations to follow.”\nBut who exactly is behind InterVisual Technology? GlobeNewswire continues:\nIntervisual Technology (“IVTI”), is an nationally accredited private school based in Florida with a physical campus, American High School located in Fort Lauderdale, engaging in educational services by physical and virtual classes for grade levels 6 to 12, which offer cost effective solutions to students and school districts globally. IVTI has a current attendance of over 2,000 students that are located within the continental US and Hawaii, in addition to international programs operating in Africa and China. The company has projected sales revenue of over $10 million for 2013 from local, state, and federal contracts and is a women-owned business established in 2007 by founder and CEO, Dana Williams, inclusive to possessing several high profile supporters and board advisors such as John Ellis “Jeb” Bush, Jr., who have enabled the school to establish robust business relationships and networks for investment and real estate opportunities.\nJeb Bush, Jr., the Governor’s son, is chief operating officer at Jeb Bush & Associates and president of Bush Reality, LLC.\n“Bush is also on the board of Intervisual, a blended charter school in Florida, Texas and Arizona,” his bio states, “a regional board member of the Hispanic Business Initiative Fund (HBIF) and a board member of the national Immigration Forum in Washington, D.C.”","url":"https://www.breitbart.com/politics/2014/12/06/jeb-bush-s-education-reform-empire/"}
