{"authors":["J. Taylor Rushing","U.S. Political Reporter","For Dailymail.Com"],"date_download":"2018-10-23 00:26:57","date_modify":"2018-10-23 00:26:57","date_publish":"2016-01-29 13:24:22","description":"Republican presidential hopeful Jeb Bush is planning to ditch the frozen cornfields of Iowa for - hopefully - sunnier skies in New Hampshire even before Iowans caucus next Monday.","filename":"data/vaneerConsumption/JebBushhasthrowninthetowelinIowaandwillleaveBEFOREthecaucuses.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30AED9F300000578-0-image-a-8_1454073770382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422766_Giving-Jeb-Bush-thrown-towel-Iowa-leave-state-Monday-night-s-caucuses-underway-Watch-New-Hampshire_1540254417.html","title":"Jeb Bush has thrown in the towel in Iowa and will leave BEFORE the caucuses","title_page":"Jeb Bush has thrown in the towel in Iowa and will leave BEFORE the caucuses | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Republican presidential hopeful Jeb Bush is planning to ditch the frozen cornfields of Iowa for - hopefully - sunnier skies in New Hampshire even before Iowans caucus next Monday.\nThe former Florida governor has decided his chances of winning the Iowa caucuses on Monday are minimal, and that his presence in New Hampshire is more necessary for his flagging campaign, according to a new report in Politico.\nBush's campaign released a schedule on Thursday that showed he will be spending Monday night at a town hall event - in Manchester, N.H.\nScroll down for videos\nRepublican presidential hopeful Jeb Bush was onstage Thursday night at the Republican presidential primary debate - which front-runner Donald Trump boycotted\nBush has long emphasized the importance of New Hampshire to his campaign's hopes, and less on Iowa, although he still plans to campaign in the Hawkeye State through Monday afternoon.\nHe also isn't alone - Ohio Gov. John Kasich and New Jersey Gov. Chris Christie are also both planning to spend Monday evening in New Hampshire, according to their campaigns.\nBush has been on a long, slow, steady slide since last July , when he reported having $114 million in the bank.\nAt one time the all-but-inevitable GOP nominee, Bush has long said his candidacy would be based on merit, not his family name, and that he would be tested through the early stages of the primary campaign.\nOnly in the middle and latter stages, he has said, his experience and acumen would prevail.\n'We are grateful for the support we have and are confident in our plan to win,' Bush spokeswoman Allie Bradenburger told Politico earlier this month.\n'Jeb will continue to campaign hard in states across the nation as our momentum for his message and record of experience continues to grow.'\nBush and Florida Sen. Marco Rubio at Thursday night's debate\nBush's campaign schedule shows he is gambling on a big showing in the state's Feb. 9 primary\nBush's top rivals are the obvious ones - Florida Sen. Marco Rubio, who is in third or even second place in some 2016 polls, and Texas Sen. Ted Cruz, who is the closest rival to front-runner Donald Trump.\nSome Bush donors are still keeping their fingers crossed for him.\n'I think Jeb has the best qualities to be the president, he’s just not doing the world’s best job of getting there,' one banker told Politico.\n'My attitude is still wait and see what happens. I can’t believe Donald Trump is going to get the nomination. As long as there is still all this insanity, there is hope for Jeb.'","url":"https://www.dailymail.co.uk/news/article-3422766/Giving-Jeb-Bush-thrown-towel-Iowa-leave-state-Monday-night-s-caucuses-underway-Watch-New-Hampshire.html"}
