{"authors":["Portia Crowe"],"date_download":"2018-10-31 00:25:00","date_modify":"2018-10-31 00:25:00","date_publish":"2016-12-01 00:00:00","description":"Important markets like initial public offerings and leveraged finance were quieter than normal even after the first quarter, Handler said.","filename":"data/vaneerConsumption/JefferiesCEORichHandleron2016and2017performance.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_jefferies-ceo-rich-handler-on-2016-and-2017-performance-2016-12_1540945500.html","title":"Jefferies CEO Rich Handler on 2016 and 2017 performance","title_page":"    Jefferies CEO Rich Handler on 2016 and 2017 performance - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Rich Handler, Jefferies CEO Getty Images/ Rob Kim Jefferies has \"not been operating at normal levels\" this year, but is well-positioned for 2017.\nThat's according to a candid letter CEO Richard Handler sent to staff Thursday to mark the end of the fiscal year.\n\"The first quarter of 2016 was one of the most painful periods we have experienced in our careers,\" Handler and chairman Brian Friedman wrote.\n\"Our results were horrible, as we dug ourselves into a pretty good-sized hole.\"\nBanks across the board were wiped out in the first quarter of this year.\nPerformance has since bounced back at Jefferies, Handler said, although \"the aggregate result for 2016 clearly will not be acceptable for any of us.\"\nImportant markets like initial public offerings and leveraged finance were quieter than normal even after the first quarter, Handler said. The firm has \"shrunk or eliminated\" challenged businesses and will continue to do so going forward.\nShares of Jefferies' parent company, Leucadia National Corporation, are up 32% year-to-date.\n\"We believe in our bones that 2017 should be a year in which we can truly break out and optimize all our hard work over these past two challenging years,\" he wrote.\nHandler finished the letter by asking staff to be honest and realistic in their year-end compensation expectations, to \"give December their all in terms of work ethic,\" and to be ready to \"hit the ground running full force\" on January 3 next year.\nHere's the full note:\n\"Today, we start Jefferies' 2017 fiscal year. We would like to share with each of you our brief perspective on our 2016 and on our future together:\n\"The first quarter of 2016 was one of the most painful periods we have experienced in our careers. Our results were horrible, as we dug ourselves into a pretty good-sized hole. This was not done maliciously, carelessly, or by just a small group of individuals or teams. Instead of blaming the environment or others, or pretending it didn't happen, we collectively rolled up all our sleeves and went to work to overcome this mess. With our strong culture, flat operating structure, and strong sense of pride and ownership, we stayed in the game and our entire firm pivoted from being on the wrong side of an impossible market to being even more focused and even better situated to help those who depend upon us. We spent the next three quarters performing for our clients, and executing for our shareholders and bondholders. The environment has been less ugly since the first quarter, but until very recently it was far from robust. Many of our important markets (such as IPO and Leveraged Finance) were quieter than normal even after the first quarter. Even though we were not operating at normal levels on many of our cylinders, we did a much better job these past three quarters and our results have been generally solid. While the aggregate result for 2016 clearly will not be acceptable for any of us or our fellow shareholders, given where we were at the end of Q1, the two of us are thrilled with how you handled this adversity and we take pride in all that each of you have accomplished, especially over these past nine months.\n\"The best part of our 2016 story is how well we are all positioned for 2017. Our balance sheet and risk are resized to what we believe we are the right place for whatever 2017 throws our way. Our Jefferies tribe has never been better or more capable, as we have made (and will continue to make) key hires across the platform that complement our strong foundation of human capital. Our competitive position has never been stronger and we can all see the potential for future market share gains across every one of our businesses. We have shrunk or eliminated businesses that had challenges or did not have the long term potential to justify the investment by our shareholders. We are not done on this task, as it is always a work in process. Our brand has risen, while others have diminished. We believe in our bones that 2017 should be a year in which we can truly break out and optimize all our hard work over these past two challenging years. Nobody knows what the future will hold in our industry, but we would \"rather be us\" than anyone else!\n\"We have three specific goals to achieve in December:\n1. We want everyone at Jefferies to be compensated fairly, taking all relevant information into account. We do this every year, and ask each of you to be honest and realistic when assessing your own performance, contribution and behavior, your business unit's performance and contribution, and the firm's overall results, as well as taking into account the compensation practices of our competitors and the market generally. Please don't make this any more challenging than it should be. We are all very lucky and, if you can't show it, you should please know it.\n2. We want everyone to give December their all in terms of work ethic. This is the start of our 2017 year and we need to play offense while everyone else is winding down. We want and deserve a strong start to 2017.\n3. We want each of you to find time to relax with your families, recharge your batteries, reflect on all the wonderful things you have in your lives and be prepared to hit the ground running full force on January 3, 2017.\n\"Happy Fiscal New Year to All,\n\"Rich and Brian\"","url":"https://www.businessinsider.com/jefferies-ceo-rich-handler-on-2016-and-2017-performance-2016-12"}
