{"authors":["Hannah Paine For Daily Mail Australia"],"date_download":"2018-10-22 23:07:20","date_modify":"2018-10-22 23:07:20","date_publish":"2017-04-26 06:43:48","description":"Jeff Goldblum, 64, made a very unexpected appearance in Sydney on Wednesday, popping up at a food truck in Sydney's CBD, jumping inside the truck and handing out free sandwiches.","filename":"data/vaneerConsumption/JeffGoldblumhandsoutfreesandwichesinSydney.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/07/3F9CF98D00000578-0-image-a-22_1493189355696.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446228_Jeff-Goldblum-hands-free-sandwiches-Sydney_1540249640.html","title":"Jeff Goldblum hands out free sandwiches in Sydney","title_page":"Jeff Goldblum hands out free sandwiches in Sydney | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's confirmed to be appearing in the highly-anticipated sequel to Jurassic World.\nBut Jeff Goldblum, 64, made a very unexpected appearance in Sydney on Wednesday, popping up at a food truck in Sydney's CBD.\nThe Jurassic Park star was handing out free sausage sandwiches to hungry lunch goers in Wynyard.\nWho's hungry? Jeff Goldblum takes over Sydney food truck and hands out sandwiches\nThe popular actor was dressed casually for the unexpected appearance, wearing a polo shirt, leather jacket and jeans.\nJeff was quick to take off his jacket and get inside the truck, handing out sausage sandwiches to commuters walking past.\nOne man seemed surprised but pleased to receive a free lunch from the American movie star.\nHard at work! Jeff was quick to take off his jacket and get inside the truck, handing out sausage sandwiches\nIn shock? One man seemed surprised but pleased to receive a free lunch from the American movie star\nChatting in the locals: Jeff chatted to some of the attendees\nLater on Jeff snapped selfies with fans passing by, even shaking hands with one of them.\nThe surprise lunch appearance comes as it was today confirmed by The Hollywood Reporter that Jeff will be reprising his role in the Jurassic World sequel alongside Chris Pratt.\nJeff shot to fame first appearing in Jurassic Park in 1993 as mathematician Ian Malcolm, later starring in its 1997 sequel.\nPlenty to smile about: The surprise lunch appearance comes as it was today confirmed by The Hollywood Reporter that Jeff will be reprising his role in the Jurassic World sequel\nThe Jurassic World casting comes as Jeff welcomed his second child with wife of two years Emilie Livingston, 34.\nHis son River was born earlier this month and joins 21-month-old big brother Charlie Ocean.\nJeff will next appear on screen with Aussie actors Chris Hemsworth and Chris Pratt in Thor: Ragarnok.\nSay cheese! Jeff snapped selfies with fans passing by who looked surprised to see him","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446228/Jeff-Goldblum-hands-free-sandwiches-Sydney.html"}
