{"authors":["Associated Press"],"date_download":"2018-10-23 02:52:23","date_modify":"2018-10-23 02:52:23","date_publish":"2017-04-26 14:10:50","description":"NEW YORK (AP) - Jeff Kinney remembers when his goal was to write a book, one big book, for grown-ups.\"I thought I'd write about a year in the life of a...","filename":"data/vaneerConsumption/JeffKinneymarks10thanniversaryofWimpyKidseries.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/14/wire-465401-1493212565-932_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447768_Jeff-Kinney-marks-10th-anniversary-Wimpy-Kid-series_1540263143.html","title":"Jeff Kinney marks 10th anniversary of 'Wimpy Kid' series","title_page":"Jeff Kinney marks 10th anniversary of 'Wimpy Kid' series | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - Jeff Kinney remembers when his goal was to write a book, one big book, for grown-ups.\n\"I thought I'd write about a year in the life of a typical kid,\" says the children's author known to millions for his \"Diary of a Wimpy Kid\" series. \"I'd write one book that was between 700 and 1,000 pages long and I'd look at every aspect of childhood within that time frame. Furthermore, I was writing for the humor section of the bookstore, not the middle grade section.\"\nKinney spoke to The Associated Press recently as he looked back at the decade since \"Diary of a Wimpy Kid\" made him one of the world's most popular writers. The first 11 novels have sold more than 180 million copies and the series has been the basis for four movies, with the latest, \"Diary of a Wimpy Kid: The Long Haul,\" scheduled for May 19. Abrams Books told the AP on Wednesday that the 12th book, coming Nov. 7, will be called \"Diary of a Wimpy Kid: The Getaway.\"\nFILE - This April 21, 2012 file photo shows Jeff Kinney at the LA Times Festival of Books in Los Angeles. The first 11 novels have sold more than 180 million copies and the series has been the basis for four movies. (AP Photo/Katy Winn, File)\nThe misadventures of middle schooler Greg Heffley, sketched in readers' minds as a skinny boy with a round head and precious few strands of hair, have stood out in two ways in the book world - they appeal equally to girls and boys (sometimes known euphemistically as \"reluctant readers\"), and they have consistently sold more than 1 million copies in hardcover, an achievement few books attain anymore thanks in part to the rise of e-books and the fall of the Borders superstore chain.\n\"The books are funny and appeal to all levels of readers,\" says Judy Bulow, lead buyer for the children's section of the Tattered Cover bookstore in Denver. \"And we've seen a plethora of stories from other authors (Rachel Renee Russell's \"Dork Dairies,\" Tom Watson's \"Stick Dog\") like that, with a lot of illustrations and clever humor. The kids eat them up. If there's not a new 'Wimpy Kid' book, they want something like it.\"\nKinney, 46, is a Fort Washington, Maryland, native who studied at the University of Maryland, College Park, and while in school created a comic strip that ran in the campus newspaper. Kinney, speaking by phone near the bookstore that he and his wife, Julie, own in Plainville, Massachusetts, recalls how Heffley had been on his mind for years before he finally got a book deal. He liked the idea of a kid defined not by heroics, but by \"flaws and imperfections,\" not unlike what the author saw in himself.\nHeffley was introduced to many in 2004 through a funbrain.com web series that Kinney published for free that attracted millions of visitors. Two years later, Kinney attended the first New York Comic-Con. He stopped by the Abrams booth, purchased a copy of Brian Fies' graphic novel \"Mom's Cancer\" and spoke to Abrams editorial director Charles Kochman, who recalls Kinney asking him if he would look at his work.\n\"At these shows you're constantly getting pitched stuff, and most of it is forgettable,\" says Kochman, who still edits Kinney. \"As he handed it to me, he said, 'I have this web comic called 'Diary of a Wimpy Kid,' and the image he showed me was the image we used for Book One. I remember thinking, 'I wish something like this had been around when I was a kid.'\"\nThe series debuted in April 2007 with a first printing of 25,000 copies and early praise from Publishers Weekly, which cited Kinney's \"gift for believable preteen dialogue and narration.\" The book was on The New York Times' best-seller list by May and remained there long after. Kinney, meanwhile, learned that his work had caught on with an unexpected audience.\n\"Once the book came out, I started getting emails from teachers thanking me, saying almost 95 percent of the time, 'You got my reluctant reader to read,'\" Kinney says. \"I had never heard that phrase before. And I found out that it was a big deal, that 'reluctant readers' was code for boys. The letters I got from kids would simply say they thought the books were funny.\"\nAccording to Abrams, Kinney's next \"Wimpy Kid\" novel will find Greg on a holiday trip, although \"what's billed as a stress-free vacation becomes a holiday nightmare.\" The author hopes to complete at least 20 in the series and likes that Heffley, unlike Harry Potter, can always stay the same age. Kinney still thinks about writing books for adults and nonfiction projects, but for fiction he is sticking with kids.\n\"I've learned that I'm a children's writer,\" he says. \"I didn't know it when I was starting off, but I know it now.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4447768/Jeff-Kinney-marks-10th-anniversary-Wimpy-Kid-series.html"}
