{"authors":["Candice Jackson For Daily Mail Australia"],"date_download":"2018-10-23 00:57:21","date_modify":"2018-10-23 00:57:21","date_publish":"2017-04-26 10:59:00","description":"Actor Jeff Goldblum hinted at a new gig during a very unexpected appearance in Sydney on Wednesday.","filename":"data/vaneerConsumption/JeffGoldblumsurprisesSydneyfanswithfoodtruckstunt.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9DAD5000000578-0-image-a-16_1493200133339.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446824_Jeff-Goldblum-surprises-Sydney-fans-food-truck-stunt_1540256241.html","title":"Jeff Goldblum surprises Sydney fans with food truck stunt","title_page":"Jeff Goldblum surprises Sydney fans with food truck stunt | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He confirmed he will appear in the highly-anticipated sequel to Jurassic World.\nAnd Actor Jeff Goldblum, 64, appeared to hint at another new gig during a very unexpected appearance in Sydney on Wednesday.\nThe Hollywood star revealed to The Daily Telegraph while acting as a street food vendor: 'I'm doing a project that I have to be secretive about but there is some thematic tie-in to this.'\n'Jeff Goldblum just made me a sandwich!' Jurassic Park actor surprises Sydney fans with bizarre 'Chef Goldblum's Jazzy Snags' food truck stunt linked to secret project on Wednesday\nJeff confirmed that he will appear in the highly-anticipated sequel to Jurassic World (Pictured: Jurassic Park, 1993)\nJeff was spotted manning his 'Chef Goldblum's Jazzy Snags' branded food truck, handing out sausage sandwiches to punters in Sydney's Wynyard and Circular Quay.\nThe Jurassic Park star was handing out free sausage sandwiches to hungry lunch goers while dressed in a polo shirt, leather jacket and jeans.\nThe American actor also cryptically added: 'I'm doing a little research for some work that I'm going to do in my chosen profession.'\n'I like food, I'm very interested in food, but you'll have to wait,' he continues, not giving anything away to fans or media.\n'I'm doing a little research for some work that I'm going to do': Jeff appeared to hint that his appearance as a street food vendor may be linked to a future role or project\nFeeding hungry fans! Jeff was spotted manning the 'Chef Goldblum's Jazzy Snags' food truck, handing out sausage sandwiches to punters in Sydney's Wynyard and Circular Quay\nJeff stunned passersby, with many taking to social media to document their encounter with the actor.\n'Jeff Goldblum just made me a sandwich!' He was really cool, I was really awkward. standard,' one fan wrote.\nOthers got close with the star, with one lady stroking his beard and another asking him to touch her mother's ashes.'\n'I met Jeff Goldblum AND he gave me the most delicious sausage sandwich ever (for free)' Fans happily lined up for their chance to speak to and take a quick selfie with the American star\n'OH MY GOSH THIS JUST HAPPENED. I met Jeff Goldblum AND he gave me the most delicious sausage sandwich ever (for free),' another excited fan in disbelief shared.\nAs the lines gathered, many fans heard the news from others: 'Heard about a 'Chef Goldblum' foodvan in Sydney, went down and got to give compliments to the Chef himself!'\nWhile it confused many Sydney lunch goers, one summed it up in his grateful post: 'Why was Jeff Goldblum handing out free snags in Sydney CBD today? Who knows! Just go with it.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446824/Jeff-Goldblum-surprises-Sydney-fans-food-truck-stunt.html"}
