{"authors":["Rachel Simon"],"date_download":"2018-10-30 23:36:03","date_modify":"2018-10-30 23:36:03","date_publish":"2014-08-13 16:19:58","description":"It's a testament to both his lovable personality and remarkable film career that in the days following Robin Williams' death, seemingly every star in Hollywood has spoken about his impact on their lives. Jimmy Fallon, Matt Damon, Sarah Michelle…","filename":"data/vaneerConsumption/JeffBridgesMemoryofRobinWilliamsinTheFisherKingisSweetHilarious.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/eb7f29f1-348b-46e0-99d2-57252aa78228.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35600-jeff-bridges-memory-of-robin-williams-in-the-fisher-king-is-sweet-hilarious_1540942563.html","title":"Jeff Bridges' Memory of Robin Williams in 'The Fisher King' is Sweet & Hilarious","title_page":"Jeff Bridges' Memory of Robin Williams in 'The Fisher King' is Sweet & Hilarious","title_rss":"NULL","source_domain":"bustle.com","text":"It's a testament to both his lovable personality and remarkable film career that in the days following Robin Williams' death, seemingly every star in Hollywood has spoken about his impact on their lives. Jimmy Fallon, Matt Damon, Sarah Michelle Gellar — whether they worked together for three months or three years, practically everyone has had something to say about the beloved actor, including his Fisher King co-star, Jeff Bridges. At a Tuesday press conference for The Giver, Bridges spoke about Williams' tragic passing and the greatness of the late actor's lasting legacy.\n\"I just want to acknowledge the fullness of life, the joy and the sadness that is in store for us all, and I'm filled with both of them today, as I was last night, learning of my dear friend's passing,\" said Bridges.\nIn The Fisher King, Bridges and Williams co-starred as a guilt-ridden shock jock and a grieving homeless man, respectively, whose lives became intertwined after the radio DJ inadvertently caused the mass murder that took the life of the other man's wife. Both actors won huge acclaim for their performances, with Williams garnering an Oscar nomination for his role as Parry, an odd, deluded character famously based on New York City's legendary RadioMan.\nAnd on Monday night, shortly after learning about Williams' death, Bridges ran into none other than the iconic figure himself.\n\"I'm sitting there with my wife trying to gather myself, and I look out the window and I say, is that Robin? Is that his ghost? No, it's RadioMan!\" Bridges recalled, laughing.\n\"I got out of the car and I embraced RadioMan and looked in his face,\" he continued, later adding, \"I could not believe that Robin's character was there in the flesh.\"\nBridges shared a memory he had of making The Fisher King, a scene where he and Williams stood outside, naked, and Williams was just \"wild and free.\"\n\"It brought back all of these wonderful feelings of what an amazing time together we had here in New York shooting The Fisher King,\" he said. \"Me and Robin out there at four o'clock in the morning, nude, naked. And Robin is just wild and free and he says, 'let the wild pony dance!' And he's rubbing his butt on the grass, and saying, 'you know why dogs do this? because they can!' So wild.\"\nAs Bridges spoke and gesticulated, his Giver co-star Meryl Streep nodded in recognition, clearly remembering the late actor's huge spirit.\n\"I just had to share that with you, because that's what's going on so strongly and how much I miss him, and I'm sure you guys do too,\" Bridges finished. \"What a gift he was to all of us... that's all I wanted to say. And now, let the wild rumpus start.\"\nImage: TriStar Pictures","url":"https://www.bustle.com/articles/35600-jeff-bridges-memory-of-robin-williams-in-the-fisher-king-is-sweet-hilarious"}
