{"authors":["Rachel Simon"],"date_download":"2018-10-30 23:39:00","date_modify":"2018-10-30 23:39:00","date_publish":"2014-08-13 15:15:05","description":"People make petitions for a lot of silly things: constructing a Death Star. Getting Justin Bieber deported. Tracking down Waldo. Typically, these efforts are laughed off and forgotten, but occasionally, there's one that actually gains some momentum.…","filename":"data/vaneerConsumption/JeffBridgesforSenateImaginingTheDudeasaUSPolitician.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/73547a83-01ac-4bf2-866e-3394e39278ae.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35585-jeff-bridges-for-senate-imagining-the-dude-as-a-us-politician_1540942740.html","title":"Jeff Bridges for Senate? Imagining The Dude as a U.S. Politician","title_page":"Jeff Bridges for Senate? Imagining The Dude as a U.S. Politician","title_rss":"NULL","source_domain":"bustle.com","text":"People make petitions for a lot of silly things: constructing a Death Star. Getting Justin Bieber deported. Tracking down Waldo. Typically, these efforts are laughed off and forgotten, but occasionally, there's one that actually gains some momentum. The reasons vary: sometimes it's that they're dumb, sometimes it's that they're crazy, and sometimes it's that they're absolutely brilliant, such as a recent Change.org petition that wants Jeff Bridges to run for Senate.\nIn the petition, started by a resident of Billings, The Giver star and Montana homeowner is encouraged to run for the U.S. Senate because of several important factors.\n\"Jeff is a great person,\" the petition says. \"He has loved Montana and all it represents since he first set up residence in Park County four decades ago. He has great name recognition! Charisma! Brains! He's internationally reknowned [sic], but he is also highly accessible. We need the Dude to be Montana's next U.S. Senator!\"\nSo far, 1,449 people have signed the petition out of the 20,000 needed. Many of the signers state their support as done out of need for a Democratic candidate (the incumbent Democratic Senator recently backed out of the race), while others just seem to love the idea of the Dude in Congress.\nAnd I totally get why; although, yes, it would be Jeff Bridges the person, not the Dude the character in the Senate seat, it's still great to think that one of the best creations in movie history could secure a spot in the U.S. government. Just imagine what it'd be like:\nMandatory Bowling Practice\nStuck in a bind? Can't come to a compromise? Take a break and go bowling, using the new alley that the Dude commissioned during his first week in the Senate. No more talks over golf or hunting at Camp David; for the Dude, bowling would be the way to go when it came to making tough political decisions.\nLegislation Passed for the Legalization of Marijuana\nLed by the Dude, but with full support from his fellow Senators, who he'd surely have...persuaded that weed is something to embrace.\n24/7 Supervision of His Rug\nIn the Dude's office would be a gorgeous, stain-free rug, and he'd refuse to allow anyone who looked even slightly suspicious to come near it without full-time supervision.\nUnwavering Support for Antiwar Policies\nAs a former member of antiwar groups and a proponent for peace and love, the Dude would not abide by any legislation that encouraged violence and warfare. Instead, he'd put his past activism to use, writing and supporting legislation that supported ending violent activity and working for peace.\nAn Open Bar, Wherever and Whenever\nFilled with — what else? — White Russians, and available to use at any given time or place. When the Dude wants his drink, he gets it.\nImages: Gramercy Pictures (5); Tumblr","url":"https://www.bustle.com/articles/35585-jeff-bridges-for-senate-imagining-the-dude-as-a-us-politician"}
