{"authors":["Jason Chester For Mailonline"],"date_download":"2018-10-23 02:01:08","date_modify":"2018-10-23 02:01:08","date_publish":"2017-03-10 10:35:42","description":"The heavily tattooed pair passed the time with an impromptu game of volleyball after hitting the beach, were Jemma’s decision to go topless ensured they were hard to miss.","filename":"data/vaneerConsumption/JemmaLucytoplessonaDominicanRepublicbeach.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E22412400000578-0-image-a-40_1489142643438.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300670_Jemma-Lucy-goes-topless_1540260068.html","title":"Jemma Lucy topless on a Dominican Republic beach","title_page":"Jemma Lucy topless on a Dominican Republic beach | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Their protracted sunshine break showed no sign of ending as Jemma Lucy and close friend Chantelle Connelly enjoyed another sun-soaked appearance in the Dominican Republic.\nThe heavily tattooed pair passed the time with an impromptu game of volleyball after hitting the beach, where Jemma’s decision to go topless ensured they were hard to miss.\nWith her own assets covered in a scarlet swimsuit, Chantelle looked every inch the Baywatch babe as they frolicked on the sand.\nScroll down for video\nHere they come: Their protracted sunshine break showed no sign of ending afternoon as Jemma Lucy and close friend Chantelle Connelly enjoyed another sun-soaked appearance in the Dominican Republic\nThe former Geordie Shore star completed her beach ready look with a jaunty baseball cap, while her intricate leg tattoo - winding from thigh to ankle - was on full display.\nOpting for skimpy white bikini-bottoms, divisive Ex on the Beach star Jemma, 27, revealed her numerous colourful inkings.\nEvidently in high spirits, she beamed while racing to catch the ball during a vigorous match with her voluptuous pal.\nGeordie phwoar! With her own assets covered in a vibrant red swimsuit, Chantelle looked every inch the Baywatch babe\nPlay time: The heavily tattooed pair passed the time with an impromptu game of volleyball after hitting the beach, where Jemma’s decision to go topless ensured they were hard to miss\nGood times: The pair were in high spirits during their latest appearance in the Dominican Republic\nThe pair later continued a recurring theme by kissing through their volleyball net before making their way across the beach hand in hand.\nJemma and Chantelle have been enjoying a protracted stay in the Dominican Republic after seemingly rekindling their romance.\nMTV star Jemma originally set tongues wagging when she was spotted kissing Chantelle in public.\nAll mine: The pair later continued a recurring theme by kissing through their volleyball net\nOn the ball: Jemma and Chantelle enjoyed a carefree game after making their way onto the beach for another day of rest and relaxation\nClose: The pair were hand in hand as they made their way across the beach on Thursday\nHighly noticeable: Opting for skimpy white bikini-bottoms, divisive Ex on the Beach star Jemma, 27, revealed her numerous colourful inkings\nEye-catching: Former Geordie Shore star completed her beach ready look with a jaunty baseball cap, while her intricate leg tattoo - winding from thigh to ankle - was on full display\nSharing a video of the pair together, Jemma claimed: 'Yes, I am going out with Chantelle. We have been together for about a month.'\nHowever, Chantelle later tweeted to her 165,000 followers that it was all a ploy, posting: 'Just to let everyone know the whole me and @jem_lucy relationship was laugh since the papers started it we rode it and had the last laugh.' (sic) followed by two money emojis.\nDespite those claims the pair have certainly looked close throughout their recent getaway.\nShe's pleased: Evidently in high spirits, Jemma beamed as she frolicked on the sand\nDon't mind me: But the Ex On The Beach star was hard to miss on Thursday morning\nJumping for joy: Chantelle stretched her toned body as she reached for the ball\nHere we go: Sprightly Jemma was clearly loving life during her latest outing on the tropical holiday hot-spot\nNearly there: Chantelle saw the funny side as she stumbled while racing to grab the incoming volleyball\nJemma shared a snap of the duo hugging on Instagram on Wednesday, but the picture was swiftly removed by moderators.\nFuming over the seemingly innocent snap being taken down, she lashed out at her followers in a foul-mouthed rant.\nJemma wrote: 'As if this picture got reported u jealous c**** anyway. - Loving my @infinitybraceletuk that my girl @chantellegshore got me for my holiday.'\nFeeling better: Jemma was fuming after a snap of her and Chantellke was removed from social media, but she appeared to be in better spirits on Thursday\nSo much fun: The reality star showed off her body as she prepared to fire the ball over the net","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300670/Jemma-Lucy-goes-topless.html"}
