{"authors":["Rebecca Lawrence For Mailonline"],"date_download":"2018-10-23 04:18:42","date_modify":"2018-10-23 04:18:42","date_publish":"2016-01-28 20:18:10","description":"She's never been shy of showing off her curvaceous figure.But on Wednesday, Jemma Lucy left very little to the imagination as she enjoyed a night out with her friend Cally Jane Beech, flashing her ample assets.","filename":"data/vaneerConsumption/JemmaLucyputsonaVERYbustydisplayintightsheervestwithCallyJaneBeech.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30ACF9D100000578-0-image-a-23_1454007720838.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421501_Jemma-Lucy-puts-busty-display-tight-sheer-vest-Cally-Jane-Beech_1540268322.html","title":"Jemma Lucy puts on a VERY busty display in tight sheer vest with Cally Jane Beech","title_page":"Jemma Lucy puts on a VERY busty display in tight sheer vest with Cally Jane Beech | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's never been shy about showing off her curvaceous figure.\nBut on Wednesday, Jemma Lucy left very little to the imagination as she enjoyed a night out with her friend Cally Jane Beech, flashing her ample assets in a skintight sheer vest.\nWith just a small strip of satin protecting her modesty, the 27-year-old Ex On The Beach star put on a seriously busty display as she headed into Zuma restaurant in London's Knightsbridge.\nScroll down for video\nGot a lot of front! With just a small strip of satin protecting her modesty, Jemma Lucy, 27, put on a very busty display as she headed into Zuma restaurant in Knightsbridge, London, on Wednesday night\nTeaming her risqué top with a beige pencil skirt, the heavily tattooed star wrapped up against the cold in a navy faux fur stole.\nAdding some height to her curvaceous frame with a pair of mesh shoes, the pretty star seemed determined to flash as much flesh as possible.\nScraping her golden locks into a high ponytail, the bronzed model also ensured her impressive ink collection was on full display.\nBosom buddies! The Ex On The Beach star left very little to the imagination as she enjoyed a night out with her friend Cally Jane Beech, flashing her ample assets in a skintight sheer vest\nFeeling nippy! Whilst she sheltered from the cold in a faux fur navy stole, the pretty star seemed determined to flash as much flesh as possible, donning a pair of see-through mesh heels\nMeanwhile, Love Island star Cally cut an equally glamorous figure, pouring her curves into a cutaway little black dress.\nWith mesh paneling showcasing her impressive cleavage, and the pencil skirt design hugging her pert posterior, the full extent of the 23-year-old's gym honed body was on display.\nSlipping her feet into a pair of white strappy heels, the raven haired beauty looked like she was ready for a big night out rather than a quiet Japanese meal.\nBreast friends! The girls seemed to be in good spirits on their dinner date, linking arms and giggling, and despite being brazen with their outfit choices, the friends put on a relatively demure display\nAccentuating her flawless features with a heavy coverage of dewy foundation and a sweep of bronzer, the dental nurse brought attention to her plump pout with a slick of rosy gloss.\nContoured to perfection, she framed her ice blue eyes with lashings of mascara.\nBoth made-up and turned out, the girls seemed to be in good spirits on their dinner date, linking arms and giggling.\nLeggy lady! With mesh paneling showcasing her impressive cleavage, and the pencil skirt design hugging her pert posterior, the full extent of the 23-year-old's gym honed body was on display\nBut despite being brazen with their outfit choices, the girls put on a relatively demure display following their saucy encounter last Wednesday.\nFollowing the National Television Awards - which neither star was invited to - the pair decided to throw their own unofficial afterparty, finishing off the evening with an over amorous display.\nAfter partying the night away at DSTRKT nightclub, the friends shamelessly stopped for several smooches on the street, with the awkward encounter caught on camera.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421501/Jemma-Lucy-puts-busty-display-tight-sheer-vest-Cally-Jane-Beech.html"}
