{"authors":["Paul Chavez For Dailymail.Com"],"date_download":"2018-10-22 23:31:49","date_modify":"2018-10-22 23:31:49","date_publish":"2017-03-10 03:12:27","description":"The 44-year-old actress spent time with her children Thursday after reportedly calling off her divorce from Ben Affleck.","filename":"data/vaneerConsumption/JenniferGarnershopsinLAaftercancellingdivorce.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/02/3E1F660600000578-0-image-a-71_1489114660422.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299790_Jennifer-Garner-goes-shopping-children-Los-Angeles_1540251109.html","title":"Jennifer Garner shops in LA after cancelling divorce","title_page":"Jennifer Garner shops in LA after cancelling divorce | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jennifer Garner spent time with her children Thursday after reportedly calling off her divorce from Ben Affleck.\nThe 44-year-old went shopping with five-year-old son Samuel and 11-year-old daughter Violet in the Brentwood area of Los Angeles.\nJennifer kept it casual with a blue T-shirt, blue skinny jeans and white sneakers.\nShopping time: Jennifer Garner kept it casual while shopping with her children Thursday in Los Angeles following a report that she has called off her divorce from Ben Affleck\nShe accessorized with sunglasses and had her dark brown hair gathered in a low ponytail.\nSamuel held hands with Jennifer while they crossed an intersection together and wore a Star Wars T-shirt featuring a light saber duel.\nViolet donned a black sweater with white polka dots over white capri trousers along with sandals.\nShe wore black glasses and carried a paperback book titled Raising Twins: From Pregnancy to Preschool.\nCasual style: The actress wore a blue T-shirt and blue skinny jeans while out with son Samuel\nWinning smile: Jennifer flashed her dimples while crossing an intersection with her son\nJennifer and Ben, 44, also have eight-year-old daughter Seraphina together.\nThey announced they were divorcing in June 2015 after 10 years of marriage amid rumors Ben had cheated with a nanny.\nJennifer decided to call off the divorce from her estranged husband and they are in 'marriage-repair mode,' according to an article Wednesday by People.\nMoving crew: A moving crew was spotted Wednesday at Jennifer's home in Los Angeles\nInteresting reading: Violet carried a paperback book titled Raising Twins: From Pregnancy to Preschool\nFamily outing: Samuel and Violet accompanied Jennifer to a clothing store\nShe was set to move ahead with the divorce a month ago but their relationship made an abrupt turn.\n'Jen has called off the divorce. She really wants to work things out with Ben. They are giving things another try,' a source close to Jennifer told People.\nA moving truck was spotted Wednesday at the family's Los Angeles home where Ben has continued to live since their split.\nStore selection: The actress checked out items for sale at a Jill Roberts store\nAthletic look: Jennifer wore sweatpants inside the store\nThey have been an example of how to co-parent for the past 20 months.\nJennifer and Ben a day after the Oscars threw a joint birthday party for Samuel that made it seem like everything was back to normal.\nIt's been tough though getting to this point.\n'Life with Ben has always been up and down for Jen,' another source told the magazine. 'Jen made it clear to Ben a while ago that she wants to have a life with three kids and one husband and not feel like she had four kids. It's exhausting having to worry about Ben constantly.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299790/Jennifer-Garner-goes-shopping-children-Los-Angeles.html"}
