{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:34:43","date_modify":"2018-10-30 19:34:43","date_publish":"2015-05-17 02:09:36","description":"Parents and kids showed up in droves at the California Democratic Convention Saturday for a protest against SB 277 and other legislation. |","filename":"data/vaneerConsumption/JennaElfmanJoinsParentsAgainstMandatoryVaccinationBillatDemConvention.json","image_url":"https://media.breitbart.com/media/2015/05/VAccianation-_0384.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_05_16__1540928083.html","title":"Jenna Elfman Joins Parents Against Mandatory Vaccination Bill at Dem Convention","title_page":"Jenna Elfman Joins Parents Against Mandatory Vaccination Bill at Dem Convention | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Parents, kids and Hollywood celebs showed up in droves to the California Democratic Convention Saturday for a protest against SB 277 and other legislation that eliminates opt-outs of one or more mandated vaccinations.\nGolden Globe winning actress Jenna Elfman along with many other parents involved in the rally, said they actually do vaccinate their children, but see the legislation as a slippery slope in Constitutional parental rights. The rally drew up to an estimated 1,000 participants. Conversation around the bill has crossed party lines in one of the more contentious fights seen in the Democrat controlled legislature.\nHeather Hawkes, a strong opponent of SB 277, told Breitbart that she is new to politics, but is heading up efforts in San Diego against the bill. She echoed many in the crowd that say they do vaccinate, but oppose the infringement on parental rights. Hawkes said her group has been meeting with legislators regarding SB 277. Under the bill parents wishing to choose not to vaccinate a child for any one of the required vaccinations would be relegated to the options of homeschool or independent study. Currently 2.54% of California Kindergarteners have personal belief waivers on file. Those waivers would be eliminated under SB 277. Hawkes indicated that this applies even for potentially STD related diseases like Hepatitis B.\nFormer Assemblyman Tim Donnelly was found among the crowd talking to protesters for the next edition of his radio program that will air Monday. Donnelly was active in defending an immigrant couple that had their five-month-old baby taken away by Child Protective Services (CPS). The government agency took baby Sammy from his parents when they sought a second medical opinion after being told their child had a medical condition and that he needed a surgery.\nElfman noted a provision in the bill that requires parents to homeschool or enroll their children in independent study if they choose to opt out of any one or more required vaccinations. She countered that option, “Single parent working families who would like a choice over their children, over what to do with their children’s bodies, can’t homeschool if they want.”\n“You open up the door of taking away parents’ rights, you open the door to a Constitutional slippery slope,” Elfman emphasized in closing.\nA posting for Saturday’s SB 277 protest read in part:\n“We will be seen and heard, by the California Democratic Party regarding forced vaccinations in California and losing our rights as parents in a free society … This is a violation of our Democratic Leadership to the California People. This is for all CA citizens – not just Democrats.”\nTwo Democrats coauthored the Senate Bill 277 that has drawn such attention. Committee hearings were flocked with the strong opinions and debate leading to some amendments. The bill has passed out of the California Senate and has moved on to the Assembly. A crop of vaccine legislation showed up following an outbreak of measles that began at Disneyland last December. The California Department of Public Health notes that the strain of measles that occurred likely came from outside the United States.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/05/16/jenna-elfman-joins-parents-against-mandatory-vaccination-bill-at-dem-convention/"}
