{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 03:16:57","date_modify":"2018-10-23 03:16:57","date_publish":"2017-03-10 12:47:00","description":"The 26-year-old former escort finally makes her Ex On The Beach debut, emerging from the sea on next on next Tuesday's upcoming episode of the MTV reality show.","filename":"data/vaneerConsumption/JennyThompsonmakesExOnTheBeachdebutinabikini.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22CA2D00000578-0-image-a-73_1489149700597.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301150_Bikini-clad-Jenny-Thompson-makes-Ex-Beach-debut_1540264617.html","title":"Jenny Thompson makes Ex On The Beach debut in a bikini","title_page":"Jenny Thompson makes Ex On The Beach debut in a bikini | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been teasing her Ex On The Beach debut for weeks.\nAnd it's not long before JeThe 26-year-old former escort, famed for sleeping with Wayne Rooney, stuns in a lime green bikini with a black lace trim as she has her Baywatch moment.\nWaiting anxiously to see whose ex is next to emerge from the sea were Aaron, Harriette and Josh.\nScroll down for video\nBeach babe: Jenny Thompson finally makes her Ex On The Beach debut, emerging from the sea on next on next Tuesday's upcoming episode of the MTV reality show\nTo Josh’s surprise, it’s his ex Jenny, and the hunk is relieved, as there is no animosity between the two.\nHe revealed: 'It could have been ten times worse'.\nAs Jenny is welcomed to the beach, the Tablet of Terror chimes again and sends Aaron and Jenny on a beer pong date.\nCheeky kiss: It's not long before Jenny makes a move on Geordie Shore hunk Aaron\nLoving the limelight: The former escort looked like she enjoyed every moment as she emerged from the sea\nDuring their date, both Aaron and Jenny confirm they’re single and have no loyalties to either Josh or Becca - it seems they’re both interested in each other.\nAfter a little flirting, the two end the date with a cheeky kiss before heading back to the villa.\nFollowing several explosive fights, Aaron decides to head up to the penthouse. He takes Jenny with him and the two enjoy spending the night together.\nOn good terms: To Josh’s surprise, it’s his ex Jenny, and the hunk is relieved, as there is no animosity between the two\nMaking an impression: Jenny stuns in a lime green bikini with a black lace trim as she has her Baywatch moment\nTheir liaison comes as little surprise since it was reported last autumn the brunette had shared a steamy romp with Aaron.\nAn insider told The Sun: 'Jenny T had her eyes on Aaron from the start, he’s completely her type and she made a beeline for him right away.\n'It wasn’t long before she’d got her wicked way with him and they were in bed with each other, things got pretty heated pretty fast.'\nJenny enters the villa 14 March at 10pm, only on MTV.\nChemistry: Their liaison comes as little surprise since it was reported last autumn the brunette had shared a steamy romp with Aaron","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301150/Bikini-clad-Jenny-Thompson-makes-Ex-Beach-debut.html"}
