{"authors":["Jessica Aquilina For Daily Mail Australia"],"date_download":"2018-10-22 21:56:17","date_modify":"2018-10-22 21:56:17","date_publish":"2016-01-29 08:27:56","description":"Jennifer Hawkins shows off her incredible washboard abs in a skimpy bikini as she spends the day paddle boarding in Pittwater.","filename":"data/vaneerConsumption/JenniferHawkinsshowsoffincredibleabsasshegoespaddleboarding.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/05/30AF186900000578-0-image-a-4_1454044307554.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422165_Jennifer-Hawkins-shows-incredible-abs-goes-paddle-boarding_1540245377.html","title":"Jennifer Hawkins shows off incredible abs as she goes paddle-boarding","title_page":"Jennifer Hawkins shows off incredible abs as she goes paddle-boarding | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is known for her flawless figure.\nAnd Jennifer Hawkins made sure to flaunt it when she spent the day paddle-boarding in Sydney's Pittwater earlier this month.\nThe 32-year-old former Miss Universe showed off her washboard abs as she took to the waters in a a mismatched blue and black bikini which was worn underneath a loose-fitting black tank top and a pair of sporty shorts.\nScroll down for video\nStunning beauty! Jennifer Hawkins showed off her washboard abs in a tank top and shorts as she went paddle-boarding in Pittwater, Sydney earlier this month\nThe beaming Myer Ambassador looked like a pro as she glided through the water without any hindrance or hesitation of falling in.\nShe also made sure to protect her smooth and supple skin from the sun, adding a blue cap and a pair of dark sunglasses to protect her pretty facial features from the harsh UV rays.\nThe catwalk model left her long blonde locks out and straight for her beach-side exercise session with her muscular hubby, Jake Wall.\nPaddling like a pro! The 32-year-old looked like a pro as she glided through the water with her husband Jake Wall close by her side\nHot couple: The genetically blessed pair showed off their muscular figures as they balanced on their boards\nSun smart: The Myer ambassador made sure to protect her smooth and supple skin from the sun, adding a blue cap and a pair of dark sunglasses to protect her pretty facial features from the harsh UV rays\nJake flaunted his muscular torso, wearing only a pair of black and white boardshorts and a matching cap.\nThe hunky male model accessorised his look with a black bracelet and a pair of dark shades.\nMeanwhile, Jen headed back to the sandy beach to take a selfie with the picturesque surroundings of her adventurous afternoon.\nThe leggy blonde extended her arm in the air pouting and posing in front of the camera in an effort to capture her best side.\nTime for a selfie! The leggy blonde extended her arm in the air pouting and posing in front of the camera in an effort to capture her best side\nHer best side! The TV personality then attempted to take a front on selfie\nThe toned beauty then proceeded to remove her shorts, pull her luscious locks into a messy bun and tie her loose shirt into a knot at the back.\nGetting back on her board, this time the model stunner chose to lay down, face forward for some relaxation time.\nExtending her legs and arms out along on the makeshift tanning mat, Jen made sure to soak up every inch of the sun's rays.\nBefore switching sides, to even out her golden complexion.\nPacking up: The 32-year-old was spotted packing up her paddle before sunning herself\nRelaxation time! The toned beauty then proceeded to remove her shorts, pull her luscious locks into a messy top knot bun and then tied her loose shirt into a knot at the back\nBeach bed: Instead of sun-baking on the beach, Jen took to her purple paddle-board and lay face down to soak up the sun's rays\nEnsuring an even complexion! She then switched sides to even up her tan\nApart from modelling and TV work, the starlet and her hunky hubby have branched out and launched their own tequila range called Sesión.\nSpeaking of the beverage, Jen told the Daily Telegraph: 'Originally when I started drinking it, I felt sexy.\n'When you are drinking a masculine drink, I felt sexy. Then I started loving the taste... then because of the feeling you get you don’t go back.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422165/Jennifer-Hawkins-shows-incredible-abs-goes-paddle-boarding.html"}
