{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 01:42:37","date_modify":"2018-10-23 01:42:37","date_publish":"2017-04-26 12:17:50","description":"The 26-year-old arrived on the set after lunch in Slovakia looking like a natural beauty, but quickly transformed into Dominika Egorova with a striking blonde wig on Tuesday afternoon.","filename":"data/vaneerConsumption/JenniferLawrencetransformsintoasexyRussianspy.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F08E000000578-0-image-a-20_1493205434542.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447174_Jennifer-Lawrence-transforms-sexy-Russian-spy_1540258957.html","title":"Jennifer Lawrence transforms into a sexy Russian spy","title_page":"Jennifer Lawrence transforms into a sexy Russian spy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been especially covert on her developing romance with Darren Aronofsky.\nSo Jennifer Lawrence may have eased seamlessly into her sexy Russian spy role this week, as she was seen filming the first scenes of 2018 thriller Red Sparrow.\nThe 26-year-old arrived on the set after lunch in Slovakia looking like a natural beauty, but quickly transformed into Dominika Egorova with a striking blonde wig.\nScroll down for video\nGetting to work: Jennifer Lawrence was seen filming the first scenes for Red Sparrow on Tuesday in Bratislava, Slovakia\nJennifer plays a young intelligence officer, whose dreams of becoming a prima ballerina are shattered when she breaks her leg.\nDominika is recruited for a secretive Russian spy agency where she is assigned to seduce a first-tour CIA agent who handles the CIA's most sensitive penetration of Russian intelligence.\nThe Cold War thriller is charged by trade-craft, deception and inevitably forbidden passion with Joel Edgerton's character Nathaniel Nash.\nOff-duty: The blonde bombshell was seen going for lunch earlier that day, sporting her natural beauty look\nAs filming commenced in Bratislava on Tuesday, actress Jennifer quickly shrugged off her lovable, girl-next-door demeanor.\nShe meant business in a long camel coat, worn with black shoes and her platinum, fringed wig.\nThe American Hustle star was captured between takes on a housing estate as she let her character slip to make conversation with her burly bodyguard.\nJennifer was also later seen zipped up and cosy in a black hoodie as she blended in with the camera crew.\nTransforming: Jennifer (left, before work) transformed into sexy Russian spy Dominika Egorova (right)\nA trailer for the forthcoming spy thriller was teased at ComicCon last month, by 20th Century Fox.\nJennifer is once again working with Francis Lawrence, who directed the Hunger Games franchise, in which Jennifer took the lead as Katniss Everdeen.\nOff-screen, Jennifer has remained schtum about her tryst with film director Darren, who is known for projects including Black Swan and Requiem For A Dream.\nThough rarely seen together in public, reports last month suggested that things were getting more serious between the 48-year-old and 26-year-old Jen.\nBlending in: Later, Jennifer kept a low profile in a black hoodie as she went about the set\n'Jennifer is comfortable with an older guy because she is mature and focused,' source told People about the gaping 22-year age gap.\nThe two met while working together on drama Mother! which is set for release later this year.\nThe source continued: 'Jen has been mesmerized by his talent and brains since she started working with him.'\nThey are very sweet together and seem happy,' another source told the magazine. 'They hold hands. They Keep to themselves and don't seem to want a lot of attention.'\nBack on the big screen: For the last year, Jennifer (here in December 2016) has been keeping a low profile and developing a romance with Darren Aronofsky","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447174/Jennifer-Lawrence-transforms-sexy-Russian-spy.html"}
