{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 22:29:04","date_modify":"2018-10-30 22:29:04","date_publish":"2014-08-15 15:14:34","description":"Jennifer Lawrence, beloved national treasure and food connoisseur, turns 24 years old on Friday and everyone is volunteering to show her proper tribute. After all, this is not only the woman who brought Katniss Everdeen of The Hunger Games to life,…","filename":"data/vaneerConsumption/JenniferLawrences7FavoriteFoodsWouldMakethePerfectBirthdayPresentsPHOTOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/78722a64-776d-4063-8fbf-aafbe5be368e.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35910-jennifer-lawrences-7-favorite-foods-would-make-the-perfect-birthday-presents-photos_1540938544.html","title":"Jennifer Lawrence's 7 Favorite Foods Would Make the Perfect Birthday Presents - PHOTOS","title_page":"Jennifer Lawrence's 7 Favorite Foods Would Make the Perfect Birthday Presents — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"Jennifer Lawrence, beloved national treasure and food connoisseur, turns 24 years old on Friday and everyone is volunteering to show her proper tribute. After all, this is not only the woman who brought Katniss Everdeen of The Hunger Games to life, but this is also the dorky, quirky girl-next-door in the body of a world famous actress who already has a collection of awards to her name before she's even 30 years old. Lawrence lost the Oscar to Lupita Nyong'o in 2014, but that doesn't mean that she's not still one of the most awesome young actresses out there in the world right now. Even more importantly, Lawrence is best known for her adorabkle personality and for her huge appetite.\nWatch even two minutes of an interview and you'll quickly learn that Lawrence loves nothing more than eating and talking about eating. She brought a purse full of snacks to the Oscars, not knowing that Ellen DeGeneres was going to be ordering pizza for everyone. Lawrence's dedication to eating as much junk food as possible is such an infamous quality of hers that, in honor of her birthday, we just had to give her seven of her favorite foods to much on. After all, who cares about presents when you can have food?\n1. Pizza\nShe talks about pizza more so than any other food and who can blame her really? Pizza is awesome. J. Law is awesome. J. Law with a pizza? Awesome.\n2. Fries\nForget about awards. Give her the world's largest box of McDonald's french fries and she'll probably be happy.\n3. Cookies\nIf there is a plate of cookies in the immediate area, you can bet that Lawrence will eat all of them. Sorry not sorry.\n4. Ice Cream\nNyong'o may have taken home the Oscar, but she's not going anywhere with J. Law's ice cream.\n5. Slim Jims\nSlim Jims were one of the many snacks that Lawrence packed with her to go to the Oscars, so I'm going to go ahead and consider it high up there on her list of favorite foods.\n6. Doritos\nLawrence's costume designer revealed that she had a tendency to get Dorito dust on her dresses during the filming of American Hustle. This came as a surprise to absolutely no one. I'm just assuming that J. Law is a fan of Cool Ranch. I mean, it's clearly the most superior of all Dorito flavors.\n7. MTV Movie Awards Popcorn Trophy\nLet's be real. There's no way that she didn't actually try to eat it after the MTV Movie Awards, considering how disappointed she was that her award was shaped like food but wasn't actually food.","url":"https://www.bustle.com/articles/35910-jennifer-lawrences-7-favorite-foods-would-make-the-perfect-birthday-presents-photos"}
