{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 21:20:44","date_modify":"2018-10-30 21:20:44","date_publish":"2015-07-17 07:08:05","description":"When ESPN's ESPY awards announced that it was giving a \"courage\" award to Bruce Jenner, Bob Costas and others deemed it a transparent effort to boost viewership.","filename":"data/vaneerConsumption/JennerBoostsRatingsforESPYAwards.json","image_url":"https://media.breitbart.com/media/2015/07/espn.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_07_17__1540934444.html","title":"Jenner Boosts Ratings for ESPY Awards","title_page":"Jenner Boosts Ratings for ESPY Awards | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"When ESPN’s ESPY awards announced that it was giving a “courage” award to Bruce Jenner, Bob Costas and others deemed it a transparent effort to boost viewership. Now, it looks like Jenner’s appearance to accept the award did just that.\nThe ESPY awards endured criticism for choosing Jenner as the recipient of its Arthur Ashe Courage Award.\nNo less than NBC Sports commentator Bob Costas classified the choice of Jenner as a misguided effort to boost ratings. Costas called it “a tabloid play.”\nOn the heels of Costas’ criticism, ESPY awards producer Maura Mandt admitted that she was really the only person involved in deciding who gets the “courage” honor in the first place. There are no committees, no finalists, no lists of people, just Mandt’s say so on who gets the award.\nNow, as the broadcast has come and gone, we see that Jenner’s inclusion in the show did just what was predicted. The ratings for this year’s ESPY award show drew 7.7 million viewers, a 250 percent rise over last year’s audience of 2.2 million.\nFurther, the last hour of the show during which Jenner received the “courage” award was TV’s most viewed hour on Wednesday night, netting an additional 1.9 million viewers over the previous hour of the show. The ESPY awards also beat all other prime time shows that evening.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com","url":"https://www.breitbart.com/sports/2015/07/17/espy-awards-gets-ratings-boost-from-caitlyn-jenner-appearance/"}
