{"authors":["Sofia Barrett-Ibarria"],"date_download":"2018-10-30 22:26:28","date_modify":"2018-10-30 22:26:28","date_publish":"2014-08-15 17:50:11","description":"Happy Birthday Jennifer Lawrence! In honor of the champion red carpet photo-bomber and Queen of GIFS, let's take a lovely stroll down memory lane to the days of Lawrence's youth. It might be hard to imagine a time when Lawrence didn't exist in the…","filename":"data/vaneerConsumption/JenniferLawrenceInFailedTVPilotBeforeSheWasFamousIsJustAwesomeVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/688bf1fa-8cdb-414d-b09e-931e64883a02.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35949-jennifer-lawrence-in-failed-tv-pilot-before-she-was-famous-is-just-awesome-video_1540938388.html","title":"Jennifer Lawrence In Failed TV Pilot Before She Was Famous Is Just Awesome - VIDEO","title_page":"Jennifer Lawrence In Failed TV Pilot Before She Was Famous Is Just Awesome — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Happy Birthday Jennifer Lawrence! In honor of the champion red carpet photo-bomber and Queen of GIFS, let's take a lovely stroll down memory lane to the days of Lawrence's youth. It might be hard to imagine a time when Lawrence didn't exist in the collective consciousness as Ruler Of The Internet, Master of The Universe, and Unabashedly Honest Soundbite Generator, but there was a time when she was just a regular actress that many people knew about. Before she landed the sweetest gig of all time as Katniss in The Hunger Games and became known by everyone everywhere, Lawrence was on TV. Back in 2007, Lawrence appeared in Not Another High School Show , a wonderfully awful Comedy Central pilot that sought to bank off the success of Not Another Teen Movie.\nVulture found this gem, and in the failed parody show that seems built on a strong foundation of vagina jokes and gratuitous fake blood, Brie played Muffy the Vampire Slayer, and Lawrence appeared as a regular teenager. In the clip below, we see how Muffy gets her name and Lawrence's unnamed character in a brief, but shining moment when she tries to save the dying school janitor. Despite the pilot's ultimate failure, Lawrence's acting skills and general goofiness were evident and have taken her from anonymous girl on TV to three-time Oscar winner.\nCheck out the hilarious Jennifer Lawrence flashback video below:","url":"https://www.bustle.com/articles/35949-jennifer-lawrence-in-failed-tv-pilot-before-she-was-famous-is-just-awesome-video"}
