{"authors":["Mary Avant"],"date_download":"2018-10-30 22:28:54","date_modify":"2018-10-30 22:28:54","date_publish":"2014-08-15 16:00:04","description":"Jennifer Lawrence is one of those rare Hollywood creatures who I just know I'd want to be friends with in real life. I mean, she's an absolute (but charming) klutz, she isn't afraid to say anything, and she's also an extremely talented actress who's…","filename":"data/vaneerConsumption/JenniferLawrenceRedCarpetStyle13TimesHerOutfitsMadeYouLoveHerEvenMore.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/fb277b46-c7a9-440e-9549-5882317799b1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35905-jennifer-lawrence-red-carpet-style-13-times-her-outfits-made-you-love-her-even-more_1540938534.html","title":"Jennifer Lawrence Red Carpet Style: 13 Times Her Outfits Made You Love Her Even More","title_page":"Jennifer Lawrence Red Carpet Style: 13 Times Her Outfits Made You Love Her Even More","title_rss":"NULL","source_domain":"bustle.com","text":"Jennifer Lawrence is one of those rare Hollywood creatures who I just know I'd want to be friends with in real life. I mean, she's an absolute (but charming) klutz, she isn't afraid to say anything, and she's also an extremely talented actress who's been in an ever-growing list of amazing movies. (And seriously, if other celebrities adore J.Law, then she's got to be cool, right?)\nThough we've all come to love her for her hilarious red-carpet interviews and goofball personality, there's one more reason I've been obsessing over J.Law for the past three years: her awesome sense of style. So to ring in the Oscar-winning star's 24th birthday, let's take a look at 13 times Lawrence's amazing looks made you love her just as much as her fabulous personality.","url":"https://www.bustle.com/articles/35905-jennifer-lawrence-red-carpet-style-13-times-her-outfits-made-you-love-her-even-more"}
