{"authors":["Sarah Sotoodeh For Dailymail.Com"],"date_download":"2018-10-22 21:32:28","date_modify":"2018-10-22 21:32:28","date_publish":"2016-01-29 06:55:23","description":"The 46-year-old is set to star in The Fixer, according to Deadline. She will play Denise White, a sports manager who is a former Miss USA contestant. The actress will as produce the film.","filename":"data/vaneerConsumption/JenniferAnistonissettoproduceandstarinthefilmTheFixer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/04/30AEC19100000578-0-image-a-42_1454041582643.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422137_Jennifer-Aniston-set-produce-star-beauty-pagent-queen-turned-sports-manager-upcoming-flick-Fixer_1540243948.html","title":"Jennifer Aniston is set to produce and star in the film The Fixer","title_page":"Jennifer Aniston is set to produce and star in the film The Fixer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's ready to play ball.\nJennifer Aniston will star as Denise White, a former Miss USA contestant turned professional sports manager, in the film, The Fixer, according to Deadline.\nThe 46-year-old will also produce the Fox 2000 acquired project through her production company, Echo Films, along with her partner, Kristin Hahn, as well as Steve Barnett and Bernie Goldmann.\nJennifer Aniston will star as Denise White, a former Miss USA contestant turned professional sports manager, in the film, The Fixer, according to Deadline; pictured on January 17 at the Critics' Choice Awards\nFox 2000 acquired a pitch by screenwriter Melisa Wallack, the 2014 Men's Journal story chronicling Denise's rise to the top of the sports managing world by Paul Solotaroff and Denise's life rights.\nAleen Keshishian will serve as executive producer along with Zack Morgenroth as co-producer.\nJennifer and Kristin produced the star's 2014 film, Cake, a drama about a woman who has to overcome losing her son and her chronic pain.\nThe movie star's portrayal earned her a Golden Globe Award and Screen Actors Guild Award nomination.\nDrama: The 46-year-old will also produce the Fox 2000 acquired project through her production company, Echo Films, along with her partner, Kristin Hahn; Her company also produced her 2014 film, Cake (pictured)\nDenise, who was named Miss Congeniality during the 1994 Miss USA pageant, founded her company, Entertainers & Athletes Group (EAG) in 1996.\nShe manages the careers of several high profile athletes, including Jared Allen, Brandon Marshall, DeSean Jackson and Vince Young.\nIn the Men's Journal article, 'The Woman Who Bails Out The NFL's Bad Boys,' Denise explained how her clients view her.\nTrue story: Denise White manages the careers of several high profile athletes, including Jared Allen, Brandon Marshall, DeSean Jackson and Vince Young\nShe told the magazine: 'You know, people made a fuss about the 'Blind Side' kid, like he was a one-of-a-kind deal. Well, 90% of my clients are the 'Blind Side' kid and need every bit of mothering they can get.'\nJennifer has two films, Mother's Day and The Yellow Birds, set to be released this year.\nMother's Day is a comedy that also stars Kate Hudson, Julia Roberts, Jason Sudeikis, and Britt Robertson.\nThe Yellow Birds, also produced by her company, is a drama about two young men in the military during the Iraq War - the starlet plays the mom of one of the soldiers.\nSerious: The movie star's portrayal in Cake earned her a Golden Globe Award and Screen Actors Guild Award nomination; pictured on January 17 at the Critics' Choice Awards in Santa Monica","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422137/Jennifer-Aniston-set-produce-star-beauty-pagent-queen-turned-sports-manager-upcoming-flick-Fixer.html"}
