{"authors":["Associated Press"],"date_download":"2018-10-22 22:54:23","date_modify":"2018-10-22 22:54:23","date_publish":"2016-01-11 04:11:51","description":"BEVERLY HILLS, Calif. (AP) — Jennifer Lawrence continued her Golden Globes hot streak by winning best actress in a motion picture comedy on Sunday for her po...","filename":"data/vaneerConsumption/JenniferLawrencewinsGoldenGlobeforbestcomedyactress.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:04d15b497d76472c83eeab677d7997f9-48qEJGFphM8d437f0aaf9201b403-80_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393360_Jennifer-Lawrence-wins-Golden-Globe-best-comedy-actress_1540248863.html","title":"Jennifer Lawrence wins Golden Globe for best comedy actress","title_page":"Jennifer Lawrence wins Golden Globe for best comedy actress | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jennifer Lawrence wins Golden Globe for best comedy actress\nBEVERLY HILLS, Calif. (AP) — Jennifer Lawrence continued her Golden Globes hot streak by winning best actress in a motion picture comedy on Sunday for her portrayal of Miracle Mop inventor Joy Mangano in \"Joy.\"\nThis is her third Golden Globe win for a performance in a David O. Russell movie. She previously won a supporting award for \"American Hustle\" and for her leading role in \"Silver Linings Playbook,\" and the trend was not lost on Lawrence.\n\"Every time I'm up here is because of you,\" Lawrence said in her acceptance speech, which focused mainly on Russell.\nIn this image released by NBC, Amy Schumer, left, and Jennifer Lawrence introduce their nominated films \"Trainwreck\" and \"Joy\" at the 73rd Annual Golden Globe Awards at the Beverly Hilton Hotel in Beverly Hills, Calif., on Sunday, Jan. 10, 2016. (Paul Drinkwater/NBC via AP)\n\"Thank you for teaching me so much, professionally, personally,\" Lawrence continued. \"I want us to be buried next to each other. I really do.\"\nLawrence was up against nominees Lily Tomlin (\"Grandma\"), Melissa McCarthy (\"Spy\"), Maggie Smith (\"The Lady in the Van\") and her friend Amy Schumer (\"Trainwreck\") in the category.\nLawrence and Schumer's friendship has become the stuff of pop culture legend. The two have vacationed together, are co-writing a movie, and even co-presented on stage at the awards on Sunday night.\nUnlike the best actress drama category, the comedy category is not expected to help predict eventual Oscar nominees, save for Lawrence. Notably, though, Lawrence did not receive a Screen Actors Guild nomination for \"Joy.\"\nLast year Amy Adams won for her role as the painter Margaret Keane in \"Big Eyes.\" She was not nominated for an Oscar.\nJennifer Lawrence arrives at the 73rd annual Golden Globe Awards on Sunday, Jan. 10, 2016, at the Beverly Hilton Hotel in Beverly Hills, Calif. (Photo by Jordan Strauss/Invision/AP)\nMelissa McCarthy arrives at the 73rd annual Golden Globe Awards on Sunday, Jan. 10, 2016, at the Beverly Hilton Hotel in Beverly Hills, Calif. (Photo by Jordan Strauss/Invision/AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3393360/Jennifer-Lawrence-wins-Golden-Globe-best-comedy-actress.html"}
