{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 01:51:44","date_modify":"2018-10-23 01:51:44","date_publish":"2016-01-11 13:20:47","description":"The Joy actress was accused of being 'rude' to E!'s Juan Pablo F-Feo during a public outburst in which she told him to stop using his phone when he interviewed her on Sunday night.","filename":"data/vaneerConsumption/JenniferLawrencesGoldenGlobesoutburstatforeignreporterusinghisphone.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300AB97500000578-0-image-a-132_1452521279770.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393853_Jennifer-Lawrence-slammed-rude-outburst-foreign-reporter-used-phone-record-Golden-Globes-interview_1540259504.html","title":"Jennifer Lawrence's Golden Globes outburst at foreign reporter using his phone","title_page":"Jennifer Lawrence's Golden Globes outburst at foreign reporter using his phone | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jennifer Lawrence has been blasted for calling out a foreign reporter in the middle of a Golden Globes press conference that followed Sunday's ceremony.\nThe Joy actress, 25, was accused of being 'rude' to E!'s Juan Pablo Fernández-Feo during a public outburst in which she told him to stop using his phone when he interviewed her.\nHer scathing attack prompted social media users to question whether she had crossed a line with her humour at the Los Angeles' Beverly Hilton Hotel event.\nScroll down for video\n'Rude': Jennifer Lawrence was accused of being 'rude' to an E! Network reporter during a press conference that followed Sunday night's Golden Globe awards\nThe reporter asked Jennifer how she felt about Oscars night - which will be held on February 28, 2016 and for which she is also expected to be nominated for an award - when she interrupted with: 'You can't live your whole life behind your phone bro.\n'You're just not gonna... You can't do that. You gotta live in the now,' she said as she rolled her eyes and wagged her finger at him, prompting the room to descend into laughter.\nThe actress, looking exquisite in a scarlet dress, had just accepted the Golden Globe award for Best Actress in the Motion Picture Comedy category for her 2016 film Joy.\nAs the reporter continued his question about the Academy Awards for a second time, she corrected him by saying: 'We are at the Golden Globes, if you put your phone down, you'd know that.'\nSee the latest Jennifer Lawrence news as she slams a reporter at her press conference\nUnimpressed: The Joy actress was unimpressed when the Latin America broadcaster used his phone as he asked her interview questions\nOutburst: She rolled her eyes and pulled faces in her humerous manner, but some have called it humourless\nSome of those reacting to an online video of the outburst said they felt she had been rude to the reporter, who works on behalf of Latin America's E! Network, predominantly in Argentina, México and Venezuela.\nOne fan's loyalty to the star started to wane, when she commented: 'I'm a fan of her, but that was kinda rude.'\nWith another saying: 'I used to find Jennifer Lawrence quite funny and relatable but now she's quite rude and arrogant. Shame'\nBurn: The star seemed to correct the reporter when he asked a question about the Oscars, instead of the Golden Globes\nHumour: She cracked up the crowd with her comments, but not everyone was laughing\nOthers were more convinced that Jennifer's humour has been disrespectful in the past, with one exclaiming: 'people are just now realizing how rude & disrespectful Jennifer Lawrence is????'\nThe actress is known for her jovial sense of humour, even sharing a laugh with comedienne of the moment and BFF Amy Schumer, who she defeated in the Best Actress category that night.\nBut this time, some social media users believed she had crossed a line.\nOne user said: 'Jennifer Lawrence tries to be sassy & sarcastic but she always forgets that tiny line where you can become rude and disrespectful'\nTaking a gong: Jennifer was on a high after her Golden Globes' Best Actress win on the night, and seemed to make the room full of reporters laugh\nChanging her opinion: One loyal fan of Jennifer's seemed to be disappointed in the viral video\nDisappointed: Another agreed that her loyalty was waning after the rude outburst\nAlways the way? One social media user seemed to suggest this is always how Jennifer acted\nA fine line: Another said she had crossed a line when she disrespected the reporter\nAwkward: Some supported the reporter, saying he was just doing his job\nEmbarrassing: Another pointed out that English may not be the E! writer's first language\nIn agreement, another added: 'jennifer lawrence calling out that reporter was not \"quirky\". it was rude and entitled and embarrassed someone just tryna doing his job'\nAnd adding about it being humiliating, one fan said: 'That reporter didn't seem to know English very well that was kinda rude of Jennifer Lawrence'\nHe seemed to agree that he'd been 'scolded' and the reporter later shared a selfie, which he captioned: 'Después de haber sido regañado por #JenniferLawrence en los #GoldenGlobes ✌.'\nWhich roughly translates to: 'After being scolded by #JenniferLawrence in the #GoldenGlobes ✌'\nSad face: The reporter, who works for the E! network in Latin America shared a selfie afterwards which seemed to prove he felt 'scolded'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393853/Jennifer-Lawrence-slammed-rude-outburst-foreign-reporter-used-phone-record-Golden-Globes-interview.html"}
