{"authors":["Ciara Farmer For Mailonline"],"date_download":"2018-10-23 02:34:06","date_modify":"2018-10-23 02:34:06","date_publish":"2017-03-16 13:05:44","description":"On Wednesday, the 27-year-old former escort looked worlds away from her MTV woes as she showed off her simply sensational physique in a barely-there orange bikini","filename":"data/vaneerConsumption/JennyThompsonshowsoffeveryinchofsensationalfigure.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E545E4100000578-0-image-a-25_1489671377531.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320148_Jenny-Thompson-shows-inch-sensational-figure_1540262046.html","title":"Jenny Thompson shows off every inch of sensational figure","title_page":"Jenny Thompson shows off every inch of sensational figure | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She soared to fame in the wake of her torrid romps with Wayne Rooney.\nYet Jenny Thompson has delightedly launched fame in her own right after making her debut on Ex On The Beach on Tuesday night - on which she enjoyed a steamy romp with co-star Aaron Chalmers on her first night in the villa, much to his ex Becca Edwards' chagrin.\nOn Wednesday, the 27-year-old former escort looked as though any woes were worlds away as she showed off her simply sensational physique in a barely-there orange bikini.\nScroll down for video\nSexy stuff: Jenny Thompson has delightedly made her arrival of fame in her own right after making her debut on Ex On The Beach on Tuesday night - on which she enjoyed a steamy romp with co-star Aaron Chalmers on her first night in the villa, much to his ex Becca Edwards' chagrin\nJenny made the most of her incredible figure as she wowed in the orange bikini boasting a bandage material with strappy sides and a halter neckline - perfect for showing off all her best bits.\nHer taut abs and perky assets were the focus of the look with the triangle cups boosting her cleavage and the sides of the bottoms helping emphasise her slender hips and gym-honed frame.\nHelping give her poolside look a unique edge, Jenny was adorned with inkings extending the lengths of her arms and hips in stunning intricate designs to help add detail to her look.\nShe peeled huge mirrored sunglasses over her make-up free face as she preened and pouted while her wet hair was slicked behind her ears with lengths cascading down her back.\nHot stuff: On Wednesday, the 27-year-old former escort looked worlds away from her MTV woes as she showed off her simply sensational physique in a barely-there orange bikini\nHot stuff: Jenny made the most of her incredible figure as she wowed in the orange bikini boasting a bandage material with strappy sides and a halter neckline - perfect for showing off all her best bits\nSince entering EOTB as the ex of Joshua Richie, of Love Island fame, she went on to enjoy a night in the penthouse with Geordie Shore hunk Aaron, who admitted he found the stunner irresistible.\nUnfortunately for Jenny she was caught in the crossfire of Aaron's ongoing row with Becca, who jetted in from Australia to face up to her ex who she cruelly split from years before.\nOn Tuesday night's episode of the show, the stunning star was accused of looking at Becca 'like a c**t' - claims she vehemently denied before the duo became locked in a furious row.\nHot and heavy: Since entering EOTB as the ex of Joshua Richie, of Love Island fame, she went on to enjoy a night in the penthouse with Geordie Shore hunk Aaron, who admitted he found the stunner irresistible\nHot stuff: Unfortunately for Jenny she was caught in the crossfire of Aaron's ongoing row with Becca, who jetted in from Australia to face up to her ex who she cruelly split from years before\nSizzling: She peeled huge mirrored sunglasses over her make-up free face as she preened and pouted while her wet hair was slicked behind her ears with lengths cascading down her back\nJenny had a taste of the spotlight in 2010 when it was revealed she had slept with Wayne seven times over a period of months while his wife Coleen with pregnant with son Kai - who was born in November 2009.\nWhen the revelations were first published, Jenny told how she used to meet the English footballer for sex sessions in the five star Lowry Hotel in Manchester. She said she earned £1,200 each time for the two-hour appointments, and also enjoyed a threesome with fellow escort Helen Wood.\nIn her entrance to Ex On The Beach she revealed she was forced to hide her job from her parents, so told them she was a glass collector in a local bar. She went on to cheekily state: 'I'd have to collect a lot of glasses'.\nOh dear: Jenny had a taste of the spotlight in 2010 when it was revealed she had slept with Wayne seven times over a period of months while his wife Coleen with pregnant with son Kai - who was born in November 2009\nStunner: Jenny made the most of her incredible figure as she wowed in the orange bikini boasting a bandage material with strappy sides and a halter neckline - perfect for showing off all her best bits","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320148/Jenny-Thompson-shows-inch-sensational-figure.html"}
