{"authors":["Emma Cueto"],"date_download":"2018-10-30 22:26:31","date_modify":"2018-10-30 22:26:31","date_publish":"2014-08-15 17:40:54","description":"It was once true that those who didn't work in media were powerless to express their experiences and points of view. As Jenna Robinson and William Giles point out in their spoken word poem \"Selfie,\" that is changing for the better — those who hold…","filename":"data/vaneerConsumption/JennaRobinsonandWilliamGilesPoemSelfieCallstoMindFergusonMissouri.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/06f0af2a-0a6d-49b0-9147-5ca6185f0fac.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35956-jenna-robinson-and-william-giles-poem-selfie-calls-to-mind-ferguson-missouri_1540938391.html","title":"Jenna Robinson and William Giles' Poem \"Selfie\" Calls to Mind Ferguson, Missouri","title_page":"Jenna Robinson and William Giles' Poem \"Selfie\" Calls to Mind Ferguson, Missouri","title_rss":"NULL","source_domain":"bustle.com","text":"It was once true that those who didn't work in media were powerless to express their experiences and points of view. As Jenna Robinson and William Giles point out in their spoken word poem \"Selfie,\" that is changing for the better — those who hold technology also hold power.\n\"Historically, our images are things that have been taken away from us,\" they say in the poem, which they performed while representing Hawaii in the prelims at the 2014 National Poetry Slam. \"Our identities have been systematically erased and redefined.\" But in the age of modern technology, when everyone has a cell phone camera in their pocket, it puts power back into the hands of the marginalized and misrepresented.\nBut even beyond just the empowering aspects of selfies, Robinson and Giles look at broader impacts that a camera can have, bringing up issues like police brutality. \"When we hold the camera,\" they say, \"news stations cannot pretend we don't exist.\"\nThe poem was performed before the shooting of Michael Brown, but it inescapably calls to mind the events that unfolded in Ferguson, Missouri this week in the aftermath of the shooting. It's unlikely that the police's actions would have ever gained widespread attention if it weren't for social media, especially Twitter, and people's ability to document what was happening in their community themselves. And the fact that this poem, which speaks so well to that fact, predates the events in Ferguson only serves as a reminder that these issues have been ongoing for a long time now, and will almost certainly continue for a long time to come.\nAnd yet, by putting cameras into the hands of the marginalized, the power dynamics are beginning to shift.\nButton Poetry on YouTube\nImage: Button Poetry/YouTube","url":"https://www.bustle.com/articles/35956-jenna-robinson-and-william-giles-poem-selfie-calls-to-mind-ferguson-missouri"}
