{"authors":["Bianca Soldani For Daily Mail Australia"],"date_download":"2018-10-22 20:29:08","date_modify":"2018-10-22 20:29:08","date_publish":"2016-01-29 01:50:26","description":"Showing off her catwalk-ready frame in a blue and purple print two-piece top and mismatched black bottoms, the stunner looked loved up as she indulged in a spot of stand up paddle-boarding.","filename":"data/vaneerConsumption/JenniferHawkinskisseshusbandJakeWallwhilepaddleboarding.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/02/30AE73BE00000578-0-image-a-85_1454033715780.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422009_Bikini-clad-Jennifer-Hawkins-kisses-husband-Jake-Wall-paddle-boarding_1540240148.html","title":"Jennifer Hawkins kisses husband Jake Wall while paddle-boarding","title_page":"Jennifer Hawkins kisses husband Jake Wall while paddle-boarding | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They've been together for over a decade, but it doesn't seem as though the romance is fading between Jennifer Hawkins and her husband Jake Wall.\nThe Myer model and bikini babe was spotted cuddling up to her handsome beau while out on the water in Sydney's Northern Beaches suburb of Pittwater last week.\nShowing off her catwalk-ready frame in a blue and purple two-piece top and mismatched bottoms, the 32-year-old stunner looked loved up as she went for a quick swim.\nScroll down for video\nLoved up: Jennifer Hawkins and husband Jake Wall were seen cuddling up while enjoying a swim in Sydney last week\nGoing strong: The couple, who have been together for almost 11 years, looked as loved up as ever\nJennifer had her long blonde locks tied up in a messy top knot to keep it from falling into her eyes while manoeuvring her way through the waves.\nA pair of dark sunglasses meanwhile, shielded her eyes from the sun and she went largely makeup free for the occasion.\nFormer rugby league player turned carpenter Jake was looking buff by her side in a pair of dark board shorts and a hat.\nSplashing good time! The pair were seen splashing about as they first jumped into the water\nOut of the way: Jennifer had her long blonde locks tied up in a messy top knot to keep it from falling into her eyes\nBikini babe: She was looking super toned in a blue and purple print bikini top and mismatched bottoms\nShirtless: Jake was looking buff by her side in black board shorts\nShe's a natural beauty: A pair of dark sunglasses shielded Jennifer's eyes from the sun and she went largely makeup free\nJennifer also put on a hat, loose-fitting short shorts and a tank top secured with a knot before jumping into the ocean.\nThe beauty is currently preparing to take to the runway again for the Myer Autumn/Winter collection launch on February 11.\nShe will be strutting her stuff in the show alongside fellow models and ambassadors Kris Smith and Rachael Finch after Kate Peck was dropped from the brand earlier this month.\nFun in the sun: The beauty was enjoying the summer weather on Sydney's Northern Beaches\nChilly, is it?She and Jake were seen goofing around in the water\nFun times: Jennifer looked to be in high spirits and was laughing and smiling\nSpot of exercise: She later took out a paddleboard\nThe couple who play together... Jake and Jennifer were seen taking their boards out together\nKeeping an eye out: Jake leant over and was holding onto his love's board while she knelt down with her paddle\nAnd it looks as though Jennifer will be keeping her fans up to date on her backstage adventures this year after she joined SnapChat recently.\nThe leggy blonde shared her first Snap on Australia Day but suffered somewhat of a social media fail in the process.\nHaving forgotten to turn the audio on, the bombshell was seen mouthing 'Happy Australia Day,' in the brief clip that sees her shakily pan the camera down her body to her designer heels.\n'Possibly the worst snap chat ever, but it's my first!!!' the former Miss Universe wrote when she later re-posted the clip onto her Instagram account.\nSun safe: Jennifer put on a loose-fitting pair of shorts and a tank top for extra sun protection\nBut first.. Jennifer was sure to capture a selfie before hitting the water\nJust chilling: She appeared to be relaxing on her board at one point\nR&R: The beauty juggles a busy schedule as a model, brand ambassador and entrepreneur\nCatwalk queen: The beauty is currently preparing to take to the runway again for the Myer Autumn/Winter collection launch on February 11\nJennifer recently told Beauticate that to ensure beauty from the inside out, she looks after herself by maintaining a balanced diet and spends time relaxing where she can.\nShe sticks to a strict skincare regime but does like to swap up her products 'quite a bit' and is still searching for a facial that she completely trusts.\nThe beauty added that she goes on a 'technology detox from 6 or 7pm every night just so I can have dinner and be present with Jake, or whoever else is around - even to be with your pets. It's really good for your body.'\nMyer crew: She will be strutting her stuff in the show alongside Kris Smith and Rachael Finch\nDown one: Fellow model and ambassador Kate Peck was dropped from the brand earlier this month\nNew starter It looks as though Jennifer will be keeping her fans up to date on her backstage adventures this year after she joined SnapChat recently\nDoes this look good? She asked her husband to take a photo of her from the shore while kicking back on her board\nSmile! Jake was busy snapping away","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422009/Bikini-clad-Jennifer-Hawkins-kisses-husband-Jake-Wall-paddle-boarding.html"}
