{"authors":["Emma Foster For Dailymail.Com"],"date_download":"2018-10-23 03:36:07","date_modify":"2018-10-23 03:36:07","date_publish":"2017-04-26 15:04:48","description":"According to prison records obtained by DailyMail.com, the reality star's ex-husband Raymond Lamb Jr is serving a lengthy prison sentence after sexually abusing a minor.","filename":"data/vaneerConsumption/JenniferLambhidesexhusbandschildmolestationcharges.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA013D500000578-0-image-a-74_1493215419384.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4440022_Jennifer-Lamb-hides-ex-husband-s-child-molestation-charges_1540265767.html","title":"Jennifer Lamb hides ex-husband's child molestation charges","title_page":"Jennifer Lamb hides ex-husband's child molestation charges | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"According to prison records, Jennifer Lamb's ex-husband - Raymond Lamb Jr - is serving a lengthy sentence after being convicted of sexually abusing a minor\nMama June: From Not to Hot star, Jennifer Lamb, was married to a convicted sex offender currently serving 35 years behind bars for child molestation, DailyMail.com can exclusively reveal.\nAnd in a second sex abuse scandal set to rock the popular reality TV franchise, Jennifer has kept the dark secret hidden from show producers, insiders tell DailyMail.com\nJennifer, who wed Mama June's ex Mike 'Sugar Bear' Thompson earlier this year, was married to truck driver Raymond Lamb Jr, 44, when he was arrested and convicted of the sex crimes in December 2013.\nBut sources close to the star - who has been married three times - have claimed she was desperate to keep the scandal hidden from senior producers at WE TV, fearing she may get kicked off the hit reality series.\nPrison records obtained by DailyMail.com show that Raymond Lamb Jr was jailed in February 2014 following a sexual abuse incident against a minor that took place on December 23, 2013.\nHe was handed a 25 year sentence for the child molestation charge and 10 years for an additional charge,\nJennifer, who wed Mama June's ex Mike 'Sugar Bear' Thompson earlier this year (above), was married to truck driver Lamb Jr, 44, when he was arrested and convicted of the sex crimes in December 2013\nBut sources close to the star have claimed she was desperate to keep the scandal hidden from senior producers at WE TV, fearing she may get kicked off the hit reality series Mama June: From Not to Hot star, starring June Shannon (pictured with ex Sugar Bear in 2015)\nIt's believed Jennifer, who married Lamb Jr in 1994 in Georgia according to records, divorced the child molester in 2014, a year after he was convicted.\nAccording to financial records Jennifer and Lamb Jr's marriage was beset with money troubles and the couple filed for joint bankruptcy in 1994, 2005 and 2009.\nLamb, who in 2005 was listed as a truck driver for a dirt company, was last known to be jailed in medium-security Wheeler Correctional Facility in Alamo, Georgia.\nShockingly, the situation is strikingly similar to the scandal that rocked the TV franchise back in 2014.\nBack then, TV network TLC canceled Mama June's previous show Here Comes Honey Boo Boo following claims that the mother-of-four was dating convicted child molester Mark McDaniel.\nThe 37-year-old, whose real name is June Shannon, repeatedly denied the claims, saying she hadn't seen McDaniel - who served 10 years in jail for forcing oral sex on an eight-year-old - for over a decade.\nBut it wasn't enough to dissuade TLC, which refused to air an entire season of episodes.\nThe latest scandal involves Jennifer, Mama June's love rival in the new show.\nA source said: 'Jennifer has got lots of skeletons in her closet that she's desperate to keep hidden.\n'She has been especially terrified that the show would find out about her ex-husband. She's even been threatening some of her family members with lawsuits if they reveal any of her secret past.\n'She has been especially terrified that the show would find out about her ex-husband. She's even been threatening some of her family members with lawsuits if they reveal any of her secret past,' a close source said about Jennifer\n'Everyone is scared of Jennifer because she has two sides to her personality - a nice side and a real nasty side,' the source said\n'This TV show means everything to her - and she loves all the drama surrounding it - even though she pretends she doesn't.\n'She's always bragging about the money she made from the show and how she's bought this and that for her house.\n'Everyone is scared of Jennifer because she has two sides to her personality - a nice side and a real nasty side.\n'Once you get on her wrong side you know about it. She's always running her mouth off at everybody. She doesn't know how to talk to people the right way or how to go about things the right way.'\nJennifer, 43, and Mama June have come to blows several times during the first season of From Not To Hot, which is documenting the reality star's dramatic weight loss.\nMama June decided to transform her body with a 'revenge diet' after her ex Sugar Bear announced that he and Jennifer were tying the knot.\nSugar Bear and Mama June had dated for several years - and even had a 'commitment ceremony' - before splitting up in 2014 amid claims of cheating.\nThe couple, who have one daughter, Alana 'Honey Boo Boo', starred together in Here Comes Honey Boo Boo and then Marriage Boot Camp: Reality Stars.\nAlthough the couple have been separated for around two years, Sugar Bear's announcement that he was remarrying shocked Mama June, who then decided to embark on an extreme weight loss and body transformation plan before her his wedding.\nBut shockingly, the current sex crimes scandal is strikingly similar to the one that rocked the TV franchise back in 2014. Back then TLC canceled Here Comes Honey Boo Boo following claims that Mama June was dating convicted child molester Mark McDaniel (pictured top right)\nJennifer was walked down the aisle by her son Joseph and Honey Boo Boo was the flower girl in the pair's wedding this February\nAlthough Mama June and Sugar Bear have been separated for around two years now, his announcement that he was remarrying shocked Mama June, who then decided to embark on an extreme weight loss and body transformation plan before her his wedding\nThe series has shown the ups and downs of her gastric sleeve surgery, weight loss and surgery to remove her excess skin - as well as the drama and fighting between June and Jennifer.\nThe tension culminated in Jennifer uninviting June to the wedding at the last minute - before she changed her mind when Sugar Bear said he would call off the nuptials unless she re-invited his ex.\nThe couple finally got married in a backyard ceremony at their home in McIntyre, Georgia in early February.\nJennifer was walked down the aisle by her son Joseph and Honey Boo Boo was the flower girl.\nBut June and the newlyweds were involved in a fiery confrontation once more in a reunion episode.\nEnraged Sugar Bear told June that he was filing paperwork to enforce visitation with Alana, screaming: 'F**k you June Shannon…you stupid b***h.'\nJune's 17-year-old daughter, Lauryn 'Pumpkin' Shannon, then steamed in to defend her mother but Sugar Bear told her to 'shut the hell up.'\n'F**k you, you dumb s**t…that's why you're a piece of s**t father,' yelled Pumpkin as Sugar Bear tore his shirt open in fury.\nThe pair had to be pulled apart by show security.\nJennifer claimed she had never seen that side of Mike's personality.\nThe source added: 'Jennifer and Mike are actually really suited to each other.\n'They both have the same personality where they are nice one minute then yelling and screaming the next - like two different people.\n'Jennifer has been married three times now but I think her and Mike will probably stay together because they are so similar.'\nWhen reached by DailyMail.com, Jennifer said: 'This is private information.'\nA spokesman for WE TV said the network would not be commenting on the matter.\nRaymond Lamb is currently appealing his conviction and has a hearing in June.\nAccording to financial records, Jennifer and Lamb Jr's marriage was also beset with money troubles and the couple filed for joint bankruptcy in 1994","url":"https://www.dailymail.co.uk/news/article-4440022/Jennifer-Lamb-hides-ex-husband-s-child-molestation-charges.html"}
