{"authors":["Alanna Bennett"],"date_download":"2018-10-30 23:50:09","date_modify":"2018-10-30 23:50:09","date_publish":"2014-08-12 23:38:14","description":"Are your calendars marked? Mark your damn calendars: There are exactly 100 days before the penultimate Hunger Games movie, The Hunger Games: Mockingjay, Part 1, hits theaters. That is so few days, in the grand scheme of things! It is so few days, in…","filename":"data/vaneerConsumption/JenniferLawrenceHungerGamesCastCelebrate100DaysTilMockingjayPart1PHOTO.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/9/c026fa29-c3f6-4be0-80ac-f53691008ad2-getty-188113530.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35533-jennifer-lawrence-hunger-games-cast-celebrate-100-days-til-mockingjay-part-1-photo_1540943409.html","title":"Jennifer Lawrence & 'Hunger Games' Cast Celebrate 100 Days Til 'Mockingjay, Part 1' - PHOTO","title_page":"Jennifer Lawrence & 'Hunger Games' Cast Celebrate 100 Days Til 'Mockingjay, Part 1' — PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"Are your calendars marked? Mark your damn calendars: There are exactly 100 days before the penultimate Hunger Games movie, The Hunger Games: Mockingjay, Part 1, hits theaters. That is so few days, in the grand scheme of things! It is so few days, in fact, that Hunger Games cast mates Jennifer Lawrence, Elizabeth Banks, and Liam Hemsworth were photographed together celebrating.\nThe photo (seen above) was posted to the official Mockingjay, Part 1 twitter account and depicts...well, the three of them together. Lawrence's hair continues to be a cute little bob grown out from her famous pixie choppage. Elizabeth Banks looks radiant and startlingly young. Liam Hemsworth looks beardy.\nConsidering there are only 100 days left until the movie premieres on Nov 21, we can probably expect an influx of trailers sooner rather than later. All we've really gotten so far are a series of (cryptic, creepy) teasers and one very teeny tiny trailer so far, after all. We need more! There's so much left to see! District 13, more of Katniss' face, more of Natalie Dormer's Cressida. Book readers will know more or less what's up with Peeta in this first of the two Mockingjay movies, but it'd be nice to see a trailer that shows us where Katniss' mind is given all the ways her life was shaken up in Catching Fire.\nOnly a hundred days until all of this hits theaters.","url":"https://www.bustle.com/articles/35533-jennifer-lawrence-hunger-games-cast-celebrate-100-days-til-mockingjay-part-1-photo"}
