{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 18:57:28","date_modify":"2018-10-30 18:57:28","date_publish":"2016-08-18 17:13:59","description":"Hollywood A-lister Jennifer Garner hosts a fundraiser for the Democratic nominee for president Hillary R. Clinton campaign.","filename":"data/vaneerConsumption/JenniferGarnerHostsHillaryClintonFundraiserinMontana.json","image_url":"https://media.breitbart.com/media/2016/08/ben-affleck-and-jennifer-garner-Christopher-PolkGetty-Images-for-VH1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_18__1540925848.html","title":"Jennifer Garner Hosts Hillary Clinton Fundraiser in Montana","title_page":"Jennifer Garner Hosts Hillary Clinton Fundraiser in Montana","title_rss":"NULL","source_domain":"breitbart.com","text":"Hollywood A-lister Jennifer Garner hosts a fundraiser for the Democratic nominee for president Hillary R. Clinton campaign Thursday at the home of Benjamin and Penelope Pierce from 4:30 p.m. to 6:30 p.m. Thursday, according to the Bozeman Daily Chronicle.\nThe paper reports that Penelope is the executive director of the Gallatin Valley Land Trust and that the co-hosts include Democrats Carol Williams and her daughter Whitney Williams, a former Hillary Clinton trips director, state Rep. Chris & Maddy Pope, Bob and Sally Sands, Bozeman Mayor Carson, and Dede Taylor\nBozeman is a popular vacation site for celebrities in southwest Montana. In the winter, there are world-class skiing trails and in the summer it is considered a cool retreat. The city sits in a valley along the Yellowstone River and is less than 100 miles from the Yellowstone National Park.\nGarner is already in The Big Sky State and the starlet was photographed Tuesday with players from the Montana State University’s female volleyball team.\nGarner, 44, was photographed in Los Angeles earlier this week. She may be headed up to the private Yellowstone Club in Big Sky where she’s known to vacation. But hearing Garner speak costs a minimum $100 contribution to Clinton’s campaign, the email from the campaign says there is limited availability for $100 donors.\nThe star of Dude, Where’s My Car? is a active supporter of Democratic candidates. In the 2016 cycle, she donated $5,940 to Act Blue, a left-wing Political Action Committee, as well as 5,400 to the aborted congressional campaign of Democract Melissa Gilbert, who starred in the 1970s TV series Little House On The Prairie. Garner, who no longer uses the surname Affleck in legal filings since beginning the process of divorcing actor Ben Affleck, also gave $2,700 to California Democrat Kamala Harris’s Senate campaign.\nGarner’s $2,700 contribution to Clinton is a good start, but in 2012 she gave President Barack Obama’s Victory Fund $12,500.","url":"https://www.breitbart.com/politics/2016/08/18/jennifer-garner-hosts-hillary-clinton-fundraiser-belgrade-montana/"}
