{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 00:01:08","date_modify":"2018-10-23 00:01:08","date_publish":"2016-01-11 08:15:08","description":"The 46-year-old singer and actress was the picture of elegance in her simple yet sexy number as she partied the night away at the Beverly Hills Hilton on Sunday.","filename":"data/vaneerConsumption/JenniferLopezoozessophisticationatGoldenGlobes2016afterparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/3006C1FD00000578-0-image-a-38_1452504708477.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393538_Jennifer-Lopez-oozes-sophistication-Gloden-Globes-party_1540252868.html","title":"Jennifer Lopez oozes sophistication at Golden Globes 2016 after-party","title_page":"Jennifer Lopez oozes sophistication at Golden Globes 2016 after-party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She stole the show on the red carpet at the 2016 Golden Globes on Sunday in a dramatic yellow fishtail gown.\nAnd Jennifer Lopez ensured she looked just as good when she headed on to the after-party, switching things up in a sophisticated white number to party the night away at the Beverly Hills Hilton.\nThe 46-year-old singer and actress was the picture of elegance in her simple yet sexy number, showing off just a hint of skin thanks to a side split snaking up her right thigh.\nScroll down for video\nPicture perfect: Jennifer Lopez looked incredible in a white gown with a subtle side split as she kept the party going at the Beverly Hills Hilton after the 2016 Golden Globes on Sunday\nRay of sunshine: JLo looked incredible in a bright yellow number with a show-stopping train when she attended the main awards show earlier in the day\nJLo kept covered up thanks to a modest neckline and pretty capped sleeves, yet still showcased her enviable, hourglass figure and voluptuous derriere in the form-fitting cut.\nThe Latina beauty upped the glamour with silver accessories, including strappy stilettos and a sparkling clutch bag.\nShe accessoriesed with a huge diamond ring, large drop earrings and a sparkling bracelet.\nSee full Golden Globes coverage on the winners and red carpet fashion\nClassy: The singer and actress upped the glamour with silver accessories, including expensive jewellery and a sparkling clutch bag\nCoordinating: The 46-year-old beauty sported a slick of dark red lipstick and a matching manicure\nDate night: The star was joined by her boyfriend Casper Smart at the after-party, looking dapper in a tux\nFigure-hugging: The white number made the most of the On The Floor hitmaker's incredible curves\nThe On The Floor hitmaker opted for a tousled blow dry, and a vampish slick of dark red lipstick and a matching manicure.\nHer date to the bash was boyfriend Casper Smart, who let her have her moment in the spotlight by walking the red carpet alone.\nThrice-married Jennifer - who has tied the knot with Ojani Noa, Cris Judd and Marc Anthony in the past - recently insisted she won't be getting married to the choreographer.\nDramatic: JLo accessorised with a sparkling red lipstick and beautiful drop earrings\nTender touch: Casper kept a protective arm on his partner's back as they walked the red carpet\nCheesy grin! The dancer looked happier than Jennifer to be at the star-studded bash\nKeeping the party going: The couple then headed on to the Universal, NBC, Focus Features and E! Entertainment Golden Globe after-party\nShe knows her angles! The brunette beauty ensured she looked her best on the red carpet\n'No wedding. There’s no wedding', she declared when Ellen DeGeneres pressed her about future plans. 'Honest!', she added after the chat show host appeared disbelieving.\nThe Golden Globe Awards are bestowed by the 93 members of the Hollywood Foreign Press Association (HFPA) and recognise excellence in film and television, both domestic and foreign.\nWhile their record in predicting Oscars glory has been hit-and-miss, many see the Globes as a pretty strong indicator of films and actors destined for an Academy Award on February 28.\nBritish comedian Ricky Gervais returned as host, taking over duties from Tina Fey and Amy Poehler, marking his fourth time hosting the ceremony\nKeeping Up With The Kardashians: JLo and Casper chatted to Kourtney Kardashian and Kylie Jenner\nDeep in conversation: Kourtney and Jennifer appeared to be getting on like a house on fire\nCatching up: The singer and actress chatted to Hollywood hardman Jason Statham","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393538/Jennifer-Lopez-oozes-sophistication-Gloden-Globes-party.html"}
