{"authors":["Heidi Parker","Kate Thomas For Mailonline"],"date_download":"2018-10-23 02:30:44","date_modify":"2018-10-23 02:30:44","date_publish":"2016-01-11 14:45:31","description":"While at the CAA after party, the Jenny From The Block beauty cozied up to her 'girls' Lady Gaga and Kate Hudson. Turns out she has worked with Gaga before, on her Love album.","filename":"data/vaneerConsumption/JenniferLopezcoziesuptoKateHudsonandLadyGagaatGoldenGlobesafterparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300B19D200000578-0-image-a-7_1452523381542.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394018_Jennifer-Lopez-cozies-girls-Kate-Hudson-Lady-Gaga-Golden-Globes-party_1540261844.html","title":"Jennifer Lopez cozies up to Kate Hudson and Lady Gaga at Golden Globes after party","title_page":"Jennifer Lopez cozies up to Kate Hudson and Lady Gaga at Golden Globes after party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jennifer Lopez is so focused on work (American Idol, Shades Of Blue, her Vegas residency) and two kids (twins Max and Emme) that it's surprising she has time for friends.\nBut at the Golden Globes on Sunday evening, the 46-year-old star chatted up plenty of other celebrities.\nWhile at the CAA after party, the Jenny From The Block beauty cozied up to her 'girls' Lady Gaga and Kate Hudson.\nScroll down for video and winners box...\nPals: Jennifer Lopez shared a photo with Kate Hudson and Lady Gaga at the CAA Golden Globes after party on Sunday evening\nThe looker shared a photo of the three and captioned it, 'The girls and the globe!! Congrats Gaga! #goldenglobes #CAA #afterparty.'\nTurns out, J-Lo and Gaga are old pals. Gaga helped the Bronx babe write some of her songs for her Love album along with producer RedOne.\nKate and Jennifer seem to have been friends for years as they have been spotted at parties together for years.\nSee more of the latest pictures and videos from the 2016 Golden Globes after party\nKeeping Up With The Kardashians: JLo and Casper Smart chatted to Kourtney Kardashian and Kylie Jenner\nDeep in conversation: Kourtney and Jennifer appeared to be getting on like a house on fire\nLopez was also seen partying with Kylie Jenner and Kourtney Kardashian.\nJennifer has been friends with the Keeping Up With The Kardashians for years and they used to be neighbors when the I Luh Ya Papi singer owned a home in Hidden Hills near Kris Jenner.\nShe was even seen at Kris' annual Christmas Eve bash.\nCatching up: The singer and actress chatted to Hollywood hardman Jason Statham\nThe curvy singer also took time out to chat with her Parker co-star Jason Statham.\nHe is newly engaged to Rosie Huntington-Whiteley.\nLopez showed up to the Globes in a stunning canary Giambattista Valli Haute Couture design, which she accessorized with glittering Jimmy Choo shoes, a Judith Leiber Couture crystal herringbone clutch and over 200 carats of Harry Winston Diamonds including a 46.95-carat Diamond wreath necklace.\nShe later changed into a white dress.\nPicture perfect: Lopez looked incredible in a white gown with a subtle side split as she kept the party going at the Beverly Hills Hilton after the 2016 Golden Globes on Sunday\nRay of sunshine: JLo stood out in a bright yellow number with a show-stopping train when she attended the main awards show earlier in the day\nHelping his lady out: Smart held up a bottle of water for his longtime love\nSee full Golden Globes coverage on the winners and red carpet fashion\nClassy: The singer and actress upped the glamour with silver accessories, including expensive jewellery and a sparkling clutch bag\nCoordinating: The 46-year-old beauty sported a slick of dark red lipstick and a matching manicure\nDate night: The star was joined by her boyfriend Smart at the after-party, looking dapper in a tux\nFigure-hugging: The white number made the most of the On The Floor hitmaker's incredible curves\nThe On The Floor hitmaker opted for a tousled blow dry, and a vampish slick of dark red lipstick and a matching manicure.\nHer date to the bash was boyfriend Casper Smart, who let her have her moment in the spotlight by walking the red carpet alone.\nThrice-married Jennifer - who has tied the knot with Ojani Noa, Cris Judd and Marc Anthony in the past - recently insisted she won't be getting married to the choreographer.\nDramatic: JLo accessorised with a sparkling red lipstick and beautiful drop earrings\nTender touch: Casper kept a protective arm on his partner's back as they walked the red carpet\nKeeping the party going: The couple then headed on to the Universal, NBC, Focus Features and E! Entertainment Golden Globe after-party\nShe knows her angles! The brunette beauty ensured she looked her best on the red carpet\n'No wedding. There’s no wedding', she declared when Ellen DeGeneres pressed her about future plans. 'Honest!', she added after the chat show host appeared disbelieving.\nThe Golden Globe Awards are bestowed by the 93 members of the Hollywood Foreign Press Association (HFPA) and recognise excellence in film and television, both domestic and foreign.\nWhile their record in predicting Oscars glory has been hit-and-miss, many see the Globes as a pretty strong indicator of films and actors destined for an Academy Award on February 28.\nBritish comedian Ricky Gervais returned as host, taking over duties from Tina Fey and Amy Poehler, marking his fourth time hosting the ceremony","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394018/Jennifer-Lopez-cozies-girls-Kate-Hudson-Lady-Gaga-Golden-Globes-party.html"}
