{"authors":["Sophie Haslett For Daily Mail Australia"],"date_download":"2018-10-23 00:28:07","date_modify":"2018-10-23 00:28:07","date_publish":"2017-03-16 09:44:38","description":"All eyes were on Myer on Thursday evening, when the renowned Australian department store unveiled its Autumn 17 covetable fashion collections in the central Sydney store. Jennifer Hawkins opened.","filename":"data/vaneerConsumption/JenniferHawkinsdazzlesatMyerinstoreSydneyshow.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E53277B00000578-0-image-a-51_1489657106976.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4318958_Jennifer-Hawkins-dazzles-Myer-store-Sydney-show_1540254487.html","title":"Jennifer Hawkins dazzles at Myer in-store Sydney show","title_page":"Jennifer Hawkins dazzles at Myer in-store Sydney show | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"All eyes were on Myer on Thursday evening, when the renowned Australian department store unveiled its Autumn 17 covetable fashion collections in the central Sydney store.\nBefore a front row that included the likes of Anna Heinrich, Alex Perry and Nicola Finetti, as well as a crowd of 1,500 customers, the Face of Myer, Jennifer Hawkins, opened the inaugural Sydney showcase wearing flowing Sass and Bide.\nJen was swiftly followed by fellow Myer ambassador, Kris Smith, and Tim Robards, who took to the 200-metre-long catwalk for his first runway appearance in ten years.\nJennifer Hawkins is seen walking the Myer show wearing a stunning lace dress by Alex Perry that retails for $2,200\nMyer unveiled its Autumn 17 covetable fashion collections in the central Sydney store on Thursday evening\nIn the opening Sass and Bide segment, 33-year-old Jen showcased why she has been at the top of her Myer game for so long.\nSporting a black halter-style top, flowing purple skirt and huge smile, she later re-appeared on the catwalk wearing Asilio and finally closed out glamorous proceedings in a dazzling lacy white Alex Perry gown.\nDominant trends of the evening included calf-high boots at Piper, peplum hems and sleeves at Nicola Finetti, gold accents and enviable headbands.\nThe sheer trend that was so ubiquitous both last season and on the recent Myer Autumn 17 fashion launch in Melbourne showed it was going nowhere too, as models often took to the catwalk in outfits featuring see-through panels and exaggerated sleeves.\nSporting a black halter-style top, flowing purple skirt and huge smile, she later re-appeared on the catwalk wearing Asilio\nA model showcases designs by Alex Perry during the Myer Fashion Runway show on Thursday evening\nJennifer Hawkins, Tim Robards and Kris Smith showcases designs during the Myer Fashion Runway show on Thursday\nTim Robards took to the 200-metre-long catwalk for his first runway appearance in ten years on Thursday evening\nThe models walked before a front row that included the likes of Anna Heinrich (third from left), Alex Perry and Nicola Finetti\nThe show, held at Sydney's Myer store on Thursday evening, was unique insofar as customers were invited to attend\nModel Kris Smith also walked the 200-metre runway to show off the Australian department store's Autumn 17 collection\nColour themes of the evening included monochrome, gold and pops of pink. One Alex Perry gown grabbed the attention of the crowds, thanks to its fluorescent pink colour and dramatic cut.\nAnother hit among the audience was a gold pleated mid-length skirt and Talulah's entire range of dresses.\nThe show, held at Sydney's Myer store on Thursday evening, was unique insofar as customers were invited to attend.\nIt was billed as the 'ultimate see, try and buy' retail experience - with people able to shop their favourite looks straight from the catwalk.\nThe 200-metre-long catwalk, meanwhile, snaked its way through the aisles of the womenswear floor.\nAnna Heinrich (left) takes a picture as her boyfriend, former Bachelor Tim Robards, walks down the runway","url":"https://www.dailymail.co.uk/femail/article-4318958/Jennifer-Hawkins-dazzles-Myer-store-Sydney-show.html"}
