{"authors":["Naomi Greenaway For Mailonline"],"date_download":"2018-10-23 01:29:37","date_modify":"2018-10-23 01:29:37","date_publish":"2016-01-28 15:50:21","description":"Carol appeared on The Jeremy Kyle Show to defend her relationship with Tommy, now 71, whom she fell in love with after his wife Shirley's death. She once thought of him as her adoptive dad.","filename":"data/vaneerConsumption/JeremyKyleguestfellinlovewiththemansheusedtocallDad.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB02B700000578-0-image-a-19_1453991553813.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3421051_Jeremy-Kyle-guest-fell-love-man-used-call-Dad_1540258177.html","title":"Jeremy Kyle guest fell in love with the man she used to call 'Dad'","title_page":"Jeremy Kyle guest fell in love with the man she used to call 'Dad' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman embroiled in a bizarre love story appeared on The Jeremy Kyle Show this morning to defend her relationship with the man she used to call 'dad'.\nGrowing up Carol had a close relationship with Tommy, 71, and his late-wife Shirley, but when the couple met up after Shirley's death they fell in love - and are now engaged.\nSpeaking to Carol, a bemused Kyle said: 'Let me get this right…you were brought up by them?'\nScroll down for video\nCarol appeared on The Jeremy Kyle Show this morning to defend her relationship with Tommy, 71, who she used to call 'dad'. Growing up Carol and had a close relationship with Tommy and his late-wife Shirley\nSpeaking to Carol, a bemused Kyle said: 'Let me get this right…you were brought up by them?' Carol explained: 'I used to call them adoptive mum and dad' but clarified that the couple did not officially bring her up\nCarol explained: 'I used to call them adoptive mum and dad.' She also clarified that the couple did not officially bring her up.\nDefending her relationship with Tommy, Carol said: 'We didn't expect this to happen when I met up with him.'\nTommy described his history with Carol saying: 'She just adopted me and Shirley as her mum and dad.'\nBut the widower credited Carol for saving him after his wife's death.\nDefending her relationship with Tommy, Carol said: 'We didn't expect this to happen when I met up with him'\nTommy (right) described his history with Carol (left) saying: 'She just adopted me and Shirley as her mum and dad.' But the widower also credited Carol for saving him after his wife's death\n'If it wasn't for Carol turning up at the house I would have been dead by now,' he said.\nIn a further twist, Allan, Tommy's surrogate son, also appeared on the show accusing the father of being the cause of Shirley's death.\nAllan claimed Tommy had been involved in his ex-wife's death for the financial reward and in order to be with Carol.\nAppalled by the current relationship between Carol and Tommy, Allen described it as being 'like monkeys' and accused Carol of being a gold digger and a cheat.\nBut the plot became even murkier when Allen revealed he and Carol had also had a relationship in the past.\nAfter a lie detector test proved Carol had not been cheating on her 71-year-old fiancé, Kyle wished the unlikely couple all the best for the future.\n'Let them get on with their lives and have a bit of happiness after Shirley's death,' he said.\nAppalled by the current relationship between Carol and Tommy, Allen, Tommy's surrogate son, described it as being 'like monkeys' and accused Carol of being a gold digger and a cheat","url":"https://www.dailymail.co.uk/femail/article-3421051/Jeremy-Kyle-guest-fell-love-man-used-call-Dad.html"}
