{"authors":["Sarah Barns For Mailonline"],"date_download":"2018-10-23 04:00:06","date_modify":"2018-10-23 04:00:06","date_publish":"2016-01-11 16:57:13","description":"Holly's ex-boyfriend Scott claimed that he is the dad of her baby and that they continued to have sex when she hooked up with her new partner, Andy. But Andy was adamant that the child is his.","filename":"data/vaneerConsumption/JeremyKyleguesthadsexwithtwomeninhalfanhouronNewYearsEve.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300CF20B00000578-0-image-a-7_1452530990353.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3394124_Woman-sex-two-men-half-hour-New-Year-s-Eve-appears-Jeremy-Kyle_1540267206.html","title":"Jeremy Kyle guest had sex with two men in half an hour on New Year's Eve","title_page":"Jeremy Kyle guest had sex with two men in half an hour on New Year's Eve | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 20-year-old woman who had sex with two men in half an hour on New Year's Eve has appeared on The Jeremy Kyle Show to prove who the father of her daughter is.\nHolly's ex-boyfriend Scott claimed that he is the dad of her one-year-old baby, Emily, and that they continued to have sex when she hooked up with her new partner, Andy. Meanwhile, Andy was adamant that Scott is a liar and the child is his.\nScott, 22, who was dressed in a grey pullover, dark jeans and white high-top trainers, told host Jeremy Kyle: 'We were together for two and a half years, at first it was great.\nA 20-year-old woman called Holly who had sex with two men in half an hour on New Year's Eve has appeared on The Jeremy Kyle Show to prove who the father of her daughter is\nHolly's ex-boyfriend Scott claimed that he is the dad of her one-year-old baby, Emily, and that they continued to have sex when she hooked up with her new partner, Andy\n'It was good for about a year and a half but we were in each other's pockets 24/7, we started arguing a lot and everything just went down hill from there.'\nScott said Holly instigated the split: 'She came home one night, we had a little argument and she just told me to leave and not come back.'\nBut when the pair broke up, they continued to sleep together. 'I was in love with her at the time. I thought there was a chance to reconnect and get back on track,' said Scott.\nJeremy told the audience that Holly admitted they had sex on one occasion but that Scott is making the rest up.\nMeanwhile, Andy was adamant that Scott is a liar and the child is his. Andy said he was with Holly all day on New Year's Eve and called Scott a 'low life, drug-taking scumbag'\nIn a bid to calm the tensions on stage, Jeremy started reading out the explosive DNA test results\nScott said the pair had sex on New Year's Eve. 'She'd spent most of the day at mine. Between 11pm and 12am she went to the pub to meet Andy. About 1am she came back to mine and then half an hour later she went home to Andy,' he said.\nIn that half an hour together, Scott claimed they slept together and that baby Emily is his. He said that Holly told him the child is his and that he still gets messages off her expressing her love.\nIn a rage, Holly's current partner Andy, dressed in a light blue top and jeans, stormed onto the stage and started yelling at Scott: 'You think you are my daughter's dad? You keep dreaming! You keep thinking about that mate.'\nAndy said he was with Holly all day on New Year's Eve and called Scott a 'low life, drug-taking scumbag'. Scott admitted he occasionally smokes cannabis.\nHolly, dressed in black, then walked onto the stage and said she 'doesn't want to be here'. She said she is '100 per cent sure' Andy is the father of her daughter and she doesn't want Scott.\nJeremy Kyle then showed the audience screen grabs of the messages exchanged between Holly and Scott, which show declarations of her love.\nA friend of Scott's called Ronnie then burst onto the stage and started screaming at Holly. She said 'She rarely keeps her knickers on! Tramp' and that Scott and Andy are being played against one another.\nIn a twist of fate, the lie detector results then showed that Scott and Holly have had sexual relations while she was with Andy\nHolly went onto admit that she has cheated on Andy with Scott throughout their relationship. Jeremy said to the pair: 'You're as bad as each other', before Andy stormed off stage\nAndy tried to deny he had done anything wrong, claiming he was drunk and wasn't knowingly aware of any instances of when he cheated\nIn a bid to calm the tensions on stage, Jeremy started reading out the explosive DNA test results.\nThey showed that Andy is the father of Holly's baby. Scott apologised but said he had to find out the truth.\nIn a twist of fate, the lie detector results then showed that Scott and Holly have had sexual relations while she was with Andy.\nAttention then turned to Andy's lie detector results. They showed that he passionately kissed, had sexual contact and had sex with someone while he was with Holly.\nShe went onto admit that she has cheated on him with Scott throughout their relationship.\nJeremy said to the pair: 'You're as bad as each other', before Andy stormed off stage.\nJeremy followed him and said to the angry dad: 'I would say you're the victim, but you cheated on her as well.'\nThe host left the broken couple with counsellor Graham Stanier to try and resolve their problems, and it was revealed since the show that the pair had decided to move on together with their relationship\nAndy tried to deny he had done anything wrong, claiming he was drunk and wasn't knowingly aware of any instances of when he cheated.\nAs Holly appeared in the hallway to watch an upset Andy, Jeremy blasted her: 'You really take the biscuit. You're one smug woman.'\nHolly's ex Scott was still lingering with his mates Ronnie and Roxie who told Andy he was being taken for a mug.\nJeremy reminded the arguing pair that there was only one person they should care about - Emily, their daughter: 'It's the kid that matters.'","url":"https://www.dailymail.co.uk/femail/article-3394124/Woman-sex-two-men-half-hour-New-Year-s-Eve-appears-Jeremy-Kyle.html"}
