{"authors":["Press Association"],"date_download":"2018-10-23 01:49:23","date_modify":"2018-10-23 01:49:23","date_publish":"2017-04-26 12:34:09","description":"Mr Corbyn said Mrs May was not a strong leader because she was \"weak against the strong\".","filename":"data/vaneerConsumption/JeremyCorbynwouldfailtokeepUKsafeclaimsTheresaMay.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/22/wire-468245-1493243352-126_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447398_Theresa-May-Jeremy-Corbyn-head-head-final-PMQs-election_1540259363.html","title":"Jeremy Corbyn would fail to keep UK safe, claims Theresa May","title_page":"Jeremy Corbyn would fail to keep UK safe, claims Theresa May | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Theresa May has accused Jeremy Corbyn of being “simply not up to the job” of running the country as the pair clashed in the Commons for the final time before the General Election.\nMr Corbyn said the election was a choice between a Tory government that would stand up for the few and a Labour Party that would represent all.\nBut during Prime Minister’s Questions Mrs May said the Labour leader would fail in his first duty of keeping the country safe.\nShe said: “The plan to disband MI5, to disarm our police and to scrap our nuclear deterrent was endorsed by his policy chief and even by his shadow chancellor.\n“Again at the weekend, we saw him refusing to say he would strike against terrorism, refusing to commit to our nuclear deterrent and refusing to control our borders.\n“Keeping a country safe is the first duty of a prime minister. He is simply not up to the job.”\nThe Conservatives are strong against the weak and weak against the strong. That's not leadership. #PMQs pic.twitter.com/vXzfYq7BUs — Jeremy Corbyn (@jeremycorbyn) April 26, 2017\nMr Corbyn said Mrs May was not a strong leader because she was “weak against the strong”, taking on her central campaign message.\n“Strong leadership is about standing up for the many, not the few, but when it comes to the Prime Minister and the Conservatives, they only look after the richest, not the rest,” he said.\n“They are strong against the weak, and weak against the strong.\nTheresa May speaks during Prime Minister's Questions\n“Far from building a strong economy, schools and our NHS are being cut, people can’t afford homes, millions can’t make ends meet.\n“That doesn’t add up to a stronger economy for anyone.\n“The election on June 8 is a choice – between a Conservative government for the few and a Labour government that will stand up for all of our people.”\nWe have a clear choice: The Tories who stand only for the few. Or Labour who will build a Britain for the many #PMQs pic.twitter.com/Y4gN02Qlta — Emily Thornberry (@EmilyThornberry) April 26, 2017\nA senior Labour source accused the Prime Minister of spreading “recycled fake news”.\nShadow chancellor John McDonnell had already made clear that he did not sign a document calling for MI5 to be disbanded, said the source. Although he was photographed holding the document, “he thought he was holding something else up”, the source added.\n“This was all dealt with when the allegation first came out,” said the Labour source. “It is not the case that John McDonnell signed any such statement. It was a confusion about another statement.\n“We are talking about recycled fake news.”\nThe source said Labour had made clear it backs “strong security service funding and support to deal with the terrorist threat and other threats”.","url":"https://www.dailymail.co.uk/wires/pa/article-4447398/Theresa-May-Jeremy-Corbyn-head-head-final-PMQs-election.html"}
