{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 01:13:52","date_modify":"2018-10-23 01:13:52","date_publish":"2016-01-28 15:31:49","description":"The Labour leader, wearing an ill-matching suit, loose tie and scruffy shoes on a trip to Teesside, has backed a head who banned nightwear on the school run to raise standards.","filename":"data/vaneerConsumption/JeremyCorbynbacksbanonslummymummieswearingpyjamas.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACC66500000578-0-image-a-48_1454004194770.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421116_Jeremy-Corbyn-backs-ban-slummy-mummies-wearing-pyjamas-school-run-tells-rebels-Wear-coat-proper-clothes-on_1540257232.html","title":"Jeremy Corbyn backs ban on slummy mummies wearing pyjamas","title_page":"Jeremy Corbyn backs ban on slummy mummies wearing pyjamas | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jeremy Corbyn's own disheveled look has been long-criticised, but today even he told parents who take children to school in their pyjamas to 'put some proper clothes on'.\nThe Labour leader, wearing an ill-matching suit, loose tie and scruffy shoes on a trip to Teesside, has backed a headteacher who banned nightwear at the gates because it sets a bad example.\nYesterday parents at the Darlington school were defiant, accusing the head of 'snobbery, and Karen Routh, 49, flouted the rule in pyjamas and Ugg boots a day after the diktat was issued.\nMr Corbyn, who has been branded 'scruffy' by critics for decades, said: 'I wouldn't do it myself, I'd advise people to wear a coat and put some proper clothes on - it gets cold out there.'\nMessage: Jeremy Corbyn was in the North-East today and agreed parents should get dressed for the school run after a local headteacher brought in a pyjama ban, flouted by Karen Routh yesterday\nTatty: Mr Corbyn's unpolished and well-worn shoes were spotted by a photographer on Teesside today\nHeadmistress Kate Chisholm, who runs Skerne Park Primary School in Darlington, County Durham, this week ordered parents to stop wearing pyjamas and slippers on the school run.\nPriorities: Mr Corbyn, pictured heading off on a weekend bike ride in October, urged parents to ensure their children are well rested and fed to help them succeed\nIn a formal letter to families, Kate Chisholm wrote: 'If we're to raise standards it's not too much to ask parents to have a wash and get dressed'.\nResponding to the story Mr Corbyn said: 'I didn't know the teacher had written to parents.\n'I've got a lot of sympathy for that teacher, but I wouldn't get too hung up about the whole thing.\n'The most important thing is to get the kids into school, the most important thing is to get them there on time, the most important thing is to make sure they have breakfast before they go to school, that they can concentrate when they're there, and they've slept the night before.'\nYesterday parents at the school gates said they felt judged by the letter, which accused parents in nightwear of setting a bad example and said it was 'not too much to ask parents to have a wash and get dressed'.\nRebel Karen Routh said putting on an outfit before taking her eight-year-old daughter Holly to school would have made her late for lessons.\nShe added: 'I think as long as the children are on time and dressed correctly in their uniform it doesn't really matter if the parents sometimes wear pyjamas.\n'The head thinks it affects a child's aspirations to see their parents taking them to school in pyjamas but I know for certain that no child grows up with the aspiration to wear pyjamas when they go out to work.'\nParent Claire Slaven, 33, said she felt judged after reading the letter from head Kate Chisholm and has since received abuse online.\nShe added: 'This has made everyone on Skerne Park look bad … and that's not fair on those of us who dress properly to bring our kids to school … we've had all kinds of abuse on social media since the letter was sent. We're not lazy, idle people. The majority of the parents are decent and hardworking.'\nPast form: Mr Corbyn's laid-back and sometimes unusual sartorial style has seen people brand him a 'scruffpot'\nMother Cheryl Wright, 30, said: '[The head] might be trying to raise standards but as long as the kids arrive on time and are well dressed what harm does it do?'\nAnother mother said: 'It's just snobbery. The head should be dealing with the real issues at the school, like the bullying, instead of looking down on people from Skerne Park and telling them what to wear.'\nMrs Chisholm yesterday defended her actions, saying some parents showed up for Christmas performances and parent’s evenings in nightwear.\n‘It is important that parents are role models and for them to see that they should maybe not attend events in nightwear.\n‘That they should not sit around in pyjamas because they don’t have to get dressed for work.\n‘I don’t give two hoots how people dress at home, I just think if they’re a good role model for their children and want them to get a job and better yourself then they ought to get dressed.’\nParent Karen Routh, 49, (left) completed the school run in her pyjamas in protest against headteacher Kate Chisholm (right), who asked parents not to bring their children to school in their nightclothes\nThe mother said she was running late as she arrived at Skerne Park Academy in Darlington wearing her pyjamas","url":"https://www.dailymail.co.uk/news/article-3421116/Jeremy-Corbyn-backs-ban-slummy-mummies-wearing-pyjamas-school-run-tells-rebels-Wear-coat-proper-clothes-on.html"}
