{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-22 21:14:41","date_modify":"2018-10-22 21:14:41","date_publish":"2016-01-11 00:33:15","description":"Catherine McKinnell quit as shadow attorney general blaming 'concerns about the direction and internal conflict' within Labour. Ms McKinnell is the fourth Labour front bencher to quit in a week.","filename":"data/vaneerConsumption/JeremyCorbyndefieswarningofshadowcabinetTridentresignations.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/300A168100000578-0-image-a-13_1452514542060.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393166_Now-THREE-Labour-frontbenchers-ready-quit-Trident_1540242881.html","title":"Jeremy Corbyn defies warning of shadow cabinet Trident resignations","title_page":"Jeremy Corbyn defies warning of shadow cabinet Trident resignations | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jeremy Corbyn was faced with a new reshuffle today after Catherine McKinnell quit as shadow attorney general blaming 'concerns about the direction and internal conflict' within Labour.\nMs McKinnell, who attends shadow cabinet but is not a full member, is the fourth Labour front bencher to resign since last week's reshuffle.\nThe news comes hours after Mr Corbyn warned party members could get a vote on Labour's Trident policy as the Labour leader seeks to move the party to his position of unilateral disarmament.\nJeremy Corbyn, pictured left outside his home this weekend, said he wanted ordinary party members to be involved in drawing up a new nuclear weapons policy. But following his remarks, Catherine McKinnell, the shadow attorney general, pictured right, became the latest to quit Labour's front bench\nIn a letter to Mr Corbyn, the former employment solicitor, who represents Newcastle North, told him she had 'shared your optimism for the 'new kind of politics' you spoke so compellingly about'.\n'However, as events have unfolded over recent weeks, my concerns about the direction and internal conflict within the Labour Party have only grown and I fear this is taking us down an increasingly negative path.'\nMs McKinnell said she reached her decision following 'much consideration' over the weekend and said she was resigning with a 'heavy heart'.\nLabour later announced Karl Turner would replace Ms McKinnell as shadow attorney general.\nMr Corbyn has rejected the warnings of his shadow cabinet over Trident nuclear weapons and warned he could give party members the final say on party policy.\nThe Labour leader, a life long opponent of nuclear weapons, infuriated many of his MPs by reshuffling Maria Eagle out of shadow defence ahead of a party review on the issue being co-chaired by Ken Livingstone.\nAmid the new row, it emerged Mr Corbyn would attend but not speak at tonight's regular meeting of Labour MPs but would not speak - insisting the meeting was to be centred on floods.\nLabour MPs expressed regret at Ms McKinnell's departure.\nShadow minister without portfolio Jonathan Ashworth said: '@CatMcKinnellMP is a good mate, decent person & a totally committed Labour MP. Sorry to see her step down from Shadow Cabinet.'\nShadow cabinet member Jonathan Ashworth tweeted his sadness at Ms McKinnell's departure from Labour's top team\nMichael Dugher - sacked by Mr Corbyn last week - noted the loss of a working mum from Mr Corbyn's front bench team\nCaerphilly MP Wayne David said he had 'respect' for the decision made by shadow attorney general\nCaerphilly MP Wayne David said she was a 'brilliant' member of the shadow justice team, adding he had 'respect' for the decision.\nMichael Dugher, sacked last week by Mr Corbyn, said: 'Cat is incredibly talented & so well-respected. Losing a working mum from NorthEast is also big loss from frontbench.'\nThree shadow cabinet members have refused to rule out quitting if Mr Corbyn pushes through a change to official party policy - which backs renewing Trident - to bring it into line with his own views.\nThe appointment of Emily Thornberry to the defence brief was widely seen as a step in this direction and today Mr Corbyn said he could push for a rule change within Labour to make changing policy easier.\nHe told the BBC Today programme: 'I want members to have a big say in it. Whether that comes as a vote of individual members or a vote of conference that will be decided, I haven't made up my mind.'\nHe continued: 'My whole election programme was based on the need for ordinary people to be able to participate much more in politics so leaders don't go away and write policy, that executive groups don't go off and decide what the policy is, that ordinary people – there is brilliance in everybody.\n'THAT'S HYPOTHETICAL': JEREMY CORBYN DUCKS QUESTIONS ON WHETHER HE WOULD DRONE STRIKE TERRORISTS Jeremy Corbyn has said questions over whether he would order a drone strike against the suspected new Jihadi John were 'hypothetical'. The Labour leader, who was critical of David Cameron's decision to order a drone strike against terror suspects in Syria last year, said tackling the causes of ISIS were more important. Specifically asked about killing the so-called 'Jihadi Sid', he told the BBC Radio 4 Today programme: 'I think it's a hypothetical question. 'You have to look at the sources of the support of Isil, you have to look at the way it gets its money, the way it gets its weapons, the way it gets its arms and look at the big picture.' He continued: 'I would want to see the evidence of it first, obviously, but the point I am trying to make is Isil haven't come from nowhere, they have got a great deal of money from somewhere.' Asked a third time, Mr Corbyn said: 'I would want to know what the evidence is, what difference it would make about doing that, what the chances were of capturing somebody - I suspect very, very low in those circumstances - so action could be taken.'\n'That's why I think our party membership has got so much bigger because people are enthused by the idea they can participate.\n'Tom Watson are looking at digital ways of involving people, we're looking at lots of way to modernise our politics, modernise our democracy, bring people in. Everybody has got ideas, let's hear them.'\nCurrent Labour rules would see a policy decided by the party's national executive committee and sent to the annual party conference for approval.\nLast year's conference approved the current version of the policy, which backs buying four new submarines to carry this missiles, sparking a furious shadow cabinet row just days after Mr Corbyn took over as leader.\nThe Government is expected to call a Commons vote on Trident by June, forcing Labour into adopting a position on the issue.\nYesterday, several shadow cabinet members - including shadow justice secretary Lord Falconer, shadow education secretary Lucy Powell and shadow work and pensions secretary Owen Smith - refused to rule out quitting the shadow cabinet if Mr Corbyn pushed through the change.\nAsked if he would quit the front bench, Mr Smith told BBC Radio 5 Live that it would be 'difficult' for him to continue if the party backed a position of nuclear disarmament. This was Labour policy in the 1980s until Neil Kinnock abandoned it after two election defeats.\nLord Falconer would not rule it out either, saying when asked on the BBC's Andrew Marr Show if he would quit: 'Let's see what happens in relation to that but I am clear that I support Trident remaining.'\nAnd Miss Powell – who stressed that she is 'not a unilateralist' – told the BBC's Sunday Politics: 'Let's see where we get to.'\nDan Jarvis, seen as a potential successor to Mr Miliband, said he would be uncomfortable running on a Labour manifesto which committed the party to unilateral disarmament.\nMr Corbyn today insisted he wanted Labour policy to be 'comprehensive'.\nWork and pensions spokesman Owen Smith (left), justice spokesman Lord Falconer (centre) and education spokesman Lucy Powell (right) all failed to rule out resigning from their posts if Mr Corbyn succeeds in changing party policy\nHe said: 'It has to start from the basis we are signed up to the nuclear non-proliferation treaty, itself a creation of the 1960s Labour government of Harold Wilson.\n'And there also has to be a policy of what we do to ensure protection of skills and jobs throughout British industry that are in some part reliant on the Trident nuclear programme.\n'But if we want to live in a nuclear-free world we have to recognise we have to make a contribution to it. Renewing Trident in my view goes against the fundamental spirit of the nuclear no-proliferation treaty which requires the five declared nuclear weapon states not to renew their weapon systems.'\nAlison McGovern yesterday became the fourth Labour resignation in a week as she stepped down as head of a review into child poverty, saying she could not work with the leadership.\nThe resignation of the Wirral South MP came after Shadow Chancellor John McDonnell denounced Progress, a group of centrist or Blairite MPs that she runs, as having a 'hard-Right Conservative agenda'. Last week, three other frontbenchers resigned, two were sacked and Maria Eagle was moved to become culture spokesman, a lesser job.\nA majority of Labour MPs are in favour of Trident renewal, as are most of the Shadow Cabinet, including deputy leader Tom Watson, and the party's union backers Unite and GMB.\nBut there are fears among moderate MPs that Mr Corbyn and Mr McDonnell will use their hard-Left allies to force through a change in party policy.\nIt was reported yesterday that an unpublished union paper is calling for the Shadow Cabinet to be stripped of its power over policy, with all decisions instead made by the National Executive Committee.\nThis is an administrative body consisting of MPs, members of constituency parties and unions – and it is largely pro-Corbyn.The plan for a power grab will be put to the NEC at its next meeting later this month.","url":"https://www.dailymail.co.uk/news/article-3393166/Now-THREE-Labour-frontbenchers-ready-quit-Trident.html"}
