{"authors":["Daniel Martin","Chief Political Correspondent For The Daily Mail"],"date_download":"2018-10-22 20:19:04","date_modify":"2018-10-22 20:19:04","date_publish":"2016-01-28 00:49:49","description":"Cabinet Secretary Sir Jeremy Heywood, known as Sir Cover-Up because of his attitude to freedom of information, has held two meetings with Google – under fire for paying far too little in British tax.","filename":"data/vaneerConsumption/JeremyHeywoodinvitedtaxdodgingGoogleandFacebookforregularconsultations.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/30A0BEA900000578-0-image-a-17_1453941454070.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420201_Sir-Cover-s-cosy-Google-chats-Civil-service-chief-invited-tax-dodging-web-giants-regular-consultations_1540239544.html","title":"Jeremy Heywood invited tax-dodging Google and Facebook for regular consultations","title_page":"Jeremy Heywood invited tax-dodging Google and Facebook for regular consultations  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Cosy chats: Cabinet Secretary Sir Jeremy Heywood (pictured) has held two meetings with Google – under fire for paying far too little in British tax\nTax-dodging web firms Google and Facebook have been invited to a series of cosy meetings with the head of the civil service, it can be revealed.\nCabinet Secretary Sir Jeremy Heywood has held two meetings with Google – under fire for paying far too little in British tax.\nThe senior mandarin, known as Sir Cover-Up because of his attitude to freedom of information, has had three sessions over the past four years with Facebook, which is also accused of not paying enough in tax.\nThe Cabinet Office said Sir Jeremy and unnamed Google representatives had held ‘general’ discussions on ‘policy issues’.\nGoogle stands accused of paying an effective tax rate of only 3 per cent after it reached an agreement with HMRC to pay back just £130million to cover a decade of back taxes.\nFacebook is resisting attempts by the authorities to claim back tax despite the fact the web firm paid just £4,327 in corporation tax in 2014.\nLast night Tom Watson, Labour’s deputy leader, said: ‘Taxpayers deserve to know if internet giants like Google and Facebook discussed the size of their tax bills in private meetings with the country’s most senior civil servant.\n‘Paying tax on UK profits is an obligation, not a choice. This Government claims to be the most transparent in history, so it should tell us without delay who was present at these meetings and what was said.’ The Government has long been accused of being too close to firms such as Google and Facebook.\nSince 2010, ministers have met with Google on average once a month. During that period, David Cameron led talks with the internet giant six times and George Osborne five times.\nIn April 2013, Treasury minister David Gauke flew to Los Angeles, where Google has offices.\nCulture minister Ed Vaizey visited its London HQ last week, where he spoke about the creative industries to Google and Facebook executives.\nQuestions have also been raised about close links between senior Conservatives and top Google executives. Rachel Whetstone, former political secretary to ex-Tory leader Michael Howard, became Google’s global head of communications and public policy. She is married to David Cameron’s former chief of staff, Steve Hilton.\nNaomi Gummer, ex-adviser to Jeremy Hunt, became public policy analyst at Google. And Joanna Shields became Mr Cameron’s digital adviser after years of leading Google’s Europe division. She is also a former managing director of Facebook in Europe.\nTwo years ago, the Prime Minister raised her to the peerage as Baroness Shields, and after the election she was made minister for internet security.\nOfficial figures show ministers have held 73 meetings with Google since 2010 – the equivalent of one a month.\nBillionaire media mogul Rupert Murdoch yesterday accused ministers of being ‘easily awed’ by Google, and wrote on Twitter: ‘Google has cleverly planted dozens of their people in White House, Downing St, other governments. Most brilliant new lobbying effort yet.’\nSince 2010, David Cameron has led talks with Google six times and George Osborne five times. Former Google CEO and now executive chairman Eric Schmidt chats to the Prime Minister at a drinks reception in 2012\nPM GURU: FIRMS 'ABOVE LAW' Giant corporations like Google appear to be operating ‘above the law’, David Cameron’s former policy guru warned yesterday. Steve Hilton said he understood public anger about the power of huge multinationals – and urged ministers to rein them in. Mr Hilton, whose wife Rachel Whetstone is a former Tory adviser and Google executive, warned failure to tackle crony capitalism would drive voters to the Left. He said: ‘There is a growing sense that companies that are so big and so dominant … really are above the law. In this particular case they have made clear they were abiding by the law – then, when the arrangements caused anger, and now that they have new arrangements.’ He added: ‘Those of us who really believe in the power of business and capitalism to do good things … have really got to make clear to businesses that they have a responsibility to behave in a way that earns public trust.’\nDowning Street yesterday defended ministers’ close contacts with Google, saying many of the meetings related to issues such as online safety.\nMr Cameron’s official spokesman said: ‘I think protecting our children online and the safety of our country and the risks online are more than enough reason to justify meetings.’\nSir Jeremy is the most powerful figure in Whitehall. He works so closely with the PM that Mr Cameron sees him as his ‘right-hand mandarin’. He was also one of Tony Blair’s key aides, working as his Principal Private Secretary from 1999 to 2003.\nDetails of the meetings between Sir Jeremy and the two web firms come from transparency records published by the Cabinet Office. They show he held a ‘general discussion’ with Google in April 2012, months after he was made Cabinet Secretary.\nIn October 2014, he held a ‘discussion on policy issues’ with Google.\nThe papers show Sir Jeremy had a ‘general discussion’ with Facebook in May 2012, and a ‘discussion on the digital industry’ in December 2013. In February 2015, he met the firm to discuss ‘national security issues’.\nBernard Jenkin, of the Commons public administration select committee, said: ‘I don’t know whether taxation affairs were discussed. But it would seem a bit odd if the Cabinet Secretary is taking over the role of HMRC.’ Last night a Cabinet Office spokesman said tax was not discussed at any of the meetings.\nGoogle said it did not negotiate tax deals at the meetings with Sir Jeremy, as tax matters are settled by HMRC. A Facebook spokesman said the meetings were not about tax, adding: ‘We are compliant with UK tax law and in fact in all countries where we have employees and offices.’\nLast night Google vice-president Peter Barron hit back at critics, writing in the Financial Times: ‘Corporation tax is paid on profits not revenue, and is collected where the economic activity that generates those profits takes place .","url":"https://www.dailymail.co.uk/news/article-3420201/Sir-Cover-s-cosy-Google-chats-Civil-service-chief-invited-tax-dodging-web-giants-regular-consultations.html"}
