{"authors":["Jennifer Brett"],"date_download":"2018-10-30 21:33:14","date_modify":"2018-10-30 21:33:14","date_publish":"2015-05-29 07:23:42","description":"Jeremy Renner has been in town working on the Marvel project \"Captain America: Civil War\" and has fo...","filename":"data/vaneerConsumption/JeremyRennertakesyoubehindthescenesatCaptainAmericaCivilW.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_buzz_jeremy-renner-tak_2bf3b607e263dd4429c377cf541fa8d1__1540935194.html","title":"Jeremy Renner takes you behind the scenes at \"Captain America: Civil W","title_page":"Jeremy Renner takes you behind the scenes at \"Captain America: Civil W","title_rss":"NULL","source_domain":"ajc.com","text":"Jeremy Renner has been in town working on the Marvel project \"Captain America: Civil War\" and has found a little time to share a peek or two from the set.\nRenner has spent time in Atlanta before, filming last year's \"Kill the Messenger\" here. My interview with director Michael Cuesta is here.\n(Full coverage of \"Captain America: Civil War\" below!)\nJeremy Renner at the \"Captain America: Civil War\" set. Photo: Atlanta Filming\n\"On set. Behind the scene. #civilwar #captainamerica #hawkeye this set is amazing,\" he posted.\nHe definitely had his game face on to suit up as Clint Barton / Hawkeye.\nAnd it looks like he had fun during his downtime!\nMore coverage:\nScarlett Johansson, Chris Evans, Anthony Mackie on the set of Marvel’s “Captain America: Civil War”\nRobert Downey Jr. spotted in Atlanta\nChris Evans suits up for “Captain America” Civil War”\nJeremy Renner on the “Captain America: Civil War” set\nCap vs Crossbones! Chris Evans, Frank Grillo film action scenes at Marvel’s “Captain America: Civil War” set\n“Captain America” stars cheer on the Atlanta Hawks\nScarlett Johansson, Chris Evans spotted in Buckhead\nPhotos from the Buckhead set\nPhotos from the Midtown set\nChris Evans spotted toning his “monster” physique at Atlanta gym","url":"https://www.ajc.com/blog/buzz/jeremy-renner-takes-you-behind-the-scenes-captain-america-civil-war-set/oc6206MIkeoXneMW9cC4JK/"}
