{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-23 01:34:08","date_modify":"2018-10-23 01:34:08","date_publish":"2016-01-11 12:36:00","description":"The Labour leader, who was critical of David Cameron's decision to order a drone strike against terror suspects in Syria last year, said tackling the causes of ISIS were more important.","filename":"data/vaneerConsumption/JeremyCorbynadmitshewouldauthoriseadronestrikeagainstterrorists.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/3007A95400000578-0-image-a-5_1452515596229.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393854_After-asked-THREE-times-Jeremy-Corbyn-admits-authorise-drone-strike-against-terrorists-planning-attacks-Syria_1540258448.html","title":"Jeremy Corbyn admits he would authorise a drone strike against terrorists","title_page":"Jeremy Corbyn admits he would authorise a drone strike against terrorists | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jeremy Corbyn has said questions over whether he would order a drone strike against the suspected new Jihadi John were 'hypothetical' - but opened the door to authorising a strike in some circumstances.\nThe Labour leader, who was critical of David Cameron's decision to order a drone strike against terror suspects in Syria last year, said tackling the causes of ISIS were more important.\nBut asked three times whether or not he would sign off a drone strike, Mr Corbyn eventually offered a narrow set of circumstances where 'action could be taken'.\nJeremy Corbyn, pictured today attending a BBC interview, outlined a set of circumstances - such as evidence of crimes, the difference a strike would make and the possibility of capture - where 'action could be taken' against a terrorist in Syria\nThe new remarks stand in stark contrast to Mr Corbyn's comments in September, when he said he 'unclear as to the point of killing' Reyaad Khan.\nSpecifically asked about killing the so-called 'Jihadi Sid', he told the BBC Radio 4 Today programme: 'I think it's a hypothetical question.\n'You have to look at the sources of the support of Isil, you have to look at the way it gets its money, the way it gets its weapons, the way it gets its arms and look at the big picture.'\nHe continued: 'I would want to see the evidence of it first, obviously, but the point I am trying to make is Isil haven't come from nowhere, they have got a great deal of money from somewhere.'\nAsked a third time, Mr Corbyn said: 'I would want to know what the evidence is, what difference it would make about doing that, what the chances were of capturing somebody - I suspect very, very low in those circumstances - so action could be taken.'\nThe Prime Minister authorised a strike against Khan and fellow UK jihadist Ruhul Amin in August last year.\nMr Cameron stunned MPs with the announcement in September by revealing the UK had used military force in Syria without parliamentary authority and against a Briton.\nIt was not until December the Commons voted for wider authorisation for bombing ISIS targets in Syria.\nIn his announcement, Mr Cameron said: 'There was a terrorist directing murder on our streets and no other means to stop him.'\nMr Corbyn was repeatedly asked whether he would authorise a drone strike against the man alleged to be a new ISIS spokesman - the so-called Jihadi Sid\nThe revelation that Khan, 21, from Cardiff, had been assassinated in the first RAF drone strike against a Briton triggered claims of extra-judicial killing. But Mr Cameron insisted the attacks were an act of self-defence and entirely legal.\nHe said Khan and Hussain were orchestrating attacks on 'high-profile public commemorations' over the summer from the IS stronghold of Raqqah.\nTargets included VJ Day last month and the VE day commemorations of May 8. The commemorations were attended by scores of war veterans and dignitaries – including the Queen.\nMr Corbyn said 'the PM has some very difficult questions to answer about the legality of what he did'.\nHe added: 'I'm unclear as to the point of killing the individual by this drone attack.'\nMr Corbyn is the runaway favourite to be elected Labour leader on Saturday, despite warnings from senior party figures that he cannot win the next election.\nReyaad Khan, 21, from Cardiff, was killed in response to a 'direct threat' to the British people, the Prime Minister said in September. Ruhul Amin, from Aberdeen, was also killed in the attack on August 21\nThe 66-year-old backbench MP today insisted that the Labour party would unite around him if he won the leadership.\nHe said he was 'very confident' that the party would come together to present a 'very strong opposition to what the government is doing'.\nUnder his leadership, he said, Labour would 'put across a serious radical alternative message'.\nBut Mr Corbyn's opposition to the drone strike on ISIS terrorists is likely to spark fresh concern among moderate Labour MPs.\nScores of Labour MPs are understood to be prepared to defy Mr Corbyn to back military action against ISIS, even if he orders the party to oppose it.\nMr Cameron this week confirmed he would stick to his pledge to hold a Commons vote – probably next month – before ordering the RAF to conduct bombing raids against Islamic State terrorists in Syria.\nLord McDonald, a former director of public prosecutions, said the killing of Khan was legal and justified. He said: 'It is appropriate to invoke the principle of self-defence and to target him.'","url":"https://www.dailymail.co.uk/news/article-3393854/After-asked-THREE-times-Jeremy-Corbyn-admits-authorise-drone-strike-against-terrorists-planning-attacks-Syria.html"}
