{"authors":["Matthew Smith For Mailonline"],"date_download":"2018-10-23 02:46:26","date_modify":"2018-10-23 02:46:26","date_publish":"2017-03-16 13:23:15","description":"Jermain Defoe is back in the England squad for the first time since 2013 as Gareth Southgate prepares to face Germany and Lithuania.","filename":"data/vaneerConsumption/JermaineDefoegetsEnglandsquadcallup.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54F96400000578-0-image-a-17_1489676226519.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4320194_England-call-34-year-old-striker-Jermain-Defoe_1540262786.html","title":"Jermaine Defoe gets England squad call up","title_page":"Jermaine Defoe gets England squad call up | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jermain Defoe is back in the England squad for the first time since 2013 as Gareth Southgate prepares to face Germany and Lithuania.\nNathan Redmond and James Ward-Prowse could also make their senior debuts after being called up by Southgate.\nThe squad for the friendly against Germany and the World Cup qualifier against Lithuania was revealed via Twitter, and features 34-year-old Defoe, who last played for England 1,217 days ago.\nJermain Defoe is to return to international football by being called up to the England squad\nDefoe has made 55 appearances for his country - his last in 2013 - and has scored 19 goals\nGareth Southgate has called up the 34-year-old as he feels Defoe has a point to prove\nFULL ENGLAND SQUAD TO PLAY GERMANY AND LITHUANIA Goalkeepers: Fraser Forster, Joe Hart, Tom Heaton Defenders: Ryan Bertrand, Gary Cahill, Nathaniel Clyne, Phil Jones, Michael Keane, Luke Shaw, Chris Smalling, John Stones, Kyle Walker Midfielders: Dele Alli, Michail Antonio, Ross Barkley, Eric Dier, Adam Lallana, Jesse Lingard, Jake Livermore, Alex Oxlade-Chamberlain, Nathan Redmond, Raheem Sterling, James Ward-Prowse Strikers: Jermain Defoe, Marcus Rashford, Jamie Vardy Fixtures: Germany (Friendly, A, Mar 22) Lithuania (WC Qualifier, H, Mar 26)\nAs expected, Wayne Rooney misses out with injury while Marcus Rashford is named despite recent illness, and there is a surprise call-up for West Bromwich Albion midfielder Jake Livermore.\nDefoe, 34, has been in excellent form for Sunderland this season despite his club being rooted to the bottom of the Premier League.\nHe reacted to his call up with a series of delighted tweets, thanking fans for their support - as well as one of England team-mate Dele Alli waving.\nHe wrote: 'Playing for England has been my dream since day one so to be back in the squad is so special for me.\n'It's also special for my family and I feel I deserve this because I've always dedicated myself to the game. I'm really looking forward to meeting up with the squad and seeing all the boys.\n'This time around it'll be strange being one of the older lads, but I can't wait! Buzzing!'\nInjuries to Harry Kane and Rooney have opened a spot for Defoe, who last played for England in November 2013 in a 24-minute substitute appearance against Chile in a friendly, which England lost 2-0.\nDefoe admitted he had initially ignored the message he received from Southgate.\nDefoe has been in terrific form for Sunderland, scoring 14 goals in 27 Premier League games\nDefoe took to Twitter to say he was 'buzzing' about his first England call up in over 1,000 days\nHe said: 'It was funny. A message popped up on my Iphone. You don't see the full message. It was from a Gareth. I don't know a Gareth! Who's this?\n'I put my phone down. Then looked at it: 'Hello Jermain, it is Gareth Southgate. Can I give you a call when you are free and have a chat. How do you feel about England?\n'We had a good chat. A nice guy. Someone I used to play against.\n'I said you used to kick me. So we had a laugh about that. A genuinely nice man and I've always had respect for him.'\nDEFOE'S TOP FIVE ENGLAND MOMENTS 1.) International debut v Sweden (31/03/2004) At the age of 21, Jermain Defoe was given the nod by then England manager Sven Goran-Erikson to make his England debut from the bench. England lost 1-0 but Defoe was singled out for praise. 2) First England goal (08/09/2004) Started the match v Poland after they had already secured qualification into 2006 World Cup. Fired opener past Jerzy Dudek in the 31st minute . 3) Hat-trick for England v Bulgaria (03/09/2010) After a miserable 2010 World Cup campaign, Defoe lifted the spirits of the nation in the opening qualifying match of Euro 2012. Goals came in 3rd, 61st, and 86th minutes. 4.) Wonder Goal v Italy (16/08/2012) England had levelled the match from 1-0 down. Italy got a corner, 22 seconds later Jermaine Defoe turned on left edge of the box to curl into top right corner past Salvatore Sirigu. 5.) Being re-called to the England squad at age of 34 (16/03/2017) Defoe has been recalled to Gareth Southgate's England squad, 1,217 days after his last international appearance.\nHe has made 55 appearances for England, scoring 19 goals including the winner against Slovenia in a group game at the 2010 World Cup, after being given his debut by Sven Goran Eriksson in March 2004 in a friendly defeat by Sweden.\nThis league campaign he has scored 14 goals in 27 games for Sunderland, making him the second-highest scoring Englishman in the Premier League, behind Kane.\nDefoe is one of just three strikers in the squad, with Rashford included for the first time since impressing at Euro 2016, while Jamie Vardy is also in.\nSouthgate has turned to Defoe and he thinks the striker has a point to prove.\nHe said: 'Year after year he's phenomenal, but this year in particular, in a team that aren't creating as many chances as other teams, his strike rate is outstanding.\n'I didn't want to just look at his age and think he's finished with England. He's somebody that is immensely proud to have represented England at every age group. I think you get young players with a point to prove and older players with a point to prove.'\nOn Rooney, the manager said: 'I've talked with Wayne. I think there's a chance he's fit for the weekend but also the injury coupled with the fact he's not really had a lot of game time recently and others have in that area of the pitch has sort of determined my decision on that one.'\nSouthgate has also given call ups to Ward-Prowse and Redmond, two Southampton players he knew well from his time in charge of the international Under-21 squad.\nThey are two of the most experienced players at that level, making 34 and 27 appearances respectively, Ward-Prowse acting as captain in 14 games.\nThey are in the squad ahead of two much more experienced names, the Arsenal pair of Theo Walcott and Jack Wilshere - the latter currently on loan at Bournemouth - who both miss out, although team mate Alex Oxlade-Chamberlain is included.\nSouthgate said: 'Theo has a really valid claim for being included. I didn't see him featuring in the games this week and so in terms of having him in the longer squad I needed to look at one or two other players that I don't know too much about.'\nNathan Redmond could make his England senior debut after being called up\nRedmond's Southampton and under 21s team mate James Ward-Prowse is also included\nOne of the more surprising names in Southgate's team is West Brom's Jake Livermore\nOne of the more surprising names in Southgate's team is Livermore, the West Bromwich Albion midfielder who has only one cap for his country.\nThis was earned four-and-a-half years ago in a friendly against Italy, where Livermore played 21 minutes as a sub.\nLuke Shaw is also called up, despite the left back struggling for game time at Manchester United under manager Jose Mourinho, with first choice Danny Rose, from Tottenham, on the injured list.\nLuke Shaw is also called up despite struggling for game time at Manchester United this year\nRoss Barkley returns to the England fold for the first time since being an unused squad member at Euro 2016 following an upturn in form for Everton, but rumours of a call for West Ham forward Andy Carroll have proved unfounded after he was left out, while Arsenal's Danny Welbeck also misses out.\nOf Carroll, Southgate said: 'That's a really tough call on him and one I don't expect him to be chuffed to bits about.\n'Andy I don't think has played enough. It's a bit like Danny Welbeck. Danny is a player I really like but at the moment is a little bit short of match minutes.'","url":"https://www.dailymail.co.uk/sport/football/article-4320194/England-call-34-year-old-striker-Jermain-Defoe.html"}
