{"authors":["Dan Morain","Laurel Rosenhall","Ben Christopher"],"date_download":"2018-10-30 23:44:54","date_modify":"2018-10-30 23:44:54","date_publish":"2018-08-06 00:00:00","description":null,"filename":"data/vaneerConsumption/JerryBrownpraiseshersowhyareDemocratstryingtodefeather.json","image_url":"https://calmatters.org/wp-content/uploads/2018.08.06_Legislature_Robbie-Short_013-e1540664327305.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_blog__1540943094.html","title":"Jerry Brown praises her-so why are Democrats trying to defeat her?","title_page":"Jerry Brown praises her—so why are Democrats trying to defeat her? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"A candidate gets his face on a pint of ice cream. A bipartisan deal is reached to make it rain in the Central Valley. A state senator and mayor plan to protest a prop in drag. Here’s a quick recap of what happened across California’s 53 congressional districts this week.\n1. If Democrats take the House, they should thank this non-profit\nThe Democratic blue wave has a banker and it’s called ActBlue.\nAccording to an analysis by FiveThirtyEight and the Center for Public Integrity, 55 percent of all contributions to Democratic congressional candidates from individual donors are now being channeled through the non-profit fundraising platform. That adds up to more than $563 million.\nA lot of that money has made its way to California.\nAndrew Janz, the Democratic prosecutor trying to take down GOP Rep. Devin Nunes in the Central Valley, has received 87.5 percent of all individual donations through ActBlue. By that measure, Janz is the second biggest ActBlue beneficiary in the country.\nIf nothing else, that may prove that political money isn’t always smart money. Though Nunes has a reputation as one of President Trump’s most stalwart defenders in Congress, making him an obvious target for outraged liberals, Janz faces exceedingly long odds. Republicans outnumber Democrats by nearly 10 points in California’s 22nd district and Nunes won more than 57 percent of the June primary vote. A recent UC Berkeley Institute of Government Studies poll had the Republican incumbent up by 8 percentage points.\nRanked by the share of their individual donations coming from ActBlue, California candidates Mike Levin (CA-49), Katie Porter (CA-45), Harley Rouda (CA-48) and Josh Harder (CA-10) came fifth, sixth, seventh and ninth, respectively.\n2. Pork can bring us together:\nAnd they say bipartisanship is dead.\nThis week President Trump signed a bill that will provide more than $6 billion in new funding to reauthorize, expand and upgrade water infrastructure projects. That includes money for reservoir and dam upgrades in the Central Valley, which has been credited to the bargaining skills of Reps. Jim Costa, a Democrat from Fresno, and Jeff Denham, Republican from Turlock.\nPerhaps the two congressmen decided to set aside their ideological differences solely for the benefit of their respective constituents. But the timing is also pretty convenient. Both are in competitive races. Costa made sure to tout the bipartisan deal in his televised debate this week with his Republican opponent, Elizabeth Heng.\nMeanwhile, Denham’s Democratic opponent, Josh Harder, was not impressed: “The fact that it’s happening two weeks before the election shows how desperate Denham is to cover up his vote and hurt Central Valley water.”\n3. Appropriated Pinocchios:\nThe Washington Post’s fact checker wants to set the record straight.\nAs the exasperated Glenn Kessler explained this week, a Super PAC is lying about an attack ad and they’ve used his newspaper’s very own fact-check as a source. Lying about an assertion with a fact-check intended to disprove another lie: It’s like a Russian nesting doll of mendacity.\nThe story starts with a video spot put out by the Democratic Congressional Campaign Committee, which argued that in voting to repeal Obamacare, Rep. Jeff Denham supported legislation that would make it easier to “weaken protections for preexisting conditions.”\nThe Congressional Leadership Fund, a Republican super PAC that is unaffiliated with the Denham campaign, fired back. They insisted that “independent fact checkers” at the Washington Post had declared the DCCC’s claim untrue. Which, it turns out, was itself untrue.\n“Imagine our surprise when we started watching this ad and suddenly saw four Pinocchios dance across the screen,” wrote Kessler.\nThe problem, he explained, is that the GOP’s Congressional Leadership Fund was citing “an unrelated fact-check” on a tweet made by California Sen. Kamala Harris. He awarded the new GOP ad four Pinocchios.\nTo make matters worse, this wasn’t even the first time that the Washington Post’s fact checks have been misused this year. It wasn’t even the first time in the last seven days.\n“This is the second time this week we have caught politicians wrongly appropriating our Pinocchios for political purposes,” he said.\nSo Kessler took to Twitter for help:\nGlenn Kessler on Twitter Readers, we need your help. We have now caught three GOPers — @PeterRoskam @RepJeffDenham (via @CLFSuperPAC) @DaveBratVA7th — claim we gave Four Pinocchios to their D opponents re preexisting conditions. Not true! Please alert us if you spot any more. We’d like to stop this.\nAt last count, six offenders have been uncovered, all Republicans.\n4. If Democrats take the House, they should also thank disaffected Republicans:\nIn two of California’s most hotly contested congressional districts, two candidates are hoping to flip these former bastions of Southern California conservatism and help the Democrats take back majority control of the U.S. House of Representatives.\nWhat do these two Democrats have in common? They both used to be Republicans.\nAs the Los Angeles Times reports, Gil Cisneros, who is neck-and-neck with Young Kim in California’s 39th district, and Harley Rouda, who is hoping to unseat Dana Rohrabacher in the 48th, have a lot in common. Both are exceptionally wealthy middle-aged men, both are new to electoral politics and both insist it’s the Republican Party that’s changed—not them.\nThat attitude might help in and around Orange County, California political analyst Tony Quinn told the Times, since “the fastest-growing base in each district is not made up of Democrats, but independents who might be drawn to a candidate who seems less partisan.”\n5. Losing labor, gaining a flavor\nAmmar Campa-Najjar, the millennial Obama alum hoping to unseat the Republican Rep. Duncan Hunter Jr. (whom readers may recall as the guy alleged by the feds to have spent campaign funds to fly his rabbit across the country), lost the endorsement and financial backing of the California Labor Federation this week. The reason, as CALmatters reported early this week: He stated his opposition to raising the gas tax.\nOrganized labor in California sees opposition to Proposition 6, which would repeal a recent increase in the state gas tax, as one of the most important campaigns of the election cycle. Evidently, that makes it more important than trying to flip this perennial Republican district.\nCampa-Najjar is likely to miss the extra cash, but the announcement from one of the state’s largest labor groups may reinforce the image of political independence he is trying to project to the GOP-dominated electorate of eastern San Diego County.\nAnd if nothing else, he can always binge away his woes the same way the rest of us do, by devouring a pint of ice cream. Unlike the rest of us, his pint may have his face on it. This week Ben and Jerry’s Ice Cream announced a new flavor in support of the Campa-Najjar campaign. It’s called “Ammar-etto American Dream.”\nHair and Heels\nIn what is likely a first for her, Diane Harkey, a Trump-supporting Republican congressional candidate from Dana Point, appears to have inspired a crossdressing protest in support of the gas tax.\nAs CALmatters noted last week, Harkey made the case that voters should support Prop. 6 and repeal the recent increase in the state gas tax lest people like her be forced to “take bikes, get on trains, hose off at the depot and try to get to work.”\n“That does not work with my hair and heels,” she added.\nTo which Democratic state Sen. Scott Wiener responded: not with that attitude.\n“Having ridden Muni w “hair & heels” & seen many drag queen(s) ride bikes with the same, I call bullshit,” the senator from San Francisco said on Twitter.\nThis prompted the following response from the mayor of Emeryville:\nJohn J. Bauters on Twitter @Scott_Wiener Tell me when you and I are doing the hair and heels bike ride down Market with #NoProp6 signs and I’m there.\nThus, the “Hair & Heels” bicycle ride to oppose Prop. 6, which might just be the most singularly Bay Area of Bay Area protests, was born. Those interested in participating have been asked to meet in San Francisco’s Castro district at 2 p.m. this Sunday. A bike is required. Heels and a wig are strongly encouraged.","url":"https://calmatters.org/articles/blog/jerry-brown-praises-her-so-why-are-democrats-trying-to-defeat-her/"}
