{"authors":[],"date_download":"2018-10-30 23:10:49","date_modify":"2018-10-30 23:10:49","date_publish":"2016-10-28 00:00:00","description":"The governor pushed for sweeping action in 2011 to close a funding gap and ease the burden on taxpayers. Then lawmakers blocked his most ambitious ideas.","filename":"data/vaneerConsumption/JerryBrowntoutedhispensionreformsasagamechangerButtheyvedonelittletoreinincosts.json","image_url":"https://www.trbimg.com/img-580fa7be/turbine/la-art-for-california-pension-legal-story-2016-006/600","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/latimes.com/projects__1540941049.html","title":"Jerry Brown touted his pension reforms as a game-changer. But they’ve done little to rein in costs","title_page":"Jerry Brown touted his pension reforms as a game-changer. But they’ve done little to rein in costs - Los Angeles Times","title_rss":"NULL","source_domain":"calmatters.org","text":"The governor pushed for sweeping action in 2011 to close a funding gap and ease the burden on taxpayers. Then lawmakers blocked his most ambitious ideas.\nA year after his 2010 election, Gov. Jerry Brown made a rare appearance at a legislative committee hearing to confront lawmakers about the steep cost of public employee pensions — and to demand that they pass his 12-point pension overhaul. Brown challenged fellow Democrats to drink political “castor oil” so public retirement costs would not overburden future generations. This series is a partnership of “We don’t really have too much choice here,” Brown said in a commanding tone as he addressed a special panel of Assembly and Senate members in the Capitol in December 2011. State lawmakers eventually passed many of Brown’s proposals, including a higher retirement age for new employees. But they rejected those with the biggest dollar savings — notably his plan for a hybrid retirement system combining smaller pensions with 401k-style savings plans. Instead, legislators chose to tinker at the margins of pension reform. Although Brown touted it as the “biggest rollback to public pension benefits in the history of California,” the package of modest changes he signed into law in 2012 has done little to slow the growth of retirement costs. The state’s annual bill for retirement obligations is expected to reach $11 billion by the time Brown leaves office in January 2019 — nearly double what it was eight years earlier. Since the 2012 law applied mainly to newly hired employees, savings will trickle in slowly over many years. Pension contributions required from state and local governments will continue to increase — although they are estimated to be 1% to 5% less than they would have been without the changes. ADVERTISEMENT Total savings from the Public Employee Pension Reform Act of 2012 are estimated at $28 to $38 billion over 30 years for the state’s main pension fund, the California Public Employees’ Retirement System, and $22.7 billion for the state’s teacher pension fund. The savings are a fraction of the two plans’ unfunded liability — the gap between the benefits owed to current and future retirees and the money set aside to pay for them. CalPERS’ unfunded liability is estimated at $93 billion. For the teachers’ fund, it is $76 billion.\nPolitically unattainable The fate of Brown’s plan illustrates the deep difficulty of reining in California’s public retirement costs. Brown’s disappointment is all the more stark given that the political stars were aligned that year: The governor was popular with voters, enjoyed good relations with public employee unions and had a supermajority of his party in power in the Legislature. Steep cuts in state spending during the Great Recession, along with a highly publicized scandal in Bell, Calif., where city leaders arranged lavish salaries and pensions for themselves, had generated momentum for pension reform. A tax increase anticipated on the November 2012 ballot gave Brown added leverage over legislators. Democrats wanted the increase to pass to protect public schools, universities and other services from further cuts. Brown told them that a demonstration of fiscal responsibility on pensions would greatly improve a tax measure’s prospects on Election Day. Still, the bulk of what Brown got were the easiest fixes. The big-dollar items proved politically unattainable. The dynamic is unchanged today, as Brown prepares to begin his final two years in office. At least publicly, Democratic legislators and labor officials do not share Brown’s urgency about rising pension costs. They say economic growth could ease the burden on taxpayers by boosting pension-fund investments. “Unfunded liability is not the same thing as debt,” said Steve Maviglio, a longtime advisor to Democratic officeholders and a spokesman for Californians for Retirement Security, a labor coalition. “It’s a snapshot in time of where the system is.” Democratic legislators also argue that taking guaranteed pensions away from public workers isn’t the right way to bridge inequities between public employees and those in the private sector, few of whom have pensions. “There are those who say those in the public sector should not have pensions that are any better than those in the private sector, and while I understand that answer, I think the answer lies in trying to improve retirement security on the private-sector side,” said Darrell Steinberg, who was president of the state Senate when Brown made his push for pension reform. Darrell Steinberg, former leader of the California Senate and now mayor-elect of Sacramento. (Steve Yeater / CALmatters)\n‘Stranglehold’ Democratic lawmakers are strongly allied with public employee unions, for which pension protection is a top priority. Public employee unions gave $12.5 million to Democratic candidates for the Legislature between 2010 and 2014, compared with $1 million for Republicans, according to the nonpartisan National Institute on Money in State Politics. Every Democratic lawmaker elected in 2010 received campaign contributions from public sector unions, as did Brown. “Let’s just be clear: The unions have a stranglehold on the Legislature,” said Sen. Joel Anderson (R-San Diego), the only senator to vote against the 2012 pension bill. “Their loyalty is to those unions because that’s how they got elected.” Former Sen. Joe Simitian (D-Palo Alto), who served on the special pension committee and is now a Santa Clara County supervisor, insisted that the final package — although less than Brown had asked for — was an impressive achievement. He said it reflected the governor’s willingness to confront labor, something no single lawmaker could have done without fear of union retribution. “This was and remains an issue that is probably beyond the ability of any individual legislator to make significant change on,” Simitian said. “And the governor was able to bring the stakeholders together and get to yes on a very challenging subject.” When Brown pitched his pension reform proposal in December 2011, Assemblyman Warren Furutani (D-Gardena), then chair of the Assembly’s public employees and retirement committee, told the governor that lawmakers were committed to “maintaining public pensions for our workers that have invested years and years of their lives in serving our state.” Furutani, who carried the reform bill, AB 340, for Brown, recalled there was tacit support from labor to close pension-spiking loopholes, but not to do much more than that. “I was given a wink and a nod, saying ‘OK, let’s come up with something realistic here,’” said Furutani, who is now running for state Senate in the 35th District in Los Angeles County. The Legislature eventually raised the age for retirement with full pension from 50 to 57 for newly hired public safety workers and from 55 to 67 for newly hired civil servants. Lawmakers banned retroactive pension increases and stopped practices such as hoarding vacation and sick time to inflate retirement calculations. They also required minimum contributions from employees toward their pensions, to supplement the much-larger taxpayer-funded contributions. The changes applied to most employees of the state, counties, cities and local districts. Not included were the University of California and cities that manage their own pension systems such as Los Angeles, San Francisco, Fresno, San Diego and San Jose.\n‘We were never going to go there’ Brown wanted the Legislature to do more, including adding more independent members to the board of CalPERS, which is dominated by labor representatives. Marty Morgenstern, Brown’s longtime labor advisor, who negotiated with lawmakers over the 12-point plan, said the change was important to the governor because he was mayor of Oakland in 1999 when the retirement board supported higher pension benefits that raised costs for local governments. “That’s why Jerry was upset,” Morgenstern said. But Democrats did not like the idea of handing the governor more authority. It would also have required voter approval. CALMatters Explains How Governor Brown's Pension Reform Plan Failed To Move Forward Listen to a report by Capital Public Radio. Read the story “Ultimately, what I think the governor focused on — and we focused on — were the policy issues,” Furutani said. “I think that was just left for another day.” Brown’s most ambitious proposal was the hybrid pension plan for new employees that would join traditional pensions and 401k-style plans, which help workers build up retirement savings but don’t guarantee any level of benefits. Brown said the hybrid system would pay retirees 75% of the salaries they collected when active. “We were never going to go there because we didn’t believe in that,” said Steinberg, now mayor-elect of Sacramento. He and Simitian argue that 401k-style plans alone do not provide sufficient financial security. “The fact that some employees in the state have some economic security and others don’t is not an argument for saying, ‘Well then, let’s reduce the number of folks with economic security,’” Simitian said.\n‘Ponzi scheme’ At the 2011 legislative hearing, CalPERS presented an analysis of Brown’s 12-point plan that criticized the hybrid concept. The analysis said closing CalPERS off to new workers would starve the system and prevent it from keeping up with pension payments. Brown, who had never proposed eliminating pensions, took umbrage at the criticism. “Well, that tells you you’ve got a Ponzi scheme, because if you have to keep on bringing in new members, then the current system itself is not in a sustainable position,” Brown said. “So I don’t accept that, and we don’t need to close it off anyway.” As an alternative to the hybrid, lawmakers approved a cap on the salary that could be used to calculate an employee’s pension. The current cap is $117,020 for workers who participate in Social Security and $140,424 for those who don’t. Sen. John Moorlach (R-Costa Mesa), who serves on the Senate Public Employment and Retirement Committee, said Brown deserves credit for what he was able to accomplish. “Maybe you’re never going to get perfect, so you settle for good,” Moorlach said. Morgenstern said Brown would have asked current workers to take a pension haircut but couldn’t because of the so-called “California rule,” a constitutional doctrine that prevents cutting an employee’s future pension benefit unless the reduction is offset by a new benefit of comparable value. In a departure from precedent, a state appellate court recently ruled that the Legislature can trim future benefits so long as a “reasonable” pension is maintained. The case is now before the California Supreme Court. Brown’s 12-point plan also called for public employees to contribute toward the cost of their retirement health benefits. The Pension Gap: Read the story Currently, state workers with 20 years of service are entitled to full health coverage in retirement, worth $20,000 a year. Newer state workers will have to work longer to get the benefit, a perk not commonly offered by private employers. Instead of mandating employee contributions, however, lawmakers told the governor to negotiate the issue with labor unions, which he’s doing this year as contracts come up for renewal. So far, highway patrol officers, prison guards and engineers have agreed to make contributions that start at less than 1% of their pay and increase to 2% to 4% over the next three years. But the largest state employee union, the Service Employees International Union Local 1000, has threatened a strike over the issue. Judy Lin is a reporter at CALmatters, a nonprofit journalism venture in Sacramento covering state policy and politics. Contact the reporter. Twitter: @ByJudyLin\nCredits: Produced by Lily Mihalik\nCalifornia's Pension Crisis: Coming next in the series Los Angeles officials boast that they have stemmed the rising cost of government workers’ retirements. A Times analysis shows otherwise. Sign up for our Essential Politics newsletter to receive the next installment in your inbox Privacy policy","url":"http://www.latimes.com/projects/la-me-pension-crisis-brown/"}
