{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:10:54","date_modify":"2018-10-31 00:10:54","date_publish":"2016-01-26 08:00:00","description":"In 1976, a year into his first term as governor, Jerry Brown signed a bill that came to be seen as one of the strongest environmental protection laws in","filename":"data/vaneerConsumption/JerryBrownscomplicatedrelationshipwithenvironmentalists.json","image_url":"https://calmatters.org/wp-content/uploads/california_coast.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944654.html","title":"Jerry Brown’s complicated relationship with environmentalists","title_page":"Jerry Brown’s complicated relationship with environmentalists | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"In 1976, a year into his first term as governor, Jerry Brown signed a bill that came to be seen as one of the strongest environmental protection laws in the country. The California Coastal Act limited development along the 1,100-mile shoreline and guaranteed public access to the beach.\nYet just two years later, Brown had become frustrated with the commission tasked with upholding the Coastal Act. He made headlines in 1978 for calling commissioners “bureaucratic thugs.”\nIt was an early indication of Brown’s complicated relationship with the environmental movement, a dynamic that still shapes his governorship today. Weeks after returning from global climate-change talks in Paris that positioned Brown as an environmental leader, the fourth-term Democrat is now facing the wrath of environmentalists at home. It’s the result of a new drama unfolding on the Coastal Commission.\nConservation advocates have been critical of the decisions made by Brown’s appointees to the commission, who have voted in favor of projects environmentalists opposed. Now they are furious that the commission is holding a vote next month to dismiss Executive Director Charles Lester. They view him as an environmental guardian and say commissioners appointed by Brown are trying to oust Lester to make the coastal agency more amenable to development.\n“It is kind of alarming that his appointees are trying to do this because it flies in the face of the environmental legacy that he wants to leave,” said Stefanie Sekich-Quinn, coastal preservation manager for the Surfrider Foundation.\n“It’s very problematic that it’s (Brown’s) appointees.”\nShe and other environmentalists are pressuring Brown to intervene. So far Brown has declined to comment on the situation; his spokesman Evan Westrup wrote an email saying, “This is a matter the Coastal Commission initiated without any involvement from our office.”\nThe criticism from environmentalists is reminiscent of the pressure Brown faced a few years ago from activists opposed to the oil-extraction method known as fracking. They demonstrated in front of the Capitol, followed Brown to speaking appearances and raised the question of his environmental legacy after the governor signed a 2013 bill that fell short of activists’ desire to ban fracking in California.\nOn the other hand, environmentalists have hailed Brown’s efforts to combat climate change. He signed an executive order last year to drastically reduce greenhouse gas emissions by 2030. He won legislative approval to increase the amount of renewable energy that flows to California’s electricity grid. He has made the battle against global warming his cause celebre, traveling to Italy for talks with Pope Francis and Paris for the conference last month that resulted in an international deal to reduce greenhouse gas emissions.\nThose who know Brown well are not surprised that he is at odds with environmentalists on the latest Coastal Commission controversy.\n“He is not a 100-percent-er on any of these things and that’s what’s made him a pretty interesting and effective governor,” said journalist Orville Schell, who wrote a biography of Brown in 1978 and remains friendly with him.\n“He isn’t a carbon cutout of one left or right view.”\nThe governor appoints 4 of 12 seats on the Coastal Commission, with the remainder appointed by the two legislative leaders. Lester and the commissioners he reports to are not commenting before the Feb. 10 vote.\nLester, who assumed leadership of the commission in 2011, has been through lengthy performance evaluations behind closed doors in the last three years. Publicly, commissioners have pressed him for not providing enough information about projects that have applied for permits, and a lack of ethnic diversity among commission staff.\nMeanwhile, Brown has demonstrated support for the Coastal Commission. His budget proposal this month gave the commission 25 permanent positions that had been temporary. The budget Brown approved two years ago gave the commission new authority to levy fines on property owners who block public access to the beach.\nEnvironmentalists applaud those moves, even as they criticize Brown’s appointments for steering the commission in a pro-development direction.\nIn August, Brown’s appointees voted to take away public use of a portion of a Malibu bluff overlooking the ocean to make way for eight new mansions. In October, on a different project in Malibu, three of the governor’s appointees voted to approve a beach restoration project that excludes a public path advocates sought.\n“They are voting poorly to protect the coast,” Sekich-Quinn said.\nSteve Blank, a former coastal commissioner who was appointed by Republican Gov. Arnold Schwarzenegger, said Brown may assume he has the support of environmentalists because he is a Democrat.\n“Under Schwarzenegger, there was an extended effort to reach out to a constituency he didn’t own. And now, with Brown, there is benign neglect of the constituency he’ll own forever,” Blank said.\nBrown’s evolution from an environmental visionary 40 years ago to a fiscal watchdog today has put his legacy at risk, Blank said.\n“No one is going to remember his skills as an accountant. It’s sad but true. But people will remember driving the California coast (as the result of) Jerry Brown’s signature in 1976,” Blank said. “I hope they don’t remember it as Jerry Brown’s destruction in 2016.”","url":"https://calmatters.org/articles/jerry-browns-complicated-relationship-with-environmentalists/"}
