{"authors":["Judy Lin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:54:35","date_modify":"2018-10-30 22:54:35","date_publish":"2016-04-05 08:00:00","description":"Having witnessed teaching “fads” since the 1950s and running charter schools as Oakland mayor, Gov. Jerry Brown doesn’t expect his own key education","filename":"data/vaneerConsumption/JerryBrownonsubsidiaritymeritocracyandfadsineducation.json","image_url":"https://calmatters.org/wp-content/uploads/Brownwithkids2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540940075.html","title":"Jerry Brown on subsidiarity, meritocracy and fads in education","title_page":"Jerry Brown on subsidiarity, meritocracy and fads in education | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Having witnessed teaching “fads” since the 1950s and running charter schools as Oakland mayor, Gov. Jerry Brown doesn’t expect his own key education policy — called the Local Control Funding Formula — to close the academic performance gap between African Americans and Latinos and other student groups.\nBrown hopes the formula will help some students improve by sending more money to those with low incomes or who don’t speak English. But he said, “the gap has been pretty persistent. So I don’t want to set up what hasn’t been done ever as the test of whether LCFF is a success or failure.”\nThe governor spoke exclusively to CALmatters in a recent telephone interview about government limits when it comes to improving classroom learning for California’s 6 million-plus students. From his vantage point, Brown, California’s longest-serving governor from 1975-1983 and since 2011, has come to the belief that federal and state government have overreached, stifling creativity and innovation in schools.\nHe often uses the term subsidiarity in explaining his rationale for ending most spending requirements in the state’s $71.6 billion education budget. He suggests that classroom problems are best solved by the people closest to the students. To that end, LCFF gives school districts much more discretion in spending state funds because Brown’s ultimate goal is for teachers and administrators to have the freedom to teach how they best see fit.\nDespite his hands-off philosophy, Brown is arguably doing more than any recent governor to change what students learn and how teachers teach in classrooms by embracing Common Core, increasing school spending and increasing local discretion. This year, the state is also scheduled to adopt a new measure for evaluating school performance.\nTo accomplish all this, Brown has turned to his most trusted education advisor Michael Kirst. Kirst is a 76-year-old retired Stanford University professor who has five decades of academic experience and written textbooks on education politics. He is, coincidentally, the longest-serving State Board of Education president having been appointed by Brown in his first and second stints as governor.\nIt was Kirst who helped Brown design his education platform during his 2010 campaign that became the foundation of the governor’s funding plan. It is Kirst who has the complicated task of directing the state board to come up with a new school accountability system stays true to Brown’s philosophy while meeting federal reporting requirements. Expected to be adopted later this year, the new system will measure more than test scores and will likely redefine how schools are judged for years to come.\nThe governor spoke with CALmatters for an upcoming story about Kirst and the state board’s development of a new accountability system. The questions below have been modified for context and the governor’s response trimmed for length.\nQ: How would you describe Michael Kirst?\nA: I would describe him as thoughtful, careful, thorough. A person that knows a great deal about education, has a lot of experience, wealth of knowledge and so is very helpful in dealing with education questions. In particular, because there’s so many fads in education and things changing every 10 or 15 years, it’s very good to have someone with that continuity.\nQ: Was the Local Control Funding Formula that changed how the state allocates money to schools his idea or your idea?\nA: I would say he brought up the weighted-student formula. The weighted-student formula was to take into consideration various factors such as low-income families or non-English speaking families. You do that in the state allocation of money to the school district. The beauty of that was not to have these categorical programs which had taken a life of their own and which proliferate and which require a lot of administration. So that was a good idea. It fit in with the idea of trying to return more of the power to the classroom and to the local district. And that’s based on a simple idea, which you’ve heard me say, subsidiarity. That’s an old people word.\nHe’s a very good sounding board, very good leader because he has to work with the teacher groups, the administrative groups, board groups and all the rest and all the equity groups. Quite a diverse crowd of people who want to weigh in on what goes on in California classrooms. But they don’t want to weigh in at the class site. They like to weigh in hundreds of miles away and therefore in a very abstract level.\nHe’s very helpful at both handling the abstractions required for remote control, which state government does, and yet keeping the flexibility at the local level so that the people who are doing the work — the teachers — have the guidance but also the freedom to do a good job of teaching. That balance is really what I guess I come to.\nQ: If local control was an equalizer for kids in Piedmont and Richmond, how long will it take to see the achievement gap close, if ever?\nA: How long will it take to achieve an egalitarian society? Is that even on the agenda? We have a system of equal protection under the law but we have another system called meritocracy.\nQ: So there’s no underlying promise to close the achievement gap?\nA: Are you talking about strict equality so that everybody will get all A’s and get 1600 on the SAT?\nQ: Well, at least graduating and going to college or career.\nA: Do you mean a career as a waiter? Do you mean a career as a window washer? Or do you mean something more elevated? Then who’s going to do all that other work that’s not elevated? Who does that? Or do we get robots for that?\nGive me an example of the gap we should close.\nQ: The gap between Latinos and African Americans and whites and Asians.\nA: It’s pretty hard to do. Even in the same family there are pretty close differences. Look, I wouldn’t measure it in some perfect sameness involving people of all backgrounds. But rather it’s giving people a boost who are coming into school with experiences that don’t lend themselves as much to mastering the material as other people.\nThe gap has been pretty persistent. So I don’t want to set up what hasn’t been done ever as the test of whether LCFF is a success or failure. I don’t know why you would go there.\nSince we did the Academic Performance Index, I think the achievement level increased substantially for everybody at about the same rate. So the gap would not change but there was definite improvement.\nQ: You don’t think Kirst is professorial?\nA: Well, I’m always asking him questions and I like people who know what the hell they’re talking about. And he generally either knows or he knows that he doesn’t. And he has an idea of how to find out or who might know. So I find that very refreshing. And he has a very open mind. He’s not an ideologue.\nKirst is very much a person of inquiry. That’s probably why he’s able to create such harmony in a completely unharmonious world called public education. If you ask the president of CTA (California Teachers Association) and (billionaire Los Angeles school reformer) Eli Broad what they think of Michael Kirst, you’d probably get a positive response. That’s remarkable and that’s worth noting.\nI’ve had hundreds of conversations with Michael Kirst over the last 40 years. In fact, when he was writing my educational platform running for governor in 2010, he was on the phone. We were collaborating over the telephone. That was me typing and then for part of it was my wife typing and Michael Kirst answering questions. And we talked about the weighted formula. You can find a lot of Mike Kirst in that because I ran all the points by him.\nI’ve been around since (former California Superintendent of Public Instruction) Max Rafferty said back to the basics. There’s a big book I remember in high school which was “Why Johnny Can’t Read.” That was in the ‘50s. We’ve never stopped with new ideas. So today it’s all about STEM (Science, Technology, Engineering and Math). Get your STEM down. Well, I never got my STEM down but I got elected governor four times.\nKirst is a thoughtful person and he’s easy to work with and he’s learning and he’s open to the ideas in the field. So that makes him a pretty unique participant into this educational world which is often weighed down with cliches and acronyms and faddish kind of notions about what’s finally going to bring us the millennium in terms of we’re all going to hold hands and walk together into the sunset.\nQ: If you believe in subsidiarity, then what is the state’s role for underperforming schools?\nA: To send down little busy bodies to run down the halls and chide the teachers. No. What’s the role? We have eight goals and many subsidiary elements in each of the eight goals that form the Local Control (and Accountability) Plan, the LCAP. And those are filed with the county office of education. Those are the result of participations. Thousands and thousands of meetings throughout California, all locally based. Teachers groups participate. Parents groups have taken place in several languages. That’s democracy. Now if you’re up here, you’d better hire yourself a lobbyist. You want to have small D democratic participation by ordinary people.\nAnd when there’s gross problems, yeah, the state can intervene. But all this game of Washington, D.C., and all the stuff they’ve been trying, you know there are limits to what can be done.\nYes, let’s create opportunities. But what is that? We got to recruit the teachers. You’ve got to pay them. You got to create enough freedom. A lot of people don’t want teachers to have too much freedom. They want to have a recipe, paint by the numbers. You ever see the coloring book that has numbers that if there’s a seven, you put a little red. If it’s an eight, you put a little green. And pretty soon without knowing anything, you can fill out that coloring book pretty good. OK, but that’s not a good idea for learning.\nReactions\nWatch state Sen. Holly Mitchell raise achievement gap concerns with Board of Education members during a Senate confirmation hearing.\nSen. Holly Mitchell reacts to CALmatters article\nRead the open letter to Brown from Ryan Smith, executive director of Oakland-based The Education Trust–West.\nRead the commentary from Michael Kirst, president of the State Board of Education.","url":"https://calmatters.org/articles/jerry-brown-on-subsidiarity-meritocracy-and-fads-in-education/"}
