{"authors":["Robert Wilde"],"date_download":"2018-10-30 19:24:01","date_modify":"2018-10-30 19:24:01","date_publish":"2015-01-04 00:48:22","description":"Tuesday groundbreaking will begin in Fresno for Governor Jerry Brown’s mass transportation project known as the ‘”bullet train.”","filename":"data/vaneerConsumption/JerryBrownBreaksGroundinFresnowithBulletTrain.json","image_url":"https://media.breitbart.com/media/2015/01/Bullet-Train-1024x619.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_01_03__1540927441.html","title":"Jerry Brown Breaks Ground in Fresno with Bullet Train","title_page":"Jerry Brown Breaks Ground in Fresno with Bullet Train","title_rss":"NULL","source_domain":"breitbart.com","text":"Tuesday groundbreaking will begin in Fresno for Governor Jerry Brown’s mass transportation project known as the ‘”bullet train.”\nThe high speed rail (HSR) project connecting San Francisco and Los Angeles, is projected to cost $68 billion, not including cost overruns, which some predict could tack on $billions more.\nRun-ups in cost would not come as a surprise to Californians, who witnessed the construction of the Bay Bridge project in Northern California, that ended up costing 600% of original projections. UC Berkeley civil engineering professor William Ibbs contends that megaprojects average 400% of initial cost estimates. Although he won’t give an exact figure on what it will cost to build the HSP, he is sure that it will exceed initial estimates.\nEven Jerry Brown’s Democratic party colleague, state Sen. Mark DeSaulnier, doesn’t have a lot of faith in the $68 billion estimate. “I don’t know how anyone could trust their numbers,” he admits.\nHolding true to his liberal roots, Brown begins the construction of his legacy project without the necessary funds to complete it. Although in 2008, California voters approved nearly $10 billion in bonds to initiate the funding, there is no good evidence that the remaining funds will be there to see the project through.\nReuters reported that Brown is banking on the state’s cap-and-trade program that he created in 2013 to partially pay for the train project. California lawmakers recently agreed to pledge 25 percent of all future cap-and-trade revenues plus an additional $650 million to the ongoing project.\nSince 2013 the state has raised $1 billion in revenue from companies paying to offset carbon emissions. A new law beginning in 2015 will up the carbon tax revenues by including distributors of transportation fuels such as gasoline and diesel and home heating fuels. This should help, but Brown is a long way from spiking the ball.","url":"https://www.breitbart.com/local/2015/01/03/ca-senator-on-bullet-train-costs-i-dont-know-how-anyone-can-trust-those-numbers/"}
