{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:31:37","date_modify":"2018-10-30 19:31:37","date_publish":"2015-04-12 13:23:49","description":"California Governor Jerry Brown has received support from an unusual source as he defends the state's farmers from the charge that they overuse water. The Wall Street Journal editorial page defended California's farmers in a weekend editorial that takes both liberals and conservatives to task for using agriculture as a \"scapegoat.\" Brown, meanwhile, visited with farmers north of Sacramento this weekend in a show of solidarity with farmers against accusations of water-wasting. |","filename":"data/vaneerConsumption/JerryBrownCourtsFarmersasWSJBacksHisWaterStance.json","image_url":"https://media.breitbart.com/media/2015/04/Screen-Shot-2015-04-12-at-6.22.19-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_12__1540927897.html","title":"Jerry Brown Courts Farmers as WSJ Backs His Water Stance","title_page":"Jerry Brown Courts Farmers as WSJ Backs His Water Stance | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"California Governor Jerry Brown has received support from an unusual source as he defends the state’s farmers from the charge that they overuse water. The Wall Street Journal editorial page defended California’s farmers in a weekend editorial that takes both liberals and conservatives to task for using agriculture as a “scapegoat.” Brown, meanwhile, visited with farmers north of Sacramento this weekend in a show of solidarity with farmers against accusations of water-wasting.\nThe Journal editorial defends Brown for exempting farmers from his mandatory 25% cut in water use statewide. It notes the myth that “farmers are producing too many water-intensive crops and over-pumping groundwater”–then proceeds to debunk it, along with the claim that farms use 80% of the state’s water, and points out that urban users are the big culprits.\n“A common claim is that agriculture consumes about 80% of “developed” water supply, yet this excludes the half swiped off the top for environmental purposes. Farmers typically consume about 80% of the remainder, so only 40% of the total,” the Journal notes. It adds that in recent allocations from the Central Valley Project, “Since 2012 agriculture has averaged 15% and cities 55%. Supplies for wildlife refuges were only recently curbed to 75% this year. Farmers are getting zip.”\nFarmers have responded by leaving land fallow, or by tapping into groundwater. Meanwhile, the delta smelt–a species that is described as fundamental to the ecosystem, but may already be extinct–is one among several species that are being “protected” by flushing large amounts of fresh water to the sea. The water that San Francisco drinks is not affected.\nThe Journal notes that cities are protected by their political clout. “But farmers don’t pack the same punch, so they’re getting fed to the smelt.”\nGov. Brown agrees–and perhaps sees an opportunity to expand support beyond his liberal base.\nPhoto: file","url":"https://www.breitbart.com/politics/2015/04/12/jerry-brown-courts-farmers-as-wsj-backs-his-water-stance/"}
