{"authors":["Deborah Danan"],"date_download":"2018-10-30 18:58:52","date_modify":"2018-10-30 18:58:52","date_publish":"2018-08-02 19:46:44","description":"TEL AVIV - Some 30,000 people attended Jerusalem’s largest-ever gay pride parade Thursday, with the annual event maintaining relative calm despite fears of violence from right-wing groups. Some LGBT allies called for Prime Minister Benjamin Netanyahu to resign over the passage of a surrogacy law that excludes gay men. | Israel / Middle East","filename":"data/vaneerConsumption/JerusalemsLargestEverPrideParadeTakesPlaceUnderIntenseSecurity.json","image_url":"https://media.breitbart.com/media/2018/08/wi/ap/02/5766f6_jerusalem-gay-pride-13295-participants-wave-lgbt-pride-rainbow-flags-annual.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2018_08_02__1540925932.html","title":"Jerusalem's Largest-Ever Pride Parade Takes Place Under Intense Security","title_page":"Jerusalem's Largest-Ever Pride Parade Takes Place Under Intense Security | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Some 30,000 people attended Jerusalem’s largest-ever gay pride parade Thursday, with the annual event maintaining relative calm despite fears of violence from right-wing groups. Some LGBT allies called for Prime Minister Benjamin Netanyahu to resign over the passage of a surrogacy law that excludes gay men.\n2,500 police officers were stationed throughout the capital, marking the highest deployment yet.\nProtesters on Thursday carried signs calling for the government to dissolve and condemning the new Jewish nation-state law as a “disgrace.”\n“Our job is to make sure everyone can express themselves,” Israel Police Commissioner Roni Alsheich told journalists at the event, “and of course that no one gets hurt.”\nPeople waved flags and banners with slogans like, “love is love,” “born this way,” and the biblical passage, “love your neighbor as yourself.”\n“Jerusalem is a special place with special people, but there are still many problems here of close-mindedness,” Hadas Cohen, a gay resident of Jerusalem, told Breitbart Jerusalem.\n“Hopefully one day I will be able to kiss my girlfriend on the street without being scared of being attacked,” she added.\nAnother marcher spoke of how the parade will always be tinged with trauma since an ultra-Orthodox man killed 16-year-old Shira Banki at the 2015 parade.\n“Shira is forever on our minds here,” Liat Gerski said. “But she would be proud of the huge turnout today.”\nDespite warnings that the parade could turn violent, anti-LGBT activists marching in counter-protests remained calm.\nOn Tuesday, Lehava founder Bentzi Gopstein released a video calling members of the gay community “terrorists” and urged people to attend his group’s counter-protest called “Jerusalem is not Sodom.”\nOrthodox group Liba, which also organized a small protest outside of Liberty Park, issued a statement signed by 200 rabbis that said the “healthy majority in the State of Israel is shocked by the provocations and the loss of the way of the abomination organizations.” They added that “the aggressive terrorism, accompanied by media brainwashing to turn the perverts into heroes will not work.”\nThe rabbis also expressed support for Jerusalem Chief Rabbi Aryeh Stern, who was slammed for a comment declaring that the children of homosexual couples had “very strange and unnatural lives.”","url":"https://www.breitbart.com/middle-east/2018/08/02/jerusalems-largest-ever-pride-parade-takes-place-under-intense-security/"}
