{"authors":["Lucia Peters"],"date_download":"2018-10-30 22:26:25","date_modify":"2018-10-30 22:26:25","date_publish":"2014-08-15 17:57:06","description":"\"Tell me something,” writes Jes Baker, AKA The Militant Baker, on her website. “When was the last time you opened up your browser and saw a beautiful image of a body shape that looked just like yours?” Thanks to projects like the Instagram account…","filename":"data/vaneerConsumption/JesBakerandLioraKsExpose2014PhotographsCelebrateBeautifulBodiesofAllShapes.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/333bfb34-4c48-4335-b67f-4283f2dedba4.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35959-jes-baker-and-liora-ks-expose-2014-photographs-celebrate-beautiful-bodies-of-all-shapes_1540938385.html","title":"Jes Baker and Liora K’s \"Expose: 2014\" Photographs Celebrate Beautiful Bodies of All Shapes","title_page":"Jes Baker and Liora K’s \"Expose: 2014\" Photographs Celebrate Beautiful Bodies of All Shapes","title_rss":"NULL","source_domain":"bustle.com","text":"\"Tell me something,” writes Jes Baker, AKA The Militant Baker, on her website. “When was the last time you opened up your browser and saw a beautiful image of a body shape that looked just like yours?” Thanks to projects like the Instagram account Love Your Lines, it’s becoming more common — but we’ve still got a long way to go. With Baker and photographer Liora K on the job, though, we’re making huge strides in the right direction. Their latest project, “Expose: 2014,” showcases real women and real bodies — and it’s just what we need to keep breaking down boundaries.\nYou might remember Baker and K as the team behind “Lustworthy,” a photo series shot in the style of a fragrance ad that challenges ideas of conventional attractiveness. “Expose” continues their work of striking down socially imposed beauty standards and celebrating bodies of all shapes and sizes. The images currently making the rounds are actually the second batch of photos in the series; the first round made its debut in the fall of 2013, at which time 68 gorgeous and diverse women plus Baker and K gathered together to pose for some of the most amazing photographs I’ve ever seen. This year, they topped their numbers with a whopping 96 participants, all of whom are different, and all of whom are beautiful.\nOn her website, Baker writes of the project:\n“We all know that what we see in the media isn't the whole story. It's not representative of all of us. And because of what we see (or rather DON'T see) we start to believe that we are the only one with our particular stretch marks. Our uneven boobs. Our scarred legs. Our asymmetrical nipples. Our belly shape. Our body hair. Our what-ever-it-is-that-you-don't-see-on-display-any-where-else... Rarely do we see our beautiful and complex combination of body parts that makes us magnificent. “And when we feel alone in our body, we feel as though we are not enough. When the truth is: we are MORE than enough. And we are not alone.”\nThis, then is the point of “Expose” — and of all other projects like it. As I noted earlier this week, all bodies are worthy of celebration. Photographs like these bring them to the fore and lets the confetti fly.\nNot everyone, of course, sees it that way. On one of the images K posted to her Facebook page, someone left a comment that read, “That can’t be unseen” — the go-to phrase deployed on the Internet for something so horrifying it’s seared itself onto your retinas. K’s response, however, is perfect:\n“It’s not meant to be unseen. This is what women’s bodies look like across a broad spectrum. The participants are brave for putting themselves out there, to be the ambassadors [f]or body love for women who feel alone in their fight against their bodies, to promote a healthier world view.\n“In this series, we have unphotoshopped bodies that haven’t been presented in the conventional sexualized way… for women to reclaim their bodies as their own instead of observed objects. Be a part of our revolution or don’t, but there’s no need to say mean things, the effect of which maintains a dangerous and oppressive patriarchal status quo.”\nShe signed it respectfully, “Best wishes, Liora.”\nThis, I think, is what makes Baker and K’s work so effective: Their projects are both unapologetic and respectful, making their statements and encouraging discussion. There is no room for insults or for words meant purely to hurt; that’s not what it’s about. It’s about talking. Conversation. Asking questions. Digging into why we feel the way we do — and what we can do to change it. I don't know about you, but I'd rather be a part of the revolution.\nCheck out the whole series at The Expose Project’s website.\nImages: The Militant Baker (3), Liora K Photography/Facebook","url":"https://www.bustle.com/articles/35959-jes-baker-and-liora-ks-expose-2014-photographs-celebrate-beautiful-bodies-of-all-shapes"}
