{"authors":["Ciara Farmer For Mailonline"],"date_download":"2018-10-23 00:15:10","date_modify":"2018-10-23 00:15:10","date_publish":"2017-04-26 09:36:22","description":"The 35-year-old Total Recall star looked sensational in a stunning checked gown which showed off her endless legs while the Senorita singer, 36, went for a wholly casual ensemble","filename":"data/vaneerConsumption/JessicaBielshowsoffendlesslegswithJustinTimberlake.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9D4B4400000578-0-image-a-9_1493193125469.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446706_Jessica-Biel-shows-endless-legs_1540253710.html","title":"Jessica Biel shows off endless legs with Justin Timberlake","title_page":"Jessica Biel shows off endless legs with Justin Timberlake | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They have been together for a decade and married for five years.\nAnd Jessica Biel proved she is as loved up as ever with her husband Justin Timberlake as they headed out for a date after the Tribeca Film Festival event at the SVA theatre this evening in New York on Tuesday night.\nThe 35-year-old Total Recall star looked sensational in a stunning checked gown which showed off her endless legs while the Senorita singer, 36, went for a wholly casual ensemble as he wore a beanie and a shirt.\nScroll down for video\nLegs eleven: Jessica Biel proved she is as loved up as ever with her husband Justin Timberlake as they headed out Tribeca Film Festival event at the SVA theatre this evening in New York on Tuesday night\nJessica looked phenomenal in the Self Portrait dress which made the most of her incredible figure complete with a perilous slash extending the length of her leg.\nThe chic gown was perfectly designed to make an impact with a frill running across her shoulders and down the plunging neckline.\nNipping in at her waist, the stunning star showed off her gym-honed frame perfectly while also nailing the red carpet to date night look.\nBoosting her endless legs and height, the stunning star gave a nod to her superstar status in a pair of envy-inducing Christian Louboutin stilettos.\nStunner: The 35-year-old Total Recall star looked sensational in a stunning checked gown which showed off her endless legs while the Senorita singer, 36, went for a wholly casual ensemble as he wore a beanie and a shirt\nLegs eleven: Jessica looked phenomenal in the dress which made the most of her incredible figure complete with a perilous slash extending the length of her leg\nShe scraped her brunette tresses into a high ponytail with the long lengths extending over her shoulder while her make-up was perfectly applied.\nJessica added a slick of pink lipstick yet kept the rest of her make-up minimal with just a slick of mascara to highlight her almond shaped eyes.\nJustin meanwhile looked wholly more low-key than his stunning wife as he wore a beanie with a blazer and shirt buttoned up to the neck.\nEarlier this year, loved-up Jessica discussed marriage to the star as he said: 'Literally every year we’re married I'm looking for that thing that he really sucks at.'\nBrunette beauty: She scraped her brunette tresses into a high ponytail with the long lengths extending over her shoulder while her make-up was perfectly applied\nLow-key: Justin meanwhile looked wholly more low-key than his stunning wife as he wore a beanie with a blazer and shirt buttoned up to the neck\nDuring her appearance on Ellen, the TV host decided to put a call in to Justin who was at home minding the couple's two-year-old son Silas. When he picked up the phone he told her he was busy making sweet potato fries for the toddler.\nEllen then informed him that according to the gossip mill, he and Jessica are expecting a second baby after he was photographed with his hands cradling her tummy as they danced at a recent LA Lakers game.\n'I can't wait to find out whose it is,' he quipped right back.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446706/Jessica-Biel-shows-endless-legs.html"}
