{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 00:41:27","date_modify":"2018-10-23 00:41:27","date_publish":"2017-03-10 07:28:16","description":"When Jessica Simpson's new campaign images were released there was one picture that really grabbed the eye.","filename":"data/vaneerConsumption/JessicaSimpsondonsherDaisyDukesforInstagramsnap.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E237CCD00000578-0-image-a-12_1489157781000.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300144_Jessica-Simpson-channels-Daisy-Duke-debut_1540255287.html","title":"Jessica Simpson dons her Daisy Dukes for Instagram snap","title_page":"Jessica Simpson dons her Daisy Dukes for Instagram snap | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When Jessica Simpson's new campaign images were released there was one picture that really grabbed the eye.\nBut while the sultry shot of the star posing in her Daisy Dukes highlighted her toned legs, there were those who assumed Photoshop was to thank.\nNot so, proved Jessica, as she slipped back into the denim micro shorts for a simple Instagram image on Thursday.\nReady for summer! Jessica Simpson once again donned a pair of unforgettable micro denim shorts for an Instagram snap on Thursday\nThe 33-year-old former pop star looked divine in the teeny Daisy Dukes, which showcased her legs to perfection.\nProving that the there was no technological trickery involved, she stood outside in a garden, looking her very best.\nOf course, knowing Jessica's love of high heels, she used a particularly striking pair to elongate her legs even further.\nThe wild multi-colored platform heels added even a few more inches to her already long gams.\nLooks familiar: Jessica Simpson modeled a pair of short denim shorts for the spring 2017 ad for her fashion collection\nOn top, she layered a fuzzy beige sweater with floral embellishments over a simple white tank that still managed to show off her very ample assets.\nShe playfully finished off her outfit with a pair of oversize, heart-shaped sunglasses.\nAs she was standing on a sunbathed walkway, her caption of 'Hello sunshine' was quite on point.\nPinup: The 33-year-old made an unforgettable impression as Daisy Duke in the 2005 comedy Dukes Of Hazzard\nOf course, Jessica Simpson made an unforgettable impression as Daisy Duke in the 2005 comedy Dukes Of Hazzard.\nThe svelte star became an instant pinup as she rocked her very short denim shorts, which actress Catherine Bach immortalized in the late 1970s TV series on which the movie was based.\nOn Wednesday the fashion designer was back in the shorts, for an ad campaign for her spring collection of clothes.\nHer Dukes film co-starred Johnny Knoxville and Seann William Scott.\nA 10: Though the movie was not a blockbuster, it did create a certain momentum for Jessica, who got her start as a pop star\nCousins: Her Dukes film co-starred Johnny Knoxville, left, and Seann William Scott, right\nThe original: Actress Catherine Bach immortalized the look in the late 1970s, early 1980s TV series on which the movie was based\nThe story was about how cousins Bo, Luke, and Daisy Duke, and their uncle Jesse, egg on the authorities of Hazzard County, Boss Hogg and Sheriff Coltrane.\nThough the movie was not a blockbuster, it did create a certain momentum for Jessica, who got her start as a pop star.\nSimpson's campaign also included shots of her in sexy black lace dresses that made the most of her very trim post-baby body.\nThe mother-of-two also wore jeans and a coral crop top.\n'In good company,' she captioned a photo that called attention to her toned belly in a red crop top teamed with jeans and platform heels.\nHottie: Simpson's campaign also included shots of her in sexy black lace dresses that made the most of her very trim post-baby body\nShe's got good jeans! Jessica Simpson unveiled her namesake brand's spring campaign on Tuesday, showing off her toned belly in a crop top and denim trousers\nMore the merrier! The singer's campaign certainly is set on racing some pulses\nThe blonde bombshell did not shy away from revealing other parts of her fit physique, including her trim legs.\nModeling a racy romper, she flashed her legs in several poses while wearing strappy sandal heels. And in another shot from the set, she wears an LBD with lace detail teamed with bright blue pumps and different styles of black strappy sandal heels.\nThe images will appear on outdoor advertisements and buses, as the billionaire's brand launches its new spring line.\nLeggy lady! The blonde modeled a print romper and strappy sandals\nNo doubt the 36-year-old is quite pleased with how she looks.\nIn an interview with Women's Health last year, the Texan spoke candidly about her body confidence.\n'I'm hard on myself, I believe everything is a work in progress,' she shared, 'but that's okay. I do love my legs, but my favorite physical attribute is my nose, because it's not perfect.'\nBillionaire boss! The bombshell mogul's campaign will appear on billboards and busses\n'But recently, since I've worked out so hard, I'm also loving my stomach,' she continued, 'knowing I grew babies in it, and then having to go through a transformation and just owning it.'\nSharing her thoughts on reading negative comments about her figure, she added, 'I will never understand why people take someone down for what you look like. If I had a character flaw, take me down. But a body flaw? That's not important.'\nHotties: The blonde beauty wore a corset as she posed with a pretty friend on Tuesday","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300144/Jessica-Simpson-channels-Daisy-Duke-debut.html"}
