{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 01:37:26","date_modify":"2018-10-23 01:37:26","date_publish":"2017-04-26 12:12:00","description":"Jesse Williams was spotted for the first time since news of his marital split broke, catching a flight out of Los Angeles on Tuesday amid claims he is dating actress Minka Kelly.","filename":"data/vaneerConsumption/JesseWilliamsisspottedamidMinkaKellyclaims.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F279200000578-0-image-a-32_1493205008290.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447314_Jesse-Williams-spotted-amid-Minka-Kelly-claims_1540258646.html","title":"Jesse Williams is spotted amid Minka Kelly claims","title_page":"Jesse Williams is spotted amid Minka Kelly claims | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was recently reported he had parted ways with his wife Aryn Drake-Lee after 13 years together.\nAnd Jesse Williams was spotted for the first time since news of his marital split broke, catching a flight out of Los Angeles on Tuesday amid claims he has been spending time with actress Minka Kelly.\nThe Grey's Anatomy star kept a low profile in a hoodie and jacket, ditching his wedding ring for his trip.\nScroll down for video\nGoing solo: Jesse Williams was spotted for the first time since news of his marital split broke, catching a flight out of Los Angeles on Tuesday amid claims he has been spending time with actress Minka Kelly\nOut and about: Minka was spotted stepping out in LA, looking glamorous in a patterned midi dress that clung to her curves\nMeanwhile, Minka was spotted stepping out in LA, looking glamorous in a patterned midi dress that clung to her curves.\nThe brunette stunner slung a dusty pink bag over one shoulder and slipped into a pair of coordinating sandals.\nThe Friday Night Lights star hid behind a pair of Aviator shades, showing no sign of being affected by the allegations.\nLooking good: The brunette stunner slung a dusty pink bag over one shoulder and slipped into a pair of coordinating sandals\nOn Monday it was reported the Grey's Anatomy star had split with Aryn, with whom he raises two children.\nTMZ subsequently claimed Jesse and Minka have been hanging out 'a lot' recently.\nThe two are shooting a project together in Paris and have been spotted together several times over the last few months, both on and off set; however no sources have indicated it is anything more than a friendship.\nMoving on? It was reported on Tuesday that Jesse has been linked to Minka following his divorce from his wife of five years\nJesse cropped up in an Instagram post by Minka of the two having dinner with another friend in January.\nMeanwhile Jesse and Aryn have not been photographed together since January of 2016 and there is no sign of Aryn on Jesse's Instagram page within the last two years.\nThe divorce was filed last week; sources told TMZ that Aryn does not want the divorce, but Jess believes the relationship has 'played itself out.'\nSpotted: Jesse cropped up in an Instagram post by Minka of the two having dinner with another friend in January\nThey have two young children together, son Maceo, aged one, and daughter Sadie, who is three.\nBut Jesse isn't seeking sole custody, instead he wants to share joint custody of their children with his estranged wife.\nThe last event they were seen at together was at the Art Los Angeles Contemporary 2016 Opening Night at Barker Hangar on January 28, 2016 in Santa Monica, California.\nFriday Night Lights star Minka dated baseball player Derek Jeter from 2008 to 2011, reuniting again briefly in 2012.\nJesse and Aryn married in September of 2012, but were together long before his acting career took off.\nLast sighting: Meanwhile Jesse and Aryn have not been photographed together since January of 2016 and there is no sign of Aryn on Jesse's Instagram page within the last two years. The pair was last photographed together at an event on January 28, 2016\nTMZ reports the split was 'amicable.'\nThe 35-year-old star and activist made headlines in 2016 with a politically charged speech at the BET Awards in Los Angeles.\nDuring the speech, he thanked his 'amazing wife who changed his life.'\nTogether, they co-founded the Ebroji app, which is a keyboard that focuses on inclusion in the options for emoji's and gifs in texting.\nShe was a real estate broker when they met, and he was a high school teacher in Philadelphia.\nHis breakout role came in The Sisterhood Of The Traveling Pants 2 in 2008, and he joined the cast of Grey's Anatomy in 2009.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447314/Jesse-Williams-spotted-amid-Minka-Kelly-claims.html"}
