{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-22 22:27:30","date_modify":"2018-10-22 22:27:30","date_publish":"2016-01-29 09:31:01","description":"It's puzzling how Jess Impiazzi achieved an invite to her former love rival's second anniversary party for Steam And Rye on Thursday night, making a defiant appearance at her co-owned bar.","filename":"data/vaneerConsumption/JessImpiazziattendsformerloverivalKellyBrooksbarparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/09/30B0E22D00000578-0-image-a-49_1454060107771.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422389_Jess-Impiazzi-attends-former-love-rival-Kelly-Brook-s-bar-party-vicious-David-McIntosh-dispute_1540247250.html","title":"Jess Impiazzi attends former love rival Kelly Brook's bar party","title_page":"Jess Impiazzi attends former love rival Kelly Brook's bar party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was once allegedly branded a 'sl**' by Kelly Brook in a vicious war of words over mutual ex David McIntosh.\nSo it's puzzling how Jess Impiazzi achieved an invite to her former love rival's second anniversary party for Steam And Rye on Thursday night.\nThough they weren't pictured together on the night, the frenemies seemed to have patched things up simply by the nature of Jess' defiant appearance.\nScroll down for video\nFrenemies: Kelly Brook (left) seemed to have invited former love rival Jess Impiazzi (right) to her bar launch on Thursday night, despite their vicious 2015 feud\nJess had the last word on the dispute in September when she branded Kelly a 'horrible b**ch' for calling her names.\nShe told the Daily Star: 'The only reason that went big was because Kelly Brook called me names for no reason. She's horrible. I used to look up to her and after that I was like you horrible b**ch.'\nBritish model Kelly is thought to have confronted Jess over a fling with former Gladiator David on the phone back in March last year, calling her a 'sl**' for dating just after Kelly called off her engagement to on-again-off-again flame David.\nRecalling the explicit conversation, Jess remembered Kelly asking: \"Are you and David dating - are you together? What's going on?\"' before Jess said, '\"Nothing really, we're just friends.\"'\nLost love: Kelly previously accused Jess of dating her former fiance David McIntosh, here in January 2014, and branded her a 'sl**' in a vicious phone showdown, reportedly\nDid they date? Jess, here with David in February 2015, shot down the accusations adding that Kelly was a 'horrible 'b**ch' for calling her names\nThe 25-year-old, who claims she wasn't aware until then that Kelly and David were speaking again, added: 'I said, \"Kelly, there's no need to try and upset me. I'm not in love with the guy. There's no need to be horrible. I don't care.\"\n'She said, \"Let's hope you're not lying to me like all the other sl**s. Nice talking to you Jess. Bye.\" She made me feel like a bit of an idiot.'\nDavid and Kelly finally called time on their relationship in November 2014 after a turbulent 11 months - six dating and five engaged - that ended less than amicably over cheating allegations lodged against him.\nMeanwhile, Jess and David were also spotted enjoying a few late nights out in London together in November 2014, no doubt prompting Kelly's speculation about an overlap in their relationships.\nLet the good times roll: Kelly had invited an ecclectic bunch to help her celebrate the second birthday of her co-owned bar Steam And Rye\nVixen: Reality star Jess pulled out all the stops in ripped jeans and killer heels, appearing to make a stand with her appearance\nIn the past? The 36-year-old seemed to have put the unfortunate incident behind her\nAll in the details: With her brunette locks worn in curls, Kelly was in high spirits\nBeing the bigger party, Kelly seemed to have put the nonsense to one side on Thursday and couldn't care less with new beau Jeremy Parisi on her arm.\nOver a year since the dating debacle, which ended in heartache for Kelly and subsequently a move to Los Angeles to pursue acting, Kelly seems to be more content than ever.\nThough the ultimate accessory on her arm appeared to be hunky French-Italian man Jeremy, her diamond left hand sparkler was also drawing attention.\nKelly recently sparked rumours she was engaged to Jeremy, and was still sporting the ring on her engagement finger, that she was reportedly given at Christmas.\nLoved up: Kelly had the ultimate accessory on her arm in the form of her hunky French-Italian boyfriend, Jeremy Parisi, who she left the bash hand in hand with, appearing to have put her ex in the past\nDate night: Jeremy seemed to be making Kelly happier than she's ever been\nHomeward bound: The couple have been dating for almost a year and spent Christmas and New Year's Eve together at model Jeremy's family home in Paris, France\nThe beauty has previously revealed that she was not ready to walk down the aisle with her judo-fighting partner.\nShe told Closer magazine: 'I'm not sure we're ready for marriage just yet, but we're definitely heading in the right direction. I'm a very loved-up lady right now.'\nKelly has previously been in relationships with Jason Statham, Billy Zane and rugby player Thom Evans.\nOn Thursday, she looked like she was ready to seriously let her hair down when she arrived at the second birthday party of her co-owned London bar venue.\nPop princess: Little Mix's Jade Thirlwall was one of the more A-list guests in attendance at Kelly's bash\nOh dear! Z-list reality stars Jess (left) and Pascal Craymer (right) made less than dignified exits from the party\nGlamour girls: Love Island's Cally Beech also caught up with Jess at the showbiz bash\nThe 36-year-old looked incredible in a black semi-sheer dress, which had a skater skirt style and lace sleeves.\nShe teamed the number with a pair of black tights and wore a pair of high heeled court shoes, in order to give herself some extra inches in the height department.\nAttendees on the night were a mixed bag of reality TV talent including Pascal Craymer, Love Island winner Jess Hayes and Big Brother star Nikki Grahame.\nThere was also a more A-list appearance in the form of Little Mix's Jade Thirlwall, who attended the bash unaccompanied by her three bandmates.\nTalk about making an impression: Love Island winner Jess Hayes flashed her assets in a plunging ensemble\nNew look: Little Mix star Jade Thirlwall showed off her edgy streaked hair (right) as she posed with a pal\nBack to black: Former Big Brother star Nikki Grahame looked great in thigh-high boots\nLooking all-white: Ex On The Beach's Anita Kaushik was one of the few reality stars who managed to leave the party with her modesty in tact\nNice one: Kelly cosied up a friend once inside the venue, who was making the most of the tasty cocktails on offer\nSomething to say? Kelly has recently sparked rumours she is engaged to Jeremy, and was still sporting a ring on her engagement finger but she says she is not yet ready\nCute: She artfully tucked her hair behind her ear as she made her way home at the end of the night\nLovely: She carried a chic Chanel bag on her shoulder as she showed off her designer accessories\nBefore the night kicked in! Kelly and her man posed with two of her pals as they started their evening\n'Off the rails': Kelly joked that her pals had been having an indulgent evening in the capital\nSelfie esteem: Kelly poses with her girlfriends as she enjoys a night in her central London venue\nCor and peace! The brunette glamour model cosies-up for am picture with War & Peace actor Callum Turner","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422389/Jess-Impiazzi-attends-former-love-rival-Kelly-Brook-s-bar-party-vicious-David-McIntosh-dispute.html"}
