{"authors":["Katie Storey For Mailonline"],"date_download":"2018-10-23 00:58:25","date_modify":"2018-10-23 00:58:25","date_publish":"2017-03-16 10:34:13","description":"The actress, 27, will star in ITV Encore's new series Harlots alongside Samantha Morton, Lesley Manville and Eloise Smyth that delves into the seedy business of the 18th century sex trade.","filename":"data/vaneerConsumption/JessicaBrownFindlaytostarinITVsHarlots.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E53210700000578-0-image-a-47_1489656280755.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319374_Jessica-Brown-Findlay-star-ITV-s-raunchy-new-series_1540256305.html","title":"Jessica Brown Findlay to star in ITV's Harlots","title_page":"Jessica Brown Findlay to star in ITV's Harlots | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is most known for her role as Lady Sybil Crawley in the hit historical period drama Downton Abbey.\nAnd now Jessica Brown Findlay is heading back in time yet again, but this time to delve into the raunchy business of the 18th century sex trade where women were pimped out via a directory of prostitutes.\nThe actress, 27, will star in ITV Encore's new series Harlots alongside Samantha Morton, Lesley Manville and Eloise Smyth.\nFrom Downton Abbey to Georgian London's brothels: Jessica Brown Findlay, 27, will star as 'coveted courtesan' Charlotte Wells in ITV's 18th century prostitution drama Harlots\n'Whore's eye view': The raunchy series will tell the story of brothel owners and the 18th century sex trade from a female perspective\nJessica will play the role of Charlotte Wells - the city's most coveted courtesan - while Samantha will star as her mother Margaret Wells.\nMaleficent star Lesley Manville plays the role of Lydia Quigley - another brothel owner - who becomes embroiled in a rivalry with the Wells.\nHarlots will be based in 1763 and will air for eight episodes at the end of this month on March 27.\nThe series depicts a family's struggles while owning a brothel in Georgian London and will be from a 'whore's eye view' instead of a usual male perspective.\nMoving on: Jessica's new role is a far cry from her character Lady Sybil Crawley in Downton Abbey\nRival madams: Samantha Morton (pictured left) and Lesley Manville (right) will play rival brothel owners Margaret Wells and Lydia Quigley\nThe Georgian age: Back in the day the legal age of consent was just 12 years old and women were often subjected to violence - something which Harlots is set to depict on screen\nIt boasts a team of entirely female directors and according to The Telegraph, executive producer Alison Owen has said about Harlots: 'It was very important for us right from the beginning to make it all about the female gaze.\n'Nearly every prostitute in drama has been seen through the male gaze... we were determined to do the very opposite of that.'\nThe show has been inspired by a historical directory of prostitutes titled Harris' List of Covent Garden Ladies.\nThe guide, which was put together so its writer Irishman Sam Derrick could get himself out of debt, was a bestseller in its time where as many as one in five women were prostitutes and men could buy a girl's virginity for extortionate prices.\nA raunchy guide: Harlots has been inspired by a historical directory of prostitutes titled Harris' List of Covent Garden Ladies and is set to include both male and female nudity\n'But if it's to see boob...': Jessica claimed she is happy with nudity onscreen as long as it's necessary to the story\nNot her usual look: The TV star, pictured at the BAFTAs in February, looks dramatically different on the red carpet in comparison to her character Charlotte Wells on Harlots\nIn the Georgian age, the legal age of consent was just 12 years old and women were often subjected to violence - something which Harlots is set to depict on screen.\nJessica, meanwhile, revealed all about her upcoming role in a recent interview with the Metro.\nAnd addressing the raunchiness of the series, which is set to see both its male and female cast strip off, Jessica claimed she is happy with the nudity as long as it's necessary for the show.\n'Sure [nudity] is there because it's sex and certainly certain parts you have to be exposed.\n'If it's part of a way a story will be told - and if it's for the narrative to move forward - then fine, but if it's there to see a boob because it's been too long then go somewhere else.'\nPutting her cleavage on display: Fortitude star Eloise Smyth stars on the show as Charlotte Wells' sister Lucy Wells","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319374/Jessica-Brown-Findlay-star-ITV-s-raunchy-new-series.html"}
