{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 23:41:23","date_modify":"2018-10-22 23:41:23","date_publish":"2017-04-26 08:23:43","description":"It was a look that certainly took the biscuit. For Jessica Seinfeld proved she is the custard cream of the crop by wearing a stunning yellow gown to a book signing in New York.","filename":"data/vaneerConsumption/JessicaSeinfeldstunsinyellowgownatNYCbooksigning.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9CCB2B00000578-0-image-a-6_1493190271983.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446494_Jessica-Seinfeld-stuns-yellow-gown-cookery-book-signing_1540251683.html","title":"Jessica Seinfeld stuns in yellow gown at NYC book signing","title_page":"Jessica Seinfeld stuns in yellow gown at NYC book signing | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was a look that certainly took the biscuit.\nFor Jessica Seinfeld proved she is the custard cream of the crop by wearing a stunning yellow gown to a book signing in New York on Tuesday.\nThe wife of megarich 62-year-old comic Jerry was grinning with glee as she posed up with her thrilling tome Food Swings: 125+ Recipes to Enjoy Your Life of Virtue And Vice as she prepared to meet her fans.\nTaking the biscuit: Jessica Seinfeld stunned in a custard cream gown at a book signing in New York on Tuesday\nThe 45-year-old was looking in good form in her figure-flattering maxi dress, which she coupled with a pair of white spotted high heels.\nThe cookery book author certainly proved a shapely advertisement for the quality of the healthy recipes in her latest tome.\nShe kicked off her writing career in 2007 when she released Deceptively Delicious, Simple Secrets to Get Your Kids Eating Good, which promoted healthy eating among children.\nJessica went on to write two further popular tomes, Double Delicious! Good, Simple Food for Busy, Complicated Lives and The Can't Cook Book.\nPocketing the proceeds: No doubt Jessica has another money-spinning tome on her hands\nFriends in high places: She was joined at the event by celebrity sidekick Ali Wentworth\nGrin when you're winning: This is her fourth cookery book in the space of a decade\nThe scribe famously left her husband of just three weeks to be with multimillionaire Jerry in 1998.\nDetermined Jerry began courting his future bride after meeting her at a gym, which she was attending after returning home from her honeymoon.\nShe later said that she had met the megarich funnyman, who is said to be worth $870 million, 'at the end of what was the most difficult period of my life.'\nThey have now been married for 17 years and have three children together.\nHer first husband, Broadway producer Eric Nederlander, is said to have been stunned by his then wife's behaviour and swiftly filed for divorce.\nHappy couple: Jerry and Jessica got married after initially meeting at a gym just weeks after her honeymoon to her first husband","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446494/Jessica-Seinfeld-stuns-yellow-gown-cookery-book-signing.html"}
