{"authors":["Laura House For Daily Mail Australia"],"date_download":"2018-10-22 21:38:34","date_modify":"2018-10-22 21:38:34","date_publish":"2017-04-26 02:07:44","description":"On Monday, Australian travel blogger Jessica Stein, aka Tuula Vintage, announced that she had given birth to her baby girl 'a few weeks ago' after a complicated pregnancy.","filename":"data/vaneerConsumption/JessicaSteinannouncesthebirthofherbabygirl.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B637600000578-0-image-a-4_1493166444620.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4445934_Jessica-Stein-announces-birth-baby-girl_1540244314.html","title":"Jessica Stein announces the birth of her baby girl","title_page":"Jessica Stein announces the birth of her baby girl | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In February, Australian travel blogger Jessica Stein took to her Instagram to announce her pregnancy after seven months of complications.\nAnd on Monday, Ms Stein announced that she had given birth to her baby girl 'a few weeks ago'.\n'Our little warrior safely arrived earth side a few weeks ago and since the first moment we met her we knew that we would go through it all again, a thousand times over,' she wrote on her Instagram page, Tuula Vintage.\nAustralian travel blogger Jessica Stein announced that she had given birth to her baby girl 'a few weeks ago' and has been living in the hospital with her newborn who's in special care\nIn February, Australian travel blogger Jessica Stein took to her Instagram to announce her pregnancy after seven months of complications\n'Thank you so much to everyone who reached out with encouragement and warm thoughts these past few months.\n'I have been offline while living in the hospital as she has been in the special care nursery, and will continue to be happily immersed in her for the next little while but sincerely appreciate everyone's overwhelming support.'\nMs Stein, who is believed to have given birth few weeks early, endured a challenging pregnancy with a number of complications.\n'I have been offline while living in the hospital as she has been in the special care nursery, and will continue to be happily immersed in her for the next little,' she wrote\nMs Stein, who is believed to have given birth few weeks early, endured a challenging pregnancy with a number of complications\nMs Stein's entire pregnancy announcement can be read here\nShe documented some of these with her 2.5 million followers and shared the highs and lows of her experience.\nThe stunning influencer, who is known for her idyllic photographs, first opened up about her rocky pregnancy after revealing that she was seven months pregnant.\nIn her announcement, Ms Stein shared a stunning black and white snap of herself and detailed the complications she had faced in the pregnancy due to being hit by a car when she was 16.\nThe stunning influencer, who is known for her idyllic photographs, first opened up about her rocky pregnancy after revealing that she was seven months pregnant\nIn her announcement, Ms Stein shared a stunning black and white snap of herself and detailed the complications she had faced in the pregnancy due to being hit by a car when she was 16\nMs Stein revealed her pregnancy was an 'unexpected miracle' as she wasn't sure if she would ever be able to have biological children.\n'I experienced multiple pelvic and internal injuries after being hit by a car at 16 with ongoing pain and limitations, and was warned of what might never come to be,' she wrote.\n'I've always wanted to adopt (as my incredible mum was) and my partner and I had been talking about it again just before this unexpected miracle happened.'\nMs Stein explained that she wouldn't have shared her story and the 'highs and lows of the pregnancy' online if she didn't think it was important.\n'I have been struggling with antenatal depression and hope that speaking out might just help heal myself, and someone else too,' she continued.\n'At our 20 week scan they noticed the lack of amniotic fluid that I had unknowingly been leaking due to my old bladder injury and was diagnosed with PPROM (broken waters),' she said\n'At our 20 week scan they noticed the lack of amniotic fluid that I had unknowingly been leaking due to my old bladder injury and was diagnosed with PPROM (broken waters).\n'With pre-labour symptoms and anticipating a very, very early arrival I was admitted to hospital in Sydney on bed rest once viable at 24 weeks.\nWe aren't in the complete clear but know that nothing ever really is.\n'I don't know the words to describe how hopeless I felt… not being able to control my own body, provide for my baby or see hope that we would make it through.'\nMs Stein said that while her partner was a 'rock of support and positivity,' she has found the last few months the 'loneliest' of her life.\nBut despite the complications, Ms Stein said she had experienced her 'first true moment of excitement and relief that things will be okay.'\nMs Stein said that while her partner was a 'rock of support and positivity,' she has found the last few months the 'loneliest' of her life\n'We have a little warrior who is beating all of the odds. I have been allowed home for the first time since late last year and the cloud of anxiety is slowly lifting,' she wrote.\n'Thank you to the doctors, midwives and hospitals who have gone above and beyond for us, including all of the women I met while sharing hospital rooms learning about each other's journeys.\n'We are so grateful to have come this far and be in this position that so many can only dream to reach. We aren't in the complete clear but know that nothing ever really is. For now we are going to lay low and enjoy every extra week of waiting to meet our miracle.'\n'Thank you to the doctors, midwives and hospitals who have gone above and beyond for us, including all of the women I met while sharing hospital rooms learning about each other's journeys,' she wrote\nSince posting, the popular blogger has been inundated with messages of support.\n'Thank you for sharing, you make social media more human. I will keep you in my prayers. Stay strong, the journey is worth it,' one follower wrote.\n'Thank you for sharing this story. What a wonderful miracle. Wishing you health and happiness in this journey,' another added.","url":"https://www.dailymail.co.uk/femail/article-4445934/Jessica-Stein-announces-birth-baby-girl.html"}
