{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-23 01:16:13","date_modify":"2018-10-23 01:16:13","date_publish":"2017-03-16 11:00:44","description":"Jessica, who announced her retirement in October last year after taking Olympic heptathlon silver in Rio, posted a photograph of two-year-old son Reggie holding a book announcing it.","filename":"data/vaneerConsumption/JessicaEnnisHillannouncessheispregnant.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53B05600000578-0-image-a-38_1489663233062.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4319676_Jessica-Ennis-Hill-announces-pregnant_1540257373.html","title":"Jessica Ennis-Hill announces she is pregnant","title_page":"Jessica Ennis-Hill announces she is pregnant | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dame Jessica Ennis-Hill has revealed she is expecting her second baby.\nJessica, who announced her retirement in October last year after taking Olympic heptathlon silver in Rio, posted a photograph of two-year-old son Reggie holding a book titled: 'I'm Going to be a Big Brother!' on her Instagram account.\nThe accompanying message read: 'Someone's going to be a big brother. Another little Ennis-Hill on the way. So happy.'\nJessica Ennis-Hill, 31, announced she is pregnant again by posting a photograph of two-year-old son Reggie holding a book entitled 'I'm Going to be a Big Brother!' on her Instagram account\nEnnis-Hill, now 31, and husband Andy Hill became parents for the first time in July 2014 when Reggie was born.\nJessica returned to athletics the following year and won World Championship gold in Beijing before only just failing to defend her Olympic title the following summer.\nShe was made a Dame in this year's New Year's Honours List.\nEnnis-Hill, now 31, and husband Andy Hill became parents for the first time in July 2014\nJessica Ennis-Hill said that knowing her son Reggie was at home watching her compete on television made the Rio Olympics 'really special' in a different way to London, left. Ennis-Hill, now 31, and husband Andy Hill, right, became parents for the first time in July 2014\nJessica spoke candidly in an interview with OK! Magazine last year about how special motherhood has been for her.\nEnnis-Hill said that being a mother ensured that taking to the track was 'special' for different reasons.\nThe mother-of-one from Sheffield, who gave birth to son Reggie in 2014, said: 'Now that I have Reggie and knowing that he's at home watching and hopefully really proud, and that he can look back at this time, makes it really special.'\nWhen talking about her performance in the competition, the London 2012 champion said: 'It was very close and I made a couple of little mistakes but Thiam was phenomenal over those two days.\n'There's an element of me that thinks, 'what if I'd done that or changed that?'.'\nEnnis-Hill scooped gold four years ago in the London 2012 Games but went onto have son Reggie, left, two years later and returned to competing\nWhile she has recently revealed that getting into shape following the birth of her son in 2014 was essential for her career, hitting the gym immediately isn't something she'd advise other mums to do.\nSpeaking out about how she got her six-pack back post birth saying her comeback was 'really hard', she told Cosmopolitan.co.uk that too many new mums put pressure on themselves to get their post-baby bodies back too quickly.\nShe said: 'There are so many people who are like, 'I need to get back to where I was straight away', and that's just not the case.\n'I remember in lots of interviews I did after [having Reggie] everyone was like 'how did you get your six pack back straight away?' But it didn't happen that quickly.'\nShe also urged parents of newborns not to rush back to the gym, saying: 'It takes time and I think it's really important that mums don't feel like they have to have the baby and then the next week start running and doing sit-ups, because it's not good for you physically or mentally and it's not going to help you. Just give yourself time.'","url":"https://www.dailymail.co.uk/femail/article-4319676/Jessica-Ennis-Hill-announces-pregnant.html"}
