{"authors":["Marta Jary For Daily Mail Australia"],"date_download":"2018-10-22 22:04:22","date_modify":"2018-10-22 22:04:22","date_publish":"2017-04-26 03:25:03","description":"Jessica Alba has revealed that she was always conscious of her image and didn't 'screw around' before meeting her husband, Cash Warren, 38.","filename":"data/vaneerConsumption/JessicaAlbastunsinElleAustraliacovershoot.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/03/3F9BC70800000578-0-image-a-34_1493173066246.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446112_Jessica-Alba-stuns-Elle-Australia-cover-shoot_1540245862.html","title":"Jessica Alba stuns in Elle Australia cover shoot","title_page":"Jessica Alba stuns in Elle Australia cover shoot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jessica Alba has revealed that she was always conscious of her image and didn't 'screw around' before meeting her husband, Cash Warren, 38.\nSpeaking to Elle Australia, the magazine's May cover girl revealed: 'I was single for eight months before I met my husband, so I didn't have a lot of time to screw around, and I was careful about my image, you know, I was always cognisant of it.'\nIn an interview alongside a stunning fashion shoot, the 35-year-old hints that she didn't want to be seen as a girl gone wild like some of her peers have been.\nSpeaking to Elle Australia, the magazine's May cover girl revealed: 'I was single for eight months before I met my husband, so I didn't have a lot of time to screw around, and I was careful about my image, you know, I was always cognisant of it'\n'I didn't want to rebel against being in the limelight. I knew I was fortunate and I didn't ever believe the hype,' she tells the publication.\nThe mother of two also revealed that her relationship with her Dark Angel co-star, Michael Weatherly which began when she was 18 and he 31, settled her down, too.\n'I was engaged to someone who was 12 years older than me —he was a grown-up with a kid,' she says of the Bull star, who is now 48.\nThe pair were in a relationship for three years between 2000 and 2003, after which Jessica was single for less than a year before meeting her current husband, Cash.\nCareful: 'I didn't want to rebel against being in the limelight. I knew I was fortunate and I didn't ever believe the hype,' she tells the publication\nGrown up: The mother of two says that her relationship with her Dark Angel co-star, Michael Weatherly which began when she was 18 and he 31, settled her down, too\nJessica met the film and television producer on the set of The Fantastic Four in 2004 and the pair married in 2008.\nThey have two daughters, Honor Marie Warren, 8, and Haven Garner Warren, 5.\nThe founder of The Honest Company also spoke about becoming an actress because she 'didn't feel comfortable in her own skin'.\nLoved up: Jessica met a film and television producer Cash on the set of The Fantastic Four in 2004 and the pair married in 2008\nHowever Jessica has previously revealed to MailOnline that she avoids being critical of her own body in front of her daughters.\n'I try not to be critical of myself and watch what I say around them, knowing that they're little sponges,' she told MailOnline.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446112/Jessica-Alba-stuns-Elle-Australia-cover-shoot.html"}
