{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 21:16:09","date_modify":"2018-10-22 21:16:09","date_publish":"2016-01-28 07:08:35","description":"The 34-year-old looked her best as she starred at the event alongside fellow silver screen beauties Jaime and Kate.","filename":"data/vaneerConsumption/JessicaAlbaleadsthewaywithbeautiesJaimeKingandKateBosworth.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/05/30A6C19D00000578-0-image-a-102_1453957240134.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420381_Jessica-Alba-leads-way-fellow-beauties-Jaime-King-Kate-Bosworth-join-Target-launch_1540242969.html","title":"Jessica Alba leads the way with beauties Jaime King and Kate Bosworth","title_page":"Jessica Alba leads the way with beauties Jaime King and Kate Bosworth | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is a business mogul who sells products ranging from diapers to sunscreen.\nSo it seemed only appropriate Jessica Alba was first amongst beauties at a launch for supermarket Target in New York on Wednesday.\nThe actress looked close to her best as she appeared at the event alongside fellow silver screen beauties Jaime King and Kate Bosworth.\nScroll down for video\nFantastic phwoar: Jessica Alba was joined by fellow beauties Jaime King and Kate Bosworth at the Who What Wear Target launch in New York on Thursday\nFantastic Four favourite Jessica, 34, was looking great in a black leather jacket, striped top and yellow and purple skirt.\nShe added a final dramatic flourish to her ensemble by wearing silver stilettos, a rather fitting addition given she is somehow worth an estimated $350 million.\nSuperman Returns star Kate, 33, was also a sight to behold in a trendy black minidress and thigh-high suede boots.\nRounding off the attractive group was Pearl Harbor actress Jaime, 36, who delighted in a black blazer, white feather Steven Khalil skirt and stilettos.\nBusiness as usual: The self-styled entrepreneur was winning all the stares at the event\nThree for the price of one: Attendees could no doubt scarcely believe their eyes when they saw who was there\nHell bent for leather: She made sure he looked great by donning a racy biker jacket\nCaught on camera: Who What Wear co-founders Katherine Power and Hillary Kerr have a selfie with Jessica\nSurprise! Jessica looked stunned by something on her phone, possibly unimpressed by her selfie snap\nMother-of-two Jessica recently claimed she had experienced sexism as she set up her business The Honest Company, which sells 'ethical' home products.\nThe self-styled actress said: 'You feel like a lone wolf surrounded by men who have done it all before.\n'Certainly people in Hollywood underestimated me. They absolutely, 100 per cent thought I was nuts.\n'It p***** me off! But as a woman, as an actress, I’ve dealt with that before. I’ve dealt with people undermining me; I’ve dealt with people thinking that I would do anything to get ahead and be successful.'\nSome say gentlemen prefer blondes: And if so they would doubtlessly have been impressed with Kate's immaculate appearance\nHeading down the Lois Lane: The Superman Returns actress turned heads as she arrived\nMaking an entrance: Jaime arrived wearing a sophisticated black blazer to keep her warm in the winter chill\nSupermarket sweets: The pair looked like they were having a great time at the Target event\nA bit of all white: Jaime stood out from her peers by donning a pale top and white feather Steven Khalil skirt\nTied up too tight: Jaime looked to loosen her choker in the middle of posing for pictures\nThat's better: Jaime flicked out her hair, revealing her delicately inked bicep\nMeanwhile her company, which in August was valued at $1.7 billion, was sued by consumer Jonathan Rubin for $5 million, who alleges her company 'deceptively and misleadingly' marketed its products as 'natural' when a number of items included 'unnatural' and 'synthetic\" ingredients.\nRubin named the brand's dish soap, hand soaps, diapers and multi-surface cleaner as being potentially hazardous and claims its sunscreen is ineffective.\nChin up: Jaime's bronze smokey eye-shadow gave her an alluring quality\nMaking a statement: Katherine Power teamed a floral print dress and long denim jacket with a pair of white heels\nOff the shoulder: The actress successfully teamed sophisticated glamour with a playful edge\nTowering: Jessica's stunning silver stilettos contrasted with her playful summery dress\nBack in black: Kate cut a stylish figure in a plain all-black ensemble which teamed an LBD with knee-high boots\nFlying visit: After the event was over she made a quick getaway to JFK Airport to jet back home\nShe's no Invisible Woman: Even in her travelling clothes it was impossible to ignore the Latina lovely\nTrolley dolly: She caused quite a stir as she pushed her luggage through the departure lounge\nThe company has asked that the entire lawsuit be thrown out and points out that the man didn't even buy some of the products he is complaining about not being natural, specifically the brand's diapers and their multi-surface cleaner.\nAlba's company says that Rubin failed to show any misleading or false statements that were made by The Honest Company and also any proof that he purchased the items based on these alleged statements.\nHard to miss: Jaime was spotted getting coffee earlier in the day wearing baggy denim overalls","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420381/Jessica-Alba-leads-way-fellow-beauties-Jaime-King-Kate-Bosworth-join-Target-launch.html"}
