{"authors":["Jj Nattrass For Mailonline"],"date_download":"2018-10-23 02:41:54","date_modify":"2018-10-23 02:41:54","date_publish":"2016-01-11 15:07:23","description":"Arriving at the star-studded Weinstein Company and Netflix after-party, held at the Beverly Hilton hotel, the 34-year-old actress was all smiles as she showed off her lithe pins in an understated red dress.","filename":"data/vaneerConsumption/JessicaJonesKrystenRitterwearsscarletgownatNetflixGoldenGlobesparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B070D00000578-0-image-a-18_1452524605441.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394003_Jessica-Jones-star-Krysten-Ritter-flashes-lithe-legs-Marvel-ous-red-dress-attends-Golden-Globes-party_1540262514.html","title":"Jessica Jones' Krysten Ritter wears scarlet gown at Netflix Golden Globes party","title_page":"Jessica Jones' Krysten Ritter wears scarlet gown at Netflix Golden Globes party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She plays the titular un-sociable and reluctant hero in Netflix's hit series, Jessica Jones.\nBut Krysten Ritter looked a far-cry from her gritty and surly character, as she arrived at The Weinstein Company and Netflix Golden Globes after-party Sponsored by Heineken, in Los Angeles, on Sunday.\nArriving at the star-studded bash, held at the Beverly Hilton hotel, the 34-year-old actress was all smiles as she showed off her lithe pins in an understated red dress.\nScroll down for video\nLady in red: Krysten Ritter looked a far-cry from her gritty and surly character, Jessica Jones, as she arrived at The Weinstein Company and Netflix Golden Globes after-party, in Los Angeles, on Sunday\nSlipping her svelte figure into an Osman split button gown for the soiree, the raven-haired beauty hit all the right notes as she mingled with her fellow A-Listers.\nSticking to a low-key yet effortlessly glamorous theme, Krysten donned a simple floor-length dress, which clung to her slim line curves and toned frame.\nFeaturing a thigh-high split, which was further highlighted by button detailing, the actress drew attention to enviably lithe legs.\nSee more of the latest news, pictures and videos from the Golden Globes after party\nMarvel-ous style: Arriving at the star-studded bash, held at the Beverly Hilton hotel, the 34-year-old actress was all smiles as she showed off her lithe pins in an understated Osman split button gown in red\nFurther accentuating her pins, the former Breaking Bad star donned a pair of skyscraper stiletto heels, which featured gold glitter detailing.\nKeeping to her understated theme, Krysten accessorised her wardrobe with a pair of dangling diamond earrings and a metallic box clutch.\nWearing her raven tresses in a perfectly coiffed centre-parting, the Pennsylvania-born beauty let her locks tumble down to her shoulders in floating waves.\nA leggy display: Sticking to a low-key yet effortlessly glamorous theme, Krysten donned a simple floor-length dress, which clung to her slim line curves and toned frame\nA well-heeled display: Further accentuating her pins, the former Breaking Bad star donned a pair of skyscraper stiletto heels, which featured gold glitter detailing\nPerfectly complementing her alabaster complexion with a minimal palette of make-up, Krysten highlighted her eyes with hint of eyeliner and highlighted her lips with a slick of scarlet lipstick.\nHowever Krysten didn't have to walk the red carpet alone, as her Jessica Jones co-star Rachael Taylor arrived at the bash with her.\nOpting for a strapless black bustier with a peplum hem and skintight black trousers, the 31-year-old Australian actress rounded her look off with a pair of matching stiletto heels.\nQuite the duo: However Krysten didn't have to walk the red carpet alone, as her Jessica Jones co-star Rachael Taylor arrived at the bash with her","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394003/Jessica-Jones-star-Krysten-Ritter-flashes-lithe-legs-Marvel-ous-red-dress-attends-Golden-Globes-party.html"}
