{"authors":[],"date_download":"2018-10-23 03:13:48","date_modify":"2018-10-23 03:13:48","date_publish":"2017-04-26 14:36:28","description":"Indian carrier Jet Airways said Wednesday it had suspended a foreign pilot from flying duty over allegations that he assaulted a woman and hurled racist...","filename":"data/vaneerConsumption/JetAirwayssuspendspilotoverracismassaultclaims.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/14/wire-465479-1493213790-742_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4447846_Jet-Airways-suspends-pilot-racism-assault-claims_1540264428.html","title":"Jet Airways suspends pilot over racism, assault claims","title_page":"Jet Airways suspends pilot over racism, assault claims | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Mumbai-based airline confirmed the incident took place on April 3 on a Chandigarh-Mumbai flight, adding the pilot in question had been taken off the flying roster soon after and an apology had been extended to the victim.\nIndian carrier Jet Airways said Wednesday it had suspended a foreign pilot from flying duty over allegations that he assaulted a woman and hurled racist abuse at another passenger on a domestic flight.\nThe Mumbai-based airline confirmed the incident took place on April 3 on a Chandigarh-Mumbai flight, adding the pilot in question had been taken off the flying roster soon after and an apology had been extended to the victim.\n\"As regards the said incident, Jet Airways has noted guest feedback with concern and regrets the incident,\" Jet Airways said in a statement Wednesday.\n\"The airline has, as per policy, initiated a full-fledged investigations, based on specific inputs from guests, concerned departments and agencies.\"\nCricketer Harbhajan Singh has weighed in on the scandal, although he clarified that he had not witnessed the incident firsthand.\n\"Not only was he racist, but physically assaulted a lady and abused a physically challenged man... absolutely disgraceful and shame on @jetairways,\" said India's out-of-favour spinner on Twitter, urging Prime Minister Narendra Modi to reprimand the airline and its pilot.\nScandals have dogged the airline industry in recent weeks, particularly in the US after United Airlines drew global outrage for forcefully dragging a passenger off an overbooked flight.\nFootage of the April 9 incident captured by fellow passengers went viral on social media and caused a public relations calamity for the carrier and airport officials.","url":"https://www.dailymail.co.uk/wires/afp/article-4447846/Jet-Airways-suspends-pilot-racism-assault-claims.html"}
