{"authors":[],"date_download":"2018-10-22 22:49:45","date_modify":"2018-10-22 22:49:45","date_publish":"2014-06-11 00:17:42","description":"Starting Sunday, JetBlue will offer business-class seats with fares ranging from $599 to $999 each way.","filename":"data/vaneerConsumption/JetBlueIntroducesMintClassWithLieFlatSeats.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/500881/140610-jetblue-mint-sleeper_1549a63924f981cd140866c1bc2194b2.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_jetblue-introduces-mint-class-lie-flat-seats-n127976_1540248585.html","title":"JetBlue Introduces Mint Class With Lie-Flat Seats","title_page":"JetBlue Introduces Mint Class With Lie-Flat Seats","title_rss":"NULL","source_domain":"nbcnews.com","text":"The seats themselves extend flat to comfortably fit a person as tall as 6 feet 8 inches. There are controls that adjust for cushion firmness, and a button that promises a massage (though don't expect much in the way of pressure). And the seating areas are well-designed, with storage areas for shoes and purses, drink holders, plus charging stations for electronics.\nWhat's really interesting, though, is the free in-flight wireless service. It has been upgraded to allow video streaming, a capability not commonly supported on in-flight networks. Since JetBlue considers itself a 15-year-old Big Apple startup, it has also tapped other locally based startups as its purveyors. The tapas-style eats were inspired by Manhattan's Saxon & Parole restaurant, Blue Marble Ice Cream in Brooklyn is supplying some of the sweets, and Birchbox is compiling the his and hers travel toiletry kits. \"In order to be in the premium-class game, you simply have to have a product that's great. There's only so far you can go with a nice business class product and JetBlue has assessed this,\" says Jay Sorensen, president of IdeaWorks Company, an airline industry consulting firm that doesn't advise JetBlue.\nHe adds that a \"class war\" has erupted between the biggest U.S. carriers flying trans-continental, thanks to the fact that the New York routes are the most competitive and business class fliers among the most profitable. So-called \"transcon\" corporate travelers can make up 10 percent of passengers, while pulling in 30 percent of revenues on some flights.\n\"We picked these markets because they are the biggest markets in the country for premium product such as the Mint experience,\" said Jamie Perry, director of product development at JetBlue. \"But also, we feel that the prices are extremely high and the products are relatively average right now, so there was a great opportunity for JetBlue to come in and do what it does best, which is to over serve the under served.\" In other words, he adds, offer a better product at a lower price point.\nIt certainly is lower. Fares range from $599 to $999, each way — still well below bigger competitors' rates. A comparable business-class ticket on another airline could run as high as $2,000.\n\"In order to be in the premium-class game, you simply have to have a product that's great.\"\nPerry says early bookings for Mint are already sold out. The three-figure fares undoubtedly help — but analysts say those lower prices could also be the biggest risk associated with the new service.\n\"I think that JetBlue is going to struggle to steal away the corporate traveler that's loyal from a frequent flier perspective to Delta or United,\" says Joseph DeNardi, an associate analyst at Stifel Nicolaus who covers airlines. \"But at this price point it's going to be very good from a bookings perspective. I just question the return that they're able to generate at $599.\"\nDeNardi thinks prices will ultimately have to rise for JetBlue to see a meaningful return on its new investment. That's because premium seats typically take up precious space — the equivalent of two to three economy class ones.\nBut Perry says those fears are unwarranted. Mint is part of a much bigger three-year design overhaul. The new Airbus jets don't just don a new business class, but a completely overhauled core class as well. New thinner seats have been trimmed by inches, carving out more space to pack in more passengers without sacrificing legroom. And the new planes are actually 23 feet longer than their predecessors, the Airbus A320s.\nSo despite Mint's demand on space, there are still nine additional seats in total on the new planes. Even more, they cost the same to fly, thanks partly to upturned wing tips that increase fuel efficiency.\nAll of this means JetBlue's new planes could welcome higher margins and potentially bigger profits — even if Mint fails to take off.","url":"https://www.nbcnews.com/business/travel/jetblue-introduces-mint-class-lie-flat-seats-n127976"}
