{"authors":["Danielle Muoio"],"date_download":"2018-10-30 21:04:21","date_modify":"2018-10-30 21:04:21","date_publish":"2016-12-22 00:00:00","description":"\"If the crew determines that a customer is causing conflict on the aircraft, the customer will be asked to deplane,\" JetBlue said.","filename":"data/vaneerConsumption/JetBlueremovespassengerforconfrontingIvankaTrump.json","image_url":"https://amp.businessinsider.com/images/5807e0ac8d83b41e008b5941-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_jetblue-removes-passenger-for-confronting-ivanka-trump-2016-12_1540933461.html","title":"JetBlue removes passenger for confronting Ivanka Trump","title_page":"    JetBlue removes passenger for confronting Ivanka Trump - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Ivanka Trump speaks at the 2016 Republican National Convention. REUTERS/Mike Segar JetBlue removed a passenger and his husband from a flight on Thursday after he was said to have confronted Ivanka Trump and her children.\nIn a statement emailed to Business Insider, the airline confirmed that the passengers were removed from the plane.\n\"The decision to remove a customer from a flight is not taken lightly,\" JetBlue said.\n\"If the crew determines that a customer is causing conflict on the aircraft, the customer will be asked to deplane, especially if the crew feels the situation runs the risk of escalation during flight.\n\"In this instance, our team worked to reaccommodate the party on the next available flight,\" JetBlue added.\nThe passenger who was removed did not immediately respond to inquiries from Business Insider.\nRepresentatives of Trump declined to comment.\nTMZ reported that the passenger told Trump \"your father is ruining the country\" before he was removed from the plane, which was departing from John F. Kennedy International Airport in New York.\nAccording to TMZ, he then said: \"Why is she on our flight? She should be flying private.\"","url":"https://www.businessinsider.com/jetblue-removes-passenger-for-confronting-ivanka-trump-2016-12"}
