{"authors":["Daniel J. Flynn"],"date_download":"2018-10-30 18:19:52","date_modify":"2018-10-30 18:19:52","date_publish":"2015-11-09 14:47:38","description":"New York Jets defensive lineman Sheldon Richardson came out in support of the striking players at his almost alma mater. |","filename":"data/vaneerConsumption/JetsDLinemanSheldonRichardsonProudofMizzouPlayersBoycottingFootball.json","image_url":"https://media.breitbart.com/media/2015/07/Sheldon-Richardson-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_11_09__1540923592.html","title":"Jets D-Lineman Sheldon Richardson 'Proud' of Mizzou Players Boycotting Football","title_page":"Jets D-Lineman Sheldon Richardson 'Proud' of Mizzou Players Boycotting Football | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"New York Jets defensive lineman Sheldon Richardson came out in support of the striking players at his almost alma mater.\n“I’m proud of those guys for standing together,” Richardson told reporters regarding the Mizzou players boycotting football until the school’s president leaves. “As far as Tim [Wolfe], he does need to go, but that’s just my opinion on it. Some stuff happened back then when I was there.”\nRichardson left Missouri after less than two years following a violation of rules in 2012. The NFL suspended him four games earlier this season for repeatedly popping positive for marijuana. Police in Missouri arrested Richardson in July, alleging he drove 140 miles per hour in a car with two men and a 12-year-old. The cops say the car wreaked of pot when they finally caught up to the Jets player.\nMore than thirty Mizzou football players posed with arms interlocked for a photograph in support of a movement to remove the school’s president. Activists, including a graduate student on a hunger strike, criticize University of Missouri President Tim Wolfe for refusing to converse with members of a mob who surrounded his car at homecoming and for allegedly mishandling several racial incidents on campus.\nRichardson, a St. Louis-area native, weighed-in on the Black Lives Matter protests last year, calling Darren Wilson, the policeman who shot and killed Ferguson, Missouri, teen Michael Brown, a “pig.” Richardson also praised Rams players who engaged in a “hands up, don’t shoot” pose during a game. “I’m glad somebody else in the league said something besides me,” Richardson explained in 2014. “I’m happy about somebody else taking a stand.”\nHe’s happy about his fellow Missouri Tigers taking a stand, too.\n“I most definitely support those guys’ cause,” Richardson told journalists after Sunday’s Jets win, in which the lineman made five tackles and registered half a sack, over the Jacksonville Jaguars. “I hope they do stick together when game time does come. If a decision hasn’t been made, hopefully they stay true to their word. I know how persuasive coach [Gary] Pinkel can be. I don’t know what his opinion is about the situation.”\nPinkel cancelled practice on Sunday and says he supports the decision of his players.","url":"https://www.breitbart.com/sports/2015/11/09/jets-d-lineman-sheldon-richardson-proud-of-mizzou-players-boycotting-football/"}
