{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:09:40","date_modify":"2018-10-30 21:09:40","date_publish":"2015-12-09 14:42:03","description":"Jewish actress Mayim Bialik took to Facebook to slam people who boycott her because she supports Zionism and Israel.","filename":"data/vaneerConsumption/JewishActressMayimBialikTellsIsraelHatersWhereToStickIt.json","image_url":"https://media.breitbart.com/media/2015/12/Screen-Shot-2015-12-09-at-14.34.35.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_12_09__1540933780.html","title":"Jewish Actress Mayim Bialik Tells Israel-Haters Where To Stick It","title_page":"Jewish Actress Mayim Bialik Tells Israel-Haters Where To Stick It","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Jewish actress Mayim Bialik took to Facebook to slam people who boycott her because she supports Zionism and Israel.\nBialik posted this (original at right) on Tuesday:\n“For those of you who refuse to follow me and discourage others from doing so because I am a Zionist (as if that’s a crime!!), I highly recommend you look up Zionism in a dictionary rather than using the definition perpetrated by anti-semitic media and leaders. Zionism is the belief that Jewish people deserve an autonomous homeland free from terrorism and threat to our global existence. if you don’t want to follow me because I believe in that, by all means don’t.”\nFacebook fans responded with encouraging messages, telling Bialik to “rock on” and stand up for what she believed in.\nOne wrote, “I never thought of myself as being a Zionist guess mostly because I never truly knew the meaning of the word. I am a Christian but also believe as a Zionist would. The Jewish people need a place of their own called Israel free of violence they are not suffering.”\nThe “Big Bang Theory” actress, who is also a neuroscientist, has expressed her love of Israel on many occasions in the past. In 2014 during Israel’s war with Hamas in Gaza, Bialik sent a donation to the IDF, which aroused anger among anti-Israel critics who sought to boycott the star.","url":"https://www.breitbart.com/entertainment/2015/12/09/jewish-actress-mayim-bialik-tells-israel-haters-where-to-stick-it/"}
