{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 21:04:34","date_modify":"2018-10-30 21:04:34","date_publish":"2017-03-03 09:40:37","description":"Jewish Agency for Israel Chairman Natan Sharansky said there is “no reason to suspect President Trump of arousing support for antisemitism.”","filename":"data/vaneerConsumption/JewishAgencyChairmanTrumpNotResponsibleforResurgenceofAntiSemitism.json","image_url":"https://media.breitbart.com/media/2017/03/Jewish-Agency-for-Israel-Chairman-Natan-Sharansky.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_03_03__1540933474.html","title":"Jewish Agency Chairman: Trump Not Responsible for Resurgence of Anti-Semitism","title_page":"Jewish Agency Chairman: Trump Not Responsible for Resurgence of Anti-Semitism","title_rss":"NULL","source_domain":"breitbart.com","text":"The Algemeiner reports: Jewish Agency for Israel Chairman Natan Sharansky on Thursday said that there is “no reason to suspect US President Donald Trump of arousing support for antisemitism,” the Hebrew news site nrg reported.\nSharansky made this comment at a conference marking two anniversaries: 120 years since the 1897 founding of the World Zionist Organization, and 50 since the reunification of Jerusalem in the 1967 Six-Day War. During the event, held at the Efrata College in the Israeli capital, Sharansky defended Trump against allegations of being responsible for the recent spike in anti-Jewish incidents in the US, such as the desecration of cemeteries and bomb threats issued against synagogues and day schools.\n“One cannot tie such profound, long-term, historical, significant processes like the resurgence of antisemitism to some remark made by this or that politician,” Sharansky was quoted by nrg as saying. “There are many attempts in the world to demonize the Jews in the state of the Jews. What is happening today in the US proves that ultimately there is no difference between the antisemitism of the Right and the anti-Israelism of the Left.”\nRead more here.","url":"https://www.breitbart.com/middle-east/2017/03/03/jewish-agency-chairman-trump-not-responsible-resurgence-anti-semitism/"}
