{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 18:37:50","date_modify":"2018-10-30 18:37:50","date_publish":"2016-12-29 11:55:54","description":"A number of leading Jewish organizations came out against Secretary of State John Kerry's Wednesday speech on the Israeli-Palestinian peace process, mere days after the Obama administration's decision to break with longstanding tradition and abstain from voting on an anti-Israel resolution at the United Nations Security Council. | Israel / Middle East","filename":"data/vaneerConsumption/JewishGroupsBlastKerrysMideastSpeechFilledwithAntiIsraelVitriol.json","image_url":"https://media.breitbart.com/media/2016/12/wi/afp/28/12snka4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_12_29__1540924670.html","title":"Jewish Groups Blast Kerry's Mideast Speech: 'Filled with Anti-Israel Vitriol'","title_page":"Jewish Groups Blast Kerry's Mideast Speech: 'Filled with Anti-Israel Vitriol' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A number of leading Jewish organizations came out against Secretary of State John Kerry’s Wednesday speech on the Israeli-Palestinian peace process, mere days after the Obama administration’s decision to break with longstanding tradition and abstain from voting on an anti-Israel resolution at the United Nations Security Council.\nThe Zionist Organization of America (ZOA), in a statement penned by President Mort Klein, said Kerry’s “speech was filled with anti-Israel vitriol and falsehoods.” Klein wrote that Kerry’s “speech today essentially was a proposal for a Hamas-Fatah-Iranian-Palestinian-Arab terrorist state, which divides Jerusalem in two, forcibly evicts Jews from their homeland, and requires Israel’s retreat to indefensible borders.” He added, “Despite Israel’s willingness to negotiate and the Palestinians’ refusals, Kerry blamed the Israelis and the Palestinians ‘equally’ for the lack of peace.”\nRepublican Jewish Coalition Executive Director Matt Brooks said, “By claiming this speech is a framework for peace in the Middle East, President Obama and John Kerry are playing the Jewish community for fools,” and called the Obama administration’s decision to abstain from the Security Council vote “a parting shot at Israel and Prime Minister Netanyahu, while at the same time creating new roadblocks to peace.”\nThe American Israel Public Affairs Committee (AIPAC) said, “Secretary Kerry placed overwhelming, disproportionate blame for the failure to advance peace on our ally, Israel, while neglecting numerous Israeli peace offers and Palestinian refusal to resume direct talks.”\nThe American Jewish Committee (AJC)’s CEO David Harris penned an open letter to Kerry in which he referred to the “unprecedented level of bilateral cooperation between Washington and Jerusalem over the past eight years,” but said that as he “processed every word, every idea, every facial gesture, every gesticulation in your remarks, I felt some unease. I wanted to embrace it all – the hope, the vision, the determination – and yet something was missing for me.”\nJack Rosen, president of the American Jewish Congress, also responded. “Secretary Kerry’s has been wrong on ISIS, wrong on Iran, wrong on Syria and wrong on Russia. He is now also wrong on the Israeli-Palestinian conflict.” Rosen added:\nDespite the horrific scenes of over 250,000 innocent people massacred, including women and children in Syria, the Obama Administration has used its remaining time to single out Israel. We express our gratitude to the incoming administration for committing to the moving the embassy, and all that they are doing to address these issues during the transition period.\nAnti-Defamation League (ADL) CEO Jonathan Greenblatt and National Chair Marvin Nathan said, “While we appreciate Secretary Kerry’s concern about policies and dynamics that may jeopardize the path to a two-state solution, we are deeply disappointed by elements of his speech and cannot separate it from the U.S. abstention at the U.N. Security Council.” Greenblatt and Nathan added that Kerry’s speech reinforces the “unhelpful perception that the international community is dictating terms to Israel.”\nJ Street, a far-left, George Soros-funded organization, issued a statement praising Kerry. The group wrote that it “applauds” and “strongly supports” Kerry’s speech as well as his “proposals for concrete steps toward the two-state solution.” They added, “We call as well on Jewish communal leaders to endorse this vision and to make clear that the overwhelming majority of Jewish Americans and friends of Israel choose the path of two states and not the path that leads to a ‘Greater Israel’ and increasing international isolation.”\nWhile several Jewish Democratic lawmakers were critical of the Obama administration’s decision to abstain from voting on Friday’s anti-Israel resolution, they were silent in response to Kerry’s controversial speech, with a few exceptions.\nSen. Richard Blumenthal (D-CT) wrote, “While I respect the administration’s steadfast efforts to seek successful negotiations aimed at a two state solution, I continue to be deeply disturbed and disappointed by its recent UN Security Council abstention. Secretary Kerry’s speech failed to dispel my strong concerns.”\nMeanwhile, Republicans – seen as the staunchest allies of the Jewish state – issued stinging criticism of Kerry. Speaker of the House Paul Ryan tweeted, “After allowing this anti-Israel resolution to pass the UN, Secretary Kerry has no credibility to speak on Israeli-Palestinian peace.”\nAfter allowing this anti-Israel resolution to pass the UN, Secretary Kerry has no credibility to speak on Israeli-Palestinian peace. — Paul Ryan (@SpeakerRyan) December 28, 2016\nFormer CIA Director James Woolsey, speaking on CNN, alluded to the bias against Israel in Kerry’s speech: “I must say I don’t think Israel is the provocateur in this. The only way that they are provocateurs is that they exist and the Palestinians don’t want a Jewish state or a partially Jewish state or any Jews in that part of the world. And that’s the problem.”\nJames Woolsey on @CNN: 'I don’t think Israel is the provocateur in this. The only way that they are provocateurs is that they exist.' pic.twitter.com/cS3pvc7PhI — Adelle Nazarian (@AdelleNaz) December 28, 2016\nPresident-elect Donald Trump sent out several tweets prior to Secretary Kerry’s speech in which he restated his intention to strengthen the U.S.-Israel alliance, particularly where it has been weakened over the last eight years:\nWe cannot continue to let Israel be treated with such total disdain and disrespect. They used to have a great friend in the U.S., but……. — Donald J. Trump (@realDonaldTrump) December 28, 2016\nnot anymore. The beginning of the end was the horrible Iran deal, and now this (U.N.)! Stay strong Israel, January 20th is fast approaching! — Donald J. Trump (@realDonaldTrump) December 28, 2016\nNOTE: This piece has been updated to include a quote from American Jewish Congress President Jack Rosen.\nFollow Adelle Nazarian on Twitter and Periscope @AdelleNaz.","url":"https://www.breitbart.com/middle-east/2016/12/29/jewish-groups-blast-john-kerrys-israel-speech-democrats-remain-mum/"}
