{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:10:47","date_modify":"2018-10-30 21:10:47","date_publish":"2015-11-23 19:01:17","description":"A Jewish student at Santa Cruz was pushed to abstain from an anti-Israel resolution over fears he was \"elected by a Jewish agenda.\"","filename":"data/vaneerConsumption/JewishStudentPressedtoAbstainfromIsraelVote.json","image_url":"https://media.breitbart.com/media/2015/11/Daniel-Bernstein-UC-Santa-Cruz-Facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_11_23__1540933847.html","title":"Jewish Student Pressed to Abstain from Israel Vote","title_page":"Jewish Student Pressed to Abstain from Israel Vote | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Jewish student at the University of California Santa Cruz was pushed to abstain from voting on an anti-Israel resolution seeking divestment from the Jewish state over fears that he was “elected by a Jewish agenda.”\nDaniel Bernstein, who represents UCSC’s Stevenson College in the Student Union Assembly, received a message from the chair of the Stevenson student council telling him that the council voted to exclude him from voting on the anti-Israel resolution over concerns that the “Jewish community rallied with [Bernstein] to elect [him] the Stevenson rep.” as a result of this “Jewish agenda.” A copy of the message was first obtained by Stand With Us and reported on by Campus Reform.\nThe Student Union Assembly at UCSC reportedly voted last week to divest from five companies that the students say are complicit in human rights violations by making the equipment used by the Israeli military. The companies are Hewlett Packard, General Electric, Caterpillar, Lockheed Martin, and Elbit.\nBernstein reportedly defied the pressure and still voted “no” on the resolution, which subsequently went on to pass, 28-5, with seven abstentions.\nHe posted the following message on Facebook:\nThe implication that I, as a Jewish student and leader in the Jewish community, should not be allowed to vote on an issue that so deeply impacts the Jewish community, and that I should abstain because I cannot be trusted due to an alleged, ‘Jewish agenda,’ echoes the racism Jews have faced all over the world throughout our history. I wish that me being subjected to anti-Semitism was a shocking new occurrence. But the truth is that I’m not shocked. I’m not shocked because this hatred and ignorance has followed me everywhere. I’m not shocked because Jewish students have been targeted with this vile racism all over the UC system for years, and especially since BDS became a major issue of discussion. Anti-Semitism today may not be the same as it was in the 1930s. But it has clearly evolved to become an inseparable part of campus politics right here at UC Santa Cruz and across the UC system.\nAntisemitism has become rampant on California campuses in recent years. In March, UCLA sophomore Rachel Beyda was initially denied a position on the university’s judicial board because of her Jewish faith. The month after that, Stanford junior Molly Horowitz was questioned about whether her Jewish faith would affect her ability to serve in the student Senate. Later, swastikas were painted on a Jewish fraternity at UC Davis, and anti-religious slurs carved into cars there.\nDespite attempts by members of the student body to separate anti-Israel sentiment from Judaism, the two are proving inextricable.\nStanley Traub, the Vice President of Slugs for Israel [the UC Santa Cruz mascot is a banana slug], told Campus Reform that he strongly “condemns the divestment vote” and believes there was a “strong Anti-Semitic sentiment” behind it. The UC Student association voted earlier this year to divest from Israel and America.\nFollow Adelle Nazarian on Twitter @AdelleNaz and on Facebook.","url":"https://www.breitbart.com/local/2015/11/23/jewish-student-pressed-abstain-israel-vote/"}
