{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:13:31","date_modify":"2018-10-30 21:13:31","date_publish":"2016-07-07 13:59:36","description":"TEL AVIV – Jews in France are feeling increasingly insecure and uncomfortable despite the French government’s efforts to protect them.","filename":"data/vaneerConsumption/JewishAgencyChiefFrenchJewsFeelInsecure.json","image_url":"https://media.breitbart.com/media/2015/01/Paris_Jews_AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_07_07__1540934011.html","title":"Jewish Agency Chief: French Jews Feel Insecure","title_page":"French Jews Insecure Despite Efforts To Protect Them","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Jews in France are feeling increasingly insecure and uncomfortable despite the French government’s efforts to protect them, according to Natan Sharansky, the head of the Jewish Agency for Israel.\nSharansky’s remarks, reported by JTA, came after a meeting in Paris of the Jewish Agency’s board of governors last week. The board chose to hold the meeting in the French capital as a show of solidarity with the country’s Jews, who have suffered numerous anti-Semitic attacks – including terror attacks – in recent years.\nIn his letter, Sharansky denied reports that said he had written France off as a viable country for Jews to live in.\n“I am neither a commissar of Zionism nor a modern-day prophet, and it is important that our conversation on this subject be based on the facts, rather than on hollow pronouncements,” Sharansky wrote.\n“For several years now, I have been speaking and writing about the question mark that hovers over the future of the French Jewish community and of Jewish communities elsewhere in Europe. The issue is complex, and I have always been careful to state that it is best represented by a question mark,” he added.\nThe past two years has seen Israel welcome a record 15,000 immigrants from France, making it the country with the largest number of newcomers. Sharansky said the record numbers were due to a number of elements, including France’s anti-Semitism problem, its flailing economy, and the strong bond French Jews have with Israel.\nSharansky praised the French government for making “sincere and laudable efforts to protect Jews, to strengthen the relationship between government authorities and the Jewish community, and to implement strong legislation against anti-Semitism.” He added that France’s efforts exceed “any other European government [efforts] to reassure the country’s Jewish citizens.”\nHowever, the issue “far exceeds amelioration by one measure or another, and it cannot be solved by sending more soldiers to protect Jewish kindergartens,” he also said.\nCiting a survey commissioned by the Fondation Jean-Jaurès, a think tank with close ties to France’s ruling Socialist Party, Sharansky wrote that 51 percent of French Jews polled have considered immigration overseas with 43 percent considering immigration to Israel.\nInsecurity on the part of French Jews is because of a “changing demographic reality in France and the influx of large populations that do not necessarily share the French republic’s democratic values and are susceptible to anti-Semitism,” Sharansky wrote.\n“Another factor is that ‘liberal France,’ which Jews have always considered to be their home, is today infected by a sense of hostility and double standards toward Israel,” he added.\n“[The Jewish Agency’s] job is clear: To serve every French Jew who wishes to make aliyah” while “working to ensure that those Jews who wish to remain in France feel deeply connected to their community, their heritage, and the State of Israel.”","url":"https://www.breitbart.com/middle-east/2016/07/07/jewish-agency-chief-french-jews-insecure-despite-govts-best-efforts-protect/"}
