{"authors":["Deborah Danan"],"date_download":"2018-10-30 19:40:33","date_modify":"2018-10-30 19:40:33","date_publish":"2017-04-23 14:47:32","description":"A U.S. Jewish human rights NGO has praised Pres. Trump for taking the Iranian threat against the Jews and the Jewish state seriously.","filename":"data/vaneerConsumption/JewishGroupPraisesTrumpAdministrationForStrongStandAgainstIran.json","image_url":"https://media.breitbart.com/media/2017/04/Screen-Shot-2017-04-12-at-3.05.35-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_04_23__1540928433.html","title":"Jewish Group Praises Trump Administration For 'Strong Stand' Against Iran","title_page":"Jewish Group Praises Trump Administration For 'Strong Stand' Against Iran","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – On the eve of Israel’s Holocaust Remembrance Day, a U.S. Jewish human rights NGO has praised the Trump administration for taking the Iranian threat against the Jews and the Jewish state seriously as opposed to the Obama administration, which based its policy on “wishful thinking.”\n“The Jewish people have learned the brutal lesson from the Nazi Holocaust, that when a leader threatens you with genocide you take such threats seriously,” Rabbis Marvin Hier and Abraham Cooper — the dean and associate dean of the Simon Wiesenthal Center — said in a statement. “The world, including many Jewish leaders, dismissed Hitler’s early threats against the Jewish people as bombast. The scope of death and destruction of WWII and the unspeakable horrors of the Shoah have taught us to never again dismiss such threats as empty rhetoric.”\n“Unfortunately, the previous administration believed that it could moderate the mullah’s actions and words through negotiation and perks. We are grateful that the Trump administration is basing its policies on Iranian behavior, not wishful thinking,” they added.\nAt a State Department press conference on Wednesday, Secretary of State Rex Tillerson said, “Iran’s provocative actions threaten the United States, the region, and the world. … The Trump administration is currently conducting a comprehensive review of our Iran policy. Once we have finalized our conclusions, we will meet the challenges Iran poses with clarity and conviction.”\nThe Obama-led nuclear deal signed by Iran and six world powers, Tillerson stated, “fails to achieve the objective of a non-nuclear Iran; it only delays their goal of becoming a nuclear state. This deal represents the same failed approach of the past that brought us to the current imminent threat we face from North Korea. The Trump administration has no intention of passing the buck to a future administration on Iran.”\nWatch a video of Tillerson’s remarks below:","url":"https://www.breitbart.com/middle-east/2017/04/23/jewish-group-praises-trump-administration-for-strong-stand-against-iran/"}
