{"authors":["Deborah Danan"],"date_download":"2018-10-30 18:59:18","date_modify":"2018-10-30 18:59:18","date_publish":"2015-12-31 11:23:37","description":"A BBC Radio phone-in show gave an anti-Semitic Londoner 13 minutes of airtime to air his views on the topic of Jewish world domination","filename":"data/vaneerConsumption/JewsControlWorldCorporateAmericaMedia.json","image_url":"https://media.breitbart.com/media/2015/08/BBC-Getty.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_12_31__1540925958.html","title":"'Jews Control World, Corporate America, Media'","title_page":"LISTEN: BBC Radio Gives Caller 13 Minutes to Rant: 'Jews Control World, Corporate America, Media'","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – A BBC Radio phone-in show gave an anti-Semitic Londoner 13 minutes of airtime to air his views on the topic of Jewish world domination. You can hear the exchange below:\nThe caller claimed that the world is “dominated by the Jews’ system” who “control the money, the money, finance,” and further added that “80% of corporate America, of the media, is owned by Jews. And they’re Zionist Jews. We are ruled by Zionist Jews.”\n“They are trying to control us more and more and more. They want to put a chip up our backsides, a ring through our noses, and a vizor for our horizons… the elite… the Rothschilds,” he added.\nThe caller also alleged that so-called Zionist Jews also owned the Bank of England and the Federal Reserve.\nFinally, he took discussion of the Holocaust to task, stating, “We keep going on about the Jews… mainstream media, they keep banging on about the Jews and the Holocaust… we keep going on about six million Jews.”\nMost of the caller’s comments were not disputed by the presenter, Simon Lederman, who also admitted on air that he granted the caller more airtime than he usually allows for phone-ins.\nAt one point Lederman himself called into question Israel’s right to exist saying, “Clearly there is a debate about whether Israel in its current form should be where it is, whether the rights of the Palestinians have been outweighed by the rights of the Israelis.”\nPro-Israel website Israellycool noted, “What’s shocking is not that people think this way, it’s that in today’s Britain they not only have no trouble expressing themselves, the BBC has no trouble devoting large amounts of air time to this.”","url":"https://www.breitbart.com/the-media/2015/12/31/listen-bbc-radio-gives-caller-13-minutes-rant-jews-control-world-corporate-america-media/"}
