{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 21:15:57","date_modify":"2018-10-30 21:15:57","date_publish":"2014-07-28 21:03:58","description":"Over one thousand French Jews have left France for Israel during a ten-day time span in mid-July, leaving their livelihoods behind for the hopes of a safer tomorrow.","filename":"data/vaneerConsumption/JewsContinuetoLeaveFranceforIsraelinRecordNumbers.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Peace/2014/Europe/France/jews-paris-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2014_07_28__1540934157.html","title":"Jews Continue to Leave France for Israel in Record Numbers","title_page":"Jews Continue to Leave France for Israel in Record Numbers | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Over one thousand French Jews have left France for Israel during a ten-day time span in mid-July, leaving their livelihoods behind for the hopes of a safer tomorrow.\nMultiple pro-Palestinian riots have occurred in the past weeks to protest Israel’s response to indiscriminate rocket fire originating from Muslim Brotherhood jihadist group Hamas in Gaza. The riots have consistently devolved into an anti-Semitic anarchic frenzy. Last week, reporters heard chants of “Gas the Jews” and “Kill the Jews” as thousands attacked Jewish businesses in Kristallnacht-like fashion. Posters were seen stating, “Come equipped with hammers, fire extinguishers, and batons.”\nThe horrific treatment of Jews in France is not simply a result of Israel’s Operation Protective Edge into Gaza. In June, as tensions were relatively calm in the ongoing Israel-Palestinian conflict, Jews were forced to flee France in droves. Citing Islamic anti-Semitism and extreme xenophobic biases, thousands of Jews packed up and left for Israel. Aliyah (emigration) from France is expected to surpass that from the U.S in 2014.\nAccording to the French government, in the first quarter of 2014, 169 separate anti-Semitic incidents were recorded. The first three months of 2014 saw a dramatic 40-percent increase in anti-Semitic incidents over 2013.\nIn May, two Jewish teens were viciously beaten on their way to a synagogue in France. That same month in Toulouse, dozens of anti-Semitic inscriptions were found bearing the words, “SS,” “Hitler burned 6 million Jews and forgot half,” and “Long live Palestine.”\nFrance is home to Europe’s largest Jewish and Muslim populations and has roughly 500,000 Jews and approximately five millions Muslims.","url":"https://www.breitbart.com/national-security/2014/07/28/jews-continue-to-leave-france-for-israel-in-record-numbers/"}
