{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 19:37:32","date_modify":"2018-10-30 19:37:32","date_publish":"2016-01-15 10:31:48","description":"In an early morning ambush, Islamic terrorists of the radical al-Shabaab group attacked an African Union military base in southern Somalia Friday.","filename":"data/vaneerConsumption/JihadistsMassacre60inCarBombAttackTakeOverSomaliMilitaryBase.json","image_url":"https://media.breitbart.com/media/2015/12/ISIS-Somalia-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_01_15__1540928252.html","title":"Jihadists Massacre 60 in Car Bomb Attack, Take Over Somali Military Base","title_page":"Jihadists Massacre 60 in Car Bomb Attack, Take Over Somali Military Base | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In an early morning ambush, Islamic terrorists of the radical al-Shabaab group attacked an African Union military base in southern Somalia Friday, breaching the walls by exploding a car bomb and overrunning the base.\nAccording to the officials of the Somali army, the blast demolished the entrance to the military base in in the town of El-Ade, Somalia, slaughtering dozens of Kenyan soldiers and allowing heavily armed jihadist militants to storm the base.\nThe African Union base is operated by Kenyan peacekeeping forces and is located about 340 miles west of Mogadishu, near the Somali border with Kenya.\nThe latest official statement issued by al-Shabaab military operations spokesman Sheikh Abdiasis Abu Musab claims that 61 Kenyan soldiers have been killed, and that the base and the nearby town of Ceel Cado are now in the hands of the Islamists.\n“Our fighters went in and after a heavy exchange of gunfire we took over the base,” Musab said, and residents have reported sporadic gunfire inside the military compound.\nThe jihadists also claim to have seized large number of weapons and vehicles at the military base.\nThe troops of the African Union number around 22 thousand soldiers in total from various African nations. This is not the first time the peacekeeping force has found itself the target of the Islamist terrorists.\nBorn as an offshoot from the Islamic Courts Union (ICU), the al-Shabaab group, which in Arabic means “youth,” has been seeking to overthrow the Western-backed Somalian government and impose a strict form of Islamic sharia law.\nThe group has been responsible for a number of deadly attacks in Kenya, such as the raid on Garissa University in April of last year that killed 148 mostly Christian students, presumably in opposition to the country’s participation in an African Union peacekeeping force in Somalia.\nSince February 2012 al-Shabaab has been affiliated with al-Qaeda, though it has been insistently courted by the Islamic State. In October, a portion of its fighters pledged allegiance to the Islamic State, resulting in tensions within the group.\nOusted from control of the Somali capital of Mogadishu in mid-2011, the terrorist group took over vast rural areas of Somalia from which it launches guerrilla warfare and suicide bombings, both in Somalia and in Kenya.\nFollow Thomas D. Williams on Twitter @tdwilliamsrome","url":"https://www.breitbart.com/national-security/2016/01/15/jihadists-massacre-60-in-car-bomb-attack-take-over-somali-military-base/"}
