{"authors":[],"date_download":"2018-10-30 14:29:24","date_modify":"2018-10-30 14:29:24","date_publish":"2015-07-28 00:00:00","description":null,"filename":"data/vaneerConsumption/JihadiJohnisSmarterthantheAverageLiberal.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_07_jihadi_john_is_smarter_than_the_average_liberal_comments_1540909764.html","title":"Jihadi John is Smarter than the Average Liberal","title_page":"Articles: Jihadi John is Smarter than the Average Liberal","title_rss":"NULL","source_domain":"americanthinker.com","text":"Who would have thought that the notorious ISIS remover of heads, the man behind the ski mask, Jihadi John, would prove to be smarter than the average liberal? Remember John? He’s the guy who struck fear in the hearts of the world when he was pictured on video carving off the heads of ISIS prisoners/journalists and aid workers like James Foley and Steven Sotloff, David Haines, Alan Henning, and Peter Kassig. Clad entirely in black from head to toe, Mohammed Emwazi, aka Jihadi John, would stand in the hot desert sun beside kneeling victims dressed in outfits similar to Hillary Clinton’s infamous Home Depot orange pants suit. Head cocked to the side, knife in hand gesturing and pointing at the camera, Jihadi John would calmly speak perfect English with a distinct British accent and then would patiently wait until his victims were done spewing a forced propaganda spiel. Then, with the cameras rolling, John would saw off their heads. Now, British and American... (Read Full Article)","url":"https://www.americanthinker.com/articles/2015/07/jihadi_john_is_smarter_than_the_average_liberal_comments.html"}
 the Islamic state, worries his own head will be removed and he is running for his life. Apparently the publicity he’s gotten has made Jihadi John quake in his Ninja boots, fearful that the militant ISIS murderers are done with him and will kill him and bury his headless body in a mass grave.\nSounds like liberalism: use up supporters and then visit upon those useful idiots the very terrorism they endorsed.\nPrior to mastering Butchery 101, Mr. Emwazi was a student at the University of Westminster studying information systems and business management. Then Emwazi was radicalized and became the masked face of ISIS terror. Now, to avoid suffering a fate similar to the ones he inflicted on others, Jihadi John is somewhere in Syria hiding from both the good and bad guys both of whom are searching for him across the Middle East.\nSo why is Jihadi John smarter than the average liberal?\nAs a group, liberals believe that their support for progressive policies such as ObamaCare, climate change, the right to choose and so on somehow exempts them from the blight liberalism creates when those policies are implemented.\nLiberals rally around high taxes but hate paying them; they applaud ObamaCare, but will be the first ones to whine when they’re denied health care services or evaluated by a death panel. Liberals love Obama’s plan to forcibly integrate neighborhoods, as long as it’s not theirs; they’ll march on behalf of illegal immigration until someone they love is killed by a drunk illegal driving without a license, and they will champion an Iran deal until Iran gets the bomb, at which point they’ll be found quaking and quivering in a renovated bomb shelter somewhere.\nIn other words, like Jihadi John, liberals can dish it out but they can’t take it.\nNever realizing that the end result will involve the devaluing and maybe even the loss of their own life, liberals decry the so-called racial profiling of potential terrorists, defend the right to choose abortion and, of late, even justify selling the organs of aborted babies. Then when terrorism threatens their life, or in the future an Obama organ collector suggests that to promote fairness liberals should volunteer a spare kidney to one who has none, the liberals who rallied for organ sharing will be the first to protest.\nSomewhere inside their hollow, empty souls, liberals like to inflict, but hate to be inflicted upon.\nThose on the left like to force others to give, never thinking that the implication of compulsory giving will also affect their own lives. Liberals are ardent supporters of government, but seem to think supporting the government edicts being imposed on the masses somehow exempts them from the negative impact of what they’re helping to promote.\nIn other words, liberals are the Jihadi Johns of a government version of ISIS: they believe they can support what progressivism imposes on America and never become a victim of those oppressive policies themselves.\nLiberals believe they can lop off heads and keep their own -- but they’re wrong, and the real Jihadi John was wise enough to recognize it. That’s why he’s smarter than the average liberal: Jihadi John hightailed it into the desert and is currently on the run somewhere trying desperately to keep his head.\nJeannie hosts a blog at www.jeannie-ology.com","url":"https://www.americanthinker.com/articles/2015/07/jihadi_john_is_smarter_than_the_average_liberal.html"}
