{"authors":["Australian Associated Press"],"date_download":"2018-10-23 05:23:26","date_modify":"2018-10-23 05:23:26","date_publish":"2017-04-26 16:51:54","description":"Broke Islamic State Jihadi Mohammad Ali Baryalei begged his friend Omarjan Azari to send money to the Middle East, a Sydney court has heard.","filename":"data/vaneerConsumption/JihadiMohammadAliBaryaleiaskedOmarjanAzariformoney.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA04A1C00000578-0-image-a-7_1493217844768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448094_Jihadi-Mohammad-Ali-Baryalei-asked-Omarjan-Azari-money_1540272206.html","title":"Jihadi Mohammad Ali Baryalei asked Omarjan Azari for money","title_page":"Jihadi Mohammad Ali Baryalei asked Omarjan Azari for money | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When an overseas Islamic State member called Omarjan Azari about a money transfer in 2014, the Sydney man was dealing with 'a bit of turmoil,' a court has heard.\nA mate he previously relied on to help transfer the money had been approached by ASIO and things were getting 'heated up', Azari allegedly said during a phone conversation with Mohammad Ali Baryalei.\n'Every brother I ask, yeah, like they refuse. They didn't want to do it,' he said.\nBut Azari insisted he would find someone and 'worst case scenario I'll probably just use a woman to do it'.\nScroll down for video\nBroke Islamic State Jihadi Mohammad Ali Baryalei (pictured) begged his friend Omarjan Azari to send money to the Middle East, a Sydney court has heard\nAzari (pictured) allegedly told Baryalei he had trouble finding someone to transfer the money because they have been approached by ASIO\nAlmost three years later, 24-year-old Azari is on trial in the NSW Supreme Court on terror charges and Baryalei, who left Australia in 2013, is believed to be dead.\nAzari pleaded guilty on Monday to making funds available to a terrorist organisation, but has pleaded not guilty to another charge of doing an act to prepare or plan for a terrorist act.\nThe jury on Wednesday heard recordings of 2014 phone conversations in Arabic, Dari and English allegedly involving Afghan-born Azari.\nIn one, Baryalei told Azari about three 'brothers' who were going to 'do a martyrdom operation', and Azari spoke about an acquaintance who was 'involved in something big in the airport', according to a translated transcript.\n'He said apparently that he's moving to the place where they - they're gonna attack the airport,' he said.\nThe Crown is alleging that in another phone conversation with Baryalei, Azari prepared or planned for a terrorist act.\nAlmost three years later, 24-year-old Azari (right) is on trial in the NSW Supreme Court on terror charges and Baryalei, who left Australia in 2013, is believed to be dead\nThe jury heard on Monday that Baryalei (pictured) told Azari to 'terminate' at least five people a month, including a 'random unbeliever'\nThe jury heard on Monday that Baryalei told Azari to 'terminate' at least five people a month, including a 'random unbeliever.'\nBaryalei said backpackers would make good targets because it would attract worldwide media attention, the court heard.\nBut defence barrister John Stratton SC said Azari, who had two relatives in Syria under the authority of Baryalei, was trying to find a way to abandon the plan and never agreed to it.\n'What the accused was attempting to do was to find excuses to put off Mr Baryalei,' Mr Stratton said during his opening address.\nThe trial continues.","url":"https://www.dailymail.co.uk/news/article-4448094/Jihadi-Mohammad-Ali-Baryalei-asked-Omarjan-Azari-money.html"}
