{"authors":["Matt Maltfor Mailonline"],"date_download":"2018-10-23 05:12:22","date_modify":"2018-10-23 05:12:22","date_publish":"2016-01-11 18:20:20","description":"Jill Ellis collected the FIFA Women's World Coach of the Year award at the Ballon d'Or 2015 ceremony after enjoying a stellar year with the USA.","filename":"data/vaneerConsumption/JillElliswinsFIFAWomensWorldCoachoftheYearatBallondOr2015.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300DA12800000578-0-image-a-11_1452536313540.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3394371_Jill-Ellis-scoops-FIFA-Women-s-World-Coach-Year-Ballon-d-2015-ceremony_1540271542.html","title":"Jill Ellis wins FIFA Women's World Coach of the Year at Ballon d'Or 2015","title_page":"Jill Ellis wins FIFA Women's World Coach of the Year at Ballon d'Or 2015 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jill Ellis collected the FIFA Women's World Coach of the Year award at the Ballon d'Or 2015 ceremony after enjoying a stellar year with the USA.\nThe 49-year-old beat England's Mark Sampson and Japan's Norio Sasaki to the award after leading the USA women's team to World Cup glory in Canada last year.\nAfter collecting the award in Switzerland, she said: 'Let me congratulate all the nominees here today, first.\nJill Ellis collected the FIFA Women's World Coach of the Year at the Ballon d'Or 2015 ceremony in Switzerland\nEllis beat Mark Sampson and Norio Sasaki to award after leading the USA women's team to World Cup glory\nEngland coach Sampson (centre) and Japan's Sasaki (left) were present but Ellis scooped the award\nEllis was congratulated on social media, with FIFA taking to their Twitter account to post the picture above\n'My award is for everyone connected with me - from the players, staff and everyone with USA football. This award is a team effort.'\nEllis had to wait for her opportunity to take charge of the USA women's team on a full-time basis but when it came her way, she certainly took it.\nHanded the reins in 2014, Ellis then led the team to their third FIFA Women's World Cup title in Canada last year.\nA 5-2 victory over Japan in the final, where Carli Lloyd scored an incredible 13-minute hat-trick, capped off a memorable tournament.\nAnd Lloyd was rewarded for her exploits last year as she collected the FIFA Women's World Player of the Year award at the Ballon d'Or 2015 ceremony.\nThe 33-year-old, who was emotional when collecting her trophy, beat Aya Miyama of Japan and Germany's Celia Sasic to the award.\nShe thanked coach Ellis after collecting her award: 'Wow. It really is an honour. It's been a dream of mine. I want to thank everyone that voted for me and everyone at US Soccer for their support.\n'I want to thank Jill [Ellis] and her coaching staff. I want to thank my incredible team-mates as we all know it took 23 players to win the World Cup.'\nJill Ellis led the USA women's team to their third FIFA Women's World Cup title in Canada last year\nA 5-2 win over Japan in the final, where Carli Lloyd scored an incredible 13-minute hat-trick, ensured they won\nCarli Lloyd collected the FIFA Women's World Player of the Year award at the Ballon d'Or 2015 ceremony","url":"https://www.dailymail.co.uk/sport/football/article-3394371/Jill-Ellis-scoops-FIFA-Women-s-World-Coach-Year-Ballon-d-2015-ceremony.html"}
