{"authors":["Alexander Robertson For Mailonline"],"date_download":"2018-10-23 02:24:16","date_modify":"2018-10-23 02:24:16","date_publish":"2017-03-10 11:33:14","description":"Craig Holden, from Newport, Gwent, wants rid of the ring (pictured) after his romance hit the rocks. He warned potential buyers that he couldn't 'guarantee it's safe to be worn by those of faith.'","filename":"data/vaneerConsumption/Jiltedmanputs1000engagementringonGumtreefor200.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E22882400000578-0-image-a-15_1489145419660.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300768_Jilted-man-puts-1-000-engagement-ring-Gumtree-200_1540261456.html","title":"Jilted man puts £1,000 engagement ring on Gumtree for £200","title_page":"Jilted man puts £1,000 engagement ring on Gumtree for £200 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A scorned lover has put his ex-fiancee's £1,000 engagement ring up for sale for just £200 - with a warning that it was worn by 'Satan herself'.\nCraig Holden, 28, wants rid of the glittering diamond ring after his romance hit the rocks.\nJilted Craig said he popped the question to his girlfriend after three years together but their relationship took a turn for the worse.\nThe scientist paid almost £1,000 for the diamond ring but is willing to cut his losses and has put it up for sale for just £200.\nA scorned lover has put his ex-fiancee's £1,000 engagement ring up for sale for just £200 - with a warning that it was worn by 'Satan herself'\nThe scientist paid almost £1,000 for the diamond ring but is willing to cut his losses and has put it up for sale for just £200\nCraig said his relationship ended before he and his ex had made any wedding plans.\nAnd the joker, from Newport, Gwent, blamed 'witchcraft or voodoo' for his doomed romance as he tries to sell the ring online on Gumtree.\nIn an advert, Craig wrote: 'As a simple, quiet, reserved and generous gentleman I began courting a young lady (who would then spawn into Satan, through witchcraft or voodoo - who knew?).\nJilted Craig said he popped the question to his girlfriend after three years together but their relationship took a turn for the worse\n'I then regrettably proposed after seeing her for three years.\n'Everything was fine, we were young everything was fine, then it began, the rage, it boiled, her eyes glazed over and her head span 360 degrees on a daily basis and she spewed venomous insults toward my aching heart.'\nHe added: 'Disclaimer - although worn by Satan herself it does not possess any magical powers or any black magic.\n'Cannot guarantee it's 100 per cent safe to be worn by those of faith.'\nSpeaking after posting the ad, Craig said he wanted to warn potential buyers the ring could be 'back luck'.\nHe said: 'I've always had a relaxed attitude and my humour knows no bounds.\n'As a warning to a potential buyer, I figured I'd give a backstory as buying a second hand engagement ring could be see as bad luck to many.\n'It's almost like buying a haunted doll.'","url":"https://www.dailymail.co.uk/news/article-4300768/Jilted-man-puts-1-000-engagement-ring-Gumtree-200.html"}
