{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-22 23:21:00","date_modify":"2018-10-22 23:21:00","date_publish":"2016-01-11 05:21:34","description":"Jim Carrey made his first public appearance at Sunday night's Golden Globes since the death of his on/off girlfriend Cathriona White four months ago.","filename":"data/vaneerConsumption/JimCarreyhastheGoldenGlobeAwards2016audiencecrackingup.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/3004E0C100000578-0-image-a-9_1452487687097.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393379_Jim-Carrey-Golden-Globe-audience-cracking-makes-public-appearance-death-girlfriend_1540250460.html","title":"Jim Carrey has the Golden Globe Awards 2016 audience cracking up","title_page":"Jim Carrey has the Golden Globe Awards 2016 audience cracking up | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jim Carrey made his first public appearance at Sunday night's Golden Globes since the death of his on/off girlfriend Cathriona White four months ago.\nAnd he had the audience in stitches while presenting the award for Best Musical or Comedy.\nAfter being introduced as 'two-time Golden Globe winner Jim Carrey', the 53-year-old seemed tickled by the title, and appeared to improvise his entire speech to the delight of the crowd.\nScroll down for video\nHe's back: Jim Carrey had the Golden Globe audience cracking up on Sunday night as he made his first public appearance since death of his on/off girlfriend four months ago.\n'Thank you, I am two-time Golden Globe winner, Jim Carrey,' he smiled behind an impressively bushy full beard.\n'You know, when I go to sleep at night, I'm not just a guy going to sleep. I'm two-time Golden Globe winner Jim Carrey going to get some well-needed shut-eye,' he continued as the audience cracked up.\n'When I dream I don't just dream any old dream. I dream about being three-time Golden Globe actor Jim Carrey. Because then I would be enough,' he said, pausing dramatically. 'It would finally be true, and I could stop this terrible search, for what I know ultimately won’t fulfill me.\nSee our full Golden Globes coverage on the winners and highlights of the night\nOn form: After being introduced as 'two-time Golden Globe winner Jim Carrey', the 53-year-old seemed tickled by the title, and appeared to improvise his entire speech to the delight of the crowd\n'But these are important these awards - I don’t want you just think that just because if you blew up the solar system, you wouldn’t be able to find us or any of our solar system from the naked eye. But for us, this is huge.'\nAlthough the orchestra is primed to play off acceptance speeches that drone on too long, they clearly weren't prepared for a rambling introduction - meaning The Grinch star could get away with as much mic time as he pleased.\nWhen he finally read the winner, he was indeed stunned, which essentially gave away the surprise, as there was only one nominee which had courted controversy by including itself in the comedy category.\nOwned it: Although the orchestra is primed to play off acceptance speeches that drone on too long, they clearly weren't prepared for a rambling introduction - meaning The Grinch star could get away with as much mic time as he pleased\n'Wow. You know once I say this, it can’t be unsaid,' he warned the audience. 'You can’t not know who the winner is after I say it'.... before unveiling Matt Damon and Ridley Scott's very-good-but-not-very-funny The Martian as the Best Comedy Or Musical.\nCarrey himself has been nominated for six Golden Globes in total, and is among the few who have won the Best Actor awards in both Drama and Comedy categories, scooping them back to back in 1998 for The Truman Show and 1999 for Man On The Moon.\nAlthough he had been expected to walk the red carpet before the event, Carrey didn't show up on screen until his presenting slot, which became his first appearance since the funeral of his 30-year-old on/off Irish girlfriend in October.\nThe Make-up artist committed suicide by suspected drug overdose, leaving a note which read: 'Jim, I love you. Please forgive me. I'm not for this world.'\nThe actor traveled to her native Tipperary to bury her in the following days, and had not been seen in the public eye since.\nTragic: Although he had been expected to walk the red carpet before the event, Carrey didn't show up on screen until his presenting slot, which became his first appearance since the funeral of his 30-year-old on/off Irish girlfriend Cathriona White in October","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393379/Jim-Carrey-Golden-Globe-audience-cracking-makes-public-appearance-death-girlfriend.html"}
