{"authors":["Sophy Ziss"],"date_download":"2018-10-31 01:51:54","date_modify":"2018-10-31 01:51:54","date_publish":"2018-09-13 21:26:47","description":"Jimmy Cooper wasn't a great television dad. In fact, actor Tate Donavan said he thinks The OC's Jimmy Cooper was the worst TV dad — maybe ever. And yet, even though he was a bad father, the actor behind the role still says he hated leaving the part…","filename":"data/vaneerConsumption/JimmyCooperOfTheOCWasTheWorstTVDadEverAccordingToActorTateDonavan.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/13/430c64be-897a-41b7-aba1-a782ee3bda9e-getty-840311734.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_jimmy-cooper-of-the-oc-was-the-worst-tv-dad-ever-according-to-actor-tate-donavan-11908838_1540950714.html","title":"Jimmy Cooper Of 'The O.C.' Was The Worst TV Dad Ever, According To Actor Tate Donavan","title_page":"Jimmy Cooper Of 'The O.C.' Was The Worst TV Dad Ever, According To Actor Tate Donavan","title_rss":"NULL","source_domain":"bustle.com","text":"Jimmy Cooper wasn't a great television dad. In fact, actor Tate Donavan said he thinks The OC's Jimmy Cooper was the worst TV dad — maybe ever. And yet, even though he was a bad father, the actor behind the role still says he hated leaving the part behind. In a recent interview with Us Weekly, Donavan revealed that he still wishes — even now — that he'd had a chance to return to the hit series. At the very least, he wanted to give the late Marissa the sendoff he felt actor Mischa Barton deserved.\nDonovan caught up with Us Weekly on September 13, and detailed for the magazine exactly what happened during his abbreviated tenure on the show. Spoiler alert: He wanted more for Jimmy Cooper. Not just for the sake of a more fulfilling acting role, but because everyone gave him grief IRL for Jimmy's terrible parenting. The actor revealed to Us Weekly that he first received the news of his departure \"in a phone call\":\n\"We were about to do some press for the next season, and I got a phone call from the producers, and said, ‘Hey, we’re gonna phase your character out.’ I was bummed. I was gutted! I wanted to be around more. I didn’t want to leave at all.”\nStill, Donovan realized, “I was like the worst dad in television history. I mean, I was a horrible dad\". And not just because of his character's money-laundering scheme, either — though the actor was quick to acknowledge that as well.\nDave Kotinsky/Getty Images Entertainment/Getty Images\nApparently, Donovan's sister put the most pressure on him to get Jimmy to change. \"My sister at the time had three teenagers,\" he explained, \"And she kept calling me week after week!\" As he recalled, she was incensed:\n\"[She'd say] 'You are the worst father I’ve ever seen in my life. I mean, they just left Marissa drunk on your doorstep. Are you’re not upset? Are you not waiting for your daughter to bring her in, and yell at those kids? I mean, what kind of father are you?'\"\nSurprisingly, though, Donovan listened. The way he remembers it, he'd approach the producers and announce \"Hey, you know, this dad is terrible,\" but they'd push back, insisting, \"No, no. Jimmy is great. He’s a great dad\". Obviously, he wasn't, but that didn't mean Donovan wanted to leave the show as early as he did. \"I wanted to be more involved in my kid’s life [on TV], but they shipped me off to Hawaii!\" he told Us Weekly. \"I left the show, and my speech was like, ‘I’m gonna go to Hawaii. I’m gonna sail to Hawaii because I want to be a better dad.’ I mean, what dad becomes better [like that]?\"\nIt's a fair point! And again, it's not like Donovan was upset with Jimmy; he just wished he'd had the opportunity to help his character turn things around. While he was optimistic about Jimmy's chances at the time, that doesn't mean he's not a realist about the character now.\nBryan Bedder/Getty Images Entertainment/Getty Images\nDonovan doesn't have high hopes for what Jimmy might be like today. When asked about where the absentee father might be in 2018, the actor didn't mince words:\n\"Oh, let’s see. Jimmy is an alcoholic. He’s lost everything. Watching Fox News, that’s basically, that’s what Jimmy is. He’s definitely kind of a pathetic case. He lives in Orange County. He’s a tragic figure, for sure. And he just sort of doesn’t have a lot of friends. He got kicked out of the country club, and is drinking a lot\".\nKind of a grim picture, but hey, The O.C. totally had a dark streak. Also, this isn't the first blast from the past the actor has had in 2018. Early in September, he reflected — also to Us Weekly — about what it was like to shoot his arc on Friends with recent ex-partner Jennifer Aniston. Shout-out to Donovan for realizing that of all the years to go on a nostalgia-fueled press tour, this was the one TV fans definitely needed it most.","url":"https://www.bustle.com/p/jimmy-cooper-of-the-oc-was-the-worst-tv-dad-ever-according-to-actor-tate-donavan-11908838"}
