{"authors":["Nicole Pomarico"],"date_download":"2018-10-31 01:49:25","date_modify":"2018-10-31 01:49:25","date_publish":"2018-09-06 13:24:14","description":"It's only been a few days since ABC announced that Colton Underwood is the next Bachelor, but it seems like he's already preparing for the gig — or, at least, a certain late-night host is doing all the work for him. On Wednesday night's episode of…","filename":"data/vaneerConsumption/JimmyKimmelGaveColtonFromTheBachelorTheSexTalkButCanWeMoveOnNowVIDEO.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/f6ce702a-5329-45a3-a41d-c08866b733a3-150226_ds2_9805.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_jimmy-kimmel-gave-colton-from-the-bachelor-the-sex-talk-but-can-we-move-on-now-video-11771150_1540950565.html","title":"Jimmy Kimmel Gave Colton From 'The Bachelor' The Sex Talk, But Can We Move On Now? - VIDEO","title_page":"Jimmy Kimmel Gave Colton From 'The Bachelor' The Sex Talk, But Can We Move On Now? — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"It's only been a few days since ABC announced that Colton Underwood is the next Bachelor, but it seems like he's already preparing for the gig — or, at least, a certain late-night host is doing all the work for him. On Wednesday night's episode of Jimmy Kimmel Live!, Jimmy Kimmel gave Colton the sex talk, and hopefully, this isn't a sign of things to come, because after The Bachelor and Bachelor in Paradise, it's time to move on from all the virgin talk.\nTo Kimmel's credit, the way he explained the birds and the bees was hilarious — and watching Colton's face during the segment, it was clear that he felt the same way about it. Kimmel sat him down next to an easel with anatomically correct drawings of the male and female reproductive systems and attempted to explain to him how things work.\nMost of us have probably experienced this talk before, either from our parents or from the horribly awkward sex ed classes at school (or both), and even if that applies to Colton too, Kimmel's version is far more entertaining. And most importantly, Colton doesn't seem the least bit offended that this is happening on national television.\nJimmy Kimmel Live on YouTube\nAt first, Kimmel asked if he'd ever had the sex talk, to which Colton said that he hadn't, and then he asked if he knew where babies come from.\n\"You know, I think, when a man loves a woman, they go into the bedroom,\" Colton said, before Kimmel interrupted, saying, \"It doesn't have to be the bedroom. It could be a car, or an elevator, or a fantasy suite. My wife's parents conceived her on the kitchen table.\"\nThen, Kimmel went on to attempt to explain how sex works — along with his visual aids — all up until the point where the egg and sperm meet to create a \"baby omelette.\" And from there, he tried to prepare Colton for what could happen in the fantasy suite, just so he'd know, and quizzed him on what he'd just learned from their session.\nYes, this segment is pretty funny, and it's a lighthearted approach to a private part of Colton's life that's made its way into the spotlight since he competed on The Bachelorette. But who Colton chooses to have sex with (or not) is none of anyone's business, and besides, aren't more interesting parts of our new Bachelor's life that everyone should be focusing on right now?\nABC/Paul Hebert\nIn the beginning of the segment, Colton explained why waiting to have sex is so important to him when Kimmel asked him if he's waiting for marriage, and his explanation has stayed the same as the one he had to give during his time on The Bachelorette. \"I'm just waiting for the right person, the right heart, I don't know — I just hold a lot of value in that,\" he said.\nObviously, this topic means a lot to Colton, so that makes it even less OK to force the issue. He's stated his decision and what it means to him, and what happens next isn't up to anyone but him. Hopefully, The Bachelor will focus more on Colton's journey to love than whether or not he has sex, but we won't know until January. Continuing to talk about Colton's virginity is boring, but seeing him meet the right person is not.","url":"https://www.bustle.com/p/jimmy-kimmel-gave-colton-from-the-bachelor-the-sex-talk-but-can-we-move-on-now-video-11771150"}
