{"authors":["Matt Jones"],"date_download":"2018-10-30 14:37:41","date_modify":"2018-10-30 14:37:41","date_publish":"2016-11-07 00:00:00","description":"Dykes said he supports his players’ rights to express themselves, but he said he thinks people should stand during the anthem.","filename":"data/vaneerConsumption/JimmyDykeswontsaywhetherprotestwillcontinue.json","image_url":"https://media.arkansasonline.com/img/photos/2016/11/07/jimmy_dykes_003_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_nov_07_jimmy-dyke_7fd4abdfe1af1aa75b00a81414407c64__page=3_1540910261.html","title":"Jimmy Dykes won't say whether protest will continue","title_page":"Jimmy Dykes won't say whether protest will continue","title_rss":"NULL","source_domain":"arkansasonline.com","text":" Arkansas women’s basketball coach Jimmy Dykes could not say Monday whether players on his team would continue to kneel during the pregame playing of the national anthem.\n“Like everything else in our program, that’s day to day,” Dykes said at his team’s monthly fan luncheon at Mermaid’s in Fayetteville.\nDykes said he supports his players’ rights to express themselves, but he said he thinks people should stand during the anthem.\n“Anyone who has ever been around me and knows me, they know that about me,” Dykes said. “That is very, very important to me and several of you who are here today.\n“Our young ladies, their intent was to have a platform where they could talk about the issues they want to talk about. It was not in any shape or form to disrespect the military.”\nDykes, who got a standing ovation before he spoke, took some questions from the audience of about 100 but not from the media after the event.\nDykes said he has felt a “tremendous of amount of support” since last Thursday when Jordan Danberry, Tatiyna Smith, Kiara Williams, Jailyn Mason, Yasmeen Ratliff and Briunna Freeman locked arms and knelt during the national anthem before an exhibition game against Oklahoma Baptist.\nBut it has also been a trying few days, Dykes said, because of a considerable amount of backlash over the protest.\nDanberry, a sophomore guard from Conway, said after the game that she knelt because of an “unjust system” that resulted in police brutality against blacks and other minorities. The gesture angered many fans who considered it unpatriotic and an insult to past and present military members.\nDykes said Monday that his staff had spoken to players several times before the exhibition game about their desire to protest during the anthem.\nWhen discussions began, “I’m not sure I really wanted to listen,” Dykes said. “Now I can’t listen enough to our young ladies.\n“We talked about each decision we make, we have consequences whether they are what we intended them to be or not to be. There is no doubt that deciding to do so during the national anthem opened up the opportunity for many different interpretations of their intentions.”\nDykes attempted to clarify some of his comments from last Thursday, which were in support of the players’ decision but he said were taken out of context by some who opposed the method of protest. He said he did not endorse his players kneeling for the anthem.\n“To be perfectly clear, my support is of our 14 tremendously strong young women, six who declared to kneel and eight who stood, and their ability to express themselves and support each other,” Dykes said. “I’m so proud of how they worked through a very difficult topic for them.”\nArkansas is scheduled to open the regular season Friday with a 10:30 a.m. game against Sam Houston State at Bud Walton Arena.","url":"https://www.arkansasonline.com/news/2016/nov/07/jimmy-dykes-wont-say-whether-protest-will-continue/?page=3"}
