{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 23:47:19","date_modify":"2018-10-30 23:47:19","date_publish":"2014-08-13 11:56:04","description":"Conan O'Brien was the first late night host to receive the devastating news that Robin Williams had passed away on Monday and O'Brien's shocked and devastated response to hearing about Williams' death during his on-air broadcast was a true…","filename":"data/vaneerConsumption/JimmyFallonSethMeyersHonorRobinWilliamswithTearfulTributestoaFallenIdolVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/eb3daea4-9b16-485c-b304-7879084d1bd5.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35566-jimmy-fallon-seth-meyers-honor-robin-williams-with-tearful-tributes-to-a-fallen-idol-video_1540943239.html","title":"Jimmy Fallon & Seth Meyers Honor Robin Williams with Tearful Tributes to a Fallen Idol - VIDEO","title_page":"Jimmy Fallon & Seth Meyers Honor Robin Williams with Tearful Tributes to a Fallen Idol — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Conan O'Brien was the first late night host to receive the devastating news that Robin Williams had passed away on Monday and O'Brien's shocked and devastated response to hearing about Williams' death during his on-air broadcast was a true reflection of an entire generation of people who had lost a living legend. Now that we've all had some time to process the situation, it hasn't become any less tragic or incredible that a man who brought so much joy and laughter to the world could have been lost to us in such a horrific way. Jimmy Fallon of The Tonight Show and Seth Meyers of Late Night missed their chance to pay proper tribute to Williams Monday night, so they both made up for it during their Tuesday night broadcasts.\nAt the very beginning of the show, a visibly shaken Jimmy Fallon appeared to be fighting back tears as spoke about Robin Williams' death. In fact, referring to Williams as the \"Muhammad Ali of Comedy\", Fallon did an entire improvisation of Williams' trademark rapid fire comedy style as if desperate for people to understand exactly what a great influence he was on comedy and improvisation while still remaining the kind of unique talent that no one else can even come close to imitating.\nFallon then played a clip of Williams' very first appearance on The Tonight Show back when it was being hosted by Johnny Carson. That single clip was enough to show that Fallon's schtick, quite honestly, had nothing on Williams' actual material.\nThe Tonight Show Starring Jimmy Fallon on YouTube\nOn Late Night, Seth Meyers also took time out of the beginning of his show to honor Robin Williams' memory, but his speech was a bit more personal and a lot more educational. \"I worked in a video store when I was growing up and I used to take out his stand up albums all the time and he brought me a great amount of joy,\" said Meyers in a somber tone of voice. \"The saddest part of this is that Robin was battling depression and if there's anything we can do to honor his memory, I would hope it would be to use this opportunity to educate us more about this terrible affliction.\"\nHe finished by thanking Robin Williams for allowing us to have had him in our lives at all through his stand up comedy and movies, through his interviews and appearances, through his pictures and his light.\nLate Night with Seth Meyers on YouTube\nIt's at times like this that we truly realize that it won't matter how many days or years have passed since we lost an iconic actor and comedian like Robin Williams. His legacy extends far and wide and his joy has brightened the lives of so many people that we'll be watching his films for years to come and still remembering the sense of overwhelming loss we're all feeling at this moment.","url":"https://www.bustle.com/articles/35566-jimmy-fallon-seth-meyers-honor-robin-williams-with-tearful-tributes-to-a-fallen-idol-video"}
