{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 20:22:07","date_modify":"2018-10-30 20:22:07","date_publish":"2015-10-11 22:30:42","description":"Former Sen. Jim Webb (D-VA) is stuck at the bottom of the polls, but could be the biggest winner of the Democratic debate in Las Vegas.","filename":"data/vaneerConsumption/JimWebbCouldBeDemocraticDebatesBigWinner.json","image_url":"https://media.breitbart.com/media/2014/12/Jim-Web-D-VA-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_11__1540930927.html","title":"Jim Webb Could Be Democratic Debate's Big Winner","title_page":"Jim Webb Could Be Democratic Debate's Big Winner | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former Sen. Jim Webb (D-VA) is stuck at the bottom of the polls, but could be the biggest winner of the Democratic debate in Las Vegas on Tuesday evening.\nMost attention has been focused on the surprisingly close race between former Secretary of State Hillary Clinton and socialist Sen. Bernie Sanders (I-VT), who is leading polls in New Hampshire. Speculations also surrounds the question of whether Vice President Joe Biden will enter the race.\nWebb has been virtually invisible, hovering around the zero mark with former Maryland governor Martin O’Malley and former Rhode Island governor Lincoln Chafee. But Webb, who was a key figure for Democrats in 2006 and in 2008, has yet to have a real crack at national media attention in this cycle, aside from remarks in defense of the Confederate battle flag after the Charleston massacre earlier this year prompted calls for its immediate removal.\nSeveral years ago, Webb was the kind of Democrat that the party promoted at every opportunity–a veteran and a moderate who could appeal to conservative voters in purple states. Webb spearheaded the attack on Sen. John McCain’s policies on veterans’ benefits in 2008, which was the Obama campaign’s opening salvo in the general election–and took the gobsmacked McCain campaign completely by surprise..\nIn today’s netroots-dominated Democratic Party, where a socialist is on the verge of becoming the frontrunner (according to NBC News’ Meet the Press), there is little thought given to Webb. Yet he remains the most qualified candidate–in either party–on national security and foreign policy issues. He also has the potential to appeal to the elusive “middle-class” voter for whom other Democrats purport to speak. He has nowhere to go but up–and probably will, slightly but significantly.","url":"https://www.breitbart.com/politics/2015/10/11/jim-webb-could-be-democratic-debates-big-winner/"}
