{"authors":["Dan Riehl"],"date_download":"2018-10-30 20:22:36","date_modify":"2018-10-30 20:22:36","date_publish":"2014-12-31 01:39:35","description":"Jim Webb's (D-VA) Born Fighting PAC released a statement in response to suggestions that the PAC made financial donations to Webb's family.","filename":"data/vaneerConsumption/JimWebbsBornFightingPACReleasesStatement.json","image_url":"https://media.breitbart.com/media/2014/12/Jim-Web-D-VA-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_12_30__1540930956.html","title":"Jim Webb's Born Fighting PAC Releases Statement","title_page":"Jim Webb's Born Fighting PAC Releases Statement | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The PAC insists any and all spending was legal, appropriate, and scrutinized regularly by outside legal counsel.\nThis story as written misrepresents reasonable compensation for real and provable work done. Adding up numbers across several years for a sensational headline doesn’t tell the story. We’re happy to be fully transparent on this for journalists interested in the whole story.\nSince its inception, the Born Fighting PAC has supported Senator Webb’s vision of leadership, both with respect to issues he continues to advance and also to support candidates. The PAC has compensated professionals who perform the necessary compliance and administrative functions of the PAC. Amy Webb has been involved in the administration, management and design of Jim Webb’s websites for many years, including the management of JamesWebb.com since 2001. She has provided the same services to the Born Fighting PAC since 2009, including the handling of FEC compliance matters since 2013.\nThe activities of the PAC increased in 2014 when Jim Webb decided to re-enter the political discussions of our country. This included extensive revamping of Jameswebb.com and the creation of the Webb2016 Exploratory Committee website. It also involved Jim’s increased personal involvement, as in his August 2014 visit to Iowa, where he campaigned for several candidates, and in numerous meetings regarding America’s political landscape.\nHong Le Webb, an attorney, was compensated for her activities relating to various aspects of multiple website designs from the period February through September 2014, including vetting design consultants, negotiating contracts and content management.\nThe payments were well within the law, were scrutinized regularly by outside legal counsel, and were much lower than usual amounts of compensation for such services.","url":"https://www.breitbart.com/politics/2014/12/30/jim-webbs-born-fighting-pac-releases-statement/"}
