{"authors":["Ian Hanchett"],"date_download":"2018-10-30 20:15:56","date_modify":"2018-10-30 20:15:56","date_publish":"2015-10-20 04:07:33","description":"Jindal: Cruz, Rubio, Graham, and Rand Need to 'Act,' Every Governor Should Defund PP","filename":"data/vaneerConsumption/JindalCruzRubioGrahamandRandNeedtoActEveryGovernorShouldDefundPP.json","image_url":"https://media.breitbart.com/media/2015/10/Jindal-1019-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_19__1540930556.html","title":"Jindal: Cruz, Rubio, Graham, and Rand Need to 'Act,' Every Governor Should Defund PP","title_page":"Jindal: Cruz, Rubio, Graham, and Rand Need to 'Act,' Every Governor Should Defund PP | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Louisiana Governor and Republican presidential candidate Bobby Jindal argued, “I know there are a lot of Republicans in DC that like to talk, it’s time for them to act, including a lot of these Republicans running for president,” namely Senators Ted Cruz (R-TX), Marco Rubio (R-FL), Lindsey Graham (R-SC), and Rand Paul (R-KY) on Monday’s “Hannity” on the Fox News Channel.\nJindal said, “The Republicans in d.c. have become the surrender caucus. All they say is they can’t. They can’t defund planned parenthood, they can’t stop amnesty, they can’t stop obamacare, they can’t stop this bad Iran deal.\nHe added that it’s both that Congressional Republicans can’t and won’t do the aforementioned agenda items, and “they need a back bone transplant. I mean, I don’t like what [Representative Nancy] Pelosi (D-CA) and [Senator Harry] Reid (D-NV) are doing to our country, but at least they fight for their principles. I’m proud of this lawsuit [against his defunding of Planned Parenthood], quite frankly. Look, the Obama attorneys might as well get comfortable in Baton Rouge, we’re not backing down from this fight. We’re going to fight to protect innocent human life. Look, I know there are a lot of Republicans in DC that like to talk, it’s time for them to act, including a lot of these Republicans running for president. A lot of the senators, whether it’s Cruz, or Rubio, Graham, or Paul. We need folks to actually act on the front lines. I hope every governor will defund Planned Parenthood. They can’t sue us all. They can’t come after us all.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/politics/2015/10/19/jindal-cruz-rubio-graham-and-rand-need-to-act-every-governor-should-defund-pp/"}
