{"authors":["Ian Hanchett"],"date_download":"2018-10-30 20:14:50","date_modify":"2018-10-30 20:14:50","date_publish":"2015-11-17 23:43:01","description":"Bobby Jindal announced the suspension of his candidacy for president on Tuesday's \"Special Report\" on the Fox News Channel.","filename":"data/vaneerConsumption/JindalSuspendsCandidacyforPresident.json","image_url":"https://media.breitbart.com/media/2015/11/Jindal-1117-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_17__1540930490.html","title":"Jindal Suspends Candidacy for President","title_page":"Jindal Suspends Candidacy for President | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Louisiana Governor and Republican presidential candidate Bobby Jindal announced the suspension of his candidacy for president on Tuesday’s “Special Report” on the Fox News Channel.\nJindal said, “Look, it has been a great honor for me to run for president of the United States, to put this in perspective, my parents came to this country 45 years ago, they came here for freedom and opportunity. You know, when they had me, they were actually living in married student housing at LSU. I don’t think, in a million years, they would have ever imagined that I’d be governor, or one day I’d be running for president of the United States. The reality though is, they told me as a young child, Americans can do anything. I believed them then, and I believe them now. But, you know, they — this is not my time, and I’ve come to the realization this is not my time. So, I’ve come here to announce that I’m suspending my campaign for president of the United States.”\nJindal added that he’s going to return to his think tank to help “develop” conservative policies.\nWhen asked about the direction of the GOP going forward, he stated, “the left is all about redistribution, and weakness abroad. Where I think my party needs to be, where the Republican Party, the conservative movement needs to be, is specific solutions, and also taking on the threat of radical Islamic terrorism. Bret, we’ve got a president, he’s a community organizer, at a time of war. He doesn’t even want to say the words ‘radical Islam.’ The reality is, earlier this year, I went abroad, I went to Europe, and I gave a speech. I came back and here said, Europe has a problem. they’re not assimilating many of these Muslims. We must not let that happen here. Now, the left hated that. the reality is that we — we’ve got to continue to tell the truth. Immigration without integration is not immigration, it’s an invasion, we must not let that happen here.”\nWhen asked if he was going to endorse, he responded, “I haven’t given that a lot of thought. I know the press loves to see whether a politician endorses another. The reality is though, I don’t think people care. I think at the end of the day, I trust the American voters to select our nominee and the next president, we may. I haven’t given that a lot of thought.”\nJindal was then asked if he had any warnings against certain people in the GOP, he stated, “it’s not enough just to elect a Republican. Bret, we need to elect somebody who’s going to make big changes. If we elect somebody who’s just going to go and do more big government spending, if we elect somebody who’s not going to be serious about the threat of radical Islam, we’re not going to get our country back on the right path. So, I want somebody who’s got the courage and the smarts to make big changes. Look, we got a big field, and again, we’ll decide whether we get involved or not. I will be supporting our nominee. The reality is, we cannot afford to go towards socialism. We cannot afford Hillary Clinton, four more years of a weak foreign policy. Our country deserves better than that.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/politics/2015/11/17/jindal-suspends-candidacy-for-president/"}
