{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 18:41:31","date_modify":"2018-10-30 18:41:31","date_publish":"2016-05-06 17:58:42","description":"Jennifer Lopez plays six different oppressed women in the new music video for her feminist anthem \"Ain't Your Mama.\" | Entertainment","filename":"data/vaneerConsumption/JLoPlaysSixDifferentOppressedWomeninVideoforFeministAnthem.json","image_url":"https://media.breitbart.com/media/2016/05/J-LO.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_05_06__1540924891.html","title":"J. Lo Plays Six Different Oppressed Women in Video for Feminist Anthem","title_page":"J. Lo Plays Six Different Oppressed Women in Video for Feminist Anthem | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Jennifer Lopez released the music video for her new single “Ain’t Your Mama” on Friday, which finds the pop star playing the roles of several oppressed women — among them a 1950s housewife, a 1960s secretary and a power-suited 1980s executive — while telling the men in her life that she won’t cook for them or do their laundry anymore.\nThe video for the singer’s new feminist anthem begins with a rain-soaked J. Lo preparing to deliver an evening newscast as a 1995 quote from Hillary Clinton plays in the background: “Human rights are women’s rights, and women’s rights are human rights, once and for all.”\n“Look, I don’t have to tell you things are bad,” Lopez kicks off the video. “Taken for granted, ignored, over-looked, under-appreciated; we have a big problem, ladies.”\nThe Dr. Luke-produced track kicks in and J. Lo is a 1950s housewife, who’s fed up with her unappreciative husband. Then she’s a 1960’s typist who puts her boss’ tie through a typewriter and throws a drink in his face. After that, she’s an assembly-line worker, and then a 1980s business executive who kicks papers around and dances on work desks when she’s apparently shut out of a meeting because she is a woman.\nThe video ends with a modern-day Lopez dancing in the streets with other women while triumphantly telling the men in their lives that they “ain’t your mama.”\nThe song was written by Meghan Trainor (“Dear Future Husband,” “All About That Bass”) and Jacob Kasher.\nRead the lyrics below, courtesy of Genius, and watch the video for “Ain’t Your Mama” above.\n[Chorus]\nI ain’t gon’ be cooking all day, I ain’t your mama\nI ain’t gon’ do your laundry, I ain’t your mama\nI ain’t your mama, boy, I ain’t your mama\nWhen you gon’ get your act together?\nI ain’t your mama\nNo, I ain’t your mama\nNo, I ain’t your mama, no [Verse 1]\nWake up and rise and shine, ah-yeah-yeah-yeah\nBest get to work on time, ah-yeah-yeah-yeah\nNo more playing video games, ah-yeah-yeah-yeah\nThings are about to change, ’round here, ’round here [Pre-Chorus]\nWe used to be crazy in love\nCan we go back to how it was?\nWhen did you get too comfortable?\nCause I’m too good for that, I’m too good for that\nJust remember that, hey [Chorus]\nI ain’t gon’ be cooking all day, I ain’t your mama\nI ain’t gon’ do your laundry, I ain’t your mama\nI ain’t your mama, boy, I ain’t your mama\nWhen you gon’ get your act together?\nI ain’t your mama\nNo, I ain’t your mama\nNo, I ain’t your mama, no [Verse 2]\nLucky to have these curves, ah-yeah-yeah-yeah\nStop getting on my nerves, ah-yeah-yeah-yeah\nYou still tryna ride this train? Ah-yeah-yeah-yeah\nCause some things have gotta change, ’round here, here, here [Pre-Chorus]\nWe used to be crazy in love\nCan we go back to how it was?\nWhen did you get too comfortable?\nCause I’m too good for that, I’m too good for that\nJust remember that, hey [Chorus]\nI ain’t gon’ be cooking all day, I ain’t your mama (I ain’t your mama, no)\nI ain’t gon’ do your laundry, I ain’t your mama (I ain’t your mama, hey)\nI ain’t your mama, boy, I ain’t your mama\nWhen you gon’ get your act together?\nI ain’t your mama (I ain’t your mama)\nNo, I ain’t your mama\nNo, I ain’t your mama, no\nI ain’t your mama, no [Pre-Chorus]\nWe used to be crazy in love\nCan we go back to how it was?\nWhen did you get too comfortable?\nCause I’m too good for that, I’m too good for that\nJust remember that, hey [Chorus]\nI ain’t gon’ be cooking all day, I ain’t your mama (I ain’t your mama)\nI ain’t gon’ do your laundry, I ain’t your mama (I ain’t your mama)\nI ain’t your mama, boy (No, no, no)\nI ain’t your mama, boy (No, no)\nWhen you gon’ get your act together? (Cause I ain’t your mama, hey)\nI ain’t gon’ be cooking all day, I ain’t your mama\nI ain’t gon’ do your laundry, I ain’t your mama (I ain’t your mama, hey)\nI ain’t your mama, boy (Na, na, na)\nI ain’t your mama, boy (Na, na, na)\nWhen you gon’ get your act together? (No, I ain’t your mama, no)\nNo, I ain’t your mama\nNo, I ain’t your mama\nNo, I ain’t your mama, no\nFollow Daniel Nussbaum on Twitter: @dznussbaum","url":"https://www.breitbart.com/entertainment/2016/05/06/j-lo-plays-six-different-oppressed-women-video-new-feminist-anthem/"}
