{"authors":[],"date_download":"2018-10-22 21:07:39","date_modify":"2018-10-22 21:07:39","date_publish":"2014-06-04 11:31:34","description":"Price increases have been largely expected after arabica coffee futures prices jumped nearly 90 percent within three months.","filename":"data/vaneerConsumption/JMSmuckerHikesCoffeePricesfor1stTimein3Years.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/486146/140604-coffee_0725_7355a6f1c871121a6506555ed099842b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_j-m-smucker-hikes-coffee-prices-1st-time-3-years-n122111_1540242459.html","title":"J.M. Smucker Hikes Coffee Prices for 1st Time in 3 Years","title_page":"J.M. Smucker Hikes Coffee Prices for 1st Time in 3 Years","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nJ.M. Smucker Co said on Tuesday that it had raised list prices on most of its U.S. packaged coffee, primarily the well-known Folgers and Dunkin' Donuts brands, for the first time since 2011 because of soaring green coffee costs.\nSmucker increased prices by an average of 9 percent due to rallying bean prices, the company said.\nPrice increases by large U.S. roasters have been largely expected after arabica coffee futures prices jumped nearly 90 percent within three months to a 26-month high in April on concerns that Brazil's worst drought in decades would damage crops in the world's biggest producer. The market has since dropped around 20 percent.\nThe move by Smucker, which is considered a trendsetter, is likely to trigger price hikes by other major U.S. coffee roasters as they seek to protect profits from rising bean prices that took the industry by surprise.\nThe price increase does not include K-Cup packs, Smucker said in a statement.\nThis is Smucker's first price move since February 2013. At that time, the company lowered retail prices on Folgers and Dunkin' Donuts brands by an average of 6 percent, its third straight cut as the futures market made a steady decline.\nSmucker last raised prices in May 2011 as arabica futures more than doubled to a 34-year high above $3 per lb.\n-- Reuters","url":"https://www.nbcnews.com/business/consumer/j-m-smucker-hikes-coffee-prices-1st-time-3-years-n122111"}
