{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-22 23:13:35","date_modify":"2018-10-22 23:13:35","date_publish":"2017-03-16 06:05:43","description":"A sequel is starting to look unlikely. The reality star looked fab in a plunging black gown with ruffled shoulders, boasting both a short skirt and long train. Missing was her co-star Rob Gronkowski","filename":"data/vaneerConsumption/JoannaKrupaarrivesforpremiereofYouCantHaveIt.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/04/3E51C3CE00000578-0-image-a-52_1489637895637.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318786_Joanna-Krupa-arrives-premiere-t-It_1540250015.html","title":"Joanna Krupa arrives for premiere of You Can't Have It","title_page":"Joanna Krupa arrives for premiere of You Can't Have It | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A sequel is starting to look unlikely.\nJoanna Krupa arrived for the premiere of her latest film You Can't Have It - alone - on Wednesday night.\nThe reality star looked fab in a plunging black gown with ruffled shoulders, boasting both a short skirt and long train.\nFight: Joanna Krupa arrived for the Hollywood premiere of You Can't Have It after blasting her no-show co-star Rob Gronkowski on Wednesday\nMissing was her co-star Rob Gronkowski, and it didn't go unnoticed by the 37-year-old.\nAccording to TMZ, the former Real Housewives Of Miami star put the NFL player on blast for failing to promote the film.\nWhile she flew in from Poland to be there for the screening, Gronk didn't bother turning up at all.\nShe also slammed him for messing up his lines while they were filming.\nWow: The reality star looked fab in a plunging black gown with ruffled shoulders, boasting both a short skirt and long train\nSolo: Missing was her co-star Rob Gronkowski, and it didn't go unnoticed by the 37-year-old\nCarrying it: While she flew in from Poland to be there for the screening, Gronk didn't bother turning up\n'To me, he's not a big team player,' she said.\nHowever, a source close to Gronk told the site his absence wasn't personal; rather he was focusing on rehab following surgery on a back injury.\n'Movie promotion is NOT a priority, his health and career are,' the insider claimed.\nLaid out: However, a source close to Gronk told the site his absence wasn't personal; rather he was focusing on rehab following surgery on a back injury\nThey also added that the New England Patriot wasn't considering a serious move into acting; rather he starred in the film as a favor to a friend involved in production.\nAccording to IMDb, the film's blurb reads: 'When Bill Sullivan spends the last night of Mr. Phil's Bar hanging out with his friends, drinking, sex and murder ensue. Last call takes on a whole new meaning.'\nIn the movie, Joanna plays 'Jackie' while Rob plays Officer Weadon, who is called to investigate a violent situation at the bar.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318786/Joanna-Krupa-arrives-premiere-t-It.html"}
