{"authors":["Hannah Paine For Daily Mail Australia"],"date_download":"2018-10-22 21:13:25","date_modify":"2018-10-22 21:13:25","date_publish":"2017-03-16 00:49:20","description":"The girlfriend of Jobe Watson model Virginia Slaghekke cut a fashionable figure while going solo at a Lavazza VAMFF event on Thursday night.","filename":"data/vaneerConsumption/JobeWatsonsmodelgirlfriendVirginiaSlaghekkeatVAMFF.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FCE2E00000578-0-image-a-78_1489623070755.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318280_Jobe-Watson-s-model-girlfriend-Virginia-Slaghekke-VAMFF_1540242805.html","title":"Jobe Watson's model girlfriend Virginia Slaghekke at VAMFF","title_page":"Jobe Watson's model girlfriend Virginia Slaghekke at VAMFF | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the glamourous other half of controversial Essendon player Jobe Watson, 32.\nAnd 26-year-old model Virginia Slaghekke cut a fashionable figure while going solo at a Lavazza VAMFF event on Thursday night.\nThe Dutch-born beauty, who is currently on university exchange in Melbourne for six months, stunned in a striking red mini dress at the fashion gala.\nScroll down for video\nRed hot! Jobe Watson's glamorous model girlfriend Virginia Slaghekke cuts a fashionable figure at VAMFF\nVirginia wore a form-fitting crimson dress which featured an elaborate bow tied around her hips and showcased her slim figure.\nThe aspiring doctor accessorised with a matching YSL handbag and strappy silver stilettos.\nSporting a severe middle part, the New York-based model wore her brunette locks slicked back in a sleek low ponytail.\nPerfect match: The aspiring doctor accessorised with a matching YSL handbag\nStylish: Virginia wore a form-fitting crimson dress which featured an elaborate bow tied around her hips and showcased her slim figure\nVirginia kept her makeup simple, pairing a strong eyebrow with a slick of bright red lipstick.\nInside the event, Virginia could be seen sipping from a cup of espresso coffee and later sat front row in a fashion show.\nThe brunette beauty met Jobe in New York late last year, where the AFL player was living after being slapped with a two year playing suspension over the Essendon Football Club's supplements scandal.\nNeeded a caffeine hit? Inside the event, Virginia could be seen sipping from a cup of espresso coffee\nClassic: Virginia kept her makeup simple, pairing a strong eyebrow with a slick of bright red lipstick\nStanding out: The brunette model was hard to miss when she later sat front row at a fashion show\nShe told the Herald Sun last month that she had no idea who the famous footballer was when he ran after her with his number on a napkin after spotting her in a cafe.\n'I did not know of the existence of AFL until a few months ago,' she said. 'The way I know Jobe is from New York and there he is just Jobe. He is just Jobe to me.'\nDespite having worked successfully as a model for Italian Vogue and Cartier, Virginia is currently completing a university neuroscience degree with plans to study medicine afterwards.\nLove match: The brunette beauty met Jobe in New York where the AFL player was living after being slapped with a two year playing suspension over the Essendon Football Club's supplements scandal","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318280/Jobe-Watson-s-model-girlfriend-Virginia-Slaghekke-VAMFF.html"}
