{"authors":[],"date_download":"2018-10-30 01:24:21","date_modify":"2018-10-30 01:24:21","date_publish":"2016-06-20 05:00:54","description":null,"filename":"data/vaneerConsumption/JobKillingRedTapeforTheeNotforMe.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/06/1-ICG_277-pick3-cmyk1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862661.html","title":"Job-Killing Red Tape for Thee, Not for Me","title_page":"Job-Killing Red Tape for Thee, Not for MeThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"If you think that all members of Congress have to comply with all of the laws that we common citizens have to obey, think again. Over the years, Congress has passed thousands of bills and statutes that dictate how we should or shouldn’t live our lives, but its members often fail to comply with these rules. In many instances, they actually exempt themselves from those burdensome constraints.\nTo state an obvious example: Taking other people’s money via force and spending it will land everyone but a politician in jail.\nOr, remember a few years ago when we found out that members of Congress weren’t prohibited from trading stocks using nonpublic information? For most of us, this type of insider trading is a serious crime that carries a high probability of prison time for regular Joes. The outrage over this scandal led to a reform bill (the STOCK Act) to right the injustice. But then Congress eliminated a key reporting requirement for members of Congress, which gutted the law enough to guarantee more corruption going forward.\nJust to name another few:\nCongress is also exempt from investigatory subpoenas to obtain information for safety and health probes and from prosecution for retaliating against employees who report safety and health hazards. In an age of federal agencies’ overreach and bogus prosecutions, I bet private businesses would like to be exempt, too.\nSarbanes-Oxley rules, which can throw chief executives of publicly traded companies in prison for up to 20 years and cost them $5 million in fines if they fail to certify their accounts, don’t apply to Congress. The Department of Defense has failed to comply with auditing requirements for several decades without consequences.\nIn other examples, we see that it takes decades for Congress to subject itself to laws that apply to us. The Fair Labor Standards Act of 1938 established overtime pay, record keeping and youth employment standards, affecting full-time and part-time workers. For all its good intentions, many companies consider this act to be the bane of their existence, the source of a constant stream of regulations and enormous costs with small benefits. Congress, in spite of its large workforce, exempted itself from it.\nThat lasted until 1995 — almost 60 years later — when the House and Senate finally passed the Congressional Accountability Act, requiring that Congress comply with many of the standards established under the FLS Act. Among other things, the act applied many labor and workplace safety and civil rights statutes to the legislative branch, such as Title VII of the Civil Rights Act of 1964, the Age Discrimination in Employment Act of 1967, the Occupational Safety and Health Act of 1970 and the American with Disabilities Act of 1990.\nBut don’t let this fool you. Just because it’s the law doesn’t mean that Congress actually complies with it. Consider overtime rules. Again, under the CAA of 1995, Congress has to comply with the rules, but in order to do so, both the House and the Senate must issue a resolution that they will adopt the rules. In 1996, all those procedural boxes were checked, and Congress subjected itself to overtime pay rules. It never complied again.\nIn August 2004, the Department of Labor issued new and costly overtime pay regulations — which once again changed the standard compensation levels and overtime exemptions for full-time employees, from a weekly salary level of $155 (the threshold varies based on duties) to a new standard of $455. However, Congress has not yet adopted the regulations to replace the 1996 overtime pay standards with the updated ones.\nAnd what do you think is going to happen now that the DOL changed the overtime pay rule to apply to full-time employees making up to $913 a week? Based on their past behaviors, I predict that members of Congress will exempt themselves again, even though many lawmakers forcefully lobbied for the rule to be pushed down the private sector’s throat. As Competitive Enterprise Institute’s Bill Frezza noted when he heard of the exemption, “job-killing red tape for thee. Exemption for me.”\nIn Federalist No. 57, James Madison wrote that the House of Representatives “can make no law which will not have its full operation on themselves and their friends, as well as on the great mass of the society.” How far we have fallen.\nCOPYRIGHT 2016 CREATORS.COM","url":"https://spectator.org/job-killing-red-tape-for-thee-not-for-me/"}
