{"authors":[],"date_download":"2018-10-22 20:31:24","date_modify":"2018-10-22 20:31:24","date_publish":"2014-05-02 11:14:38","description":"The labor market warmed up along with the weather in April.","filename":"data/vaneerConsumption/JobMarketHeatsUpinAprilUnemploymentRateDropsto63.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/415766/140502-spring-unemployment-jhc-0916_7e23083a1453b8985c86486d82dec565.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_economy_job-market-heats-april-unemployment-rate-drops-6-3-n95431_1540240284.html","title":"Job Market Heats Up in April; Unemployment Rate Drops to 6.3%","title_page":"Job Market Heats Up in April; Unemployment Rate Drops to 6.3%","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe labor market warmed up along with the weather in April when employers added a higher-than-expected 288,000 workers to their payrolls, government data showed Friday.\nThe Labor Department also reported that the unemployment rate dropped to 6.3 percent, a 5-1/2 year low, from 6.7 percent in March. The drop occurred because the number of people working or looking for work dropped sharply. People aren't counted as unemployed if they aren't looking for work.\nThe civilian labor force dropped by 806,000 after March's increase of 503,000. The labor force participation rate, or the share of working-age Americans who are employed and unemployed but looking for a job, fell 0.4 percentage point to 62.8 percent. That was the lowest level since last December.\nSome of the 1.35 million people who lost their longer-term unemployment benefits at the end of last December could have dropped out the labor force last month.\nHiring last month was broad-based and included higher-paying jobs: Manufacturing gained 12,000 positions. Construction added 32,000. Professional and technical services, which include accounting and engineering positions, gained 25,100 jobs.\n\"It's a flat out good report. All of the metrics that you want to see improve, did,\" Tom Porcelli, RBC Capital Market's chief U.S. economist, told Reuters. Porcelli also warned about reading too much into the decline in the jobless rate, however.\nA consensus of economists had been expecting an increase of 210,000 non-farm payrolls, with the jobless rate inching lower to 6.6 percent. The job gains in April were the highest since January 2012.\nAverage hourly earnings were flat in April. The length of the workweek held steady at 34.5 hours last month after bouncing back in March from its winter-depressed levels.\nMany market watchers had been anticipating a hot jobs number on belief that inclement winter weather had suppressed economic activity and cooled the jobs market, though the numbers didn't completely back that argument.\nThe initially reported March figure of 192,000 actually was ahead of the 12-month average of 183,000, while revisions bumped up February to 197,000 and even January's anemic report moved to 144,000.\n-- CNBC's Jeff Cox, The Associated Press and Reuters contributed to this report.","url":"https://www.nbcnews.com/business/economy/job-market-heats-april-unemployment-rate-drops-6-3-n95431"}
