{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-22 23:34:32","date_modify":"2018-10-22 23:34:32","date_publish":"2016-01-28 12:42:12","description":"The duo, who are holidaying with four-year-old son Koa and new addition Zekey, were alone when they took time looking out to sea on the beach in Barbados recently.","filename":"data/vaneerConsumption/JodiAlbertdisplaysherpostbabybodyonthebeachwithhusbandKianEgan.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA166000000578-0-image-a-40_1453982563479.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420829_Jodi-Albert-displays-svelte-post-baby-shape-black-vest-bikini-bottoms-hits-beach-husband-Kian-Egan_1540251272.html","title":"Jodi Albert displays her post-baby body on the beach with husband Kian Egan","title_page":"Jodi Albert displays her post-baby body on the beach with husband Kian Egan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"After expanding their family in 2015, Jodi Albert and husband Kian Egan were relishing some rare time alone in Barbados this week.\nThe duo, who are currently holidaying with four-year-old son Koa and new addition Zekey, were unaccompanied by their little ones when they hit the paradise beach spot side-by-side.\nWhile Kian, 35, was covered up the day out, gorgeous Jodi, 32, was soaking up the sun in black bikini bottoms and a light vest.\nScroll down for video\nLife's a beach: Jodi Albert hit Barbados beach this week during a relaxing holiday with husband Kian Egan and her two sons\nFormer Westlife star Kian was kicking back in swimshorts and a T-shirt, his hair still messy from the morning, and appeared to be taking some time out for R+R, thanks to their stepped-up parental duties.\nJodi meanwhile, was a stunning sight as ever, with her waist-length hair long and natural and her skin make-up free beneath large sunglasses.\nHer beach figure, which she's been honing extremely hard in the gym for the last eight months, was characteristically long and lean and sensibly glossed with sun-cream.\nTime off: The husband and wife duo spent time by themselves, able to have some time off from parenting duties\nThe getaway was no doubt nostalgic for the couple since Barbados is the Caribbean island where they tied the knot in 2009.\nKian and Jodi are said to have been introduced at Party In The Park in 1999, when she was 15, but didn't officially start dating until 2003.\nAfter starting a family with a first son two years after their jetset nuptials, they welcomed second son Zekey in May 2015.\nBeach day: The star gave birth to her second son Zeke with Kian in May last year\nA positive end to the year: The couple were able to put a positive end to the year, in which Jodi's mother sadly passed away\nMelding the happy with the sad, their little one was born on Jodi's late mother Eileen's birthday, but she was not there to see it as she sadly passed away three months before.\nEileen had been battling cancer for eight years and was particularly unwell in Christmas 2014, making this year's festive celebrations comparatively more positive for the new parents.\nSimilarly, the former girlband singer was able to make a strong start to 2016 by opening her fashion store Jodi's Boutique in Sligo, Ireland last November.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420829/Jodi-Albert-displays-svelte-post-baby-shape-black-vest-bikini-bottoms-hits-beach-husband-Kian-Egan.html"}
