{"authors":["Laura House For Daily Mail Australia"],"date_download":"2018-10-22 21:07:04","date_modify":"2018-10-22 21:07:04","date_publish":"2016-01-11 00:14:55","description":"Jodie Dominy, 41, from Queensland, Australia found a 'pimple' on her face - but after a few years and constant swelling she discovered it was a rare form of aggressive and deep-rooted cancer.","filename":"data/vaneerConsumption/JodieDominyleftwithadisfiguredfaceafteraggressiveandrarecancer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/10/23/3001314200000578-0-image-a-29_1452468830884.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3392990_Jodie-Dominy-left-disfigured-face-diagnosed-aggressive-rare-cancer_1540242424.html","title":"Jodie Dominy left with a disfigured face after aggressive and rare cancer","title_page":"Jodie Dominy left with a disfigured face after aggressive and rare cancer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When Jodie Dominy, 41, found a small lump on her chin, she simply brushed it off as a pimple caused by the stress of motherhood.\nBut when the lump refused to go away, the mother-of-two decided to seek an opinion from her doctor and was told it was a 'fatty cyst,' Mrs Dominy explained to that's life! Magazine.\n'The doctor explained I could have it removed for cosmetic reasons, but there was no harm in leaving it alone. I decided not to bother,' Mrs Dominy said.\nJust stress: Jodie Dominy, 41, found a small lump on her chin and simply brushed it off as a pimple caused by the stress of motherhood.\nNothing too bad: But when the lump refused to go away, the mother-of-two decided to seek an opinion from her doctor and was told it was a 'fatty cyst' (Mrs Dominy pictured after surgery)\nMrs Dominy, from Karalee, Queensland, continued on as usual for the next few years - but as the years passed, the bump grew.\nWith the lump the size of a 20-cent piece and starting to cause her pain, Mrs Dominy asked a plastic surgeon to remove it during a procedure she had booked to remove a benign skin cancer on her lip.\nHowever, after her 'cyst' was analysed in a biopsy and Mrs Dominy was called into the surgeon's office, she said the doctor's face was not 'the face of a man with good news'.\nBad news: Her 'cyst' was analysed in a biopsy and Mrs Dominy was called into the surgeon's office and told it was a rare form of cancer called dermatofibrosarcoma protuberans, or DFSP\nAlmost unheard of: DFSP has been reported in just eight cases throughout Australia\nThe lump that Mrs Dominy had first dismissed at a stress pimple was actually a rare form of cancer called dermatofibrosarcoma protuberans, or DFSP, and has been reported just eight times in Australia.\n'I am the only one ever to have it on my face. If left untreated it would have taken over my whole face eventually,' Mrs Dominy wrote on Facebook in March.\nThe surgeon advised Mrs Dominy that the cancer was similar to an 'octopus' as it had 'long tentacles' that spread around the area and formed 'deep roots'.\nAs a result, Mrs Dominy was sent in for extensive facial surgery and despite the high survival rate of the cancer, it was going to be hard to remove.\nFirst case: 'I am the only one ever to have it on my face. If left untreated it would have taken over my whole face eventually,' Mrs Dominy wrote on Facebook\nComplex: The surgeon advised Mrs Dominy that the cancer was similar to an 'octopus' as it had 'long tentacles' that spread around the area and formed 'deep roots' and tissue had to be taken from her arm (pictured) to patch the area during surgery\n'Mostly I was scared. Would I look like a monster? Would people point and stare at me?' Mrs Dominy said, who was also terrified about what her husband Peter would think.\nMrs Dominy's husband Peter assured her that he would always love her and the person she was and two weeks later, Mrs Dominy had her surgery.\nThe 'tentacles' had spread into her chin, bottom lip, jaw and left cheek, meaning the surgeon needed to cut out pieces of her skin and muscle and rebuild it using tissue from her arm.\nStaying positive: The surgery took nine hours and Mrs Dominy needed 170 stitches - but she remains positive and is now cancer free\nThe nine-hour procedure left Mrs Dominy with 170 stitches.\nDespite describing her appearance as 'horrid' due to the swelling and 'huge scars and blood', Mrs Dominy was happy to be cancer free and focused on staying positive.\n'I have ongoing facial reconstruction surgeries still to come this year to create a jawline and some form of normality to my face aswell as ongoing speech therapy and occupational therapy on my arm to try and gain full access of it,' Mrs Dominy wrote on Facebook.\nRaising awareness: Mrs Dominy hopes her story can help warn others never to ignore changes in their body\nFor more real life stories, pick up a copy of this week’s that’s life! magazine on sale now\n'I still have ongoing problems with my arm due to the removal of tendons and veins etc and can't feel part of my hand at all...but I am strong and know that at the end of this I will be okay.'\nMrs Dominy hopes her story can help warn others never to ignore changes in their body and feels blessed to have such a beautiful and supportive family.","url":"https://www.dailymail.co.uk/femail/article-3392990/Jodie-Dominy-left-disfigured-face-diagnosed-aggressive-rare-cancer.html"}
