{"authors":["Madhuri Sathish"],"date_download":"2018-10-31 01:40:03","date_modify":"2018-10-31 01:40:03","date_publish":"2018-09-01 21:05:46","description":"Former Presidents Barack Obama and George W. Bush both delivered moving tributes to Arizona Sen. John McCain during a ceremony in Washington, D.C. on Saturday. But two days earlier, another prominent politician spoke at a different memorial service…","filename":"data/vaneerConsumption/JoeBidensQuoteOnGriefFromJohnMcCainsArizonaFuneralIsIncrediblyMoving.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/1/c6b6b6d2-26a3-418d-a2bd-1b876630e705-getty-1025295718.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_joe-bidens-quote-on-grief-from-john-mccains-arizona-funeral-is-incredibly-moving-11478545_1540950003.html","title":"Joe Biden’s Quote On Grief From John McCain's Arizona Funeral Is Incredibly Moving","title_page":"Joe Biden’s Quote On Grief From John McCain's Arizona Funeral Is Incredibly Moving","title_rss":"NULL","source_domain":"bustle.com","text":"Former Presidents Barack Obama and George W. Bush both delivered moving tributes to Arizona Sen. John McCain during a ceremony in Washington, D.C. on Saturday. But two days earlier, another prominent politician spoke at a different memorial service in Arizona, honoring his decades-long friendship with McCain. Former Vice President Joe Biden delivered an emotional eulogy to McCain on Thursday, in which he discussed his own grief and recalled the early days of their friendship.\n\"My name's Joe Biden,\" he said when he first took the stage, prompting laughter from ceremony attendees. \"I'm a Democrat, and I love John McCain.\"\nMcCain wasn't just a colleague to Biden; the two of them met shortly after they experienced significant tragedy, and although they did not talk about McCain's time as a prisoner of war and Biden's loss of his family, they shared many other things with one another.\n\"I always thought of John as a brother,\" Biden said. \"We had a hell of a lot of family fights. We go back a long way. Above all, we understood the same thing. All politics is personal. It’s all about trust. I trusted John with my life.”\nAfter McCain publicly revealed that he had brain cancer last year, Biden consoled his daughter Meghan during an emotional interview on The View. Biden's son, Beau, also died from brain cancer back in 2015, and Biden shared Meghan's grief.\nCNN on YouTube\nIndeed, speaking at the ceremony on Thursday, Biden shared a complex understanding of grief that resonated with many people on social media:\nI promise you, the time will come that what's going to happen is six months will go by and everybody is going to think, well, it's passed. But you are going to ride by that field or smell that fragrance or see that flashing image. You are going to feel like you did the day you got the news. But you know you are going to make it. The image of your dad, your husband, your friend. It crosses your mind and a smile comes to your lips before a tear to your eye. That's who you know. I promise you, I give you my word, I promise you, this I know. The day will come. That day will come.\nWhen one Twitter user shared this quote, it prompted numerous others to share their own experiences with grief, and how they coped with it. Some also recognized that Biden was able to capture the essence of grief so accurately because he has an intimate understanding of it himself. According to The Washington Post, a 2012 speech Biden delivered to military families and friends who had lost loved ones was a clear illustration of how the then-vice president processed grief.\n“For the first time in my life, I understood how someone could consciously decide to commit suicide,\" Biden said at the time, discussing the loss of his wife and daughter. \"Because they’d been to the top of the mountain, and they just knew in their heart they’d never get there again, that it was never going to get — never going to be that way ever again.\"\nDuring his eulogy on Thursday, Biden went on to call McCain's children a \"living legacy, living proof of John McCain's success,\" and described the loss of his old friend as \"all consuming.\"\n“It’s like being sucked into a black hole inside your chest, and it’s frightening,” Biden said. However, speaking to McCain's family and loved ones, Biden added that \"the world now shares with you the ache of John’s death.\"\nBiden has spoken extensively about his own experiences with grief over the years, and has often shared publicly the ways in which he has processed it. He was prepared to run for the presidency, but chose not to because he and his family needed time to grieve and heal following Beau's death. And on Thursday, as he grieved for McCain, Biden was no less vulnerable; he delivered a moving tribute to the man who had been one of his close friends, and paraphrasing Shakespeare, he suggested that \"we shall not see his like again.”","url":"https://www.bustle.com/p/joe-bidens-quote-on-grief-from-john-mccains-arizona-funeral-is-incredibly-moving-11478545"}
