{"authors":["Associated Press"],"date_download":"2018-10-23 04:36:34","date_modify":"2018-10-23 04:36:34","date_publish":"2016-01-28 20:41:35","description":"Vice President Joe Biden on Thursday likened the Republican presidential race to a 'gift from the Lord' for Democrats trying to win control of the House and Senate.","filename":"data/vaneerConsumption/JoeBidencallstheRepublicanpresidentialraceagiftfromtheLord.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/22/308012CD00000578-0-image-a-10_1454020800969.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421532_Biden-GOP-White-House-race-Its-gift-Lord_1540269394.html","title":"Joe Biden calls the Republican presidential race a 'gift from the Lord'","title_page":"Joe Biden calls the Republican presidential race a  'gift from the Lord' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Vice President Joe Biden on Thursday likened the Republican presidential race to a 'gift from the Lord' for Democrats trying to win control of the House and Senate.\nBiden joked to House Democrats at their annual retreat in Baltimore that he doesn't know which Republican to root for, though he didn't refer to any by name.\nMany Republicans are worried that front-runner Donald Trump or Texas Sen. Ted Cruz could be a drag on other Republicans on the ballot in a general election.\nDemocrats say a Trump or Cruz candidacy could be a windfall in their uphill battle to regain control of the House, where their numbers are the lowest since the Truman administration in the late 1940s.\nPresidential gift: Vice President Joe Biden has likened the GOP presidential race to a 'gift from the Lord' for Democrats trying to win back the House and Senate. Above he is pictured in Turkey on Saturday\nBiden joked to House Democrats at their annual retreat in Baltimore that he doesn't know which Republican to root for, though he didn't refer to any by name. Above he is pictured at the State of the Union on January 12\n'And by the way, we may be given a gift from the Lord in the presidential race here. I don't know who to root for more,' Biden told House Democrats.\nThe vice president, who considered and then decided against another presidential bid, urged Democrats to run on the accomplishments of the Obama administration, citing the improving economy and gains against Islamic State radicals, as well as proposals for free community college and increasing a tax credit for child care costs.\n'The best way to win is to run on what we've done and what we're for,' Biden said. 'And we should point out what they're for.'\nDemocrats would need to gain 30 seats in this November's elections to capture a House majority. Republicans currently outnumber them 247-188, a number that includes a vacant GOP district in Ohio that the party seems certain to retain.\nYet analysts agree Democrats have no real chance of winning control because only two to three dozen House seats are considered in play this fall, thanks to computer-drawn district lines that protect most incumbents.\nThe prospects are better in the Senate, where Democrats need to gain four seats if the party holds the White House.\nBiden (pictured last October) said the fight against ISIS is going better than is commonly appreciated. He predicted rebels would be defeated in Raqqa, Syria and Mosul, Iraq this year, mirroring recent gains in Ramadi\nRepublicans have more seats to defend, 24 to the Democrats' 10, and many of those GOP seats are in states President Barack Obama won, including Illinois, Wisconsin, Pennsylvania and Ohio.\nBiden steered clear of the divisive Democratic nomination struggle between Hillary Clinton and Vermont Sen. Bernie Sanders.\nBiden said the fight against ISIS is going better than is commonly appreciated. He predicted rebels would be defeated in Raqqa, Syria and Mosul, Iraq this year, mirroring recent gains in Ramadi, Iraq. He said part of the reason is that Obama got European allies 'to pony up.'\n'The idea that they're gaining and not losing is just not accurate,' Biden said.\nOn the political front, Democratic Leader Nancy Pelosi of California announced Thursday that she raised $40 million for House Democrats last year, including $30.4 million for the campaign committee. A prodigious fundraiser, Pelosi held 205 fundraisers in 35 cities.\nPelosi became a member of the Democratic leadership in 2002 and since then, has raised $468.9 million for Democrats.\nObama plans to address the meeting Thursday evening.\nDemocratic Leader Nancy Pelosi of California announced Thursday that she raised $40million for House Democrats last year. Above she is pictured next to Senate Minority Leader Harry Reid last year","url":"https://www.dailymail.co.uk/news/article-3421532/Biden-GOP-White-House-race-Its-gift-Lord.html"}
