{"authors":["Emily Mae Czachor"],"date_download":"2018-10-31 00:02:13","date_modify":"2018-10-31 00:02:13","date_publish":"2018-10-28 17:40:11","description":"Don't they say imitation is the highest form of flattery? It looks like Joe Jonas' Halloween costume put that saying to the test during what looked like a particularly festive pre-Hallow's Eve gathering Saturday night, Oct. 27. Funnily enough, with…","filename":"data/vaneerConsumption/JoeJonasHalloweenCostumeWillHaveGameOfThronesFansScreamingInTheBestWayPHOTO.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/28/c7792a84-9f2a-4754-8fc2-b92795a2cfd4-getty-1044669054.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_joe-jonas-halloween-costume-will-have-game-of-thrones-fans-screaming-in-the-best-way-photo-13009773_1540944133.html","title":"Joe Jonas' Halloween Costume Will Have 'Game Of Thrones' Fans Screaming In The Best Way - PHOTO","title_page":"Joe Jonas' Halloween Costume Will Have 'Game Of Thrones' Fans Screaming In The Best Way — PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"Don't they say imitation is the highest form of flattery? It looks like Joe Jonas' Halloween costume put that saying to the test during what looked like a particularly festive pre-Hallow's Eve gathering Saturday night, Oct. 27. Funnily enough, with fiancée Sophie Turner by his side, Jonas' Halloween ensemble is bound to have most Game of Thrones fans seeing double. Well, sort of.\nAs GoT fans know, Turner is certainly no stranger to the fictional Westeros landscape. (In fact, she's one of the few who's been around since the beginning.) Audiences probably know her best as Sansa Stark, fiery red-headed descendant of the elite House Stark, whose members have presided over Westeros' northern region for ages. Turner's been playing the fan-favored character since Game of Thrones first debuted way back in 2011, though her stint will — unfortunately — come to an end sometime next year, when the series wraps for good.\nAnd what better way to celebrate the end of Ms. Stark's onscreen era than a decked-out Halloween costume, crafted quite literally in the character's image? If Jonas' Instagram activity Saturday night was any indication, it looks like the DNCE frontman might reply to that question with something along the lines of \"there's no better way.\" And, after actually bearing witness to Jonas' Sansa Stark costume in all of its social media glory, it appears he'd be totally right.\n\"Another Saturday Nite,\" wrote Jonas, captioning a wonderfully goofy string of IG photos bound to have most everyone — yes, even the spooky dissenters — feeling the Halloween spirit. The back-to-back photo booth snapshots see both Jonas and Turner posing alongside a group of similarly well-costumed friends. At first glance, Turner's outfit does kind of steal the show. Donning a silvery, floor-length velvet jumpsuit, the Game of Thrones star seems to have dressed as an elephant for the weekend's Halloween shindig. For a closer look, head over to Turner's Instagram Story.\nJonas' costume — compared with his fiancée's, at least — was a little bit harder to peg, just based on those two photos. (Anyone else picking up on the Princess Fiona vibe happening here?) That said, if his costume's inspiration wasn't made entirely clear by Jonas' photo booth appearances, then the singer's Instagram Story will definitely do its part to clear things up. With the Game of Thrones soundtrack blasting in the background and more Game of Thrones-themed GIFs than you probably knew existed, the final installment to Jonas' latest IG Story sees him making his grand entrance as none other than — you guessed it — Sansa Stark.\nSuffice to say, if Game of Thrones hosted a costume contest, Jonas might very well win first prize. Not completely shocking, given that he's been engaged to Turner since October of last year, and has also been pretty vocal about his own personal affinity for the HBO series in the past. Back in April, Jonas told an Australian radio program that he's grateful Turner doesn't reveal any spoilers to him ahead of time, according to the Daily Mail. Why's that? \"Because I'm a fan of the show and I'm a big nerd at heart,\" Jonas told the outlet. He added,\n\"So if I was told how things were gonna turn out, I probably would have been disappointed because we have to wait so long for the next season.\"\nMost Game of Thrones fans are probably nodding their heads in solidarity at that last comment. (Seriously, when are we going to see that Season 8 release date, HBO?!) But, in the interim, at least they've got Jonas' spot-on — and honestly, endlessly endearing — Sansa Stark impression to tide them over.","url":"https://www.bustle.com/p/joe-jonas-halloween-costume-will-have-game-of-thrones-fans-screaming-in-the-best-way-photo-13009773"}
