{"authors":["Megan Pustetto For Daily Mail Australia"],"date_download":"2018-10-22 20:55:38","date_modify":"2018-10-22 20:55:38","date_publish":"2016-01-28 05:03:20","description":"He had been compared to rapper Eminem for sporting a surprising blond buzz cut for five months for a movie role, but Joel Edgerton has well and truly gone back to his natural looks.","filename":"data/vaneerConsumption/JoelEdgertonpromotesnewfilmJaneGotAGun.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30A6109D00000578-0-image-a-29_1453994109609.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420302_Joel-Edgerton-sparks-speculation-tied-knot-seen-silver-ring-wedding-finger-promotes-new-film-Jane-Got-Gun_1540241738.html","title":"Joel Edgerton promotes new film Jane Got A Gun","title_page":"Joel Edgerton promotes new film Jane Got A Gun | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He was compared to rapper Eminem while sporting a surprising blond buzz cut for five months for a movie role, but Joel Edgerton has well and truly gone back to his natural looks.\nThe actor seemed in jubilant spirits during a talk at New York's HuffPost Live, AOL and SiriusXM studios in New York on Wednesday.\nThe handsome star also flashed his favourite silver band ring, which he often wears on his left hand wedding finger.\nScroll down for video\nFeeling natural: During a promotional trail in New York on Wednesday, Joel Edgerton showed off his natural locks after having sported a blond hairdo for five months for a movie role\nChanging face: The star had been compared to rapper Eminem while sporting the peroxide look for months (L), but on Wednesday he back to his old self (R)\nThe Australian actor is on the promotional trail for his new movie Jane Got A Gun, and the 41-year-old star struck a chirpy demeanour as he addressed his audience at the crowded event.\nThe 41-year-old cut a casual figure for the event, wearing a pair of black denim jeans and white T-shirt, which he wore teamed with a black leather jacket.\nBefore the talk, the Sydney-born star arrived in a pair of navy trousers and matching coat as well as his signature newsboy hat and sunglasses.\nChat: The Australian actor is on the promotional trail for his new movie Jane Got A Gun\nLooking good: He cut a casual figure for the event, wearing a pair of black denim jeans and white T-shirt, which he wore teamed with a black leather jacket\nJoel has been spotted wearing his favourite ring on many occasions, including in 2013 when he promoted his film The Great Gatsby at the Cannes Film Festival.\nHis reps at the time told E! News that reports of it being a wedding ring were 'inaccurate' and that the actor is neither married nor engaged.\nJoel, who is believed to have remained single for the past 12 months, has previously dated Australian Olympic champion Cathy Freeman from 2003 to 2005.\nHe was also romantically linked with his The Waiting City co-star Isabel Lucas in 2009.\nFan favourite: Before he arrived at the studios he signed autographs for fans\nHis most high profile relationship, however, was with fashion designer Alexis Blake.\nThe pair were engaged to be married before they split in 2013.\nHe has also been linked to Mexican actress Fernanda Romero and his A Streetcar Named Desire co-star Robin McLeavy after they were picture holding hands on the closing night of the show.\nDapper: He arrived in a pair of navy trousers and matching coat worn over a T-shirt\nAccessorising: Joel was also seen wearing his favourite ring as he cosied up to co-star Natalie Portman at the premiere of Jane Got A Gun on Sunday\nIn August 2014 Joel confessed to Nine's 60 Minutes that he hoped to find that someone special soon.\nExplaining that seeing his brother Nash get married had an effect on him, he said: 'I envy him.'\nHe added: ‘I think the life of an actor is glamorous to other people but then the reality sets in - you don’t know where you will be next year, or how long you’ll be there for.\n‘I don’t want at the end of my life to look back at just a bunch of fictional movies I was involved in that kept taking me away from the real world.’\nOld flame: Joel's most high profile relationship was with fashion designer Alexis Blake. The pair were engaged to be married before they split in 2013\nWay back when: Joel previously dated Australian Olympic champion Cathy Freeman from 2003 to 2005\nOn-set romance: Joel and his The Waiting City co-star Isabel Lucas were said to have shared a brief romance during filming\nIn Jane Got A Gun, Joel plays a leading role of Dan Frost, alongside Natalie Portman who plays the starring role of Jane Hammond.\nThe Western drama sees Natalie play the headstrong Jane, who is happily married to Bill Hammond (Noah Emmerich) after being tormented by the Bishop Boys outlaw gang.\nHowever, when the group track down her partner and attempt to kill him, the valiant star is forced to ask her ex-fiance (Joel) for help to save her outlaw husband.\nThe film is set to be released on Friday in the US and also stars Ewan McGregor.\nJoel also recently stared in much-hyped biopic Loving which has sparked Oscar talk for the star, who recently also nabbed a Breakout Actor Hollywood Film Award for his role in Black Mass.\nLatest venture: Joel plays the role of Dan Frost in the soon-to-be-realeased film Jane Got A Gun","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420302/Joel-Edgerton-sparks-speculation-tied-knot-seen-silver-ring-wedding-finger-promotes-new-film-Jane-Got-Gun.html"}
