{"authors":["Rohan Banerjee For Mailonline"],"date_download":"2018-10-22 22:48:15","date_modify":"2018-10-22 22:48:15","date_publish":"2016-01-28 11:07:33","description":"Everton goalkeeper Joel Robles has apologised to Manchester City winger Kevin De Bruyne after trying to lift him up as he lay injured during the Capital One Cup semi-final on Wednesday night.","filename":"data/vaneerConsumption/JoelRoblesapologisestoKevinDeBruyneaftersuspectingManchesterCitystaroftimewasting.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30AA1F1F00000578-0-image-a-25_1453982352449.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420705_Joel-Robles-apologises-Kevin-Bruyne-suspecting-Manchester-City-star-time-wasting-lay-injured_1540248495.html","title":"Joel Robles apologises to Kevin De Bruyne after suspecting Manchester City star of time wasting","title_page":"Joel Robles apologises to Kevin De Bruyne after suspecting Manchester City star of time wasting | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Robles has since apologised for his mistake\nHe had scored and assisted in the 3-1 victory for Manchester City\nEverton goalkeeper Joel Robles has apologised to Manchester City winger Kevin De Bruyne after trying to lift him up as he lay injured during the Capital One Cup semi-final clash on Wednesday night.\nRobles thought that De Bruyne was feigning his injury in an attempt to run down the clock at the Etihad Stadium.\nThe Belgian, however, had fallen awkwardly following a tangle with Toffees defender Ramiro Funes Mori, seriously hurting his knee in the process.\nEverton goalkeeper Joel Robles apologised to Manchester City winger Kevin De Bruyne on Twitter\nRobles thought De Bruyne had been feigning his injury in the Capital One Cup semi-final\nRobles tried to lift De Bruyne up from the turf, believing him to be wasting time on Wednesday night\nDe Bruyne, who cost City £54million, left the Etihad Stadium on crutches after his injury\nRobles shows his disappointment after Everton were dumped out of the Capital One Cup by City\nRobles wrote on Twitter later: 'I would like to apologise to Kevin De Bruyne for my reaction to his injury. In the heat of the moment I didn't realise he was badly hurt.\n'I wish him all the best and a speedy recovery.'\nDe Bruyne, who came on in the match as a second-half substitute, played significant role in City's 4-3 aggregate win.\nHaving lost the first-leg 2-1 at Goodison Park, City were 1-0 down in the return on 18 minutes with Ross Barkley netting for the visitors.\nFernandinho's deflected strike put City level before De Bruyne turned home Raheem Sterling's low pass across the box to put the hosts in front; although the England had run the ball out of play in the build up.\nOn 76 minutes, De Bruyne crossed for striker Sergio Aguero to score a third City goal and prevent the match from going to extra-time.\nDe Bruyne falls awkwardly following a tangle with Everton defender Ramiro Funes Mori\nRaheem Sterling's assist for De Bruyne's goal looked to have been run out of play in the build-up\nCity will now play Liverpool in the final at Wembley next month.\nManager Manuel Pellegrini is optimistic about how long De Bruyne will be sidelined for.\nHe told the BBC: 'I'm optimistic he won't be out for the rest of the season. We'll see how important the damage is. It's not the cruciate ligament.'\nThe Chilean went on: 'The doctor thinks, but he cannot be sure, that it's a problem in his medial ligament.'","url":"https://www.dailymail.co.uk/sport/football/article-3420705/Joel-Robles-apologises-Kevin-Bruyne-suspecting-Manchester-City-star-time-wasting-lay-injured.html"}
