{"authors":["Paul Newman For Mailonline"],"date_download":"2018-10-22 20:27:30","date_modify":"2018-10-22 20:27:30","date_publish":"2016-01-28 01:26:36","description":"PAUL NEWMAN: Joe Root could be moved back to No 3 as England react to the top-order crisis that blighted their Test series success against South Africa.","filename":"data/vaneerConsumption/JoeRootcouldbemovingupasEnglandseektobolstertoporder.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30870F9E00000578-0-image-a-62_1453943028093.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-3420241_Joe-Root-moving-England-seek-bolster-order_1540240050.html","title":"Joe Root could be moving up as England seek to bolster top order","title_page":"Joe Root could be moving up as England seek to bolster top order | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Joe Root could be moved back to No 3 as England react to the top-order crisis that blighted their Test series success against South Africa.\nAlastair Cook admitted that Alex Hales, Nick Compton and James Taylor will come under scrutiny before the summer series against Sri Lanka and Pakistan and Trevor Bayliss has stated that he prefers two of his top three batsmen to be attacking.\nJoe Root could be moved back to No 3 after the top-order crisis that blighted England's Test series success\n‘We have a few options,’ said the England coach when asked about the fragile batting that led to the final Test capitulation. ‘For example, Root is at four but he’s our best player so does he go to three? It may be a little further down the line but it is one of the options we will have to discuss.’\nThe dilemma for England is that Root looks so comfortable at four, where he has grown into one of the best batsmen in the world, and before that at five where he was also a success.\nAlex Hales, Nick Compton and James Taylor are under pressure after top-order failed to deliver\nThere could yet be a reprieve for Compton and Hales, with Bayliss also admitting the pair could swap roles.","url":"https://www.dailymail.co.uk/sport/cricket/article-3420241/Joe-Root-moving-England-seek-bolster-order.html"}
