{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-22 23:52:07","date_modify":"2018-10-22 23:52:07","date_publish":"2016-01-29 12:18:05","description":"Joe Swash, 34, and Stacey Solomon, 26, finally appeared ready to show the world they're an item when they were spotted looking smitten after bowling at the City Pavilion in Essex.","filename":"data/vaneerConsumption/JoeSwashgazesintoStaceySolomonseyesastheyarespottedtogether.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B126DF00000578-0-image-a-14_1454067954779.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422623_Joe-Swash-gazes-Stacey-Solomon-s-eyes-spotted-time-couple_1540252327.html","title":"Joe Swash gazes into Stacey Solomon's eyes as they are spotted together","title_page":"Joe Swash gazes into Stacey Solomon's eyes as they are spotted together | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They've reportedly been dating for as long as two months.\nAnd it appeared Joe Swash, 34, and Stacey Solomon, 26, were finally ready to show the world they're an item when they were spotted looking smitten after bowling at the City Pavilion in Romford, Essex on Wednesday.\nThe two former I'm a Celebrity... Get Me Out of Here! winners were in high spirits, despite the wet weather, as they left the bowling alley side by side.\nScroll down for video\nThe look of love: Joe Swash, 34, and Stacey Solomon, 26, appeared finally ready to show the world they're officially an item as they were spotted looking smitten after bowling at the City Pavilion in Essex\nAnd the blossoming couple gazed adoringly at one another while they walked.\nFormer EastEnders star Swash donned a knitted grey flat cap for the fun-filled date as well as a denim jacket with the sleeves rolled up.\nHe teamed it with a plain white t-shirt and grey jeans, and completed his looked with a checked scarf and pristine white high-tops.\nBowled over: Former EastEnders star Swash donned a knitted grey flat cap for the fun-filled date as well as a denim jacket with the sleeves rolled up\nDon't rain on my parade: The two former I'm a Celebrity... Get Me Out of Here! were in high spirits, despite the wet weather, as they left the bowling alley side by side\nCan't take my eyes off of you: he blossoming couple gazed adoringly at one another while they walked\nHot date: He teamed it with a plain white t-shirt and grey jeans, and completed his looked with a checked scarf and pristine white high-tops\nMeanwhile, Stacey rocked an all black ensemble. The Dagenham girl pulled up the hood on her winter coat, with her sleek brunette tresses flowing out of it.\nHer black dress had a tasseled bottom, revealing her tanned legs and comfy trainers.\nIt looked to be thirsty work, with Joe purchasing a can of Coke and a packet of cigarettes. The actor was the designated driver on the day, leading the way to the car with his keys in hands.\nAccording to The Mirror, Essex-born Stacey has been singing the virtues of her new rapport with the soap actor - and claimed 'it's going really well'.\nGentleman: Joe chivalrously opened the door for his new girlfriend as they left the bowling alley\nBehind the wheel: The star was the designated driver on the day, leading the way to the car with his keys in hands\nIn need of refreshment: It looked to be thirsty work, with Joe purchasing a con of Coke and a packet of cigarettes\nWet, wet, wet: Stacey rocked an all black ensemble. The Dagenham girl pulled up the hood on her winter coat, with her sleek brunette tresses flowing out of it\nOn the run: Joe jogged to the car in a bid to prevent getting soaked\nSpeaking at Cirque du Soleil Amaluna launch, the mother-of-two told 3AM: It’s going really well. We’re having fun, spending time together and getting to know each other.'\nThe comments come just a day after it was revealed they'd progressed from friends to love interests following Stacey's split from Jackass star Steve-O last summer.\nMeanwhile, Joe has admitted he's pulling out all the stops to impress his new partner - particularly when it comes to maintaining his glow from the Australian jungle.\nExcited: Essex-born Stacey has been singing the virtues of her new rapport with Joe Swash\n'I’ve tried to keep my tan from the jungle with sunbeds,' he offered during a recent interview.\nNot that their relationship is necessarily brand new.\nAccording to reports the pair may have been dating for up to two months, which means they may have become involved shortly before Christmas.\nOld friends: It was previously reported that Joe harboured a crush on the mother-of-two during her stint on the ITV show in 2010 when he presented ITV2’s I’m A Celebrity’s spin-off\nThe pair were spotted on a romantic getaway at Champneys Henlow Health Spa in Bedfordshire last week for Joe’s 34th birthday.\nMailOnline have contacted representatives for the stars to comment.\nLast week, Stacey took to her social media sites to share a snap from the spa retreat, in the caption she gushed: ‘I have had the lovliest most relaxing day at @champneysspas I feel like a new women! Woo such a lucky girl! Thank you so much! [sic].'\nSee I'm A Celebrity news on Stacey Solomon and Joe Swash on them secretly dating\n'I feel like a new women!': The pair reportedly were spotted on a romantic getaway at Champneys Henlow Health Spa in Bedfordshire last week for Joe’s 34th birthday - Stacey posted this snap from the retreat\nIt was previously reported that Joe harboured a crush on her during her stint on the ITV show in 2010 when he presented ITV2’s I’m A Celebrity’s spin-off.\n‘Joe really fancies Stacey,’ a source said at the time. ‘He was gutted to hear she is dating someone but thinks he may still have a chance.’\nThe mother-of-two - who shot to fame on The X Factor in 2009, finishing third in the ITV talent contest - has been single since July, after splitting from Jackass star Steve-O.\nThe pair met and fell for each other after appearing on Channel 4's winter sports challenge programme The Jump in February 2015.\nCommon ground: The EastEnders actor (L) won the ITV series in 2008, while Stacey (R) was crowned Queen of the Jungle two years later\nBut a source told The Sun: 'Stacey found it hard being away from Steve-O so they decided to put their relationship on hold.\n'He has a huge tour in the States, as that's where his fanbase is. The relationship developed quickly and was a real whirlwind, but for the time being it's not to be.'\nMeanwhile, Stacey called off her engagement to her youngest son Leighton's father, painter Aaron Barnham in April 2014 after five years together.\nMeanwhile, Joe was previously in a two year relationship with former EastEnders co-star Kara Tointon, before splitting in 2010.\nThe TV presenter also has an eight-year-old son, called Harry, with ex-girlfriend Emma Sophocleous.\n'I treated myself to a new lipstick': Stacey recently took to social media to show off her latest grooming\nToo cute: Stacey pictured with her son Zach at Disney's The Princess and the Frog screening in 2009\nMoved on? The mother-of-two - who shot to fame on The X Factor in 2009, finishing third in the ITV talent contest - has been single since July, after splitting from Jackass star Steve-O","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422623/Joe-Swash-gazes-Stacey-Solomon-s-eyes-spotted-time-couple.html"}
