{"authors":["Danny Gallagher For Mailonline"],"date_download":"2018-10-23 02:58:54","date_modify":"2018-10-23 02:58:54","date_publish":"2017-04-26 14:16:16","description":"Following the revelations of Joey Barton's betting on football matches, it has been revealed the midfielder bet on himself to score first in one match while backing his team to lose in others.","filename":"data/vaneerConsumption/JoeyBartonbettingrevealshebackedhisteamtolose.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9FB8E300000578-0-image-a-42_1493210882489.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447758_Joey-Barton-betting-reveals-backed-team-lose_1540263534.html","title":"Joey Barton betting reveals he backed his team to lose","title_page":"Joey Barton betting reveals he backed his team to lose | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Following the revelations concerning Joey Barton's betting on football matches, it has been revealed the midfielder bet on himself to score first in one match while backing his team to lose in others.\nBarton has been suspended from football and football activity for 18 months and hit with a £30,000 fine from the football association as a result.\nAnd following the charges placed upon Barton the player has revealed the 'most pertinent' of the bets within a statement on his official website.\nJoey Barton has revealed he once bet on himself to score first during a Premier League match\nAmong the lengthy list of bets placed by the player, in one instance Barton can be seen to have backed himself to score first in a game against Fulham back in April 2006.\nOn that occasion Barton featured in the starting line-up for his then team Manchester City, backing himself with a £3 bet to be the first player to break the deadlock at the Etihad Stadium - a bet which he would go on to lose.\nBarton has admitted 'just over 1,200 were placed on football' by him in the time period of which the FA questioned, with other bets showing him to have backed his own team to lose.\nWhile playing for Newcastle in 2008 Barton placed several bets on the Tyneside club to be defeated in a friendly with Dutch opposition PSV, though this was a game in which Barton personally did not feature.\nBarton provided a list of some of the 'most pertinent' bets he had made on his website\nIn the same year the midfielder backed his team to lose to Manchester United in a Premier League clash - a game in which he staked £300 on the Red Devils and lost as a result of the Magpies holding out for a 1-1 draw. Again this was a game in which Barton did not play.\nOne of the 34-year-old's biggest wins at the expense of his own side came with a £350 bet placed against Newcastle to be defeated by Chelsea in late 2010 - a result which yielded £85 winnings and a £435 gross return. Barton again was not involved in the action.\nFollowing the news of the FA's action, Barton took to his personal website to issue a response, stating the decision has effectively forced him into an early retirement.\nWhile playing for Manchester City in 2006 Barton backed himself to score first against Fulham\n'The decision effectively forces me into an early retirement from playing football,' Barton wrote.\n'I accept that I broke the rules governing professional footballers, but I do feel the penalty is heavier than it might be for other less controversial players.'\nShedding light on the scale of and reasons for his gambling, Barton wrote: 'As for the scale of my football betting, since 2004, on a Betfair account held in my own name, registered at my home address and verified by my own passport, with full transparency, I have placed over 15,000 bets across a whole range of sports.\n'Just over 1,200 were placed on football and subject to the charges against me. The average bet was just over £150, many were for only a few pounds.\n'For the modern footballer, downtime and rest are important and I spend much of my time away from training in front of a TV screen, channel hopping across a range of sports, and betting on the outcome of games,' he added.","url":"https://www.dailymail.co.uk/sport/football/article-4447758/Joey-Barton-betting-reveals-backed-team-lose.html"}
