{"authors":["Press Association"],"date_download":"2018-10-23 03:35:12","date_modify":"2018-10-23 03:35:12","date_publish":"2017-04-26 14:59:09","description":"The 34-year-old midfielder has been suspended from all football activity for 18 months with immediate effect.","filename":"data/vaneerConsumption/JoeyBartonAtimelineofcontroversies.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/16/wire-466011-1493219353-145_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447944_Joey-Barton-A-timeline-controversies_1540265712.html","title":"Joey Barton: A timeline of controversies","title_page":"Joey Barton: A timeline of controversies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Joey Barton has been suspended from all football activity for 18 months with immediate effect after he admitted a Football Association misconduct charge related to betting.\nIt is far from the first time the 34-year-old midfielder, who plans to appeal against the length of the ban, has hit the headlines for the wrong reasons.\nHere, Press Association Sport details some of the other incidents:\nDecember 2004 – Stubs lit cigar in the eye of young team-mate Jamie Tandy during Manchester City’s Christmas party.\nJoey Barton at Manchester City (Phil Noble/PA)\nFined six weeks’ wages by the club. Forced to pay four weeks’ salary – approximately £60,000 – immediately, with a further two weeks suspended for a year. Tandy later sued Barton, winning £65,000 in damages.\nJuly 2005 – Involved in altercation with a 15-year-old Everton fan at City’s team hotel in Bangkok during a pre-season tour.\nBarton celebrates scoring a goal with team-mate Antoine Sibierski (Phil Noble/PA)\nFined eight weeks’ wages by City after being found guilty of gross misconduct.\nSeptember 2006 – Drops his shorts in the direction of Everton fans following City’s 1-1 draw at Goodison Park.\n(Phil Noble/PA)\nMay 2007 – Suspended by City after training-ground altercation with Ousmane Dabo, which leaves his team-mate needing hospital treatment.\nOusmane Dabo (Mike Egerton/Empics)\nCharged with assault and, on July 1, 2008, receives a four-month suspended jail sentence. Also punished by FA with a 12-match ban – six matches of which are suspended – and a £25,000 fine.\nMay 2008 – Jailed for six months after admitting common assault and affray during an incident in Liverpool city centre the previous December.\nBarton at Liverpool Crown Court (Peter Byrne/PA)\nNovember 2010 – Punches Blackburn winger Morten Gamst Pedersen during a 2-1 defeat for Newcastle at St James’ Park.\nMorten Gamst Pedersen (Tony Marshall/Empics)\nAccepts an FA charge and is banned for three games.\nJanuary 2012 – Unleashes an online tirade against the Football Association, labelling it an ”Orwellian organisation” in need of a ”drastic shake-up”.\n#QPR captain Joey Barton hits out at 'Orwellian' FA on Twitter: http://t.co/JFriI6dl (The Independent) — Simon Peach (@SimonPeach) January 26, 2012\nMay 2012 – While playing for QPR, is sent off for elbowing Carlos Tevez on the final day of the season at Manchester City.\nCarlos Tevez was floored after the clash with Barton (Mike Egerton/Empics)\nAlso knees Sergio Aguero, and attempts to headbutt Vincent Kompany before being ushered off the field. Later banned for 12 matches.\nSeptember 2016 – Now a Rangers player, Barton is banished from the club’s training ground following an alleged altercation with team-mate Andy Halliday.","url":"https://www.dailymail.co.uk/wires/pa/article-4447944/Joey-Barton-A-timeline-controversies.html"}
