{"authors":["Mike Keegan For The Daily Mail"],"date_download":"2018-10-23 02:11:25","date_modify":"2018-10-23 02:11:25","date_publish":"2017-04-26 13:07:33","description":"Sportsmail understands that if the former Man City, Newcastle United, QPR and Marseille midfielder was to seek a move abroad, the FA would ask FIFA to enforce a global ban.","filename":"data/vaneerConsumption/JoeyBartonBANNEDfromfootballfor18monthsforbetting.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F8E235100000578-0-image-a-154_1493208448638.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_sportsnews_article-4447532_Joey-Barton-banned-football-18-months_1540260685.html","title":"Joey Barton BANNED from football for 18 months for betting","title_page":"Joey Barton BANNED from football for 18 months for betting | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Joey Barton has been suspended from football for 18 months after he admitted a Football Association misconduct charge relating to betting on matches.\nThe controversial 34-year-old Burnley midfielder believes the decision has ended his career. The FA also fined him £30,000.\nSportsmail understands that if the former Manchester City, Newcastle United, QPR and Marseille midfielder was to seek a move abroad, the FA would ask FIFA to enforce a global ban.\nJoey Barton has been suspended from football for 18 months after admitting a betting charge\nBarton has also been fined £30,000 by the FA and warned about his future conduct\nBarton admits that the suspension may force him into early retirement from the game\nBarton has vowed to appeal against the penalty, which has been branded an over-reaction by figures within the game, but sources close to the Liverpudlian revealed to Sportsmail that he is now thinking about a career beyond football.\nBarton, who joined relegation-threatened Burnley after an acrimonious split from Rangers, placed 1,260 bets on matches between March 2006 and May 2016, breaching FA Rule E8.\nA number of those featured clubs he was at, but Barton was at pains to point out that he did not bet against his team while in the matchday squad.\nIn a statement, Barton, who admitted the charge, said he was ‘very disappointed at the harshness of the sanction’.\nHe said: ‘The decision effectively forces me into an early retirement from playing football. I accept that I broke the rules governing professional footballers, but I do feel the penalty is heavier than it might be for other less controversial players.’\nIn 2009, four players were suspended after betting on the outcome of a League Two match between Accrington and Bury which each had played in. The harshest penalty handed down was a 12-month ban with a £5,500 fine.\nBarton added: ‘One thing I can state with absolute certainty — I have never placed a bet against my own team when in a position to influence the game, and I am pleased that in all of the interviews with the FA, and at the hearing, my integrity on that point has never been in question.\n‘I could not live with myself, nor face my team-mates or the fans of the clubs I played for, if they seriously thought I would bet on my team to lose a game whose outcome I could influence.’\nHe listed one of his bets as £3 on himself to be first scorer for Manchester City against Fulham in a Premier League game in April, 2006 but City team-mate Richard Dunne scored the first goal in a 2-1 defeat.\nHe also backed his Newcastle side to beat Stevenage in an away FA Cup tie in 2011 only for them to lose 3-1.\nBarton said that since 2004, on an account with Betfair, he placed ‘over 15,000 bets across a whole range of sports’ — of which 1,260 were on football — staking an average of £150 per bet.\nBarton takes on Manchester United striker Anthony Martial during Sunday's game\nThe midfielder, pictured during his Rangers days, wrote a lengthy response to the FA ban and tried to explain his reasons\nHe added: ‘The average bet was just over £150, many were for only a few pounds. For the modern footballer, downtime and rest are important and I spend much of my time in front of a TV screen, channel hopping across a range of sports, and betting on the outcome of games.’\nThe news will come as a blow to Burnley, who lie five points above the relegation zone with four matches to play.\nPundit Gary Lineker described the punishment as ‘harsh’ and added that he was looking forward to the FA ‘clamping down on betting company adverts or sponsorship in football’. Bookmakers Ladbrokes are the FA’s official betting partner.","url":"https://www.dailymail.co.uk/sport/sportsnews/article-4447532/Joey-Barton-banned-football-18-months.html"}
