{"authors":["Abc News"],"date_download":"2018-10-30 00:53:53","date_modify":"2018-10-30 00:53:53","date_publish":"2018-10-28 19:36:23","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.","filename":"data/vaneerConsumption/JoeyLoganobumpspastMartinTruexJrtoclinchtitleberth.json","image_url":"http://media.video-cdn.espn.com/motion/2018/1029/dm_181029_kershaw_machado_future/dm_181029_kershaw_machado_future_default.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Sports_joey-logano-bumps-past-martin-truex-jr-clinch_story_id=58814185_1540860833.html","title":"Joey Logano bumps past Martin Truex Jr. to clinch title berth","title_page":"Joey Logano bumps past Martin Truex Jr. to clinch title berth - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"MARTINSVILLE, Va. -- When the reigning series champion slipped past him with one lap to go at Martinsville Speedway, Joey Logano figured he had lost his shot at racing for NASCAR's title.\nA win would earn Logano one of the four spots in the winner-take-all championship at Homestead-Miami Speedway. So if he didn't try something, his chance at a Cup championship might slip away.\nLogano used an old fashioned bump-and-run on Martin Truex Jr. to Sunday and snatch one of the four tickets to the finale. Truex slid sideways across the finish line and promptly declared Logano won't take his title from him this year.\n\"He may have won the battle, but he ain't winning the damn war. I'm not going to let him win it (the championship.) I'm going to win it,\" Truex fumed.\nLogano took Truex's warning in stride.\n\"OK. That's expected,\" Logano said. \"This was our shot, maybe our only shot, so we had to make it happen.\"\nLogano was showered in boos and Truex, standing on pit road next to his third-place car, jeered the winner with both thumbs down as Logano was interviewed over the public address system. On pit road, Truex crew chief Cole Pearn Jr. had an angry exchange with Logano crew chief Todd Gordon. Nearly 30 minutes later, Pearn still appeared visibly angry.\nTruex and Pearn are part of Furniture Row Racing, which is shutting down at the end of the season, a year removed from its championship run. Naysayers cast doubt on the No. 78 defending its title with the closure looming, but both driver and crew chief are determined to prove everyone wrong.\n\"With everything we've got riding on it, the team closing down, it's tough to take,\" Pearn said of his confrontation with Gordon. \"I used a few choice words I probably shouldn't have. I probably shouldn't be around a baseball bat or a jackhammer right now.\"\nLogano won the opening race to the third round of the playoffs by using the bumper on his Ford to shove Truex out of his way on the final lap. The contact caused both cars to wiggle, but Truex's slide was nearly sideways while Logano corrected after a swerve and straightened himself out as he hurtled across the finish line.\n\"I'm a hard racer, I don't think that's a secret to anyone, and we are here to win a championship this year,\" Logano said.\nEight drivers started the day vying for the four spots in the season-finale at Homestead-Miami Speedway. Now one of the slots is gone, to Logano of Team Penske, and NASCAR's so-called \"Big 3\" is still trying to lock down a berth. Truex, along with Kevin Harvick and Kyle Busch, dominated the regular season and as a trio were expected to make it to Miami to race for the winner-take-all title.\n\"We should be in victory lane right now,\" said Truex. \"I was next to him for six laps, I never knocked him out of the way. We were going to race hard for it, in my book. I cleared him fair and square. We weren't even banging doors.\n\"And he just drove into the back of me and knocked me out of the way. Yeah, it's short track racing. But what goes around comes around.\"\nLogano was aware how he won was not popular but his eyes are on the bigger prize.\n\"He raced really clean and I laid the bumper to him. I don't expect him to be happy,\" Logano said. \"We've got to do what we've got to do, and he's got to do what he's got to do, and we'll hash it out one way or the other. That's NASCAR racing. That's what the grassroots are, that's what fans come here to see. Some may not like it.\"\nLogano led a race-high 309 of the 500 laps but had to contend with Penske teammate Brad Keselowski in the waning laps. That gave time for Truex, whose Toyota failed inspection prior to the race so he started 31st, to close in on the leaders.\nTruex first got past Keselowski, who raced Logano so hard it is clear Penske does not have team orders, and got to Logano with 10 laps to go. They raced side-by-side, door-to-door, round-and-round the Virginia paperclip until Truex finally got the lead with one lap remaining.\nTruex thought he was clear and headed to not only the right to defend his championship, but also his first career victory on a short track. Instead, Logano used his bumper to claw the victory back into his control and earned an enemy while doing so.\nMore from Martinsville:\nTEAM ORDERS: Roger Penske downplayed the questionably hard racing Keselowski waged with Logano with so much on the line for the organization. Had Logano slipped even the slightest, the team would have been heavily criticized for not allowing Logano to have an easier path to the victory.\nPenske dismissed any drama.\n\"Brad knew what had to happen here today. I told them to use their heads. That's all I said. He knew exactly what was going on,\" Penske said, adding Keselowski also didn't deliberately impede Truex trying to move closer to Logano.\n\"Brad could have blocked (Truex). You saw he didn't make it too hard for him to go by, so let's get on with it.\"\nHAMLIN COMES CLOSE: Denny Hamlin has won at least one race every season since his 2006 rookie campaign but that streak is in jeopardy with three races remaining. He finished second at Martinsville, where he is a five-time winner.\nAs he saw Logano move Truex ahead of him, he had just one thought: \"Crash harder. Just crash harder. That's all I was hoping,\" Hamlin said.\nUP NEXT: The middle race of the third round of the playoffs, Sunday at Texas Motor Speedway. Kevin Harvick is the defending race winner and Kyle Busch won there earlier this season.","url":"https://abcnews.go.com/Sports/joey-logano-bumps-past-martin-truex-jr-clinch/story?id=58814185"}
