{"authors":["Press Association"],"date_download":"2018-10-23 02:22:30","date_modify":"2018-10-23 02:22:30","date_publish":"2017-04-26 13:24:09","description":"The Burnley midfielder has been suspended from all football activity for 18 months after admitting a misconduct charge relating to betting.","filename":"data/vaneerConsumption/JoeyBartonaccusesgameofsendingmixedmessageongamblingsprosandcons.json","image_url":"https://i.dailymail.co.uk/1/2017/04/27/08/wire-470249-1493276963-663_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447600_FA-bans-Burnley-s-Joey-Barton-18-months-breaking-rules-betting_1540261350.html","title":"Joey Barton accuses game of sending mixed message on gambling´s pros and cons","title_page":"Joey Barton accuses game of sending mixed message on gambling´s pros and cons | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Joey Barton has called on football to reconsider its links with the gambling industry after the Football Association banned him for 18 months for breaking its betting rules.\nThe governing body imposed the sanction because he placed 1,260 bets on matches between March 2006 and May 2013. He was also fined £30,000.\nAt 34, the Burnley midfielder believes the ban will effectively end his career and has said he will appeal against its length.\nJoey Barton\nPress Association Sport understands he has not yet confirmed this to the FA and there is no guarantee he would be allowed to play pending that appeal. Burnley are currently 16th in the Premier League, five points above relegation, with four games to play.\nBut it is the questions Barton raises about football and gambling which will provoke the most debate, as many will sympathise with the points raised in an almost 1,500-word statement on his website.\nMidfielder @Joey7Barton has been suspended from all football activity after admitting an FA misconduct charge: https://t.co/reUbzOTn78 — The FA (@FA) April 26, 2017\n“I think if the FA is truly serious about tackling the culture of gambling in football, it needs to look at its own dependence on the gambling companies, their role in football and in sports broadcasting, rather than just blaming the players who place a bet,” he wrote.\n“Surely they need to accept there is a huge clash between their rules and the culture that surrounds the modern game, where anyone who watches football on TV or in the stadia is bombarded by marketing, advertising and sponsorship by betting companies, and where much of the coverage now, on Sky for example, is intertwined with the broadcasters’ own gambling interests.\n“That all means this is not an easy environment in which to try to stop gambling, or even to encourage people within the sport that betting is wrong.\n“It is like asking a recovering alcoholic to spend all his time in a pub or a brewery. If the FA is serious about tackling gambling I would urge it to reconsider its own dependence on the gambling industry. I say that knowing that every time I pull on my team’s shirt, I am advertising a betting company.”\nMy response to the FA's sanction and for transparency the table of bets involved. https://t.co/U4H6ByhVcd — Joey Barton (@Joey7Barton) April 26, 2017\nBurnley are sponsored by Dafabet, making them one of 10 Premier League clubs who advertise gambling firms on their shirts.\nThe FA tightened the rules on betting in 2014 to stop players in England’s top eight divisions betting on any football-related activity, anywhere in the world. Previously, players were not allowed to bet on games or competitions they were involved in or could influence.\nBarton’s statement starts with an acknowledgement that football should have gambling rules and an acceptance he has broken them.\nDescribing himself as an addict who grew up in a culture where gambling was normalised, the Liverpudlian admits to placing more than 15,000 bets on sport since 2004. But he goes on to say he is “very disappointed at the harshness of the sanction” and suggests he has been punished more seriously because of his reputation.\nBarton has served numerous FA bans for misconduct during his 15-year professional career, including a one-match ban from the Scottish FA for placing 44 football bets whilst playing for Rangers last year. He also twice been convicted of assault, spending 11 weeks in prison in 2008.\nSince then he has tried to control his temper, tackle his drinking and cultivate interests in philosophy and politics. The latter has led to him campaigning for gay rights and appearing on the BBC’s Question Time.\nBarton’s statement lists the bets he made that the FA has flagged up as the most problematic, as they involved his club, although he was only playing in five of these games. These 30 bets, made between 2006 and 2011, resulted in only three wins and losses of more than £3,000.\nAddressing the central issue that he made several bets on his own team to lose, he stressed he has “given everything” in every game he has played and was not involved in the matchday squads for any of those games.\n“One thing I can state with absolute certainty - I have never placed a bet against my own team when in a position to influence the game, and I am pleased that in all of the interviews with the FA, and at the hearing, my integrity on that point has never been in question.”","url":"https://www.dailymail.co.uk/wires/pa/article-4447600/FA-bans-Burnley-s-Joey-Barton-18-months-breaking-rules-betting.html"}
