{"authors":["Chris Spargo For Dailymail.Com"],"date_download":"2018-10-23 02:21:21","date_modify":"2018-10-23 02:21:21","date_publish":"2016-01-28 17:07:30","description":"Joey Feek got a surprise visit from that special friends on Wednesday that put a big smile on the dying singer's face - baby puppies to cheer her up as she is facing her final days in her cancer battle.","filename":"data/vaneerConsumption/JoeyFeekgetsasurprisevisitfromsomepuppiesinherfinaldays.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC851000000578-0-image-a-84_1454000702448.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421152_Joey-Feek-gets-surprise-visit-baby-puppies-final-days-putting-smile-face-country-singer-continues-battle-terminal-cancer_1540261281.html","title":"Joey Feek gets a surprise visit from some puppies in her final days","title_page":"Joey Feek gets a surprise visit from some puppies in her final days | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"the story about how she first fell in love with her husband Rory, 49\nJoey Feek got a surprise visit from some special friends on Wednesday that put a big smile on the dying singer's face - puppies!\nJoey's husband Rory posted a photo of his wife with the adorable canines on Facebook, writing; '....some baby puppies came to play with Indy the other day, but I think her mama loved their visit the most.'\nIt was a special moment for the family as Joey is in her final days fighting terminal cancer.\nScroll down for video\nSo happy: Joey Feek got a visit from some puppies on Wednesday (above)\nBaby joy: The tiny canines were meant to cheer up her daughter Indiana (above), but they put a big smile on her face as well, according to husband Rory\nFamily: Joey, 40, shared in a recent interview the story about how she first fell in love with her husband Rory, 49\nIn a blog post on Thursday, Rory wrote about how close the couple was in these final days - and how close they have always been since they first met.\n'My wife will tell you… I really do believe in magic. Not the kind with cards tricks or rabbits being pulled out of hats, but the kind that God does – where He brings something out of you and your life that you never-in-a-million-years thought was possible...', writes Rory.\n'Like our beautiful marriage… or our music career… or the greatest magic of all in our lives… our little Indiana. She’s the most precious addition that God has given us.'\nHe then addressed the difficulty of what their family is dealing with as Joey fights cancer.\n'Joey and I both have questions. Lots of them. Hard questions that we don’t have any answers for. But still, we have faith – we choose to believe.\n'I think that’s why they call it faith. If we knew all the answers, no faith would be required.\n'And so Joey and I do our best each day to only see the plus’s in our life…like all the extra days and weeks that we’ve been given together (the doctors here didn’t expect Joey to make it to Thanksgiving, and here we are near the end of January), and all the beautiful conversations and time we’ve had with her family.\n'And the amazing gift of life-slowing-down-to-a-crawl and only having and needing THIS moment in time. And of course, the incredible amount of love and support that the whole world has shown for us during this special time.\n'And every morning, when our little one wakes and I pick her up from her crib and take her in to see her mama – and her sleepy little almond eyes look into ours, once more we see…the amazing power of the plus-sign.\n'Joey+Rory = Indy.'\nTragedy: Feek was given just six weeks to live by doctors in October after her stage IV cervical cancer diagnosis\nJoey, 40, shared how she first fell in love with Rory in an interview with People last week, saying; 'Rory was singing 'In the Round' at the Bluebird Cafe in Nashville with three other songwriters.\n'I was just one of dozens of people in the audience that night. From the first song Rory sang, I fell head over heels for him.'\nShe then added: 'I didn't even know him, but something inside me said, \"You're going to marry that man and spend the rest of your lives together.\"'\nRory, 49, recently revealed that he and Joey would be releasing a new album next month comprised of a collection of hymns.\nThat album, Hymns That Are Important to Us, will be available on February 12, three days before the couple compete for a Grammy in the Best Country Duo/Group Performance category with their song If I Needed You.\nFebruary is also a big month for the pair as it is when Indiana will turn 2-years-old, a milestone Joey has said she hopes to be around for despite her prognosis.\nJoey had appeared to be defying the odds after being given six months to live last October, making remarkable progress over the past few weeks despite being told she would be bedridden for the remainder of her life in late November.\nShe got out of bed in December and then began to walk again, all things that seemed impossible just weeks before.\nShe even got to spend Christmas with her family near her childhood home in Alexandria, Indiana.\nJoey's good luck took a turn however this past weekend, with Rory revealing that her condition had gotten worse.\n'And now, here I sit beside my dying wife,' Rory wrote on his blog. 'She said she told him that if He’s ready to take her… she’s ready to come home.'\nHe then added: 'Her pain and discomfort has continued to increase daily and so has the morphine to help her be comfortable.\n'The dosage she’s needed to keep the pain away has quadrupled in the last four days. I’d like to tell you that she’s doing great and is going to beat this thing. But I can’t.'\nJust two weeks earlier the pair had celebrated Christmas together, with Joey getting a chance to see her family and friends and open gifts with Indiana and her step-daughters.","url":"https://www.dailymail.co.uk/news/article-3421152/Joey-Feek-gets-surprise-visit-baby-puppies-final-days-putting-smile-face-country-singer-continues-battle-terminal-cancer.html"}
