{"authors":["Press Association Reporter"],"date_download":"2018-10-22 23:27:19","date_modify":"2018-10-22 23:27:19","date_publish":"2016-01-11 05:52:24","description":"Johanna Konta is still waiting for her first win of the 2016 season after she exited the Hobart International with a first-round defeat to Dominika Cibulkova.","filename":"data/vaneerConsumption/JohannaKontawasteschanceasDominikaCibulkovaknocksheroutinHobart.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/05/30049D2500000578-0-image-a-54_1452491482300.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-3393426_Johanna-Konta-wastes-chance-Dominika-Cibulkova-knocks-Hobart_1540250839.html","title":"Johanna Konta wastes chance as Dominika Cibulkova knocks her out in Hobart","title_page":"Johanna Konta wastes chance as Dominika Cibulkova knocks her out in Hobart  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Johanna Konta is still waiting for her first win of the 2016 season after she exited the Hobart International with a first-round defeat to Dominika Cibulkova.\nThe British No 1 slipped to a 7-6 (8/6), 7-5 loss, but she will be regretting missed chances as she wasted five first-set points and failed to capitalise on three break of Cibulkova's serve in the second.\nIt looked like being a far more routine defeat for Australia-born Konta as she lost the first four games of the match, struggling to cope with the third seed's power from the baseline.\nJohanna Konta was eliminated from the Hobart International after a first-round defeat in Australia\nKonta plays a backhand during the match which ended in a 7-6 (8/6) 7-5 win for opponent Dominika Cibulkova\nBut from 5-1 down she mounted an impressive recovery to take the first set to a tie-break, which she then bossed, taking a commanding 6-1 lead.\nHowever, a capitulation allowed Cibulkova to reel off seven successive points to take the breaker 8/6.\nThe second set was a topsy-turvy affair that contained seven break of serves.\nKonta was in the early ascendancy, breaking to go 2-0 and 3-1 to the good, but each time she conceded her own serve straight away before another exchange of breaks saw it head to 5-5.\nThen Cibulkova got a vital fourth break in the 11th game, coming back from 0-40, to leave her serving for the match.\nKonta gave herself a chance, forcing 0-30, but the Slovakian served it out to book her place in the second round.\nCibulkova proved to be too strong for the British No 1 as the Slovakian won the match in straight sets","url":"https://www.dailymail.co.uk/sport/tennis/article-3393426/Johanna-Konta-wastes-chance-Dominika-Cibulkova-knocks-Hobart.html"}
