{"authors":["Press Association"],"date_download":"2018-10-23 03:11:58","date_modify":"2018-10-23 03:11:58","date_publish":"2016-01-29 18:01:22","description":"Johanna Konta is looking forward to some time with her family and sleeping in her own bed after the Briton's whirlwind run to the Australian Open semi-finals...","filename":"data/vaneerConsumption/Johannakontalookingforwardtofamilytime.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-4d4996fb-47cf-4a28-9379-bd26187123c6-3bmscybNe842cce83474b588ab31-297_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3422301_Johanna-Konta-looking-forward-family-time_1540264318.html","title":"Johanna konta looking forward to family time","title_page":"Johanna konta looking forward to family time | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Johanna Konta looking forward to family time\nJohanna Konta is looking forward to some time with her family and sleeping in her own bed after the Briton's whirlwind run to the Australian Open semi-finals.\nKonta was bidding to become the first female British grand slam finalist since Virginia Wade won Wimbledon 39 years ago but her hopes were dashed on Thursday as Angelique Kerber sealed a 7-5 6-2 victory.\nThis was the first year Konta had ever made it into the Australian Open main draw, let alone the semis, as 12 months ago she lost in the first round of qualifying.\nJohanna Konta is looking forward to spending time with her family\n''I don't feel very different,'' said Konta, who is expected to climb into the world's top 30 at the end of the tournament.\n''Both times I was looking forward to going home to see my family.\n''I go home to see my parents, spend some time in my own bed. That stays the same.\n''It depends what you view as disappointment. I don't live my life and feel my happiness or joy on my wins and losses.''\nKonta had been hoping to extend Britain's excellent showing in Melbourne, with Andy Murray playing Milos Raonic on Friday in the semi-finals of the singles and Jamie Murray making it through to the doubles final alongside Brazilian Bruno Soares.\nJamie Murray wants to make it third time lucky after he lost with former partner John Peers in the finals at both Wimbledon and the US Open last year.\nHe and Soares, who linked up at the start of this season, will face the experienced duo of Canada's Daniel Nestor and Czech Radek Stepanek on Saturday.\n''I think I know what to expect,'' Murray said.\n''Obviously I came up on the wrong side the last two times I was in the final but it wasn't like I played bad matches or anything like that.\n''I fully trust myself that I can perform in those matches. I believe Bruno can as well. I think the mentality we've got and the chemistry we seem to have struck up these last couple of weeks will bode well for us.\n''We'll give it all we've got. We know it's going to be a tough match.''\nWhile Jamie's brother Andy looks to book a Sunday showdown with Novak Djokovic, Britain already has one player into a singles final this weekend after Gordon Reid beat Argentina's Gustavo Fernandez 6-3 6-7 (6/8) 9-7 in the last four of the wheelchair event.\nReid wondered if he would ever play tennis again after contracting Transverse Myelitis - a disease affecting the spinal cord - aged 12 but now the 24-year-old Glaswegian has a shot at a grand slam title.\n''As it turns out, the disease has given me the kind of opportunity I've got today and I'm so thankful for that,'' said Reid, who plays Belgium's Joachim Gerard on Saturday.\n''I never would have been in a grand slam final if I wasn't in a wheelchair.\n\"I never would have been here in Melbourne sharing the facilities with guys who were my idols growing up, Andy Murray and Roger Federer, guys like that.","url":"https://www.dailymail.co.uk/wires/pa/article-3422301/Johanna-Konta-looking-forward-family-time.html"}
