{"authors":["Monique Friedlander","Andrew Court For Daily Mail Australia"],"date_download":"2018-10-23 04:56:24","date_modify":"2018-10-23 04:56:24","date_publish":"2017-04-26 16:34:20","description":"Celebrity hairstylist Joh Bailey has slammed reports made by The Daily Telegraph alleging that he has been struggling with a substance abuse problem.","filename":"data/vaneerConsumption/JohBaileyslamsreportshehasasubstanceproblem.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA07B0100000578-0-image-a-51_1493220192291.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4448332_Joh-Bailey-admits-substance-problem-crossed-line_1540270584.html","title":"Joh Bailey slams reports he has a substance problem","title_page":"Joh Bailey slams reports he has a substance problem | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Celebrity hairstylist Joh Bailey has slammed a report made by The Daily Telegraph alleging that he has been struggling with a substance abuse problem.\nSpeaking to the Sydney Morning Herald Joh said he was 'bewildered' by the story and that he will 'talk to a lawyer'.\nThe hairdresser to the stars refuted that he had spoken directly to The Daily Telegraph, and that his statements about being 'out of control' appeared in an official statement provided to the paper.\n'Business as usual, nothing has changed': Celebrity hairstylist Joh Bailey has slammed a report published by The Daily Telegraph alledging has a substance abuse problem and is stepping away from his business\n'Business as usual, nothing has changed, I am not taking a back seat nor am I out of control,' he told the Sydney Morning Herald.\n'And it is true that I have been disappointed with my own behaviour and I have promised my business partner Marilyn Koch that I will no longer drink in public, but I am hardly out of control,' Bailey told PS.\nHe also denied reports that he was escorted by security from a Sydney hotel after being asked to leave the premises last week.\n'Yes I might have been a bit tipsy but I wasn't punching people or being disgraceful,' he said of the incident.\nStylist to the stars! Hairstylist to the stars: Joh worked with Jane Fonda in 2014\nDaily Mail Australia has reached out to Joh Bailey for comment.\nOn Wednesday, The Daily Telegraph reported that Joh had revealed he is 'doing what has to be done to get healthy' and that he had said he 'crossed the line', then went ahead and claimed that he had a 'substance abuse' problem.\nJoh appears to have simply told the the publication he is concentrating on his health at the current time.\nVIP: Joh has become a celebrity in his own right, invited to many exclusive events (pictured in 2013 with Kerri-Anne Kennerley)\nFashion insider: Joh pictured with designer Alex Perry\nHowever, The Daily Telegraph reported that 'personal struggles have plagued him since his teens'.\nThe hairstylist first trimmed tresses in Sydney's exclusive Double Bay more than thirty years ago, and today has a booming business empire, with a slew of salons in his name.\nHowever, The Daily Telegraph claimed that Joh is taking a step back from work, with his business partner Marilyn Koch supposedly taking the reigns, claims which Joh strongly denies.\nSocialite! Joh has become a fixture on the Australian social scene over the past few decades, and was recently seen on The Real Housewives of Sydney\nJoh has become a fixture on the Australian social scene over the past few decades, and was recently seen on The Real Housewives of Sydney.\nIt comes after Joh made headlines after reports emerged that he was asked to leave a friend's wedding in Bali due to unruly behaviour.\nHe once again denied this report, telling the Sydney Morning Herald that he had been 'stitched up' and that he had left the party upon his own volition when it became apparent he was no longer welcome.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4448332/Joh-Bailey-admits-substance-problem-crossed-line.html"}
