{"authors":["Chris Spargo For Dailymail.Com"],"date_download":"2018-10-23 04:32:45","date_modify":"2018-10-23 04:32:45","date_publish":"2017-04-26 16:14:34","description":"Johnny Depp is firing back at his former managers after they claimed that the Hollywood star had no one to blame but himself for being $40million in debt, and revealing he spent $5m on a cannon.","filename":"data/vaneerConsumption/JohnnyDeppslamsformermanagersinfinanciallawsuit.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA049F300000578-0-image-a-24_1493217906454.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447644_Johnny-Depp-slams-former-managers-financial-lawsuit_1540269165.html","title":"Johnny Depp slams former managers in financial lawsuit","title_page":"Johnny Depp slams former managers in financial lawsuit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Johnny Depp is firing back at his former managers after they publicly stated that the Hollywood star has no one to blame but himself for being $40million in debt.\nBrothers Robert and Joel Mandel of The Management Company said in court papers that Depp's spending had become outrageously reckless in recent years, revealing that the actor at one point paid $3million to purchase 'a specially-made cannon' so that he could shoot the ashes of author Hunter Thompson over Aspen, Colorado.\nThe brothers submitted those court papers in response to a $25million lawsuit that Depp had filed two weeks prior, which alleged that the Mandels had caused his financial collapse by swindling their A-list client out of tens of millions of dollars while mismanaging his money.\nDepp is now sharing more details about that lawsuit in an interview with the Wall Street Journal, while also arguing that his personal spending should not even be a topic of discussion in this ongoing legal battle.\n'It’s my money. If I want to buy 15,000 cotton balls a day, it’s my thing,' argued the twice-divorced father of two.\nDepp also pointed out that the brothers' claim he had spent $3million on a cannon to fire off the ashes of his friend Thompson was a complete fabrication.\nThe cannon actually cost $5million said Depp.\nScroll down for video\nBack in black: Johnny Depp (above in march at Lady Gaga's birthday party) is responding to claims made by his former managers that his lavish lifestyle and reckless spending has left him $40million in debt\nSomber spend-off: The actor's former managers, Robert and Joel Mandel, revealed in court papers that Depp once bought a $3m cannon to shoot Hunter Thompson's ashes over Aspen (left while under construction, right during blastoff in 2005)\nDepp alleged in his lawsuit that TMG took took tens of millions of dollars without his consent over the years while also failing to perform their fiduciary duties.\nThe Mandels responded to that lawsuit by filing their own countersuit, in which they detailed their client's $2-million-a-month lifestyle and stated that for 17 years they did everything they could to 'protect Depp from his own irresponsible and profligate spending.'\nDepp questioned why the brothers would have kept him on as a client however if his financial situation was as dire as they paint it out to be in their court filings.\n'Why didn’t they drop me as a client if I was so out of control?' asked the Oscar nominee in his WSJ interview.\n'I’ve worked very, very hard for a lot of years and trusted a lot of people, some who’ve clearly let me down.'\nDepp filed his $25million lawsuit after claiming he discovered that he had been a victim of 'gross misconduct at the hands of his business managers' according to the original filing.\nThe actor claims he learned this shortly after he left The Management Group, who he had been with since just before his career took off in 1999, with the already A-list star becoming the highest-paid actor in the world following the success of the 'Pirates of the Caribbean' franchise.\n'Like many successful artists who depend on financial professionals to advise them, Mr. Depp trusted and reasonably relied on TMG to handle his financial and certain legal affairs and to ensure that he and his family would have a financially secure future, built upon the foundation of the substantial moneys Mr. Depp earned through years of hard work,' read the complaint, which was filed in Superior Court of California for the State of Los Angeles.\n'But instead, as a result of years of gross mismanagement and at times, outright fraud, Mr. Depp lost tens of millions of dollars and has been forced to dispose of significant assets to pay for TMG’s self-dealing and gross misconduct.'\nNot having it: The thrice-married father of two said that his spending has nothing to do with his debt, and in a $25m lawsuit claims the Mandels (Joel and Robert above) mismanaged his money\nChecked-out companions: Depp was with longtime partner Vanessa Paradis when he first began working with the Mandels, and then after their split married Amber Heard (right last April)\nThe complaint went on to state that the misconduct was not discovered until Depp 'hired new business management and accounting services' and 'learned the gravity of his financial losses and some, but surely not all, of the underlying facts.'\nThis alleged misconduct was detailed later in the complaint, and included: the more than $28million in contingency fees TMG paid itself without any written agreement from Depp, a $5.6million fine that the actor incurred when TMG failed to file his federal taxes on time, and a $10million loan made by TMG to a third party using their client's money without his consent.\nA spokesperson for the Mandels refuted all these claims in a statement soon after, and said that Depp was using the lawsuit to try and protect himself against foreclosure proceedings TMG was about to begin on one of his properties.\n'The Management Group, have been trusted business managers to some of the most successful individuals and companies in the entertainment business,' said Miochael Kump, the attorney for the brothers.\nStill got it: After a year of financial woes and abuse allegations, Depp was awarded the Favorite Movie Icon Award at the People's Choice Awards in January\n'For 17 of those years, they did everything possible to protect Depp from his irresponsible and profligate spending.'\nKump then went on to detail how Depp came to own TMG millions, which they say he still has yet to pay.\n'In December 2012, Depp faced financial ruin with the impending default on a $5 million bank loan. The Mandels bailed him out by loaning him $5 million, which he promised to repay by January 2014,' said Kump.\n'Although Depp later changed managers, he never alleged any wrong doing.'\nHe went on to state: 'In October 2016, with Depp still owing $4.2 million, the Mandels started non judicial foreclosure proceedings against certain of Depp’s properties.\n'Depp’s lawsuit, filed on the eve of the sale of those properties, is a transparent attempt to derail the foreclosure by concocting and spreading malicious lies about the Mandels.'\nHe closed out the statement by saying: 'His tactics and lawsuit will fail, and he will be forced to pay back the loan as promised.'\nSoon after, the Mandel brothers filed their countersuit in which they revealed details of Depp's alleged spending habits.\n'Depp lived an ultra-extravagant lifestyle that often knowingly cost Depp in excess of $2 million per month to maintain, which he simply could not afford,' read the suit.\n'Depp, and Depp alone, is fully responsible for any financial turmoil he finds himself in today.'\nWhine: 'It’s my money. If I want to buy 15,000 cotton balls a day, it’s my thing,' argued the thrice-divorced father of two (Depp above in 2011)\nLittle town: Depp purchased 14 residences in the South of France according to the brothers' countersuit (property above)\nLittle quiet village: The cost of the residences and the massive property came to $75million (above)\nThe suit later revealed that Depp spent $75million to purchase 14 residences in the South of France, $18million to purchase and remodel a 150-foot yacht, splashed out $30,000 each month on wine and had a fleet of at least 45 luxury vehicles.\nOther costs included Depp's full-time staff of 40 employees that cost him $300,000 per month, $150,000 on 24/7 security for himself and his two children, a Gulfstream GV which set him back $200,000 every month and the $4million he put up to fund a friend's independent music label, Unison.\nThat lawsuit then summarily dismissed each of Depp's allegations while demanding the $4.2million he still owed them on a $5million loan.\nThe actor is also being sued for breach of contract and promissory fraud by TMG.\n'Depp is responsible for his own financial waste,' stated the brothers in their complaint.\nHe began working with the brothers in 1999, just few years before her assumed his decade-long perch at the top of the Hollywood food chain.\nIt all began in 2003 with the release of the first 'Pirates of the Caribbean' movie, with Depp proving himself to be box office gold for the next 10 years in that franchise and films such as 'Public Enemies,' 'Alice in Wonderland,' 'Sweeney Todd' and 'The Toruist.'\nHe took home a $40million paycheck for 'Alice' in 2010, and made $55million in 2011 for the most recent 'Pirates' film, 'On Stranger Tides.'\nHe will likely be taking home an even bigger check for the film's upcoming installment, 'Dead Men Tell No tales,' which is set for release next month.","url":"https://www.dailymail.co.uk/news/article-4447644/Johnny-Depp-slams-former-managers-financial-lawsuit.html"}
