{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:40:28","date_modify":"2018-10-30 21:40:28","date_publish":"2016-04-20 02:07:13","description":"Former Republican presidential nominee Sen. John McCain is skipping the Republican National convention this year as he faces a tough primary challenge from former State Senator Kelli Ward. | Politics","filename":"data/vaneerConsumption/JohnMcCaintoSkipGOPConventionFacesToughReElectionFight.json","image_url":"https://media.breitbart.com/media/2015/06/ap_ap-photo66-1024x683.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_04_19__1540935628.html","title":"John McCain to Skip GOP Convention, Faces Tough Re-Election Fight","title_page":"John McCain to Skip GOP Convention, Faces Tough Re-Election Fight | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Former Republican presidential nominee Sen. John McCain is skipping the Republican National convention this year as he faces a tough primary challenge from former State Senator Kelli Ward.\nMcCain announced he would skip the convention just as National Republican Senatorial Committee chairman Sen. Roger Wicker (R-MS) told vulnerable Republicans to stay away from it, according to The Hill.\nMcCain told reporters that he has always avoided the convention when he is up for election. But The Hill reported that McCain delivered election-year speeches at the convention in 1992 and 2004.\nMcCain has held office in the nation’s capitol for over 30 years and now faces a tough challenge from popular grassroots challenger Ward. His favorability in Arizona has waned, and even the likely Democratic nominee for the race poses a challenge to him in the general election matchup.\nIn a poll taken in August 2015, Ward held a nine-point lead over sitting senator McCain.\nMcCain fought off a tough primary challenge in 2010 against J.D. Hayworth. At the time he still had a large campaign chest leftover from his 2008 campaign for president. Arizonans have also not forgotten his unfilled 2010 campaign promise to “complete the danged [border] fence.” The senior Senator has since failed to follow through on that promise.\nGOP presidential frontrunner Donald Trump has promised to build a wall on the U.S. southern border. During a Trump campaign stop in Phoenix last year, thousands of likely voters rallied to listen to the business mogul. McCain faced backlash for calling those rally attendees “crazies.”\nMcCain said at the time, “This performance with our friend out in Phoenix is very hurtful to me … he fired up the crazies.”\nMcCain was censured by his own party in January, 2014. Politico reported that McCain operatives retaliated by working to “unseat conservative activists who hold obscure, but influential, local party offices.”\nRepublicans Sen. Mark Kirk (IL) and Sen. Kelly Ayotte (NH) each face tough re-election fights and plan to skip the convention, according to the The Hill’s report. Sen. Rob Portman (OH) is undecided, even though the convention is being held in his home state. Sen. Pat Toomey (PA) and Sen. Ron Johnson are planning to attend.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2016/04/19/2008-nominee-john-mccain-skip-convention-campaign-tough-re-election-fight/"}
