{"authors":["Npr Staff"],"date_download":"2018-10-23 01:56:33","date_modify":"2018-10-23 01:56:33","date_publish":"2014-09-14 00:00:00","description":"NPR's Lynn Neary talks storytelling with John Darnielle, the creative force behind the indie-folk band The Mountain Goats and author of the new novel Wolf In White Van.","filename":"data/vaneerConsumption/JohnDarnielleAuthorOfWolfInWhiteVanNPR.json","image_url":"https://media.npr.org/assets/img/2014/09/12/20120607_mountain_goats_merge_t2_151_dla_lo_wide-6c1a3c01f70eb7c7446890bece19e618726d6c61.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2014_09_14_347995670_sprinting-toward-epiphany-talking-with-a-songwriter-turned-novelist_1540259793.html","title":"John Darnielle, Author Of 'Wolf In White Van' : NPR","title_page":"Interview: John Darnielle, Author Of 'Wolf In White Van' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Sprinting Toward Epiphany: Talking With A Songwriter Turned Novelist\nEnlarge this image toggle caption DL Anderson/Courtesy of the artist DL Anderson/Courtesy of the artist\nJohn Darnielle is best known as the man behind The Mountain Goats, a band defined for its 20-plus years by a certain literary quality. His songs are populated with high school burnouts, bitter, broken lovers, people living on the fringe who can't escape their own ghosts.\nThe songwriter's latest project is a novel, Wolf in White Van, and it's centered on another social outsider, whose sheltered, solitary life is disrupted when a disaster strikes. In a conversation with NPR's Lynn Neary about writing the book, Darnielle nails a fundamental difference between his two art forms.\n\"It's sort of like comparing making a fire and building a house,\" he says. \"A song is fire. You react to it primally, instantly. You don't have to decide whether you like it, and you don't really have to sit down and think about it much after you're done listening to it. It really does run through you like wind. Whereas a book is a journey: It's a thing you agree to go on with somebody, and I think every reader's experience of a book is going to be different. There are scenes in the book that feel very song-like to me, but I do think it's a different sort of ride. It's more of a marathon. My songs tend to sprint toward some epiphany and then explode.\"\nHear more of the conversation at the audio link.","url":"https://www.npr.org/2014/09/14/347995670/sprinting-toward-epiphany-talking-with-a-songwriter-turned-novelist"}
