{"authors":["Aaron Klein"],"date_download":"2018-10-30 21:06:13","date_modify":"2018-10-30 21:06:13","date_publish":"2016-12-05 19:03:21","description":"Speaking to the Saban Forum in Washington, Secretary of State John Kerry demonstrated dangerous ignorance of the Israeli-Palestinian conflict.","filename":"data/vaneerConsumption/JohnKerrysIgnoranceOnTheIsraeliPalestinianConflict.json","image_url":"https://media.breitbart.com/media/2016/12/jkerry.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_12_05__1540933573.html","title":"John Kerry’s Ignorance On The Israeli-Palestinian Conflict","title_page":"John Kerry’s Ignorance On The Israeli-Palestinian Conflict","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Speaking to the Saban Forum in Washington, Secretary of State John Kerry demonstrated dangerous ignorance of the Israeli-Palestinian conflict and a biased perception of the core problems impeding peace between the two sides.\nFirstly, Kerry claimed the larger Arab world will not make peace with Israel until Israelis and Palestinians sign a deal ostensibly resulting in a Palestinian state.\n“There will be no separate peace between Israel and the Arab world – I want to make that clear to all of you,” Kerry lectured, “without the Palestinian process and without Palestinian peace.”\nPerhaps the esteemed diplomat forgot that Israel already signed peace treaties with Egypt and Jordan, two moderate Arab countries that enjoy normalized relations with the Jewish state despite the absence of an Israeli-Palestinian deal.\nAnd Kerry may have missed that under Prime Minister Benjamin Netanyahu, there have been numerous reports of security cooperation between Israel and Sunni Arab states like Saudi Arabia that are deeply concerned by the U.S.-led nuclear deal with Iran.\nKerry, meanwhile, continued the Obama administration’s singular obsession with settlement activity, believing that Jewish construction in the West Bank and eastern Jerusalem serves as a major obstacle to peace.\nHe replied to Netanyahu’s accurate statement at the same forum that the essential issue blocking a peace deal is not settlement activity but the Palestinians’ longstanding refusal to recognize Israel as the nation-state of the Jewish people.\n“I don’t agree with him that settlements are not an obstacle to peace,” Kerry said. “Let’s not kid ourselves here – you can’t just wipe it away by saying it doesn’t have an impact. It has an impact.”\n“I’m not here to say that settlements are the reason for the conflict. No, they’re not,” he continued. “But I also cannot accept the notion that they’re not a barrier to peace.”\nOnce again, Kerry ignores history. In this case, he glossed over Israel’s numerous previous offers to evacuate settlements in exchange for peace deals, including offers of a Palestinian state at Camp David in 2000 and Annapolis in 2007. In each of these cases, the PA refused generous Israeli offers of statehood and bolted negotiations without counteroffers.\nWhile highlighting Jewish construction, Kerry was strangely silent on rampant illegal Palestinian construction on Jewish-owned property in eastern sections of Jerusalem, including the construction of dozens of apartment buildings on about 270 acres in the Jerusalem neighborhoods of Qalandiya and Kfar Akev, and about 50 acres in a north Jerusalem suburb known as Shoafat. The land is indisputably owned by a U.S.-based Jewish group.\nThe Palestinian Authority and much of the international community says Israel is occupying the so-called pre-1967 borders, meaning the Gaza Strip, West Bank, and eastern Jerusalem, including the Temple Mount. Israel refers to the pre-1967 territories as disputed.\nAbbas’s Fatah party, Hamas, and other major Palestinian factions routinely refer to the entire state of Israel as “occupied” territory.\nKerry’s views on settlement activity seem at odds with the intent of United Nations Security Council Resolution 242, the only binding resolution pertaining to the West Bank, which calls on Israel to withdraw under a future final-status solution “from territories occupied” as a result of the 1967 Six Day War. The resolution does not call for a withdrawal from “all territories,” a designation deliberately left out to ensure Israel’s ability to retain some territory for security purposes under a future deal.\nThe Jewish Virtual Library explains:\nThe Security Council did not say Israel must withdraw from “all the” territories occupied after the Six-Day War. This was quite deliberate. The Soviet delegate wanted the inclusion of those words and said that their exclusion meant “that part of these territories can remain in Israeli hands.” The Arab states pushed for the word “all” to be included, but this was rejected. They nevertheless asserted that they would read the resolution as if it included the word “all.” The British ambassador who drafted the approved resolution, Lord Caradon, declared after the vote: “It is only the resolution that will bind us, and we regard its wording as clear.”\nPerhaps most dangerously, Kerry took the occasion of the Saban Forum to refuse to confirm that the U.S. would veto any United Nations resolution intended to set guidelines for the establishment of a Palestinian state, allowing only that the Obama administration would veto a resolution “if it is a biased, unfair resolution calculated to delegitimize Israel.”\nThe Palestinians’ UN campaign is a farce. If the PA wanted a state, Palestinian leaders would at least respond to Netanyahu’s open-ended willingness to begin talks instead of repeatedly refusing to come to the bargaining table.\nThe same PA that now seeks to unilaterally impose a solution at the UN failed to respond to Netanyahu’s unprecedented steps to jump-start negotiations aimed at creating a Palestinian state, including freezing Jewish construction in the West Bank and eastern Jerusalem and releasing Palestinian prisoners.\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.","url":"https://www.breitbart.com/middle-east/2016/12/05/john-kerrys-dangerous-ignorance-israeli-palestinian-conflict/"}
