{"authors":["Associated Press"],"date_download":"2018-10-23 05:23:50","date_modify":"2018-10-23 05:23:50","date_publish":"2017-04-26 16:56:11","description":"Johnny Depp's former business team is calling the star \"a habitual liar\" after Depp said in an interview that his one-time managers \"clearly let him...","filename":"data/vaneerConsumption/JohnnyDeppsformermanagerscallhimhabitualliar.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/18/wire-466775-1493226364-678_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448386_Johnny-Depps-former-managers-call-habitual-liar_1540272230.html","title":"Johnny Depp's former managers call him 'habitual liar'","title_page":"Johnny Depp's former managers call him 'habitual liar' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Johnny Depp's former business team is calling the star \"a habitual liar\" after Depp said in an interview that his one-time managers \"clearly let him down.\"\nDepp sued The Management Group in January for more than $25 million, charging fraud and negligence. The Management Group countersued, saying Depp spent lavishly on homes, private jets, art and memorabilia in spite of its warnings.\nIn an interview with The Wall Street Journal , Depp questioned why he wasn't dropped as a client by the group over his spending.\nFILE - In this May 23, 2016, file photo, Johnny Depp arrives at the premiere of \"Alice Through the Looking Glass\" at the El Capitan Theatre, in Los Angeles. Depp's former business managers called him a \"habitual liar\" in a statement on April 26, 2017. The managers were responding to Depp's criticism of them in The Wall Street Journal. (Photo by Richard Shotwell/Invision/AP, File)\nDavid Shane, a spokesman for The Management Group, responded Wednesday, telling The Associated Press in a statement that Depp is a \"habitual liar who denies responsibility for his own outrageous conduct and coerces others to lie for him.\"\n\"Johnny Depp and his sister were involved in every significant business decision during the 17 years TMG represented him,\" Shane said. \"Depp now admits to his extravagant spending but blames TMG for not dropping him as a client.\"\nIn its countersuit, The Management Group alleged Depp's lifestyle was costing more than $2 million a month to maintain. The lawsuit said Depp paid more than $75 million to buy and maintain 14 homes, including a French chateau and a chain of islands in the Bahamas.\nDepp responded to the claim by telling the Journal \"it's my money.\"\n\"If I want to buy 15,000 cotton balls a day, it's my thing,\" he added.\nDepp also took legal action against The Management Group on Tuesday. The Journal reports his lawyers said in filings in Los Angeles Superior court that they have \"significant new information, including documents and testimony\" from a former Management Group employee concerning \"misconduct in managing Mr. Depp's affairs.\"\nDepp's lawyers were responding to The Management Group's effort to keep the employee's testimony out of court.\nThe business team's spokesman says Depp \"relying on dishonest, discredited statements from a vindictive former TMG employee who was fired seven years ago_at which time the employee vowed to get TMG back.\"\nThe Management Group is run by brothers Joel and Rob Mandel.","url":"https://www.dailymail.co.uk/wires/ap/article-4448386/Johnny-Depps-former-managers-call-habitual-liar.html"}
