{"authors":["Monica Hunter-Hart"],"date_download":"2018-10-31 01:39:15","date_modify":"2018-10-31 01:39:15","date_publish":"2018-08-30 12:52:15","description":"As the world looks on and mourns the late senator, John McCain's mother will attend his funeral services this week. Roberta McCain is a remarkable 106 years old and has outlived her son, who was a lot like her, according to the AP. By many reports,…","filename":"data/vaneerConsumption/JohnMcCainsMotherWillAttendHisFuneralAt106YearsOld.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/30/8a906022-9c6d-4fc0-92df-d9579051fb9e-getty-83190061.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_john-mccains-mother-will-attend-his-funeral-at-106-years-old-11451551_1540949955.html","title":"John McCain’s Mother Will Attend His Funeral At 106 Years Old","title_page":"John McCain’s Mother Will Attend His Funeral At 106 Years Old","title_rss":"NULL","source_domain":"bustle.com","text":"As the world looks on and mourns the late senator, John McCain's mother will attend his funeral services this week. Roberta McCain is a remarkable 106 years old and has outlived her son, who was a lot like her, according to the AP. By many reports, she enthusiastically embraced being his cheerleader throughout his life.\n\"Roberta was his biggest supporter and the leader of his fan club. She was incredibly proud of him,\" a friend of the family told People this week. \"His mommy loved him. He knew that.\" Roberta's championing may be best exemplified by the time she joined her son on the 2008 campaign trail and gave a warm speech to his volunteers, saying, \"I wish I could kiss each one of you on the cheek.\"\nThe AP reports that she will attend both her son's memorial services in Washington on Saturday and his burial in Annapolis on Sunday. She's likely to be one of his oldest family members there, though he's also survived by his wife, seven children, and five grandchildren.\nMcCain was often praised for having an independent spirit (earning him the title of \"maverick\") and strength of will, which he exhibited while withstanding torture and declining an early release as a prisoner of war. McCain has said he owes many of his traits to his mother; according to the AP, he wrote in one of his books, \"I am grateful to her for the strengths she taught me by example.\"\nHe continued:\nMy mother was raised to be a strong, determined woman who thoroughly enjoyed life, and always tried to make the most of her opportunities. She was encouraged to accept, graciously and with good humor, the responsibilities and sacrifices her choices have required of her.\nMcCain published his final book, The Restless Wave, earlier this year, and he mentioned his mother in it, too. According to the AP, he wrote that Roberta's \"vivaciousness is a force of nature.\" He noted that she's suffered from a stroke that has restricted her movements somewhat and made talking a \"chore.\" However, she maintains \"a spark in her, a brightness in her eyes that would light up the world if she could resume her peripatetic life.\"\nA family friend told People that McCain's death is a \"tough blow\" for Roberta, but that they expect her to be OK, despite her less-than-prime health. \"She is all there, mentally, and is still going strong at 106,\" the source said.\nThe friend also told the magazine that Roberta wasn't able to fly to McCain's side to be with him when he decided to stop treatment last week, but that they spoke on the phone sometime before his death. She was well aware of the seriousness of his illness.\nMcCain died on Saturday at age 81 of brain cancer, from which he'd been suffering for months since discovering it in the summer of 2017. It had been reported one day earlier that the late senator had decided to discontinue medical treatment. Per the AP, Roberta has said that her son used her as an example of \"what he hopes his lifespan will be.\"","url":"https://www.bustle.com/p/john-mccains-mother-will-attend-his-funeral-at-106-years-old-11451551"}
