{"authors":[],"date_download":"2018-10-30 01:08:48","date_modify":"2018-10-30 01:08:48","date_publish":"2018-07-17 00:05:07","description":null,"filename":"data/vaneerConsumption/JohnBrennanMissesCommunistRussia.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/1024px-Homeland_Security_Council_for_H1N1_flu.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861728.html","title":"John Brennan Misses Communist Russia","title_page":"John Brennan Misses Communist RussiaThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"John Brennan’s anti-Trump tweets grow more and more maniacal. His latest tweet holds that Donald Trump’s Russian diplomacy in Helsinki “rises to & exceeds the threshold of ‘high crimes & misdemeanors.’ It was nothing short of treasonous.”\nThat tells people all they need to know about the unseriousness of the left’s impeachment drive, not to mention exposing once again the demented malice behind the Obama administration’s spying on the Trump campaign.\nThe unhinged criticism is also hilariously rich, given that John Brennan, who supported the Soviet-controlled American Communist Party, meets the textbook definition of a useful idiot for the Russians. At the height of the Cold War, he was rooting for the Reds, casting his vote in 1976 for Gus Hall, the American Communist Party’s presidential candidate. If anyone is adept at serving as a dupe for the Russians, it is John Brennan. To paraphrase John Kerry, he was for them before he was against them.\nWhat changed? How could Brennan support the Soviet Union, even to the point of voting for one of its puppets, but then hysterically denounce any diplomacy toward Putin’s Russia? The answer lies in Russia’s shedding of communism. Brennan, who refused to take his oath as CIA director on the Bible, misses the days of atheistic Marxism and fears the revival of a Christian Russia (Brennan, while walking the halls of the CIA festooned with LGBT buttons, would rant to colleagues about Putin’s refusal to allow gay pride parades in Moscow.) Brennan deplored Reagan’s description of the Soviet Union as an evil empire and joined other leftists in demanding that he pursue détente with Marxist thugs who make Putin look like a piker. Were Russia still collectivist, he would be using his Twitter account, which boasts his belief in the “collective future,” to praise, not trash, diplomatic gestures.\nAnybody familiar with Brennan’s past, which includes not only supporting the evil empire of the Soviets but also the evil empire of radical Islam (his time as Obama’s CIA director was marked by apologetics for the thugs of the Muslim Brotherhood, ludicrous attempts to sanitize the concept of jihad, and nonstop whitewashing of the problem of Islamic terrorism), can only laugh at his anti-Trump antics. That the media gives this fulminating fool and fraud a platform is a measure of its own lack of seriousness and absurdly sudden hawkishness.\nThe outrage about the Trump-Putin meeting is empty noise, generated by the America Last crowd to hurt an America First president. It won’t work. From Hillary to Pelosi to Brennan, they are the little lefties who cried wolf — after decades of feeding wolves. Their credibility is nil; their counsel is immature and reckless.\n“Not only were Trump’s comments imbecilic, he is wholly in the pocket of Putin” gasped Brennan. “Republican Patriots: Where are you???” Other than members of the resistance and reflexive Trump-haters, no one takes these juvenile smears seriously. It is humorous to see these self-proclaimed “adults” hazing Trump for not behaving like a childish hothead. If another president were prioritizing peace over retaliatory tit-for-tat, they would praise him. But since the diplomacy is coming from Trump, it has to be “treasonous.”\nBrennan isn’t just throwing stones from his glass house but boulders. He once said that he feared his support for Soviet stooge Gus Hall threatened his entrance into the CIA in 1980. This sounds like a wild satirical parody, but it isn’t: a dupe for the Soviet Union rises to the top of the CIA, uses his position to shill for Islamic radicals, eggs the FBI into spying on the Trump campaign, then leaves the CIA only to resume the radicalism of his youth, calling for civil disobedience and the overthrow of a duly elected president. Brennan’s only expertise on treachery comes from his own.","url":"https://spectator.org/john-brennan-misses-communist-russia/"}
