{"authors":["John Brummett"],"date_download":"2018-10-30 17:51:36","date_modify":"2018-10-30 17:51:36","date_publish":"2018-10-30 04:30:00","description":"Words have plain meanings. But they also can carry dangerous implications.","filename":"data/vaneerConsumption/JOHNBRUMMETTTheAmericanthingtodo.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30_the-american-thing-to-do-20181030__page=2_1540921896.html","title":"JOHN BRUMMETT: The American thing to do","title_page":"JOHN BRUMMETT: The American thing to do","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Words have plain meanings. But they also can carry dangerous implications.\nThat's especially true in a country and world increasingly imperiled by connotations, inferences and the frightened and incendiary code-speak of people who revel in hate and resentment.\nI'd be a nationalist for the strict meaning of the word--loving my country and proudly believing it to be the best on earth. But I deplore the word for its connoted notion that the United States should be nativist, meaning ethnically or racially exclusive.\nI reject that an American should think only of selfish interest and hold little or no regard for the rest of the world.\nWhen loose-lipped and loose-brained Donald Trump bellowed at a right-wing populist rally that he was a nationalist, the problem was not the first definition in the dictionary. It was the second, the variety containing extremism.\nTrump was not merely invoking devotion to America, but inviting an inference extending to dangerous white racist nationalism, a movement of hate and violence that he, with fully loosened brain, had already said contained good people.\nI'd be a globalist for how I view the world--that the modern economy is unavoidably an integrated worldwide condition; that we should aspire to travel and trade freely and understand rather than revile each other; that we shouldn't behave as backyard pit bulls growling at perceived threats and hiking our legs to mark our territories.\nBut then there are those who say globalism cedes patriotic pride to global interest. They say it seeks to do away with borders.\nI decline to embrace such a relatively new and still evolving label. I decline to invite uncertainty in my meaning.\nUpon contemplation of my certain meaning, and quite to my surprise, it turns out I am a Reaganist.\nI embrace what Ronald Reagan said: \"America is a shining city upon a hill whose beacon light guides freedom-loving people everywhere.\"\nThat means I'm also an Americanist, believing the United States is so vastly superior to the rest of the world in economic power, military might and as an exemplar and ideal--especially as an exemplar and ideal--that it needn't come down from the hill like a petty brat and spat with inferiors over real or perceived slights.\nWe don't need punitive tariffs on countries looking up at our shining city with its guiding light.\nA trade imbalance is complex. Yes, maybe we buy more from you than you buy from us. Do you know why? Because we can. You make things cheaper than we do. Why? Because, as a shining city on the hill, an exemplar and ideal, we value our people more than you value yours.\nWe once sought, and should seek again, to reform the world by Reagan's positive example, by adapting our economy to continue to offer richer and respectful opportunities to our people.\nWe should not play king of the mountain. Others should be encouraged to scale our hill. Our light only shines brighter as others rise nearer.\nI admit to having been a bit obsessed lately with the expressed idealism of John Kasich. I must mention him one more time, at least.\nHe said over the weekend that we need to understand, not fear or resent, asylum-seekers from Central America who are desperate to save their daughters from forced prostitution and their sons from execution unless they agree to be drug mules.\nIt's what the Lord would have us do, he said.\nKasich said we ought to be vetting already those in the faraway caravan, not fomenting fear and alleging without evidence that the entire episode is a sponsored liberal charade infested with criminals and terrorists.\nThe caravan is moving right out there in the open. Why not go and see?\nA shining city on the hill would work with its neighbor and friend, Mexico, for permission to send agents of its Office of Refugee Resettlement to intercept the caravan for inventory.\nIt would tell those whose asylum-worthy status couldn't be determined that they may as well turn back or stay put, because they'll be denied entry if they get to the border. The humane thing would be to tell them early.\nVetting wouldn't be altogether fair or precise. If people in the caravan identified others as drug users or toughs or curious latecomers, then those persons likely would need to be rejected without due process.\nNo administrative process is ideal. Only the American ideal is ideal.\nA shining city on the hill would tell those whose identities and innocent fears and human needs could be verified that they needn't trudge another step. It would put them and their kids and their belongings on big shiny American buses bound toward that big shiny American light.\nThey'd be reprocessed formally at the border, since that's what the longstanding asylum law specifies.\nIt would be the Reaganist and Americanist thing to do.\n------------v------------\nJohn Brummett, whose column appears regularly in the Arkansas Democrat-Gazette, is a member of the Arkansas Writers' Hall of Fame. Email him at jbrummett@arkansasonline.com. Read his @johnbrummett Twitter feed.\nEditorial on 10/30/2018","url":"https://www.arkansasonline.com/news/2018/oct/30/the-american-thing-to-do-20181030/?page=2"}
