{"authors":["Tamar Hallerman"],"date_download":"2018-10-30 20:58:45","date_modify":"2018-10-30 20:58:45","date_publish":"2016-07-26 15:50:59","description":"John Lewis will be among a trio of Democrats that formally nominates Hillary Clinton for presid...","filename":"data/vaneerConsumption/JohnLewistonominateHillaryClintonthisafternoon.json","image_url":"https://politics.myajc.com/rf/image_large/Pub/p7/Politics-MyAJC/2016/07/26/Images/WPIMAGE_cmgajcpolitics_26145.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/politics.myajc.com/blog_politics_john-lewis-no_c2e38d8827ca477ac2a78fc0a0a91377__1540933125.html","title":"John Lewis to nominate Hillary Clinton this afternoon","title_page":"John Lewis to nominate Hillary Clinton this afternoon","title_rss":"NULL","source_domain":"ajc.com","text":"John Lewis will be among a trio of Democrats that formally nominates Hillary Clinton for president this afternoon, the Clinton campaign announced.\nThe Atlanta Democrat, an icon of the civil rights movement who has served in the House of Representatives for 15 terms, will second the nomination after it's offered by retiring U.S. Sen. Barbara Mikulski, D-Md., the longest-serving woman in Washington who is credited as being the first female lawmaker to wear pants on the Senate floor, among other firsts.\nLewis and Mikulski will also be joined by Na'ilah Amaru, a professor and public policy consultant who won an online contest from the Clinton campaign.\nThe nominating process will begin at roughly 5 p.m. and will kick off the roll call of the states. The three Democrats are expected to give short speeches beforehand.\nNotably absent from the group is Vermont U.S. Sen. Bernie Sanders, who was reportedly in talks for much of the day to nominate Clinton, a gesture intended to promote party unity after some of his supporters continued to indicate they would not support his one-time rival. CNN reported earlier Tuesday afternoon that Sanders was in talks with the Clinton campaign to allow the Vermont delegation to formally call for Clinton's nomination.\nLewis is one of several Georgians scheduled to speak at the DNC this week. Former state Sen. Jason Carter will take the stage this evening to introduce his grandfather, former President Jimmy Carter. Atlanta Mayor Kasim Reed is expected to address the confab later in the week. Georgia House Minority Leader Stacey Abrams gave her full-throated defense of Clinton last night.","url":"https://politics.myajc.com/blog/politics/john-lewis-nominate-hillary-clinton-this-afternoon/qpMtxLwtyFdNrHvtucjGMN/"}
