{"authors":["Lindsay Denninger"],"date_download":"2018-10-31 01:40:31","date_modify":"2018-10-31 01:40:31","date_publish":"2018-08-28 01:42:21","description":"While Bachelor In Paradise is basically just a show that people watch to be able to say, \"Wow, I'm really glad I'm not those people,\" some sort of interesting, complicated, pseudo-adult relationship would be a great thing to add to the show. For the…","filename":"data/vaneerConsumption/JohnJubileesBachelorInParadiseBreakUpDeservedMoreScreenTime.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/ad4a498e-7888-45e8-8c5d-62a2e60eb228-jube.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_john-jubilees-bachelor-in-paradise-break-up-deserved-more-screen-time-10258310_1540950031.html","title":"John & Jubilee’s 'Bachelor In Paradise' Break Up Deserved More Screen Time","title_page":"John & Jubilee’s 'Bachelor In Paradise' Break Up Deserved More Screen Time","title_rss":"NULL","source_domain":"bustle.com","text":"While Bachelor In Paradise is basically just a show that people watch to be able to say, \"Wow, I'm really glad I'm not those people,\" some sort of interesting, complicated, pseudo-adult relationship would be a great thing to add to the show. For the record, ABC, most of us are sick of waiting for Colton and Tia to get together, and we're really over Jordan shrieking like a madman because the girl he likes hurt his feefees. What about the grown ups? What about Jubilee and John? Jubilee and John broke up on Bachelor In Paradise, and these two got about 30 seconds of screen time. What's up with that?\nJubilee is an old-timer when it comes to The Bachelor — she got her start on Ben Higgins' season of the show — and John is fresh off of Becca's season of The Bachelorette. The two are both fairly quiet, level-headed people, which really doesn't make for a lot of drama. When you're an adult, you tend not to cry and throw stuffed puppies in the ocean when someone doesn't like you. You don't lie about kissing other women. You just... get on with it. You move up, or you move on. That's why Jubilee and John's Bachelor In Paradise split didn't get the screentime it deserved — the producers of the show are more likely to show an unhealthy, unhinged relationship on national television than they are one between two mature, grown people.\nVenmo John, as his nickname states, helped build Venmo, a website everyone uses everywhere to pay their friends. He's smart enough to do that, which means he's probably too smart for this show. But he's also kind and listens to the women of Bachelor In Paradise while they speak. What a novel concept! Jubilee is an army veteran whose \"closed-off nature\" (which is rational and great if that's how she feels, by the way) sent her home on Ben's season. The only mention of Jubilee's departure was a voiceover by Chelsea telling the audience that John just wanted to be friends with Jubilee, and so she left, because she didn't have her heart set on any other guys.\nThat's how a lot of relationships end — not with a bang, but with a whimper. Things happen and feelings change. It's not a big deal, in the grand scheme. The universe turns on. But on Bachelor In Paradise, showing something like John and Jubilee's entire final conversation would have been a big deal, because that's how adults speak to one another. Instead of trying to convince America that relationships are the perfect fantasy fairy tale come true, or they're nothing but fire and ice and passion, how about something in the middle? How about \"we liked each other once, and this just fizzled out?\" How about reality?\nJordan and Jenna and Benoit — that love triangle is not what a healthy relationship looks like. Colton and Tia — her begging him to be with her isn't great, either. Healthy comes when two people enter as partners, and, as hard as it can be, leave without throwing a temper tantrum. America and Bachelor Nation could have learned a lot from Jubilee and John, so it's too bad that the program neglected their breakup in favor of hijinks and its usual tomfoolery.","url":"https://www.bustle.com/p/john-jubilees-bachelor-in-paradise-break-up-deserved-more-screen-time-10258310"}
