{"authors":["Joel Christie For Dailymail.Com"],"date_download":"2018-10-22 20:32:21","date_modify":"2018-10-22 20:32:21","date_publish":"2016-01-28 01:47:45","description":"The actor came to the assistance of Grease director Randal Kleiser, whose foot became infected by the filthy water of the Los Angeles River during the shooting of the Thunder Road car race.","filename":"data/vaneerConsumption/JohnTravoltatriedtohealGreasesRandalKleisersinfectionwithScientology.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A5DF5B00000578-0-image-a-26_1453945479424.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420222_How-John-Travolta-tried-heal-Grease-director-Randal-Kleiser-s-infection-Scientology-touch-assist-set-famed-movie-musical-1970-s_1540240341.html","title":"John Travolta tried to heal Grease's Randal Kleiser's infection with Scientology","title_page":"John Travolta tried to heal Grease's Randal Kleiser's infection with Scientology | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A young John Travolta tried to heal a foot infection suffered by the director of Grease on the set of the legendary movie musical using a Scientology procedure, it has been revealed.\nThe actor - who was 23 at the time the film was shot in 1977 - came to the assistance of director Randal Kleiser, whose foot became infected by the filthy water of the Los Angeles River during the shooting of the Thunder Road car race.\nAccording to a retrospective piece on the filming of Grease by Vanity Fair this week, production was halted because of Kleiser's illness, but Travolta went to the director's trailer to perform a touch assist, a type of first aid for Scientologists that doctors have long rubbished.\nTravolta reportedly started touching the then-30-year-old filmmaker in various places and repeatedly asked him to 'feel my finger'.\nScroll down for video\nTouch assist: A new feature on the filming of Grease in 1977 has revealed John Travolta attempted to heal director Randal Kleiser (left) of a foot infection using a controversial Scientology procedure\nWhen Klesier answered 'yes', Travolta would reply 'thank you'.\nAs Klesier told the magazine: 'I was lying there with this fever and he's poking me and poking me and poking me and I'm like, ''Yes, I feel it''. ''Thank you''. Then he left.\n'The next day I was better, and of course he claimed it was because of the touch assist.'\nTravolta is believed to have started practicing Scientology in 1975, two years before Grease started filming.\nHe was given the book Dianetics - a system of psychotherapy developed by L. Ron Hubbard that would later spawn the Scientology religion - while filming the movie The Devil's Rain in Durango, Mexico.\nThe Vanity Fair feature, which centers around enigmatic producer Allan Carr, further reveals numerous facts about the filming of Grease and how the highest grossing American musical of the 20th century came to be made.\nReligious: John Travolta, seen here at the Church of Scientology Celebrity Center 44th Anniversary Gala in Los Angeles in August 2013, has been practicing Scientology since 1975\nTravolta is seen on set during the filming of Grease in Los Angeles in the summer of 1977. The movie was then released the following summer\nTell me about it, stud: A lot of the filming took place at Venice High School in Venice, California, while the end scene (pictured) was shot at John Marshall High School\nJohn Travolta and Olivia Newton-John joke around the Grease producer Allan Carr on the set\nThe film was based on Warren Casey and Jim Jacobs' 1971 musical of the same name.\nThe musical was set in a Chicago high school and had a much grittier plot, with the name coming from the 'greasy hair, greasy engines and greasy food' of the 1950s.\nCarr acquired the film rights for just $200,000 after seeing a production of Grease Off Broadway in New York in 1972.\nTravolta had played one of the Burger Palace Boys in the musical, which would be re-written for the film as the T-Birds.\nHowever Travolta was only the second choice, after Henry Winkler - who played Fonzie on the sitcom Happy Days - turned down the part out of fear of being typecast.\nThe script was given a sugary screenplay adaptation that shifted focus to the love story of two students, Sandy Olsson And Danny Zuko.\nControversially, the setting was also moved to Los Angeles, which upset the writers of the musical.\n'I was most disappointed that they filmed it in California, because it's really mostly about the kids in the industrial cities in the East and the Midwest,' Jim Jacobs told Vanity Fair.\n'It's not sandy beaches and the ocean.'\nOlivia Newton-John (center) and Didi Conn (right), along with the other girls, performing Summer Nights\nTrying to find a leading lady, however, became an issue.\nCarrie Fisher had just done Star Wars and was initially looked at for Sandy, while the singer Marie Osmond then became a possibility.\nOsmond was offered the role, but reneged out of protest of Sandy's transformation from good girl to bad.\nGrease was released to theaters on June 16, 1978\nCarr then set out to woo Australian singer Olivia Newton-John, which posed its own problems.\nFirst there was taking a chance on such an unknown star, and then there was the actress' own reservations.\nShe had done just one film prior - a science fiction stinker called Toomorrow - which tanked at the box office.\n'I was very anxious about making another film, because my music career was going well, and I did not want to mess it up by doing another movie that wasn't good,' Newtown-John told Vanity Fair.\nTravolta then became one of Newton-John's biggest champions, trying to convince both her and producers that she was the right choice.\n'She had a brilliant voice, and I didn't think there could be any more correct person for Sandy in the universe,' he said.\nTravolta added that casting Newton-John was like 'putting Taylor Swift in that role today'.\nYet still there were issues.\nTravolta was 23 and Newton-John was 29, which she was worried would be all too apparent on screen.\nAlso, she could not do an American accent.\nAfter a successful screen test with Travolta - the two acted out the drive-in scene - Newton-John found her confidence and accepted the part.\nThe script was re-written to make Sandy an Australian expat, and the cinematographer used soft lenses to make her look younger.\nFilming began in June 1977 on a modest budget of $6 million from Paramount Pictures.\nThe movie had been 'mapped out' in five weeks, and shot over just two months.\nFour songs were added to the script at the eleventh hour, including the renowned opening number 'Grease' - written by Barry Gibb and sung by Frankie Valli - 'Sandy', 'Hopelessly Devoted to You', and 'You're the One That I Want'.\nStudio 54 owner Steve Rubell, singer Olivia Newton-John and producer Allan Carr attend the 'Grease' Premiere Party on June 13, 1978 at Studio 54 in New York City\n'There Are Worse Things I Could Do', a touching ballad sung by Stockard Channing's character Rizzo, was almost cut, but Channing fought back.\n'Allan was very wishy-washy on the song. He thought it was a downer,' Channing told VF.\nShe convinced Carr to keep the track by telling him: 'That's how you know what's inside this little person. Otherwise she's just all that surface stuff.'\nHowever the biggest upheaval was with 'Greased Lightning', which in the musical was Kenickie's big number, but which was given to Danny for the film.\nAs Travolta remembers: 'I have to be completely honest with you. I wanted the number. And because I had clout, I could get the number.'\nThe switch made Patricia Birch - the musical's choreographer who was brought across for the movie - furious, particularly on behalf of Jeff Conaway, the actor playing Kenickie.\n'It's Kenickie's goddamned number!' she said.\n'I was upset with it, because I thought Jeff needed a number. John was very good doing it, but it should have been Kenickie - it was Kenickie's car!'\nToward the end of production, Newton-John was worried that she was not going to be able to pull off the all-important bad-girl side of Sandy.\n'That was such a stretch, and something I was really worried about,' she told VF.\nWe Come Together: The final scene where the carnival took place used John Marshall High School\n'But when it happened, it was just this amazing feeling. It was very freeing. Not just for Sandy, but for me as well. Because I was always the girl next door.\n'And then I got into that trailer with those guys and they put me into that outfit and the hair and I walked out to show Randal, and the whole crew turned around.\n'And the look on their faces!' she laughed.\nThe choreography of the pinnacle song, 'You're the One That I Want', was done on the spot, and the number was shot in seven hours.\n'We all stayed to watched it,' said Lorenzo Lamas, who played football jock Tom.\n'We were just ear-to-ear grins. That's when we knew this was going to be amazing.'\nAnd it was, despite a critical panning.\nGrease was released in June 1978 and grossed $8,941,717 in its opening weekend.\nGrease went on to gross $188,755,690 domestically and $206,200,000 internationally, totaling $394,955,690 worldwide.\nFox will air Grease: Live, a live-to-air production of the musical, this Sunday, January 31.","url":"https://www.dailymail.co.uk/news/article-3420222/How-John-Travolta-tried-heal-Grease-director-Randal-Kleiser-s-infection-Scientology-touch-assist-set-famed-movie-musical-1970-s.html"}
