{"authors":["Neil W. Mccabe"],"date_download":"2018-10-30 19:42:58","date_modify":"2018-10-30 19:42:58","date_publish":"2016-09-14 03:41:44","description":"A Republican Louisiana congressman filed a privileged motion Tuesday that calls for a vote on the House floor on whether to impeach IRS Commissioner John | Economy","filename":"data/vaneerConsumption/JohnFlemingKicksOffBattletoImpeachIRSCommissionerDespiteOppositionfromGOPHouseLeaders.json","image_url":"https://media.breitbart.com/media/2016/09/KOSTINEN-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/economy_2016_09_13__1540928578.html","title":"John Fleming Kicks Off Battle to Impeach IRS Commissioner Despite Opposition from GOP House Leaders","title_page":"John Fleming Kicks Off Battle to Impeach IRS Commissioner Despite Opposition from GOP House Leaders | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Republican Louisiana congressman filed a privileged motion Tuesday that calls for a vote on the House floor on whether to impeach IRS Commissioner John Koskinen for High Crimes and Misdemeanors in the next two legislative days.\n“The American people have become frustrated with Republicans because Republicans seem to be unable and unwilling to hold officials in this government accountable for their actions and activities,” said Rep. John C. Fleming (R.-La.), who is also a candidate for the Senate and leaves the House at the end of this session. Fleming was joined by Rep. Timothy A. Huelskamp (R.-Kansas).\nA Capitol Hill source familiar with the planning and execution of the motion told Breitbart News the GOP House leadership is already organizing with House Democrats to derail the motion in any way they can.\nBreitbart News visited the office of House Majority Leader Kevin McCarthy Monday and Tuesday seeking comment, but there has been no response.\n“This is part of a string of cover-ups, including Secretary Clinton’s emails and Fast and Furious,” Fleming said.\n“In this case, the IRS commissioner presided over the erasing of 24,000 of Lois Lerner’s emails after they had been subpoenaed by Congress,” he said. Lerner was the IRS official who led the IRS attacks on conservative groups.\n“He deliberately kept Congress and the American people in the dark, making materially false statements under oath. Koskinen needs to be held accountable and in this case that means impeachment. We can no longer wait,” said Fleming, who went to medical school on a Navy scholarship and served six years in that service as a medical officer.\nKoskinen was not the commissioner when the IRS targeted conservative groups for administrative harassment and the slow-walking of paperwork going into the 2012 election cycle, but he earned the enmity of Capitol Hill conservatives for what they saw as his series of misleading statements and failure to keep commitments, which combined with his haughty manner to make him the target of an impeachment process.\nIn the context of the Congress, an impeachment acts like an indictment, which is then presented to the Senate for a trial. Although there is a similar vocabulary, an impeachment is not a criminal process and is not governed by rules of evidence or other procedures associated with due process. It is simply the will of the House by a majority vote. In the Senate, a conviction requires a two-thirds majority and would result in Koskinen losing his job.\nThe original bill to impeach Koskinen was filed Oct. 27, 2015 by Rep. Jason Chaffetz (R.-Utah), the chairman of the House Oversight and Government Reform Committee.\nWhen Chaffetz filed his motion he said it came out of his frustration with the commissioner’s relentless efforts to not cooperate with his committee.\n“Commissioner Koskinen violated the public trust. He failed to comply with a congressionally issued subpoena, documents were destroyed on his watch, and the public was consistently misled,” the Utah Republican said.\n“Impeachment is the appropriate tool to restore public confidence in the IRS and to protect the institutional interests of Congress,” he said. “This action will demonstrate to the American people that the IRS is under repair, and signal that Executive Branch officials who violate the public trust will be held accountable.”\nThe committee determined that Koskinen specifically failed to comply with a subpoena resulting in destruction of key evidence and to locate and preserve IRS records in accordance with a congressional subpoena and an internal preservation order.\nCongressmen also discovered that the IRS erased 422 backup tapes containing as many as 24,000 of Lerner’s emails – key pieces of evidence that were destroyed on Koskinen’s watch.\nLater, the Oversight Committee, which has jurisdiction over the entire federal government and is the chamber’s lead investigative committee, determined that the commissioner failed to testify truthfully and provided false and misleading information, such as that the IRS turned over all emails relevant to the congressional investigation, including all of Lerner’s emails.\nThe Chaffetz motion was delivered to the Judiciary Committee after it passed the Oversight Committee, but Judiciary never took up the matter for a vote.\nFleming told Breitbart News his motion, HR 828, is the exact same as the Chaffetz motion with just one administrative amendment that has no bearing on the bill.\nBecause the congressman filed his bill July 14, just before the chamber’s last recess, there were not two legislative days available to honor his “privilege.” His filing was still active, so what he really did Tuesday was re-notify the House that he was invoking the privilege, thus starting the two-day clock.\nIn the House, like other legislatures and parliaments, members have the right to demand a vote on a specific measure that has not gone through the normal process.\nTypically, all House bills pass a committee and then go to the Rules Committee for a “rule” that governs the floor vote.\nAfter the Chaffetz motion was blocked in Judiciary, House conservatives decided to go this route, which means that absent a parliamentary procedure or ruling crafted by the House Republican leadership, there will be a simple vote on impeachment by Thursday–without debate and without amendments.\nWatch this video produced by the House Oversight and Government Reform Committee on IRS Commissioner John Koskinen:\nFleming said GOP leaders could try to table the motion or refer it to Judiciary or another committee among the many road blocks and hurdles possible.\nBut, he is clear about how he would characterize any attempt to stop him from enjoying this privilege.\n“Anything that is procedurally taking off-track this vote would be equivalent to ‘No’ on impeachment and would be against Koskinen losing his job,” the Navy veteran said.","url":"https://www.breitbart.com/economy/2016/09/13/john-fleming-kicks-off-battle-to-impeach-irs-commissioner-despite-opposition-from-gop-house-leaders/"}
