{"authors":["Brad Witter"],"date_download":"2018-10-31 01:48:43","date_modify":"2018-10-31 01:48:43","date_publish":"2018-09-13 22:15:05","description":"In casting news deserving a four-chair turn, John Legend is joining The Voice as a coach for Season 16 this spring, The Hollywood Reporter revealed on Thursday, Sept. 13. As part of the NBC reality singing competition's ongoing game of musical…","filename":"data/vaneerConsumption/JohnLegendIsJoiningTheVoiceSeason16AsACoachWithSoMuchExcitement.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/13/3101ce11-2587-48dd-94f9-d625f01120a6-getty-1030401578.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_john-legend-is-joining-the-voice-season-16-as-a-coach-with-so-much-excitement-11909511_1540950523.html","title":"John Legend Is Joining ‘The Voice’ Season 16 As A Coach With So Much Excitement","title_page":"John Legend Is Joining ‘The Voice’ Season 16 As A Coach With So Much Excitement","title_rss":"NULL","source_domain":"bustle.com","text":"In casting news deserving a four-chair turn, John Legend is joining The Voice as a coach for Season 16 this spring, The Hollywood Reporter revealed on Thursday, Sept. 13. As part of the NBC reality singing competition's ongoing game of musical chairs — those not occupied by coaches Adam Levine or Blake Shelton anyway — Legend will be replacing Season 13 coach Jennifer Hudson, who will, however, return for The Voice's new season later this month. Rounding out the panel with Legend will be the show's reigning champ Kelly Clarkson.\nAfter initially tweeting just two words — \"So excited!\" — the 10-time Grammy winner later elaborated on his new gig. \"I’m thrilled to join the coaches of @nbcthevoice,\" Legend captioned an Instagram photo after the news broke. \"I've been a guest and mentor on the show multiple times and I’m so excited to discover talented singers and help them make the most of their gift. I hope the world is ready for #TeamJL\"\nIndeed, Legend most recently guested on the four-time Primetime Emmy-winning series, giving an assist to Team Adam's contestants as an adviser in 2017.\n\"John Legend is a one-of-a-kind musician and producer with remarkable skills that are beyond measure,\" Paul Telegdy, president of NBC's alternative and reality group said in a statement, according to THR. \"His multidimensional career and incredible talents provide a repertoire that will excite and inspire our artists. This coaching panel is sure to ignite season 16.\"\nAs Legend fans may well remember, not only is this not the \"Ordinary People\" singer's first foray into appearing as a regular mentor on a reality singing competition, it also isn't his first time doing so alongside Clarkson. Back in 2012, Clarkson and Legend joined Robin Thicke and Jennifer Nettles in guiding the careers of aspiring musicians on ABC's short-lived series Duets. While appearing together on the show, which aired for only one season, Legend and Clarkson also performed a duet of Ray Charles' 1962 classic \"You Don't Know Me.\"\nThe performance was the first of several collaborations between the pair, with Legend joining Clarkson on stage in 2012 to perform Jason Aldean's part of the country singer's 2010 Grammy-winning duet with Clarkson \"Don't You Wanna Stay.\" Legend later teamed up with Clarkson in 2015 for the stunning ballad \"Run Run Run,\" off of the \"Since You've Been Gone\" powerhouse's 2015 album Piece By Piece.\nKevin Winter/Getty Images Entertainment/Getty Images\n\"Kelly's one of the best singers in the business, I think,\" Legend told Entertainment Tonight in 2015 following their Piece by Piece collaboration. \"When she reached out to me, I thought it was an easy decision. I thought the song was great and it'd be great to reunite with my old friend from Duets.\"\nThe news, of course, comes fresh on the heels of Legend earning a historic EGOT status. After winning a Creative Arts Emmy for his starring role in another NBC production — this year's live performance of Jesus Christ Superstar — Legend became the first African-American man to win an Emmy, along with his Grammys, and an Oscar and Tony Award. Aside from being one of the youngest EGOT honorees, he is also only one of only 15 celebrities to ever hold the distinction.\nAlberto E. Rodriguez/Getty Images Entertainment/Getty Images\nAfter accepting his Emmy, the dad of two, who shares daughter Luna, 2, and 4-month-old son Miles with Chrissy Teigen, adorably heaped praise on his wife of five years. \"We inspire each other,\" Legend said, according to People. \"She inspires my songs, she inspires me to want to be a better husband and a better father. We support each other fully in everything that we do. I root for her in her career and everything she’s doing. And I expect that she’ll be up here winning Emmys herself for all the awesome work that she does.”\nJerod Harris/Getty Images Entertainment/Getty Images\nWhile Legend is known for his sweet side, fans of The Voice, may see the gloves come off as he fights to build a winning team next spring.","url":"https://www.bustle.com/p/john-legend-is-joining-the-voice-season-16-as-a-coach-with-so-much-excitement-11909511"}
