{"authors":["Sean Williams","The Motley Fool"],"date_download":"2018-10-30 20:57:57","date_modify":"2018-10-30 20:57:57","date_publish":"2016-12-23 00:00:00","description":"Johnson & Johnson initially approached Actelion in November with an offer worth about $26 billion.","filename":"data/vaneerConsumption/JohnsonJohnsonsonagainoffagainpursuitofActelionisbackon.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_johnson-and-johnsons-actelion-pharmaceuticals-aquisition-2016-12_1540933077.html","title":"Johnson & Johnson's on-again, off-again pursuit of Actelion is back on","title_page":"    Johnson & Johnson's on-again, off-again pursuit of Actelion is back on - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Jonathan Ernst/Reuters\nMake up your mind, Johnson & Johnson!\nA little more than one week ago, healthcare conglomerate Johnson & Johnson announced that it was no longer pursuing Swiss-based lung disease drug specialist Actelion. Johnson & Johnson had initially approached Actelion in late November with an offer worth about $26 billion to acquire the maker of therapies to treat pulmonary arterial hypertension (PAH), a disease characterized by high blood pressure between the heart and lungs. After Actelion rejected the offer as being too low, J&J upped its offer to north of $27 billion, according to reports. Following a lack of progress, J&J abandoned its offer and walked away from the deal... until yesterday.\nRed rover, let Actelion come over... again\nBased on press releases from both Johnson & Johnson and Actelion on Wednesday morning, both companies are once again engaged in discussions that could lead to J&J acquiring Actelion. As reported by Barron's, Wells Fargo Securities believes a deal could be reached for $32 billion. The analysis assumes the deal would involve 75% cash and 25% debt financing, and that it would close by the end of 2017. Estimates suggest the acquisition would boost pharmaceutical sales growth by 40 to 60 basis points, be 3% accretive to EPS in 2018, and could increase to 5% EPS accretion by 2020.\nThe allure of Actelion throughout this entire process has been its PAH product portfolio, which covers every stage of PAH. Having such dominant market share in the PAH space means excellent pricing power for Actelion, which J&J would undoubtedly appreciate.\nSwiss biotech group Actelion CEO Jean-Paul Clozel arrives for his company's annual general meeting in Basel, May 5, 2011. Reuters / Christian Hartmann\nOn the other side of the coin, J&J is also dealing with the introduction of biosimilar competition to Remicade, its top-selling anti-inflammatory drug slated to bring in more than $6 billion in sales this year. Pfizer's and Celltrion's Inflecta, the biosimilar version of Remicade, is selling for a 15% discount to Remicade's list price, which is expected to chip away at Remicade's total sales in 2017 and beyond. Johnson & Johnson is looking for a quick way to add revenue and profits in the wake of an expected decline in Remicade sales beginning next year. Two up-and-coming PAH drugs, Opsumit and Uptravi, are both expected to generate $2 billion in peak annual sales, which is primarily what J&J would be acquiring in its bid for Actelion.\nHowever, this Fool's opinion is that J&J's sudden willingness to value Actelion at perhaps $32 billion is insane!\nIt's official, J&J's management has lost its mind\nJohnson & Johnson's CEO Alex Gorsky and his management team are generally very cautious in their approach to M&A. Despite bearing a AAA credit rating (it's one of only two publicly traded companies endowed with Standard & Poor's highest credit rating) and more than $40 billion in cash and cash equivalents, J&J has mostly shied away from larger acquisitions. With the exception of medical device company Synthes, most of J&J's purchases are easily digestible. Incorporating a $32 billion buyout could be asking for trouble in so many ways.\nOne of the biggest issues with J&J's pursuit of Actelion is the imminent fate of Tracleer, a PAH drug that comprised 46% of Actelion's sales during the first-half of 2016. Originally approved in 2001, Tracleer's patent protection is essentially up. With generic competition expected to enter the marketplace in 2017, Tracleer's sales could dip by 50% or more within a year. In other words, even with healthy sales growth from Opsumit and Uptravi, Tracleer's sales decline could deliver an overall sales decline for Actelion's product portfolio in 2017.\nA general view shows Swiss biotech group Actelion Headquarters in Allschwil Thomson Reuters\nAnother key point is that Actelion's product portfolio and pipeline have a lot of question marks beyond Opsumit and Uptravi. Aside from Tracleer's imminent exposure to generics, the company's pipeline leaves a lot to be desired at a $32 billion price tag. For instance, ponesimod, an experimental treatment for relapsing multiple sclerosis that's currently being studied in the pivotal OPTIMUM trial, is likely to face fierce competition from market share leader Gilenya, developed by Novartis. Being good enough to simply match Gilenya's effectiveness may not be enough, and J&J would be heading into a deal with Actelion while flying blind as to the phase 3 results.\nBut arguably the biggest problem with this deal is the valuation. If J&J ponied up $32 billion for Actelion, it would probably be paying in excess of six times peak annual sales, which is far and away higher than where most M&A deals in biotech and pharmaceuticals have gone down in recent years. Perhaps even more telling is what J&J would be paying relative to Actelion's EBITDA over the trailing 12-month period. Based on the $857.6 million in trailing 12-month EBITDA, J&J would be paying more than 37 times EBITDA and approximately 36 times next year's earnings. At $32 billion, I'm not convinced J&J would actually come out ahead on the deal, even with the boost to its EPS.\nStay the course\nThe good news is that Johnson & Johnson is a great company to own regardless of whether or not it acquires Actelion. It's comprised of more than 250 subsidiaries, allowing it to divest and acquire without disrupting its core businesses, and it possesses three major operating groups, each with its own purpose.\nJ&J's consumer health products are slow growing, but the pricing power and cash flow the segment provides are very predictable. Medical devices have also been slower growing of late, but there's a long-tail growth opportunity as the U.S. elderly population soars in the decades to come. And finally, pharmaceuticals provide the juicy margins and fast growth that we've become accustomed to with J&J.\nWhile not a J&J shareholder myself, if I were in the board's shoes I would strongly suggest J&J walk away from Actelion, or at least hold off on its pursuit until the generic effect on Tracleer, and the results of a handful of phase 3 trials, are known. My belief is J&J could get a much better deal on Actelion by this time next year.","url":"https://www.businessinsider.com/johnson-and-johnsons-actelion-pharmaceuticals-aquisition-2016-12"}
