{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:20:07","date_modify":"2018-10-30 21:20:07","date_publish":"2016-02-19 15:08:43","description":"GOP contender John Kasich says the problem with Obamacare is it doesn’t control the costs of healthcare. His solution, however, would involve using more “federal resources.” |","filename":"data/vaneerConsumption/JohnKasichVowsToFixObamacareByUsingMoreFederalResources.json","image_url":"https://media.breitbart.com/media/2016/02/Kasich-Getty-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_19__1540934407.html","title":"John Kasich Vows To Fix Obamacare By Using More ‘Federal Resources’","title_page":"John Kasich Vows To Fix Obamacare By Using More ‘Federal Resources’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"GOP contender John Kasich says the problem with Obamacare is it doesn’t control the costs of healthcare. His solution, however, would involve using more “federal resources.”\n“I’d take some federal resources and I’d combine it with the freed up Medicaid plan to continue to cover the working poor,” Kasich said during a CNN Townhall. “We can’t eliminate this and have tens of millions of Americans without health insurance. And by the way if I’m president a pre-existing condition will never be acceptable to deny you health insurance. That is un-American to take people off because they got sick. That’s just a rip-off.”\nKasich continued:\nBut here’s the larger plan and we’re actually doing this in our state and I would like to take it nationally. You see, we — we don’t know how our hospitals really do and what their costs are and we really don’t know how our doctors do or what their costs are. It’s easier to interpret the Dead Sea Scrolls than it is a hospital bill.\nKasich said he would want to achieve “total transparency” of information from hospitals and doctors on what they do and what it costs so the market will drive people’s choices of healthcare. Kasich says doctors who keep people healthy deserve a reward, though he is not clear about where the reward would come from in his plan. If healthcare is market-driven, then doctors and hospitals providing high quality care at the lowest cost will be rewarded with more satisfied patients.\nKasich says he is “doing it in Medicaid” in Ohio, but, as host Anderson Cooper pointed out, the governor has been criticized for expanding Medicaid under Obamacare. Asked if he regrets expanding Medicaid, Kasich gave a response that didn’t really clear things up:\nListen, we drove the cost of this health care — of this Medicaid program to like 2.5 percent. The whole country would like to have a rate like that and how do we do it? We said that if mom and dad want to say in their own home rather than being forced in the nursing they ought to be able to do it.\nKasich has not been able to articulate a truly conservative plan for health insurance because, by expanding Medicaid in his own state under Obamacare, he has expanded the federal footprint in healthcare.\nHis recent defensive claims that he has been fighting Obamacare in a couple of lawsuits are exaggerated at best. In fact, when Republicans in Ohio refused to pass a law joining Obamacare, Kasich did so through executive action, pushing it through an administrative body called the Controlling Board, as Breitbart News reported.\nKasich continues to defend expanding Medicaid with the claim that he is living out his Christian faith to help the poor and pressing the notion that this big government policy is a moral imperative.","url":"https://www.breitbart.com/politics/2016/02/19/john-kasich-vows-to-fix-obamacare-by-using-more-federal-resources/"}
