{"authors":["Sean Poulter For The Daily Mail"],"date_download":"2018-10-22 23:09:02","date_modify":"2018-10-22 23:09:02","date_publish":"2017-03-10 02:03:17","description":"Workers at employee-owned Waitrose and John Lewis will receive the equivalent of 6 per cent of salary after the bonus pot was cut from £145million to £89.4million.","filename":"data/vaneerConsumption/JohnLewisandWaitrosecutbonusforstaff.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/02/3E1F49E700000578-0-image-a-85_1489111319487.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299740_John-Lewis-Waitrose-cut-bonus-staff_1540249742.html","title":"John Lewis and Waitrose cut bonus for staff","title_page":"John Lewis and Waitrose cut bonus for staff | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Staff bonuses at John Lewis and Waitrose have been slashed to the lowest level since the 1950s.\nThe 86,700 workers at the employee-owned business will receive the equivalent of 6 per cent of salary – about three weeks’ pay – after the bonus pot was cut from £145million to £89.4million.\nCompany bosses say the move is needed despite pre-tax profits rising 21.2 per cent to £370.4million. The 6 per cent bonus is the lowest since 1954, when it was 4 per cent.\nStaff bonuses at John Lewis and Waitrose have been slashed to the lowest level since the 1950s. Workers will receive the equivalent of 6 per cent of salary\nIt was 10 per cent last year and as recently as 2013, staff – or partners, as they are known – received 17 per cent.\nThe cut will help fund investment to cope with the switch by customers from in store to online shopping.\nThis has seen all the major supermarkets, plus Marks & Spencer, cancel the building of new stores and close others.\nGroup chairman Sir Charlie Mayfield said John Lewis faced ‘an increasingly uncertain market this year’.\nEmployees recieved 10 per cent bonuses last year and as recently as 2013, staff – or partners, as they are known – received 17 per cent\nThe group also blamed a fall in the value of the pound, which has increased the cost of imports.\nIt has already been announced that Waitrose, which faces competition from cut-price rivals, will close six stores and remove a level of management, putting nearly 700 jobs at risk.\nJohn Lewis plans to axe nearly 400 jobs across its instore restaurants and home fittings service. The company is also investing in robotics in its warehouses, which seems likely to reduce the number of workers needed to pick, pack and despatch items.","url":"https://www.dailymail.co.uk/news/article-4299740/John-Lewis-Waitrose-cut-bonus-staff.html"}
