{"authors":["Matt Dathan","Mailonline Political Correspondent"],"date_download":"2018-10-23 02:32:59","date_modify":"2018-10-23 02:32:59","date_publish":"2016-01-29 17:07:25","description":"The Commons Speaker launched blistering attack on business minister after she continuously heckled her Labour rival in a debate about job losses in a government office in Sheffield.","filename":"data/vaneerConsumption/JohnBercowlaunchesattackonToryministerAnnaSoubryinHouseofCommons.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B4606100000578-0-image-a-31_1454088724284.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423028_John-Bercow-launches-blistering-attack-Tory-minister-Anna-Soubry-House-Commons_1540261979.html","title":"John Bercow launches attack on Tory minister Anna Soubry in House of Commons","title_page":"John Bercow launches attack on Tory minister Anna Soubry in House of Commons | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Speaker ordered the business minister to show some 'basic\nJohn Bercow today launched a blistering attack on Tory minister Anna Soubry, telling her to show some 'basic dignity' before yelling: 'It's not about you... just sit and listen.'\nThe House of Commons Speaker scolded the business minister for heckling her Labour rival in a debate about job losses in a government office in Sheffield.\nAn angry Bercow shouted at Soubry: 'Order! Minister, you have had your say, and you will have further says.\n'There is something here about a basic dignity.\nScroll down for video\nOutraged: Speaker John Bercow, pictured left, accused Anna Soubry of lacking 'basic dignity' in the Commons\n'Just sit and listen. It is not about you; it is about the issue.\n'It is not about the hon. Gentleman either. Be quiet and listen. That is the end of it.\n'It is not a request; it is an instruction.\nLater in the debate, Soubry was again shot down by Bercow after she criticised a Labour MP for making a statement rather than asking a question, which she described as 'not accurate and rubbish'.\nIt caused a further outburst by Bercow, who told Soubry: 'The hon. Lady should stick to the discharge of her responsibilities to the best of her ability.\n'I am the arbiter of good order. I handle those matters, and I certainly do not require any advice from a junior minister.'\n'That's an instruction': Bercow told Soubry to 'sit down and listen' after she heckled Labour rival continuously\nBercow's rant came after Soubry was accused by numerous MPs of showing 'contempt for the north of England' after the Government announced the closure of a Department for Business office in Sheffield in 2018.\nSoubry was asked by Labour MP Conor McGinn that the 240 people whose jobs are at risk had 'not heard a shred of sympathy or regret' in her Commons statement, while Sheffield MP Louise Haigh said the closure demonstrated a 'London-centric focus' by the Government.\nIrritated by Labour MPs questions to her, Soubry continuously heckled shadow minister Gordon Marsden when it was his turn to stand at the despatch box, triggering him to say: 'Will the minister stop chuntering from a sedentary position?'\nDefending the decision to close the Sheffield office, Soubry insisted the Government must 'spend taxpayers' money wisely'.\nShe announced that the department was reducing its locations from 80 to around seven as part of a plan to streamline the Business department.\nIt is not the first time Ms Soubry has been scolded in the Commons.\nIn a heated debate with SNP MP Alex Salmond last year, Soubry was told: 'She should be setting an example to your new members, not cavorting about like some demented junior minister – behave yourself, woman.'\nTHEN HOURS LATER SOUBRY LAUNCHES INTO HER OWN RANT ON TWITTER Soubry tore into East Midlands Trains, claiming their service from St Pancras had left two minutes early A couple of hours after being scolded by Bercow in the Commons, Soubry launched into her own rant, attacking East Midlands Trains after her train left two minutes early. In an exchange on Twitter, pictured, East Midlands Trains insisted the train had left from London St Pancras on time - a claim the Tory minister rejected. Soubry has history when it comes to train complaints. In November last year she tore into Crosscountry trains after boarding a 'filthy' service where walls were taped together and toilets had no water. The business minister posted pictures on Twitter of the 'shameful' state of a train she boarded from Burton to Birmingham. She condemned the service as 'the dirtiest train I've ever travelled on' and demanded that 'passengers get clean trains - now'.\nSoubry has gained a reputation for her colourful language and outspoken remarks since she was first elected in 2010.\nWhen she was first a minister in 2012, a Tory colleague warned David Cameron that she was a 'train wreck waiting to happen' after she was accused of insensitivity by branding the law on assisted suicide 'ridiculous'.\nAnd in a Commons documentary last year it was claimed she shouted 'sanctimonious c***' at former Labour leader Ed Miliband.\nShe issued a furious denial, insisting she would 'never use that word'.\nIn October Soubry hit out at the 'tatty gifts' politicians and officials exchanged with foreign dignitaries.\nShe said the country must do better than offer bizarre gifts such as goose fat and a Margaret Thatcher biography to foreign dignitaries.\nAnd earlier this week she spoke out about George Osborne's claim that the £130million tax bill with Google represented a 'major success' for the taxpayer.\nShe said: 'It doesn't sound like an awful lot of money, of course it doesn't.\n'It would be silly to say otherwise.'","url":"https://www.dailymail.co.uk/news/article-3423028/John-Bercow-launches-blistering-attack-Tory-minister-Anna-Soubry-House-Commons.html"}
