{"authors":["Jo Tweedy For Mailonline"],"date_download":"2018-10-23 01:21:26","date_modify":"2018-10-23 01:21:26","date_publish":"2017-04-26 11:46:17","description":"The Masterchef judge appeared on Good Morning Britain today as #bramblegate rumbled on. Torode told Susannah Reid and Piers Morgan that it was fine to use bramble AND blackberry.","filename":"data/vaneerConsumption/JohnTorodeDEFENDScallingblackberriesbrambles.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9F1F9700000578-0-image-a-29_1493203554088.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446878_John-Torode-DEFENDS-calling-blackberries-brambles_1540257686.html","title":"John Torode DEFENDS calling blackberries 'brambles'","title_page":"John Torode DEFENDS calling blackberries 'brambles' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"John Torode has waded into #bramblegate - after he was slammed by Masterchef viewers for referring to blackberries as 'brambles'.\nThe judge, 51, and co-host Gregg Wallace, felt the wrath of those tuning in to Monday's show after daring to use what some suggested was the 'fashionable' way to describe the popular summer fruit.\nAnswering the criticism, Torode appeared on Good Morning Britain today saying either word was fine - and pointing out that 26-year-old contestant Brodie, who cooked with the fruits on the show, grew up in Scotland, where 'bramble' is commonly used.\nScroll down for video\nHe's sitting on the fence! MasterChef judge John Torode appeared on Good Morning Britain today to offer his own personal verdict, that it was fine to use the words 'bramble' or 'blackberry' when describing the summer fruit\nYou're an Australian, what do you know? Piers Morgan, on #TeamBlackberry, said he would refuse to listen to the argument that blackberries could be called brambles\nIs it a bramble, is it a blackberry? Masterchef was accused of going for the more 'fashionable' terminology to describe the summer fruit..but Torode explained to Good Morning Britain viewers that brambles is commonly used in Scotland to describe the berry - where contestant Brodie is from\nScottish store designer Brodie was the man using the 'brambles' in the kitchen; Masterchef judge Gregg Wallace repeatedly called blackberries brambles on Monday's episode\nTorode told Good Morning Britain: 'In Scotland they are actually called brambles.'\nHowever, ITV breakfast show presenter Piers Morgan hit back firmly on the side of #TeamBlackberry.\nHe said: 'We don't judge what we call food on what the Scots call it. These are blackberries. I will fight for the right to call them blackberries.\n'I won't have you, an Australian, citing Scots, ordering me to call them brambles.'\nTorode snapped: 'Nobody's ordering you to do anything. The fact is they are called both things, brambles or blackberries.'\nBramblegate began after viewers blasted the Monday night episode of the show as 'pretentious b*******' - after the judges used the word 'brambles' to describe blackberries.\nBLACKBERRY OR BRAMBLE - WHO'S REALLY RIGHT? (AND WHAT ABOUT BRAMBLE JELLY?) The correct definition according to the Oxford Dictionary defines bramble as the 'scrambling shrub', ie the bush and the blackberry as the fruit How do the bramble naysayers explain this? Bramble jelly is readily available in supermarkets and also made by jam giant Hartley's...however, the main ingredient in the jam is...blackberry juice According to the Oxford Dictionary, viewers of last night's episode have a point. The correct definition describes the bramble as the bush, not the fruit, saying: 'A prickly scrambling shrub of the rose family, especially a blackberry.' Bramble jelly, a blackberry based jam, is widely produced in the UK...but lists blackberry juice as the main ingredient.\nThe fruit-themed rage was sparked after Scottish store designer Brodie, 26, served up a game dish featuring blackberries, only for the judges to refer to them as brambles throughout.\nAngry fans of the quintessentially British fruit quickly took to social media to vent, suggesting that the show was using the 'fashionable' term rather than the correct one.\nBudding chef Brodie, bidding for a place in the show's knockout stages, presented Wallace and Torode with a roast partridge breast served with parsnip, sweet potato and beetroot chips, a haggis scotch egg, pickled brambles and a bramble and port sauce.\nThe dish, inspired by his childhood, was generally a hit although Torode blasted Brodie's 'brambles' for not being pickled enough, saying they were 'too sweet'.\nOn Twitter, one viewer, @deutschmikey declared: 'So we are not to call them blackberries any more people - remember, the fashionable call them brambles...brambles! #Masterchef.'\nMeanwhile on Facebook, Jean Holland raged: 'Why are they calling blackberries 'brambles' on Masterchef? What a load of pretentious b*******'.\nDefinitely not a bramble: Viewers took to social media to rant about the way the summer fruit was being described\nThe summer fruits were served both pickled and in a sauce for Brodie's roast partridge dish\nWhat a pickle! John Torode derided Brodie for not pickling his brambles enough\nSome claimed geography rather than pretension was to blame, suggesting that some parts of the country had always called blackberries brambles.\n@Bob_TheBaldie 11h11 suggested: 'I think it's a north/south thing. Brambles in the North, and the correctly named blackberries down here in the south.'\nSo, who's right? According to the Oxford Dictionary, viewers of last night's episode have a point.\nTorode also finally clarified that he and co-host Gregg Wallace are 'mates'...but don't socialise outside of work\nYou keep him! Torode said he didn't want Piers Morgan to bag a spot on Celebrity MasterChef\nThe correct definition describes the bramble as the bush, not the fruit, saying: 'A prickly scrambling shrub of the rose family, especially a blackberry.'\nOn Good Morning Britain, Torode also spoke about his friendship with Wallace, saying: 'We don't hang out because we spend so much time together.'\nHe joked of Wallace, who married last year for the fourth time, that the pair hang out at 'his weddings' adding: 'That happens about every year, so that's fine.'\nAsked what his final meal would be, Torode asked: 'Why am I dying? I don't understand why I've always got to die!'\nAnd he rebuffed Susanna Reid's suggestion that Morgan appear on Celebrity MasterChef, saying: 'Please don't. Don't do that to us. You keep him.'","url":"https://www.dailymail.co.uk/femail/article-4446878/John-Torode-DEFENDS-calling-blackberries-brambles.html"}
