{"authors":[],"date_download":"2018-10-21 02:48:54","date_modify":"2018-10-21 02:48:54","date_publish":"2018-08-28 13:55:08","description":"Attendees can enjoy a variety of activities within The Post’s booth including children's story time sessions, author discussions, trivia and more.","filename":"data/vaneerConsumption/JoinTheWashingtonPostattheLibraryofCongressNationalBookFestivalSept12018.json","image_url":"https://www.washingtonpost.com/resizer/UpoX34SuvIodcfgYqOMWS2RCk5c=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/X6KMUOGAGI54PAUY5ZVTZ77JY4.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_08_28__1540090134.html","title":"Join The Washington Post at the Library of Congress National Book Festival Sept. 1, 2018","title_page":"Join The Washington Post at the Library of Congress National Book Festival Sept. 1, 2018 - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"The Washington Post is returning as charter sponsor and media partner of the Library of Congress National Book Festival on Saturday, Sept. 1 at the Walter E. Washington Convention Center from 9 a.m. to 7:30 p.m. Attendees can enjoy a variety of activities within The Post’s booth including:\nColor-your-own bookmarks and photos with Ned the Newshound\nAttendees can pick up and color their own bookmark featuring The Post’s mascot, Ned the Newshound throughout the day. Ned will make a special appearance from 11:30 a.m. to 1:30 p.m. to pose for pictures with festivalgoers.\nDiscussion with author Elizabeth Acevedo\nNeema Roshania-Patel of The Lily, a women-focused publication from The Washington Post, will host a discussion with author Elizabeth Acevedo about Acevedo’s book, “The Poet X” from 10 to 11 a.m. The Lily will be featuring “The Poet X” as its inaugural book club pick.\nChildren’s story time sessions\nLocal children’s book authors Susan Stockdale, Katy Kelly, Jennifer O’Connell and Megan Wagner Lloyd will conduct story time sessions every hour from 11 a.m. until 3 p.m. Attendees can visit the Politics & Prose booth at the festival to purchase the books read during each session.\nRetropod trivia hour\nRetropod, The Post’s history podcast, will host a trivia hour from 3 to 4 p.m. Test your history knowledge with The Post’s Mike Rosenwald for a chance to be featured in an upcoming episode of Retropod.\nPhoto booth\nVisit The Post’s photo booth anytime from 11 a.m. to 4 p.m. and take home a keepsake photo.\nThe Washington Post’s “Comic Riffs” columnist/cartoonist Michael Cavna will lead a freewheeling, “talk show”-style conversation (Genre Fiction stage, 2:40-4:40 p.m.) with five comics creators: bestselling author, educator and leading culture commentator Roxane Gay (Marvel’s pioneering “World of Wakanda”); Reuben Award-winning “Mutts” cartoonist and children’s author Patrick McDonnell; Eisner Award-winning “Hip Hop Family Tree” cartoonist Ed Piskor (“X-Men: Grand Design”); and top French graphic novelist Pénélope Bagieu (“Brazen: Rebel Ladies Who Rocked the World”) with Eisner Award-winning “Spinning” graphic novelist Tillie Walden (“On a Sunbeam”).\nAttendees can also sit in on more than 20 author discussions hosted or introduced by Post editors, reporters and critics. View a full list here.\nLearn more about the National Book Festival here: https://loc.gov/bookfest/","url":"https://www.washingtonpost.com/pr/wp/2018/08/28/join-the-washington-post-at-the-library-of-congress-national-book-festival-sept-1-2018/"}
