{"authors":[],"date_download":"2018-10-22 22:52:54","date_modify":"2018-10-22 22:52:54","date_publish":"2014-06-11 04:36:57","description":"Some California students couldn’t believe what they saw when they opened their new yearbooks: an anti-Semitic insult.","filename":"data/vaneerConsumption/JokeWentTooFarInsultSlipsIntoYearbook.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_joke-went-too-far-insult-slips-yearbook-n128081_1540248774.html","title":"'Joke Went Too Far': Insult Slips Into Yearbook","title_page":"'Joke Went Too Far': Insult Slips Into Yearbook","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy NBC BAY AREA\nSome students at a Cupertino high school couldn’t believe what they saw when they opened their new yearbooks: a Jewish student’s name changed into an anti-Semitic insult.\nSomeone changed the last name of a Jewish student of Israeli descent in this year’s Monta Vista High School yearbook, replacing the last three letters of his name with the word “Jew.”\nMarco Schwiebert is one of hundreds of Monta Vista High School students who were stunned to see their friend’s name more than just misspelled in this year’s yearbook.\n\"I think it was a joke, but it's definitely not a funny joke,” Schwiebert said.\nFremont Union High School District spokeswoman Sue Larson said they have tracked down the student who added the insult. \"Most regrettably, [the slur] was not caught by our yearbook staff,” Larson said.\n“That student has admitted that they were involved,” she said. “The local law enforcement agencies are working with the student and trying to sort out the consequences.\"\nThe family of the student whose name was changed didn’t want their name used, but the boy’s mother told NBC Bay Area they want to use this incident to teach others what is funny and what is hurtful.\n“While this may have been a joke,” the mother said, “the joke went too far.”\nThe books will not be reprinted. School is out for the summer, and with 1,600 of the yearbooks already printed and handed out, the district says they are asking students to return to the school to pick up a label they can use to cover up the insult.","url":"https://www.nbcnews.com/news/us-news/joke-went-too-far-insult-slips-yearbook-n128081"}
