{"authors":["Press Association Reporter"],"date_download":"2018-10-23 04:14:08","date_modify":"2018-10-23 04:14:08","date_publish":"2017-04-26 15:56:47","description":"Johanna Konta put a difficult weekend behind her to reach the second round of the Porsche Grand Prix in Stuttgart with a victory over teenager Naomi Osaka.","filename":"data/vaneerConsumption/JoKontabeatsOsakainPorscheGrandPrixfirstround.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA025D300000578-0-image-a-17_1493218386895.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-4448170_Jo-Konta-beats-Osaka-Porsche-Grand-Prix-round_1540268048.html","title":"Jo Konta beats Osaka in Porsche Grand Prix first round","title_page":"Jo Konta beats Osaka in Porsche Grand Prix first round | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Johanna Konta put a difficult weekend behind her to reach the second round of the Porsche Grand Prix in Stuttgart.\nThe British No 1 travelled to Germany from Constanta, where she left the court in tears and was accused of gamesmanship during Great Britain's fiery Fed Cup play-off against Romania.\nKonta did not find things easy against teenager Naomi Osaka but took advantage of her opponent's physical struggles to run away with the third set and triumph 7-6 (7/5) 3-6 6-1.\nJo Konta put a difficult weekend behind her to reach the second round in Stuttgart\nKonta did not find things easy against teenager Naomi Osaka on her weakest surface\nKonta had not dropped a set in two previous meetings with 19-year-old Osaka but clay is her weakest surface.\nThe world No 7 struggled for consistency in the opening two sets but the key moment came when she saved two break points in the third game of the third set.\nKonta broke the Osaka serve in the next game and did not look back, with the Japanese-American becoming increasingly bothered by an abdominal injury.\nKonta will face Latvia's Anastasija Sevastova in the second round.\nThe 25-year-old said on BT Sport: 'I think obviously you could tell she was struggling, I hope everything is okay with her and she recovers quickly.\n'It was just important for me to stay on my own game. Even though I lost the second set I didn't feel like I did much wrong.'","url":"https://www.dailymail.co.uk/sport/tennis/article-4448170/Jo-Konta-beats-Osaka-Porsche-Grand-Prix-round.html"}
