{"authors":[],"date_download":"2018-10-30 21:48:05","date_modify":"2018-10-30 21:48:05","date_publish":"2018-10-30 04:00:00","description":"Kitchen Curious: The only biscuit recipe you’ll ever need requires just 2 ingredients","filename":"data/vaneerConsumption/JoleneBlacksCreamBiscuits.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/newsEngin.22947449_JoleneBlacksCreamBiscuits-UTBMULU1ACX-680x383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_food--cooking_th_78940c9ba5fc382825f3bad7aa7e310d__1540936085.html","title":"Jolene Black’s Cream Biscuits","title_page":"Recipe: Jolene Black’s Cream Biscuits","title_rss":"NULL","source_domain":"ajc.com","text":"Biscuits are one of my guilty pleasures. I simply cannot pass up one of these heavenly, flaky, buttery rounds.\nNot sure about you, but I’ve got a biscuit ritual: Snag one hot from the oven. Slice the already bursting seam with a knife. Add a pat of good butter to each half and watch it melt. Do you know how hard it is not to sneak a bite as you watch the butter stain the bread yellow? Dab on fruit preserves, decidedly choosing from among the gifted jars of the homemade variety, ones that friends felt I was worthy enough to receive. Coupled with a cup of coffee, a well-made, well-treated biscuit is a delicious start to a day.\nI don’t bake biscuits often because others make them far better than me. I’ve been treated to fresh biscuits from Chadwick Boyd, a food and lifestyle personality, part-time Atlanta resident and biscuit aficionado who is a key figure in the annual International Biscuit Festival in Knoxville, Tenn. He makes moist, poufy biscuits look like a cake walk while I walk the road toward dry and crumbly.\nNot that I haven’t tried to improve. A few years ago, I worked the line at Bojangles’. That fast-food chain has got biscuit-making down to a science — in 48 steps. That’s at least 45 steps too many for me.\nPlus, why compete with perfection?\nBecause I’ve since gotten ahold of a keeper of a biscuit recipe. It calls for just two ingredients: White Lily self-rising flour and heavy cream. Perhaps you know of it. It’s called Jolene Black’s Cream Biscuits. Originally published in the Times-Picayune in April 2005, it is a reader recipe. It has since been reprinted in “Cooking Up a Storm — 10th Anniversary: Recipes Lost and Found From the Times-Picayune of New Orleans.”\nAs the Times-Picayune editors note, success comes from sticking with these two ingredients. “The trick is to use these exact ingredients. The biscuits won’t be as light if you use any other kind of self-rising flour. The fat in the heavy cream replaces the shortening or butter in comparable recipes.”\nThe first time I made these biscuits, I probably should have recorded my oohs and aahs. I was alone in my kitchen, talking to no one about my wonderment and delight at the divine smell, the sky-high rise of the bread, and the brevity of the baking project — it’s not a project; start to finish, making these biscuits is faster than washing dishes by hand. I marveled at the perfection of the liquid-to-dry ratio. And that we don’t even need to add salt.\nAn apple a day might keep the doctor away. A cream biscuit a day surely is a recipe for tasting heaven on earth.\nThe recipe for Jolene Black’s Cream Biscuits requires just two ingredients: White Lily self-rising flour and heavy cream. LIGAYA FIGUERAS / LFIGUERAS@AJC.COM (The Atlanta Journal-Constitution)\nRead the 2018 AJC Fall Dining Guide: Dining on Buford Highway\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/lifestyles/food--cooking/the-only-biscuit-recipe-you-ever-need-requires-just-ingredients/Btt3bQE4ZmD3qsqmipO7xI/"}
