{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 04:43:57","date_modify":"2018-10-23 04:43:57","date_publish":"2017-04-26 16:22:55","description":"'I am heart-broken to lose a friend, a mentor, a guy so singular and dynamic you’d have to design a hurricane to contain him,' Foster, 54, said in a statement.","filename":"data/vaneerConsumption/JonathanDemmeOscarwinningdirectordiesaged73.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA0780300000578-0-image-a-24_1493220043790.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4448256_Jonathan-Demme-dies-age-73_1540269837.html","title":"Jonathan Demme, Oscar-winning director, dies aged 73","title_page":"Jonathan Demme, Oscar-winning director, dies aged 73 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jodie Foster has paid a heartfelt tribute to her Silence Of The Lambs director Jonathan Demme, who passed away on Wednesday at the age of 73.\nFoster and Demme both won Oscars for the 1991 thriller that also earned an Academy Award for Anthony Hopkins as the cannibalistic Hannibal Lecter.\n'I am heart-broken to lose a friend, a mentor, a guy so singular and dynamic you’d have to design a hurricane to contain him,' Foster, 54, said in a statement.\nThe actress and director went on: 'Jonathan was as quirky as his comedies and as deep as his dramas. He was pure energy, the unstoppable cheerleader for anyone creative. Just as passionate about music as he was about art, he was and will always be a champion of the soul.'\nA sad loss: Oscar-winning Silence Of The Lambs director Jonathan Demme has died at the age of 73. He is pictured with stars Jodie Foster and Anthony Hopkins at the 1992 Academy Awards\nPaid tribute: 'I am heart-broken to lose a friend, a mentor,' Foster, 54, said in a statement. 'He was and will always be a champion of the soul.' The two are pictured in 2011\nHopkins, 79, said he was 'really shocked and very sad' to hear the news of Demme's death.\n'He was one of the best, and a really nice guy as well who had such a great spirit.'\n'Every day being with him was a high five. My condolences to his family,' the Welsh star said in a statement.\n'Shocked and sad': Hopkins, 79, pictured on the Silence set with Demme, described him as 'one of the best, and a really nice guy as well who had such a great spirit'\nIn addition to Best Picture Academy Award winner Silence Of The Lambs, Demme was also well known for directing 1993's Philadelphia, that nabbed an Oscar for Tom Hanks and another for Bruce Springsteen for the film's theme song.\nHanks took to social media to talk about his passing, writing: 'Jonathan taught us how big a heart a person can have, and how it will guide how we live and what we do for a living. He was the grandest of men.'\nSpringsteen tweeted: 'Over here on E Street, we're deeply saddened to hear about the passing of Jonathan Demme.'\n'He was an inspiration for me, a beautiful filmmaker and a great spirit. Always smiling, always involved with the world and always pushing you to go for your best. He'll be deeply missed.'\nBig heart: In 1993, Demme directed Tom Hanks in his Oscar-winning role as a man dying from AIDS in Philadelphia. Hanks described the filmmaker as 'the grandest of men'\n'He was an inspiration': Bruce Springsteen, who won an Oscar for his best original song Streets Of Philadelphia, also paid tribute with a series of tweets\nDemme died after a long battle with esophageal cancer and from complications of heart disease.\nHe was first diagnosed in 2010 and went into remission. But in 2015 the cancer came back.\nSick: Demme was last seen at a public event in November when he attended a Vionaries Tribute luncheon in New York City\nA family friend said that his health got much worse in 'recent weeks.'\nAn avid music fan, Demme was responsible for the 2016 Justin Timberlake documentary The Tennessee Kids.\nThe pop star and actor shared a black and white photo of himself with the director to his Instagram and wrote: 'Where do I begin..? Words just aren't enough with heartache like this.'\nYou, master of humanity. You, genius of storytelling. You, generous and warm man. You, special soul,' Timberlake went on.\n'You taught me so much about life and art and about standing up for what you believe. You made me better at my craft. And, the time I spent with you away from a camera and a stage made a better human out of me. You are truly irreplaceable. I will miss you so dearly, my sweet friend. I hope we meet again someday. I love you, JD.'\nHeartbroken: Justin Timberlake, whose 2016 documentary The Tennessee Kids was directed by Demme shared this photo of the two of them together along with a tribute\n'I miss you, buddy': Horror writer Stephen King took to Twitter to express his sorrow\n'A great artist': Oscar-winning director and producer Ron Howard said there are 'very few' like Demme\nOscar-winning filmmaker Ron Howard called Demme 'a great artist, humanitarian, activist & a warm encouraging colleague.'\nHe added: 'I've known very few like him. He will be missed.'\nDemme first came to Hollywood's attention with the 1971 biker B-movie Angels Hard As They Come.\nIn 1980, he was behind the hit comedy Melvin And Howard with Jason Robards and Mary Steenburgen.\nHe went on to direct Goldie Hawn and Kurt Russell in 1984's Swing Shift, the film on which the two actors met and fell in love.\nIn 1986 he had a sleeper hit on his hands when he directed Melanie Griffith in the caper Something Wild.\nSweet: Demme directed Goldie Hawn and Kurt Russell in 1984's Swing Shift, the film the actors met and fell in love on. Also pictured it Belinda Carlisle, far left\nEarly years: In 1986 he had a sleeper hit on his hands when he directed Melanie Griffith and Jeff Daniels in the caper Something Wild\nHe sealed his reputation as a hot director when he made Married To The Mob with Michelle Pfeiffer in 1988.\nThe Silence Of The Lambs followed in 1991 and turned out to be his biggest hit.\nThe film is about a serial killer and the agent (Foster) who tracks him with the help of twisted murderer Hannibal 'The Cannibal' Lecter (Hopkins).\nIn 1993 Demme won acclaim by directing Philadelphia, about a man with HIV who is fired by his law firm because of his condition.\nHanks played the fired lawyer while Denzel Washington played the lawyer determined to get him justice.\nHe re-teamed with Washington for 2004's remake of The Manchurian Candidate.\nQuality: He had luck with smaller films like 2008's Rachel Getting Married with Anne Hathaway; here he is seen with Anne and her husband Adam Shulman in 2015\nDemme worked with Oprah Winfrey on the 1998 drama Beloved about a slave who is visited by his dead daughter, and remade the classic Charade with Thandie Newton and Mark Wahlberg in 2002's The Truth About Charlie.\nHe also had luck with smaller films like 2008's Rachel Getting Married with Anne Hathaway and 2015's Ricki And The Flash with Meryl Streep and Rick Springfield.\nThe director is survived by his wife Joanne Howard, an artist, and their three children Jos, Brooklyn and Romona.\nDemme's relatives have asked those wanting to pay their respects to make donations to the filmmaker's favourite charity, Americans For Immigrant Justice, instead of flowers.\nThey go back: His last big film was the 2015 drama Ricki And The Flash with Meryl Streep as a down-on-her-luck LA-based rock star; here Rick Springfield is pictured center\nLast laugh: In 2016 Jonathan was behind the Justin Timberlake documentary The Tennessee Kids\nFollowing the news of his passing, some of his friends have flocked to their social networking sites to pay their respects and pass on their condolences to his family.\nMoonlight director Barry Jenkins said: 'My man Demme was the kindest, most generous. A MASSIVE soul. He lived in love. And rests in peace.'\nScreenwriter Beau Willimon added: 'I only worked with him once - he was just like his films: brilliant, curious & original. RIP Jonathan Demme - a truly great filmmaker.'\nWhile Edgar Wright said: 'Very sad to hear of the passing of the great Jonathan Demme. Admired his movies, his documentaries, his concert films. He could do anything. Too many great films to mention: Something Wild, Stop Making Sense, Silence Of The Lambs, Melvin & Howard, among countless varied others.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4448256/Jonathan-Demme-dies-age-73.html"}
