{"authors":["Associated Press"],"date_download":"2018-10-22 22:51:26","date_modify":"2018-10-22 22:51:26","date_publish":"2017-03-16 04:44:17","description":"SAN DIEGO (AP) - On a night when well-hit balls died on the warning track, Petco Park finally yielded to a hometown favorite and the All-Star Game MVP.Adam...","filename":"data/vaneerConsumption/JonesHosmerhomertoliftUSto42winvsVenezuela.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/06/wire-226649-1489644002-657_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318850_Jones-Hosmer-homer-lift-US-4-2-win-vs-Venezuela_1540248686.html","title":"Jones, Hosmer homer to lift US to 4-2 win vs Venezuela","title_page":"Jones, Hosmer homer to lift US to 4-2 win vs Venezuela | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SAN DIEGO (AP) - On a night when well-hit balls died on the warning track, Petco Park finally yielded to a hometown favorite and the All-Star Game MVP.\nAdam Jones hit a tying home run leading off the eighth inning and Eric Hosmer added a two-run shot three batters later as the United States rallied to beat Venezuela 4-2 on Wednesday night in the second round of the World Baseball Classic.\nJones played at Morse High about 8 miles east of Petco Park. His father and brother both served in the military.\nUnited States starting pitcher Drew Smyly throws to the plate against the Venezuela during the first inning of a second-round World Baseball Classic game in San Diego, Wednesday, March 15, 2017. (AP Photo/Alex Gallardo)a\n\"This ranks up high,\" said Jones, the Baltimore Orioles slugger. \"I've been in the postseason a couple of times but never won it. To do this with Team USA, it's a big difference. This is country versus country, and to do it in front of a massive military city, I really don't have words for it.\"\nAfter being shut down for the first five innings by Seattle Mariners ace Felix Hernandez, the Americans broke through against Venezuela's bullpen in the Pool F opener for both teams.\nHosmer, the MVP of the 2016 All-Star Game at Petco Park, singled leading off the seventh and scored on Jonathan Lucroy's sacrifice fly.\nHector Rondon (0-1) started the eighth for Venezuela and Jones homered to left-center to tie it at 2. Christian Yelich singled and Nolan Arenado flied out before Hosmer muscled a shot an estimated 418 feet to right-center for the lead.\n\"After Jones hit that homer, the energy in the dugout picked up and gave a spark to our club,\" Hosmer said.\nThen he connected, and the crowd chanted as he circled the bases.\n\"When you hear the 'U-S-A!' chants, when you hear the crowd going crazy after a big swing or big play like those tonight, it makes it really fun to be a part of this,\" he said.\nHosmer hit a solid drive in his second at-bat, \"and it went to the warning track. And I knew I got this one better. I knew it had a chance,\" he said.\nHosmer hit a solo homer and an RBI single in the American League's 4-2 win at the 2016 All-Star Game in San Diego.\n\"The All-Star Game is something that, for me, it was my first time experiencing it,\" Hosmer said. \"But this tournament is different. It's a sense of pride throughout the whole entire team, throughout the whole entire country, because it only happens very seldom.\"\nLuke Gregerson of the Houston Astros, who played his first five big league seasons with the San Diego Padres, pitched the ninth for the save.\nPat Neshek (1-0), who had a brief stint with the Padres in 2011, worked the eighth for the win.\nHernandez scattered three singles, struck out three and walked none.\nKing Felix made it through two heart-stopping moments in the first. He appeared to tweak something in his right leg while fielding Jones' swinging bunt and throwing him out for the second out. After being checked by a trainer and throwing two warmup pitches, Hernandez stayed in the game. Yelich then hit a comebacker that knocked Hernandez's glove off. With a befuddled look on his face, the pitcher picked up the ball and threw out Yelich to end the inning.\nVenezuela manager Omar Vizquel said Hernandez had a cramp in his upper right leg.\n\"The way that he caught the ball and tried to throw to first base, he said that he turned it a little bit, but thank God he made a couple of pitches and he said that he felt pretty good,\" Vizquel said. \"We kept checking him in every inning to make sure that he's not getting tired during the game, and he did OK. Then after the game, he's fine, so hopefully he will be OK.\"\nThe Americans threatened only once against Hernandez, and failed to come through. He allowed three straight singles to Lucroy, Alex Bregman and Ian Kinsler with one out in the third before Jones grounded into a double play.\nRougned Odor homered with two outs in the seventh for a 2-0 lead for Venezuela, which beat Italy 4-3 in a tiebreaker game in Guadalajara, Mexico, on Monday night to advance out of Pool D.\nOdor homered to right off David Robertson. Knowing it was gone, the Texas Rangers second baseman clapped his hands as he broke out of the box. On Monday night, he hit a high drive to left-center and stood and watched as it bounced off the top of the wall and back into play for a go-ahead RBI single in the ninth inning.\nEnder Inciarte had a sacrifice fly in the third for Venezuela.\nU.S. catcher Jonathan Lucroy catches a fly ball hit by Venezuela's Alcides Escobar during the first inning of a second-round World Baseball Classic game in San Diego, Wednesday, March 15, 2017. (AP Photo/Alex Gallardo)\nVenezuela starting pitcher Felix Hernandez throws against the United States during the second inning of a second-round World Baseball Classic game in San Diego, Wednesday, March 15, 2017. (AP Photo/Alex Gallardo)\nZack Rexine of Baltimore dresses up to watch U.S. players warm up before playing Venezuela in a World Baseball Classic game in San Diego, Wednesday, March 15, 2017. (AP Photo/Alex Gallardo)\nVenezuela starting pitcher Felix Hernandez throws out United States' Adam Jones at first during the first inning of a second-round World Baseball Classic game in San Diego, Wednesday, March 15, 2017. (AP Photo/Alex Gallardo)\nVenezuela's Ender Inciarte, right, watches his RBI sacrifice fly to center field with U.S. catcher Jonathan Lucroy during the third inning of a second-round World Baseball Classic game in San Diego, Wednesday, March 15, 2017. (AP Photo/Alex Gallardo)\nVenezuela's Carlos Gonzalez points back at Ender Inciarte after scoring on Inciarte's sacrifice during the third inning against the United States in a second-round World Baseball Classic game in San Diego, Wednesday, March 15, 2017. (AP Photo/Alex Gallardo)","url":"https://www.dailymail.co.uk/wires/ap/article-4318850/Jones-Hosmer-homer-lift-US-4-2-win-vs-Venezuela.html"}
