{"authors":["Alanna Bennett"],"date_download":"2018-10-30 23:30:14","date_modify":"2018-10-30 23:30:14","date_publish":"2014-08-13 17:28:25","description":"We see you there, Don Draper. We see you there with your smug selfie. Mad Men's Jon Hamm took a stalker shot of Matt Lauer on a plane and shared it with the world, and it's doing a better job of proving celebrities are just like us than more People…","filename":"data/vaneerConsumption/JonHammsSelfieWithTodaysMattLauerProvesHesJustLikeUsAlmostPHOTO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/84a38930-814b-49d0-90f5-c30daa143421.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35627-jon-hamms-selfie-with-todays-matt-lauer-proves-hes-just-like-us-almost-photo_1540942214.html","title":"Jon Hamm's Selfie With 'Today's Matt Lauer Proves He's Just Like Us, Almost - PHOTO","title_page":"Jon Hamm's Selfie With 'Today's Matt Lauer Proves He's Just Like Us, Almost — PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"We see you there, Don Draper. We see you there with your smug selfie. Mad Men's Jon Hamm took a stalker shot of Matt Lauer on a plane and shared it with the world, and it's doing a better job of proving celebrities are just like us than more People features. Well, aside from a few key aspects.\nThe great relatability of this photo lies in its composition: Hamm, like many a person who's seen a celebrity in public, passed off the photo a selfie that just happened to have Matt Lauer in the background. \"What a coincidence!\" you might say if you were in Hamm's place and got caught snapping the pic. \"I didn't even notice you there, Matt Lauer!\"\nOf course, therein ends the relatability. Then you're like \"What kind of plane are you even on? Is that what first class looks like?\" and you remember these people are richer than you will probably ever be. Then you see that Lauer's smiling amiably in the background and definitely knows the photo's being taken, in direct contrast to, say, that time my brother took a selfie with Dave Grohl in the background at brunch a while ago. Then you remember that this photo was shared on The Today Show and not, say, facebook, where your aunt could faun in with comments like \"Wowza! That Matt Lauer...he's a cutie.\"\nThey're both cuties:\nImage: Today Show/Twitter","url":"https://www.bustle.com/articles/35627-jon-hamms-selfie-with-todays-matt-lauer-proves-hes-just-like-us-almost-photo"}
