{"authors":["Press Association"],"date_download":"2018-10-23 03:31:48","date_modify":"2018-10-23 03:31:48","date_publish":"2016-01-11 16:20:51","description":"Jonny Bairstow has promised England's fielding performance in Cape Town was nothing but a \"slight blip\" and expects the catches to stick in the third Test ag...","filename":"data/vaneerConsumption/Jonnybairstowfieldingfailuresincapetownjustablip.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-976eb528-e4b3-47da-946a-d93e5023d6c9-48qEJGFphM8d437f0aaf926da026-844_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3394184_Jonny-Bairstow-Fielding-failures-Cape-Town-just-blip_1540265508.html","title":"Jonny bairstow: fielding failures in cape town just a \"blip\"","title_page":"Jonny bairstow: fielding failures in cape town just a \"blip\" | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jonny Bairstow: Fielding failures in Cape Town just a \"blip\"\nJonny Bairstow has promised England's fielding performance in Cape Town was nothing but a \"slight blip\" and expects the catches to stick in the third Test against South Africa.\nSeven chances went in and out of the hands in the second match of the series, which England drew to maintain their 1-0 lead, with fielders failing to pick up another couple in time.\nSome of those were half-chances at best but a side with standards as high as England under Trevor Bayliss will feel aggrieved not to have done better.\nJonny Bairstow, right, hopes to improve his glovework\nFielding drills were the first item on the agenda as England trained for the first time in Johannesburg, led by an animated Bayliss and missing only Nick Compton (stomach bug).\nWicketkeeper Bairstow, who dropped Temba Bavuma at Newlands, was bullish in predicting an improvement in the Wanderers Test, which begins on Thursday.\n\"You can say we put an emphasis on catching today because we dropped a few last week but look at the emphasis we put on catching in the summer against Australia and some of the ridiculous ones we took there,\" said the 26-year-old.\n\"It's just a slight blip. That's all it was. Fielding has been a priority ever since Trev took over, to be honest.\n\"At no point was anyone taking anything lightly or anything like that. So going forward it is as per - we concentrate on our batting, bowling and our fielding. We take pride in what we do. We're a young side and that's what we're about.\"\nBairstow has rarely been out of the spotlight since arriving in South Africa.\nHe scored crucial quick runs in both innings during the victory in Durban, made an emotional unbeaten 150 in Cape Town in a record 399-run stand with Ben Stokes and calmed English nerves with a steady knock on a shaky final day.\nBut the Yorkshireman has not yet managed to silence concerns over his glovework, putting down Hashim Amla and failing to stump AB de Villiers in the first Test before offering Bavuma a life in the second.\nBayliss declared Bairstow's keeping 'a work in progress' but, perhaps persuaded by his form with the bat, seems ready to allow that work to continue with an extended run in the side.\nBairstow has played 17 of his 22 Tests as a specialist batsman and accepts that, like predecessor and rival Jos Buttler, he is still finding his feet behind the stumps.\n\"I've only kept in five Test matches...I'm still bedding into Test cricket as a wicketkeeper,\" he said.\n\"You speak to people who have played 100 Tests and people who have played five Tests and that's a massive learning curve.\n\"I'm pleased with the way it is going but you're only going to learn by doing and that's the way I've always done things.\n\"I don't think you can ever say you've nailed it down but I'm pleased with the way I'm catching the ball and pleased with the way I'm moving.\n\"Hopefully people will be able to get behind me and the contributions that I'm making with my batting and hopefully that will bring me more confidence too.\n\"I've invested a lot of time and energy and a lot of pain in my keeping.\"\nBairstow does not believe the altitude of Johannesburg will make life more difficult for him or his team-mates, particularly having started the trip on the Highveld in Potchefstroom.\n\"I think the acclimatisation we spent there can only help,\" he said.","url":"https://www.dailymail.co.uk/wires/pa/article-3394184/Jonny-Bairstow-Fielding-failures-Cape-Town-just-blip.html"}
