{"authors":["Sean Moran"],"date_download":"2018-10-30 19:58:10","date_modify":"2018-10-30 19:58:10","date_publish":"2018-08-15 21:22:29","description":"Sen. Jon Tester's (D-MT) campaign disavowed a Pearl Jam poster featuring a dead President Donald Trump on Wednesday.","filename":"data/vaneerConsumption/JonTestersCampaignDisavowsPearlJamPosterwithDeadDonaldTrump.json","image_url":"https://media.breitbart.com/media/2018/08/Pearl-Jam-Poster-Dead-Trump-640x480-1.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_08_15__1540929490.html","title":"Jon Tester’s Campaign Disavows Pearl Jam Poster with Dead Donald Trump","title_page":"Jon Tester’s Campaign Disavows Pearl Jam Poster with Dead Donald Trump | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sen. Jon Tester’s (D-MT) Senate campaign, not Jon Tester, disavowed a Pearl Jam poster featuring a dead President Donald Trump and an American bald eagle eating the remains of his corpse.\nChris Meagher, Tester’s campaign spokesman, said on Wednesday that the campaign never saw the poster before Pearl Jam’s concert on Monday, they do not like the poster, and they do not condone violence of any kind.\nThe Montana Democrat has yet to come out personally and disavow the poster designed by his friend, Pearl Jam bassist Jeff Ament. Sen. Tester’s campaign disavowed the poster two days after the Pearl Jam concert and only after media reports shed light on the inflammatory poster.\nMontana rancher and state auditor Matt Rosendale chastised Tester in a press release on Wednesday, charging that the Montana Democrat only disavowed the poster after he received approval from the far-left.\nRosedale said:\nThis poster depicted a dead President Trump, with a burning White House, and Tester gleefully flying over it. He should have disavowed it immediately – and he didn’t. Instead, Tester, through a spokesperson, waited for approval from the far-left before he denounced this horrific poster. If we can’t trust Jon Tester to stand up for what is right on his own – how can we trust him in Washington, D.C. representing the people of Montana? It’s time we vote him out of the U.S. Senate.\nThe poster in question was a collaboration between Pearl Jam bassist Ament and Bobby Draws Skullz and depicts an apocalyptic Washington, D.C. In the center of the poster is the remains of President Trump, with his hair intact, and reaching for a briefcase emblazoned with the communist hammer and sickle, while an eagle feeds on his carcass.\nOver the White House, Sen. Tester is cheerfully flying over President Trump’s dead body on a tractor with clouds that spell out, “vote.”\nAment and Sen. Tester have been friends for years; Pearl Jam has previously held many concerts in Montana to get-out-the-vote for Sen. Tester’s re-elections campaigns.\nAment said that he meant to hold the concert on Monday to promote Sen. Tester.\n“It will be as close to it as we can possibly get without it being a Jon Tester campaign rally,” Ament said.","url":"https://www.breitbart.com/politics/2018/08/15/jjon-testers-campaign-disavows-pearl-jam-poster-with-dead-donald-trump/"}
