{"authors":["Deborah Danan"],"date_download":"2018-10-30 21:10:34","date_modify":"2018-10-30 21:10:34","date_publish":"2015-12-09 13:54:50","description":"The editor of the Jordanian daily Al Ghad wrote bemoaning the Arab world's inability to fulfill its dreams of a true Canadian-style democracy","filename":"data/vaneerConsumption/JordanianNewspaperArabCountriesYearnForCanadianStyleDemocracyRejectHumanRights.json","image_url":"https://media.breitbart.com/media/2015/12/Canada.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2015_12_09__1540933834.html","title":"Jordanian Newspaper: Arab Countries Yearn For Canadian-Style Democracy, Reject Human Rights","title_page":"Jordanian Newspaper: Arab Countries Yearn For Canadian-Style Democracy, Reject Human Rights","title_rss":"NULL","source_domain":"breitbart.com","text":"Following the recent appointment of an India-born Sikh as Canada’s new defense minister, the editor of the Jordanian daily Al Ghad wrote an analysis bemoaning the Arab world’s inability to fulfill its dreams of true democracy. He blamed “schizophrenic” voters who elect representatives of their clans and an Arab mentality that rejects acceptance of the other.\nAccording to Jumana Ghanimat, the editor of Jordan’s privately-owned Al Ghad newspaper, Canada’s choice of Harjit Sajjan as defense minister has attracted great interest in the Arab media, and popular opinion sees it as “awe-inspiring.” The editor explains that this is because Arabs yearn for real democracy, but their wish is thwarted by the fact that Arab countries are stuck in a cycle in which citizens do not vote for who they think will be best for the country, but for those who represent their sect or tribe.\nThe editor also notes that Arab countries are “arenas of chaos” that are “torn to shreds” by crooked politicians who seek personal gain. Moreover, Arab societies as a whole do not have “sufficient awareness to confront this phenomenon.”\n“Democracy has principles in which we are not well versed,” notes Ghanimat in her article, which was translated by MEMRI. Citing Sajjan’s appointment, Ghanimat continues, “Canadians do not question his loyalty, do not discuss his origin, and do not warn against his involvement in the state’s most important secrets. This is the democratic element whose absence we notice in the Arab world.”\n“Today, when we look at any Arab country, we see that what predominates in the discourse there is conflict,” asserts the editor. She says that Arabs do not comprehend the democratic principle of allowing disagreement between different groups, and that they are fixated on “rejection of the other, instead of coexistence.”\nShe also lays blame on the sectarian mentality that Arab society has developed as a result of its rejection of human rights, equal opportunity, and a just legal system.\n“The absence of real political action, the abnegation of human rights, and the weakness of the legislative system – [aimed at] giving the individual a sense of security and belonging – in addition to the false promises to establish civil regimes in the Arab countries, have pushed the individual to seek protection from his sect, his race, his tribe, or elsewhere.\n“In this way, societies have been subdivided into smaller groups, ultimately impacting the concept of citizenship, which cannot be actualized without the two conditions of rights and obligations.”\nShe blames individual voters for perpetuating the cycle by their actions at the ballot box. For example, even though the idea of a young politician – such as Canadian Prime Minister Justin Trudeau – is intriguing, young Arab politicians are never elected because voters will continue to opt for older candidates representing their sect, tribe, or clan. In this way, the Arab individual “is complicit in the creation of a reality that is different from the one he desires – presuming, of course, that no one interfered in one way or another with the contents of the ballot box.”\nHer article ends by lamenting that, while Arabs will continue to hanker after the Canadian model, they will never stop complaining about the fact that true democracy doesn’t exist for them.\n“The absence of standards of justice and equal opportunity,” concludes Ghanimat, “leaves a large gap between the Arab dream and the Arab reality.”","url":"https://www.breitbart.com/middle-east/2015/12/09/jordanian-newspaper-arab-countries-yearn-for-canadian-style-democracy-reject-human-rights/"}
