{"authors":["Associated Press"],"date_download":"2018-10-22 22:59:35","date_modify":"2018-10-22 22:59:35","date_publish":"2017-03-16 05:14:14","description":"AMMAN, Jordan (AP) - Jordan's King Abdullah II and an envoy for President Donald Trump have held talks about reviving long-stalled efforts to reach an...","filename":"data/vaneerConsumption/JordanskingmeetswithTrumpadviseronMideastpeacepush.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/05/wire-226507-1489641571-177_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318872_Jordans-king-meets-Trump-adviser-Mideast-peace-push_1540249175.html","title":"Jordan's king meets with Trump adviser on Mideast peace push","title_page":"Jordan's king meets with Trump adviser on Mideast peace push | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"AMMAN, Jordan (AP) - Jordan's King Abdullah II and an envoy for President Donald Trump have held talks about reviving long-stalled efforts to reach an Israeli-Palestinian peace deal.\nThe king served as a key intermediary in previous U.S.-led negotiations on setting up a state of Palestine alongside Israel.\nThe U.S. Embassy in Jordan says Abdullah told envoy Jason Greenblatt on Wednesday that he would \"do everything possible\" to help end the Israeli-Palestinian conflict on the basis of a two-state solution.\nUS President's peace process envoy Jason Greenblatt, left, meets with Palestinian President Mahmoud Abbas at the President's office in the West Bank city of Ramallah, Tuesday, March 14, 2017. (AP Photo/Majdi Mohammed)\nGreenblatt told Palestinian President Mahmoud Abbas and Israeli Prime Minister Benjamin Netanyahu in separate meetings earlier this week that Trump is interested in reaching a deal. Trump has suggested a two-state deal is not the only possible solution, but has not laid out his vision for a Mideast solution.","url":"https://www.dailymail.co.uk/wires/ap/article-4318872/Jordans-king-meets-Trump-adviser-Mideast-peace-push.html"}
