{"authors":["Associated Press"],"date_download":"2018-10-23 03:38:17","date_modify":"2018-10-23 03:38:17","date_publish":"2016-01-11 16:23:01","description":"AMMAN, Jordan (AP) — Jordan said Monday that some 16,000 Syrian refugees are stranded in a remote desert area along its border, up from 12,000 a week ago. Go...","filename":"data/vaneerConsumption/Jordansays16000Syrianrefugeesstrandedonborder.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:02f7dbf4290b4083b0b6e388792ac6d0-48qEJGFphM8d437f0aaf926e167b-370_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394103_Jordan-says-16-000-Syrian-refugees-stranded-border_1540265897.html","title":"Jordan says 16,000 Syrian refugees stranded on border","title_page":"Jordan says 16,000 Syrian refugees stranded on border | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jordan says 16,000 Syrian refugees stranded on border\nAMMAN, Jordan (AP) — Jordan said Monday that some 16,000 Syrian refugees are stranded in a remote desert area along its border, up from 12,000 a week ago.\nGovernment spokesman Mohammed Momani told The Associated Press that the refugees are being \"carefully monitored\" by authorities and have received tents, heaters, food and medicine from U.N. and other aid organizations. He said there are clinics supported by international agencies and the Jordanian military.\nMany of the refugees have spent weeks or months in what aid agencies say are deteriorating humanitarian conditions. In December, Human Rights Watch said satellite images of \"the berm\" showed at least 20,000 refugees and the U.N. refugee agency urged Jordan to allow them to enter.\nThis satellite image, provided by CNES and taken Dec. 5, 2015, shows a Syrian asylum seeker encampment in Rukban, Jordan. .Jordan said Monday that some 16,000 Syrian refugees are stranded in a remote desert area along its border, up from 12,000 a week ago. (CNES 2015 / DISTRIBUTION AIRBUS DS via AP)\nMomani said about 50 to 100 are permitted entry each day, with priority given to women, children, the elderly and sick people, but that \"security is the first priority.\"\n\"Jordan has so far hosted around 1.4 million Syrians on its territory, or the equivalent of 20 percent of its population, receiving up to 5,000 refugees per day at times. This has been mostly done at Jordan's expense,\" Momani said.\nThe U.N. refugee agency could not immediately be reached for comment.","url":"https://www.dailymail.co.uk/wires/ap/article-3394103/Jordan-says-16-000-Syrian-refugees-stranded-border.html"}
