{"authors":["Sarah Jones For Dailymail.Com"],"date_download":"2018-10-22 20:49:09","date_modify":"2018-10-22 20:49:09","date_publish":"2016-01-29 04:04:52","description":"The 35-year-old actress went with a casual street chic look donned in black overalls and a bright fuchsia top as she enjoyed a bit of retail therapy while in Beverly Hills on Thursday","filename":"data/vaneerConsumption/JordanaBrewsterstepsoutinhotpinktopanddungareesinBeverlyHills.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/03/30AE9CF500000578-0-image-a-51_1454037442649.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422135_Make-free-Jordana-Brewster-steps-hot-pink-dungarees-shopping-trip-Beverly-Hills_1540241349.html","title":"Jordana Brewster steps out in hot pink top and dungarees in Beverly Hills","title_page":"Jordana Brewster steps out in hot pink top and dungarees in Beverly Hills | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been busy promoting her new TV series, Secrets and Lies.\nSo Jordana Brewster deserved a bit of retail therapy as she stepped out in Beverly Hills on Thursday and made a few purchases.\nThe 35-year-old actress went with a casual street chic look in black overalls and a bright fuchsia top for her outing.\nShopping: Jordana Brewster enjoyed a bit of retail therapy as she stepped out in Beverly Hills on Thursday and made a few purchases\nThe Fast and the Furious starlet was all smiles as she was seen carrying several, large Madewell shopping bags.\nJordana went make-up free, highlighting her natural beauty and added a pair of tortoise shell spectacles.\nShe wore simple black flats and accessorized her ensemble with a gold wristwatch and over the shoulder black leather handbag.\nWith Fast and the Furious 8 confirmed for release in 2017, Jordana recently admitted that she is unsure whether she'll be cast in the film.\nPretty in pink: The Fast and the Furious actress went with a casual street chic look in black overalls and a bright fuchsia top for her outing\nFollowing Paul Walker's untimely death in 2013, his character of Brian O'Conner was written out of the series in a poignant final scene in Furious 7 that saw the star say he was through with a life of drag racing.\nAs she played his partner in the franchise, Jordana's role in the upcoming film has been up for question, which she acknowledged at the Television Critics Association Winter Tour.\n'There hasn’t been discussion but I can kind of see it go either way,' she said. 'Mia is with Brian but on the other hand she’s still Dom’s sister. I don’t know. I’m not sure.'\n'The best part was Paul and now it’s the fans. I think the fans have a hunger for it which is amazing, but it’ll be different for sure.'\nRetail therapy! The starlet was all smiles as she was seen carrying several, large Madewell shopping bags\nGeek chic: Jordana went make-up free, highlighting her natural beauty and added a pair of tortoise shell spectacles\nDetails: She wore simple black flats and accessorized her ensemble with a gold wristwatch and over the shoulder black leather handbag\nThe raven-haired beauty has had a hectic schedule lately between promoting her hit ABC show and her upcoming 'American Crime Story: The People vs OJ Simpson.'\nShe plays Kate Warner in Secrets and Lies, an accomplished attorney who runs the compliance department for the Warner family-owned private equity firm.\nThe upcoming season will focus on detective Andrea Cornell (Juliette Lewis) investigating a new crime, the murder of Eric Warner’s (Michael Ealy) wife.\nShe will also play Denise Brown, the sister of Nicole Brown Simpson, in the FX series which will premiere February 2.\nUncertain: With Fast and the Furious 8 confirmed for release in 2017, Jordana recently admitted that she is unsure whether she'll be cast in the film","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422135/Make-free-Jordana-Brewster-steps-hot-pink-dungarees-shopping-trip-Beverly-Hills.html"}
