{"authors":["Patrick Johnston For Reuters"],"date_download":"2018-10-23 00:08:16","date_modify":"2018-10-23 00:08:16","date_publish":"2016-01-28 13:44:02","description":"Jordan Spieth lurked one shot off the lead before thunder halted the first round of the Singapore Open on Thursday but the American, missing his regular caddie, was left frustrated by inaccuracy.","filename":"data/vaneerConsumption/JordanSpiethfrustratednottogrableadatSingaporeOpenwithhisagentactingascaddieinswelteringheat.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30A7752100000578-0-image-a-11_1453988572501.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_golf_article-3420591_Jordan-Spieth-frustrated-not-grab-lead-Singapore-Open-agent-acting-caddie-sweltering-heat_1540253296.html","title":"Jordan Spieth 'frustrated' not to grab lead at Singapore Open (with his agent acting as caddie in sweltering heat!)","title_page":"Jordan Spieth 'frustrated' not to grab lead at Singapore Open (with his agent acting as caddie in sweltering heat!) | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"South Korea's An Byeong-hun is level with world No 1 on four under par\nJordan Spieth one off the lead in Singapore after first round\nJordan Spieth lurked one shot off the lead before thunder halted the first round of the Singapore Open on Thursday but the American, missing his regular caddie, was left frustrated by his inaccurate approach play.\nSpieth's agent and manager Jay Danzi stepped up to carry the bag on a stifling first morning at the Sentosa Golf Club, with injury sideling regular caddie Mike Greller, and the duo struggled to negotiate the yardages to threaten the pins.\nStill the bogey-free four-under-par 67 efforts of Spieth, the headline act in an otherwise low-calibre field, left him right in the mix, one behind South African Keith Horne and American Berry Henson, who was on his 16th when play stopped.\nJordan Spieth walks on the 15th hole of the Serapong Course during the first round of the Singapore Open\nSpieth talks to his caddie, Jay Danzi, on the second hole, with the Singapore skyline as the backdrop\nDanzi, who is the American's agent and manger, carried Spieth's bag due to an injury to Mike Greller\nDespite Spieth's first-round 67, Spieth still bemoaned the inaccuracy of his approach play\n'For the positions I was in off the tee it was a little frustrating,' Spieth told reporters, wiping away sweat after finishing his round at the height of the mid-day sun.\n'From there I couldn't quite get it on the right tier (of the green) or right distance, my distance control was just off trying to judge the wind, humidity and the heat. And so we just struggled a bit with that.\n'I didn't get many looks (for birdie), I didn't get the ball inside 15-feet. I had plenty of opportunities to.'\nGreller, who left his job as sixth grade teacher in the US to work with Spieth, aided the 22-year-old's Masters and US Open title wins last year and surge to the top of the world rankings.\nSpieth, though, refused to bemoan his absence and credited Danzi's work at the Asian Tour season opening event, the second time he has covered for Greller after a tournament in Japan in 2014.\n'I thought Jay stepped in extremely well. It's a tough place to caddie when you are not used to carrying the bag, what with the weather, but he took it like a champ,' the Texan said.\n'We have some rounds under our belt and we have played together a lot so its an easy one-week replacement while Michael is getting healthy.'\nAn Byeong-hun of South Korea tees off on the 9th hole on his way to matching Spieth's score\nThe Spieth-Danzi team begun brightly under sunny skies on Thursday by holing a 20-foot birdie putt for a three at his first - the 10th - but his chances of picking up further shots were limited thereafter by his iron play.\nOne missed green after a duffed 100 yard approach particularly galling for the PGA Tour player-of-the-year.\nThe American, though, was happy with an improved putting display after last week's struggles in Abu Dhabi.\nSINGAPORE OPEN LEADERBOARD -5 Keith Horne, Barry Henson -4 Jordan Spieth, An Byeong-hun, Shintaro Kobayashi, Namchok Tantipokhakul\nHe safely negotiated Sentosa's large undulating greens and three two-putt birdies on the par fives, 18, four and seven, sent him joint third at the $1million event, co-sanctioned by the Japan Golf Tour, alongside world No 26 An Byeong-hun of South Korea.\n'No three putts (and) I had eight or nine putts over 30 feet,' Spieth said.\n'I know I'm not hitting it close enough. Still, the speed is great, I didn't lose any shots.'\nGreller, who left his job as sixth grade teacher in the US to work with Spieth, aided the 22-year-old's Masters and US Open title wins last year and surge to the top of the world rankings.\nSpieth, though, refused to bemoan his absence and credited Danzi's work at the Asian Tour season opening event, the second time he has covered for Greller after a tournament in Japan in 2014.\n'I thought Jay stepped in extremely well. It's a tough place to caddie when you are not used to carrying the bag, what with the weather, but he took it like a champ,' the Texan said.\n'We have some rounds under our belt and we have played together a lot so its an easy one-week replacement while Michael is getting healthy.'\nRyder Cup star Jamie Donaldson is also playing in Singapore this week\nThe Spieth-Danzi team begun brightly on Thursday with a birdie three at his first - the 10th - but chances of picking up further shots were limited thereafter by his iron play.\nSpieth said he had struggled with his putting last week after a tied-fifth finish at the European Tour's Abu Dhabi Championship, but was happier with his short-stick efforts on Sentosa's large undulating greens.\nThree two-putt birdies on the par fives, 18, four and seven, sent him to the summit of the $1million event.\n'No three-putts (and) I had eight or nine putts over 30 feet. Typically I don't use a practice stroke when I putt unless I'm trying to coast it near the hole and I had to do that on eight or nine of the greens,' Spieth said.","url":"https://www.dailymail.co.uk/sport/golf/article-3420591/Jordan-Spieth-frustrated-not-grab-lead-Singapore-Open-agent-acting-caddie-sweltering-heat.html"}
