{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 01:18:15","date_modify":"2018-10-23 01:18:15","date_publish":"2016-01-11 12:02:10","description":"The pair reunited in very different surroundings, one month after being released from the jungle, as they partied at E!'s watch along party at St Martin's Lane Hotel in the British capital on Sunday.","filename":"data/vaneerConsumption/JorgiePorterreuniteswithGeorgeShelleyforGoldenGlobes2016party.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/300826B100000578-0-image-a-86_1452513626662.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393751_Jorgie-Porter-ultra-glamorous-plunging-slinky-green-gown-reunites-George-Shelley-Golden-Globes-bash_1540257495.html","title":"Jorgie Porter reunites with George Shelley for Golden Globes 2016 party","title_page":"Jorgie Porter reunites with George Shelley for Golden Globes 2016 party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They may not have been walking the red carpet at LA's prestigious Golden Globes ceremony, but Jorgie Porter and George Shelley certainly put in the glamour at the London-based viewing party.\nJorgie traded Hollyoaks for her taste of Hollywood glamour in a slinky jade gown as she hung off the arm of former I'm A Celeb campmate George.\nThe pair reunited in very different surroundings, one month after being released from the jungle, as they partied at E!'s watch along party at St Martin's Lane Hotel in the British capital on Sunday.\nScroll down for video\nReunited: Jorgie Porter and George Shelley reunited at E!'s Golden Globe awards watch along party at London's St Martin's Lane Hotel on Sunday night\nThe viewing party celebrated Hollywood's finest as the acting elite turned out in Los Angeles for the annual awards ceremony.\nBut on the other side of the pond, the British stars were enjoying all of the glamour with a champagne and red carpet reception in honour of the start of awards season.\nOn the guest list, Jorgie was looking incredible in her plunging gown; her golden tresses tossed over one shoulder to soften her open cleavage.\nHollywood glamour: The petite blonde traded Hollyoaks for a taste of Hollywood glamour\nSlinky: She plumped for a slinky jade-green dress that featured a plunging neckline and high leg split\nWith a leg slipping through her daringly-high side split, the blonde showed off a greater hint at her shape.\nJorgie had two dates on her arm that night, thanks to George's Union J bandmate Jaymi Hensley, who looked equally sharp.\nThe former X Factor stars both plumped for jeans with their smart jackets - something they wouldn't have got away with at the Beverly Hilton - and Jaymi went for a bare collar look.\nUnion jade! Jorgie was sandwiched between Union J's George (left) and bandmate Jaymi Hensley in her slinky jade-coloured gown\nNew pals: The blonde hung out with George's bandmate with champagne flutes in hand\nThey sandwiched in petite actress Jorgie, towering over her with champagne flutes in hand for the occasion.\nJorgie's new relationship with Luther Burrell was recently confirmed when they shared a kissing picture on Instagram.\nBack in November 2015, a spokesperson for Jorgie confirmed the pair were dating but denied that anything more serious was going on and there was confusion over whether she went into the jungle as a single woman.\nGeorge, meanwhile, called things off with fellow camp star Ferne McCann less than a month after they claimed to be 'in love'\nCutie: She was among the stars celebrated in London and living vicariously through the moviestars\nParty time: The Mancunian was enjoying a visit to London without her hunky boyfriend Luther Burrell","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393751/Jorgie-Porter-ultra-glamorous-plunging-slinky-green-gown-reunites-George-Shelley-Golden-Globes-bash.html"}
