{"authors":["Sarah Tetteh For Mailonline"],"date_download":"2018-10-22 21:03:48","date_modify":"2018-10-22 21:03:48","date_publish":"2016-01-11 00:05:31","description":"She lived on a diet of rice and beans in the jungle on I'm A Celeb, but the results have certainly paid off for Jorgie Porter judging from her sizzling beach bod.","filename":"data/vaneerConsumption/JorgiePortershowsoffherampleassetsaingreenbikiniinDubai.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/10/23/300125CF00000578-0-image-a-84_1452469370634.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3392971_Jorgie-Porter-shows-ample-assets-pert-posterior-tops-tan-green-cut-two-piece-Dubai_1540242228.html","title":"Jorgie Porter shows off her ample assets a in green bikini in Dubai","title_page":"Jorgie Porter shows off her ample assets a in green bikini in Dubai | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jorgie Porter showed off her sizzling beach body on a recent holiday to Dubai.\nThe Hollyoaks' actress, 28, oozed glam in her cut-out green bikini as she put on a busty and very leggy display as she strolled barefoot in the sand.\nJudging from these incredible shots, it's clear to see just why her new boyfriend, England rugby ace, Luther Burrell can't get enough of her.\nScroll down for video\nGreen goddess: Jorgie Porter showed off her svelte bikini body in a green cut-out two piece as she topped up her tan while on holiday in Dubai\nThe beauty showed off her washboard stomach as she sauntered along the beach soaking up the sun after her stint in I'm A Celeb.\nJorgie made onlookers go green with envy looking incredible in the delicate glittering green bikini which had cut-outs which gave a glimpse of her ample cleavage.\nHer golden hair tumbled in soft curls down her back as she soaked up the sun on holiday.\nThe tanned star, who plays Theresa McQueen in the C4 soap, swapped heavy red carpet make-up for a more natural look as she allowed the sun to work it's wonders and soak into her skin.\nEmerald city: The star looked phenomenal in her green two-piece as she stepped out onto the golden sands\nJorgie showed off her pert posterior as she sauntered along the beach.\nHer curvy behind provided the perfect view for holidaymakers as she took a leisurely stroll in the sand in her green bikini.\nThe slinky number helped to nip her in at the waist with it's low slung string bikini bottoms.\nThese were blinged up with delicate gold chain detailing as she took to the white sands.\nAt one point she broke out into some impromptu dance poses and high-kicks as she frolicked in the waves as she soaked up the winter sun.\nSlinky: Jorgie's slinky swimwear helped to nip her in at the waist with it's low slung string bikini bottoms\nOn point: Jorgie looked breathtaking in a string of sexy poses as she put her best foot forward in the sand\nSplash-dance: Jorgie put in a mini work-out as she did some high-kicks while frolicking in the waves as she soaked up the winter sun\nJorgie's sexy shots come as the gorgeous star, 28, recently confirmed she's dating hunky rugby player Luther Burrell in a sweet Instagram picture of the couple sharing a kiss.\nAfter confirming their romance with the snap of them smooching earlier this month, it appears the pair have been inseparable.\nShe wrote the words: 'This man,' alongside the sweet picture, which saw the two close their eyes as they locked lips.\nBack in November, a spokesperson for Jorgie confirmed the pair were dating but denied that anything more serious was going on.\nThey told MailOnline: 'Jorgie and Luther have been on a couple of dates recently but they’re not in a relationship.'\nMust be love: Jorgie Porter confirmed she is in a relationship with England rugby player Luther Burrell on Wednesday, when she posted a picture of them kissing to Instagram\nSince then, the lovebirds were snapped sharing a smooch while standing in the street on Thursday.\nThe Hollyoaks actress and the rugby player looked smitten with one another as they shared the passionate embrace after leaving her home.\nAnd judging from her phenomenal bikini shots on holiday in Dubai, it's clear to see why he can't get enough of the bikini-clad babe.\nLoved-up! Jorgie's sexy shots come as the gorgeous star, 28, recently confirmed she's dating hunky rugby player Luther Burrell in a sweet Instagram picture of the couple sharing a kiss","url":"https://www.dailymail.co.uk/tvshowbiz/article-3392971/Jorgie-Porter-shows-ample-assets-pert-posterior-tops-tan-green-cut-two-piece-Dubai.html"}
