{"authors":["Paul Newman For The Daily Mail"],"date_download":"2018-10-23 04:48:55","date_modify":"2018-10-23 04:48:55","date_publish":"2016-01-29 20:27:35","description":"PAUL NEWMAN: Jos Buttler will look to the example of Ben Stokes for encouragement that he really can take his high-octane methods into the Test arena and finally be a success.","filename":"data/vaneerConsumption/JosButtlerImustfollowBenStokesleadtoearnbackmyEnglandplacehehadafantasticTestseriesinSouthAfrica.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/20/30B2012800000578-0-image-a-31_1454098373532.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-3423394_Jos-Buttler-follow-Ben-Stokes-lead-earn-England-place-fantastic-Test-series-South-Africa_1540270135.html","title":"Jos Buttler: I must follow Ben Stokes' lead to earn back my England place... he had a fantastic Test series in South Africa","title_page":"Jos Buttler: I must follow Ben Stokes' lead to earn back my England place... he had a fantastic Test series in South Africa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jos Buttler will look to the example of Ben Stokes for encouragement that he really can take his high-octane methods into the Test arena and finally be a success in the ultimate form of the game.\nOne of England’s most gifted players returns to the side for the one-day warm-up against South Africa A aiming to show he is a little wiser for the experience of spending the Test series as Jonny Bairstow’s deputy.\nAnd Buttler still has aspirations of reclaiming the Test place he lost to Bairstow against Pakistan in the United Arab Emirates even though it appeared to have a liberating effect on his limited-overs game.\nJos Buttler is looking to win back his England place and become a key player in future Test matches\n‘There’s an extra emphasis on one-day cricket now but I still feel Test cricket is the pinnacle and I don’t want to throw the towel in on red-ball cricket yet,’ said Buttler, who hit the fastest one-day century in England’s history against Pakistan in Dubai as soon as he had relinquished the gloves in the Test side.\n‘The emotions and feelings of winning a Test are hard to match and I don’ t think we’ll experience them in one-day cricket unless we win a World Cup. Having had a taste of Test cricket I still feel it’s the best form of the game, especially in England because of the support we receive. It’s extra special.’\nThe 25-year-old wants to follow the lead of Ben Stokes, who was sensational in South Africa\nIt is the success of Stokes, who hit the fastest 250 in Test history in Cape Town, that has convinced Buttler that he can flourish in the longer game without compromising his naturally aggressive and innovative methods.\n‘The way Ben has played has been an eye opener for everyone,’ said Buttler. ‘We all knew he was capable of that but to have the series he had was fantastic. Ben is one of my peers, so that gives me added motivation and belief that I can do it. All the talk with Trevor Bayliss is that it’s the way he wants to play in all forms.\n‘If I look back to the summer I think I went away from my strengths and maybe didn’t get the balance right between batting and keeping. Those are the things I’ve learnt and I feel a lot wiser about how to go about things if I did get another chance.’\nButtler is regarded as one of England's most gifted players and is preparing to face South Africa A\nFor now Buttler, who will be in the Indian Premier league auction next week, is a key figure in England’s attempt to add a one-day series victory over South Africa to their 2-1 Test success.\n‘I’ve got the fastest one-day hundred but there are a few guys in the changing room who can definitely beat that which is exciting,’ said Buttler. ‘Added expectation is something I have to deal with and I enjoy that responsibility and look to thrive on it.’","url":"https://www.dailymail.co.uk/sport/cricket/article-3423394/Jos-Buttler-follow-Ben-Stokes-lead-earn-England-place-fantastic-Test-series-South-Africa.html"}
