{"authors":["Martin Domin For Mailonline"],"date_download":"2018-10-22 20:22:52","date_modify":"2018-10-22 20:22:52","date_publish":"2016-01-28 01:07:05","description":"Jose Aldo has broken his silence to demand a rematch with Conor McGregor. The Brazilian was knocked out in 13 seconds last month as McGregor ended his five-year reign as champion.","filename":"data/vaneerConsumption/JoseAldodemandsrematchagainstConorMcGregor.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/306479DF00000578-0-image-a-18_1453943221452.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_ufc_article-3420240_Jose-Aldo-demands-rematch-against-Conor-McGregor_1540239772.html","title":"Jose Aldo demands rematch against Conor McGregor","title_page":"Jose Aldo demands rematch against Conor McGregor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jose Aldo has broken his silence to demand a rematch with Conor McGregor.\nThe Brazilian was knocked out in 13 seconds last month as McGregor ended his five-year reign as the UFC's featherweight champion.\nAnd Aldo has insisted he will accept only a title fight or a second clash with the Irishman.\nConor McGregor knocked out Jose Aldo in 13 seconds to win the featherweight title\n'I was quiet for a while because i was waiting for my rematch based on how the fight went down, in fact I was already training for it, but apparently I was wrong,' he said.\n'So I wanted to make something clear to UFC: for everything I have done, everything I have accepted and mostly how the fight ended, I will not accept any other fight other than a title shot.\n'My only exception would be fighting the Notorious, at any time, anywhere, and since he is afraid to give me the belt, it doesn't have to be title fight against him.\n'Keep my belt, but I wanna whoop your ass anywhere.'\nMcGregor celebrates with the featherweight belt and will challenge for the 155lb title next\nMcGregor will challenge Rafael dos Anjos for his lightweight belt at UFC 196 on March 5.\nThat event has been renamed from UFC 197 after the collapse of Fabricio Werdum's heavyweight title defence against Cain Velasquez.\nAfter Velasquez was replaced by Stipe Miocic, Werdum followed suit in pulling out injured.\nThe event, in Las Vegas on February 6, will now be headlined by the five-round welterweight bout between Johny Hendricks and Stephen Thompson.","url":"https://www.dailymail.co.uk/sport/ufc/article-3420240/Jose-Aldo-demands-rematch-against-Conor-McGregor.html"}
