{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 23:23:32","date_modify":"2018-10-30 23:23:32","date_publish":"2016-12-07 00:00:00","description":"Having a job won't save you from poverty.","filename":"data/vaneerConsumption/JosephRowntreereportHousingcrisisrentalpriceimpactonpoverty.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_joseph-rowntree-report-housing-crisis-rental-price-impact-on-poverty-2016-12_1540941812.html","title":"Joseph Rowntree report: Housing crisis, rental price impact on poverty","title_page":"    Joseph Rowntree report: Housing crisis, rental price impact on poverty - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty LONDON - Having a job won't save you from poverty because rental prices are so high, wages are simply not enough to offset the high cost of living.\nOne in every eight workers lives in poverty - 3.8 million people - according to a report by the Joseph Rowntree Foundation, a social policy group.\nThe number has risen by one million in 10 years because stagnant wages have not kept pace with the rising cost of private renting, the foundation said.\nHelen Barnard, head of analysis at the Joseph Rowntree Foundation, said:\n\"The UK economy is not working for low-income families. The economy has been growing since 2010 but during this time high rents, low wages and cuts to working-age benefits mean that many families, including working households, have actually seen their risk of poverty grow.\"\nThe total number of people living in poverty has doubled from 2.2 million in 2005 to 4.5 million this year, while half of children living in rented homes live in poverty.\n\"This report shows that people on low-incomes cannot rely on economic growth and rising employment alone to improve their financial prospects,\" Barnard said.\nHere are the figures:\nJoseph Rowntree Foundation\nPrime Minister Theresa May has focused policy to help \"Jams\" — those who are \"just about managing,\" while Chancellor Philip Hammond tweaked tax thresholds and promised a spending boost in his Autumn statment to help out families.\nA spokesperson for the Department of Work and Pensions said:\"We are committed to building a country that works for everyone, helping those who are just about managing so that nobody is defined by the circumstances of their birth.\"\n\"Since 2010, the number of people living in poverty has fallen by 300,000 but we know there's more to do. We're increasing the National Living Wage and taking millions of people out of income tax, to make sure it always pays to be in work.\"The problem is exacerbated by high rental costs. Around three-quarters of those in the bottom fifth for income are spending more than a third of their monthly wages on rent.\nMore than half of people in poverty in England live in London and southern England, where rents are highest. London has the highest poverty rate at 27%, which is 6% above the UK average.\nHere is the chart:","url":"https://www.businessinsider.com/joseph-rowntree-report-housing-crisis-rental-price-impact-on-poverty-2016-12"}
