{"authors":["Martha Sorren"],"date_download":"2018-10-30 22:28:48","date_modify":"2018-10-30 22:28:48","date_publish":"2014-08-15 16:22:35","description":"Although I didn't think it was possible, Joseph Gordon-Levitt announcing that he's a feminist just made me like him even more. He's certainly not the first male celebrity to be pro-equality, but he's one of the very few who's willing to use that…","filename":"data/vaneerConsumption/JosephGordonLevittIsaFeministButWhatAbouttheRestofHollywoodsMen.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/41ae777e-f078-4e8f-985b-3a039b603fa5.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35898-joseph-gordon-levitt-is-a-feminist-but-what-about-the-rest-of-hollywoods-men_1540938528.html","title":"Joseph Gordon-Levitt Is a Feminist But What About the Rest of Hollywood's Men?","title_page":"Joseph Gordon-Levitt Is a Feminist But What About the Rest of Hollywood's Men?","title_rss":"NULL","source_domain":"bustle.com","text":"Although I didn't think it was possible, Joseph Gordon-Levitt announcing that he's a feminist just made me like him even more. He's certainly not the first male celebrity to be pro-equality, but he's one of the very few who's willing to use that dreaded word, \"feminism.\" In a passionate statement, Gordon-Levitt reacted to the notion that some celebrities are acting out against the label of feminist. He tells the Daily Beast:\nComing out against the label? Wow. I guess I’m not aware of that. What [feminism] means to me is that you don’t let your gender define who you are—you can be who you want to be, whether you’re a man, a woman, a boy, a girl, whatever. However you want to define yourself, you can do that and should be able to do that, and no category ever really describes a person because every person is unique. That, to me, is what “feminism” means. So yes, I’d absolutely call myself a feminist.\nThe subject of feminism has always been a tricky one in Hollywood. While there are many male celebrities you probably could classify as feminist, only a handful of them have ever even talked about the word \"feminism\" and of those who have, about half had negative connotations about it. Here's how the men in Hollywood are talking about the notion of being feminist.\nJOHN LEGEND\nEthan Miller/Getty Images News/Getty Images\nThe musician isn't afraid of the feminist label and thinks more people should embrace it. At a press conference for the charity Chime for Change, which raises money to improve the lives of women all over the world, he said, \"All men should be feminists. If men care about women's rights the world will be a better place ... We are better off when women are empowered — it leads to a better society.\"\nJOSS WHEDON\nMike Windle/Getty Images Entertainment/Getty Images\nThe Avengers writer and Buffy the Vampire Slayer creator says he was \"raised by a hardcore feminist.\" Although years later he denounced the actual word saying it's \"Germanic, but not in the romantic way; this terrible ending with a wonderful beginning.\" He also argued that the word allowed people to think there was a \"fuzzy middle ground\" because it means so many different things to people. \"There's no fuzzy middle ground,\" he said. \"You either believe that women are people or you don't. It's that simple.\" So while he may decry the term, he stands behind the intention.\nTHE DALAI LAMA\nKeith Tsuji/Getty Images News/Getty Images\nHe may not be a Hollywood A-lister, but this public figure has stood up for women and deserves recognition for that. When asked about the term in 2009, he said, “I call myself a feminist. Isn’t that what you call someone who fights for women’s rights?”\nPHARRELL WILLIAMS\nKevin Winter/Getty Images Entertainment/Getty Images\nYou probably won't be surprised to know that the \"Blurred Lines\" singer is a bit confused about feminism.\nI’ve been asked, am I a feminist? I don’t think it’s possible for me to be that… I’m a man. It makes sense up until a certain point. But what I do is—I do support feminists. I do think there’s injustices. There are inequalities that need to be addressed.\nThat's almost as bad as the time Shailene Woodley said she couldn't be a feminist because she liked men.\nBILL BAILEY\nThe English comedian and Hot Fuzz actor once wore a shirt that read, \"This is what a feminist looks like,\" as part of a campaign to reclaim the word.\nRYAN GOSLING\nStar of the \"Hey girl\" memes, Gosling is often considered a defacto feminist. After all, he's ranted against the patriarchy before when the MPAA wanted to give Blue Valentine an NC-17 rating for the scene where Gosling goes down on Michelle Williams.\nYou have to question a cinematic culture which preaches artistic expression, and yet would support a decision that is clearly a product of a patriarchy-dominant society, which tries to control how women are depicted on screen. The MPAA is okay supporting scenes that portray women in scenarios of sexual torture and violence for entertainment purposes, but they are trying to force us to look away from a scene that shows a woman in a sexual scenario, which is both complicit and complex. It's misogynistic in nature to try and control a woman's sexual presentation of self.\nThere's no denying that's a pretty feminist view on the subject, but when it comes to the word itself, Gosling is a little reticent to take that label. A Salon writer talked to Gosling about his feminist Internet presence asking if he was the most feminist movie star ever, or if he just looked that way. \"Do I look like a feminist?\" Gosling asked. Then he laughed and said, \"Oh, forget it. I don’t want to know ... I’d rather live in the dark. It’s nice here.\" It's unfortunate that Gosling was made uncomfortable by that label, but it's nice to know he's at least said pro-feminism things in the past, even if he wouldn't call them as such.\nALAN ALDA\nDave Kotinsky/Getty Images Entertainment/Getty Images\nMuch like John Legend, the MASH and West Wing actor doesn't understand how you can not be a champion for women's rights. He's been doing it for years, and in 1981 dared to ask, \"Why isn’t everyone else a feminist, too?\"\nI don't know, Alan. I'm still trying to figure that one out myself. But at least women have some actors on their side who are willing to be branded with that supposed scarlet F. Hopefully, in time, more will come out in favor of feminism because I know there are a lot of male celebrities out there who believe in women's rights, they just don't know how to label their thinking.\nImages: Getty Images (5)","url":"https://www.bustle.com/articles/35898-joseph-gordon-levitt-is-a-feminist-but-what-about-the-rest-of-hollywoods-men"}
