{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 22:31:19","date_modify":"2018-10-30 22:31:19","date_publish":"2014-08-15 14:30:06","description":"UPDATE: Joseph Gordon-Levitt and girlfriend Tasha McCauley got married at home on Dec. 20. It's a happy new year for them, but a sad one for us. With all his support of feminism, is it wrong that I wanted to marry him myself? Didn't think so. In a…","filename":"data/vaneerConsumption/JosephGordonLevittsThoughtsonFeminismWillMakeYouLikeHimEvenMore.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/4b55a44f-2ac9-44fb-8ed2-e97dca750d3a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35912-joseph-gordon-levitts-thoughts-on-feminism-will-make-you-like-him-even-more_1540938679.html","title":"Joseph Gordon-Levitt's Thoughts on Feminism Will Make You Like Him Even More","title_page":"Joseph Gordon-Levitt's Thoughts on Feminism Will Make You Like Him Even More","title_rss":"NULL","source_domain":"bustle.com","text":"UPDATE: Joseph Gordon-Levitt and girlfriend Tasha McCauley got married at home on Dec. 20. It's a happy new year for them, but a sad one for us. With all his support of feminism, is it wrong that I wanted to marry him myself? Didn't think so. In a recent interview with The Daily Beast to promote his upcoming role in Sin City: A Dame to Kill For, Joseph Gordon Levitt called himself \"absolutely\" a feminist, and admitted that he doesn't understand why young Hollywood stars (Shailene Woodley, Taylor Swift, Kelly Clarkson, Katy Perry...the list goes on) reject the idea of feminism based on an old, ridiculously false stereotype of bra-burning.\nWhen asked what he thinks of young stars \"coming out against the label\" of feminist, in fact, Gordon-Levitt was genuinely taken aback:\nComing out against the label? Wow. I guess I’m not aware of that. What that means to me is that you don’t let your gender define who you are—you can be who you want to be, whether you’re a man, a woman, a boy, a girl, whatever. However you want to define yourself, you can do that and should be able to do that, and no category ever really describes a person because every person is unique. That, to me, is what “feminism” means.\nYou go JGL, four for you, JGL! Someone gets it! Someone understands that, literally, all feminism is wanting men and women to have equal opportunities in all facets of their life, whether it be social, political, career-wise, or whatever. That's it. It's not bra-burning (unless you really hate your bra, I guess, but I doubt anyone would go so far as to burn their bra because that sh*t is expensive and makes your boobs look fantastic) and it's certainly not hating all men.\nHe continued:\nSo yes, I’d absolutely call myself a feminist. And if you look at history, women are an oppressed category of people. There’s a long, long history of women suffering abuse, injustice, and not having the same opportunities as men, and I think that’s been very detrimental to the human race as a whole. I’m a believer that if everyone has a fair chance to be what they want to be and do what they want to do, it’s better for everyone. It benefits society as a whole.\nSeriously, it's kind of sad that someone would need to spell out the meaning of \"feminism\" like this, but, thankfully, JGL seems to have the patience and intelligence to do so.\nThis isn't the first time he's had to either — back in 2009, on Ellen, Gordon-Levitt said he was a feminist as well, because it was impossible to miss the double-standards in modern culture: \"For example, we would always watch Lakers games as a family, but my mom would always point out every time the cheerleaders come on, 'Okay, so look, here's the story that gets told: The men get to be the heroic skilled athletes and the women just get to be pretty.' She didn't mean any offense to any individual woman who was working as a cheerleader, but she wanted me and my brother to be aware of it because we see these images on TV, in the movies, and on magazines all the time. And if you don't stop and think about it, it just sort of seeps into your brain and that becomes the way you perceive reality.\"\nKeep being awesome, JGL. You're doin' it right.\nImages: JustGIFHunts/Tumblr","url":"https://www.bustle.com/articles/35912-joseph-gordon-levitts-thoughts-on-feminism-will-make-you-like-him-even-more"}
