{"authors":["Rory Brigstock-Barron For Mailonline"],"date_download":"2018-10-23 04:47:41","date_modify":"2018-10-23 04:47:41","date_publish":"2016-01-28 20:50:19","description":"Josh Barnett has never been one to take life too seriously, and the former UFC heavyweight champion continued the trend as he prepared for his huge fight with Ben Rothwell on Saturday.","filename":"data/vaneerConsumption/JoshBarnettattackedbymaskedwrestleratUFCFightNightNewJerseyopenworkoutThisisnotasportthisisentertainment.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30ADBAA300000578-0-image-a-33_1454031027568.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_ufc_article-3421652_Josh-Barnett-attacked-masked-wrestler-UFC-Fight-Night-New-Jersey-open-workout-not-sport-entertainment_1540270061.html","title":"Josh Barnett attacked by masked wrestler at UFC Fight Night New Jersey open workout: 'This is not a sport... this is entertainment'","title_page":"Josh Barnett attacked by masked wrestler at UFC Fight Night New Jersey open workout: 'This is not a sport... this is entertainment' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Josh Barnett has never been one to take life too seriously, and the former UFC heavyweight champion continued the trend as he prepared for his huge fight with Ben Rothwell on Saturday.\nThe 38-year-old heavyweight was attacked by a masked wrestler as he went through his open workout in New Jersey on Thursday, as he rolled back the clock to his professional wrestling days in Japan.\nBarnett was thrown around the ring and kicked repeatedly for the crowd's entertainment but will be in a real fight this weekend as he looks to break Rothwell's three-fight win-streak.\nJosh Barnett was attacked by masked wrestler during his open workout on Thursday in New Jersey\nBarnett is choked by his attacker as the pair entertain UFC fans and press at the workout\nThe UFC heavyweight grimaces the mysterious wrestler twists his arm behind his back\nThe attacker stamps on the former professional wrestler as fans watch in amusement at the UFC Gym\nHowever, the man formerly known as The Baby Faced Assassin is still out to entertain the UFC fans.\n'People put microphones and cameras in front of my face, I'm going to make the most out of it and I'm going to have a good time while doing so,' Barnett told FOX Sports.\n'In the end, it ended up being bonus to everything but it is undeniable that what we do is entertainment.\nBarnett got his revenge on the attacker has he throws him through the air insde the padded ring\nBarnett said that mixed martial arts is more about entertainment than sport\nThe 38-year-old goes head to head with his attacker inside the UFC Gym in Hoboken New Jersey\nBarnett bounces off the ropes as he goes through his paces in front of fans and media\n'This is not a sport. This is prize fighting, this is entertainment. This is a pro wrestling of a sort. I'm not here to be a goofy, over-the-top wild guy with a made-up persona but in even just being myself I can bring something interesting to the table.'\nBarnett's fight on Saturday has become even more significant this week with Cain Velasquez pulling out of his heavyweight title fight with champion Fabricio Werdum which was set for next weekend in Las Vegas.\nIf either man can make a statement in New Jersey they could be on the cusp of a shot at the title.\n'My biggest thing is the results will open the doors for me,' Barnett said. 'I'm going to go out there and give the absolute best performance I can give and I know it's going to be exciting if I do so. I know I have that kind of confidence.'","url":"https://www.dailymail.co.uk/sport/ufc/article-3421652/Josh-Barnett-attacked-masked-wrestler-UFC-Fight-Night-New-Jersey-open-workout-not-sport-entertainment.html"}
