{"authors":["Christine Rendon For Dailymail.Com","Associated Press"],"date_download":"2018-10-23 03:03:46","date_modify":"2018-10-23 03:03:46","date_publish":"2016-01-28 18:21:00","description":"The 43-year-old Transformers actor is starring in print ads promoting tourism in North Dakota. He was born in Minot, North Dakota, and says he tries to return a few times a year.","filename":"data/vaneerConsumption/JoshDuhamelrecruitssonAxltohelppromoteNorthDakota.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/23/30ACAAC600000578-0-image-a-83_1454022136340.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421433_Actor-Josh-Duhamel-says-visit-North-Dakota-His-home-state_1540263826.html","title":"Josh Duhamel recruits son Axl to help promote North Dakota","title_page":"Josh Duhamel recruits son Axl to help promote North Dakota | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He hails from scenic North Dakota.\nAnd now Josh Duhamel is serving as ambassador for the state, starring in TV and print ads due out later this year that will promote tourism in his home region.\n'Whenever people tell me, \"I've been to 49 states,\" I say, \"Let me guess. You haven't been to North Dakota,\"' the 43-year-old said in a phone interview. 'We're always the last state. I am trying to change that! We may be the 50th most-visited state, but we only have one way to go: Up.'\nScroll down for video\nGreetings from North Dakota! Josh Duhamel played with his son Axl as he overlooked the scenic North Dakota field in a snap from the promotional campaign\nDuhamel, who appeared in Transformers movies and the TV show Las Vegas, is from Minot, North Dakota, and gets back a few times a year.\n'We love to take road trips, me and my wife and my sister and her husband,' he said. 'We'll drive from Minot to Fargo, stop in random towns, population 20, go in and grab a beer.'\nThe actor, who has been married to Fergie since 2009, discussed whether or not he was recognised when he returns.\nWheely fun! The actor showed off his sporty side as he took in the landscape by bike while being photographed for the tourism campaign\n'A lot of these guys are old farmers,' he said. 'They're not big Black Eyed Peas fans, or Las Vegas or Transformers fans. They don't really care. They treat us like we're regular people.'\nIt's a welcome change from L.A. 'Every time I go back to North Dakota, the stress level just goes down,' he said. 'There's just so much open road. You can go 100 miles with nothing but little farmhouses. Something about the way people approach life is refreshing.'\nDuhamel spent eight days making the ads last summer with his son, Axl, now 2, in tow.\n'They're not big...fans': Duhamel, pictured with his wife Fergie in Beverly Hills in November 2015, admitted they aren't recognised when they travel to North Dakota\n'We traveled from Medora in the Badlands and Theodore Roosevelt National Park, all the way east through Bismarck to the Lewis and Clark Trail and Devils Lake and ended up in Fargo,' he said. 'We made it a whole sort of road trip.'\nThe ads' irreverent tone play on the idea that Duhamel is just a regular guy back home. One shows Duhamel meeting a couple while hiking. They ask for a photo. He assumes they want a photo of him, but instead they want him to shoot them.\nDuhamel's top recommendations for destinations in his home state include Theodore Roosevelt National Park ('truly the best-kept secret, so beautiful') and Fort Mandan.\nFamily first: The couple enjoyed a day out in Los Angeles with their two-year-old earlier this month\nThe fort was built by the Lewis and Clark expedition in the winter of 1804-05, and it was during their stay there that the explorers met the Native American woman who served as their guide, Sacagawea.\n'I've seen a lot of the rest of the world now,' Duhamel said, 'but there's something about going back to North Dakota that's just so peaceful.'\nThe ads will run on TV in May and early June in Minnesota and Wisconsin and in regional and national print magazines.\nAnd just for the record, according to a 2014 U.S. Travel Association's report, North Dakota isn't the 50th state when it comes to the impact of travel on state economics. It's 44th.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421433/Actor-Josh-Duhamel-says-visit-North-Dakota-His-home-state.html"}
