{"authors":["Elizabeth Ballou"],"date_download":"2018-10-30 23:13:21","date_modify":"2018-10-30 23:13:21","date_publish":"2014-08-13 21:49:27","description":"If you've been on Manhattan's High Line elevated pedestrian path lately, chances are you've seen artist Josh Kline's most recent installation, \"Skittles.\" The other day, I was strolling down the path for the first time when I saw what appeared to be…","filename":"data/vaneerConsumption/JoshKlinesSkittlesExhibitWillMakeYouThinkTwiceAboutYourNextJuiceCleanse.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/10/284e4ffc-ce41-4fce-9440-1c9befb9e95a-getty-672017444.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35665-josh-klines-skittles-exhibit-will-make-you-think-twice-about-your-next-juice-cleanse_1540941201.html","title":"Josh Kline's \"Skittles\" Exhibit Will Make You Think Twice About Your Next Juice Cleanse","title_page":"Josh Kline's \"Skittles\" Exhibit Will Make You Think Twice About Your Next Juice Cleanse","title_rss":"NULL","source_domain":"bustle.com","text":"If you've been on Manhattan's High Line elevated pedestrian path lately, chances are you've seen artist Josh Kline's most recent installation, \"Skittles.\" The other day, I was strolling down the path for the first time when I saw what appeared to be a blindingly white, modish-looking vending machine out of the corner of my eye. A few people were clustered around it, murmuring. \"Maybe they got a bag of chips stuck on a spring?\" I thought, and kept going. Turns out I missed an opportunity to check out a pretty cool piece of art.\nWhat it is: a clever play on the juice cleanse craze that so many people seem to be into (and which can actually be harmful, not beneficial, to your health). The rows of juice bottles inside the machine contain colorful blends of liquids and solids. Some of them look normal enough to down in a few sips, while others, with their floating bits of fabric and money, are more obviously different. Emblazoned in white, sans-serif font is a list of ingredients, which range from kombucha and agave to credit cards and yoga mats. As additional food for thought, the exhibition seems to contain a warning against the slick advertising on so many \"healthy\" products.\nKline's work is part of the outdoor \"Archeo\" exhibit, which is an \"exhibition about technology and obsolescence\" that reflects \"on humanity’s continuous fascination and frustration with technology.\" According to Kline's bio on the \"Archeo\" page, each \"Skittles\" smoothie is meant to represent a certain lifestyle:\n\"When grouped together, [the juices] evoke a landscape of aspiration, taste, and – at times – deprivation in a metropolis like New York City.\"\nCheck out some shots of the exhibition below. Which juice best matches your lifestyle?","url":"https://www.bustle.com/articles/35665-josh-klines-skittles-exhibit-will-make-you-think-twice-about-your-next-juice-cleanse"}
