{"authors":["Anam Syed"],"date_download":"2018-10-30 22:38:39","date_modify":"2018-10-30 22:38:39","date_publish":"2014-08-14 21:47:16","description":"The E! Network isn't the first thing that comes to mind when you think hard-hitting journalism or documentary series, but Society X with Laura Ling is just that. Usually home to shows like Bridalplasty and Keeping Up With the Kardashians, the…","filename":"data/vaneerConsumption/JournalistLauraLingIsAJewelTheseAreAllTheReasonsYouShouldLoveHer.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/6eb71d8a-0abf-45a3-affd-336f4502251f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35629-journalist-laura-ling-is-a-jewel-these-are-all-the-reasons-you-should-love-her_1540939119.html","title":"Journalist Laura Ling Is A Jewel & These Are All The Reasons You Should Love Her","title_page":"Journalist Laura Ling Is A Jewel & These Are All The Reasons You Should Love Her","title_rss":"NULL","source_domain":"bustle.com","text":"The E! Network isn't the first thing that comes to mind when you think hard-hitting journalism or documentary series, but Society X with Laura Ling is just that. Usually home to shows like Bridalplasty and Keeping Up With the Kardashians, the entertainment channel's programming blocks haven't been known for non-celebrity news. Despite that, Society X is committed to edgy stories and has the titular Ling investigating subcultures around the country, featuring a concept and some subject matter similar to VICE TV. This week's episode covers the world of \"living dolls,\" or people who get multiple invasive surgeries and subject themselves to cosmetic rituals to achieve a particularly doll-like appearance.\nWhile the subjects might be a little odd, and dare I say occasionally creepy, the woman in front of the camera with them is not. Ling will be hitting television screens nationwide, and if she seems a little bit familiar, you're not wrong. The storied journalist has quite a career behind her already, from overseas adventures to authoring a memoir with her sister.\nHere are just a few reasons why Ling is the brainy BFF of your dreams and why you should tune in to see her reporting in action on her new show.","url":"https://www.bustle.com/articles/35629-journalist-laura-ling-is-a-jewel-these-are-all-the-reasons-you-should-love-her"}
