{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 02:36:18","date_modify":"2018-10-23 02:36:18","date_publish":"2016-01-11 14:57:44","description":"The 25-year-old model stunned in an emerald green gown at the Burberry Menswear A/W16 show on Monday.","filename":"data/vaneerConsumption/JourdanDunnupstheglamourinsilkdressatBurberryLCMshow.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300B010900000578-0-image-a-38_1452522644516.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394023_Jourdan-Dunn-ups-glamour-plunging-silk-dress-Burberry-LCM-show_1540262178.html","title":"Jourdan Dunn ups the glamour in silk dress at Burberry LCM show","title_page":"Jourdan Dunn ups the glamour in silk dress at Burberry LCM show | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The likes of Brooklyn Beckham and Mark Ronson attended the Burberry Menswear A/W16 show.\nBut Jourdan Dunn completely stole the limelight from the boys when she arrived at the London fashion event in a gorgeous ensemble, looking effortlessly glamorous as she took pride of place in the front row on Monday.\nThe 25-year-old model stunned in an emerald green gown, wearing a chic fur stole draped around her shoulders for extra warmth.\nScroll down for video\nGorgeous in green: Jourdan Dunn looked absolutely incredible as she rocked up at the Burberry Menswear A/W16 show in London on Monday\nJourdan displayed a liberal amount of skin in her stunning dress which boasted a plunging neckline and a dangerously high side split.\nThe standout dress was fastened together at the waist with a gold broach, showcasing her svelte legs in all their glory.\nThe mother-of-one dressed up the look with a fur stole in soft shades of grey and beige, and sported a pair of statement strappy heels on her feet.\nFashion statement: The 25-year-old model dressed up her look with a fur stole in shades of grey and beige\nGlamazon: Jourdan added extra height to her towering frame thanks to a pair of strappy stilettos\nGorgeous: The catwalk queen's silk number was fastened at the waist with a gold broach\nElegant: Jourdan's daring ensemble was completed with a slick of dark berry lipstick\nGetting the giggles: The model was spotted having a fit of laughter as she chatted to pals outside the venue\nThe glamazon styled her locks in messy waves and chose a plum-coloured lipstick to enhance her pout.\nJourdan has been busy over the last few days, hitting the runway for Moschino during London Collections Men in an array of quirky and colourful menswear inspired looks.\nThe star previously admitted she thinks about retiring from modelling in order to care for her five-year-old son Riley, who has sickle cell anemia.\nMaking friends: Jourdan Dunn posed with handsome male model Johannes Huebl\nCute clutch: The striking star accessorised her look with a small brown leather handbag\nPride of place: Jourdan was sitting pretty on the FROW at the Burberry menswear show\nIn good company: The striking beauty was seated in between Nick Grimshaw (L) and Jack Guinness (R)\nCosy: Johannes also joined them to watch the unveiling of the British brand's Autumn/Winter 2016 collection\n'I thought about giving up all the time,' she told The Times. 'I didn’t enjoy being away from my family.\n'I would rather be at home with my friends. I didn’t enjoy the attitude. The politics. It was just too much.'\n'On one occasion I remember crying down the phone to my mum: \"I don’t want to do this. It is not worth it. I am miserable\".'\nClosing the show: The previous day, Jourdan walked for Jeremy Scott (L) in the Moschino show\nVibrant: The statuesque stunner modelled an array of colourful looks in the must-see show\nFlashing a smile: Jourdan was in great spirits as she left the venue following the runway event\nKeeping cosy: She donned an electric blue padded jacket with a hood from Moschino","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394023/Jourdan-Dunn-ups-glamour-plunging-silk-dress-Burberry-LCM-show.html"}
