{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 18:28:25","date_modify":"2018-10-30 18:28:25","date_publish":"2018-06-30 04:36:30","description":"A Massachusetts reporter who tweeted that the Annapolis, Maryland Capitol Gazette killer was wearing a Donald Trump campaign MAGA hat has announced that he has lost his job.","filename":"data/vaneerConsumption/JournalistWhoTweetedthatMarylandKillerWoreDonaldTrumpMAGAHatLosesJob.json","image_url":"https://media.breitbart.com/media/2018/06/MAGA-Hat-Matthew-CavanaughGetty-Images.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_06_29__1540924105.html","title":"Journalist Who Tweeted that Maryland Killer Wore Donald Trump MAGA Hat Loses Job","title_page":"Journalist Who Tweeted that Maryland Killer Wore Donald Trump MAGA Hat Loses Job","title_rss":"NULL","source_domain":"breitbart.com","text":"A Massachusetts reporter who tweeted that the Annapolis, Maryland Capitol Gazette killer was wearing a Donald Trump campaign MAGA hat has announced that he has lost his job.\nOn Thursday, Conor Berry, who was at the time a reporter for The Republican in Springfield, Mass., tweeted out the claim that the man who is accused of killing five newspaper employees in Annapolis, Maryland, was wearing a red “Make America Great Again” hat as he committed his shocking crime.\nBerry deleted the tweet after an editor from his paper saw it and demanded that the tweet be deep-sixed. However, the posting was seen before the deletion and screenshots soon began appearing on social media.\nBy Friday, Berry went back to Twitter to announce that his newspaper career had come “to a screeching halt,” The Hill reported.\n“Folks, My 21-year career as a ‘journalist,’ a fancy term that makes my skin crawl, frankly, came to a screeching halt yesterday with one stupid, regrettable tweet,” he tweeted on June 29. “Can’t take it back; wish I could. My sincere apologies to all good, hardworking reporters and to POTUS supporters.”\nFolks, My 21-year career as a \"journalist,\" a fancy term that makes my skin crawl, frankly, came to a screeching halt yesterday with one stupid, regrettable tweet. Can't take it back; wish I could. My sincere apologies to all good, hardworking reporters and to POTUS supporters. — CONOR BERRY (@CBerry413) June 29, 2018\nIn one of the comments on his announcement, the now former reporter insisted that his original MAGA hat tweet was supposed to have been taken as sarcasm and cynicism, but it was “interpreted as fact. It was not fact. It was fiction.”\nThe paper posted the former employee’s resignation letter on Friday, in which Berry said he was “ashamed” of the MAGA hat tweet. “I am ashamed of my tweet, which taints the good work of fair-minded journalists everywhere,” Berry wrote.\n“We need to be more vigilant than ever to be fair and accurate in a climate in which we are scrutinized and criticized,” The Republican’s executive editor, Wayne Phaneuf, said in the announcement. “The Republican newspaper and our partners at MassLive.com are committed to report the news with the truth paramount.”\nFollow Warner Todd Huston on Twitter @warnerthuston.","url":"https://www.breitbart.com/the-media/2018/06/29/journalist-who-tweeted-maryland-killer-wore-donald-trump-maga-hat-loses-job/"}
