{"authors":["Dylan Gwinn"],"date_download":"2018-10-30 19:50:31","date_modify":"2018-10-30 19:50:31","date_publish":"2017-03-23 15:21:37","description":"After Tom Brady’s jersey went missing, much of the conversation in the sports world centered on the question of where the culprit would sell the jersey, given that it would have to be sold on the black market. | Sports","filename":"data/vaneerConsumption/JournoWhoAllegedlyStoleBradyJerseyPlannedtoSellKurtWarnerHisOwnJersey.json","image_url":"https://media.breitbart.com/media/2017/03/kurt-warner.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2017_03_23__1540929031.html","title":"Journo Who Allegedly Stole Brady Jersey Planned to Sell Kurt Warner His Own Jersey","title_page":"Journo Who Allegedly Stole Brady Jersey Planned to Sell Kurt Warner His Own Jersey | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"After Tom Brady’s jersey went missing, much of the conversation in the sports world centered on the question of where the culprit would sell the jersey, given that it would have to be sold on the black market.\nWell, now that the culprit has been found, we have more of an idea of potential buyers. According to the Associated Press, at least in the case of Kurt Warner, the thief planned to sell it back to its rightful owner.\nMauricio Ortega, the Mexican media member who allegedly stole Tom Brady’s jersey, approached former Rams quarterback Kurt Warner, to try to get him to sign his own jersey. He then planned to sell Warner his own jersey back to him.\nAccording to the Sporting News:\nArturo Palafox, sports editor of the newspaper 24 Horas, told the AP he saw Ortega carrying a bag of player memorabilia in Houston, including Warner’s jersey and a book from former Cowboys running back Emmitt Smith. “He showed me Warner’s jersey with his signature and told me a story about how Warner was surprised that he was in possession of the item,” Palafox told the AP. “He said he planned to gather interest from Warner to sell him the jersey for $8,000.” Ortega, who has received media credentials for Super Bowls since at least 2005, allegedly took Brady’s Super Bowl 49 jersey as well, not to mention Von Miller’s helmet and cleats from Super Bowl 50. Those items were recovered on Monday.\nThe wall just got ten feet higher.\nFollow Dylan Gwinn on Twitter: @themightygwinn","url":"https://www.breitbart.com/sports/2017/03/23/journo-allegedly-stole-brady-jersey-planned-sell-kurt-warner-jersey/"}
