{"authors":[],"date_download":"2018-10-30 14:08:36","date_modify":"2018-10-30 14:08:36","date_publish":"2018-10-30 13:12:00","description":"Police blocked off a street Tuesday morning in Charlotte, North Carolina, while authorities investig...","filename":"data/vaneerConsumption/JourneycassettetapemistakenforsuspiciouspackageinNorthCarolin.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/10/30/Images/DqwCxFwWkAE5DRY.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_journey-casse_4ca8fae2d0787d1f135824f477c39c0d__1540908516.html","title":"Journey cassette tape mistaken for suspicious package in North Carolin","title_page":"Journey cassette tape mistaken for suspicious package in North Carolin","title_rss":"NULL","source_domain":"ajc.com","text":"Police blocked off a street Tuesday morning in Charlotte, North Carolina, while authorities investigated a report of a suspicious package that ended up being a cassette tape of the band Journey.\nInvestigators told WSOC that the suspicious package was noticed at the Duke Energy building in the city. Police said employees found a small manila envelope with suspicious handwriting on it.\n>> Read more trending news\n“Due to all the recent national events out of an abundance of caution their mail room alerted our central division offices who responded to the scene,” a spokesman for the Charlotte-Mecklenburg Police Department said. “They out of an abundance of caution notified our bomb squad who came and did a diagnostic on the package and it ended up being a cassette tape.”\nThe bomb squad brought bomb-sniffing dogs to the scene.\nA Duke spokeswoman could not share many details about the package, but said it was addressed to Duke Energy. She also said the scene was cleared just before 7:45 a.m. and that business was operating as normal inside the building.\nCMPD said some buildings in the immediate area were choosing to evacuate, but the scene was clear by 8 a.m.","url":"https://www.ajc.com/news/national/journey-cassette-tape-mistaken-for-suspicious-package-north-carolina/naabCK3p4nGNi0my2lmZrI/"}
