{"authors":["Will Martin"],"date_download":"2018-10-31 00:17:38","date_modify":"2018-10-31 00:17:38","date_publish":"2018-07-11 00:00:00","description":"\"Because of the way it has been designed, the European Monetary Union would be hard to reverse without causing catastrophic events,\" Dimon told Italian paper Il Sole 24 Ore.","filename":"data/vaneerConsumption/JPMorganCEODimonwarnsofcatastrophiceventsifItalyleavestheeuro.json","image_url":"https://amp.businessinsider.com/images/58de9e5e77bb70a0428b51f3-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_jpmorgan-dimon-catastrophic-events-if-italy-leaves-the-euro-2018-7_1540945058.html","title":"JPMorgan CEO Dimon warns of 'catastrophic' events if Italy leaves the euro","title_page":"    JPMorgan CEO Dimon warns of 'catastrophic' events if Italy leaves the euro - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty/Win McNamee\nJPMorgan boss Jamie Dimon has warned Italy's populist government of the likely \"catastrophic\" consequences that would come from attempts to pull the country out of the eurozone.\nSpeaking to Italian newspaper Il Sole 24 Ore, Dimon said that because of the structure of the European Monetary Union — the formal name for the project to converge monetary policy of the eurozone — pulling out would not only be immensely difficult, but also immensely dangerous for the stability of the global financial system.\n\"Because of the way it has been designed, the European Monetary Union would be hard to reverse without causing catastrophic events,\" Dimon told the paper.\n\"This does not mean that Europe should not fix itself; there are many regulatory issues that remain to be solved, and the fact that Brexit happened should make the dialogue between European countries easier.\"\nDimon's comments come as Italy's populist coalition government, comprised of the Lega Nord and Five Star Movement, repeatedly publicly mentioning pulling out of the euro in the lead up to the creation of that government.\nOfficial policy is that the government backs remaining in the European Union, but Matteo Salvini, the Lega Nord's leader, is an avowed eurosceptic, and is believed to privately back an exit.\nIn May, a leaked report, published in part by the Huffington Post, showed that both the parties discussed a commitment to leave the euro prior to entering into government, before abandoning that pledge.\nWhether or not the parties push for an exit from the euro, the fact that such a proposal almost formed a part of their plan for government marked a huge moment for the eurozone.\nItaly is one of the three most crucial members of the eurozone project, alongside France and Germany. Italy is the third biggest economy in the group and the largest in southern Europe. If Italy were to make attempts to withdraw from the EMU, it would undoubtedly be a huge market event.\nElsewhere in his interview with Il Sole 24 Ore, Dimon also warned that Brexit \"could turn out to be tough for the British people.\"\n\"I think Brexit could turn out to be tough for the British people because of its impact on British growth: if there is going to be less growth in the UK, this will have an impact on global growth, and so Brexit could hurt everybody a bit.\"","url":"https://www.businessinsider.com/jpmorgan-dimon-catastrophic-events-if-italy-leaves-the-euro-2018-7"}
