{"authors":["Aaron Klein"],"date_download":"2018-10-30 19:24:17","date_modify":"2018-10-30 19:24:17","date_publish":"2016-11-09 21:43:12","description":"Juanita Broaddrick, the woman who accused Bill Clinton of raping her twice in a hotel room in 1978, declared on Wednesday that for her personally Donald | Politics","filename":"data/vaneerConsumption/JuanitaBroaddrickJusticeHasPrevailedWithHillaryLoss.json","image_url":"https://media.breitbart.com/media/2016/10/juanita-broaddrick.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_11_09__1540927457.html","title":"Juanita Broaddrick: 'Justice Has Prevailed' With Hillary Loss","title_page":"EXCLUSIVE - Juanita Broaddrick: 'Justice Has Prevailed' With Hillary Loss","title_rss":"NULL","source_domain":"breitbart.com","text":"Juanita Broaddrick, the woman who accused Bill Clinton of raping her twice in a hotel room in 1978, declared on Wednesday that for her personally Donald Trump’s victory means “Bill and Hillary Clinton no longer have any control over me.”\nAsked to comment on what Trump’s win means for her, Broaddrick told Breitbart News:\n“Justice has prevailed. Bill and Hillary Clinton no longer have any control over me. I have lived in fear for 38 years, but that fear is now gone. I am so thankful to my family and friends for believing in me and supporting me. I am truly grateful to President Elect Donald J. Trump for giving me the opportunity to tell my story in the public arena of the 2nd Presidential Debate. I’ve had messages from dozens of victims of sexual abuse and rape and I tell them: Do not give up hope. Sexual abuse and rape are heinous crimes regardless of who commits them.”\nLast month, Breitbart News released an exclusive video interview in which Broaddrick recounted what she described as the life-changing experience of being raped by Clinton. The YouTube video has since garnered over one million views.\nWatch that video here:\nIn another Breitbart News exclusive video, Broaddrick recounted an alleged encounter with Hillary Clinton in which Broaddrick says the future presidential candidate attempted to intimidate her into being silent about the alleged rapes.\nBroaddrick said she believed that Hillary Clinton knew that her husband had raped her during their encounter.\nWatch the video here:\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.","url":"https://www.breitbart.com/politics/2016/11/09/exclusive-juanita-broaddrick-bill-hillary-clinton-no-longer-control/"}
