{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:30:08","date_modify":"2018-10-30 21:30:08","date_publish":"2016-06-03 16:25:39","description":"Writer-director Judd Apatow believes he knows where all the hate for the upcoming all-female Ghostbusters reboot is coming from — namely, supporters of presumptive GOP presidential nominee Donald Trump. | Entertainment","filename":"data/vaneerConsumption/JuddApatowAllFemaleGhostbustersHatersAreProbablyTrumpVoters.json","image_url":"https://media.breitbart.com/media/2016/06/Apatow1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_06_03__1540935008.html","title":"Judd Apatow: All-Female 'Ghostbusters' Haters Are Probably Trump Voters","title_page":"Judd Apatow: All-Female 'Ghostbusters' Haters Are Probably Trump Voters | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Writer-director Judd Apatow believes he knows where all the hate for the upcoming all-female Ghostbusters reboot is coming from — namely, supporters of presumptive GOP presidential nominee Donald Trump.\nIn an interview with Uproxx, the 48-year-old Trainwreck director defended Ghostbusters director Paul Feig and predicted the film would be successful despite the vocal backlash from “angry trolls.”\n“I would assume there’s a very large crossover of people who are doubtful Ghostbusters will be great and people excited about the Donald Trump candidacy. I would assume they are the exact same people,” Apatow told the outlet. “That movie is made by the great Paul Feig and stars the funniest people on Earth, so I couldn’t be more excited.”\nThe trailer for the new Ghostbusters film — directed by Feig and starring Melissa McCarthy, Kristen Wiig, Kate McKinnon and Leslie Jones — was uploaded to YouTube in early March and quickly became the most-disliked trailer in the video-sharing website’s history. The trailer had more than 850,000 “thumbs down” on YouTube as of Friday morning, compared with just 247,000 “thumbs up.”\nAs Breitbart previously reported, the backlash against the film prompted a series of articles in left-leaning publications that accused critics of sexism and misogyny for disliking the trailer, while critics themselves contend that the film simply does not look as funny as the 1984 original.\n“I think people have paid too much attention to just some angry trolls. And it will be judged on its own greatness,” Apatow told Uproxx. “I don’t think anything really matters the way you think it does. The movie comes out, and it will be great, and people will just be happy to have it.”\n“It’s not like anybody really cares about a couple of idiots who hold onto the idea that things never evolve,” he added. “I always think, you know, we have our past and if you can come up with a new, cool way to do something, then that’s exciting and hopefully it will make a lot of people happy.”\nApatow previously collaborated with Feig on the short-lived 90s television series Freaks and Geeks and on the 2011 female-led sleeper hit Bridesmaids.\nFeig defended his upcoming film in an interview with the New York Daily News in May, telling the outlet that “geek culture is home to some of the biggest a**holes I’ve ever met in my life.”\n“I don’t care what shape or size or color or anything they are,” Feig said of the updated cast. “I live or die on what things are funny and whether or not people will be entertained by them,” he said.\nFollow Daniel Nussbaum on Twitter: @dznussbaum","url":"https://www.breitbart.com/entertainment/2016/06/03/judd-apatow-female-ghostbusters-haters-probably-trump-voters/"}
