{"authors":["Abc News","More Kelly"],"date_download":"2018-10-30 00:56:56","date_modify":"2018-10-30 00:56:56","date_publish":"2018-10-29 12:03:28","description":"The legal personality discusses his efforts to help the water crisis in Flint.","filename":"data/vaneerConsumption/JudgeMathissharestheinspiringlastwordsheheardfromlongtimefriendArethaFranklin.json","image_url":"https://s.abcnews.com/images/General/judge-greg-mathis-view-abc-jef-181029_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Entertainment_judge-mathis-_75b30b93e6fd074ec3df161d620fc8c9_story_id=58828366_1540861016.html","title":"Judge Mathis shares the inspiring 'last words' he heard from longtime friend Aretha Franklin","title_page":"Judge Mathis shares the inspiring 'last words' he heard from longtime friend Aretha Franklin - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"Judge Greg Mathis, a native of Detroit and well-known courtroom TV host, said his advocacy work to help the people of Flint, Michigan with the ongoing water crisis came after a nudge from his longtime friend and Queen of Soul, Aretha Franklin.\nMathis joined \"The View\" Monday to discuss his efforts in Flint, which he said he and Franklin discussed just before her death. Aretha gave him some crucial words of wisdom.\n\"She and I would talk every month about politics. She was deep into politics, and she said, 'Greg, you've got to go back up there,'\" he said.\n\"'You're from Detroit, you shouldn't be scared,'\" Mathis said the singer told him. \"'So go up there and sock it to 'em, sock it to 'em.' Those were our last words.\"\nMathis said the two worked together in 2016 to push for the state and federal government to give $200 million to provide free water and rebuild the city's pipes.\nMathis said that he continues to advocate for Flint.\n\"There's still over $100 million left to be used, and one of the things we're looking at, our legal committee, is whether the state violated the contract they have with the city to continue providing free water up and to a point, and that point was to be when the water was either clean for the citizens to drink or pipes rebuilt,\" Mathis said.\nMatthis is planning to help deliver tens of thousands of cases of water to Flint on Nov. 1.\n\"On November 1st we have a caravan leaving Detroit from the Mathis Community Center and we're going to take tens of thousands of cases of water [to Flint.] We have semi trucks who are going to be with a caravan of about 50 cars. And we're going to stop in a couple other cities and collect water then take it to Flint and deliver that water to sites. Where the government stopped, we're gonna come in.\"\nThat night, Mathis said, there will be a rally to \"challenge the state and the city to get things done.\"","url":"https://abcnews.go.com/Entertainment/judge-mathis-shares-inspiring-words-heard-longtime-friend/story?id=58828366"}
