{"authors":["Vanessa Romo"],"date_download":"2018-10-22 21:19:48","date_modify":"2018-10-22 21:19:48","date_publish":"2018-08-10 00:00:00","description":"About 550 immigrant children between the ages of 5 and 17 are still separated from their families. The government has presented a framework that outlines steps to reunite them.","filename":"data/vaneerConsumption/JudgePleasedWithGovernmentEffortButHundredsOfChildrenStillInCustody.json","image_url":"https://media.npr.org/assets/img/2018/08/10/ap_18199618161288_wide-3b9b9d453622746fa3211244be354ce2b8633dfe.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_10_637670285_judge-pleased-with-government-effort-but-hundreds-of-children-still-in-custody_1540243188.html","title":"Judge Pleased With Government Effort But Hundreds Of Children Still In Custody","title_page":"Judge Pleased With Government Effort But Hundreds Of Children Still In Custody : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Judge Pleased With Government Effort But Hundreds Of Children Still In Custody\nEnlarge this image toggle caption Martin Panuco/AP Martin Panuco/AP\nThe Trump administration has come up with a framework for reuniting families whose children are still in government custody. Some of their parents have been released into the U.S. and others are now in other countries.\nIn documents filed Thursday, government officials told U.S. District Court Judge Dana Sabraw that 559 children between the ages of 5 and 17 have yet to be reunited with their families. Of those, 365 have parents who were deported, and officials have contact information for all but five.\nA much smaller number of children — about 50 — have parents who were freed from Immigration and Customs Enforcement detention centers but haven't been located by the government.\nMore than 140 are ineligible for reunification because of \"red flag\" warnings — meaning one or more agencies have determined a parent has a criminal record.\nSabraw, who has previously expressed frustration with the pace at which the government is delivering minors into the care of familiar adults, appeared pleased by the administration's progress and its outline moving forward.\nThe five-step framework presented on Friday, aimed at rejoining children and removed parents, is not final. The American Civil Liberties Union; three nongovernmental agencies, including Kids in Need of Defense; a private law firm; and a group of federal agency leaders intend to work through the weekend to devise a joint plan for reunification.\nAccording to documents filed in federal court in San Diego, the federal leaders are being termed the UAC Reunification Coordination Group, a task force with members from the departments of Health and Human Services, Homeland Security, State and Justice.\nBut as KQED member station reporter John Sepulvedo told NPR, much of the heavy lifting of reunifying deported parents with the children may fall to the ACLU, which brought a lawsuit on behalf of separated families.\nThe government is arguing that the ACLU needs to prove that parents in their home countries want their children back.\nThe administration's framework calls on the ACLU to \"be responsible, as the counsel to the parents, for determining and conveying the parents' wishes.\"\nLawyers for the ACLU argue it is the government's responsibility to determine whether these parents were aware of their rights.\nThe ACLU has said in court that parents were confused, coerced or deceived into signing reunification waivers by being told signing such documents would expedite their reunion.\n\"We still have significant concerns,\" Lee Gelernt, an attorney with the ACLU, told Sepulvedo. \"It appears many of these parents agreed to deportation after being told they would be reunified with their kids.\"","url":"https://www.npr.org/2018/08/10/637670285/judge-pleased-with-government-effort-but-hundreds-of-children-still-in-custody"}
