{"authors":[],"date_download":"2018-10-30 19:54:06","date_modify":"2018-10-30 19:54:06","date_publish":"2018-10-30 19:06:00","description":"At Gwinnett County’s Mill Creek High, Trent Walker seemed normal enough, even promising. Now he's in an institution because of schizophrenia after killing his father in 2014.","filename":"data/vaneerConsumption/JudgeSonwasinsanewhenhestabbedfatherdeadinGwinnett.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/30/Images/Trent%20Walker%20in%20court_edited.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_gwinnett-ma_2d91e8361a2bc58ffd2fbee0875fb0e8__1540929246.html","title":"Judge: Son was ‘insane’ when he stabbed father dead in Gwinnett","title_page":"Judge: Son was ‘insane’ when he stabbed father dead in Gwinnett","title_rss":"NULL","source_domain":"ajc.com","text":"At Gwinnett County’s Mill Creek High, Trent Walker seemed normal enough, even promising: a talented lacrosse player, who wore No. 24 for the Hawks and was social with teammates. But after graduation, friends and family saw a bizarre, flailing decline, which culminated with Walker’s face speckled with blood as he knelt in the middle of the street, praying over his father’s dead body.\nLast week, Judge Randy Rich found Walker, now 24, not guilty by reason of insanity in the 2014 stabbing of his father David Walker, as well later attacking a guard at the county jail. The verdict means he’ll be institutionalized for as long as the judge sees fit — be it a year or the rest of Walker’s life.\nThe case “is a tragedy of epic proportions,” assistant district attorney Han Chung told The Atlanta Journal-Constitution.\nIt’s a story of a young man diagnosed with schizophrenia, fighting with his mind and then, in a sudden attack, killing his 46-year-old father. Relatives were left to grapple with the loss of both the victim and, in many ways, the defendant.\nSchizophrenia tends to creep into view for young people in their late teens and early 20s, leaving families struggling to respond. Walker’s issues became apparent when he went away to Georgia Southern University in Statesboro. He reported hearing voices and believing that his roommates were spying on him, according to testimony.\nHe moved back home with his parents in an affluent subdivision in the Hoschton community of northwestern Gwinnett near Jackson County. His mother, also the victim’s widow, testified about finding him poking at insulation in basement one day, looking for a camera or microphone that wasn’t there.\nTestimony shows the family helped him seek treatment, but he stopped taking his regular medication for about a month before he attacked his father on Nov. 5, 2014. He had, however, taken a new medicine that day: Vyvanse, a stimulant used to treat ADHD, which the defense argued caused Walker to lose control because the drug wasn’t paired with any anti-psychotic medications.\nREAD: Former owner of notorious apartments to pay $3 million in teen’s death\nREAD: Inmate escaped Atlanta prison camp ‘for love’ — then sneaked back in\nREAD: DeKalb still denies police ‘quota’ system after settling suit for $150K\nOne witness thought the father and son were playing football outside their home at about 2:30 p.m., but other witnesses’ statements suggest the sight was actually Walker chasing his father with a knife. Multiple passersby and neighbors called 911. They said the son stabbed the father in the neck and the father fell to his knees, then to the pavement on Country Woods Lane.\nWalker stayed on the scene. Some witnesses testified he was pacing and talking to someone who wasn’t there. One recalled him kicking leaves, calmly. Several found it eerie that he wasn’t more upset or frantic.\nA woman who was trying to assess the father’s injuries asked the son what happened. Walker would only say that they needed to pray. He dropped to his knees and spoke incoherently.\nThe defense didn’t dispute that Walker killed his father. Nor did the state dispute that he had mental troubles.\nBut the jury in the first trial hung, leading to a mistrial. Most jurors voted to find Walker not guilty by reason of insanity.\nDefense attorneys requested the retrial be a bench trial — decided by a judge without a jury — because it seemed testimony in the first trial had clearly established the case for Walker being not guilty by reason of insanity. Knowing how close the jury came to acquitting Walker, and knowing the testimony and judge wouldn’t change in the second trial, the state agreed to let the judge decide the case. Chung, the prosecutor, said, though Walker may be mentally ill, he thought he should be found guilty but mentally ill.\nHad the judge sided with Chung, Walker would’ve been sentenced to life and held in an institution for at least 30 years.\nThe judge’s decision to find him not guilty by reason of insanity means the court will be able to evaluate Walker’s condition once a year and decide whether Walker should be released. He will serve at least a year before the judge’s first evaluation, but it’s possible he might never be released.\nSeveral staff members from the Georgia Regional Hospital outside Decatur, where Walker was taken after his arrest, testified in his trial about the severity of his schizophrenia. They will continue to provide updates to the judge on his condition.\nWalker’s attorneys declined to comment for this story. Several relatives couldn’t be reached.\nChung said, to his knowledge, all of Walker’s family was satisfied with the verdict.\nIn other news:","url":"https://www.ajc.com/news/crime--law/gwinnett-man-who-killed-dad-not-guilty-because-insanity/MPPiEAfie0ZAb3plut2YBO/"}
