{"authors":["Lani Seelinger"],"date_download":"2018-10-31 01:41:32","date_modify":"2018-10-31 01:41:32","date_publish":"2018-08-28 12:22:50","description":"After an extraordinarily emotional sentencing hearing in which more than 150 women all spoke of their experiences surviving sexual abuse at the hands of former USA Gymnastics doctor Larry Nassar, there's been a call for sympathy — but it's not…","filename":"data/vaneerConsumption/JudgeAquilinaDeniedLarryNassarsNewSentencingRequestWithAStrongDeclaration.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/8000fc17-90ff-42aa-b4bd-34ad4af51a95-getty-905708762.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_judge-aquilina-denied-larry-nassars-new-sentencing-request-with-a-strong-declaration-10259451_1540950092.html","title":"Judge Aquilina Denied Larry Nassar's New Sentencing Request With A Strong Declaration","title_page":"Judge Aquilina Denied Larry Nassar's New Sentencing Request With A Strong Declaration","title_rss":"NULL","source_domain":"bustle.com","text":"After an extraordinarily emotional sentencing hearing in which more than 150 women all spoke of their experiences surviving sexual abuse at the hands of former USA Gymnastics doctor Larry Nassar, there's been a call for sympathy — but it's not coming from the survivors. After the defense asked for more leniency in terms of the sentence that had been handed down, Judge Rosemarie Aquilina denied Nassar's new sentencing request with a very definitive response.\nNassar's attorneys requested both a lighter sentence and a different judge earlier in August, according to the Lansing State Journal. They claimed that Judge Aquilina was biased against Nassar and appealed to Judge Aquilina, the Ingham County chief judge, and the Court of Appeals. All motions to remove Judge Aquilina were denied, and then she also denied the motion for a new sentencing hearing.\nMany observers noted that Judge Aquilina was uncharacteristically vehement in Nassar's original sentencing hearing, with Vox, for example, saying that she had \"crossed a line\" in her perceived animosity towards Nassar. In her denial of his request for a more lenient sentence on Monday, she gave Nassar a response that was no less strong.\n\"What he's asking for now is continued control and control over those girls. He wants to control his sentencing,\" she said, according to the Lansing State Journal. She continued:\nHe wants somehow to think that the legal system, after being the most notorious, worst sexual predator in the world, he wants the court to hold his hand by his prescription the whole way, right into the jail and into the prison.\n\"And this court will not do that. This is not Burger King. He will not have it his way,\" Judge Aquilina went on.\nThe defense, which according to Michigan Radio could still appeal Judge Aquilina's decision, claims that Judge Aquilina was treating Nassar as though he was \"below the law.\"\n“There’s a lot of talk these days about whether or not anyone is above the law, but I would say the corollary to that is no one is beneath the law,” said Jacqueline McCann, one of Nassar's lawyers. “Not even Dr. Nassar.”\nThe Michigan Attorney General's Office, though, which prosecuted Nassar to begin with, did not agree that Nassar had been treated in an inappropriate manner, according to the Lansing State Journal.\nScott Olson/Getty Images News/Getty Images\n\"Nassar does not have the right to a sentencing hearing that is devoid of emotion or condemnation. Apparently what Nassar expected was a bland and tepid sentencing. Again, too bad,\" said Chief Deputy Attorney General Laura Moody at the hearing, according to the Lansing State Journal. \"What he got was something very different: A sentencing hearing filled with outrage at his behavior.\"\nIn January, Nassar was sentenced to 40 to 175 years in prison on multiple sexual assault convictions, which was already in addition to a sentence of 60 years for child pornography. When she handed down the 40-175 year sentence, Judge Aquilina wasn't in any doubt about what the result of her sentence would be for Nassar's life.\n\"I've just signed your death warrant,\" Judge Aquilina said to Nassar at his sentencing hearing, according to Bustle.","url":"https://www.bustle.com/p/judge-aquilina-denied-larry-nassars-new-sentencing-request-with-a-strong-declaration-10259451"}
