{"authors":["Jon Fleischman"],"date_download":"2018-10-30 21:14:42","date_modify":"2018-10-30 21:14:42","date_publish":"2015-05-03 07:05:13","description":"In a victory for transparency in state politics, Sacramento Superior Court Judge Michael Kenny ruled last week that the State Senate is required to turn over the calendars and other requested documents from the offices of former Senators Calderon and Yee. |","filename":"data/vaneerConsumption/JudgePoisedToReleaseCalendarsOfIndictedExLegislators.json","image_url":"https://media.breitbart.com/media/2015/01/Capitol-Dome-1024x768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_05_03__1540934082.html","title":"Judge Poised To Release Calendars Of Indicted Ex-Legislators","title_page":"Judge Poised To Release Calendars Of Indicted Ex-Legislators | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"If you still wonder why voters are often cynical about those in elective office, read on.\nLast Spring, the Bay Area News Group and the Los Angeles Area News Group both made multiple requests for, and were refused, copies of the calendars of two State Senators under criminal indictment–Leland Yee of San Francisco and Ron Calderon of East Los Angeles County (both Democrats).\nWhile the California Public Records Act (CPRA) requires making similar documents available throughout all of state and local government, the legislature, in passing the act exempted its members from such transparency requirements.\nTo be clear, while the CPRA does not require legislators to provide their internal documents and communications, it does not prohibit them from doing so, either.\nThis is probably a good time to provide you with a refresher on Calderon and Yee’s criminal legal travails:\nIn February of last year, then-State Senator Ron Calderon was named in a federal grand jury indictment on charges related to fraud, bribery, money laundering and falsification of tax returns–using his office for personal gain.\nLast March, Senator Yee was named with 28 other defendants in a criminal complaint. He is accused of dealing firearms without a license, illegally importing firearms, and accepting “tens of thousands of dollars in campaign contributions in campaign contributions and cash payments to provide introductions, and help a client get a contract and influence legislation,” according to the indictment.\nThe State Senate refused to take up an expulsion vote for the two Senators, but did invent a status called “suspended” where both continued to received a full salary and benefits, but had no work responsibilities through the remainder of their time in the legislature. Both Senators’ terms ended last December. Both await their criminal trials.\nAfter being turned down, the newspaper groups took the matter to court, in an attempt to compel the legislature to provide the documents.\nAfter filing their lawsuit last summer, and having it wind its way through the court system, a tentative ruling was issued last week. In a victory for transparency in state politics, Sacramento Superior Court Judge Michael Kenny ruled last week that the State Senate is required to turn over the calendars and other requested documents from the offices of former Senators Calderon and Yee.\nKenny, in making his ruling, said the public interest in releasing the documents was greater than the case for privacy made by attorneys for the State Senate.\n“The allegation of such wrongdoings created by the federal investigation is of a significant interest to the public. To the extent these alleged activities occurred under the guise of the legislators’ official duties is even more concerning,” Kenny said in his tentative decision.\nBy issuing a tentative ruling, the Judge allows the parties to comment on it, in an attempt to persuade him one way or the other, before making his ruling final. A final ruling is expected within 90 days.\nIn is worth noting that with his tentative ruling, Kenny seems to reject the specious argument put forward that releasing calendars of legislators would present a safety hazard to those officials.\nKenny’s ruling is likely going to be precedent-setting, because it represents a serious challenge to the constitutionality of the exemption that the legislature carved out for itself.\nOn Friday, attorneys for the California State Senate submitted another round written arguments to the judge, urging him to reverse his tentative ruling.\nPerhaps adding insult to injury is that all of the legal costs being incurred by the State Senate in this case are being funded with pubic taxpayer money–the very public that is being told it cannot see the private goings-on by publicly-funded legislators in the publicly-funded Capitol where they are making decisions that greatly impact public policy.\nWhile technically the State Senate is under the control of legislative Democrats, this is clearly a case of a bipartisan “circling of the wagons,” as at no time during this process have Senate Republicans weighed in publicly to call for transparency and for releasing the documents.\nThe culpability of individual State Senators, who presumably have the liberty to invite scrutiny of their own calendars and internal office documents whenever they would choose to do so, has also been exposed.\nFinally, note the silence from the State Assembly. No doubt this ruling will impact both chambers of the legislature, not just the upper one.\nWhich brings us back to voter cynicism.\nMuch is being made of the record low turnout in last November’s election–a scant 42% of eligible voters actually voting. Perhaps some of the blame can be places the disconnect many voters feel from the politicians who are supposed to represent them in the State Capitol.\nNothing says “we are above you, and not of you” more directly that shrouding your activities in secrecy.\n___\nJon Fleischman is the Politics Editor of Breitbart California. A longtime participant, observer and chronicler of California politics, Jon is also the publisher at www.flashreport.org. His column appears weekly on this page. You can reach Jon at jfleischman@breitbart.com.","url":"https://www.breitbart.com/local/2015/05/03/judge-poised-to-release-calendars-of-indicted-ex-legislators/"}
