{"authors":["Ken Klukowski"],"date_download":"2018-10-30 17:54:48","date_modify":"2018-10-30 17:54:48","date_publish":"2017-03-21 02:27:16","description":"Judge Neil Gorsuch gave his opening statement to the Senate Judiciary Committee Monday on the first day of hearings on his nomination to the U.S. Supreme Court. In it he unpacked his views on the job of unelected judges in a democratic republic, giving his personal story and pledging to be a public servant who faithfully follows the Constitution and the laws enacted by the people’s elected representatives. | Politics","filename":"data/vaneerConsumption/JudgeNeilGorsuchPromisesSenatorsHeWillUpholdtheConstitutionasWritten.json","image_url":"https://media.breitbart.com/media/2017/03/Gorsuch-1st-Day-Alex-WongGetty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_03_20__1540922088.html","title":"Judge Neil Gorsuch Promises Senators He Will Uphold the Constitution as Written","title_page":"Judge Neil Gorsuch Promises Senators He Will Uphold the Constitution as Written | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON, DC—Judge Neil Gorsuch gave his opening statement to the Senate Judiciary Committee Monday on the first day of hearings on his nomination to the U.S. Supreme Court. In it he unpacked his views on the job of unelected judges in a democratic republic, giving his personal story and pledging to be a public servant who faithfully follows the Constitution and the laws enacted by the people’s elected representatives.\n“Judging is sometimes a lonely and hard job,” Gorsuch mused, in a wide-ranging speech that ranged from the dramatic, to the humorous, to reflections — at times showing deep passion, and on two occasions even getting emotional.\nBorn and raised in Colorado, Gorsuch walked the senators through his boyhood years, the humble circumstances and struggles of his parents and grandparents, and the lessons they taught him that molded his character and worldview. He also spoke about the Supreme Court justices who trained him early in his career, including the two he clerked for: Byron White and Anthony Kennedy.\nReflecting on the late Justice Antonin Scalia, a friend and mentor whose seat on the High Court Gorsuch would fill, the Centennial State native said he learned the lesson “that words matter, that the judge’s job is to follow the words that are in the law, not replace them with those that aren’t.”\nTurning more philosophical, he discussed another hero who occupied that same seat on the Supreme Court in the 1940s and 50s, Justice Robert Jackson. From Jackson’s writings Gorsuch learned, “When you become a judge, you fiercely defend only one client: the law.”\nReflecting on the system of government established by the Constitution, the 49-year-old Gorsuch extolled “the rule of law and the importance of an independent judiciary. How hard our forbearers worked to win these things. How easy they are to lose. How each generation must either take its turn carrying the baton, or watch it fall.”\n“Sometimes the answers we reach are not necessarily the ones we prefer,” Gorsuch commented about the work of being a federal judge. “Sometimes the answers follow us home at night, and keep us up.” That is because a federal judge must always rule based on “what the law requires,” he added.\nHowever, “for all its imperfections, I believe the rule of law in this nation truly is a wonder, and that it’s no wonder that it’s the envy of the world.”\nJudges’ robes are a reminder “of the modest station we judges are meant to occupy in our democracy. In other countries, judges wear scarlet, silk, or ermine,” Gorsuch continued. By contrast, in America’s legal system, the uniform of his profession is “honest, black polyester,” which judges buy for themselves at local stores.\nA faithful judge is one who carefully examines the legal rule that applies in a situation, impartially applies it to the facts of the case before him, and issues a judgment that follows the laws enacted by the American people’s elected leaders regardless of whether the judge likes the outcome.\n“A good judge can promise no more than that, and a good judge should guarantee no less,” he summarized. “A judge who likes every outcome he reaches is probably a pretty bad judge.”\nGorsuch closed with a promise that, if confirmed, these would be the principles of the legal philosophy he would take to the nation’s highest court.\nKen Klukowski is senior legal editor for Breitbart News. Follow him on Twitter @kenklukowski.","url":"https://www.breitbart.com/politics/2017/03/20/judge-neil-gorsuch-promises-senators-he-will-uphold-the-constitution-as-written/"}
