{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:12:41","date_modify":"2018-10-30 22:12:41","date_publish":"2015-05-28 21:19:30","description":"On May 28, Judge Frederick J. Scullin Jr. denied the District of Columbia's request for an administrative state in the ruling against the \"good reason\" provision in DC's concealed carry permitting process.","filename":"data/vaneerConsumption/JudgeDeniesStayDCForcedtoIssueConcealedPermitsNow.json","image_url":"https://media.breitbart.com/media/2015/05/concealed-carry-Chris-OchsnerAP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_28__1540937561.html","title":"Judge Denies Stay, DC 'Forced'to Issue Concealed Permits Now","title_page":"Judge Denies Stay, DC 'Forced'to Issue Concealed Permits Now | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On May 28, Judge Frederick J. Scullin Jr. denied the District of Columbia’s request for an administrative state in the ruling against the “good reason” provision in DC’s concealed carry permitting process.\nThe “good reason” requirement forced residents applying for a concealed carry permit to demonstrate a justification for wanting to carry a gun. Breitbart News previously reported that Judge Scullin ruled against the requirement on May 18, saying it “impinges on Plaintiffs’ Second Amendment right to bear arms.”\nThe administrative stay would have extended the effective date for Scullin’s May 18 ruling, giving the city more time to evaluate options. The denial of this stay means DC must immediately begin issuing permits without a “good reason” requirement.\nThe Second Amendment Foundation (SAF) represented the plaintiffs in the case.\nAccording to PR Newswire, DC is still pursuing “a stay pending appeal,” which will suspend the implementation of Scullin’s ruling until the appeal has run its course. In light of this, Scullin set the following dates for SAF and the DC: “By June 22, SAF and its co-plaintiffs must file papers opposing the city’s stay pending appeal request, and the city must respond by June 26.”\nSAF founder and executive vice president Alan M. Gottlieb responded to the denial of administrative stay:\nThe Second Amendment Foundation is pleased that the court ruled immediately against the city and has forced them to start issuing carry permits,” Gottlieb said. “By now they should realize that when we say we will do everything in our legal power to force them to recognize that people have Second Amendment rights we mean it.\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/05/28/judge-denies-stay-dc-forcedto-issue-concealed-permits-now/"}
