{"authors":[],"date_download":"2018-10-22 21:47:14","date_modify":"2018-10-22 21:47:14","date_publish":"2014-05-08 12:49:50","description":"A federal judge rejected requests from the U.S. Election Commission to put on hold changes to voter forms requiring proof of citizenship in Kansas, Arizona.","filename":"data/vaneerConsumption/JudgeRefusestoHaltOrderOverKansasArizonaVoterCitizenship.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/428601/voters-kansas-sl-0852_1f5d02c7e6ae7173c05212d3bfef782b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_judge-refuses-halt-order-over-kansas-arizona-voter-citizenship-n100196_1540244834.html","title":"Judge Refuses to Halt Order Over Kansas, Arizona Voter Citizenship","title_page":"Judge Refuses to Halt Order Over Kansas, Arizona Voter Citizenship","title_rss":"NULL","source_domain":"nbcnews.com","text":"Voters in Kansas and Arizona will have to provide proof of their U.S. citizenship when registering to vote using the federal form even as a U.S. agency appeals a federal judge's order that helps those states enforce their voter registration requirements, according to a ruling on Wednesday.\nU.S. District Eric Melgren rejected the requests from the U.S. Election Assistance Commission and voting rights groups to put his earlier ruling on hold while the case goes to the 10th U.S. Circuit Court of Appeals. Melgren ruled on March 19 that the commission must immediately modify a national voter registration form to add special instructions for Arizona and Kansas residents about those states' proof-of-citizenship requirements.\nThe commission contends that the added documentation burdens result in an overall decrease in registration of eligible citizens, undermining the purpose of the National Voter Registration Act. The states argue the requirement protects the integrity of their elections by ensuring noncitizens aren't voting.\nMelgren ordered the commission to carry out \"forthwith without further delay\" his March 19 directive. The judge wrote that the commission and its supporters had not shown that the public interest is best served by suspending his ruling.\nThe election commission had argued that it is likely to succeed on appeal because Melgren's order conflicts with a U.S. Supreme Court decision last year, among other things.\nArizona enacted its proof-of-citizenship requirement by voter initiative in 2004, and Alabama, Georgia and Kansas followed with similar laws. Most voters in Arizona and Kansas register with state forms, but their officials said the availability of the federal form created a loophole in enforcement of proof-of-citizenship requirements.\nSome 17,604 Kansans now have their voter registrations on hold as a result of the requirement.\n--Associated Press","url":"https://www.nbcnews.com/news/latino/judge-refuses-halt-order-over-kansas-arizona-voter-citizenship-n100196"}
