{"authors":["Katherine Seligman","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:29:17","date_modify":"2018-10-30 22:29:17","date_publish":"2016-08-25 12:24:02","description":"The reaction has been swift, viral and unrelenting. Shortly after Santa Clara County Judge Aaron Persky sentenced ex-Stanford University swimmer Brock","filename":"data/vaneerConsumption/JudgingthejudgesRecallsmaybecomeeasierbutisthatbetter.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/JUDGES_Recall_protest-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938557.html","title":"Judging the judges: Recalls may become easier, but is that better?","title_page":"Judging the judges: Recalls may become easier, but is that better? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The reaction has been swift, viral and unrelenting. Shortly after Santa Clara County Judge Aaron Persky sentenced ex-Stanford University swimmer Brock Turner to only six months in jail for sexually assaulting an unconscious woman, the victim’s emotional 12-page court statement drew 13 million readers online, and a cyber-petition demanding the judge’s removal garnered well over a million signatures. By Thursday the judge himself had been, at his own request, removed from hearing criminal cases altogether.\nDespite the judge’s reassignment to civil court, announced in a statement by the county’s presiding judge, a recall movement is still moving forward. “He can still transfer back to hearing criminal cases any time he chooses,” said Stanford law professor Michele Dauber, a friend of the victim’s family who is organizing the recall. “Furthermore, judicial bias is just as serious regardless of whether a case is civil or criminal. Many issues affecting women are heard in civil court every day.”\nSuch judicial recall is rare nationwide, and by design, California’s system makes it difficult. But amid a constellation of factors, some legal experts believe we could be plunging into a new era in which judges increasingly fear losing their jobs over unpopular decisions—and that, in turn, may influence how they behave on the bench.\nEvidence suggests that judges tend to hand down stiffer sentences shortly before they have to face the voters in retention elections. And although there is little research on the effects of judicial recalls because there have been so few of them, growing mistrust in the justice system and the rise of social media could change that.\n“People are less inclined to be deferential to their public institutions than was once the case,” said Kevin Cole, a professor at University of San Diego School of Law. “And it’s easier for criticism to spread. Now all you need is an internet connection.”\nWhen California voters initially gave themselves the ability to oust judges by recall in 1911, it was seen as a tool to protect the judiciary from corporate influence. Progressives at the time argued that in a true democracy, judges—and all elected officials—should be held accountable to the will of the people. Interestingly, over the past century it has been against male judges whose rulings and sentences were viewed as dismissive of the concerns of women.\nToday, many legal scholars are warning of dangers inherent in politicizing the courts: 46 California law professors have signed a letter that, while criticizing Brock Turner’s sentence, warns that a recall poses “grave collateral damage” to justice in California. “Naked political pressure of this kind risks undermining the very foundation of dispassionate, independent judgment upon which all criminal convictions and sentences depend for their legitimacy…” they wrote. “If disappointed litigants can influence the outcomes of future cases by unseating judges who rule against their interests, the administration of justice quickly falls into the hands of the wealthy, special interest groups, and anyone who wants to launch a political action committee on the heels of media coverage of a controversial case.”\nUC Irvine law school dean Erwin Chemerinsky, who joined other law professors in signing the anti-recall letter, wrote that recall efforts mostly target judges seen as rendering lenient sentences. He argued that he has represented defendants given a life sentence for stealing $153 of videotapes and 25 years to life for stealing an umbrella and two bottles of liquor worth $49, but can’t remember a recall ever mounted against a judge for imposing “an outrageously long sentence.” Another online petition, this one started by public defenders in support of Persky, cautions that his removal would “deter other judges from extending mercy….We fear that this shift will disproportionately impact the underprivileged and minorities in our communities and perpetuate mass incarceration.”\nBoth Persky’s sentencing of Turner and the impassioned reaction to it are extraordinary. The Committee to Recall Judge Persky, founded by Dauber and aiming to raise $1 million for a political action committee, is getting help from a co-founder of Electing Women Silicon Valley and experienced social media consultants. The committee and the invitation-only women’s group Grlcvlt already have hosted a star-studded benefit in Brooklyn.\nDauber has said that Persky needs to be removed not merely for the sentence he handed down to Turner, but because he “exhibits a clear pattern of bias against sexual violence and violence against women.”\n“We think,” she said, “voters will agree.”\nCalifornia, of course, has a body ready-made to respond to the voters: the Legislature. Inspired by this case, lawmakers just sent to the governor a bill to broaden the legal definition of rape, and has advanced a bill designed to establish mandatory prison time for sex crimes against victims incapable of giving consent.\nNor is the judicial branch immune to political blowback. Just a few days ago, Persky recused himself from a case in which he had previously indicated his willingness to reduce a plumber’s felony conviction for child pornography possession down to a misdemeanor. By week’s end, he had opted to give up criminal cases entirely—a move that could take some of the momentum out of the recall drive.\nHe is scheduled to stop hearing criminal cases in early September, around the time Turner could go free.\n“While I firmly believe in Judge Persky’s ability to serve in his current assignment, he has requested to be assigned to the civil division, in which he previously served,” Presiding Judge Risë Jones Pichon said in a statement . “Judge Persky believes the change will aid the public and the court by reducing the distractions that threaten to interfere with his ability to effectively discharge the duties of his current criminal assignment.”\nAnd other judges feel a chill as well—which at least one Santa Clara County public defender suggests is already happening. “I am really fearful that the recall effort will impact the clients I represent,” said public defender Sajid Khan. He has not gone before Persky but says he has already encountered a case in which another county judge offered to remove a strike for a defendant in exchange for a guilty plea—but rescinded the offer after the Turner case. “It seemed more than a coincidence,” he said. “I was left to wonder if his change in course was due to fear of backlash or a subconscious concern about what Judge Persky has to go through.”\nStudies on retention votes—where judges face a vote to keep their seats—do show evidence that judges are more likely to sentence defendants to more prison time and uphold death penalty sentences in election years. One 2012 study by researchers at Loyola Law School and UC-Berkeley’s Haas School of Business found that judges in Washington state handed down longer sentences for serious crimes at the end of their election cycle.\n“The question is, might this be harkening a new emphasis on judicial recall and what does this mean for judges who are hearing cases that are controversial?” said Alicia Bannon, a senior counsel at the Brennan Center for Justice at New York University School of Law, and author of a report warning of politicized courtrooms. “In the end, judges are often going to make decisions that aren’t popular…The facts are troubling in this particular case, but raise broader questions about the integrity of our court system.”\nAnd judges do feel the pressure. The late California Supreme Court Justice Otto Kaus once likened deciding controversial cases before elections to “finding a crocodile in your bathtub when you go in to shave in the morning. You know it’s there, and you try not to think about it, but it’s hard to think of much else while you’re shaving.‘’\n“We’re only human,” former Iowa Supreme Court Judge Michael Streit, told a forum at Drake University a year after he and two other judges were blocked from retention following a decision to legalize same sex marriage. But regardless of pressure, he said, judges must consciously avoid making decisions based on politics.\nStill, says Cathal Conneely, a public information officer for the Judicial Council of California, judges are aware of the balancing act they face every day on every case. “It’s assumed that comes with the judicial temperament,” he said, adding that judges—who come to the bench with at least 10 years of legal experience—have “robust” guidance, education, supervision and support when needed.\nCalifornia is one of only eight states to allow voters to remove a judge, and one of even fewer where a judge can be tossed out without having clearly broken the law. The independent California Commission on Judicial Performance investigates complaints of misconduct where judges may have broken the law, which can result in removal or sanctions.\nJudging judges—by the numbers\nThe state’s 1,535 superior court judges appear on the ballot in a nonpartisan election every six years, facing potential ouster only if an opponent challenges them. Only two recall efforts have worked, in 1913 and 1932.\nAs for appointed California Supreme Court justices, there have been 27 attempts to remove those. Former Chief Justice Rose Bird and Justices Joseph Grodin and Cruz Reynoso were rejected in 1986 by voters angered over their resistance to capital punishment. Supreme Court judges face simple retention votes—where voters are asked to mark yes or no on their ballots.\n“California has two things that are relatively unique,” said William Raftery, a senior analyst for the National Center for State Courts. “You have more judges there than just about anywhere in the United States and you do have recall. Just looking broadly in the United States, recall very, very, very rarely happens, whether it’s a governor or a judge.”\nThe last recalled judge was County Judge Arnie Simonson, ousted by Wisconsin voters in 1977—after he had commented during a juvenile sex assault hearing that “given the way women dress, rape is a normal reaction.” He sentenced a teen convicted of attacking a 15-year-old girl in a school stairway to a year of home supervision.\nRecalls are rare primarily because they are expensive and time consuming. Proponents of recalling Judge Persky must wait until April to begin gathering 80,000 signatures of Santa Clara County voters to guarantee the measure will make the ballot. That means keeping the public engaged until an off-year election in November 2017, and raising money for what will be a long campaign.\nOften recalls simply sputter out. One case in point was an effort to recall Orange County Superior Court Judge M. Marc Kelly last year. The judge faced outrage after he sentenced a man convicted of sodomizing a 3-year-old girl to 10 years in prison, the mandatory minimum. Tens of thousands signed a Change.org petition but not enough people added their names to an official petition that would put the recall on the ballot.\nWhile supporters of the Persky recall have to work to keep momentum going, they have a responsive public. A Gallup poll last year found a historically low level of confidence in government, with fewer than a third professing faith in the criminal justice system. A recent survey found that two-thirds of voters in Santa Clara County support recalling Persky—and among younger women, that support was by a 4-to-1 margin.\nStrong support for recalling Judge Persky—especially among younger voters\nPerhaps the backlash is unsurprising, given that the sentence came amid widespread concern about a reported epidemic of sexual assaults on campuses nationwide. Turner was a student at an elite university, a swimmer with Olympic aspirations caught with an unresponsive woman near a dumpster outside a frat party. The woman, who didn’t remember the assault, suffered vaginal injuries from a foreign object. Turner was prosecuted and convicted of three felonies.\nThe judge handed down the minimum sentence after considering the “severe impact” of a long sentence, the mitigating factor of alcohol, and the fact that Turner will have to register as a sex offender. Statements from Turner’s father, describing his son’s loss of appetite and how his life had been ruined over “20 minutes of action”—which Dauber tweeted out—further inflamed public reaction.\nThe coverage was ubiquitous: Cosmopolitan, the New Yorker and everything in between. The petition on Change.org calling for impeachment—not related to a recall—is still racking up signatures. The recall effort’s web site has posted endorsements and stories about sentences Persky has handed down in other sex assault cases, including one where he sentenced a man to less than a week in jail for possession of child abuse images and another for “weekend jail” after being convicted of felony battery in a domestic violence case.\nCole, from the University of San Diego, hopes voters understand what’s at stake. The issues—involving mandated minimum sentencing and the need to evaluate each defendant individually—go to the heart of how a judge deliberates and are complex.\n“These arguments are too cerebral for Facebook,” he said.\nBut there was no Facebook in the few cases where voters decided to recall judges. Why did those succeed?\nWhat they shared, according to Stanford history professor Estelle Freedman, was outrage that sparked the attention of women’s groups. The earlier recalls—and the effort building against Persky—occurred amid a backdrop of “perceived lenience toward rape at a time of political mobilization by feminists,” she noted in a New York Times op-ed headlined “Why Feminists Take on Judges Over Rape”. And in the case against Judge Simonson in Wisconsin, the National Organization for Women organized meetings and “feminist networks in the area led the response.”\nIn 1913, when San Francisco Police Court Judge Charles Weller reduced bail for a man charged with felony assault of a 16-year old girl, women’s clubs took action, as reported at the time by the San Francisco Call. The vice president of the Oceanside Women’s Club, who instigated the recall, said that “no power on earth could prevent the good women of San Francisco from exercising their rights of franchise in so noble a cause,” the paper reported.\nThe Oceanside Women’s Club official and her allies went door-to-door and collected signatures. “The men have failed to force good government,” she told the Call. “The women will.”\nKatherine Seligman is a freelance journalist and CALmatters contributor based in San Francisco.","url":"https://calmatters.org/articles/judging-the-judges-recalls-may-become-easier-but-is-that-better/"}
