{"authors":[],"date_download":"2018-10-22 22:09:19","date_modify":"2018-10-22 22:09:19","date_publish":"2014-05-09 03:13:03","description":"A federal judge lifts her injunction barring the main contractor for U.S. Air Force national security launches from buying Russian rocket engines.","filename":"data/vaneerConsumption/JudgeLiftsBanonUSPurchaseofRussianRocketEngines.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/430896/140508-atlas_7fcb6860c33bc20f0e5f8fa1252926d7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_judge-lifts-ban-u-s-purchase-russian-rocket-engines-n101026_1540246159.html","title":"Judge Lifts Ban on U.S. Purchase of Russian Rocket Engines","title_page":"Judge Lifts Ban on U.S. Purchase of Russian Rocket Engines","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA federal judge on Thursday lifted her injunction barring the main contractor for U.S. Air Force national security launches from buying Russian rocket engines, after U.S. officials assured her that the purchases didn't violate sanctions against Russian officials.\nJudge Susan Braden of the U.S. Court of Federal Claims issued the injunction a week ago after questions were raised about an Air Force deal to buy billions of dollars' worth of rocket hardware from United Launch Alliance for future launches. United Launch Alliance's main competitor, SpaceX, challenged the deal in Braden's court.\nIn its lawsuit, SpaceX noted that United Launch Alliance's Atlas 5 rocket uses RD-180 engines purchased from a Russian state-controlled company called NPO Energomash. Because Russian Deputy Prime Minister Dmitry Rogozin is in charge of the country's space effort, SpaceX questioned whether the engine purchases violated U.S. sanctions that were levied against Rogozin and other Russian officials in the wake of the Ukraine crisis.","url":"https://www.nbcnews.com/science/space/judge-lifts-ban-u-s-purchase-russian-rocket-engines-n101026"}
