{"authors":["Ollie Gillman","Martin Gould In Fort Worth","Texas","For Dailymail.Com"],"date_download":"2018-10-23 02:27:14","date_modify":"2018-10-23 02:27:14","date_publish":"2016-01-29 17:00:10","description":"'Affluenza' teen Ethan Couch will be held in juvenile detention in Texas, a judge has ruled, but he could be moved to an adult prison before the weekend.","filename":"data/vaneerConsumption/JudgerulesaffluenzateenEthanCouchwillbeheldinjuvenileprison.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACE16200000578-0-image-a-105_1454006304344.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423087_Affluenza-teen-Ethan-Couch-held-juvenile-detention-three-weeks-returning-U-S-face-justice_1540261634.html","title":"Judge rules 'affluenza' teen Ethan Couch will be held in juvenile prison","title_page":"Judge rules 'affluenza' teen Ethan Couch will be held in juvenile prison | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'Affluenza' teen Ethan Couch will be held in juvenile detention, a judge has ruled, but he could be moved to an adult prison before the weekend.\nCouch, 18, arrived back in the U.S. yesterday after being caught in Mexico a month ago following a stint on the run with his mother.\nHe is being held at a juvenile detention center and a judge ruled today that he will stay there until another hearing in three weeks' time, which will decide whether the justice system treats him as an adult or a child.\nIf he is regarded as an adult, Couch could be jailed for 120 days if he is found to have breached his probation by playing beer pong at a party.\nIf he is treated as a child then he could be held in juvenile detention until his 19th birthday in April, when he would be eligible for parole.\nThe notorious teenager killed four people in a DUI crash in 2013 but was not jailed after a court ruled he did not understand the difference between right and wrong because of his privileged background.\nThe families of those killed in the horrific smash were in court today and came face-to-face with their loved ones' killer.\nScroll down for video\n'Affluenza' teenager Ethan Couch (pictured yesterday at Dallas Fort Worth Airport) has appeared in court to decide whether he will be held in an adult jail ahead of future proceedings for allegedly violating his probation\n'Affluenza' teenager Ethan Couch (pictured in a Mexican government vehicle on the way to Mexico City Airport yesterday) was put on a plane to Dallas, Texas, by Mexican immigration officials\nFour apparently unarmed agents were seen escorting Couch onto a plane yesterday, which was headed for Texas\nThe hearing today was to decide where Couch was held, if at all, between now and another hearing on February 19.\nThe second court appearance will decide whether his case is transferred to the adult justice system. If so, another breach of probation could lead to Couch facing 40 years in prison - 10 years for each of the people he killed in 2013.\nProsecutor Richard Alpert said at today's hearing that there was 'serious doubt' over Ethan Couch would hang around if he was freed on bond until February, CBS 11 reported.\nCouch was in the courtroom for the hearing and was wearing a khaki short-sleeved prison uniform and a white t-shirt. His blonde roots were not showing through his dyed-brown hair.\nBefore the case began, 14 family members and friends of the victims filed into court to sit in the front row. A bailiff provided tissues for them.\nA prosecution officer said Couch's mother Tonya had indicated she would attend the brief hearing, but she did not turn up. His father Fred was also a no-show.\nJudge Tim Menikos ruled Couch should stay in juvenile detention for the time being but said that he could yet send him to adult prison later today.\nSpeaking after the hearing, prosecutors said they wanted to see Couch sent to adult prison. Defense attorneys said they would not fight any attempts to move him there.\n'Ethan Couch has never apologized to the victims. That has been the most troubling thing through all of this,' prosecutors said outside court, according to NBC 5.\nA lawyer for Couch said he feels remorse for what he has done and will abide by the terms of his probation. 'Of course Ethan is sorry,' the lawyer, Scott Brown, said.\nCouch returned to Texas yesterday after being marched into the coach section of an AeroMexico commercial flight from Mexico City to Dallas Fort Worth.\nUniformed Mexican immigration agents put Couch (pictured at Mexico City Airport yesterday), 18, aboard a commercial flight to Dallas, Texas, on Thursday morning\nCuffed: Couch and his mother, Tonya, were detained in the resort of Puerto Vallarta in December\nCouch (pictured on Thursday) was taken to Mexico City Airport from an immigration holding center where he had been held\nAFFLUENZA TEEN'S LEGAL TIMELINE February 19, 2013: Ethan Couch, then 15, is caught in a truck with a naked, unconscious 14-year-old girl. He is sentenced to probation, an alcohol awareness course and community service. June 15, 2013: Couch kills four people in a 70mph DUI crash in Texas. He was more than three times over the blood alcohol limit. December 10, 2013: A judge spares Couch jail and gives him 10 years of probation following his 'affluenza' defense. December 3, 2015: A video emerges appearing to show Couch playing beer pong, which would violate his probation. December 15, 2015: An arrest warrant is issued for Couch after he and his mother, Tonya, go missing. December 28, 2015: Couch and his mother are arrested in Puerto Vallarta, Mexico. December 30, 2015: Tonya Couch is deported to the United States. January 28, 2016: Ethan Couch is deported to the United States.\nHe was escorted through the terminal by U.S. immigration officials and driven to the detention center he is now being held at. He was earlier seen wearing a blue, camouflage-print hoodie as Mexican authorities put him on the plane.\nThe teenager went on the run in Mexico in December last year after allegedly breaching his probation by playing beer pong at a party.\nCouch and his mother, Tonya, were arrested a month ago in the Mexican Puerto Vallarta resort. She was quickly deported but he had fought against proceedings until a few days ago.\nAttorney Fernando Benitez said on Monday that Couch had considered his legal options before opting to return to America where he is facing up to 120 days in jail.\nMeanwhile, Tonya Couch could be jailed for up to 10 years if she is found guilty of helping her son flee the authorities.\nTarrant County Sheriff Dee Anderson said Couch was 'calm' after arriving at the juvenile jail yesterday and had asked for a meal.\n'We've reached a great milestone,' Anderson said. 'This is a day we've looked forward to, when we have them both here and back under the jurisdiction here. We're hoping that the day comes for justice for the families and the four victims that were killed.'\nCouch was first arrested in 2013 after he killed four people while behind the wheel of his father's truck, despite being three times over the drink driving limit and too young to drive.\nBreanna Mitchell, 18, had broken down at the side of a highway in Texas and was trying to fix her vehicle alongside Hollie Boyles and her daughter Shelby, who lived nearby, and youth minister Brian Jennings, who had also stopped to help.\nCouch left the road while traveling at 70mph and hit the group, killing all of them, and paralyzing friend Sergio Molina from the neck down after he was thrown clear of the truck.\nMother Tonya Couch, who fled to Mexico with her son, was released on bail after she decided not to fight deportation and was transferred back to Texas\nCouch was sentenced to 10 years of probation which bars him from drinking or driving after he killed four people while joyriding his father's truck (wreckage pictured) back in 2013\nCouch, who gained notoriety after he was given probation for killing four people in a DUI car wreck in 2013 (pictured in December 2013), had been fighting deportation back to his home state of Texas, but dropped that appeal on Monday\nAt his trial, Couch's defense claimed he had 'affluenza', meaning he had been given such a privileged upbringing he was incapable of telling right from wrong.\nThe 'condition' is not recognized by the American Psychiatric Association, and drew widespread ridicule and outrage at the time.\nHowever, Judge Jean Hudson Boyd accepted the defense and sentenced Couch to 10 years of probation, with conditions which prohibited him from driving or drinking alcohol.\nIn December last year Couch was apparently filmed playing beer pong while at a party, in a likely violation of that order.\nTexas authorities launched an investigation and tried to contact Couch and his mother, Tonya, before revealing they had no idea where the pair were.\nThey were eventually traced to the resort of Puerto Vallarta in Mexico, where they were arrested on December 28.\nTonya did not attempt to fight deportation and within days was back in Texas where she posted bail of $75,000 and is now awaiting trial for hindering the apprehension of a felon.\nMeanwhile, Couch launched an appeal against deportation and has been held in Mexico until today.\nHe dropped that appeal on Monday and his attorney, Scott Brown, hinted that Couch could have been taken to Mexico against his will.\nCouch did not appear to be being held unlawfully when he was captured and was caught after using a credit card to order pizza.\nIt later emerged that he had been to a strip club while he was on the run with his mother and spent $2,000 on a single night.\nThe crash killed Breanna Mitchell, 24 (left), a chef who had stopped her car because of a blown out tire, and pastor Brian Jennings (right), 41, who had stopped to help her","url":"https://www.dailymail.co.uk/news/article-3423087/Affluenza-teen-Ethan-Couch-held-juvenile-detention-three-weeks-returning-U-S-face-justice.html"}
