{"authors":["Associated Press"],"date_download":"2018-10-22 20:03:19","date_modify":"2018-10-22 20:03:19","date_publish":"2016-01-29 00:10:19","description":"NEW ORLEANS (AP) — A 26-year-old man accused of shooting a deputy during a federal drug raid at his home will remain in custody after a federal judge Thursda...","filename":"data/vaneerConsumption/Judgekeepssuspectindeputysshootingincustody.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421913_Judge-keeps-suspect-deputys-shooting-custody_1540238599.html","title":"Judge keeps suspect in deputy's shooting in custody","title_page":"Judge keeps suspect in deputy's shooting in custody | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Judge keeps suspect in deputy's shooting in custody\nNEW ORLEANS (AP) — A 26-year-old man accused of shooting a deputy during a federal drug raid at his home will remain in custody after a federal judge Thursday denied his request to be released from custody on bond.\nAt a hearing, U.S. Magistrate Judge Sally Shushan decided to keep Jarvis Hardy in custody, saying he posed too much of a risk. He is charged by federal prosecutors with attempted murder and attempted murder of a federal officer.\nHardy's lawyer, public defender Valerie Jusselin, argued he posed no risk because he has no prior convictions and a steady work history.\nHardy, who appeared in court shackled and in a red jumpsuit, claims he thought he was being robbed when a team of officers raided his home.\nHe is accused of shooting Stephen Arnold, a 35-year-old Jefferson Parish sheriff's deputy, in the neck and torso. Arnold is in critical condition at the University Medical Center in New Orleans.\nThe raid was part of several federal sweeps made Tuesday morning. The Drug Enforcement Administration said the raids were part of a seven-month operation to rid New Orleans of drugs, heroin and violent crime.\nJusselin tried to make a case that Hardy posed no flight risk because he has lived most of his life in New Orleans and had not been in trouble with the law before.\nFBI Special Agent Christopher Bauer testified that Hardy told investigators he was a drug dealer and that he believed he was being robbed. He also testified that officers repeatedly announced who they were after they broke into Hardy's home at about 6 a.m. They first knocked, and then broke in, he said. After the shooting, Bauer said investigators found crack cocaine in Hardy's home.\nThe FBI said Hardy's mother, Gail Hardy, told investigators she went into her son's bedroom and told him police were raiding the home. Jusselin tried to undermine her statements, saying Gail Hardy had drug convictions in her past.","url":"https://www.dailymail.co.uk/wires/ap/article-3421913/Judge-keeps-suspect-deputys-shooting-custody.html"}
