{"authors":[],"date_download":"2018-10-22 21:01:19","date_modify":"2018-10-22 21:01:19","date_publish":"2014-05-05 15:38:52","description":"Cornealious \"Mike\" Anderson's family wept when the court granted his request for release nine months after he began serving a sentence he got in 2000.","filename":"data/vaneerConsumption/JudgeRules13YearSentenceManNeverServedisComplete.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/420931/140505-anderson-jhc-1255_5bab9e383f61a81ef7168cd470190255.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_judge-rules-13-year-sentence-man-never-served-complete-n97301_1540242079.html","title":"Judge Rules 13-Year Sentence Man Never Served is Complete","title_page":"Judge Rules 13-Year Sentence Man Never Served is Complete","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Missouri man who was locked up after officials realized he never served a 13-year sentence is being released from prison by a judge who decided he turned his life around when he should have been doing time.\nCornealious \"Mike\" Anderson's family began crying when the court granted his request for release nine months after he began serving the sentence he was given in 2000.\nJudge Terry Lynn Brown lauded Anderson's \"exemplary\" behavior during his 13 years of freedom before the arrest. \"You've been a good father. You've been a good husband. You've been a good taxpaying citizen of the state of Missouri.\n\"That leads me to believe that you are a good man and a changed man.\"\nAnderson walked out of the courtroom with his wife and 3-year-old daughter on one arm and his mom on the other. Before being driven away to a freedom celebration at an undisclosed spot, Anderson told reporters he was \"very happy. My faith has always been in God. I'm just so thankful. Thank God for everything.\"\nAnderson was convicted of the 1999 armed robbery of a Burger King manager making a bank deposit but was out on bail while he appealed.\nHis appeals were shot down, but because of what the state has labeled a clerical error, he never went to prison.\nInstead, he became a married father of four, a businessman and a youth football coach — an upstanding life interrupted when state officials realize the mistake and put him behind bars.\nAnderson noted he had made no effort to conceal his identity while he was free. Tens of thousands of people signed a petition on Change.org urging his release.\nMissouri Attorney General Chris Koster said in a statement that the outcome was \"appropriate.\"\n\"From the outset, I have proposed a solution that balances the seriousness of Mr. Anderson's crime with the mistake made by the criminal justice system and Mr. Anderson's lack of a criminal record over the past 13 years,\" he said.\n\"Today's outcome appears to appropriately balance the facts as we understand them.\"\n— Michelle Hofland and Tracy Connor\nThe Associated Press contributed.","url":"https://www.nbcnews.com/news/us-news/judge-rules-13-year-sentence-man-never-served-complete-n97301"}
