{"authors":["Inderdeep Bains For The Daily Mail","Lucy Crossley For Mailonline"],"date_download":"2018-10-22 22:55:56","date_modify":"2018-10-22 22:55:56","date_publish":"2016-01-28 11:28:19","description":"Primary school teacher Frances Cappuccini, 30, died of a heart attack after an operation to stop heavy blood loss after she gave birth by C-section at Tunbridge Wells Hospital, Kent, in 2012.","filename":"data/vaneerConsumption/JudgeordersjurytofindNHShospitalNOTGUILTYoverFrancesCappuccinisdeath.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAF8E600000578-0-image-a-42_1453990988159.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420782_Judge-orders-jury-hospital-doctor-NOT-GUILTY-death-teacher_1540248956.html","title":"Judge orders jury to find NHS hospital NOT GUILTY over Frances Cappuccini’s death","title_page":"Judge orders jury to find NHS hospital NOT GUILTY over Frances Cappuccini’s death | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The husband of a healthy young mother who died in the care of hospital staff only hours after giving birth was left without justice last night after the collapse of a landmark trial.\nBoth consultant anaesthetist Dr Errol Cornish and the health trust he worked for were on trial over the death of primary school teacher Frances Cappuccini at Tunbridge Wells Hospital in Kent.\nThey were accused of failing the 30-year-old who never woke up from an emergency operation following the birth of her second son Giacomo by caesarean section in 2012.\nPrimary school teacher Frances Cappuccini (left) died at Tunbridge Wells Hospital, Kent, in 2012. Dr Errol Cornish (pictured leaving court today, right), a consultant anaesthetist, was today cleared of gross negligence manslaughter\nBut a High Court judge instructed the jury at Inner London Crown Court to acquit both of unlawfully killing the mother-of-two after ruling that they had no case to answer.\nHe said there was ‘no question’ that Mrs Cappuccini should not have died, praised her family’s dignity and said it was inevitable they would want to hold someone to account.\nBut, after two weeks of evidence, he outlined a series of flaws in the prosecution case.\nIt means the young mother’s husband Tom is still waiting for answers about who is to blame for the death of his wife more than three years after he lost her. Mr Cappuccini, 35, has been left to raise their two boys – Giacomo, three, and Luca, five, on his own.\nHe had turned up for each day of the trial and at times wept as the jury heard about the death of his beloved wife.\nAfter the case was thrown out by the judge on Wednesday, he left visibly upset. He was believed to be too devastated to return yesterday to hear the jury formally hand down the verdict clearing Dr Cornish and the Trust.\nA second anaesthetist, Dr Nadeem Azeez, would have been charged but fled to Pakistan before he could be arrested. Kent police have issued an arrest warrant but Britain has no extradition deal with the country.\nFrances Cappuccini, 30, known affectionately as Mrs Coffee to her pupils, died hours after giving birth\nMrs Cappuccini left behind her husband Tom (pictured) and their two sons Giacomo, two, and Luca, five. Mr Cappuccini had attended court throughout the trial but was not present when the verdicts were read out\nThe Crown Prosecution Service is now likely to face a legal bill of hundreds of thousands of pounds after defence lawyers indicated they may seek to recover costs.\nThe death of Mrs Cappuccini – known affectionately as Mrs Coffee by her pupils – came just hours after the birth of her second son by caesarean section at Tunbridge Wells hospital in Pembury on October 9, 2012.\nAfter a lengthy investigation, Dr Cornish was charged with gross negligence manslaughter and Maidstone and Tunbridge Wells NHS Trust with corporate manslaughter – the first health trust to be charged with such an offence. Dr Azeez would have been charged had he been in the country.\nDr Cornish's junior colleague, anaesthetist, Dr Nadeem Azeez, 53, (pictured) was also accused of gross negligence manslaughter, but did not face a trial because he had returned to his native Pakistan\nThe trial began two weeks ago, but after adjourning for a day and a half this week, Mr Justice Peter Coulson allowed applications from both defence counsels to dismiss the case over a lack of evidence.\nHe told Inner London Crown Court: ‘I’m firmly in the view that it would be unsafe and unfair to everyone including the family of Mrs Cappuccini to leave this case to the jury.’ He said the prosecution had not presented a credible case to show Dr Cornish was negligent, adding: ‘It is as far removed from a gross negligence manslaughter case as it is possible to be.’\nHowever, he acknowledged: ‘There can be no question that Mrs Cappuccini should not have died. It is inevitable that her family want to know why it was that she did die, and they want someone to be held accountable.\n‘They have shown restraint and dignity. But, as I am sure they understand, this trial is not a public inquiry into her death.’\nDr Cornish and Dr Azeez are under investigation by the GMC and could still be struck off. The case will also be referred back to the coroner.\nThe prosecution had claimed that both Dr Azeez, 53, and Dr Cornish, 68, failed to take the most basic steps to save the life of Mrs Cappuccini after she was unnecessarily anaesthetised, and that her death had been ‘wholly avoidable’.\nIt was claimed that the men should have re-inserted a breathing tube and placed Mrs Cappuccini on a ventilator immediately when it became clear she was struggling to breathe.\nBut the judge pointed out that both doctors had followed the Trust’s guidance when they used a face mask and air bag instead.\nThe Trust had been accused of failing to ensure Dr Cornish and Dr Azeez – who received his basic qualifications in Lahore – were properly qualified and trained.\nMrs Cappuccini suffered heavy blood loss following the birth of Giacomo who was born by Caesarean section at Tunbridge Wells Hospital in Kent (pictured)\nEVENTS WHICH LED TO DEATH OF TRAGIC TEACHER FRANCES CAPPUCCINI Mrs Cappuccini suffered heavy blood loss following the birth of Giacomo who was born by Caesarean section at the hospital in Kent October 8 8.30pm: Mrs Cappuccini's waters break and she is admitted to Tunbridge Wells Hospital. She is monitored overnight - the birth of her first son, Luca, by this time aged three, had been complicated and required a Caesarean section. October 9 8.25am: Mrs Cappuccini undergoes a Caesarean section and at 8.28am Giacomo is born. 9.13am: Mrs Cappuccini returns to the labour ward from the operating theatre. 11.35am: Mrs Cappuccini returns to the operating theatre for surgery to remove a remaining part of the placenta after suffering postpartum haemorrhage. She is given a general anaesthetic and is 'intubated' - a tube is inserted into her throat and her breathing is controlled by a ventilator. 12.20pm: The surgery is successful and the surgical team leave her with Dr Nadeem Azeez and theatre technicians to allow her to wake up. 12.30pm: Dr Azeez records that Mrs Cappuccini has started to open her eyes and he 'extubates' her - he removes the endotracheal tube (ETT) helping her breathe. He then 'bags' her, helping her breathe with a face mask and hand-operated oxygen pump. 12.35pm: Dr Azeez administers a second dose of reversal agents - drugs intended to lift the paralysis Mrs Cappuccini had been under. 12.45pm: Dr Gabriella Gray, a registrar in obstetrics, comes into theatre and asks Dr Azeez if everything is OK while he hand-ventilates. He nods and she leaves. Shortly before 1pm: Rebecca Shaw, the operating department practitioner, asks a colleague in a neighbouring operating theatre to call anaesthetist Dr Errol Cornish in to help Dr Azeez. 1pm: Dr Cornish, who had been caring for another woman having a Caesarean section, comes to help Dr Azeez. The prosecution and defence clashed over how long he stayed but Mr Justice Coulson ruled that he stayed for at most 40 minutes. 1.20pm: Dr Gray and another consultant obstetrician return to the operating theatre, having been told there may be a problem. 1.20pm-1.30pm approximately: Dr Raymond Chung, the on-call emergency consultant anaesthetist, speaks to the operating theatre and tells someone he believes is Dr Azeez to reintubate Mrs Cappuccini. 1.30pm-1.35pm: Consultant anaesthetist Dr Garth Sommerville arrives and from the door tells Dr Azeez to insert a laryngeal mask - a half-way measure less invasive than reintubation. He returns two minutes later after scrubbing up and finds it has not been done so does it himself. 1.30pm-1.40pm: Dr Chung arrives and finds Mrs Cappuccini has not yet been intubated. Dr Azeez then does so but her vital signs do not improve. Dr Chung told the court he may have passed the tube into her oesophagus instead of her windpipe and he later successfully did it himself. 1.40pm approximately: Dr Cornish leaves the operating theatre, leaving Mrs Cappuccini in the care of Dr Sommerville. 2pm approximately: Mrs Cappuccini is moved to 'theatre recovery' for further care as there are no spare beds in the hospital's intensive care unit. 2.10pm: Mrs Cappuccini is reintubated, according to medical records, although Dr Chung told the court he believed he did it earlier. 3.16pm: Mrs Cappuccini has a cardiac arrest. 4.20pm: Mrs Cappuccini is pronounced dead.\nBut the judge said it was ‘perverse’ to have questioned the employment of Dr Cornish who he described as having an ‘impressive career’ with a CV of a ‘high standard’.\nFollowing his formal acquittal Dr Cornish, from Bromley, said: ‘I am relieved with the Court’s verdict.’ He can still practise, under supervision, but faces a GMC investigation.\nDr Azeez – who wasn’t formally on trial – is still banned from practising medicine in this country, pending an investigation by the GMC.\nThe court heard how the Trust had allowed Dr Azeez to continue to care for women in the maternity ward despite a woman almost dying in his care just seven months before Mrs Cappuccini’s death. In March 2012, he was investigated after the new mother had to be urgently resuscitated because of his failings in almost identical circumstances to the death of Mrs Cappuccini.\nMrs Cappiccini taught at Offham Primary School, near West Malling, Kent, (pictured) before she died. Pupils had affectionately given her the nickname 'Mrs Coffee'\nHigh walls surround the family home of Dr Nadeem Azeez, from Tunbridge Wells, Kent, who has now left the country and is believed to be in Pakistan\nMaidstone and Tunbridge wells NHS Trust Chief Executive Glen Douglas (left) and Medical Director Paul Sigston (right) arrive at court yesterday. The Trust was today cleared of corporate manslaughter charges\nThe collapse of such a high-profile case will also raise questions about the CPS decision to bring the prosecution in the first place. It was the first time a corporate manslaughter offence has been enforced since it was introduced in 2008.\nMaidstone and Tunbridge Wells NHS Trust said it ‘regretted that the CPS saw fit to pursue the charge, given the additional stress this will have caused to all involved’.\n‘The Trust has however recognised, that there were aspects of Frances’ care that fell short of the standards that the Trust would expect.’\nA CPS spokesman said: ‘We appreciate that Mrs Cappuccini’s family will be understandably upset by this outcome, but we respect the decision made by the judge.’\nFriends of the popular teacher – known as Frankie – have set up the Frances Cording-Cappuccini Prize in her memory with the hope of saving the lives of young mothers like her.","url":"https://www.dailymail.co.uk/news/article-3420782/Judge-orders-jury-hospital-doctor-NOT-GUILTY-death-teacher.html"}
