{"authors":["Tom Fitton"],"date_download":"2018-10-30 21:38:56","date_modify":"2018-10-30 21:38:56","date_publish":"2016-03-29 04:39:58","description":"We are uncovering critical links between Hillary Clinton's official duties as secretary of state and the private interests of the Clinton Foundation.","filename":"data/vaneerConsumption/JudicialWatchRevealsMoreBenghaziClintonFoundationCorruption.json","image_url":"https://media.breitbart.com/media/2015/03/Hillary-Clinton-clinton-foundation-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_28__1540935536.html","title":"Judicial Watch Reveals More Benghazi, Clinton Foundation Corruption","title_page":"Judicial Watch Reveals More Benghazi, Clinton Foundation Corruption | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This has been an important week in our continuing investigation of Hillary Clinton’s time as secretary of state. We are uncovering critical links between her official duties and the private interests of her family’s foundation.\nThe 276 pages of internal State Department documents we released last week reveal that within two days of the deadly terrorist attack on Benghazi, Mohamed Yusuf al-Magariaf, the president of Libya’s National Congress, asked to participate in a Clinton Global Initiative function and “meet President Clinton.”\nThe meeting had not previously been disclosed.\nThe documents also show that Clinton’s staff coordinated with the Clinton Foundation’s staff to have her thank Clinton Global Initiative project sponsors for their “commitments” during a Clinton Foundation speech on September 25, 2009.\nWe obtained those documents as a result of a federal court order in a Freedom of Information Act (FOIA) lawsuit filed against the State Department on May 28, 2013, (Judicial Watch v. U.S. Department of State (No. 1:13-cv-00772)).\nHere’s the incredible back story:\nIn September 13, 2012, al-Magariaf advisor Dr. Fathi Nuah wrote to the Clinton Foundation’s Director of Foreign Policy Amitabh Desai:\nDr. Almagariaf will be addressing the United Nations this September in New York as the Libyan Head of State, and he expressed a wish to meet President Clinton and to participate at the Clinton Global Initiative meeting for New York as well.\nFour hours later, Desai emailed Hillary Clinton’s Chief of Staff Cheryl Mills, asking:\nWould USG [U.S. Government] have concerns about Libyan President being invited to CGI [Clinton Global Initiative]? Odd timing, I know. Mills emailed back: We would not have issues.\nFour days later, on September 17, Desai emailed Mills again, saying:\nThe Libyan president is asking for a meeting with WJC [William Jefferson Clinton] next week. Desai asked, Would you recommend accepting or declining the WJC meeting request?\nThe State Department apparently had no objection to the meeting, because on September 26, Desai emailed Mills, “He had a v good meeting with Libya …” Hillary Clinton and al-Magariaf did not have a meeting until September 24.\nDon’t you find it incredible that the Libyan president would call and meet Bill Clinton through the Clinton Foundation before meeting Hillary Clinton about Benghazi!\nThe illicit partnership between Hillary Clinton’s State Department and her family foundation extended even to fundraising.\nAn August 2009 email chain, including Hillary Clinton’s then-Chief of Staff Huma Abedin, Mills, and then-Deputy Chief of Staff for Policy Jake Sullivan, shows that the State Department coordinated with Clinton Foundation staff on how Mrs. Clinton was to thank Foundation supporters/partners for their “commitments.”\nCaitlin Klevorick, senior advisor to the counselor and chief of staff to the secretary of state who previously worked at the Foundation, notes: “One question is if we want to see if there is a decent mass of fs [funds] related commitments to announce together at closing as a ‘mega’ commitment.”\nThe State Department material includes background information about Clinton Foundation partners, which include Foundation donors Nduna Foundation, Grupo ABCA, and Britannia Industries. Other CGI partners noted in the State Department documents include a federal agency (the Centers for Disease Control) and various United Nations entities, which also receive U.S. taxpayer funds.\nThe transcript of Hillary Clinton’s speech on the State Department website confirms that the then-secretary of state did thank those making “exceptional commitments” to her husband’s foundation:\nAnd so I congratulate all who helped to put on this (inaudible) CGI [Clinton Global Initiative]. I especially thank you for having a separate track on girls and women, which I think was well received for all the obvious reasons. (Applause.) And this is an exceptional gathering of people who have made exceptional commitments to bettering our world.\nAs previously reported elsewhere, a June 2012 email chain discusses a “firm invitation for President Clinton” to speak at a Congo conference, hosted in part by the controversial Joseph Kabila, president of that nation. Bill Clinton is offered $650,000 in fees and expenses, concerning which, as Desai emails Mills and others, “WJC wants to know that state [sic] thinks of it if he took it 100% for the foundation.”\nThis questionable activity is part of a pattern.\nOur lawsuit had previously forced the disclosure of documents that provided a road map for over 200 conflict-of-interest rulings that led to at least $48 million in speaking fees for the Clintons during Hillary Clinton’s tenure as secretary of state. Previously disclosed documents in this lawsuit, for example, raise questions about funds Clinton accepted from entities linked to Saudi Arabia, China, and Iran, among others.\nWe are continuing our litigation to obtain these conflict of interest records. The State Department has yet to explain why it failed to conduct a proper, timely search in the 20 months between when it received our request on May 2, 2011, and the February 1, 2013, date that Clinton left office.\nHere’s why this is important.\nHillary Clinton and her State Department aides were involved in fundraising for the Clinton Foundation.\nFormer Secretary of State Hillary Clinton worked hand in glove with the Clinton Foundation on fundraising and foreign policy. Despite the law and her promises to the contrary, she turned the State Department into the DC office of the Clinton Foundation.\nOur lawsuit has become particularly noteworthy because it has been reported that the Clinton Foundation, now known as the Bill, Hillary, & Chelsea Clinton Foundation, accepted millions of dollars from at least seven foreign governments while Mrs. Clinton served as secretary of state.\nThe Foundation has acknowledged that a $500,000 donation it received from the government of Algeria while Mrs. Clinton was in office violated a 2008 ethics agreement between the foundation and the Obama administration. Some of the foreign governments that have made donations to the Clinton Foundation — Algeria, Kuwait, Qatar, and Oman — have questionable human rights records.\nThe public reaction to these latest JW findings was one of outrage. As one opinion writer at the Washington Post observed:\nAnd, Clinton’s State Department was apparently coordinating meetings for Bill Clinton with foreign heads of state. If any other employee at the State Department had arranged such meetings for their spouse and actively thanked contributors to their spouse’s foundation, they would likely go to jail. No lawyer would even let it go to trial, because the sentencing guidelines would guarantee years behind bars. Another way to think about what was going on is to imagine that another country’s foreign minister’s spouse or family ran a foundation that American companies were caught giving to. Those American companies would certainly be vulnerable to prosecution by the Justice Department under the Foreign Corrupt Practices Act (FCPA). It’s only because Hillary’s last name is Clinton and because she is the Democratic front-runner for president that she isn’t already being prosecuted for something or another. For anyone else at the State Department, their conviction and sentencing would produce only a matter-of-fact, back-page reference in The Washington Post.\nYou can find the full set of documents here.","url":"https://www.breitbart.com/politics/2016/03/28/judicial-watch-reveals-more-benghazi-clinton-foundation-corruption/"}
