{"authors":["Sharnaz Shahid For Mailonline"],"date_download":"2018-10-23 01:02:11","date_modify":"2018-10-23 01:02:11","date_publish":"2016-01-28 15:11:19","description":"The TV star was spotted enjoying the beautiful sights and surroundings of sunny Barbados as she hit the beach on Monday.","filename":"data/vaneerConsumption/JudithChalmerscutsarelaxedfigureasshehitsthebeachinsunnyBarbados.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB067F00000578-0-image-a-41_1453993396964.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421108_Wish-TV-presenter-Judith-Chalmers-80-cuts-relaxed-figure-hits-beach-sunny-Barbados_1540256531.html","title":"Judith Chalmers cuts a relaxed figure as she hits the beach in sunny Barbados","title_page":"Judith Chalmers cuts a relaxed figure as she hits the beach in sunny Barbados | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is best known for being a globetrotter, presenting travel programme Wish You Were Here back in the late nineties.\nBut this week, Judith Chalmers was spotted enjoying the beautiful sights and surroundings of sunny Barbados as she hit the beach for some relaxation.\nThe 80-year-old - who hosted the popular ITV show for nearly three decades - cut a refined and content figure as she soaked up the balmy climes.\nWish You Were Here! TV presenter Judith Chalmers was spotted enjoying the beautiful sights and surroundings of sunny Barbados as she hit the beach on Monday\nShe looked lovely in a paisley-print design swimming costume and a pale blue sarong, which was styled further with silver embellished sandals.\nMoments later, Judith shielded herself from the sun and wore a broderie anglaise cotton dress while she toted her belongings in large stripy beach bag.\nThe British TV star amped up the glam factor with a delicate diamond necklace, while enhancing her pretty facial features with bright pink lipstick and well-defined eyes.\nWinter break: The 80-year-old - who hosted Wish You Were Here for nearly three decades - cut a refined and content figure as she soaked up the balmy climes\nKeeping her cool: She looked lovely in a paisley-print design swimming costume underneath a broderie anglaise cotton dress, which was styled further with silver embellished sandals\nMeanwhile, the broadcaster - who also presented ballroom dancing competition Come Dancing in the sixties - became a national sweetheart thanks to her appearance on the popular travelling show.\nDespite travelling the world, the mother-of-two previously revealed she never got the hang of packing a holiday suitcase.\n‘I don't know that I am a very good packer, I still think that I take too much,’ she said during an appearance on Loose Women in 2008.\nAttention to detail: The British TV star amped up the glam factor with a delicate diamond necklace, while enhancing her pretty facial features with bright pink lipstick and well-defined eyes\n‘I follow the golden rule of sticking your shoes in the bottom, and your pants on the top - that's if you take them.’\nJudith did, however, admit she never wore knickers when she fronted Wish You Were Here.\n'I was told by the wardrobe mistress that I shouldn't have a VPL - visible panty line,’ she teased. 'So I'm sorry to reveal that after 30 years of Wish You Were Here, I was pantless all the time!'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421108/Wish-TV-presenter-Judith-Chalmers-80-cuts-relaxed-figure-hits-beach-sunny-Barbados.html"}
