{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 18:18:42","date_modify":"2018-10-30 18:18:42","date_publish":"2016-10-09 15:30:41","description":"On Friday, Judicial Watch \"released 128 pages of documents it obtained from the mayor of Rutland, Vermont, showing a concerted effort by the mayor and a number of private organizations to conceal from the public their plans to resettle 100 Syrian refugees into the small southern Vermont town.\" The Judicial Watch release of these documents confirms a pattern of secrecy and concealment found in dozens of small communities around the country. | Politics","filename":"data/vaneerConsumption/JudicialWatchVermontMayorResettlementAgencyConcealedFromthePublicTheirPlanstoResettle100SyrianRefugees.json","image_url":"https://media.breitbart.com/media/2016/06/1024px-Ethnic_Festival_062a.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_09__1540923522.html","title":"Judicial Watch: Vermont Mayor, Resettlement Agency 'Concealed From the Public Their Plans to Resettle 100 Syrian Refugees'","title_page":"Judicial Watch: Vermont Mayor, Resettlement Agency 'Concealed From the Public Their Plans to Resettle 100 Syrian Refugees' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Friday, Judicial Watch “released 128 pages of documents it obtained from the mayor of Rutland, Vermont, showing a concerted effort by the mayor and a number of private organizations to conceal from the public their plans to resettle 100 Syrian refugees into the small southern Vermont town.”\nThe Judicial Watch release of these documents confirms a pattern of secrecy and concealment found in dozens of small communities around the country.\nAs Refugee Resettlement Watch’s Ann Corcoran notes, the Department of State has “identified 47 new resettlement sites in America to accommodate Obama’s proposed 110,000 refugees for FY 2017 which began last Saturday”:\nThese are the sites we know of so far. As we have said this is all planned in secrecy. Asheville, North Carolina; Rutland, Vermont; Reno, Nevada;Ithaca, New York; Missoula, Montana; Aberdeen, South Dakota; Charleston, West Virginia; Fayetteville, Arkansas; Blacksburg, Virginia; Pittsfield, Massachusetts; Northhampton, Massachusetts; Flint, Michigan; Bloomington, Indiana; Traverse City, Michigan.\nSecrecy was key to the planned resettlement of Syrian refugees in Rutland, Vermont, as Judicial Watch reports:\nThe documents include an April 14, 2016, email from Amila Merdzanovic, executive director of the Vermont Refugee Resettlement Program, to Mayor Christopher Louras, in which she wrote: I want to share with you the concern my HQ has about holding a public forum. If we open it up to anybody and everybody, all sorts of people will come out of woodwork. Anti-immigrant, anti-anything. They suggest that the forum be invite only but make it as wide as possible. Work with faith leaders, United Way, etc… Perhaps, we could go back to the Congregational Church and continue the conversation there. The mayor and resettlement organizations shrouded the plan in such secrecy that not even the town’s aldermen were informed of what was taking place behind closed doors. The aldermen eventually wrote to the U.S. Department of State protesting the plan and opened an investigation into the mayor’s actions. The State Department has not yet ruled on whether it will resettle refugees in Rutland despite the aldermen’s protest.\nThe Vermont Refugee Resettlement Program is the local affiliate of the U.S. Committee for Refugees and Immigrants (U.S.C.R.I) , one of the nine national voluntary agencies (VOLAGs) who receive more than $1 billion annually in federal funding to resettle refugees across the country.\nAs Breitbart News reported previously, the Chief Executive Officer of U.S.C.R.I, Lavinia Limon, was the director of the federal Office of Refugee Resettlement during the Bill Clinton administration. She is one of the architects of the policy that rejects traditional American assimilation of refugees and immigrants into the country and promotes, instead, “an aggressive multi-culturalism” described as “integration” by proponents, but known as “balkanization” or “disintegration” by critics.\nDuring FY 2016, the Obama administration resettled more than 12,500 Syrian refugees in the United States, out of a total of 84,995 resettled refugees.\nDemocratic presidential nominee Hillary Clinton has said she wants to increase the number of Syrian refugees coming in to the United States to 65,000 annually. Donald Trump, in contrast, is “committed to suspending the Syrian refugee program and programs and immigration from areas of the world that have been compromised by terrorism.”\nThe Obama administration has proposed increasing the total number of refugees allowed into the United States in FY 2017 to 110,000. During the first six days of October 2016, the beginning of FY 2017, the Obama administration brought in more than 3,000 refugees, an annualized rate of 185,000 refugees.\nAs Judicial Watch reports, the concealment efforts runs deep in Rutland, Vermont:\nHandwritten notes state that the issue was, “Not what can ‘we’ do for ‘them,’ but what the diversity, cultural richness do for the community.” The documents contain detailed discussions of what Rutland will need to provide for the refugees – including housing, jobs, medical care, and places for worship. Judicial Watch received the documents in response to a Vermont Public Records Law request to the office of Mayor Christopher Louras. Merdzanovic later told the Boston Globe that the hidden talks were “the right thing to do — to move slowly, keep it to a small circle of people, and then expand.” On April 10, 2016, she wrote to the director of the State Refugee Office about her coordination with the mayor to keep the resettlement program secret: He did share with me that the Governor’s office called him after getting a frantic call from DOL [Vermont Department of Labor] inquiring about the plan to resettle ‘100 Syrians in the next month’ in Rutland. Again, I cannot emphasize enough the importance of not sharing the information even if it is confidentially. Please respect our process, you will have plenty of opportunity to share and take action once we have met with the stakeholders. At that point we can and will share it widely. It will not serve any one of us well if the community in Rutland learned about it through the grapevine and not directly from us. The above example shows that what people hear and how they interpret it is two different things.\n“Local opponents of the refugee plans wanted a public vote on the proposal and transparency on the refugee settlement plan,” Judicial Watch notes.\n“Americans should be concerned that the Obama administration is funneling at least $46 million in tax dollars to a shady operation that encourages elected officials to cover up Obama’s Syrian refugee scheme,” Judicial Watch President Tom Fitton said on Friday.\nMissoula, Montana is another small community that offers an additional recent example of this pattern of secrecy.\n“Missoula could resettle up to 150 refugees of as many as 15 nationalities in the next 12 months, but the biggest numbers will reflect the world’s most troubled spots,” Refugee Resettlement Watch’s Corcoran writes.\n“I visited Missoula on my [Refugee Resettlement Watch] fact-finding trip this summer and learned that the contractor office was being kept secret,” she adds.\nA similar story of secrecy surrounds the proposed placement of 100 Syrian and Iraqi refugees in Flint, Michigan in FY 2017.\n“City leaders have not been informed of the details involving this matter,” a spokesperson for the mayor of Flint, Michigan told Breitbart News last month.","url":"https://www.breitbart.com/politics/2016/10/09/judicial-watch-vermont-mayor-resettlement-agency-concealed-from-the-public-their-plans-to-resettle-100-syrian-refugees/"}
