{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 22:23:08","date_modify":"2018-10-22 22:23:08","date_publish":"2017-03-10 00:40:23","description":"The 47-year-old Modern Family actress, on Sunday's episode, travels to Chicago and Pennsylvania, where she learns about a pair of late relatives who left very different legacies.","filename":"data/vaneerConsumption/JulieBowenshockeronTLCsWhoDoYouThinkYouAre.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/22/3E1E9DC400000578-0-image-a-5_1489099707120.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299320_Julie-Bowen-shocker-TLC-s-Think-Are_1540246988.html","title":"Julie Bowen shocker on TLC's Who Do You Think You Are?","title_page":"Julie Bowen shocker on TLC's Who Do You Think You Are? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Julie Bowen is the latest celebrity to dig into her roots on TLC's genealogy-based program, Who Do You Think You Are?\nThe 47-year-old Baltimore native, on Sunday's episode, travels to Chicago and Pennsylvania, where she learns about a pair of late relatives who left very different legacies.\nThe Modern Family actress 'investigates family lore, and hunts down two ancestors from a different cloth,' the network said. 'One makes a daring choice and earns his family's pride for generations - the other, Julie may have to find a way to forgive.'\nScroll below for video\nFamily secrets: Julie Bowen, 47, gets surprising news about her background on Sunday's episode of TLC's Who Do You Think You Are?\nFact-finding mission: The 47-year-old Modern Family star travels to Chicago and Pennsylvania, gleaning info about a duo of late relatives who left very different legacies.\nCracking the books: In the episode, the actress makes a number of stops to extract info about her past\nTake the good with the bad: Not all of the results of the study are music to Bowen's ears\nOn the program, which traces back into the family trees of celebrities, the mother-of-three visits two vaunted Windy City institutions - the Art Institute of Chicago and the Pritzker Military Library - to probe details on her family predecessors.\nJulie, who's also been seen on Ed, Boston Legal and Lost, learns that one of her ancestors was involved in the Chicago-based American Protective League, according to the Chicago Sun-Times. The group, which was active during World War I, tipped off authorities to the presence of German sympathizers, anarchists and war protesters.\nIn the episode, Bowen also makes a stop in Washington, Pennsylvania, where she learns of the fate of a great-grandfather (on her father's side) while meeting with the Washington Historical Society's Erica Dunbar Armstrong.\nYou don't say! The TV star gets good news from noted historian Erica Dunbar Armstrong\nLooking back: Bowen meets with Armstrong at the Washington Historical Society in Pennsylvania in the episode\nIn the chat with Armstrong, according to Entertainment Tonight, it's revealed that Bowen's ancestor Francis LeMoyne was an abolitionist who put his life on the line in the battle against slavery.\nBowen drew parallels to LeMoyne's life endeavors and current social issues percolating in the United States with President Donald Trump in the Oval Office.\nShe said, 'We're in a moment where people feel very threatened by people that they consider \"other,\" whatever \"other\" is represented by - religion, color, taking their jobs - and it just sounds so current at the same time ... it sounds so old and so new at once.'\nRevealing insights: Through deep and intensive research, Julie finds a unbeknownst source of pride in her family tree\nLearning with the stars: Other famous faces who will appear on the genealogy show this season include Jessica Biel and Liv Tyler\nOther celebs who'll be profiled on the cable program in its ninth season include music legend Smokey Robinson, Dirty Dancing beauty Jennifer Grey and TV stalwart John Stamos.\nWho Do You Think You Are? airs at 10/9c on TLC Sunday.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299320/Julie-Bowen-shocker-TLC-s-Think-Are.html"}
