{"authors":["Ciara Farmer For Mailonline"],"date_download":"2018-10-22 20:02:22","date_modify":"2018-10-22 20:02:22","date_publish":"2016-01-28 00:03:53","description":"The 55-year-old stunner posed for a smouldering shoot in the March issue of Marie Claire magazine where she rocked a super-sexy sheer gown which flaunted a mass of her toned figure","filename":"data/vaneerConsumption/JulianneMooreflauntsherfigureinsheergownforMarieClairemagazineshoot.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/23/30A4793400000578-0-image-a-71_1453937745097.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3419870_Julianne-Moore-flaunts-figure-sexy-sheer-gown-smouldering-magazine-shoot_1540238542.html","title":"Julianne Moore flaunts her figure in sheer gown for Marie Claire magazine shoot","title_page":"Julianne Moore flaunts her figure in sheer gown for Marie Claire magazine shoot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is one of Hollywood's leading actresses.\nYet Julianne Moore is adamant she struggles to find movie parts as Hollywood is driven by making money rather than creating suitable roles for individuals.\nThe 55-year-old stunner posed for a smouldering shoot in the March issue of Marie Claire magazine where she rocked a super-sexy sheer gown which flaunted a mass of her toned figure.\nScroll down for video\nStunning star: Julianne Moore is adamant she struggles to find movie parts as Hollywood is driven by making money rather than creating suitable roles for individuals\nIn a particularly striking ensemble, Julianne wore a heavily adorned sheer midi-dress boasting intricate turquoise sequins and bold red detailing while attention to detail was apparent as she sported rings which perfectly matched the colours of the gown.\nHer sensationally toned pins were visible in their entirety as the sheer material extended up to her hips and atop the exposure of her legs, Julianne also offered a glimpse at her pert bust through the dusky-hued mesh material.\nThe Still Alice actress wore her trademark bold red locks in a centre parting with bold waves worked throughout while her eyes were outlined in deep kohl.\nIn another stunning image, Julianne straddled a chair while rocking a chic lace top with flared white trousers - a look which appeared to channel the Seventies.\nSmouldering: In another stunning image, Julianne straddled a chair while rocking a chic lace top with flared white trousers - a look which appeared to channel the Seventies\nWhile the stunning actress has been feted with an Oscar, two Golden Globes and a BAFTA, she insists she still struggles to find roles although she is adamant it is not due to sexism or ageism.\nShe told the fashion publication: 'It’s very difficult to find parts, no matter how old you are, no matter where you are and whether you’re a man or a woman.\n'The movie industry is not in the business of finding good roles for actors or actresses; it is in the business of creating films that will make as much money as possible.'\nThe March issue of Marie Claire is on news stands now\nWith discrimination in Hollywood being a hotly-discussed subject of late, after many actors boycotted this year's Oscars due to lack of diversity, Julianne was candid about sexism she has experienced.\nShe said: 'I draw the line at picking up my skirt and showing them my shoes, but I don’t mind talking about [what I'm wearing]. For us, the Oscars are exciting, and they are important for our industry, but for people at home, they are watching for entertainment purposes.\nThe beautiful star is mother to 18-year-old son Caleb Freundlich and daughter Liv Freundlich, 13, with her husband Bart, who she married in 2003.\nJulianne revealed that she is strict about the separation of her home and work life, explaining: 'At night, I won’t answer work emails, or the phone, unless there is an emergency. If I have to read scripts, or have a meeting, or do an interview, I do it during the school day.\n'I don’t think I’ve ever given an interview within the school hours, just because I want to be home when my kids are home. I want to have dinner with them.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3419870/Julianne-Moore-flaunts-figure-sexy-sheer-gown-smouldering-magazine-shoot.html"}
