{"authors":["Sabienna Bowman"],"date_download":"2018-10-31 01:52:00","date_modify":"2018-10-31 01:52:00","date_publish":"2018-09-13 21:12:04","description":"It looks like Mr. Robot creator Sam Esmail has created another mind-bending thriller, and no offense to his USA hit, but the trailer for Julia Roberts' Homecoming takes the creepy factor to a whole new level. After watching the eerie full-length…","filename":"data/vaneerConsumption/JuliaRobertsHomecomingTrailerIsSoCreepyItMightJustGiveYouNightmaresVIDEO.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/13/2587e54c-5519-46c4-b337-c0d2de7c99b0-screenshot-721.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_julia-roberts-homecoming-trailer-is-so-creepy-it-might-just-give-you-nightmares-video-11910288_1540950720.html","title":"Julia Roberts' 'Homecoming' Trailer Is So Creepy It Might Just Give You Nightmares - VIDEO","title_page":"Julia Roberts' 'Homecoming' Trailer Is So Creepy It Might Just Give You Nightmares — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"It looks like Mr. Robot creator Sam Esmail has created another mind-bending thriller, and no offense to his USA hit, but the trailer for Julia Roberts' Homecoming takes the creepy factor to a whole new level. After watching the eerie full-length trailer, you may find yourself feeling deeply unsettled. And that seems to be the point. From switching between traditional and vertical shots to Roberts' character repeating, \"we're here to help them,\" everything about the teaser seems designed to get under your skin.\nPer Variety, the series follows Roberts' Heidi Bergman, a waitress who lives with her mom, played by Sissy Spacek. That seems normal enough, right? Well, four years before, Heidi worked as a caseworker who helped soldiers settle back into their normal lives via a program called Homecoming. At least, that's what she seems to believe that she did. Heidi makes it clear she's forgotten what she actually did, which brings up a whole new set of questions like is she repressing memories? Was she made to forget? Is she simply lying to the Department of Defense auditor who is digging for answers?\nHeidi has secrets, there's no doubt about that, but what's even more unnerving are the shots of the soldiers in the Homecoming facility. One soldier in particular seems to be the focus of Heidi's work, and even though he insists that he can leave the facility whenever he wants, that feels unlikely. Through a series of repetitive shots accompanied by a score that would make Alfred Hitchcock proud, the trailer ramps up the tension and the sense that something is very wrong about this place.\nPrime Video on YouTube\nHomecoming is based on a fiction podcast of the same name. The serial drama has been on for two seasons so far, and boasts an impressive voice cast including Catherine Keener and Oscar Isaac. Its summary also gives away a more succinct description of the mayhem happening in the trailer. The official site reveals:\n\"'Homecoming' centers on a caseworker at an experimental facility, her ambitious supervisor, and a soldier eager to rejoin civilian life.\"\nThe Amazon series, which will premiere on Nov. 2, has an equally star-studded cast. In addition to Roberts and Spacek, the series also stars Bobby Cannavale, Stephan James, Jeremy Allen White, Alex Karpovsky, and Dermot Mulroney. With a cast this stacked with talent, Homecoming already feels like a potential must-see drama, but even without the big names attached, the series' psychological nature is intriguing.\nWhile there doesn't appear to be anything supernatural going on, the facility seen in Homecoming's trailer is reminiscent of Stranger Things' Hawkins National Laboratory. And TV fans know what kind of nightmares came out of that place. The spook factor is definitely high with this series already. Human experimentation always sets off alarm bells, and the soldiers who wander through Homecoming's doors are definitely getting more than a helping hand at adjusting to civilian life.\nEmma McIntyre/Getty Images Entertainment/Getty Images\nOne thing is certain, if you know Roberts best as a rom-com queen, this series is poised to show you just how much range she has as an actor. And her performance might just keep you up at night too.","url":"https://www.bustle.com/p/julia-roberts-homecoming-trailer-is-so-creepy-it-might-just-give-you-nightmares-video-11910288"}
