{"authors":["Sophie Haslett For Daily Mail Australia"],"date_download":"2018-10-22 21:25:21","date_modify":"2018-10-22 21:25:21","date_publish":"2016-01-29 06:43:16","description":"On a rare break from her political duties as Foreign Affairs Minister, Julie Bishop put on a stylish display at the G’Day USA Black Tie Gala, wearing an all-white gown with a sparkly overlay.","filename":"data/vaneerConsumption/JulieBishopdazzlesattheGDayUSABlackTieGala.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30B00AE000000578-0-image-a-28_1454049777583.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422200_All-white-night-Fashionista-Foreign-Minister-Julie-Bishop-dazzles-G-Day-USA-Black-Tie-Gala_1540243521.html","title":"Julie Bishop dazzles at the G’Day USA Black Tie Gala","title_page":"Julie Bishop dazzles at the G’Day USA Black Tie Gala | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is there to meet with business leaders from television and film\nThe Foreign Affairs Minister is in the US for ten days\nShe wore a white dress for the occasion and posed with her boyfriend\nOn a rare break from her political duties as Foreign Affairs Minister, Julie Bishop has put on a stylish display at the G’Day USA Black Tie Gala.\nWhile the 59-year-old usually opts for Giorgio Armani suits and designer heels, this time the Deputy Leader of the Liberal Party chose a white gown with a sparkly overlay when she appeared on the red carpet with her boyfriend Robert Hill.\nThe politician, who has said in interviews in the past that she tries to wear clothes that will promote an appropriate image for Australia, could easily double up as Fashion Minister, and this was in full evidence at the Gala, as she and her husband posed for the cameras.\nAll white: The 59-year-old fashionista politician attended the G'Day USA Black Tie Gala in LA\nAll-star attendance: The event was also attended by Mariah Carey and her new fiance James Packer\nBishop dazzled in her dress and co-ordinating silver arm cuff and earrings, adding a pop of colour with red fingernails.\nThe event was also attended by fellow Australian James Packer and Mariah Carey, who made their first appearance since their engagement, alongside Mad Max director, George Miller.\nMariah showed off her 35 carat engagement ring on the red carpet.\nLots to celebrate: Actor Hugh Jackman and his wife Deborra-Lee Furness also attended the event\nGala theme: The theme of this year's LA Gala was innovation - 'innovation, ingenuity, and Australian creativity'\nSpeaking to Sky News, Julie Bishop said that the theme of this year’s G’Day USA Gala was innovation.\n‘Innovation, ingenuity, Australian creativity and a sophisticated diverse economy,’ she said, arguing that there would be a push for more films to be produced in Australia.\n‘We’ve had some successes with the Thor film and the next Alien film and we are hoping to attract more,’ she said.\nFurry fun: Nicole Richie also attended the event, wearing white with a furry jacket\nAustralian actor Hugh Jackman and his wife Deborra-Lee Furness were also in attendance on the red carpet, as was Holly Valance and Nicole Richie, before an awards ceremony was presented by Toni Collette and Rachel Griffiths.\nMeanwhile, Julie Bishop has been in the USA between 21 and 31 January.\nShe is currently in LA on the last leg of her US tour. She is there to meet with business leaders from the film and television industry and will return to Australia afterwards.","url":"https://www.dailymail.co.uk/femail/article-3422200/All-white-night-Fashionista-Foreign-Minister-Julie-Bishop-dazzles-G-Day-USA-Black-Tie-Gala.html"}
