{"authors":["Jenny Awford For Daily Mail Australia"],"date_download":"2018-10-23 01:18:41","date_modify":"2018-10-23 01:18:41","date_publish":"2016-01-11 12:10:02","description":"Wearing a bright pink T-shirt, black shorts and trainers, Julie Bishop was pictured speaking on her mobile as she walked along the sand in Portsea, near Melbourne.","filename":"data/vaneerConsumption/JulieBishopstaysgluedtoherphonedespitepartnerDavidPantonshowingoffhistorso.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300A224E00000578-0-image-a-59_1452517884375.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393791_Julie-Bishop-pictured-holiday-Portsea_1540257521.html","title":"Julie Bishop stays glued to her phone despite partner David Panton showing off his torso","title_page":"Julie Bishop stays glued to her phone despite partner David Panton showing off his torso | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is supposed to be enjoying a relaxing holiday with her partner. But it appears that nothing can distract Julie Bishop from her work as the Australian Foreign Minister stayed glued to her phone despite David Panton showing off his ripped torso after the pair enjoyed a run together.\nWearing a bright pink T-shirt, black shorts and trainers, the politician was pictured speaking on her mobile as she walked along the sand in Portsea, near Melbourne.\nAnd she couldn't even put her phone down while strolling along the pier at the beach resort with her topless property developer partner.\nThe deputy Liberal leader, 59, had earlier pounded the streets with Mr Panton on Sunday afternoon while wearing a pair of dark sunglasses.\nShe was also seen giving a thumbs up sign while clambering over rocks at the seaside resort and later chatted to a number of swimmers in the sunshine.\nScroll down for video\nAustralian Foreign Minister Julie Bishop did not put her phone down for a second as she strolled along the beach in Portsea, near Melbourne\nWearing a bright pink T-shirt, black shorts and trainers, the politician was pictured speaking on her mobile as she clambered over some rocks at the resort\nShe had earlier pounded the streets with her topless partner on Sunday afternoon while wearing a pair of dark sunglasses\nThe couple seemed to be deep in conversation as they strolled along the pier at the beach resort on Sunday\nMs Bishop, who has been with her property developer partner for more than a year, had cut a stylish figure at the Portsea Polo event at Victoria's scenic Mornington Peninsula the previous day, wearing a monochrome dress.\nShe was also seen going for a run in a pair of striped shorts and a turquoise T-shirt on Saturday, waving to media who had gathered ahead of the event nearby.\nThe Foreign Affairs Minister has previously spoken in the past of her love of running, revealing that she squeezes in an hour of jogging every morning no matter where her official business takes her.\nIn 2014 a government document listing her 'personal preferences' revealed one hour of daily exercise as one of her only demands while working.\nThe deputy Liberal leader, 59, was seen using her phone as she chatted to her partner David Panton on a pier in Portsea, near Melbourne\nThe politician was seen going to shake a well-wisher's hang while she holding her iPhone, which is protected by a red case\nShe clutched a small black bag as she strolled along a pier packed with fishermen at Portsea, near Melbourne\nShe showcased her bright red nail polish when she gave a thumbs up sign (left) and was later seen motioning to the ground\nShe was seen pushing her blonde locks to one side as she walked along the beach with her phone firmly in her hand\nThe couple, who have been together for more than a year, pounded the streets of the Victorian town while both wearing trainers on Sunday afternoon\nThe Foreign Affairs Minister has previously spoken in the past of her love of running, revealing that she squeezes in an hour of jogging every morning no matter where her official business takes her\nThe politician is dedicated to her fitness regime and she was also pictured going for a jog on Saturday morning\n'If I fly into a country about midnight or even later, I make sure I am up at five or six in the morning to go for a run, to put me into the time zone,' she told news.com.au.\nSo dedicated is she to her fitness regime that the politician was spotted jogging through smog in Sumatra.\nShe also confessed to surviving on four hours of sleep a night, waking up fresh to begin the day with exercise whenever she travels.\nThe minister does not drink coffee and instead prefers tea and sparkling water, the document also revealed.\nWhile she would rather stick to water, it is noted that she will drink champagne and wine at 'appropriate functions.'\nThe deputy Liberal leader looked happy and relaxed as she walked along the pier with her phone still firmly in her hand\nShe was pictured speaking to a number of swimmers in the sunshine during her getaway in Portsea, near Melbourne, on Sunday\nHer property developer partner appeared to be a little chilly as he stood on the pier after going for a quick dip","url":"https://www.dailymail.co.uk/news/article-3393791/Julie-Bishop-pictured-holiday-Portsea.html"}
