{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 00:52:33","date_modify":"2018-10-23 00:52:33","date_publish":"2017-03-16 10:25:23","description":"Adrian Derbyshire, 42, has revealed his daughter Julia, who died in 2015 aged 16 after hanging herself, was being bullied after she told a close friend she 'might be a lesbian'.","filename":"data/vaneerConsumption/JuliaDerbyshirewasbulliedforbeinggaysaysfather.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E53570D00000578-0-image-a-2_1489658975263.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319504_Father-reveals-late-daughter-16-bullied-gay_1540255953.html","title":"Julia Derbyshire was bullied 'for being gay', says father","title_page":"Julia Derbyshire was bullied 'for being gay', says father | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Julia Derbyshire, 16, pictured, who died in 2015 five days after hanging herself, was being bullied for 'being gay', her father has revealed\nA father who posted photos of his dying daughter in hospital after she hanged herself has revealed she 'wanted to die' after years of bullying because she came out as gay.\nHeart-broken Adrian Derbyshire, 42, wants the death of his 16-year-old Julia to raise awareness of playground and online bullying.\nLast week he released photos of her on a ventilator in hospital but he has now revealed the bullying started after Julia confided to a friend she 'might be a lesbian'.\nMr Derbyshire, a former Paralympic fencer, said his daughter was just 12 when she told a friend that she 'might like girls'.\nHe said her 'friend' then spread her sensitive feelings around school and Julia was subjected to vile bullying as she was 'spat at' and abused both mentally and psychically.\nMr Derbyshire said his daughter turned to self-harm to deal with her nightmare and had nowhere to turn because of the internet abuse.\nThe father-of-two, of Warrington, Merseyside, said: 'It all started when Julia was 12.\n'She approached her friend and said \"I'm not sure yet but I think I like girls\".\nAdrian Derbyshire last week shared pictures of the 16-year-old, pictured, as she lay dying in hospital to raise awareness of the consequences of bullying\nHer father said Julia, pictured left and right in hospital, told a friend she 'might be a lesbian' when she was 12, which spread around her school and led to people 'spitting at her'\nMr Derbyshire, pictured with Julia, said she could 'not get away' from bullying because of the internet\n'She was just exploring her sexuality and wanted to share it with her friend - but her friend told all the school and it started there.\n'She was spat on, there was name calling. It was physical as well as psychological.\n'It escalated and Julia started self-harming to cope with the bullies.\n'But she couldn't get away with it as she was being bullied in her own bedroom because of the internet.'\nJulia was born in Warrington but moved to America at the age of four along with her parents and elder sister.\nWhen Julia was nine, Mr Derbyshire moved back to Warrington following the breakdown of his marriage.\nBut after finding out her plight through her teenage struggle - Mr Derbyshire brought her back home to live with him in the UK.\nJulia, pictured, lived in the US between ages four and 14, which is where the bullying began\nHe said: 'By this point she had just turned 14 and she came over very damaged. The first thing I did was show her unconditional love.'\nMr Derbyshire said with his constant support, Julia's confidence began to grow and she had dreams of studying political journalism at university.\nBut he did not know the schoolgirl was was still receiving messages from American bullies.\nMr Derbyshire said: 'I think the reason why she did that was because she had gained a lot of confidence in herself and she wanted to speak to them and get them to like her for who she was.\n'We gave her the confidence to go back to the haters to stick up for herself and others - but it was too much too soon.\n'I did not have long enough and if we had a couple more years she would have got through this.'\nMr Derbyshire and Julia shared a pizza and watched a film together the night before she attempted to take her own life in October 2015.\nThe next morning he discovered the 16-year-old had collapsed in the living room after hanging herself.\nDespite a desperate effort by Mr Derbyshire to save her by giving her CPR until the ambulance arrived, she died five days later in hospital.\nIt later came to light that Julia had been leading a double life with hidden telephones and a false identity as a member of website groups which promoted teenage self-harming and suicide.\nMr Derbyshire, pictured with Julia, is leading an anti-bullying campaign and said 'no family should go through the same devastation his has'\nMr Derbyshire released the photos on Wednesday, March 8, on what would have been Julia's 18th birthday - 16 months after her death.\nHe said: 'I always knew there would be a point where I may have to release them but I haven't thought about them for 16 months.\n'It was a horrific week for myself, my family and Julia's friends building up to Julia's 18th birthday.\n'I wasn't going out with Julia on her birthday having champagne and celebrating - I was taking flowers to her grave. I then knew something needed to be done.'\nHe released the hospital images, pictured, on what would have been his daughter's 18th birthday\nMr Derbyshire said 'the outpouring of support' has reaffirmed that he made the right decision.\nHe has so far received 10,000 messages from around the world, including 900 emails and has been in contact with a representative from the United Nations.\nMr Derbyshire said: 'The response tells us how much of a problem it is. There are kids who are getting bullied and they are sitting next to their parents at the dinner table with the iPad and being bullied.\n'No parent, family or friend should ever go through the devastation and loss I have - we all have.'","url":"https://www.dailymail.co.uk/news/article-4319504/Father-reveals-late-daughter-16-bullied-gay.html"}
