{"authors":["E. Ce Miller"],"date_download":"2018-10-31 01:46:19","date_modify":"2018-10-31 01:46:19","date_publish":"2018-09-11 16:30:53","description":"Julissa Arce doesn’t remember reading a single book in middle school with a protagonist who was someone like her: a Latina immigrant living in the United States. That’s one of the reasons Arce — social justice advocate, cofounder and chairman of the…","filename":"data/vaneerConsumption/JulissaArceWantsLatinxImmigrantChildrenToSeeThemselvesReflectedInHerNewMemoirSomeoneLikeMe.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/6678ce04-a1d9-4f55-89e7-630068129615-someonelikeme.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_julissa-arce-wants-latinx-immigrant-children-to-see-themselves-reflected-in-her-new-memoir-someone-like-me-11851948_1540950379.html","title":"Julissa Arce Wants Latinx Immigrant Children To See Themselves Reflected In Her New Memoir 'Someone Like Me'","title_page":"Julissa Arce Wants Latinx Immigrant Children To See Themselves Reflected In Her New Memoir 'Someone Like Me'","title_rss":"NULL","source_domain":"bustle.com","text":"Julissa Arce doesn’t remember reading a single book in middle school with a protagonist who was someone like her: a Latina immigrant living in the United States. That’s one of the reasons Arce — social justice advocate, cofounder and chairman of the Ascend Educational Fund, and the bestselling author of My (Underground) American Dream — wanted to adapt that adult memoir for young readers. The result is the YA memoir (geared towards readers 10-years and older) Someone Like Me: How One Undocumented Girl Fought for Her American Dream, out on Sept. 18 from Little, Brown for Young Readers.\n“My biggest motivation for adapting my memoir for young readers is for them to see themselves reflected in a book,” Arce tells Bustle. “So many young people don’t develop a love for reading at an early age because the books they read in school do not speak to their experiences. I hope my book inspires young readers to love books and to write their own stories.”\nIn Someone Like Me, Arce explains that she traveled to the United States on a legal visa, and only became undocumented upon the expiration of that visa. “I came to the U.S. when I was 11-years-old,” she says. “I didn’t choose to come here, my parents made that decision. I didn’t have a say in the matter, which also means I didn’t have a say in how I got here. My parents had a different financial situation when I first arrived in the United States. They had the resources to obtain a visa.”\nSomeone Like Me: How One Undocumented Girl Fought For Her American Dream by Julissa Arce,$10.87, Amazon\nIt’s a story that’s too-often lost in the conversations about immigration in this country: the significant number of undocumented migrants who arrive in the United States on legal visas, and through one circumstance or another — and many times through no fault of their own — become undocumented upon the expiration of that visa. Far more frequently, undocumented immigrants are reduced to the stereotype of the “criminal” migrant crossing the U.S./Mexico border without documentation. “Many of the people who cross the border do not have the means to even qualify for any type of visa,” Arce says. “No one chooses to cross illegally if they have another option.”\n\"So many young people don’t develop a love for reading at an early age because the books they read in school do not speak to their experiences.\"\nA board member for the National Immigration Law Center, Arce is mindful of the ways one’s arrival in the United States can impact their opportunities once they’re here. “I don’t think someone who crossed the border to provide for his or her family is any less deserving than me,” she says. “However, the laws are vastly different depending on how someone came to the U.S. If a person has the same experiences as me, but crossed the border illegally, they may never qualify to become an American citizen under the current laws. I do think we need to talk more about these differences, and how unfair they are.”\nBut Someone Like Me, Arce notes, is more than an immigration story. “Someone Like Me is not about immigration at all,” she says. “The book is about love for family and the sacrifices we must make to achieve our dreams.” One of those sacrifices comes upon what would have been the author’s quinceañera — the traditional celebration of a girl’s 15th birthday. Arce, while planning her long-anticipated party, suddenly realized her then-expired visa status meant she could neither travel back home to Mexico to celebrate with her family nor live legally in the United States any longer. It’s a moment in the memoir that is agonizingly relatable and equally unfathomable to anyone who hasn't been there: Arce’s intense disappointment is about the much-desired party, but also about so much more.\n“The lifelong struggle of an immigrant is always wishing we could be in two places at once,” she says. “When I found out I was undocumented, I didn’t grasp what it really meant. I was 14 — I was more upset about not having a party I’d been wishing for since I was three years old than about finding out I was undocumented. My sisters were in Mexico, but my parents and younger brother were in the U.S. My life was, and continues to be, in both places.”\nPhoto by Vincent Remini\nArce describes what it’s like to traverse that terrain — the blessing and the curse, as she describes, of finding home in both places. “When I am in Mexico, my tongue feels like a fruit roll up that won’t unwind. In the United States, I don’t speak like kids who got a perfect SAT English score,” she says. “My heart is in both places. My heart longs to be here and there. My curse is not being able to give up either place. My strength, and biggest blessing, is loving both places.”\n\"The lifelong struggle of an immigrant is always wishing we could be in two places at once.\"\nIn addition to telling her own coming-of-age and immigrant story, Arce writes about the sacrifices that her parents — and particularly her mother — made for Arce and her siblings. In Someone Like Me, she describes her mother saying: “Learning is the most important thing you can do. My job is to work, your job is to do well in school.” I ask Arce, cofounder and chairman of the Ascend Educational Fund — a college scholarship and mentorship program that assists immigrant students — about this: how her education played a role in her journey.\n“It is only through education that someone like me can have the opportunities I’ve had,” she says. “Education is the great equalizer and that is why I view access to schooling as a human right. Every student, regardless of national origin, ethnicity, or immigration status, should be able to attend college. I co-founded the Ascend Educational Fund with this mission in mind, and in the past six years we have awarded over $400,000 in college scholarships to immigrant students in New York City.”\n\"When I am in Mexico, my tongue feels like a fruit roll up that won’t unwind. In the United States, I don’t speak like kids who got a perfect SAT English score.\"\nBut that education didn’t come without a price. Eventually, Arce’s parents return to Mexico, leaving her behind in the United States to complete her education. “My family would be gone,” she writes in Someone Like Me, describing the separation from her family as the true price of college. It’s a sacrifice not unlike so many of the other overlooked sacrifices immigrants make to achieve in the United States.\n“Immigrants often become the easy scapegoat for many of our country’s issues. If you don’t have a job, it’s because an immigrant took it. If you don’t have access to healthcare, it’s because we are giving it to the lazy immigrant (who took your job!),” says Arce. “It is easier to dehumanize an immigrant by ignoring the sacrifices we make just to be able to come to America to work. I am in shock anytime someone suggests immigrants come to the U.S just so we can get on welfare. Who on Earth would leave everything behind, their land, family, and customs, to just get by? Who would risk their very lives, just to survive?”\n“America is a beautiful place, with a lot to offer and a lot to be gained,” she adds. “But it is not free. It does not come easy or without sacrifice.”\n\"It is easier to dehumanize an immigrant by ignoring the sacrifices we make just to be able to come to America to work.\"\nAs a speaker and social justice advocate, Arce also offers some great ideas for places where young or new activists, interested in issues of immigration, can make a positive difference — just by starting in their own communities. “For young people, be welcoming to new classmates who may come from different countries and have different customs,” Arce says. \"Be kind to classmates who may not yet know the English language. It doesn’t mean they are not smart, it just means they are learning a second language! For older activists, volunteer to teach adults English, or to study for the citizenship test, or to fill out a DACA renewal, or to read scholarship applications for the Ascend Educational Fund.”\nShe also encourages showing up — showing up to march, registering to vote, and then actually showing up in the voting booth on election days.\n“I believe young people, like the adults who read My (Underground) American Dream, will see themselves in my experiences,” Arce says. “Because we’ve all had a dream we’ve worked hard to achieve.”","url":"https://www.bustle.com/p/julissa-arce-wants-latinx-immigrant-children-to-see-themselves-reflected-in-her-new-memoir-someone-like-me-11851948"}
