{"authors":["Jack O'Keeffe"],"date_download":"2018-10-31 01:48:26","date_modify":"2018-10-31 01:48:26","date_publish":"2018-09-14 02:15:43","description":"For the first 59 minutes of the Sept. 13 episode of Big Brother, Julie Chen made no mention of the fact that her husband, Les Moonves, stepped down as CEO of CBS following accusations of sexual misconduct. In the final minute of the show however,…","filename":"data/vaneerConsumption/JulieChensBigBrother20SignOffVoicedSupportForHusbandLesMoonvesInTheWakeOfSexualMisconductAccusations.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/ff48033c-bb45-4685-9e0f-c588f4f430b5-getty-968046886.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_julie-chens-big-brother-20-sign-off-voiced-support-for-husband-les-moonves-in-the-wake-of-sexual-misconduct-accusations-11916390_1540950506.html","title":"Julie Chen's 'Big Brother 20' Sign-Off Voiced Support For Husband Les Moonves In The Wake Of Sexual Misconduct Accusations","title_page":"Julie Chen's 'Big Brother 20' Sign-Off Voiced Support For Husband Les Moonves In The Wake Of Sexual Misconduct Accusations","title_rss":"NULL","source_domain":"bustle.com","text":"For the first 59 minutes of the Sept. 13 episode of Big Brother, Julie Chen made no mention of the fact that her husband, Les Moonves, stepped down as CEO of CBS following accusations of sexual misconduct. In the final minute of the show however, the longtime Big Brother host ended the show by saying, \"From outside the Big Brother House with Brent, I’m Julie Chen-Moonves, Goodnight,\" accentuating her husband's name in a way that she's never done on the show before.\nMoonves has been the subject of two articles written by Ronan Farrow and published by The New Yorker, which include accusations from a total of 12 women claimed that he had harassed, intimidated, and even assaulted them. On Sept. 9, the same day as the publication of the second New Yorker article, Moonves stepped down as CEO, and CBS is currently witholding a financial exit package pending an investigation into the allegations against Moonves. In a statement published by Deadline and other publications, Moonves said:\n\"For the past 24 years it has been an incredible privilege to lead CBS’s renaissance and transformation into a leading global media company. The best part of this journey has been working alongside the dedicated and talented people in this company. Together, we built CBS into a destination where the best in the business come to work and succeed.\nUntrue allegations from decades ago are now being made against me that are not consistent with who I am. Effective immediately I will no longer be Chairman and Chief Executive Officer of CBS.\nI am deeply saddened to be leaving the company. I wish nothing but the best for the organization, the newly comprised board of directors and all of its employees.\"\nOn Sept. 10, Chen, who's also a cast member of the CBS daytime show, made a statement to E! News saying, \"I am taking a few days off from The Talk to be with my family ... I will be back soon and will see you Thursday night on Big Brother.\" When Thursday night arrived, Chen made a point to sign off as \"Julie Chen-Moonves,\" and her message was heard loud and clear by Twitter. Big Brother viewers, and those who are simply curious about what Chen has to say about the circumstances surrounding Moonves, have taken to Twitter to declare that they believe she should be \"cancelled\" and to express their disappointment that Chen is continuing to support Moonves.\nChen's sign-off appeared to be an intentional and calculated response to Moonves' resignation, breaking from a 20-season long tradition of signing off as simply Julie Chen to add Moonves to the end of her name. While Chen has not yet made a formal statement about Moonves' resignation, but the fact that she used his name on Big Brother clued everyone in to the fact that she'll be sticking by her husband for the forseeable future, just as she did in July when Farrow's first New Yorker article was published, saying\n\"I have known my husband, Leslie Moonves, since the late ’90s, and I have been married to him for almost 14 years. Leslie is a good man and a loving father, devoted husband and inspiring corporate leader. He has always been a kind, decent and moral human being. I fully support my husband and stand behind him and his statement.”\nLes Moonves is no longer at CBS, and only time will tell if Julie Chen-Moonves decides to stay with the network.\nIf you or someone you know has been sexually assaulted, call the National Sexual Assault Telephone Hotline at 800-656-HOPE (4673) or visit online.rainn.org.","url":"https://www.bustle.com/p/julie-chens-big-brother-20-sign-off-voiced-support-for-husband-les-moonves-in-the-wake-of-sexual-misconduct-accusations-11916390"}
