{"authors":["Charlie Nash"],"date_download":"2018-10-30 21:53:48","date_modify":"2018-10-30 21:53:48","date_publish":"2017-03-16 18:16:20","description":"Twitter refuses to verify the official account of WikiLeaks' founder and editor Julian Assange, despite his accumulation of over 100,000 followers.","filename":"data/vaneerConsumption/JulianAssangeEnjoyingBeingOneofTwittersDeplorablesAfterSiteRefusestoVerifyAccount.json","image_url":"https://media.breitbart.com/media/2016/10/GettyImages-612355458.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2017_03_16__1540936428.html","title":"Julian Assange 'Enjoying' Being One of Twitters' 'Deplorables' After Site Refuses to Verify Account","title_page":"Julian Assange 'Enjoying' Being One of Twitters' 'Deplorables' After Site Refuses to Verify Account | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Twitter refuses to verify the official account of WikiLeaks’ founder and editor Julian Assange, despite his accumulation of over 100,000 followers.\n“This is absurd,” Assange tweeted on Wednesday, along with a screenshot of Twitter’s verification rejection. “We’ve been trying to verify this account since early October.”\nAssange criticized Twitter’s verification standards, adding, “Twitter has binary class system with proximity to power represented by ‘blue tick’ insignia. I am enjoying being one of its deplorables.”\nTwitter has binary class system with proximity to power represented by 'blue tick' insignia. I am enjoying being one of its deplorables. — Julian Assange (@JulianAssange) March 15, 2017\nAs explained by Mashable, “Twitter typically verifies celebrities and accounts ‘determined to be of public interest’ with a tick,” letting users know that it is the real account of the individual or company.\nThough WikiLeaks’ account is verified, Assange has been repeatedly denied a verification badge on his own account of over 113,000 followers.\nBreitbart Tech has reached out to Twitter for comment.\nCharlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.","url":"https://www.breitbart.com/tech/2017/03/16/julian-assange-enjoying-being-one-of-twitters-deplorables-after-site-refuses-to-verify-account/"}
