{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 21:40:49","date_modify":"2018-10-22 21:40:49","date_publish":"2017-03-16 01:54:38","description":"The ensemble emphasized her slim frame while the frock's crew neck flagged up her porcelain pale skin.","filename":"data/vaneerConsumption/JulianneMoorerocksthighhighPVCbootsinNewYork.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E50368700000578-0-image-a-41_1489628632233.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318604_Julianne-Moore-rocks-tunic-dress-thigh-high-PVC-boots_1540244449.html","title":"Julianne Moore rocks thigh-high PVC boots in New York","title_page":"Julianne Moore rocks thigh-high PVC boots in New York | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Julianne Moore turned out for the 2017 Whitney Biennial in New York on Wednesday night in a funky ensemble that paired a black dress with black PVC boots.\nThe actress, 56, cinched the long-sleeved tunic with a belt at the waist and her shiny boots covered her legs to mid-thigh.\nThe ensemble emphasized her slim frame while the frock's crew neck flagged up her porcelain pale skin.\nStar power: Julianne Moore was the headliner at the 2017 Whitney Biennial at the Whitney Museum pf American Art in New York City on Wednesday night\nJulianne wore her trademark red hair up in tight bun on top of her head.\nShe kept her make-up light with her fine features dusted in rosy blush.\nThe Still Alice Oscar winner thickened her pale lashes with black mascara and added dark pink lip color.\nStyle queen: Julianne, 56, turned out in a funky ensemble that paired a black tunic dress with black PVC boots that gave her legs a wet look\nGood time: The actress laughed as she posed for photos at the event. She cinched her frock at the waist with a belt and carried a wet look black clutch that matched her boots\nFlawless: The Still Alice Oscar winner wore her trademark red hair up in tight bun on top of her head. She kept her make-up light with black mascara on her light lashes and dark pink lip color\nDate night: Julianne was accompanied by her director husband Bart Freundlich who also opted for an all black ensemble\nMusician St. Vincent was also on the VIP guest list for the event and also chose black for the occasion.\nThe singer, 36, opted for a long sleeved knit dress that featured big satin frills at the waist and at the hem.\nShe added color with a pair of red and white socks worn with black pumps and a dash of scarlet lip stick.\nReady to mingle: Musican St. Vincent was also on the VIP guest list for the event with her eyes shadowed with silver shimmer and long black lashes\nMix and match: The singer, 34, opted for a long sleeved knit dress that featured big satin frills at the waist and at the hem\nQuirky: She added color with a pair of red and white socks worn with black pumps and a dash of scarlet lip stick\nGirls star Zosia Mamet showed up in an off-the-shoulder black dress with contrasting cuff sleeves.\nThe outfit featured large buttons on the bodice and a statement belt at the waist while the ankle-length skirt was slit to the thigh at the front.\nThe 29-year-old daughter of playwright David Mamet left her golden blonde air loose and accessorized with hoop earrings and a gold neck chain.\nMeanwhile, Zoe Kravitz, 28, wore a black suit of drainpipe trousers and cropped jacket.\nShe added a shiny gold top and carried a black purse on a gold chain.\nOff the shoulder: Girls star Zosia Mamet, 29, arrived in a black ankle-length dress slit to the thigh at the front and with buttons on the bodice and a large statement belt","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318604/Julianne-Moore-rocks-tunic-dress-thigh-high-PVC-boots.html"}
