{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:23:50","date_modify":"2018-10-30 21:23:50","date_publish":"2018-07-06 14:03:00","description":"Attack of the Killer Tomato Festival and more food events in Atlanta July 2018: There are tons of events for food and drink lovers this month, with everything from a festival dedicated to tomatoes to a celebration of French Basque country.","filename":"data/vaneerConsumption/July2018foodanddrinkevents.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/07/19/Images/photos.medleyphoto.7704921.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_th_73e494698037f7da21f9544f73ea5a49__1540934630.html","title":"July 2018 food and drink events","title_page":"Things to do Atlanta: July 2018 food and drink events","title_rss":"NULL","source_domain":"ajc.com","text":"There are tons of events for food and drink lovers this month, with everything from a festival dedicated to tomatoes to a celebration of French Basque country.\nIf you love tomatoes, there are two ways to get your fix this month. A dinner the night before Ford Fry’s Attack of the Killer Tomato Festival will feature a five-course dinner with tomato-inspired dishes and cocktails from chefs including Kevin Fink of Emmer & Rye in Austin and Josh Habiger of Bastion in Nashville.\nThe next day, check out the 10th annual Attack of the Killer Tomato Festival featuring tomato-based drinks and dishes from some of the top chefs in the Southeast, as well as music from G. Love and Special Sauce and a live auction.\nProceeds from both events will go to benefit Georgia Organics.\nPre-Attack Feast, 6:30 p.m. July 14, 2018. $250. The Optimist, 914 Howell Mill Road, Atlanta. 404-477-6260, theoptimistrestaurant.com. Attack of the Killer Tomato Festival, 1-5 p.m. July 15. $65-$130. JCT Kitchen & Bar, 1198 Howell Mill Road, Atlanta, Ga. 404-355-2252, killertomatofest.com/.\n[...]\nTake a beer-focused road trip with the Atlanta Beer Boutique’s Chicks Get Lit Road Trip. The trip, which will begin and end at Torched Hop in Midtown, will bring participants to River Watch Brewery in Augusta, where beer is brewed by a mother-daughter team, after you enjoy a meal at a local restaurant. Tickets include a seat on the bus, swag and a tour of the brewery with a meet and greet with the owners.\n9:30 a.m.-6 p.m. July 14, 2018. $50. culinarylocal.com/event/chicks-get-lit-road-trip/.\nWant to try your hand at making pasta? Join White Bull chef Pat Pascarella for a two-hour, hands-on pasta-making class. All guests will receive an apron, a recipe card and a glass of prosecco, then learn to make extruded or rolled pasta that they can take home with them.\n11 a.m. July 21, 2018. $65. The White Bull, 123 E. Court Square, Decatur, Ga. 404-600-5649, eventbrite.com/o/the-white-bull-17275851327.\nTake a drive for a good cause at a dinner to benefit Foxfire and Timpson Creek Farm. Held at Tiger Mountain Vineyards’ Red Barn, the “Forager’s Feast” event, focused on food from Southern Appalachia, will be led by chef David Sweeney, wild foods experts Patricia Kyritsi Howell and Cara Lee Langston, and Darby Weaver, farm manager for Timpson Creek Farm. Throughout the evening, Foxfire educators and students will share images and interviews from its archives about wild foods and their role in Southern Appalachia. Foxfire and Timpson Creek Farm will share how they are collaborating to raise awareness about local foodways in order to revive and reclaim food traditions in the region.\n6-9 p.m. July 28, 2018. $100. Tiger Mountain Vineyards, 2592 Old 441 S., Tiger, Ga. foragefeast.eventbrite.com.\nTake a tour of French Basque country without leaving Atlanta during Cooks & Soldiers’ Fêtes De Bayonne. The event will begin with the iconic “throwing of the keys” and will feature live entertainment and food and drink tastes from stations throughout the restaurant including mousse de foie poulet, aubergine barbajuan and gateau d socca as well as gin tonics, pastis and rosé. Guests are encouraged to wear all white with red accents to embrace tradition.\n4-9 p.m. July 29, 2018. $45-$65. Cooks & Soldiers, 691 14th St. NW, Atlanta, Ga. 404-996-2623, cooksandsoldiers.com.\nCelebrate Georgia’s most beloved fruit at PeachFest, featuring chefs and bartenders including Hector Santiago of El Super Pan, Richard Tang of Char and Terry Koval of The Wrecking Bar whipping up peach-inspired dishes and drinks. Also look for a silent auction and live music.\n﻿4-7 p.m. July 29, 2018. $60-$100. Broad Street NW, Atlanta, Ga. peachfest.org/\nRELATED:\nTop Atlanta festivals in July, including Atlanta Ice Cream Festival\nDon’t spill a drop: The second Waiters’ Race Atlanta is coming\nAJC Calendar: Find more food and wine events in Atlanta\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/the-can-miss-metro-atlanta-food-and-drink-events-july/1006poXkTUKphDqp10VSSK/"}
