{"authors":[],"date_download":"2018-10-30 21:26:27","date_modify":"2018-10-30 21:26:27","date_publish":"2018-07-03 09:00:00","description":"New Saint Leo University poll shows most of us think we're patriotic but disagree on what that looks like","filename":"data/vaneerConsumption/July4thagoodtimetotalkaboutpatriotism.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/03/Images/newsEngin.22413027_070517-4th-features-HS26.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_what-makes-you-american-patriot__1540934787.html","title":"July 4th a good time to talk about patriotism","title_page":"July 4th a good time to talk about patriotism","title_rss":"NULL","source_domain":"ajc.com","text":"If you’re among those astonished by the cheers and applause of folks elated at the suggestion that NFL players who take a knee during the national anthem be fired, if you could never quite understand why they saw that as somehow unpatriotic, let’s talk about that.\nWith the Fourth of July this week, the time just seems right.\nThe argument has been made over and over that the protests were never about patriotism but rather systemic racial inequality in our criminal justice system, starting with how communities of color are policed.\nWATCH: Trump Says NFL Owners Should 'Fire' Players Protesting the National Anthem\nThose cheering, however, either didn’t understand that or didn’t care.\nA new study by the Saint Leo University Polling Institute suggests why there is such a divide.\nAlthough most Americans view themselves as patriotic, few agree on what that looks like. Some say it’s being proud of the men and women who serve in our military and the charitable nature of Americans. Some point to living in a strong democracy and our nation being a beacon of hope to people worldwide. And some say it’s our “can do” spirit, faith in capitalism and President Donald Trump.\nHence, we don’t seem to have much common ground on what makes one patriotic, said Frank Orlando, the director of the Saint Leo University Polling Institute and author of the study.\nOverall, according to the poll, 85.5 percent of Americans report being patriotic, compared to 10 percent who consider themselves less patriotic or not at all patriotic.\nRELATED | Everything to do in and around Atlanta on the holiday\nThe most frequently stated reason for that: Trump, according to 62.4 percent.\nOther reasons cited included the idea that the nation is going in the wrong direction (45.5 percent); the nation is too divided (45.5 percent); having little or no faith in democracy today (40.6 percent); just not proud of the country (40.6 percent); don’t agree with U.S. foreign policy (29.7 percent); nation is becoming too conservative (17.8 percent); and the nation is becoming too liberal (8.9 percent).\nOrlando suspects, too, that those bedrock American institutions like, for example, organized religion that once served as unifying forces have been on the decline at least since the 1970s.\n“Without things we hold in common across party lines, there is less tethering us to the idea that we are more alike than different,” he said. “We can think of those we disagree with politically as the other, which dehumanizes them and leads to even more polarization.”\nSo what is patriotism?\nOrlando defines it this way: having an emotional connection to the country and manifesting that connection by acting as a good citizen.\nFrank Orlando is the director of the Saint Leo University Polling Institute and a political scientist at the main campus in Florida. There are three Saint Leo locations in metro Atlanta. CONTRIBUTED (The Atlanta Journal-Constitution)\nMary A. Evins, an associate professor of history and director of the American Democracy Project for Civic Learning at Middle Tennessee State University, said that how we express patriotism is a manifestation of our core American values.\n“The divide about patriotism clearly parallels the divide we have throughout the entire country today in terms of our thinking,” she said. “Rule-bound, hidebound, fear-based, intractable, jingoistic authoritarianism is peaking in this country.”\nThe problem is authoritarianism apparently seeks to “own” patriotism.\nRELATED | Do white NFL fans see players as human or as mascots?\n“The utter irony, however, is that the revolutionary spirit that brought our nation into being in 1776 — the Declaration of Independence against such authority — is what July Fourth celebrates and honors,” Evins said.\nShe said that the Founding Fathers sought redress from tyranny and restraints. An “originalist” could argue that true patriotism is the very act of defying norms at personal risk in order to support and uphold the highest principles of America’s truest, finest values: welcome for the poor and needy, equality, diversity, free speech, liberty of conscience, to name just a few.\nMary A. Evins, an associate professor of history and director of the American Democracy Project for Civic Learning at Middle Tennessee State University, says that how we express patriotism is a manifestation of our core American values. CONTRIBUTED (The Atlanta Journal-Constitution)\n“Thomas Jefferson understood that true patriots will continually defy tyranny,” she said. “In a parallel universe, intriguingly, in a ‘Christian nation’ as the right sees it, Christ similarly threw the Pharisees out of the temple for their rigid adherence to hard rules that did not carry the spirit of love he advocated.”\nI mentioned the NFL protests.\nRELATED | NFL owners adopt new policy on national-anthem protests\nThe Saint Leo poll shows that most of us support the NFL’s new policy of fining teams when their players on the field kneel or fail to show respect for the U.S. flag during the playing of the national anthem.\nSpecifically, 77.5 percent who say they are conservative support the new rule while 51.5 percent who say they are moderate offer support, and 39.7 percent who identify as liberal say they support the new NFL policy. Race and party affiliation do come into play in the poll results, but not to a great degree.\nEach week, Gracie Bonds Staples will bring you a perspective on life in the Atlanta area. Life with Gracie runs online Tuesday, Thursday and alternating Fridays. (The Atlanta Journal-Constitution)\n“It’s remarkable how consistently popular the decision by NFL owners is,” said Orlando, the Saint Leo political scientist. “Majorities of basically every demographic and political group approve of the rule. Across age, education levels and income, there is consistent support. Blacks, liberals and Democrats disapprove on the whole, but around 40 percent of those groups agree with the policy. This isn’t exactly a slam-dunk.”\nAs for Evins, she said that this Fourth of July, she and her family celebrated the American spirit of refreshing our commitment to enlightenment thinking and our national heritage built by the thinkers who decried oppression to establish a nation of justice, personal voice, and human dignity.\n“There is nothing more patriotic than Americans willing to stand up, march, sit in, or kneel down for what they believe,” she said. “Is kneeling not a position of supplication, humbly asking for wrongs to be righted?”\nFind Gracie on Facebook (www.facebook.com/graciestaplesajc/) and Twitter (@GStaples_AJC) or email her at gstaples@ajc.com.","url":"https://www.ajc.com/lifestyles/what-makes-you-american-patriot/0vu6TriVmyuSWMZCU7BaXO/"}
