{"authors":[],"date_download":"2018-10-30 20:44:21","date_modify":"2018-10-30 20:44:21","date_publish":"2016-06-03 10:06:28","description":"Eurogroup president Jeroen Dijsselbloem has criticised European Commission President Jean-Claude Juncker for comments on France.","filename":"data/vaneerConsumption/JunckersRemarksOnFranceDamageCredibilityOfCommission.json","image_url":"https://media.breitbart.com/media/2016/06/Eurogroup-President-and-Dutch-Finance-Minister-Jeroen-Dijsselbloem-rings-the-bell-prior-to-a-meeting-of-Eurogroup-ministers-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_06_03__1540932261.html","title":"Juncker's Remarks On France Damage Credibility Of Commission","title_page":"Juncker's Remarks On France Damage Credibility Of Commission - Dijsselbloem","title_rss":"NULL","source_domain":"breitbart.com","text":"BERLIN (Reuters) – Eurogroup president Jeroen Dijsselbloem (pictured above) has criticised European Commission President Jean-Claude Juncker for saying that the European Commission has given France leeway on fiscal rules “because it is France”.\n“If the Commission President says that things apply differently for France, then this really damages the credibility of the Commission as guardian of the pact,” Dijsselbloem said in an interview with German daily Sueddeutsche Zeitung and six other European newspapers.\nOn Tuesday, asked why the Commission had on several occasions turned a blind eye to French infractions, Juncker said in an interview with the French senate television Public Sénat that it did so “because it is France”.\n“It would be wise for the Commission to pay a little more attention to its credibility,” said Dijsselbloem, adding that member states needed an “objective arbitrator” who upholds the budget rules manifested in the Stability and Growth Pact.\nThe European Union is debating how to best apply its fiscal rules, which require a budget deficit of under 3 percent of GDP and public debt to fall, at a time when some argue that more public spending would help boost economic growth.\nThe Commission, which is in charge of monitoring national budgets and recommending corrective measures, is sometimes accused by Germany and other northern euro zone governments of being to lenient in applying EU budget rules.\nThe EU executive arm gave France in 2015 two more years to bring its deficit below 3 percent of GDP, even though Paris appeared to miss agreed targets.\n(Reporting by Michael Nienaber; Editing by Hugh Lawson)","url":"https://www.breitbart.com/europe/2016/06/03/junckers-remarks-france-damage-credibility-commission-dijsselbloem/"}
