{"authors":["Jon Fleischman"],"date_download":"2018-10-30 21:14:50","date_modify":"2018-10-30 21:14:50","date_publish":"2016-02-03 13:18:43","description":"Prop. 50 would allow either chamber of the legislature, by a two-thirds vote, to suspend a member of that body without pay or benefits.","filename":"data/vaneerConsumption/JuneBallotMeasureaReminderofCapitolCorruption.json","image_url":"https://media.breitbart.com/media/2015/07/Leland-Yee-Justin-Sullivan-Getty-1024x768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_03__1540934090.html","title":"June Ballot Measure a Reminder of Capitol Corruption","title_page":"June Ballot Measure a Reminder of Capitol Corruption | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"California Secretary of State Alex Pedilla has assigned a number, Proposition 50, to the only measure to appear on the upcoming June primary ballot.\nIf passed by the voters, Prop. 50 would amend the state constitution to allow either chamber of the legislature, by a two-thirds vote, to suspend a member of that body without pay or benefits.\nThe measure stands as a reminder of the corruption that has gripped the California State Capitol in recent years.\nTo understand the origin of this measure, placed on the ballot by the legislature, you need only look back to March 28, 2014. That was just days after State Senator Leland Yee became the third Democrat in the legislature’s upper chamber to become embroiled in criminal wrong-doing, with the federal government charging Yee with gun-running, illegal sale of firearms, of taking tens of thousands of dollars in cash bribes, and more.\nThe previous month, State Senator Ron Calderon had been indicted by the federal government on bribery and corruption charges. A month before that, State Senator Rod Wright was convicted by a jury of multiple felony counts of voter fraud and perjury.\nThen-State Senate President Darrell Steinberg was part of a bi-partisan Capitol establishment which largely looked the other way, permitting Wright to serve after being charged, and–incredibly–after being found guilty. Calderon was also allowed to continue to serve despite his high-profile charges. Public calls by several Republican Senators to take action, including a formal resolution to expel Wright, were buried by Steinberg and not permitted to come to a vote. It wasn’t until Yee was indicted that finally the pressure on the State Senate leadership was such that they were forced to act.\nYee’s indictment was apparently the proverbial straw that broke the camel’s back, and the Senate voted to suspend Calderon, Wright and Yee. When that was done, it was made clear that there was no authority under the state constitution to stop paying the Senators their $90,526 annual pay–and benefits. At that time the constitutional amendment that would become Prop. 50 was introduced.\nWright remained in the Senate until appeal of his conviction was denied. Calderon and Yee served through the end of their terms in 2014, while suspended from their official duties. Both have criminal trials pending.\nCalifornia state law allows only for measures placed on the ballot before the legislature to appear on the June ballot. All measures qualified by gathering signatures must appear in November. It is anticipated that over fifteen measures will appear on the general election ballot.","url":"https://www.breitbart.com/politics/2016/02/03/junes-lone-ballot-measure-reminder-of-capitol-corruption/"}
