{"authors":["Lindsay Denninger"],"date_download":"2018-10-31 01:41:12","date_modify":"2018-10-31 01:41:12","date_publish":"2018-09-14 20:00:52","description":"MAJOR spoilers ahead for Episodes 1 and 2 of Forever. Anyone who’s ever been in a long-term relationship knows that it’s not all sunshine and roses. Once the honeymoon period is over, couples have to work every day to stay together — it’s a choice…","filename":"data/vaneerConsumption/JuneOscarsMarriageOnForeverShowsThatItsOKIfTheLoveOfYourLifeBoresYouSometimes.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/023f3421-4a54-4b22-9a91-77353d4d8609-forever.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_june-oscars-marriage-on-forever-shows-that-its-ok-if-the-love-of-your-life-bores-you-sometimes-11848369_1540950072.html","title":"June & Oscar’s Marriage On ‘Forever’ Shows That It’s OK If The Love Of Your Life Bores You Sometimes","title_page":"June & Oscar’s Marriage On ‘Forever’ Shows That It’s OK If The Love Of Your Life Bores You Sometimes","title_rss":"NULL","source_domain":"bustle.com","text":"MAJOR spoilers ahead for Episodes 1 and 2 of Forever. Anyone who’s ever been in a long-term relationship knows that it’s not all sunshine and roses. Once the honeymoon period is over, couples have to work every day to stay together — it’s a choice to be partnered up, and though it’s a wonderful choice to make, there are some days where one wonders if he or she wouldn’t be better off flying around the world solo to meet interesting new people and have no-strings-attached sex. But still, you stay. And you press on. And that’s why June and Oscar’s marriage on Forever is so revolutionary and interesting for television.\nWhen you start watching Forever, it’s pretty evident that Oscar (Fred Armisen) and June (Maya Rudolph) themselves aren’t that revolutionary. In fact, their love is kind of boring — that’s the beauty of it. They have a marriage in which they do the same thing every year, going to a lake house and catching fish and eating it, Oscar placing the plate in front of June with aplomb on an annual basis. There’s a sort of quiet reassurance in these everyday acts of love, and June and Oscar go on and on until a suggestion they abandon the lake for a mountain puts them on the slopes — and Oscar killed in a skiing accident. Yes, this is one of those shows that kills off the main character in the first episode, but bear with us here.\nFollowing Oscar’s untimely death, June struggles to move on. But once a promotion falls into her lap, she takes it. It means a new life, and a move to a new state — Hawaii. She even gets to fly first class there! But a rogue macadamia nut sends June to the ever after where — surprise — Oscar is waiting for her. And here we go.\nColleen Hayes/Amazon Studios\nThe disappointment, happiness, and sadness on Maya Rudolph’s face (she plays June) sums it all up for June. She loved her husband, but she moved on without him, and she was excited, even, to begin the next chapter of her life. To live what was left of it to the fullest. And now that she’s back with Oscar, she gets her ordinary life back… but she is also robbed of the promise and potential of being able to start over.\nTypical television marriages and partnerships are either absolutely terrible (Betty and Don Draper on Mad Men) or idyllic (Randall and Beth on This Is Us). There’s not a lot of in between, and that’s where June and Oscar fit in. June loved Oscar and was crushed to have him gone. Now, though, she’s suffering another loss entirely — the loss of the life she imagined for herself after Oscar was gone. It’s a second death in itself, and one June could use to resent Oscar. It’s not that Oscar killed June or brought her to the heaven-ish place where they now reside — it’s that he represents her old life. The life she had to push past from. It’s all the same. June and Oscar were lovers and partners for years, but can she still love him now, after everything they’ve gone through? If relationships are most successful when partners can grow together, what happens to a coupling when they’re stuck in a state of arrested development in the ever after? Forever will, I’m sure, explore this as the episodes continue.","url":"https://www.bustle.com/p/june-oscars-marriage-on-forever-shows-that-its-ok-if-the-love-of-your-life-bores-you-sometimes-11848369"}
