{"authors":["Kate Pickles For Mailonline"],"date_download":"2018-10-23 03:31:33","date_modify":"2018-10-23 03:31:33","date_publish":"2016-01-11 16:09:25","description":"Up to 45,000 junior doctors in will go on strike for 24 hours from 8am tomorrow in England in a protest against changes to their pay and working conditions. Emergency care will be provided.","filename":"data/vaneerConsumption/Juniordoctorspreparetostrikeoverpayashealthchiefsissuewarning.json","image_url":"https://i.dailymail.co.uk/i/pix/2015/12/30/09/2FADADCE00000578-0-image-a-9_1451467733174.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3394077_Stay-away-hospitals-tomorrow-unless-s-dire-emergency-Health-chiefs-issue-warning-45-000-junior-doctors-prepare-strike-pay-conditions_1540265493.html","title":"Junior doctors prepare to strike over pay as health chiefs issue warning","title_page":"Junior doctors prepare to strike over pay as health chiefs issue warning | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Patients have been warned to stay away from hospitals during tomorrow's junior doctors strike' and only attend if absolutely necessary.\nUp to 45,000 junior doctors will go on strike for 24 hours from 8am in a protest against changes to their pay and working conditions.\nThe industrial action means thousands of operations and appointments have been cancelled across England.\nAbout 100 picket lines are being put in place for the strike, with a large concentration in and around London.\nJunior doctors will only provide 'emergency care only' until 8am on Wednesday when the strike ends.\nThis means some of them will still be on rota to work in Accident and Emergency departments and cover other emergency services in hospitals.\nAbout 45,000 junior doctors are expected to walk out on January 13 unless an agreement can be reached\nThe BMA will be supporting around 100 picket lines across England, pictured here in blue, as an estimated 45,000 junior doctors are expected to strike from 8am tomorrow\nExtra consultants, doctors and nurses who are not protesting have been drafted in to provide cover for their striking colleagues while most outpatient clinics and non-essential treatments have been cancelled.\nLocums already scheduled to work tomorrow will be able to work as normal but a law prevents employers from using agency staff to cover striking workers.\nThere are also 17,000 junior doctors who are not BMA members who are expected to work.\nFurther walk outs are planned for 48 hours on Tuesday, 26 January as well as a full walk-out, which will include A&E junior doctors, from 8am to 5pm on Wednesday, 10 February.\nDavid Cameron today begged junior doctors to call off their 'damaging' strike, saying it will cause 'real difficulties' for patients and 'potentially worse' scenarios.\nNHS England claims that everything possible is being done to ensure the provision of safe emergency care and to minimise the impact on patients.\nToday, it issued the following advice to the public:\nUrgent and emergency care services will be available as normal but hospitals are expected to be under additional pressure\nWhere possible, people should contact their GP, seek advice from their local pharmacist, call NHS111 or consult the NHS Choices website\nWhere it is an emergency, people should call 999 or go directly to A&E\nGP services will be available as normal and anyone who thinks they will need an appointment is encouraged to organise this before industrial action begins\nAny patients who have procedures or appointments affected by industrial action will be contacted by the providers if they need to be rearranged.\nPeople should be particularly attentive to their health over this period and look out for more vulnerable members of their families and communities.\nDoctors union the BMA said it 'deeply regretted' the disruption the industrial action would cause patients, but insisted it was necessary because the proposed contract changes would 'damage patient safety'\nJunior doctors are set to go on strike after weeks of talks between the British Medical Association (BMA) and the Government failed to reach an agreement.\nThe planned industrial action was suspended last month hours before the first planned walk-out after union representatives and the Government agreed to get back around the negotiating table.\nBut despite weeks of discussions on medics' proposed new contracts, the BMA last week announced its plans for disgruntled employees to walk out for the first time in 40 years.\nWHAT IMPACT WILL THE STRIKE HAVE? 3,960 operations, scans and tests cancelled and postponed until a later date 17,500 outpatients appointments cancelled and postponed Patients who are affected will have received letters through their door. Otherwise they should turn up as usual A&E units may be crowded – patients advised to stay away unless they are seriously ill GP surgeries busier – patients have been urged to avoid trying to make an appointment today as some surgery doctors are on strike\nOfficials said they were confident the contingency plans will provide safe and effective care to patients.\n'We have tried and tested plans to deal with a range of disruptions including industrial action,' said Anne Rainsberry, the NHS England director overseeing preparations, said.\n'As ever, the safety and care of patients is our top priority and the NHS has robust plans in place to ensure those who need emergency treatment will continue to receive it.\n'We have been working with hospitals and other NHS providers across the country to ensure we can continue to protect the safety of our patients and provide the urgent services they need.\n'We will monitor the situation across the country to ensure these plans are in place, and are ready to respond to any significant increases in pressure in any region over the course of this dispute.'\nIt said 1,425 inpatient operations and procedures have been cancelled as a result of the strike alongside 2,535 outpatient ones.\nIt said there were about 4,000 cancellations in total, of which 3,400 are on Tuesday.\nThe dispute centres around Jeremy Hunt's revised contracts for junior doctors.\nHe claims the new contracts will make hospitals safer by ensuring more doctors work evenings and weekends when death rates are up to 16 per cent higher.\nBut junior doctors fear the new rotas will leave them exhausted and prone to mistakes, and that their overall earnings will be slashed.\nConsultants, nurses and doctors who are not protesting will be asked to cover for striking colleagues if the industrial action goes ahead next month\nUnder the proposed contract changes, junior doctors in England will get an increase in their basic pay, but will have to work more weekends while guaranteed pay rises linked to time in the job will be axed and bonus pay for working unsociable hours will be curbed.\nLast week, the Health Secretary said the Government thought it was 'making very good progress' in talks and he was disappointed the BMA had called strikes.\nHe said that 'no government' wanted to cut doctors' pay but changes must be made to increase weekend staffing levels.\nAs ever, the safety and care of patients is our top priority and the NHS has robust plans in place to ensure those who need emergency treatment will continue to receive it Anne Rainsberry, NHS England\nThe Government's plan to get rid of 'pay progression', or automatic annual salary increases, is reportedly one key sticking point of negotiations.\nIt is also understood that another key point involves plans to scrap fines imposed on hospitals which force junior doctors to work beyond their maximum hours, as determined by the European Working Time Directive.\nThe BMA opposes the planned change, which would see a new system overseen by the Care Quality Commission.\nThousands of medical students have also voiced their support to junior doctors by signing a pledge on the BMA website.\nEngland's chief medical officer Dame Sally Davies said on Sunday the strike would 'lead to patients suffering'.\nThis morning, Jeremy Corbyn told the BBC Radio 4 Today programme: 'We should recognise that junior doctors are qualified, extremely hard-working, deserve to be treated properly and (Health Secretary) Jeremy Hunt should now come to an agreement with them.'\nHe added: 'I hope that Jeremy Hunt realises the need to come to an agreement very quickly.'\nA total of 28,316 junior doctors took part in a ballot in November last year, of whom 99 per cent voted in favour of staging industrial action and 98 per cent for an all-out strike.\nJunior doctors were set to walk out on 1, 8 and 16 December 1, 8 and 16 but the action was called off at the 11th hour when Acas tried to broker a deal to avoid disrupting hospital services.\nEven though these strikes were eventually averted, the threat caused mass disruption to the NHS as thousands of patients had operations or appointments cancelled.\nSome 20,000 operations were postponed that had been scheduled for one of the three planned strike days earlier this month.","url":"https://www.dailymail.co.uk/health/article-3394077/Stay-away-hospitals-tomorrow-unless-s-dire-emergency-Health-chiefs-issue-warning-45-000-junior-doctors-prepare-strike-pay-conditions.html"}
