{"authors":["Dominic King For The Daily Mail"],"date_download":"2018-10-23 01:41:55","date_modify":"2018-10-23 01:41:55","date_publish":"2016-01-29 15:51:18","description":"The England international, who has only played 106 minutes for Klopp, published a tweet on Boxing Day saying he “was ready to go” but he has still not trained with Liverpool’s team.","filename":"data/vaneerConsumption/JurgenKlopprulesDanielSturridgeoutofFACupclashwithWestHamasLiverpoolstrikersrehabilitationisdisruptedagainHisinjuryhistorymeansthisisnormal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/309A1B6900000578-0-image-a-90_1454082674678.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423025_Jurgen-Klopp-rules-Daniel-Sturridge-FA-Cup-clash-West-Ham-Liverpool-striker-s-rehabilitation-disrupted-injury-history-means-normal_1540258915.html","title":"Jurgen Klopp rules Daniel Sturridge out of FA Cup clash with West Ham as Liverpool striker's rehabilitation is disrupted again: 'His injury history means this is normal'","title_page":"Jurgen Klopp rules Daniel Sturridge out of FA Cup clash with West Ham as Liverpool striker's rehabilitation is disrupted again: 'His injury history means this is normal' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jurgen Klopp has cast fresh doubt on when Daniel Sturridge will return for Liverpool after admitting 'issues' are disrupting his rehabilitation.\nThe England striker, who has only played 106 minutes for Klopp, published a tweet on Boxing Day saying he 'was ready to go' but he has still not trained with Liverpool's team. He continues to work with the club's medical team, who are doing all they can to get Sturridge ready.\nSturridge damaged his hamstring at Newcastle on December 6 but, given that Klopp wants him to participate in at least seven or eight consecutive training sessions, it seems it will be mid-February at the earliest before he will be available once more.\nLiverpool's manager was non-committal on when Sturridge – who has been absent for 616 of the 1123 days he has been at Anfield – will play but stressed there was no way the 26-year-old will be in the squads for Saturday's FA Cup tie against West Ham or next Tuesday's trip to Leicester City.\nJurgen Klopp has cast fresh doubt on when Daniel Sturridge will return for Liverpool after training disruptions\nKlopp admitted that there have been 'disruption's in Sturridge's attempts to return to full fitness\nSturridge tweeted that he was 'good to go' on Boxing Day but has not played since early December\nKlopp said: 'He is still working. Sometimes it is better, sometimes it is a bit worse because of other issues. That is all. He has done a lot of sessions in the last few weeks but it is always interrupted with a few breaks. He needs consistency in the sessions and that's what we try to do.\n'His injury history means this (slow progress) is normal. It is not coincidence. Some things are not right if you are injured that often. We have to be really sensitive with all the information we get. That is what we try to do. We're trying to find a point from which we can train and build up fitness.\n'He could do a lot of sessions in the last few weeks, but they have always been interrupted with different issues where we always have to see and wait on what happens. We have to work, together with Daniel, on his fitness. I don't know what happens after Leicester to be honest.'\nThe England striker has not featured for Liverpool since appearing as a substitute against Newcastle\nSturridge suffered a hamstring injury after the game in December and has been building on his fitness since\nThe 25-year-old has played only 106 minutes under Klopp and scored twice against Southampton\nKlopp's immediate priority is on West Ham and he will play a much-changed team in the fourth round, as he did against Exeter. His reason this time, though, is because the side that played against Stoke on Tuesday ran 156km (96 miles) to reach the Capital One Cup final.\nJames Milner (10.5miles) ran further than any other player and Klopp says it would be negligent on his part if he asked those who put so much in to do so again, particularly as Liverpool have a schedule of seven games in the next 28 days.\n'It was easy to be brave against Exeter,' said Klopp, who may give a debut to goalkeeper Danny Ward. 'But sometimes you have to be brave in a moment when you really need it and that's what we are doing. I trust these players.\nKlopp says that Sturridge's injury history means that the setbacks he has suffered are 'normal'\nKlopp has ruled Sturridge out of Liverpool's next two games against West Ham and Leicester\nKlopp hopes Philippe Coutinho will be over his own hamstring problem having not played since early January\n'We can't ignore the other games. I can't say 'try it again' – if they are injured we cannot use them. If we know about the intensity of the last game, and the short break to the next one. I can't say go again until you lay on the ground. That doesn't work. So there's no alternative for us.'\nKlopp, meanwhile, insisted he had 'nothing to say' about Liverpool's pursuit of Alex Teixeira. The Brazilian's club, Shakhtar Donetsk, on Friday insisted he had £50million release and would not be leaving unless their demands are met.","url":"https://www.dailymail.co.uk/sport/football/article-3423025/Jurgen-Klopp-rules-Daniel-Sturridge-FA-Cup-clash-West-Ham-Liverpool-striker-s-rehabilitation-disrupted-injury-history-means-normal.html"}
