{"authors":["Press Association"],"date_download":"2018-10-23 03:32:11","date_modify":"2018-10-23 03:32:11","date_publish":"2016-01-11 16:21:12","description":"Jurgen Klopp has revealed Liverpool's defensive injury crisis has cleared a little in time for Arsenal's visit to Anfield on Wednesday night. Klopp expects K...","filename":"data/vaneerConsumption/Jurgenkloppseesliverpoolsinjurieseaseaheadofarsenalclash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-af4ac897-f946-4928-90c0-ef8589c2cbb8-48qEJGFphM8d437f0aaf926dcdd1-245_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3394173_Jurgen-Klopp-sees-Liverpools-injuries-ease-ahead-Arsenal-clash_1540265531.html","title":"Jurgen klopp sees liverpool's injuries ease ahead of arsenal clash","title_page":"Jurgen klopp sees liverpool's injuries ease ahead of arsenal clash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jurgen Klopp sees Liverpool's injuries ease ahead of Arsenal clash\nJurgen Klopp has revealed Liverpool's defensive injury crisis has cleared a little in time for Arsenal's visit to Anfield on Wednesday night.\nKlopp expects Kolo Toure and possibly Mamadou Sakho to play in the middle of his defence against the Barclays Premier League leaders, meaning the Reds may not have to deploy Lucas Leiva as a makeshift centre-back.\nMartin Skrtel and Dejan Lovren are still sidelined with hamstring injuries, although the latter could return to the fold for Sunday's home clash with rivals Manchester United.\nMamadou Sakho could bolster Liverpool's defensive options against Arsenal on Wednesday\nThe scenario is still more positive for Klopp, who was facing up to the possibility of tackling Arsene Wenger's high-flying Gunners without any recognised centre-backs a few days ago.\n\"The situation now is better than it was two or three days before,\" Klopp revealed.\n\"I think Kolo will be available so we have a senior centre-back. Mama wants to be available, hopefully we can use him. We will see.\n\"Martin is still a few weeks, Dejan feels good but his time of injury was the 5th of January so only six days (until Monday) - to Arsenal, eight; United, 11, 12, it's close. There will be a moment when we have to decide if it's a risk or if it's a risk we could try or not, but it's not a moment for this, we have to wait.\n\"That's the situation. We have probably Kolo and Mama, and the next one is Lucas, so three senior centre-backs.\"\nSkipper Jordan Henderson (foot), James Milner (calf) and Jordon Ibe were all absent when Klopp named a much-changed team in the FA Cup third-round tie at Exeter on Friday.\nBut all three, along with Sakho, have a shot at coming into the squad in two days' time.\n\"Jordon Ibe, Jordan Henderson and Mama - these are three, good news,\" Klopp added.\n\"Milly was, but we left him at home too when we were in Exeter. He's still in training so that's all good news.\"\nKlopp has recalled goalkeeper Danny Ward from a loan spell with Aberdeen ahead of schedule, yet he was not forthcoming when asked about January arrivals to Merseyside.\nStriker Alexandre Pato has been linked with a move to Anfield from Brazilian club Corinthians, but the Liverpool boss seemed to pour cold water on suggestions he was on the verge of joining fellow countrymen Lucas, Philippe Coutinho and Roberto Firmino in his squad.\n\"I don't want to answer all the questions about this, I would like to say we don't talk about things like this until we sign a contract,\" Klopp said regarding transfer speculation.","url":"https://www.dailymail.co.uk/wires/pa/article-3394173/Jurgen-Klopp-sees-Liverpools-injuries-ease-ahead-Arsenal-clash.html"}
