{"authors":[],"date_download":"2018-10-23 03:53:42","date_modify":"2018-10-23 03:53:42","date_publish":"2016-01-29 19:15:49","description":"Jurgen Klopp admits he will choose a different team to play West Ham in FA Cup fourth round on Saturday to the one that beat Stoke City in the semi-finals of the Capital One Cup.","filename":"data/vaneerConsumption/JurgenKloppcoyaboutAlexTeixeiramoveasLiverpooltrainaheadofWestHamFACuptiebuttheresstillnosignofDanielSturridge.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/21/30B5185C00000578-0-image-a-2_1454101806081.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_fa_cup_article-3423283_Liverpool-players-training-ahead-FA-Cup-fourth-round-clash-against-West-Ham-s-no-sign-Daniel-Sturridge_1540266822.html","title":"Jurgen Klopp coy about Alex Teixeira move as Liverpool train ahead of West Ham FA Cup tie... but there's still no sign of Daniel Sturridge","title_page":"Jurgen Klopp coy about Alex Teixeira move as Liverpool train ahead of West Ham FA Cup tie... but there's still no sign of Daniel Sturridge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Liverpool's exertions in their midweek Capital One Cup shootout win over Stoke City mean it will be a much-changed side that faces West Ham United in this weekend's FA Cup clash, manager Jurgen Klopp said on Friday.\nKlopp fielded a number of young academy graduates when they beat Exeter City in a replay to come through the FA Cup's previous round and some of those could find themselves thrown back into action at Anfield on Saturday.\nLiverpool played 120 minutes on Tuesday and then had to go through the nail-biting drama of a penalty shootout to beat Stoke in their semi-final, second leg tie, while Saturday's opponents West Ham had no midweek distractions.\nJose Enrique (left) and Christian Benteke (right) preparing for FA Cup action against West Ham on Saturday\nLiverpool manager Jurgen Klopp wants to guide his side to a second cup final this season after Stoke victory\nJames Milner and Adam Lallana enjoy a high spirits training session at Melwood after a successful week\nFormer Brazilian star Ronaldinho has said Liverpoo must focus their game around Roberto Firmino (pictured)\n'Yes. It will be a different team, for sure,' Klopp told reporters.\n'We have to make a few changes, we will make them, but only because we want to win the game.'\nWest Ham have already beaten Liverpool twice in the Premier League this season, but with Klopp's squad currently decimated by injuries, his options are limited.\nThe manager confirmed that captain Jordan Henderson has re-joined an injury list that includes nine of the German's first team squad, having been substituted during the second half of Tuesday's match with a recurrence of his long-term heel injury.\nWhile centre back Dejan Lovren, who was on the bench against Stoke, is now back fit and right back Nathaniel Clyne, recovering from a knee injury, is a possibility to face West Ham, Klopp said striker Daniel Sturridge's woes are on-going.\nThe England striker, whose injury problems have ruled him out of the majority of the last two seasons, has not played since suffering a hamstring problem on December 6 and he will miss at least their next two games, Klopp said.\nEmre Can (left) tries to tackle Lallana (right) as the English midfielder does his best to keep control of the ball\nAlberto Moreno (left) given a tough time by industrious English midfielder Milner who manages to pass forward\nKolo Toure (left), Klopp (centre) and Milner (right) share a joke while in conversation at training on Friday\nGerman manager Klopp gives Lucas Leiva, one of Liverpool's better players this season, a pep talk at training\n'He is still working. Sometimes it's better, sometimes it's worse,' he added.\n'He needs consistency in sessions and that's what we try to do. There's no doubt about his quality. We have to work together on his fitness.'\nKlopp was keeping his cards close to his chest as to whether he will be able to add to his squad in the remainder of the January transfer window, with a number of players including Shakhtar Donetsk forward Alex Teixeira having been linked with a move.\n'There is nothing to say. You have to wait, like I have to wait,' Klopp said.\nDejan Lovren (closest) hasn't played for Liverpool since the League Cup win at away to Stoke in early January\nCentral defender Lovren (centre) will be hoping that he is given a chance to play against West Ham at Anfield\nLiverpool goalkeeper Simon Mignolet produced a fine display in the League Cup semi-final win against Stoke","url":"https://www.dailymail.co.uk/sport/fa_cup/article-3423283/Liverpool-players-training-ahead-FA-Cup-fourth-round-clash-against-West-Ham-s-no-sign-Daniel-Sturridge.html"}
