{"authors":["Carl Markham","Press Association Sport"],"date_download":"2018-10-23 03:58:47","date_modify":"2018-10-23 03:58:47","date_publish":"2017-03-10 13:55:16","description":"Liverpool's five league defeats have all come against bottom-half sides, starting at Turf Moor in August when they had 26 shots but lost after the Clarets scored with their only two shots on target.","filename":"data/vaneerConsumption/JurgenKloppthereisnoplanBforBurnleymatch.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3DF6488F00000578-0-image-a-81_1489153790200.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301326_Jurgen-Klopp-no-plan-B-Burnley-match_1540267127.html","title":"Jurgen Klopp there is no 'plan B' for Burnley match","title_page":"Jurgen Klopp there is no 'plan B' for Burnley match | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Liverpool manager Jurgen Klopp insists there is no special 'plan B' in place to overcome Burnley despite struggling against similar teams this season.\nThe Reds' five league defeats have all come against bottom-half sides, starting at Turf Moor back in August when they had 80 per cent possession and 26 shots but lost after the Clarets scored with their only two shots on target.\nSince then they have been beaten by Bournemouth, Swansea, Hull and Leicester and while none have quite followed the pattern set by Sean Dyche's tactics, there is no doubt teams who sit back and hit on the counter-attack have been more successful against Liverpool.\nLiverpool will be looking to record a second straight league victory on Sunday against Burnley\nKlopp is well aware of the criticism of his side in these moments and the struggles they have had, but stressed that was no reason to completely alter strategy.\n'We don't play checkers,' he said, motioning as if he were moving pieces on a board.\n'We've spoken about the things we have to do but not in the case of a team against the lower part of the table.\n'I know what people say and is not the first people have said something like this but I don't have a Plan B in my mind.\n'We know how to play but in the end you have to come into specific spaces and make the right decisions.\nLiverpol have struggled against bottom-half sides in the league so far this campaign\n'My job is to help them make the right decisions more easily. That is what training is for. It is a challenge.\n'We knew it after the Arsenal game (a 3-1 win last weekend) these questions would be asked. We have to prove it on the pitch.\n'Before the Arsenal game the mood here was quite optimistic but I think a lot of people thought 'if we lose then we have real problems'.\n'In this moment I am not sure we will win against Burnley but I am quite optimistic because I know about the boys.'\nJurgen Klopp will be hoping that Liverpool can get their revenge on Burnley at Anfield\nKlopp's words are very similar to predecessor Brendan Rodgers' when he was asked whether he had an alternative approach to his possession-heavy style of football.\n'If Plan A doesn't work, Plan B is to make a change to make Plan A more effective,' was the Northern Irishman's response.\nKlopp admitted that defeat at Turf Moor on the second weekend of the season remains a source of frustration for him.\nHe does, however, acknowledge and admire the work Dyche has done despite Burnley failing to win an away match in the league this season.\n'Even if we had won all the games against other teams (in the bottom half) Burnley is special because they have the clearest plan of all these teams,' added the German.\nSean Dyche's side beat Liverpool 2-0 at Turf Moor in the reverse fixture earlier on in the season\n'Against Burnley it is clear what you have to expect. They defend like they defend, long balls, counter-attacks, but it is really tuned: (Ashley) Barnes, (Sam) Vokes, (Andre) Gray are running (onto) channel balls in behind, set-pieces, so you know it can't be easy.\n'We need to be ready for work again, creating an atmosphere on the pitch and in the stadium.\n'You miss a chance against Arsenal and no one is surprised. You miss a chance against Burnley and everyone thinks differently - 'Ah, difficult, difficult, we won't have another chance like this'.\n'We need to feel free for playing football. We know about a few problems already but we've had good sessions and we have to go and win the game.'","url":"https://www.dailymail.co.uk/sport/football/article-4301326/Jurgen-Klopp-no-plan-B-Burnley-match.html"}
