{"authors":["Associated Press"],"date_download":"2018-10-22 22:50:56","date_modify":"2018-10-22 22:50:56","date_publish":"2017-04-26 05:55:21","description":"Eric Frein, 33, was sentenced to death after he shot and killed Cpl. Bryon Dickson II, a Marine veteran and married father, in Pennsylvania in 2014.","filename":"data/vaneerConsumption/JurysentencesambushkillertodeathinPennsylvania.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/27/05/3F65C79200000578-0-image-a-120_1493266205196.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446328_Jury-begin-weighing-sentence-police-ambush-killer_1540248656.html","title":"Jury sentences ambush killer to death in Pennsylvania","title_page":"Jury sentences ambush killer to death in Pennsylvania | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A jury convicted Eric Frein (above) of capital murder last week in the ambush slaying of a state police trooper he targeted in 2014\nA survivalist who shot and killed a state trooper and left another seriously injured during an ambush at their Pennsylvania barracks has been sentenced to death.\nEric Frein, 33, was told by a jury he will die by lethal injection, a week after he was convicted of murdering a law enforcement officer and terrorism.\nProsecutors said Frein was hoping to start an uprising against the government when he opened fire on the Blooming Grove barracks in the Pocono Mountains in 2014.\nCpl. Bryon Dickson II, a Marine veteran and married father of two, was killed in the late-night ambush, and Trooper Alex Douglass was critically wounded.\nFrein showed no emotion as the decision was read, while someone on the police side of the gallery shouted 'Yes!'\nThe injured trooper couldn't stop smiling.\nDefense lawyer Bill Ruzzo told reporters he was disappointed by the sentence, and surprised the jury failed to find a single mitigating circumstance that would point to a life sentence.\nCpl. Bryon Dickson II (left) died in the September 12, 2014 attack, as Trooper Alex Douglass (right) was left critically injured\nIn arguing for the death penalty, prosecutors portrayed Frein (above) as a remorseless killer who randomly attacked in hopes of fomenting rebellion\nCol. Tyree Blocker, the state police commissioner, thanked the jury for delivering justice.\n'Cpl. Dickson will always remain in the hearts of all members of the Pennsylvania State Police, forever,' he said outside the courthouse.\nFrein led police on a 48-day manhunt in the Poconos before US marshals caught him at an abandoned airplane hangar.\nHe did not take the witness stand in his own defense, nor did he ask the jury to spare his life in the penalty phase.\nFrein is seen above being led away by Pennsylvania State Police Troopers at the Pike County Courthouse in this January 5, 2015, file photo\nProsecutors said Frein (seen above after his arraignment in October 2014) was hoping to start an uprising against the government when he opened fire with a rifle on the Blooming Grove barracks in the Pocono Mountains in 2014\nHis lawyers had argued for a sentence of life in prison without parole, presenting evidence he'd grown up in a dysfunctional home.\nHis father told the jurors he had failed his son, and his mother said, 'I want my son to be saved.'\nProsecutors portrayed Frein as a remorseless killer who randomly attacked in hopes of fomenting rebellion.\nFrein kept a journal in which he coolly described shooting Dickson twice and watching him fall 'still and quiet.'\nAnd in a letter to his parents, written while he was on the run but never sent, he complained about lost liberties, spoke of revolution and said, 'The time seems right for a spark to ignite a fire in the hearts of men.'\nFrein showed 'wickedness of heart' when he 'made a choice to pull that cold trigger again, again, again and again,' District Attorney Ray Tonkin said in his closing argument Wednesday.\n'Full justice is sentencing this defendant to death,' he said.\nFollowing a tradition that dates to the 19th century, Pike County's sheriff rang the bell atop the courthouse eight times, heralding that Frein had received a death sentence.\nThe bell last tolled for a condemned inmate in the 1980s.\nThe sentencing caps a saga that began Sept. 12, 2014, when Frein hid in the woods across the street from the barracks and targeted Dickson as he was leaving work.\nHe then shot Douglass, who had come to the aid of his mortally wounded comrade.\nPolice linked Frein to the ambush after a man walking his dog discovered his partly submerged SUV three days after the ambush in a swamp a few miles from the shooting scene.\nInside, investigators found shell casings matching those found at the barracks and Frein's driver's license.\nThe discovery sparked a manhunt that involved 1,000 law enforcement officials and spanned more than 300 square miles, rattling communities throughout the Poconos.\nHis lawyers did not contest his guilt, focusing their efforts on trying to save his life during the penalty phase of the trial.\nThe defense told jurors that Frein grew up with an angry, domineering and abusive father who imparted his anti-government and anti-police views to him.\nTiffany Dickson, the widow of slain Pennsylvania State Police Trooper Cpl. Bryon Dickson, is escorted by a Pennsylvania State Police Trooper during a preliminary hearing for Frein at the Pike County Courthouse in Milford, Pennsylvania, in January 2015\nLawyers asked the jury to consider Frein's relationship with his dad, Eugene Michael 'Mike' Frein, a mitigating circumstance as it weighed a sentence of life or death.\nTonkin ridiculed the effort to cast Frein's father as a villain, saying Frein's lawyers were trying to 'deflect from the murderer over there and put Eugene Frein on trial.'\nDickson's widow, meanwhile, gave emotional testimony about how she and her two young sons have struggled since his murder, and Douglass, the injured trooper, described suffering from a range of health problems since Frein shot him through both hips.\nThough the gunman faces a bleak existence on death row, he likely won't face execution for decades, if ever.\nDemocratic Gov. Tom Wolf has imposed a moratorium on the death penalty, and Pennsylvania's last execution took place in 1999.\nThe state has executed only three people since the US Supreme Court restored the death penalty in 1976.\nFrein's lawyers have promised to tie up his case in appeals.","url":"https://www.dailymail.co.uk/news/article-4446328/Jury-begin-weighing-sentence-police-ambush-killer.html"}
