{"authors":[],"date_download":"2018-10-30 19:43:28","date_modify":"2018-10-30 19:43:28","date_publish":"2016-09-19 15:14:39","description":"The need to meet his daily arrest quota led a DeKalb County police officer to scatter marijuana on the ground where Alphonso Eleby was sitting so Eleby could be charged with a crime and taken to jail, according to a pending federal lawsuit.","filename":"data/vaneerConsumption/JurytodecideifDeKalbpolicequotasledtofalsearrest.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_judge-jury-decid_01e41c5fb772d08615cdce4dbbd14cb5__1540928608.html","title":"Jury to decide if DeKalb police quotas led to false arrest","title_page":"Jury to decide if DeKalb police quotas led to false arrest","title_rss":"NULL","source_domain":"ajc.com","text":"The need to meet his daily arrest quota led a DeKalb County police officer to scatter marijuana on the ground where Alphonso Eleby was sitting so Eleby could be charged with a crime and taken to jail, according to a pending federal lawsuit.\nThe judge hearing the case wrote in an order that there was evidence that DeKalb County Police Department set ticket and arrest quotas for its officers. But, the judge wrote in a recent order, a jury would have to decided if that was the reason Eleby was arrested in a gas station parking lot in 2012.\nDeKalb PD says the agency does not have quotas but it does expect officers to reach benchmarks.\nVideo from the stores surveillance cameras show officer Demetrius Kendrick appearing to drop something on the ground and then call over fellow officers to see what he had found. Eleby was arrested for possession of marijuana even though he had been strip searched twice and his pockets remained turned inside out before the leaves of marijuana were supposedly spotted.\nThe drug case against Eleby was dropped two years later due to lack of evidence. Kendrick remains on DeKalb’s force.","url":"https://www.ajc.com/news/local/judge-jury-decide-dekalb-police-quotas-led-false-arrest/PXtqnGPbWNNCnzmEidUmbI/"}
