{"authors":["Associated Press","Anton Nilsson For Dailymail.Com"],"date_download":"2018-10-23 00:25:21","date_modify":"2018-10-23 00:25:21","date_publish":"2016-01-28 14:20:43","description":"A South Carolina judge has ordered that a jury pool of 600 be summoned in trial of a man accused in the shooting deaths of nine parishioners at a Charleston church last June.","filename":"data/vaneerConsumption/Jurypoolof600tobesummonedinCharlestonchurchmassacrecase.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACE44600000578-0-image-a-2_1454007488010.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420949_Jury-pool-600-summoned-church-shooting-case_1540254321.html","title":"Jury pool of 600 to be summoned in Charleston church massacre case","title_page":"Jury pool of 600 to be summoned in Charleston church massacre case | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dylann Roof, 21, is accused of murdering nine people in a South Carolina church last year\nA South Carolina judge has ordered that a jury pool of 600 people be summoned in the trial of a white man accused in the shooting deaths of nine black parishioners at a Charleston church last June.\nThe state is seeking the death penalty in the trial of 21-year-old Dylann Roof, who faces nine counts of murder, three counts of attempted murder and a weapons charge in the slayings that occurred during a Bible study at Emanuel African Methodist Episcopal Church on June 17, 2015.\nThe trial is set to begin on July 11.\nOn Wednesday, Circuit Judge J.C. Nicholson issued an order saying a jury pool of 600 is needed because of the complexity of the case.\nThe judge also ordered that questionnaires that will be used to screen potential jurors remain sealed until they are given to members of the jury pool June 28.\nMembers of the pool will then report back to the court in groups of 20 to be questioned by attorneys the day the trial is set to begin.\nAttorneys have said the trial is expected to last several weeks.\nEmanuel African Methodist Episcopal Church pastor and South Carolina State Senator Clementa Pinckney lies at the South Carolina State House in Colombia, South Carolina, on June 24. Pinckney was one of nine people killed during a Bible study inside the Emanuel AME church in Charleston\nRoof also faces dozens of charges, including hate crimes and obstruction of the practice of religion, in federal court.\nProsecutors have not yet said whether the federal government will seek the death penalty and indicated in earlier hearings it could be March before the Justice Department makes a decision.\nA hearing on the status of that case will be held next month.\nDylann Roof posted this and several other pictures of himself posing with a gun and a Confederate flag shortly before killing nine black parishioners inside a Charleston, South Carolina church last June","url":"https://www.dailymail.co.uk/news/article-3420949/Jury-pool-600-summoned-church-shooting-case.html"}
