{"authors":["Associated Press"],"date_download":"2018-10-23 01:52:21","date_modify":"2018-10-23 01:52:21","date_publish":"2016-01-28 16:18:25","description":"BOWLING GREEN, Ohio (AP) — Jurors couldn't agree on a verdict in the trial of a man arrested last year in the killing of a young woman found dead in a street...","filename":"data/vaneerConsumption/JuryinOhiofailstoreachverdictin1982killingofwoman.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421249_Jury-Ohio-fails-reach-verdict-1982-killing-woman_1540259541.html","title":"Jury in Ohio fails to reach verdict in 1982 killing of woman","title_page":"Jury in Ohio fails to reach verdict in 1982 killing of woman | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jury in Ohio fails to reach verdict in 1982 killing of woman\nBOWLING GREEN, Ohio (AP) — Jurors couldn't agree on a verdict in the trial of a man arrested last year in the killing of a young woman found dead in a street 33 years ago.\nThe jury spent seven hours considering the evidence Wednesday and insisted they were deadlocked, even when the judge urged them to keep trying.\nThe judge declared a hung jury and deputies took Russell Adkins, 56, of Whitehouse, back to jail. A new court hearing was scheduled for Monday.\nAdkins was charged in the killing of 19-year-old Dana Rosendale after authorities exhumed her body and ruled her death a homicide due to trauma to her head.\nRosendale died a few days after she was found in a suburban Toledo street in September 1982. The cause of her death was undetermined at the time.\nAdkins told police he found Rosendale and then later told authorities she had fallen out of his car, according to media reports. He was not charged then.\nHe said he was giving her a ride home from a nightclub when she fell out of his car because of a faulty door latch.\nA message seeking comment was left with prosecutors Thursday. Attorneys for Adkins declined to comment.\nA coroner testified during the trial that injuries to Rosendale's head led her to conclude she had been beaten, and the injuries did not match those of a fall from a moving vehicle.","url":"https://www.dailymail.co.uk/wires/ap/article-3421249/Jury-Ohio-fails-reach-verdict-1982-killing-woman.html"}
