{"authors":[],"date_download":"2018-10-22 20:42:44","date_modify":"2018-10-22 20:42:44","date_publish":"2014-05-02 23:38:26","description":"A jury ordered Samsung Electronics to pay $119.6 million to Apple, after it found the South Korean smartphone maker had infringed two Apple patents.","filename":"data/vaneerConsumption/JuryOrdersSamsungtoPayApple1196MinPatentInfringementCase.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/408116/140429-140429-apple-samsung-1158_4afb4e5836d00d62c6d49bd668f9aae8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_jury-orders-samsung-pay-apple-119-6m-patent-infringement-case-n96156_1540240964.html","title":"Jury Orders Samsung to Pay Apple $119.6M in Patent Infringement Case","title_page":"Jury Orders Samsung to Pay Apple $119.6M in Patent Infringement Case","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSAN JOSE, Calif. — A California jury determined Friday that Samsung infringed Apple smartphone patents and awarded $120 million in damages.\nThe panel delivered its verdict in federal court in the latest lawsuit involving the two tech giants. It also ruled that Apple infringed Samsung patents and awarded $158,000 in damages.\nApple Inc. had sought $2.2 billion after accusing Samsung Electronics Co. of infringing five of its patents covering functions such as slide-to-lock, universal searching, quick linking, automatic word correction and background syncing.\nSamsung had sought $6 million after arguing that Apple had infringed two of its smartphone patents related to camera use and video transmission.\nThe verdict marked the latest intellectual property battle between the world's top two smartphone makers. Apple and Samsung have sued each other in courts and trade offices around the world.\nTwo years ago, a separate jury ordered Samsung to pay Apple $930 million after finding it had used Apple technology to create older generation devices. Samsung is appealing that order.\nThe lawsuits were filed as Apple and Samsung are locked in a bitter struggle for dominance of the $330 billion worldwide smartphone market. Samsung has become the leader of the sector with a 31 percent share after being an also-ran with just 5 percent in 2007. Apple, meanwhile, has seen its market share slip to about 15 percent from a high of 27 percent three years ago.\nThe jury of four men and four women delivered its verdict in the latest case after beginning deliberations April 29.\n-The Associated Press","url":"https://www.nbcnews.com/business/consumer/jury-orders-samsung-pay-apple-119-6m-patent-infringement-case-n96156"}
