{"authors":["Associated Press"],"date_download":"2018-10-22 23:37:35","date_modify":"2018-10-22 23:37:35","date_publish":"2017-03-10 03:44:08","description":"BERKELEY, Calif. (AP) - U.S. Supreme Court Justice Sonia Sotomayor said Thursday that she is saddened to see that many people have lost confidence in judges...","filename":"data/vaneerConsumption/JusticeSotomayorlamentsperceptionofjudgesaspolitical.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/03/wire-193861-1489117452-33_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4299910_Justice-Sotomayor-laments-perception-judges-political_1540251455.html","title":"Justice Sotomayor laments perception of judges as political","title_page":"Justice Sotomayor laments perception of judges as political | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BERKELEY, Calif. (AP) - U.S. Supreme Court Justice Sonia Sotomayor said Thursday that she is saddened to see that many people have lost confidence in judges and believe they are political.\nSotomayor made the comments while taking questions from law students at the University of California, Berkeley. The school's interim law school dean, Melissa Murray, served as Sotomayor's clerk when the justice was a federal appellate court judge.\nSotomayor said judges try to be fair and impartial and don't have rigid beliefs they apply to every case. She encouraged people to view judges as \"human beings who care deeply about what we're doing.\"\nU.S. Supreme Court Justice Sonia Sotomayor gestures during a speech at the University of California at Berkeley on Thursday, March 9, 2017, in Berkeley, Calif. (AP Photo/Ben Margot)\n\"So don't give up hope on us, OK,\" she exhorted the audience.\nSotomayor did not mention President Donald Trump's nominee to the court, Neil Gorsuch, whose confirmation hearing is scheduled to start later this month. And her comments lamenting the perception of judges made no reference to the president's attacks on the judiciary.\nSotomayor, who walked around the auditorium shaking hands and hugging students as she spoke, was nominated by President Barack Obama in 2009 and became the court's first Hispanic justice when the U.S. Senate confirmed her later that year.\nShe was asked what it was like to have only eight justices on the court since Justice Antonin Scalia's death last year. Gorsuch would fill Scalia's seat.\n\"We are talking more,\" she said of the remaining justices. \"We are trying to reach consensus more.\"\nShe also said she initially found herself asking more questions when attorneys were making their arguments, though she has since pulled back.\n\"I was filling the dead space during the arguments,\" she said. \"With (Scalia) around, he usually was the first one to jump in and ask a question.\"\nU.S. Supreme Court Justice Sonia Sotomayor, center, answers questions from the audience during a speech at the University of California at Berkeley on Thursday, March 9, 2017, in Berkeley, Calif. (AP Photo/Ben Margot)\nU.S. Supreme Court Justice Sonia Sotomayor gestures during a speech at the University of California at Berkeley on Thursday, March 9, 2017, in Berkeley, Calif. (AP Photo/Ben Margot)\nU.S. Supreme Court Justice Sonia Sotomayor waves a University of California at Berkeley pennant after delivering a speech on the campus on Thursday, March 9, 2017, in Berkeley, Calif. (AP Photo/Ben Margot)","url":"https://www.dailymail.co.uk/wires/ap/article-4299910/Justice-Sotomayor-laments-perception-judges-political.html"}
