{"authors":["Joshua Caplan"],"date_download":"2018-10-30 17:53:56","date_modify":"2018-10-30 17:53:56","date_publish":"2018-06-27 18:16:20","description":"Justice Associate Anthony Kennedy will retire from the Supreme Court, according to reports.","filename":"data/vaneerConsumption/JusticeAnthonyKennedytoRetirefromSupremeCourt.json","image_url":"https://media.breitbart.com/media/2017/12/wi/afp/03/3un70q6-e1533237207687.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_27__1540922036.html","title":"Justice Anthony Kennedy to Retire from Supreme Court","title_page":"Justice Anthony Kennedy to Retire from Supreme Court","title_rss":"NULL","source_domain":"breitbart.com","text":"Justice Associate Anthony Kennedy will retire from the U.S. Supreme Court effective July 31.\nThe 81-year-old’s retirement presents President Donald Trump with his second opportunity to appoint conservative Supreme Court Justice, following the confirmation of Justice Neil Gorsuch.\nLeonard Leo, Federalist Society official and an outside adviser to President Trump on judicial nominations, thanked Kennedy and expressed optimism about his replacement. “I expect the nominee to be like Justice Gorsuch, to demonstrate excellence in every respect, and to earn widespread support from the American people, and bipartisan support for confirmation,” Leo said in an announcement following the announcement.\nPresident Trump already has a list of 25 candidates — 24 judges and Sen. Mike Lee (R-UT) — from which the White House has previously said he would choose a nominee.\nProminent on that list are Judges Thomas Hardiman of Pennsylvania and William Pryor of Alabama, seriously considered for the seat eventually filled by Justice Neil Gorsuch, and Judge Brett Kavanaugh, who serves on the federal appeals court in Washington, DC.\nKavanaugh is a longtime Washington insider, having served as a law clerk to Kennedy and then as a key member of independent counsel Kenneth Starr’s team that produced the report that served as the basis for President Bill Clinton’s impeachment. In October, Kavanaugh dissented when his court ruled that an undocumented teen in federal custody should be able to obtain an abortion immediately.\nAbortion is likely to be one of the flash points in the nomination fight. Kennedy has mainly supported abortion rights in his time on the court, and Trump has made clear he would try to choose justices who want to overturn the landmark abortion rights case of Roe v. Wade. Such a dramatic step may not be immediately likely, but a more conservative court might be more willing to sustain abortion restrictions.\nInterest groups across the political spectrum are expected to mobilize to support and fight the nomination because it is so likely to push the court to the right.\nRepublicans currently hold a bare 51-49 majority in the Senate, although that includes the ailing Sen. John McCain of Arizona. If Democrats stand united in opposition to Trump’s choice, Senate Majority Leader Mitch McConnell of Kentucky can lose no more than one vote. If the Senate divides 50-50, Vice President Mike Pence could break a tie to confirm the nominee.\nRegardless of who replaces him, Kennedy’s departure will be a massive change for the high court, where he has been the crucial swing vote for more than a decade.\nThe Associated Press contributed to this report.","url":"https://www.breitbart.com/politics/2018/06/27/supreme-court-associate-justice-anthony-kennedy-to-retire/"}
