{"authors":["Candice Jackson For Daily Mail Australia"],"date_download":"2018-10-22 23:32:04","date_modify":"2018-10-22 23:32:04","date_publish":"2017-03-10 03:22:34","description":"He's the international heartthrob touring Australia as part of his Purpose World Tour this month. But Justin Bieber looked less less than stylish on Friday when he greeted fans at Perth airport.","filename":"data/vaneerConsumption/JustinBiebergreetsPerthfansinslidesandsocks.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/04/3E1FB77700000578-0-image-a-114_1489119450698.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299784_Justin-Bieber-greets-Perth-fans-slides-socks_1540251124.html","title":"Justin Bieber greets Perth fans in slides and socks","title_page":"Justin Bieber greets Perth fans in slides and socks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's the international heartthrob touring Australia as part of his Purpose World Tour this month.\nBut Justin Bieber looked less than stylish on Friday, when he greeted fans at Perth airport before boarding his private jet to Melbourne.\nThe 23-year-old singer met with lucky punters while sporting a bizarre combination of blue side-striped tracksuit pants with socks and slide shoes.\nScroll down for video\nIs it too late now... to get a stylist? Justin Bieber sported a bizarre outfit, consisting of quirky tracksuit pants and slides with socks as he greeted fans at Perth airport, on Friday\nThey don't mind! The girls couldn't care less about what Justin was wearing as they gushed over the pop star\nKeeping it casual: Adding to his comfortable laid-back look, Justin added a blue T-shirt with a black unzipped bomber jacket\nAdding to his comfortable laid back look, Justin added a blue T-shirt with a black unzipped bomber jacket.\nThe Canadian-born superstar appeared to happily approach his adoring fans without being accompanied by security.\nSmiling and staring at him as he spoke, the group of mostly young females were overjoyed to be in the presence of the globe-trotting performer.\nJustin also showed gratitude to his followers by placing his hands in a prayer gesture on his approach.\nHis people: The Canadian-born superstar happily approached his adoring fans without being accompanied by security\nFixated: Smiling and staring at him as he spoke, the group of mostly young females were overjoyed to be in the presence of the globe-trotting performer\nGetting cosy: Justin chatted to the girls and embraced them during the meeting\nOne less lonely girl! Justin hugged many of his adoring followers, with one school girl beaming a huge grin as the Sorry hit-maker wrapped his arms around her\nHe was seen conversing with the group with ease, as he and the girls laughed and smiled through the brief exchange.\nAt some points, Justin was seen hugging his fans.\nHis bizarre mis-matched ensemble featured unzipped trouser pockets, his drawstring hanging around his front and multi-coloured patterned socks on display.\nLining up: The fans lined up to get their moment with Bieber\nBeside themselves: The moment was one the girls would surely never forget\nThe teen sensation was in demand during the gathering, with the Perth natives circling around the star to get close.\nMany of his fans were wearing his Purpose World Tour merchandise, perhaps having been to his concert at Perth's Nib stadium on Monday.\nThe singer rocked to the sold out Nib Stadium on Monday night with a 90-minute extravaganza around the songs of his fourth studio album, Purpose.\nNever let him go? One girl broke from the group to initiate a hug with the Sorry hit-maker\nShowing their support! Many of his fans were wearing his Purpose World Tour merchandise, perhaps having been to his concert at Perth's Nib stadium on Monday\nHugs for everyone! They all stood patiently waiting for their turn at hugging the star\nLiving in the moment: His fans appeared to have kept their phones in their bags and pockets during the meet and greet\nLiving in the moment, his fans appeared to have kept their phones in their bags and pockets during the meet and greet.\nOnce one lady broke from the group to initiate a hug with the Sorry hit-maker, it was clear others were keen to get their fix.\nThey all stood patiently waiting for their turn at hugging the star.\nChuffed! The pilot of Justin's private jet gleamed a large smile in response to Justin's show of gratitude, returning his one-armed hug with a warm double-armed embrace\nOn top of greeting with fans, the pop superstar also proved he was grounded when he showed his appreciation towards his skilled pilot before leaving Perth.\nHe was seen hugging and patting his private jet pilot in an act of gratitude as he boarded his jet headed for Melbourne.\nThey were seen laughing together as Justin patted the captain once more and head for the aircraft's staircase.\nThe singer will continue his Purpose World Tour with performances in Melbourne, Brisbane and Sydney, before heading over to New Zealand.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299784/Justin-Bieber-greets-Perth-fans-slides-socks.html"}
