{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-22 21:02:30","date_modify":"2018-10-22 21:02:30","date_publish":"2017-03-16 00:31:27","description":"Justin Bieber appears to be morphing into Eminem with his blonde hair, baggy clothes, clear glasses and tattoos","filename":"data/vaneerConsumption/JustinBieberappearstobemorphingintoEminem.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/22/3E4F987B00000578-0-image-a-9_1489618391458.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4317942_Is-Justin-Bieber-morphing-Eminem_1540242150.html","title":"Justin Bieber appears to be morphing into Eminem","title_page":"Justin Bieber appears to be morphing into Eminem | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They're two of the most popular artists in the world.\nAnd it seems Justin Bieber is taking a leaf out of Eminem's book, appearing to change up his look and channeling one similar to that of the rapper, 44.\nRecently the 23-year-old Canadian pop star has been sporting short peroxide blonde locks, clear glasses and baggy clothes, just like The Real Slim Shady hit maker.\nScroll down for video\nSpecs appeal! It seems Justin Bieber (L) is taking a leaf out of Eminem's book (R, pictured in 2003), appearing to to change up his look, and channeling one similar to that of the rapper\nJustin - who is known for hits including Baby and Sorry - also has various tattoos like Eminem, whose real name is Marshall Mathers III.\nThe Boyfriend star appears to be a fan of Eminem and in 2015 made headlines for covering two of Eminem's songs in a nightclub in London.\nIn 2013, he also rapped to Eminem during a concert in Eminem's hometown of Detroit.\nThat's some ink! Justin - who is known for hits including Baby and Sorry - also has various tattoos like Eminem, whose real name is Marshall Mathers III\nInspiration? The 23-year-old Canadian pop star appears to have always channelled the Slim Shady star\nMarkings: Eminem is seen here performing shirtless in 2002\nThat same year, The Sun reported that Eminem invited Justin to say at his home over the Christmas and New Year period to help get him back on track.\n'He's really hoping he can sort Justin out. The way he's going he's worried he's going to end up in really bad trouble,' a source told the newspaper at the time.\nThe source added: 'He wants to talk him into going to therapy and counselling to deal with the stress of fame in a positive way.'\nStyle: The pair are seen here with similar jackets and baggy jeans\nIdol? Justin appears to be a fan of Eminem and in 2015, made headlines for covering two of Eminem's songs in a nightclub in London\n'Eminem would consider going into the studio with him if he sorts himself out, which would be a dream come true for Justin.'\nJustin is currently on his Purpose World Tour and is in Australia.\nOn Wednesday evening, he took to the stage in front of thousands at ANZ Stadium.\nFans flocked to Twitter to thank the singer for an 'amazing show' after he called it the 'best night of my life' three times.\nOn the road: Justin is currently on his Purpose World Tour and is in Australia (pictured in February in Los Angeles)\n'Tonight was hectic! You continue to inspire me each and every day! Thank you,' one fan wrote.\n'Thank you so much! It was amazing,' another added.\nThe performance was certainly an improvement to Melbourne where patrons at the concert were left less than impressed, with some of the 50,000 fans who packed into the arena to see the pop superstar complaining about his demeanor on stage.\nThey said he 'looked miserable' and 'seemed bored' throughout the one hour and forty-five minute performance.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4317942/Is-Justin-Bieber-morphing-Eminem.html"}
