{"authors":["Jo Scrimshire For Daily Mail Australia"],"date_download":"2018-10-23 00:10:49","date_modify":"2018-10-23 00:10:49","date_publish":"2017-03-16 09:03:17","description":"Justin Bieber has been making the most of the local culture while touring Australia in support of his Purpose album.","filename":"data/vaneerConsumption/JustinBieberspottedatMcDonaldsinCremorne.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54942B00000578-0-image-a-90_1489672359309.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319254_Pop-star-Justin-Bieber-spotted-McDonald-s-Cremorne_1540253449.html","title":"Justin Bieber spotted at McDonald's in Cremorne","title_page":"Justin Bieber spotted at McDonald's in Cremorne | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Justin Bieber has been making the most of the local culture while touring Australia in support of his Purpose album.\nAnd he certainly looked like a local while ordering food at a McDonald's restaurant in Cremorne, Sydney earlier this week.\nA photo posted on Facebook on Thursday shows the 23-year-old pop star at the counter waiting for his fast food.\nHe's just like a local! A photo posted on Facebook on Thursday shows Justin Bieber at a McDonald's restaurant in Cremorne, Sydney recently\nAnother photo obtained by Daily Mail Australia shows the tattooed singer in a singlet and shorts holding a McFlurry ice cream.\nThe Where Are Ü Now star performed at Sydney's ANZ Stadium on Wednesday night.\nDaily Mail Australia has reached out to Justin's representatives for comment.\nKeeping casual: Another photo obtained by Daily Mail Australia shows the tattooed singer in a singlet and shorts holding a McFlurry ice cream\nLooking good, Justin! The star's visible tattoos and muscles were on display in the white tank top\nIt was also mentioned on Facebook by a mother, Isabela Arden, that her son, Sebastian Gomez, reportedly talked tattoos and hairstyles with Justin.\n'So my son gets home at 8pm from school, I am why [are you] so late I was getting worried,' she began the post.\n'He was like, \"I was talking and hanging out with Justin Bieber at McDonalds at Cremorne. We were talking about tattoos, school, hairstyles and we just chilled with each other.\"\n'I am like, ''So Sebastian Gomez do you have Bieber fever? #chill now,\"' she continued alongside three laughing face emojis.\nChance encounter: It was also mentioned on Facebook by a mother, Isabela Arden, that her son, Sebastian Gomez, reportedly talked tattoos and hairstyles with Justin\nAt ease: Justin appeared at ease and relaxed\nHe's lovin' it! The Canadian crooner was seen indulging in the fast food\nThe sighting comes after News Corp Australia reported Justin tried Vegemite on toast for the first time at a Sydney eatery this week.\nIt was claimed the Baby singer specifically asked staff for 'that Aussie spread that everyone talks about' while at the Manly Wine restaurant.\nHe was subsequently offered 'white toast with heaps of butter and just the right amount,' said marketing manager Camilla Glover.\nWorld tour: The Where Are Ü Now star performed at Sydney's ANZ Stadium on Wednesday\nA local delicacy! The sighting comes after it was reported Justin tried Vegemite on toast for the first time at a Sydney eatery this week\nI want your finest spreads, sir! It was claimed the Baby singer specifically asked staff for 'that Aussie spread that everyone talks about' while at the Manly Wine restaurant\nRelaxed look: Justin blended in with the casually dressed diners in shorts and a T-shirt\n'He enjoyed it and he ate it,' Camilla added.\nEarlier this month, Justin made headlines after being spotted partying on a yacht in Melbourne with several busty models.\nThe female guests included aspiring singer Nyssa Large, married mother-of-one Kaysha Louise and 'lifestyle blogger' Roze Cook.\nIs it too late now to say yummy? Manly Wine's marketing manager Camilla Glover said Justin 'enjoyed' his serving of Vegemite on buttered white toast\nHaving fun? Earlier this month, Justin made headlines after being spotted partying on a yacht in Melbourne with several busty models, including socialite Nyssa Large (pictured)","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319254/Pop-star-Justin-Bieber-spotted-McDonald-s-Cremorne.html"}
