{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 01:01:20","date_modify":"2018-10-23 01:01:20","date_publish":"2016-01-11 11:28:42","description":"He's currently riding high in the charts. But pop star Justin Bieber was riding something a little less glamorous when he was spotted cruising through LA on a skateboard, Sunday afternoon.","filename":"data/vaneerConsumption/JustinBieberswapshisLamborghiniforaskateboardinBeverlyHills.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/300525FA00000578-0-image-a-32_1452511463980.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393719_Off-duty-Justin-Bieber-swaps-Lamborghini-skateboard-cruises-Beverly-Hills_1540256480.html","title":"Justin Bieber swaps his Lamborghini for a skateboard in Beverly Hills","title_page":"Justin Bieber swaps his Lamborghini for a skateboard in Beverly Hills | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's currently riding high in the charts.\nBut pop star Justin Bieber was riding something a little less glamorous when he was spotted cruising through LA on a skateboard, Sunday afternoon.\nThe Love Yourself singer ditched his flash Lamborghini for a more casual cruise, which saw him enjoy some low-key down-time at the weekend.\nScroll down for video\nNifty footwork! Justin Bieber was spotted cruising through LA on a skateboard, Sunday afternoon\nThe Canadian artist - who broke records on Sunday when he accomplished top three singles chart positions - was seen speeding through LA by foot.\nClutching his smartphone as he picked up speed, the 21 year-old looked focused as he zipped through traffic in the Californian city.\nCausing a stir for locals - who are accustomed to seeing him surrounded by security - he effortlessly turned heads.\nSee the latest Justin Bieber updates as he swaps his Lamborghini for a skateboard\nMaking tracks: The Canadian artist - who broke records on Sunday when he accomplished top three singles chart positions - was seen speeding through LA by foot\nCool dude: Clutching his smartphone as he picked up speed, the 21 year-old looked focused as he zipped through traffic in the Californian city\nRad: Causing a stir for locals, who are accustomed to seeing him surrounded by security, he turned heads\nAt one point the hit-maker was seen performing tricks on the four-wheeled device, which was branded with the label 'Deathwish'.\nDressed in a pair of skinny jeans and an electric blue Dodgers jacket, he was particularly hard to miss.\nHe capped his urban look with a pair of turquoise high-top trainers and a reverse-worn hat.\nWell, he is a performer! At one point the hit-maker was seen performing tricks on the four-wheeled device, which was branded with the label 'Deathwish'\nLow-key: The Love Yourself singer ditched his flash Lamborghini for a more casual cruise, which saw him enjoy some low-key down-time at the weekend\nOut and about: The youngster was clearly happy to be out and about on his own terms\nThe sighting happened on the same day that he was seen lighting up a cigarette - shortly after claiming he wanted to give up smoking.\nEarlier this month Justin told The Bert Show that one of his New Year's resolutions was to break the habit.\n'I'm going to quit smoking, I'm gonna do it. It’s not healthy,' the Purpose hit maker said.\nSmoke break: Justin Bieber was seen lighting up a cigarette outside the Montage hotel in Beverly Hills on Saturday afternoon\nIgnoring his resolution: This comes just after he told The Bert Show this week that one of his New Year's resolutions was to break the habit\nOh well... : 'I'm going to quit smoking, I'm gonna do it. It’s not healthy,' the Purpose hit maker said\nAlso in the interview the Sorry singer: 'That’s why…I just don’t want to be someone who people are like, \"He’s smoking, he’s a bad person.\"'\nThe Where Are U Now crooner also offered no promises: 'But once again, it’s my journey.'\nWhile outside the upscale hotel - where Scott Disick also often stays - the blonde Grammy favorite wore a blue silky LA Dodgers jacket over a green shirt and camouflage slacks and black sneakers.\nSee more on Justin Bieber as he breaks his New Year's resolution to quit smoking\nHe gone done that: Also in the interview the Sorry singer: 'That’s why…I just don’t want to be someone who people are like, \"He’s smoking, he’s a bad person\"'\nDon't judge: The Where Are U Now crooner also offered no promises: 'But once again, it’s my journey'\nWhile outside the upscale hotel - where Scott Disick also often stays - the blonde Grammy favorite wore a blue silky jacket over a green shirt\nHe had a white trucker hat on backwards and two male attendants could be seen looking after him.\nLater that night the star was seen at Sean Penn's Haiti relief fundraiser.\nHe wore a mini man bun and a white shirt with a military style jacket that looked like something Michael Jackson would have donned in the 1980s.\nAlso at the event were Penn, his ex-wife Madonna, Leonardo DiCaprio, OIivier Martinez, Rachel Zoe, Jason Segel and Suki Waterhouse, among others.\nLooking to blend in? The Biebs also had on camouflage slacks and black sneakers\nGo Dodgers: Though Justin is Canadian, he sure seems to be a fan of the LA Dodgers\nMixing it up with Hollywood: Later that night the star was seen at Sean Penn's Haiti relief fundraiser","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393719/Off-duty-Justin-Bieber-swaps-Lamborghini-skateboard-cruises-Beverly-Hills.html"}
