{"authors":["Candice Jackson For Daily Mail Australia"],"date_download":"2018-10-22 23:53:44","date_modify":"2018-10-22 23:53:44","date_publish":"2017-03-16 08:08:05","description":"He's been enjoying the Australian way of life during his Purpose World Tour down under over the last two weeks. And Justin Bieber farewelled Australia on Thursday with a Vegemite smile.","filename":"data/vaneerConsumption/JustinBiebermunchesdownonVegemiteontoastinSydney.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/07/3E5254C100000578-0-image-a-3_1489648263474.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319070_Justin-Bieber-munches-Vegemite-toast-Sydney_1540252424.html","title":"Justin Bieber munches down on Vegemite on toast in Sydney","title_page":"Justin Bieber munches down on Vegemite on toast in Sydney | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's been enjoying the Australian way of life during his Purpose World Tour over the last two weeks.\nAnd Justin Bieber farewelled Australia on Thursday with a Vegemite smile.\nThe Canadian pop star was spotted at Sydney's Manly Wine munching down on the iconic spread on toast.\nA local delicacy! It was reported Justin tried Vegemite on toast for the first time at a Sydney eatery this week\nThe restaurant shared an Instagram photo of the Where Are Ü Now hitmaker leaving the establishment in a T-shirt and shorts.\nThey wrote: 'J U S T I N just popped in for his first experience in Manly. He enjoyed 3 eggs on toast, seafood & his first try of @vegemite.'\nThe Daily Telegraph reported Justin and three minders dined at the restaurant on the rainy morning following his concert at Sydney's ANZ Stadium.\nI want your finest spreads, sir! It was claimed the Baby singer specifically asked staff for 'that Aussie spread that everyone talks about' while at the Manly Wine restaurant\nRelaxed look: Justin blended in with the casually dressed diners in shorts and a T-shirt\nManly Wine's marketing manager Camilla Glover said Justin ordered three eggs on toast- one runny to dip his bread in - and also asked about Australia's famous spread\n'He’s like, \"Do you have that Aussie spread that everyone talks about?\"' she said.\nCamilla then made sure to give him an adequate amount on white toast, adding: 'He enjoyed it and he ate it.'\nIs it too late now to say yummy? Manly Wine's marketing manager Camilla Glover said Justin 'enjoyed' his serving of Vegemite on buttered white toast\nDining etiquette: The cafe said he FaceTimed with an unknown girlfriend while lifting up his shirt at the table for her to see\nThe cafe said he also sipped on an iced latte and FaceTimed with an unknown girlfriend, lifting up his shirt at the table for her to see.\nWhile the only photo they were permitted was one of him leaving the venue, the staff say they were given kisses and hugs as he parted.\nJustin is believed to have tried Vegemite for the first time on Channel Nine's The Today show in 2010.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319070/Justin-Bieber-munches-Vegemite-toast-Sydney.html"}
