{"authors":[],"date_download":"2018-10-30 00:50:39","date_modify":"2018-10-30 00:50:39","date_publish":"2018-08-23 00:05:10","description":null,"filename":"data/vaneerConsumption/JustAnotherWordforNothingLefttoLose.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/1024px-Hypomesus_transpacificus.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860639.html","title":"Just Another Word for Nothing Left to Lose","title_page":"Just Another Word for Nothing Left to LoseThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Sacramento\nAt a conference examining California’s housing crisis, one of the more liberal audience members expressed her frustration at those of us who even talked about free markets. I don’t recall her exact words, but the mere mention of such ideas were a non-starter. Apparently, such notions shouldn’t be raised in polite company given what they mean for the poor and disenfranchised. Couldn’t we just get back to discussing government regulations and programs?\nThat comment summarized the problem with discussing public policy in a state where such ideas are considered arcane. The notion that people should be free to pursue their own lives, with only minimal interference and subsidy from the government, is never on the table. The assumption, in the Legislature, among policymakers and in local government, is that private actors would leave a path of death and destruction if the government didn’t try to manage everything.\nThat the government itself always leaves destruction in its wake — not only within its own bureaucracies but within the industries it controls — simply is more evidence that the government needs even more power. We’re free to talk about tweaking current rules and regulations, but never to propose reducing or eliminating them. Government knows best, even when government employees are caught repeatedly enriching themselves at our expense.\nAnd, of course, there’s virtually no area of our lives — outside our sexual behavior and reproductive “choices” — that should be free from state interference. It should be no surprise, then, that the libertarian Cato Institute’s latest “Freedom in the 50 States” report finds California nearly at the bottom, in 48thplace. New York and Hawaii were worse, but California has been remarkably consistent in its ranking over the past 16 years. Whenever there’s some think tank report comparing the states for some bad thing, I always start at the bottom to find my home state.\nNot surprisingly, we have the highest taxes in the country, even with 1978’s Proposition 13 putting the kibosh on uncontrolled property-tax hikes. We have a high level of public debt, of course. As Cato points out, the state actually has one of the lowest percentages of government employees (11.2 percent of private employment). But the reason is simple: California pays its employees such astoundingly high pay and benefit packages that it simply can’t afford to hire any more of them. Thank goodness for small favors. The fewer the better.\nOur regulatory system is what really stings. “California is one of the worst states on land-use freedom,” Cato explains. “Some cities have rent control, new housing supply is tightly restricted in the coastal areas despite high demand, and eminent domain reform has been nugatory. The state even mandates speech protections in privately owned shopping malls. Labor law is anti-employment, with no right-to-work law, high minimum wages, strict workers’ compensation mandates, mandated short-term disability insurance, stricter-than-federal anti-discrimination law, and prohibitions on consensual non-compete agreements.” Did I mention that our voter-approved insurance system requires government to approve any rate increases or decreases? We do have more freedom than residents of most states to smoke weed and buy alcoholic beverages, which is good but that’s thin gruel.\nDespite this, our economy does well, which is the main rebuttal one finds from progressive advocates for more rules and government spending. But the key word here is despite. This is a massive and beautiful state with a climate and culture that attracts the best and the brightest (and the worst and the not-so-bright, too) from across the globe. Yet I think of free-market writer Henry Hazlitt’s discussion of the seen and the unseen. Because of all the state’s controls, we never see the great things and entrepreneurial ideas that have never come to pass. And the state does have the highest poverty rates in the nation using the Census Bureau’s cost-of-living-adjusted measure, which is necessary given that $15 an hour doesn’t go far in a city with $1 million median home prices.\nOf course, California does provide entertainment for the rest of the country. At a time when San Franciscans are dealing with mounds of human feces that foul that once-lovely city, lawmakers spent their summer stopping restaurants and convenience stores from giving out or selling plastic straws. They also limited the use of packaged condiments. Not long ago, officials banned the sale of flavored tobacco products, which means that smokers who are trying to quit the habit are out of luck. The city’s decision to hand out needles to addicts actually is a decent idea, but it’s bizarre to simultaneously subsidize heroin needles and ban far-more mundane products such as ketchup packages.\nIt’s easy to roll one’s eyes at San Francisco, but a bill that would forbid restaurants from handing out plastic straws unless requested by the customer has just landed on the governor’s desk. Furthermore, a second bill that just landed on his desk requires fast-food restaurants to offer water or milk as the default option on any children’s meals. Advocates for the latter see it as a strike against childhood obesity, but it’s really just a means to meddle in parents’ minor life decisions. Parents can still order soda for their kids, but restaurants could face $500 fines for providing a soda with the meal. This is an almost literal example of the “nanny state.”\nPersonal freedom? Perish the thought. The government knows best. Like with all things, most of us just work around the nonsense, as we tote old bags to the grocery stores like vagabonds and check out those poop maps to chart the state of affairs in different neighborhoods. (OK, the map is really just designed to highlight homelessness issues, but still…)\nMeanwhile, hundreds of farmers showed up at the state Capitol on Tuesday to protest the state water board’s plan to double the amount of water taken from three Central Valley rivers to help improve fish flows in the Sacramento-San Joaquin Delta — something that could decimate the farm economy. And community activists are pushing their November initiative that would let cities across the state impose the most extreme forms of rent control (on single-family houses and condos, for instance), thus threatening to worsen the housing mess.\nWhen markets and freedom are distasteful words, you’re going to get more government management and destruction of everything. That tells you everything you need to know about the future of our state. I’ll be here to the bitter end, but it’s sad to watch what’s happening.\nSteven Greenhut is Western region director for the R Street Institute. Write to him at sgreenhut@rstreet.org.","url":"https://spectator.org/just-another-word-for-nothing-left-to-lose/"}
