{"authors":["Taylor Ferber"],"date_download":"2018-10-31 01:41:57","date_modify":"2018-10-31 01:41:57","date_publish":"2018-09-14 18:30:41","description":"In the summer of surprises, Justin Bieber and Hailey Baldwin reportedly tied the knot on Thursday, Sept. 13, according to People. Early on Friday morning, Bieber's mom Pattie Mallette's tweet may have confirmed Bieber and Baldwin's marriage. The…","filename":"data/vaneerConsumption/JustinBiebersMomMightveConfirmedTheSingersMarriageToHaileyBaldwinInAMysteriousTweetUPDATE.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/f4f93e33-b335-4a17-b35d-972d9762b7be-getty-1027960538.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_justin-biebers-mom-mightve-confirmed-the-singers-marriage-to-hailey-baldwin-in-a-mysterious-tweet-update-11924264_1540950117.html","title":"Justin Bieber’s Mom Might’ve Confirmed The Singer’s Marriage To Hailey Baldwin In A Mysterious Tweet - UPDATE","title_page":"Justin Bieber’s Mom Might’ve Confirmed The Singer’s Marriage To Hailey Baldwin In A Mysterious Tweet — UPDATE","title_rss":"NULL","source_domain":"bustle.com","text":"In the summer of surprises, Justin Bieber and Hailey Baldwin reportedly tied the knot on Thursday, Sept. 13, according to People. Early on Friday morning, Bieber's mom Pattie Mallette's tweet may have confirmed Bieber and Baldwin's marriage. The tweet said: \"Love is unconditional.\" Although the tweet is a mysterious one, Mallette also shared consecutive tweets when the two were engaged in July, also sentiments about love, so this could be the real deal. (Bustle reached out to Bieber and Baldwin's reps for comment, but has not yet received a response.)\nUPDATE, 4:50 PM EST: Baldwin responded to the wedding rumors in a straightforward tweet on Friday afternoon: \"I understand where the speculation is coming from, but I’m not married yet!\"\nEARLIER: On Friday, People reported the two were married in a New York City courthouse on Thursday. TMZ obtained a photo of Bieber and Baldwin at the courthouse in casual clothing. \"They went ahead and did it without listening to anyone,” a source told People. The pair reportedly has plans for a religious ceremony and celebration for loved ones in the very near future. \"They're going to have a big blowout, in front of god and everyone they love,\" they said.\nAccording to TMZ, eyewitnesses claimed to have seen the couple get emotional when inside the courthouse's marriage bureau. Some overheard Bieber say, \"I can't wait to marry you, baby\" to Baldwin and told a court official, “Thanks for keeping it on the DL.” While fans scramble for answers, Mallette's tweet just might say it all:\nWhen news broke that Bieber and Baldwin got engaged in early July, Mallette confirmed the news with similar tweets. First, she posted this tweet:\nAnd two days later, posted a tweet with a Bible verse about love:\nThe day after the engagement news broke, Baldwin's father Stephen also tweeted, writing \"Sweet smile on my face! Me&wife (Kennya) Always pray 4 gods will!! He is moving in the hearts of JB&HB. Let’s all pray for His will to be done. Love you 2 so much!!!\" Shortly after, the tweet was deleted. The same day, Baldwin posted a Bible verse with the hashtag #blessed. (He's yet to tweet in light of alleged marriage news). Bieber's father Jeremy also posted about it on social media, writing, \"Proud is an understatement! Excited for the next chapter!\"\nFans will now likely be watching Bieber and Baldwin's (and their parents') every move on social media. When the two were engaged, Baldwin confirmed the news by liking a post about it from Upscale Hype's Instagram. Bieber also confirmed the engagement with a lengthy post about Baldwin and how excited he was to marry her. \"My heart is COMPLETELY and FULLY YOURS and I will ALWAYS put you first!\" he wrote. \"You are the love of my life Hailey Baldwin and I wouldn’t want to spend it with anybody else.\"\nIt seems a wedding was being planned at some point during this whirlwind romance. In mid-July, Baldwin's aunt Kim Basigner told Us Weekly that the couple's bridal party was already in works and included her daughter Ireland Baldwin. “Oh, it’ll be fun,” she said of the future wedding. \"It’s cool! I think it’s sweet. It’s a very sweet thing.\"\nHowever, a People report in mid-August claimed that the couple was actually slowing down wedding plans. A source told the magazine, “The wedding planning has slowed down a bit. They still don’t want a long engagement, but they are also not rushing the wedding.” Guess there's no stopping two kids in love.","url":"https://www.bustle.com/p/justin-biebers-mom-mightve-confirmed-the-singers-marriage-to-hailey-baldwin-in-a-mysterious-tweet-update-11924264"}
