{"authors":["Kate Darvall For Daily Mail Australia"],"date_download":"2018-10-23 01:38:58","date_modify":"2018-10-23 01:38:58","date_publish":"2017-03-10 10:03:47","description":"Pop icon Justin Bieber was pictured ordering food from a Nando's in Belmont on Thursday night, apparently unaware the chicken franchise was slapped with a $20,000 fine for health breaches this month.","filename":"data/vaneerConsumption/JustinBieberdinesataNandosinBelmontPerth.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E21B2AD00000578-0-image-a-11_1489135594948.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300370_Justin-Bieber-spotted-Nando-s-Belmont_1540258738.html","title":"Justin Bieber dines at a Nando's in Belmont, Perth","title_page":"Justin Bieber dines at a Nando's in Belmont, Perth | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Pop icon Justin Bieber has millions of fans spanning the world, but it appears not one thought to warn him he was eating at a fast food joint with a less-than-upstanding reputation.\nBieber, 23, was pictured ordering food from a Nando's in Belmont on Thursday night, seemingly unaware the Portuguese chicken franchise was slapped with a $20,000 fine for health breaches this month.\nThe popular fast food franchise was found guilty of breaching the Food Act (2008) following an investigation by the Department of Health.\nBieber, 23, was pictured ordering food from a Nando's in Belmont on Thursday night\nThe Belmont store was ordered to pay $20,000 and costs of $1745.50 for offences on September 13, 2016, WAToday report.\nThe Department of Health found it 'failed to maintain food premises to a standard of cleanliness' and failed to maintain equipment to a standard of cleanliness'.\nThe Belmont store was one of three Nando's restaurants fined by the Department of health for breaches including poor cleanliness standards, hand-washing facilities and poor temperature control.\nPerth stores in Spearwood and Nedlands were also convicted.\nBieber was seemingly unaware the Portuguese chicken franchise was slapped with a $20,000 fine for health breaches this month\nJustin Bieber pictured speaking with a fan at the Portuguese chicken franchise on Thursday\nThe Belmont store was ordered to pay $20,000 and costs of $1745.50 for offences on September 13, 2016, WAToday report\n'Me when I see food,' Justin Bieber captioned this photo posted to his millions of Instagram followers\nWhile Bieber was escorted by a large contingency of police and supporters, it appears he was not warned about the store's health breach.\nWhile not out ordering questionable fast food, the Canadian music sensation has reportedly spent time with Western Australia model Emily Baldwin during his stay in Australia.\nMs Baldwin, a former Miss Universe WA contestant, was reportedly seen entering Bieber's $25,000-a-night suite at Crown Towers on Wednesday night.\nBieber's Purpose World Tour kicked off in Western Australia on Monday night, and will take it to Melbourne, Brisbane and Sydney in March.\nWhile not out ordering questionable fast food, the Canadian music sensation has reportedly spent time with Western Australia model Emily Baldwin (pictured)","url":"https://www.dailymail.co.uk/news/article-4300370/Justin-Bieber-spotted-Nando-s-Belmont.html"}
