{"authors":["Kelli Serio"],"date_download":"2018-10-30 20:22:39","date_modify":"2018-10-30 20:22:39","date_publish":"2015-11-17 18:24:03","description":"Justin Bieber paid tribute on Twitter to his friend, Universal Music Group executive Thomas Ayad, who was killed in the Paris attacks.","filename":"data/vaneerConsumption/JustinBieberHonorsFriendWhoDiedinParisTerroristAttacks.json","image_url":"https://media.breitbart.com/media/2015/11/Justin-Bieber-LA-Staples-Center-GettyImages.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_11_17__1540930959.html","title":"Justin Bieber Honors Friend Who Died in Paris Terrorist Attacks","title_page":"Justin Bieber Honors Friend Who Died in Paris Terrorist Attacks","title_rss":"NULL","source_domain":"breitbart.com","text":"Justin Bieber paid tribute on social media to his friend, Universal Music Group executive Thomas Ayad, who was killed in Friday’s terrorist attacks in Paris.\nPeople reports Ayad was among the 89 people killed during the attack at the Bataclan theater, where rock group the Eagles of Death Metal was playing a show.\n“Still thinking about Paris and my friend Thomas that we lost in the tragedy. He was a part of the team for years and I wish I would’ve had more time to thank him,” wrote Bieber on his social media platforms.\n“Make sure to appreciate people while you have them. Thanks Thomas for everything you did for me. You are appreciated and missed. Thoughts and prayers are with your family & friends,” he wrote, using the tag #PrayForParis.\nThe Islamic State of Iraq and Syria (ISIS) has claimed responsibility for the series of attacks that struck the French capital, which killed at least 129 people and injured 350 more.\nThe terror group released a statement online in the aftermath of the tragedy, in which it described the attacks as the “first of the storm,” while referring to Paris as a “capital of prostitution and obscenity.”\nNick Alexander, the merchandise manger for the Eagles of Death Metal, was also killed at the concert.\nAccording to reports, EoDM members were onstage at the venue when the attackers burst through the doors and opened fire on the audience.\n“We are still currently trying to determine the safety and whereabouts of all our band and crew,” the group wrote on Facebook. “Our thoughts are with all of the people involved in this tragic situation.”\nFrench President Francois Hollande has announced France would remain in a state of emergency following the attacks.","url":"https://www.breitbart.com/entertainment/2015/11/17/justin-bieber-honors-friend-died-paris-terrorist-attacks/"}
