{"authors":["Lydia Willgress For Mailonline"],"date_download":"2018-10-23 00:26:29","date_modify":"2018-10-23 00:26:29","date_publish":"2016-01-29 13:20:20","description":"Lauren Spierer was last spotted partying with a group of friends in a sports bar in Bloomington, Indiana, in June 2011. Police yesterday searched a house around 20 miles away in Martinsville.","filename":"data/vaneerConsumption/JustinWagershomesearchedinhuntforIndianacoedLaurenSpierer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B2163700000578-0-image-a-81_1454073610051.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422678_Home-serial-flasher-searched-hunt-Indiana-ed-Lauren-Spierer-disappeared-2011_1540254389.html","title":"Justin Wagers' home searched in hunt for Indiana co-ed Lauren Spierer","title_page":"Justin Wagers' home searched in hunt for Indiana co-ed Lauren Spierer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A property linked to a serial flasher has been searched by police hoping to discover clues about a girl who disappeared nearly five years ago.\nIndiana University student Lauren Spierer, 20, was last spotted partying with a group of friends in a sports bar in Bloomington in June 2011.\nPolice were yesterday seen searching a Martinsville house around 20 miles away and a lawyer for Justin Wagers - who has a long string of public indecency charges and who is thought to be related to the occupier - confirmed it was linked to the case.\nScroll down for video\nInvestigation: A property linked to serial flasher Justin Wagers (left) has been searched by police hoping to discover clues about Lauren Spierer (right) who disappeared nearly five years ago\nMissing: Lauren Spierer went missing back in 2011 and despite her family's desperate search there have been no solid leads\nOfficers were photographed sifting through mud and dirt near to the property, which police confirmed was occupied by someone under the name of Wagers.\nDogs and FBI agents also searched the scene, footage from Fox59 showed.\nLauren Spierer's mother Charlene told WTHR.com she was 'sick' over the latest revelations.\n'This is just making me sick now. I want to find Lauren more than anything in the whole wide world and that’s the most important thing. So, if it is, it is, you know, I want to know.'\nIn another interview with Fox59, she added: 'If Lauren is there, then that's what my main concern is, is finding Lauren and bringing her home. Wherever she is, however bad it might be, that's my one and only goal, is to find her. I do believe that we're going to find Lauren one day, but, you know, it's very hard with each passing year, and you kind of just have to sort of give it over to the powers that be. Because not knowing and not having her is devastating.\n'There are no words. It's very hard to live with every single day.'\nMeanwhile, WTHR.com revealed the link with Lauren's disappearance could be a white van seen near the site of her disappearance.\nSurveillance footage captured the vehicle but police, at the time, said they had spoken to the owner and there was no connection to Spierer's disappearance.\nThe website claims a white truck was towed from Wagers' property on Thursday.\nOne neighbor told WISHTV: 'You could tell they were searching. They had the dogs out and they were going through stuff.\n'[They were] walking in and out of their shed, barn... each of their houses.'\nWTHR also reported a separate property in Trafalgar, Indiana, had been searched.\nSearch: Police officers searched the Martinsville property of sex offender Justin Wagers on Thursday in connection with the disappearance of Lauren Spierer back in 2011\nProbe: FBI and local police officers were seen on site of the property combing through belongings, pictured, and according to WTHR seized a white van\nEvidence? Investigators are exploring the property where Justin Wagers lived with his mother and stepfather before his arrest in August on indecency charges\nMr Wagers' lawyer insisted his client, who is currently in prison, had 'no knowledge' of Miss Spierer.\nHe added: 'The family has no further comment at this time and asks that the media respect their privacy.'\nMiss Spierer is believed to have left Kilroy's Sports Bar around 2.30am on June 3 2011 without her shoes or phone.\nShe is then said to have gone to a friend's apartment, which she left around two hours later. She was reported missing the following morning.\nHer disappearance sparked an extensive search and officers have never arrested anyone despite posters and billboards being erected in a bid to get information.\nBloomington Police yesterday confirmed they were at the property as part of an 'active and ongoing investigation'.\nAccording to WTHR.com, Wagers lived on the property with his mother and stepfather before he was arrested in August.\nDevelopment: Lauren Spierer's mother Charlene said she was anxious at the search before adding 'I want to find Lauren more than anything in the whole wide world and that’s the most important thing'\nVanished: Indiana University student Miss Spierer is believed to have left Kilroy's Sports Bar (pictured) around 2.30am on June 3 without her shoes or phone\nHe is accused of exposing himself to a woman at a gas station and is linked to at least five other cases of indecent exposure.\nHe was already on the sex offenders register before the most recent allegations. He has criminal convictions in five counties including charges of public indecency and battery, the website reported.\nSpierer's parents previously filed a federal lawsuit against the men who were with her on the night of her disappearance but it was dismissed in October 2014.","url":"https://www.dailymail.co.uk/news/article-3422678/Home-serial-flasher-searched-hunt-Indiana-ed-Lauren-Spierer-disappeared-2011.html"}
