{"authors":["Faye James","Monique Friedlander For Daily Mail Australia"],"date_download":"2018-10-22 21:21:56","date_modify":"2018-10-22 21:21:56","date_publish":"2017-03-16 01:04:53","description":"He has become increasingly vocal about his religious beliefs over the past few years, having even tattoed a small crucifix to his face last year.","filename":"data/vaneerConsumption/JustinBieberkicksoffSydneyshowwithChristianmessage.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/02/3E504A9A00000578-0-image-a-17_1489629624218.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318536_Justin-Bieber-kicks-Sydney-Christian-message_1540243316.html","title":"Justin Bieber kicks off Sydney show with Christian message","title_page":"Justin Bieber kicks off Sydney show with Christian message | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He has become increasingly vocal about his religious beliefs over the past few years, having even tattoed a small crucifix to his face last year.\nAnd Hillsong devotee Justin Bieber, 23, once again reminded fans of his faith by broadcasting a Christian message during his Purpose concert in Sydney this Wednesday.\nDuring the sold-out show, Justin descended onto the stage in a transparent box baring the hand-written words: 'Mark my words Jesus loves you!!!!'\n'Mark my words Jesus loves you!!!!' Hillsong devotee Justin Bieber, 23, once again reminded fans of his faith by broadcasting a Christian message during his Purpose concert in Sydney this Wednesday\nIt's not the first time Justin has spotlighted his religious views on-stage during his Purpose world tour.\nDuring a recent Paris concert, Justin broke out into an impromptu rendition of Christian ballad I Could Sing Your Love Forever.\nIn recent years, Justin also been spotted spending time with NYC Hillsong co-pastor Carl Lentz, Hillsong NYC, worship leader Joel Houston, City Church Pastor Judah Smith, and other influential young Christian leaders.\nBest night! He may have received some criticism for his sombre performance in Melbourne, but in Sydney Justin Bieber was full of smiles on Tuesday night\nHe is also known to attend regular Hillsong conferences, having paid a visit to a week-long Sydney Hillsong event in 2015.\nJustin received criticism for his sombre performance in Melbourne, but managed to wear a brigher expressoin as he took the stage in Sydney on Tuesday.\nTelling his 70,000 adoring fans in at the ANZ stadium Sydney that it was the 'best night of his life' not once, but THREE times, Justin was in great form for his Purpose World Tour.\nThe pop sensation even smiled at the concert and revved up the audience, thanking them and asking them to 'make some noise' while fans themselves raved that it was 'an amazing show'.\nOn form: Telling his 70,000 adoring fans in at the ANZ stadium Sydney that it was the 'best night of his life' not once, but THREE times, Justin was in great form\n'Thank you for an amazing show' wrote one fan while one simply said, 'WAS SO GOOD.'\n'Tonight was hectic! You continue to inspire me each and every day! Thank you,' wrote another.\n'Thank you so much! It was amazing!' gushed one more.\nJustin even went as far to invite a handful of pint size fans onto stage and introduced them to the crowds.\nHappy: 'Thank you so much! It was amazing!' gushed a fan\nFan-tastic! One simply said, 'WAS SO GOOD.'\n'Tonight was hectic! You continue to inspire me each and every day! Thank you,' wrote another\nThe performance was certainly an improvement to Melbourne where patrons at the concert were left less than impressed, with some of the 50,000 fans who packed into the arena to see the pop superstar complaining about his demeanour on stage.\nThey said he 'looked miserable' and 'seemed bored' throughout the one hour and forty-five minute performance.\nThanks! One fan called the star 'My man!'\nInclusive: Justin even went as far to invite a handful of pint size fans onto stage and introduced them to the crowds\nTaking to Twitter, one concertgoer wrote, 'So excited, yet a little disappointed. You seemed bored.'\nThe user added a frowning emoji and the hashtag 'it's too late now to say sorry.'\nResponding to a review in The Age, which claimed that Bieber had a 'stone face' and only had 'hollow interactions' with the audience, several other concertgoers shared their thoughts.\nSo disappointed with Justin Bieber,' wrote one Facebook user who added that he 'looked uninterested' and he put 'zero effort into it.'\n'Couldn't decide if he was bored or just trying to be edgy,' another user wrote.\n'Anyone who saw him on Ellen a few weeks ago knows he is just over it at the moment. I took my daughter and she loved it so I can't complain because the overall show is amazing.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318536/Justin-Bieber-kicks-Sydney-Christian-message.html"}
