{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 20:09:03","date_modify":"2018-10-30 20:09:03","date_publish":"2015-02-16 04:14:05","description":"In the United States, fear of HIV has recently faded as treatments and awareness have caused some complacency with the disease.","filename":"data/vaneerConsumption/JustasObamaOpensRelationsaNewStrainofHIVAppearsinCuba.json","image_url":"https://media.breitbart.com/media/2014/12/Blood-collection-tube-HIV-AP-SHERRY-YATES-YOUNG.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_15__1540930143.html","title":"Just as Obama Opens Relations, a New Strain of HIV Appears in Cuba","title_page":"Just as Obama Opens Relations, a New Strain of HIV Appears in Cuba","title_rss":"NULL","source_domain":"breitbart.com","text":"In the United States, fear of HIV has recently faded as treatments and awareness have caused some complacency with the disease. But a new, more virulent strain seems to be upsetting that complacency, and the source of this stronger version of the deadly virus is Cuba, the very nation that Obama wants opened up to American tourism.\nThe Centers for Disease Control says that 1.2 million Americans are living with HIV and that the disease has never become any less of a worry than it was at the height of the fear it caused in the 1980s and 90s. In fact, the CDC says that HIV is still at epidemic levels.\nOver 600,000 Americans have died of AIDS since it was first diagnosed in the 1980s.\nStill, many treatments and advances in science have helped millions live longer with the disease.\nBut new worries about HIV are growing among researchers concerned over the strain found in Cuba. In a new study published in the journal EBioMedicine, researchers report that the new strain could be “far more lethal to patients in the West” than previous strains.\nThe researchers found that the new strain cuts the window of treatment from five or ten years to only three, meaning that patients have far less time until the HIV virus develops into full-blown AIDS. It also means that patients will have far less time to seek treatment.\n“The new variant named ‘CRF19’ reveals a combination of HIV subtypes A, D and G, and is far faster-acting than strains within the general populous,” Science Times reported on February 15.\nResearchers said that some cases have been reported in Africa, but it is Cuba where CRF19 is seen most frequently.\nThe magazine goes to pains to note that currently the strain has been contained in Cuba.\n“As Cuba is an island nation, the virus remains rather removed from other populations. And current trade embargoes with Cuba also keep possible transmission contact low,” Science Times reported.\nBut that will all change quickly and drastically if President Obama gets his way and relations with Cuba are opened up to greater travel from the US.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/politics/2015/02/15/just-as-obama-opens-relations-a-new-strain-of-hiv-appears-in-cuba/"}
