{"authors":["Kelli Serio"],"date_download":"2018-10-30 20:23:35","date_modify":"2018-10-30 20:23:35","date_publish":"2015-07-07 16:52:39","description":"During his vacation in Australia this week, Justin Bieber posted an image of his butt to his Instagram page. |","filename":"data/vaneerConsumption/JustinBieberOwnedbyFollowersAfterPostingPhotoofHisButt.json","image_url":"https://media.breitbart.com/media/2015/07/bieber-instgram.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_07_07__1540931015.html","title":"Justin Bieber Owned by Followers After Posting Photo of His Butt","title_page":"Justin Bieber Owned by Followers After Posting Photo of His Butt | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During his vacation in Australia this week, Justin Bieber posted an image of his butt to his Instagram page.\nLook A photo posted by Justin Bieber (@justinbieber) on Jul 6, 2015 at 7:38pm PDT\nWhile Biebs is no stranger to bad press or bizarre publicity stunts, his latest act has left many wondering if they are seeing him for what he truly is: an ass. In a new photo captioned, “Look,” the 21-year-old pop singer asked his 23 million followers to check out his back side while he sailed down the coast, and they’re talking.\nGarnering more than 460,000 comments in 13 hours, the post impressed some, while other commenters wondered if Bieber’s post was just a depraved cry for attention.\n“Dat ass doe,” said one fan, while another simply stated, “God is real.”\nTo counter the number of positive responses, a large number of commenters are seemingly fed up with the way millennials are conducting themselves on social media, and they took their frustrations out on Bieber.\n“Ur wasting ur youth,” said one critic. “Anything for attention,” wrote another.\nA commenter wrote, “U r a bad person justin.”\nWhile one simply said, “homo.”\nThe happening wouldn’t have been a true circus without Miley Cyrus, and she obliged.\nCyrus got ahold of the image, and as she often does, thought Biebs needed a little enhancement, so she put her photoshop skills to the test and re-posted the same photo on her page, only with a new butt attached.\nShe captioned hers, “Bieber got back!”\nBieber got back! A photo posted by Miley Cyrus (@mileycyrus) on Jul 6, 2015 at 10:52pm PDT\nWhile Cyrus and Bieber are often accused of sporting the same haircut, it seems they both share something else: the need for constant attention.","url":"https://www.breitbart.com/entertainment/2015/07/07/justin-bieber-owned-by-followers-after-posting-photo-of-his-butt/"}
