{"authors":[],"date_download":"2018-10-30 01:16:46","date_modify":"2018-10-30 01:16:46","date_publish":"2018-09-04 00:05:47","description":"It is now becoming quite clear that for the last few years a double standard has existed regarding how the FBI and the Department of Justice (DOJ) handle Obama/Clinton campaign finance violations versus how they treat alleged violations by President Trump. And the Special Counsel’s office seems to have continued that tradition as seen in the recent court action involving Michael Cohen.","filename":"data/vaneerConsumption/JusticeIsntBlindWhenItComestoCampaignFinanceViolations.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/1024px-Obama_unity.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862206.html","title":"Justice Isn’t Blind When It Comes to Campaign Finance Violations","title_page":"Justice Isn’t Blind When It Comes to Campaign Finance ViolationsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"It is now becoming quite clear that for the last few years a double standard has existed regarding how the FBI and the Department of Justice (DOJ) handle Obama/Clinton campaign finance violations versus how they treat alleged violations by President Trump. And the Special Counsel’s office seems to have continued that tradition as seen in the recent court action involving Michael Cohen.\nOf the eight criminal charges Cohen pleaded guilty to, two of them are alleged campaign finance offenses involving his payment of personal — not campaign — hush money to Stormy Daniels and Karen McDougal, two women who claim to have had affairs with Trump almost a decade before he was a candidate. But the media talking heads who pretend to be experts on such laws are making a huge mistake. First and foremost, a candidate is allowed to spend as much of their own money as they want on campaign expenditures, but it is far from certain if Trump’s payment to these women can even be described as campaign expenditures.\nAs former FEC Chairman Bradley Smith says, “When the FEC wrote the regulation that says what constitutes campaign expenditures and what constitutes personal use, it rejected specifically the idea that campaign expenditure was anything related to a campaign, and instead says it has to be something that exists only because of the campaign and solely for that reason.” Indeed, there are reasons to believe Trump would have paid these women even if he were not running for president and attempting to prove Trump’s intent would be impossible. Unless Cohen has evidence on tape or in writing that Trump made these payments specifically to influence the campaign, then this issue is a non-issue. If Cohen did have such evidence, we would have heard about it by now.\nMoreover, as Bradley Smith stated, “it looks like Trump has made these kinds of payments to people before unrelated to his campaign or as a candidate. It’s hard to show this payment was made solely because he was running for election.” Lastly, the idea that the government could declare something illegal that the candidate did on his own time and with his own money would be unprecedented. Indeed, non-disclosure agreements between two parties are consummated every day in America. They are not illegal. And by the way, Cohen did not work for the campaign; he was Trump’s personal attorney.\nStatements by Cohen’s attorney Lanny Davis and other media talking heads about how such expenditures are crimes are outrageous. Davis is clearly trying to score points with his leftist friends by working with prosecutors to fabricate a charge that doesn’t really exist in the law but will be used by congressional Democrats to build a phony case for impeachment, should they take power this November. What’s shocking is that Cohen allowed his attorney to plead guilty to a non-existent crime, all for the purpose of giving political ammunition to the Democrats. Cohen was taken for a ride.\nBut now, for funzies, let’s take a look at how the feds have treated campaign finance violations by Obama and Hillary.\nIn 2008, Investor’s Business Daily reported that more than $190 million of Obama’s campaign contributions were unidentifiable and some of it was foreign and over the allowable limits. Newsmax reported that this was “the largest pool of unidentified money that has ever flooded into the U.S. election system, before or after the McCain-Feingold campaign finance reforms of 2002.”\nThe Obama campaign simply refused to identify the contributors, probably because some of them were from the Middle East. Researchers associated with the Atlas Shrugs blog reported that Obama received 81 donations from foreign sources including many of which were over the legally allowed contribution limit. Indeed, Pamela Geller devoted a whole section of her website to articles detailing Obama’s illegal foreign contributors including thousands of dollars contributed by “Palestinians” from a Hamas-controlled refugee camp in Gaza. And her site is a gold mine of info on other shady foreign contributors who illegally helped Obama win the 2008 election. Andy McCarthy also wrote about this illegal fundraising in NRO. And Ken Timmerman wrote in Newsmax about 118 illegal contributors to Obama who were identified as foreigners.\nThe RNC filed a complaint with the FEC and five years later the FEC fined Obama. Naturally, this was ignored by the media but more importantly, there was zero interest in this scandal by the DOJ, FBI, Congress, or anyone else. Obama was never held accountable and no one suggested impeaching him. So if you’re a leftist running for president and foreigners from all over the world illegally contribute to your campaign, the feds won’t lift a finger. Imagine for a second if a Republican candidate for President had violated all these campaign finance laws. There would have been a half dozen federal investigations.\nIn 2011, Obama again blatantly violated federal law when he used federal offices to raise campaign money. Specifically, he was illegally using the White House “Map Room” for partisan political fundraising and even sent out a video promoting such illegal activity. See here and here.\nThe RNC chairman at the time, Reince Priebus, sent a letter to Attorney General Eric Holder asking him to investigate, but Holder did nothing, nor did any law enforcement agency or even the FEC investigate.\nBut let’s look at an issue that more closely resembles Trump’s payment of hush money to the two women. During the 2008 election, one of Obama’s campaign associates approached Reverend Jeremiah Wright and offered him hush money — $150,000 — to stay silent the rest of the election season. Wright was Obama’s long-time pastor but, not surprisingly, also a radical, anti-white racist who famously uttered “God damn America” among other things. Obama was alarmed since the media was beginning to take notice of this nut job and the two held a secret meeting. It is not certain if this money ever changed hands but if it did and it was specifically designed to influence the election (which it was) and it wasn’t disclosed (which it wasn’t), then federal laws were violated. However, even though this was reported by journalist Edward Klein in his book, The Amateur, six years ago, I am not aware of any investigations by any federal agency or the FEC to determine if federal laws were violated.\nFast forward to 2018 and an FEC complaint is filed by the Committee to Defend the President, claiming that Hillary’s campaign committee, the Hillary Victory Fund, was “using state chapters as straw men to circumvent campaign donation limits and launder(ing) the money back to her campaign.” Dan Backer, the attorney who filed the complaint, explains in Investor’s Business Daily, that “roughly $84 million may have been laundered in what might be the single largest campaign finance scandal in U.S. History.”\nBacker’s complaint is rock solid and is a far more serious violation of election law than any campaign finance issue Mueller is currently investigating. But even though Backer filed his complaint over six months ago, where’s all the headlines? Why hasn’t Mueller added this to his growing list of targets? Where’s Jeff Sessions and the DOJ? If this is the “single largest federal campaign finance scandal in U.S. history,” why isn’t the FBI investigating this? Instead, everyone is focused on a highly questionably allegation involving a measly $280,000 paid by Trump personally to two women.\nWe should also not forget the clear cut federal campaign violations by Hillary’s campaign when they paid a private group, Fusion GPS, to compile the phony dossier targeting Trump. But they did so by funneling the money through a law firm called Perkins Coie and then falsely described this expenditure on campaign disclosure forms as payment for “legal services.” And the DNC did the same exact thing. This blatant effort to try to hide the purpose of campaign expenditures is a violation of Federal election law. At least Trump’s payments were never described as anything other than what they were, nor did he use campaign money. But will we see Robert Mueller question or investigate anyone associated with Hillary’s presidential campaign or Fusion GPS? It’s doubtful. Will the FEC investigate it? Probably not.\nClearly, if you are Obama or Hillary, you can do just about anything to violate campaign finance laws and the worst thing to happen is a slap on the wrist by the FEC. However, if you are a Republican like President Donald Trump, a very weak allegation of a campaign finance violation will not only be investigated by the feds but will be used to bolster the Democrat argument that Trump should be impeached. This is why most Americans feel Lady Justice is no longer blind.","url":"https://spectator.org/justice-is-not-blind-when-it-comes-to-campaign-finance-violations/"}
