{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 22:26:46","date_modify":"2018-10-30 22:26:46","date_publish":"2014-08-15 17:11:06","description":"This is so insanely sweet. At a recent Justin Timberlake concert — with 25,000 fans in attendance! — a sweet 8-year-old boy named Julian was treated to a chorus of the \"Happy Birthday\" song led by Justin Timberlake himself, after Timberlake found…","filename":"data/vaneerConsumption/JustinTimberlakeSingingHappyBirthdaytoaYoungAutisticFanAtaHugeConcertWillRemindYouThatTheresGoodIntheWorldVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/014abfe2-e9a3-41c0-864b-aadcb2fcdd4a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35954-justin-timberlake-singing-happy-birthday-to-a-young-autistic-fan-at-a-huge-concert-will-remind_1540938406.html","title":"Justin Timberlake Singing Happy Birthday to a Young Autistic Fan At a Huge Concert Will Remind You That There's Good In the World - VIDEO","title_page":"Justin Timberlake Singing Happy Birthday to a Young Autistic Fan At a Huge Concert Will Remind You That There's Good In the World — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"This is so insanely sweet. At a recent Justin Timberlake concert — with 25,000 fans in attendance! — a sweet 8-year-old boy named Julian was treated to a chorus of the \"Happy Birthday\" song led by Justin Timberlake himself, after Timberlake found out that Julian was attending the concert with his mother to celebrate his birthday. Seriously, could this dude get any more awesome?\nAlong with video footage filmed by the group sitting next to the family of the once-in-a-lifetime surprise, Julian's mother, Marika, blogged about the experience:\nAnd at the perfect quiet moment, the group in front of us started yelling to get Justin’s attention, because despite his loud volume, Julian’s voice was not carrying. Only repeating. And then before we knew what was happening, the group in front of us that had turned out to be so incredibly kind all night to our birthday boy, and these gorgeous girls who I was convinced would be totally annoyed by Julian, had captured Justin’s attention. And then it happened. Justin Timberlake was singing Happy Birthday. They all were. The awesome grandmother of 3 sitting in front of us. The model-esque girls sitting to our right. The people sitting to our left that offered us the video that they captured of the whole thing. They were all singing. All 25,000 of them.\nMarika added in her blog post that Julian is autistic, and she had initially been worried about taking him to the concert to celebrate his birthday, but that the event completely made her fears disappear instantly:\nAnd I swear the light in his eyes when this world of people began to sing was so bright it must have been what got my eyes so unexpectedly teary, you know the way your eyes water when you look at the sun? All my mama worries had been for naught. Everyone was embracing our boy in the way I was afraid they wouldn’t. Here we stood while thousands of people lifted him in song to celebrate the day he came into the world 8 years ago.\nSeriously, who else feels a little teary-eyed? I think, especially after all that's gone on in the world this week, we all need a little reminder and proof that there's good in the world. This is that. Check out the video below.\nTree of Life United Ministries on YouTube\nImage: Gifatron","url":"https://www.bustle.com/articles/35954-justin-timberlake-singing-happy-birthday-to-a-young-autistic-fan-at-a-huge-concert-will-remind"}
