{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 04:36:48","date_modify":"2018-10-23 04:36:48","date_publish":"2016-01-28 20:42:11","description":"The 21-year-old hit-maker showed no hesitation in jumping from his giant SUV at a main intersection into the street, to check on the fallen bicyclist. Earlier he had partied at a hip LA club.","filename":"data/vaneerConsumption/JustinBiebergetsoutofhisluxurySUVtocometoaidofmanwhohasfallenoffbike.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30AD274A00000578-0-image-a-47_1454010991449.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421569_Justin-Bieber-gets-luxury-SUV-come-aid-man-fallen-bike-hitting-club-fling-Kourtney-Kardashian_1540269408.html","title":"Justin Bieber gets out of his luxury SUV to come to aid of man who has fallen off bike","title_page":"Justin Bieber gets out of his luxury SUV to come to aid of man who has fallen off bike | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He'd spent the evening bar-hopping around Los Angeles, starting at his regular joint The Nice Guy, where he almost ran into 2015 'fling' Kourtney Kardashian.\nAnd Justin Bieber then showed off a kinder side as he stopped to help a stricken bicyclist in Hollywood in the early hours of Thursday.\nThe 21-year-old Sorry hit-maker showed no hesitation in jumping from his giant luxury SUV at a main intersection into the street to check on the fallen rider.\nScroll down for video\nAssistence: Justin Bieber he stopped to help a stricken bicyclist in Hollywood in the early hours of Thursday\nWearing a green bomber jacket, which featured the slogan,'Under Cover Maniac', the star went undercover of darkness to the assistance of a remarkably similarly-clad individual who appeared to have come-off his two-wheeled ride.\nNo doubt he would have been surprised to see the Sorry hitmaker - who covered his head with a grey Supreme beanie, despite wearing a cream hoodie under his jacket - come to his aid.\nJustin didn't even take the time to close the doors of his gigantic Chevrolet, showing off the pristine cream leather interior.\nSee Justin Bieber updates as he goes to the aid of man who has fallen off his bike\nNight out: He'd spent the evening at The Nice Guy, his regular joint\nThere the beauty is: Also at the venue was his 2015 'fling' Kourtney Kardashian\nThe chart-topping Baby singer opted for a casual and low-key look for his night on the town, throwing together a comfy yet on-point ensemble.\nHe also wore a pair of drop-crotch black jeans, before rounding off his outfit with a pair YEEZY Boost 350s.\nStarting off on Wednesday night at the celeb-fave bar and eatery, Justin obviously had put some planning into his mid-week partying, as he was later seen looking a little bleary-eyed leaving the trendy cocktail bar the Warwick - where he abandoned his 'undercover' routine.\nMishap: The star went undercover of darkness to the assistance of a remarkably similarly-clad individual who appeared to have come-off his two-wheeled ride\nComfy: The chart-topping Baby singer opted for a casual and low-key look for his night on the town\nHurry: He didn't even take the time to close the doors of his gigantic Chevrolet, showing off the pristine cream leather interior\nEarlier in the evening, despite apparently partying solo, he showed his softer, more romantic side as he bought a bunch of roses.\nPerhaps thinking of a particular someone, the singer walked off with a brace of the red flowers from a street seller.\nJustin has most recently been romantically linked to Hailey Baldwin, 19, after they enjoyed a steamy clinch in St Barts over New Year.\nSomeone in mind? Earlier in the evening, despite apparently partying solo, he showed his softer, more romantic side as he bought a bunch of roses and removed some of his clothing","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421569/Justin-Bieber-gets-luxury-SUV-come-aid-man-fallen-bike-hitting-club-fling-Kourtney-Kardashian.html"}
