{"authors":["Quinn Keaney"],"date_download":"2018-10-30 23:30:13","date_modify":"2018-10-30 23:30:13","date_publish":"2014-08-13 17:40:47","description":"What does Joe Manganiello do in between time spent looking at his glistening, chiseled abs and caressing the perfect stubble that lines his rugged jaw? Well, these days Joe Maganiello's been cozying up to Sofia Vergara. Almost immediately after the…","filename":"data/vaneerConsumption/JustinTimberlakesLosAngelesConcertDoubledasaCelebrityOrgyPHOTOS.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/79a53ab5-0ca6-47c1-8c30-1b3276aa11a1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35622-justin-timberlakes-los-angeles-concert-doubled-as-a-celebrity-orgy-photos_1540942213.html","title":"Justin Timberlake's Los Angeles Concert Doubled as a Celebrity Orgy - PHOTOS","title_page":"Justin Timberlake's Los Angeles Concert Doubled as a Celebrity Orgy — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"What does Joe Manganiello do in between time spent looking at his glistening, chiseled abs and caressing the perfect stubble that lines his rugged jaw? Well, these days Joe Maganiello's been cozying up to Sofia Vergara. Almost immediately after the Modern Family bombshell announced she was single, True Blood hunk Manganiello swooped in and has been spotted smooching her all over Los Angeles. How does he keep her entertained when they're not dominating the West Coast with their insane levels of combined sex appeal? Attending a Justin Timberlake concert, that's how, and he wasn't the only celebrity boyfriend to think so.\nWhile finishing up the last show on the US leg of his 20/20 Experience tour at the Staples Center on on August 12, Justin Timberlake had hot Hollywood couples coming out in droves for a night of watching Timberlake pelvic thrust his way through song after song. It was basically one big tabloid buffet of celebrity hand holding and lovey-dovey stolen glances from much-talked about pairs like Vergara and Manganiello, Lea Michele and Matthew Paetz, and Naya Rivera and new hubby Ryan Dorsey. Is it even legal to have that much hotness in one stadium? Doesn't that need to be regulated somehow? Jeeze.\nJust look at them. Are they even real? Is this union allowed? Please have babies already.\nThere's no doubt that Lea Michele and boyfriend Matthew Paetz either made out and stared deep into each other's eyes the whole concert, OR Matthew was forced to listen to her explain how much better of a singer than Justin she is after every song.\nThe amount of fierce that Naya Rivera serves on a day-to-day basis is pretty incredible. The hat? The abs? The \"If-I-See-Rachel-Berry-I'm-Going-To-Cut-Someone\" expression? God bless you, Ryan Dorsey.\nQuietly slipping in behind all of those attention-grabbing pairs was low-key couple 90210 star Shenae Grimes and hubby Josh Beech. Their matching denim vests really manage to get, \"We're here to listen to Suit & Tie, not the sound of Joe Manganiello's tongue slurping on Sofia Vergara's face,\" across without being too obvious. Love it.","url":"https://www.bustle.com/articles/35622-justin-timberlakes-los-angeles-concert-doubled-as-a-celebrity-orgy-photos"}
