{"authors":["Bianca La Cioppa For Daily Mail Australia"],"date_download":"2018-10-23 00:19:22","date_modify":"2018-10-23 00:19:22","date_publish":"2016-01-28 14:06:25","description":"Justin Hemmes flashed his McLaren P1 car, worth $2 million, on Thursday as he stepped out in Sydney.","filename":"data/vaneerConsumption/JustinHemmesstepsoutin500000sportscarforacasualdriveinSydney.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA6EFE00000578-0-image-a-7_1453986692130.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420791_Hotelier-Justin-Hemmes-steps-500-000-sports-car-enjoys-casual-drive-Sydney_1540253962.html","title":"Justin Hemmes steps out in $500,000 sports car for a casual drive in Sydney","title_page":"Justin Hemmes steps out in $500,000 sports car for a casual drive in Sydney | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He is one of Sydney's best-known entrepreneurs, and on Thursday Justin Hemmes flashed his worth as he stepped out in Sydney with his McLaren 650S Coupé.\nThe luxury black vehicle is worth a whopping $500,000 and features Batman-style doors which open upwards.\nThe 43-year-old showed off a blunt look as he parked his luxury automobile on the side of one of Paddington’s busy street.\nScroll down for video\nShowing off: Justin Hemmes flashed stepped out in Sydney with his McLaren 650S Coupé on Thursday\nPricey: The vehicle is rumoured to be worth a whopping $500,000\nHe dressed to impress for his quick outing in a pair of dark skinny-cut slacks and a short-sleeves button-up shirt.\nJustin slicked his golden locks back and tucked it behind his ears as he showed off his unshaven facial hair.\nWhile his partner Katie Fowler and newborn daughter were nowhere to be seen, the worthy businessman was accompanied by a female companion.\nStylish: The luxury vehicle also features Batman-like doors which open upwards\nConcentrating: The 43-year-old showed off a blunt look as he parked his luxury automobile on the side of one of Paddington’s busy street\nStylish: He dressed to impress in a pair of dark skinny-cut slacks and a short-sleeves button-up shirt\nJustin and Kate became parents for the first time last November.\nThe loved-up couple announced the exciting news of their daughter's arrival on social media.\n'Alexa Merivale Hemmes. Born Thursday 5th of November at 2:34am. The most magical moment imaginable. Yet you continue to enchant us more and more each day. We cannot wait to share our lives with you,' Kate, 25, wrote at the time.\nCasual: Justin slicked his golden locks back and tucked it behind his ears as he showed off his unshaven facial hair\nCompany: While his partner Katie Fowler and newborn daughter were nowhere to be seen, the worthy businessman was accompanied by a female companion\nFamily: Justin and Kate became parents for the first time last November to their daughter Alexa Merivale\nFollowing the tiny tot's arrival Justin opened up about her birth to the Manly Daily revealing he was 'bawling' when he first laid eyes on her.\nSince expanding their family, Justin has regularly taken to his Instagram account to document the quick growth of his princess.\nJustin is the CEO of the Merivale empire, which includes hot nightspots The Ivy in Sydney and Coogee Pavilion.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420791/Hotelier-Justin-Hemmes-steps-500-000-sports-car-enjoys-casual-drive-Sydney.html"}
