{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 23:44:18","date_modify":"2018-10-30 23:44:18","date_publish":"2014-08-13 13:56:08","description":"He may have escaped a hefty amount of jail time, but he's still got the government to pay. The Associated Press reports that Justin Bieber will head to anger management as a part of his sentence from his arrest back in January for illegal street…","filename":"data/vaneerConsumption/JustinBiebersAngerManagementSentenceIsOnlytheTipoftheIceberg.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/a682bc5e-6643-430a-a325-3e86450a86c1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35576-justin-biebers-anger-management-sentence-is-only-the-tip-of-the-iceberg_1540943058.html","title":"Justin Bieber's Anger Management Sentence Is Only the Tip of the Iceberg","title_page":"Justin Bieber's Anger Management Sentence Is Only the Tip of the Iceberg","title_rss":"NULL","source_domain":"bustle.com","text":"He may have escaped a hefty amount of jail time, but he's still got the government to pay. The Associated Press reports that Justin Bieber will head to anger management as a part of his sentence from his arrest back in January for illegal street racing. (This arrest, which happened in Miami, is different from Egg-gate 2014.) In addition to the anger management sessions, Bieber will be donating $50,000 in the name of charity and will also be paying a fine ordered by the court. So basically, Bieber's atoning for this crime with his fat wallet and by agreeing to zen out a little.\nBut with all of the other fines he's paying — like the misdemeanor fine he received back in July for yes, that egg-throwing debacle — he could definitely see his wallet start to get a little slimmer. But maybe he won't get mad about it after his anger management sessions? Or maybe he'll decide to just keep his mouth shut; perhaps Orlando Bloom taught him a thing or two. Or maybe, he'll adopt a Notorious B.I.G. sentimentality toward it all — \"mo money, mo problems.\" If he has less money... then he'll have fewer problems, and then he'll be less inclined to break the law?\nOne could speculate for days, and even if Bieber does clean his act up, it's unlikely, no matter how much those Beliebers keep on believing, that they'll ever get this again:\nTurnin' back time is tough.\nImage: Giphy","url":"https://www.bustle.com/articles/35576-justin-biebers-anger-management-sentence-is-only-the-tip-of-the-iceberg"}
