{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-23 04:21:48","date_modify":"2018-10-23 04:21:48","date_publish":"2017-04-26 16:01:50","description":"Technically, she is the main breadwinner of the household. When asked by Esquire magazine if the disparity upset him, the 45-year-old replied: 'Not at all'. 'She's successful for a reason,' he said","filename":"data/vaneerConsumption/JustinTherouxisntintimidatedbyJenniferAniston.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA028C400000578-0-image-a-7_1493217760275.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4448068_Justin-Theroux-isn-t-intimidated-Jennifer-Aniston_1540268508.html","title":"Justin Theroux isn't intimidated by Jennifer Aniston","title_page":"Justin Theroux isn't intimidated by Jennifer Aniston | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Technically, she is the main breadwinner of the household.\nBut Justin Theroux insists he is not intimidated by wife Jennifer Aniston's success.\nWhen asked by Esquire magazine if the disparity upset him, the 45-year-old replied: 'Not at all'.\nSecure: Justin Theroux told Esquire magazine he is not intimidated at all by wife Jennifer Aniston's success\n'She's successful for a reason.... We're not in competition,' he said.\nBut he jokingly added: 'If I was competing for the same job as her, I might be less forgiving.'\nWith an estimated worth of $150million - from film, TV, and product endorsements - Jen is one of Hollywood's most successful female talents, featuring on Forbes' Top Earning Actresses for 15 years, every year since 2001.\nJustin - a successful actor, director, screenwriter and producer - is no layabout however, with an estimated worth of $20million.\nDisparity: The 45-year-old is worth around $20million, compared to his wife's $150million\nNope: When Justin was asked in May's edition if the disparity between him and his wife upset him, he replied: 'Not at all'\nWhile he joked about competing for the same job, he hinted the two might in fact be working together soon, as they have discussed collaborating on a project.\n'We were talking about an idea I had that we might start to develop together,' he revealed, but was not forthcoming on any of the details.\nThe couple have been together five years this months, and are coming up on their second anniversary in August.\nAs to the secret to their successful relationship, Justin was equally schtum: 'I'm not giving any marriage tips,' he shrugged. 'I am no brighter than any man.'\nHe did however laugh off the scrutiny such a high-profile relationship comes under, and the rumors that stem.\nSuccess: The couple have been together five years this months, and are coming up on their second anniversary in August (pictured in Hollywood April 4)\n'A friend once told me, \"Another you has been born, this insane person who's constantly breaking up, getting back together, having a baby, losing a baby\",' he laughed.\nJustin currently stars in HBO's The Leftovers - a drama about the sudden and unexplained disappearance of two per cent of the world's population - which is approaching its finale.\nWhile he is also an established screenwriter on such comedy films as Tropic Thunder, Rock Of Ages and Zoolander 2, he admitted he could never turn his hand to the more serious nature of his current show.\n'I couldn't write one of these scripts,' he conceded. 'I would go right for the fart joke.'\nWhen he is writing comedy though, Aniston is one of the first people he tests it on.\n'I have very funny friends and a very funny wife,' he added. 'I bounce ideas off of them. If I get a deep belly laugh, I know I've hit something.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4448068/Justin-Theroux-isn-t-intimidated-Jennifer-Aniston.html"}
