{"authors":["Kipp Jones"],"date_download":"2018-10-30 20:22:58","date_modify":"2018-10-30 20:22:58","date_publish":"2016-01-08 18:46:55","description":"Justin Bieber was removed from the site of an historic Mayan monument this week after he allegedly pulled down his underwear and tried to climb one of its forbidden ruins.","filename":"data/vaneerConsumption/JustinBieberRemovedfromHistoricMexicanSiteforClimbingRuinsandPullingDownHisPants.json","image_url":"https://media.breitbart.com/media/2016/01/Justin-Bieber-Instagram.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_01_08__1540930978.html","title":"Justin Bieber Removed from Historic Mexican Site for Climbing Ruins and Pulling Down His Pants","title_page":"Justin Bieber Removed from Historic Mexican Site for Climbing Ruins and Pulling Down His Pants","title_rss":"NULL","source_domain":"breitbart.com","text":"Justin Bieber was removed from the site of an historic Mayan monument this week after he allegedly pulled down his underwear and tried to climb one of its forbidden ruins.\nAccording to the Daily Mail, the 21-year-old and his rumored girlfriend, Hailey Baldwin, have been vacationing in Quintana Roo in Southwestern Mexico with family and friends.\nAt around 4 p.m. on Thursday, Bieber reportedly attempted to enter the ancient Mayan fortress of Tulum while carrying a beer.\nCiting local media, the Daily Mail reports Bieber was initially denied entry to the archaeological site over the drink, but he threw it away and entered with four companions.\nShortly after making his way onto the property, he climbed a restricted ruin and “pulled his underpants down” to expose his bare butt. He then reportedly took a selfie.\nAdriana Velazquez, the director of Mexico’s National Institute of Anthropology and History (INAH), told a local news outlet that Bieber’s personal bodyguards got into an argument with monument security guards after the incident.\nBieber is said to have left Tulum following a 15-minute argument and some “pushing and shoving” between his bodyguards and INAH security.\nPolice were called to the scene after Bieber allegedly threatened and insulted security.\nMembers of the site’s staff told local media that it was clear Bieber was under the influence of alcohol.","url":"https://www.breitbart.com/entertainment/2016/01/08/justin-bieber-removed-historic-mexican-site-for-climbing-ruins-and-pulling-down-his-pants/"}
