{"authors":["Kayleigh Giles For Mailonline"],"date_download":"2018-10-22 22:49:46","date_modify":"2018-10-22 22:49:46","date_publish":"2016-01-29 10:18:51","description":"The 21-year-old star proved he isn't afraid to take risks when it comes to his ever-changing style as he swept his bleach blonde locks into a small ponytail atop his head.","filename":"data/vaneerConsumption/JustinBiebertieshisbleachblondemaneintoaponytailatBrysonTillerconcert.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B12DCD00000578-0-image-a-16_1454062706852.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422501_Justin-Bieber-ties-bleach-blonde-mane-small-ponytail-debuts-edgy-new-hairstyle-Bryson-Tiller-concert_1540248586.html","title":"Justin Bieber ties his bleach blonde mane into a ponytail at Bryson Tiller concert","title_page":"Justin Bieber ties his bleach blonde mane into a ponytail at Bryson Tiller concert | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's adopted an edgier new style since making his musical comeback.\nAnd Justin Bieber debuted quite the outlandish hairstyle when he rocked up to Bryson Tiller's concert at the Wiltern theater in Los Angeles on Thursday evening.\nThe 21-year-old star proved he isn't afraid to take risks when it comes to his ever-changing style as he swept his bleach blonde locks - which looked to have been lightened - into a small ponytail atop his head.\nScroll down for video\nEdgy: Justin Bieber debuted quite the outlandish hairstyle when he rocked up to Bryson Tiller's concert at the Wiltern theater in Los Angeles on Thursday evening\nThe Sorry hitmaker cut a relaxed figure all round though, as he modeled a chunky knitted sweater, which boasted black and white stripes and a sizable hood, beneath which he occasionally hid his new hairstyle.\nJustin paired the over-sized jumper with somewhat loose-fitting cream trousers and plimsoll trainers in a similar shade as he sauntered into the gig alongside a male companion.\nUnable to go anywhere without pocketing fan attention, the star waved at some of his admirers before continuing to chat with his friends on his way into the young rapper's gig.\nSee Justin Bieber updates as he ties his bleach blonde mane into a daring ponytail\nBrave: The 21-year-old star proved he isn't afraid to take risks when it comes to his ever-changing style as he swept his bleach blonde locks into a small ponytail atop his head\nLaid-back: The Sorry crooner cut a relaxed figure all round, as he modeled a chunky knitted sweater, which boasted black and white stripes and a sizable hood, beneath which he occasionally hid his new hairstyle\nJustin wasn't the only A-lister at the intimate concert however, as Kylie Jenner was also seen a strutting into the venue with her girlfriends.\nThe stylish 18-year-old was clad in an all leather ensemble, comprised of a sleeveless, belted blouse and tight trousers, as she prepared to party the night away.\nThe reality star - who is in a relationship with Rack City rapper Tyga - looked to have approved of Bryson's performance as she left the venue with a beaming smile on her face and in seemingly high spirits.\nHey, there! Unable to go anywhere without pocketing fan attention, the star waved at some of his admirers before continuing to chat with his friends on his way into the young rapper's gig\nSignature style: Justin paired the over-sized jumper with somewhat loose-fitting cream trousers and plimsoll trainers in a similar shade as he sauntered into the gig alongside a male companion\nThe event came the night after the Confident crooner partied at the same hot-spot, The Nice Guy club, as the teen's older sister Kourtney Kardashian, who is rumoured to have enjoyed a brief 'fling' with last year.\nBut while celebrities staggering out of nightclubs is hardly a rarity, Justin showed off his kinder side as he stopped to help a stricken bicyclist in Hollywood in the early hours of Thursday.\nThe singing sensation showed no hesitation in jumping from his giant luxury SUV at a main intersection into the street to check on the fallen rider.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422501/Justin-Bieber-ties-bleach-blonde-mane-small-ponytail-debuts-edgy-new-hairstyle-Bryson-Tiller-concert.html"}
