{"authors":["Matt Turner"],"date_download":"2018-10-30 22:17:22","date_modify":"2018-10-30 22:17:22","date_publish":"2016-12-14 00:00:00","description":"Americans are unanimous.","filename":"data/vaneerConsumption/JustCapitalonfairwages.json","image_url":"https://amp.businessinsider.com/images/57c9ed2e09d293d10f8b5ff7-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_just-capital-on-fair-wages-2016-12_1540937842.html","title":"Just Capital on fair wages","title_page":"    Just Capital on fair wages - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Employers can get ahead by investing in their workers with higher wages. Rebecca Cook/Reuters Americans are unanimous.\nJust Capital, a nonprofit set up by legendary hedge fund manager Paul Tudor Jones, has asked more than 50,000 Americans what they look for in corporate behavior.\nAnd the No. 1 answer across all income groups is that a company \"pays a fair wage for the industry and job level.\"\nNow, on one hand, this shouldn't be a surprise. And what a \"fair wage\" means exactly is open to debate, with likely as many opinions as there are people.\nBut the research highlights the extent to which Americans are worried about their wages and feel as if American companies should also be focused on this issue.\nSome issues, like companies creating jobs US jobs, are of more importance to those with lower incomes. Some concerns, like following laws and regulations, seem to be the preserve of the wealthy.\nEveryone is unanimous on wages, however.\nIt's not surprising, therefore, that real wage growth — or the lack thereof — has become a hot-button issue in the US. In simple terms, many Americans feel as if they're not doing any better than they were five or 10 years ago. And sure enough, growth in wages minus inflation has fallen sharply over the past 30 years, according to the Federal Reserve.\n\"Our analysis shows that this economy-wide average real wage growth rate has declined by a third since the mid-1980s,\" researchers at Liberty Street Economics at the Federal Reserve Bank of New York wrote in a post in September.\nHere are Just Capital's findings:","url":"https://www.businessinsider.com/just-capital-on-fair-wages-2016-12"}
