{"authors":["Jamie Primeau"],"date_download":"2018-10-31 01:41:58","date_modify":"2018-10-31 01:41:58","date_publish":"2018-09-14 18:13:13","description":"A major congratulations may be in order. Just a day after reports circulated that the pair obtained a marriage license, People announced that Justin Bieber and Hailey Baldwin are married. A source close to the couple reportedly confirmed the news to…","filename":"data/vaneerConsumption/JustinBieberHaileyBaldwinAreMarriedAccordingToANewReportUPDATE.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/95032421-d1e9-44be-94a6-bf314fb7d090-311471b9-8675-4ce7_-8a3c-a1c215f9df23-getty-1027974440.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_justin-bieber-hailey-baldwin-are-married-according-to-a-new-report-update-11924083_1540950118.html","title":"Justin Bieber & Hailey Baldwin Are Married, According To A New Report - UPDATE","title_page":"Justin Bieber & Hailey Baldwin Are Married, According To A New Report — UPDATE","title_rss":"NULL","source_domain":"bustle.com","text":"A major congratulations may be in order. Just a day after reports circulated that the pair obtained a marriage license, People announced that Justin Bieber and Hailey Baldwin are married. A source close to the couple reportedly confirmed the news to People, saying, \"They went ahead and did it without listening to anyone.\" The ceremony supposedly took place on Thursday in New York City. (Bustle has reached out to reps for Bieber and Baldwin for comment, but did not receive an immediate response.)\nUPDATE: A few hours after the reports spread on Friday, Baldwin cleared up the wedding rumors with a very straightforward tweet, confirming she and Bieber did not tie the knot just yet. She wrote,\n\"I understand where the speculation is coming from, but I’m not married yet!\"\nBaldwin also shared a screenshot of the same tweet to her Instagram Story.\nEARLIER: While People is reporting that a \"religious source\" confirmed that the pair was married at the courthouse, that's not the end of the celebrating. Apparently, they're still planning to keep things pretty traditional by holding a religious ceremony and reception later on. The source claimed to People, \"They’re going to have a big blowout, in front of God and everyone they love.\"\nAlthough Bieber and Baldwin have yet to confirm anything on their respective social media pages, the \"Sorry\" singer's mother Pattie Mallette may have hinted at the big news on Twitter. On Friday, Bieber's mother tweeted, \"Love is unconditional.\" Of course, the timing could be a coincidence, but Mama Biebs was also one of the first people to acknowledge Bieber and Baldwin's engagement when that news spread back in July — again, with a cryptic tweet.\nFor those just catching up, Bieber and Baldwin announced their engagement to the world in early July. Bieber reportedly popped the question while on vacation in the Bahamas. He also celebrated the news in a black-and-white Instagram post, writing a lengthy message to his at-the-time bride-to-be. The 24-year-old wrote,\n\"Was gonna wait a while to say anything but word travels fast, listen plain and simple Hailey I am soooo in love with everything about you! So committed to spending my life getting to know every single part of you loving you patiently and kindLY. I promise to lead our family with honor and integrity letting Jesus through his Holy Spirit guide us in everything we do and every decision we make. My heart is COMPLETELY and FULLY YOURS and I will ALWAYS put you first! You are the love of my life Hailey Baldwin and I wouldn’t want to spend it with anybody else. You make me so much better and we compliment eachother so well!!\"\nBut Bieber isn't the only one who's head-over-heels. Baldwin has vocalized just how happy she is to spend the rest of her life with Bieber. Soon after the engagement news spread, the model tweeted a heartfelt message. She wrote,\n\"Not sure what I did in life to deserve such happiness but I am so utterly grateful to God for giving me such an incredible person to share my life with! No words could ever express my gratitude.\"\nAnd in an interview with The Cut published on Thursday, Baldwin talked about how ready she was to say \"I do.\" She told the publication, \"My sister was 24 when she got married, and my parents also got married when they were young, too. I see no reason to wait. When you know it’s right, it's right.\"\nIf Bieber and Baldwin are indeed married, this is only the beginning of their love story. And chances are, they'll continue taking fans along for the ride. Basically, it's only a matter of time before they begin post photos, tweets, and lengthy captions to commemorate the occasion.","url":"https://www.bustle.com/p/justin-bieber-hailey-baldwin-are-married-according-to-a-new-report-update-11924083"}
