{"authors":["Matthew Smith For Mailonline"],"date_download":"2018-10-23 00:21:54","date_modify":"2018-10-23 00:21:54","date_publish":"2017-03-16 09:28:25","description":"Juve breezed into the last eight with a routine 3-0 aggregate victory over Porto, while Barca's path through the round of 16 was much more unconventional, beating PSG 6-5 over two legs.","filename":"data/vaneerConsumption/JuventuswantBarcelonaintheChampionsLeagueBonucci.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E4A173B00000578-0-image-a-43_1489656388148.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319338_Bonucci-Juventus-want-Barcelona-Champions-League_1540254114.html","title":"Juventus want Barcelona in the Champions League - Bonucci","title_page":"Juventus want Barcelona in the Champions League - Bonucci | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Juventus defender Leonardo Bonucci says he wants to face Barcelona in the Champions League quarter-finals.\nJuve breezed into the last eight with a routine 3-0 aggregate victory over Porto, while Barca's path through the round of 16 was much more unconventional.\nThe Catalan side beat PSG 6-1 in the second leg, scoring their final three goals after the 88th minute, to go through 6-5 on aggregate.\nJuventus defender Leonardo Bonucci wants to face Barcelona in the Champions League\nBonucci wants to face Barcelona in order to get revenge - they beat Juventus in the 2015 final - rather than one of the supposedly weaker sides, such as English surprise package Leicester City.\nBonucci told the Juventus website: 'We are among the best eight clubs in Europe and now is the time to kick on and go as far as we can.\n'Leicester have been the surprise package of the tournament so far but personally I would want to meet Barcelona next. Facing off against the side that beat us to the trophy two years ago would be a huge incentive for all of us.\n'After their comeback against PSG, you would have to say that of the teams left, they have the most momentum and belief.'\nJuve breezed into the last eight with a routine 3-0 aggregate victory over Porto\nBonucci has also revealed who his nightmare draw would be, as Juve seek their first European trophy since since 1996, when they last won the Champions League.\nHe said: 'Who to avoid? Bayern Munich. Wherever he goes Ancelotti finds a way of winning football matches, just like Guardiola. You would prefer to face a side like Bayern in a one-off final where anything can happen.'\nThe Champions League quarter-final draw is made at 11am on Friday.","url":"https://www.dailymail.co.uk/sport/football/article-4319338/Bonucci-Juventus-want-Barcelona-Champions-League.html"}
