{"authors":["Scott Neuman"],"date_download":"2018-10-22 21:41:59","date_modify":"2018-10-22 21:41:59","date_publish":"2014-11-30 00:00:00","description":"The resignation of Gen. Zahir Zahir came after a series of attacks against foreigners in the capital that are attributed to the Taliban.","filename":"data/vaneerConsumption/KabulsPoliceChiefStepsDownAmidSteppedUpTalibanAttacks.json","image_url":"https://media.npr.org/assets/img/2014/11/30/ap128357712153_wide-4e5c3beafbd843fa808e6fe76dce48415288176e.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2014_11_30_367570381_kabuls-police-chief-steps-down-amid-stepped-up-taliban-attacks_1540244519.html","title":"Kabul's Police Chief Steps Down Amid Stepped-Up Taliban Attacks","title_page":"Kabul's Police Chief Steps Down Amid Stepped-Up Taliban Attacks : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Kabul's Police Chief Steps Down Amid Stepped-Up Taliban Attacks\nEnlarge this image toggle caption Rahmat Gul/AP Rahmat Gul/AP\nKabul's police chief is stepping down after a series of deadly militant attacks on foreigners that have shaken the capital in recent days.\nIn a news briefing today, Gen. Zahir Zahir said that four people had died in an attack on a compound of Partnership in Academics and Development on Saturday that was blamed on the Taliban. He said the director, his teenage son and daughter — all South African nationals — were killed when one of the attackers blew himself up. Reuters says the family had lived in Afghanistan for the past 12 years. An Afghan was also killed in the attack.\nAt the end of the briefing, Zahir announced he would step down as police chief in the capital. He did not elaborate and a police spokesman has also declined to comment on Zahir's resignation.\nOn Friday in a similar attack claimed by the Taliban no one was hurt, but earlier in the day a suicide bombing of a British vehicle killed 5.\nTwo American soldiers and two British embassy workers have also been killed in attacks in recent days. The BBC notes: \"Gen Zahir was himself the target of an attack in early November, when a suicide bomber infiltrated his offices — supposed to be one of the most secure buildings in Kabul — and killed his deputy. Gen Zahir was not there at the time of the attack.\"\nThe BBC also says:","url":"https://www.npr.org/sections/thetwo-way/2014/11/30/367570381/kabuls-police-chief-steps-down-amid-stepped-up-taliban-attacks"}
