{"authors":["Paul Newman For The Daily Mail"],"date_download":"2018-10-22 20:13:56","date_modify":"2018-10-22 20:13:56","date_publish":"2016-01-28 00:36:25","description":"Kagiso Rabada, the South African fast-bowling sensation who destroyed England in the final Test, wants to further his cricketing education by playing county cricket.","filename":"data/vaneerConsumption/KagisoRabadaonhiswaytoEnglandasSouthAfricastartargetscountydeal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/3096896C00000578-0-image-a-52_1453940784595.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_cricket_article-3420199_Kagiso-Rabada-way-England-South-Africa-star-targets-county-deal_1540239236.html","title":"Kagiso Rabada on his way to England as South Africa star targets county deal","title_page":"Kagiso Rabada on his way to England as South Africa star targets county deal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kagiso Rabada, the South African fast-bowling sensation who destroyed England in the final Test, wants to further his cricketing education by playing county cricket.\nThe rising star of the world game is keen to experience English conditions and his representatives have been contacting counties this week to try to seal a deal for the first six weeks of the summer.\nRabada, who took 13 wickets in South Africa’s thumping win in Centurion, is hoping to take advantage of a gap in his country’s calendar that sees them without Test cricket until they face New Zealand in August.\nSouth African fast-bowling sensation Kagiso Rabada destroyed England by taking 13 wickets in the final Test\nSouth Africa play in a one-day tournament in the Caribbean in June but the 20-year-old has identified the early part of the English season, when counties play six or seven Championship matches, as his window of opportunity.\nThe only question is which counties are in the market for an overseas player in April and May, but there should be no shortage of offers for Rabada, who wants to carefully manage his development.\nSportsmail understands he will resist the lure of the lucrative Twenty20 market in India and Australia for at least the next couple of years because he does not believe an excess of short-form cricket is in his best interests.\nYet a short stint in county cricket is a different matter, particularly as it would give Rabada invaluable experience of conditions that are still alien to him ahead of South Africa’s tour of England in 2017.\nRabada's respresentatives have been contacting counties over a deal for the first six weeks of the summer\nOne man who is convinced Rabada is destined for a highly successful career is West Indies great Michael Holding, who spent some time with the young bowler while commentating on England’s Test series here. ‘I’m a big fan and I like what I see,’ said Holding. ‘I was invited to dinner in Johannesburg by a friend who told me Rabada wanted to meet me. We sat down and chatted about his cricket, his progress and what he wants to do.\n‘He’s not going to be the finished article at 20 but what I liked was that he didn’t just accept what I was saying because I’m Michael Holding. He was asking me why I was suggesting things and thinking about what I was advising him and I was very impressed by that.\n‘He works extremely hard on his cricket. Ideally I would like to see him operating as first change because that will help his development. South Africa have been without Dale Steyn and Vernon Philander here and the danger is that they have used Rabada both as a fast bowler and a workhorse. You can’t be both. When they get the others back he will be able to bowl shorter spells, he won’t get tired and he will be able to bowl fast throughout.\nThe rising star of the world game is keen to experience English conditions\n‘They will have to look after him because I see an analogy with a kid in a candy store. If he sees all that candy he will want to eat it but it’s up to his parents to say, “Have a little now and have more tomorrow”. South Africa mustn’t get carried away and it’s important he has good people managing him.’\nHolding is acutely aware of Rabada’s importance as a role model for the black majority here at a challenging time for the South African people. ‘In normal circumstances it wouldn’t matter what colour he is but it certainly matters in this country,’ added Holding. ‘Transformation matters here. But you don’t want a cricketer to just be there because he’s black, you want him to be there because he is good. Well, this kid is good and he deserves to be there.’","url":"https://www.dailymail.co.uk/sport/cricket/article-3420199/Kagiso-Rabada-way-England-South-Africa-star-targets-county-deal.html"}
