{"authors":["Allyson Koerner"],"date_download":"2018-10-31 01:49:56","date_modify":"2018-10-31 01:49:56","date_publish":"2018-08-27 17:17:22","description":"This celebrity couple makes hearts go big bang. On Instagram on Aug. 24, Kaley Cuoco shared a throwback photo with Karl Cook proving not only are they a perfect pair, but they've made some really wonderful memories together. The picture shows Cuoco…","filename":"data/vaneerConsumption/KaleyCuocoKarlCooksBigBangTheoryThrowbackPhotoProvesTheseTwoWereAlwaysMeantToBe.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/d015b81e-8c70-4d50-bc00-39c083750494-getty-937564424.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_kaley-cuoco-karl-cooks-big-bang-theory-throwback-photo-proves-these-two-were-always-meant-to-be-10248537_1540950596.html","title":"Kaley Cuoco & Karl Cook's 'Big Bang Theory' Throwback Photo Proves These Two Were Always Meant To Be","title_page":"Kaley Cuoco & Karl Cook's 'Big Bang Theory' Throwback Photo Proves These Two Were Always Meant To Be","title_rss":"NULL","source_domain":"bustle.com","text":"This celebrity couple makes hearts go big bang. On Instagram on Aug. 24, Kaley Cuoco shared a throwback photo with Karl Cook proving not only are they a perfect pair, but they've made some really wonderful memories together. The picture shows Cuoco kissing Cook on the cheek, while he gives the biggest smile possible. It's seriously adorable.\nThe Big Bang Theory star captioned her image,\n\"#fbf that time my guy made his first official @bigbangtheory_cbs set visit @mrtankcook #kaleyspoloroids.\"\nCook also commented on the Instagram making it even more special. He sweetly wrote,\n\"For me what an emotional picture thinking about what followed. I don't know what you saw in me but I am glad you did [heart eyes emoji] I love you so much @normancook.\"\nIs this real life? Cook's words are beyond romantic and shows how happy he is to have Cuoco by his side as a partner. On June 30, Cuoco and Cook got married after about two years together. They've never hidden their intense love for each other, including when Cuoco and Cook delivered their wedding vows.\n\"When I look at you, the two words that constantly come to mind are unconditional love,\" Cuoco told her husband. She also gushed, \"I love you every second of every day and I can't wait to see where life takes us. I know it will be full of animals, adventure, and lots of laughs. I was meant for you. You are a good man, Charlie Brown, and I am yours.\"\nAs for Cook, he beautifully said to his wife, \"There's a rhythm and a pulse to us, like the ocean waves crashing upon the rocks. And just like those waves on those rocks, we feel like a force of nature. I guess that's the power of a true human connection.\" He added like the romantic man he is, \"If you can't tell, I've loved you since the first night we met. Every day since then has been only devoted to you.\"\nSee? They were meant to be. Cuoco's photo of Cook visiting her on set is probably a memory the actor will forever hold dear to her heart, and not just because he's the love of her life. The CBS comedy has been a huge part of Cuoco's life for the past 12 years. Now that TBBT is ending after this season, Cuoco can reminisce about all of the wonderful memories she made, including Cook's first visit.\nKaley Cuoco/Instagram (screenshot)\nAfter it was announced that Big Bang Season 12 will be the last, Cuoco shared a touching tribute on Instagram. Next to a photo of the cast, she wrote,\n\"This ride has been a dream come true and as life changing as it gets. No matter when it was going to end , my heart would have always been broken in two. Drowning in tears, we promise to bring you the best season yet. To the fans, our crew, families, Chuck Lorre, Warner Brothers , CBS, and everyone who has supported us for so many years, thank you. We are goin out with a bang.\"\nIt will be hard to say goodbye to the comedy for both fans and the cast, but thankfully, there are beautiful moments to reflect on. For Cuoco, the photo of she and Cook is just one of the many amazing memories she can look back on whenever she misses the show and playing Penny.","url":"https://www.bustle.com/p/kaley-cuoco-karl-cooks-big-bang-theory-throwback-photo-proves-these-two-were-always-meant-to-be-10248537"}
