{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:33:04","date_modify":"2018-10-22 23:33:04","date_publish":"2016-01-11 06:24:18","description":"The 30-year-old Big Bang Theory star was sure to turn heads at the star-studded event held at the Beverly Hilton Hotel on Sunday.","filename":"data/vaneerConsumption/KaleyCuocosizzlesinslinkyreddressatGoldenGlobeAwards2016afterparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/05/3004E6F400000578-0-image-a-26_1452489127246.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393367_Kaley-Cuoco-sizzles-slinky-red-dress-Golden-Globe-Awards-2016-party_1540251184.html","title":"Kaley Cuoco sizzles in slinky red dress at Golden Globe Awards 2016 after party","title_page":"Kaley Cuoco sizzles in slinky red dress at Golden Globe Awards 2016 after party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kaley Cuoco was sure to turn heads at the Golden Globes after party.\nThe 30-year-old actress put on an eye-popping display in a slinky red dress as she arrived at the annual InStyle and Warner Bros. event at the Beverly Hilton Hotel in Los Angeles.\nThe Big Bang Theory star's sexy look also featured a racy thigh-high slit which revealed some leg.\nScroll down for video\nRed hot: Kaley Cuoco put on an eye-popping display at the Golden Globes after party on Sunday evening\nHer blonde locks were styled in sultry tousled waves for a just-got-out-of-bed appearance.\nShe wore a neutral make-up palette with shimmery pink lips.\nRock the Kasbah actress Kate Hudson made an appearance and sported the same shimmering nude outfit she wore for the award ceremony.\nSee our full coverage on the Golden Globes winners and red carpet style\nReady to mingle: The 30-year-old actress opted for a slinky red gown and wore her hair in tousled waves\nRacy: The Big Bang Theory star flashed some leg with a thigh-high slit\nFlirty: Completing Kaley's red hot look were some metallic stilettos\nThe 36-year-old actress flaunted her gym-honed abs in a Michael Kors dress which featured a large cut out mid-section and choker detail.\nThe figure-hugging garment was encrusted in hundreds of jewels and she teamed it with peach platform heels.\nBella Thorne, 18, opted for a metallic gown with sheer panels as she got ready to party at the star-studded event.\nBarely there: Kate Hudson flaunted her gym-honed abs in a shimmering Michael Kors dress, which featured a large cut out mid-section and choker detail\nTime to party: The 36-year-old beauty posed up a storm for cameras\nShining star: Bella Thorne shimmered in a metallic dress with sheer panels\nVampy: Vanessa Hudgens looked lovely in a long velvet gown with sheer embroidered panels\nSo pretty: Actress Nina Dobrev wowed in a pretty floral lace dress\nVampire Diaries star Nina Dobrev looked pretty in a beautiful floral pattern lace gown with red clutch and her hair swept up in an elegant updo.\nIn contrast, Charli XCX, 23, arrived in a barely there metallic mini dress which showed off lots of cleavage and some of her derriere to boot.\nDitching her caped Giambattista Valli dress, Jennifer Lopez, 46, chose a figure hugging white gown which showcased her stunning figure for the after party.\nSkimpy: In her usual fashion singer Charli XCX opted for a barely there cleavage flashing frock\nMetallics: Kourtney Kardashian and sister Kylie Jenner made an appearance at the event\nSophisticated style: Sarah Hyland in Amanda Wakeley and Jamie Chung opted for simple black and white gowns\nSeeing stripes: Model Jaime King sported a bold sheer frock with nude fabric underneath\nKiller curves: Jennifer Lopez changed from her yellow Giambattista Valli gown into a figure-hugging white dress\nStill going strong: J. Lo arrived with her 28-year-old boyfriend Casper Smart\nThe singer and actress carried a jewel-encrusted clutch and some serious Harry Winston bling on her right hand.\nShe was accompanied by 28-year-old boyfriend Casper Smart.\nAlso making a swift wardrobe change before hitting the party was Taraji P. Henson who arrived in a stunning blush gown with embroidered bodice.\nWhat a gent: Casper tenderly place a hand on his girlfriend's back as they made their way into the party\nPop princess: Selena Gomez arrived in an off-the-shoulder gown and carried a chic box clutch\nParty people: Channing Tatum and wife Jenna Dewan were pictured inside the venue\nLooking great! Naya Rivera showed off her stunning post-baby body in a purple satin gown\nStatuesque: Laverne Cox rocked a striking white gown with caped sleeves\nBronze beauty: Rumer Willis showed some skin in a plunging white beaded gown\nThe 45-year-old actress, who won best actress in a TV drama, clutched her Golden Globe as she posed up a storm on the red carpet.\nDuring the ceremony The Revenant swept the board with multiple awards.\nLeonardo DiCaprio - who stars in the flick - took home best actor while Alejandro González Iñárritu was awarded the gong for Best Director.\nWardrobe change! Taraji P. Henson changed into a blush gown as she showed off her Golden Globe for best actress in a TV drama\nTV family: The actress posed with her Empire co-stars Jussie Smollett, Grace Gealey, and Trai Byers\nBringing the colour: Award winner Rachel Bloom and Bridget Moynahan opted for emerald and golden yellow satin gowns\nCoordinating couple: Mark Ruffalo made it a date night with wife Sunrise Coigney\nFlattering look: Victoria Justice stunned in a cut-out coral pink Bao Tranchi dress\nAll that glitters: Regina King wore an over-the-top sequinned Krikor Jabotian frock\nOn the same page: Gabrielle Union and Katherine McPhee opted for black on white\nPure class: Bryce Dallas Howard arrived in a shimmering blue gown with lace overlay\nThe Revenant was also named Best Picture Drama, beating out Carol, Mad Max: Fury Road, Room, and highly touted Spotlight.\nRelative newcomer Brie Larson took home Best Actress in a Movie Drama for her role in Room.\nBritish comedian Ricky Gervais returned as host of the ceremony for the fourth time and once again caused controversy with his cutting sense of humour.\nTurning heads: Kat Graham stunned in a silk black and white plunging gown\nGot the memo: Whitney Port and Melissa George had the same idea in black frocks with lots of sheer fabric\nSomething differnt: Actress Jennifer Morrison showed her individual flair in a blush silk billowy gown\nPretty in purple: Alyssa Milano and Meagan Good sported plum gowns\nSparkling: Gabourey Sidibe went for a sequined one-shoulder number\nStrike a pose: Lea Michele looked great in white and flashed a little side boob\nThe 54-year-old made jabs at celebrities such as Ben Affleck, Mel Gibson and presidential candidate Donald Trump.\nThe Golden Globe Awards are bestowed by the 93 members of the Hollywood Foreign Press Association (HFPA) and recognises excellence in film and television, both domestic and foreign.\nThe after party was designed by Thomas Ford who has created the lavish event held at the Beverly Hills venue every year since 2002.\nLooking lovely: Newly engaged Eva Longoria arrived solo to the event in a pretty dress with coloured jewel embellishments\nSerene in green: Tamar Braxton and Carly Chaikin opted for dramatic looks in emerald\nParty time: Rob Lowe continued the evening with wife Sheryl Berkoff\nFuturistic: Portia Doubleday wowed in a metallic ballgown and slicked back hair\nFeminine flair: Cara Santana and Toni Braxton flashed cleavage in white jumpsuits\nBlonde beauty: Olivia Holt looked lovely in a cerise gown with jeweled neckline\nShine bright like a diamond: Molly Sims wore a black gown with sheer cut-outs and diamond detail\nHe told InStyle of this year's bash: 'The theme is Asian-inspired with gold and burgundy and bamboo, but the bamboo is mirrored bamboo,'\nThe designer talked about the over-the-top centrepiece chandelier which was made to look like an exploded lantern.\n'It's gold and it has cool new light pixels in the middle, instead of just lightbulbs'\n'It will also have pictures of cherry blossoms and geishas and all sorts of crazy. Asian-themed pictures that we've deconstructed to pixels so you can't tell what anything is.'\nTaking the plunge: Gillian Anderson donned a shimmery tiered champagne frock while Elisabeth Rohm wore a gold Jani & Khosla gown\nLady in red: Orange Is The New Black actress Jackie Cruz took the plunge in a velvet gown\nBrunette beauties: TV personality Aisha Tyler and actress Yara Shahidi opted for pretty pastels\nBaring it all: Zoe Kravitz revealed quite a lot in her sheer embroidered dress\nGaby Hoffmann, Kathryn Hahn and Carrie Brownstein appeared to be enjoying a girls' night\nTime to relax: Sylvester Stallone celebrated his best supporting actor win with wife Jennifer Flavin and their daughters","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393367/Kaley-Cuoco-sizzles-slinky-red-dress-Golden-Globe-Awards-2016-party.html"}
