{"authors":["William Bigelow"],"date_download":"2018-10-30 22:17:02","date_modify":"2018-10-30 22:17:02","date_publish":"2015-11-05 22:16:55","description":"Attorney General Kamala Harris may be investigated by FPPC after the agency received a tip that gifts to her may have exceeded legal limits.","filename":"data/vaneerConsumption/KamalaHarrisMayFaceEthicsInvestigationoverGifts.json","image_url":"https://media.breitbart.com/media/2015/01/Kamala-Harris-AP.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_05__1540937822.html","title":"Kamala Harris May Face Ethics Investigation over Gifts","title_page":"Kamala Harris May Face Ethics Investigation over Gifts | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Attorney General Kamala Harris, running for the U.S. Senate, may be investigated by the Fair Political Practices Commission (FPPC) after the agency received an anonymous tip that gifts she received may have exceeded legal limits.\nThe letter, written by the FPPC, stated that the agency “is considering initiating an investigation concerning your receipt of furnishings, accessories and services from Ken Fulk, Inc., over the gift limit.”\nFPPC spokesman Jay Wierenga downplayed the significance of the letter, telling the Los Angeles Times that the agency had simply requested a response from Harris, adding, “I would categorize it as routine.” Wierenga made sure to note that his agency looks into over 1,000 complaints annually. He was loath to discuss details of the alleged impropriety, including what the gifts were or when they were offered.\nElected officials in California are barred from receiving a gift or gifts totaling more than $460 in a calendar year, unless they are donated by family members.\nLos Angeles attorney Stephen Kaufman, representing Harris, sniffed, “Ken Fulk is a personal friend of the AG’s. and we’re confident that this will be resolved quickly and easily.” Fulk attended Harris’ August 2014 wedding, as San Francisco Chronicle reported, and donated $5,000 to Harris’ campaigns for attorney general, according to state elections records. Harris joined Fulk at the Ken Fulk Collection for Pottery Barn Arrival Party in August 2015.","url":"https://www.breitbart.com/politics/2015/11/05/kamala-harris-may-face-ethics-investigation-gifts/"}
