{"authors":["William Bigelow"],"date_download":"2018-10-30 22:16:48","date_modify":"2018-10-30 22:16:48","date_publish":"2016-02-16 20:33:20","description":"California Attorney General Kamala Harris may be on Barack Obama’s list of nominees to fill the Supreme Court vacancy left by Antonin Scalia’s death.","filename":"data/vaneerConsumption/KamalaHarristoReplaceScaliaonSupremeCourt.json","image_url":"https://media.breitbart.com/media/2015/11/Kamala-Harris-Stan-Honda-AFP-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_16__1540937808.html","title":"Kamala Harris to Replace Scalia on Supreme Court?","title_page":"Kamala Harris to Replace Scalia on Supreme Court? | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"California Attorney General Kamala Harris may be on Barack Obama’s list of nominees to fill the Supreme Court vacancy left by Antonin Scalia’s death.\nVarious media outlets have mentioned Harris as as a prospective nominee, including the New York Times, Associated Press, USA Today, the National Law Journal and the SCOTUSblog, according to the Los Angeles Times.\nFormer Obama White House advisor David Axelrod has also mentioned Harris. Harris’ campaign spokesman Nathan Click dismissed the speculation, saying, “While the attorney general is honored to be mentioned in these conversations, she’s committed to her current job and continuing her fight for California families in the U.S. Senate.”\nObama has a special fondness for Harris, featuring her as a speaker at the Democratic National Convention in 2012 and once calling her “the best-looking” attorney general in the country.\nHarris champions leftist positions on virtually everything, including abortion, ending the federal ban on medical marijuana, easing a path to citizenship for illegal immigrants, and shorter sentences for some drug crimes.\nShe notably refused to defend Proposition 8, which outlawed same-sex marriage in California, saying it violated the Constitution. She defended the law forcing members of public employee unions to help pay for collective bargaining, and appealed the ruling against unions in Vergara vs. California.\nAs San Francisco district attorney, Harris refused to press for the death penalty against a gang member who killed a police officer.\nJudge Paul Watford, another Californian, has also been mentioned by the New York Times and the Washington Post as a possible successor to Scalia. He clerked for Justice Ruth Bader Ginsburg, was nominated by Obama to be an appellate judge in 2011, and was confirmed by the Senate in 2012. He, like Harris, is African American.","url":"https://www.breitbart.com/politics/2016/02/16/kamala-harris-for-supreme-court/"}
