{"authors":["Molly Longman"],"date_download":"2018-10-31 01:50:42","date_modify":"2018-10-31 01:50:42","date_publish":"2018-09-06 12:19:36","description":"California Sen. Kamala Harris put pressure on Supreme Court nominee Brett Kavanaugh during the second day of his confirmation hearing. The questioning went well into the night, and Sen. Harris was the second to last person to take her turn…","filename":"data/vaneerConsumption/KamalaHarrisAbortionQuestionsForKavanaughMayBeTheToughestYet.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/67fc1e2f-74fd-430c-91c3-0de31c12c06b-getty-1026698170.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_kamala-harris-abortion-questions-for-kavanaugh-may-be-the-toughest-yet-11771401_1540950642.html","title":"Kamala Harris' Abortion Questions For Kavanaugh May Be The Toughest Yet","title_page":"Kamala Harris' Abortion Questions For Kavanaugh May Be The Toughest Yet","title_rss":"NULL","source_domain":"bustle.com","text":"California Sen. Kamala Harris put pressure on Supreme Court nominee Brett Kavanaugh during the second day of his confirmation hearing. The questioning went well into the night, and Sen. Harris was the second to last person to take her turn questioning the judge on issues from the Mueller investigation to abortion. As she pressed Kavanaugh on his views about abortion, Harris asked if he was aware of any laws stating “that the government has power to make over the male body?”\nNew York Magazine's The Cut reported that room fell silent for three seconds before Kavanaugh addressed the question, but hedged about answering. “Um… I’m happy to answer a more specific question, but —\" before Harris interjected to clarify: \"Male versus female.\"\nAfter a bit of back and forth clarifying the question, Kavanaugh responded: “I’m not aware of any right now, senator.\"\nThis came after Harris pushed Kavanaugh to talk about his thoughts about whether \"the right to privacy protects a woman's choice to terminate a pregnancy.\"\nMany have speculated that Kavanaugh's confirmation could mean Roe v. Wade — the landmark Supreme Court ruling protecting abortion rights — could be either overturned or weakened. \"Weakening\" could mean changing laws about at what point during a pregnancy women can have an abortion, and what the rules about informed consent are.\nKavanaugh refused to answer the question, partially basing his argument for sidestepping the issue on what previous Supreme Court justices had done when they were nominees.\n\"All eight currently sitting justices of the supreme court have recognized that two principles are important: One, we shouldn't talk about, in this position, cases or issues that are likely to come before the Supreme Court or could come before the Supreme court,\" Kavanaugh said.\nHe also began to paraphrase a quote from Supreme Court Justice Elena Kagan about not giving a thumbs up or down to similar issues.\nAs shown in a C-SPAN Video, Harris continued to question the judge, arguing that one justice did comment on Roe v. Wade at her confirmation hearing: Justice Ruth Bader Ginsburg. Harris said both Kavanaugh and Ginsburg had written previously about Roe, and Ginsburg addressed that writing. So why wouldn't Kavanaugh?\n\"I have not articulated a position on that,\" Kavanaugh responded. \"And, consistent with the principle articulated — the nominee precedent that I feel duty bound to follow as a matter of judicial independence.\"\nSeemingly unsatisfied with Kavanaugh's rambling response and dodging of her questions about abortion, Harris settled for her pointed query about laws giving government the power to make decisions about the male body.\nBefore questioning the judge, Harris noted on Twitter that she wanted answers from the nominee about his thoughts on abortion, writing: \"There are 13 cases on abortion that are steps away from the Supreme Court.\"\nAs the third day of Kavanaugh's confirmation hearings begins, other Congresspeople will put Kavanaugh's views and history under the microscope — time will tell if they push him as hard as Harris did.","url":"https://www.bustle.com/p/kamala-harris-abortion-questions-for-kavanaugh-may-be-the-toughest-yet-11771401"}
