{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:17:08","date_modify":"2018-10-30 22:17:08","date_publish":"2016-02-19 14:10:35","description":"CA Attorney General Kamala Harris is fighting a 2014 court ruling that declared California's 10-day waiting period for gun purchases unconstitutional.","filename":"data/vaneerConsumption/KamalaHarrisFightsfor10DayWaitingPeriodforGuns.json","image_url":"https://media.breitbart.com/media/2015/11/Kamala-Harris-hands-Nick-Ut-Associated-Press-e1520962963533.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_02_19__1540937828.html","title":"Kamala Harris Fights for 10-Day Waiting Period for Guns","title_page":"Kamala Harris Fights for 10-Day Waiting Period for Guns | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Attorney General Kamala Harris is fighting a 2014 court ruling that declared California’s ten-day waiting period for gun purchases unconstitutional.\nHarris has kept the 10-day wait in place, despite the ruling, while she appeals the case, Silvester v. Harris.\nAccording to Fox News, the appeal of the case was heard before the Ninthth Circuit Court of Appeals last week. It revolves around plaintiff Jeffery Sylvester’s and gun owner Brandon Combs’s complaint that gun buyers who pass a background check and are “issued a state Certificate of Eligibility or a California License to Carry” must still wait ten days before picking their gun up from the retailer.\nThe Second Amendment Foundation (SAF) has joined Calguns Foundation on the plaintiffs’ behalf in the appeal.\nSAF’s Alan Gottlieb said, “There is no government public safety interest in a waiting period if you already own a gun and have gone through a background check. This is clearly only about a right delayed being a right denied.”\nDuring the initial trial, Harris argued “that the Founding Fathers would not have been troubled by the waiting period, given that citizens in their time lived on isolated farms and often traveled for days to make purchases.” This argument is somewhat odd, as citizens who traveled for days to buy what they needed would have been the first to fight the idea of traveling for days to buy a gun then returning home and traveling for days again to pick it up once the ten-day waiting period ended.\nDistrict Judge Anthony Ishii heard the initial case and “ruled the California waiting period law violated Second Amendment rights of citizens and should be replaced with the Federal National Instant Criminal Systems (NICS) adopted by most other states.” Ishii also pointed out that the ten-day waiting period is even more egregious for people who already own guns, as there is no evidence to support the theory that a waiting period stops “impulse acts of violence by individuals who already possess a firearm.”\nIt could be months before a decision in the case is announced.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2016/02/19/ag-harris-fights-for-10-day-waiting-period-in-addition-to-passing-background-check/"}
