{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 18:20:23","date_modify":"2018-10-30 18:20:23","date_publish":"2016-05-03 19:03:34","description":"Gov. Sam Brownback's recent decision to withdraw the state of Kansas from the federal refugee resettlement program may be just the first step in a full-fledged battle with the Obama administration over state sovereignty issues. | Politics","filename":"data/vaneerConsumption/KansasWatchingforDevelopmentsinConstitutionalChallengetoFederalRefugeeResettlementProgram.json","image_url":"https://media.breitbart.com/media/2016/03/GettyImages-512657442.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_05_03__1540923623.html","title":"Kansas 'Watching for Developments' in Constitutional Challenge to Federal Refugee Resettlement Program","title_page":"Kansas 'Watching for Developments' in Constitutional Challenge to Federal Refugee Resettlement Program | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Gov. Sam Brownback’s recent decision to withdraw the state of Kansas from the federal refugee resettlement program may be just the first step in a full-fledged battle with the Obama administration over state sovereignty issues.\n“We are aware of the legal argument and watching for developments,” Gov. Brownback’s spokesperson Eileen Hawley tells Breitbart News about the lawsuit the Tennessee General Assembly has declared it will file on Tenth Amendment grounds against the federal refugee resettlement program.\nHawley’s comment is just the latest indication of growing state resistance to the Obama administration’s efforts to increase the resettlement of Syrian refugees, even in states that have made clear they do not want them.\nThe Obama administration says it will increase the number of Syrian refugees settled in the United States to 10,000 in the current fiscal year, up dramatically from an estimated 2,300 in the four previous fiscal years.\nIn addition, the Obama administration has unilaterally declared that it intends to accelerate the vetting time for these refugees, taking just three months instead of the usual two years.\nKansas joins New Jersey, which Gov. Chris Christie recently withdrew from the federal refugee resettlement program, and twelve other states (Alabama, Alaska, Colorado, Idaho, Kentucky, Louisiana, Massachusetts, Nevada, North Dakota, South Dakota, Tennessee, and Vermont) that previously withdrew from the program.\nThe Obama administration is asserting it can continue to operate the federal refugee resettlement program directly in Kansas and New Jersey through VOLAGs (voluntary agencies such as Catholic Charities and Lutheran Social Services) just as it has done in the twelve states that have previously withdrawn under a set of statutorily questionable regulations that established the Wilson-Fish alternative program.\nAs Breitbart News reported previously, the Obama administration pays these VOLAGs more than $1 billion to administer the federal refugee resettlement program around the country.\nRefugee Resettlement Watch recently published an anonymous report from a former VOLAG employee who argues, based on personal experience, that these groups are failing to ensure the resettled refugees become self-sufficient.\n“What I DO fault them, and all the staff at the VOLAG, for is what I view as continually enabling refugee clients to remain dependent on social services and welfare handouts,” the anonymous former VOLAG employee writes, adding:\n[T]he thing that burned me up (still does!) is the fact that refugees aged 65 and over automatically qualify for SSI benefits! I never understood why the caseworkers and Director didn’t see how the financial irresponsibility on the part of so many refugees, their unwillingness to do certain jobs, their entitlement mentality, and dependence on welfare, coupled with the sheer NUMBERS coming into this country, is contributing to the eventual downfall of Judaeo-Christian society.\nBut Tennessee is now poised to challenge the operation of the Wilson-Fish alternative program by one of these VOLAGs, Catholic Charities, in the Volunteer State.\nThe Tennessee General Assembly recently passed a joint resolution “regarding the commencement of legal action seeking relief, including declaratory and injunctive relief, from the federal government’s mandated appropriation of state revenue and noncompliance with the Refugee Act of 1980 with respect to refugee resettlement in Tennessee.”\n“The federal government is actively placing refugees in the State of Tennessee,” the resolution states. “The State of Tennessee is required to provide certain benefits and services to otherwise eligible refugees, including Medicaid services, or risk losing all Medicaid funding.”\n“[U]nder the Tenth Amendment to the United States Constitution as construed by the United States Supreme Court in National Federation of Independent Businesses v. Sebelius,” the resolution continues, “the federal government cannot lawfully coerce the State to provide funding with no real option but to acquiesce.”\n“[S]uch coercion,” the resolution adds, “is also prohibited by Article II, Section 24, of the Tennessee Constitution, which prohibits the expenditure of public money except pursuant to appropriations made by law.\n“[B]y conditioning all Medicaid funding on the requirement that the State provide Medicaid services to refugees absent other input or control by the State of Tennessee, the State is being coerced in violation of both the United States Constitution and the Tennessee Constitution,” the resolution states.\nThe Thomas More Law Center, a conservative public interest law firm, has told Tennessee and any other state in which the federal government is operating the refugee resettlement program under the Wilson-Fish alternative program regulations, that it will represent that state free of charge in a Tenth Amendment challenge to the program in federal court.\nKansas may not be the only state that has withdrawn from the program that is “watching for developments” in the anticipated constitutional legal challenge to the federal refugee resettlement program. Sources tell Breitbart News that political leaders in Idaho and North Dakota are also closely watching the Tennessee challenge.\nTenth amendment legal challenges from states in which the federal government is operating the refugee resettlement program under the statutorily questionable Wilson-Fish alternative program are not the only problem the Obama administration faces.\nSeveral states currently participating in the program may be considering withdrawing as well.\n“Our contract is up in one month and we are currently evaluating our options,” a spokesperson for Gov. Greg Abbott of Texas tells Breitbart News.\nThe spokesperson was referring to the contracts between the State of Texas and local resettlement agencies, or VOLAGs, for the operation of the federal refugee resettlement program in the state.\n“The Governor in conjunction with the refugee coordinator ” were identified by the spokesperson as the responsible parties evaluating current options.\nIn testimony before the Texas State Senate in April, Cecile Erwin Young, the Texas State Refugee Coordinator, identified the Wilson-Fish alternative program as one of three options available to the State of Texas. (Testimony begins around the 46 minute mark in this video .)\nTexas is currently one of the 35 states still participating in the federal refugee resettlement program.\nEarlier this year, Texas and Alabama each separately sued the federal government for its failure to operate the refugee resettlement program in compliance with the Refugee Act of 1980. Legal experts tell Breitbart News that lawsuit, which was not filed on Tenth Amendment grounds, is not expected to have much success, since the federal government can claim a simple phone call to state officials after the fact informing them of where refugees have been settled complies with the law.\nSources tell Breitbart News that Maine and Florida are two additional states that may be considering withdrawal from the federal refugee resettlement program.","url":"https://www.breitbart.com/politics/2016/05/03/state-resistance-grows-kansas-watching-developments-constitutional-challenge-federal-refugee-resettlement-program/"}
