{"authors":["Thomas Burrows","Associated Press"],"date_download":"2018-10-23 04:57:44","date_modify":"2018-10-23 04:57:44","date_publish":"2017-03-16 16:04:18","description":"Adoption officials in Kansas are working to find a permanent place for Bradley, 11, Preston, 10, Layla, 8, Landon, 6, and Olive, 2, to live together with the same family.","filename":"data/vaneerConsumption/Kansassiblingswhowanttobeadoptedbythesamefamily.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/20/3E57F09E00000578-0-image-a-120_1489697468854.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320884_Push-underway-5-Kansas-siblings-adopted-together_1540270664.html","title":"Kansas siblings who want to be adopted by the same family","title_page":"Kansas siblings who want to be adopted by the same family | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Five siblings who want to be adopted together have had thousands of offers after an online listing about their unique situation went viral.\nAdoption officials in Kansas are working to find a permanent place for the children to live, as well as a family willing to keep the siblings together.\nThe siblings - Bradley, 11, Preston, 10, Layla, eight, Landon, six, and Olive, two - are all currently living in separate foster homes.\nAdoption officials in Kansas are working to find a permanent place for Bradley, 11, Preston, 10, Layla, 8, Landon, 6, and Olive, 2, to live together with the same family\nVideo courtesy of WIBW:\nThe two sisters and three brothers were featured on the adoption website AdoptKSKids.org last week, which is run by the Kansas Children's Service League and Kansas Department for Children and Families.\nThe website was forced to take the children's listing down on Monday so staff could begin to go through the high number of requests they have already received.\nTheresa Freed, with the Kansas Department for Children and Families, told ABC News the agency had received more than 1,300 emails about the children.\nShe added: 'We've identified some possible families who may be a good fit.'\nShe was not able to disclose information on the children's parents or the circumstances that led to the siblings' need for an adoptive family.\n'This is a viral response...and it's pretty insane,' Corey Lada from the League told the newspaper.\n'In 13-plus years of working here I've seen nothing like this. Nothing.'\nThe newspaper profiled the children saying they were active in church and have hobbies ranging from hip-hop dance, to collecting Pokemon to soccer and tether ball.\nThe two sisters and three brothers are all currently living in separate foster homes\nBradley was described as a music lover who is shy and quiet, while his younger brother Preston is an energetic animal lover who likes being outdoors.\nLandon, six, loves collecting Pokemon cards and racing his older brothers, while the youngest child Olive likes to be cuddled and held.\nEight-year-old Layla enjoys hip-hop dancing, playing baseball and volleyball. She is 'already planning to save sick or injured animals when she grows up.'\nKansas has about 1,200 children in state custody and seeking adoption.","url":"https://www.dailymail.co.uk/news/article-4320884/Push-underway-5-Kansas-siblings-adopted-together.html"}
