{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:14:17","date_modify":"2018-10-30 22:14:17","date_publish":"2015-04-03 01:10:41","description":"Kansas Gov. Sam Brownback signed SB 45, abolishing the need for a concealed carry permit in order to carry a concealed handgun in the state.","filename":"data/vaneerConsumption/KansasGovIgnoresMomsDemandSignsBillAbolishingConcealedPermitRequirement.json","image_url":"https://media.breitbart.com/media/2015/04/Sam-Brownback-signing-pro-2nd-Amendment-bill-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_02__1540937657.html","title":"Kansas Gov. 'Ignores' Moms Demand: Signs Bill Abolishing Concealed Permit Requirement","title_page":"Kansas Gov. 'Ignores' Moms Demand: Signs Bill Abolishing Concealed Permit Requirement | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On April 2, Kansas Governor Sam Brownback (R) signed SB 45, abolishing the need for a concealed carry permit in order to carry a concealed handgun in the state.\nThis means Kansas joins Alaska, Arizona, Vermont, and Wyoming in doing away with concealed carry permit requirements and also joins Montana, which has done away with a concealed permit requirement outside of city limits in that state.\nThe Kansas City Star reports that the new law will go into effect on July 1.\nKansas will continue to offer concealed carry permit courses and licenses for those who want to get them in order to enjoy reciprocity with the 36 other states that recognize Kansas licenses, but no license will be necessary in order to carry inside Kansas’s borders.\nWhen signing the bill, Brownback talked of how “carrying a gun is a constitutional right” and added, “We’re saying if you want to do that in this state, then you don’t have to get a permission slip from the government.”\nMoms Demand Action for Gun Sense in America’s TerriLynn Barnett Miller said her group opposed SB 45 to no avail. The Topeka Capital-Journal quotes Miller as saying her group “spoke out against this dangerous setback for public safety [but] Governor Brownback ignored [them].”\nAnother loss for Moms Demand Action, another win for freedom.\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/04/02/kansas-gov-ignores-moms-demand-signs-bill-abolishing-concealed-permit-requirement/"}
