{"authors":["Morgan Brinlee"],"date_download":"2018-10-31 01:49:55","date_modify":"2018-10-31 01:49:55","date_publish":"2018-08-27 17:27:58","description":"Hundreds of Kansans living in the Wichita area may have unknowingly been drinking water contaminated with dry cleaning chemicals that, over time, have the potential to harm the liver, kidneys, and nervous and reproductive systems. According to The…","filename":"data/vaneerConsumption/KansasResidentsDrankContaminatedWaterForYearsWhileOfficialsKeptTheEvidenceQuiet.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/aae57e51-2404-442e-a3ef-3703c305135f-getty-468938238.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_kansas-residents-drank-contaminated-water-for-years-while-officials-kept-the-evidence-quiet-10244545_1540950595.html","title":"Kansas Residents Drank Contaminated Water For Years While Officials Kept The Evidence Quiet","title_page":"Kansas Residents Drank Contaminated Water For Years While Officials Kept The Evidence Quiet","title_rss":"NULL","source_domain":"bustle.com","text":"Hundreds of Kansans living in the Wichita area may have unknowingly been drinking water contaminated with dry cleaning chemicals that, over time, have the potential to harm the liver, kidneys, and nervous and reproductive systems. According to The Wichita Eagle, state officials in Kansas waited years before notifying residents that water contamination may have affected their private drinking wells.\nAlthough the Kansas Department of Health and Environment uncovered evidence that a dry cleaning chemical known as perchloroethylene, or PCE, had contaminated groundwater in Haysville in 2011, the agency failed to act or alert residents for more than six years, according to a report in The Wichita Eagle. Bustle has reached out to the Kansas Department of Health and Environment for comment. While the paper did not provide exact numbers, it noted that state officials found PCE in groundwater at levels higher than the U.S. Environmental Protection Agency deems safe to drink while investigating the potential expansion of a Kwik Shop. Sampling of one resident's private well conducted more recently, reportedly revealed nearly 10 times the acceptable level of PCE, the paper reported.\nThe state's Department of Health and Environment told The Wichita Eagle that it had initially assumed the contaminated groundwater was moving away from nearby residents' private drinking wells, and so they classified the issue as a low priority. But the contaminated groundwater wasn't flowing away from nearby private wells, it was flowing directly toward them. According to The Wichita Eagle, the Kansas Department of Health and Environment didn't discover this until 2017.\nState officials have been clear in emphasizing that the public water supply for the city of Haysville has not been affected, meaning residents who are connected to city water are not at risk for having consumed or bathed in water contaminated with PCE. But it's unclear exactly how many private wells — not to mention the residents who rely on them — may have been impacted.\nWhile it's also unclear exactly how long water in contaminated private wells may have been compromised, The Wichita Eagle noted that prolonged exposure to PCE \"may cause changes in mood, memory, attention, reaction time and vision\" and that \"studies have suggested that the chemical might lead to a higher risk of bladder cancer, multiple myeloma or non-Hodgkin’s lymphoma.\"\nBut the city is apparently attempting to bring clean water to as many residents as possible. According to The Wichita Eagle, Haysville had hooked up \"around 200 homes\" to the city's public water supply by July. It was unclear to Bustle if some residents remained dependent on potentially contaminated private wells.\nThe Haysville groundwater contamination is reportedly not the first time state officials have been slow in alerting residents of contamination. In 2009, The Kansas Department of Health and Environment found evidence of a PCE contamination in Wichita, The Wichita Eagle reported. But the agency reportedly waited until 2014 before telling potentially impacted residents of the contamination.\nPart of the problem is a decades-old state law known as the Kansas Drycleaner Environmental Response Act, which emphasizes prioritizing the protection of dry cleaners over public health. According to The Wichita Eagle, the law directs the Kansas Department of Health and Environment not to specifically look for contaminations related to dry cleaning chemicals and to instead, make every \"reasonable effort\" to keep contamination sites within the state off the Environmental Protection Agency's Superfund list.\nWhat's more, money in a fund established to deal with dry-cleaning chemical related contamination sites has steadily been decreasing while the number of known contamination sites has been increasing, putting strain on the state's ability to keep up.\nBut Kansas Department of Health and Environment Director of Environment Leo Henning told The Wichita Eagle that the agency has established priorities. \"There's never going to be enough money to do everything at once, so we have to prioritize,\" the paper reported Henning said. \"Right now our main challenge — and where we're trying to get to — is making sure there are no Kansans drinking contaminated water.\"","url":"https://www.bustle.com/p/kansas-residents-drank-contaminated-water-for-years-while-officials-kept-the-evidence-quiet-10244545"}
