{"authors":[],"date_download":"2018-10-22 23:18:38","date_modify":"2018-10-22 23:18:38","date_publish":"2015-01-13 00:00:00","description":"Robert Finn, head of Kansas City's diocese, is the only U.S. bishop convicted of shielding a sexually abusive priest. Supporters say Finn received conflicting advice about how to handle the problem.","filename":"data/vaneerConsumption/KansasCityCatholicsDividedOverVaticanInvestigationOfBishop.json","image_url":"https://media.npr.org/assets/img/2015/01/13/ap1111140174909_wide-2201fdfe69bfc71975ad8241ea598308705c42f7.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=377000433_1540250318.html","title":"Kansas City Catholics Divided Over Vatican Investigation Of Bishop","title_page":"Kansas City Catholics Divided Over Vatican Investigation Of Bishop : NPR","title_rss":"NULL","source_domain":"npr.org","text":"MELISSA BLOCK, HOST:\nCatholics in the Kansas City-St. Joseph Diocese are waiting to find out if the Pope is going to remove their bishop. Robert Finn is the only American bishop convicted in state court of shielding a sexually abusive priest. Bishop Finn is also the focus of a rare Vatican investigation. Frank Morris of member station KCUR reports that the debate over the controversial bishop is splitting the diocese.\nFRANK MORRIS, BYLINE: A Catholic bishop normally governs pretty much unchecked in his diocese. Only the Pope can dislodge a bishop. And each time Catholics celebrate mass in Kansas City, they pray for Bishop Robert Finn, right after they pray for Pope Francis.\n(SOUNDBITE OF MASS)\nUNIDENTIFIED MAN #1: Our Holy Father Francis, our Bishop Robert.\nMORRIS: But some Catholics here, like Deacon David Biersmith, refused to go along. [POST-BROADCAST CORRECTION: The audio of this story incorrectly identifies David Biersmith as a deacon. He is actually a Eucharistic minister.]\nDAVID BIERSMITH: When the priest says that, you know, you're supposed to say it with him, I just - I leave that out (laughter). I just don't say it.\nMORRIS: Why?\nBIERSMITH: Because he's not my bishop as far as I'm concerned.\nMORRIS: Much of the discontent has to do with an incident four years ago. A computer technician found hundreds of lewd photos of little girls on a priest's laptop. The priest was Shawn Ratigan, and it wasn't the first sign that he was a pedophile. But Bishop Finn didn't tell authorities. Instead, he sent Ratigan to a therapist, switched his job and asked him to stay away from children. Ratigan didn't. And months later, a diocese official did finally report him. Ratigan was sentenced to 50 years in prison for child pornography and Finn drew two years' probation for shielding him.\nJEFF WEIS: So we have a guilty verdict from a judge - yes, he did fail. There had to be more.\nMORRIS: Jeff Weis was just a regular parishioner, not an activist. That is, not until this.\nWEIS: What I was looking for was what is the church's response to this? What is the bishop's response?\nMORRIS: The church set up new protocols for reporting child abuse and hired a former federal prosecutor to investigate the Ratigan mess. But Finn stayed on as bishop. And so Weis launched an online petition asking the Pope to remove him. It's drawn more than 260,000 signatures. Others sent the same message in different ways. And then, last fall, the Vatican dispatched an archbishop here to investigate.\nJIM CACCAMO: Out of the blue I got a call, and they were arranging meetings for the archbishop to talk with people about the Bishop Finn issues. Could I come?\nMORRIS: That's Jim Caccamo, who had a good vantage point on the issue. He led a board for the diocese set up to advise Bishop Finn on sexual abuse issues. While Caccamo calls Finn a wonderful, holy man, he can't fathom why he failed to report Ratigan to authorities.\nCACCAMO: Oh, my gosh. In this environment today, when the church is moving to protect its children, how could that happen?\nMORRIS: A lot of people are asking the same question. James Connell, a priest and canon lawyer in Milwaukee, says Finn broke protocols the church set up after the huge sexual abuse crisis in 2002. Even high-ranking church officials have publicly weighed in. Cardinal Sean O'Malley from Boston, a close adviser to Pope Francis, addressed the Finn issue on \"60 Minutes.\"\n(SOUNDBITE OF TV SHOW, \"60 MINUTES\")\nSEAN O'MALLEY: It's a question that the Holy See needs to address urgently.\nNORAH O'DONNELL: And there is a recognition?\nO'MALLEY: There is a recognition.\nO'DONNELL: From Pope Francis?\nO'MALLEY: From Pope Francis.\nMORRIS: Pope Francis recently demoted Finn's closest ally in Rome, a conservative cardinal named Raymond Burke. But Finn still has plenty of support here in Kansas City.\nJOHN PURK: Well, I love Bishop Finn.\nMORRIS: John Purk, a recently ordained deacon in the Kansas City-St. Joe Diocese, holds traditional Catholic views of marriage, birth control, abortion and theology - same as Finn. It's a belief system that Purk says reveals the deity of Jesus.\nPURK: Now, a lot of people have a problem with that, just like they had a problem with Jesus. And so the problems that Jesus encountered, this bishop encounters.\nMORRIS: Purk says Finn faced a real dilemma over Father Ratigan. He says the bishop had conflicting advice and notes that Ratigan tried to kill himself when his lewd photographs came to light.\nPURK: I think the bishop did the best that he could have done with the information that he had, having to balance mercy and justice with a man who was suicidal.\nMORRIS: American Catholics are looking to see how the Vatican balances the traditional autonomy of bishops with the need to better address the church's ongoing sexual abuse issue and who the Pope wants to lead the diocese in Kansas City. For NPR News, I'm Frank Morris.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=377000433"}
