{"authors":["Associated Press"],"date_download":"2018-10-23 05:00:54","date_modify":"2018-10-23 05:00:54","date_publish":"2016-01-28 21:02:27","description":"TOPEKA, Kan. (AP) — The Kansas Supreme Court considered Thursday whether the state can avoid limiting greenhouse gas emissions from a proposed $2.8 billion c...","filename":"data/vaneerConsumption/Kansascourtpondersgreenhousegaslimitsforcoalplant.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:a3397df6d4b4489aa29339f7fa03306c-2vdWmEltwXfba0ce28e632c9da58-445_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421688_Kansas-court-ponders-greenhouse-gas-limits-coal-plant_1540270854.html","title":"Kansas court ponders greenhouse gas limits for coal plant","title_page":"Kansas court ponders greenhouse gas limits for coal plant | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kansas court ponders greenhouse gas limits for coal plant\nTOPEKA, Kan. (AP) — The Kansas Supreme Court considered Thursday whether the state can avoid limiting greenhouse gas emissions from a proposed $2.8 billion coal-fired power plant despite the federal government's efforts to combat climate change.\nThe court heard arguments Thursday from attorneys in a lawsuit filed by the Sierra Club in 2014 to prevent Sunflower Electric Power Corp. from building the 895-megawatt facility next to an existing coal-fired plant outside Holcomb, in southwest Kansas. The state Department of Health and Environment has twice given a go-ahead for the project without setting limits on greenhouse gas emissions.\nThe department first issued a pollution-control permit to Sunflower in 2010, just before the federal government began regulating greenhouse gas emissions. Environmentalists challenged it on other grounds, and the Supreme Court in 2013 directed the agency to set tougher standards for pollution such as mercury, nitrogen dioxide and sulfur dioxide.\nFILE - This Feb. 2, 2007 file photo shows Sunflower Electric Cooperative's coal-fired power plant in Holcomb, Kan. The Kansas Supreme Court heard arguments from attorneys Thursday, Jan., 28, 2016 in Topeka on a lawsuit filed by an environmental group to block construction of a $2.8 billion coal-fired power plant next to the existing coal-fired plant outside Holcomb. (AP Photo/Charlie Riedel, File)\nThe department in 2014 issued what it calls an \"addendum\" to the 2010 permit and argues that limits on greenhouse gas emissions are still not required for the new plant. The Sierra Club said the agency must impose such restrictions because of President Barack Obama's efforts to target coal-fired power plants as a major source of greenhouse gas emissions.\nThe Supreme Court could rule later this year, and such a decision would come as Kansas officials are working on a plan for complying with a U.S. Environmental Protection Agency rule issued last year to require states to reduce greenhouse gas emissions from power plants. Kansas must drop its emissions levels by 43 percent by 2030.\n\"They'd like to pretend this isn't happening, but it is,\" Amanda Goodin, an attorney for Earthjustice, which is representing the Sierra Club, said after the court's hearing. \"They need to wake up and get emission limits in this permit.\"\nSunflower has sought to build the plant for nearly a decade. It didn't obtain a permit from KDHE until Democratic Gov. Mark Parkinson brokered a deal with the company and the Republican-dominated Legislature that included approval of some green energy initiatives. The 2010 permit was issued during Parkinson's final weeks in office, after he'd pushed out the KDHE secretary who'd previously blocked it.\nEnvironmentalists didn't challenge the lack of limits on greenhouse gas emissions in attacking the 2010 permit. They conceded the issue because the EPA's first greenhouse gas rules didn't take effect until 2011, albeit only weeks after the permit.\nAssistant Attorney General Steve Fabert, representing KDHE said after the hearing that the Sierra Club \"punted\" on the issue by not raising it then.\nHe told the justices that the department wasn't issuing a new permit in 2014. Doing so would require the state to follow federal greenhouse gas regulations imposed after 2010.\n\"We didn't alter anything here,\" Fabert told the justices. \"We added to what was already present.\"\nBut Justice Marla Luckert told him: \"That seems disingenuous to me.\"\nSunflower provides electricity to 350,000 western and central Kansas residents through six smaller cooperatives. Its new plant could generate enough electricity for up to 448,000 households, according to one state estimate.\nThree-quarters of the new capacity would be reserved for power that would be sold in Colorado. That's a sore point for environmentalists, but Sunflower gained bipartisan support in the Legislature for the plant by describing it as potential economic development.\n___\nOnline:\nKansas Supreme Court: http://bit.ly/1KdpNiv\nSunflower: http://www.sunflower.net/\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3421688/Kansas-court-ponders-greenhouse-gas-limits-coal-plant.html"}
