{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:55:58","date_modify":"2018-10-30 19:55:58","date_publish":"2015-03-26 16:53:37","description":"Kansas House, Senate: Abolishing Concealed Permit About 'Freedom, Liberty'","filename":"data/vaneerConsumption/KansasHouseSenateAbolishingConcealedPermitAboutFreedomLiberty.json","image_url":"https://media.breitbart.com/media/2015/03/concealed-carry-gun-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_26__1540929358.html","title":"Kansas House, Senate: Abolishing Concealed Permit About 'Freedom, Liberty'","title_page":"Kansas House, Senate: Abolishing Concealed Permit About 'Freedom, Liberty' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On March 25 the Kansas House and Senate passed a concealed carry reform bill–SB 45–that ends the requirement for a permit to carry a concealed handgun in that state.\nAccording to The Topeka Capital-Journal, SB 45 was sponsored by state representative Travis Couture-Lovelady (R-110th Dist.), who said requiring a permit for carry is just “a feel good measure.” He said his bill “is about freedom and liberty. No more fees. No license. Carrying a guns is a lifestyle and government should trust its citizens.”\nSB 45 passed the house 85-39 and the senate “voted 31-8 to concur with the house.”\nThe bill now goes to Governor Sam Brownback’s (R) desk and, if signed, means that Kansans 21 years and older can carry a concealed handgun for self-defense without a permit.\nState representative Louis Ruiz (D-Kansas City) opposed the measure, claiming it will turn Kansas “into the Wild West” and will result in lawlessness and “gun fights.” Ruiz did not indicate whether lawless individuals have been waiting for the concealed carry law to change before carrying guns on their persons.\nFive states currently allow concealed carry without permit, those are Alaska, Arizona, Montana, Vermont, and Wyoming.\nWest Virginia’s House and Senate recently passed a bill repealing the permit requirement in their state, but the measure was vetoed by Governor Earl Ray Tomblin (D), who stood with Moms Demand Action and Senator Joe Manchin (D-WV) over the rights of West Virginians.\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/03/26/kansas-house-senate-abolishing-concealed-permit-about-freedom-liberty/"}
