{"authors":[],"date_download":"2018-10-22 21:44:41","date_modify":"2018-10-22 21:44:41","date_publish":"2016-01-29 07:50:26","description":"Paul Kantner, the co-founder of Jefferson Airplane whose psychedelic sound and free-spirited mindset helped define 1960s counterculture in San Francisco, has...","filename":"data/vaneerConsumption/KantnercountercultureiconwithJeffersonAirplanedeadat74.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h6kx-3bmscybNe842cce83474b523191c-454_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422099_Jefferson-Airplane-founder-Kantner-dead-74_1540244681.html","title":"Kantner, counterculture icon with Jefferson Airplane, dead at 74","title_page":"Kantner, counterculture icon with Jefferson Airplane, dead at 74 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kantner, counterculture icon with Jefferson Airplane, dead at 74\nPaul Kantner, the co-founder of Jefferson Airplane whose psychedelic sound and free-spirited mindset helped define 1960s counterculture in San Francisco, has died. He was 74.\nWith hits such as \"Somebody to Love\" and \"White Rabbit,\" Jefferson Airplane wrote anthems for the hippie movement and the memorable \"Summer of Love\" in which young people took over the US city in 1967.\nWhile vocalists Grace Slick and Marty Balin were the public faces of Jefferson Airplane, Kantner, a guitarist, was often considered the creative force of the band as he brought a new urgency to the folk scene from which he emerged.\nPaul Kantner, the co-founder of Jefferson Airplane, died of multiple organ failure following a heart attack ©Mario Tama (Getty/AFP/File)\n\"He was the first guy I picked for the band and he was the first guy who taught me how to roll a joint,\" Balin wrote on Facebook of his death.\n\"And although I know he liked to play the devil's advocate, I am sure he has earned his wings now,\" he said.\nKantner, who suffered intermittent health problems for years, died of multiple organ failure following a heart attack, the San Francisco Chronicle quoted his longtime publicist and friend Cynthia Bowman as saying.\nBowman could not be reached. The Recording Academy, which is due to award Jefferson Airplane a lifetime achievement Grammy this year, in a statement mourned Kantner as \"a true icon\" of the 1960s music scene.\nJefferson Airplane was one of the first bands to frequent Bill Graham's Fillmore club, the epicenter of the hippie music scene that also brought in the Grateful Dead, Janis Joplin and The Doors.\nAs icons of the counterculture, Jefferson Airplane were headliners at two emblematic festivals of the era -- Monterey, where the band turned its performance into a live album, and Woodstock, where the band's set due for Saturday evening wound up taking place at 8:00 am the next morning.\n- 'A marvelous exploration' -\nBorn in San Francisco, Kantner was a lifelong cultural fixture in the famously left-leaning city whose philosophy, he liked to say, was to break all the rules.\nHe wrote the 1969 anthem \"We Can Be Together\" after hearing a slogan of the nascent Black Panther movement.\n\"We are obscene, lawless, hideous, dangerous, dirty, violent and young / But we should be together,\" ran the signature verse.\nIn an interview at the time with Rolling Stone magazine, Kantner did not reject the characterization of his music as violent.\n\"Violent in terms of violently upsetting what's going on, not a violence of blowing buildings up,\" he said.\nKantner was unabashed about his drug use, enjoying LSD and advocating the legalization of marijuana while calling alcohol the greater danger.\nHe described LSD trips as the \"most formative moment of my life,\" telling the Sarasota Herald-Tribune last year that the psychedelic drug \"gave me what I always hoped religion would give me, and never did.\"\nHe was similarly sharp-tongued when asked about the Beatle George Harrison's comment that 1967 San Francisco was awash with \"horrible, spotty, drop-out kids.\"\n\"I guess he didn't get laid, which was hard to do back then,\" he told the Virginia newspaper The Hook in 2007.\n\"It wasn't just sex, drugs, and rock 'n roll but just a marvelous exploration in a different way of living,\" he said.\nKantner for a time was involved with singer Slick, with whom he had a daughter, China, whose birth inspired the song \"A Child Is Coming.\"\nBut he declined to follow Slick in the 1980s into the band Jefferson Starship, whose light pop sound brought number one hits but also mockery for the commercial tilt.\n(L-R) Paul Kantner, Cathy Richardson, Slick Aguilar and David Frieberg perform at the concert marking the 40th anniversary of the Woodstock music festival in Bethel, New York ©Mario Tama (Getty Images/AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3422099/Jefferson-Airplane-founder-Kantner-dead-74.html"}
