{"authors":["Caitlin O'Toole For Dailymail.Com","Justin Enriquez For Dailymail.Com"],"date_download":"2018-10-22 20:46:31","date_modify":"2018-10-22 20:46:31","date_publish":"2016-01-28 03:45:20","description":"The 38-year-old rapper refused to answer questions about his epic Twitter fit as he arrived at LAX on Wednesday. ''Don't ask me no more questions about it,' he snapped at a cameraman.","filename":"data/vaneerConsumption/KanyeWestbrushesoffquestionsaboutWizKhalifaandAmberRoseTwitterfeud.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/02/30A62CF700000578-0-image-a-14_1453946792905.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420308_Kanye-West-brushes-questions-Wiz-Khalifa-Amber-Rose-Twitter-feud-arrives-LAX_1540241191.html","title":"Kanye West brushes off questions about Wiz Khalifa and Amber Rose Twitter feud","title_page":"Kanye West brushes off questions about Wiz Khalifa and Amber Rose Twitter feud | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kanye West angrily brushed off questions about his Twitter feud with Wiz Khalifa as he stepped out after his epic social media meltdown.\nThe rapper grew annoyed at a TMZ cameraman who repeatedly questioned him about the beef and asked if he'd gone too far dragging Wiz and Amber Rose's young son into the spat.\nThe 38-year-old blasted music from his new album Waves as he pulled up at LAX on Wednesday, wearing one of his Yeezy jackets and a black Yeezus hoodie.\nScroll down for video\nMoving on: Rapper Kanye West brushed off questions about his epic Twitter meltdown at Wiz Khalifa as he arrived at LAX on Wednesday\n'I said what I had to say,' the All Day rapper said when asked if he'd been too hard on Wiz.\nAsked a second time, Kanye insisted: 'I said what I had to say and I ain't saying nothing else to you.'\nThe rapper signed autographs as he walked through the terminal, but lost his cool when he was asked about the issue for a third time, specifically about dragging Wiz and Amber's 23-month-old son Sebastian into the mix.\nKanye implied on Twitter that Wiz had been 'trapped' by having a kid with 'gold digger' Amber, that Wiz wouldn't have a kid if it wasn't for Kanye breaking up with Amber.\nFashion lover: Kanye wore one of his Yeezy jackets and a hoodie from his Yeezus tour as he said he didn't want to talk about the social media beef\nAnnoyed: 'Don't ask me any more questions about it,' the rapper said as he moved through the terminal\n'I said \"I said all I had to say,\" said Kanye, adding: 'Don't ask me no more questions about it. Thank you.'\nHowever, the 38-year-old later appeared to regret his brusque tone, shaking the cameraman's hand and apologizing when he reached the gate.\n'Thank you brother. Good meeting you man,' Kanye said. 'I didn't mean to talk to you heavy... respect to you and your family.'\nBetter mood: Kanye went off on Wiz after he complained about Yeezy's new album name Waves and added the initials KK, which Kanye mistakenly took as a dig at wife Kim Kardashian. It was actually a weed reference\nOn his phone: The 36-year-old later apologized for snapping at the cameraman, and has also deleted his tweets, saying he wants to put 'positive energy' out there\nKanye unleashed an epic tirade at Wiz, 28, after taking a 'KK' reference in one of Wiz's tweets to be a dig at wife Kim Kardashian. He later realized it was a reference to marijuana and apologized, deleting the tweets and saying he wanted to focus on 'positive energy.'\nThe rappers both dated Amber Rose, 32, and Kanye made several angry comments about his ex during the vitriolic stream of consciousness.\nHe referred to Amber as a 'stripper' and implied she was a gold digger by referencing lyrics to his hit song. Amber and Wiz, who were married for a year, have a 23-month-old son, Sebastian, together.\nThe feud began when Kanye announced he changed the name of his upcoming album to Waves, which Wiz took umbrage to and later tweeted something involving 'KK,' appearing to set Kanye off.\nWild, wild West: Kanye West unleashed a tirade at Wiz Khalifa on Twitter on Wednesday. The pair both dated Amber Rose\nAmber responded with perhaps the most shocking tweet of all - a sexually explicit reference to her bedroom activities with Kanye.\nAs the feud began with the album title, Waves, which is a term in the hip-hop community in reference to the style of rapper Max B, who is currently in prison.\nWiz later tweeted a post with the initials ‘KK’ in it, which Kanye took to be a reference to his wife Kim Kardashian, and blasted him for it, as well as accusing him of stealing his style from rapper and Kanye protege Kid Cudi. However, Kanye did admit that Wiz has 'cool pants.'\nAfter Wiz insisted that ‘KK’ had been referring to marijuana, Kanye continued to berate him with pointed tweets.\nBut Yeezy later admitted everything regarding 'KK' was a misunderstanding and that it was actually marijuana Wiz had been referring to, saying he was deleting his tweets because he wanted to try to stay positive.\nEpic: The 38-year-old rapper went on an epic Twitter rant as he even took aim at the mother of Wiz's child and his ex girlfriend Amber Rose\nKanye's epic rant aimed at Wiz including strong words like: 'You let a stripper trap you.'\n'I know you mad every time you look at your child that this girl got you for 18 years'\n'You wouldn’t have a child if it wasn’t for me.'\nBut he threw in a few compliments too in the bizarre outburst, saying: 'I think you dress cool I wish I was skinny and tall...'\nHe continued: 'Maybe I couldn’t be skinny and tall but I’ll settle for being the greatest artist of all time as a consolation.'\nHe also praised his rival's taste in trousers, noting: 'I went to look at your twitter and you were wearing cool pants. I screen grabbed those pants and sent it to my style team #Wizwearscoolpants.'\nOuch: Kanye also used his wife's app Kimoji as he shared this image while making reference to Wiz's hit Work Hard Play Hard\nWhat an endorsement: Khloe Kardashian certainly seemed to be enjoying Kanye's rant as she posted this\nWorking title: This all began on Tuesday night when Kanye announced he had changed his album title to Wave\nBut then Kanye took the credit, noting: 'I am your OG and I will be respected as such. I made it so we could wear tight jeans.'\nAt one point, The All Of The Lights rapper even used his wife's app Kimoji to share one of Kim Kardashian with a tear running down her face, he also poked fun of Wiz with the caption as he made reference to his 2012 hit with the message: 'work hard play hard.'\nIt seemed as if Kanye finally got the message as he deleted the string of tweets because it was all about 'positive energy.'\nAfter three hours, Wiz finally took to Twitter again but did not address any of Kanye's tweets but instead promoted his concert as he wrote: 'First show in Argentina is tonight. Meet and Greets at 7. I go on at 9.'\nRegret? After the string of tweets, Kanye posted much more positive messages\nMoving on: He later tweeted that he had deleted all the negative messages aimed at WIz\nWorking hard or playing hard?: Kanye said that he was with Ian Connor, who is Wiz's assistant, personal stylist and creative director\nClarification: Kanye did admit that everything involving 'KK' was a misunderstanding and that it was actually a reference to marijuana\nKanye dated Amber for two years from 2008 to 2010.\nTheir relationship has been up for discussion as of late as a track from his upcoming seventh studio album was leaked, as he appeared to blast his ex by suggesting she doesn't look as good as she used to.\nA snippet from the track, features the lyrics: 'My ex said she gave me the best years of her life, I saw a recent picture of her, guess she was right.'\nIt's fair to say the relationship did not end amicably with Amber previously branding Kim, the mother of Kanye's two children, a 'homewrecker.'\nKanye was bold about slamming his former girlfriend in 2015 when he said in an interview that he had to take '30 showers' after dating Amber.\nNo love lost: Kanye and then-girlfriend Amber Rose at an opera gala in New York in 2009\nLow blow: Amber, Wiz and son Sebastian out in LA. Kanye tweeted that Wiz wouldn't have a child it it weren't for him dumping Amber\nHitting back: Amber did not take the tweets lightly as she responded with a rather crude tweet\n'You're getting bodied by a stripper': The 32-year-old model also addressed the fact that Kanye had deleted the tweets\nHe candidly confessed: 'If Kim had dated me when I wanted, there would be no Amber Rose.'\nThe rapper is said to have had his eye on Keeping Up With The Kardashians star Kim as early as 2008, naming her his 'girl of the week' in early blog posts which resurfaced in October 2014.\nHe added in the one-to-one: 'It's very hard for a woman to want to be with someone that's with Amber Rose. I had to take 30 showers before I got with Kim.'\nAmber and Wiz married in July 2013 but filed for divorce just over a year later in September 2014. They remain amicable.\nIt is quite an interesting time for the feud to come to come fruition, as Kim and Amber's lives certainly seem to be intertwined as Amber has had repeated reports of animosity between her and the Kardashian sisters.\nEyebrows were raised earlier this week as she began following Kourtney Kardashian's ex Scott Disick on Instagram - after spending a weekend in Vegas with him, Khloe's ex French Montana and rapper Chris Brown.\n'Don't take the wave': The 28-year-old rapper appeared to take umbrage with the album title change as he posted about the Wave movement on Tuesday night shortly after Kanye's announcement\nNot pleased: As currently incarcerated rapper Max B is credited with the Wave movement, Kanye paid his respects but Wiz still seemed skeptical\nInteresting initials: Wiz mentioned 'kk' and it seemed to set Kanye off as he thought it was a reference to his wife Kim Kardashian\nExplanation: Wiz did not respond very much during Kanye's epic rant but he did explain what 'kk' actually meant\nIgonoring: Several were waiting for the See You Again rapper's response but he decided not to acknowledge the posts as he opted to promote his concert in Argentina instead\nNot pleased: The Twitter feed for Wiz's record label, Taylor Gang, was very active as they fired shots at the rapper and fashion designer\nBut anyone thinking Amber was attempting to provoke the Kardashians would be wrong - with a spokesman for the star explaining that she was simply an admirer of Disick.\n'Amber just has a lot of respect for Scott and his work, explained her rep. 'They are friends and colleagues that have mutual respect for each other.'\nThe model's newfound friendship with club promoter Disick comes as it emerged that her BFF Blac Chyna has begun a relationship with Rob Kardashian.\nThe 28-year-old Rob shocked his family and fans when it was revealed that he is dating the model, who has been locked in a bitter feud with his sister Kylie Jenner since Kylie started dating 27-year-old Blac's ex-fiancé Tyga.\nKylie is said to be 'livid' over her brother's romance, with a source adding that she feels 'betrayed.'\nThings certainly seem to be getting interesting as he was pictured rolling up to the model's gated community in LA on Tuesday afternoon after he was allegedly kicked out of older sister Khloe's house for striking up the romance.\nMore to the story: Kanye even accused Wiz of stealing the sound and style of his protege Kid Cudi, right, seen with the rapper at Cannes in 2012\nIntertwined: Amber got fans talking about her 'feud' with the Kardashians as she followed Scott Disick after being seen boarding a private jet in Vegas with Kourtney Kardashian's ex, French Montana and Chris Brown","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420308/Kanye-West-brushes-questions-Wiz-Khalifa-Amber-Rose-Twitter-feud-arrives-LAX.html"}
