{"authors":["Justin Enriquez For Dailymail.Com"],"date_download":"2018-10-22 21:44:28","date_modify":"2018-10-22 21:44:28","date_publish":"2016-01-29 07:50:23","description":"The 38-year-old rapper took to Twitter once again early Friday to address the kinky things his 32-year-old model ex had written about him on the same microblog a day earlier.","filename":"data/vaneerConsumption/KanyeWestrespondstoTHATcrudeAmberRosetweetaboutsexlife.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/08/30B06EE600000578-0-image-a-98_1454054638810.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422315_Kanye-West-returns-Twitter-responds-crude-Amber-Rose-tweet-sex-life_1540244668.html","title":"Kanye West responds to THAT crude Amber Rose tweet about sex life","title_page":"Kanye West responds to THAT crude Amber Rose tweet about sex life | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kanye West has responded to ex-girlfriend Amber Rose's rather explicit insight to their private life.\nThe rapper, 38, evidently wanted to make abundantly clear what he is and isn't into in the bedroom department as he took to Twitter early on Friday morning to address the claims.\nYeezy let loose on the model, 32, once again, describing her as 'mad' in response to her recent revelations about their somewhat fruity sex life.\nScroll down for video\nHitting back: Kanye West responded early Friday to Amber Rose's explicit tweet about him\nClarification: The 38-year-old rapper wanted fans to know that he was not exactly into what his ex accused him of on the microblogging site\nNot one to shy away from letting his opinion be known, Kanye wrote: 'Exes can be mad but just know I never let them play with my a**… I don’t do that… I stay away from that area all together.'\nHe followed up that gem, with perhaps a little too much information about his personal life as he even mentioned wife Kim Kardashian.\nHe wrote: 'I’m not into that kind of s***… I like pictures and videos. Me and my wife got the kind of love that can turn exes into best friends.'\nThe All Of The Lights hitmaker was responding to a rather shocking and sexually explicit post by Amber that caused a collective gasp across the internet.\nSee Kanye West updates as he responds to THAT crude Amber Rose tweet on their sex life\nTMI? He gave a little insight into his personal life with his next tweet\nDynamic duo: Kanye said he and wife Kim Kardashian - pictured together at his fashion show in New York back in September - have the 'kind of love that can turn exes into best friends'\nIt read: 'Awww @kanyewest are u mad I'm not around to play in ur a*****e anymore?#FingersInTheBootyA**B**ch.'\nThis came after Kanye's epic Twitter rant aimed at her ex-husband, Wiz Khalifa, which also mentioned their 23-month-old son Sebastian.\nInitially, Kanye, 38, referred to Amber as a 'stripper' and implied she was a gold digger by referencing lyrics to his hit song during an exchange with Wiz.\nKanye wrote: 'You let a stripper trap you.'\nHitting back: The 32-year-old model did not take lightly to Kanye's Twitter rant about her ex Wiz Khalifa on Wednesday as she responded with a rather crude tweet\n'You're getting bodied by a stripper': Amber also addressed the fact that Kanye had deleted the tweets\n'I know you mad every time you look at your child that this girl got you for 18 years', Kanye tweeted referencing Wiz's soon to be three-year-old son Sebastian with Amber.\n'You wouldn’t have a child if it wasn’t for me.'\nKanye later deleted his tweets after Amber got involved and she tweeted soon after: 'Lol Now u wanna delete ur tweets cuz Muva has arrived?'\nThings have reached such a fever pitch that an iconic daytime personality has offered to have the trio settle their differences on his show.\nJerry Springer also took to Twitter on Thursday morning as he said: 'Hey @kanyewest, @wizkhalifa and @DaRealAmberRose, don't fight! I think you should settle this on my show.'\nBack in the day: Kanye dated Amber for two years from 2008 to 2010, as they are pictured together in New York back in March 2009\nThe feud began when Kanye announced he changed the name of his upcoming album to Waves, which Wiz took umbrage to and later tweeted something involving 'KK,' which appeared to set Kanye off but later admitted it was a misunderstanding as it was actually a reference to marijuana.\nAs Kanye took 'KK' to be a reference to his wife Kim Kardashian, he blasted Wiz for it, as well as accusing him of stealing his style from his rap protege Kid Cudi.\nKanye dated Amber for two years from 2008 to 2010.\nTheir relationship has been up for discussion as of late. In a leaked track from his upcoming seventh studio album, Kanye appears to blast his ex by suggesting she doesn't look as good as she used to.\nA snippet from the track features the lyrics: 'My ex said she gave me the best years of her life, I saw a recent picture of her, guess she was right.'\nWorking title: This all began on Tuesday night when Kanye announced he had changed his album title to Waves\nNot pleased: As currently incarcerated rapper Max B is credited with the Wave movement, Kanye paid his respects but Wiz still seemed skeptical\nInteresting initials: Wiz mentioned 'kk' and it seemed to set Kanye off as he thought it was a reference to his wife Kim Kardashian\nExplanation: Wiz did not respond very much during Kanye's epic rant but he did explain what 'KK' actually meant\nClarification: Kanye did admit that everything involving 'KK' was a misunderstanding and that it was actually a reference to marijuana\nMaking it personal: Kanye also took aim at Amber and Wiz's son, Sebastian, as he wrote 'you own waves ??? I own your child !!!'\nIt's fair to say the relationship did not end amicably with Amber previously branding Kim, the mother of Kanye's two children, a 'homewrecker'.\nKanye was bold about slamming his former girlfriend in 2015 when he said in an interview that he had to take '30 showers' after dating Amber.\nHe candidly confessed: 'If Kim had dated me when I wanted, there would be no Amber Rose.'\nThe rapper is said to have had his eye on Keeping Up With The Kardashians star Kim as early as 2008, naming her his 'girl of the week' in early blog posts which resurfaced in October 2014.\nHe added in the one-to-one: 'It's very hard for a woman to want to be with someone that's with Amber Rose. I had to take 30 showers before I got with Kim.'\nAmber and Wiz married in July 2013 but filed for divorce just over a year later in September 2014. They remain amicable.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422315/Kanye-West-returns-Twitter-responds-crude-Amber-Rose-tweet-sex-life.html"}
