{"authors":["Julia Emmanuele"],"date_download":"2018-10-31 01:43:13","date_modify":"2018-10-31 01:43:13","date_publish":"2018-09-14 16:00:08","description":"Over the past few weeks, Kanye West has made an effort to squash his beef with fellow rapper Drake, declaring that he intends to come see his Aubrey & The 3 Migos Tour and sending him \"good energy.\" But now, it seems West has a secret weapon in his…","filename":"data/vaneerConsumption/KanyeWestsVideoOfNorthWestSingingInMyFeelingsProvesHesReadyToEndHisFeudWithDrake.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/357006e7-fd1e-4b6b-894d-013ca920c5a1-getty-980333702.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_kanye-wests-video-of-north-west-singing-in-my-feelings-proves-hes-ready-to-end-his-feud-with-drake-11918258_1540950193.html","title":"Kanye West’s Video Of North West Singing “In My Feelings” Proves He’s Ready To End His Feud With Drake","title_page":"Kanye West’s Video Of North West Singing “In My Feelings” Proves He’s Ready To End His Feud With Drake","title_rss":"NULL","source_domain":"bustle.com","text":"Over the past few weeks, Kanye West has made an effort to squash his beef with fellow rapper Drake, declaring that he intends to come see his Aubrey & The 3 Migos Tour and sending him \"good energy.\" But now, it seems West has a secret weapon in his question to win over Drake: an incredibly adorable video of daughter North West singing \"In My Feelings.\"\nThe trendsetting five-year-old was captured singing Drake's hit song in the backseat of a car, in a super cute video that West posted on Instagram on Thursday. Though North doesn't treat viewers to her version of the #DoTheShiggy Challenge — she is strapped into a carseat, after all — she does belt out the song's now-iconic chorus with confidence, even putting her own twist on things by speeding up the words faster and faster as she goes.\nIt's easy to interpret West's decision to post a video of his daughter singing \"In My Feelings\" as an attempt by the rapper to settle his disagreements with Drake. The pair's feud kicked off in May, when West's friend (and G.O.O.D. Music president) Pusha T released a series of diss tracks, in which he claimed that Drake uses a ghostwriter and revealed that he had a son that he was \"hiding\" from the world. Though West didn't involve himself in the warring diss tracks, he was the sole producer of Pusha's album, Daytona. Some fans even speculated that West was even the one to reveal to Pusha that Drake had a child — something the rapper has adamantly denied.\nIn a series of tweets from early September, the Yeezy founder further denied that he had any involvement in Pusha's diss tracks, and apologized for the bad blood between Drake and himself, and even writing that he wanted to come see Drake's show. And, if his public statements weren't enough to squash his supposed beef with Drake, then this adorable video is sure to do the trick.\nDrake and Kanye feud aside, North's choice of car jam has another significance to the West family. In early September, Twitter user @tmorrison24 posited a theory that Drake and Kim had an affair, using the lyrics from \"In My Feelings\" to prove it. In their posts, they suggest that the \"KiKi\" who Drake references in the chorus is actually Kim, citing the fact that one of her known nicknames is KiKi, as well as the fact that the Wests and Drake live near each other in Hidden Hills, California. (Another track on Scorpion includes the line \"creeping down the block and making a right,\" in reference to Drake visiting the person he's seeing in secret.)\nHowever, Kim herself debunked the conspiracy shortly after it went viral on social media, commenting on a post on the Shade Room's Instagram about the alleged affair that it \"never happened. End of story.\" Furthermore, based on her own Instagram story, she also likely witnessed North's in-car performance.\nSome fans might have noticed that North appears to be wearing lipstick in the clip, and it turns out she's actually showing off a sneak peek at mom Kim Kardashian West's upcoming Classic Blossom Collection for KKW Beauty. As the reality star revealed in her own Instagram Story, she \"needed a bribe to get [North] out of the door ... you feel me?!?!?!\" (For the record, North is rocking shade #6 from the upcoming collection, and, as Kim made sure to add, \"it's coming off in a few mins.\")\nIt certainly seems as if West really is inspired by Drake's art, so much so that it's rubbed off on his eldest daughter. And this video of North singing \"In My Feelings\" suggests he's more than willing to leave all of their fighting in the past. Now, if only we can find out what Saint's favorite Drake song is.","url":"https://www.bustle.com/p/kanye-wests-video-of-north-west-singing-in-my-feelings-proves-hes-ready-to-end-his-feud-with-drake-11918258"}
