{"authors":["Caitlin O'Toole For Dailymail.Com"],"date_download":"2018-10-22 21:09:40","date_modify":"2018-10-22 21:09:40","date_publish":"2016-01-28 06:53:05","description":"Social media users following the rappers' Twitter fight were quick to jump on the bandwagon with funny memes and jokes. Kanye, 38, lashed out believing Wiz had dissed Kim Kardashian.","filename":"data/vaneerConsumption/KanyeWestsepicmeltdownatWizKhalifaandAmberRoseinspiresfunnymemes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/06/30A7363B00000578-0-image-a-45_1453963008305.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420409_Kanye-West-s-epic-social-media-meltdown-Wiz-Khalifa-Amber-Rose-inspires-hilarious-memes-jokes_1540242580.html","title":"Kanye West's epic meltdown at Wiz Khalifa and Amber Rose inspires funny memes","title_page":"Kanye West's epic meltdown at Wiz Khalifa and Amber Rose inspires funny memes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Twitter users had a field day with the Kanye West, Wiz Khalifa and Amber Rose social media feud.\nKanye, 38, went on an epic Twitter rant at Wiz, 28, on Wednesday after the rapper complained about Yeezy's new album title Waves and made a reference to KK - which Kanye took to be a diss at wife Kim Kardashian.\nThe rapper lashed out at Wiz's 'corny' music and took shots at ex-wife Amber Rose, who Kanye dated before Kim.\nScroll down for video\nCome at me bro: Kanye West's Twitter fight with Wiz Khalifa has inspired funny memes and tweets\nAnd social media users following the beef were quick to create funny memes about the Twitter spat, which was later revealed to be a big misunderstanding when Wiz explained KK was a reference to marijuana, not Kim.\nOne meme showed an angry Kanye wearing a black Yeezus jersey and standing over Wiz on the basketball court, with rappers Drake and Snoop Dog looking on.\nThe caption was pulled from one of Kanye's angry tweets: 'I am your OG & I will be respected as such.'\nOther Tweets referenced Kanye's admission that Wiz does have 'cool pants.'\nSee more of the latest on Kanye West's Twitter meltdown at Wiz Khalifa and Amber Rose\nEmotional: Kanye West smiled as he jetted out of LAX on Wednesday, after saying the episode had been a big misunderstanding\nDuring his rant, Kanye said he wished he were 'tall and skinny' like Wiz, and had even sent photos of Wiz's pants to his 'style team.' He also created the hashtag #Wizwearscoolpants, which Twitter users were quick to run with.\nOne image showed a Valentine's Day card of Kanye's smiling face hovering over pink hearts.\n'I screen grabbed those pants and sent it to my style team,' the Valentine read.\nTrue love: Kanye took time to praise Wiz's taste in pants, which inspired yet more Twitter gags\nSimple: Twitter users also shared a 'Don't Be Like Kanye' stick figure, in a twist on the popular Facebook trend\nSome corporate Twitter feeds also got in on the action, with Kit Kat weighing in on the KK debate and Kanye's complaint that the drama was distracting his 'creative process' ahead of his new album Waves.\n'Hey Kanye, know what else KK stands for?' the chocolate brand tweeted.\n'And sorry you had to take a break from your creative process - KK,' and added '#BestWrapperAlive' hashtag.\nAnd Comedy Central tweeted 'Don't Tell Kanye, but his favorite episode of South Park is on right now' and a picture of the infamous Kanye episode of animated show.\nStylish: The epic Twitter feud triggered jokes about Wiz's pants after Kanye created the hashtag #WizWearsCoolPants\nTake a break: Chocolate brand Kit Kat also got in on the KK action\nGood timing: Comedy Central also aired the Kanye South Park episode after the social media spat\nYeezus speaks: Social media users were quick to call Kanye's smack downs the 'ten commandments'\nA number of people also joked that Kanye's two-year-old daughter North West must have got ahold of his phone. Last year, North got into Kim's phone and posted an old bikini photo to Twitter.\nOther onlookers created silly GIFS, including one of Wiz bopping in his chair and eating takeaway as he stares at the computer screen, which read 'wiz sitting at home reading kanye's tweets like.'\nAnother GIF showed rappers Nicki Minaj and Meek Mill sitting court side at a basketball game, with Nicki smiling as she shows him her smartphone.\n'Look bae it's not me this time,' the caption read.\nConfused? Twitter had a field day with the rapper's fight and the #WizWearsCoolPants hashtag\nKanye has a point: Other social media users admitted Kanye was right about Wiz's fashion sense\nOn hold: Other Twitter users joked about Amber Rose's vulgar Tweet in reply to Kanye\nStaying out of it: One person said the drama was all too much for rapper Jay Z\nWait, what? The entire fight was later revealed to be a misunderstanding, with KK referring to weed and not Kanye's wife Kim Kardashian\nAnother user created a Kanye stick figure mimicking the Facebook trend 'Be Like' and tweaking it to 'Don't be like.'\n'This is Kanye. Kanye misunderstood a tweet. Kanye attacked Wiz. Kanye looked dumb. Kanye got dissed by ex. Don't be like Kanye,' it read.\nThere were also a few vulgar memes and drawings related to Amber Rose's sexually explicit tweet about Kanye.\nFan favorite: One person even framed Kanye's tweet calling Wiz out for not respecting him as 'OG'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420409/Kanye-West-s-epic-social-media-meltdown-Wiz-Khalifa-Amber-Rose-inspires-hilarious-memes-jokes.html"}
