{"authors":["Lily Waddell For Mailonline"],"date_download":"2018-10-22 21:20:00","date_modify":"2018-10-22 21:20:00","date_publish":"2017-04-26 01:39:13","description":"Kara Tointon showed off her glowing complexion when she went make-up free to Alice's Adventures Underground press night in London on Tuesday.","filename":"data/vaneerConsumption/KaraTointonreuniteswithMrSelfridgesKatherineKelly.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B3D4B00000578-0-image-a-27_1493164975894.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4445826_Kara-Tointon-reunites-Mr-Selfridge-s-Katherine-Kelly_1540243200.html","title":"Kara Tointon reunites with Mr Selfridge's Katherine Kelly","title_page":"Kara Tointon reunites with Mr Selfridge's Katherine Kelly | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kara Tointon showed off her glowing complexion when she went make-up free to Alice's Adventures Underground press night in London on Tuesday.\nThe 33-year-old former EastEnders actress looked stunning when she ditched her usual red carpet lipstick and eyeliner for the glitzy event.\nShe styled a striking floor length black gown, which showcased her petite frame.\nScroll down for video\nKara Tointon showed off her glowing complexion when she went make-up free to Alice's Adventures Underground press night in London on Tuesday\nSweeping her brunette locks into a messy bun, she put the focus on her make-up free features.\nThe soap queen dressed down her ensemble with a biker leather jacket, which was edged with white fur.\nShe accessorised with a small black bag and a retro watch, which didn't detract away from her simple attire.\nBefore and after: The 33-year-old former EastEnders actress looked stunning when she ditched her usual red carpet lipstick and eyeliner for the glitzy event\nDifferent look: The soap queen dressed down her ensemble with a biker leather jacket, which was edged with white fur\nKara joined Mr. Selfridge co-star Katherine Kelly, 37, at the event who pulled off a biker chick look with a chic leather jacket.\nShe completed her casual ensemble with a pair of loose trousers and a pair of trainers.\nThe former Coronation Street star added a splash of colour to her outfit with a flash of scarlet lipstick.\nHer bold make-up brought attention to the vibrant colours in her floral scarf, which was made up primarily of emerald green and fiery red flowers.\nChic! Kara joined Mr Selfridge co-star Katherine Kelly, 37, at the event who pulled off a biker look with a leather jacket\nAdd a splash of colour! The former Coronation Street star wore a brush of scarlet lipstick, which brought attention to the vibrant colours in her scarf\nPerfect finish: The former Coronation Street actress completed her casual ensemble with a pair of loose trousers and a pair of trainers\nOn trend as ever, the duo were closely followed by 2008 X Factor semi finalist Diana Vickers.\nThe 25-year-old also wore a chic leather jacket, teamed with skintight leggings which showed off her slender pins.\nShe pulled off a tousled look when she let her golden locks fall in a natural array around her face.\nBeauty! 2008 X Factor semi finalist Diana Vickers also wore a chic leather jacket, teamed with skintight leggings which showed off her slender pins\nThe TV personalities enjoyed each other's charming company as they celebrated the press night of the West End show.\nAlice's Adventures Underground has returned to London after a successful sell-out run in 2015.\nThe Olivier nominated performance takes theatre-goers to the Mad Hatters' tea party and puts you up against the fearsome Queen of Hearts.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4445826/Kara-Tointon-reunites-Mr-Selfridge-s-Katherine-Kelly.html"}
