{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 21:38:19","date_modify":"2018-10-22 21:38:19","date_publish":"2016-01-29 07:35:32","description":"On Thursday night’s First Look teaser show a worried Khloe can be seen with her hand over her mouth as dramatic piano music played.","filename":"data/vaneerConsumption/KardashiansrallyaroundafterLamarOdomsnearfataloverdose.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/08/30B05ADF00000578-0-image-a-84_1454054661741.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422281_Kardashians-rally-Odom-s-near-fatal-overdose-KUWTK-look-Khloe-reveals-loved-him_1540244299.html","title":"Kardashians rally around after Lamar Odom's near fatal overdose","title_page":"Kardashians rally around after Lamar Odom's near fatal overdose | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lamar Odom’s nearly fatal drugs overdose last year will be the focus of this week’s episode of Keeping Up With the Kardashians somber new clips show.\nOn Thursday night’s First Look teaser show a worried Khloe can be seen with her hand over her mouth as dramatic piano music played.\n‘Khloe has been spending every second with Lamar,’ Kourtney told the cameras as Khloe was shown sitting down on a couch next to sister Kim.\nScroll down for video\nTough time: The family's reaction to Lamar Odom's overdose will be shown on Sunday's episode of Keeping Up With The Kardashians\nTough times: He ex Lamar - pictured in LA back in November 2012 - was found unconscious at the Love Ranch brothel in Nevada four months ago\nThe show then flashed up the phrase ‘No matter what happens family is family’ on a black screen.\n‘I think hearing our voices and having family around might make a difference,’ Kris Jenner is heard saying off camera.\nIn other scenes from future episodes Khloe told the girls that Caitlyn could not be at Kris Jenner’s 60th birthday party as she would be in New York.\n‘Whatever the great Cait wants,’ Kim told Khloe and Kylie sarcastically.\nDistraught: The brief glimpse showed Khloe struggling to come to terms with the news\nStanding by her estranged husband: Kourtney shares that Khloe 'has been spending every second with Lamar'\nKhloe then revealed that Rob had once told their dad that her nickname in high school had been ‘Khloe Blowie.’\n‘That was not me that was another girl. I am the fat one who is going to want b**w jobs from the fat girl?’ she laughed.\n‘Being fat really saved me from being a w***e in life though you guys, being fat and then being married.\nKhloe then gave her sisters an insight into her relationship with Lamar.\n'I think hearing our voices and having family around might make a difference': Kris Jenner tries to provide some comfort\nRallying around: The whole family were by Lamar's hospital bedside after his near fatal overdose in October\n‘I respect Lamar because he liked me fat and I appreciate that,’ she said.\nKim asked Khloe if that had been Lamar’s ‘Hold over you this whole time.’\n‘That is a big deal when a cool person likes you at your worse,’ Khloe replied.\nKim and Khloe then sat down to discuss the Kardashian family birthdays.\n'That's a big deal': Khloe told Kim that she 'respects' Lamar because he loved her when she was curvier\n'Trooper': Kim, who was heavily pregnant admitted that she 'will give anything' North wants if it makes her go to bed\nKim said she was doing nothing for her birthday as she was feeling ‘very overwhelmed.’\n‘The veins on my boobs are driving me insane,’ Kim confided to Khloe.\n‘Every night I give North a bottle and she is like ‘milky mom’ and I’m like I will give you anything you want just go to bed.’\nKhloe told the cameras her sister was a ‘trooper’ and continued to push herself while pregnant.\nKris took part in a friend’s podcast and used the opportunity to talk about boyfriend Corey Gamble\nPregnancy woes: The 35-year-old also shared that 'the veins on my boobs are driving me insane'\nGiving back: Elsewhere, Kim and Khloe enlisted some party planners to help them throw a big soiree for Kris's 60th birthday\nShe was then asked if Corey spelt his name with a ‘K’ would the pair already be married.\n‘No. Corey and I have been seeing each other for about a year and it is really great but it is really different,’ she told the cameras.\n‘I am so used to being married. I just came out of a 23-year relationship I don’t really know how to be a girlfriend.’\nKris denied she was pregnant and told the host she was done with childbirth.\nDecisions, decisions: The pair said that their mother always throws them the best parties\nToo much: Kim drew the line at these houndstooth pillows, saying she wanted something 'tonal' instead\n‘I think six is fine for any human being. I am all good in that department,’ she laughed.\nThe sisters then sat down to plan the surprise birthday party with a creative director.\n‘We can’t do this half-ass, we need to either come correct or not at all. And we have no time to get this done,’ said Khloe recalling all the huge parties Kris had thrown for the family.\nCorey then took Kris to West Coast Customs with Khloe where he surprised her with a new all black paint job for her Range Rover.\nSurprise!: Meanwhile, Kris received a special gift from her toyboy Corey Gamble\nSwanky: Corey had the momager's Range Rover painted matte black, after telling her he needed to borrow it\nKhloe then urged her mother to give Corey more credit for the surprise after Kris first thanked the body shop for their work.\n‘I am not used to a guy surprising me with anything, then to do something so extravagant, I just sometimes don’t know how to take things like that,’ admitted Kris to the cameras.\nIn a future scene Kim talked about her health worries about her second pregnancy.\n'I am all good in that department': The reality star also said that six children is 'fine for any person' and that she doesn't want to have more\nFirm friends: Kris was appearing on her pal Heather McDonald's podcast\n’This pregnancy is way more scary to me because of the medical issues I had before,’ Kim says as she got scans done of baby Saint.\nAnd Corey Gamble discussed Kris Jenner’s health with her.\n‘There is one thing to be a workaholic and make all this success and all the business, but if your ass is not healthy then all this s**t is for zero,’ Corey told her firmly.\n‘But I can’t just stop,’ she told her boyfriend.\n'This pregnancy is way more scary to me': In a future scene Kim talked about her health worries about her second pregnancy","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422281/Kardashians-rally-Odom-s-near-fatal-overdose-KUWTK-look-Khloe-reveals-loved-him.html"}
