{"authors":[],"date_download":"2018-10-22 22:03:09","date_modify":"2018-10-22 22:03:09","date_publish":"2014-06-07 18:51:44","description":"Celebrated activist and civil rights lawyer Karen DeCrow, who led the National Organization for Women in the 1970s, died Friday at her home.","filename":"data/vaneerConsumption/KarenDeCrowFormerPresidentofNOWDiesfromMelanomaat76.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/494576/140607-now-decrow-mn-1515_88fd3b52b811ec36b2c15816f37334bf.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_karen-decrow-former-president-now-dies-melanoma-76-n125336_1540245789.html","title":"Karen DeCrow, Former President of NOW, Dies from Melanoma at 76","title_page":"Karen DeCrow, Former President of NOW, Dies from Melanoma at 76","title_rss":"NULL","source_domain":"nbcnews.com","text":"She targeted Ivy League schools to bring in more female students, social groups to open up their male-dominated membership rolls and asked NASA to include more women in the space program.\nMalamud, the president of NOW's Greater Syracuse chapter, called DeCrow \"a hero and a guide.\"\n\"Together, with a lot of other people, we helped to change history,\" Malamud said, stifling tears during a brief telephone interview. \"She was in the forefront of that.\"\nDeCrow was born Karen Lipschultz on Dec. 18, 1937. She grew up in Chicago, earned a degree in journalism from Northwestern University and attended a graduate journalism program and law school at Syracuse University. While a law student, she ran for mayor of Syracuse, the first mayoral campaign by a woman in the state.\nShe joined NOW in 1967, inspired by the pay inequality she saw in her own workplace — an issue that continues to simmer four decades later. She joined the organization's national board a year later and remained there until becoming president.\nDeCrow advocated state ratification of the Equal Rights Amendment, passed by Congress in 1972, throughout her tenure and lamented each time a state legislature voted against it. She called a North Carolina defeat in 1977 \"an absolute crisis\" and said a loss in Florida evoked the \"Old South.\"\n— The Associated Press","url":"https://www.nbcnews.com/news/us-news/karen-decrow-former-president-now-dies-melanoma-76-n125336"}
