{"authors":["Sarah Jones For Dailymail.Com"],"date_download":"2018-10-22 20:06:51","date_modify":"2018-10-22 20:06:51","date_publish":"2016-01-28 00:15:03","description":"The always fashionable supermodel added a feminine touch to her rocker look, which included a heavy leather biker jacket, when she stepped out in New York City.","filename":"data/vaneerConsumption/KarlieKlosswearsleathermotorcyclejacketasshestepsoutinNYC.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/22/30A4DAE400000578-0-image-a-8_1453934477536.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420041_Karlie-Kloss-goes-biker-chic-leather-motorcycle-jacket-steps-NYC_1540238811.html","title":"Karlie Kloss wears leather motorcycle jacket as she steps out in NYC","title_page":"Karlie Kloss wears leather motorcycle jacket as she steps out in NYC | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Karlie Kloss ditched her Victoria's Secret Angel image for something a bit edgier on Wednesday.\nThe always fashionable supermodel added a feminine touch to her rocker look, which included a heavy leather biker jacket, when she stepped out in New York City.\nThe 23-year-old donned a fitted leather motorcycle jacket with floral embellishments throughout and ruffled sides.\nScroll down for video\nBiker chic! Karlie Kloss, 23, traded her former Victoria Secret Angel image for a Hells Angel look while in New York City on Wednesday\nShe added to her edgy look in distressed black skinny jeans with ripped slits following all the way down her denims.\nL'Oreal Paris's latest spokesmodel covered her silky blonde tresses in a charcoal grey beanie with a beaded skull emblem on the front.\nKloss wore black and white Adidas sneakers and accessorized with a bright yellow designer handbag and red tinted sunglasses.\nPretty as a petal! The supermodel added a feminine touch to her leather motorcycle jacket with floral embellishments throughout and ruffled sides\nDistressed denims: The best friend of Taylor Swift added to her edgy look in black skinnies with ripped slits following all the way down her jeans\nThe best friend of Taylor Swift went makeup-free, showcasing her natural beauty and flawless complexion.\nKarlie appeared in good spirits as she was recently named the face of Topshop's spring line, which is the second campaign for the fashion company.\nShe previously worked for the British company eight years ago, which was also one of her first modelling jobs.\nFinishing touches: L'Oreal Paris's latest spokesmodel wore black and white Adidas sneakers and accessorized with a bright yellow designer handbag and red tinted sunglasses\nSuccessful supermodel: The some-time ballerina was recently named the face of Topshop's spring line, which is the second campaign for the fashion company\nLast week the some-time ballerina - who is one of the highest paid models in the world - shared her excitement as she came across a photo of herself on the company's billboard.\n'Seeing double today,' Karlie captioned the Instagram image, making a playful expression while posing next to the huge poster.\nIn addition to her busy modeling career, Karlie is also a student at New York University's Gallatin School of Individualized Study, as well as running her YouTube channel, called Klossy.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420041/Karlie-Kloss-goes-biker-chic-leather-motorcycle-jacket-steps-NYC.html"}
