{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 22:08:44","date_modify":"2018-10-30 22:08:44","date_publish":"2016-01-29 20:13:39","description":"Karl Marx’s The Communist Manifesto is ranked among the top three most frequently assigned texts at universities and colleges, and Marx is the most assigned economist in college courses. |","filename":"data/vaneerConsumption/KarlMarxsCommunistManifestoRankedAmongTopThreeAssignedCollegeTexts.json","image_url":"https://media.breitbart.com/media/2015/10/Karl-Marx-Grave-Public-Domain.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_29__1540937324.html","title":"Karl Marx’s ‘Communist Manifesto’ Ranked Among Top Three Assigned College Texts","title_page":"Karl Marx’s ‘Communist Manifesto’ Ranked Among Top Three Assigned College Texts | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Karl Marx’s The Communist Manifesto is ranked among the top three most frequently assigned texts at universities and colleges, and Marx is the most assigned economist in college courses.\nThe data comes from the Open Syllabus Project (OSP), which writes about its system of monitoring books and other materials assigned to college students:\nAt present, we have around 1.1 million syllabi, drawing predominantly from the past decade of teaching in the US. We think the total number of US, UK, Canadian, and Australian syllabi for the past 15 years is in the range of 80-100 million.\nThe beta version of OSP’s Syllabus Explorer is publicly available, and the project acknowledges it’s a work in progress, and welcomes the donations of syllabi to its cause from universities and departmental faculty.\nWriting at MarketWatch, managing editor Tom Bemis also reviewed the OSP Explorer and begins his column about it with the following trigger warning: “The following blog post includes the use of ironic tone which may be confusing or upsetting to people reading outside their safe zones.”\nBemis, who also observes that the Bible isn’t even on the list of texts, continues:\nIn case you had any doubts that America’s college campuses are dominated by Godless communists, fresh statistical evidence is at hand. More than 25 years after the fall of the Berlin Wall, the collapse of the Soviet Union and the onset of market economy practices in China, “The Communist Manifesto” still ranks among the top three most frequently assigned texts at American universities.\nThe OSP Explorer ranks each text according to a “count,” which is the number of times the text appears in course syllabi, and a teaching score – “a numerical indicator of the frequency with which a particular course is taught,” according to the site.\nMarx’s The Communist Manifesto is ranked third on the overall list of assigned texts, with a count of 3,189 and a teaching score of 99.7. William Strunk’s The Elements of Style is ranked first with a count of 3,934 and a teaching score of 100.0, while Plato’s Republic comes in second with a count of 3,573 and a teaching score of 99.9.\nWhen the OSP explorer is filtered by country, Marx’s work has an overall ranking of fourth in the United States, with a count of 2,244, 37th in the United Kingdom, with a count of 197, and sixth in Canada, with a count of 76. In Australia and New Zealand, the book receives a count of only 2 and is in the bottom ranks.\nIronically, when you filter the OSP explorer by field, Marx’s classic is not among the top texts in the field of Economics – where it ranks as 71st among the texts assigned. Among History texts, however, The Communist Manifesto ranks fourth, in the field of Sociology texts, it comes in third, and in Politics, it ranks eighth.\nRegarding the text’s placement in the field of Economics, Bemis adds:\n[A] search for “economics” shows Paul Krugman at the top of the list with his iconic “Economics,” which gets a count of 1,081 and score of 89.4. However, Gregory Mankiw’s “Macroeconomics,” doesn’t appear at all under the same search, even though it gets a count of 989 and a teaching score of 87.5. Karl Marx’s classic receives a count of 3,189 and a score of 99.7. It doesn’t actually show up under economics texts either, as it is generally taught along with philosophy texts such as “The Social Contract,” by Jean-Jacques Rousseau; “Leviathan,” by Thomas Hobbes; and “On Liberty,” by John Stuart Mill… Among other standouts, “Mein Kampf,” by Adolph Hitler, received a count of 697 and a score of 75.7. “What Is To Be Done,” by Vladimir Lenin received a count of 361 and a teaching score of 45.9.\nWhen the OSP explorer is filtered by state, The Communist Manifesto ranks first among texts assigned in New Jersey, Wisconsin, Indiana, New Hampshire, and Washington State; second in New York, Iowa, and Virginia; third in Massachusetts and Minnesota; fourth in California and Connecticut; seventh in Illinois; eighth in Georgia; 22nd in Tennessee; and 72nd in Texas.\nThe OSP explorer can also be filtered by institutions. For example, at Massachusetts Institute of Technology (MIT), Marx’s classic is ranked second among texts assigned, and fourth at University of California – Berkeley.","url":"https://www.breitbart.com/politics/2016/01/29/karl-marxs-communist-manifesto-ranked-among-top-three-assigned-college-texts/"}
