{"authors":["Stephanie Downs"],"date_download":"2018-10-31 01:45:55","date_modify":"2018-10-31 01:45:55","date_publish":"2018-08-27 19:54:12","description":"If you thought that Taylor Swift and Karlie Kloss were feuding, you may want to think again. The BFFs recently had a reunion that will definitely put any dramatic rumors to rest. Over the weekend, Karlie Kloss attended Taylor Swift's Nashville…","filename":"data/vaneerConsumption/KarlieKlossAttendedTaylorSwiftsNashvilleConcertProvingTheseTwoAreStillClosePHOTO.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/ca730f8b-c2cd-4fe6-89dc-90a57a898fb9-getty-459849930.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_karlie-kloss-attended-taylor-swifts-nashville-concert-proving-these-two-are-still-close-photo-10250880_1540950355.html","title":"Karlie Kloss Attended Taylor Swift's Nashville Concert, Proving These Two Are Still Close - PHOTO","title_page":"Karlie Kloss Attended Taylor Swift's Nashville Concert, Proving These Two Are Still Close — PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"If you thought that Taylor Swift and Karlie Kloss were feuding, you may want to think again. The BFFs recently had a reunion that will definitely put any dramatic rumors to rest. Over the weekend, Karlie Kloss attended Taylor Swift's Nashville concert, as People reported. To celebrate the occasion, the model even posted a truly sweet tribute to her superstar bestie.\nAccording to People, Kloss got her jam on during Swift's Reputation tour at the Nashville stop, an event that took place on Aug. 25. It's a major deal that she showed up to the concert, as it was also the first time in a year that they've been seen hanging out together publicly, per the Daily Mail. Interestingly enough, based on fan's tweets about the show, the model apparently supported her friend in the VIP area alongside Swift's other BFF, Abigail Anderson. If that isn't a major sign that all is well in with their friendship, nothing is.\nAdditionally, Kloss also took the time to write a lovely note of support to her friend on Instagram. Alongside a post-concert selfie, she wrote, \"No one puts on a show like @taylorswift,\" and continued, \"Nashville was out of this world, I am SO proud of you.\" So just in case anyone was wondering, you don't have to worry about the state of Swift and Kloss' friendship. Based on this Nashville outing, these two are as close as ever.\nWhy did some people think there was drama between them in the first place, though? Well, there are a couple of things that caused that speculation. According to People, some fans wondered whether Kloss was still a member of Swift's classic squad since her name was nowhere to be seen on a t-shirt the singer donned in the \"Look What You Made Me Do\" music video (released in August 2017), in which she reprised a character from her \"You Belong With Me\" vid.\nThere was also some speculation regarding their friendship after an interesting post from Kloss. In January, she originally captioned an Instagram vid, which highlighted her Love Magazine advent calendar appearance, with, \"Swish swish.\" Some people perceived that as a nod to Katy Perry, who has a song titled, \"Swish Swish.\" Of course, Perry has a well-known history of drama with Swift, so the caption raised some eyebrows. After the backlash, though, the model changed the caption to read, \"Nothing but net.\"\nWhile these moments led to worries about the end of their bond, Kloss clarified the state of their friendship herself in an interview with the New York Times in March. When asked about whether there was any feud with Swift, she told the publication, \"Don’t believe everything you read.\" In other words, don't worry about there being any drama between these BFFs.\nThe two have been besties since 2013 when they first met at the Victoria's Secret Fashion Show, in which Swift performed while Kloss took to the runway. And based on their recent Nashville hangout, it sure seems like their friendship is still going strong today.","url":"https://www.bustle.com/p/karlie-kloss-attended-taylor-swifts-nashville-concert-proving-these-two-are-still-close-photo-10250880"}
