{"authors":["Lucy Mae Beers","Sinead Maclaughlin For Daily Mail Australia"],"date_download":"2018-10-22 22:45:54","date_modify":"2018-10-22 22:45:54","date_publish":"2017-03-10 01:26:52","description":"Karl Stefanovic has slammed a report claiming stay-at-home mothers in Australia are 'draining the economy,' and asked 'what price can be put on caring for their kids'.","filename":"data/vaneerConsumption/KarlStefanovicslamsstudyonhousewivesdrainingeconomy.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1EC92F00000578-0-image-a-9_1489102328611.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299020_Karl-Stefanovic-slams-study-housewives-draining-economy_1540248354.html","title":"Karl Stefanovic slams study on housewives draining economy","title_page":"Karl Stefanovic slams study on housewives draining economy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Karl Stefanovic has slammed a report claiming stay-at-home mothers are 'draining the economy,' and asked 'what price can be put on caring for their kids'.\nFinance editor Ross Greenwood appeared on the Today Show on Friday to speak about the study and said mothers who stay at home are using a 'substantial amount of welfare'.\nAs the program cross back to Stefanovic, the father-of-three asked Mr Greenwood if he 'was serious,' saying women at home looking after their children was surely the most important place they should be.\nScroll down for video\nKarl Stefanovic (pictured) has slammed a report claiming stay-at-home mothers are 'draining the economy,' and asked 'what price can be put on caring for their kids'\nLast year, Stefanovic's wife Cassandra Thorburn wrote an open letter to stay-at-home mums, saying she does not consider herself in competition with working mothers\nMr Greenwood tried to respond to Stefanovic's questions and speak from an 'economic point of view'.\nBut he was immediately interrupted by the Today Show host.\n'What price do you put on them caring for their kids?' Stefanovic asked repeatedly.\n'Well of course it's a price, but the fact is they're being paid by taxpayers to do it through the welfare system, Karl,' Mr Greenwood said.\nEarlier on the program, Today Show newsreader Sylvia Jeffreys said the report made her 'cringe,' but feels it highlights a huge gap in the country in relation to paid parental leave.\n'At the moment, my sister works just to pay for her childcare,' Jeffreys said.\n'So where is the incentive for women to stay in the workforce and climb the ladder when they are doing it just to cover the cost of having kids in daycare'.\nLast year, Stefanovic's wife Cassandra Thorburn wrote an open letter to stay-at-home mums, saying she does not consider herself in competition with working mothers.\nFinance editor Ross Greenwood appeared on the Today Show on Friday to speak about the study and said mothers who stay at home are using a 'substantial amount of welfare'\nMs Thorburn, who separated from her husband in November after 21 years of marriage, wrote about the 'morning madness' at her home\nShe said when she decided to become a stay-at-home mother, her husband supported her 'wholeheartedly'\nMs Thorburn, who separated from her husband in November after 21 years of marriage, wrote in Popsugar about the 'morning madness' at her home.\n'I was a working mother for a long time before I made the decision that was right for my family — a decision supported wholeheartedly by my husband,' she wrote.\n'A decision I know I was fortunate enough to be able to make'.\nAccording to the study by the Organisation for Economic Co-operation and Development's (OECD), housewives are the country's 'greatest untapped potential,' The Daily Telegraph reported.\nBeing paid for work was also found to be an important factor for a woman's happiness, according to the employment study.\nSince the split with his wife, Stefanovic has been dating shoe designer Jasmine Yarbrough (pictured)\nWomen deciding to stay at home to look after their family is hurting Australia's economy, a study by OECD claims (stock image)\nBut Parenthood executive director Jo Briskey says some women are unable to go into full-time employment as they can't afford childcare.\nBut she added it's important women have the choice.\n'Women need flexible work arrangements and a supportive workplace that helps them meet their responsibilities at work and home,' she told the Daily Telegraph.\n'If they want to stay home it's an incredibly important job looking after kids — not just for the family but to build society.'\nThe employment study found women were better educated than their male counterparts with over half of 25-34 year olds with a degree, while only 43 per cent of men have one.\nResearch also showed around half of single mothers were in paid work, while 45 per cent of mother in a relationship worked part-time jobs.\nParenthood executive director Jo Briskey (pictured) says some women are unable to go into full-time employment as they can't afford childcare","url":"https://www.dailymail.co.uk/news/article-4299020/Karl-Stefanovic-slams-study-housewives-draining-economy.html"}
