{"authors":["Andrew Bullock For Mailonline"],"date_download":"2018-10-23 01:38:14","date_modify":"2018-10-23 01:38:14","date_publish":"2017-03-16 11:51:54","description":"Karolina Kurkova has been seen posing in a parking lot in a hot pink prom dress.","filename":"data/vaneerConsumption/KarolinaKurkovachannelsLadyGagainhotpinkpromdress.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E4F26F500000578-0-image-a-4_1489663985141.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319890_Karolina-Kurkova-channels-Lady-Gaga-hot-pink-prom-dress_1540258694.html","title":"Karolina Kurkova channels Lady Gaga in hot pink prom dress","title_page":"Karolina Kurkova channels Lady Gaga in hot pink prom dress | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been flaunting her quirky style in a series of elaborate shots for Harper's Bazaar in Miami this week.\nBut one bold outfit stood miles apart from the rest on Karolina Kurkova, as she posed in a parking lot in a hot pink prom dress.\nThe 33-year-old blonde model danced around in a voluminous cerise retro prom dress by some bins.\nScroll down for video\nReady for prom: Karolina Kurkova channeled Lady Gaga in a decadent hot pink prom dress for a Harper's Bazaar shoot... before suggestively eating a banana\nWearing her shades, she had on a choker necklace and allowed her golden locks to flow back in straight strands, her trademark fringe looking particularly striking.\nThe strapless number featured a big bow on the front an voluminous ruffled skirt.\nThe sunkissed beauty was a sight for sore eyes as she pouted her way through the session for Harper's Bazaar.\nIn the pink! The 5ft 11in beauty wore black sunglasses and a diamond choker\nNow, now! The model ate a banana in a slightly suggestive manner\nThe dress also featured a buckled belt at the waist, separating the figure-hugging torso from the ginormous skirt.\nIn other shots, she was seen in a one-sleeved glittery number, a black bow tie and a Moschino swimsuit and baseball cap combo.\nShe stood next to a vintage car with tousled hair and wearing Ray-Bans as the photographer snapped away.\nThe Czech model also heading indoors for another shoot, which saw her suggestively munching on a banana, wearing a metallic pink suit.\nHungry: The Czech model also heading indoors for another shoot, which saw her suggestively munching on a banana, wearing a metallic pink suit\nPotassim fix: The Czech model also heading indoors for another shoot, which saw her suggestively munching on a banana, wearing a metallic pink suit\nThe former Victoria's Secret Angel has appeared on the covers of Vogue and Vanity Fair, and has walked the runways for legacy fashion houses such as Chanel, Christian Dior, Yves Saint Laurent.\nBut growing up, the 5ft 11in knockout has said she struggled with body confidence.\n'People always used to look at me and point at me because I was very tall and very long,' she said in an interview with Popsugar.\n'I was different, so I wasn't very comfortable with the way I looked. So definitely through modeling and being in front of the camera and people, I got my confidence.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319890/Karolina-Kurkova-channels-Lady-Gaga-hot-pink-prom-dress.html"}
