{"authors":["Press Association Reporter"],"date_download":"2018-10-22 23:20:02","date_modify":"2018-10-22 23:20:02","date_publish":"2017-03-16 06:31:05","description":"Karolina Pliskova's superb 2017 continues as she booked a place in the semi-final of the BNP Paribas Open in Indian Wells by defeating Garbine Muguruza.","filename":"data/vaneerConsumption/KarolinaPliskovabeatsGarbineMuguruzaatIndianWells.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/06/3E51D79800000578-0-image-a-12_1489645663429.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-4319016_Karolina-Pliskova-beats-Garbine-Muguruza-Indian-Wells_1540250402.html","title":"Karolina Pliskova beats Garbine Muguruza at Indian Wells","title_page":"Karolina Pliskova beats Garbine Muguruza at Indian Wells | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Karolina Pliskova's superb 2017 continues as she booked a place in the semi-final of the BNP Paribas Open in Indian Wells.\nThe world No 3 beat Spaniard Garbine Muguruza 7-6 (7/2) 7-6 (7/5) to remain in the hunt for a third title of the year and a maiden 'Premier Mandatory' success.\nThere were six break of serves in the first set as both women struggled on their own delivery, only for Pliskova to dominate in the tiebreak.\nKarolina Pliskova defeated Garbine Muguruza to continue her fine form in 2017\nThe Czech struggled to hold her serve but held her nerve during the tie breaks in both sets\nShe earned successive breaks in the second set and twice served for the match but on both occasions Muguruza hit back to force another tiebreak.\nPliskova again regrouped and finally won it on her third match point when the Spaniard sent down a double fault.\nPliskova said on BT Sport 1: 'In the end it was a little bit tricky, I was up 5-2 and she started playing more aggressively than me, so it was tough to close it but she gave me the last point, so I am happy.\nMuguruza showed resilience to consistently break back but ultimately did not have enough\n'I started both sets well and was hitting the ball well from the baseline but she improved and I struggled on my serve. I am just happy to get through.'\nThe Czech will meet Svetlana Kuznetsova in the last four after she won an all-Russian affair against Anastasia Pavlyuchenko.\nKuznetsova won 6-3 6-2 to reach the last four at Indian Wells for the first time since 2008, where she went on to reach the final for a second successive year.\nCaroline Wozniacki and Kristina Mladenovic and Venus Williams and Elina Vesnina battle it out in the remaining quarter-finals on Thursday.","url":"https://www.dailymail.co.uk/sport/tennis/article-4319016/Karolina-Pliskova-beats-Garbine-Muguruza-Indian-Wells.html"}
