{"authors":[],"date_download":"2018-10-22 20:34:42","date_modify":"2018-10-22 20:34:42","date_publish":"2014-06-02 10:02:55","description":"Statement released by the Afghan government calls the deal to Sgt. Bowe Bergdahl a \"violation of previous agreements.\"","filename":"data/vaneerConsumption/KarzaiSoldierReleaseSwapDealViolatesUSAfghanAgreement.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/480751/140602-afghanistan-karzai-6a_e9ac75fe10b9d3a8fdabf68e099fbfbc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_bowe-bergdahl-released_karzai-soldier-release-swap-deal-violates-u-s--afghan-n120061_1540240482.html","title":"Karzai: Soldier Release Swap Deal Violates U.S.-Afghan Agreement","title_page":"Karzai: Soldier Release Swap Deal Violates U.S.-Afghan Agreement","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nKABUL, Afghanistan - President Hamid Karzai condemned the swap deal that freed captive Sgt. Bowe Bergdahl in exchange for five senior members of the Taliban, arguing that it broke international law and violated existing deals with Afghanistan's government.\n“Recently five Afghan citizens were transferred to Qatar in exchange for the release of U.S. Army Sgt. Bowe Bergdahl in violation of previous agreements with the government of Afghanistan,” the foreign ministry said in a statement issued Sunday night.\nKarzai’s has often accused the United States of acting unilaterally and not consulting it before acting on Afghan soil. The White House did not give Congress forewarning of the swap.\nThe statement underlined just how bad the relationship between Karzai and his longtime backers, the United States, has become, and went on to say that the five militants should not have any restrictions placed on them while in Qatar. The Gulf country helped broker the swap and has agreed to house the militants and their families for at least a year.\n“If the government of the United States have transferred these Afghan citizens to Qatar to limit their freedom and imprison them, then this is a clear violation of international law,\" the statement added. “If this is the case, the government of Afghanistan protests this in the strongest terms and calls on the governments of the U.S. and Qatar to respect international norms and laws and … set them free as soon as possible.\"\nThe Qatari role in the deal earned the praise of the Afghan Taliban’s longtime leader, Mullah Omar, who thanked them for their “tireless efforts.”\nA senior U.S. administration official has told NBC News the five detainees, who had been held in Guantanamo Bay, were in the custody of Qatari authorities and \"will be subject to restrictions on their movement and activities.”","url":"https://www.nbcnews.com/storyline/bowe-bergdahl-released/karzai-soldier-release-swap-deal-violates-u-s--afghan-n120061"}
