{"authors":["Caroline Mcguire For Mailonline"],"date_download":"2018-10-22 21:36:49","date_modify":"2018-10-22 21:36:49","date_publish":"2016-01-28 08:17:38","description":"Indian photographer Sankar Sridhar spent two years with nomadic Bakarwal tribes. They travel every year from Jammu's Himalayan mountains to meadows in Kashmir to graze cattle.","filename":"data/vaneerConsumption/Kashmirshepherdswhostillkeeptheirancienttribaltraditionsalive.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/08/30A7D7D200000578-0-image-a-6_1453969856957.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3418937_Last-nomads-road-Kashmir-shepherds-ancient-tribal-traditions-alive_1540244209.html","title":"Kashmir shepherds who still keep their ancient tribal traditions alive","title_page":"Kashmir shepherds who still keep their ancient tribal traditions alive | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A series of breathtaking photos by the Indian photographer Sankar Sridhar have provided a rare insight into the lives of the nomadic Bakarwal tribes of Kashmir.\nThe herder families, which number around 100,000 men, women and children, travel between the Jammu's Himalayan mountains and the meadows of Kashmir every year with their flocks of cattle, horses, goats and sheep.\nEvery year, just as the winter snows begin to melt in April, the community begins their journey with their livestock back to the alpine pastures for grazing during the summer, before returning in September as the weather worsens.\nScroll down for video.\nTwo children travel with the nomadic Bakarwal tribes of Kashmir in the Himalayan mountains. Rations, utensils and children too young to walk long distances are carried on horseback, while live and fragile cargo - like hens - make the journey in the nomads' arms. This makes sure they weather the journey well and remain in a condition to lay eggs during the Bakarwals' stay away from civilisation\nThe difficult journey takes more than three weeks, but in recent years, it has become much tougher because of modern changes in the area.\nThe tribe's traditional route between Kashmir and the mountains has become crisscrossed with many busy roads that disturb the animals and the journey is made even more treacherous by the risk of landslides from the practice of blasting of mountains by mining companies to extract minerals.\nWhen they return to Kashmir during the summer months, they also have problems finding pastures to graze on as many are used for tourism and the tribes have the added problem of being a magnet for crime, with many of their animals being poisoned or going missing.\nThe difficulties of surviving alongside modern life has meant that many members of the tribe have now given up nomadic farming and have taken on jobs in more stable industries like construction.\nThe first signs of spring appear as tufts of grass on mountainsides, but snow on the valley floor means the sheep have slender pickings while on the move. The Bakarwal begin their day early to take advantage of lower temperatures, which allow them to walk longer distances without tiring. On snowy stretches, a lot of thought is put into how much to walk, how much rest to give to the sheep, so they don't grow weak from hunger, or worse, die\nWomen and children lead the Bakarwal migration, with the women entrusted with guiding the pack animals, and setting up camp before the men arrive with the sheep. Here, as the family sets up camp, their horse rubs off the fatigue brought about by carrying 11 stone of goods by giving itself a much-deserved back rub\nA Bakarwal family in one of the stone dwellings they have built in valleys where they spend weeks together\nThe photographer Sankar Sridhar, from Calcutta, started to photograph the Bakarwal tribes two years ago having spent a total of 15 years with the nomads.\nHe told MailOnline: 'Documenting the Bakarwals is part of a personal long-term project to document the many nomadic and semi-nomadic communities across India, that I began 15 years ago as an excuse to travel beyond what then were tourist circuits.'\nSridhar revealed that one of the most awe-inspiring things about the tribes is the way they have learned to weather their surroundings.\nHe said: 'As with all nomadic communities, the lifestyle of the Bakarwal shuttles between intense movement and utter stillness -- it is like being privy to completely different ways of living.\n'Much about them is fascinating -- from their woolen shawls that is woven in a manner to make it almost water proof, to their knowledge of the mountains and the many herbs that grow, they are a repository of knowledge on the environment they inhabit.\n'The Bakarwals, like all other communities of pastoral nomads, share a close relationship with the mountains.'\nLush meadows signal a pause in the migration, where the tribes can stay for as long as two full months. Every family of shepherds has grazing rights only on certain meadows. The droppings of the sheep provide great manure for the soil. it is also collected by the Bakarwal, dried, and used as fuel when they are above the tree line\nPortrait of a Bakarwal elder, with a beard dyed flaming red by henna, left, and one of the children of the tribe\nAs roads plough deeper into the mountains, the Bakarwals' run-ins with vehicular traffic keeps increasing. Neither heavy vehicles nor cars carrying tourists are willing to suffer delays on account of sheep. This community suffers the maximum losses to their livestock on such stretches\nWrangling horses is one of the first lesson Bakarwal boys are taught by their elders\nHe continued: 'They are almost one with nature, although some of that is changing among the younger lot, and their migratory ways have ensured that the line between needs and wants are never blurred.\n'They possess a respect for nature that we would do well to learn.'\nBut Sridhar is keen to point out that while they have benefited from certain aspects of modern society, it is also a huge threat to the nomadic Bakarwal way of life.\nHe said: 'It is a double edged-sword. They have as much a right to education, medical care, and an easier life as everyone else.\n'But their brush with tourists, mobile cameras and all the trappings of \"development\", are making many of their youth abandon their ways to take up menial jobs in smaller towns and cities.\n'For the elders, it means there are lesser people to pass on their knowledge.\n'The Bakarwals' contact with society has become sinister in other ways too. Today, they carry their rations from shops in plastic bags, and many of their campsites are gradually turning into a graveyard for polythene.'\nThe sheep's thick winter coat gets trimmed in summer. Not unlike hairdressers, there are specialist shearers in the Bakarwal community who offer their services for a price. A master shearer can go through as many as 40 sheep in a day. The wool sells at about Rs 60 (60p) for every 2.2lbs.\nTwo Bakarwals watch as a storm bears down on their camp high up in the Himalayan mountains\nRain or shine, sheep always come first for the Bakarwal. Even as the rain approaches, the Bakarwal go through their routine of counting the sheep that have returned from grazing","url":"https://www.dailymail.co.uk/travel/travel_news/article-3418937/Last-nomads-road-Kashmir-shepherds-ancient-tribal-traditions-alive.html"}
