{"authors":["Unity Blott For Mailonline"],"date_download":"2018-10-22 21:31:06","date_modify":"2018-10-22 21:31:06","date_publish":"2016-01-28 07:50:41","description":"Naomi Campbell, Kate Moss and Lara Stone joined forces with five other supermodels to pose as the seven deadly sins in a short film celebrating the 25-year career of fashion's Edward Enninful.","filename":"data/vaneerConsumption/KateMossandNaomiCampbellplaythesevendeadlysinsinnewcampaign.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/14/30A1B7CB00000578-0-image-a-112_1453906727478.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3419124_Supermodels-play-seven-deadly-sins-sizzling-new-photos_1540243866.html","title":"Kate Moss and Naomi Campbell play the seven deadly sins in new campaign","title_page":"Kate Moss and Naomi Campbell play the seven deadly sins in new campaign | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Between them they represent the cream of the fashion industry, boasting ad campaigns for the likes of Burberry, Versace and Louis Vuitton.\nBut if you needed further proof that they are a force to be reckoned with, supermodels including Naomi Campbell, Kate Moss and Lara Stone have joined forces for a sizzling short film celebrating the career of one of Britain's fashion greats.\nIn a new campaign produced by Beats By Dre headphones, the beauties have dressed up to embody the seven deadly sins - with Moss depicting lust.\nScroll down for video\nKate Moss reclines in a scarlet throne posing as 'lust' in a short film created in honour of fashion giant Edward Enniful. The full version of the film will premiere on a billboard in New York's Times Square on 29 January\nKarlie Kloss poses in a golden gown and bangles as 'greed' in the 10-second clip produced by Nick Knight\nKarlie Kloss, Jourdan Dunn and fellow models Karen Elson, Mariacarla Boscono and Anna Ewers are also in on the act posing as the seven deadly sins: pride, greed, envy, gluttony, wrath and sloth.\nThe short clip, which lasts just 10 seconds, was produced by renowned British fashion photographer Nick Knight to celebrate the career of fashion tsar Edward Enninful who is celebrating 25 years in the industry this year.\nHis career includes stints i-D magazine, W magazine, Vogue Italia and Vogue US where he worked alongside editor-in-chief Anna Wintour.\nEdward has been teasing his 350,000 Instagram followers with short gifs taken from the video. He wrote: 'Seven sins, seven colors, seven sounds and eight muses (gluttony required two).'\nThe models pose as the seven deadly sins - pride, greed, lust, envy, gluttony, wrath and sloth - in the video\nAnna Ewers, left, and Lara Stone, right, both pose in a sea of pink as they take the part of 'gluttony'\nIt sees the seven deadly sins reimagined as supermodels in a variety of sultry poses, each dressed decadent costumes.\nWhile Kate Moss poses in a red encrusted jacket with a red wig and, what looks like a red crustacean resting on her groin, as lust, Naomi Campbell plays the part of pride, dressed in a sweeping Yohji Yamamoto gown.\nKarlie Kloss is wrapped in gold to play greed, Jourdan Dunn has long green hair to embody envy, and Lara Stone and Anna Ewers languish in a sea of pink to play gluttony.\nItalian beauty Mariacarla Boscono represents sloth, with Karen Elson as wrath. Each model is set against a different colour backdrop with a different piece of short music, as chosen by Beats By Dre.\nEdward Edinfull (pictured with Naomi Campbell, left and Kate Moss, right) is celebrating 25 years in fashion\nSupermodel Naomi Campbell poses in a sweeping black gown by Yohji Yamamoto as she plays 'pride'\nWhile Kate, 42, reclines on a throne wearing lacy scarlet lingerie, stockings and a matching wig, Karlie stuns as greed in a golden dress and bangles.\nLara Stone and Anna Ewers both pose against in a sea of candyfloss pink as gluttony, while Naomi Jourdann Dunn makes a fleeting appearance as envy.\nFlame-haired Karen Elson wears a flowing yellow gown as wrath, while Mariacarla Boscono dons a dark blue wig and gown as sloth.\nJourdan Dunn is green with envy, left, while fellow model Karen Elson dons a yellow gown as she plays 'wrath'\nMariacarla Boscono dons a dark blue wig and gown as sloth. The short film will be screened on a giant billboard in Times Square on 29 January, before being rolled out globally online ShowStudio.com on 13 February\nEdward told the Telegraph: 'I’ve known Kate [Moss] since I was 16 and she was 14. ‘I’ve known Naomi [Campbell], my gosh, forever. She’s like a sister to me. All the others I’ve seen since they started.’\nHe added: 'Straight away Kate said, “I’m lust.” She claimed it.'\nWhile fans have been granted only sneak previews in gif form, producers are planning a premiere of epic proportions, debuting the short film on a giant billboard in Times Square on 29 January.","url":"https://www.dailymail.co.uk/femail/article-3419124/Supermodels-play-seven-deadly-sins-sizzling-new-photos.html"}
