{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 00:16:02","date_modify":"2018-10-23 00:16:02","date_publish":"2017-03-16 09:19:11","description":"Passing on her incredible TV legacy to children has never been a desire of Springwatch star Kate Humble, 48, who says that she knew at the age of 14 that parenthood wasn't for her.","filename":"data/vaneerConsumption/KateHumbleknewshedidntwantchildrenat14.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E5379B900000578-0-image-a-27_1489660807789.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319226_Kate-Humble-knew-didn-t-want-children-14_1540253762.html","title":"Kate Humble knew she didn't want children at 14","title_page":"Kate Humble knew she didn't want children at 14 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's enjoyed almost three decades as a high-flying wildlife and science presenter.\nBut passing on her legacy to children has never been a desire of Springwatch star Kate Humble, 48, who says that she knew at 14 that parenthood wasn't for her.\nSpeaking to The Mirror this week, the TV presenter explained that she was lacking a maternal gene and insists it has 'never been an issue' for her, or her husband.\nScroll down for video\nHappy families: Kate Humble has revealed that she knew at the age of 14 that she did not want children\nShe explained: 'I know that motherhood was not for me and literally it bypassed me. I don't think I had even started my periods and I knew it wasn't something I wanted to do.\n'It was as fundamental as somebody saying, 'I knew I was gay when I was a young teenager' or 'I knew I was transgender.' Not being a mum has never been an issue for me.'\nKate previously said that her partner, British TV producer Ludo Graham, shared her family ideals and instead, they share Welsh sheepdog Teg and a farm of smallholding animals.\nCaring: While Kate doesn't believe she has a maternal instinct, she has been exploring a human bond with dogs (here with her own Sheepdog Teg)\nHappy families: Kate (left, with husband Ludo Graham) considers herself lucky to have a partner who feels the same way\nShe continued: 'I never thought I would be married but I have been married 25 years this year. But it's only because I go away a lot.'\nKate previously told The Express: 'My maternal gene is missing. If I had wanted them I would have tried to have them but I didn't. It was just the right decision for me.\n'I find it extraordinary in this day and age that people need to question it and you feel you have to justify it.'\nKate was also the face of Springwatch until 2012, when she was replaced by Michaela Strachen.\nShe held the post, which also included Winterwatch and Autumnwatch, for seven years, focusing on British wildlife.\nPassionate: The star has said that she is lacking the 'maternal gene'\nTravelling: Kate (here in 2015 for programme Kate Humble: Living with Nomads) said that she couldn't believe she'd been married for 25 years - but 'it's only because I go away a lot'\nBut her commitments to one-off programmes like Kate Humble: Into the Volcano and The Secret Life of the Sun have taken her around the globe.\nIn March, Kate's new programme Back To The Land - a series about the UK's most inspirational rural entrepreneurs - was viewed by two million people.\nKate and Ludo settled in South Wales in 2010 when they bought a farm in Wye Valley.\nSuccessful career: Kate (here in 2005) has enjoyed almost three decades of successful TV work\nNo time to stop: The TV presenter said that her decision to bypass motherhood was as fundamental as knowing someone was gay\nThe pair have created a business out of the working farm, previously holding festivals including Big Day Out and hosting visits from His Royal Highness The Prince of Wales and The Duchess of Cornwall.\nIn 2016, Kate released a book about the special relationship between humans and dogs, called Friend For Life.\nAs a life-long animal lover, Kate includes tales of rescue dogs, guide dogs, service dogs and medical dogs.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319226/Kate-Humble-knew-didn-t-want-children-14.html"}
