{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:12:57","date_modify":"2018-10-22 23:12:57","date_publish":"2017-03-16 06:03:24","description":"Lily, 18, also wore black leggings with a gray hoodie and black slides and carried a cell phone in one hand.","filename":"data/vaneerConsumption/KateBeckinsalestepsoutwithdaughterLily18.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E521DDF00000578-0-image-a-45_1489643686939.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318988_Kate-Beckinsale-steps-daughter-Lily-18_1540249977.html","title":"Kate Beckinsale steps out with daughter Lily, 18","title_page":"Kate Beckinsale steps out with daughter Lily, 18 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kate Beckinsale put her leggy figure on display on Wednesday as she ran errands in Beverly Hills.\nThe British beauty, 43, rocked skintight leggings tucked into black boots paired with a baggy gray tank top for her outing.\nHer long brunette hair flowed loose and she covered up with a pair of large sunglasses.\nEnglish beauty: Kate Beckinsale, 43, put her leggy figure on display as she stepped out in skintight leggings tucked into boots and a tank top in Beverly Hills on Wednesday\nKate carried a backpack over her shoulders and a cell phone in one hand as she strolled through a parking lot.\nShe was accompanied by her daughter Lily, from her relationship with actor Michael Sheen.\nLily, 18, who shares her famous mother's coloring wore her own long brown hair tied up into a ponytail.\nShe, too, wore black leggings with a gray hoodie and black slides and carried a cell phone in one hand.\nJoined her mom: Also on the outing was Kate's lookalike daughter Lily Sheen, 18, whore wore her long brown hair up in a ponytail and wore leggings, a hoodie and slides\nOn January 31, Kate had shown her pride in her only child by celebrating Lily's 18th birthday by posting a flashback photo to her Instagram\nThe heartwarming snap showed Lily as a toddler, clomping around in her mother's massive shoes.\nThe Underworld star wrote: '18 and now you're in the big girl shoes for real. I love you so much @lily_beckinsale.'\n'Nothing has been better in my life than being your mama. Happy happy happy birthday to my favourite, funniest best person in the world.\n'Ps we will obviously get you better shoes those are hideous I don't know what I was thinking.'\nProud mother: Back in January, the Underworld star had celebrated her only's child's 18th birthday with this cute throwback snap of Lily as a toddler","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318988/Kate-Beckinsale-steps-daughter-Lily-18.html"}
