{"authors":["Andrew Bullock For Mailonline"],"date_download":"2018-10-23 04:45:14","date_modify":"2018-10-23 04:45:14","date_publish":"2017-03-16 15:58:36","description":"Kate Moss looked all business as she was snapped leaving her London home in a conservative jumpsuit.","filename":"data/vaneerConsumption/KateMossleavesLondonhomewithphotoofhersinging.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E5558DE00000578-0-image-a-73_1489679068651.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320792_Kate-Moss-leaves-home-framed-photo-singing_1540269914.html","title":"Kate Moss leaves London home with photo of her singing","title_page":"Kate Moss leaves London home with photo of her singing | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was out on the town on Wednesday night, channeling Chinese-style chic.\nBut on Thursday morning, Kate Moss looked all business as she was snapped leaving her London home in a conservative jumpsuit.\nThe black ensemble was adorned with a print of simple white/gold squares, which were splashed across the whole outfit.\nScroll down for video\nIn the frame: Kate Moss leaves her London home in a stylish print suit... as her driver carries an encased black and white photograph of her singing\nCareer change? The model, 43, followed her driver out of the property, who was carrying a framed black and white print of Kate, seemingly singing at a microphone\nThe model, 43, followed her driver out of the property, who was carrying a framed black and white print of Kate, seemingly singing at a microphone.\nThe driver strolled ahead of her to the car, where he loaded the picture, as Kate followed, sunglasses on, blonde hair tied back.\nShe carried a black purse over her shoulder and allowed a slight smirk to creep across her lips as she strutted to the car, followed by another woman.\nBusinesswoman chic: Kate Moss looked all business as she was snapped leaving her London home in a conservative jumpsuit\nColour block: The black ensemble was adorned with a print of simple white/gold squares, which were splashed across the whole outfit\nThe look was completed with a pair of gold hooped earrings and she wore heeled boots to head across the gravel to the car, where her driver held the door open for her to get inside, followed swiftly by the female companion.\nThe British supermodel recently pulled out of her trip to India as speculation mounts that the late George Michael's funeral will be taking place this week.\nIt was less smirking and more grinning when Kate was spotted heading into China Tang restaurant in Mayfair on Wednesday night.\nLadies first: The look was competed with a pair of gold hooped earrings and she wore heeled boots to head across the gravel to the car, where her driver held the door open for her to get inside\nLady friend: She carried a black purse over her shoulder and allowed a slight smirk to creep across her lips as she strutted to the car, followed by another woman\nThe supermodel looked sensational in head-to-toe black as she sported an oriental-inspired top with red piping paired with black trousers paired with a perfectly tailored black blazer.\nKate has long been known for her sartorial prowess throughout her near 30 year career in showbiz having brought out an array of her own collections with Topshop atop modelling for some of the world's top fashion houses.\nSheer delight: Kate Moss proves the party never stops as she flashed a Hollywood grin while heading into China Tang restaurant in Mayfair on Wednesday night\nThe stunning star illustrated her flawless style as she slipped into the high-necked black shirt with red piping and a crossover neck - which gave a hint of a lace camisole from beneath.\nWhile the top was dainty and oriental-themed she added a tough edge with the addition of a sharp suit with an androgynous feel.\nThe blazer was perfectly tailored to her slender frame to nip in at her slender waist and highlight her famously flawless frame.\nStunning: The 43-year-old supermodel looked sensational in head-to-toe black as she sported an oriental-inspired top with red piping paired with black trousers paired with a perfectly tailored black blazer\nStyling: Kate has long been known for her sartorial prowess throughout her near 30 year career in showbiz having brought out an array of her own collections with Topshop atop modelling for some of the world's top fashion houses\nStrutting her stuff: The stunning star illustrated her flawless style as she slipped into the high-necked black shirt with red piping and a crossover neck\nKate wore voluminous trousers which slightly drowned her slender legs although she pulled off the look with aplomb.\nHer blonde tresses were worn in mussed waves which a section pinned at the front while her make-up was minimal yet striking to show her ageless complexion.\nShe boosted her height with a pair of round toed heels which perfectly coordinated with her chic black clutch bag.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320792/Kate-Moss-leaves-home-framed-photo-singing.html"}
