{"authors":["Rebecca Davison For Mailonline"],"date_download":"2018-10-23 04:35:40","date_modify":"2018-10-23 04:35:40","date_publish":"2016-01-11 17:45:24","description":"Supermodel Kate Moss paid tribute to her close friend David Bowie on Monday following his death from cancer aged 69.","filename":"data/vaneerConsumption/KateMosspaystributetoDavidBowieinTshirtemblazonedwithhisface.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300D944400000578-0-image-a-49_1452535850003.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394305_Kate-Moss-pays-tribute-friend-David-Bowie-steps-wearing-T-shirt-emblazoned-face-purple-platforms-following-shock-death_1540269340.html","title":"Kate Moss pays tribute to David Bowie in T-shirt emblazoned with his face","title_page":"Kate Moss pays tribute to David Bowie in T-shirt emblazoned with his face | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Supermodel Kate Moss paid tribute to her close friend David Bowie on Monday following his death from cancer aged 69.\nThe 41-year-old was pictured walking in London with a friend as she wore a T-shirt with a black and white image of his face on the front of it.\nShe kept the rest of her outfit black as a sign of respect, wearing high-shine trousers and an oversized fluffy coat.\nScroll down for video\nSad day: Supermodel Kate Moss paid tribute to her close friend David Bowie on Monday following his death from cancer aged 69, wearing a T-shirt emblazoned across the front\nTragic: The singer was close to Kate - he passed away on Monday following a secret 18-month-battle with cancer\nAnd in a further nod to the iconic singer, she wore a pair of purple metallic platform boots similar to those he once wore.\nKate covered up with a large hat and looked understandably upset as she made her way out, while her friend followed suit and wore a Sound And Vision top.\nShe famously accepted Bowie's BRIT award for Best Male Solo artist wearing singer's Ziggy Stardust playsuit in February 2014.\nSee more of the latest news on David Bowie following his untimely death\nShe looks lovely: She kept the rest of her outfit black as a sign of respect, wearing high-shine trousers and an oversized fluffy coat\nGood company: Kate covered up with a large hat and looked understandably upset as she made her way out, while her friend followed suit and wore a Sound And Vision top\nSupportive: She famously accepted Bowie's BRIT award for Best Male Solo artist wearing singer's Ziggy Stardust playsuit in February 2014\nThe catwalk star was on hand for the ceremony because David Bowie, 67, stayed at home in New York.\nHe originally donned the leotard-style garment while appearing at London's Rainbow Theatre in Finsbury Park on August 19, 1972.\nThe costume, called 'Woodland Creatures' but popularly known as his 'rabbit costume' was designed by Kansai Yamamoto.\nModel from Venus: Supermodel Kate Moss wore vintage Bowie at the Brits - as she wore one of the iconic singer's Ziggy Stardust outfits to collect a prize on his behalf at the Brit Awards in London\nHere's one he wore earlier: Kate Moss took to the stage in David Bowie's iconic playsuit worn at Ziggy Stardust's final appearance in 1972\nNoel Gallagher announced Bowie - who made a comeback after a ten-year absence - had taken the prize on the night in his own unique style.\nThe ex-Oasis star said: 'You maniacs didn't think David Bowie was actually going to be here? David Bowie's too cool for that - he doesn't do this s***.\n'David Bowie has sent his representative on earth. The one and only Kate Moss is going to receive this award on his behalf.'\nShe's got it! Kate looked effortlessly stylish as she let her clothes do the talking\nStrong: She kept a brave face on as she enjoyed a walk in her fluffy oversized jacket\nSolidarity: Kate joins Bowie's fans around the world in her grief following his death","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394305/Kate-Moss-pays-tribute-friend-David-Bowie-steps-wearing-T-shirt-emblazoned-face-purple-platforms-following-shock-death.html"}
