{"authors":["Megan Pustetto For Daily Mail Australia"],"date_download":"2018-10-22 23:21:37","date_modify":"2018-10-22 23:21:37","date_publish":"2016-01-11 05:28:03","description":"The 32-year-old fashion blogger showed off her very slender frame in a black bikini and matching singlet top as she enjoyed a day at Sydney's Balmoral Beach with her family on Sunday.","filename":"data/vaneerConsumption/KateWaterhouseshowsoffherslenderframeinablackbikini.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/3004A49900000578-0-image-a-35_1452486717184.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393308_Kate-Waterhouse-shows-slender-frame-black-bikini-matching-singlet-relaxing-day-family-beach_1540250497.html","title":"Kate Waterhouse shows off her slender frame in a black bikini","title_page":"Kate Waterhouse shows off her slender frame in a black bikini | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She recently braved the cold climes, spending two weeks in the Swiss Alps with her family to ring in the New Year and celebrate a 'White' Christmas.\nSo it's hardly surprising that Kate Waterhouse was eager to hit the beach to soak up some much needed rays on her return to Australia.\nThe 32-year-old fashion blogger showed off her very slender frame in a black bikini and matching singlet top as she enjoyed a day at Sydney's Balmoral Beach with her family on Sunday.\nScroll down for video\nBeach day: Make-up free Kate Waterhouse showed off her slimline frame in a black bikini and matching singlet top as she enjoyed a day at Sydney's Balmoral Beach with her family on Sunday\nDespite usually being dressed up to the nines, Kate ditched her signature glamour and opted for a more casual approach to her wardrobe for the outing.\nKeeping her top half covered, Kate flaunted her long, lean pins, and went make-up free for the day out in the Australian sunshine.\nThe media personality protected her head from the glaring sun with a pair of designer sunglasses and a large straw fedora hat, which she removed once she had settled herself in the shade to play with her daughter Sophia, one, and niece Rose, two.\nLow-key: Despite usually being dressed up to the nines, Kate ditched her signature glamour and opted for a more casual approach to her wardrobe for the outing as she clutched her daughter Sophia in her arms\nSun safe: The media personality protected her face from the glaring sun with a pair of designer sunglasses and a large straw fedora hat\nDoting mother: Kate removed her hat once she had settled herself in the shade to play with her daughter Sophia, one, and niece Rose, two\nThe Fashion Bloggers star was later seen cradling her adorable lookalike tot before wrapping her up in a large towel.\nAs she headed off home after the enjoyable family outing, the journalist and TV personality also wrapped a colourful towel around her own waist as she slung her straw beach bag over her shoulder.\nStrolling towards her vehicle, the fashion-forward reality star clad her feet in a pair of flip-flop thongs, whilst showing off her matching deep red manicure and pedicure.\nCasual chic: As she headed off home after the enjoyable family outing, the journalist and TV personality also wrapped a colourful towel around her waist as she carried her straw beach bag in one hand\nFamily fun: For the outing Kate was accompanied by her husband, former Rugby League player Luke Ricketson, 42, and their daughter\nDown to earth: Strolling towards her vehicle at the end of the day, the fashion-forward reality star clad her feet in a pair of thongs\nFor the outing Kate was accompanied by her husband, former Rugby League player Luke Ricketson, 42, whom she wed in Italy in 2012, and their daughter.\nJoining the family-of-three was Kate's brother and bookmaker Tom Waterhouse, 33, and his partner Hoda, along with their two children, Rose and William, who is just four-months old.\nThe couple who married in 2011, live nearby at a chic seaside home in Balmoral.\nHoda's mother was also in attendance on the day along with a number of various members from their extended brood.\nThe more the merrier! Joining the family-of-three was Kate's brother and bookmaker Tom Waterhouse, 33 and his partner Hoda, along with their two children, Rose and William, who is four-months old\nDoting fathers: Tom and Luke appeared to be quite the proud parents as they spent time quality with their young ones on the day\nProud as punch! Luke cuddled his young daughter while Tom was seen doting over his newborn son William during a leisurely stroll along the beach promenade\nIf you've got it, flaunt it! Making the most of the sun rays, Luke and Tom went shirtless as they tried to top up their tans in the sunshine\nMeanwhile, Luke and Tom appeared to be quite the proud parents as they spent time quality with their young ones on the day.\nLuke enjoyed cuddling young daughter Sophia while Tom was seen doting over his newborn son William during a stroll along the beach promenade\nMaking the most of the sun rays, Luke went shirtless, simply wearing a pair of blue and white printed board shorts and comfortable thongs.\nWhile Tom ditched his professional suit and tie for a more relaxed ensemble, consisting of a light blue polo shirt which he teamed with white printed board shorts, as well as a dark blue cap to shield his face from the sun.\nTom later followed Luke's lead, stripping off to just his shorts before taking a dip in the refreshing ocean.\nCool and casual: Luke wore a pair of blue and white floral printed shorts, whilst Tom opted for a pair in similar hues\nBeach body: Tom showed off his torso as he stood shirtless on a nearby wharf\nSummer is here! The Australian bookmaker later cooled off by taking a dip in the ocean\nHoliday mode: He appeared happy and relaxed as he enjoyed emerged from the ocean after a refreshing swim\nMeanwhile, brunette beauty Hoda showed off her svelte figure in a grey sleeveless blouse teamed with a pair of white shorts.\nKate jetted from Switzerland to Sydney after a two week family trip to the Alps.\nFor the getaway they were joined once more by her brother Tom's family, along with their parents, Australian racing identities Gai and Robbie, as well as Hoda's parents and younger sister Rey-Hanna Vakili.\nAnd as a dedicated user of social media, Kate made sure share her Christmas and New Year's holiday snaps with her 128,000 plus followers on Instagram.\nLike father, like son! Little William was as cute as a button as he cuddled up to his father\nBrunette beauty: Hoda showed off her svelte figure in a grey sleeveless blouse teamed with a pair of white shorts\nFamily fun: The couple relished in their family time together\nMini-me: Kate regularly peppers her Instagram account with cute shots of her adorable lookalike tot Sophia","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393308/Kate-Waterhouse-shows-slender-frame-black-bikini-matching-singlet-relaxing-day-family-beach.html"}
