{"authors":["Stephanie Linning For Mailonline"],"date_download":"2018-10-23 01:44:37","date_modify":"2018-10-23 01:44:37","date_publish":"2017-03-10 10:09:55","description":"Speaking to Good Morning Britain presenter Kate Garraway, actress Kate Winslet revealed she builds her whole look around a perfectly-fitting pair of pants.","filename":"data/vaneerConsumption/KateGarrawayrevealsKateWinsletsredcarpetsecret.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/16/3E1D513000000578-0-image-a-24_1489078583988.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4296818_Kate-Garraway-reveals-Kate-Winslet-s-red-carpet-secret_1540259077.html","title":"Kate Garraway reveals Kate Winslet's red carpet secret","title_page":"Kate Garraway reveals Kate Winslet's red carpet secret | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"How to look good in any outfit is a secret all women want to know.\nNow Kate Garraway has lifted the lid on the great fashion mystery.\nThe Good Morning Britain presenter said any good outfit starts with one basic garment - a perfectly-fitting pair of pants. The trick is so full-proof that Kate Winslet swears good underwear is the key to all of her best red carpet looks.\n'I have always liked my big knickers,' Ms Garraway said. 'So it was really interesting to find out when [Kate Winslet] looks at her most spectacular she very often gets gowns that are constructed around a piece of underwear that then makes everything fall away.\n'What a Good tip. Even if you can't get a gown constructed, it is good to have a good piece of underwear underneath.'\nThe TV and radio presenter, who turns 50 next month, reflected on life advice she had received from celebrities in an exclusive video for MailOnline.\nShe said: 'I have met some extraordinarily inspirational people over the years who have all been dealing with similar things that I have been looking at: getting older, the way it changes the way you look, they way it changes the way you feel about yourself, how does that affect your relationships.'\nLife lessons: Kate Garraway reflected on the best advice she has received in an exclusive video\nWardrobe secret: Actress Kate Winslet, pictured right in 2012 and left with Leonardo DiCapro last year, revealed she always builds her glamorous red carpet looks around her underwear\nOne high-profile interviewee who impressed Ms Garraway was Julia Roberts, who opened up about how she finds time to unwind.\n'[Julia] said she loves gardening, she gardens with her kids, because she said it makes everything slow down,' Garraway said.\n'She just allows herself to watch over the months and weeks how things develop.'\nDowntime: Julia Roberts, above with husband Danny Moder, told Kate she gardens to unwind\nNext step: Mother-of-two Kate, pictured, said middle-age is a good time to 'take stock' of life\nMs Garraway explores life and ageing in her new book, The Joy of Big Knickers.\nKate added: 'Middle age is a brilliant time of life to take stock, work out what you want and maybe just think about what you want the next chapter of your life to be.'\nA special edition of the book is available at Asda for their Tickled Pink campaign, which has raised more than £50 million for breast cancer care and currently supports two charities, Breast Cancer Now and Breast Cancer Care.\nThe Tickled Pink edition of The Joy of Big Knickers by Kate Garraway is available in store at Asda from Thursday 9 March 2017","url":"https://www.dailymail.co.uk/femail/article-4296818/Kate-Garraway-reveals-Kate-Winslet-s-red-carpet-secret.html"}
