{"authors":["Npr Staff"],"date_download":"2018-10-22 23:25:04","date_modify":"2018-10-22 23:25:04","date_publish":"2014-09-27 00:00:00","description":"The singer, whose voice is often compared to Billie Holiday's, says she can't accept that honor right out — but that she and Holiday do share a similar understanding of the role of the voice.","filename":"data/vaneerConsumption/KatEdmonsonIHearMyselfAsAnInstrument.json","image_url":"https://media.npr.org/assets/img/2014/09/26/katedmo_wide-f449c18a56a3b92987ae3cd1b51792ae7b2e20e8.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2014_09_27_351766336_kat-edmonson-i-hear-myself-as-an-instrument_1540250704.html","title":"Kat Edmonson: 'I Hear Myself As An Instrument'","title_page":"Kat Edmonson: 'I Hear Myself As An Instrument' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Kat Edmonson: 'I Hear Myself As An Instrument'\nEnlarge this image toggle caption Courtesy of the artist Courtesy of the artist\nSinger Kat Edmonson has always looked to the past for inspiration. Her music video for the song \"Rainy Day Woman,\" for example, evokes the technicolor days of the 1960s; with her short-bobbed hair and big eyes that peer out from under an umbrella, Edmonson looks as if she stepped out of Breakfast At Tiffany's.\nSpeaking with NPR's Scott Simon, Edmonson — whose new album, The Big Picture, comes out Sept. 30 — says those old movies and musicals are how she got interested in singing to begin with.\n\"I fell in love with the marriage of cinema and music together,\" Edmonson says. \"I remember being 4 years old and thinking that I was just like Gene Kelly on the screen.\"\nThese days, however, she draws another comparison: Billie Holiday. It's an enviable association, and one Edmonson says she can't accept outright — though she does see one similarity between herself and Lady Day.\n\"What I understand that she was trying to do with her voice was to emulate a horn, specifically Louis Armstrong playing the trumpet,\" Edmonson says. \"And much of my approach to singing has been similar. I hear myself as an instrument, playing with the band.\"\nHear the rest of the Edmonson's conversation with NPR's Scott Simon at the audio link.","url":"https://www.npr.org/2014/09/27/351766336/kat-edmonson-i-hear-myself-as-an-instrument"}
