{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 00:23:59","date_modify":"2018-10-23 00:23:59","date_publish":"2016-01-11 09:32:44","description":"She surely has plenty of access to the best fashions. So it's perhaps unsurprising that Kate Bosworth suffered some sartorial indecision when she attended the Golden Globes in LA on Sunday.","filename":"data/vaneerConsumption/KateBosworthwearspeplumtopandcroppedtrousersatGoldenGlobes2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/3006F48800000578-0-image-a-5_1452506264410.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393573_Kate-Bosworth-undergoes-dramatic-outfit-change-swaps-stunning-sequinned-gown-jewelled-peplum-cropped-trousers-Golden-Globes_1540254239.html","title":"Kate Bosworth wears peplum top and cropped trousers at Golden Globes 2016","title_page":"Kate Bosworth wears peplum top and cropped trousers at Golden Globes 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"As a Hollywood celeb, she surely has plenty of access to the best fashions.\nSo it's perhaps unsurprising that Kate Bosworth suffered some sartorial indecision when she attended the Golden Globes in LA on Sunday.\nThe blonde beauty sported not one, but two, bold looks as at the annual awards ceremony - undergoing an impressive costume change.\nScroll down for video\nDramatic costume change: Kate Bosworth suffered some sartorial indecision when she attended the Golden Globes in LA on Sunday, switching from sequinned gown to jewelled peplum top and cropped trousers\nThe blonde beauty, 33, wowed onlookers when she arrived at the Hilton Hotel in a floor-length sequinned gown.\nStrapless and infused with shimmering pink discs, the acclaimed actress cut a classy figure as she paraded along the red carpet.\nWearing her hair slicked back in a taut bun, she added delicate make-up and some diamond earrings for a sophisticated finish.\nSee Golden Globes updates as Kate Bosworth changes outfit for the afterparty\nContrast: Having succeeded at the red carpet dress, she then opted for comfort in a peplum trouser ensemble\nClassy: The blonde beauty wowed when she arrived at the Hilton Hotel in a floor-length sequinned gown by Dolce & Gabbana\nA seamlessly demure approach to the proceedings, she kept other accessories to a minimum - allowing the focus to remain on her impressive wardrobe choice.\nHowever, the glamorous look didn't last too long - and was traded in for a more practical affair.\nBy the time she reached the Warner Bros/InStyle.Netflix afterparty, she had slipped into a pair of cropped trousers and a jewelled peplum top.\nAdventurous style: Having a little for fun with the look, she carried a rigid clutch bag and added a flash of bright red make-up for added sex appeal\nStrike a pose: Kate and her husband were certainly equally well-dressed at the bash\nBlack and gold, the statement ensemble was both dramatic and yet ladylike as she partied alongside her husband, Michael Polish.\nHaving a little for fun with the look, she carried a rigid clutch bag and added a flash of bright red make-up for added sex appeal.\nShe capped the look with a pair of towering heels, also featuring jewel detail.\nSex appeal: Black and gold, the statement ensemble was both dramatic and yet ladylike as she partied alongside her husband, Michael Polish\nInspiring in Instagram: The critically acclaimed actress posed a cute shot of herself online to fans\nLess is more: A seamlessly demure approach to the proceedings, she kept other accessories to a minimum - allowing the focus to remain on her impressive wardrobe choice\nCommanding attention: Sophia Bush (L) and Kate Bosworth both wowed on presenting duties at the ceremony\nShimmering: Strapless and infused with pink discs, the acclaimed actress cut a classy figure as she paraded along the red carpet.\nLooking good: Kate Bosworth & Walton Goggins attend The Weinstein Company/Netflix Golden Globe Party\nStrike a pose: Designer Nina Garcia (L) and actress Kate cosy-up at the Hollywood bash\nGood times: Kate and her husband partied hand-in-hand at the celebrity-filled bash","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393573/Kate-Bosworth-undergoes-dramatic-outfit-change-swaps-stunning-sequinned-gown-jewelled-peplum-cropped-trousers-Golden-Globes.html"}
