{"authors":["Sarah Sotoodeh For Dailymail.Com"],"date_download":"2018-10-22 21:54:10","date_modify":"2018-10-22 21:54:10","date_publish":"2016-01-11 01:55:39","description":"The 36-year-old actress showed off her toned abs in the shimmering Michael Kors dress, which featured a large cut out mid-section and choker detail.","filename":"data/vaneerConsumption/KateHudsonstunsattheGoldenGlobes2016inaMichaelKorsgown.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/30020DC600000578-0-image-a-14_1452477544531.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393187_Kate-Hudson-stuns-revealing-Michael-Kors-gown-Golden-Globes-2016_1540245250.html","title":"Kate Hudson stuns at the Golden Globes 2016 in a Michael Kors gown","title_page":"Kate Hudson stuns at the Golden Globes 2016 in a Michael Kors gown | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kate Hudson dazzled in a revealing nude colored gown for the Golden Globe Awards.\nThe 36-year-old actress flaunted her gym-toned abs in the shimmering Michael Kors dress, which featured a large cut out mid-section and choker detail.\nThe stunning light hued number had a polka dot pattern, giving her overall look a sparkling touch.\nScroll down for video\nFlawless! Kate Hudson showed off her toned abs in the shimmering Michael Kors dress, which featured a large cut out mid-section and choker detail\nBeaming! Hudson was all smiles for the awards ceremony star-studded event\nThe starlet wore the strapless dress with shiny pink heels and a matching structured clutch.\nThe low-cut frock showed off a hint of cleavage as well as her toned arms.\nKate left her shoulder-length blonde locks loose, center parted with a slight wave.\nShe kept her makeup neutral, rocking subtle smoky eye shadow, nude lipstick and rosy blush.\nSee the latest Kate Hudson updates as she attends the Golden Globes Awards\nGorgeous! The 37-year-old's stunning light hued gown had a polka dot pattern, giving her overall look a sparkling touch\nDressed to the nines: The actress wore the strapless dress with shiny pink heels and a matching structured clutch\nHappy Hudson! The Almost Famous starlet seemed delighted to be at the Golden Globe awards\nThe movie star, who is a presenter at this year's Globes, wore a diamond ring and large earrings to complete the look.\nKate added dark polish to her nails to add depth to her overall light colored ensemble.\nWhile talking to E!'s Ryan Seacrest, the beauty struck up a conversation with The Rock, who was being interviewed before her.\nNatural beauty! She kept her makeup neutral, rocking subtle smoky eye shadow, nude lipstick and rosy blush\nShowstopper: The beauty wowed in the cream colored gown, which showed off her svelte frame\nShe mentioned that she not only follows the actor, but also loves his dog.\nRyan asked her about a photo she shared on her Instagram with her mom, Goldie Hawn, as well as Dakota Fanning and her mother, Melanie Griffith.\nKate revealed that she grew up with Dakota in Colorado, exclaiming 'Look at our mommies!' when the photo popped up on the screen.\nLooking good: Kate left her shoulder-length blonde locks loose, center parted with a slight wave\nGlamorous: The low-cut frock showed off a hint of cleavage as well as her toned arms\nFinal touch! Kate added dark polish to her nails to add depth to her overall light colored ensemble\nFamily moment! Hudson presented at the awards ceremony alongside her stepdad, actor Kurt Russell\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393187/Kate-Hudson-stuns-revealing-Michael-Kors-gown-Golden-Globes-2016.html"}
