{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 23:38:14","date_modify":"2018-10-22 23:38:14","date_publish":"2016-01-11 06:35:08","description":"Speculation has been at fever pitch she is once again romancing former boy band star Nick Jonas.","filename":"data/vaneerConsumption/KateHudsondeniesshesinlovewithNickJonasatGoldenGlobeAwards2016.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3007BA3700000578-0-image-a-93_1452510192631.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393410_Kate-Hudson-denies-love-Nick-Jonas-Golden-Globes-admits-pair-friendly_1540251494.html","title":"Kate Hudson denies she's 'in love' with Nick Jonas at Golden Globe Awards 2016","title_page":"Kate Hudson denies she's 'in love' with Nick Jonas at Golden Globe Awards 2016 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Speculation has been at fever pitch she is once again romancing former boy band star Nick Jonas.\nBut Kate Hudson insisted the pair are just good friends as she chatted on the Golden Globe Awards red carpet on Sunday.\nThe 36-year-old Almost Famous actress is said to have had a summer fling with Nick, 23, and the pair were seen together again at a coffee shop in Mammoth Lakes, California, earlier this week.\nScroll down for video\nSetting the record straight: Kate Hudson used the Golden Globes to flaunt her body, while clarifying the alleged romantic situation with Nick Jonas\nAccess Hollywood's Billy Bush was determined to get to the bottom of things, asking her: '(Are you) in love?'\nAnd even though she initially told the newsman to 'stop it,' she eventually said, 'No. Friendly.'\nIt was reported she had split from her toyboy because she did not want a long-distance relationship while he was on the road with Demi Lovato, and that she 'wanted to pursue multiple people.'\nSee the latest Kate Hudson updates as she denies 'loving' Nick Jonas\nUnder the spotlight: When quizzed by Access Hollywood, Kate admitted her and Jonas were 'friendly'\nSummer loving: She had a blast with Nick Jonas last year and it is thought their feelings have been re-kindled\nHowever things seemed very warm between them as they chatted with friends at the cafe situated in the posh skiing resort area last Monday.\nAt the Globes Kate dazzled in a revealing nude colored Michael Kors gown, which showcased her toned abs and featured a large cut out mid-section and choker detail.\nThe stunning number had a polka dot pattern, giving her overall look a sparkling touch.\nLooking good: Clearly on good form, the blonde actress commanded attention in her boob-tube dress\nBilly Bush whacked: The Access Hollywood hack would not take no for an answer as he grilled the starlet\nJust playing with her toyboy: Kate Hudson, here at the Instyle and Warner Bros afterparty, denied she was 'in love' with Nick Jonas but said they are 'friendly' at the Golden Globes on Sunday\nKeeping it simple, Kate wore the strapless dress with shiny pink heels and a matching structured clutch.\nThe low-cut frock showed off a hint of cleavage as well as her toned arms and suffered flattered her enviable shape.\nKate, who was clearly having a good time as she goofed around, left her shoulder-length blonde locks loose, center parted with a slight wave.\nBeaming! Hudson was all smiles for the awards ceremony star-studded event\nCheeky girl: The actress looked rearly impressive in her strapless dress with shiny pink heels\nGorgeous: Kate glowed as she paraded up and down the red carpet in her body-baring dress\nGorgeous! The 37-year-old's stunning light hued gown had a polka dot pattern, giving her overall look a sparkling touch\nHappy Hudson! The Almost Famous starlet seemed delighted to be at the Golden Globe awards\nShe kept her makeup neutral, rocking subtle smoky eye shadow, nude lipstick and rosy blush.\nThe movie star, who is a presenter at this year's Globes, wore a diamond ring and large earrings to complete the look.\nKate added dark polish to her nails to add depth to her overall light colored ensemble.\nWhile talking to E!'s Ryan Seacrest, the beauty struck up a conversation with The Rock, who was being interviewed before her.\nBust on show: She showcased her ample assets and taut abs in a revealing nude colored gown\nShowstopper: The beauty wowed in the cream colored gown, which showed off her svelte frame\nShe mentioned that she not only follows the actor, but also loves his dog.\nRyan asked her about a photo she shared on her Instagram with her mom, Goldie Hawn, as well as Dakota Fanning and her mother, Melanie Griffith.\nKate revealed that she grew up with Dakota in Colorado, exclaiming 'Look at our mommies!' when the photo popped up on the screen.\nLooking good: Kate left her shoulder-length blonde locks loose, center parted with a slight wave\nGlamorous: The low-cut frock showed off a hint of cleavage as well as her toned arms\nFinal touch! Kate added dark polish to her nails to add depth to her overall light colored ensemble\nFamily moment! Hudson presented at the awards ceremony alongside her stepdad, actor Kurt Russell","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393410/Kate-Hudson-denies-love-Nick-Jonas-Golden-Globes-admits-pair-friendly.html"}
