{"authors":[],"date_download":"2018-10-22 22:13:32","date_modify":"2018-10-22 22:13:32","date_publish":"2014-06-06 13:51:11","description":"Katherine Archuleta is taking on a challenge that has persisted for decades: too few Hispanics in the federal workforce.","filename":"data/vaneerConsumption/KatherineArchuletaSeeksToIncreaseLatinosinFederalJobs.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/492426/140606-kathereine-archuleta-graduation-jsw-1131a_3326c863dac9484b12f511f81c16e6fa.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_katherine-archuleta-seeks-increase-latinos-federal-jobs-n124436_1540246412.html","title":"Katherine Archuleta Seeks To Increase Latinos in Federal Jobs","title_page":"Katherine Archuleta Seeks To Increase Latinos in Federal Jobs","title_rss":"NULL","source_domain":"nbcnews.com","text":"Archuleta said she is working to improve the representation of several other groups as well, veterans, people with disabilities, women. But there are expectations from Latino leaders - many who pushed for a Hispanic at the head of OPM - hoping her presence leads to significantly improved hiring within the Latino community.\nThe National Hispanic Leadership Agenda, a coalition of 37 national groups, has made Latinos in the federal workforce a top priority. The coalition’s chairman Hector Sanchez works with Archuleta through the Hispanic Council of Federal Employment to improve the numbers.\n“This is not only about having solid middle class jobs (for Latinos), it’s about being at the table, being in the agencies of the nation that affect the quality of life for children, things that affect people in day to day life,\" said Sanchez, who also is executive director of the Labor Council for Latin American Advancement. \"It has an effect on all the immigration legislation we have seen,\" he added.\nThe agencies have a lot of influence over how federal government resources are disseminated across the country, said Brent Wilkes, NHLA vice chair. The agencies with the fewest Latino employees, the Department of Education and Health and Human Services, are important to the Latino community. \"It is not surprising to us that in a lot of the programs they offer, Latino participation is way underrepresented,\" Wilkes said.\nSome Latino groups would like to see Obama issue a stronger executive order to get agency heads and their management staff to improve Hispanic hiring. But groups also recognize that an executive order is not a magic bullet. \"We need people who want to hire Latinos making decisions to do this,\" Wilkes said.\nArchuleta is not alone in struggling with an underrepresentation of Latinos. This month Google made public its workplace diversity data, which came with an admission there was work to be done on diversity. Three percent of its 46,170 employees are Hispanic.\nOne of her strategies to reach that end is to get out the word that working for the federal government doesn’t have to mean working in Washington, D.C. Only 15 percent of U.S. government jobs are in the district, Archuleta said. To get Latinos, it’s not enough to just say “ya’all come,” but a need to be specific and to find where Hispanics may be needed, she said.\n“Our culture doesn’t move away from our families, we don’t. Maybe there’s 90 percent of us who want to stay home and 10 percent are willing to move,” Archuleta said. \"What does do me well, for example in Brownsville, is to say, ‘Did you know there are these kinds of jobs right here in Texas?’ ”\nThe University of Texas, Brownsville is one of the campuses Archuleta has visited to drum up interest in working for Uncle Sam. She’s also made stops at University of Texas, San Antonio and her alma mater Metropolitan State University in Denver.\n\"We're about public service. No, we can't compare on salaries. We can't compare on perks, but what we can give you is a promise to know that what you are doing is good.\"\nArchuleta uses the word “surgical” to describe how she's tackling the issue. Part of it entails analyzing job openings and discerning which might draw Latino recruits. She also is working to use the right type of media, be it social media or radio or others, to bring in potential recruits. Conferences are fine perhaps for seasoned workers, but this is not where you are going to find millennials, she said.\nTapping into the strong cultural value of service is another avenue, she said. For experienced workers in the private sector, she suggests they consider taking their decade or more of service and putting it to use for about five years in the federal government to \"embellish\" their experience.\n\"We're about public service. No, we can't compare on salaries. We can't compare on perks, but what we can give you is a promise to know that what you are doing is good. That sort of purpose-driven mission stands above anything in the private sector,\" she said.\nRegarding the ultimate public service position, Archuleta believes the first Latino or Latina president is already here. \"We have to find that person,” Archuleta said.","url":"https://www.nbcnews.com/news/latino/katherine-archuleta-seeks-increase-latinos-federal-jobs-n124436"}
