{"authors":[],"date_download":"2018-10-30 22:27:23","date_modify":"2018-10-30 22:27:23","date_publish":"2018-08-20 08:02:08","description":"Entertainer Kathie Lee Gifford shares her passionate faith in Jesus Christ through a new best-selling book, The Rock, The Road, and The Rabbi.","filename":"data/vaneerConsumption/KathieLeeGiffordIDontWantReligioninMyLife.json","image_url":"http://www1.cbn.com/sites/default/files/styles/original/public/media/standard/images/kathyleegifford_si.jpg?itok=XSCCrScH","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/.cbn.com/cbnnews_us_2018_august_kathie-lee-gifford-i-dont-want-religion-in-my-life_1540938443.html","title":"Kathie Lee Gifford: 'I Don't Want Religion in My Life'","title_page":"Kathie Lee Gifford: 'I Don't Want Religion in My Life' | CBN News","title_rss":"NULL","source_domain":"cbn.com","text":"NEW YORK – From the recording studio to the television studio, Kathie Lee Gifford is an all-around entertainer with an unmatched passion. She's also passionate about her faith.\n\"Follow your joy and it will lead to God's purpose for your life. I have a mantra which is, my joy is non-negotiable,\" Gifford told CBN News in a recent interview about her new best-selling book, The Rock, The Road, and The Rabbi.\nThe inspiration for the book was her love for the Holy Land, which she's been visiting since she was 17 years old.\n\"I was a big Bible nerd from the time I became a Christian when I was 12 years old,\" she said. \"And my father, as my graduation gift from high school, got tickets for my mom and me to go to Israel. And I was thrilled. I missed my high school graduation. I could have cared less. I was always anxious to get to the Holy Land and be where everything happened and just soak it in.\"\nOne of those trips to the Holy Land was with Rabbi Jason Sobel, who helped her write the book.\n\"In 2012, my husband and I went on what we call a 'rabbinical trip,' and that's when everything changed for me,\" she explained.\nUnderstanding the Bible from a Middle Eastern Perspective\n\"And when I started really studying the way the Messianic rabbis teach because the Word of God was written by Middle Easterners for Middle Easterners,\" she went on, \"and when we try to apply our western mindset or traditions or thought processes towards that, it never works. We have to go back to who they were and what was happening at the time that it happened and we have to understand what the languages truly meant.\"\nGET MORE STORIES OF FAITH: Click Here to Get CBN News in Your Inbox\n\"Most people think Jesus was a carpenter. Well, not according to the Greek in the New Testament. The word for what Jesus and Joseph did was 'tekton.' And that means either builder or it means architect. Well, Jesus was the architect of all creation, so that would make sense. And if I am going to base my entire life on something, I have to know what it really means. Many people call themselves Christians, they've never even read the Bible, much less know what it says.\nGifford says she hopes the book will help make the pages of the Bible come to life for readers, and encourage people to read it more.\nMaking the Bible Come to Life\n\"If you know Israel, there is like a three-mile circumference around the temple. Everything was about worship at the temple. Everything was about the spilling of blood for the atoning of sins in the temple. Those shepherds were Levitical priests' shepherds and those lambs were born for the same reason that Jesus was born in Bethlehem right there, to be sacrificed for the sins of the people. And what did they do? What did they do to the lambs as soon as they were born? They wrapped them in swaddling clothes and laid them in mangers. This is the kind of journey we go on in The Rock, The Road, and The Rabbi. And I hope it ignites people's faith. We are so lukewarm, so lukewarm in our society today.\n\"Our battery is like on critical mass because we are not understanding what the word of God really says, therefore we are not applying it properly in our own daily lives. And we are living half of our faith out because we are not living our Jewish part,\" Gifford continued.\nRejecting Religion and Embracing Relationship\nShe also talked about religion versus relationship, and how that understanding came alive for her late husband, Frank Gifford, on one of their trips to Israel.\n\"I don't want religion in my life,\" she declared. \"I want a relationship with the living God.\"","url":"http://www1.cbn.com/cbnnews/us/2018/august/kathie-lee-gifford-i-dont-want-religion-in-my-life"}
