{"authors":["Jasmin Sahota For Mailonline"],"date_download":"2018-10-23 02:52:27","date_modify":"2018-10-23 02:52:27","date_publish":"2017-03-16 13:26:23","description":"The TV personality, 38, proved she still has her model physique as she paraded her insanely tiny waist in a midriff-baring Twitter post.","filename":"data/vaneerConsumption/KatiePriceflauntsherincrediblyTINYtummy.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E553DF300000578-0-image-a-7_1489680074331.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320006_Katie-Price-flaunts-incredibly-TINY-tummy_1540263147.html","title":"Katie Price flaunts her incredibly TINY tummy","title_page":"Katie Price flaunts her incredibly TINY tummy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She made a name for herself as the ultimate glamour girl in the Noughties.\nAnd five children later, Katie Price proved she still has her model physique as she paraded her insanely tiny waist in a midriff-baring Twitter post.\nStaring straight into the camera lens, the TV personality, 38, posed up a storm as she sent fans into a frenzy over her 'incredible figure'.\nScroll down for video\nWaist-ing away! Katie Price,38, proved she still has her model physique as she paraded her insanely tiny waist in a midriff-baring Twitter post\nThe mum-of-five showed off her model credentials while sitting atop of her kitchen counter in matching grey co-ords.\nThe cropped sweater cut just above the star's navel, giving an eyeful of her tanned and toned tummy as she promoted one of her favourite clothing brands.\nFans quickly flocked to Twitter to gush over Katie's impressive frame, with one writing: 'Me want that waist, never mind track suit (sic).'\nMeanwhile another adoring fan added: 'Looking gorgeous Katie as always xx (sic),' and third simple stated: 'Incredible figure'.\nBum deal: The Loose Women panelist is no stranger to showing off her fabulous figure across her social media sites, recently sharing an underwear-clad snap during her bum lift treatment\nAdored: Fans quickly flocked to Twitter to gush over Katie's impressive frame, with one writing: 'Me want that waist, never mind track suit (sic).'\nThe Loose Women panelist is no stranger to showing off her fabulous figure across her social media sites, recently sharing an underwear-clad snap during her bum lift treatment.\nKatie - who's currently married to Kieran Hayler - has revealed that she's eager to expand her brood, admitting that she'd like to have three more children.\nDuring an appearance on Loose Women on Monday, the veteran model said: 'I've got five kids, I've had four Caesareans, but I do want more children.\n'I'm lucky that I've had five children. There's women out there who want children and can't have any. It would kill me if the doctors said I can't have anymore children. I want three more.'\nConfessions: Katie - who's currently married to Kieran Hayler - has revealed that she's eager to expand her brood, admitting that she'd like to have three more children\nHowever, her plans to have more children could be scuttled by the fact that she's already had more than the recommended limit of Caesareans.\n'I heard that after three [Caesareans] you're quite touch and go. And you can't have a natural birth after a cesarean, apparently.'\nThe discussion kicked off when Katie and her fellow Loose Women panellists talked about cesareans over natural childbirth.\n'I've experienced quite a lot, having five,' interjected Katie, who went on to reveal that her first child Harvey - who also happened to be the largest of the babies - was the only one who was a natural birth.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320006/Katie-Price-flaunts-incredibly-TINY-tummy.html"}
