{"authors":["Jabeen Waheed For Mailonline"],"date_download":"2018-10-23 01:17:45","date_modify":"2018-10-23 01:17:45","date_publish":"2017-03-10 09:17:21","description":"Katie McGlynn played up to her single girl status as she partied the night away at the 883 Police denim line launch in Manchester on Thursday.","filename":"data/vaneerConsumption/KatieMcGlynnoozessexappealinsemisheerlacetop.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21C0FE00000578-0-image-a-81_1489137429057.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300414_Katie-McGlynn-oozes-sex-appeal-semi-sheer-lace-top_1540257465.html","title":"Katie McGlynn oozes sex appeal in semi-sheer lace top","title_page":"Katie McGlynn oozes sex appeal in semi-sheer lace top | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She has hit back at claims she's dating Strictly Come Dancing professional, Giovanni Pernice.\nAnd Katie McGlynn played up to her single girl status as she partied the night away at the 883 Police denim line launch in Manchester on Thursday.\nThe Coronation Street star, 33, looked worlds away from her on-screen alter-ego, frump factory worker Sinead Tinker, as she flaunted her recent two-stone weight loss in a semi-sheer lace top.\nScroll down for video\nAll eyes on her! Katie McGlynn, 33, played up to her single girl status as she partied the night away at the 883 Police denim line launch in Manchester on Thursday\nThe soap-star certainly knew how to steal the spotlight away from the Cobbles as she made a very glamorous arrival in her all-black ensemble.\nKatie oozed sex appeal in the racy top, which hugged onto the contours of her slim waist, and bared her toned arms with the sheer detailing.\nHer clingy top was neatly tucked into a pair of skinny black jeans and she bolstered her height in a pair of towering black heels.\nThe choker-wearing show-stopper amped up the racy night out look with her super sleek blonde tresses and heavily lined and fluttery peepers.\nRacy display: The Coronation Street star flaunted her recent two-stone weight loss in a semi-sheer lace top\nSexy: The soap-star certainly knew how to steal the spotlight away from the Cobbles as she made a very glamorous arrival in her all-black ensemble\nEnviable frame: Katie oozed sex appeal in the racy top, which hugged onto the contours of her slim waist, and bared her toned arms with the sheer detailing\nStatement look: Her clingy top was neatly tucked into a pair of skinny black jeans and she bolstered her height in a pair of towering black heels\nClutching onto a large black clutch, Katie looked sensational as she partied the night away with her fellow Corrie co-stars Brooke Vincent, Sair Khan and Tisha Merry.\nKatie's appearance was even more stunning, given that she's recently lost a lot of weight thanks to a gruelling health and fitness regime, inspired by her pal Catherine Tyldesley.\nCatherine shared her dieting and and workout secrets with the blonde bombshell, helping her lose a stone in weight.\nShe had been giving advice on a strict fitness regime and suggesting a diet of vegetables, lean meats and brown rice.\nGorgeous: The choker-wearing show-stopper amped up the racy night out look with her super sleek blonde tresses and heavily lined and fluttery peepers\nA friend of Katie told The Sun: 'Katie was really unsure about how to train and what foods to eat.\n'Cath has really sorted her out with some sound advice coupled with some evil work outs. It has taken a while but she has lost a stone and looks super-fit now.\n'Kate is really pleased with the results but she loves her nights with food and drink so she still makes sure she has a blow-out now and again.\nHer stunning new look also reportedly caught the eye of Strictly's Giovanni, as rumours swirled of a romance between them.\nSlimmer stunner: Katie's appearance was even more stunning, given that she's recently lost a lot of weight thanks to a gruelling health and fitness regime, inspired by her pal Catherine Tyldesley\nHaving a blast: Katie looked sensational as she partied the night away with her Corrie co-star Sair Khan\nWhat's so funny? The girls enjoyed a good giggle together\nDream team: Katie was also joined by pals Tisha Merry and Brooke Vincent\nHowever, Katie was quick to shoot down the hear'say as she shared with her 90,000 Instagram followers snaps of herself and friend Lee Bennett at The Mirror Ball in Manchester on Tuesday night.\nThe blonde bombshell captioned the post: 'The only guy I'm dating atm #gbf #mirrorball'.\nReports had suggested that Katie had been enjoying the Giovanni's company, taking him up on the offer of a romantic night out.\nKatie reportedly 'went for dinner and the cinema' with the Lothario and 'had a night partying with some of his pals in London' recently.\nCompletely different: Katie looked worlds away from her on-screen Coronation Street alter-ego, frump factory worker Sinead Tinker\nSmitten? Her stunning new look also reportedly caught the eye of Strictly's Giovanni, as rumours swirled of a romance between them (Pictured with ex girlfriend Georgia May Foote)\nA source told The Mirror that 'there was a lot of chemistry between them'.\n'They really like each other and there’s a huge attraction there, but it’s early days,' said the source, who claims to know how both parties are feeling internally.\n'[Katie's] in Manchester filming with a big story-line, while [Giovanni's] home is London and he has his tour ­coming up in April, so who knows?'\nAlthough Katie made no mention of the dancing hunk, a tweet suggested that she was indeed in London last week, as claimed by the source.\nThe actress posted: 'London it's been a pleshze! Back in actual sunny Manchester now; what's gwarn?! [sic]'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300414/Katie-McGlynn-oozes-sex-appeal-semi-sheer-lace-top.html"}
