{"authors":["Isolde Walters For Mailonline"],"date_download":"2018-10-22 22:52:59","date_modify":"2018-10-22 22:52:59","date_publish":"2017-03-10 01:43:39","description":"The 33-year-old TV presenter and philanthropist shared her new hair style in an Instagram post earlier in the day and was keen to debut the do at a party at Channel 4 in London.","filename":"data/vaneerConsumption/KatiePipershowsoffhernewhairextensionsinLondon.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E1EF66000000578-0-image-a-98_1489109062504.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299622_Katie-Piper-shows-new-hair-extensions-London_1540248779.html","title":"Katie Piper shows off her new hair extensions in London","title_page":"Katie Piper shows off her new hair extensions in London | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She recently lent her star power to the Prince's Trust's confidence-boosting project All Worth It to help thousands of people who struggle with self doubt.\nBut it looked like Katie Piper was focussing on her day job as a TV presenter when she was spotted arriving at a party at the Channel 4 building in London on Thursday night.\nThe philanthropist, who survived a horrific acid attack in 2008, sported a pretty red and green tropical print dress which featured a pattern of exotic foliage and tigers.\nScroll down for video\nNew hair, don't care: Katie Piper showed off her new tumbling honey-coloured tresses as she arrived at a party at the Channel 4 building in London in a red and green tropical print dress\nThe 33-year-old paired her eye catching dress with knee-high suede boots and carried a chic grey leather handbag over her shoulder.\nThe TV presenter showed off her new hair style of tumbling honey-coloured tresses which was achieved with the help of hair extensions.\nKatie was keen to share her new look with her Instagram followers and posted a picture montage with three pictures from the front, side and back, making sure her fans could appreciate the style from all angles.\nPretty in print: The 33-year-old philanthropist sported a tropical print shirt dress which featured exotic foliage and tigers\nShe captioned the image: 'Guess who changed their hair again.....'\nKatie, who created her own foundation to help those who have suffered facial disfigurement, launched a television career after a Channel 4 documentary followed her recovery from the 2008 acid attack.\nThe mother-of-one has undergone more than 300 surgical procedures after she suffered horrific and life-changing burns when her ex-boyfriend Daniel Lynch arranged to have Stefan Sylvestre throw sulphuric acid in the promising model's face.\nThe incident was caught on CCTV and both Lynch and Sylvestre were handed life sentences.\nAll the angles: Katie shared her new style with her Instagram followers, captioning the image 'Guess who changed their hair again....'\nThe brave mother, who gave birth to Belle in March 2014, previously revealed she wasn't sure when she would share the story of her horrific acid attack with her daughter.\n'It's difficult for a number of reasons because I don't want to frighten her and I don't want her to think there's people like this in society because it's so few and far between,' she told ITV's Lorraine.\n'I don't want her to feel that I am really different because I don't think I am really different anymore. I feel accepted and normal whatever that is.'\nWhat a change: Before her extensions, Katie sported a chic bob as seen here in December\nShe credited her husband Richard with helping her feel better.\n'I always talk about my husband giving me confidence and it wasn't that I needed a man to feel good about myself,' she explained during an appearance on Loose Women in January.\n'I always see men as a luxury not a necessity. I was confident without him but he enhanced my life and gave me certainty and stability.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299622/Katie-Piper-shows-new-hair-extensions-London.html"}
