{"authors":["Press Association"],"date_download":"2018-10-23 04:34:28","date_modify":"2018-10-23 04:34:28","date_publish":"2017-03-10 14:48:06","description":"As well as the award to Monroe over defamatory \"war memorial\" tweets, former Apprentice star Hopkins will have to pay costs running into six figures.","filename":"data/vaneerConsumption/KatieHopkinsfacessixfigurebillafterlosinglibelcaseovertweets.json","image_url":"https://i.dailymail.co.uk/1/2017/03/11/07/wire-200199-1489219090-260_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4301516_Writer-Jack-Monroe-wins-24k-damages-columnist-Katie-Hopkins_1540269268.html","title":"Katie Hopkins faces six-figure bill after losing libel case over tweets","title_page":"Katie Hopkins faces six-figure bill after losing libel case over tweets | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Controversial columnist Katie Hopkins faces a six-figure bill after losing a libel action brought against her over two of her tweets.\nShe was ordered by a High Court judge on Friday to pay £24,000 damages to writer Jack Monroe at the conclusion of a case dubbed “Twibel” by media pundits.\nAs well as the award to Monroe over defamatory “war memorial” tweets, former Apprentice star Hopkins will have to pay costs running into six figures.\nIt\"s taken 21 months\nbut today the High Court ruled\nthat Hopkins statements to/about me were defamatory.\nI sued her for libel.\nand I won. — Jack Monroe (@BootstrapCook) March 10, 2017\nShe was ordered by Mr Justice Warby at a hearing in London to pay £107,000 on account of costs within 28 days, with the full figure yet to be assessed.\nFood blogger Monroe, 28, of Leigh-on-Sea, Essex, complained that the tweets posted in May 2015 accused her of “vandalising a war memorial and desecrating the memory of those who fought for her freedom, or of approving or condoning such behaviour”.\nThe judge said “Ms Hopkins does not suggest that Ms Monroe did behave in either of these ways”.\nHer answer to the claim was that her tweets did not bear the meanings complained of, were not defamatory and that it had not been shown that they caused serious harm to Monroe’s reputation.\nI'll be writing a longer statement shortly, but for now, to everyone who told me I couldn't, wouldn't, shouldn't - I could, I would, I did. — Jack Monroe (@BootstrapCook) March 10, 2017\nAnd now that I can actually breathe, first I am going to hammer my book over the finishing line for those who backed it, and me. Thankyou. — Jack Monroe (@BootstrapCook) March 10, 2017\nThe case arose after Twitter erupted following the daubing of a memorial to the women of the Second World War in Whitehall with the words “F*** Tory scum” during an anti-austerity demonstration.\nDuring a recent hearing, Jonathan Price, for Hopkins, told the judge her case was “this relatively trivial dispute arose and was resolved on Twitter in a period of several hours”.\nHe argued “no lasting harm, and certainly no serious harm” to Monroe’s reputation resulted from it.\nBeen a long game of chicken, and only one of us actually crossed the road into the High Court. The defendant didn't turn up once in 4 days. — Jack Monroe (@BootstrapCook) March 10, 2017\nBut the judge ruled that the “publications complained of” had “not only caused Ms Monroe real and substantial distress, but also harm to her reputation which was serious”.\nMonroe’s lawyer, Mark Lewis, a partner at Seddons solicitors, said she had “finally been vindicated in full from the libellous and wholly false accusation by Katie Hopkins that she had supported the vandalisation of a war memorial”.\nHe added: “Jack Monroe never did, and coming from a proud military family, never would.”","url":"https://www.dailymail.co.uk/wires/pa/article-4301516/Writer-Jack-Monroe-wins-24k-damages-columnist-Katie-Hopkins.html"}
