{"authors":["Katie Hopkins For Mailonline"],"date_download":"2018-10-23 04:58:12","date_modify":"2018-10-23 04:58:12","date_publish":"2017-03-10 15:00:50","description":"One thing that surprises me is how axe, machete, knife and bomb attacks across Europe are responded to by anti-terror squads even though they are not, apparently, terror, writes KATIE HOPKINS.","filename":"data/vaneerConsumption/KATIEHOPKINSScaredbeingkilledbyarightwingnutter.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E237B5900000578-0-image-a-104_1489157939921.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/debate_article-4301476_KATIE-HOPKINS-Scared-killed-right-wing-nutter_1540270692.html","title":"KATIE HOPKINS: Scared being killed by a right wing nutter","title_page":"KATIE HOPKINS: Scared being killed by a right wing nutter  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"One of the things that surprises me on an almost weekly basis, is how axe, machete, knife and bomb attacks against nationals across Europe are responded to by anti-terror squads even though they are not, apparently, terror.\nWe are categorically told: this was not a terror attack.\nAnd as if to sugar-coat our daily dose of multiculturalism, we hear surprisingly quickly if the attacker came from anywhere that isn't a mainly Muslim country.\nThe authorities were virtually falling over themselves to report the lorry in the Christmas attack was licensed to a Polish driver. Only to discover, shortly afterwards, that he had been murdered in his cab by the Muslim terrorist at the wheel.\nIt was a long time before the crazed Dusseldorf axe attacker from last night could be named.\nPictured: Paramedics rush to the aid of a victim of the train station attack in Dusseldorf last night - but police insisted it was not terror related\nEye-witness accounts describing him in the German newspapers as southern-looking (which translates as Mediterranean / dark-skinned) were quickly glossed over and replaced with a much more reassuring 'Yugoslavian'. A country which doesn’t even exist!\nDoes anyone remember what that conflict in Yugoslavia was all about? Religion wasn’t it?\nFinally we find out that’s he’s one ‘Fatmir H’ from 95% Muslim Kosovo. Hmmm.\nBut he apparently has severe mental issues, and the attack as ‘nothing to do with terror’. So that’s all right then.\nIt’s a consistent messaging that we have become so used to that we've learned to take shortcuts to aid our own understanding.\nIf we are not given a name for a violent perpetrator, we can assume it's not Sven.\nIf we are not told the country of birth, it’s pretty much guaranteed to be on the list Donald Trump has wisely banned from the States.\nAnd if we are eventually told the name and nationality, we can safely assume suddenly mental issues will be front and centre. Or at the very least he will be a wolf. And alone.\n(What has always surprised me is how individuals with genuine mental illness have never complained about being bracketed together with the sort of people who shout a few religious words and then try to axe off the arm of a thirteen-year-old at a bus stop.) Now it appears the Home Office is keen to push this narrative, one step further by shouting about the fact white people are scary too. If not worse.\nTheir headline statistics released yesterday assert one in three terror suspects arrested in Britain last year was white.\nDid you get that? One in three?\nLess numerate minds might be looking around at their neighbours thinking one in three of them could be a terrorist. Next-door-but-one could be looking to machete you in the night. White van man over the road might be concealing some hard-core Semtex under his fluoro-vest.\nMrs Merkel's Germany has been plagued by terror attacks in the past year\nBut let’s think about this a bit.\nIf one-third of terror suspects arrested were white, then two-thirds were not.\nAnd the two-thirds who identify as non-white make up just 10% of the censored UK population. (As for the non-censored lot who prefer not to be counted, I will leave you to draw your own conclusions.) So two-thirds of all terror suspects arrested are from just ten percent, a tiny fraction, of our population. The non-white population.\nThat is the bigger story.\nBut there is a bigger question.\nWhy is the Home Office so desperate to make white people the fear? Why the inference that the rise in the far right is just as big a threat as Islamic extremism, when all evidence is to the contrary?\nAnd why is so much resource being thrown at domestic terror (where there are no links to either Northern Ireland-related or international terrorism), resulting in the arrest of just 35 domestic ‘terror suspects’, when their figures show a 30% fall in the use of counter-terrorism powers at the UK border (where just 19,355 people were 'stopped and examined' at airports and seaports)?\nThis is madness. An insane waste of resource to satisfy politically correct quotas.\nWe are focussing effort and energy on Fat Joe from the darts club who was alleged to have left a pack of bacon from the Co-op outside a mosque, and not on borders and airports where a reported 200 migrants a day are coming into our country -- in the back of a van -- no doubt many of them from places Thump has banned from America.\nOur top terror expert in the UK, David Anderson QC, is equally keen to force this agenda in the face of statistical truths: 'Extreme right-wing ideology can be just as murderous as its Islamist equivalent'; he said.\n'Increasingly, right-wing extremists such as Thomas Mair, the killer of Jo Cox MP, feed off the tension [caused by Islamist extremism] to plan violence of their own'\nI’d argue the tensions around Jo Cox’s death were not of the making of Islamic extremists, but by liberal extremists. The far left. A group which, according to the media, does not exist. And a group who do not identify as far-left, but act that way all the same.\nI would assert that there are powerful forces lobbying the government for the far-right to be in the spotlight at all times.\nI wonder if it is just a coincidence the husband of Jo Cox, endlessly and relentlessly pushed across the BBC, was a senior political adviser to Gordon Brown and well connected inside Parliament.\nI am not sure he is driven by grief alone. I think he is still a man with a political mission, determined to own hope and make white Brexiteers the custodians of hate.\nNo one is arguing her murder was not an appalling act.\nBut as the ONLY fatal attack in the UK that is remotely attributable to the right-wing, why are we suddenly being asked to believe that terrorism by the right is on a par with the brutal acts of ISIS?\nI listed the suspected terror attacks in Germany this year in a tweet:\nAnd immediately those following the multi-cultural script told me 12,000 people are killed by guns in America each year. Or this was not relevant to UK news. Or the perpetrators country of origin was not relevant. Or I am racist.\nThis is the far left at work. They are the ones promoted across the BBC trying to own ‘hope’ when they are actually the biggest perpetrators of a new brand accepted form of ‘hate’.\nAnd they are as delusional as the Dusseldorf axeman.","url":"https://www.dailymail.co.uk/debate/article-4301476/KATIE-HOPKINS-Scared-killed-right-wing-nutter.html"}
