{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-23 04:35:28","date_modify":"2018-10-23 04:35:28","date_publish":"2016-01-11 17:42:17","description":"Despite it being men's fashion week, one female model took to the runway at the Katie Eary show with completely bare breasts.","filename":"data/vaneerConsumption/KatieEarymodeltakestothecatwalkexposingherbarebreasts.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300D46B400000578-0-image-a-36_1452533228492.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3394248_Is-fashion-week-s-daring-trend-Model-takes-catwalk-exposing-bare-breasts-totally-naked-coat-London_1540269328.html","title":"Katie Eary model takes to the catwalk exposing her bare breasts","title_page":"Katie Eary model takes to the catwalk exposing her bare breasts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"We've seen the side boob and the under boob but if fashion week is anything to go by, full frontal boob will be the next big trend.\nDespite it being men's fashion week, one female model took to the runway at the Katie Eary show with completely bare breasts.\nWearing just a purple and orange striped coat, she stormed the runway with her assets completely on show.\nScroll down for video\nA female model took to the runway at the Katie Eary show with completely bare breasts on Monday\nThe creative vision behind the catwalk show was Katie Eary - a London-born designer best known for her bold menswear designs and work with Kanye West.\nKatie Eary also recently made her high street debut with a collection for River Island Design Forum.\nThe 18-piece collection showcased Katie's penchant for vivacious prints and energetic colours across flowing maxi dresses, swimwear and statement accessories.\nElsewhere at London Collections: Men, Burberry's Christopher Bailey revealed his latest Menswear collection, named 'Something Old, Something New, Something Borrowed, Something Blue,' at its custom-built venue in London’s Kensington Gardens.\nWearing just a purple and orange striped coat, the model bared all on the runway with her breasts completely on show\nKatie Eary - a London-born designer - is best known for her bold menswear designs but today called on female models for her show\nA model pays tribute to the late David Bowie at the Sean Suen presented by GQ China Show on Monday\nAs well as Bowie tribute tattoos, male models donned bizarre accessories in the form of safety pins clipped to their faces\nElsewhere at London Collections: Men, Burberry's Christopher Bailey revealed his latest Menswear collection\nThe show, named 'Something Old, Something New, Something Borrowed, Something Blue,' was held at Burberry's custom-built venue in London’s Kensington Gardens\nGuests who attended the show included Steve McQueen, Brooklyn Beckham, Mark Ronson, Josephine de la Baume, Tinie Tempah, Jourdan Dunn, Amber Anderson, andToby Huntington-Whiteley.\nModels walking the show included the brand’s current campaign stars Sol Goss, Louie Johnson, Ruth and May Bell, Eliza Fairbanks, Hayett McCarthy as well as Chinese singer and actor Kris Wu, who made his runway debut today.\nTributes were also paid to the late and great David Bowie, with Sean Suen's models taking to the runway with faux tattoos in his honour.\nAs one of new generation of fashion designer, Sean Suen has an experience full of diversity in life and work - born in Chongqing, lived in Shenzhen, Shanghai and Beijing; educated as a painter, practiced as graphic designer, and now a fashion designer.\nSean Suen launched his label SEAN SUEN in Beijing 2012, with the aesthetic ethos: Amusing, Dynamic and Chic.\nHis style is minimal and lively, emphasising the decomposition of the structure. Each single piece is a small project, mixing various materials and using multi-level cut, intends to offer a practical function and stylish silhouette.\nThis isn't the first of the quirky clothes we've seen at LC:M. Thong-like underwear, clown hair and men sashaying down the catwalk in crop tops made an appearance over the weekend.\nThis morning saw London Collections: Men kick off in London with characteristically outlandish designs on show. Milliner Nasir Mazhar shocked on the runway by sending his male models down the catwalk donning bottom-baring thongs, strappy halterneck crop tops and, curiously, trousers worn half way down their legs\nOne of the most eclectic shows was MAN - the joint initiative between Topman and Fashion East.\nMale models took to the runway in head-to-toe pinstripes, floor length scarves and shoulder-baring jumpers.\nThe beauty look was equally out there with men rocking vibrant gold and purple hair, white faces, black brows and glittering red eyeshadow before a rather perplexed crowd.\nAccessories followed suit with chokers, sequin embellished headbands and crafty handbags all being worn by male models.\nMAN spearheaded London Fashion Week’s menswear schedule in 2005 and proudly champions emerging menswear talent, making it the show to keep an eye on this season.\nOne male model appeared to be wearing a black sleeping back as he took to the runway in a Darth Vader style ensemble at the Nasir Mazhar show on Friday\nOne of the most eclectic show was MAN - the joint initiative between Topman and Fashion East. Male models took to the runway with clown-like hair dyed in different hues and carrying bizarre totes\nDesigners are selected by a panel of buyers, stylists and journalists including Nicola Formichetti, Charlie Porter and Tim Blanks.\nEach season these young designers receive a bursary, catwalk show-production, PR support and expert advice to help them launch their labels.\nMAN enjoys an unrivalled reputation for identifying and supporting the most exciting new menswear names in the industry. Alumni James Long, Christopher Shannon and JW Anderson continue to trail blaze with solo catwalk shows.\nThe zany show was watched from the front row by the likes of Dermot O'Leary, David Gandy and Oliver Cheshire.\nElsewhere, Milliner Nasir Mazhar shocked on the runway by sending his male models down the catwalk donning bottom-baring thongs, strappy halterneck crop tops and, curiously, trousers worn half way down their legs.\nNasir - who sent models down the runway in bondage-inspired jeans and quirky crop tops - was born in east London; he is of Turkish Cypriot origin. He has worked for theatrical designer Mark Wheeler and trained with Jane Smith\nThe beauty look at the MAN show was equally out there with men rocking vibrant gold and purple hair, white faces, black brows and glittering red eyeshadow\nOther male models wore monochrome headgear and one even donned a peculiar Darth Vader helmet.\nNasir was born in east London; he is of Turkish Cypriot origin. He has worked for theatrical designer Mark Wheeler and trained with Jane Smith.\nOther internationally acclaimed brands to show this weekend include Alexander McQueen, Belstaff, Burberry, dunhill, and Coach.\nAs well as established brands, the BFC’s NEWGEN MEN initiative sponsored by Topman will see London’s brightest emerging design talents showcase AW16 collections.\nNew additions in the Designer Showrooms include Mackintosh, BOY London - who are celebrating their 40th anniversary - and LCM Ambassador David Gandy’s footwear brand David Preston London.","url":"https://www.dailymail.co.uk/femail/article-3394248/Is-fashion-week-s-daring-trend-Model-takes-catwalk-exposing-bare-breasts-totally-naked-coat-London.html"}
