{"authors":["Caitlin O'Toole For Dailymail.Com"],"date_download":"2018-10-22 21:48:36","date_modify":"2018-10-22 21:48:36","date_publish":"2016-01-11 01:43:03","description":"The singer wore a bubblegum pink dress and a bouffant half-updo as she arrived at the Beverly Hills Hilton for the Golden Globes on Sunday.","filename":"data/vaneerConsumption/KatyPerrywearsalowcutdressontheGoldenGlobesredcarpet.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/02/3002315E00000578-0-image-a-92_1452479832347.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393232_I-got-wig-globes-Katy-Perry-wears-big-hair-low-cut-pink-dress-red-carpet_1540244916.html","title":"Katy Perry wears a low-cut dress on the Golden Globes red carpet","title_page":"Katy Perry wears a low-cut dress on the Golden Globes red carpet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Katy Perry wore a plunging pink dress and joked that she'd brought her own 'globes' to the red carpet on Sunday.\nThe singer wore a bubblegum pink dress and a bouffant hairstyle as she arrived at the Beverly Hilton for the Golden Globes on Sunday.\n'I got my wig out and my globes,' she joked to E! News host Ryan Seacrest, adjusting her breasts.\nScroll down for video\nStunning: Katy Perry wore a form-fitting pink gown as she arrived at the Golden Globes on Sunday\nThink pink: The pop star joked about bringing her own 'globes' to the awards show in her low-cut gown\nPop star: The Fireworks singer accessorized with diamond bracelets and matching pink manicure\n'I have no idea where I am at this very moment,' she joked as she made her way through the throngs on the red carpet.\n'Am I at the Grammys?,' she asked.\nThe 31-year-old pop star said she was feeling relatively relaxed, since she is presenting but not performing at Sunday's show.\nSee the latest news on Katy Perry as she hits the Golden Globes red carpet\nAll smiles! The pop star said she was feeling relatively relaxed, since she is presenting but not performing at Sunday's show\nDazzling! The singer added lots of sparkle to her blush pink dress with tons of sparkling diamond accessories\nPop of colour: As for her bright pink gown, Katy explained: 'Pantone says the color of the year is rose quartz'\nBut she still went all out for her glamorous look.\nHer form-fitted pink gown featured a plunging neckline with thin straps, and tied in the back in a cute bow.\nThe singer accessorized with sparking diamond bracelets and a matching pink manicure.\nAs for her bright pink gown, Katy explained: 'Pantone says the color of the year is rose quartz.'\nConfident: The 31-year-old looked right at home on the red carpet\nDetails: The bright pink gown featured a cute pink bow\nHair raising: The Emmy nominee went old Hollywood glamour with a chic bouffant hairstyle\nAnd the singer was thrilled when she ran into actress Jennifer Lawrence, raving about her film Joy.\nKaty also told the actress that she had 'a bump-it' in her hair to keep the volume, prompting J.Law to immediately pat her on the head, saying 'Yes, you do!'\nThe Fireworks singer then gushed that she'd seen Joy alone in a cinema wearing pink sweatpants, raving 'You inspired me!'\nPicture perfect! Perry showcased her slender physique and pert posterior in the soft pink number\nShowstopping! Katy made sure to stand out from the crows on the red carpet in her head turning garb\nBig smile: Katy wore matching bubblegum pink lipstick and sparkling earrings\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393232/I-got-wig-globes-Katy-Perry-wears-big-hair-low-cut-pink-dress-red-carpet.html"}
