{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-23 03:09:11","date_modify":"2018-10-23 03:09:11","date_publish":"2017-03-10 12:39:37","description":"Mr Candy and his brother Christian deny allegations by Mark Holyoake that they conspired to extort large sums from him, The High Court trial in London continues.","filename":"data/vaneerConsumption/KatyPerryplayedatHollyValancesweddingcourthears.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E23122D00000578-0-image-a-100_1489152644029.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301140_Nick-Candy-says-ex-business-partner-pathological-liar_1540264151.html","title":"Katy Perry played at Holly Valance's wedding, court hears","title_page":"Katy Perry played at Holly Valance's wedding, court hears | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Property tycoon Nick Candy today slammed the man suing him as 'a fraudster and pathological liar'\nBillionaire property tycoon Nick Candy has told a court he paid US popstar Katy Perry £1.2million to perform at his wedding to Australian actress Holly Valance, but denied he lives a lavish lifestyle.\nMr Candy and his brother Christian deny allegations by former business partner Mark Holyoake that they conspired to extort large sums from him by putting 'the fear of God' into him with threats.\nMr Holyoake is claiming £132million in damages against the property tycoons at the High Court in London.\nGiving evidence at the trial today, Nick Candy denied that paying Katy Perry a seven-figure amount to sing at his wedding showed his lavish lifestyle.\n'That's not my lifestyle, it was a one-off event,' he said, adding: 'I came from nothing. I take money seriously.'\nNick Candy told a judge the 'very, very charismatic' Mr Holyoake was 'a fraudster and pathological liar'.\nHe told the High Court today that becoming friends with Holyoake was 'the worst decision of my life by a long, long way'.\nMr Holyoake was Nick's long-time friend from university days until things turned sour over a £12 million loan from the brothers.\nMr Candy said they had become 'close friends' but Mr Holyoake was not his best friend.\nHe said: 'I regret the day I ever met the man. It was the worst decision of my life by a long, long way.'\nMr Candy says his wife, Holly Valance, would say he was 'an emotional softie'\nNick Candy told the court in cross examination how from the early days he and his brother made 'tens and tens of millions' from their property development enterprises as prices boomed in London.\nAsked by Roger Stewart QC, representing Mr Holyoake, if he was tough in business, Mr Candy replied: 'I am no pussycat, that's for sure.'\nHe told the judge he could be tough but was 'fair', then added: 'My wife will tell you I am an emotional softie.'\nQuestioned about his relationship with Mr Holyoake, Mr Candy told the court what made him 'sick about this case' was the allegation 'that I threatened his family'.\nHe added: 'It makes me absolutely sick. I have got a three-year-old child. If anyone threatened my family I would be absolutely appalled by it.'\nThe court heard that Mr Holyoake referred to Nick as 'Clown Candy', which he said he was not previously aware of and was not sure if it was 'complimentary or negative.'\nThe court heard US popstar Katy Perry was paid £1.2million to perform at Mr Candy's wedding\nHe said he knew Mr Holyoake called him 'Rickie Butcher', a reference to the Eastenders character, because 'I was thick as two short planks.'\nCandy added: 'I didn't have a nickname for him, but I might do after this case.'\nNick then addressed Mr Justice Nugee and said 'I'm not sure if you have watched Eastenders recently, my lord.'\nMr Holyoake alleges the Candys made threats against both him and his family to extort repayments amounting to £37 million.\nThe brothers, who are best known for creating the luxury One Hyde Park apartment complex in Knightsbridge, central London, deny all the allegations.\nMr Holyoake borrowed the money from Christian Candy's company CPC Group in October 2011 to help him buy Grosvenor Gardens House in Belgravia, London, to convert into a luxury property for a substantial profit.\nMark Holyoake (left) is suing Nick and Christian Candy (right) for £132 million in damages\nHe gave evidence earlier in the trial that he eventually paid back more than £37 million on the two-year loan and had to sell up at a loss of £100 million in potential profits after incurring millions of pounds in legal fees and other costs.\nMr Holyoake, 44, alleges the brothers subjected him and his family to a campaign of intimidation, including threats against his then pregnant wife Emma.\nThey had put 'the fear of God' into him by threatening to sell his debt to Russian gangsters, it was alleged.\nEarlier in the trial Christian Candy told Mr Justice Nugee from the witness box: 'I don't deal with shady people.'","url":"https://www.dailymail.co.uk/news/article-4301140/Nick-Candy-says-ex-business-partner-pathological-liar.html"}
