{"authors":["Loretta Donelan"],"date_download":"2018-10-30 22:26:46","date_modify":"2018-10-30 22:26:46","date_publish":"2014-08-15 17:04:27","description":"In a recent interview with Yahoo, Katy Perry discusses the importance of education. While these sorts of celebrity messages are often taken with a grain of salt, since many stars are both undereducated and highly successful, Perry's was predictably…","filename":"data/vaneerConsumption/KatyPerrysStatementAboutHerLackOfEducationIsAdmirablyVulnerable.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/864dc8d9-fcd3-487d-ae31-54db77f54a7a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35934-katy-perrys-statement-about-her-lack-of-education-is-admirably-vulnerable_1540938406.html","title":"Katy Perry's Statement About Her Lack Of Education Is Admirably Vulnerable","title_page":"Katy Perry's Statement About Her Lack Of Education Is Admirably Vulnerable","title_rss":"NULL","source_domain":"bustle.com","text":"In a recent interview with Yahoo, Katy Perry discusses the importance of education. While these sorts of celebrity messages are often taken with a grain of salt, since many stars are both undereducated and highly successful, Perry's was predictably candid and heartfelt. \"I'm kind of bummed at this stage that I didn't have a great education,\" she says. \"I could really use that these days.\"\nI think it's brave and significant of Perry to admit that her lack of education is affecting her now, at age 29. Warranted or not, Perry has, like many a pop star before her, been cast by the media as a bimbo. Discussing her lack of education opens her up for ridicule, and thus is particularly brave. Perry dropped out of high school at 15, and before that, she admitted that her education was often interrupted by frequent family moves.\nPerry has partnered with Staples for their \"Make Roar Happen\" campaign, which raises money for teachers. It's nice to see that her support of the campaign comes from a genuine place, and despite lamenting her lack of education at an early age, she says that she's fostering her intellectual curiosity. \"I've learned to educate myself at this stage and how to continue my education at any age. I'm going on 30 and I'm still very thirsty for information.\" Most recently, on a tour stop in Chicago, Perry posted a bunch of pictures at the Art Institute's Renee Magritte special exhibit, urging her followers to check it out.\nThis has not been the first time that Perry has displayed a remarkable amount of vulnerability. She has discussed her imperfections with a refreshing bluntness, telling Parade: \"There are a lot of things that are personally uncomfortable to show, especially me without makeup and completely bloated or crying. But I've realized that it's time for me to show my audience that you don't have to be perfect to achieve your dreams. Because nobody relates to being perfect.\" She's said that this vulnerability is a conscious decision:\nPop stars are hard to relate to because they are so scared of being vulnerable or real and afraid that people will exploit their flaws. I on the other hand, celebrate my flaws and actually welcome them. Flaws give us character and at the end of the day, I want people to see me as that girl they can relate to, talk to, and have a good laugh with.\nBy admitting that she, a successful pop star, still has a lot to learn, Perry encourages children and adults alike to pursue education. Her vulnerability makes her seem real, and her desire to keep learning is admirable, and also pretty brave.","url":"https://www.bustle.com/articles/35934-katy-perrys-statement-about-her-lack-of-education-is-admirably-vulnerable"}
