{"authors":[],"date_download":"2018-10-30 01:00:43","date_modify":"2018-10-30 01:00:43","date_publish":"2018-09-11 00:05:00","description":"These days the Trump White House is held up as the principal example of misgovernment in America today. But what to make of the hearings on Brett Kavanaugh’s nomination for the Supreme Court? It is difficult to decide whether mindless protesters (also known as “activists,” whatever that means) or sanctimonious senators are dumber.","filename":"data/vaneerConsumption/KavanaughandtheLeftsViewofJudges.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/LisaHeinzerling.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861243.html","title":"Kavanaugh and the Left’s View of Judges","title_page":"Kavanaugh and the Left’s View of JudgesThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"These days the Trump White House is held up as the principal example of misgovernment in America today. But what to make of the hearings on Brett Kavanaugh’s nomination for the Supreme Court? It is difficult to decide whether mindless protesters (also known as “activists,” whatever that means) or sanctimonious senators are dumber.\nIn most civics classes students are taught that the U.S. system has three branches: executive, legislative, and judicial. They have separate roles and check one another. Judges are to interpret the law, assessing what it is, not declaring what they want it to be.\nHowever, the Kavanaugh hearings demonstrate that none of the protesters or, more seriously, the Democratic senators, paid attention in class. They obviously imagine that judges are merely legislators in robes. The judiciary’s job is to create a progressive paradise. The law really doesn’t matter.\nThe purpose of America’s original system should be obvious. Laws are made with the consent of the governed. It is hard to have a national town meeting, so legislative power is delegated to one or more elected bodies. In the federal government there is a House and a Senate, so some degree of consensus is required to pass legislation.\nAdministration of the law is a separate job which also goes to an elected official. The interplay between legislatures and chief executives is complex, but is supposed to prevent either branch from gaining too much power. While administration inevitably requires some discretion, governors and presidents are supposed to implement, not make up, laws.\nJudges are the clean-up crew. Statutes are ambiguous. Laws conflict. Constitutions are terse. It sometimes really isn’t clear what “is” is. How best to apply old principles to changing technologies? Legislators sometimes ignore constitutions, while executives sometimes ignore laws and constitutions. Rights, real ones, not left-wing wish lists, are to be protected. Jurists are to figure out what the law is, irrespective of their personal preferences.\nHowever, the Left discovered what it believes to be a terrible flaw in this system. Most people don’t like having their lives run by social engineers. Many legislators actually agree with their constituents. Which means people get to keep too much of their own money, make too many of their own decisions, and hold inappropriately non-PC opinions. It is up to judges to take over the legislature’s function and impose new rules on the recalcitrants. And to enforce this glorious new progressive way of life.\nThe result is essentially two competing judicial philosophies. A gross simplification, to be sure. But reasonably accurate in practice.\nOne is that judges should try to figure out the legal meanings based on the original political compromise. Judges might emphasize drafters or enactors. Jurists might stick more closely to language irrespective of evidence of intent. Courts might emphasize precedence despite evident error to promote stability. However, the law is not supposed to be infinitely malleable. It was intended to mean something when passed, which was to remain reasonably fixed and predictable. That meaning is supposed to outlive transitory court majorities. Constitutions and statutes can, and should, be changed, but by legislatures and voters in prescribed ways. Courts are not to act as continuing constitutional conventions.\nThe other jurisprudential vision is that judges are policymakers and should do whatever they feel like — as long as it’s consistent with tolerance, diversity, sensitivity, and other liberal verities. Of course, lefties rarely put it quite so baldly. They have come up with numerous detailed theories, all of which lead to the predictable result: judges are to act as legislators, daily, even hourly mandating a progressive future. The details don’t matter.\nIn this theory, the reason we have the judiciary is not to balance against legislators and executives, but to correct their mistakes when they do not increase spending, expand welfare, impose social programs, engage in social engineering, and otherwise mandate left-wing progressivism as every American’s life ethos. In a perfect world the Left would have judges wear placards proclaiming “Free Stuff” on one side and “Willing to force someone somewhere to give you what you want” on the other.\nWhile it is easy to blame liberal jurists, Sen. Ben Sasse (R-Neb.) and others point out that irresponsible legislators are complicit. By ducking their responsibilities — refusing to pass detailed legislation and vote on presidential war-making, for instance — they essentially leave law-making to bureaucrats in and out of robes. Explained Sasse: “… most people here in Congress want their jobs more than they want to do legislative work.”\nUltimately, progressive jurisprudence is anti-law. It doesn’t matter what was passed and why it was passed. It can be rewritten by judicial fiat so long as it advances the right (meaning on the Left!) set of values. All that matters are results.\nWhen Ronald Reagan ran for president and the Republican Party platform insisted on judges who would overturn Roe v. Wade, Democrats complained about “litmus tests” for the judiciary. No one should be barred because of their views on one issue, they insisted. Today Roe is about the only case Senate Democrats seem to care about. And what the Constitution says and was meant to say are irrelevant. Roe discarded precedent, which leftists celebrated, but now as precedent they claim the decision is sacred.\nHowever, Roe really is not constitutional law. Rather, it was a legislative enactment. Overturning Roe would turn abortion back into a normal political issue in which lawmakers make a difficult balance of life and liberty interests. Indeed, in practice, ending Roe, which already has been substantially modified, would have only modest practical impact. The issue would return to individual states. “Progressive” states would leave people free to abort their children. Virtually no one would be more than a couple states away from a legal abortion clinic.\nA few years back when I debated the constitutionality of Obamacare, even some law students appeared to forget the purpose of constitutional law. They would complain that a relative had a problem health condition, which must mean, ipso facto, that the law was valid. I responded that such a personal problem might demonstrate the need for health care reform, but the specific remedy was not self-evident — after all, Obamacare’s many flaws were obvious. Even more important, however, the Constitution did not proclaim that anything goes so long as someone somewhere wants something.\nWhere the Left makes some sense is to dismiss the issue of judicial “activism.” Newsweek’s David Kaplan recently complained about both Left and Right wanting judges to run the world. However, leftists usually expect judges to ignore the Constitution while those on the right more typically urge action to restore the Constitution. “Activism” in the abstract is not a problem. To the contrary, many constitutional provisions — limits on state power of all sorts — require judges to intervene to vindicate constitutional liberties. For instance, only an “active” judge can enforce Fourth Amendment safeguards against improper government searches and seizures. The real issue is fidelity to the Constitution.\nIndeed, progressives rather like conservatives who argue that judges should do, well, nothing. Leftish judges create grand new “rights.” Then conservative judges are told that as proponents of restraint they are duty-bound to ratify the new precedent. Thus, liberals believe that in the natural legal order they extend and conservatives consolidate judicial law-making.\nAlthough Kavanaugh almost certainly will be confirmed, his backers need to do a better job explaining the function of judges to the American people. The judiciary’s role is not to dispense goodies to the assembled masses. Judges are supposed to vindicate the law, even when inconvenient. Critics have rightly questioned some of Kavanaugh’s positions, especially on executive power, but he still seems far more likely to decide what the law is rather than what he wants it to be. It comes as a shock to many on the Left, but he appears to believe that constitutional law should have at least a vague connection to what the Constitution actually says.\nDoug Bandow is a Senior Fellow at the Cato Institute. A former Special Assistant to President Ronald Reagan, he is a graduate of Stanford Law School and a member of the California and Washington, D.C. bars.","url":"https://spectator.org/the-kavanaugh-hearings-understanding-the-lefts-view-of-judges/"}
