{"authors":["Nina Totenberg"],"date_download":"2018-10-22 21:18:35","date_modify":"2018-10-22 21:18:35","date_publish":"2018-09-04 00:00:00","description":"Trump's Supreme Court nominee will face tough questioning from Democrats during his confirmation hearings this week on abortion, guns, investigating the president, national security and regulation","filename":"data/vaneerConsumption/KavanaughConfirmationHearingsToFocusOn6HotButtonIssues.json","image_url":"https://media.npr.org/assets/img/2018/09/02/ap_18233759432825_wide-3e51ebc40f9575f0e746013a7705bf0c6cd57059.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_09_04_644105543_kavanaugh-confirmation-hearings-to-focus-on-6-hot-button-issues_1540243115.html","title":"Kavanaugh Confirmation Hearings To Focus On 6 Hot-Button Issues","title_page":"Brett Kavanaugh Confirmation Hearings To Focus On 6 Hot Topics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Kavanaugh Confirmation Hearings To Focus On 6 Hot-Button Issues\nEnlarge this image toggle caption Jose Luis Magana/AP Jose Luis Magana/AP\nThe confirmation of a Supreme Court justice is often a major event that ripples through American law for decades. But Brett Kavanaugh's confirmation hearing, which opens Tuesday, is especially historic because, if confirmed, Kavanaugh is expected to solidify a hard-right majority on the nation's highest court, a majority the likes of which has not been seen since the early 1930s, and which is likely to dominate for a generation or more.\nThe almost-week-long hearing will have both more and less drama than Neil Gorsuch's last year — more because Kavanaugh has a longer record in public life and a paper trail to match, and less because the Republicans changed the Senate rules last year to allow confirmation with a simple majority, instead of 60 votes.\nWith a one-vote GOP majority in the Senate, and no indication so far that any Republican will defect, the outcome would seem a foregone conclusion. Still, anything can happen in a confirmation hearing.\nSo, here is a crib sheet highlighting six of the issues that will come up this week:\n1. Abortion: Will Kavanaugh overturn Roe v. Wade?\nExpect Kavanaugh to be asked repeatedly about the Supreme Court's 1973 abortion decision, Roe v. Wade. And expect him to follow in the footsteps of Republican nominees over the last 30 years, refusing to say whether he would overrule or restrict the Supreme Court's decision holding that women have a constitutional right to terminate a pregnancy in the first two trimesters.\nKavanaugh has written only two decisions involving abortion. In 2017, he dissented from an appeals court decision ordering the Trump administration to temporarily release an undocumented 17-year-old from custody, so that she could get an abortion.\nThe minor had been detained seven weeks earlier after crossing the border illegally. While in custody, she received clearance from a Texas judge for an abortion, which would be paid for by a third-party organization. Nonetheless, the Office of Refugee Resettlement refused to release her for the abortion, and the ACLU went to court on her behalf. In Garza v. Hargan, the U.S. Court of Appeals for the District of Columbia ordered her temporary release in order to obtain the abortion when she was, at that point, 15 weeks pregnant.\nPolitics Brett Kavanaugh's Record On Abortion Brett Kavanaugh's Record On Abortion Listen · 5:08 5:08\nKavanaugh dissented, arguing that it was not an unconstitutional \"undue burden\" on the girl's rights to allow more time for authorities to find a sponsor for her, so that when she obtained the abortion, the government would not be facilitating it. Kavanaugh accused the majority of essentially allowing \"abortion on demand.\"\nIn a second case, unrelated to Roe but involving abortion, Doe ex rel. Tarlow v. D.C., Kavanaugh authored a majority opinion permitting the D.C. Mental Retardation and Developmental Disabilities Administration to make medical decisions for persons deemed mentally incompetent. The case was brought on behalf of three individuals, two of whom had been forced to have abortions without their consent.\nThe challengers maintained that even if they were incompetent to make medical decisions, they should have been consulted. In his opinion, Judge Kavanaugh wrote that the Constitution does not require that an agency consider the consent of incompetent people when making medical decisions on their behalf. Such a right, he said, is not \"deeply rooted in this nation's history\" nor \"implicit in the concept of ordered liberty.\"\nIn addition to his abortion opinions, Kavanaugh recently delivered two speeches in which abortion played an indirect role. One speech was about the late Chief Justice William Rehnquist, the other about the late Justice Antonin Scalia. In both, Kavanaugh singled out their dissenting decisions in major abortion cases for favorable comments.\n2. Guns: Outlawing them is \"equivalent to a ban\" on speech?\nAs a judge, Kavanaugh has staked out an unusually strong position in favor of gun rights. In 2011, for example, he disagreed with his conservative colleagues, writing a 52-page dissent from a decision that upheld a Washington, D.C. ban on assault weapons and magazines of more than 10 rounds, plus broad registration requirements.\nA ban on a class of arms, he said, is \"equivalent to a ban on category of speech.\"\nMoreover, as he put it, it is not for judges to weigh public safety in evaluating whether a gun law is constitutional. Rather, he maintained that because rapid-fire weapons \"are in common use today\" and \"have not been traditionally banned,\" the Constitution does not allow that they be banned now.\n\"I've been be a lonely voice,\" Kavanaugh said of his position on gun regulation during a speech at the conservative American Enterprise Institute in 2016.\n3. Investigating the president\nThe shadow of President Trump's legal difficulties will play at least some role in the hearings. That's because Kavanaugh has, for nearly two decades, been a critic of these investigations. That, despite the fact that he was one of the lead authors of the Clinton impeachment report submitted to Congress by Independent Counsel Kenneth Starr in 1998.\nPolitics Brett Kavanaugh's Role In the Starr Investigation And How It Shaped Him Brett Kavanaugh's Role In the Starr Investigation And How It Shaped Him Listen · 6:20 6:20\nA year later, however, Kavanaugh strongly suggested that the Supreme Court had been wrong in 1974 to uphold a special prosecutor's subpoena for President Nixon's infamous and incriminating tapes. He argued that by enforcing a subpoena for evidence of a crime, the Supreme Court \"took away the power of the president to control information in the executive branch.\" And he contended that the president's power as chief law enforcement officer \"was diminished dramatically\" by the the ruling. In 2016 his tone was different in a Catholic University Law Review article when he listed the Nixon tapes case as among \"some of the greatest moments in American judicial history ... when judges stood up to the other branches.\"\nTwo years ago, he said that he would like to \"put the final nail in\" the Supreme Court's 7-1 decision in 1988 upholding the post-Watergate independent counsel law. And in a 2009 law review article, Kavanaugh suggested that Congress should forbid all criminal investigations or prosecutions of a sitting president, as well as all civil lawsuits.\n4. Executive power and national security\nKavanaugh, who was in the White House on 9/11, is a staunch advocate of broad and muscular national security powers for the President. While on the D.C. Circuit, he saw the Supreme Court repeatedly limit some of the Bush administration's rules for dealing with enemy combatants.\nThe Supreme Court ruled first that U.S. citizens, and later that all detainees, could not be held indefinitely without having access to a lawyer and without having a chance to challenge their detentions in court. The high court left it to the D.C. Circuit to deal with these cases on an individual basis, and the appeals court largely agreed on how to handle most, though not all, of the cases.\nKavanaugh was the leader of a small group of conservative judges who critics said sometimes sought to undermine the Supreme Court's rulings. In Al-Bihani v. Obama, for instance, Kavanaugh played a central role regarding whether the government's detention authority was subject to international law. The Obama administration agreed that it was, but Kavanaugh maintained that, as a general matter, courts should not be bound by international norms or treaty obligations unless specifically required by statute or \"self-executing\" treaties.\nThat viewpoint is very controversial in light of the fact that the Supreme Court's opinion upholding the government's power to detain people captured on the battlefield rested on international law.\nKavanaugh has been a key player on the D.C. Circuit in upholding the power of military tribunals to try detainees for offenses that are not deemed war crimes, namely conspiracy charges. Until now, the Supreme Court has only blessed military tribunals for war crimes. But proving that an individual was involved in a specific crime, a specific terrorist episode, for instance, is very difficult, whereas proving that an individual was involved with others who did commit such offenses is much easier. Both the Bush and Obama administrations argued that military tribunals can try people for conspiracy alone, and Judge Kavanaugh has been a leading judicial defender of that approach.\n5. His views of the \"administrative state,\" regulations and presidential authority within the Executive Branch\nKavanaugh has, throughout his career on the bench and off, been deeply skeptical of any limits on the president's power to hire or fire at will. That has sometimes conflicted with the structure and powers of quasi-independent regulatory agencies, and congressionally enacted solutions to current problems, like the 2008 financial crash and the mortgage crisis that followed.\nMost recently, Kavanaugh dissented when the D.C. Circuit upheld the structure of the Consumer Financial Protection Bureau, created after the crash to protect consumers' financial arrangements. Kavanaugh would have ruled the law creating the bureau unconstitutional, because it was run by a single individual whose independence was protected; he or she could only be fired for cause, meaning unethical or illegal behavior.\nKavanaugh's views on the so-called \"administrative state\" harken back to pre-New Deal times. He does not, for instance, believe that the Environmental Protection Agency should be able to deal with climate change, because when Congress enacted the Clean Air Act, it didn't know about greenhouse gases and climate change, so it didn't specifically authorize the agency to regulate in that area.\nKavanaugh's position is that if Congress wants to amend the law, it should do that, while his adversaries believe that an agency like the EPA was created to deal with emerging problems and new science.\nLaw Supreme Court Nominee Brett Kavanaugh's Record On The Environment Supreme Court Nominee Brett Kavanaugh's Record On The Environment Listen · 2:37 2:37\nKavanaugh's views are widely applauded by business and condemned by environmentalists. Statistics compiled by the liberal group Public Citizen suggest both sides are right in their predilections: in split decisions, Kavanaugh sided with business 18 times on regulatory issues, and four times against business. On environmental protection, he sided 11 times with business, and twice with environmental groups. And on workers' rights, 15 times with business and twice with workers.\nThe Trump administration trumpets that record. Indeed, the White House issued a one-page unsigned memo this summer proclaiming that \"Judge Kavanaugh has overruled federal agency action 75 times,\" adding that the judge \"helped kill President Obama's most destructive new environmental rules.\"\n\"Judge Kavanaugh has overruled federal agency action 75 times,\" it said, adding that the judge \"helped kill President Obama's most destructive new environmental rules.\"\n6. Campaign contribution limits — and a fight over documents\nEnlarge this image toggle caption Saul Loeb/AFP/Getty Images Saul Loeb/AFP/Getty Images\nDemocrats have waged a fight for more of Kavanaugh's documents from the time he was in the George W. Bush White House. They argue the hearings shouldn't proceed until all of the documents have been released.\nPart of that is because you never know what's going to be in them. For example, a document released Friday night found that Kavanaugh raised questions about the constitutionality of campaign contribution limits. Individual contributions are currently set at $2,700 per person and limits were upheld by the Supreme Court in 1976.\n\"I have heard very few people say that the limits on contributions to candidates are unconstitutional, although I for one tend to think those limits have some constitutional problems,\" Kavanaugh wrote in an email in 2002.\nThere are some three million documents from Kavanaugh's six years in the White House. Fewer than a third have been produced, and President George W. Bush's lawyers are running the process of what gets released and doesn't. That has Democrats crying foul. Republicans note accurately that more Kavanaugh documents have been produced than for any other nominee.\nPolitics Democrats Push For More Records On Supreme Court Nominee Brett Kavanaugh Democrats Push For More Records On Supreme Court Nominee Brett Kavanaugh Listen · 5:01 5:01\nBut that's likely because there are more, and Democrats counter that whatever the number, its less than 20 percent of Kavanaugh's total White House documents. The National Archives has not endorsed the way the documents have been screened — by lawyers for President Bush, but the archives said it could not go review the documents for public disclosure — as it has for other Supreme Court nominees — before the early confirmation date set by Senate Republicans. As a result, the documents from Kavanaugh's first two years in the Bush White House, as an associate counsel, were reviewed by President Bush's lawyer, who at one time worked for Kavanaugh in the White House. Still, it was President Trump that late last week invoked executive privilege, barring disclosure of 100,000 documents that had been reviewed. That still left, as well, all the documents from Kavanaugh's time as staff secretary for President Bush.\nPolitics Democrats Push For More Records On Supreme Court Nominee Brett Kavanaugh Democrats Push For More Records On Supreme Court Nominee Brett Kavanaugh Listen · 5:01 5:01\nSo what's in all these undisclosed documents? That's the question Democrats are asking. \"I'm willing to wager there's a smoking gun here,\" said Democratic Sen. Richard Blumenthal of Connecticut, a member of the Judiciary Committee. \"What are they concealing? What are they afraid the American people will see?\"\nRepublicans portray the whole document controversy as a ploy. Judiciary Committee Chairman Chuck Grassley of Iowa contends the Democrats \"are diverting attention from his extreme qualifications to be on the Supreme Court ... because they don't have anything else to pick at.\"\nNPR's Domenico Montanaro contributed to this report.","url":"https://www.npr.org/2018/09/04/644105543/kavanaugh-confirmation-hearings-to-focus-on-6-hot-button-issues"}
