{"authors":["Monica Hunter-Hart"],"date_download":"2018-10-31 01:41:54","date_modify":"2018-10-31 01:41:54","date_publish":"2018-09-14 18:41:27","description":"Democrats trying to block President Donald Trump's second Supreme Court nominee have bought themselves just slightly more time. On Thursday, the Senate Judiciary Committee agreed to delay the confirmation vote date of Brett Kavanaugh, but it likely…","filename":"data/vaneerConsumption/KavanaughsConfirmationVoteDateWasDelayedButNotEnoughForDemocratsToBeHappy.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/0cc5501a-9649-4194-8f36-cb46f71fef9c-getty-1026685702.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_kavanaughs-confirmation-vote-date-was-delayed-but-not-enough-for-democrats-to-be-happy-11921511_1540950114.html","title":"Kavanaugh’s Confirmation Vote Date Was Delayed, But Not Enough For Democrats To Be Happy","title_page":"Kavanaugh’s Confirmation Vote Date Was Delayed, But Not Enough For Democrats To Be Happy","title_rss":"NULL","source_domain":"bustle.com","text":"Democrats trying to block President Donald Trump's second Supreme Court nominee have bought themselves just slightly more time. On Thursday, the Senate Judiciary Committee agreed to delay the confirmation vote date of Brett Kavanaugh, but it likely won't be enough to prevent the Senate from pushing him through before the next session of the Supreme Court begins in October.\nKavanaugh's hearing is now scheduled to take place on Thursday, Sept. 20, according to CNBC, after it had been on the docket for Sept. 13. Democrats used one of their last playing cards to push it back, a rule that any member of the Senate Judiciary Committee may delay a hearing for one week if they request to do so.\nAsking for a delay is normal. Nominees for judicial positions \"are typically held over for one week after they are first listed on the agenda,\" a spokesperson for Sen. Dianne Feinstein (D-California) told The Washington Examiner earlier this week. It was also expected to happen: \"A vote is unlikely on Thursday [the 13],” a spokesperson for the Senate Judiciary Committee told the paper. However, this isn't exactly great news for people who want to see the nomination blocked. One week is not nearly as long as Democrats had been trying to delay Kavanaugh's confirmation hearing.\nChip Somodevilla/Getty Images News/Getty Images\nCNBC reports that five of the committee's 10 liberal senators raised motions to push the hearing back further to subpoena witnesses and more documents. They argued — as they have been for weeks — that there hasn't yet been adequate opportunity to review Kavanaugh's long paper trail. Feinstein pointed out on Thursday that less than 10 percent of the documentation of Kavanaugh's political career has been disclosed, per CNBC. (The National Archives says it won't be able to release all of the documents until the end of October because there are so many.)\nBut the committee voted 11-10 along party lines against every single one of those motions to delay. Democrats are likely out of options to push Kavanaugh's hearing back any further.\nThose who want to see Kavanaugh's nomination blocked are paying close attention to a sexual misconduct allegation against Kavanaugh that emerged at the end of this week (he's responded, \"I categorically and unequivocally deny this allegation\"). The Intercept reported on Thursday that Feinstein had received a letter that may have detailed an incident alleged to have taken place between Kavanaugh and a girl while they were in high school. Feinstein acknowledged the letter's existence later that day, said she had referred it to the F.B.I., and also said that she was going to honor the woman's request to keep her identity confidential.\nBut The New Yorker published an exposé about the allegation on Friday. The woman, whose identity still has not been disclosed, claims that Kavanaugh attempted to assault her with one of his classmates at a party in the early '80s (she went to high school near him in Maryland). She alleges that Kavanaugh covered her mouth and turned up music to cover up her protesting, but that she was able to get free. Again, Kavanaugh has denied this.\nAccording to The New Yorker, the woman contacted several government officials to tell them of the alleged incident, but when she saw that his confirmation process was moving forward and that he was likely to join the SCOTUS, she eventually stopped trying. She declined to participate in an interview with the magazine. Politico reports that the author of the exposé, Ronan Farrow, has flown out to California to try to persuade her to go public before the vote on Kavanaugh.\nIn response to the allegation, the GOP quickly released a letter signed by 65 women who say they knew Kavanaugh when he was in high school. \"For the entire time we have known Brett Kavanaugh, he has behaved honorably and treated women with respect,\" the letter states. \"That was true when he was in high school, and it has remained true to this day.\"\nIt seems unlikely at this point that even this sexual misconduct allegation will convince the conservative senators who are predisposed to favor Kavanaugh to change their minds. The nation will have to wait to see what happens in the votes.","url":"https://www.bustle.com/p/kavanaughs-confirmation-vote-date-was-delayed-but-not-enough-for-democrats-to-be-happy-11921511"}
