{"authors":["Ken Hutchison"],"date_download":"2018-10-30 23:53:06","date_modify":"2018-10-30 23:53:06","date_publish":"2016-12-05 00:00:00","description":"When you first gaze upon the Z650 you notice its diminutive stature, exposed steel frame, muscular lines of the tank, angular headlamp and minimal bodywork.","filename":"data/vaneerConsumption/KawasakiZ650motorcycleREVIEW.json","image_url":"https://amp.businessinsider.com/images/5845d11eba6eb602688b68b8-640-320.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_kawasaki-z650-motorcycle-review-2016-12_1540943586.html","title":"Kawasaki Z650 motorcycle REVIEW","title_page":"    Kawasaki Z650 motorcycle REVIEW - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Kevin Wing/RideApart It was dark and stormy on that fateful afternoon.\nThe rain was threatening to unleash its soggy fury upon us as we scratched and clawed our way toward the shelter of the infamous Lookout Road House.\nThe driving skill of people in this area seems to diminish exponentially as the rainfall exceeds .001-inch on these scary roads, except for the dump truck driver with his bent bumper and busted headlight, looming ominously in the rearview mirror as we slowed to stop for lunch.\nPress intros mean nothing to Mother Nature and despite the perpetually perfect climate inherent to So Cal, that crazy bitch did her best to dampen our spirits. But our first ride on the new 2017 Kawasaki Z650 was not going to be thwarted, so without further ado, I offer you the following impression of the Z650: I liked it. It was good. Buy one.\nHa-ha, you wish it was that easy! The fact is the Z650 is a very good motorcycle. Over the course of our day-long ride it became obvious that all the hype Kawasaki heaped on this middleweight sport naked was pretty much spot on.\nWhen you first gaze upon the Z650 you notice its diminutive stature, exposed steel trellis frame, gull-style swingarm, muscular lines of the tank, angular headlamp and minimal bodywork. Kawasaki calls the look: \"Refined, Raw.\" On the Pearl White version the frame is green and looks sharp. The Metallic Black version has a grey frame, so it is much more subtle - but both look good. All of these parts combine to make the Z650 a scrappy looking badass that is more intriguing than intimidating, which in turn means it looks like it would be fun to ride.\nAnd I'm happy to report, it is fun. The \"Supernaked\" Zee is powered by the championship-winning 649cc parallel twin that propelled Bryan Smith and Kawasaki to their first AMA GNC1 Flat Track title in 2016, so it's got the heritage of a winner. That heavily-revised twin offers great low- to mid-range power, which makes it ideal for both commuting and blasting through canyons; it should appeal to newbies and experienced riders alike. Riding through town at slow speed revealed the clutch is light at the lever and shifting through the six-speed gearbox is precise, never clunky. The Z is equipped with a slipper clutch, too, so downshifts are always going to be smooth no matter who's at the controls.\nRev up the peppy engine and the stock exhaust actually emits a nice growl compared to its demure mumble at idle. It accelerates strong from a stop, but makes its best power as the digital tach sweeps past 5,000 rpm. If you keep it around 4-5K when you're riding, you'll have good acceleration on tap when you need to roll-on to get you moving. It helps that it has a claimed curb weight of 410 lbs, (which should equate to about 420 lbs with fluids and fuel), either way it's pretty light. There is an inherent buzz to this parallel twin, though. When it's running at 80 mph you will feel vibrations through the one-piece bars. I'd define it as character.\nKevin Wing/RideApart\nSince the road was wet most of the time, everyone was trying to lock up the brakes and see how good the Bosch ABS is. On the rear, it kicks in quick and pulses are noticeable but it works great. To test the front I just progressively pulled the front brake lever harder as we approached intersections until I got it to kick in. As expected, this system is very good. The front end doesn't spring-back too much as the ABS cuts in, which means the non-adjustable front fork is well sorted to handle these situations. The brakes consist of a pair of 300mm petal-type rotors and two-piston calipers up front and a single 220mm disc and piston in back, which are more than good enough to slow down this little bike.\nThe stock Dunlop Sportmax D214 work well in the rain and offered great traction in the cold on the dry, curvy roads we enjoyed earlier in the day. However, the caveat here is that I was very perpendicular when making the ABS kick in and I used good judgment when blasting through turns. I wasn't just mindlessly hoping the tires would stick or that the ABS would magically save me. Remember: ABS reduces the chance of crashing on the brakes but you still need to use your head.\nWe didn't get to officially track mpg but the word is it should be in the 40-45 mpg range. If that's even close to reality that would mean the Z650 would have a touring range in the neighborhood of 160-180 miles from the four-gallon tank. Not too shabby considering Kawasaki imagines the Z will be used for light touring, too. There will be a set of optional side luggage and top case available, along with radiator guard and frame sliders. There are also bungee hooks integrated into the rear pegs so you can strap down your stuff if you forgo the panniers. The rear suspension is adjustable for preload so you can crank that up a bit when you have a passenger or a bunch of stuff loaded on the bike. About the only thing you will be wishing for is a windscreen, since the stock one doesn't do much, but then again, you wouldn't be looking at this bike if that's a deal breaker.\nThere's a new dash that is compact yet full of useful information including a gear position indicator, dual trip meters, fuel gauge, shift light, clock, speedo and a digital tach which you can change the look of the needle if you so desire. It has a faux carbon fiber face to it and it looks good. It also compliments the angular head lamp which is the centerpiece of the new Z650 streetfighter styling. It's much better looking than the squished ramp thing bolted to the front of the last generation Z1000.\nIf you spend a lot of time in the saddle, you'll find the seat is quite comfortable. The front pad is about 2 inches lower than the rear so it has a bit of a backstop to help keep you in place. Seat height is just 30.9 inches, which makes it good for us short people. Also, the rider triangle is designed to be comfortable for riders on the shorter side. I'm right at 5-foot-8 and I could easily touch the ground with both feet and my knees never felt cramped up. Taller riders will get folded up more. Those over 6 feet tall reported it was still comfy, but the riding position was sport-oriented for tall folks.\nWhat Everyone Else Says About the New Kawasaki Z650\n\"Throw a leg over the Z650 and you'll notice that the seat is low. At 30.9-inches, that contributes to a user-friendly feel and enables shorter riders to feel in control the instant they throw a leg over the bike, but also for me (6-foot-3-inches) to feel a bit cramped after 30-some-odd miles.\" Bradley Adams, Cycle World\n\"As for the 649cc Twin, I'll admit it sounds uninspiring at idle or when you're just cruising along like we were on the Coast Highway. After 5,000 rpm, however, the Z comes alive with an intake growl that's loud, fierce, and sounds downright mean.\" Troy Siahaan, Motorcycle.com\n\"I definitely like the Z650's muscular, sculpted gas tank, two-piece seat, and angular front cowl and radiator shrouds. Compared to its chief rivals, the Suzuki SV650 and Yamaha FZ-07, its look is distinctly Kawasaki, and since many buyers of motorcycles in this category are likely to make styling a high priority in their purchase decision, the Z650 will be an attractive option.\" - Jenny Smith, Rider Magazine\nAs I said at the beginning, I like this bike. It's a capable beginner bike, commuter or jack of all trades for someone looking to buy a streetfighter on a budget. At $6,999 for the base model and $7,399 for the ABS-equipped bike we rode at the intro, this motorcycle is going to contend for sales in its class versus the FZ-07 and SV650. I have no-doubt that it will fare better than the ER-6n that previously filled this role for Kawasaki. It looks better and runs better, but we have to wait and see how it stacks up head-to-head.\nWould I buy it? If I was in the market for middleweight I would be into this bike. I'd certainly push a new rider to look this way because it's easy to ride and has a high enough performance ceiling that you could ride it for years and not get bored as your skills advance. Heck, you could even take this to a track day and have a real good time. I like the looks, I think it handles great, it's comfortable and has a pretty good engine. What more do you need?","url":"https://www.businessinsider.com/kawasaki-z650-motorcycle-review-2016-12"}
