{"authors":["Associated Press"],"date_download":"2018-10-23 02:20:14","date_modify":"2018-10-23 02:20:14","date_publish":"2016-01-11 14:13:54","description":"MOSCOW (AP) — Kazakhstan fans could choose their country's next national team coach in an online vote as part of a rare democratic experiment in internationa...","filename":"data/vaneerConsumption/Kazakhstanholdsvotefornewnationalsoccerteam.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393934_Kazakhstan-holds-vote-new-national-soccer-team-coach_1540261214.html","title":"Kazakhstan holds vote for new national soccer team","title_page":"Kazakhstan holds vote for new national soccer team | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kazakhstan holds vote for new national soccer team\nMOSCOW (AP) — Kazakhstan fans could choose their country's next national team coach in an online vote as part of a rare democratic experiment in international soccer.\nFans have been offered a choice between a Kazakh or foreign coach on the federation's website. In the second round, fans will pick a name from a list of coaches, federation spokesman Dmitry Nesterenko told The Associated Press.\nThe candidates will all be realistic hires rather than global stars, Nesterenko said, with \"basically, no (Jose) Mourinho,\" who recently left Chelsea.\nHowever, the Central Asian nation's foray into Internet democracy has been hampered by low participation.\nThe federation said 50,000 votes would be needed to consider the vote valid, but barely 5 percent of that figure had been reached as of Monday evening, with only four days to go. There was a clear preference for a foreign coach, that option leading by 1,732 votes to 836.\n\"There aren't really any problems with popularizing football. People go to the football, watch it, but I can't say why no one is voting,\" Nesterenko said.\nThere is no guarantee that all the votes were cast by Kazakh supporters. Registration is open to registered users of the federation's website, but there is nothing to stop foreigners from going through the automated registration process and casting votes.\nSoccer in Kazakhstan reached a milestone this season when FC Astana became the first Kazakh team to play in the group stage of the Champions League. While it didn't qualify for the knockout stages, Astana managed to remain unbeaten at home in its group games.","url":"https://www.dailymail.co.uk/wires/ap/article-3393934/Kazakhstan-holds-vote-new-national-soccer-team-coach.html"}
