{"authors":["Andre Walker"],"date_download":"2018-10-30 18:15:43","date_modify":"2018-10-30 18:15:43","date_publish":"2015-01-05 16:08:30","description":"A couple declared too fat to work are raking in £2k a month in welfare handouts from the taxpayer.","filename":"data/vaneerConsumption/KebabsAndClaims55StoneCoupleGet2kAMonth.json","image_url":"https://media.breitbart.com/media/2015/01/BeerandCoomb.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_01_05__1540923343.html","title":"Kebabs And Claims: 55 Stone Couple Get £2k A Month","title_page":"Kebabs And Claims: 55 Stone Couple Get £2k A Month | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A kebab-loving couple declared too fat to work are raking in £2k a month in welfare handouts from the British taxpayer. Stephen Beer and Michelle Coomb, from Plymouth, weigh a total of 55 stone and claim their size makes it impossible to find a job.\nThe two will appear tonight on the Channel 5 documentary called ‘Too Fat To Work’. They will be shown planning a £3k wedding, paid for through their housing benefit payments. At the wedding guests were treated to £450 worth of kebabs from their local takeaway. It will be Mr Beer’s fifth marriage.\nBoth are on Disability Living Allowance because of their size, and Beer travels around in a specially modified scooter built for obese people. He has taxpayer funded carers to help him wash and dress because he cannot stand up for long periods.\nWhilst 31-stone Beer has not worked in five years, his 24-stone wife has never had a job at all. The pair are seen discussing jobs they might like to do, with Beer suggesting he might make a good Santa Claus at Christmas. He also discusses losing his cleaning business through a stroke.\nThe couple are part of the forty percent of British people who are either overweight or obese. They are also amongst the 5,500 people who claim benefits due to being too fat, a figure that has doubled in the last five years.\nTonight’s documentary is likely to reignite the debate about whether the benefits culture is cruel to claimants as it encourages people to live unfulfilled lives. Beer and Coomb both claim they would like a gastric band operation to prevent them from continuing to over eat. They say they have misgivings about asking the taxpayer to fund this but are on the NHS waiting list anyway.\nToo Fat To Work will be on Channel 5 at 9pm tonight.","url":"https://www.breitbart.com/europe/2015/01/05/kebabs-and-claims-55-stone-couple-get-2k-a-month/"}
