{"authors":[],"date_download":"2018-10-30 01:18:19","date_modify":"2018-10-30 01:18:19","date_publish":"2016-11-17 00:05:25","description":null,"filename":"data/vaneerConsumption/KeepingthePostalServiceFromGoingPostal.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/11/cliff-clavin-forget-the-fiscal-cliff-cnbc.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862299.html","title":"Keeping the Postal Service From Going Postal","title_page":"Keeping the Postal Service From Going PostalThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Lawmakers have been tinkering around the edges of reforming the way the government delivers the mail, but, unless bolder measures, such as removing the U.S. Postal Service’s (USPS) monopoly status, are taken soon, the problem won’t ever be solved.\nA recent report published by USPS’ Office of the Inspector General (USPS OIG), a government entity tasked with “[helping] maintain confidence in the postal system and improv[ing] the Postal Service’s bottom line through independent audits and investigations,” found USPS’ efforts to restructure itself and provide higher-quality service have largely failed. The report found the primary reason for the failure is the Postal Service has largely ignored opportunities for substantial reform.\nIn 2006, lawmakers passed the Postal Accountability and Enhancement Act, a bill aimed at reducing unnecessary USPS facilities and streamlining processes. Five years later, USPS made further reductions, including reductions in service quality, to help reduce the Postal Service’s spending.\nThe USPS OIG report, published in October, finds those service reductions have done little to solve the government agency’s runaway budget.\nDespite eliminating overnight mail services and reducing delivery speeds in 2015 as part of voluntary service cuts referred to collectively as the “operational window change” (OWC), USPS spent $5.1 billion more than it collected in revenue, and continued to fail to make all of its required entitlement payments to retired employees.\nUSPS OIG auditors wrote in their report OWC was supposed to make USPS faster, stronger, and more efficient. “The Postal Service described the OWC as one of its most significant changes since automating mail processing,” the auditors wrote. “It was designed to allow the Postal Service to process mail on fewer machines, thus using less facility square footage.”\nIt didn’t. Despite the lowered standards, USPS is objectively getting worse at delivering the mail.\n“For the period January through September 2015, the Postal Service reported delayed mail processing increased by almost 638 million pieces (or 51 percent) compared to the same period in fiscal year 2014,” the auditors wrote. “Further, the Postal Service’s service standard measurements indicated that 2-day and 3–5 day First-Class Mail weekly performance scores declined by as much as 7 percent and 34 percent, respectively, compared to the same period a year earlier.”\nOWC didn’t even save the agency money. According to the USPS OIG report, “[T]he Postal Service did not achieveprojected savings associated with the OWC,” because “management could provide support for achieving only 10 percent” of estimated savings.\nIf “one of the most significant changes since automating mail processing” couldn’t reduce USPS’ costs, one must wonder whether the agency is sustainable at all, or can lawmakers deliver a miracle and turn it around?\nUSPS has a government-granted monopoly over much of the mailing industry, a benefit almost unheard of in other countries. However, repealing that monopoly and forcing USPS to compete for consumers’ dollars and services is not unheard of.\nIn an April 2016 publication, Chris Edwards, director of tax policy studies at the Cato Institute, wrote, “Sweden in 1993 became the first major European country to repeal its postal monopoly,” Edwards wrote. “Sweden Post (now PostNord) was put into a corporate structure, but it is still owned by the government. The Netherlands partly privatized its national postal company in 1994. Majority control shifted to the private sector in 1995, and the company later became part of TNT, a global delivery company. Netherlands opened postal markets to competition in 2009. New Zealand cut costs at New Zealand Post in the 1980s, and put the company into corporate form. The country repealed its postal monopoly in a series of laws during the 1980s and 1990s.”\nAs time has gone on, it has become increasingly clear USPS is incapable of operating in an efficient and fiscally responsible way. Coddling the agency by authorizing rate hikes and service cuts, as the government has done for decades, will only allow the institutional rot to fester.\nLawmakers should follow the lead of other countries and encourage USPS to improve itself through competition with private-sector companies, replicating the success other countries’ postal services have had with privatization and deregulation. Continuing to take timid steps and calling it “reform” will only end with the same result such efforts have produced in the past: complete and utter failure.","url":"https://spectator.org/keeping-the-postal-service-from-going-postal/"}
