{"authors":["Associated Press"],"date_download":"2018-10-23 05:55:19","date_modify":"2018-10-23 05:55:19","date_publish":"2016-01-11 18:42:09","description":"NASHVILLE, Tenn. (AP) — Country star Keith Urban hasn't finished his forthcoming album, \"RipCORD,\" but he's already planning a new arena and amphitheater tou...","filename":"data/vaneerConsumption/KeithUrbanplansout2016tourwhilefinishingalbum.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:779c0e405886404d8a8d3924e81a78de-3WAQP5SaQH704788ebcf7e2161e1-542_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394204_Keith-Urban-plans-2016-tour-finishing-album_1540274119.html","title":"Keith Urban plans out 2016 tour while finishing album","title_page":"Keith Urban plans out 2016 tour while finishing album | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Keith Urban plans out 2016 tour while finishing album\nNASHVILLE, Tenn. (AP) — Country star Keith Urban hasn't finished his forthcoming album, \"RipCORD,\" but he's already planning a new arena and amphitheater tour in 2016.\nThe first leg of the RipCORD World Tour will start June 2 in Kansas City, Missouri, and run through Nov. 19 at the Barclays Center in Brooklyn, New York, Urban announced Monday.\n\"I am anxious to get it done,\" he said in a phone interview with The Associated Press on his way into the studio to work on the album. \"'Cause I hate the buildup of anything. If I could, I wouldn't talk about any of it. I would just put it out.\"\nFILE - In this Nov. 4, 2015, file photo, Keith Urban performs at the 49th annual CMA Awards at the Bridgestone Arena in Nashville, Tenn. Urban hasn¿t finished his forthcoming album, ¿RipCORD,¿ but he¿s already planning a new arena and amphitheater tour in 2016. Urban announced on Monday, Jan. 11, 2016, the first leg of the RipCORD World Tour will start June 2 in Kansas City, Mo., and run through Nov. 19 at the Barclays Center in Brooklyn. (Photo by Chris Pizzello/Invision/AP, File)\nUrban has been teasing fans with little snippets of information for months. He's already put out two singles from the record, the Grammy-nominated \"John Cougar, John Deere, John 3:16,\" and his second single, \"Break on Me.\"\n\"I'd much rather have the record out six months before I tour,\" he said. \"I certainly don't want to wait to tour because the record is not done already. I still think the record is going to be out before the tour, probably.\"\nFor \"RipCORD,\" he's been working with a new crop of producers and musicians, including guitarist and producer Nile Rodgers, who won three Grammys for his work with Daft Punk on their hit album, \"Random Access Memories.\"\n\"This last year was a lot of experimenting and working with a lot of different people, much like I did with 'Fuse,'\" Urban said. \"And so now it's just sort of distilling it down to the things that feel right and true.\"\nTour openers include country singer Brett Eldredge, who was the 2014 Country Music Association's new artist of the year, and newcomer Maren Morris, a 25-year-old Texas singer who is expected to release her debut album on the Columbia Nashville label this year.\nUrban will have a busy 2016 with the new album, the tour and the final season of \"American Idol,\" where he serves as a judge.\n\"I am going to miss it,\" he said of the singing competition. \"There is nothing that has quite that feel on television where you can sit down and watch it with your whole family.\"\nBut he's optimistic about the new year.\n\"I feel really good about this year,\" Urban said. \"And I hear that sentiment from a lot of other people. There's a lot of optimism from a lot of people who just want this to be a good year.\"\n__\nOnline:\nhttp://www.keithurban.net\n__","url":"https://www.dailymail.co.uk/wires/ap/article-3394204/Keith-Urban-plans-2016-tour-finishing-album.html"}
