{"authors":["Leith Huffadine For Daily Mail Australia"],"date_download":"2018-10-23 01:08:41","date_modify":"2018-10-23 01:08:41","date_publish":"2016-01-29 14:54:18","description":"A West Australian mother and her toddler have been rescued from a freak wave which washed over a road in Hawaii by 11-time world surfing champion Kelly Slater (pictured), who came to their aid.","filename":"data/vaneerConsumption/KellySlatersavesWestAustralianmotherSarahWhitefromafreakwaveinHawaii.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/30B505F900000578-0-image-a-90_1454096994613.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422799_Surfing-legend-Kelly-Slater-saves-West-Australian-mother-Sarah-White-son-freak-wave-Hawaii_1540256921.html","title":"Kelly Slater saves West Australian mother Sarah White from a freak wave in Hawaii","title_page":"Kelly Slater saves West Australian mother Sarah White from a freak wave in Hawaii | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Eleven-time world surfing champion Kelly Slater has saved a mother and her toddler from a freak wave in Hawaii in a dramatic rescue.\nWest Australian mother Sarah White was walking with her 22-month-old toddler Van on a seaside road in Hawaii recently, when a freak wave 'like a tsunami' swept over it and engulfed them, causing Van to swallow water and sand and Mrs White to become submerged.\nLuckily, Slater happened to be walking nearby and leapt into action, grabbing Mrs White and her son and making sure they were safe.\nThey were saved as huge swells and breaks of up to 45ft battered northern parts of the Aloha State - but it didn't stop the surfers taking up the challenge.\nScroll down for video\nChris White (left) and Sarah White (right), from West Australia, recalled the ordeal in Hawaii. Center is one of their children\nAmerican surfer Kelly Slater (pictured) came to the rescue of Mrs White and her toddler Van, pulling them from the freak wave and ensuring their safety\nThis image shows what is believed to be debris from where the freak wave crossed a road in Hawaii, engulfing Mrs White and her toddler, Van\nSlater is seen riding a wave during the Quiksilver Pro tournament in Hossegor, France, in October\nThey were saved as huge swells and breaks of up to 45ft battered northern parts of the Aloha State - but it didn't stop the surfers taking up the challenge\nSpeaking to 7 News, Mrs White said the wave was 'like a tsunami... just this big flood of water'.\n'The only thing I was thinking of was: I don't want my son to drown, I don't want my son to drown,' she said.\n'I just held onto that pram as long as I could and there - there was a point where I got bumped and I let go and that's when I thought, that's it.'\nSlater pulled the pram upright, and pulled her out of the water where she had been submerged.\nNot only did Slater (pictured) rescue Mrs White and her toddler Van, but he drove them home and came back to check on them the next day\nHer husband, Chris, said Slater described the wave as being about 10-feet of white wash high, and for nearly half a minute, his wife and son couldn't be seen.\nDuring the terrifying ordeal, his son was swallowing water and sand, he wrote on Instagram.\n'His ears and mouth ended up full of sand. So lucky Slater got to the pram and tipped it back up. Sarah is pretty bruised and scraped. Safe to say her phone didn't make it... Could have ended so badly.'\nThe American surfing star did not stop at rescuing them.\nNot only did he drive them home afterwards, he returned the next day to check on the family.\nMr White took to Instagram to thank Slater for his actions in Hawaii\nSlater responded to Mr White on Instagram, saying he had 'randomly' stopped and happened to be in the right place\nMr White described him as a 'legend'.\nHe took to Instagram to thank Slater for his actions.\n'So thankful the surf gods denied @kellyslater today cos [sic] for whatever reason he was right there to save my wife and kid who were swept across a road by a freak wave today. Forever grateful to the great man and so thankful my family is alive and safe,' he wrote.\nSlater responded, writing: 'Thank you! I didn't look at it that way but for some random reason I stopped there when I normally don't and happened to be there. Lifeguards were on it either way and had it handled. So glad all is well and we can (someday) laugh about it. Van's first wave was a huge one! Definitely a WA baby!'.\nMr White's post on Instagram has had over 100 comments, mainly of support for his family and congratulating Slater for his actions.\nDuring the extreme conditions in Hawaii on Wednesday, surfers took to Oahu's Waimea Bay and Maui's Peahi to tackle the huge waves.\nKerry Atwood, an Ocean Safety lifeguard at Waimea Bay for the past 26 years, told Hawaii News Now: 'I think it's one of the most famous big wave surfing spots in the world - and being in the middle of the winter on the North Shore right now, people just can't resist the temptation.'\nDave Yester added: 'It's friggin' giant. It magnetizes me. It attracts me. These big waves make me nervous still, but it's just an amazing show.'\nTwo jet skis were positioned at Waimea Bay as a precaution. By the end of Wednesday lifeguards only let the most experienced surfers into the water.\nSlater, from the U.S. is an 11-time world surfing champion\nChris White (pictured) took to social media to thank Slater for rescuing his wife and child\nHuge swells battered parts of Hawaii as wind picked up. But surfers still wanted to take on the challenge\nTwo surfers hit the huge waves in Waimea Bay, where extra lifeguards stopped novices from going into the water for their own safety","url":"https://www.dailymail.co.uk/news/article-3422799/Surfing-legend-Kelly-Slater-saves-West-Australian-mother-Sarah-White-son-freak-wave-Hawaii.html"}
