{"authors":["Ciara Farmer For Mailonline"],"date_download":"2018-10-22 23:09:20","date_modify":"2018-10-22 23:09:20","date_publish":"2017-03-10 02:03:40","description":"The 32-year-old shared the snap in which she seized a microphone during a BBC Radio 1 event while a then 18-year-old Adele peered on alongside her looking fully in the mood to party","filename":"data/vaneerConsumption/KellyOsbournesharesDECADEoldsnapwithAdele.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E1EF2F900000578-0-image-a-202_1489110588034.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299696_Kelly-Osbourne-shares-DECADE-old-snap-Adele_1540249760.html","title":"Kelly Osbourne shares DECADE old snap with Adele","title_page":"Kelly Osbourne shares DECADE old snap with Adele | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They both found fame at tender ages, with former party-loving spirits.\nAnd on Thursday, Kelly Osbourne gave a peek into the life and soul of parties an entire decade ago as she shared a throwback snap in which she lived it up with a baby-faced Adele in 2007.\nThe 32-year-old posted the snap in which she seized a microphone during a BBC Radio 1 event while a then 18-year-old Adele peered on alongside her, looking fully in the mood to party.\nScroll down for video\nBack in the day: On Thursday, Kelly Osbourne gave a peek into the life and soul of parties an entire decade ago as she shared a throwback snap in which she lived it up with a baby-faced Adele\nKelly delightedly posted the image on Instagram for her 2.2million followers to see as she showed the decade old image of the duo at the Radio 1 Big Day Out.\nAfter years of many different hair colours, in this particular image Kelly was rocking a shock of black hair hacked into an edgy pixie crop.\nHaving become known for her punky style, inspired no doubt by her rock icon dad Ozzy, she went for a nu rave look, complete with a bright yellow slogan T-shirt.\nShe peeled on an over-sized pair of red sunglasses while layering a mass of yellow beads to coordinate with her bold top.\nThrowing it back: The 32-year-old shared the snap in which she seized a microphone during a BBC Radio 1 event while a then 18-year-old Adele peered on alongside her looking fully in the mood to party\nThat was then: After years of many different hair colours, in this particular image Kelly was rocking a shock of black hair hacked into an edgy pixie crop\nAdele meanwhile, fresh from releasing her groundbreaking record Hometown Glory, kept things muted in a grey waistcoat with a long-sleeved black top underneath.\nBeneath the snap she added the caption: '#TBT2007 of me & @adele hosting/starting a conga line at @bbcradio1 #BigDayOut! #BackInTheDay'.\nWhile the duo's connection has been minimal since the deep roots of their long careers, in 2013 Kelly, who was born in London before touring the world with her dad, admitted Adele, alongside Twilight star Robert Pattinson, make her proud of her British roots.\nLook at her now! Adele is now one of the world's hottest music stars\nWay back when: Adele meanwhile, fresh from releasing her groundbreaking record Hometown Glory, kept things muted in a grey waistcoat with a long-sleeved black top underneath\nFollowing the 2013 Golden Globes she revealed: 'I know Adele from years back and I've hung out with Robert Pattinson in London since I was 19.\n'It makes me so proud of my country that they're all doing so well. Rob was at the Soho House party in LA (after the Golden Globes), and the last time I saw him there, his friend was stealing the toilet roll.\n'Everyone was so happy that Adele won Best Original Song (at the Golden Globes). Adele is so well-loved. When she hit the red carpet, everyone's mouths dropped - her skin is glowing. I need to get her baby boy present.'\nThe big reveal: Following the 2013 Golden Globes she revealed: 'I know Adele from years back and I've hung out with Robert Pattinson in London since I was 19'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299696/Kelly-Osbourne-shares-DECADE-old-snap-Adele.html"}
