{"authors":["Hannah Moore For Daily Mail Australia"],"date_download":"2018-10-22 21:59:07","date_modify":"2018-10-22 21:59:07","date_publish":"2017-03-10 00:09:17","description":"Victorian Paralympian Kelly Cartwright says doctors thought she was experiencing 'growing pains' before discovering she had a rare, aggressive form of cancer, which saw her lose her leg.","filename":"data/vaneerConsumption/KellyCartwrightondiagnosiswhichsawherloseherleg.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1EDDFE00000578-0-image-a-17_1489103621748.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4299314_Kelly-Cartwright-diagnosis-saw-lose-leg_1540245547.html","title":"Kelly Cartwright on diagnosis which saw her lose her leg","title_page":"Kelly Cartwright on diagnosis which saw her lose her leg | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kelly Cartwright had been an ambitious athlete since childhood.\nBut a persistent pain in her right knee, which doctors told her was nothing more than 'growing pains' saw her ditch her dream of playing netball for Australia when she was a teenager.\nAt 15, she had her leg amputated to save the rest of her body from a synovial sarcoma, one of the rarest cancers to grow in soft tissue.\nShe was told if she did not lose her leg, she could lose her life.\nAt just 15, Kelly Cartwright was told if she did not have her leg amputated, she could die\n'Basically amputation was my only chance of survival,' she told Fairfax Media.\nThe Victoria-based mother-of-one explained that, despite the invasive procedure she was about to undergo and the severity of her diagnosis, there was not a lot of information available.\n'My Mum and Dad and I were asking my doctor questions he couldn't answer, because he'd never seen anything like it,' she said.\nEarlier, she told Mamamia nobody could make any guarantees for her future - in sport or in general.\nMs Cartwright, who previously held dreams of playing netball for Australia, could not secure a guarantee she would even walk again, let alone play sport\nLife goes on: Now a mother-of-one, Ms Cartwright leads a relatively normal life, and is a Paralympic medallist\n'There was the unknown of whether I would even walk again, let alone play sport,' she told the publication.\n'It happened so quickly, my life was turned upside down within seconds.'\nThankfully for Ms Cartwright, four months after the surgery she was back on her feet, though one of them was prosthetic.\nShe went on to become an acclaimed Paralympian, representing Australia in the Beijing and London Games, and taking home the gold for long jump and silver for the 100m at the latter.\nWinner: At the 2012 London Games, she took out the gold medal for long jump (pictured) and silver for the 100m\nThe Paralympian credits her success to the generous people who helped to raise funds for her first running leg, and has committed herself to The START Foundation, a charity for amputees with sporting ambitions.\nMost recently, Ms Cartwright teamed up with Rare Cancers Australia, who campaign for more funding for rare cancers and who in just two years managed to raise nearly $2million towards helping patients pay for their treatment.\nAgreeing to work with the Foundation was a no-brainer for the athlete, who said: 'Every cancer patient deserves a fair fight'.","url":"https://www.dailymail.co.uk/femail/article-4299314/Kelly-Cartwright-diagnosis-saw-lose-leg.html"}
