{"authors":["Jerome Hudson"],"date_download":"2018-10-30 19:51:41","date_modify":"2018-10-30 19:51:41","date_publish":"2017-02-11 16:44:16","description":"Jim Hoffa, Teamsters' president, says his organization will \"fight\" Kellogg’s decision to shift from direct delivery of its foods to stores.","filename":"data/vaneerConsumption/KelloggsHasTurnedItsBackonWorkingFamilies.json","image_url":"https://media.breitbart.com/media/2016/11/Kelloggs-Cereal-Boxes-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_02_11__1540929101.html","title":"Kellogg's Has Turned Its Back on Working Families","title_page":"Teamsters' President Jim Hoffa: Kellogg's Has Turned Its Back on Working Families","title_rss":"NULL","source_domain":"breitbart.com","text":"Jim Hoffa, president of the International Brotherhood of Teamsters, says his organization will “fight” Kellogg’s decision to shift from direct delivery of its foods to stores, a move that will result in the firing of more than 1,100 full-time workers at Kellogg’s facilities across the country.\n“On February 8, The Kellogg Company (NYSE: K) announced its short-sighted plan to eliminate their U.S.(Keebler) snacks direct store delivery system across the country which will destroy nearly 1,200 good, Teamster jobs in key markets across the country,” Hoffa said in press statement.\n“It is an outrage for Kellogg’s – an iconic American company – to turn its back on working families,” Hoffa said.\nKellogg’s recently announced its decision to move to a “highly efficient warehouse model” and will no longer use a direct store delivery system to bring its products to local grocery stores. The company will instead utilize grocers’ distribution centers.\nThe move is part of Kellogg’s cost-cutting initiative, Project K, launched in 2013.\nThe Michigan-based breakfast food company reported a $53 million loss in the fourth quarter. Cutting its direct store delivery system, Kellogg’s says, “will free up money to invest in activities like advertising that more directly help boost sales,” the Associated Press reports.\nHoffa, however, says the move “is just bad business.”\n“Management’s plan to abandon a system virtually overnight that provides excellent customer service and healthy profits for the company is just bad business,” Hoffa said. “We’ve seen time and time again, when companies chase profits at the expense of sales, like Kellogg’s is doing now, workers and customers suffer and shareholders never get what they’re promised.”\nHoffa added, “Teamsters throughout North America are united to fight Kellogg’s attack for as long as it takes.”\nLast year, Kellogg’s made the politically partisan decision to pull ads from Breitbart News, which spurred a boycott campaign and intense online backlash. The company’s stock has performed much worse in comparison to its breakfast rivals, including Post and General Mills, during the past year.\nFollow Jerome Hudson on Twitter @jeromeehudson.","url":"https://www.breitbart.com/politics/2017/02/11/teamsters-president-hoffa-kelloggs-turned-back-working-families/"}
