{"authors":["Press Association"],"date_download":"2018-10-22 23:18:38","date_modify":"2018-10-22 23:18:38","date_publish":"2017-04-26 07:11:56","description":"Kelly Sotherton wants a 'fresh, clean' Olympic bronze medal and not the one given to Russian drugs cheat Tatyana Chernova, which she regards as 'dirty and tainted'.","filename":"data/vaneerConsumption/KellySothertondemandsfreshclean2008Olympicbronze.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/07/3F97895200000578-0-image-a-37_1493186975428.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_sportsnews_article-4446434_Kelly-Sotherton-demands-fresh-clean-2008-Olympic-bronze_1540250318.html","title":"Kelly Sotherton demands 'fresh, clean' 2008 Olympic bronze","title_page":"Kelly Sotherton demands 'fresh, clean' 2008 Olympic bronze | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kelly Sotherton wants a 'fresh, clean' Olympic bronze medal and not the one given to Russian drugs cheat Tatyana Chernova, which she regards as 'dirty and tainted'.\nThe 40-year-old's finish in the 2008 Beijing Games heptathlon is set to be upgraded to third place after Chernova was belatedly disqualified on Monday having tested positive for a steroid.\nSotherton originally came fifth in the event but has now climbed into the medal positions after first Lyudmila Blonska of Ukraine and now Chernova were found to have doped.\nBritish athlete Kelly Sotherton is due for a second upgrade to bronze from the 2008 Beijing Olympic Games after Russian drugs cheat Tatyana Chernova was stripped of her medal\nSotherton doesn't want to receive the same 'dirty and tainted' medal Chernova received\nThe Briton is hoping to get the opportunity to stand on a podium to receive her Olympic medal - but she does not want the one currently in Chernova's possession.\nShe told the Times: 'If she has had the medal in her house and in her hands for the last nine years why would I want that?\n'Why would I want something that has been around her neck? I don't want that - it seems dirty and tainted.\n'If I am to get a medal I want a fresh, clean one. But I don't care that much about receiving the medal itself because just being recognised goes a long way.'\nChernova has been stripped of a number of medals after a positive drugs test from 2009\nSotherton is also keen to have a medal ceremony now she has finally been upgraded\nSotherton, who won a surprise bronze medal in the heptathlon at the 2004 Games, had already been upgraded to a bronze in the 4x400m relay in Beijing thanks to the belated disqualification of the teams from Belarus and Russia.\nShe added: 'I came away from Beijing feeling a failure and now I have two medals from there and three in all.'\nSotherton retired from athletics in 2012 having won medals at Commonwealth, European, Olympic and world level, indoors and outdoors.\nChernova, 29, has already lost a 2011 world title, 2012 Olympic bronze and 2013 World Student Games gold for a retrospective positive test from the 2009 world championships.","url":"https://www.dailymail.co.uk/sport/sportsnews/article-4446434/Kelly-Sotherton-demands-fresh-clean-2008-Olympic-bronze.html"}
