{"authors":["Sara Tan"],"date_download":"2018-10-30 23:55:03","date_modify":"2018-10-30 23:55:03","date_publish":"2014-08-12 21:30:02","description":"Remember when Kelly Cutrone was like the evil boss (read: wicked witch) that taught intern LC the idea of tough love, but also made her cry sometimes on The City? Well, as it turns out, the People's Revolution publicist is still pretty fierce today…","filename":"data/vaneerConsumption/KellyCutroneHatesKanyeWestandKimKardashianAndIsntToSweetOnTheirFansEither.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/d1b2351c-d2d8-4d6b-8b12-5260495ad0a1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35511-kelly-cutrone-hates-kanye-west-and-kim-kardashian-and-isnt-to-sweet-on-their-fans-either_1540943703.html","title":"Kelly Cutrone Hates Kanye West and Kim Kardashian, And Isn't To Sweet On Their Fans, Either","title_page":"Kelly Cutrone Hates Kanye West and Kim Kardashian, And Isn't To Sweet On Their Fans, Either","title_rss":"NULL","source_domain":"bustle.com","text":"Remember when Kelly Cutrone was like the evil boss (read: wicked witch) that taught intern LC the idea of tough love, but also made her cry sometimes on The City? Well, as it turns out, the People's Revolution publicist is still pretty fierce today and has no qualms about dissing self-proclaimed fashion giants Kimye. In a recent interview with Daily News' Confidenti@l, Kelly Cutrone said Kanye West and Kim Kardashian have no influence on the fashion world whatsoever.\nNever one to be coy, Cutrone shared her extremely scathing opinion about the world's most controversial couple. \"I don’t think there’s one person who really works in the fashion industry who gives a flying f--- about Kanye West,\" said Cutrone. She continued, \"I think they have no influence in the fashion world whatsoever.\"\nThe main reason Cutrone believes this is because she doesn't think either of them are doing anything new or exciting in fashion. Sure, the Givenchy-obsessed duo might have the newest items from the collection before anyone else has them, but does that make them trendsetters in Cutrone's eyes? No. “The truth of the matter is that Kim Kardashian is not doing anything fresh in fashion, either. She’s not getting into the nitty-gritty, super avant-garde players. She’s not even wearing [Vivienne] Westwood yet.\"\nWhile Cutrone does not recognize the couple as fashionistas by any means, she will admit that they have a huge presence on today's society. \"Have Kim and Kanye had an impact on pop culture? Absolutely.\" But she backed up that statement by saying, \"Do I think that (Vogue editor-at-large) Hamish Bowles wakes up in the morning, calls (former Vogue editor-at-large) Andre Leon Talley and says, ‘Did you see those pants that Kanye was rocking on ‘SNL’?’ No.”\nCutrone not only cut into Kimye, but also their fans. \"I mean, most people who watch the Kardashians can’t afford Givenchy. I don’t mean to be mean. Are (counterfeiters) on Canal St. benefiting from it? Probably, but that’s not the fashion world.”\nEeek. Consider yourself added to Kanye West's on-stage rants, Kelly Cutrone. You definitely earned your spot.","url":"https://www.bustle.com/articles/35511-kelly-cutrone-hates-kanye-west-and-kim-kardashian-and-isnt-to-sweet-on-their-fans-either"}
