{"authors":["Alicia Vrajlal","Bianca La Cioppa For Daily Mail Australia"],"date_download":"2018-10-22 22:00:40","date_modify":"2018-10-22 22:00:40","date_publish":"2016-01-11 02:08:15","description":"The gorgeous new mum wore her locks back in a sleek updo, while staring into her mobile phone to capture the selfie.","filename":"data/vaneerConsumption/KellyCartwrightmakesherpostbabyInstagramdebutSIXdaysaftergivingbirth.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/03/3002622F00000578-0-image-a-69_1452481376254.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393238_Kelly-Cartwright-makes-post-baby-body-debut-crop-denim-shorts-just-SIX-days-giving-birth-son-Max_1540245640.html","title":"Kelly Cartwright makes her post-baby Instagram debut SIX days after giving birth","title_page":"Kelly Cartwright makes her post-baby Instagram debut SIX days after giving birth | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She gave birth to her first son Max last Tuesday.\nAnd just six days later, Kelly Cartwright was proud to show off her glowing post-baby figure.\nTaking to Instagram on Sunday, the 26-year-old Australian paralympian shared a photo of herself in a crop top and denim shorts while holding onto her six-day-old son.\nScroll down for video\nSelfie time: Taking to Instagram on Sunday, Australian paralympian Kelly Cartwright shared a photo of herself in a crop top and denim shorts while holding onto her six-day-old son\nShe captioned the image: 'And we are off on our first trip to Geelong to Grandmas house we go. #maxmillersdayout #6daysold (sic)'.\nReady to take her little boy on his first road trip, Kelly opted for a casual chic look, wearing a short white sleeved crop top.\nTeamed with a pair of denim shorts, a generous glimpse of her tummy was on show for all to see.\nThe gorgeous new mum wore her locks back in a sleek updo, while staring into her mobile phone to capture the selfie.\nNew parents: Kelly and her partner Ryan Miller became parents for the first time on Tuesday\nIntroducing: The former paralympian shared the first full picture of their bundle of joy on Friday\nMeanwhile little Max was as cute as a button, wrapped up in a white blanket as he snuggled up to his famous mum.\nLast week Kelly shared the first full picture of her bundle of joy as the newborn peacefully slept while lying on his back.\nShe captioned the picture of her son simply with his name: 'Max William Miller'.\n'The best dad award goes to': She also recently shared the sweet picture of partner Ryan after their first sleepless night with their son\nHis arms raised to rest by his head and covered by little white mittens, matched to his white and grey triangle patterned onesie.\nThe picture of Max asleep on his own is a pleasant change from the picture she shared earlier on after a sleepless night.\nKelly gushed over partner Ryan Miller in the post, and wrote 'The best dad award goes too' [sic] and an emoticon of a finger pointing upwards.\nSpeechless: The loved-up couple announced the arrival of their little dude on Tuesday while sharing the first mother-son image\nIn the snap a shirtless Ryan cradled Max, and although he looked tired he adoringly gazed down at the baby nestled in his arms.\nThe loved-up couple announced the arrival of their little boy on Tuesday while sharing the first mother-son image.\nShe captioned the sweet photo, 'Welcome to the world Max William Miller.'\nHer skin was radiant and glowing as she cuddled her son close to her chest and brightly smiled up at the camera for the picture.\nProud dad: Ryan soon after also took to Instagram to share the news, with a black and white image of Max's hands and hospital bracelet","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393238/Kelly-Cartwright-makes-post-baby-body-debut-crop-denim-shorts-just-SIX-days-giving-birth-son-Max.html"}
