{"authors":["Emily Sheridan For Mailonline"],"date_download":"2018-10-23 02:36:34","date_modify":"2018-10-23 02:36:34","date_publish":"2016-01-11 14:59:54","description":"The American model was spotted party-hopping just hours after her ex-boyfriend Leonardo DiCaprio was named Best Actor In A Drama for The Revenant.","filename":"data/vaneerConsumption/KellyRohrbachpartyhopsafterexLeonardoDiCapriosGoldenGlobestriumph.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/20/300E1E6000000578-0-image-a-23_1452543907254.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393961_Kelly-Rohrbach-shows-leg-cleavage-clingy-pink-dress-party-hops-ex-Leonardo-DiCaprio-s-Globes-triumph_1540262194.html","title":"Kelly Rohrbach party-hops after ex Leonardo DiCaprio's Golden Globes triumph","title_page":"Kelly Rohrbach party-hops after ex Leonardo DiCaprio's Golden Globes triumph  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's made her name as a swimsuit model thanks to her amazing body.\nSo it's no wonder Kelly Rohrbach wanted to show it off as she attended a post-Golden Globes after-party on Sunday night.\nThe model and actress, 25, was spotted party-hopping just hours after her ex-boyfriend Leonardo DiCaprio was named Best Actor In A Drama for The Revenant.\nScroll down for video\nPretty in pink: Kelly Rohrbach shows off her stunning figure in a revealing pink Dion Lee dress as she arrives at the William Morris Agency Golden Globe party at the Chateau Marmont in West Hollywood on Sunday night\nShowing some leg: The daring pink dress showcased the model's stunning legs as she also attended the Weinstein Company/Netflix party at the Beverly Hilton\nThe Sports Illustrated pin-up showed off her toned legs and cleavage in a pale pink satin Dion Lee number as she attended a host of bashes in Beverly Hills and West Hollywood.\nKelly, who has been cast as CJ Parker in the upcoming Baywatch movie, started off her night at the Weinstein Company/Netflix and InStyle/Warner Bros parties at The Beverly Hilton.\nShe then moved on to the Chateau Marmont for her agency Wiliam Morris's bash, where she joined the likes of Chanel Iman, Jaimie Alexander and Peter Facinelli.\nBack on the market: The 25-year-old hit the town following her recent split from actor Leonardo DiCaprio\nThe next Pamela Anderson? Kelly has been cast as CJ Parker in the upcoming Baywatch movie\nKelly's attendance at the party came after her recent ex Leonardo picked up an accolade for his performance as 19th century frontiersman Hugh Glass.\nAccepting his accolade in front of his peers, Leonardo, 41, said: 'This film was about survival, adaptation and the triumph of the human spirit and more importantly it was about trust.\n'There is nobody more deserving of that trust than our director Alejandro Inarritu. I've never had an experience like this in my entire life. The depths he went to are unfathomable.'\nLeonardo and Kelly's split was first reported last week with sources claiming they parted ways over a month ago.\nGirl about town: The 25-year-old looked flawless as she went from party to party\nParty-hopper: Kelly also attended the Instyle and Warner Bros party at the Beverly Hilton Hotel\nThe pair were last spotted together over Thanksgiving in November, but by early December they were done.\nAn insider told Us Weekly: 'They’ve been broken up for over a month. It was mutual. They both have intense work schedules and a lot going on in their lives right now. They both needed to take a break because of that. They are still friends and talking but it’s over.'\nLeonardo and Kelly were first linked back in June after the actor was previously said to have enjoyed a fling with pop star Rihanna.\nPrior to Kelly, Leonardo has dated a host of leggy blondes - predominantly models - including Toni Garrn, Erin Heatherton, Bar Refaeli, Blake Lively and Gisele Bundchen.\nAll that glitters: Model Chanel Iman channelled old Hollywood glamour in a floor-length silver number as she arrived at the Chateau Marmont\nGreen with envy: Actress Jaimie Alexander looked lovely in a sweeping green gown as she attended with fiance Peter Facinelli\nHe's a winner: Kelly's ex Leonardo accepts Best Actor In A Drama for The Revenant during the Golden Globes","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393961/Kelly-Rohrbach-shows-leg-cleavage-clingy-pink-dress-party-hops-ex-Leonardo-DiCaprio-s-Globes-triumph.html"}
