{"authors":["Sarah Jones For Dailymail.Com"],"date_download":"2018-10-22 20:44:01","date_modify":"2018-10-22 20:44:01","date_publish":"2016-01-29 03:18:07","description":"The 34-year-old singer kept it chic while out and about with her one-year-old son in Los Angeles on Thursday in a pink Chanel scarf and carried a grey handbag by the designer label, as well","filename":"data/vaneerConsumption/KellyRowlandbondswithsonTitanastheyrunerrandstogetherinLA.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/30AE18C700000578-0-image-a-9_1454026626512.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421939_Kelly-Rowland-bonds-sweet-son-Titan-run-errands-LA_1540241041.html","title":"Kelly Rowland bonds with son Titan as they run errands together in LA","title_page":"Kelly Rowland bonds with son Titan as they run errands together in LA | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's a doting mom.\nAnd Kelly Rowland was spotted enjoying time with her young son on Thursday in Los Angeles.\nThe 34-year-old kept it chic while out with her one-year-old, Titan Jewell Witherspoon.\nStylish singer! Kelly Rowland, 34, kept it chic while out with her one-year-old son, Titan Jewell Witherspoon in Los Angeles on Thursday\nThe former Destiny's Child singer wore a pink Chanel scarf around her neck and carried a grey handbag by the designer label, as well.\nThe four-time Grammy winner turned an ordinary outfit into a fashion statement with the haute couture accessories.\nHer rose-coloured shawl added a pop of colour to her achromatic ensemble which included grey skinny jeans and a white top.\nRowland finished her look with a pair of white Converse sneakers and kept shaded behind a pair of large movie star shades.\nHaute couture: The former Destiny's Child singer wore a pink Chanel scarf around her neck and carried a grey handbag by the designer label, as well\nShe soaked up some sun as she kept a tight grip on the toddler, her son with husband and manager Tim Witherspoon.\nTitan looked darling in a grey sweatshirt and black pants, with white high-top sneakers as he held onto his mom.\nThe busy mother-of-one has had her hands full lately as the night before she attended a promotional event in New York as she's partnering with Seagram's Escapes.\nPretty in pink! The Grammy winner's rose-coloured shawl added a pop of colour to her achromatic ensemble which included grey skinny jeans and a white top\nTiny tot: Titan looked darling in a grey sweatshirt and black pants, with white high-top sneakers as he held onto his mom\nKelly is lending her name to introduce the beverage maker's new line of signature flavors and sampled the cocktail treats which included Pink Pineapple Passion and Orange Sassy Swirl.\nKelly took to Twitter during the day and wrote: 'So excited to announce my partnership with @SeagramsEscapes and introduce our new flavors!'\nAdditionally the singer is preparing to release new music next month and will also be seen on her BET reality-based show, titled Chasing Destiny which premieres April 5.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421939/Kelly-Rowland-bonds-sweet-son-Titan-run-errands-LA.html"}
