{"authors":[],"date_download":"2018-10-30 01:05:20","date_modify":"2018-10-30 01:05:20","date_publish":"2014-09-25 00:00:00","description":null,"filename":"data/vaneerConsumption/KenBurnsMakesRoomonRushmoreforEleanorRoosevelt.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2014_09_ken_burns_makes_room_on_rushmore_for_eleanor_roosevelt_1540861520.html","title":"Ken Burns Makes Room on Rushmore for Eleanor Roosevelt","title_page":"Ken Burns Makes Room on Rushmore for Eleanor Roosevelt","title_rss":"NULL","source_domain":"americanthinker.com","text":"Ken Burns Makes Room on Rushmore for Eleanor Roosevelt\n“Ambitious” is the obvious description of the recently aired 14-hour documentary on Theodore, Franklin, and, disappointingly, Eleanor Roosevelt. Produced by Ken Burns, the video documentarian whose often tedious productions have dominated public television for over two decades, he delivers an informative, well-designed, and watchable effort, at least for the first five 2-hour parts of the 7-part series on PBS. The writing and video material displayed were much improved. Geoffrey Ward, not Ken Burns, handled the screenplay, a huge help in conveying the useful information available. Producer Burns avoided the melancholy musical score used in his better-known presentations. The old format for attribution was dropped and the usual political bias was seemingly less severe. Remember the Civil War episodes and the tedious verbal identifications? Or the coverage of the American Indians that depicted all whites as genocidal maniacs? His story of baseball in America was about race, not America’s game. His Mark Twain series made viewers think Samuel Clemens wasn’t funny.\nBy combining the lives of TR and FDR, the viewer was kept engaged as the drama of their lives coincided with the calamitous history of the first half of the 20th century. That TR’s Republican Oyster Bay branch of the family, and FDR’s Democrat Hudson River Roosevelts are considered American royalty makes for a sure-fire drama. TR charged into life at full speed with verve and undaunted courage, prepared to take on anything that came his way, or launch adventures and challenges he concocted himself. The shrewd and politically wise FDR concealed his innermost feelings and motives, an attribute TR was incapable of achieving. TR led the famous charge on San Juan Hill, and nearly died exploring an uncharted river deep in the Amazon jungle. FDR displayed courage of even superior magnitude when struck down by the cruel onset of polio in his mid-30s, just as his political career was on the uptick. Rarely did the series disappoint, until it sank under the weight of political ballast. Juxtaposing Teddy’s and Franklin’s lives left viewers unaware that an opening was being craftily concocted to insert another Roosevelt -- Eleanor, FDR’s wife. By the end of the series, she had been elevated to Mt. Rushmore heights for apparently political purposes. In Episode 5, the fix is in. The socialist Eleanor never relents in her hectoring to persuade her husband to follow the usual litany of utopian causes and programs. To his credit, FDR defied her as best he could under withering fire from his virago of a wife. After that, it’s the Eleanor’s show and her efforts for women’s rights, minority rights, guaranteed annual wages, union rights, and friendship with the Soviet Union. Burns and writer Ward glossed over the 1940 Democratic national convention by implying it was FDR, not Eleanor, who told the delegates he would step down as a candidate if Henry Wallace was turned down as his running mate. Wallace was eventually tapped as VP and sent after the election on peacekeeping missions to the USSR and China. Upon his return, he penned a subversive piece for the New York Times titled “The Dangers of American Fascism,\" in which he condemned the rising tide of anti-Soviet propaganda, called for One World government in order to eliminate nationalism and, consequently, imperialism. In 1944, as FDR was nominated for an historical fourth term, the evidence against Wallace’s socialist beliefs (not to mention his weird relationship with a Theosophist guru) had become so overwhelming that he was dropped like a hot potato, with Harry Truman selected in his place. Here was a good time for Burns and Ward to state how fortunate America had been historically to nominate or elect the right person at the right time, including his subjects TR and FDR. Had this not been the case, an international socialist would have become president of the United States when FDR died four months after taking office in 1945. It is believed by historians Wallace would not have dropped the atomic bomb on Japan, and certainly he would have allowed the Soviet Union free rein over the postwar world, even beyond what was handed to Stalin at Yalta. And Eleanor would have achieved her goal of placing a pro-Soviet communist sympathizer in the Oval Office. The omission of the details of the Wallace issue exemplified the goal of the Roosevelt series to brainwash rather than inform. The derring-do of Teddy and the ferocious bravery of FDR are washed away in an attempt to deify Eleanor and praise her far Leftist political views. In retrospect, the program appears in the rear-view mirror as a greedy act of cannibalism of two great men to plug the Democratic Party and elevate the role of women to pay homage to the politically-correct feminists of our era. Ken Burns hasn’t evolved into a more accurate historian and filmmaker with \"The Roosevelts: An Intimate History\". He has demonstrated, beyond a doubt, he is a propagandist who disguises his political agenda in celluloid.","url":"https://www.americanthinker.com/articles/2014/09/ken_burns_makes_room_on_rushmore_for_eleanor_roosevelt.html"}
