{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-23 00:49:38","date_modify":"2018-10-23 00:49:38","date_publish":"2016-01-11 10:45:37","description":"Kendall Jenner, 20, didn't appear ready to return to the glitz and glamour of the Hollywood awards circuit, as she shunned the Golden Globes in favour of spending time with a pal on Sunday.","filename":"data/vaneerConsumption/KendallJennerskipsGoldenGlobesafterpartywithKourtneyKardashianandKylie.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/10/3007399000000578-0-image-a-51_1452507010693.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393597_Kendall-Jenner-shuns-Golden-Globes-favour-make-free-visit-pal-sisters-Kylie-Jenner-Kourtney-Kardashian-attend-star-studded-afterparty_1540255778.html","title":"Kendall Jenner skips Golden Globes afterparty with Kourtney Kardashian and Kylie","title_page":"Kendall Jenner skips Golden Globes afterparty with Kourtney Kardashian and Kylie  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She recently returned from a relaxing getaway in St. Barts where she was pictured getting close and personal with rumoured beau Harry Styles.\nAnd Kendall Jenner, 20, didn't appear ready to return to the glitz and glamour of the Hollywood awards circuit just yet, as she shunned the Golden Globes in favour of spending time with a pal on Sunday.\nThe model cut an uncharacteristically low-key figure as she stepped out make-up free. She wore a baggy black and grey jumper with a pair of leggings and black Nike trainers.\nScroll down for video\nChilled out: Kendall Jenner, 20, didn't appear ready to return to the glitz and glamour of Hollywood just yet as she shunned the Golden Globes in favour of spending time with a pal on Sunday\nThe Keeping Up With The Kardashians star covered her eyes with a pair of circular shades. As she reached up to brush her long brunette locks off her face she revealed a golden bracelet on her left wrist.\nKendall exited her black Range Rover carrying a small black leather handbag with a white and green pom-pom attached.\nAs she made her way up the stairs of her friend's home, her impressively pert derriere was on full display.\nSee the latest updates on Kendall Jenner as she skips the Golden Globes afterparty\nSister act: Kylie Jenner, 18, and Kourtney Kardashian, 36, teamed up for a girls' night out at a Golden Globes after party on Sunday.\nRelaxed: The model cut an uncharacteristically low-key figure as she stepped out make-up free. She wore a baggy black and grey jumper with a pair of leggings and black Nike trainers\nWindswept: The Keeping Up With The Kardashians star covered her eyes with a pair of circular shades. As she reached up to brush her long brunette locks off her face she revealed a golden bracelet on her left wrist\nMeanwhile, Kylie Jenner and Kourtney Kardashian teamed up for a girls' night out at a Golden Globes after party on Sunday.\nThe 18-year-old reality star and her older sister, 36, both put on a dazzling show in sparkly dresses at the InStyle And Warner Bros bash at the The Beverly Hilton Hotel.\nThe pair have had their fair share of boy drama lately; Kylie's boyfriend Tyga has been accused of cheating with a Brazilian model while Kourtney split with Scott Disick earlier this year after he was pictured with another woman.\nShut the door: Kendall's black leggings showcased her lithe legs and pert derriere\nThe climb: As she made her way up the stairs of her friend's home, her impressively pert rear was on full display\nKourtney, who has three children with Disick, also had a brief fling with Kylie's pal Justin Bieber late last year.\nBut both looked eager to party away their worries as they mingled with an A-list crowd at the party.\nSince returning from her tropical getaway, Kendall has kept a relatively low profile. On Saturday she caught up with pal Hailey Baldwin, who had been holidaying in the Caribbean herself in the festive period, alongside Justin Bieber.\nAnd considering Kendall's sister Kourtney was seen out with the singer before Christmas, they no doubt had a lot to catch up on.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393597/Kendall-Jenner-shuns-Golden-Globes-favour-make-free-visit-pal-sisters-Kylie-Jenner-Kourtney-Kardashian-attend-star-studded-afterparty.html"}
