{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:37:49","date_modify":"2018-10-22 23:37:49","date_publish":"2017-03-10 03:46:19","description":"The reality star with a modeling side gig paired the denim cutoffs with a white sleeveless crop top over a long-sleeved sheer number.","filename":"data/vaneerConsumption/KendallJennergoesbareleggedintinydenimshorts.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21F25800000578-0-image-a-10_1489139601333.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299906_Kendall-Jenner-goes-bare-legged-tiny-denim-shorts_1540251469.html","title":"Kendall Jenner goes bare-legged in tiny denim shorts","title_page":"Kendall Jenner goes bare-legged in tiny denim shorts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kendall Jenner decided to treat the world to a view of her bare legs on Thursday.\nThe reality star with a modeling side gig donned a pair of short shorts for a shopping trip in Beverly Hills.\nShe paired the denim cutoffs with frayed hems with white ankle boots.\nScroll down for video\nBare legged: Kendall Jenner donned a pair of short shorts for a shopping trip in Beverly Hills. She paired the denim cutoffs with frayed hems with white ankle boots\nKendall added a wide belt with gold buckle and a white sleeveless crop top over a long-sleeved sheer number.\nShe walked with a small mustard-color purse slung across her body on a gold chain.\nThe Keeping Up With The Kardashians castmember tied the front of her dark hair into a messy topknot and left the rest of it loose.\nShopping trip: The reality star, 21, cheekily showed off her long lean legs as she headed back to her car\nKendall's arched brows were penciled in giving her a somewhat surprised expression.\nHer eyes were rimmed with mascara and she wore a touch of blush and red lipstick.\nShe also shared an Instagram selfie Thursday showing her behind the wheel of her car with leopard ears and a black button nose. She captioned it: 'Baby bear.'\nClose up: Kendall also shared this Instagram selfie with filter while sitting in her car Thursday\nThe daughter of Kris and Caitlyn Jenner and older sister of Kylie Jenner returned stateside from France on Tuesday night after Paris Fashion Week.\nShe'd touched down in LAX in a fur jacket over a gray tee and baggy gray sweatpants and accompanied by two bodyguards.\nKendall, whose parents are Kris Jenner and Caitlyn Jenner, had on a gray t-shirt and baggy gray sweatpants under the fur.\nShe carried an alligator skin purse and wore her dark hair tied back from her face.\nDespite looking like she didn't want any attention, she did peek up above her shades at the people around her as two bodyguards cleared the way for her.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299906/Kendall-Jenner-goes-bare-legged-tiny-denim-shorts.html"}
