{"authors":["Tanya Ghahremani"],"date_download":"2018-10-31 00:11:04","date_modify":"2018-10-31 00:11:04","date_publish":"2014-08-12 20:18:29","description":"Update: Kendall Jenner denies ever throwing money in a waitress' face and is threatening to sue her for defamation. Yikes! Talk about bad press. How much of an aneurysm do you think Kris Jenner is having right about now with this news story out…","filename":"data/vaneerConsumption/KendallJennerPullsScottDisicksMoveRudelyThrowsMoneyatWaitress.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c94e4ff6-4aa9-4dde-a9b7-71ae3f956987.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35507-kendall-jenner-pulls-scott-disicks-move-rudely-throws-money-at-waitress_1540944664.html","title":"Kendall Jenner Pulls Scott Disick's Move & Rudely Throws Money at Waitress","title_page":"Kendall Jenner Pulls Scott Disick's Move & Rudely Throws Money at Waitress","title_rss":"NULL","source_domain":"bustle.com","text":"Update: Kendall Jenner denies ever throwing money in a waitress' face and is threatening to sue her for defamation. Yikes! Talk about bad press. How much of an aneurysm do you think Kris Jenner is having right about now with this news story out there? According to Page Six (who took the story from a source actually involved in it, so personally, I believe it), Kendall Jenner maybe threw a tantrum at an NYC restaurant after her server, who coincidentally once starred in MTV's failed American version of Skins , refused to serve her alcohol because everyone and their mom knows that Jenner is under 21. If this is true — Kendall, girl, you better check yourself...before you wreck yourself.\nHere are the deets: Jenner and her friend Hailey Baldwin (yes, another Baldwin family offspring) were reportedly dining at an NYC restaurant when aforementioned former Skins star-turned-waitress, Blaine Morris, refused to serve Jenner alcohol. Jenner apparently flipped, and then left the restaurant without paying her $60 bill. When Morris chased Jenner and Baldwin down the street, the two friends reportedly laughed at Morris, and Jenner \"took a couple of $20 bills out of her wallet, threw them at the server and walked away, not even counting if it was enough or if it included a tip.\"\nHmm. Where could Kendall possibly have learned this behavior from? Oh, right: That's pretty much exactly what Scott Disick did in a season four episode of Keeping Up With the Kardashians, only Disick took it a step further and shoved the money right into the waiter's mouth. And that was caught on camera:\nApparently, Kylie Jenner reportedly also threw a tantrum when she was denied bottle service at a Beverly Hills hotel last year, and she's even younger than Kendall. So, y'know, no one should really be shocked if this is true.\nMorris herself confirmed the story on Twitter, with the following tweet that was luckily screencapped before she locked her account (probably to, y'know, avoid the wrath of the Kardashian clan):\nPoor, poor Morris. On another note, she was kind of one of the best parts of that godawful Skins remake on MTV (which was canceled after a handful of episodes, unsurprisingly) so at least she has that consolation.\nRii-ight.\nImage: fvckanonymous/Tumblr; nicoola-s/Tumblr","url":"https://www.bustle.com/articles/35507-kendall-jenner-pulls-scott-disicks-move-rudely-throws-money-at-waitress"}
