{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 03:00:48","date_modify":"2018-10-23 03:00:48","date_publish":"2017-03-16 13:40:12","description":"The 21-year-old model called police at around 1am on Thursday morning after she noticed jewelry missing from her bedroom and was frightened someone was still in the house, according to TMZ .","filename":"data/vaneerConsumption/KendallJennersHollywoodHillshomeisburglarized.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54B15B00000578-0-image-a-47_1489673349859.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320290_Kendall-Jenner-s-Hollywood-Hills-home-burglarized_1540263648.html","title":"Kendall Jenner's Hollywood Hills home is burglarized","title_page":"Kendall Jenner's Hollywood Hills home is burglarized | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kendall Jenner has reportedly had $200,000 of jewelry stolen from her Hollywood Hills home.\nThe incident, which was initially thought to be a burglary, is looking more like an inside job as more details of the situation emerged on Thursday.\nThe 21-year-old model called police at around 1am on Thursday morning after she noticed jewelry missing from her bedroom and was frightened someone was still in the house, according to TMZ.\nKendall Jenner called police on Thursday morning after she discovered $200k of jewelry missing from her bedroom\nNot a burglary: After initial reports it now seems one of Kendall's guests took the jewelry during a party\nCops arrived and conducted a thorough search of the property but found no suspects or evidence of forced entry.\nIt was originally claimed Kendall was alone at the home and called 911 after hearing a noise in the house.\nLaw enforcement sources are now telling TMZ that Kendall was actually having a party with a group of friends on Wednesday night.\nDuring the evening an alarm warning went off when someone opened a door but Kendall apparently thought nothing of it.\nThe source says Kendall left her friends in her home at midnight and returned just after 1am to find her jewelry box open and that's when she called the police.\nSources now say police are sure it was an inside job as Kendall (pictured on March 7) had some friends round on Wednesday night and suspect 'knew exactly where she kept her bling'\nActivity: News crews are pictured outside the property on Thursday\nCriminal investigation: Detectives were also spotted arriving to Kendall's house\nPolice are apparently now certain that the thief knew exactly where Kendall keeps her jewelry - and if they were invited as a guest it's a theft and not a burglary.\nIt's not the first time Kendall has been the victim of a crime.\nIn August 2016 a stalker managed to make his way up the driveway of her home and make contact with her.\nShe was granted a permanent restraining order against Shavaughn McKenzie who was accused of following the runway model and repeatedly knocking on her car window on August 14.\nNice ice: The 21-year-old star shows off some of her jewelry on Instagram\nThe KUWTK star bought the six-bedroom home from Emily Blunt and John Krasinski for $6.5 million in 2016\n'I've never been so scared in my life,' Kendall said in a court appearance at the time.\nThe KUWTK star bought the six-bedroom home - perched above the legendary Chateau Marmont - from Emily Blunt and John Krasinski for $6.5 million in 2016.\nThe 4,800-square-foot estate includes a swimming pool, rooftop patio and floor-to-ceiling windows.\nIn August 2016 a stalker managed to make his way up the driveway of her home and make contact with her\nKendall's sister Kim Kardashian was robbed at gunpoint in October.\nA gang of masked men forced their way into her Paris apartment, tied her up at gunpoint and stole jewelry worth $10million.\nAs result of the heist, Kim withdrew from the public eye for months, eventually re-emerging at a beauty seminar in Dubai in January.\nThe incident highlighted how much of their lives the famous family document on social media, including Kim, who had been flashing her $4 million emerald-cut engagement ring on Instagram shortly before the robbery.\nKendall's sister Kim Kardashian was the victim of a robbery in October when thieves forced their way into her Paris apartment, tied her up and stole her jewelry","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320290/Kendall-Jenner-s-Hollywood-Hills-home-burglarized.html"}
