{"authors":["Jasmin Sahota For Mailonline"],"date_download":"2018-10-23 03:21:46","date_modify":"2018-10-23 03:21:46","date_publish":"2017-03-16 14:12:50","description":"The Keeping Up With The Kardashians star, 21, flaunted her statuesque figure while posing up a storm for Penshoppe clothing line.","filename":"data/vaneerConsumption/KendallJennerflauntsherstatuesquefigureforPenshoppe.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54687B00000578-0-image-a-42_1489670255221.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320262_Kendall-Jenner-flaunts-statuesque-figure-Penshoppe_1540264906.html","title":"Kendall Jenner flaunts her statuesque figure for Penshoppe","title_page":"Kendall Jenner flaunts her statuesque figure for Penshoppe | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's one of the most sought-after models in the industry.\nAnd Kendall Jenner proved why she has found such success in the fashion world, as she flaunted her statuesque figure while posing up a storm for Penshoppe clothing line.\nThe Keeping Up With The Kardashians star, 21, looked every inch the supermodel as she showed off her genetically-gifted looks for the retro-themed photoshoot.\nScroll down for video\nNaughty and nude! Kendall Jenner, 21, flaunted her statuesque figure while posing up a storm for Penshoppe clothing line\nThe brunette beauty teased a glimpse of her tanned and toned tummy in a ribbed crop top, featuring peek-a-boo cut-out details.\nKendall donned a minimal make-up look, drawing attention to her natural beauty while she gave a seductive look into the camera lens.\nIn another snap, the reality star sat inside of an old-school car wearing a thigh-grazing pink frock which perfectly paraded her long and lithe legs.\nWith the sun beaming onto her face, another shot showed the rising star casually caressing her long chestnut tresses as she posed for the fashion line.\nModel behaviour: The Keeping Up With The Kardashians star, 21, looked every inch the supermodel as she showed off her genetically-gifted looks for the retro-themed photoshoot\nPoser: With the sun beaming onto her face, another shot showed the rising star casually caressing her long chestnut tresses as she posed for the fashion line\nThe stunning star ensured her long and lean frame was on full display as she stood tall in a thigh-skimming mini-skirt as she lent on the truck.\nMeanwhile it's been reported that Kendall is the latest celebrity to become victim to a jewellery theft, just month's after her sister Kim Kardashian's gunpoint robbery in Paris.\nThe reality star's Hollywood Hills home was burglarised on Wednesday, according to a report from TMZ.\nThe model called police after she noticed jewellery missing from her bedroom but no suspects were found when authorities arrived at the scene.\nAll eyes on her: Kendall donned a minimal make-up look, drawing attention to her natural beauty while she gave a seductive look into the camera lens\nAccording to TMZ the 21-year-old left her home around noon on Wednesday and returned at 8pm. She didn't notice anything suspicious until 1am when she discovered the items were missing.\nKendall then called the police who searched the property but found no evidence of forced entry.\nLaw enforcement sources told TMZ that Kendall called 911 after hearing a noise in the house and believed a burglar may still be lurking.\nHowever, after a thorough search of the property police found no suspects.\nThe KUWTK star bought the six-bedroom home from Emily Blunt and John Krasinski for $6.5 million in 2016.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320262/Kendall-Jenner-flaunts-statuesque-figure-Penshoppe.html"}
