{"authors":["Andrew Flanagan"],"date_download":"2018-10-23 01:57:32","date_modify":"2018-10-23 01:57:32","date_publish":"2017-03-30 00:00:00","description":"The \"best rapper alive\" dropped the presumptive first single from his forthcoming album on Thursday night.","filename":"data/vaneerConsumption/KendrickLamarsVideoForHumbleIsAMustWatch.json","image_url":"https://media.npr.org/assets/img/2017/03/30/kendrick-lamar-humble_wide-243569df6aa6cf72dbd6355e439c43d0060cdd9d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_allsongs_2017_03_30_522127680_kendrick-lamars-video-for-humble-is-a-must-watch_1540259852.html","title":"Kendrick Lamar's Video For 'Humble' Is A Must-Watch","title_page":"Kendrick Lamar's Video For 'Humble' Is A Must-Watch : All Songs Considered : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Kendrick Lamar's Video For 'Humble' Is A Must-Watch\nYouTube\nKendrick Lamar dropped the presumptive first single — titled \"Humble\" — from his highly anticipated forthcoming album on Thursday night, just a week after teasing new music with a cryptic Instagram post.\nThe song, less exploration of contrition on the part of Lamar than an instruction to his peers, picks up a thread NPR Music first examined following that album teaser: how the \"best rapper alive\" might explore the theme of God, religion and personal growth. (In the previous non-album single, \"The Heart Part 4,\" Lamar stuck to a similar narrative: \"Tell 'em that God comin'.\")\nThe video was directed by Dave Meyers and The Little Homies, the former responsible for innumerable iconic music videos himself, the latter for several Top Dawg Entertainment videos, including Lamar's most notable. Together, they produced a PSA featuring the rapper and Barack Obama last year.\nLamar opens his first verse with the rhyme \"Wicked or weakness, you gotta see this,\" and truer words haven't been spoken this year. \"Humble\" is packed with heavy allusions and striking imagery: Kendrick in Jesus' seat at The Last Supper, Kendrick in a sea of black heads, Kendrick passing the Grey Poupon.\nThe video is a gorgeous volley, and Lamar raps in a consistently clipped, monotonic manner. It's no wonder that in its first 90 minutes on YouTube, \"Humble\" generated nearly 500,000 views on YouTube.\nHis fourth album, still untitled, is expected to be released April 7.","url":"https://www.npr.org/sections/allsongs/2017/03/30/522127680/kendrick-lamars-video-for-humble-is-a-must-watch"}
