{"authors":["Tom Farmery For Mailonline"],"date_download":"2018-10-23 02:56:41","date_modify":"2018-10-23 02:56:41","date_publish":"2016-01-29 17:42:49","description":"When you're as fashionable on the pitch as Barcelona's Neymar is it's equally important to surround yourself with those who are setting trends off it.","filename":"data/vaneerConsumption/KendallJennermeetsNeymaratMangolaunchinBarcelona.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B4440C00000578-0-image-a-29_1454088575483.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423166_Keeping-Neymar-Barcelona-star-meets-Kendall-Jenner-boss-Luis-Enrique-says-play-against-Atletico-Madrid_1540263401.html","title":"Kendall Jenner meets Neymar at Mango launch in Barcelona","title_page":"Kendall Jenner meets Neymar at Mango launch in Barcelona | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Enrique: 'If I didn't put him in they'd (the Barcelona fans) would kill me!'\nWhen you're as fashionable on the pitch as Barcelona's Neymar is it's equally important to surround yourself with those who are setting trends off it.\nThe Brazilian star seems to be pretty well-versed in the fashion icon stakes as he poses next to model Kendall Jenner.\nFollowers of Neymar's Instagram were drawn to his account on Friday when he posted a picture of him and Jenner side by side with a caption which read: 'Nice to meet you too @kendalljenner.'\nNeymar poses next to model Kendall Jenner while she launches Mango Spring 2016 campaign in Barcelona\nJenner had been in Barcelona to launch Mango's new Spring 2016 campaign, which obviously Neymar did not want to miss.\nStill fairly fresh from his appearance at FIFA's Ballon d'Or ceremony in Zurich in mid-January, Neymar chose once again to wear a bowler hat and bow tie.\nIndeed, as a fellow model, it's highly likely he asked more about fashion than Jenner did about football.\nYet it is football that Neymar will need to concentrate on when Barcelona host Atletico Madrid in a top-of-the-table clash in La Liga on Saturday despite only just recovering from a hamstring injury.\nBarcelona manager Luis Enrique, who understands the gravity of the fixture, told reporters ahead of the match that it would be wrong to leave out Neymar.\nHe said: 'Neymar has a knock. Regardless, it would be foolhardy not to play him.\nNeymar at Ballon d'Or ceremony in Zurich in January wearing bowler hat and bow tie as he poses for photos\nNeymar has recovered from a hamstring injury that had threatened to rule him out of Atletico Madrid match\nBarcelona's players enjoy a joke at the expense of Arda Turan (centre) as they prepare for Saturday's match\nNEYMAR'S 2015-16 LA LIGA STATS Games played: 17 Matches won: 13 Matches drawn: 2 Matches lost: 2 Goals scored: 16 Goals when starting: 16 Assists: 9 Crosses into area: 78 Shots: 69 Shots on target: 29 Minutes played: 1582\n'If I didn't put him in they'd kill me! He'll play for sure.'\nDespite a season where he has endured a fair number of knocks and groin injuries, he has managed to score 21 goals in 28 appearances but there has been speculation surrounding his future in Spain.\nSome reports in Spain have suggested that Neymar could leave the Nou Camp after revealing that he would love to work with Premier League-bound Pep Guardiola.\nBut Enrique quashed speculation by adding: 'When he renews [his contract], you can remind me if I was right or not when I said that he'd extend.","url":"https://www.dailymail.co.uk/sport/football/article-3423166/Keeping-Neymar-Barcelona-star-meets-Kendall-Jenner-boss-Luis-Enrique-says-play-against-Atletico-Madrid.html"}
