{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 18:32:44","date_modify":"2018-10-30 18:32:44","date_publish":"2016-05-06 07:50:47","description":"Former London mayor Ken Livingstone on Wednesday called the creation of Israel “fundamentally wrong,” and “a great catastrophe.”","filename":"data/vaneerConsumption/KenLivingstoneCreationOfIsraelWasAGreatCatastrophe.json","image_url":"https://media.breitbart.com/media/2016/05/Ken-Livingstone-speaks-to-reporters-as-he-leaves-Milbank-Studios-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_05_06__1540924364.html","title":"Ken Livingstone: Creation Of Israel Was ‘A Great Catastrophe’","title_page":"Ken Livingstone: Creation Of Israel Was ‘A Great Catastrophe’","title_rss":"NULL","source_domain":"breitbart.com","text":"The Times of Israel reports: Former London mayor Ken Livingstone on Wednesday called the creation of Israel “fundamentally wrong,” and “a great catastrophe.” The existence of the Jewish state in the Middle East, he said, could ultimately lead to nuclear war.\n“The creation of the state of Israel was fundamentally wrong, because there had been a Palestinian community there for 2,000 years,” Livingstone told an Arabic language TV station based in London, in a clip posted and translated by the watchdog MEMRI group.\n“The creation of the state of Israel was a great catastrophe,” he repeated. “We should have absorbed the post-World War II Jewish refugees in Britain and America. They could all have been resettled, whereas 70 years later, the situation is still very tense, and there is potential for many more wars, potential for nuclear war,” Livingstone told Al-Ghad Al-Arabi.\nHe also advocated for an international boycott on Israeli products, telling his interviewer that “I never buy anything” that comes from Israel. “I like dates, but I don’t buy dates that come from Israel,” he said.\nRead more here","url":"https://www.breitbart.com/middle-east/2016/05/06/ken-livingstone-creation-israel-great-catastrophe/"}
