{"authors":[],"date_download":"2018-10-30 19:17:33","date_modify":"2018-10-30 19:17:33","date_publish":"2016-10-10 20:27:00","description":"Georgia Secretary of State Sam Olens is the sole candidate to become the next president of Kennesaw State University.","filename":"data/vaneerConsumption/KennesawStatestudentsfacultyholdsilentOlensprotest.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_kennesaw-state-s_959125d2818437284cc4a89f310cff4a__1540927053.html","title":"Kennesaw State students, faculty hold silent Olens protest","title_page":"Kennesaw State students, faculty hold silent Olens protest ","title_rss":"NULL","source_domain":"ajc.com","text":"A large group of students and faculty silently lined Campus Green at Kennesaw State University on Monday in protest of the sole option for their future leader.\nGeorgia Attorney General Sam Olens is teed up to become the next president of the university without a lick of student input. All this in the wake of a tumultuous year of leadership failures, including financial policy violations by former president Dan Papp, who suddenly resigned earlier this year.\nProtesters and others also took to social media to showcase their opposition to Olens' record on LGBTQ issues. Olens has been criticized for opposing both gay marriage and gender neutral bathrooms.\nThe state Board of Regents is scheduled to vote Wednesday on Olens' presidency.\nSee some of those posts below:\nKSU factually/students are protesting Sam Olens, the homophobe/transphobe/racist/islamophobe who was elected without a nationwide search. pic.twitter.com/nDZtE6LJcy — Devyn (@HalfAtlanta) October 10, 2016\nHAPPENING NOW. Nearly 150 professors and staff at @kennesawstate stage a silent protest/walkout to protest new KSU president Same Olens. pic.twitter.com/BJHbdMDLLv — Devyn (@HalfAtlanta) October 10, 2016\n@Kwayylo it's a classic case of cronyism. Sam Olens is attny general and is against gay marriage and the bathroom bill. — RJ (@PettiLabelle) October 10, 2016\nThere a bigots who are still in control of the lives and futures of the people they abhor! #KSU is violating the idea of democracy. — lemongrab. (@Kwayylo) October 10, 2016\nNot extremist tidbits from either side of the matter. That being said, I'm still so proud of my university for protesting against Sam Olens! — morgan barnwell (@_bensonsbabe) October 10, 2016\nDon't Appoint Anti-LGBTQ Attorney General Sam Olens as President of Kennesaw State https://t.co/9FDbegXAAz — MiMi ♪♬♩ (@M0NST3R_M3LI) October 10, 2016\nLike Cobb County News Now on Facebook | Follow us on Twitter and Instagram.","url":"https://www.ajc.com/news/local/kennesaw-state-students-faculty-hold-silent-campus-protest-olens/mMWb9okJE93HAJcwrKXD5K/"}
