{"authors":["Ron Elving"],"date_download":"2018-10-22 21:16:59","date_modify":"2018-10-22 21:16:59","date_publish":"2018-09-10 00:00:00","description":"\"An indulgent and prosperous nation readily forgave Bill Clinton and instead blamed the prosecutor,\" Starr writes of investigating the president. \"That would be me.\"","filename":"data/vaneerConsumption/KenStarrsMemoirContemptLooksAtTheRockyRoadToClintonImpeachment.json","image_url":"https://media.npr.org/assets/img/2018/09/10/ap_969010929739_wide-797be5d991660d718e2a77174de3aab9b9698d89.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_09_10_643124271_ken-starr-s-new-memoir-on-the-rocky-road-to-impeachment_1540243019.html","title":"Ken Starr's Memoir 'Contempt' Looks At The Rocky Road To Clinton Impeachment","title_page":"Ken Starr's Memoir 'Contempt' Looks At The Rocky Road To Clinton Impeachment  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Ken Starr's Memoir 'Contempt' Looks At The Rocky Road To Clinton Impeachment\nContempt A Memoir of the Clinton Investigation by Ken Starr Hardcover, 338 pages | purchase close overlay Buy Featured Book Your purchase helps support NPR programming. How?\nAnyone contemplating the impeachment of a president should read Ken Starr's new book on the case he made for the impeachment of Bill Clinton in 1998.\nNot that the author of Contempt: A Memoir of the Clinton Investigation is interested in setting the stage for the next impeachment. His immediate mission here is reshaping our memories of that earlier \"national trauma.\"\nStarr is offering, at long last, a defense of his most famous work as a lawyer. But it may also be read as a cautionary tale. He is warning that even when the facts at hand seem damning, even incontrovertible, impeachment proceedings may not produce the expected result.\nStarr had already been a federal appeals judge and U.S. solicitor general when he agreed in 1994 to take over the investigation of Clinton. The probe had initially related to a failed real estate project called Whitewater and a savings and loan back in Arkansas. It had widened its scope to include the death of deputy White House counsel Vince Foster. Under Starr, it would expand further to entail allegations of an Oval Office affair and a cover-up.\nStarr replaced a previous independent counsel, Robert Fiske Jr., who had been well-regarded (Starr himself has only praise for him). But an oversight panel of judges thought it was time for a change, and Starr was the man they wanted for the job.\nStarr freely admits he had once called the independent counsel law \"stupid, stupid, stupid\" and considered it unconstitutional. But \"the law is the law,\" and he took the job. He rejects out of hand any suggestion that the judges involved wanted someone to be tougher on Clinton than Fiske had been, accepting at face value their protestations to the contrary.\nThe Fiske-Starr probe eventually meant criminal charges for several Clinton friends. Clinton's successor as governor went to prison. A close friend was jailed for refusing to testify. And when the focus turned to Clinton and perjury in the case of his affair with 22-year-old White House intern Monica Lewinsky, Starr concluded he could not indict the president directly. So he made a report to Congress that led to Clinton's impeachment in the House. (The Senate did not come close to the necessary two-thirds vote to remove the president, who completed his term.)\nTry as he might, Starr cannot help but take much of this personally.\n\"An indulgent and prosperous nation readily forgave Bill Clinton and instead blamed the prosecutor,\" Starr writes. \"That would be me.\"\nIndeed, in September 1998, the month Starr produced his shockingly detailed report on the Clinton-Lewinsky affair, the president's approval rating in the Gallup Poll went up. And in that fall's midterm elections, the president's party defied the usual midterm curse by gaining seats in Congress.\nAs Starr himself notes, the country was far from sold on impeachment, the salacious details of the Starr report notwithstanding. (In a side note of some irony, the young lawyer who helped write that X-rated report was Brett Kavanaugh, who is now President Trump's nominee for the Supreme Court.)\nStarr's career as recounted in this memoir divides all too easily into pre-Monica and post-Monica eras. The pre-Monica phase is a catalog of success. He leaves his church college for a scholarship at George Washington University in Washington, going on to Brown University for graduate study and then to Duke for a law degree.\nHe clerks for a federal appeals court judge, then ascends to a clerkship with Warren Burger, chief justice of the U.S. Supreme Court. Dancing from peak to pinnacle, he works for President Ronald Reagan's attorney general and gets a coveted appointment to the U.S. Court of Appeals for the District of Columbia Circuit while still in his 30s.\nYet six years later, he gives up this sinecure to be solicitor general for President George H.W. Bush, presumably as a steppingstone to an appointment to the Supreme Court. He recounts how, the following year, he was \"passed over\" for a high-court opening that went instead to David Souter. He says he was thought as a \"squish\" who was \"not conservative enough\" by some at the time.\nCould that have been on his mind when he agreed to take over the Clinton probe a few years later? He does not say. But he clearly still feels the snub keenly, returning to it on the penultimate page of this memoir, adding that Souter turned out to be a liberal and a bitter pill for conservatives. (He also adds that both Souter and Chief Justice John Roberts have been heard to say they had seats on the court that otherwise would have gone to Starr.)\nThis is not to accuse of Starr of having it in for Clinton just because of what happened to his own career trajectory. The evidence of this memoir is that the Clintons, plural, offended Starr's sense of law, decency, decorum and morality.\nStarr's firm convictions in this realm are revealed throughout this text. When he wins a case against Clinton associates back in Arkansas, he writes: \"Thanks to an honorable judge and a God-fearing jury, justice had been done.\"\nBut when another trial goes the other way, he immediately says, \"We suspected skullduggery in the form of jury tampering but we had no evidence to back that up.\" But enough to mention the suspicion, apparently, and to underline that not every jury could be counted on to be God-fearing.\nStarr's book title conjures the legal concepts of \"contempt of court\" or \"contempt of Congress.\" Starr obviously believes the Clintons demonstrated both. But a reader must be forgiven for thinking the term of the title refers just as aptly to Starr's own judgment and attitude toward the president — and most especially toward the first lady.\nIn these pages, the 42nd president is often described as charming, persuasive, intuitive — in short, \"vastly talented but terribly flawed.\" Starr stands back in awe when the president enthralls a National Prayer Breakfast in 1998, even as he is ensnared in the worst of the scandal.\nBut Hillary Clinton gets no such grudging respect. Starr harks all the way back to the moment she left her home and the \"hard-working Republican businessman\" who was her father. Starr says she then \"shed her Midwestern upbringing and became an anti-war Democrat ... profoundly influenced by the radical Saul Alinsky. \"\nStarr is incensed at the speech Hillary Clinton gave at her own Wellesley graduation (nearly 50 years ago), where she \"denounced\" the Republican senator who gave the commencement address. Starr labels this \"rude grandstanding at a revered rite of passage ... a 'soft' form of contempt for which Hillary was written up in Life magazine as a voice of her generation.\"\nAnd all this, mind you, before she had even met Bill Clinton.\nLater on, Hillary would be \"a mediocre attorney and for the most part a disaster as a trial lawyer,\" according to Starr and his sources (unnamed). When she appears at a news conference as first lady, Starr details her \"pink sweater with black trim, her hair beautifully coiffed and her voice well-modulated [as she] dazzled press and public alike.\"\nHillary even has a star turn in the book's cover art, which shows her whispering in her husband's ear like Machiavelli advising his prince.\nWhy has Starr waited so long to tell his side of the story?\n\"I wanted to move on with my life,\" he explains, \"to focus on my work in the academic world, where I served as dean of the Pepperdine Law School ... before becoming president of Baylor University in my native Texas.\"\nBut then, Starr adds, he lost his job at Baylor because of a scandal over the handling of complaints about sexually aggressive athletes and others. Although not directly involved, Starr says: \"Captains go down with the ship.\"\nMore recently, Starr has signed on with a longtime friend whose Houston firm has handled billion-dollar suits against major corporations.\nBut a crucial factor in finally releasing this salvo seems to have been the outcome of the 2016 presidential election, when his nemesis, Hillary Clinton met her \"crushing\" final defeat. \"Unexpectedly freed of all these considerations,\" Starr says, he can now unburden himself.\nStarr's prose is sturdy but far from beguiling; nor is he especially winning as a personality. He does appeal at times as just plain folks, beginning with his evocation of a small-town Texas boyhood as the son of a Baptist preacher. But the intensity of his personal ambition is palpable, even insistent, and his deep resentment at his place in history keeps boiling to the surface.\nLike the memoir released earlier this year by former FBI Director James Comey, Starr's will probably make few converts. But it will be celebrated by the author's many admirers, and it will surely be ammunition for all sides in the unending argument over the Clinton controversies.\nStarr's contribution also matters because, whether intentionally or not, it illustrates vividly how personal, subjective and partisan our criminal legal system can be — a reflection of the larger political sphere of which it is a part.","url":"https://www.npr.org/2018/09/10/643124271/ken-starr-s-new-memoir-on-the-rocky-road-to-impeachment"}
