{"authors":["Esra Gurkan For Mailonline"],"date_download":"2018-10-23 00:32:30","date_modify":"2018-10-23 00:32:30","date_publish":"2017-04-26 10:10:06","description":"Sian Butler, 20, from Tunbridge Wells in Kent, splashes most of her wages on hand-made dresses for her pet chihuahua, Lilly, who has 17,000 followers on Instagram.","filename":"data/vaneerConsumption/Kentdoggroomerspends10000onChanelesqueoutfits.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9DAFBA00000578-0-image-a-3_1493197596904.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446696_Kent-dog-groomer-spends-10-000-Chanel-esque-outfits_1540254750.html","title":"Kent dog groomer spends £10,000 on Chanel-esque outfits","title_page":"Kent dog groomer spends £10,000 on Chanel-esque outfits | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's hard to resist the sight of a dog wearing a miniature outfit.\nBut one owner's obsession with dressing up her dog has seen her spend a whopping £10,000 on Chanel-inspired dresses and Louis Vuitton accessories for her pampered pooch.\nDog groomer Sian Butler, 20, from Kent, says her chihuahua Lilly is better dressed than she is thanks to her splashing most of her wages around 1,000 dresses for her 18-month-old dog - at around £100 a time.\nLilly, who also has a collection of 50 glitzy collars and leads, is now something of a social media star thanks to her outlandish wardrobe, with 17,000 Instagram followers eager to see what she wears next.\nScroll down for video\nSian Butler, 20, who lives in Tunbridge Wells, Kent, says she's spent £10,000 on her dog Lilly's outfits\n'Lilly loves wearing dresses, she has over 1,000 of them and each cost around £100,' said Sian.\nThe dog groomer said that her own understated wardrobe is frequently put in the shade by her pet's sparkly accessories and colourful dresses.\n'I tend to wear jeans and a jumper or t-shirt but Lilly always goes for the glamorous look, I think it suits her the most,' said Sian.\n'Lilly definitely has more clothes than me but I don't mind, I wouldn't have it any other way.\n18-month-old Lilly the Chihuahua boasts a wardrobe full of Dior and Chanel-inspired dresses\nLilly, dressed in a bright blue Tiffany dress, now even has her own Instagram page\nThe tiny Chihuahua boasts over 17,000 followers on the social media site and regularly receives messages from fans\nSian added that she's inundated with messages from Lilly's fans on Instagram, and insists her pet loves being dressed up and having her picture taken.\n'She has so many clothes and accessories, such as hats to match every dress and around 50 different leads and collars,' said Sian.\n'Most of Lilly's clothes are handmade so you can't get her style on the high street.\n'If I don't put her in an outfit she tends to drag her box of clothes out as if to say, \"come on, put a dress on me.\"'\nSian says: 'She has so many clothes and accessories such as hats (above) to match every dress and around 50 different leads and collars'\nThe dog is usually dressed in bright and glitzy dresses however Sian (above) often chooses plain and more understated clothes for herself\nMost of Lilly's clothes are handmade so Sian can't get them from the high street\nSian (above with Lilly) says: 'If I don't put her in an outfit she tends to drag her box of clothes out as if to say, 'come on put a dress on me''\nSian says the dog (above in a Chanel-inspired dress) loves posing for the camera and that's why she set up an Instagram page to document what she wears on a daily basis\n20-year-old Sian says: 'I tend to wear jeans and a jumper or t-shirt but Lilly always goes for the glamorous look, I think it suits her the most'\nLilly, pictured above posing, was first adopted by Sian back in 2015 and she now lives with her and Sian's parents\nSian, who lives with her parents, adopted Lilly back in 2015.\n'At first I was buying Lilly a new dress every week,' she said.\n'It was costing me a small fortune but seeing her looking so adorable made it impossible to stop.\n'But now I have calmed the spending down a bit and tend to buy her something new every few weeks instead.\n'Lilly is often stopped in the street because of her style, I suppose it's not every day that you see a dog in a huge puffy dress.'\nThe fashionable dog has been in the limelight with both her modelling and pageant successes too.\nSian began buying Lilly a dress per week and says it was costing her a small fortune\nSian says: 'But now I have calmed the spending down a bit and tend to buy her something new every few weeks instead'\nLilly, dressed in a blue polkadot dress, is often stopped in the street because of her style\nThe fashionable dog (above) has been in the limelight with both her modelling and pageant successes\nLilly has even had some modelling experience.\n'She loves the camera so it made sense to do a few modelling shoots with her,' Sian said.\n'We've entered her into doggy pageants too and she has been placed first place as the most beautiful and best dressed.\n'I always aim to find Lilly the most extravagant dresses and that's one of the main reason we get them all handmade.\n'She has a lot more designer things than most people, let alone dogs, but one of my favourites is her Louis Vuitton collar and lead.'\nLilly is so pampered, said Sian, that she even likes having her claws painted.\n'She happily sits there patiently while I dress her, and unlike other dogs she doesn't try and take her hats or clothes off.\n'Lilly can be quite bossy but she's a good little girl and despite her diva ways, she loves nothing more than being cuddled and going on walks.'","url":"https://www.dailymail.co.uk/femail/article-4446696/Kent-dog-groomer-spends-10-000-Chanel-esque-outfits.html"}
