{"authors":[],"date_download":"2018-10-23 05:18:50","date_modify":"2018-10-23 05:18:50","date_publish":"2015-03-23 00:00:00","description":"NPR's Audie Cornish speaks with Nicole Auerbach, who covers college basketball for USA Today Sports, about the 16 teams left in the NCAA men's college basketball tournament.","filename":"data/vaneerConsumption/KentuckyStillFavoredAsMarchMadnessHeadsIntoSweetSixteen.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=394906493_1540271930.html","title":"Kentucky Still Favored As March Madness Heads Into Sweet Sixteen","title_page":"Kentucky Still Favored As March Madness Heads Into Sweet Sixteen : NPR","title_rss":"NULL","source_domain":"npr.org","text":"AUDIE CORNISH, HOST:\nIf you filled out a bracket for college basketball's March Madness, it's likely a mess. ESPN reports that of the 11-and-a-half million entries in its contest, not one has predicted all the winners. We're now down to the Sweet 16 in the men's tournament, and sports writer Nicole Auerbach of USA Today says there isn't a Cinderella team among them. Welcome back to the show, Nicole.\nNICOLE AUERBACH: Thanks for having me.\nCORNISH: So no Cinderellas - no underdogs?\nAUERBACH: No. Honestly, I mean, you've got an 11 seed in the field still but it's UCLA, which is the winningest program in college basketball history. So I don't think any of these teams would qualify as Cinderellas.\nCORNISH: So who is the big story of the tournament?\nAUERBACH: Well, the big story is Kentucky. Still undefeated - they've won more games in one season than any men's Division I basketball program has in the history of the sport, and they are four games away from winning it all - the first perfect season since 1976 when Indiana did it. So the question, really, the rest of the way is can they keep it up?\nCORNISH: There's been a lot of handwringing about the low-scoring games in college basketball generally. The 2014-2015 season was looking like the worst offensive season in modern history - right? - in terms of how many points averaged per game - 67, the lowest since 1952. But what is it looking like in the tournament?\nAUERBACH: Well, I think we're seeing a mix. There's some really good offensive teams out there. Notre Dame is one. Virginia was known for a very slow-paced, low-scoring style. We saw them, in a very physical game, lose to Michigan State in the round of 32. So I think it's kind of been representative of the season on the whole, but we have some high-scoring games, which have kind of felt like a little bit of a treat.\nCORNISH: Looking ahead to this week, what are the fun matchups?\nAUERBACH: Well, like I said, everyone is going to be keeping an eye on Kentucky. So Kentucky's path gets much more difficult here. They've got West Virginia first in the Sweet 16. But then the winner of that, which will likely be Kentucky, will get the winner of Notre Dame-Wichita State, which, I think, both of those teams pose really interesting matchup problems for Kentucky. And I think that would be, you know, to date their biggest test of the season.\nIn general, I'm curious to see how some of the ACC teams do. Five of the six that made the tournament are in the Sweet Sixteen, which is an incredible percentage and obviously speaks to the strength of that conference. So I'm curious to see how long some of these teams advance, you know, how long they hang around in the tournament. NC State knocked off number-one seed Villanova. So, you know, they're a little bit of a surprise Sweet Sixteen team. And obviously Duke is a favorite to maybe get to the Final Four, maybe contend with Kentucky for a title. The Big 12 was perceived to be the strongest conference all regular season, but only two of their seven teams made it to the Sweet 16 - seven who entered the tournament. So it's always interesting to see how that shakes out once, you know, the best-of-the-best in all of the conferences are facing each other in the tournament.\nCORNISH: And, Nicole, before we let you go, the state of your bracket?\nAUERBACH: You know, my bracket's not too bad. I did not predict some of those 14-3 upsets that kind of threw everything off early, but I did have Wichita State beating Kansas. Kentucky is my national champion so they're still around. So three of my four final four teams are still alive, and I'll take that.\nCORNISH: Nicole Auerbach, thank you so much for talking with us.\nAUERBACH: Thanks for having me.\nCORNISH: Nicole Auerbach - she covers college sports for USA Today sports.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=394906493"}
