{"authors":["Associated Press"],"date_download":"2018-10-23 02:00:41","date_modify":"2018-10-23 02:00:41","date_publish":"2017-03-16 12:14:15","description":"NAIROBI, Kenya (AP) - Kenya's security agencies are violating privacy rights in counter-terrorism operations and the information acquired is used to commit...","filename":"data/vaneerConsumption/Kenyacounterterrorworkcreatesabusesrightsgroupsays.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319986_Kenya-govt-abusing-rights-privacy-counter-terrorism_1540260041.html","title":"Kenya counter-terror work creates abuses, rights group says","title_page":"Kenya counter-terror work creates abuses, rights group says | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NAIROBI, Kenya (AP) - Kenya's security agencies are violating privacy rights in counter-terrorism operations and the information acquired is used to commit human rights abuses, including targeted killings, an international human rights group says.\nInformation gathered from phone intercepts and other means is carried out essentially without oversight, contravening procedures required by law, the London-based Privacy International said in a report released Wednesday.\nThe National Intelligence Service makes phone intercepts and provides the information to police, who obtain clearance to monitor targets. Information obtained through surveillance is central to the identification, pursuit and \"neutralization,\" or killing, of suspects, the report says.\n\"Telecommunications operators end up handing over their customers' data because they largely feel that they cannot decline agencies' requests, in part due to the vagueness in the law,\" the report says.\n\"Several telecommunications operators spoke of the threat, either direct or implicit, that their licenses would be revoked if they failed to comply,\" it says.\nKenyan authorities declined to comment.\nKenya has experienced frequent extremist attacks since it sent troops to neighboring Somalia in 2011 to help fight al-Shabab.\nPrivacy International said it interviewed three intelligence officers, seven military officers and 22 police officers. Of those interviewed, 17 are in active duty and 15 recently left service.\nThis is the latest report on alleged abuses in Kenya's counter-terrorism efforts.\nRecent reports by rights groups Haki Africa, Human Rights Watch and the government's human rights commission have found that dozens of Kenyans suspected of links to extremist groups have been victims of enforced disappearances, and some have been found executed.\nKenya holds presidential elections in August, and a proposed $19 million project by the government regulator Communications Authority of Kenya to monitor radio frequencies and social media platforms and \"manage devices\" is viewed by some as a way to spy on Kenyans or control communications during the vote.\nThe government has said the project would help prevent a repeat of the violence after the 2007 election that killed more than 1,000 people.","url":"https://www.dailymail.co.uk/wires/ap/article-4319986/Kenya-govt-abusing-rights-privacy-counter-terrorism.html"}
