{"authors":["Associated Press"],"date_download":"2018-10-22 20:34:10","date_modify":"2018-10-22 20:34:10","date_publish":"2016-01-29 02:17:28","description":"CAMBRIDGE, Mass. (AP) — \"Scandal\" actress Kerry Washington took home a shiny little pudding pot Thursday after being feted with a raucous parade through Harv...","filename":"data/vaneerConsumption/KerryWashingtonfetedwithparadeandroastatHarvard.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:17b36fdd15cf456092bd84601c8ef82f-2vdWmEltwXfba0ce28e632efdf3b-860_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421902_Kerry-Washington-feted-parade-roast-Harvard_1540240450.html","title":"Kerry Washington feted with parade and roast at Harvard","title_page":"Kerry Washington feted with parade and roast at Harvard | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kerry Washington feted with parade and roast at Harvard\nCAMBRIDGE, Mass. (AP) — \"Scandal\" actress Kerry Washington took home a shiny little pudding pot Thursday after being feted with a raucous parade through Harvard Square and a roast by Harvard University's Hasty Pudding Theatricals.\nThe nation's oldest collegiate theatrical organization says it named Washington as Woman of the Year because she's the first black woman to headline a network TV drama since 1974.\nIn a statement, the troupe called her a \"talented and socially engaged film, TV and stage actress who keeps breaking barriers in Hollywood.\"\nActress Kerry Washington, Harvard University's Hasty Pudding Theatricals' Woman of the Year, is kissed by actors in drag, Robert Fitzpatrick, left, and David Sheynberg, right, as she is paraded through the streets of Harvard Square, Thursday, Jan. 28, 2016, in Cambridge, Mass. (AP Photo/Elise Amendola)\nWashington told WCVB-TV before the festivities kicked off that she was \"crazy honored\" to join the esteemed list of women that have been honored by the group.\nPrevious Hasty Pudding honorees include Meryl Streep, Katharine Hepburn and Elizabeth Taylor. Comedian Amy Poehler won last year.\n\"It's surreal. I mean, it's so crazy,\" Washington told the station.\nThe 38-year old actress also admitted she was nervous about the roast, which was her first.\nIn keeping with tradition, Washington made her way to the theater in style, riding in the back of convertible flanked by actors in colorful drag.\nWhile on stage with Hasty Pudding actors, Washington did a throaty rendition of Tina Turner's \"What's Love Got to Do with It.\"\nAt another point, she threw a pie at an actor dressed like Donald Trump and she later posed with the event's signature golden pudding pot.\nWashington stars as crisis management specialist Olivia Pope on the hit show \"Scandal,\" which debuted on ABC in 2012. She's earned Golden Globe, Emmy and Screen Actors Guild nominations for the role.\nActor Joseph Gordon-Levitt, this year's Man of the Year, will be feted by Hasty Pudding on Feb. 5.\nActress Kerry Washington, center, is honored as Harvard University's Hasty Pudding Theatricals' Woman of the Year while surrounded by actors in drag, Thursday, Jan. 28, 2016, in Cambridge, Mass. (AP Photo/Elise Amendola)\nActress Kerry Washington, Harvard University's Hasty Pudding Theatricals' Woman of the Year, is flanked by actors in drag, Robert Fitzpatrick, left, and David Sheynberg, right, as she is paraded through the streets of Harvard Square, Thursday, Jan. 28, 2016, in Cambridge, Mass. (AP Photo/Elise Amendola)\nActress Kerry Washington, Harvard University's Hasty Pudding Theatricals' Woman of the Year, waves as she is paraded through the streets of Harvard Square, Thursday, Jan. 28, 2016, in Cambridge, Mass. (AP Photo/Elise Amendola)\nActress Kerry Washington, center, Harvard University's Hasty Pudding Theatricals' Woman of the Year honoree, is surrounded by actors in drag, Thursday, Jan. 28, 2016, in Cambridge, Mass. (AP Photo/Elise Amendola)\nActress Kerry Washington, Harvard University's Hasty Pudding Theatricals' Woman of the Year, reacts to holding a stuffed pig as actor David Sheynberg, right, watches during her parade through the streets of Harvard Square, Thursday, Jan. 28, 2016, in Cambridge, Mass. (AP Photo/Elise Amendola)\nActress Kerry Washington, Harvard University's Hasty Pudding Theatricals' Woman of the Year, poses with the pudding pot, Thursday, Jan. 28, 2016, in Cambridge, Mass. (AP Photo/Elise Amendola)\nActress Kerry Washington, Harvard University's Hasty Pudding Theatricals' Woman of the Year, holds up the pudding pot, Thursday, Jan. 28, 2016, as she is honored in Cambridge, Mass. (AP Photo/Elise Amendola)\nActress Kerry Washington, Harvard University's Hasty Pudding Theatricals' Woman of the Year, throws wine in the face of an actor playing Republican presidential candidate Donald Trump, Thursday, Jan. 28, 2016, as she is roasted in Cambridge, Mass. (AP Photo/Elise Amendola)","url":"https://www.dailymail.co.uk/wires/ap/article-3421902/Kerry-Washington-feted-parade-roast-Harvard.html"}
