{"authors":["Jerome Hudson"],"date_download":"2018-10-30 18:43:30","date_modify":"2018-10-30 18:43:30","date_publish":"2016-06-25 21:29:39","description":"Facebook's Sheryl Sandberg enlisted celebrities to record a video supporting Lean In, her campaign to encourage women to support one another.","filename":"data/vaneerConsumption/KerryWashingtonOtherCelebsUrgeWomentoLeaninTogether.json","image_url":"https://media.breitbart.com/media/2016/06/Lean-in-Together-twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_06_25__1540925010.html","title":"Kerry Washington, Other Celebs Urge Women to 'Lean in Together'","title_page":"Kerry Washington, Other Celebs Urge Women to 'Lean in Together'","title_rss":"NULL","source_domain":"breitbart.com","text":"Facebook Chief Operating Officer and activist Sheryl Sandberg enlisted celebrities Kerry Washington, Emma Watson, and Lena Dunham to record a video message supporting Lean In, Sandberg’s public awareness initiative aimed at encouraging women to support one another in their professional and personal lives.\nIn a video for Sandberg’s Together Women Can campaign, the A-list stars share stories of the women who have helped them achieve their own successes.\n“I’m not really sure what my life would look like without Shonda Rhimes,” Scandal star Kerry Washington says of the hit ABC show’s creator.\nThe short video shows Lena Dunham praising her longtime creative collaborator Jenni Konner, while actress Emma Watson speaks of filmmaker Sofia Coppola, saying, “[She] supported my work, and she made me believe that I could do more.”\nFox News anchor Megyn Kelly is also featured in the video.\n“One of the most heartening parts of this past year for me has been the outpouring of support I’ve received from women,” Kelly says, referencing the controversy she found herself in the middle of after a presidential debate last August during which she asked presumptive Republican presidential candidate Donald Trump a question about his treatment of women.\nThe video also features tennis great Serena Williams, Olympic gold medalist and retired women’s soccer player Abby Wambach, and singer Selena Gomez.\n“When women lean in together, we accomplish amazing things,” Sandberg says in the video.\nOpening up about her new initiative, Sandberg tells Dunham in a recent interview published in the actress’s Lenny Letter newsletter, “Our goal is to help women lean in to their ambitions — and we don’t get there alone.”\n“We have heard from our Lean In Circles and from women in the workplace that to be more confident and feel stronger, they look to their female peers for support,” Sandberg says.\nFollow Jerome Hudson on Twitter: @jeromeehudson.","url":"https://www.breitbart.com/entertainment/2016/06/25/kerry-washington-megyn-kelly-lena-dunham-urge-women-to-lean-in-together-in-psa/"}
