{"authors":[],"date_download":"2018-10-30 14:21:21","date_modify":"2018-10-30 14:21:21","date_publish":"2014-05-31 00:00:00","description":null,"filename":"data/vaneerConsumption/KerrysDefinitionofSuccess.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_05_kerrys_definition_of_success_1540909281.html","title":"Kerry's Definition of 'Success'","title_page":"Kerry's Definition of 'Success'","title_rss":"NULL","source_domain":"americanthinker.com","text":"Kerry told PBS. “I mean, if you look at what has happened in Ukraine, the president led an effort to try to keep Europe unified with the United States, to put difficult sanctions on the table. Europe wasn’t thrilled with that. But they came along. That was leadership. And the president succeeded in having an impact ultimately, together with the Europeans, on the choices that face President Putin.”\n(2) Prevented Assad from using chemical weapons\n“In Syria, the president obviously made his decision to strike Syria, and appropriately sent that decision to Congress. Congress didn’t want to move. But we came up with another solution, which was get all of those chemical weapons out, rather than just have one or two days of strikes … the president has now succeeded in getting 92 percent of those weapons out of Syria.”\n(3) Prevented Iran from developing nuclear weapons\n“In addition, the president has engaged with Iran. We were on a course to absolute collision, where they were building a nuclear system and the world was standing opposed to that. But the president put in place a series of sanctions, a capacity to be able to bring Iran to the table… We are now in the middle of negotiations. Everyone will agree the sanctions regime has held together. The weapons, the nuclear program has been frozen and rolled backwards. And we now have expanded the amount of time that Iran might have for a breakout. That’s a success.”\n(4) Prevented collapse of the Afghan war effort\nKerry claimed that the Afghan war was “adrift and in danger” in 2009 but has now had a successful outcome: “We have done it. They had a very successful election. And they provided the security and they did the planning, and they did the execution. That is exactly what the president is now trying to do with respect to the final steps.”\nKerry is essentially arguing that smart diplomacy has worked. Instead of the go-it-alone mentality of the Bush administration followed by blustering in with military force and shooting from the hip, smart diplomacy of “engagement” has had success. The engagement/prevention policy is basically just a Pavlovian reward/punishment policy involving (1) mustering support from the “global community” and (2) using economic and political policy to reward good behavior and punish bad behavior.\nThe prevention claim is generally a weaselly argument. Has the Obama administration prevented another 9/11 type terrorist attack? Have they prevented an all-out war between Iranian Shiite forces and Saudi Sunni forces? Have they prevented collapse of the U.S. dollar? Prevented double digit unemployment? If X does not happen it does not thereby mean that the policies in place prevented X from happening. Moreover, having “prevented” something from happening does not mean that it will not happen in the future.\nPrevented Putin from taking over the Ukraine? Prove first that that was his intention and that the administration engagement/prevention policy was the reason. Prevented Assad from going full bore with chemical weapons? Prove first that that was his intention and that the pariah sanctions stopped him. Prevented a collapse of Afghanistan into an ungovernable chaos? Is that where Afghanistan was headed in 2009? Prove it. Prevented Iran from continuing its nuclear program?\nIs Kerry implying that current administration policies ensure that in the future Putin will not chip away at the Ukraine and other former Soviet satellites? That Afghanistan will not collapse into chaos? That Iran will not attempt to build nuclear capabilities?\nA little early, perhaps, for a victory lap?\nThe real constant and hallmark of the Obama administration’s foreign policy is backing the Muslim Brotherhood at home and abroad. Perhaps Kerry should tout all those successes backing the Muslim Brotherhood in Egypt, Syria and Libya. Backing Morsi? That has really endeared us to the Egyptians. But perhaps the coupe de maitre of the MB alliance was the reasoning that the Consulate in Benghazi didn’t need any additional U.S. protection forces since they were being protected by Muslim Brotherhood security.","url":"https://www.americanthinker.com/blog/2014/05/kerrys_definition_of_success.html"}
