{"authors":["Brakkton Booker"],"date_download":"2018-10-23 01:02:53","date_modify":"2018-10-23 01:02:53","date_publish":"2015-10-19 00:00:00","description":"Kerry appeared to push back against a French proposal calling for an international presence at the holy site in order to preserve the status quo agreement. Israel is against the proposal.","filename":"data/vaneerConsumption/KerryOnHolySiteInJerusalemWereNotSeekingOutsidersOrOthersToComeIn.json","image_url":"https://media.npr.org/assets/img/2015/10/19/ap_452384631083_wide-bcf88ab62bfcf02ae0514e3445a54a1112e77513.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2015_10_19_449994154_kerry-on-holy-site-in-jerusalem-were-not-seeking-outsiders-or-others-to-come-in_1540256573.html","title":"Kerry On Holy Site In Jerusalem: 'We're Not Seeking Outsiders Or Others To Come In'","title_page":"Kerry On Holy Site In Jerusalem: 'We're Not Seeking Outsiders Or Others To Come In'  : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Kerry On Holy Site In Jerusalem: 'We're Not Seeking Outsiders Or Others To Come In'\nEnlarge this image toggle caption Francisco Seco/AP Francisco Seco/AP\nAhead of his meetings with Israeli and Palestinian leaders this week, U.S. Secretary of State John Kerry has urged both sides to exercise restraint and called for clarity on the status of a holy site in Jerusalem that's been at the epicenter of the uptick in Israeli-Palestinian clashes in recent weeks.\nSpeaking from Madrid Monday, Kerry called for Israel to maintain the status quo agreement over the hilltop compound in Jerusalem that is venerated by Jews, known as the Temple Mount and the site of the Al-Aqsa Mosque, a sacred symbol for Palestinians:\n\"Israel understands the importance of that status quo, and I think what is necessary perhaps – which is why diplomacy sometimes enters into this – is to make sure that everybody understands what that means, that there is clarity as to what the expectations are.\"\nThe status quo at the holy site allows for Jews to visit, but not pray there.\nKerry also seemed to push back against a French proposal that called for an international presence at the holy site in order to preserve the status quo agreement:\n\"We're not seeking outsiders or others to come in. I don't think Israel wants that.... and we're not proposing it. So let me make clear: What we need is clarity. We need to have all the parties come together with an expression of that clarity. And I feel strongly that it's in the interests of everybody to be able to do so,\" Kerry said.\nAccording to the Times of Israel, Prime Minister Benjamin Netanyahu has also come out against the proposal.\nKerry announced over the weekend he would be meeting separately with both Netanyahu and Palestinian President Mahmoud Abbas this week. As the Two-Way reported Sunday, the meetings come during a surge in violence in the region.\nWhile in Madrid, Kerry also solidified an agreement with Spain's Foreign Minister Jose Manuel Garcia-Margallo Monday to further discuss the cleanup and removal effort of toxic land on the Spanish coast. The land is reportedly contaminated with radioactivity after a mid-air collision in 1966 dropped four U.S. hydrogen bombs near Palomares, a southern Spanish village.\nAccording to the wire service, the agreement calls for the two countries to arrange for the disposal of the contaminated soil at a site within the U.S.\nThe AP reports:","url":"https://www.npr.org/sections/thetwo-way/2015/10/19/449994154/kerry-on-holy-site-in-jerusalem-were-not-seeking-outsiders-or-others-to-come-in"}
