{"authors":["Sharnaz Shahid For Mailonline"],"date_download":"2018-10-23 04:46:45","date_modify":"2018-10-23 04:46:45","date_publish":"2016-01-11 17:55:50","description":"The TV star was seen putting on a brave face as she stepped out to run errands around the town near her house in East Sussex on Monday afternoon.","filename":"data/vaneerConsumption/KerryKatonashusbandGeorgeKaydeniesclaimsheattackedher.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300D4F8000000578-0-image-a-5_1452534145596.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394318_Kerry-Katona-puts-brave-face-low-key-outing-estranged-husband-George-Kay-appears-court-denies-claims-attacked-her_1540270005.html","title":"Kerry Katona's husband George Kay denies claims he attacked her","title_page":"Kerry Katona's husband George Kay denies claims he attacked her | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was recently left devastated after the collapse of her third marriage.\nBut Kerry Katona was seen putting on a brave face as she stepped out to run errands around the town near her house in East Sussex on Monday afternoon.\nThe Atomic Kitten singer’s sighting comes hours after her ex-husband, George Kay, pleaded not guilty to assaulting her in September.\nScroll down for video\nBeaming: Kerry Katona was seen putting on a brave face as she stepped out to run errands around the town near her house in East Sussex on Monday\nWrapped up in a grey knitted overlay, the 35-year-old radiated a gorgeous glow and flashed a beaming smile as she passed by.\nShe teamed her relatively low-key getup with ripped denim jeans, a plain white shirt and a high-neck blouse, while strolling along the streets in nude leather boots.\nGeorge, 36, was arrested following an alleged row at the couple's home in Crowborough, East Sussex, last year.\nOn the move: The Atomic Kitten singer’s sighting comes hours after her ex-husband, George Kay, pleaded not guilty to assaulting her in September\nKeeping her cool: Wrapped up in a grey knitted overlay, the 35-year-old appeared to be in content spirits\nAttention to detail: She teamed her relatively low-key getup with ripped denim jeans, a plain white shirt and a high-neck blouse, while strolling along in nude leather boots\nHe was charged by Sussex Police with assault by beating and possessing a banned weapon, relating to a Taser-style instrument which was disguised.\nEarlier on, at Hove Crown Court, the ex-rugby league player pleaded not guilty to both charges and will stand trial from April 25.\nThe alleged attack is said to have taken place just five days after the couple's one-year wedding anniversary.\nChilled vibes: She radiated a gorgeous glow and flashed a beaming smile as she passed by\nBeing frank: Three-times married Katona recently revealed breaking up was 'hard' but 'the right thing to do'\nSince then, three-times married Katona revealed breaking up was 'hard' but 'the right thing to do'.\nThe pop star told OK! Magazine: 'George was with me 24/7. It's like somebody has died. He was my best friend.'\n‘There is no going back with George and me,' she added. 'That is what hurts so much, as I know he is a good person. I just wish I could shake him.'\nAt court: George, 36, was arrested following an alleged row at the couple's home in Crowborough last year\nStepping out: The ex-rugby player was seen arriving at Hove Crown Court on Monday morning","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394318/Kerry-Katona-puts-brave-face-low-key-outing-estranged-husband-George-Kay-appears-court-denies-claims-attacked-her.html"}
