{"authors":["Ian Hanchett"],"date_download":"2018-10-30 18:44:21","date_modify":"2018-10-30 18:44:21","date_publish":"2018-09-12 00:43:36","description":"On Tuesday's edition of MSNBC's \"Hardball,\" former Secretary of State John Kerry stated that there was a rationale for people like Secretary of State Mike | Video","filename":"data/vaneerConsumption/KerryThereWasRationaleforPeopletoStayinTrumpAdminIssueHasSuddenlyBeenForced.json","image_url":"https://media.breitbart.com/media/2018/09/Kerry-911-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2018_09_11__1540925061.html","title":"Kerry: There 'Was' Rationale for People to Stay in Trump Admin, 'Issue Has Suddenly Been Forced'","title_page":"Kerry: There 'Was' Rationale for People to Stay in Trump Admin, 'Issue Has Suddenly Been Forced' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"\"People are going to die because of the decision he made.\" @JohnKerry on Trump's decision to pull out of the Paris Climate agreement. #Hardball pic.twitter.com/N1eB6KMhTo\nOn Tuesday’s edition of MSNBC’s “Hardball,” former Secretary of State John Kerry stated that there was a rationale for people like Secretary of State Mike Pompeo and Secretary of Defense James Mattis to stay in the administration, “the issue has suddenly been forced,” and “adults in Washington need to deal with this in a very serious way.”\nKerry said, “I think there was a rationale in the last weeks leading up to this moment where you could say to yourself, it’s important to be here to stop things from happening. I think now, the issue has suddenly been forced, in a way, by virtue of the anonymous memo and Bob’s book and everybody’s awareness of what’s happening. And I think that adults in Washington need to deal with this in a very serious way.”\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/video/2018/09/11/kerry-there-was-rationale-for-people-to-stay-in-trump-admin-issue-has-suddenly-been-forced/"}
