{"authors":[],"date_download":"2018-10-22 21:11:01","date_modify":"2018-10-22 21:11:01","date_publish":"2014-06-04 13:38:55","description":"John Kerry began an unannounced trip to Lebanon Wednesday as the country struggles with an influx of Syrian refugees and a local political stalemate.","filename":"data/vaneerConsumption/KerryonSurpriseLebanonTriptoShowUSSupport.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/486751/140604-kerry-1009_ed44ca36ac2df9ddd827248473355890.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_kerry-surprise-lebanon-trip-show-u-s-support-n122276_1540242661.html","title":"Kerry on Surprise Lebanon Trip to Show U.S. Support","title_page":"Kerry on Surprise Lebanon Trip to Show U.S. Support","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBEIRUT - Secretary of State John Kerry began an unannounced trip to Lebanon Wednesday, aiming to bring a message of U.S. support as the country struggles with an influx of Syrian refugees and a domestic political stalemate.\nKerry arrived in Beirut to meet with Lebanese officials and others as they deal with both the fallout from the conflict in Syria and a seemingly intractable dispute over who will become the next Lebanese president.\nHe is expected to announce another $290 million in aid for United Nations agencies working on the Syrian refugee issue throughout the region.\nLebanon, home to 4.5 million people, is struggling to cope with the presence of more than a million Syrian and Palestinian refugees in desperate need of housing, education and medical care.\nA senior U.S. official traveling with Kerry said that in addition to discussing the refugee issue with Lebanese officials, including Prime Minister Tammam Salam and Parliament Speaker Nabih Berri, the secretary would also press them to deal with the political crisis that has left the country without a president since last month.\nLebanon requires a \"fully functioning\" presidency in order to cope with tremendous challenges it faces, the official said, adding that although Washington has no favored candidate, the U.S. would like to see a new president in office as soon as possible.\nKerry is the first secretary of state to visit Lebanon in five years; Hillary Clinton traveled there in April 2009.\nThe Lebanese are deeply split over the civil war in neighboring Syria and have lined up behind opposing sides in that conflict. Those deep divisions are among the reasons for the lack of agreement on a consensus candidate for the country's next president.\nUnder Lebanon's power-sharing system, the president must be a Maronite Christian, the prime minister a Sunni Muslim and the parliament speaker a Shiite Muslim. For a parliament to elect the president, a two-thirds quorum — or 85 of the legislature's 128 members — is needed, but none of the sessions to choose Suleiman's successor met that requirement.\nThe Associated Press","url":"https://www.nbcnews.com/news/world/kerry-surprise-lebanon-trip-show-u-s-support-n122276"}
