{"authors":["Ashley Collman For Dailymail.Com","Rachel Mcgrath For Dailymail.Com"],"date_download":"2018-10-23 02:32:31","date_modify":"2018-10-23 02:32:31","date_publish":"2016-01-29 17:04:08","description":"The actress and her husband originally listed the stately Los Angeles home with views of the Hollywood sign for $2.695million.","filename":"data/vaneerConsumption/KerryWashingtonandherhusbandsellHollywoodHillsmansionfor268million.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B440FB00000578-0-image-a-41_1454086551847.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423076_Scandal-star-Kerry-Washington-ex-NFL-player-husband-sell-Hollywood-Hills-mansion-2-68million_1540261951.html","title":"Kerry Washington and her husband sell Hollywood Hills mansion for $2.68million","title_page":"Kerry Washington and her husband sell Hollywood Hills mansion for $2.68million | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Actress Kerry Washington and her ex-NFL player husband Nnamdi Asomugha listed their Hollywood Hills home for sale at almost one million dollars more than what they paid for it two years ago and have found a buyer.\nThe stunning 1920's French country chateau-inspired property, which Washington and her hubby purchased for $1.865 million in May 2014, sold for $2.68million - just short of the couple's initial asking price of $2.695million.\nThat selling price is a little more than a third of what Washington makes in a year for her hit show Scandal. According to Forbes, the actress earned $7million for the ABC show in 2015.\nScroll down for video\nHilltop abode: Kerry Washington and Nnamdi Asomugha have reportedly found a buyer for their Hollywood Hills estate\nWashington, 38, and Asomugha, 34, moved into the house two years ago, shortly after giving birth to their daughter Isabella in April 2014.\nComedian Nicole Sullivan, who used to star on the sitcom the King of Queens, previously owned the home.\nThe couple, who wed in June 2013, still own a home in Manhattan beach, south of Los Angeles, that the former pro athlete purchased in 2010.\nQuick turnaround: The Scandal star, pictured at the Sundance film festival on January 23, bought the property in May 2014\nContrasts: The interior of the home features white walls and dark hardwood floors\nAiry feel: The interior is filled with natural light courtesy of the plentiful windows and glass doors\nSimply charming: The home gives off a clean minimalist feel with its carefully coordinated furnishings\nComfortable: Large area rugs cover the floors in the living area, which has a white and taupe color scheme\nWorkout: The home includes a pretty size-able gym, perfect for practicing yoga in the comfort of one's own home\nThe interior of the main house features white decor with dark wood accents and matching furnishings.\nColorful rugs adorn the dark hardwood floors and the plentiful windows and glass doors let in plenty of light.\nThe master suite has a large custom walk-in closet and a wall-to-ceiling tiled bathroom.\nCook's choice: The kitchen includes stainless steel appliances and country-style cabinets\nSlumber time: The main house offers four bedrooms and four full bathrooms and the master suite has a walk-in closet\nLuxury living: The master bath features wall-to-ceiling tile, a large shower and tub and white vanities\nIn addition to the main house, the gated estate also offers a detached guest house with its own kitchen and chauffeur's quarters over the garage.\nThe grounds feature a swimming pool and deck, a covered patio living area with a big screen TV, fire pit and half-court basketball.\nThere are also paved courtyards and lawn areas.\nPlenty of room: The master bedroom also includes a custom-made walk-in closet for storing away an actress's gowns for awards season\nJaw dropping: Above, a view of the Hollywood Hills outside of one of the home's picturesque windows\nPrivate: The French chateau-inspired property sits back from the road behind gates\nRoom to roam: The estate also boasts a detached guest house, chauffeur's quarters over the garage, a swimming pool, outdoor living area with a TV and fire pit and a basketball court","url":"https://www.dailymail.co.uk/news/article-3423076/Scandal-star-Kerry-Washington-ex-NFL-player-husband-sell-Hollywood-Hills-mansion-2-68million.html"}
