{"authors":["Press Association"],"date_download":"2018-10-22 23:50:50","date_modify":"2018-10-22 23:50:50","date_publish":"2016-01-11 07:42:33","description":"The estranged husband of former Atomic Kitten singer Kerry Katona will appear in court charged with assaulting her. George Kay, 36, was arrested following an...","filename":"data/vaneerConsumption/Kerrykatonasestrangedhusbandincourttofaceassaultcharge.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-cb4eabc6-64c8-453b-8910-4a18342ee03e-48qEJGFphM8d437f0aaf9220efd7-219_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393451_Kerry-Katonas-estranged-husband-court-face-assault-charge_1540252250.html","title":"Kerry katona's estranged husband in court to face assault charge","title_page":"Kerry katona's estranged husband in court to face assault charge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kerry Katona's estranged husband in court to face assault charge\nThe estranged husband of former Atomic Kitten singer Kerry Katona will appear in court charged with assaulting her.\nGeorge Kay, 36, was arrested following an alleged bust-up at the couple's home in Crowborough, East Sussex, last October 3.\nHe was charged by Sussex Police with assault by beating and possessing a banned weapon, relating to a Taser-style instrument disguised as a torch.\nGeorge Kay, estranged husband of former Atomic Kitten singer Kerry Katona\nKay, a labourer of Hollybank Moore, Warrington, Cheshire, faces a third charge of possessing a bladed article, relating to a hunting knife found in a wardrobe.\nFormer I'm A Celebrity ... Get Me Out of Here! and Celebrity Big Brother contestant Katona, 35, who married ex-rugby league player Kay in 2014, is likely to give evidence in the case.\nSince the alleged incident, three-times married Katona announced the couple had split. In an interview with OK! magazine, she said breaking up was \"hard\" but \"the right thing to do\".\nShe said: \"George was with me 24/7. It's like somebody has died. He was my best friend.\" But she added: \"There is no going back with George and me.\"\nMother-of-five Katona's previous failed marriages had been to Irish former Westlife singer Brian McFadden and Mark Croft.","url":"https://www.dailymail.co.uk/wires/pa/article-3393451/Kerry-Katonas-estranged-husband-court-face-assault-charge.html"}
