{"authors":["Jack Gaughan For Mailonline","Chris Wheeler For The Daily Mail"],"date_download":"2018-10-23 01:29:12","date_modify":"2018-10-23 01:29:12","date_publish":"2016-01-28 15:48:57","description":"Kevin De Bruyne looks set to miss the Capital One Cup final after scans revealed he could be out for up to 10 weeks. The Manchester City star sustained knee ligament damage against Everton.","filename":"data/vaneerConsumption/KevinDeBruynetomisssixweekswithkneeinjuryfromManCitysCapitalOneCupwin.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AA169D00000578-0-image-a-28_1453995887357.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421206_Manchester-City-star-Kevin-Bruyne-set-miss-six-weeks-knee-ligament-injury-rules-Capital-One-Cup-final_1540258152.html","title":"Kevin De Bruyne to miss six weeks with knee injury from Man City's Capital One Cup win","title_page":"Kevin De Bruyne to miss six weeks with knee injury from Man City's Capital One Cup win | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manuel Pellegrini is relieved that he did not suffer cruciate ligament issue\nThat means the Belgian is definitely out of the Capital One Cup final\nThe playmaker tweeted on Thursday that he'll be out for 'around ten weeks'\nHe damaged his knee ligaments and went to see a specialist\nKevin De Bruyne was taken off in agony against Everton on Wednesday\nKevin De Bruyne will miss the Capital One Cup final next month after being ruled out for 10 weeks with ligament damage.\nManchester City’s £54million summer signing tweeted the news after seeing a specialist in London.\nDe Bruyne came off the bench on Wednesday to inspire City to victory in their semi-final against Everton.\nBut the Belgium midfielder injured his right knee and ankle in a challenge with Ramiro Funes Mori.\nManchester City playmaker Kevin De Bruyne left the Etihad Stadium on crutches on Wednesday evening\nJust got back from the specialist. I'll be out for around 10 weeks. — Kevin De Bruyne (@DeBruyneKev) January 28, 2016\nDe Bruyne screams in agony after suffering knee ligament damage that could keep him out for 10 weeks\nThe Belgian looks set to miss the Capital One Cup final with his injury suffered in Wednesday's semi-final\nGAMES DE BRUYNE COULD MISS January 30 - vs Aston Villa (A - FA Cup) February 2 - vs Sunderland (A) February 6 - vs Leicester City (H) February 14 - vs Tottenham (H) February 24 - vs Dynamo Kiev (A - CL) February 28 - vs Liverpool (Capital One Cup) March 2 - vs Liverpool (A) March 5 - vs Aston Villa (H) March 12 - vs Norwich City (A) March 15 - vs FC Dynamo Kyiv (H - CL) March 20 - vs Manchester United (H) April 2 - vs Bournemouth (A)\nHe had scored in every round he played of the competition, including the second leg against Roberto Martinez's Toffees.\nHe is set to miss about a dozen matches, including the Wembley final against Liverpool on February 28, the Champions League tie against Dynamo Kiev and the quarter-final should they get that far.\nThe 24-year-old came off in stoppage time of the victory at the Etihad Stadium after a challenge by Ramiro Funes Mori.\nHe has absolved the Everton defender of any blame, however, saying: ‘Nobody touched me. It just got stuck and I think I fell the wrong way.’\nEverton keeper Joel Robles has apologised for trying to pick De Bruyne off the pitch, not realising he needed to be carried away on a stretcher.\nDe Bruyne covers his face as he is carried off the field on a stretcher in the closing stages against Everton\nIt comes as a serious blow for City, who have seen De Bruyne add a new attacking dimension since his £54million arrival in the summer.\nBut the club will be thankful it isn’t something more serious.\nPellegrini knew the injury was going to be long-term immediately after Wednesday's win and was talking in uncertain terms as to whether the Belgian would play again this season.\nWhen asked if him missing the remainder of the was likely, Pellegrini said: 'I hope not. It is very difficult to know in this moment but I am optimistic he will not be out for the rest of the season. It is not a cruciate ligament, it is the medial ligament.\n'I always said Kevin is a very important player in the whole season. He didn't start because we have to play nine games in 27 days. I think it is important to have a very good rotation of the squad.’","url":"https://www.dailymail.co.uk/sport/football/article-3421206/Manchester-City-star-Kevin-Bruyne-set-miss-six-weeks-knee-ligament-injury-rules-Capital-One-Cup-final.html"}
