{"authors":[],"date_download":"2018-10-30 21:17:42","date_modify":"2018-10-30 21:17:42","date_publish":"2015-02-12 18:15:01","description":"Each week on the Atlanta Eats television show, we get to go into the kitchen and talk to the best chefs in Atlanta.","filename":"data/vaneerConsumption/KevinRathbunsGuiltyPleasure.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/02/12/Images/photos.medleyphoto.6779617.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_dining_kevin-rathbun-guilty-pleasure__1540934262.html","title":"Kevin Rathbun’s Guilty Pleasure","title_page":"Kevin Rathbun’s Guilty Pleasure","title_rss":"NULL","source_domain":"ajc.com","text":"Each week on the Atlanta Eats television show, we get to go into the kitchen and talk to the best chefs in Atlanta. You can’t talk about the best chefs in Atlanta without mentioning Kevin Rathbun. Kevin Rathbun really needs no introduction, but we’ll give him one anyway. A chef and a master restaurateur, Kevin has elevated the Atlanta dining scene in ways that nobody else has. He brought Inman Park into restaurant relevance, competed on a national stage and received accolades from just about every group that gives them. You love his steakhouse, his eponymous restaurant and everything else he has built in between. But what does he love? What is this master chef craving when he’s not making you a Thai duck risotto to die for? Well, we went straight to the source. From guilty pleasures to the one trend that needs to go far, far away, this is the way Kevin Rathbun eats in Atlanta.\nNot every meal can be an elevated experience with tastings and pairing. What is your guilty pleasure in Atlanta?\nWhen I need some really great, unpretentious food, I go to Antico and grab a Napolitano pizza and finish with one of their gelatos.\nWhere would you go for your dream day of dining in Atlanta? Breakfast, lunch and dinner?\nFor breakfast, I start off with a Matthew’s Caffeteria for the biscuits and gravy. For lunch, I’m going to General Muirs and grabbing a double pastrami sandwich. And for dinner? It’s Sotto Sotto in Inman Park. I love the tagliatelle fungi and the risotto.\nThis is a tough one. Give us the best burger, the best BBQ and the best steak - that’s not yours- in Atlanta?\nFor the burger, I’m a Grindhouse fan. Going right for the Apache Burger (pepper jack cheese, grilled onions New Mexico green chiles, lettuce). Favorite BBQ? Community Q. I’m a big brisket guy coming from Kansas City. Their brisket is the best in town. Sides are great too, but love the way they slice it thin, just like I love. Also love the burnt ends. And it’s Hal's for steak and hanging with Hal, himself.\nWhat’s next for the Atlanta dining scene?\nThree things come to mind. 1. Indoor markets. On a local level, love Krog Street Market. I think that Inman Park is really blowing up. It’s the future. 2. More local fast casuals like the new additions of Yalla and Fred’s Meat and Bread, and Bell Street Burritos. Just local guys with flair doing sandwich spots. Local people, not chains. I think that’s one of the best things going on right now. And 3. Beltline walk ups like what King of Pops is doing.\nWhat’s the one food trend you’re sick of?\nMolecular gastronomy. Good food on a plate is what it should be. [Molecular gastronomy]is weird and over the top. And a little fussy. There’s some great technique involved - like immersion circulators. But, hey man, grill a great steak. Take care of some great vegetables.\nWhat is the perfect order at your newest restaurant, KR Steakbar?\nStart with the octopus with potato, charred onion and orange, then order the Pecorino Tonnarellii. For the entrée: the shell steak with horseradish and espresso. And dessert? Chocolate Budino with candied orange. Now, to drink. I’m a big gin drinker. Specialty cocktails are too sweet. Ideal drink is Plymoth Gin with soda and lime. And for this meal, a great red wine would work. Some sort of Amarone or a big, Italian red.\nFor more on the ne into Atlanta Eats every Saturday and Sunday at 10:30 on Peachtree TV Hungry yet?","url":"https://www.ajc.com/entertainment/dining/kevin-rathbun-guilty-pleasure/5apkFC3qcDdITmfrU8LOmK/"}
