{"authors":["Associated Press"],"date_download":"2018-10-23 03:04:56","date_modify":"2018-10-23 03:04:56","date_publish":"2016-01-29 17:52:47","description":"FORT WORTH, Texas (AP) — A judge ruled Friday that a Texas teenager known for using an \"affluenza\" defense in a fatal drunken-driving wreck will remain at a ...","filename":"data/vaneerConsumption/KeyeventsincaseofaffluenzateenEthanCouch.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421918_Key-events-case-affluenza-teen-Ethan-Couch_1540263896.html","title":"Key events in case of 'affluenza' teen Ethan Couch","title_page":"Key events in case of 'affluenza' teen Ethan Couch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Key events in case of 'affluenza' teen Ethan Couch\nFORT WORTH, Texas (AP) — A judge ruled Friday that a Texas teenager known for using an \"affluenza\" defense in a fatal drunken-driving wreck will remain at a juvenile detention facility until a hearing next month. Ethan Couch, 18, was deported a day earlier from Mexico, where authorities believe he and his mother fled as Texas prosecutors investigated whether he violated his probation in the 2013 wreck.\nHere is a timeline of events in the case:\n— June 15, 2013: Four people are killed when a pickup truck driven by 16-year-old Ethan Couch swerves off a road south of Fort Worth, Texas. Couch's blood-alcohol level is three times the legal limit for driving. The victims are a woman whose vehicle was disabled on the side of the road and three people helping her. Two of the seven passengers in Couch's truck are severely injured.\n— Dec. 4, 2013 — Couch \"admitted his guilt\" in juvenile court in four cases of intoxication manslaughter and two cases of intoxication assault, according to the Tarrant County Criminal District Attorney's Office.\n— Dec. 10, 2013: A defense witness testifies during Couch's sentencing that the teen's wealthy parents coddled him into a sense of irresponsibility, a condition the psychologist termed \"affluenza.\" Couch is later ordered to rehab and sentenced to 10 years' probation, which prosecutors and law enforcement blasted as too weak.\n— Feb. 5, 2014 — A juvenile court judge sets probation conditions that include barring Couch from driving and from drinking alcohol or using drugs.\n— August 2015 — Couch's father files for divorce, a year after he and his wife stopped living together as a couple. Fred and Tonya Couch originally married in 1996. They divorced 10 years later, but then remarried in April 2011.\n— On or about Dec. 2, 2015 — A video surfaces that shows Ethan Couch at a party where alcohol was being served. Drinking alcohol would be a violation of his probation.\n— Dec. 3, 2015 — Couch is contacted by his probation officer and told to report for a drug test. His mother withdraws $30,000 from her personal account. On or around the same date, mother and son hold a gathering in which they talk about going to Mexico, and Fred Couch tells authorities that Tonya Couch had called to tell him he would never see their son again.\n— Dec. 10, 2015 — Ethan Couch, who is now 18, misses a mandatory appointment with his probation officer.\n— Dec. 11, 2015 — A directive to apprehend Couch for a probation violation is issued.\n— Dec. 16, 2015 — Authorities publicly announce they're investigating whether Couch fled with his mother in an attempt to avoid facing accusations that he may have violated his probation.\n— Dec. 28, 2015 — Ethan Couch and Tonya Couch are taken into custody in the Mexican resort city of Puerto Vallarta, a few days after a call for pizza delivery tipped off authorities to their whereabouts. Texas authorities issue an arrest warrant for Tonya Couch.\n— Dec. 30, 2015 — Tonya Couch is deported, but a Mexican judge decides to delay Ethan Couch's deportation. Tonya Couch arrives on a flight early the next morning in Los Angeles, where she is taken to jail.\n— Jan. 7, 2016 — Law enforcement officers accompany Tonya Couch as she is flown back to Texas. She is booked at the Tarrant County Jail in Fort Worth.\n— Jan. 8, 2016 — Tonya Couch is arraigned on a charge of hindering the apprehension of a felon. Her bond is set at $1 million.\n— Jan. 11, 2016 — A judge lowers Tonya Couch's bond to $75,000. She posts the bond the next day and is released to live with another son, after being fitted with an electronic ankle GPS monitor.\n— Jan. 17, 2016 — Ethan Couch's attorney in Mexico files a document seeking to lift the injunction that has kept him in Mexico.\n— Jan. 25, 2016 — Ethan Couch formally ratifies his decision to drop an appeal against deportation.\n— Jan. 28, 2016 — Ethan Couch is deported and flown on a commercial flight from Mexico City to Dallas-Fort Worth International Airport. He is booked at a juvenile detention facility.","url":"https://www.dailymail.co.uk/wires/ap/article-3421918/Key-events-case-affluenza-teen-Ethan-Couch.html"}
