{"authors":["Associated Press"],"date_download":"2018-10-23 02:07:37","date_modify":"2018-10-23 02:07:37","date_publish":"2017-03-10 11:04:34","description":"SEOUL, South Korea (AP) - Key moments in the life of Park Geun-hye, who was ousted as South Korean president by the country's Constitutional Court on...","filename":"data/vaneerConsumption/KeymomentsinthelifeofoustedSouthKoreanpresident.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195519-1489144161-575_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300822_Key-moments-life-ousted-South-Korean-president_1540260457.html","title":"Key moments in the life of ousted South Korean president","title_page":"Key moments in the life of ousted South Korean president | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SEOUL, South Korea (AP) - Key moments in the life of Park Geun-hye, who was ousted as South Korean president by the country's Constitutional Court on Friday:\n- Feb. 2, 1952: Park is born as the eldest child of Park Chung-hee and Yuk Young-soo.\n- 1963: Park moves to the presidential Blue House after her father becomes president, two years after he staged a coup and took control of the country.\nFILE - In this Dec. 19, 2012 file photo, South Korea's presidential candidate Park Geun-Hye, center, of ruling Saenuri Party, waves to supporters after arriving at the party headquarters in Seoul, South Korea. The ouster of President Park by the country's Constitutional Court on Friday, March 10, 2017, ends a power struggle that consumed the nation for months. (Kim Jae-hwan/Pool Photo via AP, File)\n- 1974: Park's mother is shot and killed by a Korean resident of Japan, claiming orders from then-North Korean leader Kim Il Sung, while Park Chung-hee was making a speech at a Seoul theater. Park Geun-hye is rushed from Paris, where she had been studying, and begins serving as acting first lady.\n- 1979: Park Chung-hee is assassinated by his Korean Central Intelligence Agency chief Kim Jae-kyu during a late-night drinking party. Park Geun-hye's first reaction to the news of her father's death is reportedly to check on the security status at the border with North Korea, comments that lead supporters to say she deserves a national leadership role. After her father's state funeral, Park Geun-hye leaves the Blue House.\n- 1998: After years of avoiding the public eye, Park enters politics and wins a parliamentary seat amid public nostalgia for her father that erupted after South Korea was battered by the Asian financial crisis. She becomes an iconic figure of South Korean conservatives.\n- 2006: Park, then leader of the main conservative opposition party, is attacked by a man wielding a box cutter while she was campaigning in Seoul for upcoming elections. She is given 60 stitches on an 11-centimeter (four-inch) gash on her face. The first words she says at a hospital were, \"How is Daejeon?\" to check how the election campaign was going in that central city; that further builds up her image as a strong leader.\n- 2012: Park wins the presidency by defeating her main liberal rival Moon Jae-in.\n- Dec. 9, 2016: Park is impeached by the liberal-controlled parliament over allegations that she colluded with her longtime friend of 40 years, Choi Soon-sil, to extort money from businesses and let Choi pull government strings, though she has never held a government post. Park once described Choi as a person who helped her \"when I had difficulties\" in the past, in an apparent reference to her parents' assassinations.\n- March 10, 2017: Park is formally removed from office after the Constructional Court upholds her impeachment.","url":"https://www.dailymail.co.uk/wires/ap/article-4300822/Key-moments-life-ousted-South-Korean-president.html"}
