{"authors":["Liam Deacon"],"date_download":"2018-10-30 22:05:40","date_modify":"2018-10-30 22:05:40","date_publish":"2018-09-11 14:00:17","description":"The London Assembly has voted to push for a vote on “reversing” Brexit and keeping the UK locked in the European Union (EU). | London / Europe","filename":"data/vaneerConsumption/KhansLondonAssemblyVotestoPushtoReverseBrexit.json","image_url":"https://media.breitbart.com/media/2018/09/SK.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_09_11__1540937140.html","title":"Khan’s London Assembly Votes to Push to ‘Reverse’ Brexit","title_page":"Khan’s London Assembly Votes to Push to ‘Reverse’ Brexit | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The London Assembly has moved to push for a vote on “reversing” Brexit, keeping the UK locked in the European Union (EU).\nThe 25-member body, elected to scrutinise Mayor Sadiq Khan, demanded he “join the campaign for a ‘people’s vote’ on the final terms of Brexit… leaving open the option of reversing the result of the referendum”.\nIn the capital, around 200,000 more people voted to leave the Brussels bloc in the referendum than the number who voted for Mr Khan, including first and counted second votes, in the Mayoral elections.\nGreen Party co-leader and London Assembly Member Sian Berry, who proposed the anti-Brexit motion, said the body “has recognised that there is a huge strength of feeling in London for a people’s vote”.\n“This motion also acknowledges the strength of feeling among Assembly members,” she added.\nHowever, UKIP education spokesman and London Assembly Member David Kurten hit back, telling Breitbart London:\n“It is astonishing how some Remoaners still do not respect the result of the referendum on leaving the EU and are trying to overturn the democratic will of the people under the guise of having a ‘People’s Vote’.”\nHe continued: “A small but noisy minority of anti-democrat EU sycophants are propagandising the idea that people who do not agree with them are unintelligent or didn’t know what they were voting, but his is a great calumny!\n“We had a people’s vote, the people knew what we were voting for, and the people voted to leave!\n“It is shocking that a majority of London Assembly Members voted against democracy yesterday, but UKIP will always speak up on behalf of the people of the nation and fight for the ordinary patriotic people of Britain who want our country back.”\nMr Khan hinted in 2017 that he could back a second vote and is currently campaigning for a “soft” Brexit, with the UK tied to the bloc’s Single Market and mass migration rules.\nHe has also said he is “optimistic” about the UK staying in the bloc, linked the vote to leave to “hate crimes”, and hosted events in City Hall framing Brexit as harmful.\nCity Hall and Mr Khan allegedly worked with the European Commission to put on a so-called “My Life My Say” event in May, with many prominent anti-Brexit speakers such as New European editor Alastair Campbell.","url":"https://www.breitbart.com/europe/2018/09/11/khans-london-assembly-votes-to-push-to-reverse-brexit/"}
