{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:50:55","date_modify":"2018-10-22 23:50:55","date_publish":"2016-01-11 07:45:16","description":"Khloe Kardashian suggested a threesome with her teenage sister Kylie and her boyfriend Tyga on Sunday's episode of Keeping Up With The Kardashians.","filename":"data/vaneerConsumption/KhloeKardashianproposesthreesomewithsisterKylieJennaandTygaonKUWTK.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/06/300593A000000578-0-image-a-143_1452495524759.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393432_What-Khloe-Kardashian-proposes-threesome-teen-sister-Kylie-beau-Tyga-KUWTK_1540252255.html","title":"Khloe Kardashian proposes threesome with sister Kylie Jenna and Tyga on KUWTK","title_page":"Khloe Kardashian proposes threesome with sister Kylie Jenna and Tyga on KUWTK | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Khloe Kardashian suggested a threesome with her teenage sister Kylie and her boyfriend Tyga on Sunday's episode of Keeping Up With The Kardashians.\nThe reality star kept up her penchant for outlandish statements while riding with Kylie and Tyga to a New York Fashion Week event.\n'You guys, why don't we just have a threesome?,' Khloe jokingly said as they rode in the back of a black SUV.\nSee Khloe Kardashian updates as she jokingly proposes a threesome with Kylie and Tyga\nScroll down for video\nOutlandish statement: Khloe Kardashian suggested a threesome with sister Kylie and her boyfriend Tyga on Sunday's episode of Keeping Up With The Kardashians\n'And then, what could our name be?,' she added.\nKylie started to suggest a nickname, but rapper Tyga stepped in and offered up 'Khloga'.\nThe episode titled The Big Launch primarily centered on all five sisters getting together in New York City to launch their new mobile apps.\nKim and the girls got ready for the launch of their app, with Kourtney unhappy that she had been pushed into the ‘mom stuff’ corner.\nNickname needed: Tyga suggested the name 'Khloga' for their three-way\n‘They don’t know what they are doing with me,’ she griped.\n‘I know what I am passionate about. I think they have dropped the ball,' she said.\nKhloe told the cameras her sister had been through a tough time but was ‘delusional’ and trying to shift the blame on why her app was late.\nLaunch delayed: Kourtney Kardashian was none too pleased about the launch of her app being delayed\n‘Kourt you dropped the ball,’ said Khloe and she and Kim agreed Kourtney was ‘pissed’ that they were doing so much with their apps.\nKim then showed Kylie old videos in which Khloe told the cameras that Kim will be famous one day.\nShe then talked to Kylie about ‘being professional’ for her ‘perfectionist’ husband Kanye West when she took part in his New York fashion show.\nGood advice: Kim Kardashian took Kylie aside to make sure she was professional for husband Kanye West's fashion show\nKim said she felt compelled to talk to Kylie after hearing her sister could be difficult and keep people waiting.\n‘This is different, this is family,’ she told the cameras.\nKourtney dug her heels in when she realized the app launch would not include her own and threatened to skip it all together.\nIt's family: The reality star wanted to make sure that Kylie didn't bring her entourage or keep people waiting\n‘I had just had a baby. Not one person has bothered me about this,’ argued Kourtney.\nKim and Kanye then attended the Givenchy show in which Kendall modelled.\nBack in Los Angeles, Corey Gamble took Kris out for lunch and told her they needed to watch black movies like Boyz N The Hood and Friday.\nFashion week: Kanye and Kim were shown headed to the Givenchy fashion show\nOn the runway: Kendall Jenner walked the runway at the Givenchy show\nMovie suggestions: Corey Gamble recommended that Kris watch Boyz N The Hood and Friday\n‘You did not have the right African-American man in your life,’ he laughed.\nKourtney made the trip to New York and the whole group got to have a rare family dinner together, where Khloe admitted she used to fight regularly on nights out.\n‘I used to be insane,’ she laughed as Kourtney told the girls she got punched in the face while at a club.\nFormerly insane: Khloe revealed during a family dinner that she used to fight regularly on nights out\nGood one: Kendall cracked up as her sisters shared funny stories about themselves\nKim and Kourtney then talked about the late launch of Kourtney’s app, with Kim telling her sister to spin that it was late because it was more lifestyle-orientated.\n‘Or I could say too that I just had a baby when we were working on it,’ said Kourtney.\n‘No, no. So what? I’m pregnant, everyone in life has a baby and they work like 10 jobs. You are not special, sorry,’ said an unsympathetic Kim.\nNo sympathy: Kim had no sympathy for Kourtney over her delayed app\n‘No excuses. You knew you were having this baby nine months before you did and you knew you had this app a year ago. To me there is no excuses,’ Kim said.\nKim then spent time with friend Jonathan Cheban and asked him to drop off a urine sample with her doctor.\n‘I need to pee in a cup and I need it dropped off,’ she laughed.\nSmall favour: The pregnant reality star asked her best friend Jonathan Cheban for an odd favour\nThat's disgusting: Jonathan balked at delivering Kim's urine sample but eventually relented\n‘That is disgusting. There better be no warmth,’ said a horrified Cheban.\nKim then made him run out to collect cronuts which took so long Cheban’s masseuse left without rubbing him down.\nDuring a night out Kylie annoyed her sisters by leaving early with Tyga.\nMessed up: Khoe scolded Kylie for leaving her magazine cover party early with Tyga\nKim then had to have a talk with Kylie about not bringing her entourage to Kanye’s fashion show.\n‘I just want her to have a long career and a good reputation for people to want to work with her. She needs to learn to be responsible and respectful of everybody and to know why it is so important,’ Kim told the cameras.\nWhile in New York, Scott Disick was left at home looking after he and Kourtney’s children.\nOld friends: Kris caught up with gal pal Faye Resnick over lunch\n‘I am proud of Kourtney as I feel she is trying to really try to make a really bad situation a lot better by co-parenting with Scott, I just hope that he can make a commitment and really follow through,’ Kris told the cameras.\nOver lunch Kim and Kylie joked that Kris was ‘out of hand’ by constantly stealing Kim’s looks.\n’She is fully stealing my clothes and trying to clone my looks when I am gone,’ laughed Kim.\nTough talk: Kim told Kylie about her reputation for being 'kind of a diva on set'\nKim then told her sister that she had heard from people that she ‘was kind of a diva on set’ and she was always on her phone.\n‘Oh my God. I am so not. I am always nice to everybody,’ said Kylie.\nKim told her that she wanted her to have a ‘wild’ reputation but be professional whenever she was working.\n‘I totally understand what Kim is saying. It is hard to hear but I need to make an effort to be professional and nice to everybody everywhere I go,’ admitted Kylie to the cameras.\nHard to hear: Kylie admitted that she had to make more of an effort to be professional\nModel looks: The teen took part in Kanye's fashion show\nKris and Corey then visited artist Mr. Brainwash and he showed her an old-style picture he had worked on of the whole family, much to the amusement of Kris.\nOver dinner Kourtney was asked how life was in the house without Scott.\n‘It is just trying to figure out how to manage life. First I was like come over whenever you want, have breakfast, dinner, whatever yo want to do but that was not really working and now we have it like ''You need to come when you say you will come'' we are trying that,’ said Kourtney.\nMBW fans: Kris and Corey visited the gallery of one of their favourite artists Mr. Brainwash\nThe artist: Mr. Brainwash, real name Thierry Guetta, welcomed Kris and Corey to his studio\nShe was then asked if she wanted him back in her life.\n‘Not right now. I don't know if there will be a day when Scott will get it together and change and be someone I can depend on and be a partner, but he is none of those things right now,’ she explained.\nAsked if she was ready to wait for Scott, she said: ‘No, I am not waiting.’\nNot waiting: Kourtney during dinner said she wasn't waiting for Scott Disick\n‘I love Scott but I have gotten to a place where I am living life again and I need to separate myself because over time I carry his problems on my shoulders. I physically can’t keep doing it. Scott really needs to help himself and I need to focus on myself.’\nKourtney was then told that she needs to get out on a date.\n‘I don’t think i want to go on a an actual date. I mean the people that talk to me, I mean what am I going to do with them? They are like 7’5 and a basketball player. Dates to me are like brutal,’ she laughed.\nThey're brutal: The mother of three said she found dating 'brutal'\nLater, while hanging out with her pregnant fashion designer friend, Stacey Bendet, Kourtney said she realized what Kim had been talking about.\n‘I understand Kim’s point, I need to get back to how I used to be,’ said Kourtney.\nKris also spilled that Kim was so worried about how she looked during pregnancy that she hired a body double to try on all her outfits for her.\nSpilling it: Kris revealed that Kim uses a body double to try on her maternity clothes for her\n‘She has a body double. She has someone come over here and put a prosthesis on like a pregnant person and makes them try on all her loathes because she’s too tired to do it,’ laughed Kris while talking to Kourtney.\nKris then added that Kim took pictures of the model in the outfit and pinned them to the clothes so she can remember what it looks like on a pregnant woman.\nPicture proof: The momager showed how Kim attaches a photo of her body double to her clothes\nThe momager held up one of the photos and poked fun at the model being skinnier than Kim.\n‘Is the body double going to have to start eating beignets because she needs to get a bigger a**,' Kris said.\nIn scenes from the next episode Kourtney was shown on a nude photoshoot, and Kendall revealed she misses doing the ‘boyish things’ she used to do with her dad, Caitlyn Jenner.\nMissing out: Kendall in a scene from the next episode revealed she missed doing 'boyish things' with her father Caitlyn Jenner\nAnd it showed Caitlyn telling Kendall that if she had issues with the ‘changes’ that had gone on then she needed to to speak directly to her.\nKris Jenner also was shown arguing about the chances of getting breast cancer, with Khloe telling her mother she does not care when she dies.\nKeeping Up With The Kardashians airs on Sunday nights on the E! network.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393432/What-Khloe-Kardashian-proposes-threesome-teen-sister-Kylie-beau-Tyga-KUWTK.html"}
