{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 22:35:55","date_modify":"2018-10-22 22:35:55","date_publish":"2017-04-26 04:54:59","description":"It may have only been Tuesday, but Khloe Kardashian and Kris Jenner were letting loose.\nThe mother and daughter duo were spotted knocking back the wines at a winery in Malibu.","filename":"data/vaneerConsumption/KhloeKardashianshowsoffherlonglegsatawinery.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/04/3F9C050600000578-0-image-a-69_1493176422395.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446182_Khloe-Kardashian-shows-long-legs-winery_1540247755.html","title":"Khloe Kardashian shows off her long legs at a winery","title_page":"Khloe Kardashian shows off her long legs at a winery | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It may have only been Tuesday, but Khloe Kardashian and Kris Jenner were letting loose.\nThe mother and daughter duo were spotted knocking back the wines at a winery in Malibu during a lunchtime outing.\nAppearing to have been filming scenes for their long-running reality show, Keeping Up With The Kardashians, Kris and Khloe were spotted chatting at a table, as they enjoyed a meal and sampled the different wines on offer.\nLegging it: Khloe Kardashian showed off her pins during a day out at a Malibu winery on Tuesday\nThe pair appeared extremely relaxed as they took in their serene surroundings, accompanied by a camera crew.\nShowing off her long, lean legs, Khloe looked sexy in a figure-hugging white mini-dress.\nShe wore towering nude stilettos, and kept warm with an oversize camel-colored blanket coat.\nThe 32-year-old was seen toting a beige designer handbag with bamboo handle, and she accessorized with large Chanel hoop earrings and diamond rings.\nKeeping it short... Showing off her long, lean legs, Khloe looked sexy in a figure-hugging white mini-dress\nThe right stripes: Joining her daughter was Kris Jenner, who looked chic in a pair of black and white pinstripe trousers\nTrying it out... Kris and Khloe were spotted chatting at a table, as they enjoyed a meal and sampled the different wines on offer\nCutting loose: The mother and daughter duo were spotted knocking back the wines during a lunchtime outing\nHer shoulder-length hair was parted on the side and worn in loose waves, and she wore a pair of stylish reflective sunglasses from Quay.\nMeanwhile, Kris looked chic in a pair of black and white pinstripe trousers.\nShe wore a navy top with corseted bodice, and had a white coat draped over her shoulders.\nGood times: The pair seemed in great spirits, chatting and laughing with each other and their crew\nOn set: The pair appeared extremely relaxed as they took in their serene surroundings, accompanied by a camera crew\nStanding tall: Khloe opted for a pair of towering nude stilettos, while Kris wore chunky black and white platform heels for the occasion\nThe 61-year-old momager sported a pair of chunky black and white platform heels for the occasion, and wore a pair of black sunglasses.\nShe also wore a short chain necklace, and her trademark cropped hair was slightly tousled.\nThe pair seemed in great spirits, chatting and laughing with each other and their crew.\nAt one stage, Khloe was even seen putting her hand on her mom's back in an affectionate gesture.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446182/Khloe-Kardashian-shows-long-legs-winery.html"}
