{"authors":["Carmel Holt"],"date_download":"2018-10-22 20:16:28","date_modify":"2018-10-22 20:16:28","date_publish":"2018-08-10 00:00:00","description":"A power trio of an entirely different kind, the Houston band led a journey through globally-influenced funk, jazz, surf and psych-rock — before creating a live, instrumental hip-hop mixtape.","filename":"data/vaneerConsumption/KhruangbinLiveInConcertNewportFolk2018.json","image_url":"https://media.npr.org/assets/img/2018/08/10/khruangbin_bymarykang2_wide-b7acb797a927ab9705ce7d6aa098b738ec9926d5.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/event_music_630604090_khruangbin-live-in-concert-newport-folk-2018_1540239388.html","title":"Khruangbin, Live In Concert: Newport Folk 2018","title_page":"Khruangbin, Live In Concert: Newport Folk 2018  : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Nothing felt better — at noon, during the third day of Newport Folk Festival — than standing in the shade of the enormous tent covering the \"Quad Stage\" and grooving to the globally-influenced funk, jazz, surf and psychedelic stew that is Khruangbin.\nA power trio of an entirely different kind, this Houston band — Laura Lee on bass, Mark Speer on guitar, and Donald Johnson on drums and piano — delivered a set pretty evenly split between their Thai-funk influenced 2015 debut, The Universe Smiles Upon You, and this year's more Middle Eastern-leaning album, Con Todo El Mundo. The pinnacle moment came with an instrumental medley that showcased a less obvious, and truly American, influence on their sound — hip-hop.\nFollow along, if you can. The trio took us on a journey that seamlessly moved from Dr. Dre's \"Next Episode\" to Ice Cube's \"It Was a Good Day\", on to Warren G's \"Regulate\" before circling back to Leon Haywood's 1975 hit \"I Want'a Do Something Freaky To You\" (famously sampled by Dr. Dre on \"Nuthin' but a 'G' Thang\"). From there, \"Summer Madness\" by Kool & the Gang and finally bringing it in for a landing with Luniz's \"I Got 5 On It\" feat. Michael Marshall and \"Mary Jane\" by Rick James. Hearing these songs all through the Khruangbin sonic filter was not only a masterful live mixtape, but in the backdrop of Newport Folk Festival, was an exciting way to make musical worlds intersect.\nSET LIST:\n\"Dern Kala\"\n\"August 10\"\n\"Mr. White\"\n\"Two Fish And An Elephant\"\n\"Lady & Man\"\n\"Evan Finds The Third Room\"\n\"White Gloves\"\n\"Next Episode\"\n\"Today Was A Good Day\"\n\"Regulate\"\n\"Aint Nothing But A G-Thang\"\n\"Summer Madness\"\n\"Maria Tambien\"\n\"People Everywhere ( Still Alive)\"\nCREDITS:\nTechnical Director:Josh Rogosin; Production Assistant: Téa Mottolese ; Location Recording facilities Provided by Aura-Sonic, Ltd.; Producer: Suraya Mohamed; Photography: Adam Kissick.\nSpecial thanks to TuneIn's Newport Folk Radio. Listen to Newport Folk Radio year-round via TuneIn.com or the TuneIn app.","url":"https://www.npr.org/event/music/630604090/khruangbin-live-in-concert-newport-folk-2018"}
