{"authors":[],"date_download":"2018-10-22 20:39:43","date_modify":"2018-10-22 20:39:43","date_publish":"2014-05-02 19:46:34","description":"Kickstarter campaigns may soon face more than Internet outrage if they don't follow through on promises: a government lawsuit.","filename":"data/vaneerConsumption/KickstarterFraudStateSuesFailedProjectsCreators.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/417196/b35e002682806ec2a7c7748066965319_large_bc3d1e45e3dacb37338255a1a7f5efd8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_internet_kickstarter-fraud-state-sues-failed-projects-creators-n95951_1540240783.html","title":"Kickstarter Fraud? State Sues Failed Project's Creators","title_page":"Kickstarter Fraud? State Sues Failed Project's Creators","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"It's very clean,\" said Bernstein. \"They took all the money, and nobody got anything.\"\nSo Washington state is filing a lawsuit against the company, Altius Management, based in Nashville, Tennessee, and person who started the Kickstarter campaign, Edward J. Polchlepek III, also known as Ed Nash, demanding refunds for backers and fines for violating the Consumer Protection Act.\nNBC News attempted to contact Polchlepek and Altius but was unable to reach anyone.\nOne might reasonably ask why Kickstarter doesn't do something — it's certainly against the terms and conditions to cut and run. But Bernstein explained the crowdfunding company has to keep out of such disputes and, like eBay or Craigslist, make sure the consumer and the provider can hash it out between themselves.\nThe AG's office says this is the first legal action by law enforcement authorities in a case like this.\n\"Part of the reason we did this was the general deterrent factor,\" Bernstein said. \"What this shows is that someone may actually do something.\"\nHe was quick to add that they don't want to discourage sites like Kickstarter and Indiegogo, just show potential fraudsters there are repercussions — and remind users there are risks.\n\"We support the concept of crowdfunding, but consumers need to be wary,\" he concluded.","url":"https://www.nbcnews.com/tech/internet/kickstarter-fraud-state-sues-failed-projects-creators-n95951"}
