{"authors":[],"date_download":"2018-10-30 14:34:38","date_modify":"2018-10-30 14:34:38","date_publish":"2015-12-22 00:00:00","description":null,"filename":"data/vaneerConsumption/KidGlovesforaVileTerrorist.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_12_kid_gloves_for_a_vile_terrorist_1540910078.html","title":"Kid Gloves for a Vile Terrorist","title_page":"Kid Gloves for a Vile Terrorist","title_rss":"NULL","source_domain":"americanthinker.com","text":"Kid Gloves for a Vile Terrorist\nSamir Kuntar, a bloodsoaked terrorist, achieved grisly fame in 1979 when he kidnaped and killed members of an Israeli family from the coastal town of Nahariya. Kuntar broke into their home, taking the father Danny Haran and his four-year-old daughter, Einat, hostage. He then killed the father and beat his daughter to death, bashing her head with a rifle butt. A second daughter, Yael, 2, also died. Her mother smothered her as she tried to hide the child in a crawl space. Israel freed Kuntar three decades later in exchange for the bodies of two Israeli soldiers. Last Sunday, he won his proper reward in an airstrike near Damascus. His brother celebrated him as a martyr and Hamas protested this “heinous crime.”\nWith these basic facts, how did the Washington Post cover Kuntar’s well-deserved finale? The headline reads as follows: “Airstrike killed militant active in Syrian conflict.” Militant? Yes. At a minimum, the Post should have accorded him membership in a pantheon of terrorists. Why, given his bloody record, does the Post need to settle for the likes of a mere “militant?” Even the State Department qualifies Kuntar as a global terrorist. But let’s skip the headline and proceed to the first two paragraphs, written by Ruth Eglash and Hugh Nailor. Post readers are a busy lot and the vast majority are not likely to go beyond the two leading paragraphs. So here’s their version: “JERUSALEM-A notorious Lebanese militant (the Post just can’t tear itself away from softening Kuntar’s bio) leader, viewed by the United States and Israel as a terrorist (finally, the T word, but notice that it’s just the U.S. and Israel who allow themselves the T word -- not necessarily the Post) and deeply involved in the Syrian civil war, was killed late Saturday in an airstrike on the outskirts of Damascus. “Suspicion for the attack, which killed Samir Kuntar and at least eight others affiliated with the Lebanese militant (Yes, there’s no way for the Post to relinquish the M-word) group Hezbollah, immediately fell on Israel. Kuntar was released by Israel in 2008 after he spent three decades in prison for his role in the killing of three Israelis, including a 4-year-old girl and her father.” The younger 2-year-old still has to make an appearance. Question: Does this coverage give proper credit to the Mideast’s Osama Bin Laden? Leo Rennert is a former White House correspondent and Washington bureau chief of McClatchy Newspapers","url":"https://www.americanthinker.com/blog/2015/12/kid_gloves_for_a_vile_terrorist.html"}
