{"authors":[],"date_download":"2018-10-22 20:28:22","date_modify":"2018-10-22 20:28:22","date_publish":"2014-06-01 16:30:29","description":"Two Italian priests and a Canadian nun kidnapped in northern Cameroon nearly two months ago by suspected Boko Haram gunmen were released on Sunday.","filename":"data/vaneerConsumption/KidnappedItalianPriestsandCanadianNunFreedinCameroon.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_22/480201/140601-cameroon-1226_327b3bcaf333d3e9a648ffc4a4d91ae2.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_kidnapped-italian-priests-canadian-nun-freed-cameroon-n119696_1540240102.html","title":"Kidnapped Italian Priests and Canadian Nun Freed in Cameroon","title_page":"Kidnapped Italian Priests and Canadian Nun Freed in Cameroon ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nYAOUNDE, Cameroon — Two Italian priests and a Canadian nun kidnapped in northern Cameroon nearly two months ago by suspected Boko Haram gunmen were released on Sunday, smiling and apparently in good health as they arrived in the capital.\nGiampaolo Marta and Gianantonio Allegri, missionaries from the diocese of Vicenza in northeast Italy, and Canadian Gilberte Bissiere were seized on the night of April 4 from the parish of Maroua, close to the border with Nigeria.\nThere has been no claim of responsibility for their kidnapping but Cameroonian officials have pointed the finger at the Nigerian Islamist group Boko Haram, which has become active in a region that it had for some time used as a logistical base.\nState television showed images of the priests and the nun arriving at Yaounde airport on Sunday in the company of heavily armed Cameroonian special forces.\nThe Cameroonian presidency said the captives had been \"handed over last night to Cameroonian authorities\", and thanked those who had worked for their release. Authorities declined to give further details of the release, or to say whether any deal had been done to secure it.\nThe clerics, looking tired but smiling, were greeted by the ambassadors of Italy and Canada, local church authorities and an envoy sent by Pope Francis, state television said.\nThey were taken to their respective embassies and were expected to meet Cameroonian President Paul Biya later on Sunday, officials said.\nIn Rome, Vatican spokesman Father Federico Lombardi said the pope had been informed immediately of the release, which \"fills us with joy.\"","url":"https://www.nbcnews.com/news/world/kidnapped-italian-priests-canadian-nun-freed-cameroon-n119696"}
