{"authors":["Associated Press"],"date_download":"2018-10-22 20:25:16","date_modify":"2018-10-22 20:25:16","date_publish":"2016-01-29 01:31:21","description":"PORT-AU-PRINCE, Haiti (AP) — A high-profile kidnapping trial started Thursday for the son of a prominent Haitian family with extensive business holdings in t...","filename":"data/vaneerConsumption/KidnappingtrialbeginsforsonofprominentHaitianfamily.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:612c2e34906a4522922dd3fee829175d-2vdWmEltwXfba0ce28e632ea4110-19_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421709_Kidnapping-trial-begins-son-prominent-Haitian-family_1540239916.html","title":"Kidnapping trial begins for son of prominent Haitian family","title_page":"Kidnapping trial begins for son of prominent Haitian family | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kidnapping trial begins for son of prominent Haitian family\nPORT-AU-PRINCE, Haiti (AP) — A high-profile kidnapping trial started Thursday for the son of a prominent Haitian family with extensive business holdings in the Caribbean nation.\nClifford Brandt was first jailed in 2012 for allegedly kidnapping two adult children of another wealthy family and demanding a ransom of $2.5 million. He escaped from a maximum-security lockup in a mass breakout in 2014 but was recaptured a couple of days later near the Dominican border.\nOn Thursday, masked officers carried duffel bags stuffed with evidence into a courtroom in downtown Port-au-Prince. One law enforcer carried a baseball bat to be entered into evidence.\nFILE - In this Aug. 12, 2014, file photo, Clifford Brandt is escorted by police after his arrest, in Port-au-Prince, Haiti. A high-profile trial has begun on Thrusday, Jan. 28, 2016, for Brandt, the son of a prominent Haitian family with extensive business holdings. Brandt allegedly kidnapped the adult children of another wealthy family. The trial is being regarded by many as a test of Haiti's justice system, which has long been regarded as corrupt and dysfunctional. (AP Photo/Dieu Nalio Chery, File)\nBrandt was later escorted into the courthouse, which had a strong police presence.\nHe has denied any wrongdoing and his lawyers have said the allegations stemmed from a family dispute. He and several alleged co-conspirators have been charged with kidnapping for ransom, money laundering, and illegal possession of weapons, among other charges.\nProsecution team lawyer Francois Amiel asserted Thursday that there is \"strong evidence\" against Brandt and his alleged co-conspirators. He said he could not estimate how long the trial might take.\nThe trial is being regarded as a test of Haiti's justice system, which has long been regarded as corrupt and dysfunctional.\n\"We know what the law says. We will see if it is going to apply in this case,\" said prominent human rights lawyer Mario Joseph, adding he was satisfied that a new \"respectable\" judge was appointed to the non-jury criminal trial.\nA 2012 report from Haiti's National Human Rights Defense Network alleged that Brandt was the leader of a gang that had at least 13 victims. It said investigators seized weapons, cars, uniforms of the Haitian National Police and an ID card for Haiti's National Palace issued to Brandt and listing him as an adviser.\nKidnappings soared in Haiti after the 2004 rebellion that ousted then-President Jean-Bertrand Aristide. But U.N. peacekeepers and Haitian police successfully cracked down on the crime and kidnappings, especially of foreigners, has become relatively unusual.\n___\nDavid McFadden on Twitter: http://twitter.com/dmcfadd\nClifford Brandt, wearing white shirt, is escorted by police while he arrives at the courthouse in Port-au-Prince, Haiti, Thursday, Jan. 28, 2016. A high-profile trial has begun for Brandt, the son of a prominent Haitian family with extensive business holdings for allegedly kidnapping the adult children of another wealthy family. The trial is being regarded by many as a test of Haiti's justice system, which has long been regarded as corrupt and dysfunctional. (AP Photo/Dieu Nalio Chery)\nClifford Brandt, center, is escorted by police as he arrives at the courthouse in Port-au-Prince, Haiti, Thursday, Jan. 28, 2016. A high-profile trial has begun for Brandt, the son of a prominent Haitian family with extensive business holdings for allegedly kidnapping the adult children of another wealthy family. The trial is being regarded by many as a test of Haiti's justice system, which has long been regarded as corrupt and dysfunctional. (AP Photo/Dieu Nalio Chery)\nClifford Brandt, center, is escorted by police as he arrives at the courthouse in Port-au-Prince, Haiti, Thursday, Jan. 28, 2016. A high-profile trial has begun for Brandt, the son of a prominent Haitian family with extensive business holdings for allegedly kidnapping the adult children of another wealthy family. The trial is being regarded by many as a test of Haiti's justice system, which has long been regarded as corrupt and dysfunctional. (AP Photo/Dieu Nalio Chery)","url":"https://www.dailymail.co.uk/wires/ap/article-3421709/Kidnapping-trial-begins-son-prominent-Haitian-family.html"}
