{"authors":[],"date_download":"2018-10-22 23:37:41","date_modify":"2018-10-22 23:37:41","date_publish":"2017-03-10 03:48:09","description":"The bruises, scabs and chain markings have long faded but Haji Ghulam is still visibly traumatised by his month-long abduction, one of dozens of victims of a...","filename":"data/vaneerConsumption/KidnappingsblightwarscarredKabulcity.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/03/wire-193877-1489117692-555_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4299912_Kidnappings-blight-war-scarred-Kabul-city_1540251461.html","title":"Kidnappings blight war-scarred Kabul city","title_page":"Kidnappings blight war-scarred Kabul city | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kidnappings and extortion have become a cottage industry in Kabul, where displaying wealth can be tantamount to a death sentence\nThe bruises, scabs and chain markings have long faded but Haji Ghulam is still visibly traumatised by his month-long abduction, one of dozens of victims of a violent crime surge that has beset the Afghan capital.\nWhile the relatively rare kidnappings of foreigners instantly grab international headlines, this chilling wave of abductions of ordinary Afghans such as Ghulam remains a hidden scourge that has put the city on edge.\nAfghan police, already stretched on multiple insurgent battlefronts, are struggling to rein in kidnapping rings that target not just the wealthy -- but anyone that appears to have money.\n\"On a cold spring day last year I was driving home from work with my son and cousin when we were waylaid by two cars with armed men in military uniforms,\" Ghulam, a 53-year-old professional money changer, said with a stammer, his lips and face twitching.\n\"I thought they were policemen, but they beat my son and cousin and dragged me to their vehicle. I was blindfolded, slapped, beaten. They drove for an hour and dropped me in a tiny hole in the ground,\" he told AFP at his home in Kabul.\nHis kidnappers tortured him and sent his recorded screams to his family, demanding a ransom of $2 million, a gargantuan sum in one of the world's poorest countries. He was fed little more than a piece of bread every day.\nA month later, security officials discovered Ghulam in that hole in a small house on the outskirts of Kabul, maimed, emaciated and enchained. His kidnappers are still at large.\nGhulam, who now walks with a limp and uses an armoured vehicle and private guards for his protection, is one of the lucky ones.\nIn one case, a 14-year-old Afghan boy was abducted and then brutally murdered, his body dumped in downtown Kabul. In another incident, a city shopkeeper's ear was sliced off by his kidnapper and sent to his family to press them to pay up.\nRecently a Kabul businessman sold off his entire property to pay ransom for his kidnapped son, but he remains in captivity.\nReliable official statistics are hard to obtain, but Afghanistan's Chamber of Commerce and Industries says around 80 businessmen were kidnapped around the country last year. Experts believe many other cases went unreported for fear of reprisals from the kidnappers.\n- Crime city -\nKidnappings and extortion have become a cottage industry, while car thefts are common. In fact Kabul, is a city so riddled with crime that displaying wealth can be tantamount to a death sentence.\nThe situation is exacerbated by rampant poverty and rising unemployment.\nThe kidnapping rings appear to be feeding off growing insecurity as Afghan law enforcement remain stretched by the Taliban, Islamic State jihadists and other militant groups.\nThe fledgling and under resourced police force is struggling to effectively combat crime, which has contributed to an unprecedented exodus of Afghans towards Europe.\n\"In addition to the threat of bombings, the city is plagued by kidnappers and extortionists,\" Haji Zeerak, a spokesman for money changers in Kabul's Shahzada market, told AFP.\n\"Because of this business is down and more people are fleeing the country,\" he said, adding that nearly 100 money changers were kidnapped last year.\nIn another shocking incident, armed men recently stole $1.2 million from a money changer in Kabul after stopping his car. When the money changers took the issue to President Ashraf Ghani, police arrested a criminal gang said to be behind it but the money is yet to be recovered, Zeerak said.\n- Threat to investment -\nCriminal gangs often sell abductees, especially foreigners, to insurgent groups for a higher price, who transfer them to the badlands across the border in Pakistan, officials say.\nBut the police force insist a crackdown has begun, citing the 3,000 criminals -- including 16 top kidnappers -- in the past year.\n\"There has been a substantial increase in crime, but we are making progress in fighting it,\" said outgoing Kabul police chief Abdul Rahman Rahimi.\nHe added: \"We will chase every kidnapper.\"\nAfter propping up the Afghan economy for years with billions of dollars, international donors are pushing the government to wean itself off its dependence on foreign aid. But those efforts are thwarted partly by rising crime, which is forcing much needed investors to flee.\n\"Investment in Afghanistan is falling due to insecurity and kidnappings,\" Siamuden Pasarly, spokesman for Afghanistan's Chamber of Commerce and Industries, told AFP.\nThe government's inability to curb kidnappings has led many like Ghulam to suspect that some criminals are in cahoots with security officials.\nHe added: \"If the Afghan government cannot stop insurgent attacks, can they at least focus on fighting crime?\"","url":"https://www.dailymail.co.uk/wires/afp/article-4299912/Kidnappings-blight-war-scarred-Kabul-city.html"}
