{"authors":[],"date_download":"2018-10-30 14:24:09","date_modify":"2018-10-30 14:24:09","date_publish":"2014-08-15 00:00:00","description":null,"filename":"data/vaneerConsumption/Kidsrevoltingagainstrevoltingsnacks.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_08_kids_revolting_against_revolting_snacks_1540909449.html","title":"Kids revolting against revolting snacks","title_page":"Kids revolting against revolting snacks","title_rss":"NULL","source_domain":"americanthinker.com","text":"Mail Online:\nStudents returning back to school after the summer vacation are finding out what First Lady Michelle Obama's new rules for healthy eating in schools, truly mean.\nGone are the the signs marketing high-sugar sodas to thirsty kids, so too are the fattening chips and chocolate.\nInstead, those having cravings for all-things-fattening will have to make do with protein bars, vegetable snacks, bottles of mineral water and diet soda.\nMrs Obama's new rules which were approved by her husbands administration now see vending machines across the country featuring healthier options in an overall effort to fight obesity.\nWith many schools back in session, teens have taken to Twitter to vent their frustration at the lack of options that the new vending machines provide.\n'Michelle Obama is single-handedly ruining my life by changing school lunch and the vending machines,' tweeted one student who was craving calories.\n'How about Michelle Obama quit worrying about the vending machines and worry about how terrible school lunches are. Like that’s cardboard,' tweeted another angry student.\nSome students seem to have taken matters into their own hands, however, and are starting to bring in their favorite sugary snacks from outside of school.\n'Smuggling junk food in my purse to school because there’s only healthy food in the vending machines,' wrote one Twitter user.\nThe new rules phase out the advertising of sugary drinks and junk foods around campuses during the school day and ensure that other promotions in schools are in line with health standards that already apply to school foods.\nThat means a scoreboard at a high school football or basketball game eventually is no longer allowed to advertise Coca-Cola, for example, but it could advertise Diet Coke or Dasani water, which is also owned by Coca-Cola Co.\nThe same rules apply to the front of vending machines. Cups, posters and menu boards which promote foods that don't meet the standards have been phased out.\nNinety percent of such marketing in schools is related to beverages, and in advance of the new rules coming into effect, many soda companies already began to transition their sales and advertising in schools from sugary sodas and sports drinks to their own healthier products.\nWhat's a hungry teen to do? Aside from smuggling in the less healthy alternative snacks, kids are apparently rejecting the nannyism of government by going off campus for lunch. There were a million fewer meals sold last year at schools that are part of the federal lunch program and that is likely to worsen as this massive experiment in forcing change literally down the throat of our kids spreads across the country.\nAnd as the program spreads, so will the protests against these ridiculous rules.","url":"https://www.americanthinker.com/blog/2014/08/kids_revolting_against_revolting_snacks.html"}
