{"authors":[],"date_download":"2018-10-30 20:49:17","date_modify":"2018-10-30 20:49:17","date_publish":"2018-08-29 10:00:00","description":"Atlanta Journal-Constitution columnist Bill Torpy gives a first-person account of the empty nest syndrome.","filename":"data/vaneerConsumption/KidsaregoneDoparentsplayorworkmoretopaybillsTorpy.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/29/Images/newsEngin.22802794_nest-home.JPG_web--002-.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_torpy-large-empt_a8a06fe6e593cdefa6218959f14325dc__1540932557.html","title":"Kids are gone. Do parents play, or work more to pay bills?| Torpy","title_page":"Kids are gone. Do parents play, or work more to pay bills?| Torpy","title_rss":"NULL","source_domain":"ajc.com","text":"A couple of decades ago, my mother and father were leaving our Atlanta home after dropping off my youngest sister, who had graduated from college and was moving here from Chicago.\nAs they drove away, their mission completed, my dad, who was a taciturn fellow, muffled some sobs. Not only was the task of moving their youngest to Atlanta finished, but their lifework of raising five kids was largely complete.\nFor 36 years — from 1958 to 1994 — they had at least one kid living at home. That’s a timeline of nine presidents, from Dwight D. Eisenhower to Bill Clinton. But now here they were, headed for a residence that would house just them. Maybe dad feared the quiet. Perhaps he was melancholy about the passage of time. Or maybe it was that they bugged each other and had lost their last buffer.\nNow, after almost 28 years, my wife and I are at that point in life, sans the muffled sobs. Somehow, I’m more stoic than my pop.\nRecently, our youngest son left for the University of Georgia, trading his basement pad for a dorm. And so, my wife and I are left with a quiet house filled with empty bedrooms.\nIt was long a place where the door would spring open with someone tromping in unannounced. Where you’d yell, “Hello?” and be met with the voice of one of your offspring. Or not. Sometimes, they weren’t in the mood to respond.\nNot only are the kids away, but one of my middle sons, a veterinary student at UGA, last week took our (actually, his) little green parrot to live with him. She’s a tiny creature with an outsized personality, so her absence is felt.\nAll we have left is Darla the pit bull, a friendly beast my daughter left behind when she moved out of state. She threatens to take Darla back if she ever returns to Georgia, but we’d resist. It would be too damned peaceful around here.\nOur home, on a cul-de-sac with woods and a stream out back, was where our kids and their buddies congregated. They’d hang out, run amok and largely remain unsupervised. (We failed to get our parental helicopter licenses.)\nThe tools of their childhood now sit unused in the carport, house and shed: Airsoft guns, baseball mitts, wagons, badminton nets, bicycles with flat tires, unfired Roman candles. We even found some empty beer cans in a basement closet recently while cleaning it out. Pulling something over on the parents has always been a cherished rite of childhood.\nBringing home our twin babies in 1997. (Note, that’s a hospital gown I’m wearing, not a dress!) (Torpy family photo)\nI had looked forward to this day, to no longer having to hurriedly bag four sack lunches before rushing out the door to drive the carpool. I remember agonizing over child care situations, such as the time we had to fire a beloved nanny for stealing. Or the time one suddenly quit for a better job. Or the heart-pounding, speed-limit-bending drives to make the final pickup at day care.\nWe thought that as empty nesters, we’d travel. But with three boys in college, we can only afford day trips. We imagined that when weekends and evenings were free for us to do as we pleased, we’d become adventurous and cool. Instead, so far, we’re Netflix viewers.\nWe’re figuring out ways, however, to get the post-children mojo running.\nThen Torpy lads ready to head back to college. (Julie Hodack)\nThe tasks and responsibilities have peeled away through the years, but so have the fun duties, such as being the Little League coach who threw batting practice in the cage. That was two buckets of balls each to 10 kids, or as many as 400 pitches a session. Recently, I pelted a stop sign with some large acorns and threw out my arm. Such is the price of non-use.\nBack around the turn of the century (it is odd to write that), an old doctor who had raised a houseful of kids in the neighborhood stopped and watched as our hellions ran, screeched and played out front.\n“It’s like when the neighborhood was young,” he said, soaking in the reminiscence. A 1990s’ census review found that my DeKalb County neighborhood, built in the 1950s and 1960s, had the highest percentage of senior citizens of any tract in metro Atlanta.\nWe were the change of that. And now the community is rolling over again.\nThe fam more recently, with newer dog. (Torpy family photo)\nMy next-door neighbors have four young kids ranging from diapers to middle school. I refer to them as “the 2001 Torpys.” Visits to the neighborhood pool find few parents who we know anymore and a bunch who are closer in age to our daughter than to us. It is time marching on, the inevitable flip of the calender from summer to fall, a moment that catches us helplessly saying, “Hold on, there!”\nThe empty nesters on a night out. (Photo: Hank Klibanoff)\nThe empty nest syndrome is well documented with countless articles on the internet describing the feeling of loss, grief, loneliness, even depression. The Mayo Clinic addresses it, as does Psychology Today.\nGoogle has a “Questions people ask” feature about subjects that one queries. With this one, people are apparently asking: Symptoms of empty nesters. How old are empty nesters? And, which Golden Girl is the oldest?\nI’m not lying.\nThere are also innumerable stories instructing us what to do with all of our new-found, child-free time. One industrious author constructed a list of 30 enriching activities to work on. You can reconnect with the person carrying the laundry basket whom you pass in the hallway. You can redecorate your child-battered dump. You can volunteer, declutter closets (doing it!), exercise, start a herb garden (again, not lying) or pursue some other hobby.\nMaybe I’ll up my workouts to punching my heavy bag several times a week. I’ve always said that wrapping up your hands and banging out a few rounds on the bag is cheaper than a therapist.\nAnd it will keep me from having to take up crocheting.","url":"https://www.ajc.com/news/local/torpy-large-empty-nesting-what-when-the-hellions-leave/HMdEIZeiKhUTMVo2LukchM/"}
