{"authors":["Caitlin O'Toole For Dailymail.Com"],"date_download":"2018-10-22 21:31:48","date_modify":"2018-10-22 21:31:48","date_publish":"2016-01-28 08:02:48","description":"The 16-year-old actress stood out as she attended the Marvel Avengers Academy Party at the Teagram Ballroom in Los Angeles on Wednesday. The Mad Men star showed off her unique style.","filename":"data/vaneerConsumption/KiernanShipkaembracespatternsinboldorangebutterflydress.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/07/30A75BCD00000578-0-image-a-97_1453966928388.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420474_Kiernan-Shipka-embraces-patterns-bold-orange-butterfly-dress-diamond-skirt_1540243908.html","title":"Kiernan Shipka embraces patterns in bold orange butterfly dress","title_page":"Kiernan Shipka embraces patterns in bold orange butterfly dress | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kiernan Shipka showed she's not afraid to mix patterns.\nThe 16-year-old actress stood out as she attended the Marvel Avengers Academy Party at the Teagram Ballroom in Los Angeles on Wednesday.\nThe former Mad Men star wore a bright dress with an orange butterfly design as she arrived at the bash.\nStylish: Kiernan Shipka wore a pretty patterned dress as she attended the Marvel Avengers Academy party in Los Angeles on Wednesday\nKiernan appeared to be in a good mood, grinning as she arrived at the party for a new mobile app game.\nThe budding style icon's dress featured a colorful butterfly design on the chest and sheer sleeves, while the mid-length skirt featured a black, orange and white diamond pattern.\nThe teenager wore her blonde hair down in a center part, and finished off her look with dark eyeliner and pink lipstick.\nBig smile: The 16-year-old beamed as she arrived at the bash\nKiernan kept her accessorizes simple, wearing a single silver ring and flashing a classic red manicure.\nThe actress gave her petite frame a boost with black platform heels with peep toes and thin ankle straps.\nAlso attending the party in LA were future Baywatch actor Alexandra Daddario and Arrow star Colton Haynes.\nBold choice: The budding style icon looked pretty in a distinctive dress with a butterfly pattern on the chest and diamond design on the skirt\nAlexandra flashed a bit of skin in a sheer black bodysuit worn under low slung black pants.\nThe San Andreas star added a long tuxedo-style jacket with a shimmering silver trim on the lapel, and added black patterned heels.\nThe 29-year-old who can currently be seen in Nicholas Sparks adaptation The Choice, looked relaxed as she rested her hands in her pockets and flashed a big smile.\nBlack ensemble: Actress Alexandra Daddario wore a sheer bodysuit and tuxedo jacket\nAlso attending the event was Arrow star Colton Haynes, 27, who opted for casual style in a polka dot shirt, black leather jacket and ripped jeans.\nThe actor caused a stir on social media earlier this month when he appeared to confirm he was gay after a fan mentioned his 'secret gay past.'\n'Was it a secret? Let's all just enjoy life & have no regrets,' he Tweeted in response.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420474/Kiernan-Shipka-embraces-patterns-bold-orange-butterfly-dress-diamond-skirt.html"}
