{"authors":["Caitlin White"],"date_download":"2018-10-30 22:29:03","date_modify":"2018-10-30 22:29:03","date_publish":"2014-08-15 15:26:17","description":"Just when you thought it was over, Kiera Cass pulls readers back in. Cass announced some huge news Thursday for Selection fans: The One won't be the final book of the series. In fact, there will be at least two more books to follow, with the first,…","filename":"data/vaneerConsumption/KieraCassSelectionSeriesIsExpandingSoIHopeYoureSittingDowntoReadThisNews.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/207014ab-fdd3-42bd-907d-b1ddb726310c.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35919-kiera-cass-selection-series-is-expanding-so-i-hope-youre-sitting-down-to-read-this-news_1540938543.html","title":"Kiera Cass' Selection Series Is Expanding, So I Hope You're Sitting Down to Read This News","title_page":"Kiera Cass' Selection Series Is Expanding, So I Hope You're Sitting Down to Read This News","title_rss":"NULL","source_domain":"bustle.com","text":"Just when you thought it was over, Kiera Cass pulls readers back in. Cass announced some huge news Thursday for Selection fans: The One won't be the final book of the series. In fact, there will be at least two more books to follow, with the first, The Heir, coming Spring 2015.\nAll the way back in May, after the CW passed on the pilot for The Selection TV series, Cass teased fans not to worry, that there was \"some very cool book-related news\" coming soon. But with the news of another novella focused on Queen Amberley's process in the Selection, called The Queen, fans thought that was all they had coming to them — but they were oh so wrong.\nNot only did fans \"unlock\" the first few chapters of The Queen , Cass also said that she would be releasing another Selection universe novella The Favorite, focused on, well, everyone's favorite candidate for Prince Maxon, Marlee. As a huge fan of this tough, go-get-em woman, I would have been satisfied by this news alone, but she had more. After instructing her viewers to sit down, she announced the continuation of the series, by popular demand, and a whole new epilogue to The One to kick it off. Pat yourselves on the back readers, you did it!\nCheck out the super-excited, bubbly Cass making all of the announcements:\nEpic Reads on YouTube\nYou guys, I'm really excited, too. I read all of these books on plane rides, and they were so fun that when the woman next to me tried to chat about my vacation I had to tell her to shush, I was trying to read. This news has excited fangirls and boys everywhere.\nSo, there are three major reasons we should all be excited about #MoreSelection. There will be some already published Selection books spoilers ahead, so tread carefully.\n1. We're Just Not Done With This Universe\nCass built up this complex, interesting universe with problems that not-so-quietly mirrored many of our own in present day. I know that things started to settle down in The One, but the whole world can't turn on a dime, and there is surely so much more to say about this place.\n2. Bring on the swoony romance!\nThis is where I have to out myself as Team Maxon. Look, Aspen seemed like a winner, and I always like to root for the scrappy, non-Prince underdog, but Aspen made it hard with his whole \"i'm the man, I have to be a breadwinner, now we're over\" deal. No thanks, Aspen. Now that America and Maxon are together, we can really get down into the romance without the love triangle in the way. And based on the new epilogue to The One, it's already starting.\nEyes still closed, I smiled to myself as Maxon brushed away a lock of hair to find a new place to kiss. Waking up to the feeling of Maxon’s breath on my skin reminded me of how we ended up knotted in these sheets in the first place.\nOhhhh heyyyyyy. Bring it!\n3. The Heir Means What You Think It Means\nIt's happening. Babies?! Maxon-America babies? Boy or girl? What will they name him/her? How will they bring a kid into this crazy world? Will they have to do the Selection? Will May be the best aunt ever (probably, yes)? I have so many baby questions! With this news, of course we need more books.\nThe only question that remains is how will we all be able to wait until next spring?","url":"https://www.bustle.com/articles/35919-kiera-cass-selection-series-is-expanding-so-i-hope-youre-sitting-down-to-read-this-news"}
