{"authors":["Jo Scrimshire For Daily Mail Australia"],"date_download":"2018-10-22 20:36:14","date_modify":"2018-10-22 20:36:14","date_publish":"2016-01-29 02:29:56","description":"The 44-year-old shock jock was discussing a recent clash on Instagram between his girlfriend Imogen, 24, and another social media user on KIIS 1065's The Kyle and Jackie O Show on Friday","filename":"data/vaneerConsumption/KIIS1065sKyleSandilandsreadsImogenAnthonysputdowntoonlinetroll.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/23/30AE004300000578-0-image-a-31_1454024597616.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422010_KIIS-1065-s-Kyle-Sandilands-reads-girlfriend-Imogen-Anthony-s-X-rated-online-troll_1540240574.html","title":"KIIS 1065's Kyle Sandilands reads Imogen Anthony's put down to online troll","title_page":"KIIS 1065's Kyle Sandilands reads Imogen Anthony's put down to online troll | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's the shock jock who isn't afraid to turn the airwaves blue with his edgy stunts and controversial remarks.\nAnd Kyle Sandilands, 44, lived up to his controversial reputation on the Kyle and Jackie O Show when discussing his model girlfriend Imogen Anthony's response to an online troll on Friday.\nIn a segment called 'Social Meanies' - where the KIIS 1065 co-hosts read negative comments said about them online - the radio star talked about a recent clash between his 24-year-old partner and another Instagram user.\nScroll down for video\nDealing with trolls: KIIS 1065's Kyle Sandilands, 44, read out a negative comment left by an unidentified user on his model girlfriend Imogen Anthony's Instagram on Friday morning's Kyle and Jackie O Show\nReading the comment from his phone, but declining to name the person who wrote it, Kyle stated: 'Yup, keep those legs open, hun. That's how you're getting Kyle to keep you bankrolled'\nHe then remarked: 'Very rude, I think', and co-host Jackie Ellen Henderson, 40, agreed.\nThe ex-Australian Idol judge later joked: 'Because I'm hardly even getting it sometimes. I've really got to put her through the paces.'\nCouple: Kyle (right) has been in a relationship with model-turned-fashion designer Imogen Anthony, 24, (left) since 2012 and claims she has to deal with negative comments online 'often'\nKyle then moved on to his girlfriend Imogen's reply, saying 'this is why I love this girl, right, she doesn't muck around'.\nBut before he starts, Kyle gets interrupted by an orange flashing light in the studio - presumably a warning by a concerned producer over the soon-to-be broadcast remarks.\nBut the Brisbane-born TV and radio personality goes on regardless: 'Don't flash the light and don't beep anything. Right?'\n'Don't beep anything. Right?' Kyle warns the producers before reading Imogen's X-rated reply to an online troll\nMeanwhile, Jackie chuckled: 'I think, knowing what the reply might be, a beep could be involved.'\nKyle conceded, addressing the radio staff: 'Okay, you might need to beep - but don't beep unless it's necessary.'\nHe then began: 'Here's what Imogen wrote back, \"I'd rather have my legs wide open for my man than look like an old w***e.\"'\nControversial: Kyle, pictured with his trademark golden microphone, told the producers only to censor Imogen's post 'if necessary', before reading it aloud live on air\n'I think a beep could be involved': KIIS 1065 breakfast co-host Jackie O, 40, jokes that the producers may need to censor Imogen's online comment to be appropriate for broadcast\nContinuing to read the post, he said: '\"Try flicking the bean in the mirror. Sometimes it kills the loneliness. So beat it, prune.\"'\nFlicking the bean is a slang term for female masturbation, according to Urban Dictionary.\nKyle then added proudly: 'Owned it! Killed it. I love it. She doesn't even tell me about these things, these happen so often with her.'\nJackie chimed in: 'She's not afraid to bite back, is she?'\nProud: Kyle says that Imogen, who designs the clothing range White Trash Royalty, 'owned it' with her reply\nHe also complained that some people online repeatedly say Imogen is only dating Kyle for his fortune.\n'There's a lot of fat, old b******s that always just keep saying to her, \"Oh, it's something about the money\"', he said.\n'The kid doesn't spend no money. And anything she spends, I buy her. I've got to force it on her.'\nGirls trip: This month, Imogen enjoyed several days away with her girlfriends on a road trip north up the New South Wales Coast to Byron Bay\nMeanwhile Imogen, who has been dating Kyle since 2012, enjoyed a few days away with her girlfriends on a road trip north up the New South Wales Coast to Byron Bay earlier this month.\nThe four friends stopped off at the Big Banana in Coffs Harbour and posed for a snap beneath the tourist attraction.\nThe model-turned-fashion designer documented her travels with her 105,000 Instagram followers, and regularly uploaded snaps including a day of frolicking beneath Killen Falls waterfall.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422010/KIIS-1065-s-Kyle-Sandilands-reads-girlfriend-Imogen-Anthony-s-X-rated-online-troll.html"}
