{"authors":["Jennifer Smith For Dailymail.Com"],"date_download":"2018-10-23 02:59:36","date_modify":"2018-10-23 02:59:36","date_publish":"2017-04-26 14:18:24","description":"In 2013, Jerome Walter Kowalski was sentenced in to life in prison without parole for shooting his brother Richard and his wife Brenda in their Michigan home five years earlier.","filename":"data/vaneerConsumption/Killerdemandsnewtrialoverjudgesaffairwithwitness.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3F9FE68800000578-0-image-a-2_1493213406456.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447574_Killer-demands-new-trial-judge-s-affair-witness_1540263576.html","title":"Killer demands new trial over judge's affair with witness","title_page":"Killer demands new trial over judge's affair with witness | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A convicted double murderer who killed his brother and sister-in-law is asking for a new trial because the judge who jailed him had an affair with a key witness.\nIn 2013, Jerome Walter Kowalski was sentenced in to life in prison without parole for shooting his brother Richard and his wife Brenda in their home in Oceola Township, Michigan, five years earlier.\nAfter his arrest, he admitted the killings to Michigan State Police Detective Sgt. Sean Furlong but later retracted the confession, claiming he made it out of desperation after a lengthy interrogation.\nKowalski unsuccessfully appealed his conviction in 2014.\nOn Wednesday, his lawyer Peter Van Hoek revealed that Furlong had been named in divorce proceedings involving the trial judge Theresa Brennan.\nJerome Walter Kowalski is seeking a new trial because Judge Theresa Brennan, who jailed him for life without parole in 2013, was having an affair with a key witness in his trial\nThe pair had an affair which he says began before his client's trial but none of the attorneys involved were ever made aware.\nThey insist it began after Kowalski's trial began and that they were only friends beforehand.\nHer former husband Donald Root insists the two were romantic during Kowalski's trial.\nBrennan had an affair with Michigan State Police Detective Sgt. Sean Furlong\nWhether they were romantically involved or just friends, the murderer's lawyer says the relationship and the judge's failure to disclose it at the time is tantamount to judicial misconduct and that Kowalski deserves a new trial as a result.\nKowalski, now 70, claimed during proceedings that his brother and sister-in-law's 'real killer' was 'still out there'.\nAccording to the his lawyer, Judge Brennan and Detective Sgt. Furlong began their affair long before she called on him at his 2013 trial.\nThey allegedly met up at a cottage she owned with her husband and had spent the night together for years before they crossed paths with Kowalski.\nThey both admitted to kissing in a courthouse in 2007 and spoke outside court at least twice during Kowalski's murder trial, he claims.\nPhone records allegedly indicate that the pair spoke 37 times throughout the trial and some were made during court hours.\nBrennan's former husband Donald Root (left) said her affair began during Kowalski's trial. The 70-year-old convicted double murderer (right) is hopeful the revelations will win him a new trial\nDespite their long, personal history, neither disclosed their relationship to the other trial parties.\nWhile Kowalski says it is unlikely the charges will ever be dropped but that he was 'hopeful' he may be granted a new trial.\n'(Kowalski) is hopeful, but at this point, we all are,' he told The Detroit Free Press.\nKowalski's brother Richard and his sister-in-law Brenda were found shot dead in their home in 2008.\nAt his trial, prosecutors said he killed them in a jealous rage because his brother had always been more successful than him.","url":"https://www.dailymail.co.uk/news/article-4447574/Killer-demands-new-trial-judge-s-affair-witness.html"}
