{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:59:58","date_modify":"2018-10-30 20:59:58","date_publish":"2015-08-28 07:33:38","description":"A former Green Party Councillor who was exposed as having an unexpected hobby – trophy hunting – has rebuffed critics, defending his sport","filename":"data/vaneerConsumption/KillerOfCecilTheLionDefendedByTrophyHuntingGreenPartyCouncillor.json","image_url":"https://media.breitbart.com/media/2015/08/Screen-Shot-2015-08-27-at-15.13.241.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_08_28__1540933198.html","title":"Killer Of Cecil The Lion Defended By Trophy Hunting Green Party Councillor","title_page":"Killer Of Cecil The Lion Defended By Trophy Hunting Green Party Councillor | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A former Green Party councillor who was exposed as having an unexpected hobby – trophy hunting – has rebuffed his critics, defending the sport and robustly backing Walter Palmer, the man who shot Cecil the lion.\nFor a party that claims to represent the natural world, the Greens are impressively out of touch with it. They are staunchly against many forms of wildlife management, particularly if humans happen to enjoy it, proposing to ban “hunting of all animals for sport” in their election manifesto this year.\nSo when it emerged that Ben Wightman, a former Green councillor in Kirkburton parish, near Huddersfield, had proudly posted pictures posing on his public Facebook page with big game he’d shot, you’d expect him to retreat quietly – like Walter Palmer, the lion-hunting American dentist. But he didn’t – he came out fighting:\n“I am a firm believer that one of the best ways of management and conservation is with a rifle. We are taking out old, lame or unfit animals that are causing problems for local farmers,” he explained on Facebook.\nPictures on his page included snaps with two antelopes, a warthog, ostrich, buffalo and a zebra, all taken on hunting trips to Africa.\n“It’s a holiday or part of it is a holiday,” he continued. “A group of us go together and have a good laugh and some beers. We are all passionate hunters and shooters. We approach shooting as you would a job. There is a lot of over-population out there and animals sometimes do a lot of damage and that needs addressing.\n“This is shooting and conservation. You employ a professional hunter and a couple of local lads from the village as trackers and you pay them and the landowners money. It helps the economy.”\nThen, for good measure, he added: “We are not just out for anything. One of the farmers who rears cattle was having a problem with zebras on his grassland, eating the grass.\n“We observed the situation and saw two old males and two old females who would not make it through the next season. They were past breeding age. We took two of them out.\n“There was a herd of eight zebra and we took two elder ones. That’s two less animals to eat his grass,” he said, demonstrating how culling can benefit the ecosystem.\nHe was clear that nothing was wasted, too, assuring visitor to his page that much of the meat was distributed to local people: “Everything we eat while we are there is something we have shot. We can’t bring it back with us. I am a big bloke but even I couldn’t eat a whole zebra.\n“I know for a fact the Green Party would not approve. The Green Party has a lot of principles but one policy that upsets me was ending recreational fishing…”\nWell, Mr. Wightman, it sounds as if you might just have been in the wrong party.\nA Green party spokesman seemed to think so: “We condemn hunting and have actively campaigned against it for many years,” he told The Times; “Our 2015 general election manifesto contained a commitment to ban all hunting of all animals for sport or pleasure, and we expect all Green party candidates to support this policy.”\nApparently, the party spokesman added, Wightman represented them at the parish election without ever becoming a fully paid-up member.","url":"https://www.breitbart.com/europe/2015/08/28/killer-of-cecil-the-lion-defended-by-trophy-hunting-green-party-councillor/"}
