{"authors":["Frances Martel"],"date_download":"2018-10-30 20:12:23","date_modify":"2018-10-30 20:12:23","date_publish":"2017-01-05 02:21:45","description":"Yeni Şafak, a pro-Erdogan Turkish newspaper, accuses the United States of \"leading\" the Islamic State attack on Istanbul's Reina nightclub.","filename":"data/vaneerConsumption/KillerUSBehindIstanbulNightclubAttack.json","image_url":"https://media.breitbart.com/media/2017/01/istanbul-nightclub-attack.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_01_04__1540930343.html","title":"'Killer U.S.' Behind Istanbul Nightclub Attack","title_page":"Turkish Newspaper: 'Killer U.S.' Behind Istanbul Nightclub Attack","title_rss":"NULL","source_domain":"breitbart.com","text":"An opinion column in Yeni Şafak, a pro-Erdogan Turkish newspaper, accuses the United States of “leading” the Islamic State, the Kurdistan Workers’ Party (PKK), and the alleged terrorist group run by Islamic cleric Fethullah Gulen.\nThe “killer U.S.,” writes columnist Tamer Korkmaz, orchestrated the massacre in Istanbul’s Reina nightclub over the weekend, as well as multiple terrorist bombings and the assassination of Russian Ambassador to Turkey Andrei Karlov in December.\n“The U.S., which most recently shed the blood of innocent people in Ortaköy [the Istanbul neighborhood where Reina is located] through its tool, the Daesh terror organization, has also tried to tarnish the independent Turkey’s Islamic identity through its ‘counterterror’ attack showing a ‘fake flag,'” Korkmaz writes, apparently accusing the United States of orchestrating terror attacks to later use the attacks to exert itself militarily.\n“The attacker in Ortaköy is the American State of Terror,” he states definitively. Of the unnamed assailant, identified as a Kyrgyz national who entered Turkey with his family through Syria, Korkmaz writes, “the deep address behind the murderer is the U.S./CIA.”\nWhile blaming the United States for running the “terrorist consortium” of the PKK, the Islamic State, and the Gulen group (a coalition of charter schools the cleric calls “Hizmet” but Ankara refers to as FETO), Korkmaz does not explain why the PKK has vowed to destroy the Islamic State and vice versa, or why the United States has labeled both a terrorist group.\nThe PKK is a Marxist group that has engaged in terrorist acts against Turkey with the intention of establishing a Kurdish state. In Iraq, members of the Iraqi Yazidi minority have stated that the PKK’s role in northern Sinjar was essential in eradicating ISIS and preventing a complete genocide of the Yazidi people. The Kurdistan Regional Government (KRG) of Iraq, a U.S. and Turkish ally, has repeatedly demanded the PKK leave the area.\nIn addition to failing to provide this context, Korkmaz also delivers no evidence to back up his claim that the “United Terror States of America” planned the multiple terrorist attacks he names, committed both by Islamic State and PKK-allied agents. The Karlov assassination is the only incident that remains unclaimed; while assassin Mevlüt Mert Altintas declared he had committed his act to avenge the Sunni Muslims killed in Aleppo, Syria, neither the Islamic State nor any other terror group has claimed his as one of their own. The Turkish government has repeatedly claimed Altintas was a Gulenist.\nThis is neither the first time Yeni Şafak nor Tamer Korkmaz have accused the United States of committing acts of terrorism in Turkey. Following Karlov’s assassination, Korkmaz described Altintas as a “CIA/FETO assassin.” Yeni Şafak also accused an American general, Gen. J.F. Campbell, of personally plotting the failed coup against President Recep Tayyip Erdogan in July. Campbell dismissed the claims, noting that he was enjoying a beer with Geraldo Rivera on the night of the coup.\nThe newspaper is not alone in these accusations, however — Erdogan himself has made the claim that the United States supports ISIS. “The West gives support to terror and stands on the side of coups,” he said shortly after the failed coup.\n“Now they give support to terrorist groups including Daesh [ISIS], YPG, PYD. It’s very clear. We have confirmed evidence, with pictures, photos and videos,” Erdogan alleged of the United States in late December.\nMultiple independent news reports have accused Erdogan’s government itself of cooperating with the Islamic State years ago as a way to undermine the government of Syrian dictator Bashar al-Assad. In 2015, an anonymous Islamic State terrorist told a publication that Turkey “paved the way” for ISIS: “Had Turkey not shown such understanding for us, the Islamic State would not be in its current place. It [Turkey] showed us affection. Large [numbers] of our mujahedeen received medical treatment in Turkey.”\nThe Turkish newspaper Cumhuriyet also published evidence that the Turkish intelligence agency, the MIT, was shipping arms into Syria for the rebels to use. Cumhuriyet also found evidence of a conversation between an Islamic State terrorist in charge of arms shipments and several unnamed Turkish soldiers. Erdogan had Cumhuriyet‘s Ankara editor Erdem Gül and editor-in-chief Can Dündar arrested for publishing the report. Dündar is currently living in self-imposed exile in Europe after an assassin attempted to kill him while he waited for a verdict on the arms shipments report case.\nThe Islamic State has publicly criticized Erdogan repeatedly, however, describing him as a “beggar before the doors of Crusader Europe” for his attempts to join the European Union and calling for attacks on Turkey.\nThe Islamic State has taken credit for the Reina nightclub attack; the perpetrator remains at large.","url":"https://www.breitbart.com/national-security/2017/01/04/pro-erdogan-newspaper-killer-u-s-behind-pkk-istanbul-attack/"}
