{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:12:45","date_modify":"2018-10-22 23:12:45","date_publish":"2017-04-26 07:03:36","description":"Kim, 36, is helping older sister Kourtney celebrate her 38th birthday with a fun-filled vacation.","filename":"data/vaneerConsumption/KimandKourtneyKardashianwearmatchingsilverbikinis.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/07/3F9CD3BD00000578-0-image-a-169_1493187141375.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446436_Kim-Kourtney-Kardashian-wear-matching-silver-bikinis_1540249965.html","title":"Kim and Kourtney Kardashian wear matching silver bikinis","title_page":"Kim and Kourtney Kardashian wear matching silver bikinis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kim Kardashian isn't letting the publication of non-airbrushed photos of herself in a bikini stop her from continuing to enjoy the sun, sea and sand in Mexico.\nThe reality star, 36, is helping older sister Kourtney celebrate her 38th birthday with a fun-filled vacation.\nAnd the two once again headed to the beach in revealing swimwear that left little to the imagination.\nSister, sister: Kourtney and Kim Kardashian once again flaunted their beach bods in matching silver bikinis during their Mexican getaway\nThe Keeping Up With The Kardashian star headed out in matching silver bikinis showing off their curves.\nKim, who stunned the world with the candid images of her boobs and butt in a vintage Christian Dior two-piece, opted this time around for a sparkly outfit.\nThe tiny bottoms with ties at the hip just about preserved her modesty while the top held her ample enhanced assets in place.\nSpot the difference: Kim, 36, rocked another tiny two-piece and looked sleek and tanned, compared to unedited photos of her on the same beach published a couple of days ago\nBody confident: Kim may have been a little sensitive after she revealed pals had been fat-shaming her after the non-airbrushed images went global but still put on a show\nCheeky: Kim's derriere definitely appeared to be more toned than earlier in the week as she strode across the sand with her big sister\nMother-of-three Kourtney also opted for a pair of shiny bikini bottoms that rode up high on her hips.\nShe added a white t-shirt rolled up under her top that hid her cleavage from view.\nThe eldest of Kris Jenner's daughters wore her long raven hair loose and seemed to be enjoying her relaxing birthday vacation as she soaked up the ray with Kim.\nFit and fabulous: Mother-of-three Kourtney paired shiny bikini bottoms that rode up high on her hips with a rolled up white t-shirt over her bikini top\nTaking it easy: The two women took some time to relax in the sunshine and bag some rays on wooden loungers set up on the sand\nCelebrity moms: Both reality stars left their children behind for some fun in the sun\nThe girls' weekend welcomed all of the familiar faces into the fold, including Larsa Pippen, Brittny Gastineau, Malika Haqq and Hrush Achemyan - all playfully dubbed 'The Calabasas mom crew,' by Kim.\nKim provided a 'play-by-play' for fans, tweeting about the getaway as she, Kourtney and their friends spent some well-deserved time away from their children.\nKim is mother to North, three, and one-year-old Saint West by husband Kanye, while Kourtney has Mason, seven, Penelope, four, and two-year-old Reign with estranged partner Scott Disick.\nKids-free zone: The bathing beauties clearly relished some down time away from filming their E! reality series\nTaking care of business: However, the two have been keeping their social media followers updated on their antics\nFurry amusing: Kim posted some funny images on her Snapchat Tuesday night\nAmple assets: Mrs. Kanye West showed off her boobs in one set of selfies","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446436/Kim-Kourtney-Kardashian-wear-matching-silver-bikinis.html"}
