{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 20:48:05","date_modify":"2018-10-22 20:48:05","date_publish":"2016-01-29 03:57:33","description":"Variety claimed on Thursday that the 62-year-old actress will play the role of Elena Lincoln in the upcoming Fifty Shades Of Grey sequel.","filename":"data/vaneerConsumption/KimBasingertoplayChristianGreysexloverinFiftyShadesDarker.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/02/30AE6FA200000578-0-image-a-18_1454033289723.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422088_Kim-Basinger-62-signs-play-Christian-Grey-s-ex-lover-Fifty-Shades-Darker_1540241285.html","title":"Kim Basinger to play Christian Grey's ex-lover in Fifty Shades Darker","title_page":"Kim Basinger to play Christian Grey's ex-lover in Fifty Shades Darker | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's played some risque characters in such massive hits as L.A. Confidential.\nAnd it seems like Kim Basinger isn't done with steamy roles just yet, as it was announced that she will be the newest main character in the racy Fifty Shades film franchise.\nVariety claimed on Thursday that the 62-year-old actress will play the role of Elena Lincoln in the upcoming sequel Fifty Shades Darker.\nScroll down for video\nNot shy: it seems like Kim Basinger isn't done with steamy roles just yet, as it was announced that she will be the newest main character in the racy Fifty Shades film franchise\nElena is protagonist Christian Grey's business partner, and a former lover of the bondage-savvy industry mogul. She also happens to be quite a few years older than the 27-year-old businessman.\nThe first film was rumored to have soured the cast and crew on the franchise, as author E.L. James apparently had numerous acrimonious disagreements with director Sam Taylor-Johnson that threatened to derail the production.\nAnd at one point in February of last year lead Jamie Dornan, 33, was rumoured to have threatened to leave the franchise altogether.\nCooler heads prevailed: At one point in February of last year lead Jamie Dornan, 33, even threatened to leave the franchise altogether\nThings appear to be back on track however, as a new director has been brought on to film the remaining two sequels.\nHollywood vet James Foley, who is known for Glengarry Glen Ross and directing numerous episodes of Netflix hit House of Cards, agreed to take over helming duties.\nIn addition, both Dornan and co-star Dakota Johnson, 26, have announced they will in fact both participate in the sequels.\nOriginal cast: Both Dornan and co-star Dakota Johnson, 26, have announced they will in fact both participate in the sequels\nThe studio, Universal, is planning on filming the final two parts of the series, Fifty Shades Darker and Fifty Shades Freed, back to back.\nThough it does focus on the provocative world of S&M, Fifty Shades of Grey holds the record for the largest ever weekend opening in February.\nSequel Fifty Shades Darker is scheduled for a February 10th, 2017 release.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422088/Kim-Basinger-62-signs-play-Christian-Grey-s-ex-lover-Fifty-Shades-Darker.html"}
