{"authors":["Ekin Karasin","Dailymail.Com Reporter"],"date_download":"2018-10-23 01:15:31","date_modify":"2018-10-23 01:15:31","date_publish":"2017-04-26 11:23:32","description":"Kim Jong-Un watched the exercises on Tuesday, which saw the firing of more than 300 large-calibre artillery pieces and included submarine torpedo-attacks in North Korea.","filename":"data/vaneerConsumption/KimJongUnsarmyfiresrocketsatmockenemywarships.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9EDF4C00000578-0-image-a-68_1493200506065.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447140_Kim-Jong-army-fires-rockets-mock-enemy-warships_1540257331.html","title":"Kim Jong-Un's army fires rockets at mock enemy warships","title_page":"Kim Jong-Un's army fires rockets at mock enemy warships | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kim Jong-Un's army readied for war as they fired rockets and torpedoes at mock enemy warships during North Korea's 'largest ever' live-fire artillery drills on Tuesday.\nHundreds of tanks were lined up along the eastern coastal town of Wonsan in a show of military strength to celebrate 85 years since the North Korean army was created.\nKim saluted the military as he watched the exercises on Tuesday, which involved the firing of more than 300 large-calibre artillery pieces and included submarine torpedo-attacks.\nJust one day later, South Korea conducted joint military live-fire drills with the US at Seungjin fire training field in Pocheon, South Korea, near the border with North Korea.\nNorth Korea held massive live-fire artillery drills on Tuesday as it marked the anniversary of the founding of its military\nLeader Kim Jong-Un saluted his military from the top of a private car as they drove through the demonstration\nMore than 300 large-calibre artillery pieces were fired in the drill, called a 'Combined Fire Demonstration'\nThe exercises involved submarine torpedo-attacks on mock enemy warships, causing huge explosions\nHundreds of weapons were fired across the sea in Wonsan, North Korea, in the military demonstration\nAnd in a defiant bit of timing, South Korea have announced that key parts of a contentious US missile defense system have been installed.\nThe South's trumpeting of progress in setting up the Terminal High-Altitude Area Defense system, or THAAD, comes as high-powered US military assets converge on the Korean Peninsula and as a combative North Korea signals possible nuclear and missile testing.\nOn the same day, a US guided-missile submarine docked in South Korea.\nAnd the USS Carl Vinson aircraft carrier is also headed toward the peninsula for a joint exercise with South Korea.\nThe exercise took place as a US guided-missile submarine arrived in South Korea and envoys from the US, Japan and South Korea met in Tokyo to discuss the growing threat posed by North Korea's nuclear weapons and missiles program.\nSpeculation had mounted that the North could carry out a sixth nuclear test or another missile launch to mark 85 years since the founding of its army.\nThe North Korean despot smiled with his military deputies as he watched the military drill\nHundreds of tanks were lined up along the eastern coastal town of Wonsan in a show of military strength celebrating 85 years since the North Korean army was created\nNorth Korea fired dozens of missiles across the sea to mark the anniversary of the military's creation\nHundreds of flag-bearing soldiers saluted as they stood next to weapons\nThe Korean People's Army positioned tanks along the coast as planes soared overhead\nThe South's Yonhap news agency cited a government source as saying the exercise was the North's 'largest ever'.\nMeanwhile, a senior analyst warned that the back-and-forth threats between the US and North Korea could cause a needless stumble into war.\nOn Monday, President Donald Trump said dictator Jong-Un isn't as strong as he claims to be, and he blamed the international community for not doing more to rein him in.\nThe 'status quo' on North Korea is 'unacceptable,' Trump told members of the United Nations Security Council at the White House.\n'The council must be prepared to impose additional and stronger sanctions,' Trump said.\nSenior analyst, Jonathan Pollack, at the Brookings Institution says the back-and-forth threats between the US and North Korea 'raises the stakes', according to CBS.\nUS Army's M1 A2 tanks fired during a joint military live-fire drills with South Korea at Seungjin Fire Training Field in Pocheon, South Korea, near the border with North Korea\nFlames rose as South Korean army's armored vehicles waited during their own drill on Wednesday\nSouth Korean army's multiple launch rocket systems fired several rockets\nIn a defiant bit of timing, South Korea have announced that key parts of a contentious US missile defense system have been installed\nSouth Korean acting President Hwang Kyo-ahn (pictured centre, front) inspected a variety of fire arms during the firing drill\nA US Army Apache helicopter fired rockets during the joint military live-fire drills\nThe US and South Korea's armored vehicles move through the Seungjin Fire Training Field\n'We could stumble needlessly into what would be the biggest crisis in East Asia since the United States intervened in the Korean War in 1950,' Pollack warned.\n'The situation prevailing on the Korean Peninsula is so tense that a nuclear war may break out due to the frantic war drills of the US imperialists and their vassal forces for aggression,' Gen Pak Yong Sik told a meeting of thousands of senior military and civilian officials.\nSouth Korea's Joint Chiefs of Staff said it was closely watching North Korean military action in the Wonsan city area, where it said the drills were being held.\nThe exercise involved 300 to 400 artillery pieces, but an official from Seoul's Defense Ministry couldn't confirm the details.\nFlower-laying and bowing at statues and portraits of the leaders is a regular routine on major anniversaries. People also gathered in open spaces to take part in organized dancing, another common way to mark holidays.\n'Our great leaders founded and wisely led our revolutionary army, and just like that, now our respected Marshal Kim Jong-Un is leading wisely, so even though the situation is tense, we are celebrating the day,' said Choe Un Byol, who came with his family to the bronze statues of the former leaders.\nThe USS Michigan (pictured), a nuclear-powered submarine, arrived at the South Korean port of Busan in what was described as a routine visit to rest the crew and load supplies. Cmdr Jang Wook from South Korean navy public affairs said there was no plan for a drill\nSouth Korea's military said Tuesday North Korea held live-fire drills in an area around its eastern coastal town of Wonsan as it marked the anniversary of the founding of its military. The exercise may have been the North's 'largest ever' and leader Kim Jong-Un oversaw it (left)\nMeanwhile, senior Koreas analyst, Jonathan Pollack, says the back-and-forth threats between the US and North Korea could cause the US to 'stumble needlessly' into war. A young girl celebrates the 85th anniversary of North Korea's military\nNorth Korea often also marks significant dates by displaying its military capability. It launched a missile one day after the 105th birthday of late founder Kim Il Sung on April 15. People gathered in open spaces to take part in organized dancing (pictured)\nNorth Korea often also marks significant dates by displaying its military capability. It launched a missile one day after the 105th birthday of late founder Kim Il Sung on April 15.\nRecent US commercial satellite images indicate increased activity around North Korea's nuclear test site, and third-generation dictator Jong-Un has said the country's preparation for an intercontinental ballistic missile (ICBM) launch is in its 'final stage'.\nThe USS Michigan, a nuclear-powered submarine, arrived at the South Korean port of Busan in what was described as a routine visit to rest the crew and load supplies.\nCmdr Jang Wook from South Korean navy public affairs said there was no plan for a drill.\nThe submarine's arrival comes as the USS Carl Vinson aircraft carrier headed toward the Korean Peninsula for a joint exercise with South Korea. The US 7th Fleet said two American destroyers were conducting simultaneous maritime exercises with naval ships from South Korea and Japan.\nNikki Haley, Trump's UN ambassador, said the US is not looking for a fight with Kim Jong-Un and would not attack the country 'unless he gives us reason to do something'. She also praised China's increased pressure on North Korea\nNorth Korea launched two missile tests this month while Trump and his senior aides have warned that 'all options are on the table' against Pyongyang, including military action\nDespite the buildup, Trump has reportedly settled on a strategy that emphasizes increased pressure on North Korea with the help of China, the North's only major ally, instead of military options or trying to overthrow North Korea's government.\nTrump told the UN Security Council that they must be prepared to impose additional and stronger sanctions on North Korea.\n'This is a real threat to the world, whether we want to talk about it or not,' Trump said Monday.\n'North Korea is a big world problem, and it's a problem we have to finally solve. People have put blindfolds on for decades, and now it's time to solve the problem.'\nNikki Haley, Trump's UN ambassador, said the US is not looking for a fight with Kim and would not attack North Korea 'unless he gives us reason to do something'. She praised China's increased pressure on North Korea.\nWhen asked about the threshold for US action, Haley told NBC that 'if you see him attack a military base, if you see some sort of intercontinental ballistic missile, then obviously we're going to do that'.\nThe USS Carl Vinson aircraft carrier (pictured) headed toward the Korean Peninsula for a joint exercise with South Korea\nSouth Korean protesters staged a rally against US deployment of the USS Carl Vinson aircraft carrier and its battle group to the Korean Peninsula\nUSS MICHIGAN: ONE OF THE LARGEST SUBS IN THE WORLD The USS Michigan is the second Ohio-class nuclear-powered guided missile submarine in the US Navy. The Michigan has a displacement of more than 18,000 tons when submerged and 16,000 tons when surfaced. It is one of the largest submarines in the world and can travel at speeds of 29 miles per hour and can stay submerged for up to three months. The submarine is equipped with about 150 Tomahawk missiles that hit targets that are up to 990 miles away, and can carry out a range of missions including anti-submarine warfare and reconnaissance. The USS Michigan was last deployed to the peninsula in June 2015. It also boasts 24 missile tubes, four 21-inch torpedo tubes and an S8G Nuclear Reactor. Source: Naval Technology\nBut asked what if North Korea tests an intercontinental missile or nuclear device, she said: 'I think then the president steps in and decides what's going to happen.'\nThe US, Japan and South Korea agreed Tuesday to put maximum pressure on North Korea, the South's envoy for North Korea said after meeting his American and Japanese counterparts in Tokyo.\n'We agreed to warn North Korea to stop any additional strategic provocation and take intolerably strong punitive measures against Pyongyang if it goes ahead with such provocations,' Kim Hong-kyun told reporters following his meeting with Joseph Yun of the US and Japan's Kenji Kanasugi.\nKim said they discussed ways to get more cooperation from China and Russia, which they agreed is crucial to applying effective pressure on North Korea to abandon its nuclear weapons program. He said they also recognized China's recent steps toward that goal.\nJapan's Foreign Ministry announced that China's envoy for North Korea, Wu Dawei, was arriving in Tokyo on Tuesday for talks with Kanasugi that may take place later this week.","url":"https://www.dailymail.co.uk/news/article-4447140/Kim-Jong-army-fires-rockets-mock-enemy-warships.html"}
