{"authors":["Press Association"],"date_download":"2018-10-23 00:16:43","date_modify":"2018-10-23 00:16:43","date_publish":"2017-03-16 09:28:09","description":"Police confirmed Mr Kim´s identity using the DNA of one of his children.","filename":"data/vaneerConsumption/KimJongNamsfamilyallowsMalaysiatodecidewhattodowithhisbody.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/09/wire-227513-1489656493-677_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4319394_Kim-Jong-Nam-s-family-allows-Malaysia-decide-body_1540253803.html","title":"Kim Jong Nam´s family allows Malaysia to decide what to do with his body","title_page":"Kim Jong Nam´s family allows Malaysia to decide what to do with his body | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The family of Kim Jong Nam, who was killed last month, has given consent to Malaysia to decide what to do with his body, police in Kuala Lumpur have said.\nIt also emerged that four North Korean suspects who are believed to have fled Malaysia on the day of the killing have been put on Interpol’s red notice list.\nMr Kim, the estranged half-brother of North Korea’s leader, was killed last month at Kuala Lumpur’s airport by two women who smeared the banned VX nerve agent on his face. He died within 20 minutes.\nA police officer guards the main gate of forensic department at Kuala Lumpur Hospital (Daniel Chan/AP)\nPolice confirmed Mr Kim’s identity using the DNA of one of his children. He was holding a diplomatic passport in the name of Kim Chol when he was killed.\nDeputy national police Chief Noor Rashid Ibrahim said Mr Kim’s family will let the government decide what to do with his body.\n“I was made to understand that they are leaving it to our government to deal with it (the body) … yes, they have given their consent,” he said.\nAny decision will be subject to negotiations between the two countries amid a diplomatic stand-off over the killing, he added.","url":"https://www.dailymail.co.uk/wires/pa/article-4319394/Kim-Jong-Nam-s-family-allows-Malaysia-decide-body.html"}
