{"authors":["Frances Martel"],"date_download":"2018-10-30 19:36:34","date_modify":"2018-10-30 19:36:34","date_publish":"2016-01-26 17:10:50","description":"The former head of South Korea's intelligence agency claims North Korean dictator Kim Jong-il did not plan to leave his son, Kim Jong-un, in charge.","filename":"data/vaneerConsumption/KimJongIlWorkedtoKeepSonOutofPower.json","image_url":"https://media.breitbart.com/media/2016/01/Kim-Jong-Il-and-Kim-Jong-un-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_01_26__1540928194.html","title":"Kim Jong-Il Worked to Keep Son Out of Power","title_page":"Former South Korean Spy: Kim Jong-Il Worked to Keep Son Out of Power","title_rss":"NULL","source_domain":"breitbart.com","text":"The former head of South Korea’s intelligence agency, Ra Jong-yil, claims to have evidence that North Korean dictator Kim Jong-il did not plan to leave his son, Kim Jong-un, in charge of the country, but a combination of infighting between an appointed committee and the younger Kim’s efforts to cement his hold on power resulted in his rise to leadership.\nRa tells the UK Telegraph that the elder Kim had attempted to set up a ten-person committee to replace him upon his death, a plot he is to describe in detail in a forthcoming biography of Jang Song-thaek, the husband of Kim Jong-un’s aunt. Jang was executed and erased from North Korean records by the younger Kim’s orders.\nNot only did Kim allegedly have an alternative plan for the North Korean regime, he explicitly rejected the idea of Kim Jong-un becoming ruler. “Even when he was still in good health, some of those close to Kim Jong-il suggested that he should name one of his children as his successor, but he brushed those suggestions aside on at least two occasions,” Ra told the Telegraph.\nRa’s theory as to how the ten-person committee collapsed is two-fold: while the ten chosen leaders of North Korea bickered in the immediate aftermath of Kim Jong-il’s death, his son struggled to consolidate power. “He fought hard,” Ra notes. “He had some very strong competition, including the brother of Kim Il-sung, the founder of the nation, his own step-mother, who was very powerful, and his step-brothers and sisters.”\nThe younger Kim has eliminated this competition in the years since coming to power. Some he has executed, while others have died under mysterious circumstances. Of particular note are his aunt, Kim Kyong-hui, and her husband, the aforementioned Jang Song-thaek.\nKim Kyong-hui disappeared from the public eye entirely last year, and many assume she is dead. At least one North Korean defector believes the Pyongyang dictator had his aunt killed. “Kim Jong Un ordered his aunt, Kim Kyong Hui to be killed. Only his bodyguard unit, Unit 974, knew this–now senior officials also know she was poisoned,” the defector, known as “Mr. Park,” said in May 2015. Other theories as to her fate include death involving a number of illnesses, including heart disease and stroke, a bout of alcoholism, or suicide. Others believe she is alive, but in such critical condition Pyongyang has kept her whereabouts secret.\nThaek’s death was not a state secret. The Korean Central News Agency (KCNA), the main state news outlet, accused him of being “worse than a dog,” “human scum” who deserved his execution. He allegedly had “improper relations with several women and was wined and dined at back parlors of deluxe restaurants,” in addition to indulging in other corrupt activities, though the North Korean government put forth no evidence of this.\nThe articles criticizing Jang, as well as any article mentioning him at all, have disappeared from Korean media archives.","url":"https://www.breitbart.com/national-security/2016/01/26/south-korean-spy-claims-kim-jong-il-worked-to-keep-son-out-of-power/"}
