{"authors":["Martha Sorren"],"date_download":"2018-10-30 23:24:22","date_modify":"2018-10-30 23:24:22","date_publish":"2014-08-13 19:26:43","description":"It's easy to like Simon Orsik, the manager in Kim Kardashian's iPhone game. He's dorky but well-meaning and uses Kanye West references every now and again. But while he's certainly worthy of our love, I can't forget about the game's trusty publicist…","filename":"data/vaneerConsumption/KimKardashianiPhoneGamePublicistMariaHolmesHasTaughtMeSoMuch.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/d35618b9-45db-41d1-883f-a84f71f34aad.PNG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35603-kim-kardashian-iphone-game-publicist-maria-holmes-has-taught-me-so-much_1540941862.html","title":"Kim Kardashian iPhone Game Publicist Maria Holmes Has Taught Me So Much","title_page":"Kim Kardashian iPhone Game Publicist Maria Holmes Has Taught Me So Much","title_rss":"NULL","source_domain":"bustle.com","text":"It's easy to like Simon Orsik, the manager in Kim Kardashian's iPhone game. He's dorky but well-meaning and uses Kanye West references every now and again. But while he's certainly worthy of our love, I can't forget about the game's trusty publicist Maria Holmes. Where Simon is bumbling, (he doesn't know what a selfie is or what DTF means) Maria is sharp. She was first introduced as someone with some anger problems, but in the world of publicity, that might not be a bad thing.\nSure, there's always the threat that she could go off at any moment. That's probably why when she tells you to come to her office she warns you that it's nothing to worry about, strictly business. But though she drops hints about needing therapy on the regular, she always comes through for you in the end and you always gain a little bit of knowledge.\nThe most I've learned from my time with Simon is that he has frequent indigestion, but with Maria I have garnered several life lessons about rising to A-list status. In case you were too consumed with finding energy and K stars to notice these truth bombs at the time, I've compiled a list here for your reference.\nREVENGE IS OK\nThere will come a time when someone is harassing you (let's be real, it's probably Willow Pape) and Maria can put an end to it very easily with a little harmless gossip. Maybe this isn't the most morally okay way to go about things, but you probably signed away your moral high ground weeks ago when you downloaded this game, right? Besides, Maria's revenge post makes the immediate problem go away and that's worth it in the end.\nThere's a brief period in the game when some rude anonymous tweeter starts ragging on your appearance. It happens a few times before Maria steps in to save the day. She tracks down a computer whiz who can reveal the anon's identity (it was Willow Pape) and then hires you a bodyguard so you'll be safe in the future. Thx Maria!\nWHEN I DOUBT, TALK IT OUT\nLater, that bodyguard develops a crush on you, but Maria steps in to solve that problem, too. She lets you know that she knows it's inappropriate and advises you two to talk it out to resolve the situation in an adult manner. I'd like to think this is Maria's solution right before she goes full Internet blast on them. See, she's not revenge-driven from the get go! She tries to use her words first.\nTHERE'S ALWAYS ANOTHER SOLUTION\nElizabeth Korkov (aka Anna Wintour) made me choose between my friends and my career. I thought my hopes of being a high fashion model were over when Maria solved the ultimatum. She did some digging and found out that the friend whose collection I featured alongside Elizabeth's in my store actually helped Elizabeth's line sell better. You can't argue with numbers!\nTHERE'S AN EASY WAY TO AVOID HOMEWRECKING RUMORS\nNo one wants to be a home wrecker in real life or in the tabloids. When a rumor was started that I'd hooked up with someone else's BF, Maria had the perfect solution. Send me on a date! As she put it, \"You won't be seen as a homewrecker if you're not wrecking any homes!\" It's pretty sound advice. I don't know why the tabloids wouldn't then just print that I'm cheating on my partner with someone else's boyfriend but hey, this is Maria's world and I'm just living in it.\nTHE THIGH-FLEX 3000 IS AMAZING\nUnfortunately this isn't a real product... yet. If Kim ever decides to sell it, you know it has Maria's stamp of approval and what more could you need?\nA PUBLICIST SHOULD GO FAR AND BEYOND\nIf I ever get a publicist in real life, she's going to have a hard time measuring up to Maria. She once traveled the globe helping me find Kim Kardashian's missing earring. That's right, she didn't just assign me the task, she actually joined in on the search. She's like my very own Momager and I'm forever grateful.\nImages: Kim Kardashian: Hollywood","url":"https://www.bustle.com/articles/35603-kim-kardashian-iphone-game-publicist-maria-holmes-has-taught-me-so-much"}
