{"authors":["Kristie Rohwedder"],"date_download":"2018-10-30 23:50:09","date_modify":"2018-10-30 23:50:09","date_publish":"2014-08-12 23:50:20","description":"Uh, Officer? You’ve been caught butt-eyeball’d. Tuesday, Kim Kardashian shared a pic on Instagram that’d been snapped of her as she was leaving her New York City apartment. In the background of the shot: A cop. What was that cop up to? Oh, just…","filename":"data/vaneerConsumption/KimKardashianWillPutYouOnBlastIfYouOgleHerBumPHOTO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/4971a249-7725-4369-b599-5dc26a601c6e.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35529-kim-kardashian-will-put-you-on-blast-if-you-ogle-her-bum-photo_1540943409.html","title":"Kim Kardashian Will Put You On Blast If You Ogle Her Bum- PHOTO","title_page":"Kim Kardashian Will Put You On Blast If You Ogle Her Bum— PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"Uh, Officer? You’ve been caught butt-eyeball’d. Tuesday, Kim Kardashian shared a pic on Instagram that’d been snapped of her as she was leaving her New York City apartment. In the background of the shot: A cop. What was that cop up to? Oh, just making sure the swarm of fans standing outside of the building didn't descend upon Kardashian. That, and STARING AT HER BUM.\nThough I'm no body language expert, that left eyebrow and that gaze tell me everything I need to know. There are no ifs, ands, or butts (had to) about it, dude's eyes were locked in on Kardashian’s rear end.\nExcuse me, SIR. Yes, I agree she has a rockin' bod, SIR. Yes, her derrière is phenomenal, SIR. But you and that eyebrow need to chill the hell out, SIR.\nShe captioned the photo with a single emoji. And the emoji she selected just so happens to be one of my favorite emojis: The wide-eyed side-eye. The emoji that says \"uh oh, Spaghetti-Os.\" Stellar emoji choice, Kim K.\nAccording to MTV.com, Kardashian also posted a photo of a security guard looking at her backside, but later deleted it.\nMen ogling women: BLERG. Women calling out oglers: YES, PLEASE. If Kardashian were to keep sharing photos of people checking out her behind and then turn the collection of emoji-captioned photos into a second picture book, I'd buy that book in a heartbeat. She could call it Oglers & Emojis.\n...Eh, I'll workshop that title.\nImage: kimkardashian/Instagram","url":"https://www.bustle.com/articles/35529-kim-kardashian-will-put-you-on-blast-if-you-ogle-her-bum-photo"}
