{"authors":["Taylor Ferber"],"date_download":"2018-10-31 01:42:51","date_modify":"2018-10-31 01:42:51","date_publish":"2018-08-28 00:44:10","description":"She's about four years late to the party, but people should probably give her a break. Kim Kardashian tweeted that she just discovered the Serial podcast and the internet won't stop giving her a hard time about it. But better late than never right?…","filename":"data/vaneerConsumption/KimKardashiansSerialTweetsShowItsNeverTooLateToListenToThePopularPodcast.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/65e17f0b-3b1f-4e5a-b537-6ad6e740bd50-getty-999728348.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_kim-kardashians-serial-tweets-show-its-never-too-late-to-listen-to-the-popular-podcast-10254122_1540950171.html","title":"Kim Kardashian's 'Serial' Tweets Show It's Never Too Late To Listen To The Popular Podcast","title_page":"Kim Kardashian's 'Serial' Tweets Show It's Never Too Late To Listen To The Popular Podcast","title_rss":"NULL","source_domain":"bustle.com","text":"She's about four years late to the party, but people should probably give her a break. Kim Kardashian tweeted that she just discovered the Serial podcast and the internet won't stop giving her a hard time about it. But better late than never right? Besides, she's a pretty busy lady.\nOn Saturday, Kardashian posted an extremely enthusiastic tweet about discovering the podcast, as if it was 2014 all over again. “Who has listened to the SERIAL podcast?\" she wrote. \"I’m on episode 4 now and dying to know what you guys think? Is he guilty or innocent?!?!” Yes, she's late, but you have to admit her excitement is a little endearing.\nWhen the podcast debuted in 2014, it became an instant fan favorite and pop culture obsession. Serial host and journalist Sarah Koenig took listeners through the investigation of a Baltimore murder. Koenig co-created and co-produced the podcast along with Julie Snyder and the series was developed by This American Life. Season 2 premiered in 2016 and Season 3 could drop sometime in 2018, according to Esquire.\nEven though Serial is well-known to most pop cutlure fans by now, it's all new to Kardashian at the moment. Fans generally haven't been able get over how late Kardashian is to the Serial train, and she's getting endless tweets from fans in pure disbelief.\nAnd of course, there are a handful of tweets that are pretty hilarious and playing on Kardashian's lateness to the 2014 pop culture obsession.\nWhat makes this even more amusing is that after receiving such feedback from Twitter, Kardashian posted a follow-up tweet with nothing but the link for Serial Season 2. Does that mean she finished Season 1 already?\nSerial's second season premiered in 2016, so technically, she's only two years behind for this one. Either she was poking at fans , or genuinely continuing her initial enthusiasm from the first tweet. Season 2 told the story of US Army soldier who was held captive.\nOn Aug. 26, Kardashian tweeted that she realized, yes, she's late to the party, but she's now super into podcasts and asked for recommendations.\nThe tweet has a whole thread of responses of people plugging their own podcasts, as well as making genuine recommendations for her and her family.\nAs quirky as her interests may be, don't hate because Kim's late. She herself had a pretty busy 2014: she broke the internet with an infamous magazine cover, she married Kanye West, and she was a new mom to a then 1-year-old daughter North West. And since then, Kardashian has had two more children with West, Saint and Chicago. She has also been busy for years maintaining a $350 million fortune which consists of constant media, beauty, and lifestyle ventures, as well as filming her immensely successful reality TV show Keeping Up With The Kardashians.\nBesides, this just means that Serial is so good that it's timeless — and that's hardly a bad thing.","url":"https://www.bustle.com/p/kim-kardashians-serial-tweets-show-its-never-too-late-to-listen-to-the-popular-podcast-10254122"}
