{"authors":["Lia Beck"],"date_download":"2018-10-30 22:49:27","date_modify":"2018-10-30 22:49:27","date_publish":"2014-08-14 17:55:40","description":"There's no denying that Kim Kardashian is everywhere. She's on your TV, on your phone, all up in your Interwebz, and is about to be on your coffee table. (Well, maybe not your coffee table, but the coffee table of some reality TV obsessed friend you…","filename":"data/vaneerConsumption/KimKardashiansiPhoneGameSuccessMakesHerWanttoContinueintotheTechWorldIHaveSomeIdeas.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/6d96c6ee-f4ae-4736-9866-3fef6fe830d8.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35799-kim-kardashians-iphone-game-success-makes-her-want-to-continue-into-the-tech-world-i_1540939767.html","title":"Kim Kardashian’s iPhone Game Success Makes Her Want to “Continue into the Tech World” & I Have Some Ideas","title_page":"Kim Kardashian’s iPhone Game Success Makes Her Want to “Continue into the Tech World” & I Have Some Ideas","title_rss":"NULL","source_domain":"bustle.com","text":"There's no denying that Kim Kardashian is everywhere. She's on your TV, on your phone, all up in your Interwebz, and is about to be on your coffee table. (Well, maybe not your coffee table, but the coffee table of some reality TV obsessed friend you have.) Because Kardashian is everywhere, she often gives interviews about her everywhere-ness. She doesn't have to be promoting anything in particular, because in giving interviews, she's promoting herself and thus the dozens of ways people are able to give her money. Case-in-point, in a recent interview with the Associated Press, Kim Kardashian opened up about her iPhone game, her baby, North West, and taking selfies. All of these are integral parts of her life, but something that struck me most is when Kardashian expanded on her game's success saying,\nI always wanted to get into some form of a video game whether it was an app, just trying to figure something out and a company came to me with a great idea and we bounced ideas off each other and we came up with this really fun concept. I am really surprised at how well it's done and it's motivated me to want to, you know, just continue into the tech world a little bit.\nIf I had a dime for every time Kardashian said she'd \"always wanted to get into [insert venture she's already involved with],\" I'm pretty sure I'd have a shit ton of dimes. Because, as I always say, once you're already producing a line of self-tanner, it's very easy to say that you always knew your true calling was producing a line of self-tanner.\nBut let's look a little closer at Kardashian's statement. She says she wants to \"continue into the tech world a little bit.\" Kim Kardashian: Hollywood, while it maybe shouldn't have been, was surprising enough. What can she possibly do next in a continuing effort to add \"tech entrepreneur\" on to her resume?\nKim Kardashian: World\nJust as Kim Kardashian: Hollywood doesn't just stick to Hollywood, Kim Kardashian: World won't just stick to planet Earth. After you become a C-List celebrity, you're allowed to travel to other planets, such as Kimtopia where every inhabitant wears conturing makeup.\nKim Kardashian Holograms\nReceiving \"texts\" from Kim Kardashian: Hollywood not good enough for you? Do you need to feel like you're really interacting with Kim? A Kim Kardashian hologram should do the trick. Take a mini-Kim K. around with you everywhere! Simply put on a special watch-like device, press a button to summon Kim, and she'll be giving you 3D pixelated advice in no time! (Did you notice my way of speaking about futuristic technology doesn't extend much beyond the effects used on Mighty Morphin Power Rangers? I'm sure Kim can do better.)\nThe kPhone\nWe all know the iPhone (except me, Andriod fo' lyfe!), but what about the kPhone? The Siri-like feature has Kardashian's voice! The icons are all pictures of Kardashian! When you need to download updates, the powerful voice of Bruce Jenner tells you to restart now! Also, the background is her infamous butt selfie and you can't change it no matter how much you want to.\nKmail\nIt's email, but with a 'k', not an 'e. Instead of being free it costs $400 a month.\nKimstagram\nIt's like Instagram but all of the filters make you more like Kim Kardashian. Want a larger derrière? Use the Buttlencia filter. Want to have Kardashian's long, dark hair? Kimfair is the way to go. Want Kanye West to magically appear in all of your pictures? Simply press the X-Kanye II filter.\nKim Kardashian will definitely release another tech idea onto the world soon, because why wouldn't she? I'm just hoping she uses one of my ideas and gives me some of that cash money. Kmail me, Kim!\nImages: Kim Kardashian: Hollywood; Giphy (2); Ali Express; Kim Kardashian/Instagram","url":"https://www.bustle.com/articles/35799-kim-kardashians-iphone-game-success-makes-her-want-to-continue-into-the-tech-world-i"}
