{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 22:49:22","date_modify":"2018-10-30 22:49:22","date_publish":"2014-08-14 18:03:23","description":"Kardashian Krisis alert! Only, well — this time, it doesn't involve someone with the actual surname \"Kardashian,\" but it's close enough. By now, you may have heard about the little war poor Kendall Jenner has gotten herself into with former MTV …","filename":"data/vaneerConsumption/KimKardashiansiPhoneGameKendallJennersWaitressFeudHaveaLotinCommon.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/bf7780ce-06ab-4c44-b5ce-6536707e6aa8.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35801-kim-kardashians-iphone-game-kendall-jenners-waitress-feud-have-a-lot-in-common_1540939762.html","title":"Kim Kardashian's iPhone Game & Kendall Jenner's Waitress Feud Have a Lot in Common","title_page":"Kim Kardashian's iPhone Game & Kendall Jenner's Waitress Feud Have a Lot in Common","title_rss":"NULL","source_domain":"bustle.com","text":"Kardashian Krisis alert! Only, well — this time, it doesn't involve someone with the actual surname \"Kardashian,\" but it's close enough. By now, you may have heard about the little war poor Kendall Jenner has gotten herself into with former MTV Skins actress Blaine Morris, but if not (and you don't want to wait until it's inevitably torn apart in Keeping Up With the Kardashians next season), here's a brief summary: Jenner was reportedly dining at the Mercer Kitchen in NYC with her Hollywood buddy Hailey Baldwin, and when their waitress — aforementioned Skins actress Morris — refused to serve Jenner alcohol, the duo allegedly stormed out without paying. Morris claimed on her Twitter that she chased down Jenner to get the money for the check, which prompted Jenner to, allegedly, \"take a couple of $20 bills out of her wallet, threw them at the server and walked away, not even counting if it was enough or if it included a tip.\" According to the story, Jenner and Baldwin also laughed in Morris' face as they did this, because of course.\nAnyway, now Jenner is, of course, denying it all happened, and has enlisted Kardashian family lawyer, Marty Singer, to slap Morris with a lawsuit for defamation. Singer, of course, contacted TMZ with a letter about what Jenner's account of the story is:\nSinger says in the letter … what actually happened was that the waitress did come up to her outside but Jenner was “extremely apologetic” and gladly paid what she owed — $33, plus a $7 tip … which she “politely handed” to her.\nSinger says, “Although you are working as a waitress at Mercer Kitchen, I understand you are also a struggling actress,” adding, “You no doubt concocted a fictionalized account of your encounter with my client in order to create publicity for yourself.”\nWhile it's not really clear who's telling the truth here, who else is getting total Kim K: Hollywood vibes from this whole situation? Like, maybe there's a problem that I'm starting to look at the entire world as if it is all a gigantic game of Kim K: Hollywood, but lets disregard that and look at all the similarities. If you believe Morris' account of the events that went down that night, this is totally like Jenner is Willow Pape, and Morris is the scrappy young Hollywood newbie who wants to get on the A-list.\nMorris was working a job serving customers when she encountered Jenner\nSure, it's not a retail gig at a Downtown LA clothing store called \"So Chic,\" (which, by the way, probably wouldn't be in Downtown LA — I know the district has gentrified a lot since the late 2000s, but still, all shopping worth a dime is generally within the confines of west Los Angeles. Just sayin'!) but Mercer Kitchen is a high-profile restaurant that Lindsay Lohan had a cigarette outside of once.\nJust like in Kim K: Hollywood, when you first meet Willow Pape outside of The Brew Palms, one of Hollywood's hottest (?) bars, while you're just a lowly retail associate and she is a high and mighty D-lister dating some jerk named Dirk who probably insults her outfit every chance he gets.\nJenner herself is likely at least a B-lister at this point, so she's not quite as low as Willow — but the resemblance is uncanny.\nOR, perhaps, Jenner is actually the scrappy young Hollywood star, and Morris is the Willow Pape of this situation\nIf you want to go with Jenner's account of the story, then Morris may have planted a fake story in the press to lift her own status up and make Jenner quite literally lose fans — a total Willow Pape move, that Jenner is choosing to let her management Simon — I MEAN, her lawyer, Marty Singer — handle.\nAs Uproxx points out, if a lawsuit actually comes out of this, people will be coming out of the woodwork to either confirm or deny Jenner's account of events, so if Jenner did indeed take the high road and \"graciously\" pay Morris the bill money when confronted about it (instead of choosing option \"Throw drink,\" which might lose her fans, of course), then it'll probably come out and Willow Pape — I mean, Morris' plan — will fall through.\nI suppose we'll all just have to wait to see what comes out of this story to decide who's really who. I'm going to go ahead and assume that nothing will, though — Marty Singer is a pretty powerful lawyer, and I doubt Morris will want the negative attention.\nAnd really, in all seriousness...Willow Pape is probably Paris Hilton anyway.","url":"https://www.bustle.com/articles/35801-kim-kardashians-iphone-game-kendall-jenners-waitress-feud-have-a-lot-in-common"}
