{"authors":["Zoe Nauman For Dailymail.Com"],"date_download":"2018-10-23 05:28:05","date_modify":"2018-10-23 05:28:05","date_publish":"2016-01-28 21:28:18","description":"The former Real Housewife of Beverly Hills will soon be seen starring in The Mother/ Daughter Experiment: Celebrity Edition, which starts on Lifetime in March.","filename":"data/vaneerConsumption/KimRichardsweepsundergoingtherapywithdaughterKimberly.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/21/30AD7EE100000578-0-image-a-102_1454016766207.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421691_Don-t-tell-Kim-Richards-weeps-undergoing-intensive-therapy-daughter-Kimberly-alongside-cast-celebrity-mums-offspring-new-show_1540272485.html","title":"Kim Richards weeps undergoing therapy with daughter Kimberly","title_page":"Kim Richards weeps undergoing therapy with daughter Kimberly | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She has been out of the limelight for some months, in the wake of being charged with petty theft and spending time in rehab.\nBut it seems Kim Richards has been busy while she has been off radar, filming a new reality show.\nThe former Real Housewife of Beverly Hills will soon be seen starring in The Mother/ Daughter Experiment: Celebrity Edition.\nScroll down for video\nEmotional: Former former Real Housewife of Beverly Hills Kim Richards will soon be seen starring in The Mother/ Daughter Experiment: Celebrity Edition alongside daughter Kimberly\nKim, 51, is appearing on the show with her daughter Kimberly Jackson.\nAnd the pair will not be alone when it comes to celebrity moms and their offspring - they will be joined by a host of reality stars.\nHeidi Montag will be on the program with her mother Darlene Egelhoff, as well as Courtney Stodden and her mom Krista.\nTough talk: The pair are seen getting emotional on the show\nThe pair will not be alone when it comes to celebrity moms and their offspring - they will be joined by a host of reality stars\nAlso making an appearance are Bad Girls Club star Natalie Nunn and her mother, Karen and\nShar Jackson and her daughter Cassie.\nJessica Canseco, from Hollywood Exe's, and her daughter, Josie, are also starring.\nTherapy: The six sets of mothers and daughters work with therapist Dr. Debbie Magids over eight weeks\nAppearance: Courtney Stodden (L) will be on the program with her mum Krista (R)\nAppearance: Shar Jackson will be on the show with her daughter Cassie\nGood ocmpany? Bad Girls Club star Natalie Nunn makes an appearance\nArgument: She and her mother Karen are seen at loggerheads\nThe six sets of celebrity mothers and daughters work with therapist Dr. Debbie Magids over eight weeks.\nThe aim is with the help of discussion and intensive therapy they can mend their broken relationships.\nIt is clear tempers and emotions run high while the women and their daughters are working through their issues.\nOpen: Jessica Canseco, from Hollywood Exe's, and her daughter, Josie, are also starring\nReality royalty? Heidi Montag (centre) is also on the program\nLetting it out: Her mother Darlene Egelhoff gets some things off her chest\nIn a clip from the show, Kim can be seen in a shouting match with Kimberly, saying: 'Don't tell me what to do, I'm defending myself!'\nLater her daughter can be seen weeping as she tells her mom: 'I want you to stay healthy always.'\nKim, who has four children, including Brooke, 29, Whitney, 25, and Chad, 24, had a turbulent 2015 - it saw her continue to struggle with sobriety, as well as being charged with trespassing, resisting an officer and battery on a police officer in April.\nHot headed: In a clip from the show, Kim can be seen in a shouting match with Kimberly, saying: 'Don't tell me what to do, I'm defending myself!'\nDagger drawn: It's clear she's not the only person she falls out with\nThen in August she was charged with petty theft after she was arrested for shoplifting at Target in Van Nuys.\nEarlier this week, Kim was left devastated after the death of her ex-husband Monty Brinson at the age 58, after his battle with cancer.\nThe Mother/ Daughter Experiment: Celebrity Edition, will air on Lifetime in March.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421691/Don-t-tell-Kim-Richards-weeps-undergoing-intensive-therapy-daughter-Kimberly-alongside-cast-celebrity-mums-offspring-new-show.html"}
