{"authors":["Tanya Ghahremani"],"date_download":"2018-10-30 23:21:28","date_modify":"2018-10-30 23:21:28","date_publish":"2014-08-13 20:07:20","description":"I don't think one conversation I've had about the Kardashians has gone by without me idly commenting, \"yeah...I just feel so bad for Rob.\" Because, seriously, that poor guy clearly has so many issues revolving around his weight, depression, and…","filename":"data/vaneerConsumption/KimRevealsWhyRobKardashianMissedHerWeddingSheDoesntSoundSympatheticAtAllVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/d18a779d-f47b-43df-92d7-0b65d007aeac.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35674-kim-reveals-why-rob-kardashian-missed-her-wedding-she-doesnt-sound-sympathetic-at-all_1540941688.html","title":"Kim Reveals Why Rob Kardashian Missed Her Wedding & She Doesn't Sound Sympathetic, At All - VIDEO","title_page":"Kim Reveals Why Rob Kardashian Missed Her Wedding & She Doesn't Sound Sympathetic, At All — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"I don't think one conversation I've had about the Kardashians has gone by without me idly commenting, \"yeah...I just feel so bad for Rob.\" Because, seriously, that poor guy clearly has so many issues revolving around his weight, depression, and possible drug use (which sister Khloé expanded on during Keeping Up With the Kardashians ), and still, it sort of seems like he's ignored by everyone in his family apart from Khloé, and used as a tool for creating more drama on Keeping Up With the Kardashians, like struggle and depression is a plotline. And now, here I am saying it again after watching this clip from Kim Kardashian's appearance on last night's Watch What Happens Live! on Bravo. Prompted by host Andy Cohen's question about Kim's relationship with Rob, Kim comments that she and her brother are \"close,\" but \"I'm definitely a tough love kind of person. If i don't like something that's going on in my life, I change it, and I don't sit and complain about it for a year.\"\nThere's one thing I have to say to that: Ugh.\nEven Cohen looks a little taken aback by the response, possibly reevaluating his decision to ever go become a reality television star interviewer in the first place, and asks about any conflicts between the two due to the fact that Rob skipped Kim's wedding. Once again, Kim's answer seems rehearsed in a weird, tense way:\nHe sent me a long email the morning of that he was going to leave. There was no fight...I just thought, 'You know what, this is my day, I'm not even going to worry about it.' [...] I totally understand that he wouldn't want to see a lot of people if he was feeling uncomfortable and you can only pray and wish that someone would not miss out on more memories in life, because life is about memories.\nRight. Here's the thing about depression, which it has been reported that Rob might really be experiencing: It is not a simple rut you pull yourself out of. It is not something that responds to toughening up and \"tough love\" techniques Kim claims she employs with her brother. It is not the equivalent of sitting around and complaining about how much life sucks — this is such a problematic way of looking at it, because it understates just how serious depression can be for anyone going through it, and is a huge reason people don't take those suffering from it seriously.\nSomeone who has never gone through depression might find it hard to empathize with the emotional impact it has, and how much it truly twists the mental state of anyone experiencing it, but it's careless to just call it complaining. It is a serious condition that turns someone's entire perception of the world into a hopelessly dark place with no foreseeable end — it is not just feeling sad. It is recognized as a mental illness by the DSM-5, and it responds to support. It responds to help.\nI hope Rob isn't depressed, I really do — but with all evidence pointing to the contrary, I also hope that Khloé isn't the only one who continues to take notice of it.","url":"https://www.bustle.com/articles/35674-kim-reveals-why-rob-kardashian-missed-her-wedding-she-doesnt-sound-sympathetic-at-all"}
