{"authors":["Kenya Foy"],"date_download":"2018-10-30 22:46:06","date_modify":"2018-10-30 22:46:06","date_publish":"2014-08-14 19:47:06","description":"With each season of The Real Housewives series, revolving door friendships are always one of the show's major running themes. After a bond forms, some ridiculous reason or another causes the \"friendship\" to implode, giving birth to a feud that…","filename":"data/vaneerConsumption/KimZolciakNeNeLeakesBeefIsOverThisTimeItMightActuallyStayThatWay.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/f1bccc0e-9570-4748-b50b-91888f72dd8f.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35828-kim-zolciak-nene-leakes-beef-is-over-this-time-it-might-actually-stay-that_1540939566.html","title":"Kim Zolciak & NeNe Leakes' Beef Is Over & This Time It Might Actually Stay That Way","title_page":"Kim Zolciak & NeNe Leakes' Beef Is Over & This Time It Might Actually Stay That Way","title_rss":"NULL","source_domain":"bustle.com","text":"With each season of The Real Housewives series, revolving door friendships are always one of the show's major running themes. After a bond forms, some ridiculous reason or another causes the \"friendship\" to implode, giving birth to a feud that either plays out within a few episodes or spans multiple seasons, like the on-again, off-again relationship between Kim Zolciak Biermann and NeNe Leakes. On Wednesday's episode of Watch What Happens Live!, the star of Don't Be Tardy told host Andy Cohen that she and Leakes are finally on good terms.\n\"NeNe and I are cool now,\" Zolciak said. \"I was friends with her long before Housewives. I'm in a good place with her and that makes me feel better and happy.\"\nSince this isn't the first time Zolciak and Leakes called a truce, I was initially tempted to dismiss what Zolciak said altogether, but there's reason to believe that they might actually remain amicable this time around. For one, when Zolciak was on RHOA, Leakes basically used her as a punching bag and a way to gain attention. Now that she's no longer on the show, Leakes has absolutely nothing to gain from attacking her.\nAstrid Stawiarz/Getty Images Entertainment/Getty Images\nThen there's the fact that Leakes has other distractions to keep her busy. After the latest RHOA season wrapped, she temporarily set her sights on her most recent friend-turned-foe Cynthia Bailey when their fickle friendship contract expired. Plus, there's her ongoing feud with Wendy Williams, which recently started up again over Leakes decorating a Birkin bag.\nDuring Zolciak and Leakes' previous fights, I always anticipated the moment that Zolciak would finally be done with giving Leakes second chances especially because after each of their breakup to makeup moments, Leakes' attacks on her former friend grew increasingly nastier. But with both women on separate shows, there's no reason why their relationship can't remain positive, as long as they keep a healthy distance from one another, specifically in the presence of cameras.","url":"https://www.bustle.com/articles/35828-kim-zolciak-nene-leakes-beef-is-over-this-time-it-might-actually-stay-that"}
