{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:25:25","date_modify":"2018-10-30 21:25:25","date_publish":"2018-07-17 21:17:00","description":"The bar will be the second location at Ponce City Market for King of Pops.","filename":"data/vaneerConsumption/KingofPopsBeachBaropeningatPonceCityMarket.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AccessAtlanta/2018/04/05/Images/skyWord.558518-pops.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_king-pops-opening__1540934725.html","title":"King of Pops Beach Bar opening at Ponce City Market","title_page":"King of Pops Beach Bar opening at Ponce City Market","title_rss":"NULL","source_domain":"ajc.com","text":"King of Pops is getting “silly” with its newest venture at Ponce City Market.\nThe omnipresent local frozen treats purveyor is slated to open its King of Pops Beach Bar at noon on Thursday, July 19.\nSituated in an outside courtyard container beside the rooftop entrance, the bar will be the second location in the mixed-use development for King of Pops, which also has a stall in the food hall on the first floor.\n“We want to keep creating fun ways to interact with our community,” said co-owner Steven Carse, who owns King of Pops with his brother, Nick, in a press release. “This bar is silly and weʼre excited to be outside in the sun keeping everyone cooled off. You deserve it.”\nThe bar will offer a new menu with some classics from downstairs including alcohol-infused slushies and a variety of snacks and frozen pops.\nThe new bar will feature a mural from local street artist, Jimmy Jam Boom Bam, and on opening day, limited offering piña colada slushies in cored, whole pineapples with “a silly umbrella and straws” will be available for purchase for a limited offering.\nRELATED:\nMore metro Atlanta restaurant openings\nYour guide to Ponce City Market\nMore intown Atlanta dining news\nGet a taste of the new fusion revolution with the 2018 AJC Spring Dining Guide: Global Mashup\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/king-pops-opening/DX2AH5o4cRG2cBLSEFUhhP/"}
