{"authors":["Nelson Groom For Daily Mail Australia"],"date_download":"2018-10-23 02:13:01","date_modify":"2018-10-23 02:13:01","date_publish":"2017-03-10 11:08:20","description":"It's a hotly anticipated blockbuster, but things spiralled out-of-control when a huge statue of King Kong went up in flames during Kong: Skull Island premiere in Ho Chi Minh City.","filename":"data/vaneerConsumption/KingKongstatuegoesupinflamesatpremiereinVietnam.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E219D8400000578-0-image-a-22_1489138016494.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300526_Statue-King-Kong-flames-film-premiere_1540260781.html","title":"King Kong statue goes up in flames at premiere in Vietnam","title_page":"King Kong statue goes up in flames at premiere in Vietnam | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's a hotly anticipated blockbuster, but things spiralled out-of-control when a huge statue of King Kong went up in flames at the film's premiere.\nDramatic footage from the opening of Kong: Skull Island shows the giant ape bursting into flames at a Ho Chi Minh City shopping mall in Vietnam.\nPanic-stricken crowds, including government officials, scrambled to flee the complex as blazing debris shot into the air, VTNews reported.\nA giant King Kong statue went up in flames at the premiere for Kong: Skull Island\nThe inferno was sparked when flames were ejected from a simulated volcano, setting the $AUD60,000 stage alight.\nIt is understood crowds initially thought the fire was part of the plan, before the flames ripped across the elaborate stage, plunging guests into panic.\nFirefighters were called and eventually extinguished the blaze, which lasted for more than 15 minutes.\nThe film starring Tom Hiddleston, Brie Larson and Samuel L. Jackson was largely shot in Hanoi and remote Vietnamese regions.\nGovernment officials and representatives from the US General Consulate in Ho Chi Minh City were among the crowd.\nSkull Island's cast as well as 225 crew members filmed in the country for a month last year.\nThe inferno was sparked when flames were ejected from a simulated volcano, setting the $AUD60,000 stage alight\nPanic-stricken crowds, including government officials, scrambled to flee the complex","url":"https://www.dailymail.co.uk/news/article-4300526/Statue-King-Kong-flames-film-premiere.html"}
