{"authors":["Katie French For Mailonline"],"date_download":"2018-10-23 04:16:13","date_modify":"2018-10-23 04:16:13","date_publish":"2017-03-10 14:25:02","description":"The head of King Kong was spotted in the side of a cliff in the sleepy seaside town of Whitby, North Yorkshire. Photographer Dag Kjelldahl captured the image yesterday.","filename":"data/vaneerConsumption/KingKongsfacespottedonthesideofaYorkshirecliff.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E230C3300000578-0-image-a-47_1489152229632.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4301284_King-Kong-s-face-spotted-Yorkshire-cliff_1540268173.html","title":"King Kong's face spotted on the side of a Yorkshire cliff","title_page":"King Kong's face spotted on the side of a Yorkshire cliff | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His face may be in all the cinemas at the moment - but apparently it is also etched on the side of a cliff face as well.\nThe famous head of King Kong was spotted by a passerby in the sleepy seaside town of Whitby, North Yorkshire yesterday.\nIt is the same rock face Dracula scrambled up when he arrived in Britain.\nPhotographer Dag Kjelldahl captured the image while monkeying around with his camera while walking on the beach.\nMonkey business: Mr Kjelldahl, who took the picture yesterday said: 'Only twice a year the sunshine hits the cliffs at Sandsend - and this time it created a giant ape's head - it's King Kong.'\nCan you spot the likeness? While cinemas across the globe are currently showing the latest King Kong film (pictured above in the original movie), residents in West Yorks didn't have to go far to see the ape's iconic face as it appeared in the side of a cliff\nIn Bram Stoker's novel, Dracula is shipwrecked off Whitby and comes ashore in the guise of a black dog and wreaks havoc on the town.\nMr Kjelldahl, who took the picture on Thursday, said: 'Only twice a year the sunshine hits the cliffs at Sandsend - and this time it created a giant ape's head - it's King Kong.'\nThe King Kong film franchise reboot Kong: Skull Island, starring Tom Hiddleston and Samuel L. Jackson, is in cinemas now.","url":"https://www.dailymail.co.uk/news/article-4301284/King-Kong-s-face-spotted-Yorkshire-cliff.html"}
