{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 03:36:33","date_modify":"2018-10-23 03:36:33","date_publish":"2017-03-16 14:29:20","description":"The rock legend, 72, whose music has been an inspiration to generations of fans, was honoured by the Prince of Wales at Buckingham Palace this afternoon.","filename":"data/vaneerConsumption/KinksfrontmanSirRayDaviesgethisknighthood.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54A96700000578-0-image-a-9_1489672998675.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320400_Kinks-frontman-Sir-Ray-Davies-knighthood_1540265793.html","title":"Kinks frontman Sir Ray Davies get his knighthood","title_page":"Kinks frontman Sir Ray Davies get his knighthood | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Kinks frontman Sir Ray Davies was knighted for services to British music today.\nThe rock legend, 72, whose music has been an inspiration to generations of fans, was honoured by the Prince of Wales at Buckingham Palace this afternoon.\nSir Ray, who is considered one of Britain's greatest modern songwriters, described the investiture with his typical dry wit and said: 'It lasted three minutes and it went very well and I said goodbye and went home.'\nThe Kinks were formed in 1963 and became one of the era's most influential bands - their influence on acts like Oasis and Blur earned Sir Ray the nickname Godfather of Britpop.\nDescribing how he felt when he was told he said: 'Initially I felt a mixture of surprise, humility, joy and a bit embarrassed but after thinking about it, I accept this for my family and fans as well as everyone who has inspired me to write.'\nArise Sir Ray Davies: The lead singer and songwriter for The Kinks was today knighted by the Prince of Wales at Buckingham Palace.\nDedicated follower of fashion: Sir Ray, dressed in a smart blue suit and tie, said that he went to the Palace for the three minute ceremony, posed for this photograph and 'went home'\nStars: Ray Davies, Mick Avory, Dave Davies and Pete Quaife (left to right) when the band was formed in 1963\nSir Ray has also revealed he is writing a new musical about siblings.\n'It's about siblings,' he told the Press Association. 'I can't tell you too much about that.'\nBritish war photographer also knighted British photographer Don McCullin poses with his knighthood medal Also being knighted was veteran war photographer Sir Don McCullin. His career, spanning almost 60 years, saw him covering conflicts in countries including the Congo, Biafra (Nigeria), Vietnam, Afghanistan and Iran, as well as being imprisoned in Uganda by dictator Idi Amin. The 81-year-old recently said he would work until he 'can't press that button anymore', though probably not covering warzones. 'When I was young I was like a greyhound, I could really shift across those battlefields and now I walk across them which is slightly more dangerous,' he told the Press Association.\nThe 72-year-old said it was 'partially' inspired by the famously rocky relationship with his brother Dave, who once described a pattern of 'jealousy, hatred and envy' between the pair before The Kinks disbanded in 1996.\nThe pair recently reunited in Islington's Assembly Hall in London for the first time in almost 20 years, where they sang You Really Got Me.\nThe musical will not be the first time Sir Ray has stepped into the world of theatre.\nHis musical Come Dancing won the Mobius Award for best Off-West End production in 2009 and Sunny Afternoon won four Olivier Awards.\nThe Kinks were formed in 1963 and became one of the era's most popular bands, with Sir Ray penning classics such as Waterloo Sunset and Sunny Afternoon.\nThe band's influence on acts like Oasis and Blur earned Sir Ray the nickname Godfather of Britpop.\nHowever, he said that receiving the knighthood honour had made him re-evaluate his life's work.\n'I don't think of myself as a musician strangely enough,' he said.\n'I'm a creative person. If I had a card it would say Sir Raymond Davies, creative person.'\nSir Ray, born in Muswell Hill, north London, said he was accepting the award for his family.\n'I hope it inspires people to do the work. I kept on working, regardless. I was speaking to Don McCullin and we kept on doing it.'\nHe said he found the ceremony 'moving', particularly the classical music which played as Prince Charles handed out the honours.\n'It's quite moving with the music and the theatrics. I listen to this kind of music often,' he added.","url":"https://www.dailymail.co.uk/news/article-4320400/Kinks-frontman-Sir-Ray-Davies-knighthood.html"}
