{"authors":["Frances Martel"],"date_download":"2018-10-30 20:31:19","date_modify":"2018-10-30 20:31:19","date_publish":"2018-09-06 18:25:41","description":"Residents in Kirkuk, Iraq, are protesting that they have run \"out of water,\" joining a chorus of protests in cities like Basra.","filename":"data/vaneerConsumption/KirkukOutofWaterasIraqiMismanagementTakesToll.json","image_url":"https://media.breitbart.com/media/2018/08/wi/afp/13/cc144b_girl-carries-containers-collect-water-on-outskirts-mazar-sharif-in-northern-e1536257743696.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_09_06__1540931479.html","title":"Kirkuk 'Out of Water' as Iraqi Mismanagement Takes Toll","title_page":"Kirkuk 'Out of Water' as Iraqi Mismanagement Takes Toll","title_rss":"NULL","source_domain":"breitbart.com","text":"Residents in Kirkuk, Iraq, are protesting that they have run “out of water,” joining a chorus of protests in cities like Basra over Baghdad’s inability to provide basic government services, the Kurdish outlet Rudaw reported on Wednesday.\nKirkuk, a multi-ethnic city in northern Iraq, was traditionally administered by the Iraqi government in Baghdad until 2014, when the Islamic State attacked and the Iraqi military fled. The Iraqi Kurdish Peshmerga forces stepped in and saved the city from ISIS, placing Kirkuk under the control of the Kurdistan Regional Government (KRG). Baghdad, backed by pro-Iran Shiite militias known as the Popular Mobilization Units (PMU/PMF), expelled the Peshmerga in late 2017 following the KRG’s decision to hold a non-binding referendum on independence.\nAt the time, President Donald Trump announced the United States would not “take sides” between the U.S.-allied Peshmerga and Iranian proxy forces, leading the Peshmerga to choose to step down.\nFollowing the Peshmerga’s departure, Kirkuk has once again become a target for Islamic State attacks and is falling increasingly into disrepair. Kurds living in the city also complain that Arab representatives from Baghdad are trying to erase them from official positions.\n“This neighborhood has not received water for 20 days. Go and knock on the doors of all these houses and ask them about how many days they have not received water,” a Kirkuk resident identified as Kamaran Rustam told Rudaw on Wednesday. He noted that some enterprising businessmen are trying to sell water at expensive prices, but “the water from some of them is not even drinkable because it is salty, spoils dishes, or if you use it for taking a shower it makes your hair hard.”\nAnother resident, Chalak Fazil, told the outlet, “Look, we are out of water. We went [to local officials] yesterday and another day. They keep saying ‘okay,’ but nothing is done. We come back home and see no water. We do not sleep at night time, waiting for water in vain.”\nOfficials in the city told the Kurdish news service that the water shortage is a product of electrical failures. Without electricity, the water stations responsible for churning out the water necessary cannot run.\nResidents already contending with a water shortage have also had to prepare for potential Islamic State attacks. Attacks continued this week. Local reports stated that ISIS terrorists killed at least seven people in a village west of the city of Kirkuk. Iraqi authorities announced later in the week that police had killed five terrorists and arrested 12 in a counteroperation.\nThe complaints in Kirkuk follow a turbulent week in Basra, southeastern Iraq, where police killed at least five protesters and wounded 68 others in a protest also demanding water, electricity, and basic resources between Tuesday and Wednesday. The day before, according to CNN, protesters in Basra were specifically demanding an end to “prolonged power cuts, contaminated water that has sent hundreds to the hospital and sanitation problems.” Some protesters grew violent, throwing Molotov cocktails at government buildings.\nIn response, the government of Prime Minister Haider al-Abadi sent in police to shoot protesters and let off tear gas to dispel the crowds on Tuesday. Abadi also announced an investigation into the deaths.\nMasoud Barzani, the former president of the KRG, sent a message of solidarity to Basra on Wednesday.\n“We consider protesting and these protests to be the right of the people, and at the same time, consider that the people of Basra have the right to live in reasonable conditions, which they deserve,” Barzani said. “What makes us wonder is that the children of the richest city in the world are suffering from problems that can not be justified, such as the lack of drinking water, the spread of disease, the disease, and negligence.”\nBasra is one of Iraq’s largest oil hubs, gifted with immense natural resources.\nIraq has largely failed to deal with these administrative problems because it does not yet have a government despite holding parliamentary elections in May. The Parliament is now split between Abadi’s supporters, including influential Shiite cleric Muqtada al-Sadr, and an opposition wing led by former prime minister Nouri al-Maliki. Maliki contends with the support of the Iranian government, with Sadr, despite also being a Shiite Muslim, is a nationalist and opposes Iranian meddling in the country’s affairs.\nA key to establishing a ruling coalition for either side will be whether they can secure the support of Kurdish political parties. Abadi, having taken Kirkuk out of Kurdish hands following the referendum and brought KRG politics into disarray, faces a challenge in convincing Kurds to support him. He repeated this week that returning Kirkuk to Peshmerga control was out of the question.\nFollow Frances Martel on Facebook and Twitter.","url":"https://www.breitbart.com/national-security/2018/09/06/kirkuk-water-iraqi-kurdish-departure/"}
