{"authors":["Rachel Mcgrath For Dailymail.Com"],"date_download":"2018-10-22 23:03:51","date_modify":"2018-10-22 23:03:51","date_publish":"2016-01-11 04:31:34","description":"The 33-year-old looked stunning as she went bra-less in the cleavage-revealing frock, and so it's no wonder that fellow actor Hedlund, 31, held on tight to his main squeeze.","filename":"data/vaneerConsumption/KirstenDunstcuddlesuptoGarrettHedlundonGoldenGlobesredcarpet.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300D482000000578-0-image-a-57_1452535381260.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393276_Kirsten-Dunst-cuddles-longtime-beau-Garrett-Hedlund-Golden-Globes-red-carpet-stuns-plunging-black-Valentino-gown_1540249431.html","title":"Kirsten Dunst cuddles up to Garrett Hedlund on Golden Globes red carpet","title_page":"Kirsten Dunst cuddles up to Garrett Hedlund on Golden Globes red carpet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kirsten Dunst walked the red carpet at the Golden Globes with longtime boyfriend Garrett Hedlund proving their four-year romance is still going strong.\nThe 33-year-old looked stunning as she went bra-less in a cleavage-revealing Valentino frock, which featured ties across her chest.\nAnd so it's no wonder that fellow actor Hedlund, 31, held on tight to his main squeeze.\nScroll down for video\nA strong romance: Kirsten Dunst and Garrett Hedlund have been together for four years\nThe pair have been together since meeting on the set of the movie On The Road, released in 2012.\nThe relationship is clearly a strong one with Dunst saying recently that she hopes to start a family in the not to distant future.\n'I want to continue acting, but I also want to have kids,' she said in a November interview with Net-A-Porter. 'I think I’ll be ready to have them in two years or something.'\nSee more of the latest red carpet pictures and videos from the 2016 Golden Globes\nGlamorous: Dunst, 33, wowed in a low-cut black velvet Valentino gown at the Golden Globe Awards on Sunday\nSecret to their romance: Dunst revealed recently that she 'appreciates old-fashioned manners' like a guy holding the door open for her and paying for dinner. 'I love the masculine,' she said\nWhile the actress has enjoyed some pretty high-profile romances in the past, she's kept her current one on the down-low.\nAway from the cameras, the two enjoy a pretty normal life, she told Net-A-Porter, bringing Hedlund along to Sunday dinners with her mom and letting him 'drag' her to action-packed blockbuster movies.\n'I love the masculine; I’ve dated men who had more of a feminine side and it didn’t work,' Dunst explained.\n'I appreciate old-fashioned manners. I want a guy to pay for dinner and open the door for me,' she said.\nWorked together: The Spider-Man star and the Tron: Legacy actor started dating after meeting on the set of the film On The Road, released in 2012\nGive and take: Dunst takes Hedlund, 31, to Sunday dinners with her mom while he 'drags' her along to see blockbuster action films\nHedlund, 31, got his big break after being cast in 2004's Troy opposite Brad Pitt.\nHe went on to have roles in Friday Night Lights, Tron: Legacy, Unbroken and Pan.\nDunst has been working since the age of six with a long list of credits including Interview With The Vampire, The Virgin Suicides, Bring It On and Sam Raimi's Spider-Man trilogy with Tobey Maguire.\nSee our full Golden Globes coverage on the winners and red carpet moments\nEnchanting: The 33-year-old paired the cleavage-baring floor-length gown, cinched at her waist, with dark eye makeup and styled her blonde locks in a classy up-do\nStunner: The actress sported black eye shadow and kohl lined lids and a large pair of diamond earrings\nDunst was nominated for best performance by an actress in a limited series for her role in Fargo - but missed out to Lady Gaga.\nThe blonde beauty was previously nominated for a Golden Globe in 1995 for her performance in Intervew With The Vampire: The Vampire Chronicles.\nShe's previously been linked romantically with Jake Gyllenhaal, Adam Brody, Ben Foster and Justin Long.\nDazzling: The Melancholia actress was the picture of happiness on the red carpet\nLooking to the future: Dunst recently said she would like to have children in a couple of years or so\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393276/Kirsten-Dunst-cuddles-longtime-beau-Garrett-Hedlund-Golden-Globes-red-carpet-stuns-plunging-black-Valentino-gown.html"}
