{"authors":["Sharnaz Shahid For Mailonline"],"date_download":"2018-10-23 01:53:00","date_modify":"2018-10-23 01:53:00","date_publish":"2016-01-28 16:23:31","description":"The 40-year-old served up quite the revealing display as she stripped down to a skimpy bikini for the new Champneys Detox range.","filename":"data/vaneerConsumption/KirstyGallacherstripsdowntowhitebikiniforChampneysDetoxrangephotoshoot.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AB42F400000578-0-image-a-74_1453997605030.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421243_Sea-sational-Kirsty-Gallacher-shows-incredible-figure-strips-skimpy-white-bikini-smouldering-photoshoot_1540259580.html","title":"Kirsty Gallacher strips down to white bikini for Champneys Detox range photoshoot","title_page":"Kirsty Gallacher strips down to white bikini for Champneys Detox range photoshoot | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She dazzled crowds with her fancy footwork on Strictly Come Dancing, flashing the flesh in a variety of racy ensembles\nSo it’s no surprise Kirsty Gallacher has been picked to front the new Champneys Detox range, taking part in a smouldering photoshoot.\nThe TV presenter - who turned 40 last week - served up quite the revealing display as she stripped down to a skimpy bikini.\nScroll down for video\nSea-sational! Kirsty Gallacher served up quite the revealing display as she stripped down to a skimpy bikini for the new Champneys Detox range\nChannelling her inner Ursula Andress, the brunette stunner looked absolutely incredible as she emerged from the water with large seashells in her hands.\nShe proudly showcased her toned curves and slender frame in a replica of the sizzling white belted two-piece made famous by the iconic James Bond star.\nWith her long tresses left loose in wet tousled waves, Kirsty’s striking facial features were clearly visible, made-up with smoky eyewear, rosy cheeks and plush pink lips.\nWater goddess: Channelling her inner Ursula Andress, the brunette stunner looked absolutely incredible as she emerged from the water with large seashells in her hands\nKirsty oozed heaps of sex appeal and confidence, stepping out from the sea with droplets of water rippling off her sun-kissed body.\nCommenting on the new spa range, Kirsty explained: ‘I’m a big advocate of detoxing from skin to soul and swear by the Champneys Detox range to revive and renew.\n‘Seaweed and sea minerals are amazing natural ingredients that makes skin smoother and firmer, with noticeable results even in hard to reach problem areas.’\nSizzling display: She proudly showcased her toned curves and slender frame in a replica of the sizzling white belted two-piece made famous by the iconic James Bond star (pictured on the right)\nA beauty: With her long tresses left loose in wet tousled waves, Kirsty’s striking facial features were clearly visible, made-up with smoky eyewear, rosy cheeks and plush pink lips\nResearch from the Original Health Spa Champneys, reveals that women are at their most confident at 40 (64 per cent) having higher self-esteem and knowing what works for their body.\nMeanwhile, the new campaign will no doubt be a welcome distraction for Kirsty, as the TV star recently ended her marriage with partner of 15 years Paul Sampson.\nAnd while Kirsty is yet to set her sights on her next man, the mother-of-two recently revealed she isn't ruling out the possibility of having more children in the future.\n'We’re all ten years younger these days, so 40 is the new 30,' she enthused, during an interview with Essentials magazine.\n'I’m feeling better in myself - personally, mentally, physically - than I’ve ever felt. I think late 30s are a good time for women - if you can think positively, it’s the best time of your life.'\nDaring to bare: The TV star also sported a seaweed inspired bikini","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421243/Sea-sational-Kirsty-Gallacher-shows-incredible-figure-strips-skimpy-white-bikini-smouldering-photoshoot.html"}
