{"authors":["John Hayward"],"date_download":"2018-10-30 18:05:45","date_modify":"2018-10-30 18:05:45","date_publish":"2016-08-19 03:02:22","description":"A bizarre string of kite-inflicted fatalities rocked India on Monday, killing two small children and a 22-year-old man in separate incidents.","filename":"data/vaneerConsumption/KiteStringsKillThreeinIndiaonSameDay.json","image_url":"https://media.breitbart.com/media/2016/08/independence-day-kite-flying-in-india-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_08_18__1540922745.html","title":"Kite Strings Kill Three in India on Same Day","title_page":"Kite Strings Kill Three in India on Same Day","title_rss":"NULL","source_domain":"breitbart.com","text":"A bizarre string of kite-inflicted fatalities rocked India on Monday, killing two small children and a 22-year-old man in separate incidents.\nIndia has an alarming fondness for kite strings made with glass, known as manja. This makes the strings sharp enough to cut skin, with fatal results in these three cases, as each victim was struck in the neck.\n“A 4-year-old boy had his throat slit while he was looking out of a car’s sunroof and a 22-year-old man received a lethal cut on his neck while riding a motorbike on August 15, according to Pushpendra Kumar, the deputy commissioner of the West Delhi Police,” CNN reports. “The same day, a 3-year-old girl looking out the sunroof was strangled by a kite string which cut her neck, according to a deputy commissioner of North West Delhi Police.”\nThe UK Guardian adds the terrible detail that the little girl was standing on her mother’s lap when she was killed. “The manja had cut through her neck, including the windpipe. The cut was so deep she died instantly,” said a senior police officer.\nThe Guardian adds there was another, reportedly non-fatal, injury east of Delhi, leaving an eight-year-old boy with 20 stitches.\nIndia is now considering a ban on the strings, with Dehli’s deputy chief minister Manish Sisodia declaring that “Chinese manja and other kite flying thread which is made of glass, sharp material is dangerous,” and “the safety of our citizens is non-negotiable.”\nCNN further notes that manja kite strings have also injured a number of animals, with 500 birds requiring treatment for cuts over the past few days. (There has been a great deal of kite-flying recently due to India’s Independence Day celebration.)\nSharp glass kite strings might seem like a pointlessly dangerous affectation, but the UK Guardian explains that such strings are prized for kite fighting. India has a history of regional bans on manja strings, as in the city of Chennai, where four people were killed over the span of three years by the strings, plus 14 lesser injuries.","url":"https://www.breitbart.com/national-security/2016/08/18/kite-strings-kill-three-india-day/"}
