{"authors":["Shannon Carlin"],"date_download":"2018-10-31 01:50:10","date_modify":"2018-10-31 01:50:10","date_publish":"2018-09-13 21:54:16","description":"Jon Snow may know nothing, but Kit Harington knows a little something about the expectations that fans have for the Game Of Thrones series finale. And, it is because of that knowledge that Harington doesn't think all GoT fans are going to love the…","filename":"data/vaneerConsumption/KitHaringtonsThoughtsOnTheGameOfThronesSeriesFinaleShouldSoundFamiliarToFans.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/13/43d5b435-dec5-4416-8ffe-d5a59f389178-getty-902386636.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_kit-haringtons-thoughts-on-the-game-of-thrones-series-finale-should-sound-familiar-to-fans-11906894_1540950610.html","title":"Kit Harington's Thoughts On The 'Game Of Thrones' Series Finale Should Sound Familiar To Fans","title_page":"Kit Harington's Thoughts On The 'Game Of Thrones' Series Finale Should Sound Familiar To Fans","title_rss":"NULL","source_domain":"bustle.com","text":"Jon Snow may know nothing, but Kit Harington knows a little something about the expectations that fans have for the Game Of Thrones series finale. And, it is because of that knowledge that Harington doesn't think all GoT fans are going to love the finale. And you know what? He thinks that's OK, in fact, it's to be expected. And, as a matter of fact, eagle-eyed fans have come to expect this kind of answer from the Game Of Thrones cast.\nIn an interview with MTV at the Toronto International Film Festival, Harington was asked about the GoT series finale — because of course he was. And despite being unable to say anything specific about the finale, he did say that it might not live up to some fans' expectations.\n\"I think a TV series that's spanned eight, nine years is an incredibly difficult thing to end,\" Harington said. \"I think not everyone's going to be happy, you know, and you can't please everyone.\" To prove his point, he name dropped some of his favorite dramas that ended with a bang, but also a bit of a whimper from some disappointed fans. \"My favorite TV shows are Sopranos, Breaking Bad, and The Wire,\" Harington said. \"And they all ended in a way that...It's never going to satisfy you.\" Harington did tell MTV that ultimately, he \"hopes\" that the Game Of Thrones Season 8 will satisfy most viewers, but he wants to be realistic about the whole thing.\nThis isn't the first time that a member of the Game Of Thrones cast has tried to undersell the series finale. Back in January, Isaac Hempstead Wright, who plays Bran Stark, told The Hollywood Reporter that the Game Of Thrones finale won't please everyone. \"We're all so confident in the way this story goes and the message it gives and how the whole story arc works,\" Wright said, noting that it's impossible to get everything right for every single fan. \"It won't go the way some people want,\" he said of the ending. \"It will be too happy for some people, or too sad, or too whatever. That's the nature of an ending.\"\nWright continued by saying, \"Naturally, when anything is coming toward its finale, especially something as consistently brilliant as Game of Thrones, naturally people are concerned about whether we can do this justice: 'Are they going to f*ck this up at the last minute?'\" Wright said. \"Obviously, people will hold us to a higher standard.\" For him, as long as the creative team \"does justice\" to the story, that's all that matters.\nEmilia Clarke, whose Game Of Thrones finale comments have been all over the place, also hinted that not every fan is going to be happy with how it ends. \"It f*cked me up,\" Clarke said about the GoT finale in an interview withVanity Fair. \"Knowing that is going to be a lasting flavor in someone's mouth of what Daenerys is…\"\nNow, knowing that the remaining Game of Thrones actors have been taught the art of deflection when it comes to questions about this final season, it's hard not to wonder if this \"not everyone's going to be happy with the finale\" answer is one they were told to say. A way of getting fans excited, but not too excited, this way even if the finale doesn't give them everything they want, they'll take it with a grain of salt.\nOf course, don't expect anyone in the GoT cast to admit this, but definitely keep an ear out for other actors on the show to echo Harington's latest sentiment. And, if you do hear it, just know that it's probably their way of saying, \"I'd tell you, but then I'd have to kill you\" — and also, \"please don't yell at me on social media after it airs.\"","url":"https://www.bustle.com/p/kit-haringtons-thoughts-on-the-game-of-thrones-series-finale-should-sound-familiar-to-fans-11906894"}
