{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-22 22:35:46","date_modify":"2018-10-22 22:35:46","date_publish":"2016-01-29 09:48:59","description":"Kit Harington, 29, and Rose Leslie, 28, looked close as the pair arrived at LAX together on Thursday.","filename":"data/vaneerConsumption/KitHaringtonarrivesinLAwithGameofThronescostarRoseLeslie.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/09/30B0361100000578-0-image-a-15_1454058924401.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422418_Kit-Harrington-arrives-LA-Game-Thrones-star-Rose-Leslie-amid-reports-acting-coupley-restaurant_1540247746.html","title":"Kit Harington arrives in LA with Game of Thrones co-star Rose Leslie","title_page":"Kit Harington arrives in LA with Game of Thrones co-star Rose Leslie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They enjoyed a passionate and fiery relationship in fantasy epic Game of Thrones.\nAnd Kit Harington, 29, and Rose Leslie, 28, looked to be getting close off-screen as well, as the pair arrived at LAX together on Thursday.\nHunky Kit put on a typically cool display as he lead the way through the assembled fans and photographers.\nScroll down for video\nBlossoming romance? Kit Harington, 29, and Rose Leslie, 28, looked close as the pair arrived at LAX together on Thursday\nThe actor, best known for playing the brooding Jon Snow in the hit TV show, wore a white linen shirt tucked into a pair of dark jeans.\nWearing his sleeves rolled up and his shirt unbuttoned to reveal a glimpse of chest, Kit walked with purpose with Rose close by.\nHe sported a pair of dark brown ankle boots, and a pair of shades combined with his beard and slick long locks gave off a rock star vibe.\nSee Game Of Thrones updates as Kit Harington and Rose Leslie eat together\nStylish: The actor, best known for playing the brooding John Snow in the hit TV show, wore a whie linen shirt tucked into a pair of dark jeans\nEpitome of cool: Wearing his sleeves rolled up and his shirt unbuttoned to reveal a glimpse of chest. Kit walked with purpose with Rose close by\nMeanwhile, Rose ensured the duo were sartorially in-sync with an open white shirt worn over a plunging black vest top.\nShe teamed the garments with a pair of black trousers and some casual black and white kicks.\nThe actresses distinctive red hair was swept over to one side and cascaded in waves down her front. She also covered her eyes with a pair of brown shades.\nShe certainly looked far more glamorous than her Game of Thrones character Ygritte.\nKit-ted out: He sported a pair of dark brown ankle boots and a pair of shades combined with his beard and slick long locks gave off a rockstar vibe\nCrowd-pleaser: Kit made an effort to sign fans' memorabilia on his way to the car\nThe 'wildling' shared a sexual relationship with Jon made difficult by their differing backgrounds.\nOn Tuesday, the pair were spotted getting cosy in a restaurant in Soho, London, according to perezhilton.com.\nAn insider reported that the duo 'were acting \"very coupley\"' with Rose 'ruffling her hands through Kit's hair'.\nThe pair were joined on their flight by co-star Sophie Turner, 19, who plays Sansa Stark.\nLuscious locks: The actresses distinctive red hair was swept over to one side and cascaded in waves down her front\nProving popular: Kit's role in Game of Thrones has made him an international star\nSet to return: Kit's beloved character looked like a sure goner at the end of the previous season, when he was stabbed multiple times by his 'brothers' in the Nights Watch in a Ides Of March esque betrayal\nKit's beloved character looked like a sure goner at the end of the previous season, when he was stabbed multiple times by his 'brothers' in the Nights Watch in a Ides Of March esque betrayal.\nHowever fans are hoping he will survive after all after after a bloody teaser poster featuring his character suggested he might pull through.\nHis eyes were shown changing colour as he bled in the snow, suggesting he may have been using been transferring his consciousness into another creature, most likely his direwolf the almost too perfectly named Ghost.\nIn additio,n Red Priestess Melisandre turned up at Castle Black just before he was attacked, and followers of her religion have been shown bringing people back to life in the past.\nAccording to Entertainment Weekly, season six of the fantasy drama will premiere on April 24, and HBO is preparing for two additional seasons.\nMailOnline has contacted representatives for Kit and Rose, and is awaiting comment.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422418/Kit-Harrington-arrives-LA-Game-Thrones-star-Rose-Leslie-amid-reports-acting-coupley-restaurant.html"}
