{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 00:29:02","date_modify":"2018-10-23 00:29:02","date_publish":"2017-03-10 06:59:20","description":"His Jon Snow character has already died and come back to life once. And it seems Kit Harington is suggesting things are only going to get crazier in the upcoming season of","filename":"data/vaneerConsumption/KitHaringtondiscussesupcomingambitiousGoTseason.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/06/3E20622C00000578-0-image-a-96_1489126400848.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300052_Kit-Harington-discusses-upcoming-ambitious-GoT-season_1540254542.html","title":"Kit Harington discusses upcoming 'ambitious' GoT season","title_page":"Kit Harington discusses upcoming 'ambitious' GoT season | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His Jon Snow character has already died and come back to life once.\nAnd it seems Kit Harington is suggesting things are only going to get crazier in the upcoming season of Game of Thrones, set to debut on July 16th.\nThe 30-year-old actor talked to ABC News on Thursday and offered up several tantalizing teasers as well as some interesting analysis.\nWhat a tease: It seems Kit Harington is suggesting things are only going to get crazier in the upcoming season of Game of Thrones, set to debut on July 16th\n'[Season 7 has] so much more ambition,' began the U.K. native, it's going to be 'much grander.'\nHe went on to explain why fans are going to get a particularly wild ride in the upcoming season.\n'There are less episodes this year, so they spent more money on those episodes. So, the whole scale of it is up,' he said, referring to the fact that there are only seven episodes planned for the 7th season, down from 10 in seasons past.\nThe Seventh Son star also revealed he believes the show needs to go out 'with a bang' when it ends after season eight.\nRepeat? His Jon Snow character has already died and come back to life once\n'That has to happen at the end of Thrones, this season and next season. It has to go into places TV hasn't been.'\nAfter the more general discussion, he also got into how the fans' perception of the show is extremely important.\n'I'm such a big cynic, I film a scene and [think] it's gonna be a terrible scene,' he admitted, before adding 'Then when everyone loves it, I'm happy.'\nTrue artist: 'I'm such a big cynic, I film a scene and [think] it's gonna be a terrible scene,' he admitted, before adding 'Then when everyone loves it, I'm happy'\nKit's insights come after fans were left frustrated when an HBO live stream abruptly ended with no announcement for the premiere of season seven on Thursday.\nHundreds of thousands of fans waited patiently for more than an hour for block of ice to melt revealing the premiere date.\nBut the Facebook stream appeared to be plagued by technical glitches, leaving many disappointed when it suddenly dropped.\nHBO did manage to confirm the July 16th drop date later in the day.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300052/Kit-Harington-discusses-upcoming-ambitious-GoT-season.html"}
