{"authors":[],"date_download":"2018-10-23 00:55:10","date_modify":"2018-10-23 00:55:10","date_publish":"2016-01-28 14:59:07","description":"Heading to the The Ivy on Wednesday night, the 29-year-old star sported his character's trademark tousled black locks and beard - though he chose a more modern wardrobe than the Night's Watch.","filename":"data/vaneerConsumption/KitHaringtonchannelstheJonSnowbywearingallblackinLondon.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAFDC100000578-0-image-a-66_1453993125449.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420997_Kit-Harington-channels-Night-s-Watch-wearing-black-ensemble-London-preparing-Game-Thrones-fans-hopes-dashed-Jon-Snow_1540256110.html","title":"Kit Harington channels the Jon Snow by wearing all-black in London","title_page":"Kit Harington channels the Jon Snow by wearing all-black in London | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The only question anyone wants to ask Kit Harington at the moment is: 'Is Jon Snow really dead?'\nBut if anyone was asking the question on Wednesday night, Kit Harington didn't appear to be in the mood to answer it - as the actor cut surly figure while out and about in London.\nHeading to the The Ivy, the 29-year-old Game of Thrones star sported his character's trademark tousled black locks and beard - though he chose a more modern wardrobe than the Night's Watch.\nScroll down for video\nTaking up the black: Kit Harington cut a surly figure as he stepped out in London on Wednesday night, and appeared to be taking some style tips away from his time on Game of Thrones\nPossibly paying a nod to his character's role as the leader of Westeros' only defence against the White Walkers and Wildlings, Kit donned an all black ensemble.\nWith winter firmly upon the capital, the star chose to step out in a snug, charcoal wool jumper, which only served to emphasise the actor's impressive torso.\nTeaming his warm knitwear with a pair of black skinny-fit jeans, Kit kept to his monotonal theme while also adding a sharp edge to his smart-casual look.\nHe rounded off the look with a pair of slightly scuffed Chelsea boots, which gave a distinctive British edge to the London-born actor's wardrobe.\nChannelling Westeros: Heading to the The Ivy, the 29-year-old Game of Thrones star sported his character's trademark tousled black locks and beard - though he chose a more modern wardrobe than the Night's Watch\nA tribute to Jon Snow? Possibly paying a nod to his character's role as the leader of Westeros' only defence against the White Walkers and Wildlings (Jon Snow, pictured), Kit donned an all black ensemble\nAnd while he may possibly have left Jon Snow behind for ever at the end of series five of Game of Thrones, Kit kept the distinctive look of Ned Stark's son for his evening on the town.\nWearing his long mane tangled mane in the distinctive scraped-back, tousled do, the actor also sported a groomed beard on his chiseled features.\nKeeping his look sombre and mainly untouched, the only exception to his sartorial rule for the evening was a silver wristwatch.\nWinter warmer: With winter firmly upon the capital, the star chose to step out in a snug, charcoal wool jumper, which only served to emphasise the actor's impressive torso\nSimple and stylish: Teaming his warm knitwear with a pair of black skinny-fit jeans, Kit kept to his monotonal theme while also adding a sharp edge to his smart-casual look\nKit's evening out in London came only days after the actor revealed in an interview with the BBC that Game of Thrones fans should prepare for disappointment regarding his beloved character.\nTalking about the up-coming sixth series (due in April) he bluntly revealed Jon Snow is dead, saying: 'They should tune in and watch because whatever happens in the next season will be very exciting. But John Snow is dead I'm afraid.\n'I think [fans' speculation] is great for the show - but they shouldn't get their hopes up about anything because Game of Thrones is very good at dashing hopes.'\nWell-heeled display: He rounded off the look with a pair of slightly scuffed Chelsea boots, which gave a distinctive British edge to the London-born actor's wardrobe\nThat distinctive look: Wearing his long mane tangled mane in the distinctive scraped-back, tousled do, the actor also sported a groomed beard on his chiseled features\nHowever the actor managed to expertly side-step the question of whether his character's scenes in series six, leaving a giant question mark hanging over the mysterious Jon Snow storyline.\nAnd hinting that the show had reached a peak, he hinted the award-winning drama would start to draw to an end.\n'It's been a gateway into many things for me, and I love it and owe it a lot,' he explained. 'I hope that people keep watching it as it comes to a slow, gradual end.'\nSeries Six of HBO's epic fantasy drama, based on the books of George R. R. Martin is due to hit the small screen in both the US and UK in April.\nKit's evening out in London came only days after the actor revealed in an interview with the BBC that Game of Thrones fans should prepare for disappointment regarding his beloved character","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420997/Kit-Harington-channels-Night-s-Watch-wearing-black-ensemble-London-preparing-Game-Thrones-fans-hopes-dashed-Jon-Snow.html"}
