{"authors":["Press Association"],"date_download":"2018-10-23 03:17:12","date_modify":"2018-10-23 03:17:12","date_publish":"2016-01-11 15:57:14","description":"Jurgen Klopp has warned former Bundesliga rival Pep Guardiola to be ready for England's punishing fixture schedule should he follow him to the Premier League...","filename":"data/vaneerConsumption/Klopphighlightsnumberofmatchesaskeydifferencebetweengermanyandengland.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-8c966b60-ae8e-4ddf-9af9-e9fb88a24693-3WAQP5SaQH704788ebcf7e0a88bb-418_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393642_Klopp-highlights-number-matches-key-difference-Germany-England_1540264632.html","title":"Klopp highlights number of matches as key difference between germany and england","title_page":"Klopp highlights number of matches as key difference between germany and england | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Klopp highlights number of matches as key difference between Germany and England\nJurgen Klopp has warned former Bundesliga rival Pep Guardiola to be ready for England's punishing fixture schedule should he follow him to the Premier League.\nGuardiola has announced he will leave Bayern Munich at the end of the season and has been linked with three of England's biggest clubs.\nChelsea are under interim manager Guus Hiddink after sacking Jose Mourinho, Louis van Gaal remains under pressure at Manchester United and Guardiola is widely linked with Manchester City, who have manager Manuel Pellegrini under contract but a number of Guardiola's former Barcelona colleagues in their leadership structure.\nEngland's fixture schedule has posed problems for Jurgen Klopp and his injury-ridden squad\nKlopp, who enjoyed great success with Borussia Dortmund in Germany, took over at Liverpool earlier this season and has since seen his squad decimated by injuries.\nHe faces an FA Cup replay after an unfamiliar line-up drew 2-2 with Exeter on Friday, while a run to the two-legged semi-final of the Capital One Cup has added to congestion.\n\"The number of games is the biggest difference (from Germany),\" Klopp told several national newspapers.\n\" When I came here, I didn't know there were two (legs) in the semi-final of the Capital One Cup. I had people in Germany, saying after we beat Stoke, 'yeah, you're in the final again!' Idiots!\n\"In Germany, when you tell people about the FA Cup - that if you draw you play again - they say 'what?'. Here you have penalties and extra time, but only after the second game.\"\nThe teams linked with Guardiola have all been consistently big spenders in the transfer market and Klopp said: \" Pep is so experienced, for sure. I'm sure he will buy a few players and have a good team, have 35 players or whatever.\"\nA spate of hamstring issues have highlighted Liverpool's injury problems and Klopp again referenced the fixture schedule, and the lack of a winter break in England, in discussing the situation.\nHe said: \"I've had a similar situation before with injuries, but with the winter break, they come back. That's a big difference.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3393642/Klopp-highlights-number-matches-key-difference-Germany-England.html"}
