{"authors":["Robert Wilde"],"date_download":"2018-10-30 22:17:19","date_modify":"2018-10-30 22:17:19","date_publish":"2015-05-06 15:19:51","description":"The Los Angeles County Sheriff’s Department arrested an aide to California Attorney General Kamala Harris along with two others for operating a rogue police force.","filename":"data/vaneerConsumption/KnightsTemplarGroupArrestedforImpersonatingOfficers.json","image_url":"https://media.breitbart.com/media/2015/05/kamala-harris-aide-mugshots.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_05_06__1540937839.html","title":"‘Knights Templar’ Group Arrested for Impersonating Officers","title_page":"‘Knights Templar’ Group Arrested for Impersonating Officers","title_rss":"NULL","source_domain":"breitbart.com","text":"The Los Angeles County Sheriff’s Department arrested an aide to California Attorney General Kamala Harris, along with two others, for operating a rogue police force.\nBrandon Kiel, David Henry and Tonette Hayes were charged with impersonating a police officer through their roles in the Masonic Fraternal Police Department, which boasts jurisdiction in 33 states and Mexico City.\nThe MFPD claims to have existed for more than 3,000 years and that their “bloodlines” descend from the Knights Templar, an ancient Christian organization some refer to as the “storm troopers of the Crusades.”\nThe Los Angeles Times reported on Wednesday, Kiel, 31, has worked as the deputy director of community affairs at the California Department of Justice under Harris. A California DOJ spokesman said that Kiel is on administrative leave. The Attorney General declared her Democratic candidacy for senator to replace retiring Barbara Boxer in 2016.\nSheriff’s officials said that in January they became suspicious of the MFPD when several police chiefs in Southern California received a letter telling of new leadership for the group. Following up on the letters, Kiel, referring to himself as the police force’s “chief deputy director,” called several law enforcement agencies and requested meeting with them.\nSanta Clarita Valley Sheriff’s Capt. Roosevelt Johnson agreed to meet with members of the group. He became distrustful after they were unable to shed any information about their goals or mission as a group.\nThe MFPD website states , “When asked what is the difference between the Masonic Fraternal Police Department and other Police Departments the answer is simple for us. We were here first!… This is more then (sic) a job it is an obligation.”\nThe Times reported that sheriff’s investigators searched two sites in Santa Clarita and found badges, weapons, uniforms and law enforcement paraphernalia.\nAccording to jail records, on Thursday the three suspects were arrested and released after being booked.\nAside from the impersonation of an officer charges, Kiel is accused of misusing his government identification. Henry was also charged for perjury under oath.","url":"https://www.breitbart.com/local/2015/05/06/kamala-harris-aide-heads-knights-templar-group-arrested-for-impersonating-police-officer/"}
