{"authors":[],"date_download":"2018-10-22 21:23:52","date_modify":"2018-10-22 21:23:52","date_publish":"2014-06-05 11:23:41","description":"From G-7 leaders putting the focus on Russia to a Canadian gunman on the loose after killing three Mounties, see the stories we're following.","filename":"data/vaneerConsumption/KNOWITALLThursdaysTop6StoriesatNBCNews.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/484446/bergdahl_f235fd4a3ef5cfc5510d3310fc4bbfc8.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_know-it-all_know-it-all-thursdays-top-6-stories-nbc-news-n123256_1540243432.html","title":"KNOW IT ALL: Thursday's Top 6 Stories at NBC News","title_page":"KNOW IT ALL: Thursday's Top 6 Stories at NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGood morning, and happy Thursday! Here are some of the stories we're following today:\n1. Obama and G-7 colleagues meet without Russia’s Putin\nPresident Barack Obama sat down today with world leaders to talk strategy on Russia, whose president, Vladimir Putin, has been getting the cold shoulder since his country annexed Crimea. It’s the first time Russia hasn’t been represented at the summit in 17 years. The high-profile event was originally scheduled for Sochi, Russia, but those plans were canceled given Russia's role in Ukraine's separatist crisis. More sanctions against Russia could be on the table at the G-7 summit. Obama will speak at a news conference at 9:50 a.m. ET today, and then depart for Paris ahead of D-Day activities. Read more in POLITICS.\n2. Canadian police on hunt for gunman who killed 3 officers\nIn a rare show of gun violence in Canada, an “armed and dangerous” shooter allegedly killed three police officers and injured two others in New Brunswick province Wednesday. He remained on the loose early today, and authorities warned residents in the Pinehurst subdivision near the Moncton Coliseum to lock their doors. The last Mountie to die by gunfire, according to an honor roll on the RCMP website, was in November 2007. Read more in NEWS.\n3. Military logs draw more scrutiny over Bergdahl’s release\nArmy Sgt. Bowe Bergdahl was captured by Afghan Taliban less than nine hours after walking off from his outpost in 2009, according to military logs made public by WikiLeaks. The documents reveal other details about Bergdahl’s disappearance and the scramble to find him – but they don’t answer questions about why the young soldier walked away. Since Bergdahl’s release Saturday, video has emerged of his final moments in captivity, while his hometown in Idaho had to cancel a “welcome home” rally because of security concerns. Read more in NEWS.\n4. GM to release results of internal probe over faulty switches\nThe Detroit automaker has recalled some 15 million vehicles this year because of safety problems, including an ignition switch defect linked to 13 deaths. The company’s new CEO, Mary Barra, has promised to release a report today by a former federal attorney into the recalls. All of the products affected by the ignition switch recall — such as the Chevrolet Cobalt, Pontiac G6 and Saturn Ion — are now out of production. Meanwhile, the company has rebounded from bankruptcy with its best sales since August 2008. Read more in BUSINESS.\n5. Donald Sterling is $2B richer after agreeing to sell Clippers\nHis racist comments upended the NBA, and triggered outrage from players and fans. Now, Sterling has reportedly agreed to get out of the basketball business, and along with his wife will sell the Los Angeles Clippers to ex-Microsoft CEO Steve Ballmer. In addition to the record $2 billion payday, Sterling won’t sue the league and the league will drop any of its charges against him. Read more at NBC SPORTS.\n6. Casey Kasem’s wife disputes radio icon’s ailing health\nAfter allegedly throwing raw meat at Casey Kasem’s daughter, wife Jean Kasem is telling her side of the story in court documents filed Wednesday. Although Jean Kasem still hasn’t explained why she has kept her husband from his adult children from another marriage, she claims they want his $80 million fortune. Daughter Kerri Kasem also owes her father and his current wife $1.3 million, the court filing claims. Kerri Kasem has struck back, telling NBC News the claims are “defamation of character.” Read more in POP CULTURE.\n… What’s trending today?\nTwitter users are none too impressed with the Commander-in-Chief’s workout routine.\nA video purportedly shows President Obama pumping iron in Poland during his European tour this week. But his weights of choice look a little meager for the leader of the free world.","url":"https://www.nbcnews.com/news/know-it-all/know-it-all-thursdays-top-6-stories-nbc-news-n123256"}
