{"authors":[],"date_download":"2018-10-22 20:54:39","date_modify":"2018-10-22 20:54:39","date_publish":"2014-05-05 00:55:30","description":"From a horrifying circus malfunction to the return of the Pistorius trial, see the stories we're following.","filename":"data/vaneerConsumption/KNOWITALLMondaysTopStoriesatNBCNews.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/419641/140505-circus-canceled-girl-650a_6cf4683c35b6b44dd7e3d4c661d81e84.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_know-it-all_know-it-all-mondays-top-stories-nbc-news-n96901_1540241679.html","title":"KNOW IT ALL: Monday's Top Stories at NBC News","title_page":"KNOW IT ALL: Monday's Top Stories at NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGood morning, and happy Monday. Here are some of the stories we're following today:\n1. Woman injured in circus act will return, her father says\nOne of the eight women who plunged when a high flying act at a Rhode Island circus went awry will return to the ring, her father vowed. Another dancer was injured on the floor Sunday morning when a high-wire apparatus fell to the ground, to the horror of the audience. Investigators are trying to figure out what went wrong and how to fix it before the act is featured at another Ringling Brothers show. Read More in NEWS.\nThis video may be disturbing for some to watch.\n2. Pistorius back on trial after 17-day hiatus\nOscar Pistorius' sensational and often dramatic murder trial, which started March 3, resumed Monday after a hiatus. The defense had called three witnesses — including Pistorius — before Monday, but at least 11 more are expected to testify. On Monday the defense first questioned, Johan Stander, a neighbor who Pistorius called after killing his girlfriend, Reeva Steenkamp on Valentine's Day morning 2013. Read more in News.\n3. Wildfires burn 4,000 acres of Oklahoma\nA man was killed when he failed to evacuate one of the Guthrie, Okla., homes impacted by a massive wildfire. The fire was 75 percent contained by Monday morning, but 150 homes were still in the path of the flames. Six occupied homes and 15 abandoned buildings had already been destroyed in the blaze that affected more than 6,000 people. Read more in NEWS.\n4. Search for missing jet gets an upgrade — and an update\nIn the excruciating effort to find the Malaysia Airlines plane that disappeared March 8, Australian officials said they will seek out new equipment to dive deeper than the autonomous sub that has already scoured more than 100 square miles in the Indian Ocean. Officials also plan to reassess the data they have compiled in the search to make sure they are focusing their resources on the right area. Read more in NEWS.\n5. MERS virus spreads in Saudi Arabia\nFifteen more people in Saudi Arabia have been diagnosed with Middle East Respiratory Syndrome (MERS) virus, a deadly disease that was first discovered in 2012. While most cases are reported in the Middle East, 12 countries have been plagued by it — including the U.S., when a health worker with the virus traveled from Saudi Arabia to Indiana. He is being kept isolated at a hospital, and doctors say he's in good condition. Read more in HEALTH.\n… What’s trending today?\nMore than a year ago, a New Jersey family lost their dog when Hurricane Sandy descended on the Northeast. The parents decided recently that it was time to get a replacement pup for their kids and when they visited a shelter, were immediately drawn to a dog who looked just like their long-lost pitbull mix, Reckless. A scar on his head indicated that it was, in fact, the family's beloved pet. Reckless is likely to be one spoiled doggy from now on.","url":"https://www.nbcnews.com/news/know-it-all/know-it-all-mondays-top-stories-nbc-news-n96901"}
or when she was asked a question about sexual assault on college campuses. In her 30-second slot, she said colleges need to take responsibility for what's going on at their schools in order to raise awareness about the problem and encourage girls to empower themselves. Read more in STYLE.\n… What’s trending today?\nTrending: An 89-year-old British World War II vet was determined to make it to Normandy on the 70th anniversary of D-Day so he hopped on a bus to France. The only problem was that Bernard Jordan didn’t tell anyone at his nursing home where he was going, and they reported him missing. The nursing home had tried to get him a trip, but they weren’t able to so the still-savvy vet made his own way. He’s back at the home safely now, and it doesn’t seem attendants were too upset with him. How could they be — look at that face.","url":"https://www.nbcnews.com/news/know-it-all/know-it-all-mondays-top-stories-nbc-news-n125791"}
