{"authors":[],"date_download":"2018-10-22 21:07:06","date_modify":"2018-10-22 21:07:06","date_publish":"2014-05-06 00:44:36","description":"From terror in Nigeria to more violence in Ukraine, see the stories we're following.","filename":"data/vaneerConsumption/KNOWITALLTuesdaysTopStoriesatNBCNews.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/422481/140506-donetsk-0713_b2b4f791b95658ce6b1594e14a379661.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_know-it-all_know-it-all-tuesdays-top-stories-nbc-news-n97766_1540242426.html","title":"KNOW IT ALL: Tuesday's Top Stories at NBC News","title_page":"KNOW IT ALL: Tuesday's Top Stories at NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGood morning, and happy Tuesday. Here are some of the stories we're following today:\n1. Threat from terror group to sell Nigerian girls could come to be\nIn a video that surfaced Monday, the leader of the terrorist group Boko Haram threatened to sell the secondary school girls the group kidnapped on April 15. More than 200 girls were abducted, and reports circulated last week that some may have already been sold into marriages for as little as $12. Experts told NBC News that Nigeria has a thriving human trafficking market, meaning the captors' horrifying threats may not be empty. Read more in NEWS.\n2. At least 34 killed in battle over Ukraine’s Slovyansk\nThirty or more pro-Russian separatists were killed by Ukrainian forces trying to regain the city of Slovyansk on Monday. At least four Ukrainian troops were also killed in the violence, and another 20 were injured. The area is one of several towns or cities in Donetsk and the surrounding region that was seized by armed groups demanding closer ties with Russia last month. Read more in NEWS.\n3. Civilian diver dies searching for ferry disaster victims\nThe South Korean ferry that sank on April 16 left 240 confirmed dead, as divers continue to search within the submerged vessel for 40 who are still missing. A 53-year old civilian diver died Tuesday in those search efforts when he lost consciousness shortly after entering the water. Murky waters, floating debris and rough weather have made the diving conditions difficult and the recovery efforts slow. Read more in NEWS.\n4. Snapped clamp caused circus accident\nThe circus apparatus that came crashing down on Sunday night, leaving eight acrobats and a circus performer below injured, malfunctioned because a single steel ring broke. The reason that the ring — with the supposed capability to hold 10,000 pounds — broke is still under investigation. Four of the acrobats are in serious condition and four are in good condition. Read more in NEWS.\n5. Spy plane causes in-air traffic jam\nThe Federal Aviation Administration confirmed that a Cold War-era U-2 spy plane confused air traffic control computers when it passed through Southern California airspace last week. While the U-2 was flying at 60,000 feet, the computers were trying to keep it from interfering with planes flying miles below. The computer system overloaded, resulting in an hour-long ground stop. Delays and cancellations ensued. Read more in INVESTIGATIONS.\n6. Climate report due from White House today\nThe White House will release a 1,300-page National Climate Assessment on Tuesday that will likely outline what other climate reports this year have highlighted: the Earth's climate is undergoing a rapid transition, largely due to industrial activity. Climate activists are ready to use the report to raise awareness and make their case for a change in the way humans are treating the earth, while climate skeptics are already primed to dispute it. Read more in ENVIRONMENT.\n... What's trending today?\nThis one's for Gary Busey. While researchers have yet to determine whether talking to inanimate objects is beneficial, it turns out, talking to yourself can be — if you do it the right way. Researchers say \"self-talk\" is more common than we may think and have tips for how to use what may have once been considered crazy to your benefit.","url":"https://www.nbcnews.com/news/know-it-all/know-it-all-tuesdays-top-stories-nbc-news-n97766"}
laimed more than 300 lives. The sight of Capt. Lee Joon-seok prompted cries of “murderer” from the audience. One relative held up a sign that read, “You are not human. You are beneath animals.” Read more in NEWS.\n7. Final countdown: Is Brazil ready for the World Cup?\nWith the start of the World Cup just days away, gang violence, protests and city-wide strikes threaten to disrupt Brazil's preparations. The host nation opens the month-long tournament on Thursday, facing off with Croatia in Sao Paulo. Watch more in NEWS.\n… What’s trending today?\nOne town isn’t big enough for two people with tight white pants.\n“Tonight Show” host Jimmy Fallon faced off with Jennifer Lopez during Monday night’s show over who can wear their hip-huggers better. It was an easy win for one of them.","url":"https://www.nbcnews.com/news/know-it-all/know-it-all-tuesdays-top-stories-nbc-news-n127136"}
