{"authors":[],"date_download":"2018-10-22 21:26:18","date_modify":"2018-10-22 21:26:18","date_publish":"2014-05-07 10:30:33","description":"A frightening report on climate change, a firsthand report on the Nigeria kidnappings and an eye-popping IPO are among the stories we're following.","filename":"data/vaneerConsumption/KNOWITALLWednesdaysTopStoriesatNBCNews.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/425436/140507-alibaba-office-7a_5e75fa7de96f64d799aef67eeb1677d7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_know-it-all_know-it-all-wednesdays-top-stories-nbc-news-n99006_1540243578.html","title":"KNOW IT ALL: Wednesday's Top Stories at NBC News","title_page":"KNOW IT ALL: Wednesday's Top Stories at NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nGood morning and happy Wednesday. Here are some of the stories NBC News is following today:\n1. Doomsday everywhere\nIt’s bad, and it’s already happening: A White House report says climate change is already touching the entire United States. If it goes unaddressed, the report says, the results could include killer heat waves and floods in the Northeast, toxic algae in the Great Lakes and more devastating fires out West. Read the predictions for all 50 states in NEWS.\n2. Nigeria kidnappings: One girl’s story\nThe United States is promising to help authorities in Nigeria find almost 300 schoolgirls abducted last month by Islamic terrorists. A 16-year-old girl who was free described the ordeal: Armed men in uniforms burst into the school dorm and promised, “Nothing is going to happen to you.” Then they started shouting, “Allahu Akhbar! (God is great!)” she said, “And we knew.” Read more in NEWS.\n3. Bigger than Amazon, and then some\nThe Chinese e-commerce company Alibaba is going public, and new paperwork sheds light on just how big the company is. Think of it as a Chinese Amazon, eBay and PayPal all in one. It raked in a quarter-trillion dollars in revenue last year and handled more than 11 billion orders. Financial analysts say it could be the biggest stock offering in American history. What you need to know about the IPO in TECH.\n4. Hotel boycott expands\nEllen Degeneres, Jay Leno, Sharon Osbourne and Virgin CEO Richard Branson are among the celebrities boycotting the Dorchester hotel chain over its owner’s ties to the introduction of Sharia law in Brunei. The chain includes the storied Beverly Hills Hotel in Los Angeles. Read more on the boycott, and what the city is planning to do about it, in NEWS.\n5. Wheel-well stowaway captured on video\nNBC News has obtained airport security footage showing the teenager who apparently holed up in the wheel well of a plane and made it from San Jose, Calif., to Hawaii. The video shows the teen dropping onto the tarmac at the airport in Maui, then wobbling around the jet. His father says he was trying to get to his mother, who lives in Ethiopia. Watch the video in NEWS.\n6. She’s baaaaa-aack\nMonica Lewinsky says she deeply regrets her affair with President Bill Clinton but wants to move on. “It’s time to burn the beret and bury the blue dress,” she writes in a piece for Vanity Fair: “Let me say it again: I. Myself. Deeply. Regret. What. Happened.” Lewinsky also says she was troubled by Hillary Clinton’s impulse to blame herself, at least in part, for her husband’s extramarital exploits. Get the full story from NIGHTLY NEWS.\n… What’s trending today?\nMichael Jordan opens up in a new biography about how racial obstacles early in life shaped the drive behind his phenomenal NBA career. Jordan describes entrenched racism in the part of North Carolina where he grew up, and being suspended from school in 1977 after he threw a soda at a girl who called him the n-word. “I was really rebelling,” he says. “Basically, I was against all white people.” Read more in POP CULTURE.","url":"https://www.nbcnews.com/news/know-it-all/know-it-all-wednesdays-top-stories-nbc-news-n99006"}
e fall, which I know is gonna change my life,” Clinton said in a wide-ranging interview on “NBC Nightly News” on Tuesday. Clinton spoke on a variety of topics, from her upcoming role as grandmother to Edward Snowden to Karl Rove questioning her health. Clinton’s latest book, “Hard Choices,” was released Tuesday. Read more in POLITICS.\n… What’s trending today?\nA Georgia man stuck overnight at Las Vegas’ McCarran International Airport was all by himself — and had a little fun with it.\nRichard Dunn decided to lip-synch to Celine Dion’s cover of “All By Myself” in the deserted airport. And because he was all by himself, he had to record himself by mounting his cellphone to a wheelchair and his suitcase handle.\nIn one scene, he was all by himself on an elevator and had to get creative with shooting.\n“For the escalator shot I had to sprint up the steps after I got my shot so the computer bag didn't hit the top and fall back down,” he wrote on Vimeo. “Quite fun!”","url":"https://www.nbcnews.com/news/know-it-all/know-it-all-wednesdays-top-stories-nbc-news-n128191"}
