{"authors":["Associated Press"],"date_download":"2018-10-23 02:18:24","date_modify":"2018-10-23 02:18:24","date_publish":"2017-03-16 12:49:20","description":"YANGON, Myanmar (AP) - A commission chaired by former U.N. Secretary-General Kofi Annan recommended Thursday that Myanmar's government allow aid workers and...","filename":"data/vaneerConsumption/KofiAnnancallsonMyanmartoallowaccesstotroubledarea.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320096_Kofi-Annan-calls-Myanmar-allow-access-troubled-area_1540261104.html","title":"Kofi Annan calls on Myanmar to allow access to troubled area","title_page":"Kofi Annan calls on Myanmar to allow access to troubled area | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"YANGON, Myanmar (AP) - A commission chaired by former U.N. Secretary-General Kofi Annan recommended Thursday that Myanmar's government allow aid workers and journalists free access to an area in the country's west where security forces are accused of major human rights abuses against the Muslim Rohingya minority.\nAnnan spoke in a video shown at a news conference in Yangon, where his commission issued its interim recommendations for long-term solutions to conflict between Muslim Rohingya and Rakhine Buddhists in Rakhine state. The commission was established last year at the behest of Myanmar's leader, Aung San Suu Kyi.\nThe Rohingya face severe discrimination in Buddhist-majority Myanmar and were the targets of inter-communal violence in 2012 that killed hundreds and drove about 140,000 people - predominantly Rohingya - from their homes to camps for the internally displaced, where most remain.\nThe army launched counterinsurgency operations in Rohingya areas in northern Rakhine last October after the killing of nine border guards. U.N. human rights investigators and independent rights organizations charge that soldiers and police killed and raped civilians and burned down more than 1,000 homes during their operations.\nAnnan said there should be an independent and impartial investigation of the attacks on the border guards and subsequent \"crimes.\"\n\"We strongly believe that perpetrators of these crimes must be held to account,\" he said.\nThe commission's call for an investigation falls short of what has been recommended by the U.N.'s special envoy for human rights in Myanmar, Yanghee Lee, who seeks an international inquiry.\nThe report by Annan's commission explained that interim findings were being released to address urgent issues \"in order to ward off any further violence while also laying the groundwork for a more peaceful and prosperous future.\" The final report is to be issued later this year.\nThe commission was directed to submit recommendations to the government on how it could promote reconciliation, strengthen local institutions, advance development, resolve conflict and provide humanitarian aid in Rakhine state.\n\"The commission is not mandated to investigate specific alleged human rights violations,\" the report cautioned. \"Rather, it seeks to address institutional and structural issues which undermine the prospects for peace, justice and development in Rakhine, and to propose concrete steps that may contribute to improving the well-being of all communities in the state.\"\nA statement issued by Suu Kyi's office several hours after the report's release said the government concurs with its recommendations.\n\"The large majority of the recommendations will be implemented promptly with a view to maximum effectiveness. The implementation of a few will be contingent upon the situation on the ground but we believe there will be speedy progress,\" it said.","url":"https://www.dailymail.co.uk/wires/ap/article-4320096/Kofi-Annan-calls-Myanmar-allow-access-troubled-area.html"}
