{"authors":["Brian Viner For The Daily Mail"],"date_download":"2018-10-22 23:08:41","date_modify":"2018-10-22 23:08:41","date_publish":"2017-03-10 01:58:21","description":"Kong: Skull Island is feebly plotted and scripted, monkeying around with the story, BRIAN VINER says in his review of the film, starring Tom Hiddleston and Brie Larson.","filename":"data/vaneerConsumption/KongSkullIslandisadisappointmentsaysBrianViner.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3DD68E6D00000578-0-image-a-54_1489111086140.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299756_Kong-Skull-Island-disappointment-says-Brian-Viner_1540249721.html","title":"Kong: Skull Island is a 'disappointment' says Brian Viner","title_page":"Kong: Skull Island is a 'disappointment' says Brian Viner | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kong: Skull Island (12A)\nVerdict: A gigantic disappointment\nRating:\nMore than eight decades have passed since former Mail war correspondent Edgar Wallace created King Kong, but still the giant ape exerts a fierce grip on the collective imagination.\nWhat a shame, then, that Kong: Skull Island is so feebly plotted and scripted, monkeying around with the story and, in the biggest misjudgment of all, revealing Kong in all his hairy majesty even before the opening credits.\nThe picture begins on a remote Pacific island with a wartime confrontation between two airmen — one American, the other Japanese — who have parachuted out of their stricken planes.\nBut, soon, they are distracted from the business of killing each other by the great beast itself, an idiotic move by director Jordan Vogt-Roberts and his band of screenwriters.\nKong: Skull Island is feebly plotted and scripted, monkeying around with the story, Brian Viner says in his new review\nThey include Dan Gilroy, who wrote and directed the captivatingly tense 2014 thriller Nightcrawler and really ought to know better.\nAnyway, with the suspense of Kong's entrance shattered before some folk in the audience have even started tucking in to their popcorn, we then skip forward to 1973.\nIt is shortly before the Fall of Saigon and, in some ways more significantly, just after the rise of Black Sabbath.\nA Seventies soundtrack that also includes David Bowie and Jefferson Airplane is probably the best thing about this film, notwithstanding the presence of Samuel L. Jackson, John Goodman, Brie Larson, Toby Kebbell and a hopelessly miscast Tom Hiddleston.\nBut the point of the setting is not only to facilitate good music. America, reeling from the Vietnam War and with Watergate brewing, is in turmoil.\nTo make matters worse, ships and planes are unaccountably going missing in the Pacific, so a fellow played by Goodman who specialises in finding 'massive unidentified terrestrial organisms' — every government should have one — gets the go-ahead to see whether, lurking at the heart of the mystery, there might be a creature the size of a skyscraper. And guess what . . ?\nThe muscle for his expedition is provided by maverick U.S. Army man Preston Packard (Jackson) and his unit, who have axes to grind since being given the runaround by the Viet Cong.\nBut they still need someone who knows his way through an impenetrable rainforest. Enter former SAS hero James Conrad (Hiddleston), whom we know to be rock-hard because, in time-honoured bad-movie fashion, we've seen him beating someone up in a bar.\nNow, Hiddleston has already proved himself as this kind of character, not least in acclaimed BBC drama The Night Manager. Yet here, in this Pacific archipelago, he is all at sea.\nViner says that Tom Hiddleston (pictured) is wildly miscast in his role of former SAS hero James Conrad\nAlongside Jackson in particular, who gives us his standard, mildly deranged alpha-male act, Hiddleston just seems fey, like a posh, faintly camp sommelier who has blundered into the wrong movie.\nMaybe that's why he musters barely a test tube's worth of chemistry with the obligatory love interest, Mason Weaver (Larson). She is a photographer, although not a very good one, judging by her insistence on taking pictures of this wildly colourful, just-discovered island in black and white.\nShe might look cute clutched in a large, leathery palm once we discover Kong is actually a sweetie at heart, but she'll never get a picture spread in National Geographic. So much for the human protagonists — what of the furred, feathered and scaled cast members?\nThis is an island that could sustain an entire David Attenborough series all on its own.\nKong's neighbours include monumental chickens, enormous spiders, vast stick insects and, most dangerous of all, colossal lizards, Kong's sworn enemies, led by an especially big one known, conveniently, as the Big One.\nIn fairness, Vogt-Roberts does not waste all the special effects and motion capture bells and whistles at his disposal: the creatures are brought to life convincingly.\nBut what a disappointing film this is, all the same. There are deliberate echoes of Apocalypse Now and Jurassic Park, but they ring terribly hollow.\nThere's scarcely any tension, no exciting narrative thrust and rather painfully strained attempts at humour, even by the always excellent John C. Reilly — whose character I won't divulge, just in case you really don't have anything better to do on Sunday afternoon.\nBut I hope you do. In fact, you could fare a lot worse than staying at home and watching the DVD of The Hobbit director Peter Jackson's 2005 remake of King Kong. It is superior in every way.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299756/Kong-Skull-Island-disappointment-says-Brian-Viner.html"}
