{"authors":["Associated Press"],"date_download":"2018-10-22 23:04:49","date_modify":"2018-10-22 23:04:49","date_publish":"2016-01-28 11:40:53","description":"MELBOURNE, Australia (AP) — The extent of what she accomplished at the Australian Open hasn't fully sunk in, but Johanna Konta expects it will when she retur...","filename":"data/vaneerConsumption/KontamadeBritishhistoryinAustraliaheadshomeproud.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:f6ffb166bd7b4cf5b591d7cb13321dbd-4vVdYopwYQ7f641721b07acacbc2-386_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420763_Konta-British-history-Australia-heads-home-proud_1540249489.html","title":"Konta made British history in Australia, heads home proud","title_page":"Konta made British history in Australia, heads home proud | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Konta made British history in Australia, heads home proud\nMELBOURNE, Australia (AP) — The extent of what she accomplished at the Australian Open hasn't fully sunk in, but Johanna Konta expects it will when she returns home to England.\nThe 24-year-old Konta's strong run at Melbourne Park became big news back home and Down Under when she became the first British woman to reach a Grand Slam semifinal since 1983.\nThat run ended Thursday, when No. 7 Angelique Kerber beat her 7-5, 6-2 for a chance to play No. 1 Serena Williams in the final.\nJohanna Konta of Britain plays a forehand return to Angelique Kerber of Germany during their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Andrew Brownbill)\nKonta emerged from the defeat saying she felt proud, carrying the positive energy and composure she had displayed on court into her post-match news conference.\n\"I really enjoyed my experience out there,\" said Konta, who was ranked 47th and is motivated by challenges. \"At this level, you're constantly being tested. Whoever you're playing, your limits are constantly being pushed. I'm really happy how I was able to keep pushing my threshold.\"\nThat could all change, of course, when she gets back home to England.\n\"When I go home, when my mom will say, 'Oh, you're calm.' It will come out more,\" she joked.\nKonta's story was the type that tennis fans never tire of — the talented but unnoticed player who seemingly comes out of nowhere to beat a champion.\nKonta was playing in the main draw at the Australian Open for the first time, after losing in qualifying rounds for the previous three years.\nIn the first round, she stepped onto the biggest stage at the Australian Open, Rod Laver Arena, and beat seven-time Grand Slam winner Venus Williams in straight sets.\nShe won over the crowds with her athletic, chase-every-ball style, squatting into her forehands and backhands for extra power. She became a local favorite when Melbourne Park fans learned she had been born in Sydney, Australia to Hungarian parents and moved as a teen to England, where she obtained citizenship in 2012.\nWhen Konta made it to the quarterfinals, the tennis establishment in Britain erupted with headlines about her historic success. She became the first British woman since Jo Durie in 1983 to get that far in a Grand Slam.\nBritain will now have to wait for its first female player to reach a Grand Slam final since Virginia Wade in 1977.\nBut it appears to have a rising star on the female side, perhaps, to keep Andy Murray company in the second week of the majors.\nOften, players set a goal to break into the Top 20, or reach a certain number in the rankings.\nNot Konta.\n\"I don't look at myself in the mirror and say, 'You're number this in the world. That's not how I view my career and life,\" Konta said. \"If I'm accomplishing ... what I would like to accomplish, then I go home happy.\"\nJohanna Konta of Britain waves as she leaves Rod Laver Arena after her semifinal loss to Angelique Kerber of Germany at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Vincent Thian)\nJohanna Konta of Britain plays a backhand return to Angelique Kerber of Germany during their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Thursday, Jan. 28, 2016.(AP Photo/Vincent Thian)","url":"https://www.dailymail.co.uk/wires/ap/article-3420763/Konta-British-history-Australia-heads-home-proud.html"}
