{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 20:44:50","date_modify":"2018-10-22 20:44:50","date_publish":"2016-01-28 03:24:49","description":"The 36-year-old stunner looked in fine form indeed as she flaunted her wares in a see-through top while heading into the studio, which was packed to the rafters with top showbiz names.","filename":"data/vaneerConsumption/KourtneyKardashianwearscollarandplungingnecklineatKocktailsWithKhloetaping.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/03/30A6838400000578-0-image-a-4_1453952093383.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420303_Kourtney-Kardashian-wears-racy-collar-plunging-neckline-attends-Kocktails-Khloe-taping_1540241090.html","title":"Kourtney Kardashian wears collar and plunging neckline at Kocktails With Khloe taping","title_page":"Kourtney Kardashian wears collar and plunging neckline at Kocktails With Khloe taping | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She has always been regarded as one of the more low-key members of the Kardashians.\nBut Kourtney sexed up her image by combining a racy collar with a plunging neckline as she attended a taping of Kocktails With Khloe in Los Angeles on Wednesday.\nThe saucy stunner looked in fine form indeed as she flaunted her wares in a see-through top while heading into the studio, which was packed to the rafters with top showbiz names.\nScroll down for video\nThe collar duty: Kourtney Kardashian combined a racy choker with a plunging neckline as she attended a Kocktails With Khloe taping in Los Angeles on Wednesday\nKourtney, who is the only Kardashian sister with a university degree, looked in fine form indeed in her racy leather jacket, sheer lace top and flares, though it was her collar that really caught the eye.\nThe 36-year-old single mum has been busy since leaving her long-term partner Scott Disick, and was even rumoured to be involved in a passionate affair with pop pixie Justin Bieber.\nShe even blushed as she unconvincingly attempted to deny it during an appearance on The Ellen DeGeneres Show this week.\nKourtney and Scott split last summer after photos emerged of him canoodling with stylist Chloé Bartoli in Monaco.\nUnleashed: She may have been going for a S&M-inspired look after twinning her collar with a leather jacket\nA flare for fashion: Kourtney also showcased her physique in wide-leg trousers, teamed with sky high heels\nBust on show: She seemed pleased with her revealing sheer top she posted a close-up on Instagram\nWho's that girl? Kylie Jenner was looking uncharacteristically classy as she headed into the studio\nRegular guest: Kylie seems to be at the studio almost every day recordings for the FYI show take place\nIt brought to an end a nine-year relationship that has spawned three children - Mason, six, Penelope, three, and 13-month-old Reign.\nNo doubt she would be expanding on comments she made on The Ellen DeGeneres Show about her relationship with her ex.\nWhen Ellen asked the star about how things were going with her man she replied: 'Well, we're not together, I feel like every day is different.\nBag lady: Kourtney was carrying a holdall when she finally left the studio\nSheer delight: Kourtney looked good enough to eat as she headed out for dinner in West Hollywood\nKlowning with Kourtney: Taping an interview with her sister seemed to have put her in a good mood\n'But, we're totally getting along, we have three beautiful kids together. He's family, he'll always be.'\nScott has just made an appearance on the show, and insisted his current focus in life is being a good father for their children.\nIt had been claimed Kocktails With Khloe was struggling to attract guests from outside her family circle, but that may be a thing of the past after pop culture icons Diddy and Snooki were spotted at the studio.\nThe January 20 premiere of the primetime talk show earned record ratings for FYI.\nFront runner: She seemed to relish showing off her charms as she headed off for her meal\nFull belly: Kourtney was later spotted doing a stellar job of sucking it in as she left with a friend following her meal at trendy restaurant Craig's\nReturn of the Diddyman: Perhaps the cheesed off music mogul had just learned he was appearing on the show\nThe network’s first live-to-tape talk show with host Kardashian posted triple digit gains in Live+3 across key demos, becoming the network’s most-watched series premiere ever.\nThe hour-long series premiere delivered 496,000 total viewer. with 313,000 in the coveted 18 to 49 bracket according to the channel and Nielsen.\nAlso spotted arriving for the taping were Kylie Jenner, who wore a baggy grey jumpsuit and lace boots, Snooki and Diddy.\nAll the big names: Rumours the show is struggling to attract guests seem wide of the mark after pop culture icon Snooki was spotted at the studio\nBet this won't be a Jersey bore: The MTV favourite will have had plenty of wild tales for her appearance","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420303/Kourtney-Kardashian-wears-racy-collar-plunging-neckline-attends-Kocktails-Khloe-taping.html"}
