{"authors":["Kayla Caldwell For Dailymail.Com"],"date_download":"2018-10-23 05:42:01","date_modify":"2018-10-23 05:42:01","date_publish":"2016-01-29 21:26:42","description":"The 36-year-old was spotted heading into Sugarfish Sushi with a friend but opted not to say hi to her ex who was nearby at Toscanova with their children Mason and Penelope.","filename":"data/vaneerConsumption/KourtneyKardashianavoidsbumpingintoexScottDisickandthekidsthoughbothgrabbeddinneratTheCommonsinCalabasas.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/20/30B5327500000578-0-image-a-4_1454099660091.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423409_Kourtney-Kardashian-avoids-bumping-ex-Scott-Disick-kids-grabbed-dinner-Commons-Calabasas_1540273321.html","title":"Kourtney Kardashian avoids bumping into ex Scott Disick and the kids though both grabbed dinner at The Commons in Calabasas","title_page":"Kourtney Kardashian avoids bumping into ex Scott Disick and the kids though both grabbed dinner at The Commons in Calabasas | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Though she normally plays the doting mother-of-three, Kourtney Kardashian was in need of a girls' night on Thursday.\nThe 36-year-old was seen heading to Sugarfish sushi with a pal at the Calabasas Commons on Thursday night.\nBut on her way to dinner, the E! star passed her ex Scott Disick who had just dined with their kids Mason, six, and Penelope, three, at Toscanova in the same mall. According to onlookers, the beauty passed the former party boy and didn't so much as wave.\nScroll down for video\nTable for three! Scott Disick took Mason and Penelope for dinner at Toscanova in Calabasas on Thursday as ex Kourtney had a girls' night\nMe time! The mother-of-three avoided running into her ex as she also hit The Commons in Calabasas, instead opting to grab dinner at Sugarfish Sushi with a friend\nKourtney wore a loose-fitting white blouse, which featured a plunging front that revealed a bit of the star's white bra.\nShe sported the collared top with the sleeves rolled just past her wrists, and coupled the look with a pair of black, leather trousers. And the reality diva accessorized with a coordinating black belt, and also donned a pair of black heeled boots for the outing.\nHer long, raven tresses were worn in a center part, and styled in soft curls that cascaded past her shoulders.\nSee Kourtney Kardashan updates as she avoids bumping into ex Scott Disick\nChic: Kourtney showed off her fashion credentials in a plunging white blouse, which she sported tucked into a pair of black leather trousers\nKourtney showed off a bit of a smoky eye for the outing, and balanced it with a softer, pink lipstick as she stepped out with a friend.\nMeanwhile, Scott looked more laid-back in a navy blue sweatshirt, worn with a pair of light grey skinny jeans.\nThe 32-year-old finished off the comfortable look with a pair of low-top white sneakers as he carried daughter Penelope.\nLaid-back: Scott, meanwhile, kept comfortable in a navy blue sweatshirt, grey skinny jeans, and white sneakers\nShe was bundled up in a black sweatshirt, which coordinated with a pair of black and white polka dot sweatpants and two-toned sneakers.\nThe father-of-three was also spotted walking hand-in-hand with his son Mason, who looked comfortable in a long-sleeved, grey T-shirt, coordinating trousers, and black sneakers.\nPerhaps Kourtney felt bad about the slight as the following day the reality star took to her Instagram page to share a throwback photo of her and Scott.\nThrowback: Kourtney may have felt bad for the diss as the following day she took to Instagram to share this flashback photo, writing: 'with the baby daddy before he was a baby daddy'\n'#FBF with the baby daddy before he was a baby daddy,' she wrote, alongside an old snap of her and her ex - with whom she split this past July after nine years together.\nThe two can be seen showing off smiles as they sit side-by-side in a restaurant together some years ago.\nSince then, things have become substantially more difficult for Scott, who checked out of his fifth stint in rehab at Cliffside in Malibu in the fall. He has continued to shoot scenes for Keeping Up With The Kardashians with Kourtney's mother Kris, 60.\nGetting along: The Keeping Up with the Kardashians star recently appeared on The Ellen DeGeneres Show, where she shared of her ex: 'We're not together, I feel like every day is different. But, we're totally getting along, we have three beautiful kids together. He's family, he'll always be'\nMeanwhile, Kourtney has been looking better than ever after consistent gym sessions and a new, healthier diet.\nWhile on The Ellen DeGeneres Show on Monday, Kourtney explained how she is no longer seeing Scott.\n'We're not together, I feel like every day is different. But, we're totally getting along, we have three beautiful kids together. He's family, he'll always be.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423409/Kourtney-Kardashian-avoids-bumping-ex-Scott-Disick-kids-grabbed-dinner-Commons-Calabasas.html"}
