{"authors":["Justin Enriquez For Dailymail.Com"],"date_download":"2018-10-22 22:05:19","date_modify":"2018-10-22 22:05:19","date_publish":"2017-03-16 02:33:29","description":"The 37-year-old reality star looked absolutely fantastic while on a shopping trip in Los Angeles on Wednesday.","filename":"data/vaneerConsumption/KourtneyKardashianrocksbodysuitandGuccijoggerpants.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/02/3E5004EA00000578-0-image-a-72_1489629843842.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318630_Kourtney-Kardashian-rocks-bodysuit-Gucci-jogger-pants_1540245919.html","title":"Kourtney Kardashian rocks bodysuit and Gucci jogger pants","title_page":"Kourtney Kardashian rocks bodysuit and Gucci jogger pants | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It has recently been revealed that her ex Scott Disick admitted to being a sex addict.\nAnd Kourtney Kardashian seems to be addicted to something else that starts with an 's'.\nThe 37-year-old reality star looked absolutely fantastic while on a shopping trip in Los Angeles on Wednesday.\nKeeping cool: Kourtney Kardashian was spotted out and about in Los Angeles on Wednesday\nThe mother-of-three flaunted her fantastic figure in a clinging white bodysuit for the occasion.\nAs if that wasn't enough she also sported a pair of blue, red, and white wool and silk Gucci jogger pants.\nThe flowy trousers featuring a striped design down the side featured gold-buttons as they retail for just under $2000.\nLooking good: The 37-year-old reality star flaunted her fantastic figure in a clinging white bodysuit for the occasion\nStunner: Her raven-colored tresses were worn down flowing over her shoulders as she let her natural looks show with complimentary make-up including a swipe of shiny pink lip\nGorgeous: Kourtney accessorised the look with a pair of retro-styled shades along with a white leather designer bag\nLike what you see? She enjoyed some shopping on the outing\nPerusing: She looked to be picking up a few things for her home\nSweet ride: The Keeping Up With The Kardashians star also had some hot wheels as she drove around in her gunmetal grey Ashton Martin\nKourtney accessorised the look with a pair of retro-styled shades along with a white leather designer bag.\nHer raven-colored tresses were worn down flowing over her shoulders as she let her natural looks show with complimentary make-up including a swipe of shiny pink lip.\nThe Keeping Up With The Kardashians star also had some hot wheels as she drove around in her gunmetal grey Ashton Martin.\nBusy day: Earlier in the days he was joined by half-sister Kendall and mother Kris Jenner for lunch at restaurant inside Whizin Market in Agoura Hills, California\nPatriotic: She sported a pair of blue, red, and white wool and silk Gucci jogger pants\nPricey: The flowy trousers featuring a striped design down the side featured gold-buttons as they retail for just under $2000\nEarlier in the day she was joined by half-sister Kendall and mother Kris Jenner for lunch at restaurant inside Whizin Market in Agoura Hills, California.\nKendall, 21, looked fantastic in yellowwide leg flowing pants which cinched high on the waist which created a ruffle from her own Kendall + Kylie collection.\nKris kept it casual in an all-black ensemble as she enjoyed the meal bonding with her daughters.\nNot so mellow yellow: Kendall, 21, looked fantastic in yellowwide leg flowing pants which cinched high on the waist which created a ruffle from her own Kendall + Kylie collection\nLovely in lace: She also sported a silk cami while followed by mother Kris\nDark side: The 61-year-old matriarch sported all-black\nThe trip comes just days after the explosive Keeping Up With The Kardashians trailer in which on/off partner Scott Disick admitted to being a sex addict.\nThis all came to a head when longtime partner and mother to his three children, Kourtney Kardashian, had caught him sneaking another girl into a hotel room while on their vacation in Costa Rica.\nNext Scott could be heard raising his voice while trying to explain what happened as he exclaimed: 'I'm a sex addict!'\nBig revelation: The outing comes just days after Scott Disick said he was a 'sex addict' in the latest Keeping Up With The Kardashians teaser released on Thursday\n'She's the love of my life': It seemed like Scott and Kourtney could have been on the verge of reconciliation\nWow factor: Kourtney showed off her fantastic figure in a black bikini as she looked adoringly at Scott","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318630/Kourtney-Kardashian-rocks-bodysuit-Gucci-jogger-pants.html"}
