{"authors":["Heidi Parker For Dailymail.Com"],"date_download":"2018-10-23 03:40:27","date_modify":"2018-10-23 03:40:27","date_publish":"2016-01-29 18:43:39","description":"The 36-year-old beauty posted a flashback photo to Instagram of the troubled 32-year-old reality star, who she split from in July. The photo looks to be at least nine years old","filename":"data/vaneerConsumption/KourtneyKardashiansharesflashbackphotoofScottDisickbeforepartyingtookitstoll.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4C78C00000578-0-image-a-26_1454092863339.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423213_Kourtney-Kardashian-shares-flashback-photo-Scott-Disick-partying-took-s-toll-calls-baby-daddy_1540266027.html","title":"Kourtney Kardashian shares flashback photo of Scott Disick before partying took it's toll","title_page":"Kourtney Kardashian shares flashback photo of Scott Disick before partying took it's toll | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kourtney Kardashian acknowledged her ex Scott Disick on Friday.\nThe 36-year-old beauty posted a flashback photo to Instagram of the troubled 32-year-old reality star, who she split from in July.\nThe photo looks to be around nine years old, and both appear happy and carefree as he gently caresses her hand while they sit side-by-side at a restaurant.\nScroll down for video\nBack in the day: Kourtney Kardashian acknowledged her ex Scott Disick on Friday. The 36-year-old beauty posted a flashback photo to Instagram of the troubled 32-year-old reality star, who she split from in July\nWhat a difference a few years make! The two looked very different in May 2015\nThe caption the E! star wrote is particularly noteworthy as she calls him a 'baby daddy,' making it seem as if all he ever gave her were children.\nTogether they have three kids: Mason, aged six, Penelope, aged three, and Reign, aged one.\n'With the baby daddy before he was a baby daddy,' she wrote.\nThe years have changed him: Scott about nine years ago (left) and in 2015 (right)\nThere is a mixed drink in front of them, but it is not clear who the beverage belongs to.\nScott is almost unrecognizable. Not only is the frown he has been wearing for the past year gone, but he also looks like the picture of health.\nAnd the New York native, who now wears a scruffy beard, has a clean-shaven face and slicked back hair, making him look more preppy than post-rehab.\nApart but together: Kourtney and Scott with Mason and Penelope on January 3 in LA\nScott checked out of his fifth stint in rehab at Cliffside in Malibu in the fall. He has continued to shoot scenes for Keeping Up With The Kardashians with Kourtney's mother Kris, 60.\nMeanwhile, Kourtney has been looking better than ever after consistent gym sessions and a new, healthier diet.\nThe star showed off her curves again on Wednesday in a lacy top and fitted slacks at West Hollywood's The Nice Guy, where her rumoured fling Justin Bieber also made an appearance.\nHot mama! Kourtney looked undeniably sensational as she stepped out for a girls' night in West Hollywood on Wednesday - where she barely missed bumping into former flame Justin Bieber\nJustin made his presence known not long afterwards, arriving in a big black SUV with white interior.\nThe 21-year-old pop star emerged from the back seat covered up in a grey beanie, beige hoodie and a green bomber jacket over black jeans.\nThe Sorry singer ducked his head as he dashed inside the hotspot with his entourage.\nThe ex of Selena Gomez also made a stop at Warwick nightclub in Hollywood with his partying pals.\nFeeling fine: Justin gave the thumbs up in front of The Nice Guy nightclub where he arrived about an hour after Kourtney left with her pal\nHow low can one go? The 36-year-old revealed a fair amount of her ample chest in a racy low-cut and almost entirely sheer blouse\nGirls' night: She clung to her pretty pal's arm as they left the restaurant, Kourtney showing off her petite, tight curves in the burgundy blouse and high-waisted wide-legged trousers\nThe morning after: Kourtney is seen in a camo hoodie as she kisses daughter Penelope on Thursday\nMore to say: Scott appeared on Khloe Kardashian's new show, Kocktails With Khloe, this week\nA new attitude? He told Kylie Jenner's boyfriend Tyga that making money does not bring him happiness and all he wants to do is 'calm down' and spend time with his three children\nWhile on The Ellen DeGeneres Show on Monday, Kourtney explained how she is no longer seeing Scott.\n'We're not together, I feel like every day is different. But, we're totally getting along, we have three beautiful kids together. He's family, he'll always be.'\nScott appeared on Khloe Kardashian's new show, Kocktails With Khloe, this week.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423213/Kourtney-Kardashian-shares-flashback-photo-Scott-Disick-partying-took-s-toll-calls-baby-daddy.html"}
