{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-22 23:41:55","date_modify":"2018-10-22 23:41:55","date_publish":"2017-04-26 08:28:19","description":"Unafraid of showing off her white bits, Kourtney was seen taking a dip on the Mexican coastline in a bright blue bikini this time, which served only to cover the essentials on Monday during the girls' break.","filename":"data/vaneerConsumption/KourtneyKardashiandisplaysunderboobinabluebikini.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9D0E9E00000578-0-image-a-18_1493190714134.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446532_Kourtney-Kardashian-displays-underboob-blue-bikini_1540251715.html","title":"Kourtney Kardashian displays underboob in a blue bikini","title_page":"Kourtney Kardashian displays underboob in a blue bikini | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"While sister Kim's voluptuous bottom threatens to break the internet again, Kourtney Kardashian is making a case for the major underboob look.\nUnafraid of showing off her white bits, Kourtney was seen taking a dip on the Mexican coastline in a bright blue bikini this time, which served only to cover the essentials.\nA mum-of-three with an age-defying summer body, the 38-year-old proved that an unsupportive bikini top makes absolutely no difference to the appearance of her perky assets.\nHoliday blues: The single mum-of-three wore a bright blue bikini with almost no support on the chest as she continued her wild vacation in Mexico with girlfriends\nKourtney, who has previously talked about having a boob job at 22, was no doubt leading a revolution in how to wear swimwear, after wearing the same look on Sunday.\nPreviously she tried the underboob display in scarlet red, yet the bikini top seemed even skimpier, threatening to free the nipple as she put on an energetic display.\nIn 2010, Kourtney said it was 'not a secret' that she'd had her boobs enhanced during her college years.\nBlue beauty: Kourtney looked ripped on the shoreline, showing off her athletic nature as she ran up and down\nIt is likely she has undergone revisions since her first surgery - implants usually need to be replaced every 10 years - and the brunette has since carried three children.\nKourtney has often talked about her boob job on Keeping Up With The Kardashians; being in her early twenties when she went under the knife the first time.\nBut Kourtney's busty bikini wasn't the only eye-popping element of her beach look because her abs, legs and arms were all enviably toned, thanks to her unrelenting fitness schedule.\nHow does she do it? A self-confessed fitness addict, the brunette has an astonishing mum bod\nWith the girls: Still seemingly separated from ex Scott Disick, Kourtney was enjoying some girl time\nA self-confessed gym addict, she maintains her fit form by doing grueling workouts with a personal trainer; the star often shares clips of her sessions to her Snapchat account.\nIn addition, the E! starlet follows a gluten free and dairy free diet, as seen on previous episodes of KUWTK.\nShe has spoken out about keeping her household stocked with items like coconut and almond milk as substitutes for dairy.\nKourtney also avoids sugar, specifically refined, and has divulged that she prefers organic and non-GMO groceries.\nNo holiday blues: Earlier this week, Kourtney was making a strong case for underboob once again","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446532/Kourtney-Kardashian-displays-underboob-blue-bikini.html"}
