{"authors":["Allyson Koerner"],"date_download":"2018-10-31 01:49:04","date_modify":"2018-10-31 01:49:04","date_publish":"2018-09-06 14:09:12","description":"The Kardashian-Jenner family doesn't have time for \"fake news.\" On Wednesday, Kourtney Kardashian shut down a rumor about Younes Bendjima and her sisters, Kim and Khloé Kardashian. In response to a Wednesday tweet posted by TMZ reading, \"Kardashian…","filename":"data/vaneerConsumption/KourtneyKardashianSlammedThisYounesBendjimaRumorByDefendingHerExSisters.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/dbc8626e-2483-4050-b3a8-a6a9193cd89f-getty-954810962.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_kourtney-kardashian-slammed-this-younes-bendjima-rumor-by-defending-her-ex-sisters-11771845_1540950544.html","title":"Kourtney Kardashian Slammed This Younes Bendjima Rumor By Defending Her Ex & Sisters","title_page":"Kourtney Kardashian Slammed This Younes Bendjima Rumor By Defending Her Ex & Sisters","title_rss":"NULL","source_domain":"bustle.com","text":"The Kardashian-Jenner family doesn't have time for \"fake news.\" On Wednesday, Kourtney Kardashian shut down a rumor about Younes Bendjima and her sisters, Kim and Khloé Kardashian. In response to a Wednesday tweet posted by TMZ reading, \"Kardashian Sisters Believe Younes Tipped Off Photogs About Kourtney Meet-Up,\" Kourtney retweeted it and wrote, \"FAKE NEWS.\"\nOn Sept. 5, TMZ released a report claiming Bendjima alerted the paparazzi about his Sept. 4 outing with Kourtney, which also sparked rumors that the two are back together. According to TMZ, sources told the publication that Kim and Khloé believed Kourtney and Bendjima being photographed in her car was set up by the model in order for him to achieve \"his last 15 minutes\" of fame.\nTMZ also reported that the Kardashians always thought Bendjima was alerting the paparazzi when he was still with Kourtney. The publication continued to claim that Kim and Khloé are happy Kourtney is no longer with the 25-year-old. However, according to Kourtney, the report is nothing but \"FAKE NEWS.\"\nOn Sept. 4, reconciliation rumors involving Kourtney and Bendjima began circulating. Us Weekly reported that they had \"some miscommunication,\" but \"they worked it out and are giving it another shot.\" (Bustle has reached out to Kardashian's agent for comment, but did not receive an immediate response.)\nOn Tuesday, the Daily Mail and TMZ both published photos of Kourtney and Bendjima in Malibu, where they reportedly picked up food at Bui for dinner. In the photos, you can see the two hanging out in what appears to be Kourtney's Range Rover SUV with Bendjima in the driver's seat.\nThe Daily Mail reported after driving on the Pacific Coast Highway, they parked somewhere and remained inside the car for \"several hours.\" Later, they reportedly grabbed more food at In-N-Out in Calabasas and then went back to the Keeping Up With the Kardashians star house.\nIn a different report published on Sept. 4, TMZ reported that Kourtney and Bendjima's recent get-together was reportedly \"all about closure.\" Per TMZ, Bendjima was the one seeking \"closure\" and Kourtney gave him the opportunity.\nA source also told Entertainment Tonight that Kourtney and Bendjima have been in communication since their split. \"The two caught up recently and talked about their breakup and relationship and where they stood,\" the source claimed. \"Kourtney and Younes had a great relationship and both are figuring out if it’s worth figuring out what is next for them.\"\nOn Aug. 7, TMZ reported Kourtney and Bendjima broke up after almost two years together. TMZ claimed the split was Kourtney's decision. At the time of the breakup report, TMZ also published photos of Bendjima with another woman in Mexico and labeled the images as \"rebound pics.\" (Bustle previously reached out to Kardashian's agent for comment, but did not receive an immediate response.)\nBendjima defended himself regarding the photos shared by TMZ. In response to a Daily Mail article claiming he was rebounding with the woman, Bendjima posted a screenshot of the post and wrote, \"They really want me to be the bad guy. F*ck your Hollywood bullsh*t (can't have friends no more.\" In a separate post, he wrote, \"I’m not attached to this 'life' so you can’t touch me. I know who I am where I’m from and where I’m going and that bothers you.\"\nAfter Bendjima's response, it appeared that Kim and Khloé Kardashian responded to his comments. They also reportedly defended Kourtney.\nKourtney and Bendjima have faced a lot of gossip since their recent hangout and breakup reports surfaced. Based on Kourtney's \"FAKE NEWS\" tweet, the reality star has made it clear that if or when she wants to respond to rumors, she will.","url":"https://www.bustle.com/p/kourtney-kardashian-slammed-this-younes-bendjima-rumor-by-defending-her-ex-sisters-11771845"}
