{"authors":["Heidi Parker For Dailymail.Com"],"date_download":"2018-10-23 03:56:44","date_modify":"2018-10-23 03:56:44","date_publish":"2017-04-26 15:34:39","description":"In the past few days the 38-year-old has posed in a bikini and even admitted to throwing up a few times in her bed from too much alcohol. Now she was getting silly.","filename":"data/vaneerConsumption/KourtneyKardashianstraddlesonherfriend.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA0153800000578-0-image-a-8_1493216894868.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4448028_Kourtney-Kardashian-straddles-friend_1540267004.html","title":"Kourtney Kardashian straddles on her friend","title_page":"Kourtney Kardashian straddles on her friend | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's a mother to three young children, but Kourtney Kardashian sure knew how to party up a storm during her trip to Mexico.\nIn the past few days the 38-year-old has posed in a bikini and even admitted to throwing up a few times in her bed from too much alcohol.\nAnd on Wednesday photos surfaced of Scott Disick's ex-partner sitting on a blonde female friend who is Kardashian family makeup artist Joyce Bonelli. The image was shared by pal Larsa Pippen.\nScroll down for video\nLike a teenager! Kourtney Kardashian sat on a blonde friend while in a hotel in Mexico this week; the image was shared by Larsa Pippen\nOuch: The female friend is Kardashian family makeup artist Joyce Bonelli\nKourtney wore a white bra top and sheer mini skirt with stars all over it.\nJoyce had on a metallic dress. At one point she put her hands over her private parts to hide them. It appeared as if she was not wearing lingerie.\nIt looked as if they were in their hotel room.\nLit: Kourtney was also seen dressed in a skimpy silver dress and even tried on a wide-brimmed hat as she had fun at the mini party which seemed to take place at her hotel\nKourtney was also seen dressed in a skimpy silver dress and even tried on a wide-brimmed hat as she had fun at the mini party which seemed to take place at her hotel.\nIn one shot a mariachi is seen in the background.\nHe looks like he is on the verge of doing an eye roll over the crazy party girls.\nYes, there's more: Here Kourtney showed off her chest as she took a 'siesta'\nIn case you missed the first shot: Later the siren shared this image with her top coming off\nBabes gone wild: The daughter of Kris Jenner by the pool in a leopard-print bikini\nThe reality TV star is currently on holiday with her sister Kim and some of her closest pals in the five-star resort of Casa Aramara, Punta Mita, where Kourtney has apparently been drinking far more than she's able to handle.\nKim wrote on Twitter: 'So I'm gonna give u guys a play by play of the trip so far.\nAnd she certainly did.\n'@kourtneykardash threw up in her bed 4 times and slept in it.'\nAnd after exposing Kourtney's drunken antics, Kim later added: 'Oh and @kourtneykardash won't stop doing naked cart wheels.'\nActing like a teenager: Kourtney 'threw up in her bed' and 'slept in it' while on vacation in Mexico; here she is seen receiving a sex toy from Joyce\nSlow down! The reality TV star is currently on holiday with her sister Kim and some of her closest pals in the five-star resort of Casa Aramara, Punta Mita, where Kourtney has apparently been drinking far more than she's able to handle\nSister spilled: Kim wrote on Twitter: 'So I'm gonna give u guys a play by play of the trip so far.' And she did\nOy: '@kourtneykardash threw up in her bed 4 times and slept in it,' reported Kim, 36\nThe TV star - who turned 38 on April 18 - admitted to drinking excessively during her belated birthday bash in Mexico.\nKourtney wrote on Twitter: 'I may or may not have thrown up four times last night and slept in it. #birthdayvibes (sic)'\nBut last week, Kim marked her sister's birthday by paying a glowing tribute to Kourtney.\nToo much: Kourtney wrote on Twitter: 'I may or may not have thrown up four times last night and slept in it. #birthdayvibes (sic)'\nShe wrote on her website: 'I'm so blessed to have you in my life. I love how close we were growing up - and still are today. I don't know what I would do without you! Love you!'\nKim also talked about her other pals.\n'@sarahrhoward tweaked her neck twerking (I will snap chat videos soon)\n'@jenatkinhair spiked my Oreo shake to try to get me to not eat it because she's fat shaming me.\nLooking better: The star in white at the Chateau Marmont on Thursday night\n'Nicole Reda had a 10 min black out & tried to fight @steph_shep\n'@BrittGastineau skinny dipped solo and then disappeared for the two days. (sic)'\nKim also revealed her close friend Larsa Pippen has been trying to lead her astray during their vacation in Mexico.\nShe wrote: '@larsapippen tried to give me a \"special\" brownie and I threatened to sue her & the chef (sic)'\nKim's tweets came shortly after Kourtney admitted to throwing up 'four or five times' during her post-birthday celebrations.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4448028/Kourtney-Kardashian-straddles-friend.html"}
