{"authors":["Lianna Brinded"],"date_download":"2018-10-30 21:18:02","date_modify":"2018-10-30 21:18:02","date_publish":"2016-12-21 00:00:00","description":"Financial institutions are sitting tight for now and are instead just devising contingency plans for the worst post-Brexit.","filename":"data/vaneerConsumption/KPMGGlobalChairmanJohnVeihmeyerBrexitCitycontingencyplanspassporting.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_kpmg-global-chairman-john-veihmeyer-brexit-city-contingency-plans-passporting-article-50-2016-12_1540934282.html","title":"KPMG Global Chairman John Veihmeyer: Brexit, City contingency plans, passporting","title_page":"    KPMG Global Chairman John Veihmeyer: Brexit, City contingency plans, passporting - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty One of the biggest concerns for the City of London is that some of the world's largest financial services will relocate staff and units to other parts of the European Union once Britain invokes a Brexit.\nHowever, John Veihmeyer, the global chairman of KPMG, one of the world's biggest accounting firms, told Business Insider that banks and financial institutions are sitting tight for now and are instead just devising contingency plans for the worst.\n\"I wouldn't say we are seeing a lot of companies that are aggressively and actively moving in that direction [relocating staff, units, or setting up subsidiaries] but companies that are sensitive to sector investment flows [due to the Single Market access and passporting], like financial services, are working on contingency plans,\" said Veihmeyer.\n\"These include looking at various potential scenarios coming out the Brexit negotiations [after two years] and including the scenario of what they should do if they need to relocated certain operations abroad. My sense is that it is rather precipitous, but companies are wanting to wait [until taking any action].\"\nA \"hard Brexit\" is the UK leaving the European Union without unfettered access to the single market, in exchange for full control over immigration.\nI wouldn't say we are seeing a lot of companies that are aggressively and actively moving in that direction [relocating staff, units, or setting up subsidiaries]\nFor financial services, this is the worst possible outcome as it would mean the loss of passporting rights.\nThe biggest challenge for financial services\nThe loss of passporting rights following Brexit is one of the biggest fears in the City of London. If the passport is taken away, then London could cease to be the most important financial centre in Europe, costing the UK thousands of jobs and billions in revenues.\nAround 5,500 firms registered in the UK rely on the European Union's passporting rights for the financial services sector, and they turn over about £9 billion ($11.2 billion) in revenue.\nThat being said, Article 50 has not been triggered yet and therefore the official two-year negotiation period has not started. Therefore, how Brexit is going to look for Britain is just speculation at the moment.\n\"The biggest concern is what happens in two years time. This is a challenge we all have — predicting what key dimensions of the Brexit talks will be and what the negotiations are going to produce,\" said Veihmeyer.\n\"One of the major concerns from clients is mainly around talent — the ease of travel for your employees and potentially how this will constrain activities.\"\nThe contingency plans involve companies putting a blueprint in place for various eventualities — including any crackdown on immigration that makes it more onerous for companies to employ EU citizens.\nRecovering from the initial \"knee-jerk\" reaction to the Brexit vote\nJohn Veihmeyer, Global Chairman of KPMG. KPMG A number of institutions have warned that jobs are going to move out of the country, with Japanese banks, as well as Lloyd's of London, both already saying they will almost certainly be moving some operations.\nOn top of that, UK investment collapsed by £15 billion between July and September, according to the ONS. That was only the fifth time there has been a quarterly decline in UK investment since 1987.\nBut Veihmeyer says that the worst may be over.\n\"I think in terms with what we've experienced, the impact on the economy Brexit has had initially saw a real pullback [in investment] which lasted 45 days or so, through to mid to late August. It was pretty significant, with deals being put on hold, for example,\" said Veihmeyer.\n\"However, by the latter part of August, this subsided and now we feel like we are back to normal, like we're not feeling any significant negative impact in the economy and investors have now dealt with the initial reaction to the investment drawback.\"\nThis does seem true.\nBy September, virtually every major institution had rowed back on economic forecasts, following a slew of better than expected economic data coming out of the country. Even Barclays — which in the immediate aftermath of the referendum was the most bearish of all major banks on the UK economy — bumped up their forecasts once again, saying they expect the British economy to grow every quarter next year, and for growth to run at 1% over the full year.\nAnd it is for this reason that Veihmeyer says that KPMG's advice to clients is to not have a \"knee-jerk\" reaction and wait until something more concrete comes out from Brexit talks.\nYes there are uncertainties but lets not make assumptions that may or may not play out\n\"I think from an advice standpoint, there's an initial tendency on the part of companies to have a kneejerk reaction. But I say that, 'yes there are uncertainties but lets not make assumptions that may or may not play out.' On one level you need to stay calm but then there is a real responsibility of companies to anticipate the kinds of issues that it could experience [from something as big as Brexit] and not to be caught off guard by trade issues and certainly financial passporting,\" he told BI.\nSo what are the contingency plans?\nCurrent EU law allows European banks to operate branches in the UK that do not need to be separately capitalised from the parent company abroad. Similarly, non-EU banks, such as those from the US or Asia, can use their London subsidiary to sell services to clients across the EU. This has allowed London's financial centre to act as a hub for global firms looking to do business in the EU.\nThe use of this bank \"passport,\" which allows banks in London to access the EU single market of 28 nations (including the UK), could be one of the rights the UK loses in the British exit from the EU. Other financial centres in the EU, such as Dublin, Frankfurt or Paris, could take over London's hub role if the UK loses its passport.\nAnd they have made it no secret that they want to poach business from the UK. Amsterdam is also being considered as a potential relocation site for companies' relocation plans. kavalenkava volha/Shutterstock\nEarlier this month, Spain unleashed a range of new measures to make it easy for businesses to relocate from London to Madrid in a bid to take business away from Britain post-Brexit.\nSpain's financial regulator, the Comisión Nacional del Mercado de Valores (CNMV), said new measures include allowing companies to submit all their documents in English, fast-track authorisation for financial companies looking to relocate, as well as promising that the country will not impose any regulatory requirements beyond those set out by the European Union.\nMeanwhile, representatives from Paris and Frankfurt are actively looking to take business from London.\nAt the moment, this is just fertile groundwork and Veihmeyer says that part of the contingency plans is to look where is possible to relocate to, should a final Brexit deal warrant a relocation of services and people.\nHe says, the places are \"diverse, like the places you say, Frankfurt and Paris. Folks are also considering places like Amsterdam.\"\nBut it is not easy to up sticks and move abroad and Veihmeyer told us that something as simple as finding office space could hold back people moving to some of Europe's major capitals.\n\"The major gating issues that crop up for contingency planning is around infrastructure, for example, very basic facilities such as office space,\" he told BI.\nKPMG advises some of the biggest financial services firm in the world, like Citi and Deutsche Bank, but it is also — in its own right — a major employer and player in the City of London. However, just as he advised his clients, Veihmeyer told us that the accountancy has no plans to relocate services or jobs in light of the Brexit vote.\n\"We can't envisage an outcome where we don't have a major presence or employer in London,\" said Veihmeyer.\n\"London is a very important market for us.\"","url":"https://www.businessinsider.com/kpmg-global-chairman-john-veihmeyer-brexit-city-contingency-plans-passporting-article-50-2016-12"}
