{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 21:32:39","date_modify":"2018-10-22 21:32:39","date_publish":"2016-01-29 07:05:32","description":"Kris Jenner, 60, has spoken out about her horror she felt that her close friend Nicole Brown had been brutally murdered in her home in Los Angeles back in 1995","filename":"data/vaneerConsumption/KrisJennertalksNicoleBrownsmurderandRobertKardashiandefendingOJ.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30AFEF8900000578-0-image-a-108_1454047964470.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422215_Kris-Jenner-talks-Nicole-Brown-s-murder-says-Robert-Kardashian-defending-OJ-hard_1540243959.html","title":"Kris Jenner talks Nicole Brown's murder and Robert Kardashian defending OJ","title_page":"Kris Jenner talks Nicole Brown's murder and Robert Kardashian defending OJ | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was the murder that shocked a nation and led to one of the most notorious trials in recent history.\nAnd Kris Jenner has spoken out about her horror she felt that her close friend Nicole Brown had been brutally murdered in her home in Los Angeles back in 1994.\nThe reality television personality said she still could not believe what had happened as she sat in court during OJ Simpson's trial the following year, where her lawyer ex husband Robert Kardashian was helping to defend her friend's suspected killer.\nScroll down for video\n'Horrific': Kris Jenner said she was devastated her friend Nicole Brown had been found brutally murdered\nThe 60-year-old told People: 'It was horrible. I couldn't wrap my head around the fact that she had been killed in such a horrific, violent way.'\nThe 35-year-old, who Kris described as 'beautiful, funny, loyal and passionate,' was found dead at her Los Angeles home after suffering multiple times stab wounds to the head and neck. She also had defensive wounds on her hands.\nHer waiter friend Ronald Goldman, 25, had also been killed after being stabbed in the neck, chest and abdomen.\nAfter his dramatic arrest, following a car chase where Simpson sat in the backseat of a friend's vehicle, with a gun pointed to his head, the former NFL star recruited Robert Kardashian to his defence team.\nBest friends: Kris and Nicole were extremely close before her brutal murder in 1994\nSuspect: OJ Simpson was arrested and put on trial in 1996 for the murder of his ex wife and her friend\nKris, who attended much of the trial, said: 'They were trying to save OJ from going to jail. It was very hard.\n'It was excruciating to see how painful it was for the families to hear them go over and over all the details of what had happened.\n'I just wanted it to be over so we could all try to pick up the pieces. But it went on for so long. It was very stressful.'\nBy this point Kris was married to Olympic gold medalist Bruce Jenner, and was pregnant with their first child Kendall, who is now 20-years-old.\n'Very hard': Kris admitted she found it difficult to see her ex husband Robert helping to defend Simpson\nClose friends: Robert reactivated his law licence to be part of Simpson's defence team at the trial\nUltimately Simpson was controversially acquired, despite compelling DNA and forensic evidence, a decision which left Kris shocked.\nShe said: 'We didn't know what the verdict was going to be, I couldn't breathe.\n'When the (not guilty verdict) was read, everybody was stunned. I was just numb. And seeing the photos of (Simpson and his defense team) celebrating, it was hard.'\nRobert, despite his close friendship with Simpson, remained unconvinced about his innocence. H stated in a 1996 ABC interview: 'I have doubts. The blood evidence is the biggest thorn in my side; that causes me the greatest problems. So I struggle with the blood evidence.'\nMembers of the family: The Kardashians and the Browns would spend a lot of time with each other\nHoliday pals: Simpson and Brown even joined the Jenner family on a holiday to Mexico in 1994\nSimpson was later found liable for Brown and Goldman's deaths. He was ordered to pay $33.5 million in compensatory and punitive damages.\nHowever that will never fill the hole that was left in the lives of Kris and the loved ones of the victims.\nShe said: 'Losing her was something that I can never quite get over, but I will always have such love in my heart for Nicole. She is a part of my life that will be there forever.'\nThe whole affair is the basis of the first series of TV anthology show American Crime Story, in which Selma Blair plays Kris, David Schwimmer portrays Robert and Cuba Gooding Jr plays Simpson.\nDrama: The case is featured in the forthcoming American Crime Story which stars John Travolta, David Schwimmer and Cuba Gooding Jr","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422215/Kris-Jenner-talks-Nicole-Brown-s-murder-says-Robert-Kardashian-defending-OJ-hard.html"}
