{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:26:25","date_modify":"2018-10-22 23:26:25","date_publish":"2017-03-10 03:01:44","description":"Kristen Stewart, 26, rocked the contrast between edgy and elegant at the Personal Shopper premiere in New York City on Thursday night as she showed off her newly cropped blonde hair.","filename":"data/vaneerConsumption/KristenStewartstunsatPersonalShopperpremiereinNYC.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E21B48500000578-0-image-a-5_1489136165786.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299752_Kristen-Stewart-stuns-gown-buzz-cut-premiere_1540250785.html","title":"Kristen Stewart stuns at Personal Shopper premiere in NYC","title_page":"Kristen Stewart stuns at Personal Shopper premiere in NYC | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been out and about quite a bit since shaving off her brunette do and revealing her new bleached buzz cut.\nAnd Kristen Stewart rocked the contrast between edgy and elegant at the premiere of her new film Personal Shopper in New York City on Thursday night sponsored by Ruffino Wines.\nThe 26-year-old actress showed off her newly cropped blonde hair as she walked the red carpet hours after explaining during an interview with The Today Show why she decided to cut it off in the first place.\nScroll down for video\nDrastic contrast: Kristen Stewart, 26, rocked the contrast between edgy and elegant at the Personal Shopper premiere in New York City on Thursday night\nWhat a difference! The actress showed off her newly cropped blonde hair as she walked the red carpet\n'It's practical,' she revealed. 'I mean, I'm not going to be able to have touch-ups once they put the helmet on my head.'\nThe actress is referring to her new role in Underwater, directed by William Eubank, in where she plays a mechanical engineer who works on an oil rig.\nShe says it wasn't required for the role, but when the director suggested it as part of her character, Kristen decided to go for it.\nThe actress opted to wear a floor-length silver gown with a high neckline that sat close around her neck.\nGorgeous style: The actress opted to wear a floor-length silver gown with a high neckline that sat close around her neck and was completely open at the back\nThe dress showed off her broad, thin shoulders at the front and hung down loosely around her toned body.\nThe front of the dress was fitted with pocket detailing to give the gorgeous gown a more casual feel.\nKristen, who has always maintained a trim figure, looked ravishing from the back as the dressed showed off her tiny, toned frame and elegant back.\nThe Twilight star decided to go with very dark makeup around her eyes, which helped create the contrast between her edgy new hairdo and the elegance of her premiere gown.\nShe wore very little highlighter or other makeup on her face and chose to wear a very neutral lipstick to allow her eyes to really pop.\nIt fits well: The dress showed off her broad, thin shoulders at the front and hung down loosely around her toned body\nPersonal Shopper is a psychological thriller which centres on a ghost story set in the fashion underworld of Paris.\nKristen's character is grieving the death of her twin brother, and spends time at his Paris home determined to make contact with his spirit.\nThe film has received rather mixed reviews, but it seems reviewers are not blaming Kristen for the quality of the picture.\nModel Andreja Pejic also attended the premiere in a denim-inspired two-piece outfit\nModel Andreja Pejic also attended the premiere in a denim-inspired two-piece outfit.\nThe off-the-shoulder look featured puffy sleeves and a a slim denim pencil skirt.\nShe paired the outfit with sassy red boots and wore her bleached hair parted down the center hanging down past her shoulders.\nMini chic: Girls star Zosia Mamet made an appearance at the event, staying on-trend with a black choker around her neck, paired with a plunging black mini dress\nUnderstated elegance: She wore her light hair casually parted down the center in a low bun at the base of her neck and large dangling hoop earrings to complete her look\nFun after the premiere: Zosia and actor Evan Jonigkeit attend the after-party for the \"Personal Shopper\" New York Premiere\nFriends! Zosia and Kristen pose together for a photo as the celebrate Personal Shopper premiere\nTwo outfits for one night: Kristen also wore a pinstripe pair of pants with a crop top\nPeople pleaser: Kristen ensured to take selfies and mingles with fans\nHeading home: Kristen harboured a few essentials in large brown bag\nYour turn! However, the activity proved to be too strenuous as she handed over the bag to a pal\nGirls star Zosia Mamet made an appearance at the event, staying on-trend with a black choker around her neck, paired with a plunging black mini dress.\nShe wore her light hair casually parted down the center in a low bun at the base of her neck and large dangling hoop earrings to complete her look.\nThe daughter of famous play write David Mamet looked relaxed and elegant as she posed for the cameras.\nDetails: A pair of chains dangled down her front\nCute and sexy: Reality star Olivia Palermo also attended the event in an all-black suit and black slip-on tennis shoes\nPals: Zosia and Kristen had obviously struck up quite the friendship as the pair shared a giggle together\nStunning: Zosia flaunted her enviable frame as she cosied up to the new-look Kristen\nReality star Olivia Palermo also attended the event in an all-black suit and black slip-on tennis shoes.\nShe also chose to wear a choker around her neck and opted for a sleek hairstyle with her blonde hair parted down the center.\nCarrying a coordinating black purse, the socialite also had her nails painted black to complete the monochromatic look.\nStill celebrating: Kristen and director Olivier Assayas continued to party well into the night after attending the premiere\nDynamic duo: Director Olivier Assayas posed with Kristen on the red carpet as they promoted their film","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299752/Kristen-Stewart-stuns-gown-buzz-cut-premiere.html"}
