{"authors":["John Mcgarry For The Scottish Daily Mail"],"date_download":"2018-10-22 21:06:08","date_modify":"2018-10-22 21:06:08","date_publish":"2017-03-16 00:36:06","description":"Second choice to Souleymane Coulibaly up until Christmas, the 33-year-old fought a constant battle against ring-rust in the cameo roles he was largely afforded in Lee Clark’s side.","filename":"data/vaneerConsumption/KrisBoydisthemostmentallystrongsaysLeeMcCulloch.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4D6C6800000578-0-image-a-35_1489623734281.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4318446_Kris-Boyd-mentally-strong-says-Lee-McCulloch_1540242368.html","title":"Kris Boyd is the most mentally strong, says Lee McCulloch","title_page":"Kris Boyd is the most mentally strong, says Lee McCulloch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kris Boyd's season is shaping up as a timely reminder of the futility of talent if it’s not nurtured by opportunity.\nSecond choice to the occasionally spectacular but frequently infuriating figure of Souleymane Coulibaly up until Christmas, the 33-year-old fought a constant battle against ring-rust in the cameo roles he was largely afforded in Lee Clark’s side.\nCoulibaly’s lucrative move to Egyptian side Al Ahly in January has been rewarding for the Ayrshire side way beyond the £800,000 they banked from the deal.\nKilmarnock striker Kris Boyd (centre) celebrates his winning goal against Ross County\nBoyd, frankly, has rolled back the years since the Ivorian’s departure. The four goals in seven games he’s enjoyed since reclaiming the lead striker role have contrasted sharply with the three in 17 he claimed as a bit-part player.\nInterim Killie boss Lee McCulloch, who knows Boyd intimately from their time together at Rangers, felt the recent upturn in the former Scotland international’s fortunes should have been about as predictable as day following night.\n‘Souley was here and he was scoring spectacular goals,’ recalled McCulloch. ‘He wasn’t a natural goalscorer, but he was a scorer of good goals.\n‘Boydy can score good goals, but he is a natural goalscorer and he will get you goals. To get the best out of Kris, he’s got to be playing every week.\n‘There’s ability there, and obviously his movement is there from the way he was brought up. But there’s also a tremendous degree of mental strength.\n‘He’s a little bit like Ally McCoist in that he believes in his ability so much to score goals, and also in their movement in the box.\nInterim boss Lee McCulloch spoke to the press ahead of his side's match against Partick Thistle\n‘Boydy could race a lot of football players over 100metres and he might not win too many, but I don’t think there’s anyone faster in the Premiership right now than Kris Boyd in the box.\n‘We’ve started creating chances in the last three or four games and he’s getting on the end of things. Right now, if Boydy is playing for a big team, he would be banging in goals all day long.’\nNot for one second would the local lad-made-good pretend to be the complete striker.\nA lack of mobility, as well as question marks over his link-up play, cost him game-time in many a key match under Walter Smith at Rangers and was manna from heaven for his detractors.\nMcCulloch needs no reminder of that. But when he can point to the fact that Boyd remains the most prolific player in the history of the Scottish Premier League, the Killie caretaker boss feels that all criticism is relative.\n‘Scoring goals is definitely the hardest thing to do in football,’ McCulloch added. Boydy has always had his fair share of criticism which, for me, is unjust.\nBoyd (2nd left) has rolled back the years since the Souleymane Coulibaly departure\n‘His goal return at Rangers, his goal return at Kilmarnock and a couple of other clubs is nothing short of phenomenal. It’s in the top five in Scotland ever, it’s crazy. And people will still have a go\n‘From my playing days he’s probably the most mentally-strong player I’ve played with in terms of how he believes in himself and believes that, no matter what, he is going to score a goal.\n‘Our team needs that, our dressing room needs that, and this club needs that. Just now he’s the stand-in captain, and there’s no reason why he can’t go on and get even more goals.’\nThere is no sign of Boyd’s love affair at Rugby Park ending any time soon, whether that be on the field of play or honing the talents of the next generation.\n‘In the future, the club should be looking after him with a coaching role,’ said McCulloch. He’s a good guy for the young players in the dressing room to look up to, because he gets this stick for not being a good trainer and for this and that.\n‘But Boydy is good for these young boys in the dressing room and that’s the main thing. You’ll have to ask him how long he can go on for, but there’s no reason why he can’t go on and break another record and no doubt he will. I wouldn’t rule him out.’\nMcCulloch says Boyd is the most mentally-strong player that he has ever encountered\nHow long McCulloch will go on with the word ‘interim’ in his title is a matter that’s no clearer than the last time be addressed the matter.\nFirst asked to take the side for the game with Aberdeen on February 19, he’s now eyeing the visit of Partick Thistle on Saturday as his fifth match in charge.\nThus far, two wins from four, and two decent displays in the ones that got away, suggest he would be a decent fit to replace Clark in the longer-term. Yet a resolution to the matter does not appear to be round the corner.\n‘Again, there is absolutely no update,’ he said. ‘The truth is there’s not been any contact really, I just got a text message saying well done for the result last weekend.\n‘I can only speak for myself but why be in a rush if things are going okay? That’s the way probably both parties are looking at it at the moment. I’m enjoying myself, I love working with the boys, Peter (Leven) and all the rest of the staff. So, we’ll just keep carrying on.\n‘It’s been a great experience learning all about dealing with players individually and collectively, and out on the training pitch is the thing I enjoy the most. On match days you get a wee bit nervous but I’m really enjoying my short time I’ve had.\n‘The difference is night and day from being the assistant. When you are the assistant you want the team to win, you’re hands-on and you’ve got the manager’ s back obviously.\n‘But it’s just a whole different world when you become the manager, which some people don’t like and some people do. Right now, I’m enjoying it.’","url":"https://www.dailymail.co.uk/sport/football/article-4318446/Kris-Boyd-mentally-strong-says-Lee-McCulloch.html"}
