{"authors":["Shyam Dodge For Dailymail.Com"],"date_download":"2018-10-23 03:47:41","date_modify":"2018-10-23 03:47:41","date_publish":"2016-01-29 19:05:50","description":"Kris Jenner was seen arriving to Blac Chyna's house on Friday just days after her son Rob Kardashian moved into the Tarzana home.","filename":"data/vaneerConsumption/KrisJennerpicturedarrivingtoBlacChynashouseaftersonRobKardashianmovedin.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/30B4F26600000578-0-image-a-21_1454095393221.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423320_Kris-Jenner-pictured-arriving-Blac-Chyna-s-house-son-Rob-Kardashian-moved-just-days-before_1540266461.html","title":"Kris Jenner pictured arriving to Blac Chyna's house after son Rob Kardashian moved in","title_page":"Kris Jenner pictured arriving to Blac Chyna's house after son Rob Kardashian moved in | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It appears that the momager is on a mission to reclaim her son.\nKris Jenner was seen arriving to Blac Chyna's house on Friday just days after her son Rob Kardashian moved into the Tarzana home.\nReclusive Rob, 28, revealed earlier this week his new romance with Chyna, who is Tyga's baby mama.\nScroll down for video...\nHere on family business: Kris Jenner was seen arriving to Blac Chyna's house on Friday just days after her son Rob Kardashian moved into the Tarzana home\nReclaim her boy: Reclusive Rob, 28, revealed earlier this week his new romance with Chyna, who is Tyga's baby mama\nThe relationship is said to have caused chaos for the Kardashian family as Rob is dating little sister Kylie Jenner's love rival.\nAnd it appears Kris' visit to Chyna's home was to talk some sense into her son, who is shacking up with the former exotic dancer.\nThe 60-year-old was seen rolling up to the gated community in Tarzana, California, in her brand new Rolls Royce.\nAnd she wasn't the only visitor; a moving van was also spotted spotted pulling up to Chyna's home that same day.\nSee Kris Jenner updates as she goes to Blac Chyna's house after Rob Kardashian moved in\nThe momager will see you now: The 60-year-old was seen rolling up to the gated community in Tarzana, California, in her brand new Rolls Royce\nTough talk: It appears Kris' visit to Chyna's home was to talk some sense into her son, who is shacking up with the former exotic dancer\nTMZ reports that the former recluse, whose diabetes diagnosis saw him hospitalised last month, 'adores' the 27-year-old and is feeling 'happier than he's been in years'.\nRob is said to have moved in with the Chyna, who is mother to Tyga's son Cairo, after his big sister Khloe Kardashian 'threw him out' of her own home.\nSource tell the website that Chyna is motivating him and that he will be staying indefinitely, with no intention to move back in with his sister.\nLet me through: The star rolled into the gated community\nTell em, it's the momager: The reality star chatted with the gate keepers\nNothing stops her! Kris was soon zooming off to Chyna's home\nThe proof was in the pudding for the estranged Kardashian on Thursday when he also took himself off to the gym in a new Instagram, a sign that he is finally taking his diabetes recovery seriously.\nA source went on to explain that the pair have not struck up a relationship to get back at the Kardashian and Jenner sisters, he quite simply 'adores' Blac Chyna.\nIt's believed that Kim, in particular, has mellowed to the idea anyway as she wants her brother to be 'truly happy and healthy.'\nProof: Kris wasn't the only visitor; a moving van was also spotted spotted pulling up to Chyna's home that same day\nHappy: Meanwhile Blac Chyna was spotted at LAX looking delighted with herself\nHear ye: Kanye also arrived at LAX that same day, making his way back from Paris Fashion Week on the same flight as sister-in-law Kendall Jenner\nThis comes as his sister Kylie made it clear that her brother Rob is not her favourite person right now.\nJust before the world realized that the 28-year-old reclusive Kardashian is dating Tyga's former fiancee, his little sister took reportedly took to social media and joked that Rob was no longer her brother and the devil.\nWhile the apparent post has now been deleted, Twitter fan page UpdateJenner took a screen grab of it.\nAttached at the hip: Rob and Chyna seen the day before running errands together\nThe cat that got the cream: The former exotic dancer looked happy as she stepped out alone on Thursday\nMotivation: The former E! star shared a photo at the gym on Thursday, proving that his girlfriend had been keeping him 'motivated' as sources claim\n'#babykardashian': Rob broke his social media silence to joke about his new reported girlfriend Blac Chyna having his baby on Tuesday\nTell us how you really feel: On Sunday, just before news broke that her brother was dating Tyga's ex, Kylie Jenner reportedly posted this rather telling 'joke' on Instagram before deleting it\nThe 18-year-old star allegedly re-posted another social media user's post of a drawing of the devil drawn by another woman's seven-year-old brother.\nIn response to the woman's question, 'what does this mean?', the original poster captioned the image: 'It means he is not your brother anymore, b***h get out of the house?'\nObviously believing Rob has betrayed her, Kylie reportedly captioned the snap: 'This is @robkardashian lol.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423320/Kris-Jenner-pictured-arriving-Blac-Chyna-s-house-son-Rob-Kardashian-moved-just-days-before.html"}
