{"authors":["Rachel Simon"],"date_download":"2018-10-30 22:31:12","date_modify":"2018-10-30 22:31:12","date_publish":"2014-08-15 14:52:37","description":"One of the biggest changes to ever take place in entertainment media occurred early this year — and chances are, most people had no idea it was even happening. If you looked closely at your issues of People or Us Weekly, though, you would've spotted…","filename":"data/vaneerConsumption/KristenBellonHerNoKidsPolicy5MonthsLaterIWillForeverBeGrateful.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/18b0599d-aef6-489d-96ff-eb0533ec6b65.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35432-kristen-bell-on-her-nokidspolicy-5-months-later-i-will-forever-be-grateful_1540938672.html","title":"Kristen Bell on Her #NoKidsPolicy 5 Months Later: \"I Will Forever Be Grateful\"","title_page":"Kristen Bell on Her #NoKidsPolicy 5 Months Later: \"I Will Forever Be Grateful\"","title_rss":"NULL","source_domain":"bustle.com","text":"One of the biggest changes to ever take place in entertainment media occurred early this year — and chances are, most people had no idea it was even happening. If you looked closely at your issues of People or Us Weekly, though, you would've spotted it: the total absence of paparazzi photos of celebrities' children. Since March, the kid-focused images that once filled dozens of tabloids are nowhere to be found. It's a huge shift in entertainment journalism, and it's all thanks to Kristen Bell, who, in January, began the #NoKidsPolicy campaign to convince media outlets to no longer use unsolicited paparazzi photos of famous-born children.\n\"It was important to me to set up a safe and healthy environment for my child to grow up in, and the situation that I was entering, the situation that I was bringing a child into, was neither safe nor healthy for her,\" Bell, now pregnant with her second child, tells Bustle. \"I wouldn’t be able to sleep at night knowing that I was doing a decent job as a mother without attempting to change something, attempting to get people to acknowledge that children should not be affected by the media.\"\nTo Bell, this meant kids \"feeling like they were on display the minute they left the house.\"\n\"They should run around with their finger in their nose and dirt all over their face,\" she continues. \"They shouldn’t be judged for their outfit. That’s hard enough when you’re an adult, and you’re actually playing the game. They’re too little for all this judgment. They don’t understand any of it, they don’t understand that they’re a cog in the machine. All they feel is a predatory sense of oppression when the paparazzi follow them, and that’s intolerable.\"\nSo, along with husband Dax Shepard, Bell began the #NoKidsPolicy campaign, urging the entertainment media to stop publishing unsolicited child photos, and, most importantly, consumers to stop supporting outlets that carried them.\n\"Dax and I felt there was a gap in the rules of the social structure,\" Bell explains. \"I felt like all these things are being marketed directly to the people, via social media, via interviews like this, so why not talk about the topic directly to the consumers? The power is in the hands of the people, and until you change the appetite, you won’t see the most dramatic effects of what you’re doing.\"\nStill, she says, \"I didn't expect anyone to listen.\"\nBut listen they did, and the couple's passionate tweets, op-eds, and interviews, along with news coverage of stars like Jennifer Garner and Halle Berry fighting to change California paparazzi law, began to earn notice. Bell also got many famous friends to agree not to speak with outlets featuring unsolicited child photos, using, she says, laughing, her House of Lies background as a management consultant to come to publications with a \"little bit of leverage.\"\n\"[These celebrities said] oh, absolutely, if I had the choice to do an interview with someone who said, we respect kids, or we’re putting pictures of toddlers on the opening of our website, I would obviously choose the former,\" Bell says. \"So I started the process . . . with that in mind. I went in and said, 'I would love for you guys to be on our side with the issue and publicly acknowledge it, and know that when you do, you’ll get all these interviews with people that you want.'\"\nSoon, sites like Access Hollywood and Entertainment Tonight got on board, and other prominent publications followed: People, Us Weekly, even PerezHilton.com.\n\"I was very surprised that a lot of those outlets said yes,\" Bell says, \"because they had gone down the road over the last few years of actually marketing directly to people who like to see pictures of celebrity babies. . . . It’s a bigger decision for that corporation to make, because they have to decide whether or not it’ll affect their bottom line. I was shocked that Perez agreed, but at the same time, he has a kid now. So I think that it was easier to him to picture what it would be like if his kid were scared.\"\nStill, while Bell's actions garnered substantial support, some people took issue with what they considered both an infringement on free speech and a focus on an \"unimportant\" issue.\n\"Look, this is very low on the totem pole,\" Bell admits. \"I never want to appear like this is the most important topic on Earth. I’m very sure that it’s not.\"\n\"But,\" she adds, \"when doctors try to cure cancer, they also try to cure foot fungus, because both suck.\"\nAlthough most major outlets now support Bell's policy, some have held out.\n\"I reached out to every publication knowing full well that a lot of them wouldn’t,\" she says. \"Life and Style, In Touch, they had no interest in complying. That’s their prerogative. But they're not very journalistically integrity-driven sources from the beginning.\"\nBell's hopeful, though, that they'll come around.\n\"I would like to see publications say that they care about this before a child actually gets hurt,\" she says simply.\nSome media outlets have come halfway, agreeing not to publish the candid paparazzi photos but still decreeing that they'll post images of children at places where they'd expect to be photographed.\n\"Look, I don’t fault them for it,\" says Bell. \"I would’ve loved for each and every one of them to say, of course, you’re right, all children should be respected, anyone under 18. But it’s not a reality. And I still respect them based on the fact that they said, OK, what if the parents bring them to a Laker game and they’re sitting courtside? I can acknowledge that. Listen, if you don’t want your child photographed, don’t go courtside to the Lakers.\"\nWhat it all comes down to, she says, is respect: Between paparazzi and parents; paparazzi and children; and media consumers and the real people they're reading about in their magazines.\n\"Any child who’s followed by a stranger — whether or not they’re holding cameras or lollipops is irrelevant,\" Bell says. \"You shouldn’t have to feel like people are taking advantage of your children.\"\nSince the #NoKidsPolicy took hold, the number of paparazzi photos of children has decreased enormously. Studying the \"Star Tracks\" sections of People magazines from 2013, I discovered that 31 percent of those photos were unsolicited shots of famous kids, while in issues published today, that number is close to zero.\n\"We’ve made more strides than I ever anticipated,\" Bell says. \"I haven’t been followed with Lincoln since I started talking about this, and I will forever be grateful that she doesn’t know what that feels like.\"\nAnd so are countless other celebrity parents, including many of the names on Bell's \"leverage\" list.\n\"I’ve gotten thank-yous from everyone,\" she says. \"I've heard personal stories from a lot of people who said it drastically diminished the amount of paparazzi that follow their children or follow them when they’re having family time, and it has a direct correlation, I think, to the child’s sense of safety and her freedom and happiness.\"\nYet it's \"still very, very strange to say you’re welcome,\" Bell adds, \"because I really don’t think I did anything but talk loud, which I always do. . . . I know that a lot of parents in the public eye have been frustrated by this problem. I just happened to be the one who had a gut instinct about how we should handle it.\"\nImages: DaxShepard1/Twitter; ImKristenBell/Twitter; Life & Style; People","url":"https://www.bustle.com/articles/35432-kristen-bell-on-her-nokidspolicy-5-months-later-i-will-forever-be-grateful"}
