{"authors":["Alex Michael For Daily Mail Australia"],"date_download":"2018-10-23 03:37:59","date_modify":"2018-10-23 03:37:59","date_publish":"2017-03-10 13:16:55","description":"Kris Smith sent fans online into meltdown Friday when he shared a snap from a romantic dinner that showed the slimmed down hunk wearing what many commenters believed to be a wedding ring","filename":"data/vaneerConsumption/KrisSmithlooksskinnyandsparksengagementspeculation.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22A4BC00000578-0-image-a-15_1489150648827.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300754_Kris-Smith-looks-skinny-sparks-engagement-speculation_1540265879.html","title":"Kris Smith looks skinny and sparks engagement speculation","title_page":"Kris Smith looks skinny and sparks engagement speculation | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He was the subject of flirting attempts from Keira Maguire, Carson Kressley and definitely not Tziporah Malkah on I'm A Celebrity...Get Me Out Of Here!\nBut was Kris Smith engaged the whole time? And is he married now?\nThe 33-year-old sent Instagram into meltdown Friday after he shared a snap flaunting his dramatic weight loss and what fans speculated to be a shiny new wedding ring on his index finger.\nWhat's that ring doing there? Kris Smith sent fans online into meltdown Friday after a snap from a romantic dinner showed the slimmed down hunk wearing what many commenters speculated to be a wedding ring\nHe wore a simple black skivvy, clasping his hands onto a pair of chopsticks, exposing the large gold band on his ring finger.\n'The way to a mans heart is!!!!!!! Yeah great food and Old Fashions,' he wrote in the caption, further fueling speculation.\nFans were quick to jump on the bearded babe's new jewelry, boldly trying to get confirmation from the reality star.\nSlimmed down! Despite losing significantly less than other evicted camp mates, Kris' arms and face looked noticeably slimmer as he sat across from an accomplice assumed to be the 'ex-girlfriend' he told contestants he was rekindling with on the show\n'Where are those rings from @krissmith13?' One prodded.\nGoing for a more direct approach another simply asked: 'Wedding Ring @krissmith13????'\n'Who is it?' joined an intrigued commenter, the chorus of speculation growing with every passing minute.\nSpill it! Fans were quick to jump on the bearded babe's new jewelry, with one flat out asking: 'Wedding ring????'\nThe hunky model also sported a noticably slender frame in the photo, taken at Melbourne's popular Hawker Hall restaurant complex.\nDespite losing significantly less weight than other evicted camp mates, Kris' arms and face looked noticeably slimmer.\nSome commenters took the opportunity to touch base on Kris' much slimmer frame.\nNo thanks! The 33-year-old had to fend off flirtatious encounters with flamboyant Queer Eye For The Straight Guy host Carson Kressley on I'm A Celebrity...Get Me Out Of Here!\nHe's mine! The Bachelor's Keira Maguire also tried and failed at her attempts at wooing Kris\nAre they back together again? Kris has previously dated model Maddy King on-and-off\n'You've lost so much weight! But still look great @krissmith13,' one wrote.\nDuring his time in the South African jungle, Kris became the apple of several flirtacoius celebrities' eyes, including Carson Kressley, Ash Pollard and Keira Maguire.\nSadly for his admirers, Kris eventually confirmed to Tegan Martin: 'I'm not single'.\nLater in the program, Kris, who has a son with Dannii Minogue, told Ash Pollard that the woman he was dating is in fact an ex-girlfriend he was 'reconnecting with'.\n'I have got a lot of feelings for her. I am reconnecting with my ex and everything else. It is fresh. We are talking again about fixing things up,' he said.\nWhat? Attempts that surprisingly still held up after Kris - who shares a kid with former lover Dannii Minogue - surprised many by telling Tegan Martin 'I'm not single'\n'If you say you have a girlfriend you will have to go into who,' Tegan said after Kris said he wanted to keep the relationship quiet.\n'I know. That's what I didn't want to do,' Kris said before saying that he had not been seeing the mystery woman, 'overly long really' and that it was 'early days'.\nToo early for a wedding?","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300754/Kris-Smith-looks-skinny-sparks-engagement-speculation.html"}
