{"authors":[],"date_download":"2018-10-22 21:10:36","date_modify":"2018-10-22 21:10:36","date_publish":"2014-05-06 08:27:08","description":"\"It's really something off that 'Shouldn't Be Alive' show. She really had a strong will to survive,\" firefighter says.","filename":"data/vaneerConsumption/KristinHopkinsSurvivesFiveDaysAfterCarCrashinColorado.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/422011/140505-hopkins-car-wreck-jms-1936_b2f2e8fa7a937a15eda2806520692546.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_kristin-hopkins-survives-five-days-after-car-crash-colorado-n97876_1540242636.html","title":"Kristin Hopkins Survives Five Days After Car Crash in Colorado","title_page":"Kristin Hopkins Survives Five Days After Car Crash in Colorado","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA mother survived in the mangled wreckage of her car without food and water for at least five days after the vehicle plunged about 120 feet down an embankment.\nKristin Hopkins, 43, scribbled desperate pleas for help on an umbrella and pushed it through the open window of her overturned Chevrolet Malibu.\nThe barely legible note written with a Sharpie appeared to say: \"Six days, no food, no water; please help me; need a doctor,\" according to firefighter Jim Cravener, who was one of the first rescuers on the scene.\nInvestigators were still trying to determine what caused the crash on U.S. Highway 285, four miles south of Fairplay, Colorado. But officials were stunned that Hopkins managed to survive the drop - let alone her five-day ordeal trapped inside.\n\"The crash alone would have taken its toll on her,\" Colorado State Patrol Trooper Dean Enright told KUSA. \"It's surprising she survived the crash at all, but to be down there for that amount of days…” he added, his voice trailing off in disbelief.\nMotorists spotted the vehicle Sunday and hiked down from the highway before alerting emergency services, according to The Associated Press.","url":"https://www.nbcnews.com/news/us-news/kristin-hopkins-survives-five-days-after-car-crash-colorado-n97876"}
