{"authors":["Brenton Garen At Dailymail.Com"],"date_download":"2018-10-23 03:17:55","date_modify":"2018-10-23 03:17:55","date_publish":"2016-01-28 18:37:58","description":"Kristin Cavallari, 29, posted a photo holding her two-month-old daughter Saylor on Thursday, revealing she's on the up and up after being injured in a car accident last week.","filename":"data/vaneerConsumption/KristinCavallariholdsnewborndaughterforfirsttimesincehercarcrashinjury.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACEA8D00000578-0-image-a-4_1454007300453.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421393_Kristin-Cavallari-holds-newborn-daughter-time-car-crash-injury-morning-seen-leaving-studio-shoot-LA_1540264675.html","title":"Kristin Cavallari holds newborn daughter for first time since her car crash injury","title_page":"Kristin Cavallari holds newborn daughter for first time since her car crash injury | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kristin Cavallari is holding her baby again.\nOn Thursday the 29-year-old reality vet posted to her Instagram account a photo where she's hugging her daughter.\n‘Morning snuggles with my girl. First time I've been able to hold her by myself in a week,’ she wrote on Instagram. It comes after she was injured in a car accident last week.\nEarlier, the Hills star was seen smiling as she left a studio in LA.\nScroll down for video\nAdorable: Kristin Cavallari posted a photo Thursday holding her two-month-old daughter Saylor - the first time she's done it by herself since her car crash on January 21\nIn the picture she's holding Saylor, who was born on November 23. She's pictured in bed wearing a grey blanket around her shoulders while holding the cute two-month-old close to her chest.\nThe beauty's hair was in a high bun as she appeared without makeup or any jewelry.\nThe cute photo was posted after Cavallari was spotted Wednesday night leaving a studio shoot in Hollywood. She looked in high spirits as she flashed a smile.\nAll smiles: The star was in high spirits on Wednesday night in Hollywood... she appears to have recovered well after being in a car crash in Chicago on January 21\nShe wore an elegant beige top and white cardigan to go with her torn-at-the-knee black pants and black shoes.\nHer long blonde locks flowed as her face glowed in flawless makeup.\nCavallari has two other children – both boys – to Chicago Bears quarterback husband Jay Cutler: Camden, 3, and Jaxon, 20 months.\nBack in public! Cavallari was seen leaving a studio shoot in Hollywood on Wednesday night\nThe Denver born blonde was hospitalized after a car struck her vehicle in Chicago on January 21.\nNone of her children or husband were in the car at the time of the accident.\nOn Wednesday, the Laguna Beach star apologized to her 1.8million followers for getting 'corny' before professing her new found appreciation of life.\nFeeling better: The 29-year-old posted this photo to her Instagram on Wednesday, sharing she has a new found appreciation of life\nShe's okay! The Hills star dislocated her elbow in the car accident; she's seen here in a sling on January 25 as she arrives at LAX\n'I dislocated my elbow in a car accident last week and because of that, and everything else I've been through in the past couple months, I have such an appreciation for life,' she wrote.\n'I am so thankful it wasn't worse, and more importantly that my babies weren't with me,' she continued. My arm hurts like a b*tch but I'm thankful because I have my arm!!'\nAnd to show her new found lease of life, the reality star snuck in a little plug for her upcoming book.\nHappy couple: Cavallari has three children to Chicago Bears quarterback husband Jay Cutler; they're seen here on January 1\nBears fans! Cavallari holds son Camden in October before the start of an NFL game between the Chicago Bears and Oakland Raiders\nPlug: The author alluded to a new book on Wednesday, saying she shot her spring shoe look despite her injured arm\n'Shot my spring shoe look book today and even though I could barely move my arm, I am forever grateful for being here to shoot it,' she added.\nHer car accident happened just six weeks after her brother Michael was found dead on December 10 after going missing the day after Thanksgiving.\nThe 30-year-old's body was found in the desert near Green River, Utah, about three miles from where he had abandoned his car.\nRIP: Cavallari's brother Michael was found dead in Utah on December 10, just over two weeks after he was reported missing","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421393/Kristin-Cavallari-holds-newborn-daughter-time-car-crash-injury-morning-seen-leaving-studio-shoot-LA.html"}
