{"authors":["Alanna Bennett"],"date_download":"2018-10-30 23:55:05","date_modify":"2018-10-30 23:55:05","date_publish":"2014-08-12 21:25:37","description":"It's been about six months since the Veronica Mars movie premiered and gave us some much-needed resolution for some of our favorite characters of the mid-2000s. You know what that means? It's about time to start missing them again. The Ryan…","filename":"data/vaneerConsumption/KristenBellsVeronicaMarsSpinoffPlayItAgainDickWillCenteronRyanHansenWithOriginalCast.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/237ea7ef-1af0-4c6d-8487-a82710c93b4c.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35516-kristen-bells-veronica-mars-spinoff-play-it-again-dick-will-center-on-ryan-hansen-with-original_1540943705.html","title":"Kristen Bell's 'Veronica Mars' Spinoff 'Play It Again, Dick' Will Center on Ryan Hansen With Original Cast","title_page":"Kristen Bell's 'Veronica Mars' Spinoff 'Play It Again, Dick' Will Center on Ryan Hansen With Original Cast","title_rss":"NULL","source_domain":"bustle.com","text":"It's been about six months since the Veronica Mars movie premiered and gave us some much-needed resolution for some of our favorite characters of the mid-2000s. You know what that means? It's about time to start missing them again. The Ryan Hansen/Dick Casablancas Veronica Mars spinoff web series seems like the perfect place to start pining again. After all, most of the cast is participating. And yes, that includes Kristen Bell.\nWhen news of the Dick Casablancas-centric web series Play It Again, Dick first spread, I wrote it off pretty quickly: It'd be cute, sure, but what really is a Veronica Mars venture without, you know, Veronica Mars? But Buzzfeed's just released a bunch of info about the series that's quickly replaced my indifference with the kind of committed anticipation that's much more characteristic of my love of Veronica Mars ventures. Here's Rob Thomas' description of the series:\nThe web series will have more in common with Party Down tonally, but it will be about Ryan Hansen, or at least a version of Ryan Hansen, deciding to capitalize on the current Veronica Mars heat to get his own series on the air. He’ll try to pull his actor pals into the venture with varying degrees of success.\nSo what I'm picturing here is Matt LeBlanc in Episodes trying to rally the cast of Friends, but way more pathetic — and therefore potentially way more hilarious. Party Down was a cult classic for a reason, right?\nBut really, it's the cast list that sells it. Suffice it to say that practically everyone is returning — and that on top of returning, they'll be playing themselves. In other words: Kristen Bell won't just be Kristen Bell, she'll be Kristen Bell playing \"Kristen Bell,\" playing Veronica Mars. They also, rather hilariously, recast Duncan: Ryan Devlin won't be playing villain Mercer this time around — he'll be playing \"Ryan Devlin\" playing Duncan Kane, likely in the event that Hansen's \"Ryan Hansen\" can't get a hold of Teddy Dunn. That's guranteed to be something interesting to see.\nThere's a lot to think about here. It's all very meta. And I can't wait.","url":"https://www.bustle.com/articles/35516-kristen-bells-veronica-mars-spinoff-play-it-again-dick-will-center-on-ryan-hansen-with-original"}
