{"authors":["Laura House For Daily Mail Australia"],"date_download":"2018-10-22 23:55:35","date_modify":"2018-10-22 23:55:35","date_publish":"2017-03-10 04:55:31","description":"Popular 'Thinkergirls' radio host Kristie Mercer, from Sydney, is 'about certain' she would have an abortion if she was to find out she was pregnant tomorrow.","filename":"data/vaneerConsumption/KristieMercerwouldhaveanabortionifshegotpregnant.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/04/3E20099700000578-0-image-a-13_1489121238543.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4299940_Kristie-Mercer-abortion-got-pregnant_1540252535.html","title":"Kristie Mercer would have an abortion if she got pregnant","title_page":"Kristie Mercer would have an abortion if she got pregnant | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When it comes to pregnancy and starting a family, women are flooded with information about fertility and birth control and opinions what the 'right' things to say and do are, from a young age.\nAnd now popular 'Thinkergirls' radio host Kristie Mercer, has shared her own thoughts and why she is 'about certain' she would have an abortion if she was to find out she was pregnant tomorrow.\nThe Sydney-based 27-year-old, who has been in a happy relationship with her boyfriend for eight years, said that despite being stable in her career and in the 'best financial position I've ever been in,' she's not in a 'perfect place to provide for a child.'\n'Thinkergirls' radio host Kristie Mercer is 'about certain' she would have an abortion if she was to find out she was pregnant tomorrow\nMs Mercer said she noticed 'judgement' on her friends' faces when she told them her thoughts\n'There is no way I am ready to bring a child into this world - and while you never truly know what you’d do until you’re faced with the decision - I’m just about certain I would have an abortion,' she wrote for NewsCorp.\nMs Mercer said it felt 'shameful' to say that due to how many 'ready for parenting' boxes her life position ticks and said she noticed 'judgement' on her friends' faces when she told them her thoughts.\n'Even my single friends, my flat broke friends and my I-haven’t-figured-out-my-career friends, all landed in exactly the same place - having an abortion as we edge closer to 30, was way more irresponsible than if we were teenagers,' she wrote.\nDespite the judgement being 'momentary,' Ms Mercer said she would never tell them if she did terminate a pregnancy, she would never tell her friends\nDespite the judgement being 'momentary,' Ms Mercer said she would never tell them if she did terminate a pregnancy, she would never tell her friends.\nMs Mercer concluded by saying 'there's no way I can see a future for myself where I'm not a mother' but urged people to understand that a long term relationship 'doesn't automatically make you a better parent.'\n'A \"career woman\" can have more in her life than a career. And terminating a pregnancy doesn’t mean you never want to be a mum,' she said.\nIn 2015, the radio host also revealed she was considering freezing her eggs after hearing about the facts surrounding fertility after 30.\n'A \"career woman\" can have more in her life than a career. And terminating a pregnancy doesn’t mean you never want to be a mum,' she said\n'What happens if I wait until I’m ready only to realise that my body can no longer create a child?' She wrote on the Thinkergirls website at the time.\nDespite describing herself as 'un-clucky,' Ms Mercer said that she was at 'perfect baby making age' and felt it would be 'careless to not consider a backup' for her future.\n'You never know what life might throw at you - illness or bad luck - so why not consider it at the very least?' She wrote.\nShe concluded by saying it was nobody's right to 'question another's consideration of their life creating another' and described the choice as a 'personal decision' and not one that she took lightly.\n'I have a Doctor’s appointment next week to talk through my hundreds of questions and then a later a chat with my bank manager to increase the limit of my credit card (joking … but seriously),' she wrote.\nIf you need help or support with your pregnancy, are finding it difficult to talk about your pregnancy or wish to talk about your options, contact Pregnancy Help Australia or Abortion Grief Australia.","url":"https://www.dailymail.co.uk/femail/article-4299940/Kristie-Mercer-abortion-got-pregnant.html"}
