{"authors":["Marc Jackson For Mailonline"],"date_download":"2018-10-23 05:12:04","date_modify":"2018-10-23 05:12:04","date_publish":"2017-03-10 15:11:06","description":"The Personal Shopper star - who has dated men and women - admits that she doesn't understand why bisexuals are labelled 'confused' as she thinks it is, in fact, 'quite the opposite'.","filename":"data/vaneerConsumption/KristenStewarttalksabouthersexualityindetail.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/16/3E240AB400000578-0-image-a-11_1489164287120.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301642_Kristen-Stewart-talks-sexuality-detail_1540271524.html","title":"Kristen Stewart talks about her sexuality in detail","title_page":"Kristen Stewart talks about her sexuality in detail | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She came out as gay during an explosive episode of Saturday Night Live last month.\nNow Kristen Stewart has talked in detail about her sexuality and dealing with relationships in the public spotlight.\nThe Personal Shopper star - who has dated men and women - admits that she doesn't understand why bisexuals are labelled 'confused' as she thinks it is, in fact, 'quite the opposite'.\nScroll down for video\nOpen: Kristen Stewart has talked in detail about her sexuality and dealing with relationships in the public spotlight, calling for more understanding of 'fluidity'\nShe said: 'Oh, I think things are changing. I mean, I don't think I would have approached my life differently if that hadn't been the case. But who knows? Individually we are all part of that change and so I can take some credit for it, I guess - there's no reason why I should shy away from that. But all the prejudice; it's going for sure.\n'I mean, yeah, it's definitely still there. People still have some horrendous f***ing experiences. But it's cool that you don't have to nail everything down any more. That whole certainty about whether you're straight or gay or whatever. You're not confused if you're bisexual. It's not confusing at all. For me, it's quite the opposite.'\nAnd the 26-year-old actress is glad people feel more able to talk about sexuality in general now.\nComing out: Kristen is thought to currently be dating Stella Maxwell (pictured, left with Kristen, in January)\nShe added to The Guardian: 'That's been nothing but positive. I mean, it's hard to talk about. I don't want to seem presumptuous, because everyone has their own experience.The whole issue of sexuality is so grey. I'm just trying to acknowledge that fluidity, that greyness, which has always existed. But maybe only now are we allowed to start talking about it.'\nMeanwhile, Kristen previously admitted it took her some time to realise how important it is for her to open up about her private life because it can affect others too.\nFacts: The Personal Shopper star - who has dated men and women - admits that she doesn't understand why bisexuals are labelled 'confused' as she thinks it is, in fact, 'quite the opposite'\nPast: The actress was in a relationship with Robert Patterson during their time in the Twilight franchise\nNew love: Kristen is now regularly seen with the Victoria's Secret Angel Stella\nShe shared: 'But considering I had so many eyes on me, I suddenly realised [my private life] affects a greater number of people than just me. It was an opportunity to surrender a bit of what was mine, to make even one other person feel good about themselves.\n'If it didn't seem like a relevant topic like something that needed help, I would have kept my life private for ever. But then I can't walk outside holding somebody's hand, as I'm followed everywhere.\n'When I was dating Rob, the public were the enemy - and that is no way to live. It wasn't this grand statement, 'I was so confused! Now I've realised who I am!' I have not been struggling. It just seemed important, and topical.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301642/Kristen-Stewart-talks-sexuality-detail.html"}
