{"authors":[],"date_download":"2018-10-30 19:43:23","date_modify":"2018-10-30 19:43:23","date_publish":"2018-08-21 15:37:00","description":"Warrants released this week detail the dispute that led to a man's death outside a DeKalb County Kroger earlier this month on Memorial Drive.","filename":"data/vaneerConsumption/KrogercustomerdaresmantoshoothimNowhesdeadDeKalbcopssay.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/21/Videos/4465735.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_kroger-customer-_c56265e4f4751377ae56590f7084ba98__1540928603.html","title":"Kroger customer dares man to shoot him. Now he’s dead, DeKalb cops say","title_page":"Kroger customer dares man to shoot him. Now he’s dead, DeKalb cops say","title_rss":"NULL","source_domain":"ajc.com","text":"After the pistol-whipping outside a DeKalb County Kroger, the victim wasn’t shrinking away.\n“That all you got,” Jeremiah Flemister, a young father, asked the attacker, identified by police as Dra James.\n“I can shoot you,” James said.\n“Go ahead.”\nFlemister took a bullet to the chest there in the parking lot of the Memorial Drive store on Aug. 7, according to warrants released this week, detailing his last moments.\nThe victim leaves behind a son, who, on Facebook, the father called the best boy he could wish for. “This is what God gave me,” Flemister wrote of the boy four days before death.\nREAD: DeKalb parents charged with disabled toddler’s beating death seek bond\nREAD: Was it fear — or recklessness — that took down Jason Spencer?\nREAD: Good things coming for notorious, crime-infested DeKalb complex?\nThe argument likely started at the store near Columbia Drive over gang affiliation, the warrants say, though it isn’t clear if either man actually had gang ties. It began inside and spilled into the parking lot where several witnesses were on hand to see the dispute, which happened around 6 p.m.\nSecurity cameras also captured the shooting, warrants say.\nDeKalb deputies arrested James days later on a murder charge.\nHe remains in jail but has a bond hearing on Aug. 29, court records show.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/kroger-customer-dares-man-shoot-him-now-dead-dekalb-cops-say/zDBsxIHq5scP4plXAGiL4H/"}
