{"authors":["Pam Key"],"date_download":"2018-10-30 21:11:30","date_modify":"2018-10-30 21:11:30","date_publish":"2016-06-05 17:55:55","description":"Sunday on ABC's \"This Week,\" economist and New York Times columnist Paul Krugman said Republican presidential nominee Donald Trump \"is completely | Politics","filename":"data/vaneerConsumption/KrugmanTrumpIsCompletelyIncoherentonEconomicPolicy.json","image_url":"https://media.breitbart.com/media/2016/06/krug.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_05__1540933890.html","title":"Krugman: Trump Is 'Completely Incoherent on Economic Policy'","title_page":"Krugman: Trump Is 'Completely Incoherent on Economic Policy' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Sunday on ABC’s “This Week,” economist and New York Times columnist Paul Krugman said Republican presidential nominee Donald Trump “is completely incoherent on economic policy.”\nPartial transcript as follows:\nNORQUIST: Look at Reagan and Obama, and Reagan created more jobs and Reagan…\nKRUGMAN: They’ve got to go back 35 years to a completely different situation. We had Bush, got all this stuff, none of it delivered. And it’s kind of an amazing thing how Bush has become a nonperson.\nNORQUIST: Well, no, but he is a significant spending increases in the last\ntwo years of his administration. Democrats did the budgets, not Republicans, so you’re looking at a number of challenges and he didn’t have a supply side approach to economics the way Trump is looking at.\nI mean, Trump’s proposed — he’s also talking about regulation.\nKRUGMAN: Trump is completely incoherent on economic policy. I mean, you can find him on any given day supporting almost anything.\nWell, he said he wanted to — maybe he wanted to raise taxes on the rich, then he said he wanted to cut them. I mean, to actually try to suss out what\nTrump means, god knows.\nNORQUIST: It’s written down. And I think the proposal that he has — getting rid of the death tax, getting rid of the AMT finally, taking the corporate and business takes to 15 percent, he’s actually going to be a great advantage to the gig economy, the 1099 economy, the sharing economy, which Hillary Clinton is actually bared her teeth at. She said she’s going to crack down on independent contractors, which basically make Uber and AirBNB illegal in this country.\nHillary is on the wrong side of the future, on the wrong side of the gig economy, the sharing economy, and Trump has a tax plan to make it easier for people to be self-employed.\nSTEPHANOPOULOS: That’s all we have time for today. Thank you both very much.\nKRUGMAN: Thank you.","url":"https://www.breitbart.com/politics/2016/06/05/krugman-trump-completely-incoherent-economic-policy/"}
