{"authors":[],"date_download":"2018-10-30 19:05:07","date_modify":"2018-10-30 19:05:07","date_publish":"2018-09-07 00:43:00","description":"Lawsuit accuses officials of civil rights violations","filename":"data/vaneerConsumption/KSUstudentsuesofficialsoveranthemprotests.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/08/29/Videos/4471461.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_kennes_c48544fe715765223ee443b14dd9534e__1540926307.html","title":"KSU student sues officials over anthem protests","title_page":"Ga. colleges: KSU student sues officials over anthem protests","title_rss":"NULL","source_domain":"ajc.com","text":"A Kennesaw State University student has filed a lawsuit accusing university and elected officials of violating her civil rights during a dispute over her decision and other cheerleaders to kneel during the national anthem at football games last year to protest police brutality and racial discrimination.\nTommia Dean, a sophomore, said in her complaint, filed Wednesday, that the officials conspired against the cheerleaders by keeping them off the field during the anthem after the first protest. She accused two elected officials, Cobb County Sheriff Neil Warren and state Rep. Earl Ehrhart, R-Powder Springs, of attempting to stop the protests because of her race. Dean and the other cheerleaders who protested are African-American. Ehrhart and Warren are white.\n“Ehrhart and Warren used their power and influence to create a threatening atmosphere for any groups daring to exercise the privileges and immunities guaranteed by the U.S. Constitution,” Dean’s attorneys wrote in the complaint.\nThe university later reversed itself and allowed the cheerleaders on the field during the anthem.\nThe other defendants in the lawsuit are former university President Sam Olens, and two athletics department officials, Matt Griffin and Scott Whitlock. Olens resigned in February amid complaints about how he handled the protests.\nSome Kennesaw State University cheerleaders take a knee during the national anthem before the football game Sept. 30, to protest police misconduct and racial inequality. Cory Hancock / Special to the AJC\nThe University System of Georgia wrote in a special review last November that Olens and KSU officials didn’t follow the system’s guidance that taking a knee during the anthem is free speech protected by the U.S. Constitution and should not be interfered with, unless it causes a disruption.\n“By prohibiting the cheerleaders, including Plaintiff Dean, from taking the field and kneeling during the national anthem, Defendant Olens, Whitlock and Griffin in conspiracy under the pretext of improving the fan experience and acting under color of state law, violated Plaintiff Dean’s clearly established constitutional rights of which a reasonable person and government official would have known,” the complaint said.\nDean said she’s suffered migraine headaches and emotional distress. She’s demanding unspecified monetary damages for “the violation of her constitutional rights.”\nA KSU spokeswoman said the university does not comment on pending litigation. A spokesman for Sheriff Warren also declined comment, citing similar reasons. Messages to Olens were not immediately returned.\nAn attorney for Ehrhart said in a statement Friday afternoon that his client did not act with racial bias against Dean or the other cheerleaders.\n“Rep. Ehrhart was not present when the protests first occurred and only acted in response to numerous complaints from his constituents, who asked that he relay their concerns to those in positions of authority. Rep. Ehrhart did not act in response to the race of anyone,” said the attorney, Jonathan Crumly.\nOnly one of the five cheerleaders who took a knee during the anthem last season was selected to be on the team this year. Dean was not selected to join the squad.","url":"https://www.ajc.com/news/local-education/kennesaw-state-cheerleader-sues-officials-over-national-anthem-protests/MnyctmoHFg0KxhLZnGKxCM/"}
