{"authors":["John Carney"],"date_download":"2018-10-30 19:44:53","date_modify":"2018-10-30 19:44:53","date_publish":"2018-07-26 16:50:13","description":"\"This bolsters Trump's argument that being tough and aggressive--and, yes, using tariffs where required--can get you to the negotiating table,\" Kudlow said. | Politics","filename":"data/vaneerConsumption/KudlowEuropeAgreedtoHelpUsConfrontChina.json","image_url":"https://media.breitbart.com/media/2018/06/wi/afp/11/81ced1_us-national-economic-council-larry-kudlow-has-suffered-heart-attack-president-e1532623734325.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_26__1540928693.html","title":"Kudlow: Europe Agreed to Help Us Confront China","title_page":"Kudlow: Europe Agreed to Help Us Confront China | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The European Union has agreed to help the U.S. take on China, White House economic adviser Larry Kudlow said Thursday.\n“President Juncker made it very clear that he intended to help us, President Trump, on the China problem,” Kudlow said in an interview on the Fox Business Network.\nTrump and European Commissioner Jean-Claude Juncker met Wednesday at the White House and agreed to a wide-ranging framework to resolve trade disputes, with the aim of bringing tariffs down to zero eventually. In announcing the agreement on the White House lawn, Trump said the E.U. and the U.S. would “work closely together with likeminded partners to reform the WTO and to address unfair trading practices including intellectual property theft, forced technology transfer, industrial subsidy, distortions created by state-owned enterprises, and overcapacity.”\nThose comments closely mirrored the U.S. criticism of China trade practices that have led to escalating tariffs between the two countries. Kudlow’s remarks on Thursday confirmed the impression that Trump was describing a burgeoning alliance to counter China.\n“”U.S. and EU will be allied in the fight against China, which has broken the world trading system,” Kudlow said.\nKudlow also said that the E.U. had been approached by China but had rejected the overture.\nKudlow described the agreement with Europe as a vindication of Trump’s tough stances on trade.\n“This bolsters Trump’s argument that being tough and aggressive–and, yes, using tariffs where required–can get you to the negotiating table,” Kudlow said.\nDespite earlier signs of hope that a trade war with China could be avoided, Kudlow says talks have stalled out. “They have gone very dark,” Kudlow said, adding that the U.S. remained open to talks if China decides to return to the table.\nWatch the latest video at foxbusiness.com","url":"https://www.breitbart.com/politics/2018/07/26/kudlow_eu_versus_china/"}
