{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:35:10","date_modify":"2018-10-30 20:35:10","date_publish":"2016-11-18 04:06:48","description":"The U.S.-allied Kurdish YPG, despite objections from Turkey, are expected to soon join the offensive to retake Raqqa.","filename":"data/vaneerConsumption/KurdishYPGtoJoinUSBackedOffensivetoRetakeRaqqafromIslamicState.json","image_url":"https://media.breitbart.com/media/2016/06/syria-ypg-kurdish-fighters-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_11_17__1540931710.html","title":"Kurdish YPG to Join U.S.-Backed Offensive to Retake Raqqa from Islamic State","title_page":"Kurdish YPG to Join U.S.-Backed Offensive to Retake Raqqa from Islamic State","title_rss":"NULL","source_domain":"breitbart.com","text":"The U.S.-allied Kurdish People’s Protection Units (YPG), despite objections from Turkey, are expected to soon join the ongoing U.S.-backed offensive to retake Raqqa, considered to be the de-facto capital of the Islamic State (ISIS/ISIL) in Syria.\n“We announce the withdrawal of our forces to east of the Euphrates to take part in the ‘the Wrath of the Euphrates’ to liberate Raqqa,” the YPG General Command said in a statement, reports Rudaw.\nThe YPG is the armed wing of the Kurdish Democratic Union Party (PYD) that controls large swathes of northern Syria.\nWhile Turkey’s NATO ally the United States believes the YPG is one of the most effective ground forces against ISIS, Ankara considers the militia to be affiliated with the Kurdistan Workers’ Party (PKK).\nThe PKK has been designated a terrorist organization by the United States, Turkey, and other NATO members. Washington does not believe the YPG is linked to the terrorist group.\nRudaw reports:\nThe Kurdish People’s Protection Units (YPG) announced on Wednesday that they have withdrawn their forces from the northern Syrian city of Manbij after enabling local forces to protect the city, adding that the withdrawn units will join the US-backed Syrian Democratic Forces (SDF) in the operation to retake the ISIS stronghold of Raqqa.\nSDF refers to an Arab-Kurdish alliance led by the YPG.\nU.S. Secretary of Defense Ash Carter revealed last month that the U.S.-led coalition against ISIS would “simultaneously” carry out operations against the terrorist group in its de-facto capitals of Raqqa and Mosul.\nThe U.S.-backed offensive to recapture Mosul, Iraq’s second-largest city and ISIS’s last major stronghold in the country, began a month ago, on October 17.\nOn November 6, Kurdish-led Syrian troops, supported by U.S.-led coalition airstrikes and American military advisers, launched the operation to retake Raqqa from ISIS.\n“The military operation to retake Raqqa from ISIS to oust the extremist group from its de facto capital was launched on November 6 on two fronts by an amalgam of fighters, including the YPG and its female counterpart YPJ, under the SDF flag,” notes Rudaw.\nBrett McGurk, President Barack Obama’s special envoy for the U.S.-led coalition against ISIS, confirmed on Twitter that the YPG militiamen had withdrawn from Manbij.\nMilestone: all #YPG units to depart Manbij & return east of Euphrates after local units complete training to maintain security after #ISIL. — Brett McGurk (@brett_mcgurk) November 16, 2016\nIn mid-August, the U.S.-backed SDF liberated Manbij after months of fighting against ISIS.\n“After the liberation, our units started to help the international coalition forces to prepare the forces that belong to the Manbij military council, which now has got enough military and security institutions, and has become capable of protecting the Manbij land and its people against all the dangers posed against it,” explained the YPG, according to Rudaw.","url":"https://www.breitbart.com/national-security/2016/11/17/kurdish-ypg-militia-join-u-s-backed-offensive-retake-raqqa-islamic-state/"}
