{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 20:35:58","date_modify":"2018-10-30 20:35:58","date_publish":"2015-02-25 15:03:30","description":"Officials in Kobani have had to build hundreds of tents for residents whose homes were destroyed in the civil war in Syria.","filename":"data/vaneerConsumption/KurdsPlanThousandStrongTentCitytoHouseReturningRefugeesinKobani.json","image_url":"https://media.breitbart.com/media/2015/02/Kobani-refugees-tents-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_25__1540931758.html","title":"Kurds Plan Thousand-Strong 'Tent City' to House Returning Refugees in Kobani","title_page":"Kurds Plan Thousand-Strong 'Tent City' to House Returning Refugees in Kobani | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Officials in Kobani, the predominantly Kurdish city in northern Syria, have been forced to construct hundreds of tents for residents whose homes have been completely destroyed in the ongoing civil war in Syria, Firat News reports. Much of the city, which sits on the Turkish border, was completely ravaged in defending against the Islamic State (ISIS) terror group.\nAuthorities are also planning to create a thousand-strong tent “city” as a way to house people returning to the war-struck area. The good news, however, is that many are reportedly returning in large numbers to Kobani, officials stated. When the battles between ISIS and Kurdish forces reached a fever pitch, residents fled mostly into other Kurdish-controlled areas or into Turkey, according to reports. On January 26, Kurdish forces, with the help of U.S. airpower, successfully defeated ISIS and forced the jihadist group to retreat into other areas in Syria.\nThe Syrian Observatory for Human Rights estimates that Kurdish forces have liberated at least 163 villages within the area.\nOfficials estimate that about 4,000 refugees have returned to Kobani after the four-month intense battle between Kurdish and jihadist forces.\nAuthorities have warned the citizens coming back to Kobani that ISIS left behind mines and booby traps on its way out of the city. “It’s not safe for them. But they were looking forward to coming back,” explained Kobani official Idris Nasan.\nKurdish news outlet Rudaw reports that Firat News, which broke the story, is an entity with close ties to the communist Kurdistan Workers’ Party (PKK), who have much control over Kobani and the surrounding region.\nBefore the war broke out, Kobani had a population of an estimated 200,000. Rudaw described the city’s importance as a “symbol of Kurdish resistance” against ISIS.","url":"https://www.breitbart.com/national-security/2015/02/25/kurds-plan-thousand-strong-tent-city-to-house-returning-refugees-in-kobani/"}
