{"authors":["Frances Martel"],"date_download":"2018-10-30 20:34:55","date_modify":"2018-10-30 20:34:55","date_publish":"2014-07-17 15:30:26","description":"Since the jihadist terror group the Islamic State (formerly the Islamic State of Iraq and al-Sham--ISIS) began its onslaught on Iraq and conquered large |","filename":"data/vaneerConsumption/KurdishFemaleEliteForcesPreparetoBattleISISinIraq.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Peace/2014/Middle-East/Iraq/kurd-elite-women-army-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2014_07_17__1540931695.html","title":"Kurdish Female Elite Forces Prepare to Battle ISIS in Iraq","title_page":"Kurdish Female Elite Forces Prepare to Battle ISIS in Iraq | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Since the jihadist terror group the Islamic State (formerly the Islamic State of Iraq and al-Sham–ISIS) began its onslaught on Iraq and conquered large swaths of northern Iraq, Iraqis opposed to their murderous jihadist agenda have relied on the Kurdish army, the Peshmerga, to fight back, while the Iraqi military fled or was massacred.\nThe Peshmerga have deployed an unprecedented number of troops in the region, and many attribute to their efforts the fact that, until now, Baghdad is safe from the ISIS threat. But there is something special about one battalion of the Peshmerga formed in 1996 to battle Saddam Hussein loyalists: it is exclusively female.\nAccording to the BBC, the female Peshmerga, led by unit commander Col. Nahida Ahmed Rashid, train intensively, most on a daily basis. Others, the mothers in the group, must make room for caring for their children and come to training twice a week. They are preparing to enter the front lines against ISIS–not serve as auxiliary troops–and receive intensive training in weapons usage and engaging in battle with their male opponents.\n“They’ve been trained with SWAT teams and with the special forces,” says Col. Rashid, explaining that some even have battle experience: “Some have already fought alongside their male colleagues on the front line and I’m sending others to Kirkuk soon. I was in Kirkuk myself recently.” Kirkuk remains out of the hands of ISIS largely because of the efforts of the Peshmerga. The Kurds have taken over oil facilities in Kirkuk that could have significantly aided ISIS efforts into other major cities, controlling the oil facilities and asking Iraqi government workers to leave.\nMale Peshmerga have attested to international news outlets the difficulty of fighting ISIS jihadists. Since jihadists believe that death will lead to eternal gifts in the afterlife, many arrive on the battlefield hoping to die, so killing them does not deter them from fighting. The hard part is killing somebody who already wants to die,” one soldier told NBC News last month.\nAll of the female Peshmerga are volunteers, and those who spoke to the BBC all appear excited to enter the battlefield. “They’ve taken up arms and gone to battle to protect Kurdistan, but also to say that there’s no difference between men and women,” explains Col. Rashid, who notes that the battle, in many ways, is about defending women from jihadist extremism: “They join because they want to defend other women in areas of conflict.”\nCol. Rashid herself is a mother, and says her daughter begs to come to the battlefield with her, though she, of course, cannot. “”I have a daughter – she’s 10 years old – and when she sees the videos of Isis attacks on Facebook and on the internet, she tells me: ‘Please mum, when you go to fight on the front line, please just take me with you.'”\nBelow, the Associated Press released raw footage of the female Peshmerga in training:","url":"https://www.breitbart.com/national-security/2014/07/17/Kurdish-Female-Elite-Forces-Prepare-to-Battle-ISIS-in-Iraq/"}
