{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:35:23","date_modify":"2018-10-30 20:35:23","date_publish":"2016-03-19 04:11:48","description":"Kurds will combine three Kurdish-led autonomous areas in northern Syria into a federal system, Kurdish officials have announced.","filename":"data/vaneerConsumption/KurdsDeclareDeFactoFederalRegioninNorthernSyria.json","image_url":"https://media.breitbart.com/media/2016/03/ypg-kurds-in-syria-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_1_bc66e225d9d352f2789ed11c0588351d__1540931723.html","title":"Kurds Declare De-Facto Federal Region in Northern Syria","title_page":"Kurds Declare De-Facto Federal Region in Northern Syria","title_rss":"NULL","source_domain":"breitbart.com","text":"Kurds will combine three Kurdish-led autonomous areas in northern Syria into a federal system, Kurdish officials have announced.\nThe announcement comes after the Kurds were excluded from talks in Geneva to resolve Syria’s civil war, which has been raging since March 2011.\nReuters reports, “The step aims to combine three Kurdish-led autonomous areas of northern Syrian into a federal arrangement and will be sure to alarm neighboring Turkey, which fears a growing Kurdish sway in Syria is fueling separatism among its own minority Kurds.”\n“A conference in the Kurdish-controlled town of Rmeilan on Wednesday discussed a ‘Democratic Federal System for Rojava – Northern Syria,’ and ended with a decision to make the announcement at a news conference on Thursday,” it adds. “Rojava is the Kurdish name for northern Syria.”\nOn Thursday, Syria’s Kurds did declare a de-facto federal region in Kurdish-controlled areas of northern Syria, reports the Associated Press (AP).\nThe move drew sharp rebuke from both the Bashar al-Assad regime in Syria and its opponents who condemned the unilateral move as unconstitutional and setting a dangerous precedent.\n“In Syria’s civil war, Kurdish fighters have emerged as the most effective fighting force against the Islamic State group and are backed militarily by the United States,” notes AP. “More recently, Russia has backed them politically.”\n“But despite Russia’s insistence that they should be part of the talks that started this week in Geneva, they have not been invited because Turkey considers the group to be a terrorist organization,” it adds.\nTurkey has linked the U.S. backed Kurdish Democratic Union Party (PYD) that controls large swathes of northern Syria and its armed wing, the People’s Protection Units (YPG), to the Communist separatist group known as the Kurdistan Workers’ Party (PKK). The PKK has been deemed a terrorist group by Turkey and the United States.\nHowever, unlike Turkey, the United States considers the PYD an ally in the fight against the Islamic State (ISIS/ISIL) in Syria. Nevertheless, the U.S. has warned the PYD not to support the PKK in Turkey.\nBesides the Damascus government, the Syrian Kurd’s move to declare autonomy has also drawn condemnation from Turkey and even the United States, Reuters reports.\nCiting a foreign ministry source, the state-controlled Syrian Arab News Agency (SANA) reports, “Any such announcement has no legal value and will not have any legal, political, social or economic impact as long as it does not reflect the will of the entire Syrian people.”\n“Syria must remain as one without being weakened and the Syrian people must decide on its future in agreement and with a constitution,” added an official in Turkey, according to Reuters. “Every unilateral initiative will harm Syria’s unity.”\nEven the United States, which has backed the Syrian Kurds, expressed dissatisfaction.\n“We don’t support self-ruled, semi-autonomous zones inside Syria. We just don’t,” said John Kirby, a State Department spokesman.\n“What we want to see is a unified, whole Syria that has in place a government that is not led by Bashar al-Assad, that is responsive to the Syrian people. Whole, unified, nonsectarian Syria, that’s the goal,” he added.","url":"https://www.breitbart.com/national-security/2016/03/18/kurds-expected-to-combine-kurdish-controlled-areas-in-n-syria-into-federal-system/amp/"}
