{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:16:49","date_modify":"2018-10-30 20:16:49","date_publish":"2016-02-19 19:53:59","description":"The Kurdistan Freedom Falcons (TAK), a separatist terrorist group tied to the PKK, said it carried out the Ankara bombing Wednesday.","filename":"data/vaneerConsumption/KurdishPKKSplinterGroupClaimsResponsibilityforAnkaraBombing.json","image_url":"https://media.breitbart.com/media/2016/02/GettyImages-511263306.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_02_19__1540930609.html","title":"Kurdish PKK Splinter Group Claims Responsibility for Ankara Bombing","title_page":"Kurdish PKK Splinter Group Claims Responsibility for Ankara Bombing","title_rss":"NULL","source_domain":"breitbart.com","text":"The Kurdistan Freedom Falcons (TAK), a separatist terrorist group that primarily operates in northern Iraq and southeastern Turkey, said it carried out the successful car bomb attack on the Turkish capital, Ankara, that killed 28 people Wednesday.\nTAK, in a statement posted online, said it carried out the attack to avenge Turkish military operations against Kurdish rebels in southeast Turkey.\n“This act was conducted to avenge the massacre of defenseless, injured civilians,” the group said, in reference to a large-scale Turkish military attack against militants in the town of Cizre, reports The Associated Press (AP).\n#BREAKING Pro-PKK ANF reports that PKK splinter group Kurdistan Freedom Falcons (TAK) claimed the responsibility for Ankara attack — Ragıp Soylu (@ragipsoylu) February 19, 2016\n“Rights groups have raised serious concerns over the operation in the town, which has been placed under a curfew that prevents journalists and observers from entering,” notes AP.\nIn 2008, the TAK was deemed a Specially Designated Global Terrorist group by the United States. The group is “responsible for multiple terrorist attacks in Turkey, which targeted tourist locations, military sites, and government buildings, resulting in several deaths,” according to the U.S. government.\nOn Thursday, Turkey’s leaders blamed their top enemies – including the Syrian government and the U.S.-backed Kurdish People’s Protection Units (YPG), which is the military arm of the Democratic Union Party (PYD) – saying they had conducted the attack in coordination with the Kurdistan Workers’ Party (PKK), a U.S. designated terrorist group, and vowing strong retaliation against the perpetrators.\nDue to their affiliation to the PKK, the PYD and YPG are considered to terrorist groups by Turkey, but not the United States.\nAlthough the TAK named the suicide bomber as Abdulbaki Sonmez, Turkey’s Prime Minister Ahmet Davutoglu identified Syrian national Salih Neccar, a YPG member, as the attacker.\nFollowing the bombing, Turkey stepped up pressure on the United States and other allies to cut off support to the YPG.\nHowever, the YPG has been deemed the most effective ground force against the Islamic State (ISIS/ISIL).\nThe U.S. National Counterterrorism Center (NCTC) has directly linked the TAK to the PKK, calling it the “urban terrorist wing” of the cult-like Marxist-inspired group, which has been officially designated a terrorist group by the United States and some of its allies.\nHowever, TAK has also been described as a PKK splinter group led by commanders who have split because of dissatisfaction with its tactics, Ekurd Daily reports.\nTAK has been using terrorist tactics since 2005, notes the NCTC.\nOn Friday, the state-run Anadolu Agency revealed that “Turkish authorities said they had detained three more suspects in connection with the bombing in Ankara, raising the number of people in custody to 17,” adding that “the latest suspects are believed to be linked to the PKK.”\nTurkey has reportedly continued its military campaign against YPG positions in Syria despite international opposition.\nPresident Recep Tayyip is quoted by AP as saying Friday that “Turkish authorities don’t have the slightest doubt that the YPG and its political arm, the Democratic Union Party, or PYD, were behind the bombing and said Turkey was saddened by its Western allies’ failure to brand them as terrorist groups.”\nU.S.-backed PYD leader Salih Muslim has denied his group was behind the attack, and he warned Turkey against taking ground action in Syria.\nErdogan told reporters Friday he would soon express his concerns about the Syrian Kurdish groups alleged role in the Ankara attack to President Obama.\nThe recent suicide bombing was the second bombing in the capital in four months.","url":"https://www.breitbart.com/national-security/2016/02/19/3088296/"}
