{"authors":["Associated Press"],"date_download":"2018-10-22 23:43:25","date_modify":"2018-10-22 23:43:25","date_publish":"2017-03-10 03:59:23","description":"SYDNEY (AP) - Utility back Kurtley Beale has left English club Wasps to sign with the New South Wales Waratahs and the Australian Rugby Union for two...","filename":"data/vaneerConsumption/KurtleyBealereturnsfromEnglandtoplayforWaratahs.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4299880_Kurtley-Beale-returns-England-play-Waratahs_1540251805.html","title":"Kurtley Beale returns from England to play for Waratahs","title_page":"Kurtley Beale returns from England to play for Waratahs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"SYDNEY (AP) - Utility back Kurtley Beale has left English club Wasps to sign with the New South Wales Waratahs and the Australian Rugby Union for two years.\nThe ARU said Friday the 28-year old Beale, a 60-test veteran, would remain with Australian rugby until the end of 2019 and would remain eligible to represent Australia.\nBeale said from England on Thursday that he would not take up a second-year option with Wasps, despite a reported first-season figure of about $1 million that made him the highest paid player in the English Premiership.\n\"It's great to be heading back to Australian rugby,\" Beale said in a statement issued by the ARU. \"l have to say thank you to Wasps, though, for the opportunity they have given me and my partner and I have learned a lot about rugby and myself. It's been a great experience.\"\nWallabies coach Michael Cheika said it was good to have Beale back.\n\"Even though he's only been gone a year, it's a very different Wallabies team now,\" Cheika said. \"He will have an important role to play for Australia, and the Waratahs as well.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4299880/Kurtley-Beale-returns-England-play-Waratahs.html"}
