{"authors":["Michael Lucchese"],"date_download":"2018-10-30 21:18:39","date_modify":"2018-10-30 21:18:39","date_publish":"2015-06-29 22:14:17","description":"Kuwaiti authorities have announced that they believe they know that the ISIS-linked suicide bomber who killed dozens of people in a Shia mosque this Friday is a Saudi national. Kuwait’s Interior Minister identified the attack as Fahad Suleiman Abdulmohsen-Gabaa.","filename":"data/vaneerConsumption/KuwaitIdentifiesISISSuicideBomberResponsibleforMosqueAttack.json","image_url":"https://media.breitbart.com/media/2015/06/ap_ap-photo1758-e1435615128264.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_06_29__1540934319.html","title":"Kuwait Identifies ISIS Suicide Bomber Responsible for Mosque Attack","title_page":"Kuwait Identifies ISIS Suicide Bomber Responsible for Mosque Attack","title_rss":"NULL","source_domain":"breitbart.com","text":"Kuwaiti authorities have announced that they believe they know that the ISIS-linked suicide bomber who killed dozens of people in a Shia mosque this Friday is a Saudi national. Kuwait’s Interior Minister identified the attack as Fahad Suleiman Abdulmohsen-Gabaa.\n“The person responsible for the terrorist blast in Kuwait arrived at Bahrain International Airport from Riyadh [the Saudi capital] on June 25. He remained in [the] transit area until he left for Kuwait… on Friday, June 26,” Bahrain’s Ministry of Information said.\nThe Kuwaiti officials also said that the terrorist was in Kuwait illegally.\nAt least 200 have been arrested in the aftermath of the bloody attack, including the owner and the driver of the car that took the bomber to the mosque. The driver of the car, Abdulrahman Sabah Eidan Saudi, belongs to Kuwait’s Bidoon minority, which claims it is oppressed by the Kuwaiti government’s policies.\nShortly after the attack, ISIS claimed responsibility for it.\nThe mosque was run by Muslims of the Shiite denomination, which ISIS views as heretical and evil. About a third of Kuwait’s population are Shiite Muslims.\nISIS posted a recording of the attacker on social media shortly after the blast. In the audio, he is identified as Abu Suleiman al-Muwahid, presumably a pseudonym.\nIn the recoding, the suicide bomber warned his “enemies” that “what comes next will be worse and more bitter.”\nThe bombing was one of three major Muslim terror attacks committed on Friday.\nIn France, a man was beheaded and terrorist drove a car into a gas facility, triggering a massive explosion. In Tunisia, a Muslim gunman opened fire at a coastal tourist town and killed at least 36, injuring dozens more.\nPentagon officials are saying that it is too early to say if the attacks were connected, but all three were motivated by militant Islam. A hashtag praising these “lone wolf” terrorists trended among ISIS fighters on Friday.\n“This Friday is a holy day for Muslims,” one extremist tweeted.\nMany Muslims online are approvingly calling the trio of attacks “Bloody Friday.” This Friday, ISIS fighters also snuck into the city of Kobani, currently being held by Kurdish forces, and massacred at least 150 civilians.","url":"https://www.breitbart.com/national-security/2015/06/29/kuwait-identifies-isis-suicide-bomber-responsible-for-mosque-attack/"}
