{"authors":["Belinda Cleary For Daily Mail Australia"],"date_download":"2018-10-22 22:46:15","date_modify":"2018-10-22 22:46:15","date_publish":"2017-03-10 01:31:25","description":"The devastated grandmother of Kyhesha-Lee Joughin has revealed she was supposed to mind the little girl the weekend she died, but she couldn't get to Brisbane to collect her.","filename":"data/vaneerConsumption/KyheshaLeesgrandmawasmeanttoseeherdayshedied.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1EB11B00000578-0-image-a-31_1489101649241.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4295756_Grandma-Kyhesha-Lee-meant-day-died_1540248375.html","title":"Kyhesha-Lee's grandma was meant to see her day she died","title_page":"Kyhesha-Lee's grandma was meant to see her day she died | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The devastated grandmother of Kyhesha-Lee Joughin has revealed she was supposed to mind the little girl the weekend she died, but her car broke down and she was not able to get to Brisbane to collect her.\nThe tragic twist in the child's heartbreaking death was revealed to a Brisbane court by the three-year-old girl's maternal grandmother Tanya Coyne, who said she is still haunted by knowing the child should have been in her care that Easter weekend in 2013.\nKyhesha-Lee was living with her father, Matthew Lee Williamson, in the Brisbane suburb of Petrie, when she died from horrific internal injuries sustained after days of abuse, the court has been told.\nDaily Mail Australia can reveal Ms Coyne had arranged to pick up Kyhesha-Lee from her father's flat and take her to spend the Easter weekend with her mother Danielle Joughin, who she had not seen for nine months.\n'We were actually going to have her that weekend, but our car broke down and we could not make it,' Mrs Coyne wrote in a victim impact statement to the court.\nKyhesha-Lee dies after days of physical and sexual abuse in her home in Petrie, Brisbane where she lived with her father Matthew Williamson and housemate Christopher Kent\nTanya Coyne, pictured here with her daughter Tammy and partner Doug Joughin, who is Kyhesha's grandfather\n'We thought it would be better anyway for Kyhesha to spend Easter with her father,' Mrs Coyne said\n'We thought it would be better anyway for Kyhesha to spend Easter with her father,' Mrs Coyne said.\nMrs Coyne rearranged the custody and planned to have Kyhesha-Lee the following weekend.\nBut the little girl didn't live long enough to take the trip to her grandma's.\nAt 2.36pm on March 30 her father, Williamson, who has plead guilty to manslaughter, called Triple-0 after he found his daughter's lifeless body on the loungeroom floor.\nCourt documents revealed in addition to her horrific injuries, Kyhesha-Lee's head had been shaved and her hair was just one 1cm long to disguise bald patches where chunks had been pulled out.\nMrs Coyne wrote in her victim impact statement that she felt 'numbness, disbelief, confusion, shock, angry and helplessness' when she found out her granddaughter was dead.\n'The final days of her life horrific injuries and what happened to her and her suffering will always haunt our minds.\n'The helpless mess we feel about not being there will haunt us for a very long time.'\nCourt documents revealed in addition to her horrific injuries, Kyhesha-Lee's head had been shaved and her hair was just 1cm long to disguise bald patches where chunks had been pulled out. She is pictured here with her mother Danielle Joughin\n'The final days of her life horrific injuries and what happened to her and her suffering will always haunt our minds,' Kyhesha's grandma said\nKyhesha during a trip to her mother's home in 2012\nDevastated grandparents had plans 'to spoil' Kyhesha\nMrs Coyne, who is engaged to Doug Joughin, Kyhesha Lee's maternal grandfather, had assumed the role of grandmother to the child.\nShe was 'looking forward' to Kyhesha Lee's visit because she hadn't seen the little girl for 'a very long time', according to her statement.\n'The last time we spoke to Kyhesha she was not well but the time before that she was going to paint us a bunny rabbit picture which we never got and never will,' Mrs Coyne said.\nMrs Coyne said her family had plans 'to spoil' Kyhesha-Lee the day they received the heart-breaking call to say she had died.\n'We were actually buying all the grandkids their Easter eggs and toys,' she said.\nDanielle Joughin and Doug Joughin leaving court during Matthew Williamson's trial\nMatthew Lee Williamson with supporters outside court\nMs Joughin's sister Tammy, the child's aunt, has suffered post-traumatic stress disorder since the tragedy.\n'Our daughter Tammy had plans to take Kyhesha on a girl's day out, shopping for clothes and to the movies. She was so excited,' Ms Coyne said.\n'Tammy has never gone back to the same girl we had three years ago, she will not talk about it and will not acknowledge it, it is so hard for to all watch her like this.\n'We watched a happy young girl become so depressed and upset.'\nA mother's heartbreaking goodbye\nMrs Coyne said in her statement she has had to 'hold it together' for her family despite being diagnosed with depression following her granddaughter's death.\nMrs Coyne described her step-daughter's distress at having to say goodbye to Kyhesha-Lee at the little girl's funeral.\n'Nothing could prepare Danielle for how she would be affected seeing her little girl lying motionless.'\n'I will never forge the pleas and gut wrenching crying that came out of the grieving mother saying goodbye to her little girl,' Mrs Coyne said\nIt was the last time Danielle would see her daughter - and according to Mrs Coyne she dressed her in a 'really pretty dress, shoes and matching ID bracelets'.\n'The dress was so pretty it was white with clear gemstones on it.\n'Her shoes were white with matching crystal-like butterflies on them.\n'I will never forget the pleas and gut wrenching crying that came out of the grieving mother saying goodbye to her little girl,' she wrote.\n'The hardest thing any father could do was to pull his daughter Danni away from her own daughter when it was time to go.'\nKyhesha-Lee playing with dolls the year before she was killed in her father's home\nDanielle Joughin with her daughter, who lived full-time with her father after the couple's separation\n'I can't pry her mouth open... move her arms'\nDaily Mail Australia can reveal the moment Williamson called Triple-0 for help.\n'My daughter's not breathing... I fell asleep on the couch,' he said.\n'She's stiff its like rigor mortis.'\n'I can't pry her mouth open.. can't move her arms.'\nWilliamson's former housemate Christopher Kent, who also plead guilty to manslaughter after Kyhesha-Lee's death, left the house before the ambulance arrived at 2.46pm.\nHe was found in Grafton the following day - but blames Williamson for Kyhesha Lee's physical and sexual injuries and said he told him to 'hide the bong' kept in the apartment before he would call for help.\nKent, who is currently serving time in a NSW prison for an unrelated matter, testified against Williamson during his sentencing for manslaughter - which has been adjourned until March 16.\n'Everyday I would come home to another bruise,' Kent said in a statement to the court.\nChristopher Kent, who also plead guilty to manslaughter after Kyhesha's death, left the house before the ambulance arrived at 2.46pm\nAt 2.36pm on March 30 her father, Matthew Williamson, pictured, who has plead guilty to manslaughter, called 000 after he found his daughter's lifeless body on the loungeroom floor\nDanielle Joughin pictured with her daughter Kyhesha-Lee during one of their visits\nKent, who the court head was involved in an 'unorthodox sexual relationship' with Williamson, had lived with him and Kyhesha since January or February 2013.\nHe said Williamson, who generally slept through the day, would lock his daughter in her bedroom for hours on end and would become enraged when the distressed girl threw her faeces inside the room.\nWilliamson admitted using rope to keep Kyhesha locked away but claimed it was to stop her from getting out at night.\nHe also denied a raft of abuse allegations, including using a large sex toy on Kyhesha, punching her in the stomach, posing naked with her and pulling on her ear until it bled.\nThe young girl was 'found dead on the loungeroom floor' according to her father\nKyhesha-Lee was tied to her bed and locked in her bedroom by her father - a court heard\nWilliamson had custody of Kyhesha since splitting with her mother Danielle Joughin in 2010. The pair lived with his father until October 2012 when they moved into the Petrie apartment where she died.\nThe three-year-old went to childcare on March 21 and looked healthy - but by March 29 she had a swollen and bruised face, court documents reveal.\nA man that Williamson had casual sex with went to the two-bedroom apartment the night before Kyhesha died, and told him he should take her to the hospital because her face was bruised and swollen.\nDanielle Joughin outside the Supreme Court where her ex-partner is to be sentenced for the death of their daughter Kyhesha-Lee\nKyhesha 'in serious pain days before death'\nWilliamson didn't want to 'lose custody of her' so never took her to see a doctor - even though she had green vomit, was bleeding in her nappy and was dehydrated and lethargic.\nThe injuries were treatable, according to medical experts - who said if she was taken to the medical centre located just 500m from her house she would have lived.\nAccording to court documents obtained by Daily Mail Australia, Kyhesha would have been in serious pain in the days leading up to her death.\nHer bowel had been ruptured after she was hit in the stomach while she was lying on a hard surface which caused her bowel to rupture.\n'Nothing could prepare Danielle for how she would be affected seeing her little girl lying motionless' her step-mother said\nKyhesha-Lee had not seen her mother, Danielle, since June or July the year before her death\n'The hardest thing any father could do was to pull his daughter Danni away from her own daughter when it was time to go'\nThis caused an infection which soon went septic - experts told the court Kyhesha would not have been able to eat, drink or move in the 12 hours before her death.\nAfter hearing two days of evidence at a sentencing hearing, Justice Roslyn Atkinson adjourned the matter until Thursday March 16, where she is expected to hand down her findings as to what role Williamson played in Kyhesha's death and his appropriate punishment.\nWilliamson barrister Michael Copley has requested a report into whether a 'psychological abnormality' contributed to his conduct towards Kyhesha-Lee.","url":"https://www.dailymail.co.uk/news/article-4295756/Grandma-Kyhesha-Lee-meant-day-died.html"}
