{"authors":["Amy Lyall For Daily Mail Australia"],"date_download":"2018-10-23 00:31:59","date_modify":"2018-10-23 00:31:59","date_publish":"2016-01-29 13:34:39","description":"New clip reveals Kyle Sandilands was lost for words when a busty Jackie 'O' Henderson arrived on-set for the latest KIISFM campaign earlier this month.","filename":"data/vaneerConsumption/KyleSandilandsisshockedatcohostJackieOHendersoncleavage.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/05/30AEE49A00000578-0-image-a-88_1454043917830.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422175_Kyle-Sandilands-shocked-host-Jackie-O-Henderson-arrives-shoot-eye-popping-cleavage_1540254719.html","title":"Kyle Sandilands is shocked at co-host Jackie 'O' Henderson cleavage","title_page":"Kyle Sandilands is shocked at co-host Jackie 'O' Henderson cleavage | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Radio shock jock Kyle Sandilands isn't often short of words when it comes to voicing his opinions.\nBut as Jackie 'O' Henderson arrived on-set for the latest KIISFM advert earlier this month, her co-host only had one word, 'Jesus!'\nJackie flashed a busty display in a plunging black Carla Zampatti jumpsuit, which left Kyle in shock.\nLost for words: Shock jock Kyle Sandilands could only muster one word as busty co-host Jackie 'O' Henderson arrived on-set for their promotional photoshoot earlier this month\nPlunging and pushed up: In a behind the scenes clip from their recent campaign shoot, released on Thursday, even Jackie herself made a reference to her ample chest\nThe designer outfit features a nude-colour sheer mesh panel down the front, showcasing her cleavage.\nIn a behind-the-scenes clip of their recent campaign shoot, released on Thursday, even Jackie herself made a reference to her ample chest.\nJackie and Kyle happily posed for promotional shots together, although it was later revealed that she wasn't comfortable with the amount of cleavage that was exposed.\nNot willing to bare it all: Jackie convinced the radio station to digitally alter the image and cover up more of her cleavage for billboard advertisement\nA shy Jackie convinced the radio station to digitally alter the image and cover up more of her cleavage for billboards.\nWhile on-air earlier this month, Kyle who likes to tease his partner-in-crime demanded that all billboards be changed to the original shot for one hour to put her assets on display.\nThe official Kyle and Jackie O Instagram account posted an image that compared the digitally altered and raw photographs.\n'Spot the difference?' Kyle and Jackie O's Instagram revealed both the digitally altered and raw image in a side-by-side comparison when the billboards were changed earlier this month\nThe image was captioned: 'Spot the difference?! The left is the digitally altered photo, the right is the original... On all digital billboards for an hour!'\nAs the billboards were plastered along the street, the caption was finished with 'Be safe on the road guys' no doubt a reference to her traffic stopping cleavage.\nThe digitally altered version of the image, where Jackie is more conservatively covered up is the final shot used in the advertisement, though a subtle hint of her cleavage is still visible.\nCovering up: The digitally altered version of the image, where Jackie is more conservatively covered up is the final shot used in the advertisement, though a subtle hint of her cleavage is still visible\nJackie is not the first famous face to wear the cleavage-enhancing Carla Zampatti jumpsuit.\nSinger Tina Arena modelled the design while on stage at the ARIA Awards last November, collecting her Hall Of Fame trophy and talking about ageing gracefully in the industry.\nFurthermore Terry Biviano was spotted in the ensemble weeks later at a Sydney social event.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422175/Kyle-Sandilands-shocked-host-Jackie-O-Henderson-arrives-shoot-eye-popping-cleavage.html"}
