{"authors":["Alicia Vrajlal For Daily Mail Australia"],"date_download":"2018-10-22 20:50:49","date_modify":"2018-10-22 20:50:49","date_publish":"2016-01-28 04:14:56","description":"Despite his recent health concerns, Kyle Sandilands appears to still be living large.","filename":"data/vaneerConsumption/KyleSandilandshidesfigureunderblackTshirt.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/03/30A6753600000578-0-image-a-42_1453951235993.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420327_Kyle-Sandilands-hides-figure-black-T-shirt_1540241449.html","title":"Kyle Sandilands hides figure under black T-shirt","title_page":"Kyle Sandilands hides figure under black T-shirt | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"At the end of last year he vowed to lose weight citing health concerns as a reason to slim down.\nBut it appears that Kyle Sandilands is still very much struggling with his battle with the bulge.\nThe 44-year-old KIIS 106.5 FM breakfast radio star was spotted at Sydney's Woolloomooloo on Thursday and the shock jock did his best to conceal his figure under a loose-fitting black T-shirt.\nHe teamed the top with a pair of grey shorts, while his footwear of choice was a pair of suede laced up boots.\nScroll down for video\nOut and about: Kyle Sandilands was spotted at Sydney's Woolloomooloo on Thursday, the shock jock doing his best to conceal his portly figure under a loose-fitting black T-shirt\nCompleting his look with some signature accessories, Kyle wore a black cap to match his T-shirt, and a pair of dark sunglasses.\nMaking his way along the sidewalk outside the Sienna Marina restaurant, the media personality clutched onto his mobile phone.\nLast year Kyle was in the news with growing concerns for his health after missing a number of radio shows and even failing to show up as a guest co-host on The Project.\nWhen appearing on The Morning Show in August, the shock jock attempted to silence the fat-shamers by stripping off and showing his body in all its glory.\nSandilands style: Completing his look with some signature accessories, Kyle wore a black cap to match his T-shirt, and a pair of dark sunglasses\nOn the move: The media personality was seen getting out of his car, close to the Sienna Marina restaurant\n'This is an Australian man,' he said as he stripped out of a black T-shirt during the rare TV appearance.\n'I have been fat shamed over all the newspapers and magazines but Australia here it is.'\nThe unexpected move by Kyle came as a shock to his radio co-host Jackie O and the Morning Show co-hosts Larry Emdur and Kylie Gillies, leaving them trying to gasp for words while laughing.\nHere it is: The controversial shock jock ripped his shirt off on live TV in August last year and revealed his protruding belly during an appearance on The Morning Show\nWhat a difference a decade makes! A slimmer Kyle back in October 2005 at the Australian Commercial Radio Awards in Sydney\nPutting jokes aside, Kyle revealed he has become aware that something desperately needs to be done to improve his health and figure.\n'I think I am going to have to do something about the weight,' he said.\n'I am a mess and would like to live a bit longer,' he added before stating he will be having 'an operation in December,' leaving out the in-depth details.\nKyle is yet to speak on air this year about the operation if it did take place.\nTrimmer: Kyle in 2005 (L) and in 2010 (R) walking red carpets","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420327/Kyle-Sandilands-hides-figure-black-T-shirt.html"}
