{"authors":["Heidi Parker For Dailymail.Com"],"date_download":"2018-10-23 04:01:11","date_modify":"2018-10-23 04:01:11","date_publish":"2016-01-28 19:47:41","description":"Three months ago, all seemed pleasant with the Calabasas clan as evidenced in a new teaser for Sunday's episode of KUWTK . In it, Kylie is beaming as she talks babies.","filename":"data/vaneerConsumption/KylieJennertalksbabieswithTygainKUWTKclip.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30AD259600000578-0-image-a-89_1454010434220.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421419_Kylie-Jenner-18-babies-brain-says-likely-two_1540267271.html","title":"Kylie Jenner talks babies with Tyga in KUWTK clip","title_page":"Kylie Jenner talks babies with Tyga in KUWTK clip | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"When news broke on Monday that Blac Chyna was dating Rob Kardashian, the whole family went into meltdown with Khloe throwing out Godfather quotes on Instagram and Kris Jenner talking about her 'difficult' day.\nBut three months ago, all seemed pleasant with the Calabasas clan as evidenced in a new teaser for Sunday's episode of Keeping Up With The Kardashians.\nIn it, Kylie is beaming as she talks babies with beau Tyga - who has a son with Chyna - by her side.\nSee Kylie Jenner updates as as she talks babies with Tyga in KUWTK clip\nBig plans: Kylie Jenner looked excited as she talked about having children while beau Tyga sat next to her in a teaser for Sunday's Keeping Up With The Kardashians\nMaking trouble: The KUWTK clip was shot months before Blac Chyna started dating Rob Kardashian, which has upset the entire family\nKylie is only 18 years old, but she has baby on the brains clearly.\nShe tells parent Caitlyn Jenner that she thinks waiting until age 30 to get pregnant is too late.\nThe beauty also said she thinks she will have two little ones.\nHer ideas: She tells parent Caitlyn Jenner that she thinks waiting until age 30 to get pregnant is too late. The beauty also said she thinks she will have two little ones\nThe scene takes place at Kim Kardashian's 35th birthday party in October.\nKylie, Tyga and Caitlyn are seated at a bench while they nosh on carnival fare.\nThe Pac Sun model begins the conversation by asking the former Olympian: 'What do you feel like is a good age to have kids? Like 25?'\nKiddos: The Pac Sun model begins the conversation by asking Caitlyn: 'What do you feel like is a good age to have kids? Like 25?'\nCaitlyn, dressed in black lace with her hair and makeup nicely done, shoots back: 'Thirty's a good age. Thirty's a good age.'\nThe I Am Cait star does not ask if her youngest child wants to pro-create.\nKylie, wearing black and with her locks cut short, says, 'I feel like 30's too late. Every psychic said I'm only gonna have two kids.'\nTips: Caitlyn, dressed in black lace with her hair and makeup nicely done, shoots back: 'Thirty's a good age. Thirty's a good age.' The I Am Cait star does not ask if her youngest child wants to pro-create\nHer goals: Kylie, wearing black and with her locks cut short, says, 'I feel like 30's too late. Every psychic said I'm only gonna have two kids'\nTyga - who already has a child with model Blac Chyna - just laughs along and does not seem ruffled by his girlfriend's admission.\nCailtyn, who is steadily enjoying her meal, adds: 'When you have one you might as well have two.\n'And you want your kids close together, that's why we had you. Might as well have the two so they have somebody to grow up with.'\nKylie looks shocked and opens her mouth.\nOh Cait! Cailtyn, who is steadily enjoying her meal, adds: 'When you have one you might as well have two. 'And you want your kids close together, that's why we had you. Might as well have the two so they have somebody to grow up with'\n'Oh OK! So I'm just...'\nThe Cait interrupts: 'Somebody for Kendall to grow up with.' Caitlyn says this matter-of-factly but it's clear the Vanity Fair cover model is trying to be witty.\n'I'm the one to keep Kendall company,' Kylie laughs. Tyga laughs too.\n'Yeah,' Caitlyn says.\nWeird comment: Caitlyn tells Kylie she had her so Kendall would have 'somebody to grow up with'; here Kendall in seen in Barcelona on Thursday\nCaitlyn then goes on to tell Kylie she has to have 'at least three' kids so she can have 30 grandchildren.\nAgain the Balmain model looks astonished.\nThis comes just after Tyga's ex Chyna was revealed to be dating Kylie's brother Rob Kardashian, who is overweight and suffers from diabetes.\nThis photo launched 1000 emails: Rob with his arm around Chyna in a photo shared Monday\nOn Thursday it was reported Khloe Kardashian kicked the only son of Kris Jenner out of her Calabasas house because he was drinking alcohol with Blac in her kitchen.\nRob is supposed to be sober.\nAlso on Thursday, Kylie reportedly has said she wants to be single amid all the controversy.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421419/Kylie-Jenner-18-babies-brain-says-likely-two.html"}
