{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:32:44","date_modify":"2018-10-22 23:32:44","date_publish":"2016-01-11 06:22:24","description":"Kylie Jenner and Kourtney Kardashian teamed up for a girls' night out at a Golden Globes after party on Sunday.","filename":"data/vaneerConsumption/KylieJennerandKourtneyKardashianattendGoldenGlobeAwards2016afterparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/300644B500000578-0-image-a-53_1452505092337.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393443_Forget-bad-boys-Kylie-Jenner-Kourtney-Kardashian-party-away-worries-glittering-girls-night-Golden-Globes-party_1540251164.html","title":"Kylie Jenner and Kourtney Kardashian attend Golden Globe Awards 2016 after party","title_page":"Kylie Jenner and Kourtney Kardashian attend Golden Globe Awards 2016 after party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kylie Jenner and Kourtney Kardashian teamed up for a girls' night out at a Golden Globes after party on Sunday.\nThe 18-year-old reality star and her older sister, 36, both put on a dazzling show in sparkly dresses at the InStyle And Warner Bros bash at the The Beverly Hilton Hotel.\nThe pair have had their fair share of boy drama lately; Kylie's boyfriend Tyga has been accused of cheating with a Brazilian model while Kourtney split with Scott Disick earlier this year after he was pictured with another woman.\nKourtney, who has three children with Disick, also had a brief fling with Kylie's pal Justin Bieber late last year.\nScroll down for video\nGirls' night out: Kourtney Kardashian and Kylie Jenner partied at the InStyle And Warner Bros party following the Golden Globes on Sunday\nThe next Kim: Kylie, 18, is fast becoming as popular as her big sister and stole the show on the red carpet\nBut both looked eager to party away their worries as they mingled with an A-list crowd at the party.\nKourtney showed off her slim toned figure in a silver strapless Julian Macdonald bustier dress, while his little sis indulged her Cinderella side in an angelic chiffon and sequin two-piece.\nKylie recently revealed that her oldest half-sibling is the best person to go to when she has a problem.\nThe teen said: 'Kourtney probably gives the best life advice, but I go to my sisters for all advice and to each of them for different things.'\nSee the latest Kylie Jenner updates as she and Kourtney party at the Golden Globes party\nHello down there! Kylie is noticeably taller than her older sister and the height difference was evident\nRacy: The youngest of the Kardashian-Jenner sisters had her raven-coloured locks in a bun\nDazzling: The mother-of-three looked in absolutely fantastic shape during the gala outing\nStatuesque: The youngest sibling towered over the eldest at the gala event\nLife in the spotlight: Kylie Instagrammed this picture from the back of her car, no doubt snapped by Kourtney\nFinishing touches: Earlier in the night, Kourtney shared this photo with a caption about her 'date' with Kylie\nSparkle time: Kylie posed up with Bella Thorne at the bash\nSelfie stick: Everyone wanted a picture with the Kardashian-Jenner girls\nSister, sister: The pair showed off their unique styles as they arrived at the event side by side\nHometime! Kourtney certainly looked like she enjoyed her night as she headed out of the party\nHowever, the 'Keeping Up With the Kardashians' star is a big believer in 'self-expression' rather than copying what is stylish or in fashion.\nShe added: 'Other than that, I don't really have anyone I get inspiration from.\n'I just like to be organic and be me. I'm really into self-expression and whoever I'm feeling that day.'\nFresh: Despite her night on the tiles, Kourtney's make-up was completely fresh and preened\nLoved up: Jennifer Lopez was joined by her younger beau Casper Smart\nWow factor: The 46-year-old singer looked stunning as always in a white gown\nHelping hand: The 28-year-old dancer had his arm around his girlfriend's back as she showed off her curvaceous figure\nLooking good: While most of her contemporaries opted to shed more skin, Selena Gomez covered up in a flowy ivory-coloured number\nQueen Cookie: Taraji P Henson showed off her new trophy at the event\nTaking the plunge: Rumer WIllis and Gabrielle Union wore low-cut numbers\nVa va voom: LaVerne Cox stunned in a white fishtail gown\nLarking around: Bella Thorne was completely in her element on the red carpet\nFlower power: Eva Longoria looked great in a white dress with a floral detailing around the hips\nColour coordination: Lea Michele (L) and Maria Menounos (R) also rocked white dresses\nWhen it comes to fashion and beauty, Kylie turns to Kim Kardashian West and her husband Kanye West for inspiration.\nShe said: 'Kim really inspires my look - she inspires me the most.\n'I think my sister and Kanye have great style and the people around them really inspire me.'\nDapper gent: Damian Lewis cut a smart figure as he arrived at the bash\nRavishing in red: Kaley Cuoco definitely turned heads in a low-cut plunging crimson dress with thigh-high split\nFashionista: Kate Bosworth sported a pair of tailored trousers underneath her velvet dress\nDark side: Vanessa Hudgens (left) and Sarah Hyland (right) both rocked black numbers as they did similar poses\nSheer daring: Zoe Kravitz wore a very revealing see-through number\nShimmering: Bella Thorne (left) and Charlie XCX took note from the Kardashian-Jenner girls as they sported shiny, yet numbers\nOooh la la: The thigh was more than the limit for the 23-year-old British singer as she flashed plenty of flesh\nTop of the crops: Kate Hudson was unafraid to show her toned torso\nFitness fan: Kate showed off her hard-earned figure in a bralet and matching skirt\nSensational in silk: Former Glee star Naya Rivera looked incredible in a seriously plunging dress\nGilty pleasure: Regina King wowed in a gold dress\nWonders in white: Jamie Chung (left), Katharine McPhee (centre) and Lea Michele (right) all looked angelic\nJetsetter: Nicole Scherzinger flew over from the UK to attend the star-studded bash\nShining star: Gabourey Sidibe wore a sequined number\nSheer daring: Whitney Port (left) wore a mesh number as Jamie King sported a see-through striped number\nThis year, Kylie has vowed to be more healthy.\nAsked her New Year's resolutions, she told Look magazine: 'Probably just to work out and be healthy.\n'Maybe I'll get a treadmill in my house or something. I mean, I'll try to eat good and go on walks. Maybe do some hiking.'\nBack in black: Melissa George (Left) and Kate Bosworth rocked primarily black looks\nPretty in plum: Alyssa Milano looked wonderful as always\nShowing off: Kat Graham (left) and Niecy Nash both displayed plenty of cleavage\nSunshine: Bridget Moynahan opted for more colour in a shiny yellow strapless number\nBeautiful in blue: Bryce Dallas Howard (left) and Gina Rodriguez each stunned\nGal pals: Gaby Hoffmann, Kathryn Hahn, and Carrie Brownstein - from left to right - seemed to be enjoying hanging out at the star-studded party\nRed alert: Meagan Good and Jackie Cruz looked fantastic in varying shades of red\nCutie in coral: Victoria Justice looked great in a sheer bright red get-up\nMan of the hour: SylvesterStallone proudly showed off his new trophy\nJewel hues: Katherine Schwarzenegger (L) looked lovely in emerald, while Empire's Grace Gealey (R) rocked a sexy red number\nPretty as a picture: Nina Dobrev looked sophisticated as ever in a pink lace number\nBlonde bombshells: Model Kelly Rohrbach (L) and actress Nicola Peltz (R) opted for pale shades\nCute: One Tree Hill star Bryan Greenberg cuddled up to Jamie Chung at the bash\nGolden girl: Breakout star Brie Larson proudly clutched her trophy as she walked the red carpet\n2016 GOLDEN GLOBE AWARDS WINNERS - FILM Best Performance by an Actress in a Motion Picture Drama Cate Blanchett, Carol Brie Larson, Room Rooney Mara, Carol Saoirse Ronan, Brooklyn Alicia Vikander, The Danish Girl Best Performance by an Actor in a Motion Picture Drama Bryan Cranston, Trumbo Leonardo DiCaprio, The Revenant Michael Fassbender, Steve Jobs Eddie Redmayne, The Danish Girl Will Smith, Concussion Best Performance by an Actor in a Motion Picture Musical or Comedy Christian Bale, The Big Short Steve Carell, The Big Short Matt Damon, The Martian Al Pacino, Danny Collins Mark Ruffalo - Infinitely Polar Bear\nBest Performance by an Actress in a Motion Picture Musical or Comedy Jennifer Lawrence, Joy Melissa McCarthy, Spy Amy Schumer, Trainwreck Maggie Smith, The Lady in the Van Lily Tomlin, Grandma Best Screenplay Motion Picture Josh Singer Charles Randolf The Big Short Steve Jobs Quentin Tarantino, The Hateful Eight Best Original Song Motion Picture Love Me Like You Do, Fifty Shades Of Grey One Kind Of Love, Love and Mercy See You Again, Furious 7 Simple Song #3, Youth Writing's On The Wall, Spectre\nBest Motion Picture - Drama Carol Mad Max: Fury Road The Revenant Room Spotlight Best Motion Picture - Musical or Comedy The Big Short Joy The Martian Spy Trainwreck\nBest Motion Picture - Animated Anomalisa The Good Dinosaur Inside Out The Peanuts Movie Shawn The Sheep Movie\nBest Motion Picture - Foreign Language The Brand New Testament, Belgium The Club, Chile The Fencer, Finland/Germany/ Estonia Mustang, France Son of Saul, Hungary Best Performance by an Actress in a Supporting Role in any Motion Picture Jane Fonda, Youth Jennifer Jason Leigh, The Hateful Eight Helen Mirren, Trumbo Kate Winslet, Steve Jobs Alicia Vinkander, Ex-Machina\nBest Performance by an Actor in a Supporting Role in any Motion Picture Paul Dano, Love & Mercy Idris Elba, Beasts of No Nation Mark Rylance, Bridge of Spies Michael Shannon, 99 Homes Sylvester Stallone, Creed Best Director Motion Picture Todd Haynes, Carol Alejandro G Inarritu, The Revenant Tom McCarthy, Spotlight Ridley Scott, The Martian George Miller, Mad Max:Fury Road\nBest Original Score Motion Picture Carol The Danish Girl The Hateful Eight Steve Jobs The Revenant","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393443/Forget-bad-boys-Kylie-Jenner-Kourtney-Kardashian-party-away-worries-glittering-girls-night-Golden-Globes-party.html"}
