{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 20:43:22","date_modify":"2018-10-22 20:43:22","date_publish":"2016-01-28 03:14:38","description":"It's been a drama-filled week so the 18-year-old star will no doubt have lots to talk about on her sister's show Kocktails With Khloe.","filename":"data/vaneerConsumption/KylieJennerarrivestofilmKocktailsWithKhloeamidRobandBlacChynadrama.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/02/30A634B700000578-0-image-a-95_1453949011698.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420275_Kylie-Jenner-arrives-film-Kocktails-Khloe-amid-Rob-Blac-Chyna-drama_1540241002.html","title":"Kylie Jenner arrives to film Kocktails With Khloe amid Rob and Blac Chyna drama","title_page":"Kylie Jenner arrives to film Kocktails With Khloe amid Rob and Blac Chyna drama | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's been a drama-filled week for the TV family so there'll no doubt be lots to talk about on Khloe's new show.\nAnd Kylie Jenner made a stylish appearance at studios in Burbank as she prepared to film a segment for Kocktails With Khloe.\nThe teen TV star was pictured in a slouchy grey jumpsuit which she dressed up with some Christian Dior lace boots.\nScroll down for video\nDesigner darling: Kylie Jenner looked stylish as she arrived at studios in Burbank, California on Wednesday to film a segment for sister Khloe's new show\nKylie even took to Instagram during the day to show off the stunning footwear with a photo which she captioned simply: 'Christian Dior'\nThe star layered on a long black coat over the top of her outfit and carried a Givenchy handbag to complete the look.\nKylie wore her hair in soft waves and clutched her cell phone as she made her way into the studio.\nThe 18-year-old KUWTK star was joined by her eldest sister Kourtney, 36, who made her own statement in a leather jacket and racy lace bodysuit.\nSee more of the latest on Kylie Jenner as she appears on Kocktails with Khloe\nSo chic: The 18-year-old KUWTK star wore a slouchy grey jumpsuit and Christian Dior lace boots\nReady for her close-up: Kylie wore her hair in soft waves and layered on a long black coat\nTV star: Kylie's sister Kourtney looked just as stylish in a racy red lace bodysuit, trousers and black leather jacket\nSean 'P Diddy' Combs was also pictured arriving to film for Khloe's show.\nKocktails With Khloe premiered on FYI last week and the reality star welcomed Brandi Glanville and Snoop Dogg on the girls' night style chat show as well as sister Kendall, 20.\nKhloe revealed via an Instagram taken on set that her guests on this week's episode include Kylie's boyfriend Tyga, Kourtney's ex Scott Disick, BFF Malika Haqq as well as Youtube blogger Jenna Marbles and Rich Kids of Beverly Hills star Morgan Stewart.\nRacy in lace: Kylie showed off her stylish boots with this Instagram snap which she captioned simply 'Christian Dior'\nModeling the look: The TV star revealed cut-outs at the side of her jumpsuit in another Instagram\nShe captioned the image 'Tonight!! #kocktailswithkhloe 10pm on @fyi'\nIt's been an interesting week for the Kardashian clan as it was revealed that Kylie & co's brother Rob, 28, is dating the teen's former love rival Blac Chyna.\nChyna, 27, used to be engaged to Kylie's boyfriend Tyga, 26, and the duo have been flaunting their relationship on social media.\nKhloe made a thinly veiled attack on her brother with an Instagram on Tuesday as she shared a photo from brother-in-law Kanye West's recording studio.\nCheck this out: Kylie didn't caption the poolside shots\nStar-studded: Sean 'P Diddy' Combs also made an appearance for Khloe's show\nTV stars unite: Reality star Snooki was also seen arriving to join in the fun\nKhloe wrote alongside the snap: 'Never go against THE Family. I love Yeezy's studio speeches!!'\nKhloe used the same words, 'never go against the family', during a series of tweets on Monday after Blac Chyna shared an Instagram snap in which she appeared to be cuddling Rob.\nThe 31-year-old took to Twitter, warning: 'You can do anything. But never go against the family.'\nRob has reportedly angered his family by moving out of Khloe's home and into Chyna's.\nThis week's mischief: Kocktails With Khloe airs on Wednesdays on FYI and the reality star revealed her guests for Wednesday's show including Kylie's boyfriend Tyga, Kourtney's ex Scott Disick and pals\nBetrayed: There will be plenty for the siblings to talk about this week after their brother Rob revealed his romance with Tyga's ex-fiancee Blac Chyna via social media\n'Waiting on Zaddy like': Chyna shared some seductive Instagrams on Wednesday\nKeeping up with...: The model is rocking icy blue hair at the moment - just like the hue Kylie was rocking last year\nThe pair are also said to have bonded over their dislike of the Kardashian-Jenner sisters.\n'Rob has been lonely for so long, so of course it's great for him to spend time with someone other than his sisters,' a source told People.\n'Rob has also found an escape from his family nagging him about his heath. He has ignored their attempts to contact him.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420275/Kylie-Jenner-arrives-film-Kocktails-Khloe-amid-Rob-Blac-Chyna-drama.html"}
