{"authors":["Rebecca Davison For Mailonline"],"date_download":"2018-10-22 23:53:16","date_modify":"2018-10-22 23:53:16","date_publish":"2017-04-26 08:45:44","description":"They're rumoured to be dating following Kylie Jenner's recent split from Tyga in April.","filename":"data/vaneerConsumption/KylieJennerandTravisScottlookcosyatNBAgame.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9D39B400000578-0-image-a-100_1493192722401.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446596_Kylie-Jenner-Travis-Scott-NBA-date_1540252396.html","title":"Kylie Jenner and Travis Scott look cosy at NBA game","title_page":"Kylie Jenner and Travis Scott look cosy at NBA game | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They're rumoured to be dating following Kylie Jenner's recent split from Tyga in April.\nAnd the reality star and rumoured new love interest and rapper Travis Scott were pictured for the first time at an NBA game in Houston, Texas, on Tuesday, where they looked rather cosy.\nThe pair sat courtside during Game Five of the Western Conference Quarterfinals game of the 2017 NBA Playoffs at Toyota Center.\nScroll down for video\nIt's Scott to be the real deal! Kylie Jenner and rumoured new love interest Travis looked very cosy as they were pictured together for the first time at NBA game\nKylie, 19, had dressed down for the occasion, wearing a rust-coloured baggy T-shirt which loose-fitting ripped jeans and black trainers.\nHer poker straight raven locks hung down past her shoulders as she made a very public appearance with Travis.\n24-year-old Travis, meanwhile, clashed his prints, wearing a plaid shirt with camo trousers, teamed with powder blue Nike trainers.\nNice seats: The pair sat courtside during Game Five of the Western Conference Quarterfinals game of the 2017 NBA Playoffs at Toyota Center following Travis' performance\nLow-key: Kylie, 19, had dressed down for the occasion, wearing a rust-coloured baggy T-shirt which loose-fitting ripped jeans and black trainers\nKylie supported Travis at the sporting event, where he performed before play-off.\nA source told People, 'During his performance, Kylie was hiding in the Rockets’ courtside club anxiously waiting for him to come back to her.\n'Once he got back, they definitely looked like a couple, cuddled up next to each other among her friends.\nGone their separate ways? Kylie and long-term love Tyga are said to have split back in April\n'They were super hand-holdy and it seemed like she wanted people to see them together. They haven’t let go of each other since he got off the court.'\nMailOnline has contacted a spokesperson for both Kylie Jenner and Travis Scott for comment.\nMeanwhile, US Weekly reported that Tyga has already left Kylie's $6 million mansion in Hidden Hills, California.\nHe and Scott Disick partied together at the TAG Heuer unveiling of Amgen Tour of California Best Young Rider Jersey with Brand Ambassador at Galerie Montaigne on Tuesday night.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446596/Kylie-Jenner-Travis-Scott-NBA-date.html"}
