{"authors":["Sam Cunningham For Mailonline"],"date_download":"2018-10-23 01:49:55","date_modify":"2018-10-23 01:49:55","date_publish":"2017-03-16 12:06:48","description":"Monaco forward Kylian Mbappe has been coveted by European football’s giants for many years before he became the 18-year-old knocking Manchester City out of the Champions League.","filename":"data/vaneerConsumption/KylianMbappeturneddownRealMadridChelseaLiverpool.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E54069A00000578-0-image-a-65_1489666640222.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319574_Monaco-striker-Kylian-Mbappe-new-Thierry-Henry_1540259395.html","title":"Kylian Mbappe turned down Real Madrid, Chelsea, Liverpool","title_page":"Kylian Mbappe turned down Real Madrid, Chelsea, Liverpool | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He has broken two of Thierry Henry’s records already and cannot escape comparison with the France legend. Monaco forward Kylian Mbappe has been coveted by European football’s giants for many years before he became the 18-year-old knocking Manchester City out of the Champions League.\nHe is the attacking player in the Pep Guardiola mould - young, skilful and quick, akin to Gabriel Jesus, Leroy Sane or Raheem Sterling - who dashed the City manager’s European hopes. City reportedly had a £34.5million bid for the teenager turned down in last summer’s transfer window, although they were only the latest in a long list of pursuers.\nMbappe is a lifelong Real Madrid fan but turned them down, along with Chelsea, City, Liverpool and Bayern Munich to sign for Monaco at 15. So impressed were Real with the player during a match at the prestigious French academy Clairefontaine, where he spent two years, he was flown to Spain for a week’s trial at the Bernabeu where he was welcomed by Zinedine Zidane.\nKylian Mbappe, 18, helped Monaco knock Manchester City out the Champions League\nMbappe scored the opening goal of the Ligue 1 side's 3-1 second-leg win on Wednesday\nMan City boss Pep Guardiola (pictured shaking hands with Mbappe) had a bid turned down\nKYLIAN MBAPPE: CV Age: 18 Games: 45, goals: 18 International: 11 U19 caps, seven goals Kylian Mbappe has started 17 games for Monaco this season, scoring 16 goals in those matches. He became Monaco’s youngster ever player in December 2015 at 16 years and 347 days, usurping Thierry Henry. In February 2016, at 17 years and 62 days, he broke Henry’s record as the club’s youngest ever goalscorer in a win against Troyes\nMbappe spent his early formative years at AS Bondy, a local side to the eastern suburb of Paris where he grew up, and a surrounding close family unit has kept him grounded. His father, Wilfried, was a coach at AS Bondy and is now his agent, and they chose to shun everyone else to ensure first-team football at Monaco when he left Clairefontaine at 15.\nHis entourage are well aware of the power all the attention has brought them and when he was barely played by manager Leonardo Jardim at the start of this season his father told L’Equipe in October: ‘We thought he would be a regular part of the squad and be given opportunities. That’s what the management promised.\n'We did not expect him to be a starter, we are not stupid but we did not imagine either that he would be the sixth-choice striker. He could have gone to a big, big club to be sixth choice.’\nThe story of how he has become a figure of such intense interest goes back to when he was displaying enormous talent regularly on raggedy pitches where buildings and fences watch on from sidelines instead of supporters. Mbappe, a sprinter in football boots who plays comfortably on either wing or leading the attack, has more tricks than Dynamo.\nMbappe's pace and skills have made him nearly unstoppable so far this season\nMbappe turned down Real Madrid, Chelsea, City, Liverpool and Bayern Munich at 15\nHe has transitioned these to the slicker Ligue 1 pitches and became Monaco’s youngster ever player in December 2015 at 16 years and 347 days, usurping Henry. At 17 years and 62 days, he broke Henry’s record again as the club’s youngest scorer in a win against Troyes.\nHenry has had his say and wrote in his Sun column before Monaco’s first leg against City: ‘I've met Mbappe and he's a nice lad with a good head on his shoulders. He is very respectful and quite quiet. But give him the ball and he talks and he isn't very nice anymore. He is determined and never gives up. He is the talk of the town.’\nHow he progresses from prodigious talent to world beater will depend on his mental faculties. That, at least, is the opinion of Arsene Wenger, who has also admitted to lodging a bid for the player.\nMbappe holds the record for being Monaco's youngest ever player and goal scorer\nHe took both records from Thierry Henry (right) who went on to a stellar career\n‘He has similarities to Thierry, has huge talent, plays for Monaco like Thierry,’ Wenger said.\n‘But after that what makes a career is the mental aspect Thierry had, this young boy has to show that now. We wanted him last season but he decided to stay where he was.’\nOn signing his first professional contract at Monaco last year that runs until 2019, the player said: ‘This is the club that's helped me grow. I feel good here, and I'm going to be able to continue taking new steps forward.’\nMbappe has numerous admirers but Real Madrid - who he supports - are front of the queue\nHe has made giant leaps in the last six weeks with a dazzling run of nine goals in eight games.\nWhen he decides the time is right to move can anyone beat Real Madrid to signing him? Mbappe recently paid tribute to Raymond Kopa, the famous French attacking midfielder who was part of the 1950s Real Madrid, lifted three European Cups and was a Ballon d’Or winner, who died this month. When they try to buy a player few can rival them and the finances involved will rule out most others.\nMonaco rewarded his early promise with a contract worth around £74,000 per week, placing him in their top 10 earners. So in addition to a transfer fee likely to surpass Anthony Martial’s £36m move from Monaco to Manchester United as the highest for a teenager, he will require hefty wages to match.","url":"https://www.dailymail.co.uk/sport/football/article-4319574/Monaco-striker-Kylian-Mbappe-new-Thierry-Henry.html"}
