{"authors":["Sarah Sotoodeh For Dailymail.Com"],"date_download":"2018-10-22 21:44:48","date_modify":"2018-10-22 21:44:48","date_publish":"2016-01-29 07:55:43","description":"The 18-year-old showed off her toned stomach and cleavage in a black tank top and grey sweats. The reality star was spotted leaving Epione, a skin care facility, on Thursday in Beverly Hills.","filename":"data/vaneerConsumption/KylieJennercoversherfacewithsunglasseswhileleavingskincareclinic.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30B0107B00000578-0-image-a-74_1454048794396.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422194_Kylie-Jenner-covers-face-sunglasses-leaving-skin-care-clinic-t-resist-flashing-cleavage_1540244688.html","title":"Kylie Jenner covers her face with sunglasses while leaving skin care clinic","title_page":"Kylie Jenner covers her face with sunglasses while leaving skin care clinic | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's certainly not known for having a shy and retiring nature.\nBut Kylie Jenner covered her face with a pair of oversized sunglasses on Thursday as she left a skincare clinic in Beverly Hills - even though it was dark outside.\nHowever the 18-year-old couldn't resist showing off her cleavage and flat midriff in her casual ensemble.\nScroll down for video\nOn the go: Kylie Jenner was spotted leaving Epione, a skin care center, while wearing a low cut black tank and fitted sweats\nThe Keeping Up With The Kardashians star didn't crack a smile as she left the office, rocking a slightly sheer black top and fitted grey bottoms with a cream colored waistband.\nHer light colored sweats featured a zipper detail on the sides of her hips as well the hemline.\nShe stayed warm in a cuffed shiny black bomber jacket while pounding the pavement in grey Yeezy 350 Boost sneakers.\nKylie shielded her makeup free face with the large shades and pulled her raven hued locks back into a casual low bun.\nCasual chic: The 18-year-old showed off her cleavage and flat midriff in her casual ensemble on Thursday in Beverly Hills\nThe brunette beauty,who wore her signature Cartier bracelets as well as a large golden watch, sported neutral hued polish on her nails.\nEarlier in the day, the teen shared a photo to her 49.4 million Instagram followers of her outfit without her jacket.\nIn a video on her website, thekyliejenner.com, the teen revealed she wanted time to get to know herself, saying: 'I feel like I have been in a relationship for six years. I have just gone from one person to the next.'\nKylie added: 'I was dating someone for like, three years, 14, 15, 16, and a little bit of 17. I went into another relationship, 17, 18. I feel like I really need to find myself.'\nSerious: The Keeping Up With The Kardashians star didn't crack a smile as she left the office, rocking a slightly sheer black top and fitted grey leggings with a cream colored waistband\nHomeward bound: The reality star stayed warm in a cuffed shiny black bomber jacket while pounding the pavement in grey Yeezy 350 Boost sneakers\nShe continued: 'And have like a relationship with myself. Because I don't know what it feels like to be by myself. I feel like you have to love yourself before you can love anybody else.'\nThe teenager has had a drama filled week.\nIt was revealed this week that her brother, Rob Kardashian, is not only dating Blac Chyna, but that he's also moved in with her.\nKylie is in a relationship with rapper Tyga, who has a three-year-old son, King Cairo Stevenson with his ex-fiancé, Blac Chyna.\nFocused: Kylie shielded her makeup free face with opaque sunglasses and pulled her raven hued locks back into a casual low bun\nTime for a selfie: Earlier in the day, the teen shared a photo to her 49.4 million Instagram followers of her outfit without her jacket","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422194/Kylie-Jenner-covers-face-sunglasses-leaving-skin-care-clinic-t-resist-flashing-cleavage.html"}
