{"authors":["Bianca La Cioppa","Frank Coletta For Daily Mail Australia"],"date_download":"2018-10-22 21:53:40","date_modify":"2018-10-22 21:53:40","date_publish":"2016-01-11 01:56:01","description":"New mum Kyly Clarke took a stand against anti-vaccination groups on Monday while appearing on Channel Seven's Sunrise.","filename":"data/vaneerConsumption/KylyClarkereveals8weekoldKelseyLeehashadherinjections.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001BA5700000578-0-image-a-158_1452474272203.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393176_Kyly-Clarke-hits-anti-vaccination-groups-reveals-eight-week-old-Kelsey-Lee-injections_1540245220.html","title":"Kyly Clarke reveals 8-week-old Kelsey Lee has had her injections","title_page":"Kyly Clarke reveals 8-week-old Kelsey Lee has had her injections | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's a controversial topic that has proved divisive, particularly among new mothers.\nAnd on Monday Kyly Clarke took a swipe against anti-vaccination groups during an appearance on Channel Seven's Sunrise.\nThe new mother branded the practice of not vaccinating children as 'really inconsiderate and unfair'.\nScroll down for video\nHitting out: New mum Kyly Clarke took a stand against anti-vaccination groups on Monday labelling it 'inconsiderate and unfair' while appearing on Channel Seven's Sunrise\n'I have a new born, she is eight-weeks today and it's very concerning for me,' she continued.\nThe TV presenter, who gave birth to daughter Kelsey Lee two months ago, also revealed that her little one had already had her relevant injections.\nUnder the National Immunisation Programme in Australia children must have a number of injections within the first year of their lives.\nAt six months old or before children must be vaccinated against Hepatitis B, diphtheria, tetanus, whooping cough, flu and polio.\nOpening up: Kyly appeared on the show alongside Deborah Clay (L) and Gretel Killeen (M) to talk about immunisation after a Melbourne mother scheduled an anti-vaccination event at a zoo\nSix months later children are required to have the Measles, mumps and rubella (MMR) vaccine.\nKyly's comments come a day after a mother advertised an anti-vaccination meet and greet at Melbourne Zoo on social media - one month after a Brisbane mother advertised a chickenpox party on Facebook.\n'The thing I don't understand is...we are asking doctors for cures and preventions for other diseases such as cancer, yet we can't do an easy vaccination for all kids to be safe and healthy and to have a healthy community,' the wife of former Australian cricket captain Michael said.\n'We are even asking a community like ourselves to donate money to charities to find cures and preventions for illnesses so it just doesn't make sense to me.'\nOn the job: The 34-year-old revealed her eight-week-old daughter Kelsey Lee has had her needles\nEmotional: The mother-of-one explained 'we are asking doctors for cures and preventions for other diseases... yet we can't do an easy vaccination for all kids to be safe and healthy and to have a healthy community'\nShe concluded: 'You can't pick and choose, you can't pick to help one disease but not the other.'\nEarlier in the day One Nation Party leader Pauline Hanson opened up on the topic stating she would now think twice about vaccinating her own children.\nTalking to the Daily Mail Australia she revealed that one of her grandchildren is not vaccinated while her own children have been immunisation.\n'I had my kids vaccinated and they haven't been sick, it's parents who are making the decisions on what is best for the children, it's open for debate, I haven't got a closed mind at all,' she said.\nOn set: She appeared on the show alongside fellow media personalities\nThoughts: Earlier in the day One Nation Party leader Pauline Hanson vowed her support towards anti-vaccination stating she would now think twice about vaccinating her own children\n'I made an informed decision ... one of my children has decided against it and made their choice, I haven't discussed it with the other ones (children).'\nThe 61-year-old explained that she believes vaccinations may be to blame for the rising rates of autism and cancer.\n'I have had so many people who have brought it to my attention, that's why their kids are autistic...We haven't done the research enough, what is causing these kids to have autism, what is having all the cancer in our community, have we had enough answers into the cancer?'\nLast year Australian singer Cody Simpson came under fire when he showed his support towards anti-vaccinations on Twitter.\nThe 18-year-old called on Australia's former Prime Minister Tony Abbott to end laws that require parents to vaccinate their children unless a special exemption is granted.\nFiring line: Last year Australian singer Cody Simpson came under fire when he showed his support towards anti-vaccinations on Twitter\nOut loud: At the time, he called on Australia's former Prime Minister Tony Abbott to end laws that require parents to vaccinate their children unless a special exemption is granted before deleting the tweet\n'Tony Abbott let go of your controlling infant vaccination laws. I'm appalled. Free Australia. Free humanity' he wrote, with a list of 'facts' about vaccination attached.\nThe update was soon removed from the Queensland-born star's account.\nOne Twitter user replied to the post: 'Hey Cody Simpson, remember that time you got polio? Or rubella? No? Must have been because your parents had a brain and vaccinated you.'\nAnother commented: 'Please take the time to understand the importance of vaccinations and the devastation that these diseases have caused globally.\nAs of January 1, 2016 parents who don't immunise their children are no longer eligible for childcare benefits.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393176/Kyly-Clarke-hits-anti-vaccination-groups-reveals-eight-week-old-Kelsey-Lee-injections.html"}
