{"authors":["Jason Chester For Daily Mail Australia"],"date_download":"2018-10-22 22:00:28","date_modify":"2018-10-22 22:00:28","date_publish":"2016-01-11 02:00:32","description":"The brunette continued to display her impressively toned physique during a day out with husband Michael Clarke and daughter Kelsey Lee on Saturday.","filename":"data/vaneerConsumption/KylyClarkedisplaysherpostpregnancyfigurewithhusbandMichaelanddaughterKelseyLee.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001C33100000578-0-image-a-34_1452476584055.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393220_Kyly-Clarke-continues-display-impressive-post-pregnancy-figure_1540245628.html","title":"Kyly Clarke displays her post-pregnancy figure with husband Michael and daughter Kelsey Lee","title_page":"Kyly Clarke displays her post-pregnancy figure with husband Michael and daughter Kelsey Lee | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She gave birth little more than two months ago, but Kyly Clarke's impressive post-pregnancy figure once again took centre stage during a day out in Sydney on Saturday.\nThe brunette continued to display her impressively toned physique during a day out with husband Michael Clarke and daughter Kelsey Lee.\nSporting a stylish denim dress with a cinched waist that further accentuated her post-pregnancy figure, Kyly was an eye-catching sight as the family strolled through upmarket Sydney suburb Vaucluse.\nScroll down for video\nHere she comes: Kyly Clarke continued to display her impressively toned physique during a day out with husband Michael and daughter Kelsey Lee on Saturday\nAn above the knee cut revealed a pair of athletic looking legs, and with Michael on pram duty for much of their outing she did had ample opportunity to show them off.\nThe WAG completed her look with a pair of simple peep-toe heels, while her brunette locks were casually maintained with a simple centre parting.\nMeanwhile Michael looked relaxed in a loose fitting T-shirt and jeans as he gently pushed his baby daughter through the smart suburb.\nLooking good: Sporting a stylish denim dress with a cinched waist that further accentuated her post-pregnancy figure, Kyly was an eye-catching sight as the family strolled through upmarket Sydney suburb Vaucluse\nLeggy display: An above the knee cut revealed a pair of athletic looking legs\nAt one point Kyly assisted as they guided the pram out of a property and onto the street, her eyes shielded behind a pair of heavily tinted sunglasses.\nWhile the brunette glamazon has been attending to new-mother duties, she has also been working on her debut novel, which is set for release this year.\nFresh details about the 'mind-enhancing' book emerged earlier this week, with publisher Pan MacMillan describing the work, titled True To You, as 'a collection of mantras, quotes and wisdom'.\nLet's go: Michael appeared to be on pram duty during the brief outing\nHappy to help: At one point Kyly assisted as they guided the pram out of a property and onto the street, her eyes shielded behind a pair of heavily tinted sunglasses\nThat'll do: Michael led the way as they stepped onto the sidewalk with their pram in tow\nSet her down gently: The pair carefully lowered Kelsey's pram to the ground after descending a set of stone steps\nThe book is touted as an aid for readers to 'develop deep and compassionate relationships' and enhance their careers.\nKyly gave birth to Kelsey Lee five weeks prematurely in November.\nShe previously revealed to Daily Mail Australia that the pair did not have a specific name in mind for their child before the birth.\nThe brunette beauty explained: 'We have a couple of favourites when it comes to boys and girls, so I think when the time comes, we'll just look at each other and...we'll just know the name once we see bub.'\nProud parents: The pair beamed as they looked down at their baby daughter\nThey're off: Michael got to grips with the pram while his glamorous wife lagged behind","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393220/Kyly-Clarke-continues-display-impressive-post-pregnancy-figure.html"}
