{"authors":["Jessica Aquilina For Daily Mail Australia"],"date_download":"2018-10-22 22:19:12","date_modify":"2018-10-22 22:19:12","date_publish":"2016-01-29 09:19:07","description":"Kym Johnson took plunging necklines to new depths at the G'Day USA Gala Dinner in LA on Thursday.","filename":"data/vaneerConsumption/KymJohnsonwearsplunginggowntoGDayUSAGalawithRobertHerjavec.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30B016E500000578-0-image-a-8_1454049297425.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422248_Kym-Johnson-wears-plunging-gown-G-Day-USA-Gala-beau-Robert-Herjavec_1540246752.html","title":"Kym Johnson wears plunging gown to G'Day USA Gala with Robert Herjavec","title_page":"Kym Johnson wears plunging gown to G'Day USA Gala with Robert Herjavec | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's a talented dancer with an evolving fitness empire.\nBut on Thursday night at the G'Day USA Gala Dinner in Los Angeles, Kym Johnson added ravishing fashionista to her long list of credentials.\nThe 39-year-old Dancing With The Stars personality exuded sex appeal as she took to the red carpet with billionaire beau Robert Herjavec, wearing a plunging black gown that showed off her ample cleavage.\nScroll down for video\nPlunging depths! Kym Johnson takes plunging necklines to new depths as she adds some va-va-voom to the G'Day USA gala crimson carpet in a ravishing number\nThe designer dress also incorporated a daring thigh-high split which revealed the Sydney native's toned pins as she placed both hands on her hips as she posed solo for the cameras.\nKym kept accessories to a minimum to keep the floor-length gown the main focus and opted for a simple gold bracelet, watch and stud earrings.\nBoosting her petite frame, the professional ballroom dancer added black platform peep-toe heels under her dress.\nThe blonde beauty styled her short locks into tidy bob, while applying a thick layer of pink lipstick onto her naturally plump lips.\nRevealing gown! The designer dress also incorporated a daring thigh-high split which revealed the Sydney native's toned pins as she placed both hands on her hips\nThe dance champion also made sure to accentuate her big blue eyes with thick lashings of mascara and a light dusting of pink powder on her cheeks.\nThe LA-based star also showed off her her new squeeze, Robert Herjavec, at the exclusive event.\nThe businessman was equally dressed to impress and was seen lovingly wrapping his arm around his girlfriend.\nThe inventor and author wore a stylish white blazer over his black button-up shirt, paired with matching trousers.\nLooking dapper in his red carpet uniform, the 53-year-old completed his look with dress shoes and a polka-dot handkerchief in his blazer pocket.\nNew love! The LA-based star made sure to show off her her billionaire beau, Robert Herjavec, on the red carpet of the exclusive event\nThe pro dancer and her beau have been together for a little over nine months, after falling for each other during Season 20 of US Dancing With The Stars.\n'We were friends first, and we got to know each other on a friendship level; I think that's really important,' Kym told People magazine recently.\nFrom there, their relationship grew into a romantic one.\n'...it's really great. We're both each other's number one fans, and have respect for each other,' she pointed out.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422248/Kym-Johnson-wears-plunging-gown-G-Day-USA-Gala-beau-Robert-Herjavec.html"}
