{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 04:48:11","date_modify":"2018-10-23 04:48:11","date_publish":"2016-01-28 20:58:08","description":"The 39-year-old Coronation Street actress took a break from the gym as she stopped by the Key 103 radio station in Manchester on Thursday to act as a guest presenter on the breakfast show.","filename":"data/vaneerConsumption/KymMarshkeepsherlookcasualingreyskinnyjeans.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD4B9100000578-0-image-a-30_1454013900041.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421675_Kym-Marsh-keeps-look-casual-grey-skinny-jeans_1540270091.html","title":"Kym Marsh keeps her look casual in grey skinny jeans","title_page":"Kym Marsh keeps her look casual in grey skinny jeans | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been focusing on her fitness mission following the release of her new workout DVD.\nBut Kym Marsh took a break from the gym as she stopped by the Key 103 radio station in Manchester on Thursday to act as a guest presenter on the breakfast show.\nThe 39-year-old Coronation Street actress kept her look casual and relaxed, sporting grey skinny jeans and a leather jacket.\nScroll down for video\nOut and about: Coronation Street star Kym Marsh was in great spirits as she left the Key 103 radio station in Manchester on Thursday\nKym carried her woolen grey cardigan over one arm, prepared for every eventuality as she braved the changeable weather.\nThe former Hear'Say singer completed her ensemble with a pair of black Ugg boots, a white T-shirt and a simple scarf.\nThe soap star kept her hair and make-up look equally low-key, pulling her brunette locks up into a ponytail and wearing her glasses.\nPutting her best foot forward: The ex Hear'Say singer completed her ensemble with a pair of black Ugg boots\nStaying snug: Kym carried a woolly cardigan over one arm and wrapped a scarf around her neck\nThis isn't the first time that Kym has been seen in the same get-up, donning the exact same outfit to present the show earlier this week.\nKym - who is currently dating her personal trainer Matt Baker - recently admitted she had struggled with body confidence issues for years after a backhanded comment about her weight.\nSpeaking exclusively to MailOnline, she revealed she had been called 'fat' by music mogul Nigel Lythgoe after she auditioned to join Hear'Say on Popstars in 2000.\nBeaming: Kym, who is currently dating her personal trainer Matt Baker, is feeling better than ever since embarking on a health kick last year\nSay cheese! The soap star happily posed for a picture with a male fan\nAt a healthy size 12 at the time of the incident, Nigel was filmed telling her: 'You need to lose some weight. Christmas is over and the goose has gotten fat.\n'I think you've put weight on over Christmas and I think you needed to lose weight before Christmas.'\nReflecting on the comments, Kym confessed: 'I'd always been quite body confident until that moment but when he said that it really affected me, I couldn't even look at myself in the mirror.\n'I started to look at myself differently and question whether I was overweight. I started becoming far too critical of myself. My body had changed an awful lot after having children and I simply didn't have time to exercise.'\nGetting her confidence back: The 39-year-old star confessed she had been insecure about her figure for years following an off-hand comment by music mogul Nigel Lythgoe after she auditioned to join Hear'Say on Popstars in 2000","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421675/Kym-Marsh-keeps-look-casual-grey-skinny-jeans.html"}
