{"authors":["Kayleigh Giles For Mailonline"],"date_download":"2018-10-23 01:30:46","date_modify":"2018-10-23 01:30:46","date_publish":"2016-01-29 15:36:44","description":"The Coronation Street beauty was keen to motivate the viewers of Good Morning Britain on Friday morning, it appeared the star hadn't done all of her homework.","filename":"data/vaneerConsumption/KymMarshmakesablunderbeforeGMBsBenShephardsavestheday.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B3FE4900000578-0-image-a-73_1454082347821.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422870_Kym-Marsh-makes-cringe-worthy-blunder-live-TV-struggles-answer-question-fitness-gadget-Good-Morning-Britain-s-Ben-Shephard-saves-day_1540258246.html","title":"Kym Marsh makes a blunder before GMB's Ben Shephard saves the day","title_page":"Kym Marsh makes a blunder before GMB's Ben Shephard saves the day | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's adopted a new healthy lifestyle and has been revelling in the results.\nBut while Kym Marsh was keen to motivate the viewers of Good Morning Britain on Friday morning, it appeared the star hadn't done all of her homework as she accidentally forgot the answer to a question put to her by co-host Ben Shephard.\nPromoting a giveaway of the health device Fitbit, Kym raved: 'We've got 250 trackers to give away today. For those of you who don't know they help you keep a track of what you're eating, how much you're moving, how well you're sleeping.'\nScroll down for video\nKym Marsh suffered an awkward live blunder during her appearance on Good Morning Britain on Friday where she promoted new fitness gadget Fitbit\n'You can record your progress so it's just a really good way of helping you along your journey,' she continued.\nBut the Coronation Street star came unstuck when the 41-year-old presenter asked her how the public could get their hands on the gadget.\nLooking awkwardly at hosts Ben and Kate Garraway, she replied through giggles: 'I don't know, how do they get them, Ben?'\nStarted well: Kym raved of the product: 'We've got 250 trackers to give away today. For those of you who don't know, they help you keep a track of what you're eating, how much you're moving, how well you're sleeping'\nThe Sky Sports broadcaster then stepped in and told viewers that they could get the fitness aids on the GMB website.\nDefending Kym's blunder, Kate then interjected: 'You can't expect [Kym] to know everything,' she jokingly snapped at her co-host. Turning to the Coronation Street actress, she then added, 'Well done, you've been fantastic!'\nSeemingly trying to give the soap star some extra reassurance, Ben chimed: 'Yes, keep it up!'\nWhoops! The Coronation Street star came unstuck when the 41-year-old presenter asked her how the public could get their hands on the gadget\nThe former Hear'Say singer looked typically stylish for her appearance on the daytime show, clad in a floaty white blouse and skinny jeans, which highlighted her particularly slender legs.\nKym elongated her pins even further with the aid of black heeled shoe boots, which coordinated with the thick-rimmed glasses she sported.\nHer brunette locks were perfectly preened, falling in a sleek centre-parted style around her face, which sported a neutral make-up palette.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422870/Kym-Marsh-makes-cringe-worthy-blunder-live-TV-struggles-answer-question-fitness-gadget-Good-Morning-Britain-s-Ben-Shephard-saves-day.html"}
