{"authors":["Andre Walker"],"date_download":"2018-10-30 20:54:28","date_modify":"2018-10-30 20:54:28","date_publish":"2014-10-22 15:25:50","description":"A flagship child care plan introduced by the last Labour government has been shown to be so bad at encouraging mums back into work that it cost £66,000 |","filename":"data/vaneerConsumption/LaboursFreeChildCarePlanCosts66000ForEachMumBackInWork.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/09/13/Pre-K-Classroom-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_10_22__1540932868.html","title":"Labour's Free Child Care Plan Costs Â£66,000 For Each Mum Back In Work","title_page":"Labour's Free Child Care Plan Costs Â£66,000 For Each Mum Back In Work | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A flagship child care plan introduced by the last Labour government has been shown to be so bad at encouraging mums back into work that it cost £66,000 for each one who did. The cost of giving free nursery places for three-year-olds under the part-time pre-school places scheme will be £800m this year but only 12,000 mums have returned to work as a result.\nThe scheme was introduced shortly after Tony Blair’s government came to power, and by 2005 it had been extended over the whole country. At the time the government claimed it would bring large numbers of mums back into the work place but a study from the Institute for Fiscal Studies (IFS) found that it had provided very poor value.\nThe report claims that even of the 12,000 mums that did return to work very few went full-time, with most working under 30 hours a week. The IFS also found that for every six children in the scheme five of them would have been in pre-school education whether the subsidy existed or not. This means most of the money spent is just a subsidy to parents who would have paid for the child care themselves had it not been free.\nAccording to the Daily Mail the report said: “For the majority of mothers who would have paid for childcare without the free entitlement, the policy simply cuts the cost of childcare without boosting employment rates.\nIt added: “There is a growing consensus in the UK, from across the political spectrum, that extending the free entitlement – either by making more children eligible or by offering additional hours per week or weeks per year to children who are already eligible – will help more parents to work.\n“But the extent to which such policies would transform parental labour supply – and whether universal entitlement offers good value for money – are far from clear.”","url":"https://www.breitbart.com/europe/2014/10/22/labours-free-child-care-plan-costs-66000-for-each-mum-back-in-work/"}
