{"authors":["Liam Deacon"],"date_download":"2018-10-30 22:05:32","date_modify":"2018-10-30 22:05:32","date_publish":"2018-09-06 09:10:13","description":"A senior Labour politician has said he is prepared to provoke social unrest on the streets of Britain in order to block a ‘no-deal’ Brexit.","filename":"data/vaneerConsumption/LabourMayorReadytoProvokeUnrestonUKStreetstoBlockCleanBrexit.json","image_url":"https://media.breitbart.com/media/2018/09/GettyImages-610888288.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_09_06__1540937132.html","title":"Labour Mayor Ready to Provoke ‘Unrest on UK Streets’ to Block Clean Brexit","title_page":"Labour Mayor Ready to Provoke ‘Unrest on UK Streets’ to Block Clean Brexit","title_rss":"NULL","source_domain":"breitbart.com","text":"A senior Labour politician has said he is prepared to provoke social unrest on the streets of Britain in order to block a ‘no-deal’ Brexit, blaming the “alt-right” for pushing a clean exit from the bloc.\nAndy Burnham, the Mayor of Greater Manchester and a former Labour MP and Cabinet Minister, admitted that a second referendum would “further erode trust in Parliament and politicians”.\nYet he added: “There is always a price that comes with that, but in the end that price is worth paying to stop the catastrophic damage to jobs that would come with a ‘No Deal’ Brexit.”\nIn a speech in Westminster, the mayor made it clear he was adopting this position despite having a clear understanding of the impact it could have on society.\n“I have to think seriously about what a second vote would mean on the streets of Greater Manchester,” he said.\n“If we thought the first was bad, the second would be a whole lot worse. It won’t heal divisions but widen them. It would be angrier [and] create social unrest.”\nTwice as Many Brits Back ‘No Deal’ over May’s Brexit Plan https://t.co/8cX3lvGSSv — Breitbart London (@BreitbartLondon) July 16, 2018\nBurnham reiterated his belief that the possibility of “real unrest” was a price worth paying to prevent a clean Brexit in an interview on BBC Radio 4’s Today programme: “I have real concerns about a second vote. It would cause real unrest on the streets of Greater Manchester,” he confessed.\n“But there is something worse than having another vote and that is crashing out of the European Union without a deal,” he insisted.\nBurnham also suggested that a second referendum would “open up a massive opportunity for the populist far-right in the way we are seeing elsewhere in Europe and the USA.”\n“In fact, it is possible the so-called alt-right are driving this ‘No Deal’ agenda to set up the clash in our communities from which they think they can profit,” he claimed — although he did not provide any evidence of such a conspiracy.\nThe Mayor also proposed begging the European Union to postpone the UK’s departure deadline if a deal is not struck, in order to allow further negotiations.\nBrexit Voters Not Deterred by Project Fear Economic Threats, Finds Poll https://t.co/ZTOZc6OwaJ — Breitbart London (@BreitbartLondon) September 3, 2018","url":"https://www.breitbart.com/europe/2018/09/06/labour-mayor-ready-provoke-unrest-uk-streets-block-clean-brexit-pushed-alt-right/"}
