{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-23 04:59:51","date_modify":"2018-10-23 04:59:51","date_publish":"2016-01-11 18:05:46","description":"BBC Panorama is due to broadcast a documentary raising concerns about the treatment of youngsters at the Medway Secure Training Centre in Rochester, Kent, which is managed by G4S.","filename":"data/vaneerConsumption/LaboursaysALLG4Sprisonsmustbeputintospecialmeasures.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300D577D00000578-0-image-a-14_1452534137339.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394323_Labour-says-G4S-prisons-special-measures-following-allegations-unnecessary-force-used-against-children_1540270791.html","title":"Labour says ALL G4S prisons must be put into special measures","title_page":"Labour says ALL G4S prisons must be put into special measures | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ofsted visited the youth centre in Medway on Monday to look into claims\nAll prisons and detention centres run by G4S should be put in special measures following allegations about a secure training centre, Labour has said.\nBBC Panorama is due to broadcast a documentary raising concerns about the treatment of youngsters at the Medway Secure Training Centre in Rochester, Kent, which is managed by G4S in co-operation with the Youth Justice Board.\nAndy Slaughter today urged Justice Secretary Mr Gove to take immediate action to put all G4S-run prisons, secure training centres and detention centres into special measures to assess the 'safety and competence' at each site.\nMr Gove told MPs the security group had previously 'let the Ministry of Justice and those in our care down', although he stressed it runs other institutions which 'do a good job'.\nShadow justice minister Andy Slaughter, pictured in the Commons today, led questions in Parliament about the allegations and called for all G4S facilities to be placed in special measures\nSeven G4S staff were suspended last week after the BBC presented its allegations.\nThe claims made in the documentary, due to be broadcast tonight, involve unnecessary force, foul language and a cover-up.\nMr Gove said Her Majesty's Inspectorate of Prisons and Ofsted visited the Medway centre on Monday morning.\nThey have met with representatives of G4S, Medway Council and the Youth Justice Board to ensure 'all necessary action is being taken to ensure the wellbeing of young people at the centre', the Cabinet minister added.\nMr Gove said: 'Inspectors will speak directly with young people detained at Medway to satisfy themselves that everything is being done to ensure people are safe.\n'I will also be meeting G4S this week to discuss the allegations and to review their response.\n'I'm under no illusions that our system of youth justice needs reform. Although youth offending is down, recidivism rates are high and the care and supervision of young offenders in custody is not good enough.'\nMr Gove reiterated he has asked for a review of youth justice to be conducted, which will report back later this year.\nEarlier, Mr Gove said he is 'grateful' to the BBC for the work it has undertaken.\nHe said: 'We must treat these allegations with the utmost seriousness. Kent Police and Medway child protection team are now investigating matters on the basis of the information shared with them by the BBC.\n'The police will decide in due course whether criminal charges should be brought.\n'It'd be inappropriate of me to comment further on specific allegations while investigations are under way.\n'But I can assure the House my department and the Youth Justice Board, under the determined leadership of Lord McNally, will do everything we can to assist the police and the local council.'\nShadow justice minister Andy Slaughter suggested Mr Gove could have met G4S sooner to discuss the 'serious allegations' and called for the Government to review its contracts with the company to see if it is 'fit and proper' to manage major public contracts.\nJustice Secretary Michael Gove, pictured today answering questions in the Commons, said G4S had let people down before but said a full investigation should take place\nHe also thanked the BBC as he noted the allegations included a teenager having their windpipe squeezed to cause problems breathing, staff 'boasting of mistreating young people' including using a fork to stab one in the leg, and the alleged mistreatment taking place out of sight of CCTV.\nMr Slaughter told Mr Gove: 'I think adding to this serious situation is it's clear the allegations only came to light following the investigative journalism you mentioned rather than any monitoring or oversight from the Youth Justice Board or MoJ.\n'Perhaps you'd say what the Youth Justice Board monitors have been doing if they're supposed to be an essential protection in these circumstances.'\nMr Gove asked for a 'full independent investigation of the circumstances of the abuse' at Medway, adding it should not be 'swept under the carpet or blamed on a few rogue officers'.\nHe said: 'Sadly this is only the latest in a long line of failures and mismanagement by G4S.'\nMr Slaughter added to Mr Gove: 'Given the concerns raised over many years and in many areas about G4S, we urge the MoJ to review all its contracts with that company to see whether they are fit and proper to manage major public contracts.\n'In the meantime it's our belief G4S should not be considered for bidding for other Government contracts. Can you give me those assurances today?'\nAfter raising concerns about the number of suicides across the prisons estate, Mr Slaughter also told Mr Gove: 'We need a cultural shift across the entire secure estate and therefore to begin that process we ask that the Government today takes immediate action to put all G4S-run prisons, STCs and detention centres into special measures to assess the safety and competence of their operation.'\nIn reply, Mr Gove said it would be 'quite wrong to make a blanket allegation' against G4S.\nHe added the BBC's Panorama programme informed the local authority on December 30 - with 'appropriate steps' taken.\nMr Gove told Mr Slaughter: 'Because a police investigation was necessarily taking place we have to respect due process.\nG4S said last week they had suspended staff and were treating the allegations with the 'utmost gravity' ahead of the BBC Panorama documentary tonight\n'You are absolutely right, the allegations which you have listed are very serious, but they are allegations and it is important that we give G4S and those involved the appropriate time and space to respond in a way which is I think congruent with the seriousness of these allegations.\n'It's because I take these allegations seriously that I don't want to be in a position where we either rush to judgement or do anything that can be used by those who may be guilty of very serious offences to wriggle off the hook.'\nMr Gove added: 'You are absolutely right, G4S have in a number of other ways and times in the past let the Ministry of Justice and those in our care down.\n'But it is also important to stress there are other institutions run by G4S which do a good job and continue to do a good job and it'd be quite wrong to make a blanket allegation against an individual organisation of the kind, which I know you did not make, but others might be tempted to do.'\nIn a statement last week, Paul Cook, Managing Director for G4S Children's Services in the UK said: 'We are treating the allegations with the utmost gravity and have taken immediate action to suspend a number of staff members who are alleged to have conducted themselves in a manner which is not in line with our standards.\n'We take any allegations of unacceptable or inappropriate behaviour extremely seriously and are giving our full support and co-operation to the LADO and the police as the investigation moves forward.'\n'The Police and LADO are the appropriate independent authorities to conduct the initial investigation into the allegations and once that investigation has concluded, we will agree with the Ministry of Justice and Youth Justice Board whether further independent review or investigation is required.'","url":"https://www.dailymail.co.uk/news/article-3394323/Labour-says-G4S-prisons-special-measures-following-allegations-unnecessary-force-used-against-children.html"}
