{"authors":["Jack Montgomery"],"date_download":"2018-10-30 17:58:24","date_modify":"2018-10-30 17:58:24","date_publish":"2017-05-01 17:14:27","description":"Rachael Maskell, who said Britain should keep taking migrants regardless of impact on healthcare, schools and taxes, wants a second referendum.","filename":"data/vaneerConsumption/LabourMPWhoWantsImmigrationUntilSaturationPointCallsforSecondEUReferendum.json","image_url":"https://media.breitbart.com/media/2017/05/Rachael-Maskell.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_05_01__1540922304.html","title":"Labour MP Who Wants Immigration Until ‘Saturation Point’ Calls for Second EU Referendum","title_page":"Labour MP Who Wants Immigration Until ‘Saturation Point’ Calls for Second EU Referendum","title_rss":"NULL","source_domain":"breitbart.com","text":"Labour MP Rachael Maskell has joined party leadership hopeful Clive Lewis to defy Jeremy Corbyn by endorsing a second referendum on Britain’s membership of the European Union.\nIn a joint op-ed for The Guardian newspaper, the pair concede the “ship has sailed” on a rerun of the 23 June referendum last year, but contend that “giving the British people a chance to ‘seal the deal’ with a vote on the final terms of the Brexit negotiations is not asking the same question twice”.\nThey said they could “understand why the Labour frontbench does not want to commit to that now, but we welcome their acknowledgement that, if circumstances changed, and there was a groundswell of public opinion in favour of the British people getting the final say, they would listen.”\nMaskell, a former Shadow Secretary of State and an ardent Remain campaigner, achieved a degree of infamy at the height of the migrant crisis when she called for Britain to keep taking migrants until it reached “saturation point” – even if this meant longer hospital waiting times, overcrowding in schools, and higher taxes.\n“We need to shout so much more, and say 20,000 is not enough 30,000 is not enough,” the York Central MP told a cheering crowd of open borders activists in September 2015.\n“We must keep going until we really are at saturation point, because what does it matter if we have to wait another week for a hospital visit, or if our class sizes are slightly bigger, or if our city is slightly fuller? What does it matter if things are slightly more challenging; if we have to pay a little bit more into the system?\n“Surely it is worth it to see those lives being restored again.”\nDisgraceful from LAB leadership contender Clive Lewis promoting his re-election effort with a FAKE poll. Pic via @MattSingh_ pic.twitter.com/iPouhlowGK — Mike Smithson (@MSmithsonPB) April 26, 2017\nNorwich South MP Clive Lewis, meanwhile, has stirred controversy more recently: Widely tipped as the favourite to succeed Jeremy Corbyn as Labour leader in the event of a defeat on 8 June, Lewis was heavily criticised after being caught tweeting a fake election poll last week – a possible violation of the Representation of the People Act.","url":"https://www.breitbart.com/europe/2017/05/01/labour-mp-immigration-saturation-second-eu-referendum/"}
