{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:39:42","date_modify":"2018-10-30 18:39:42","date_publish":"2017-01-24 17:44:02","description":"A Labour party councillor has attacked a Roman Catholic school for insisting a 4-year-old girl conforms to their uniform policy.","filename":"data/vaneerConsumption/LabourCouncillorAttacksCatholicSchoolforBanningHijab.json","image_url":"https://media.breitbart.com/media/2017/01/Screen-Shot-2017-01-24-at-16.59.40.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_01_24__1540924782.html","title":"Labour Councillor Attacks Catholic School for Banning Hijab","title_page":"Labour Councillor Attacks Catholic School for Banning Hijab","title_rss":"NULL","source_domain":"breitbart.com","text":"A Labour party councillor has attacked a Roman Catholic school for insisting a 4-year-old girl conforms to their uniform policy by not wearing an Islamic headscarf to class.\nSt. Clare’s School in Birmingham has a strict uniform policy, prohibiting all headwear and scarfs and asked parents of the young girl to respect it.\nHowever, after the father of the girl called on him to help, Waseem Zaffar, Birmingham City Council’s Labour cabinet member for “equalities”, accused the school of breaking the law and demanded they back down.\nIn a now deleted Facebook post, he claimed to have met with the head teacher and said the school’s policy was in contravention of the equalities act.\nWomen’s rights campaigner Gina Khan attacked Cllr Zaffar, accusing him of backing male parents who enforce the hijab on very young girls as a means of control.\n“Hijab isn’t compulsory for a child in Islam, but patriarchal biraadari power used to control Muslim school girls”, she wrote on Twitter, asking: “So why has [the Labour party] promoted this patriarchal abuser… to the position of [Birmingham] Equality Officer”?\n“Unbelievable this man insisting a primary school allow Muslim girl to wear a hijab. This has nothing to do with rights, it’s to control girls”, she added.\nNo wonder Pakistanis & Islam get a bad name..this all about #patriarchy control over Muslim primary schoolgirls to ensure they wear #hijab. pic.twitter.com/jf4UopEhRg — Gina Khan (@GinaKhanUK) January 22, 2017\nBrigid Jones, the council cabinet member for children, families, and schools, argued the school was within its right to uphold a uniform policy.\n“Each school’s governing body is responsible for the creation and implementation of its own uniform policy”, she told The Telegraph.\n“However, the local authority is supporting the school to ensure its policy is appropriate, in line with legal requirements, and we are engaging with all schools to remind them of their responsibilities when it comes to setting school uniform policies.”\nFellow councillor Majid Mahmood agreed, arguing a faith school “maybe within its rights to insist upon a particular dress code,” just as a Muslim faith school “may require girls to wear headscarves”.\nHowever, he said that as the Muslim population of the area grew, the school may have to adapt.\n“I also would have thought a Muslim parent would have thought very carefully about sending their child to a Roman Catholic school and considered the uniform policy,” he said.\n“This should have all been discussed between school and parent, not been dragged into the public and political arena.”","url":"https://www.breitbart.com/europe/2017/01/24/labour-councillor-attacks-catholic-school-infant-hijab/"}
