{"authors":["James Tapsfield","Political Editor For Mailonline"],"date_download":"2018-10-23 01:26:30","date_modify":"2018-10-23 01:26:30","date_publish":"2017-04-26 11:51:41","description":"The backbencher came under fire after posting a bar chart alongside the claim that only he was able to beat the Conservative candidate on June 8.","filename":"data/vaneerConsumption/LabourMPisembroiledinfakenewsrowoverpolltweet.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9ED4B900000578-0-image-a-22_1493203871169.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447202_Labour-MP-embroiled-fake-news-row-poll-tweet_1540257990.html","title":"Labour MP is embroiled in 'fake news' row over poll tweet","title_page":"Labour MP is embroiled in 'fake news' row over poll tweet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Labour MP Clive Lewis is embroiled in a 'fake news' row after tweeting a poll suggesting his constituency is tight race with the Tories - only for the polling firm to deny any knowledge of it.\nThe backbencher posted a bar chart alongside the claim that only he was able to beat the Conservative candidate on June 8.\nThe research, which was marked as an 'ICM poll of Norwich South', was said to demonstrate that 'voting Lib Dem or Green helps the Tories'.\nBut ICM spokesman Martin Boon stepped in after seeing the chart on Twitter - saying they had not carried it out.\nClive Lewis posted a graphic claiming to show an 'ICM poll of Norwich South' on Twitter, but the polling firm's spokesman denied any knowledge and demanded he withdraw it\nMr Lewis has been tipped as a future leader of Labour. He was a close ally of Jeremy Corbyn, but resigned from the front bench in protest at the leadership's position on Article 50\n'Please withdraw our name from it,' he added.\nMr Lewis dismissed the criticism, saying the graphic was based on 'projection and analysis' of an ICM poll of all Labour seats carried out by a pressure group.\nHowever, the graphic was removed from his Twitter feed and replaced with a version that cited 'recent polling analysis'.\nThe post from Mr Lewis said the survey was conducted in the constituency in January 2017, but it does not appear to tally with any known polls.\nIt claims Labour was on 36 per cent, the Tories on 28 per cent, the Lib Dems on 16 per cent, Ukip on 12 on per cent and the Greens on just 8 per cent.\nPortraying an election as a straight fight between two parties is a common way to maximise tactical voting.\nIt helps win support from local residents who are motivated against one of the parties.\nMr Lewis said in a statement on Twitter this afternoon: 'Graph is based on projection and analysis of polling of all Labour held-seats commissioned from ICM in Jan 17 by Represent Us.\n'Analysis of implications for Labour-held seats - including Norwich S done for Represent Us by polling expert Chris Hanretty of the UEA.\n'So both independent polling analysis and election results both show it's a choice between Clive Lewis and the Tories in Norwich South.\n'If you don't want a Tory MP in Norwich South, only a vote for Clive Lewis and Labour on 8 June can stop it.'\nMr Lewis has been tipped as a future leader of Labour.\nHe was a close ally of Jeremy Corbyn, but resigned from the party's front bench in protest at the leadership's position on the Article 50 Brexit vote.","url":"https://www.dailymail.co.uk/news/article-4447202/Labour-MP-embroiled-fake-news-row-poll-tweet.html"}
