{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:30:46","date_modify":"2018-10-30 18:30:46","date_publish":"2018-07-18 11:39:09","description":"Jeremy Corbyn’s Labour Party have sustained a lead over the Tories in opinion polls, with UKIP also gaining voters.","filename":"data/vaneerConsumption/LabourRetainPollLeadasUKIPSupportSurges.json","image_url":"https://media.breitbart.com/media/2017/06/nigel-farage-Bus.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_18__1540924246.html","title":"Labour Retain Poll Lead as UKIP Support Surges","title_page":"Labour Retain Poll Lead as UKIP Support Surges","title_rss":"NULL","source_domain":"breitbart.com","text":"Jeremy Corbyn’s Labour Party have sustained a lead over the Tories in opinion polls, with UKIP also gaining voters and party members since the Prime Minister announced plans for a “soft” Brexit.\nThe shock results come as Theresa May threatens Tory MP rebels, insisting they back her vision of Brexit or she will call a general election, which Labour looks to be increasingly likely to win.\nTory whips issued the warning to pro-EU MPs, according to The Times, minutes before a crunch vote on Tuesday night on locking the UK in a customs union with the European Union (EU).\nPro-Brexit Tories will also be fearful of putting far-left Jeremy Corbyn in power. His Labour has now backed staying inside the EU’s Customs Union and Single Market.\nA YouGov poll for the same paper, published Wednesday, reveals Labour has 41 percent support, up two points from last week, with the Tories falling one point to 36 percent. The Liberal Democrats were down to 9 percent and UKIP rose to 7 percent.\nUKIP’s support includes 15 percent of all Leave voters and 12 percent of people who voted for the Conservatives in 2017. The party is also now polling most strongly in the Tory heartland South of England, outside the capital, hitting 9 percent in this geographic area.\nWell quite. And more are joining every day, thank you. We will not let you down. https://t.co/kgzJYGADnI — UKIP (@UKIP) July 18, 2018\nThere is widespread opposition to Mrs May’s Brexit plan, with twice as many Brits wanting a clean exit from the EU than those who back her “soft Brexit” alternative, according to a poll out earlier this week.\nThis could explain why the Tories are losing support as UKIP makes gains, with voters switching back to UKIP after Mrs May did not make good on her promises to break free from EU rules and regulations.\nUKIP sources have also claimed that disaffected Brexit voters have been joining UKIP in large numbers since Mrs May’s Chequers summit, where she revealed the “soft” Brexit plan.\nOn Tuesday night, party officials confirmed 2,500 new members had been processed in the past week, and claimed 4,000 applications had been made since the Chequers plans were published.\nFurthermore, a YouGov poll from Monday showed former UKIP leader Nigel Farage is now seen as a leader of Brexiteers by more of the public, including Tory voters, than Theresa May.\nAnd an opinion poll for the Observer newspaper on Sunday had Jeremy Corbyn’s Labour Party on 40 percent support with the Conservatives trailing on 36 percent – a six-point fall since the beginning of last month.\nUKIP, meanwhile, was up 5 points to 8 percent support.","url":"https://www.breitbart.com/europe/2018/07/18/labour-retain-poll-lead-ukip-support-surges/"}
