{"authors":["Tim Sculthorpe","Deputy Political Editor For Mailonline"],"date_download":"2018-10-23 00:33:07","date_modify":"2018-10-23 00:33:07","date_publish":"2017-04-26 10:17:25","description":"Gisela Stuart (pictured) said Brexit was the best chance since World War II to renew Britain's politics but warned Labour was wasting the opportunity.","filename":"data/vaneerConsumption/LabourBrexitchampionGiselaStuartslamsherparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/04351A0E000003E8-0-image-a-21_1493198177510.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446930_Labour-Brexit-champion-Gisela-Stuart-slams-Labour_1540254787.html","title":"Labour Brexit champion Gisela Stuart slams her party","title_page":"Labour Brexit champion Gisela Stuart slams her party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Labour Brexit champion Gisela Stuart has condemned her party response to EU referendum and warned it was making itself 'irrelevant'.\nShe said Brexit was the best chance since World War II to renew Britain's politics but warned Labour was wasting the opportunity.\nSir Keir Starmer, the shadow Brexit secretary, yesterday set out Labour's plans for tackling Brexit but was accused of signalling surrender to Brussels.\nMs Stuart was the senior Labour campaigner on Vote Leave and is leaving Parliament at the snap election following the historic victory.\nLabour Brexit champion Gisela Stuart has condemned her party response to EU referendum and warned it was making itself 'irrelevant'\nWriting in The Telegraph, the outgoing Birmingham Edgbaston MP said Labour had to be more than a pressure group or movement and sell itself as a party of government that shared voters' desires.\nThe Birmingham Edgbaston MP said that Brexit will be the 'defining issue for this generation' and warned the campaign so far lacked 'precision'.\nShe said: 'This is the best opportunity since 1945 to renew our nation's politics and society and it speaks volumes that at this moment Labour has made itself irrelevant.\n'If we do want to be a party of government again, Labour must prepare for its own process of renewal.'\nMs Stuart said that while Prime Minister Theresa May was focusing on 'strong leadership' during the election campaign, Labour can focus on the Conservative Party's record on schools, the NHS and housing.\nMs Stuart (pictured on the Brexit trail with Boris Johnson) was the senior Labour campaigner on Vote Leave and is leaving Parliament at the snap election following the historic victory\nHowever the party will need more than a 'wish list and a collection of grievances', she said.\nMs Stuart also urged the leadership to resist the temptation to plan for a hung parliament and make pacts with other parties.\nShe said: 'If Labour instead wants to be a party of government, it has to go into the election fighting for every vote.\n'It must attack the Tories, yes, but it must also take a good look at the confidence and optimism voters feel about this country outside the EU and think hard about why Labour is not with them.'\nMs Stuart, who was first elected in 1997, announced she would not be seeking re-election at the start of the campaign.","url":"https://www.dailymail.co.uk/news/article-4446930/Labour-Brexit-champion-Gisela-Stuart-slams-Labour.html"}
