{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 18:32:02","date_modify":"2018-10-30 18:32:02","date_publish":"2016-08-05 17:30:29","description":"Shami Chakrabarti's peerage proves that her report into antisemitism within the Labour Party was a “whitewash”, Jewish leaders have said.","filename":"data/vaneerConsumption/LabourLeaderAccusedofConductingWhitewashforPeerageScandal.json","image_url":"https://media.breitbart.com/media/2016/08/GettyImages-543774512-1-e1470410921644.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_08_05__1540924322.html","title":"Labour Leader Accused of Conducting 'Whitewash for Peerage' Scandal","title_page":"Labour Leader Accused of Conducting 'Whitewash for Peerage' Scandal","title_rss":"NULL","source_domain":"breitbart.com","text":"The nomination of Shami Chakrabarti for a peerage just weeks after she published a report finding no indication of institutional anti-Semitism within the Labour Party proves that the report was a “fraud” and a “whitewash”, Jewish community leaders have said.\nThe nomination has also caused further ructions between Labour Party factions, as many who oppose Jeremy Corbyn’s leadership severely criticised him for the timing of his nomination of Ms. Chakrabarti.\nMr. Corbyn has previously promised that he would never nominate anyone for a peerage, but singled out Ms. Chakrabarti for inclusion in David Cameron’s resignation honours list. The bid came just days after he criticised a leaked draft of the list, saying the process should be “more democratic”.\nFollowing the announcement that Ms. Chakrabarti had accepted the peerage, Britain’s Chief Rabbi, Ephraim Mirvis, said the credibility of her report “lies in tatters”.\nHe said: “Shami Chakrabarti has a proud record of public service, but in accepting this peerage, the credibility of her report lies in tatters and the Labour Party’s stated intention, to unequivocally tackle anti-Semitism, remains woefully unrealised.”\nSimilarly, Marie van der Zyl, vice president of the Board of Deputies of British Jews, called the report a “whitewash” which had been bought with a peerage.\n“It is beyond disappointing that Shami Chakrabarti has been offered, and accepted, a peerage from Labour following her so-called ‘independent’ inquiry. The report, which was weak in several areas, now seems to have been rewarded with an honour,” she said.\n“This ‘whitewash for peerages’ is a scandal that surely raises serious questions about the integrity of Ms. Chakrabarti, her inquiry and the Labour leadership.”\nHaving undertaken the inquiry Ms. Charkrabarti concluded that “the Labour Party is not overrun by antisemitism, Islamophobia or other forms of racism,” although she advised that members avoid using words including ‘Paki’ and ‘Zio’, and that “Labour members should resist the use of Hitler, Nazi and Holocaust metaphors, distortions and comparisons in debates about Israel-Palestine in particular.”\nHowever, her conclusions were undermined when the Labour party media event to launch the report itself drew fresh allegations of anti-Semitism.\nShe also took the opportunity, in writing the report, to explain that she had joined the Labour party soon after accepting the brief “for two reasons.\n“Firstly, I had for some time been an undeclared Labour voter and supporter, though formally unaffiliated due to my work as first a civil servant and then the director of a crossparty, non-party human rights organisation.\n“Secondly, I wanted to be clear with everyone and especially with Labour members and supporters, that my Inquiry would be conducted, and any recommendations made, in the Party’s best interests.”\nCommenting on the peerage, the Campaign Against Antisemitism’s Director of Communications, Jonathan Sacerdoti said: “If anybody still took Shami Chakrabarti’s report or Jeremy Corbyn’s declared opposition to antisemitism seriously, this must be the final straw.\n“Shami Chakrabarti’s inquiry into antisemitism was suspected of being a fraud from the moment she promised to conduct it in Labour’s interests. Sure enough, she delivered a whitewash which failed to deal with Labour’s antisemitism problem in any meaningful way.\n“She did not tackle allegations of antisemitism in the Labour Party or their woeful handling by Jeremy Corbyn, and she even refused to adopt a definition of antisemitism.\n“Having promised to never send anyone to the House of Lords, that is exactly what Jeremy Corbyn has done in return for a clean bill of health.”\nThe nomination has also caused further infighting within a Labour Party already at war with itself. John Mann, the MP for Bassetlaw, an outspoken critic of anti-Semitism within the Labour Party told LBC Radio: “The rewarding of someone with a peerage for doing this kind of work is quite shocking – it is the worst kind of politics.\n“She has been given it because she has done this report and the accusation will be that the report has been watered down to please Mr Corbyn.”\nMeanwhile Labour MPs Wes Streeting and Dianne Abbot had a public spat, partially conducted over Twitter, in which Ms. Abbott warned Mr. Streeting to “consider his position” following his criticism of the timing of the nomination.\nMr. Streeting shot back that he had, and that he agreed with Rabbi Mirvis.\nShami Chakrabarti will bring great experience to Lords. But let’s not pretend that a Labour peerage in these circumstances doesn’t stink. — Wes Streeting MP (@wesstreeting) August 4, 2016\nDiane Abbott tells Sky News Wes Streeting should “consider his position” after Chakrabarti peerage position. — Josh May (@JoshMay_PH) August 5, 2016\nI’ve considered it: I agree with the Chief Rabbi that “the credibility of the Chakrabarti Report lies in tatters”. https://t.co/3dsNHKDUDv — Wes Streeting MP (@wesstreeting) August 5, 2016\nA spokesman for Mr. Corbyn said: “Shami Chakrabarti shares Jeremy’s ambition for reform of the House of Lords. Her career has been one of public service and human rights advocacy.\n“Her legal and campaigning skills, and the trust that she has gained from many ordinary Britons, will be a considerable asset to the House of Lords.”\nMs. Chakrabarti said: “I am honoured to accept Jeremy Corbyn’s challenge and opportunity to help hold the Government to account.\n“This is a dangerous moment for our country and we share vital human rights values that need defending more than ever before in my lifetime.”","url":"https://www.breitbart.com/europe/2016/08/05/labour-leader-accused-conducting-whitewash-peerage-scandal/"}
