{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 19:32:20","date_modify":"2018-10-30 19:32:20","date_publish":"2014-12-29 20:54:31","description":"Farmers in California are worried that President Obama's recent executive action on immigration will exacerbate a labor shortage problem in the Golden State's agriculture industry. |","filename":"data/vaneerConsumption/LaborShortageDuetoObamaExecAmnesty.json","image_url":"https://media.breitbart.com/media/2014/12/chicken-farm-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2014_12_29__1540927940.html","title":"Labor Shortage Due to Obama Exec Amnesty","title_page":"CA Farmers: Labor Shortage Due to Obama Exec Amnesty","title_rss":"NULL","source_domain":"breitbart.com","text":"Farmers in California are worried that President Obama’s recent executive action on immigration will exacerbate a labor shortage problem in the Golden State’s agriculture industry.\nSeveral California farmworkers told CBS San Francisco that the President’s action, which is predicted to shield up to five million people in the country illegally from deportation, could lure agriculture workers away from seasonal jobs toward full-time employment in other industries.\n“This action isn’t going to bring new workers to agriculture,” Western Growers vice president Jason Resnick predicted to CBS. “It’s possible that because of this action, agriculture will lose workers without any mechanism to bring in new workers.”\n“U.S. and Mexican farmers have to compete for that diminishing supply of farm labor,” added University of California, Davis researcher Edward Taylor. “Once this change hits, there’s no going back.”\nWestern Growers’ Resnick told CBS that the agricultural workforce has been in decline for the past ten years. The organization predicts that the industry is already experiencing a 15 to 20 percent labor shortage, leading many in agriculture to call for permanent, comprehensive changes to Unites States immigration policy.\n“Hopefully there will be the opportunity for comprehensive immigration reform,” state Department of Food and Agriculture secretary Karen Ross told CBS. “That’s the right thing to do for this country.”\nMeanwhile, in another potential blow to the agriculture industry, egg prices are set to rise in the coming months due to a different new law set to take effect New Year’s Day.\nAccording to the Los Angeles Times, a new law taking effect January 1 that mandates more space for California farm animals could contribute to a 10-40% increase in egg prices next year. UC Davis agricultural economist Dan Sumner told the Times that the cost of infrastructure upgrades, as well as the need to raise fewer chickens to comply with the law, could raise prices for the staple at local markets.\nTwo other factors could play a role in the price fluctuation of eggs; with meat prices at record highs, egg consumption in the U.S. is set to rise to its highest level in nearly a decade. Additionally, increased demand for eggs from Canada and Mexico could further push prices up.\n“It’s sort of a perfect storm,” California Grocers Association president Ronald Fong told the Times.\nUnder Proposition 2, approved by voters in 2008, farmers will need to provide 116 square inches of space for each bird, nearly double the amount previously required. So-called “battery cages,” or rows of cages filled with closely-confined birds, will no longer be allowed.\nChad Gregory, head of United Egg Producers, which represents over 90% of United States egg growers, told the Times that egg farmers would adapt to the new regulations, but that the reality of egg farming is far different than the ideal that consumers picture.\n“The sad reality is that consumers don’t really know where their food comes from,” Gregory told the paper. “What they think farming should look like is not a realistic picture if you want to provide a good and affordable source of food to 315 million people.”\nPaul Shapiro, vice president of farm animal protection at the Humane Society of the United States, told the Times that egg producers should have prepared for changes to the law earlier.\n“Egg producers have had six years to come into compliance with Prop. 2, and instead of using that time to convert to cage-free systems, they’ve simply sued and sued and lost every suit they filed while sitting on their hands,” Shapiro told the paper.","url":"https://www.breitbart.com/local/2014/12/29/ca-farmers-fear-labor-shortage-under-obama-executive-amnesty-egg-prices-set-to-rise/"}
