{"authors":["Quentin Letts For The Daily Mail"],"date_download":"2018-10-22 20:31:08","date_modify":"2018-10-22 20:31:08","date_publish":"2016-01-29 01:55:29","description":"The Commons was discussing the bedroom tax/spare room subsidy, writes QUENTIN LETTS. Should taxpayers’ money be used to give some public-housing tenants a spare room?","filename":"data/vaneerConsumption/LabourandConservativessquabbleoverthebedroomtaxbyQUENTINLETTS.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AD38EF00000578-0-image-a-7_1454032322926.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422083_Labour-terrific-honking-shrieking-QUENTIN-LETTS-resists-urge-stab-Biro-watch-Commons-squabble-bedroom-tax_1540240268.html","title":"Labour and Conservatives squabble over the bedroom tax, by QUENTIN LETTS","title_page":"Labour and Conservatives squabble over the bedroom tax, by QUENTIN LETTS | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Flabbergasted: Owen Smith\nTwo frontbenchers competed across the Commons table, one a former ministerial special adviser, one the ex-manager of a night club called Eros.\nWhich was the Conservative, which from Labour? Which of them might be expected to have a truer feel for public opinion on welfare handouts?\nThe Commons was discussing – groan – the bedroom tax/spare room subsidy. Excuse me while I stab myself with my Biro. Squabble squabble squabble. Should taxpayers’ money be used to give some public-housing tenants a spare room?\nThis argument was a big part of the General Election campaign, Tories saying the cut was vital to their welfare reforms, Labour insisting that the ‘tax’ (factually no such thing) was ‘wicked and cruel’. Labour lost the election.\nThe issue has been revived after the Court of Appeal ruled on Wednesday that the Government should not have withdrawn the subsidy from people with severely disabled children who need overnight care. The same applied to victims of extreme domestic violence. Lawyers 1, Politicians Nil.\nVoters may have supported a policy but, in this age of power wigs, that policy is subservient to the fiat of unelected lawyers.\nLabour yesterday persuaded Speaker Bercow to grant an Urgent Question on the matter.\nThe Opposition’s case was led by Owen Smith, who brings to his utterances all the vinegary indignation of a Pontypridd street preacher.\nGloom and fury exist in equal measure in his pessimistic fulminations. No sentence is complete without a dollop of Biblical hyperbole and, perhaps, a hint of class hatred.\nShadow Pensions Secretary Smith is bespectacled with short, dark hair neatly parted, a monochrome, ascetic creation. The core Labour vote likes him.\nHis opponent yesterday was not the Secretary of State, Iain Duncan Smith (though he was present and on the front bench) but a junior minister, Justin Tomlinson.\nSo tall that he stoops slightly to address the microphone, plain-spoken Tomlinson has been an MP since 2010 but a minister only a few months. He has departmental responsibility for disabled people. Hence his presence yesterday.\nMr Smith, having heard opening remarks from Mr Tomlinson, bristled. I have seen stable mucking-out brushes less stiff.\nHe was ‘flabbergasted’ (twice, indeed) by the minister’s ‘extraordinary’ response.\nThe adjective was lemon-squeezed on Mr Smith’s Cambrian larynx. ‘Estrawdeenarry’. And he was particularly vexed that Mr Duncan Smith was not himself speaking at the despatch box.\nIDS was ‘ducking his responsibilities,’ averred Mr Smith. ‘He is not prepared to defend his policy!’\nMr Tomlinson defended the policy for his boss and did so without succinct ability.\nHe had to put up with terrific honkings and shriekings and face-fanning from Labour MPs. ‘Disgusting!’ they cried. ‘Disgraceful! No! Wrong!’ Mr Tomlinson kept his nerve.\nThe Commons was discussing – groan – the bedroom tax/spare room subsidy, writes QUENTIN LETTS. Should taxpayers’ money be used to give some public-housing tenants a spare room?\nHe said needy families were shielded from the cuts by discretionary payments.\nThe £850million put aside for such payments was proving perfectly adequate. The Government had to make welfare reductions.\nIf Labour did not accept that, how could it balance its proposed budgets? At the top of this sketch I told you that one frontbencher was an ex ministerial special adviser and that one formerly ran a nightclub called Eros. It may or may not surprise you to know that the man from Eros was Minister Tomlinson.\nI have not been to the establishment in question but it is in Swindon. That Wiltshire Eden was identified by some – including Labour’s Chuka Umunna – as a vital swing area at the last election. Swindon, Labour in the Blair years, in May opted for David Cameron.\nOur former Whitehall special adviser (spad) was Mr Smith. In 2006 his Labour patrons tried to parachute him into Blaenau Gwent in a by-election but he was beaten by an independent candidate. The locals reckoned Mr Smith was an out-of-touch metropolitan.","url":"https://www.dailymail.co.uk/news/article-3422083/Labour-terrific-honking-shrieking-QUENTIN-LETTS-resists-urge-stab-Biro-watch-Commons-squabble-bedroom-tax.html"}
