{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 18:31:51","date_modify":"2018-10-30 18:31:51","date_publish":"2016-07-01 09:08:54","description":"A press conference called to announce that the Labour Party is “not overrun” by anti-Semitism prompted fresh allegations of anti-Semitism","filename":"data/vaneerConsumption/LabourPressConferenceonAntiSemitismResultsInFreshAccusationsofAntiSemtism.json","image_url":"https://media.breitbart.com/media/2016/06/GettyImages-543774512-e1467307080743.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_07_01__1540924311.html","title":"Labour Press Conference on Anti-Semitism Results In Fresh Accusations of Anti-Semtism","title_page":"Labour Press Conference on Anti-Semitism Results In Fresh Accusations of Anti-Semtism","title_rss":"NULL","source_domain":"breitbart.com","text":"A press conference called to announce that an inquiry has found the Labour Party is “not overrun” by anti-Semitism has prompted fresh allegations of anti-Semitism within the party, after its leader Jeremy Corbyn compared the Israeli government to Islamic State, and a Jewish MP fled the room in tears after being accused of conspiring with the right wing press.\nThe inquiry, undertaken by Shami Chakrabarti, was commissioned in April by Corbyn as a response to numerous allegations of anti-Semitism in the Labour at all levels. It was sparked by the suspension of Bradford MP Naz Shah for her suggestion, posted to Facebook, that Israelis be deported to America, and former Mayor of London Ken Livingstone’s defence of Ms. Shah, in which he asserted that ‘Hitler was a Zionist’.\nCharkrabarti has reached the conclusion that “the Labour Party is not overrun by antisemitism, Islamophobia or other forms of racism,” although she has advised that members avoid using words including ‘Paki’ and ‘Zio’, and that “Labour members should resist the use of Hitler, Nazi and Holocaust metaphors, distortions and comparisons in debates about Israel-Palestine in particular.”\nBut in presenting the findings to a press audience on Thursday, Mr Corbyn drew fresh accusations of anti-Semitism, and of being in denial over the party’s problems with anti-Semitism. After attempting to deflect from anti-Semitism within Labour ranks, he then compared the Israeli government to Islamic State.\n“Whatever your views on the outcome of the referendum campaign – and two-thirds of Labour supporters voted Remain – we need to reflect for a few moments on some of the hateful language used by some of the most prominent participants in it,” he told reporters.\nHe continued, remarking before Boris Johnson dropped out of the Conservative leadership race: “Boris Johnson, current favourite to lead the Tory party, compared Hitler’s murderous tyranny with the European project … Michael Gove compared pro-Remain economists to Nazi collaborators … And Nigel Farage warned of mass sex attacks should the Remain Campaign win, calling it the “nuclear bomb” of the Brexit campaign.”\nNo mention was made of Mr Livingstone’s remarks regarding Hitler.\nThen, denouncing the use of anti-Semitic terms he added: “Our Jewish friends are no more responsible for the actions of Israel or the Netanyahu government than our Muslim friends are for those various self-styled Islamic states or organisations.”\nHis comments have been widely criticised by Jewish leaders. Former chief rabbi Lord Sacks slammed the comparison to Islamic State as “demonisation of the highest order, an outrage and unacceptable”.\nHe told the Jewish Chronicle: “That this occurred at the launch of the report into the Labour Party’s recent troubles with antisemitism shows how deep the sickness is in parts of the left of British politics today.\n“Israel is a democratic state with an independent judiciary, a free press and a diverse population of many cultures, religions and creeds. Isis is a terrorist entity whose barbarities have been condemned by all those who value our common humanity. In the current political climate, when hate crimes are rising and political rhetoric is increasingly divisive, this is all the more shocking.”\nMr Corbyn has denied making the comparison; his office has since said that he wasn’t referring to Islamic State specifically but a collection of groups and states.\nBut the current Chief Rabbi Ephraim Mirvis said Mr Corbyn’s comments “however they were intended, are themselves offensive, and rather than rebuilding trust among the Jewish community, are likely to cause even greater concern.”\nMatters then escalated when a Momentum activist and former Guardian writer Marc Wadsworth accused Labour MP Ruth Smeeth of colluding with the Daily Telegraph during a speech, prompting her to storm out of the meeting. Both she and Labour staffers were in tears following the event.\nMr Corbyn’s failure to intervene on behalf of Ms Smeeth has led to further calls for his resignation, not least from Ms Smeeth herself who posted on social media: “This morning, at the launch of the Chakrabarti Inquiry into anti-Semitism, I was verbally attacked by a Momentum activist and Jeremy Corbyn supporter who used traditional anti-Semitic slurs to attack me for being part of a ‘media conspiracy’. It is beyond belief that someone could come to the launch of a report on anti-Semitism in the Labour Party and espouse such vile conspiracy theories about Jewish people.\n“No-one from the Leader’s office has contacted me since the event, which is itself a catastrophic failure of leadership. I call on Jeremy Corbyn to resign immediately and make way for someone with the backbone to confront racism and anti-Semitism in our party and in the country.”\nLabour MP Wes Streeting told MailOnline he was ‘disgusted’ by events at this morning’s launch.\nHe said: “I don’t think Jeremy Corbyn could have done any more harm this morning than he did if he tried. To stand by silently while a Jewish Labour MP is abused by a Momentum activist, accusing her of collaborating with the Telegraph – it was repulsive.\n“In addition to all of the other questions about his competence to lead the Labour Party, I’m afraid he has lost any moral authority.\n“I’m beyond the idea that Jeremy Corbyn is a kind and decent man – there is no longer any evidence to justify that. He should go immediately. If he does not, there will be a single challenger.”\nMeanwhile the Chakrabarti report itself has been slammed by Jewish representatives as a “whitewash.”\nCommenting on the report, Jonathan Sacerdoti, Director of Communications at Campaign Against Antisemitism said: “The Chakrabarti Inquiry presented what it set out to present: a narrow set of recommendations on how the Labour Party should change its rules on racism. It did not examine the disgraceful cases of antisemitism in the Party, or their even more disgraceful mishandling by the Party leadership, including Jeremy Corbyn who presides over a regime of the lightest slaps on wrists for even the most offensive and deliberate anti-Semites.\n“Inexcusably, the Inquiry proposes making it harder to suspend anti-Semites and keeping suspensions secret so as not to affect elections. Additionally the Inquiry dismisses any claims of antisemitism arising from sharing a stage with anti-Semites, and suggests that any anti-Semitic incident coming to light after more than two years should not be considered — a limitation period so short it has no parallel in any other disciplinary regime that we are aware of.\n“Apart from imploring Labour activists to stop calling Jews ‘Zios’ or accusing them of supporting Nazi policies, this Inquiry is a vague, meaningless whitewash that will do nothing to rid Labour of antisemitism or address the total absence of leadership it has shown on this issue.\n“For Jeremy Corbyn to compare Israel to ISIS during his event dedicated to antisemitism only goes to show just how little grasp he has of this pressing problem for his party.”","url":"https://www.breitbart.com/europe/2016/07/01/labour-press-conference-on-anti-semitism-results-in-fresh-accusations-of-anti-semtism/"}
