{"authors":["Tim Sculthorpe","Mailonline Deputy Political Editor"],"date_download":"2018-10-23 00:49:13","date_modify":"2018-10-23 00:49:13","date_publish":"2016-01-11 10:40:56","description":"Another £1.3million could disappear from party coffers if separate reforms are pushed through by Chancellor George Osborne. The Government today faced claims it was 'authoritarian'.","filename":"data/vaneerConsumption/Labourfacelosing6MILLIONbecauseofpartisanToryunionreforms.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/10/2FDE270E00000578-0-image-a-15_1452508563330.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393699_Labour-forced-sack-staff-losing-6MILLION-year-partisan-Tory-reforms-trade-union-laws_1540255753.html","title":"Labour face losing £6MILLION because of 'partisan' Tory union reforms","title_page":"Labour face losing £6MILLION because of 'partisan' Tory union reforms | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Jeremy Corbyn, pictured at his home, could have to deal with a £6million cut in funding if trade union reforms in Parliament today become law\nLabour could lose as much £6million every year, forcing it cut staff, if 'entirely partisan' Tory proposals to reform trade union laws are pushed through, it emerged today.\nAnother £1.3million could disappear from annual party coffers if separate reforms are pushed through by Chancellor George Osborne.\nThe union reforms, being debated in the House of Lords today, have been blasted as 'authoritarian' for a senior former civil servant.\nThe scale of the funding challenge presented to Labour by the new laws was laid bare in an internal memo leaked to The Guardian.\nThe document said: 'The party could not absorb a loss of £5-6m and maintain its current structure.\n'With an annual salary cost in excess of over 50 per cent of total costs, it is clear that current staffing levels could not be sustained.\n'In addition to a staffing review, all contracts would need to be challenged to remove any discretionary costs and offices considered for sale or sublet.'\nThe change is driven by the Trade Union Bill which requires all union members to actively opt in to making political contributions via their union subscription.\nThe legislation also imposes minimum turn out thresholds for strike action to be legitimate but ministers resisted calls for unions to be allowed to conduct ballots online. Legislation dating from the 1990s says they must be carried out by post.\nThe Bill is expected to be law by the summer despite bitter opposition from Labour. The Commons voted for it last year.\nLabour is facing a further loss of £1.3million as the Government wants to cut 'short money' - the cash provided by the taxpayer to opposition parties to pay for their work opposing ministers.\nLord Collins, a former Labour general secretary involved in the fight against the changes, told The Guadian: 'These changes are entirely partisan, unfair and going to hit the income of the party and union political funds very hard.\n'No balancing measure is being taken to cap the donations of the Conservative party.'\nIn a column for The Guardian, former head of the home civil service Sir Bob Kerslake said the changes 'demonstrate a worryingly authoritarian streak in this government that is not comfortable with scrutiny and challenge'.\nSir Bob continued: 'For all my frustrations with trade unions, I recognise that they had a legitimate role to defend their members, individually and collectively.\n'Indeed it is arguable that given the scale change their members have faced, including real-terms pay reductions, the trade unions have acted with considerable restraint.\nFormer Labour general secretary Ray Collins, left, has said the changes are 'entirely partisan' following an internal memo which said Labour faces losing £6million from the trade union reforms, described by senior former civil servant Sir Bob Kerslake, right, today as a sign of an 'authoritarian' streak in the Government\nThe issues at stake here go beyond the immediate concerns of the trade unions themselves, or indeed one political party.\n'They go to the heart of what we mean by an open society and balanced, proportionate government.'\nIn 2014, five unions and about two million members contributed a total of about £5.5million to Labour.\nA further nine trades union are also affiliated to Labour and provide funds.\nThe internal document estimates only around 10 per cent union members would opt in under the new rules - potentially slashing donations from the big five unions to around £1million.\nA spokesperson for the Department for Business, Innovation and Skills said: 'Union members already have a choice as to whether they pay into a political fund or not.\n'These changes mean members will be asked to give a positive indication if they want to pay into a union's political fund.'","url":"https://www.dailymail.co.uk/news/article-3393699/Labour-forced-sack-staff-losing-6MILLION-year-partisan-Tory-reforms-trade-union-laws.html"}
