{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:28:23","date_modify":"2018-10-30 20:28:23","date_publish":"2016-06-15 14:02:58","description":"Labour party activists have walked off Bob Geldof’s anti-Brexit boat in “disgust”, “apologis[ing]” for the “jeering at fisherman\".","filename":"data/vaneerConsumption/LabourApologisesForJeeringAtWorkingClassFishermen.json","image_url":"https://media.breitbart.com/media/2016/06/GettyImages-540302350-e1485280542812.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_06_15__1540931303.html","title":"Labour ‘Apologises’ For ‘Jeering’ At Working Class Fishermen","title_page":"Labour ‘Apologises’ For ‘Jeering’ At Working Class Fishermen","title_rss":"NULL","source_domain":"breitbart.com","text":"Labour party activists have walked off Bob Geldof’s anti-Brexit boat in “disgust”, “apologis[ing]” for “jeering at fisherman worried about their livelihoods”.\nMr. Geldof, the musician and political campaigner, shouted insults over a loud speaker and was photographed swearing at the fishermen in today’s flotilla.\nUKIP leader Nigel Farage called the protest “disgusting, rich people laughing at poor people… effectively laughing and working class communities being destroyed.”\nBethany Pickering, a politics student and self-described “socialist, feminist, environmentalist” announced the Labour activist’s apology on Twitter.\n“On a boat with Bob Geldof and its awful. I may vote remain, but don’t support jeering at fisherman worried about their livelihoods”.\nShe continued: “As someone who was on Bob Geldof’s boat, and left with others in protest, I can tell you it is everything wrong with strongerin… Fisherman, please know that most Labour remain people on Geldof’s boat left in disgust. Not why I’m in at all”.\nTo be sure, she concluded: “Left Bob Geldof’s boat in disgust. Fisherman, the Labour Remain presence sincerely apologises”.\nUKIP leader Nigel Farage agreed with the left-wing activist. He told BBC News shortly after the protest:\n“What… Multi-millionaire Mr. Geldof did is show absolute contempt for the men and women who have come here today, from right across the United Kingdom, asking, demanding to be listened to as their communities are destroyed by the Common Fisheries Policy.\n“I think, frankly, as a spectacle it’s pretty disgraceful,” he added. “Then what [Mr. Geldof] did was to show the depth of his ignorance.\n“The Common Fisheries Policy is sorted out on the principle of equal access to a common resource – which means what is rightfully ours, [but] we share with the rest of the European Union.\n“We’re only allowed to catch 20 per cent by value of the fish that swim in what should be our territorial waters – Mr. Geldof clearly doesn’t understand that.”\nBob Geldof and Nigel Farage trade insults over the Thames as the #EURef fishing debate reaches boiling pointhttps://t.co/Jbng5TMNcb — ITV News (@itvnews) June 15, 2016\nMr. Farage added: “What we’ve seen today… is the establishment protesting against us and trying to drown out the voices of ordinary people who are saying, ‘please help us’.\n“Because this industry has been destroyed. And actually, if we go on inside the European Union, God knows where it will be in five or ten years’ time.\n“Brexit is the only solution for our fishing industry.”","url":"https://www.breitbart.com/europe/2016/06/15/labour-activists-apologies-in-disgust-for-jeering-at-working-class-fisherman/"}
