{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:13:15","date_modify":"2018-10-30 22:13:15","date_publish":"2016-12-17 03:48:56","description":"Los Angeles County supervisors Janice Hahn and Hilda Solis are asking their colleagues to join them in setting aside $1 million in county funds that can be used to help illegal immigrants fight deportation. | Local","filename":"data/vaneerConsumption/LACountyConsiders1MillioninTaxpayerFundstoHelpIllegalsFightDeportation.json","image_url":"https://media.breitbart.com/media/2016/12/illegal-aliens-may-15-2016-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_12_16__1540937595.html","title":"LA County Considers $1 Million in Taxpayer Funds to Help Illegals Fight Deportation","title_page":"LA County Considers $1 Million in Taxpayer Funds to Help Illegals Fight Deportation | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Los Angeles County supervisors Janice Hahn and Hilda Solis are asking their colleagues to join them in setting aside $1 million in county funds that can be used to help illegal immigrants fight deportation.\nIt is estimated that LA County’s illegal immigrant population is over 800,000, and the $1 million in funding would come from taxpayers’ pockets.\nAccording to KPCC, supervisor Hahn’s spokeswoman Liz Odendahl explained that “The idea is to set up the legal fund with $1 million in the first year, then obtain matching funds from public or private donors.” The move is a preemptive one, aimed at short-circuiting President-elect Donald Trump’s pledge “to deport millions of immigrants living in the country illegally.”\nHahn said, “Many immigrants who are facing deportation have a legal avenue to stay in this country, but they are not aware of it because they don’t have legal representation.”\nThe push to use taxpayer funds to benefit illegal immigrants is not new to California. In 2014 Governor Jerry Brown (D) “authorized about $3 million annually for nonprofit legal services providers to represent unaccompanied minors arriving at the U.S.-Mexico border.”\nBreitbart News previously reported that amnesty groups in California are working to deny federal access to the database containing names of gang members in the state. This, too, is a preemptive move aimed at preventing members of the Trump administration from searching the database for illegals, who may thereafter be deported. The Voice of OC quoted Trump from a post-election 60 Minutes interview in which he “vowed to immediately deport as many as three million undocumented immigrants, specifically those with criminal records such as gang members and drug dealers.”\nThe proposal to use $1 million in taxpayer funds to protect illegals will be voted on next week.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and host of “Bullets with AWR Hawkins,” a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2016/12/16/la-county-considers-setting-aside-1-million-help-illegals-fight-deportation/"}
