{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 22:00:36","date_modify":"2018-10-30 22:00:36","date_publish":"2015-11-05 22:23:42","description":"L.A. County Sheriff Jim McDonnell says much of the blame for the rise in crime in California can be attributed to the passage of Prop 47.","filename":"data/vaneerConsumption/LACountySheriffBlamesProp47forCrimeSpike.json","image_url":"https://media.breitbart.com/media/2015/10/Crime-Scene-line.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_11_05__1540936836.html","title":"L.A. County Sheriff Blames Prop 47 for Crime Spike","title_page":"L.A. County Sheriff Blames Prop 47 for Crime Spike | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"California’s Proposition 47, also known as the Safe Neighborhood and Schools Act, was intended to reduce crime and the state’s prison population by downgrading several drug anh property crimes from felonies to misdemeanors when it was approved by voters last year.\nIn the wake of its passage, it appears the opposite has happened: according to the San Francisco Chronicle, incidents of car theft, robberies and aggravated assaults are all up in San Francisco in 2015, and in Los Angeles, violent crime has spiked 20.6 percent over last year while property crime has increased by 11 percent.\nIn an interview with the Los Angeles Times, L.A. County Sheriff Jim McDonnell says much of the blame for the rise in crime in California can be directly attributed to the passage of Proposition 47.\n“Do I think that Californians are more at risk today than they were prior to the passage of Prop 47? I do,” McDonnell told the Times in a video interview. “I look at 47 and the intent behind it as an honorable intent, one that we would focus on treatment rather than incarceration for drug offenses and low-level thefts. In order to be successful in doing that, I believe we should have front-loaded the treatment portion with funding from the state to be able to ensure that if we’re gonna get this thing rolling, that we have the beds, that we have the capability to be able to deal with the treatment part of the equation. We didn’t have any of that.”\n“It paints a picture that we didn’t set it up for success,” McDonnell continued. “And I think to the detriment of all of us, because what we’ve seen then is an increase not only in property crime but also in violent crime. And that has certainly taken its toll on the county.”\nMcDonnell also said that by downgrading what were once felony drug crimes to simple misdemeanors, drug addicts could ” no longer be compelled to go in to treatment, and as a result, treatment is down.\nIn addition, McDonnell also commented on, cod confirmed, the “Ferguson Effect,” the newfound hesitation of law enforcement to do their jobs lest they be accused of racism, saying it has contributed to the rise in crime not just in Los Angeles, but around the country as well.\n“Hopefully we’ll be able to get through this period that we’re currently in – I don’t think we’ve seen anything like this since the 60s,” McDonnell concluded.","url":"https://www.breitbart.com/local/2015/11/05/l-county-sheriff-blames-prop-47-crime-spike/"}
