{"authors":["Cassie Carpenter For Dailymail.Com"],"date_download":"2018-10-22 21:42:27","date_modify":"2018-10-22 21:42:27","date_publish":"2016-01-11 01:22:24","description":"The 29-year-old pop diva received her first-ever nod for her role as the blood-lusting hotelier The Countess in FX's American Horror Story: Hotel","filename":"data/vaneerConsumption/LadyGagagoesretroHollywoodglamforherfirstGoldenGlobeAwards.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/3001E79500000578-0-image-a-58_1452475960845.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393060_Lady-Gaga-goes-retro-Hollywood-glam-corseted-black-gown-Marilyn-style-wig-Golden-Globes_1540244547.html","title":"Lady Gaga goes retro Hollywood glam for her first Golden Globe Awards","title_page":"Lady Gaga goes retro Hollywood glam for her first Golden Globe Awards | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lady Gaga covered her tattoos with body make-up and went full retro Hollywood glam for her first-ever nomination at Sunday'sGolden Globe Awards in Beverly Hills.\nThe 29-year-old pop diva's stylist of seven years, Brandon Maxwell, dressed her in a corseted, black Atelier Versace gown and Marilyn-style wig.\nThe Haus of Gaga director once told Fashionista: 'With her, of course, you don't really have to think about comfort. That's not really the first thing that comes to her mind.'\nScroll down for full list of winners and video\nFIfties glamour: Lady Gaga covered her tattoos with body make-up and went full retro Hollywood glam for her first-ever nomination at Sunday's Golden Globe Awards in Beverly Hills\nThe Cheek to Cheek songstress opted for nude lips and diamond accessories to go along with her heavily-cinched waistline and padded hips.\nGaga - born Stefani Germanotta - was dutifully joined at the Beverly Hilton by her fiancé Taylor Kinney, who matched her in an equally traditional tuxedo.\n'We keep on, back and forth on [wedding] dates, and I think it’ll just be a surprise,' the 34-year-old actor told DailyMail.com this week.\nExaggerating her 5ft1in curves: The 29-year-old pop diva's stylist of seven years, Brandon Maxwell, dressed her in a corseted, black Atelier Versace gown and Marilyn-style wig\nHer stylist of seven years, Brandon Maxwell, once told Fashionista: 'With her, of course, you don't really have to think about comfort. That's not really the first thing that comes to her mind'\nCountess-approved: The Cheek to Cheek songstress opted for nude lips and diamond accessories to go along with her heavily-cinched waistline and padded hips\nHer other half: Gaga - born Stefani Germanotta - was dutifully joined at the Beverly Hilton by her fiancé Taylor Kinney, who matched her in an equally traditional tuxedo\nThe 34-year-old actor told DailyMail.com this week: 'We keep on, back and forth on [wedding] dates, and I think it’ll just be a surprise'\nThe six-time Grammy winner received the nod for her role as the blood-lusting hotelier The Countess in FX's American Horror Story: Hotel.\nMother Monster will compete in the Best Actress in a Limited-Series or TV Movie category against Sarah Hay, Felicity Huffman, Queen Latifah, and Kirsten Dunst.\nWhen Gaga first learned of her nomination, she tweeted that she apologised to her neighbours for screaming in her Manhattan apartment.\nChecking in? The six-time Grammy winner received the nod for her role as the blood-lusting hotelier The Countess in FX's American Horror Story: Hotel\nWho will win? Mother Monster will compete in the Best Actress in a Limited-Series or TV Movie category against Sarah Hay, Felicity Huffman, Queen Latifah, and Kirsten Dunst\n'I am too excited for words at this recognition for my work!' the New York native told EW in a formal statement.\n'I dreamed endlessly of being in television & film. This is a real honor for a waitress/singer/actress from New York!'\nIt's an impressive feat for the Applause Singer, whose only prior roles were Bertha in Sin City: A Dame to Kill For last year,and La Camaleón in Machete Kills in 2013.\n'This is a real honor for a waitress/singer/actress from New York!' When Gaga first learned of her nomination, she tweeted that she apologised to her neighbours for screaming in her Manhattan apartment\nShe captioned this snap of her mother Cynthia and manager Bobby Campbell: '[They're] so emotional about our Best Actress Golden Globe Nomination and so happy for Ryan Murphy and the whole gang for HOTEL's nomination for Best TV Series!'\nRobert Rodriguez muse: It's an impressive feat for the Applause Singer, whose only prior roles were Bertha in Sin City: A Dame to Kill For last year (pictured), and La Camaleón in Machete Kills in 2013\nRyan Murphy's campy-horror series is also up for Best TV Movie or Limited-Series - competing against American Crime, Fargo, Flesh and Bone, and Wolf Hall.\nCatch more of the two-time Emmy nominee on the fifth season finale of American Horror Story: Hotel, which airs Wednesday on FX.\nNBC airs the 73rd Annual Golden Globe Awards Sunday night, and the booze-filled ceremony will be hosted for the fourth time by Ricky Gervais.\nFace to face: Ryan Murphy's campy-horror series is also up for Best TV Movie or Limited-Series - competing against American Crime, Fargo, Flesh and Bone, and Wolf Hall\nThe thrilling conclusion: Catch more of the two-time Emmy nominee on the fifth season finale of American Horror Story: Hotel, which airs Wednesday on FX\n'I'm on my way': NBC airs the 73rd Annual Golden Globe Awards Sunday night, and the booze-filled ceremony will be hosted for the fourth time by Ricky Gervais\nThe 'Till It Happens to You belter - along with Diane Warren - will next compete at the February 15 Grammy Awards for Best Song Written For Visual Media (rape documentary The Hunting Ground).\nAnd catch more of Kinney as Lieutenant Kelly Severide in the fourth season of Chicago Fire, which continues January 19 on NBC.\nUp next! The 'Till It Happens to You belter - along with Diane Warren (R) - will next compete at the February 15 Grammy Awards for Best Song Written For Visual Media (rape documentary The Hunting Ground)\nHot firefighter: And catch more of Kinney as Lieutenant Kelly Severide in the fourth season of Chicago Fire, which continues January 19 on NBC\n2016 GOLDEN GLOBE AWARD WINNERS - TELEVISION Best Performance by an Actress in a Limited Series or Motion Picture Made for Television Uzo Aduba, Orange is the New Black Joanne Froggatt, Downton Abbey Regina King, American Crime Judith Light, Transparent Maura Tierney, The Affair Best Performance by an Actor in a Limited Series or Motion Picture Made for Television Idris Elba, Luther Oscar Isaac, Show Me a Hero David Oyelowo, Nightingale Mark Rylance, Wolf Hall Patrick Wilson, Fargo Best Performance by an Actress in a Television Series – Drama Caitriona Balfe, Outlander Viola Davis, How to Get Away with Murder Taraji P Henson, Empire Eva Green, Penny Dreadful Robin Wright, House of Cards Best Performance by an Actor in a Television Series – Musical or Comedy Aziz Ansari, Master of None Gael Garcia Bernal, Mozart In The Jungle Rob Lowe, The Grinder Patrick Stewart, Blunt Talk Jeffrey Tambor, Transparent Best Performance by an Actor in a Television Series – Drama Jon Hamm, Mad Men Rami Malek, Mr Robot Wagner Maura, Narcos Bob Odenkirk, Better Call Saul Liev Shreiber, Ray Donovan Best Performance by an Actress in a Television Series – Musical or Comedy Rachel Bloom, Crazy Ex-Girlfriend Jamie Lee Curtis, Scream Queens Julia Louis Dreyfus, Veep Gina Rodriguez, Jane the Virgin Lily Tomlin, Grace and Frankie\nBest Performance by an Actress in a Supporting Role in a Series, Limited Series or Motion Picture made for Television Lady Gaga, American Horror Story Sarah Haye, Flesh and Bone Felicity Huffman, American Crimes Queen Latifah, Bessie Kirsten Dunst, Fargo Best Television Limited Series or Motion Picture Made for Television American Horror Story Fargo Flesh And Bone Stars Wolf Hall Best Performance by an Actor in a Supporting Role in a Series, Limited Series or Motion Picture made for Television Alan Cumming, The Good Wife Damian Lewis, Wolfhall Ben Mendelson, Bloodline Tobias Menzies, Outlander Christian Slater, Mr Robot Best Television Series - Musical or Comedy Orange Is The New Black Silicon Valley Transparent Veep Casual Mozart In The Jungle Best Television Series - Drama Empire Game of Thrones Mr Robot Narcos Outlander","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393060/Lady-Gaga-goes-retro-Hollywood-glam-corseted-black-gown-Marilyn-style-wig-Golden-Globes.html"}
