{"authors":["Dan Cain For Mailonline"],"date_download":"2018-10-23 01:24:02","date_modify":"2018-10-23 01:24:02","date_publish":"2016-01-11 12:17:51","description":"Winners and presenters from Sunday night's Golden Globes have been beautifully captured in a set of stunning photographic portraits taken behind the scenes.","filename":"data/vaneerConsumption/LadyGagaJenniferLawrenceandBrieLarsoninGoldenGlobesbehindthescenesportraits.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/300A264F00000578-0-image-a-104_1452516075499.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393695_Lady-Gaga-Jennifer-Lawrence-Brie-Larson-pictured-striking-scenes-portraits-Golden-Globes_1540257842.html","title":"Lady Gaga, Jennifer Lawrence and Brie Larson in Golden Globes behind the scenes portraits","title_page":"Lady Gaga, Jennifer Lawrence and Brie Larson in Golden Globes behind the scenes portraits | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Winners and presenters from Sunday night's Golden Globes have been beautifully captured in a set of stunning photographic portraits taken behind the scenes of the star-studded ceremony.\nThe likes of Lady Gaga, Jennifer Lawrence and Brie Larson were snapped by revered Dutch photography duo Inez van Lamsweerde and Vinoodh Matadin as they left the stage.\nMusician-turned-actress Gaga, 29, called her win in the Best Performance By An Actress In A Limited Series Or Motion Picture Made For Television category for her role as The Countess Elizabeth in American Horror Story 'one of the greatest moment of my life'.\nScroll down for video\nEyes on the prize: Winners and presenters from Sunday night's Golden Globes have been beautifully captured in a set of stunning photographic portraits taken behind the scenes of the star-studded ceremony\nAnd she looked every inch the film icon in her portrait, as she clutched her award while gazing down at the camera lens.\nThe star resembled a 50s siren, with her blonde Marilyn Monroe-style blonde locks and off the shoulder black gown the very essence of glamour.\nJennifer Lawrence, 25, cut a powerful figure in her portrait which was taken after she received the Best Actress In A Motion Picture - Musical Or Comedy gong for 'Joy'.\nSee full Golden Globes coverage on the portraits taken of winners with their awards\nAward-winner: Jennifer Lawrence, 25, cut a powerful figure in her portrait which was taken after she received the Best Actress In A Motion Picture - Musical Or Comedy gong for 'Joy'\nStriking: Brie Larson, 26, showcased her feminine beauty as she struck a sexy pose in a shimmering sequinned dress\nPut 'em up: Sylvester Stallone won Best Performance By An Actor In A Supporting Role - Motion Picture for 'Creed'\nThe Hunger Games star wore her blonde locks slicked back into a faux crop on the night which saw her collect her fourth Globe.\nBrie Larson, 26, showcased her feminine beauty as she struck a sexy pose in a shimmering sequinned dress.\nThe actress claimed the award for Best Performance By An Actress In A Motion Picture - Drama for her role in 'Room'.\nDouble team: Alejandro Inarritu and Leonardo DiCaprio claimed Best Director - Motion Picture and Best Performance By An Actor In A Motion Picture - Drama, respectively, for 'The Revenant'\nDramatic: Taraji P. Henson took home Best Performance By An Actress In A Television Series - Drama for 'Empire'\nNo reason to be mad: Jon Hamm claimed Best Performance By An Actor In A Television Series - Drama for 'Mad Men'\nMusic buddies: Sam Smith and Jimmy Napes' 'Writing's On The Wall' from Bond film 'Spectre' won Best Original Song - Motion Picture\nTilting her head back for the shot, she reached up and interlocked her fingers while mainting seductive eye contact with the camera.\nOther stars pictured included Mark Wahlberg with Will Ferrell, Leonardo DiCaprio with director Alejandro Inarritu, Sam Smith, Taraji P. Henson, Matt Damon and Sylvester Stallone.\nLast year, Ellen von Unwerth was charged with capturing the winners in a series of glittery backstage portraits.\nComedy gold: Mark Wahlberg and Will Ferrell's bromance was captured in black and white\nEnglish beauty: Kate Winslet was stunned by her Best Performance By An Actress In A Motion Picture win for 'Steve Jobs'\nHandsome: Christian Slater took home the Best Performance By An Actor In A Supporting Role In A Series, Limited Series Or Motion Picture Made For Television gong for Mr. Robot\nFashion photographers Inez and Vinoodh have worked together since 1986.\nThey have worked on campaigns for Chanel, Roberto Cavalli, Donna Karan, DKNY, Stella McCartney, Brioni, Moschino, been featured in a plethora of fashion publications and even directed Lady Gaga's 2013 Applause music video.\nThe duo told Instagram: 'We really like people, and the idea of finding the most iconic, the most heroic, the most timeless, the most essential image of someone.'\nSuperstar: Matt Damon put on a poker face, alongside Amy Adams after winning Best Performance By An Actor In A Motion Picture - Musical Or Comedy for 'The Martian'\nSimple, yet effective: Andy Samberg played it straight with a subtle smile in his portrait","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393695/Lady-Gaga-Jennifer-Lawrence-Brie-Larson-pictured-striking-scenes-portraits-Golden-Globes.html"}
