{"authors":["Associated Press"],"date_download":"2018-10-22 23:55:58","date_modify":"2018-10-22 23:55:58","date_publish":"2016-01-11 07:47:36","description":"Lady Gaga walked away from Sunday's Golden Globes with a best actress trophy for her role in FX's \"American Horror Story\" — and the most buzz on Twitter for ...","filename":"data/vaneerConsumption/LadyGagareignssupremeonTwitterduringGoldenGlobes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:c111b76b690c4bc39b9bb16f5d295901-48qEJGFphM8d437f0aaf92216794-621_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393482_Lady-Gaga-reigns-supreme-Twitter-Golden-Globes_1540252558.html","title":"Lady Gaga reigns supreme on Twitter during Golden Globes","title_page":"Lady Gaga reigns supreme on Twitter during Golden Globes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lady Gaga reigns supreme on Twitter during Golden Globes\nLady Gaga walked away from Sunday's Golden Globes with a best actress trophy for her role in FX's \"American Horror Story\" — and the most buzz on Twitter for her red carpet appearance and her award.\nTwitter counted 4.4 million tweets about the Globes during the show, spokeswoman Elizabeth Luke said. While Gaga reigned supreme among the most talked about moments, Leonardo DiCaprio, who generated the second most buzz for his best actor award for \"The Revenant,\" and in the third spot, \"Mr. Robot\" for its best TV drama award.\nOn the red carpet, Jennifer Lawrence racked up the second most tweets, and Katy Perry came in third.\nLady Gaga poses in the press room with the award for best performance by an actress in a limited series or a motion picture made for television for ¿American Horror Story: Hotel¿ at the 73rd annual Golden Globe Awards on Sunday, Jan. 10, 2016, at the Beverly Hilton Hotel in Beverly Hills, Calif. (Photo by Jordan Strauss/Invision/AP)\nThe most tweets overall went to Gaga, with Lawrence coming in second and DiCaprio third.\nLeonardo DiCaprio poses in the press room at the 73rd annual Golden Globe Awards on Sunday, Jan. 10, 2016, at the Beverly Hilton Hotel in Beverly Hills, Calif. (Photo by Jordan Strauss/Invision/AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3393482/Lady-Gaga-reigns-supreme-Twitter-Golden-Globes.html"}
