{"authors":["Stephanie Linning For Mailonline"],"date_download":"2018-10-23 00:04:08","date_modify":"2018-10-23 00:04:08","date_publish":"2017-03-16 08:43:26","description":"Lady Violet Manners, the 23-year-old daughter of the Duke of Rutland, donned a magenta velvet wrap-dress as she stepped out for a night in central London on Thursday.","filename":"data/vaneerConsumption/LadyVioletMannersdazzlesinavelvetwrapdress.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/08/3E5290D400000578-0-image-a-19_1489653567247.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4319184_Lady-Violet-Manners-dazzles-velvet-wrap-dress_1540253048.html","title":"Lady Violet Manners dazzles in a velvet wrap dress","title_page":"Lady Violet Manners dazzles in a velvet wrap dress | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is never afraid to take a fashion risk, and last night was no exception.\nLady Violet Manners, the 23-year-old daughter of the Duke of Rutland, made a statement in a magenta velvet wrap-dress as she enjoyed a night in central London.\nShe layered the sumptuous frock over a sheer blouse with ruffle detailing and a bold rose print, adding to the vintage feel of the look.\nVintage beauty: Lady Violet Manners made a statement in a velvet dress in London last night\nThe PR maven accessorised the ensemble with square toed gold strap sandals and a small black bag with chain strap.\nIn a typically relaxed style, Lady Violet wore her brunette locks around her shoulders in soft waves and wore just a subtle touch of make-up.\nIt is the second night this week the society beauty has been seen out and about after she was spotted rubbing shoulders with the fashion elite on Tuesday.\nShe waltzed into a fashion party in Mayfair, where guests included Samantha Cameron and Dame Natalie Massenet, wearing what appeared to be nightwear.\nIt was, in fact, a £1,395 Burberry olive-green silk dressing gown designed for outdoor use.\nSartorial risk: On Tuesday night, Lady Violet 23, ensured she turned heads as she joined Samantha Cameron and Net-a-Porter founder Dame Natalie Massanet at a fashion event\nLuxe look: Lady Violet Manners, left, chats to Lady Kitty Spencer at the London Uprising book launch in London on Tuesday night. The society girl opted for a £1,395 dressing gown coat\nWhen she lived in Fulham with her two sisters, Ladies Alice and Eliza, they upset the neighbours with raucous all-night bashes that earned them the nickname the No Manners girls.\nTheir parents are David and Emma Manners, Duke and Duchess of Rutland, whose ancestral residence is the 15,000-acre Belvoir Castle estate in Leicestershire.\nThe couple also have a teenage son, Charles, who will inherit the castle.","url":"https://www.dailymail.co.uk/femail/article-4319184/Lady-Violet-Manners-dazzles-velvet-wrap-dress.html"}
