{"authors":["Jordan Lauf"],"date_download":"2018-10-31 00:02:05","date_modify":"2018-10-31 00:02:05","date_publish":"2018-10-28 19:00:30","description":"E! has a new talk show in the works, and this one is all about the ladies. Part celebrity talk show, part friendly gossip session, part exploration of feminism, Ladygang is a TV adaptation of the podcast of the same name, which features three…","filename":"data/vaneerConsumption/LadygangHostKeltieKnightOnceRodeASegwayWithEdSheeranYesSheHasIntel.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/25/55c9a890-f4d1-43ea-9fe8-eba53291e917-getty-1048340998.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_ladygang-host-keltie-knight-once-rode-a-segway-with-ed-sheeran-yes-she-has-intel-12981360_1540944125.html","title":"'Ladygang' Host Keltie Knight Once Rode A Segway With Ed Sheeran & Yes, She Has Intel","title_page":"'Ladygang' Host Keltie Knight Once Rode A Segway With Ed Sheeran & Yes, She Has Intel","title_rss":"NULL","source_domain":"bustle.com","text":"E! has a new talk show in the works, and this one is all about the ladies. Part celebrity talk show, part friendly gossip session, part exploration of feminism, Ladygang is a TV adaptation of the podcast of the same name, which features three friends discussing the raw truths of Hollywood. That includes Ladygang host Keltie Knight, who, though no stranger to the spotlight, new fans of the show might not be familiar with.\nKnight has wanted to work in showbiz since the fourth grade. \"I grew up in a very small town, and my late Aunt Vera took me to see Cats when I was in fourth grade,\" Knight shared with CBS' Watch! \"That was my first taste of glitz and glamour and seeing people get to be someone else. From then on, I was obsessed—I had to be on Broadway. I moved to New York on a Greyhound bus when I was 18 years old.\"\nShe spent the beginning of her career as a dancer, performing with the Knicks City Dancers and the New Jersey Nets Dancers, according to Dance Spirit. She went on to conquer many types of dance, from completing four tours as a Radio City Rockette to dancing behind mega stars such as Fergie, Beyoncé, and Kanye West. But achieving that success wasn't always easy. \"I would go out on 30 to 40 auditions a week and book one if I were lucky,\" she told Watch! \"I never took it personally. I felt, If it's a 'no' right now, I'm going to turn that into a yes, and show you how I did!\"\nJamie McCarthy/Getty Images Entertainment/Getty Images\nLater, Knight was able to leverage her success as a performer into a job as an entertainment news correspondent. She worked on The Insider! and as an Entertainment Tonight correspondent, and was able to get some incredible access to major celebrities. \"Ed Sheeran let me come on his world tour last year for The Insider. I was the only journalist to get access,\" Knight continued to Watch! \"He handed me and my crew an artist's pass for the entire day! He said, 'Come in the morning, stay as late as you want, watch the show.' I literally followed him around all day. We had Segways. It was so cool!\"\nKnight and her friends Becca Tobin and Jac Vaneck began their podcast Ladygang as a space for conversational chit-chats with celebrities from all different backgrounds. And the trio are hoping to bring that informal style to their E! show. \"The first half of the show is we shoot it in my living room. Our celebrity guest comes. We have these awesome hilarious conversations, play a little game, have a little chat, and then we go out into the world with other celebrities and we investigate all the things that it means to be a woman,\" Knight told Variety.\nChristopher Polk/Getty Images Entertainment/Getty Images\nAmong the guests slated to appear are Adam Rippon, Ed Sheeran, and Karamo Brown. \"This is all authentic, nothing is scripted or pre-planned,\" Knight's co-host Tobin said in the same interview. \"We open up the topic and the guests get as candid as possible and we ourselves get really candid.\"\nE! Entertainment on YouTube\nThe women (and hopefully their celebrity guests!) will discuss everything from failing relationships to balancing work responsibilities with their personal lives and trying a Diva cup for the first time. And though it's a TV adaptation, they're sticking with the core elements that made their podcast such a hit. \"It’s kind of this weird hybrid show,\" Knight continued to Variety, \"but it really stays true to the authentic nature of what has made the podcast so successful.\"\nThe world could use more lady gangs, and Knight, Tobin, and Vaneck are here to start the trend. And then cover that trend on their show.","url":"https://www.bustle.com/p/ladygang-host-keltie-knight-once-rode-a-segway-with-ed-sheeran-yes-she-has-intel-12981360"}
