{"authors":["Lucy Mapstone For Mailonline"],"date_download":"2018-10-23 00:06:54","date_modify":"2018-10-23 00:06:54","date_publish":"2016-01-11 08:38:33","description":"Lady Victoria Hervey did her absolute best to steal attention from Hollywood's finest as she flashed almost every inch of her skin in a racy ensemble at the post-show bash.","filename":"data/vaneerConsumption/LadyVictoriaHerveywearsplungingdresswithasheerskirtatGoldenGlobesafterparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/08/3006335C00000578-0-image-a-14_1452500785055.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393537_Lady-Victoria-Hervey-tries-steal-attention-dangerously-plunging-dress-sheer-derriere-flashing-skirt-Golden-Globes-afterparty_1540253214.html","title":"Lady Victoria Hervey wears plunging dress with a sheer skirt at Golden Globes afterparty","title_page":"Lady Victoria Hervey wears plunging dress with a sheer skirt at Golden Globes afterparty | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She wasn't nominated for anything on the night.\nBut Lady Victoria Hervey did her absolute best to steal attention from Hollywood's finest as she flashed almost every inch of her skin in a racy ensemble as she attended the The Weinstein Company & Netflix Golden Globe Afterparty in Beverly Hills, Los Angeles on Sunday night.\nThe 39-year-old socialite - who is known for her daring red carpet choices - stayed true to form in a backless, plunging dress that left barely anything to the imagination.\nScroll down for video\nCheeky! Lady Victoria Hervey did her best to steal attention from the stars in a barely-there dress at the The Weinstein Company & Netflix Golden Globe After Party in Beverly Hills, Los Angeles on Sunday night\nThe slimline star also showed off her pert derriere and her long legs in the garment, which included an almost entirely sheer skirt.\nThe British former It girl's attire was carefully constructed with transparent straps that barely covered her breasts, plunging down to just above her navel.\nAs well as flashing her ribcage, midriff and chest, she also turned to reveal it was entirely backless, letting her flaunt plenty of her tanned skin.\nBut it was the skirt - hugging to her slender hips before flowing out into a sheer net curtain-effect - that caught the eye.\nDoing what she does best: The 39-year-old socialite went braless as she rocked a dangerously plunging dress, constructed from sheer black fabric\nLeaving little to the imagination: The former It girl is known for her risque red carpet choices, and Sunday night's effort didn't disappoint\nAnd, so as not to make her black dress look messy, she opted to go underwear free, revealing her pert derriere while posing with her backs to the cameras on the red carpet.\nLady Victoria teamed her conversation start of an outfit with a relatively simple black clutch bag and a small smattering of dainty jewellery.\nHer blonde locks were swept up into a chic do with a high quiff, and her make-up was remarkably low key for the evening.\nA regular face at the starriest of events, Lady Victoria appeared at ease as she enjoyed another night out with Hollywood's heavyweights which followed the Golden Globes awards ceremony - which saw the likes of Jennifer Lawrence, Leonardo DiCaprio, Brie Larson and Matt Damon scoop the top prizes.\nSheer-ly not! She skirt of her gown was almost entirely sheer, and she revealed she was going without underwear as she turned to pose\nAnd, although The Jump star loves her social lifestyle and party-hard ways, the single star recently admitted that she is ready to start a family.\nSpeaking to Hello! magazine, she confessed she is keen to have children, revealing that she finally feels ready for such a life change.\nHowever, being single, she is considering freezing her eggs to ensure it's something she can do in the future.\n'I would love to have children,' she said. 'I need to step on it, you know, but I feel like I'm mentally and physically ready to have kids, and I think I was definitely not ready, even a year ago.\n'I've definitely thought about having my eggs frozen just to have them there.'\nThe aristocrat also admitted that her younger sister Isabella's wedding in 2014 was part of the catalyst for her decision.\nGoing for glamour: The pretty star glowed as almost every inch of her skin was on show, teaming the look with a classy updo and relatively low-key make-up","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393537/Lady-Victoria-Hervey-tries-steal-attention-dangerously-plunging-dress-sheer-derriere-flashing-skirt-Golden-Globes-afterparty.html"}
