{"authors":["Dylan Gwinn"],"date_download":"2018-10-30 21:15:32","date_modify":"2018-10-30 21:15:32","date_publish":"2017-02-03 05:46:28","description":"Two weeks ago, we brought you reports that the NFL had asked Lady Gaga to stay away from politics with her halftime performance at the Super Bowl. This week, we can report there’s a strong chance that Lady Gaga has every intention of getting political with her halftime performance at the Super Bowl. | Sports","filename":"data/vaneerConsumption/LadyGagaClaimsHerSuperBowlHalftimeShowWillPromoteInclusionandEquality.json","image_url":"https://media.breitbart.com/media/2017/02/lady-gaga.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2017_02_02__1540934132.html","title":"Lady Gaga Claims Her Super Bowl Halftime Show Will Promote ‘Inclusion’ and ‘Equality’","title_page":"Lady Gaga Claims Her Super Bowl Halftime Show Will Promote ‘Inclusion’ and ‘Equality’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Two weeks ago, we brought you reports that the NFL had asked Lady Gaga to stay away from politics with her halftime performance at the Super Bowl. This week, we can report there’s a strong chance that Lady Gaga has every intention of getting political with her halftime performance at the Super Bowl.\nGaga held a press conference on Thursday in Houston. During the Q&A session, a reporter asked Gaga, “I know you spoke about kinda taking this moment to unify America a little bit. Are you going to do that at all? Are you going to make any kind of statements during the performance?”\nThe pop star responded, “Well, I don’t know if I will succeed in unifying America. You’ll have to ask America when it’s over. But the only statements that I’ll be making during the halftime show are the ones that I’ve been consistently making throughout my career.\n“I believe in a passion for inclusion. I believe in the spirit of equality, and the spirit of this country as one of love and compassion and kindness. So my performance will have both those philosophies.”\nSounds harmless, right? A celebrity performer using the platform of the single largest annual media event in America to dedicate a performance to “inclusion” and “equality.” What could go wrong?\nThis, despite well-justified concerns many will have based on last year’s halftime performance, where the NFL allowed Beyoncé to perform the anti-police, pro Black Panther song “Formation,” during the Super Bowl halftime show.\nThough, Lady Gaga insists her show will appeal to all, “This performance is for everyone. I want to, more than anything, create a moment that everyone that’s watching will never forget.”\nWe shall see.\nFollow Dylan Gwinn on Twitter: @themightygwinn","url":"https://www.breitbart.com/sports/2017/02/02/lady-gaga-claims-super-bowl-halftime-show-will-promote-inclusion-equality/"}
