{"authors":[],"date_download":"2018-10-30 14:19:30","date_modify":"2018-10-30 14:19:30","date_publish":"2016-12-19 00:00:00","description":null,"filename":"data/vaneerConsumption/LaLaLandisshallowspoileralert.json","image_url":"https://www.americanthinker.com/images/bucket/2016-12/197595.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_12_emla_la_landem_is_shallow_spoiler_alert_comments_1540909170.html","title":"La La Land is shallow (spoiler alert)","title_page":"Blog: La La Land is shallow (spoiler alert)","title_rss":"NULL","source_domain":"americanthinker.com","text":"The apparent hit film of the year-end releases is La La Land. All the critics are giving it rave reviews, calling it an homage to the fabulous musicals of the 1950s. And it is a good film. But a '50s musical it is not – not even close. The story is bittersweet; two people who dream of success in Los Angeles, he a musician, she an actress, fall in love but sacrifice their relationship for their individual success. This is definitely a Millennial tale. In the old days, people who fell in love, even in Hollywood, found ways to make their love relationships prevail, despite all manner of separations and geographical difficulties, even if they did not survive in the end. They had survived WWII! Today, among our youth, it seems that the career comes first, no matter the sacrifice. The film begins with a truly fabulous scene of a gridlocked Los Angeles freeway during which the trapped drivers get out of their cars... (Read Full Post)","url":"https://www.americanthinker.com/blog/2016/12/emla_la_landem_is_shallow_spoiler_alert_comments.html"}
racters meet and become a couple. When he is offered a wonderful job with a successful band about to go on tour, she is selfishly shocked and disappointed. When she gets a major acting job that will take her to Paris, they agree, despite their love for each other, to go their separate ways. Why? Both of their wildest dreams have come true and yet they could not remain a couple? Who are these people? While meant to be poignant, the shallowness of the story is blatant. How many military families remain intact through years of separations? There are countless professions that demand that couples be separated by thousands of miles for months or years at a time. Human beings of both genders are capable of loyalty and permanence despite long periods apart. Not so, apparently, among our young and talented Hollywood wannabes. They are, as portrayed in the film, wholly self-motivated. Permanence and loyalty have been bred out of them in favor of personal, individual success. Let us hope this is not true across the board, because what it breeds is loneliness and misery. It would be nice if this film triggered a resurgence of interest in the glorious musicals of the past: South Pacific, Paint Your Wagon, West Side Story, Sound of Music, Oklahoma, My Fair Lady, Fiddler on the Roof, etc. Those films taught traditional values, pride in country, culture, faith, and American and world history. This one simply demonstrates the shallowness of America's youth and entertainment culture, as if the popularity of the Kardashians had not already made that sad fact abundantly clear. If La La Land is meant to be a testament to musicals of the past and a mythologized commentary on life in the cloistered entertainment industry of Los Angeles, it is a sad one. And it is one sorely lacking the fabulous talent of days gone by, in both substance and artistry. See the film, and then go home and teach your children well. Love and commitment can and do prevail over the countless difficulties disparate careers present to couples and families around the world. Our Millennials will be relegated to sad and lonely lives if they let the narcissism that has somehow been inculcated in them dictate the paths of their lives, as it does the two characters in this film. While it is not a political film, it is a sad commentary on where the political left has taken our culture and so our youth.","url":"https://www.americanthinker.com/blog/2016/12/emla_la_landem_is_shallow_spoiler_alert.html"}
