{"authors":["Paul Chavez For Dailymail.Com"],"date_download":"2018-10-22 22:29:45","date_modify":"2018-10-22 22:29:45","date_publish":"2017-03-16 03:42:01","description":"The 37-year-old former pro athelte was spotted having lunch Wednesday in Los Angeles with pals and his assistant who has a striking resemblance to his ex-wife Khloe Kardashian.","filename":"data/vaneerConsumption/LamarOdomenjoyslunchwithKhloelikeassistantinLA.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/03/3E5075FE00000578-0-image-a-62_1489635100414.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318764_Lamar-Odom-enjoys-lunch-Khloe-like-assistant-LA_1540247385.html","title":"Lamar Odom enjoys lunch with Khloe-like assistant in LA","title_page":"Lamar Odom enjoys lunch with Khloe-like assistant in LA | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lamar Odom was spotted having lunch Wednesday in Los Angeles with pals and his assistant who has a striking resemblance to his ex-wife Khloe Kardashian.\nThe 37-year-old former professional basketball player kept it casual for his lunch outing in the Sherman Oaks area.\nHe wore a short-sleeved salmon hoodie, black sweatpants and Nike trainers while eating with male companions.\nLunch outing: Lamar Odom enjoyed lunch with friends Wednesday in Los Angeles and was met by his assistant who strongly resembles his ex-wife Khloe Kardashian\nThey dined outdoors at the Sweet Butter Kitchen known for its pastries, breakfast and lunch offerings.\nLamar was joined by his assistant who gave him a side hug while wearing a denim jacket, long white blouse and distressed skinny jeans.\nShe finished her ensemble with black heels and had her long blonde hair up in a ponytail.\nLamar was spotted with her earlier this month and TMZ reported that she's Lamar's assistant.\nWork together: The former Los Angeles Lakers star got a side hug from his assistant\nCatching up: Lamar and his assistant sat down at the outdoor venue in the Sherman Oaks area\nDead ringer: The assistant bears a striking resemblance to his ex-wife Khloe\nDenim on denim: Khloe shared snaps of herself Sunday on Instagram wearing denim on denim\nThe former Los Angeles Lakers star was snapped Saturday with his teenage children at the Kids' Choice Awards in Los Angeles.\nThe Queens, New York native escorted aspiring model Destiny, 18, and 15-year-old Lamar Jr. to the awards ceremony at the Galen Center.\nThe 6ft10 Odom won two NBA championships with the Lakers and also played for the Los Angeles Clippers, Miami Heat and Dallas Mavericks.\nCasual attire: Lamar kept it casual in a hoodie, sweatpants and trainers\nLamar married reality star Khloe Kardashian, 32, in September 2009 after a month of dating.\nKhloe and Lamar met at a party for his mercurial Lakers teammate Ron Artest.\nTheir wedding was featured on Khloe's family reality show Keeping Up With The Kardashians and they starred in the spin-off Khloe & Lamar that was canceled in 2012 after two seasons.\nSoft drink: The former NBA player washed down his meal with a soft drink\nHanging out: Lamar and his pals ate al fresco at the Sweet Butter Kitchen\nLooking around: The former pro athlete enjoyed people watching at the restaurant\nKhloe filed for divorce in December 2013 but proceedings were dismissed by request in October 2015.\nLamar nearly died following a binge at a Nevada brothel in October 2015 and the divorce was temporarily called off so Khloe could help make medical decisison during his recovery.\nIt was recently revealed that Lamasr entered a rehab facility last December for a 30-day stint as 'a precautionary measure' as Lamar was aiming 'to stay clear and focused' in 2017.\nLamar has been working on his own reality show that will document his road to recovery.\nTaking off: Lamar climbed into the passenger seat while leaving the restaurant","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318764/Lamar-Odom-enjoys-lunch-Khloe-like-assistant-LA.html"}
