{"authors":["Benjamin Zhang"],"date_download":"2018-10-30 21:34:40","date_modify":"2018-10-30 21:34:40","date_publish":"2016-12-19 00:00:00","description":"The new Lamborghini Aventador S supercar has a top speed of 217 mph.","filename":"data/vaneerConsumption/LamborghiniunveilsupgradedAventadorSsupercar.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_lamborghini-aventador-s-supercar-upgrade-2016-12_1540935280.html","title":"Lamborghini unveils upgraded Aventador S supercar","title_page":"    Lamborghini unveils upgraded Aventador S supercar - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Lamborghini Aventador S. Lamborghini On Monday, Lamborghini unveiled the latest version of its flagship supercar, the Aventador S.\n\"This is the next generation Aventador as well as the expression of new technological and performance milestones in super sports car development,\" Automobili Lamborghini chairman and CEO Stefano Domenicali said in a statement.\n\"The Aventador S is visionary design, cutting-edge technology and driving dynamics in pure harmony, and elevates the concept of super sports cars to a new level.\"\nThe most notable upgrades from the current LP 700-4 Aventador — which has been around since 2012 — occur on the aerodynamic front. The S receives a more aggressive nose featuring a pronounced front splitter and larger air-intake ducts designed to improve aerodynamic efficiency and engine cooling.\nOut back, the Aventador S gets a three-position active rear-spoiler along with a large diffuser.\nLamborghini According to Lamborghini, the new aero package improves front-end downforce by 130% over the existing model — while overall aerodynamic efficiency has increased, in some cases, by as much as 400%.\nIn an era dominated by down-sized turbocharged engines and hybrid-electric drive systems, Lamborghini's flagship Aventador achieves heart-stopping performance in a decidedly old-school manner — the brutal power of a hulking 6.5-liter, naturally aspirated V12 engine. With the Aventador S, there's now more of that throwback horsepower.\nThe upgraded V12 in the S produces 730 horsepower (740CV) — up 40 from the LP 700-4.\nAs a result, Lambo claims that the Aventador S can make the sprint to 0-60 mph from a standstill in 2.9 seconds and reach a top speed of 217 mph.\nLamborghini The big V12 puts its power to the pavement through a 7-speed gearbox and a Haldex all-wheel-drive system.\nInside, the Aventador S gets a digital TFT instrument display along with Apple CarPlay compatibility, a drive-mode selector, and a telemetry tracking system.\nThe new Lamborghini Aventador S is expected to arrive in the spring of 2017 with a price tag of $421,350.","url":"https://www.businessinsider.com/lamborghini-aventador-s-supercar-upgrade-2016-12"}
