{"authors":["Caroline Burke"],"date_download":"2018-10-31 01:42:09","date_modify":"2018-10-31 01:42:09","date_publish":"2018-08-28 04:03:54","description":"In addition to being fresh off of her recent Netflix rom-com success, To All the Boys I've Loved Before, Lana Condor's Twitter exchange with Dwayne \"The Rock\" Johnson has basically confirmed Condor to be America's sweetheart, or at least the 2018…","filename":"data/vaneerConsumption/LanaCondorDwayneTheRockJohnsonsTwitterExchangeIsAsRelatableAsItGets.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/28/43b1aa99-33ff-4305-a8ed-eae0db2a173e-524e344b-1d8d-4233-90d8-714cc3ecf83b-getty-1017902726.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_lana-condor-dwayne-the-rock-johnsons-twitter-exchange-is-as-relatable-as-it-gets-10258644_1540950129.html","title":"Lana Condor & Dwayne \"The Rock\" Johnson's Twitter Exchange Is As Relatable As It Gets","title_page":"Lana Condor & Dwayne \"The Rock\" Johnson's Twitter Exchange Is As Relatable As It Gets","title_rss":"NULL","source_domain":"bustle.com","text":"In addition to being fresh off of her recent Netflix rom-com success, To All the Boys I've Loved Before, Lana Condor's Twitter exchange with Dwayne \"The Rock\" Johnson has basically confirmed Condor to be America's sweetheart, or at least the 2018 version of that old prototype. In fitting with modern standards, Condor's exchange with The Rock included a meme for the two of them to bond over. And in fitting with his reputation of being the most likable guy ever, The Rock was totally willing to play along with the meme.\nThe exchange started when Condor tweeted on Sunday night about her fitness goals, citing that her goal was \"The Rock\" and that her reality was a meme of Michael Scott from The Office doing parkour. The Rock immediately jumped into the fray, tweeting back at Condor, \"You got this LC!\"\nAnd since Condor is the epitome of the friend everyone wants to have, she naturally did what anyone would do in this circumstance: she totally freaked out. The only difference was that she freaked out to her 2.5 million followers on Instagram via an Instagram Story. BuzzFeed reports that Condor wrote on her Instagram story, \"Do I respond?! What do I say?! Will he see this story?! Have I ultimately humiliated myself forever?! I'm spiraling SOS\"\nCondor did decide to respond, and naturally came up with the perfect response. She tweeted back to The Rock, \"I just had a vision of you singing me Moana as I bench press and me crying tears of absolute bliss # TheRockforpresident\"\nBut Condor wasn't finished. She returned to her Instagram story, asking her followers, \"I honest [sic] just blacked out...DID I SAY THE RIGHT THING?\"\nThe Rock didn't respond this time, but tons of Condor's fans tweeted back at her about the whole experience. One Twitter user wrote, \"imagine: the rock makes a cameo in to all the boys I’ve loved before sequel...don’t know where why or how he’d fit but make it happen\"\nAnother Twitter user immediately suggested that The Rock could play the part of Peter's father in the sequel. Yet another Twitter user wrote, \"I'M FREAKING OUT FOR YOU LANA\"\nThe Rock's social media game isn't the most prevalent of all the celebrities, but that's probably why this makes his input all the more fantastic, given the massive gap in age, experience, and social sphere. With that said, love for The Rock is pretty much universal at this point, so it makes complete sense that Condor would be fangirling over his comments.\nCondor's interaction with The Rock isn't the only topic that's been trending around the newfound celebrity: she's also been the source of speculatio and rumors about whether or not she and her on-screen love, Noah Centineo, are dating in real life. Cosmopolitan asserts that the two have been actively flirting all through their press tour, and that a candid shot of them napping on set has been circulating online.\nThough nothing has been confirmed or denied yet, it's safe to say Condor will keep the world in the loop with the most creative and adorable social media response in the game.","url":"https://www.bustle.com/p/lana-condor-dwayne-the-rock-johnsons-twitter-exchange-is-as-relatable-as-it-gets-10258644"}
