{"authors":["Mark Duell For Mailonline"],"date_download":"2018-10-23 03:36:48","date_modify":"2018-10-23 03:36:48","date_publish":"2017-03-16 14:33:47","description":"Lorry driver Christopher Dennett, of Buckshaw Village, Lancashire, was seen swinging the block wildly as his Dogue de Bordeaux puppy Narla barked and ran away.","filename":"data/vaneerConsumption/Lancashirefatherchasesterrifiedpuppywithwood.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54C1AA00000578-0-image-a-197_1489674512263.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320468_Sickening-moment-father-chases-terrified-puppy-wood_1540265808.html","title":"Lancashire father chases 'terrified' puppy with wood","title_page":"Lancashire father chases 'terrified' puppy with wood | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the sickening moment a father chased a 'terrified' puppy with a plank of wood around his garden in a video filmed by a horrified neighbour.\nChristopher Dennett, of Buckshaw Village, Lancashire, was seen swinging the block wildly as his dog Narla barked and ran away.\nBut the 30-year-old lorry driver claimed was trying to train the Dogue de Bordeaux puppy by emulating an exercise he had seen on YouTube.\nShocking video: Christopher Dennett, of Buckshaw Village, Lancashire, was seen swinging the plank of wood wildly as his dog Narla barked and ran away\nThe 30-year-old lorry driver (left) claimed was trying to train his Dogue de Bordeaux puppy Narla (right) by emulating an exercise he had seen on YouTube\nNow, he has admitted causing unnecessary suffering towards the dog by using threatening or abusive behaviour, and been banned from keeping animals for a year.\nThe defendant handed over the animal to the Royal Society for the Prevention of Cruelty to Animals, which said it was 'emotionally not in a good way'.\nRSPCA Inspector Helen Smith said: 'As you can see from the video, Narla is terrifed, and has been caused unnecessary suffering, fear and distress.\n'She is now terrified of men and although we could find no significant physical harm, emotionally she is not in a good way.'\nDennett has admitted causing unnecessary suffering towards the dog by using threatening or abusive behaviour, and been banned from keeping animals for a year\nThe defendant handed over the animal to the Royal Society for the Prevention of Cruelty to Animals, which said it was 'emotionally not in a good way'\nThe court was shown the sickening 47-second video in which the frightened dog is heard barking and seen running away as he swings at her with the wood.\nA horrified neighbour had captured the back garden attack and rang police who then sent the footage to the RSPCA.\nBut Dennett laughed off the investigation, telling RSPCA workers he was trying to train the dog for close quarters protection for his girlfriend.\nHowever, Dennett – who has no previous convictions - was disqualified from keeping dogs for 12 months and was ordered to pay a £660 fine along with a £66 surcharge.","url":"https://www.dailymail.co.uk/news/article-4320468/Sickening-moment-father-chases-terrified-puppy-wood.html"}
