{"authors":["Ken Klukowski"],"date_download":"2018-10-30 20:45:21","date_modify":"2018-10-30 20:45:21","date_publish":"2016-07-12 18:14:40","description":"Republican delegates in Cleveland drew a sharp contrast to Hillary Clinton and the Democrats on Monday, pushing sharp restrictions on federal power over land and aggressive domestic energy production.","filename":"data/vaneerConsumption/LandRightsandDrillBabyDrill.json","image_url":"https://media.breitbart.com/media/2016/07/Oregon-Cowboy-Fed.-Land-Policy-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_07_12__1540932321.html","title":"Land Rights and 'Drill Baby, Drill!'","title_page":"Republicans in Cleveland: Land Rights and 'Drill Baby, Drill!'","title_rss":"NULL","source_domain":"breitbart.com","text":"CLEVELAND, Ohio—Republican delegates in Cleveland drew a sharp contrast to Hillary Clinton and the Democrats on Monday, pushing sharp restrictions on federal power over land and aggressive domestic energy production as vital to both the economy and national security during the Platform Committee debates ahead of the full party gathering next week to nominate the GOP’s standard bearer.\nThe federal government owns 28 percent of the 2.27 billion acres of land in the United States, including a majority of the land in some western states like Nevada, Arizona, and Utah.\nUnder the Antiquities Act of 1906, the president has authority to designate any part of federal land as a national monument. Creating a national monument severely restricts how American citizens and companies can use that land, such as camping, hunting, fishing, and harvesting trees.\nPushing back against President Barack Obama’s continuing the trend of recent Democratic presidents like Bill Clinton in creating vast new monuments, Republican Platform Committee delegates adopting language to empower each state to retain control over the lands within their borders, saying that new monuments, “require the approval of the state where the national monument is designated or a national park is proposed.”\nThe delegates adopted the following language as the official position of the Grand Old Party on energy:\nSince energy is both an economic and national security issue, we support the enactment of policies to increase domestic energy production, including on public lands, and to counter market manipulation by the Organization of Petroleum Exporting Counties (OPEC) and other nationally-owned oil companies, and reduce America’s vulnerability to energy price volatility.\nChuck Cunningham, the well-respected lobbyist at Securing America’s Future Energy (SAFE), witnessed the committee adopting this language and emphasized to Breitbart News the importance of such a broad-based understanding of energy policy as essential for the nation’s welfare and the vast untapped potential of America’s natural energy resources.\nHe explained that such legislation enjoys bipartisan support, and could be a winning issue for any president because it appeals to a broad cross-section of Americans.\nAs an example, he pointed to H.R. 4559, introduced by Reps. Trent Frank (R-AZ) and Kevin Cramer (R-ND), as well as Minnesota’s Collin Petersen, a Democrat. H.R. 4559 would establish the U.S. Commission on the Organization of Petroleum Exporting Counties (OPEC). This legislation would carry into effect the platform’s language to hold OPEC accountable.\nThese new changes will be presented to the Republican Convention next week for approval of the full party and the GOP presidential nominee, Donald Trump.\nKen Klukowski is senior legal editor for Breitbart News. Follow him on Twitter @kenklukowski.","url":"https://www.breitbart.com/politics/2016/07/12/republicans-in-cleveland-land-rights-and-drill-baby-drill/"}
