{"authors":["Samantha Matthews"],"date_download":"2018-10-30 22:46:30","date_modify":"2018-10-30 22:46:30","date_publish":"2014-08-14 19:00:04","description":"Loyal customers of Lands' End recently received a free issue of GQ magazine along with their regular catalog as a promotion, but the advertising efforts fell flat. The Lands' End catalog came with the July GQ issue with sultry Emily Ratajkowski…","filename":"data/vaneerConsumption/LandsEndCustomersGotGQForFreeWithTheirCataloguesAndTheyArePissedAboutIt.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/3607ff38-1da2-4f1c-827d-c07681ad4691.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35785-lands-end-customers-got-gq-for-free-with-their-catalogues-and-they-are-pissed-about_1540939590.html","title":"Lands' End Customers Got 'GQ' For Free With Their Catalogues - And They Are Pissed About It","title_page":"Lands' End Customers Got 'GQ' For Free With Their Catalogues — And They Are Pissed About It","title_rss":"NULL","source_domain":"bustle.com","text":"Loyal customers of Lands' End recently received a free issue of GQ magazine along with their regular catalog as a promotion, but the advertising efforts fell flat. The Lands' End catalog came with the July GQ issue with sultry Emily Ratajkowski (of \"Blurred Lines\" music video fame) and her two barely covered breasts, which apparently was too much for these customers to handle. The outraged Lands' End customers have been complaining to the company about their free copy of GQ for the last few days, according to Jezebel.\nMany complaints were posted on the Lands' End Facebook page, mostly by parents who were extremely upset because their children could have seen it when innocently gathering the mail. Lands' End and Condé Nast have a deal that involves the customers receiving free issues of its magazines, but the previous magazines (Vogue, Glamour, and Self) received caused zero controversy. Probably because they don't put naked ladies on the covers.\nEdgar Huber, Lands' End CEO and president, did email an apology for sending the magazine. For the sake of being ridiculous and making funny lists, I must admit that, although the front of the GQ July issue is revealing, there are far worse things Lands' End could have sent their subscribers way. So count your lucky stars, polo enthusiasts, that none of these showed up unwanted in your mailbox.\n1. A Vibrator Necklace\nThe Crave vibrator that doubles as a necklace would certainly cause a family discussion when children were confused as to what mail they brought inside the house. Pairs perfectly with a cardigan!\n2. An Issue of Playboy\nSee? It could be worse!\n3. A Candy Bra\nThese don't even offer any proper support!\n4. Fuzzy Handcuffs\nThis one doesn't even need a comment.\nIn all seriousness, however, the GQ cover was certainly an ill-advised choice, and I totally get why some parents might not want their kids getting a glimpse of the risque glossy. Don't worry, Lands' End costumers — next month's freebie is an issue of Conde Nast Traveler.\nImages: Crave, Lingerie Diva, Amazon","url":"https://www.bustle.com/articles/35785-lands-end-customers-got-gq-for-free-with-their-catalogues-and-they-are-pissed-about"}
