{"authors":["Véronique Lacapra"],"date_download":"2018-10-22 23:07:40","date_modify":"2018-10-22 23:07:40","date_publish":"2015-11-03 00:00:00","description":"There's no barrier between the underground chemical reaction and nearby radioactive waste. Federal, state and local officials disagree about the danger it poses; residents are confused and concerned.","filename":"data/vaneerConsumption/LandfillFireThreatensNuclearWasteSiteOutsideStLouis.json","image_url":"https://media.npr.org/assets/img/2015/11/02/bridgeton_gas_flares_img_8478_web_wide-6fa75235294920cd629c2a1a6e616a0ab932b12d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_11_03_454010066_landfill-fire-threatens-nuclear-waste-site-outside-st-louis_1540249660.html","title":"Landfill Fire Threatens Nuclear Waste Site Outside St. Louis","title_page":"Landfill Fire Threatens Nuclear Waste Site Outside St. Louis : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Landfill Fire Threatens Nuclear Waste Site Outside St. Louis\nEnlarge this image toggle caption Véronique LaCapra/St. Louis Public Radio Véronique LaCapra/St. Louis Public Radio\nImagine you are a parent, and that out of the blue, you get a letter from your child's school telling you not to worry — that they're ready to evacuate or shelter in place if an underground fire at a nearby landfill reaches radioactive waste on the same property.\nThat's pretty much what happened recently in suburban St. Louis.\nLandfill fires are pretty common, but this one is different. It's only about a thousand feet away from nearly 9,000 tons of nuclear waste — and there's no barrier in between.\nHundreds of people packed a recent community meeting about the landfills, located in Bridgeton, Mo.\n\"I feel like so many people in St. Louis are not even aware this is going on,\" said one attendee, Cole Kelley.\nEnlarge this image toggle caption Véronique LaCapra/St. Louis Public Radio Véronique LaCapra/St. Louis Public Radio\nMany of the people at the meeting didn't know of the landfills' existence, even though the fire started five years ago, and the radioactive waste was dumped back in the early 1970s.\nResidents like Carmen Burrus and Shannon Walker came to the meeting with many questions: How can people get their children home safe from school? Why isn't there discussion about mass evacuations?\nBut when it comes to these landfills, it seems like whomever you ask has a different answer — including the authorities in charge.\nThe U.S. Environmental Protection Agency, which oversees the radioactive material in what's known as the West Lake Landfill, insists it does not pose a risk to the public.\nSpecifically, Acting EPA Regional Administrator Mark Hague says there is \"no imminent threat\" of the underground fire in what's known as the Bridgeton Landfill reaching the radioactive waste at the adjacent West Lake Landfill.\nBut Missouri Attorney General Chris Koster says the EPA isn't doing its job.\n\"They have tried to avoid dealing with this in a deliberate way,\" Koster says.\nThe state's consultants say the underground fire at Bridgeton is spreading and — in a worst-case scenario — could reach the radioactive waste at West Lake in just a few months.\nRuss Knocke works for the landfills' owner, Republic Services, the same company that Koster, the attorney general, has sued. Knocke says the reaction is actually moving away from the radioactive waste, not closer.\n\"Bridgeton Landfill is in a managed state,\" Knocke says. \"It is safe. It is intensely monitored.\"\nBut what if the fire did reach the radioactive waste — what then? According to the EPA's Hague, there's nothing to worry about.\n\"There might be some increased releases of radon into the atmosphere that would dissipate out,\" he says.\nBut a report released last year by EPA scientists said if the waste got hot enough, it could release both radon and radioactive dust into the air — and since no one knows exactly what's mixed in with the radioactive material, those other substances could be prone to explosion.\nResident Dawn Chapman has been tracking this fight for more than two years. She wants the radioactive waste gone and compares the fire to a freight train whose brakes have gone out.\n\"At this point, you either have to stop that train or you have to clear the tracks,\" she says. \"And for us, clearing the tracks is getting that radioactive waste out of the way and removing the people that live right around it.\"\nSo far, there's no buyout offer for residents near the landfill — and no feasible way to put out the underground fire. The EPA says it will announce plans to build a firebreak before the end of the year and decide whether to dig up the radioactive waste sometime in 2017.","url":"https://www.npr.org/2015/11/03/454010066/landfill-fire-threatens-nuclear-waste-site-outside-st-louis"}
