{"authors":[],"date_download":"2018-10-30 14:33:19","date_modify":"2018-10-30 14:33:19","date_publish":"2015-04-23 00:00:00","description":null,"filename":"data/vaneerConsumption/LapchicksaysSuperBowladsshowbiasagainstwomenminorities.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_04_lapchick_says_super_bowl_ads_show_bias_against_women_minorities_comments_1540909999.html","title":"Lapchick says Super Bowl ads show bias against women, minorities","title_page":"Blog: Lapchick says Super Bowl ads show bias against women, minorities","title_rss":"NULL","source_domain":"americanthinker.com","text":"A new \"study\" claims that Super Bowl ads are biased against women and minorities. The study was done by a man named Richard Lapchick, who apparently has not done a study to see whether his last name might also be offensive to women. The study found that of the 42 Super Bowl ads in 2015 for which data was available, only three — or seven percent — featured exclusively a person of color as the lead creative director. By contrast, 86 percent featured a white creative director and seven percent featured both a white person and person of color. Uh oh! If the race of directors of Super Bowl ads doesn't precisely mirror the racial makeup of the country, there must be racism at work! Who thinks like this? Who has time to investigate the skin color of the behind-the-scenes people who make advertisements? I think Lapchick has too much time on his hands. In terms of gender, 81 percent of the creative directors were male, 13... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/04/lapchick_says_super_bowl_ads_show_bias_against_women_minorities_comments.html"}
that some were partially female, or transgendered?\nThe study also pointed out that of 61 commercials, 19 had African-Americans in a lead role, a significant increase since when the study was first conducted in 2011.\nWait a minute. A third of the leads were black, but blacks are not one third of the population. This looks like racism against white people and other minorities! Why isn't Lapchick dancing up and down about that?\nRacial and gender data was only available for 42 of the 61 advertisements aired during the 2015 Super Bowl, compared to 58 out of 66 in 2011. Lapchick said this was due to advertisement agencies being unwilling to provide the names of their creative directors for the respective advertisements.\nGood for them. They shouldn't give in to this racial and sexual bean-counting. You don't see Lapchick gyrating his metaphorical hips about the vast overrepresentation of black players in the NFL – he's concerned only about Whitey. And personally, I think if he wants to do something about injustice to women he should seriously consider changing his last name.\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/04/lapchick_says_super_bowl_ads_show_bias_against_women_minorities.html"}
