{"authors":["William Bigelow"],"date_download":"2018-10-30 21:09:12","date_modify":"2018-10-30 21:09:12","date_publish":"2015-10-09 16:12:56","description":"On Thursday, LAUSD Superintendent Ramon Cortines suspended all commercial film shoots at Los Angeles Unified schools.","filename":"data/vaneerConsumption/LAPublicSchoolsSuspendFilmShootsAfterPornExpos.json","image_url":"https://media.breitbart.com/media/2015/10/Sexy-teacher-Tamara-Núñez-Flickr-CC-Cropped.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_10_09__1540933752.html","title":"L.A. Public Schools Suspend Film Shoots After Porn Exposé","title_page":"L.A. Public Schools Suspend Film Shoots After Porn Exposé","title_rss":"NULL","source_domain":"breitbart.com","text":"On Thursday, LAUSD Superintendent Ramon Cortines suspended all commercial film shoots at Los Angeles Unified schools.\nThe decision by Cortines, which threatens the $2 million the Los Angeles public schools collect from the film shoots annually, was triggered by an NBC LA investigation, which revealed a pornographic film shoot, titled Revenge of the Petites, at Alexander Hamilton High School. NBC also described a music video for singer CharliXCX’s “Break the Rules,” which lauds drug use; a music video production filled with profane language that wanted to film at Marshall High School; and Bad Teacher, starring Cameron Diaz, Justin Timberlake and Jason Segal, with a scene in which Diaz lewdly dances in a carwash shot at Burroughs Middle School.\nCortines’ statement read:\nI recently asked the District’s Inspector General to examine filming activities at our schools, and that review is under way. I have also asked staff to review existing practices and, if necessary, to update the District’s procedures. As such, I have decided to temporarily suspend all commercial filming at our schools. It is important that we ensure teaching and learning are not disrupted, and that all filming activity is appropriate for our schools. As an organization responsible for educating students, it is essential that we hold ourselves and our schools to a high standard.” University High School in West Los Angeles reaps roughly $100,000 annually from film and park production vehicles.\nStudents have been bothered by explosions, missing supplies, more circuitous treks to classes, and damaged equipment, according to NBC LA.\nFilmLA, which arranges permits for filming with LAUSD, declined an interview with NBC LA.","url":"https://www.breitbart.com/entertainment/2015/10/09/l-a-public-schools-porn-film/"}
