{"authors":["Alicia Vrajlal For Daily Mail Australia"],"date_download":"2018-10-22 20:58:43","date_modify":"2018-10-22 20:58:43","date_publish":"2016-01-28 05:21:30","description":"His first birthday is just around the corner and Lara and Sam Worthington's son Rocket has certainly grown up.","filename":"data/vaneerConsumption/LaraBingledotesoverbabyRocketZotasshejetsintoSydney.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/05/30A70D7F00000578-0-image-a-22_1453960140336.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420359_Lara-Bingle-dotes-baby-Rocket-Zot-jets-Sydney-husband-Sam-Worthington-SIX-suitcases_1540241923.html","title":"Lara Bingle dotes over baby Rocket Zot as she jets into Sydney","title_page":"Lara Bingle dotes over baby Rocket Zot as she jets into Sydney | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His first birthday is just around the corner and Lara and Sam Worthington's son Rocket has certainly grown up.\nThe 10-month-old was seen in his famous mother's arms on Wednesday as the trio made their way out of Sydney airport.\nLooking as cute as a button, Rocket wore navy and green skeleton print outfit, perfectly coordinated with Lara's khaki coloured ensemble and Sam's blue shirt.\nScroll down for video\nBack in Australia: Lara Bingle was spotted arriving at Sydney airport on Wednesday with son Rocket\nShowcasing a casual yet still very chic travelling look, 28-year-old Lara stunned in a green maxi dress.\nShe layered the number with a matching leather jacket, while a pair of laced shoes were her footwear of choice.\nAlways the accessoriser, she donned a pair of dark shades, while a brown backpack was slung over her shoulder.\nVery cute: The 10-month-old was seen in his famous mother's arms on Wednesday as the trio made their way out of the airport\nFun outfit: Looking as cute as a button, Rocket wore navy and green skeleton print outfit\nFamily travels: Lara was accompanied by husband Sam Worthington, with whom she shares Rocket\nBlonde beauty: Lara recently chopped her blonde locks to an even shorter hairdo\nLara was seen holding onto her little bub while also managing to push a trolley of luggage, before eventually placing Rocket in a stroller.\nWhile Lara focused on pushing the pram, husband Sam took over the duties of handling the family's luggage.\nIt looks like the famous family hadn't packed lightly, with what appeared to be around six suitcases right in front of Sam.\nGood times: No doubt Rocket was enjoying the ride as his mother pushed a trolley with suitcases\nLeather luxe: Model Lara sported a khaki coloured leather jacket on the day\nOops! One of Rocket Zot's shoes fell off and the bub tried to reach down and grab it\nCool shoes: A pair of laced boots were the blonde beauty's footwear of choice on this occasion\nThe 39-year-old actor opted for cool and casual attire, sporting a blue buttoned up shirt with the sleeves rolled up.\nHe also wore a pair of dark trousers, while completing his look with a pair of spectacles.\nIn November Lara opened up about how her life has changed since welcoming her son in March last year.\nFeed time: Lara was seen sitting down at one stage to feed her cute bub\nPram time: The wife of Sam Worthington later put Rocket into the pram for some rest time\nDelicious: From the looks of it, Lara was feeding some Rocket some food out of a packet scrawled with the word 'organic' across the front\nSpeaking to Vogue Australia she said: 'I generally try and get up at least an hour and a half before he wakes to check emails, shower and catch up on work,' the beauty said.\n'But as soon as [Rocket] wakes I put everything down so I'm 100% present.'\nLara chose to name her son after her late father Graham, who lost his battle with cancer in 2008.\nModel ways: The glamazon sported a khaki coloured maxi dress for her travels\nAccessoriser: A brown Louis Vuitton backpack was slung over Lara's right shoulder\nThe right fit: The mother-of-one was seen securing one of Rocket's shoes\nTaking to Twitter in April last year, the model explained her son's name is a 'respectful nod to my late father, whose nickname was affectionately, Zot'.\nNo doubt family is very important to the model, who told Daily Mail Australia last year: 'I've always been a happy girl but I guess I'm a mother and a wife and I have a beautiful little sanctuary I would call it'.\n'It’s definitely something new,' Lara reflected on motherhood when speaking to DMA.\nWaiting game: While inside the airport, the former reality star chose to keep her sunglasses on\nThat's a lot! There appeared to be at least six suitcases which Sam had to manage pushing\nSpecs appeal: Sam was seen wearing a pair of glasses\nBaby on board: Lara also kept a firm grip on a baby seat for Rocket\n'It’s the best thing in the world. It’s very challenging, and I’m learning something new every day which is awesome.'\nGiving a nod to other mothers who are juggling full time jobs with looking after their children, Lara said:\n'I’m very new to this. I have a lot of respect for women who also have full careers and have three or four children and can balance it. I strive to find the balance and I’m just learning.'\nCool and casual: Actor Sam wore a blue shirt with the sleeves rolled up\nHands full: She certainly had her hands full as she juggled a pram, baby sear and suitcase\nHandle with care: Lara was seen handing the baby seat over to her Avatar star husband","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420359/Lara-Bingle-dotes-baby-Rocket-Zot-jets-Sydney-husband-Sam-Worthington-SIX-suitcases.html"}
