{"authors":["Sarah Fitzmaurice For Daily Mail Australia"],"date_download":"2018-10-22 20:37:04","date_modify":"2018-10-22 20:37:04","date_publish":"2016-01-28 02:08:28","description":"She is a doting mother to her son Rocket Zot but it appears that Lara Bingle is also extremely maternal towards her best friend's little girl Yoki too.","filename":"data/vaneerConsumption/LaraBingleplaysinthepoolwithVickiLeesdaughterYokiinInstagrampicture.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/02/30A613E100000578-0-image-a-50_1453946892476.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420282_Lara-Bingle-enjoys-play-date-pool-best-pal-Vicki-Lee-s-daughter-Yoki_1540240624.html","title":"Lara Bingle plays in the pool with Vicki Lee's daughter Yoki in Instagram picture","title_page":"Lara Bingle plays in the pool with Vicki Lee's daughter Yoki in Instagram picture | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is a doting mother to her son Rocket Zot but it appears that Lara Bingle is also extremely maternal towards her best friend's little girl Yoki too.\nVicki Lee uploaded a super sweet snap of her model pal with her daughter as the pair played in the pool together.\nIn the Instagram image Lara is seen holding a giggling Yoki into the air while gazing a the little girl.\nScroll down for video\nSuper cute snap: Lara Bingle's best friend Vicki Lee shared this snap of the model enjoying a play date with her daughter Yoki to her Instagram page on Thursday\nAlong with the cute snap Vicki wrote: '\"To the left to the left\" Beyoncé @laraworthington.'\nAs well as spending some quality time with the tot Lara and Vicki also enjoyed some time together too.\nThe pair seemed to be checking out the latest Snapchat filters and Lara posted a short clip from the app to her Instagram page.\nYesterday in Gucci: The 28-year-old posted a snap of herself in this pretty floral dress earlier in the week.\nAlong with the footage, who showed the girls 'shooting lasers from their eyes' Lara wrote: 'We are so grown up @vickileelee.'\nVicki welcomed her daughter in March last year, just weeks before Lara welcomed her own child Rocket with husband Sam Worthington.\nIn November Lara opened up about how her life has changed since welcoming her son.\nSpeaking to Vogue Australia she said: 'I generally try and get up at least an hour and a half before he wakes to check emails, shower and catch up on work,' the 28-year-old said.\nRIP Pop: Earlier this week Lara paid tribute to her late grandfather posting this sweet snap of the pair together\n'But as soon as [Rocket] wakes I put everything down so I'm 100% present.'\nWhile Vicki happily posts pictures of her daughter to her social media pages, Lara and Sam, who are notoriously private, keep their son out of the limelight.\nOver the weekend Lara paid tribute to her grandfather after he passed away.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420282/Lara-Bingle-enjoys-play-date-pool-best-pal-Vicki-Lee-s-daughter-Yoki.html"}
