{"authors":["Monique Friedlander For Daily Mail Australia"],"date_download":"2018-10-22 22:57:29","date_modify":"2018-10-22 22:57:29","date_publish":"2016-01-29 10:31:25","description":"He is barely a year old, but the cherubic son of Lara and Sam Worthington, Rocket Zot, is already becoming the spitting image of his famous parents.","filename":"data/vaneerConsumption/LaraBingleandRocketZotarriveatSydneyAirportwithSamWorthington.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30B103E800000578-0-image-a-16_1454063479965.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422466_Lara-Bingle-Rocket-Zot-sport-matching-blonde-hairstyles-Sydney-Airport-Sam-Worthington_1540249049.html","title":"Lara Bingle and Rocket Zot arrive at Sydney Airport with Sam Worthington","title_page":"Lara Bingle and Rocket Zot arrive at Sydney Airport with Sam Worthington | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He is barely a year old, but the cherubic son of Lara and Sam Worthington, Rocket Zot, is already becoming the spitting image of his famous parents.\nThe 10-month-old was spotted in the arms of his mother on Friday as the trio arrived at Sydney Airport, ahead of their departing flight.\nSporting a head of sandy blonde hair, Rocket was unmistakably the son of Lara, 28, whose famous cropped, flaxen mane has inspired copy-cat hairstyles among fans across the nation.\nJust like mummy! Lara Bingle was spotted carrying 10-month-old son Rocket Zot at Sydney Airport on Friday with the mother and son duo showing off matching hairstyles\nLara was rugged up for the rainy weather, donning a black long-line blazer matched with a pair of dark suit pants.\nShe added a simple white T-shirt to her androgynous look, while completing her ensemble with a pair of unusual heeled boots in a denim material.\nLara kept her make-up fresh and feminine for the off-duty occasion, opting for a subtle pink blush and a thick flick of eyeliner.\nTwo of a kind! Sporting a head of sandy blonde hair, Rocket was unmistakably the son of the former model, whose famous cropped, flaxen mane has inspired copy-cat hairstyles among fans across the nation\nLady in black! Lara was rugged up for the rainy weather, donning a black long-line blazer matched with a pair of dark suit pants\nMatchy matchy! Meanwhile, Rocket was dressed to match his stylish mother, clad in a black T-shirt, dark jeans and a pair of white sneakers\nShe chose to keep her accessories simple, throwing on a simple pair of stud earrings and her gold wedding band.\nMeanwhile, Rocket was dressed to match his stylish mother, clad in a black T-shirt, dark jeans and a pair of white sneakers.\nSam, 39, was the most casual of the three, wearing a black T-shirt, a pair of slouchy track pants and a set of comfortable running shoes.\nCasually clad: Sam, 39, was the most casual of the three, wearing a black T-shirt, a pair of slouchy track pants and a set of comfortable running shoes\nPractical add-ons: He accessorised his look with a pair of spectacles and a square-framed wristwatch\nHello grandma! Joining the doting parents was Lara's mother, Sharon Bingle, who appeared to be assisting Lara by holding onto Rocket as the family unpacked their luggage from a car\nSurprise! Lara added a touch of quirkiness to her outfit by adding a pair of unusual heeled boots in a denim material\nHe accessorised his look with a pair of spectacles and a square-framed wristwatch.\nJoining the doting parents was Lara's mother, Sharon Bingle, who appeared to be assisting Lara by holding onto Rocket as the family unpacked their luggage from a car.\nIn October last year, Lara confessed about her secret nuptials to Sam, revealing the wedding actually took place at a private home in Melbourne in December 2014\nMore recently, Lara spoke to Vogue Australia about balancing life as a new mother with running her own cosmetics business, The Base.\nLoving mother: Lara doted upon her adorable son as she brushed his hair out of his face\nNo mistaking that baby! While Rocket's hair is unmistakably his mother's, his face is the spitting image of his father Sam\nBaby on board: Lara also kept a firm grip on Rocket as she unloaded bags from the car\n'I'm always impressed with women who have a great work-life balance; knowing how and what to prioritise is important', explained the blonde beauty.\n'And it's something I'm certainly working on. I think it will always be a constant juggle', she added.\nLara launched The Base in 2014 and has seen rapid success in the Australian market so far.\nOnly the best! Rocket wore Stan Smith Adidas runners, which retail from $40 a pair\nQueen of the bronze! Lara seemed to be sporting a subtle summer glow despite being covered up for the colder weather\nWoman in charge! Lara launched her self-tanner cosmetics line, The Base, in 2014 and has seen rapid success in the Australian market so far\n'I wanted to have my own business - I sold my house to create it,' the Westfield ambassador revealed to the Daily Mail Australia last year.\nIndeed, the entrepreneur sold her waterfront apartment in Sydney in June 2014, with the Darling Point pad selling for $1 million and making an estimated $118,000 profit.\nShe purchased the well-lit 65sqm apartment in 2010 after her break-up with former finace Michael Clarke.\nMaking the sacrifice: The Westfield ambassador revealed to the Daily Mail Australia last year that she sold her own apartment to start up her business\n'I do everything': The mother-of-one also revealed she is invested in all facets of her business, not just lending her name to a product\n'I know all the back end, I do everything,' Lara said, 'I wanted to know what was to do with the boxes, the branding, the packaging, the formulas - it’s just learning about something that I’ve never done before.'\n'I started The Base because I wanted to create something that's very authentic and real and enhanced women’s beauty rather than constantly putting layers on,' Lara, who labelled the experience as 'inspiring', said.\n'I came from going in the salt water and the ocean, it’s just amazing for your skin.'\n'I wanted to create something that's very authentic': Lara's explained her brand focuses upon enhancing women's beauty rather than covering it\nJet-setter: The Sydney-born glamazon is based in the US but often returns to Australia to visit her family and promote her range","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422466/Lara-Bingle-Rocket-Zot-sport-matching-blonde-hairstyles-Sydney-Airport-Sam-Worthington.html"}
