{"authors":["Alana Mastrangelo"],"date_download":"2018-10-30 20:35:42","date_modify":"2018-10-30 20:35:42","date_publish":"2018-10-30 19:26:21","description":"Radio show host Larry Elder told Breitbart News on Saturday that porous borders affect minority communities.","filename":"data/vaneerConsumption/LarryElderPorousBordersAreAllowingIllegalAlienstoTakeJobsfromMinorities.json","image_url":"https://media.breitbart.com/media/2016/12/GettyImages-623389446.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2018_10_30_exclusive-_9bc9bc950787829ffdc1cf8cf4839941__1540931742.html","title":"Larry Elder: ‘Porous Borders Are Allowing Illegal Aliens to Take Jobs' from Minorities","title_page":"Larry Elder: ‘Porous Borders Are Allowing Illegal Aliens to Take Jobs' from Minorities","title_rss":"NULL","source_domain":"breitbart.com","text":"Radio show host Larry Elder told Breitbart News on Saturday that porous borders affect minority communities, adding that many black people know this and are in favor of securing U.S. borders.\n“I do feel there’s a great deal of momentum right now for the black conservative movement,” said Elder. “I just saw an NAACP poll that said 21 percent of blacks now support Trump. That is seven times the support that Trump got in 2016. So something is clearly happening,”\n“And that something is this,” continued Elder. “Trump is doing something about illegal immigration.”\n“A lot of people don’t think [illegal immigration] is an issue that black people care about, but it turns out that according to studies, porous borders are allowing illegal aliens — particularly those who are unskilled — to take jobs away from inner city blacks and browns, and they put downward pressure on their wages.”\n“If you look at polls, blacks are far more supportive of doing something about the borders than their counterparts in the Democratic Party,” said Elder.\n“The other thing is this: Right now, only three percent of kids can do math at grade level at their high school,” added Elder. “What Trump wants to do is allow parents to have a voucher. The money should follow the child, rather than the other way around.”\nElder told Breitbart News there are three big issues that should be “enough reason” for black people “to rethink their allegiance to the Democratic Party” and consider voting to re-elect the president: the economy, borders, and school choice.\n“Black people used to admire [Trump] … but all of the sudden, he becomes president, and he’s a racist?” said Elder about the president’s critics.\n“The most curious [accusation of racism] is they call [Trump] anti-Semite,” continued Elder. “His daughter is married to an Orthodox Jew. She’s converted to Judaism. His top financial officer in his company is Jewish. Many of the top aides are Jewish.”\n“So if that’s anti-Semitism, it’s kind of a bizarre form of anti-Semitism, isn’t it? Maybe he needs to go back to anti-Semitism school,” quipped Elder.\nElder spoke to Breitbart News at Turning Point USA’s first-ever Young Black Leadership Summit in Washington, DC.\n“I don’t think there’s ever been a room of so many young black conservatives before,” said Elder about his experience at the summit.\n“And to have so many young people who have rejected the idea that they’re victims, that the man’s holding them back, that they’re being oppressed, was just wonderful to see.”\nYou can follow Alana Mastrangelo on Twitter at @ARmastrangelo and on Instagram.","url":"https://www.breitbart.com/video/2018/10/30/exclusive-larry-elder-porous-borders-allowing-illegal-aliens-take-jobs-minorities/amp/"}
