{"authors":["John Hayward"],"date_download":"2018-10-30 19:47:34","date_modify":"2018-10-30 19:47:34","date_publish":"2016-06-01 15:26:02","description":"“In terms of Brexit, I think this has, frankly, more to do with Britain’s culture, and government, and autonomy, as a great English-speaking, common-law, Magna Carta state,” Larry Kudlow says. “I think this is a rebellion against Brussels, and a rebellion against the European Union.” | Politics","filename":"data/vaneerConsumption/LarryKudlowBritainWillNeverRuleBritainAgainIfItStaysIntheEuropeanUnion.json","image_url":"https://media.breitbart.com/media/2016/05/The-word-OUT-is-depicted-on-a-Brexit-mug-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_01__1540928854.html","title":"Larry Kudlow: ‘Britain Will Never Rule Britain Again’ If It Stays In the European Union","title_page":"Larry Kudlow: ‘Britain Will Never Rule Britain Again’ If It Stays In the European Union | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"CNBC senior contributor Larry Kudlow discusses the British vote to exit the European Union with Breitbart News Daily, as SiriusXM host Stephen K. Bannon noted the vote for exit is now ahead by a few points in some polls, producing a “tectonic plate shift and shockwave in London.”\nBannon asked Kudlow if the “rise of economic nationalism,” as exemplified by the Brexit vote, was a good or bad development.\n“In terms of Brexit, I think this has, frankly, more to do with Britain’s culture, and government, and autonomy, as a great English-speaking, common-law, Magna Carta state,” Kudlow replied. “I think this is a rebellion against Brussels, and a rebellion against the European Union.”\n“If it wins, you listen to people like Boris Johnson – he’s an MP from London, he was the mayor of London – a lot of those guys argue that they’re ceding power to Brussels, and the EU, and that Britain will never rule Britain again,” he continued. “Britain’s democracy will not be the most important factor in making decisions for the country. I think that is more at stake. The economic stuff, we can talk about that, and there are a lot of naysayers regarding trade and banking, but I don’t buy that, frankly. I just don’t buy that.”\nBannon noted that European Union officials, and President Obama, have attempted to suppress the exit vote by warning that independent Britain will not be given the sort of bilateral trade deals its economy would require to flourish. “Aren’t they trying to put the fear of God into the British people, that hey, if you guys make this decision, you’re going to cause a depression?” he asked.\n“Yes,” said Kudlow. “I mean, the London stock market – which is not just a stock market, it’s a bond market and a currency market, it’s a commodity market – is the largest financial exchange in the world, including the USA. And, I might add, it’s been hot as a pistol. The idea that all these bankers and traders are going to move to Frankfurt is, to me, unrealistic.”\n“I think the money comes to London,” Kudlow continued. “The money does not leave London, the money comes to London. I think it’s just almost silly to make the arguments that are being made, at least on those grounds. So, I don’t buy it. The United States, incidentally, will create a treaty. I mean, to some extent, Britain is better off making its own trade, and financial, and whatnot agreements.”\nIn contrast, he said he doesn’t think “the European Union is a model of anything economic.”\n“I think the European Union is basically a top-down, Left-leaning, socialist-leaning, Big Government-leaning operation,” he elaborated. “Therefore, I’m highly suspicious when it comes to free markets, for example. I think the EU is not for free markets. I think the EU is for subsidies, and the EU is for welfare, and so forth, and so on.”\n“Britain, on the other hand, has probably the best-performing economy among the large countries, including the United States. They’ve had better GDP than we’ve had, for many years. They have lower tax rates, for example. Their capital gains tax rate’s come down. Their corporate tax rate is scheduled to come down to 17%. The United States is still at 35%, which is why I vehemently support Trump’s 15%. That’s what attracts business,” he said.\n“London’s done a lot of good things. The EU has not. Take a look at the EU economies. Outside of Germany – which hasn’t done great, incidentally – Holland’s okay. Some reforms in places like Sweden and Denmark. I say some, not a lot. It’s a tax-heavy, regulatory operation,” Kudlow declared.\n“I think Britain could do better going it alone, the bilateral route, rather than the EU route. In any event, I don’t believe for one minute that EU is gonna ‘cut off’, quote-unquote, trading and banking with Britain. I don’t believe it. I mean, there’s two years to cut a new deal on trade and finance after this thing passes, Brexit, if it passes. So color me highly doubtful that the worst-case scenario will happen,” he concluded.\nBreitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern.\nLISTEN:","url":"https://www.breitbart.com/politics/2016/06/01/larry-kudlow-britain-will-never-rule-britain-stays-european-union/"}
