{"authors":["Chriss W. Street"],"date_download":"2018-10-30 17:57:36","date_modify":"2018-10-30 17:57:36","date_publish":"2017-01-10 21:02:04","description":"Final site selection for the George Lucas museum is now a hot and heavy competition between San Francisco and L.A.","filename":"data/vaneerConsumption/LASanFranciscoBattleforGeorgeLucasMuseum.json","image_url":"https://media.breitbart.com/media/2017/01/Darth-Vaders-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_01_10__1540922256.html","title":"L.A., San Francisco Battle for George Lucas Museum","title_page":"L.A., San Francisco Battle for George Lucas Museum | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Board of George Lucas’s proposed “Museum of Narrative Art” delayed its final site selection approval in what is now a hot and heavy competition between San Francisco’s Treasure Island and Los Angeles’ Exposition Park.\nThe highly anticipated “Star Wars” museum, which would potentially house the world’s top digital and populist art collection, will be funded and endowed with a $700 million gift from George Lucas and his wife, Mellody Hobson.\nThe museum was once seen as a done deal to locate on an eigh-acre site in San Francisco’s Crissy Field. But after four years of negotiating, the seven member Presidio Trust board voted unanimously in February 2014 to reject Lucas’s bid.\nThe decision came despite a vigorous lobbying campaign that included backing from Gov. Jerry Brown, San Francisco Mayor Ed Lee, U.S. Sen. Dianne Feinstein (D-CA), and House Minority Leader Nancy Pelosi (D-CA), plus support from such cinematic heavyweights as Martin Scorsese.\nDespite the location already being identified by the Presidio master plan as a potential museum site as far back as 2002, San Francisco’s powerful environmental lobby did not want the Crissy Park view of the Marin Headlands and the Golden Gate Bridge interrupted.\nDavid Perry, a spokesman for Lucas, said at the time, “This is something that caught us completely by surprise.”\nSince then, the Lucas board and San Francisco have negotiated for several other San Francisco sites, including an eight-acre South of Market (SoMa) site facing the bay. But each time, the sites would require Lucas to change the look of his desired museum from the intended “mock-classical temple” with four ceremonial domes.\nAfter offering the Treasure Island site in the middle of the San Francisco Bay for $23 million, Mayor Ed Lee tweeted out a rendering of the proposed new design with the message: “What better place to ignite the power of imagination & inspire future innovators than continuing the legacy where it began #SF # LucasMuseum.”\nBut San Francisco Project Manager Adam Van De Water told the local CBS news affiliate that the Lucas board has concerns about the risk of sea-level rise at the Treasure Island site: “They are looking at seismic performance for the building and some of the geographic and temperature conditions of being here on the Bay.”\nAt that point, Los Angeles jumped in with a competing bid offering a permanent seven-acre lease downtown, next to the Coliseum, for just $20 a year. The museum would also be near the California Science Center, the Natural History Museum and the California African American Museum. The site, across from USC, also has plenty of bus and Metro stops.\nLos Angeles Mayor Eric Garcetti has called the proposed Lucas museum the largest civic gift in American history. He emphasized that the project will bring an estimated 1,500 construction jobs, 350 permanent jobs and a top national tourist attraction to the city. Garcetti especially praised architect Ma Yansong’s spaceship design as a tribute to Hollywood.\nGarcetti added that Lucas and his wife’s mix of classic and pop art is valued at $400 million. The breadth of pieces to be displayed includes everything from Lucas’s movie memorabilia storyboards and costume pieces, to Norman Rockwell paintings.\nWith 45.5 million people visiting L.A. annually, compared to just 24.6 million visiting San Francisco, Garcetti claims that Los Angeles is the ideal location to win the competition.","url":"https://www.breitbart.com/local/2017/01/10/la-san-francisco-battle-george-lucas-museum/"}
