{"authors":["Guest Commentary","Laurel Rosenhall"],"date_download":"2018-10-31 00:15:49","date_modify":"2018-10-31 00:15:49","date_publish":"2018-09-01 07:01:01","description":"In the final days of California's 2018 legislative session, hundreds of bills landed on the governor's desk. We're tracking the fate of the most consequential here.","filename":"data/vaneerConsumption/LaststopOnthese2018Californiabillsitsthegovernorscall.json","image_url":"https://calmatters.org/wp-content/uploads/capitolsideview_medium.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944949.html","title":"Last stop: On these 2018 California bills, it's the governor's call","title_page":"Last stop: On these 2018 California bills, it's the governor's call | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"100 Percent Renewable Energy WHAT THE BILL WOULD DO Kevin de León’s SB 100 would require the state’s utilities to acquire 100 percent of their power from clean energy sources by 2045. California and Hawaii would be the only two states with such ambitious renewable energy goals. WHO SUPPORTS IT\nA long list of environmental groups and public health advocates are joined by solar energy companies, who all say that the state has proved that it can speed up adoption of renewable energy from the sun, wind and hydroelectric plants. WHO’S OPPOSED\nOil companies and manufacturing groups strongly opposed the bill, saying that ratepayers would be punished by higher rates. WHY IT MATTERS\nReducing greenhouse gas emissions is at the core of California’s battle against climate change. By prioritizing renewable energy—and cutting carbon from the atmosphere–the state continues its environmental leadership. GOVERNOR’S CALL Signed by Governor Brown on September 10, 2018. —Julie Cart\nFor-Profit Charter Schools WHAT THE BILL WOULD DO AB 406 would ban for-profit companies from running charter schools in California. Carried by Assemblymember Kevin McCarty, a Sacramento Democrat, the bill also seeks to prevent non-profit charter schools from relying heavily on for-profit companies to manage their operations. WHO SUPPORTS IT Labor unions piled on in support of the bill, echoing McCarty’s argument that public tax dollars should not be used to enrich corporate executives. After opposing earlier versions, the California Charter Schools Association switched its position to support, saying the minority of charter schools that are for-profit shouldn’t be allowed to tarnish the image of the broader charter school movement. WHO’S OPPOSED The product of a hard-fought compromise between charter school advocates and teacher unions, AB 406 faces no major opposition. But it must now go before a governor who has already vetoed a ban on for-profit charters schools once, in 2015. WHY IT MATTERS Charter schools operated by for-profit companies enroll thousands of California children. A 2016 investigation by the Attorney General’s office found that the state’s largest provider of online public K-12 education, California Virtual Academies, had inflated attendance numbers and misled parents about student performance. While the schools were technically non-profits, they were run by K12 Inc, a for-profit, national charter school operator. GOVERNOR’S CALL Signed by Governor Brown on September 7, 2018. —Felicia Mello\nDrinks in Kids' Meals WHAT THE BILL WOULD DO Sugary soda could no longer be a default beverage in kids’ meals in restaurants under his SB 1192, carried by Democratic Sen. Bill Monning of Carmel. Choices would be limited to water, plain milk, or a non-dairy substitute like almond milk, though customers could still order a sugary drink such as soda or juice at no extra charge upon request. WHO SUPPORTS IT The American Heart Association, Public Health Advocates, California Alliance of YMCAs and Latino Coalition for a Healthy California co-sponsored the bill, which has bipartisan support. Health care advocates say the marketing of sugary drinks has promoted childhood obesity and associated health problems, and that healthier habits early on help kids make healthier choices later in life. WHO’S OPPOSED Ideological opponents say parents don’t need guidance from the state in determining children’s diets. The California Restaurant Association has not taken a position on the bill. The American Beverage Association typically opposes restrictions on sugary beverage consumption, but is neutral this time around and has similar guidelines in place at elementary schools. WHY IT MATTERS Diabetes and obesity are leading drivers of high healthcare costs. Research shows children consume more sugar when they drink soda at a younger age. This puts them at a greater risk for tooth decay, obesity and diabetes. By changing the default option, advocates hope children will adopt healthier habits, such as preferring water over a sugary drink. GOVERNOR’S DECISION Signed by Governor Brown on September 20, 2018. —Elizabeth Castillo\nPlastic Straws, by Request Only WHAT THE BILL WOULD DO In an attempt to curb plastic pollution, AB 1884 would ban full-service, dine-in restaurants from offering single-use plastic straws unless they are requested by customers. Restaurants violating the law would be subject to warnings and small fines. The law exempts fast-food establishments, a major source of plastic straws. WHO SUPPORTS IT Introduced by Assemblyman Ian Calderon, Democrat from Whittier, the bill was supported by prominent environmental groups like the National Resources Defense Council and Sierra Club California. Organizations concerned with preserving beach and ocean health were especially keen on the bill. WHO’S OPPOSED In this case, it’s more important which interest groups didn’t oppose it. The California Restaurant Association, the California Chamber of Commerce, and the Plastics Industry Association did not fight the bill. That’s partly because it fell short of an outright ban, spared fast food chains, and the enforcement penalties appear relatively light. Conservative legislators did express their opposition to the bill as an unnecessary regulatory burden. WHY IT MATTERS The bill represents the latest in a growing string of California laws aimed at keeping oceans, rivers and other parts of the environment free from plastic trash. Four years ago, California became the first state in the country to ban single-use plastic bags. Environmental groups hope that, much like the plastic-bag ban, other states will follow California’s example on the issue. GOVERNOR’S CALL Signed by Governor Brown on September 20, 2018. From his signing message: “Plastics, in all forms—straws, bottles, packaging, bags, etc.—are choking our planet. It is a very small step to make a customer who wants a plastic straw ask for it.” —Matt Levin\nWildfire Response WHAT THE BILL WOULD DO After last year’s deadly wildfires, legislators were under pressure to take action to prevent more blazes in the future and figure out how to pay for billions of dollars in damages. This mega-bill, SB 901, is the result of a special committee formed to tackle the issue. It sets aside as $200 million for forest health—thinning trees and other projects to make the state’s forests less fire-prone. It also allows utility companies—which are liable for the costs of any fires sparked by their power lines—to pass some of the costs of the 2017 fires onto their customers after a review determining how much the company’s shareholders can afford. For fires that began this year and beyond, a new commission would decide whether utilities can pass costs onto customers and suggest broader changes to liability laws. WHO SUPPORTS IT Pacific Gas & Electric, labor unions, fire victims, loggers, firefighting groups, cities and several chambers of commerce say that there’s more good than bad in the bill. They make the point that no one is served if the cost of damages causes a major utility to go bankrupt. WHO OPPOSES IT Ratepayer groups—including residential consumers as well as industrial energy users like big agricultural and oil companies—oppose the bill, calling it a bailout for wealthy utilities that failed to properly maintain equipment to prevent fire. WHY IT MATTERS California is still experiencing the most destructive fire season ever, and a recent state report forecasts more to come. And more and more research suggests that carbon released during and after fires may make it difficult for the state to reach its climate change goals. The legislation is, to say the least, the result of a major compromise, and not likely to please everyone. It’s also an attempt to knit together disparate aspects of wildfire response. No one policy can begin to address all the complications of the issue, but proponents argue that’s no reason to not act. GOVERNOR’S DECISION Signed by Governor Brown on September 21, 2018. Brown, in a press release on the bill: “Wildfires in California aren’t going away, and we have to do everything possible to prevent them. This bill is complex and requires investment – but it’s absolutely necessary.” —Julie Cart\n'Junk' Health Insurance WHAT THE BILL WOULD DO The Legislature wants to outlaw so-called junk health insurance—short-term policies that are generally cheaper and offer less coverage than other plans and typically exclude pre-existing conditions. The bill would uphold federal Affordable Care Act standards for basic benefits that include coverage of pre-existing conditions. The measure bucks the Trump administration’s decision that states can allow insurance that excludes such things as cancer treatment, maternity care, prescription drugs and such pre-existing conditions as allergies, asthma and diabetes. California would be the first state to explicitly put the ban into law, though several other states , including Massachusetts, New Jersey and New York, have stated they wouldn’t allow low-cost, short-term junk insurance. Supporters of these policies say they can be a good option for some people. Under the Affordable Care Act, short-term plans were designed to fill coverage gaps for up to 90 days while people transitioning to new plans waited for them to kick in. The new federal rules allow states to turn those bare-bones, short-term plans into coverage for up to three years. WHO SUPPORTS A BAN Health care advocates, medical organizations, employer groups and even some health insurance companies, such as Kaiser Permanente and Blue Shield of California, endorsed the bill. WHO OPPOSES IT Three groups have lodged objections to the bill. The California Association of Health Underwriters and TechNet, both trade groups, have expressed concern that eliminating short-term plans could force some consumers into expensive emergency-room care during a gap in coverage. Anthem Blue Cross has said it agrees with the federal change and that short-term plans with limited coverage offer value for some customers. WHY IT MATTERS People with short-term insurance still need health care, and if they get sick and find their insurance won’t pay for it, then taxpayers may have to—in the more expensive ER setting. And short-term insurance causes higher premiums for others, according to a study by the nonprofit Urban Institute. That’s because young, healthy people are the ones who tend to pick inexpensive health insurance with little coverage, which means people with Affordable Care Act-level coverage tend to be comparatively less healthy and require more care. Without limits on short-term insurance, the Urban Institute predicted a 17.8% rise in premium costs for fuller policies. GOVERNOR’S DECISION Signed by Governor Brown on September 23, 2018. —David Gorn\nConservatorships for Mentally Ill Homeless People WHAT THE BILL WOULD DO: SB 1045 would create a 5-year, opt-in pilot program for San Francisco, Los Angeles and San Diego Counties, making it easier to conserve individuals with serious mental illness and substance abuse disorders who refuse treatment and have been detained frequently by police. Counties would have to prove that they could provide housing and wraparound services before they could participate. WHO SUPPORTS IT? San Francisco Democratic Sen. Scott Wiener sponsored the bill, which also received backing from San Francisco Mayor London Breed and several San Francisco tourism interests, as well as the cities of Los Angeles, Santa Monica and Fairfield, and the California Psychiatric Association. They argued that current laws often prevent people from getting the treatment they deserve even when they are unable to request it. Some public health workers said it was frustrating to see the same mentally ill people routinely cycling through on 72-hour holds. Wiener, who contends the bill would affect a small minority of homeless people, said “We do have a very large conservatorship program in California—it’s called jail.” WHO’S OPPOSED? An array of advocates for homeless people joined the American Civil Liberties Union in maintaining that it was a mistake to make it easier to conserve people when low-cost housing and other support programs are in short supply, particularly for anyone with a criminal background. They noted that it was senseless to funnel money into the court process of expanding conservatorships when that money could be better spent giving people the housing and treatment options they need. WHY IT MATTERS: Californians are troubled by the presence on their streets of people who exhibit symptoms of mental illness—both because it makes neighborhoods less safe and also because it feels inhumane. But if there is general agreement over the need to do something to help, there are stark differences of opinion about what should be done. Other bills attempting to address this issue on a statewide basis failed to advance, but if these pilot programs win authorization, expect the rest of the state to closely watch the outcomes in San Francisco, Los Angeles and San Diego. GOVERNOR’S DECISION Signed by Governor Brown on September 27, 2018.\nSecret Settlements WHAT THE BILL WOULD DO Carried by Chino Democratic Sen. Connie Leyva, this SB 820 would end a confidentiality provision often used in settlement agreements to silence victims in sexual harassment cases and protect the reputations of serial offenders. The “STAND Act,” as it has been named, won’t bar settlement agreements. But while a victim’s name could be kept private, perpetrators’ names could no longer be kept confidential in cases of sexual assault, harassment or discrimination in the workplace. WHO SUPPORTS IT The California Women’s Law Center and Consumer Attorneys of California say basic facts to a settlement should be made available so repeat offenders can be identified. It’s also supported by Attorney General Xavier Becerra and advocates for equal rights. WHO’S OPPOSED The California Chamber of Commerce, representing business interests, argues that employee allegations are often disputed, and settlements often occur because neither party wants the expense and distraction of litigation that either side could easily lose. The one-sided loss of privacy protections, they say, will cause more employers to take workplace claims to trial to protect their public images, costing money and creating more trauma for workers who are abused. WHY IT MATTERS Secret settlements silence victims while allowing serial offenders to continue harassing. Making disclosure easier protects workers from abuse and employers from potential liability. Also the threat of exposure may deter sexual misconduct in the workplace. GOVERNOR’S CALL Signed by Governor Brown on September 30, 2018. —Antoinette Siu\nWomen on Corporate Boards WHAT THE BILL WOULD DO Under SB 826 , publicly held companies with principal executive offices in California would be required to have at least one female director by Dec. 31, 2019, or else face a fine . By the end of 2021, corporations with five directors would have to have at least two female directors, and corporations with six directors or more would have to have at least three female directors. Under this bill, authored by two female Democrats—Sen. Hannah-Beth Jackson and Senate President Pro Tem Toni Atkins—corporations out of compliance would have to add a board seat and fill it with a woman if none opens before the deadlines. WHO SUPPORTS IT The National Association of Women Business Owners sponsored the bill, urging the state to set an example and consider evidence that companies led by female directors perform better financially. Women’s business groups and small business associations also support it, noting that mandated gender diversity on corporate boards is common in Europe, and that the results of voluntary diversification have been slow. WHO’S OPPOSED A coalition of some two dozen business groups led by the California Chamber of Commerce are fighting the measure, saying it focuses too narrowly on gender, as opposed to other kinds of diversity, and violates federal and state constitutions. There is no federal requirement for female representation on U.S. boards. WHY IT MATTERS According to the bill’s authors, a quarter of the publicly held corporations in California do not have a single woman in their boardrooms, a reflection of the male domination of corporate boards nationally. Gender representation in the corporate world has been an issue of huge debate, and this bill would make California the first state to enact legally binding requirements for women on boards. GOVERNOR’S CALL Signed by Governor Brown on September 30, 2018. From Gov. Brown’s signing statement: “Given all the special privileges that corporations have enjoyed for so long, it’s high time corporate boards include the people who constitute more than half the ‘persons’ in America.” —Antoinette Siu\nNet Neutrality WHAT THE BILL WOULD DO SB 822 by Democratic State Sen. Scott Wiener of San Francisco would restore key Obama-era internet net neutrality regulations rolled back by the Trump administration. The goal: To prevent internet service providers from blocking, slowing or favoring content, charging extra for fast lanes, collecting new fees from apps as a condition of internet access and favoring preferred apps by exempting them from consumers’ data caps if that means rival startups and small businesses will be harmed. WHO SUPPORTS IT Technology companies say net neutrality makes the internet a level playing field, particularly for smaller companies and startups, and that it deters censorship and protects innovation. Advocates argue consumers should be free to choose what they access, without interference from the internet service providers that control the pipeline. The Electronic Frontier Foundation and several former FCC commissioners are among the supporters, along with the Writers Guild of America and American Civil Liberties Union. WHO’S OPPOSED AT&T, Verizon, TMobile, and other broadband interests and internet service providers say the internet should be governed by a single national policy, not a state-by-state patchwork, and argue that they do not throttle speeds or interfere with access. They also say this measure would add to their costs and thus prevent them from upgrading their equipment and keeping prices low for consumers. Ideological opponents of net neutrality say California is overreaching and service providers should be able to upcharge for faster service if there is a market for it. WHY IT MATTERS Access to the internet and the infrastructure that supports it has been central to the debate over how best to protect consumers and ensure fair competition, and California’s Silicon Valley has been at the forefront. Backlash to the Trump administration’s rollback of net neutrality rules imposed by the Federal Communications Commission during the Obama era has already prompted federal litigation. A California net neutrality law is expected to face legal challenges, too. GOVERNOR’S DECISION Signed by Gov. Brown on September 30, 2018. But within hours of that signature, the Trump administration filed a lawsuit to block it, contending that the state’s action was “unlawful and anti-consumer” because it is in conflict with the federal government’s position and imposes burdensome regulations on the Internet. “Once again the California Legislature has enacted an extreme and illegal state law attempting to frustrate federal policy,” U.S. Attorney General Jeff Sessions said in a statement. —Antoinette Siu\nPolice Accountability WHAT THE BILLS WOULD DO Sacramento police thought Stephon Clark was holding a gun when they killed him in March in his grandmother’s backyard. But he was actually holding a cell phone, and the death of another unarmed black man at the hands of police triggered weeks of protests in the Capitol as well as proposals for new laws. Two police accountability bills collapsed under opposition from law enforcement groups: One would have made a tougher standard for police to use deadly force, and another that would have the Attorney General investigate police shootings. Two other bills advanced that would create more transparency for police: Assembly Bill 748 would require police departments to release body camera footage of most shootings within 45 days.\nSenate Bill 1421 would make investigation records public in police shootings and confirmed cases of sexual assault or lying by police. WHO SUPPORTS THEM The American Civil Liberties Union—as well as publishers, broadcasters and numerous criminal justice reform groups—argue that making videos and misconduct records public will improve safety and foster trust between communities and police. WHO OPPOSES THEM Many law enforcement groups lobbied against the bills, saying they violate officers’ privacy and could discourage them from doing their jobs. But the California Police Chiefs Association negotiated on SB 1421 and eventually supported it. WHY IT MATTERS California goes further than many states in terms of protecting police from public scrutiny. In most states, the public has at least some access to records on police misconduct, but California law has shielded such information since 1978. These bills would begin to shine some light on law enforcement practices and help Californians know if the officers who patrol their streets have a history of misconduct. GOVERNOR’S DECISION Both bills signed by Governor Brown on September 30, 2018. —Laurel Rosenhall","url":"https://calmatters.org/articles/california-final-bill-tracker-2018-legislature/"}
