{"authors":[],"date_download":"2018-10-30 21:45:52","date_modify":"2018-10-30 21:45:52","date_publish":"2015-12-21 15:32:00","description":"Need some last minute Christmas presents? Check out these places near Atlanta for last minute Christmas and holiday gift ideas.","filename":"data/vaneerConsumption/Lastminuteholidaygiftideas.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/11/03/Videos/4215879.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_holiday_got-last_da251362c613e9a20bfcd3272d83f9e9__1540935952.html","title":"Last-minute holiday gift ideas","title_page":"Christmas in Atlanta: Last-minute holiday gift ideas","title_rss":"NULL","source_domain":"ajc.com","text":"You've been busy. Apparently, very busy, because Christmas is nearly here, and you still need to buy gifts.\nAt this point, you're going to have to go to a store to be absolutely sure your gift will be under the tree on Christmas morning. Here are suggestions for great gifts you can pick up around town, either on your lunch break or on the way home.\nFor kids\nThanks to TableTop, celebrity geek Wil Wheaton's web series on the YouTube channel Geek & Sundry, board games are making a comeback. One popular game is The Settlers of Catan, a trading and building game with a fairytale theme, recommended for ages 12 and older. The best part? You don't have to know what game system the child has. You can find Catan and other board games at most retail stores, including Target and Walmart.\nMost kids play video games, however, and they like Minecraft. Why not get them a gift based on the video game? Stop by Barnes & Noble for \"Minecraft: The Complete Handbook Collection\" or a few of these mini figures.\nFor adults\nPick up a nice bottle of wine and an aerator, which forces air to mingle with the liquid. Aerators come in a variety of styles and can be found at Target, Macy's, Williams-Sonoma and other stores.\nAnother great wine gadget is the Corkcicle, which chills, aerates and pours your favorite wine without having to remove it. You can find Corkcicles at Sur la table, Target, Bed Bath & Beyond and other retailers.\nWine isn’t your only option. Many people love a nice cup of tea. Teavana carries loose-leaf tea, matcha tea and full-leaf tea sachets. Pair your selection with one of Teavana’s beautiful tea sets, which come in a variety of styles and colors. You can also find tea kettles and teapots at Target and Walmart. Teavana stores are in Phipps Plaza, and Perimeter, Lenox Square and Cumberland malls.\nGift cards\nGift cards can be purchased almost anywhere. If you don't want to just hand someone a card, though, you can build a gift around it. Throw a Netflix gift card, popcorn, candy and drinks in a popcorn box and wrap it up.\nAn iTunes gift card is good for music, books and games. Add a new iPhone case, which you most likely can get at the same store, and you have a great present.\nFor art lovers\nDrop by the gift shop at the High Museum of Art for everything from books to socks.\nThe book \"Artists and their Cats\" explores the special bond Pablo Picasso, Andy Warhol, Frida Kahlo and about 50 others shared with their feline companions. \" Also available are exhibition catalogs.\nMaybe your gift recipients prefer to wear their art. Look for socks, scarves, ties and jewelry in a variety of styles. The museum shop is open 10 a.m. to 5 p.m. Thursday and Saturday, 10 a.m. to 9 p.m. Friday, and noon to 5 p.m. Christmas Eve.\nAbsolutely last minute\nIf the next few days are just too busy for shopping, and you need a truly very-last-minute gift, consider an app. Yes, with your iPhone or iPad, you can gift an app. You can also send books and music through iTunes. Just excuse yourself from the room, find what you want to give, and, voila, you have a present.\nWith these ideas or a little imagination of your own, no one will know you waited until this week to start your shopping.\nNote: The AJC may receive a commission for purchases made through some links in this article.","url":"https://www.ajc.com/lifestyles/holiday/got-last-minute-gift-ideas-for-all-you-procrastinators-out-there/aVhjj02m8GspEo0ceBWdyJ/"}
