{"authors":[],"date_download":"2018-10-30 20:19:13","date_modify":"2018-10-30 20:19:13","date_publish":"2015-12-18 13:59:38","description":"The last shopping weekend before Christmas will be sunny and rain-free, so in addition to mall traffic, motorists can expect congestion in several interstate construction zones as road crews take advantage of the dry weather.","filename":"data/vaneerConsumption/LastweekendbeforeChristmastoseetrafficaroundmalls.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/18/Videos/4666905127001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_traffic_last-weekend-b_68814a00f76031e946ee116d5fd1e76f__1540930753.html","title":"Last weekend before Christmas to see traffic around malls,...","title_page":"Last weekend before Christmas to see traffic around malls,...","title_rss":"NULL","source_domain":"ajc.com","text":"The last shopping weekend before Christmas will be sunny and rain-free, so in addition to mall traffic, motorists can expect congestion in several interstate construction zones as road crews take advantage of the dry weather.\nHere’s what you need to remember to avoid the work zone backups:\nWork on Express Lanes to affect I-75 and I-575\nOne northbound lane of I-575 will be closed all weekend between Ga. 92 and Towne Lake Parkway, while a southbound lane will be blocked from Ga. 92 to Chastain Road.\nOne southbound lane of I-75 will be closed at the Canton Road Connector and again at Delk Road from 9:30 a.m. to 4 p.m. Saturday.\nSign structure work will close one southbound lane between I-575 and North Marietta Parkway from 6 a.m. to 5 p.m. Saturday.\nSouth of town, one southbound lane of I-75 will be closed between Ga. 20 and Jonesboro Road from 9 a.m. to 2 p.m. for guardrail repairs.\nTwo southbound lanes of I-85 will be closed nightly from Cleveland Avenue to Ga. 74.\nEast of town, two lanes of I-20 in each direction will be closed all weekend between U.S. 278 and Alcovy Road.\nTwo westbound and one eastbound lane of I-285 will be closed at I-675 throughout the weekend.\nAlso on I-285, one eastbound lane will be closed all weekend between Flat Shoals Road and Jonesboro Road, while one westbound lane will be shut down between Glenwood Road and I-20.\nOn the west side, one eastbound lane of I-20 will be closed between I-285 and Martin Luther King Jr. Drive from noon until 4 p.m. Sunday.\n» For updated traffic information, listen to News 95.5 and AM 750 WSB and follow @ajcwsbtraffic on Twitter.\nWeekend to be dry and cooler\nChannel 2 meteorologist Karen Minton is forecasting sunny skies through Sunday, with the next chance of rain arriving on Monday and Tuesday.\nAfternoon highs will be in the low 50s Saturday and mid-50s Sunday, with morning lows in the low 30s Saturday and mid-30s Sunday.\n» Check the full forecast and track changes\nNew bowl game highlights weekend events\nAlcorn State takes on North Carolina A&T in the inaugural Air Force Reserve Celebration Bowl at noon Saturday at the Georgia Dome.\nNext door at Philips Arena, Saturday night’s V103 40th Anniversary Winterfest Concert will be followed by Sunday night’s Cirque Musica Holiday Spectacular.\n» Full list of weekend events","url":"https://www.ajc.com/news/traffic/last-weekend-before-christmas-see-traffic-around-malls-work-zones/pzpIPzB8KRiVowoiXNkrxH/"}
