{"authors":[],"date_download":"2018-10-22 21:07:06","date_modify":"2018-10-22 21:07:06","date_publish":"2014-05-06 01:01:34","description":"Supporters of Cecily McMillan, who faces up to seven years in jail, promised to appeal the verdict.","filename":"data/vaneerConsumption/LastOccupyWallStreetDefendantCecilyMcMillanConvicted.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/422101/140505-cecily-mcmillan-jms-2035_1a71cb054dcaf75eab35b920e9f6b429.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_last-occupy-wall-street-defendant-cecily-mcmillan-convicted-n97776_1540242426.html","title":"Last Occupy Wall Street Defendant Cecily McMillan Convicted","title_page":"Last Occupy Wall Street Defendant Cecily McMillan Convicted","title_rss":"NULL","source_domain":"nbcnews.com","text":"Bovell testified that McMillan intentionally sprang at him and hit him in the face on March 17, 2012, as he was helping fellow officers clear the park during a protest marking six months since the creation of the Occupy movement in late 2011.\nMcMillan countered that she went to the park to meet a friend, not to be part of the protest. She said she felt someone feeling her breast, so she instinctively struck back.\nThe trial has been a spark for the embers of the anti-Wall Street Occupy movement, whose followers showed up in court every day. They shouted \"shame\" and refused to leave the courtroom when the verdict was announced following three hours of deliberations.\nA group of Occupy supporters called the Cecily McMillan Support Committee accused the judge of having manipulated the jury to reach a verdict that would send a pro-business message.\n\"It has been clear from day one that Cecily has not received a fair and open trial. The job of a judge during a jury trial isn't to guide the verdict to fit his opinion,\" the group said in a statement, which labeled Zweibel \"a prosecutor in robes.\"\n\"We will be fighting this unjust verdict in the court of appeals,\" the group promised.","url":"https://www.nbcnews.com/news/us-news/last-occupy-wall-street-defendant-cecily-mcmillan-convicted-n97776"}
