{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:18:17","date_modify":"2018-10-30 22:18:17","date_publish":"2015-09-28 15:52:11","description":"San Francisco's last gun store will be closing its doors for good in October due to gun controls with which the store refuses to comply.","filename":"data/vaneerConsumption/LastGunStoreinSanFranciscoClosinginResponsetoGunControls.json","image_url":"https://media.breitbart.com/media/2015/09/High-Bridge-Arms-Steve-Alcairo-Facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_09_28__1540937897.html","title":"Last Gun Store in San Francisco Closing in Response to Gun Controls","title_page":"Last Gun Store in San Francisco Closing in Response to Gun Controls","title_rss":"NULL","source_domain":"breitbart.com","text":"In October, High Bridge Arms—the last gun store in San Francisco—will be closing its doors for good due to gun controls with which the store refuses to comply.\nSan Francisco has emerged as the gun control capital of California, with laws regulating everything from magazine capacity to allowable types of ammunition to limits on advertising to the manner in which guns must be stored–and beyond. For decades, High Bridge Arms has adapted to the passage of each new gun control, but it views the latest push as a step too far.\nAccording to SFist, the newest control push “comes from Supervisor Mark Farrell (District 2), and proposes to require that all gun sales in San Francisco be videotaped.” It would also “further require that all gun and ammunition buyers’ names, birthdates, addresses and driver’s license numbers be supplied to the San Francisco Police Department. Sup. Farrell proposed the idea in July, and it may be voted on this month.”\nFox News reports that High Bridge Arms’ general manager, Steven Alcairo, said the store’s owners are tired of keeping up with the new regulations and equally tired of trying to guess what might come next. Alcairo said, “This time, it’s the idea of filming our customers taking delivery of items after they already completed waiting periods. We feel this is a tactic designed to discourage customers from coming to us.” He added, “This year, it’s this and next year will probably be something else. We don’t want to wait for it.”\nComments from Supervisor Farrell bolster Alcairo’s concern that further gun control is on the way. When Farrell began pushing for the videotaping of all gun sales, he said:\nEasy access to guns and ammunition continue to contribute to senseless violent crime here in San Francisco and across the country. Even though San Francisco has some of the toughest gun control laws on the books in the country – there is more we can do to protect the public.\nHigh Bridge Arms opened in the mid-1950s. It will soon be closed after dying the death of a thousand cuts.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2015/09/28/last-gun-store-san-francisco-closing-response-flood-gun-controls/"}
