{"authors":[],"date_download":"2018-10-22 21:14:56","date_modify":"2018-10-22 21:14:56","date_publish":"2014-06-04 18:16:45","description":"The last of the 29 Navajos who created a code designed to elude the Japanese during World War II, Chester Nez, died Wednesday. He was 93.","filename":"data/vaneerConsumption/LastofOriginalGroupofNavajoCodeTalkersDies.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/487586/140604-chester-nez-1409_7f4d7cdcb9396119cdc62e03e63e7d87.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_last-original-group-navajo-code-talkers-dies-n122606_1540242896.html","title":"Last of Original Group of Navajo Code Talkers Dies","title_page":"Last of Original Group of Navajo Code Talkers Dies","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFLAGSTAFF, Ariz. — The last of the 29 Navajos who developed a code that stumped the Japanese during World War II has died.\nChester Nez, of Albuquerque, New Mexico, died Wednesday morning of kidney failure, said Judy Avila, who helped Nez write his memoirs. He was 93.\nBefore hundreds of men from the Navajo Nation became Code Talkers, 29 Navajos were recruited to develop the code based on the then-unwritten Navajo language. Nez was in 10th grade when he enlisted, keeping his decision a secret from his family and lying about his age, as did many others.\n\"It's one of the greatest parts of history that we used our own native language during World War II,\" Nez told The Associated Press in 2010. \"We're very proud of it.\"\nNez has said he was concerned the code wouldn't work, but even the few Navajos who spoke the language couldn't understand the code. It proved impenetrable.\nThe Navajos trained in radio communications were walking copies of the code. Each message read aloud by a Code Talker was immediately destroyed.\n\"The Japanese did everything in their power to break the code but they never did,\" Nez said in 2010.\nAfter World War II, Nez volunteered to serve two more years during the Korean War. He retired in 1974 after a 25-year career as a painter at the Veterans hospital in Albuquerque.\nNez was eager to tell his family about his role as a Code Talker, Avila said, but he couldn't. Their mission wasn't declassified until 1968.\nThe accolades came much later. The Code Talkers now are widely celebrated. The original group received Congressional Gold Medals in 2001, and a movie based on the Code Talkers was released the following year.\nDespite having both legs partially amputated, confining him to a wheelchair, Avila said Nez loved to travel and tell his story.\nFuneral arrangements are pending.","url":"https://www.nbcnews.com/news/us-news/last-original-group-navajo-code-talkers-dies-n122606"}
