{"authors":[],"date_download":"2018-10-22 22:23:51","date_modify":"2018-10-22 22:23:51","date_publish":"2014-06-09 20:04:54","description":"Police say Jerad and Amanda Miller were apparently acting alone, but they are investigating their ties to militants.","filename":"data/vaneerConsumption/LasVegasCopKillersHatedGovernmentandLeftSwastikaonBody.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/498536/140610-vegas-cops-630a_b51fafce84739d570fcd5f61df56105c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_vegas-cop-killers_las-vegas-cop-killers-hated-government-left-swastika-body-n126666_1540247031.html","title":"Las Vegas Cop-Killers Hated Government and Left Swastika on Body","title_page":"Las Vegas Cop-Killers Hated Government and Left Swastika on Body","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Las Vegas couple who shot to death two police officers, a civilian and themselves — after telling a neighbor they were headed to an \"underground world\" — had an anti-government, anti-police ideology with militia and white supremacist overtones, authorities said Monday.\nInvestigators believe ex-con Jerad Miller and his wife, Amanda, acted alone during Sunday's blood-thirsty rampage, but they are investigating possible links between the pair and militants who converged on rancher Cliven Bundy's property during his armed standoff with federal rangers.\n\"At this time, we believe this is an isolated act,\" Assistant Sheriff Kevin McMahill said at a briefing.\nThe duo left calling cards of their world view on the bodies of the slain cops: a \"Don't Tread on Me\" flag, a note that read \"The revolution is beginning\" and a swastika meant to equate police with the Nazis, McMahill said.\nThe couple's ideology was no secret, yet a neighbor who saw them set off on foot Sunday morning with a red shopping cart carrying weapons and ammunition was not alarmed enough to call police.\n\"I thought they were talking out of their neck,\" Kelly Fielder told NBC Los Angeles.\nShe said Jerad Miller, 31, had two guns and bullets and Amanda, 22, had a .38 caliber handgun in her purse and a rifle.\n\"We gotta do what we gotta do,\" Jerad Miller told Fielder, adding that they were departing for an \"underground world\" and needed protection.\nAmanda Miller then embraced Fielder and said, \"I am so sorry.\"\nPolice believe the couple walked the four miles to CiCi's Pizza, where Officers Alyn Beck, 42, and Igor Soldo, 32, were having lunch in a booth.\nAs the duo strode by the cops' booth, the husband pulled out a handgun and shot Soldo once in the back of the head, killing him instantly. Beck began to react, and Jerad Miller opened fire, hitting him in the throat. HIs wife then pulled out her pistol and shot him several more times, police said.","url":"https://www.nbcnews.com/storyline/vegas-cop-killers/las-vegas-cop-killers-hated-government-left-swastika-body-n126666"}
