{"authors":["Snejana Farberov For Dailymail.Com"],"date_download":"2018-10-23 03:01:08","date_modify":"2018-10-23 03:01:08","date_publish":"2017-03-16 13:44:50","description":"Convicted child molester Robert Roginsky, 38, has been charged with open murder in the strangulation death of his live-in girlfriend, Laura Guden, in Las Vegas on March 10.","filename":"data/vaneerConsumption/LasVegaswomankilledbyhersexoffenderboyfriend.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54497D00000578-0-image-a-3_1489670629452.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320012_Woman-strangled-death-sex-offender-boyfriend_1540263668.html","title":"Las Vegas woman 'killed by her sex offender boyfriend'","title_page":"Las Vegas woman 'killed by her sex offender boyfriend' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A registered sex offender with a history of pedophilia has been arrested and charged with strangling to death his 21-year-old girlfriend in Las Vegas.\nInvestigators say 38-year-old Robert Roginsky murdered Laura Guden inside their apartment in downtown Las Vegas shortly before 9pm last Thursday.\nPolice were summoned to the couple's home by concerned neighbors who heard screams coming from the apartment.\nScroll down for video\nBrutal end: Robert Roginsky, 38, (left), has been charged with murder in the strangulation death of his 21-year-old girlfriend, Laura Guden (right)\nResponding officers forced their way inside and found Roginsky and an unresponsive Guden, who was pronounced dead at a the scene.\nAccording to an arrest report, the 21-year-old victim was naked and had defensive injuries to both her hands, including broken fingernails, suggesting that she had fought for her life.\nWhen questioned by police, Roginsky claimed that his girlfriend was a victim of a drug deal gone awry.\nHe told detectives that his girlfriend was raped and strangled by a drug dealer named David.\nRoginsky said David and another man kidnapped him after the killing and took him to an unknown location, the Las Vegas Review Journal reported.\nBut at one point he admitted to choking her. Neighbors also told cops that they didn't see anyone come in or out of the property during the day.\nDuring the interview, the 38-year-old suffered an unspecified medical episode and had to be hospitalized for treatment.\nRoginsky was later booked into the Clark County Detention Center without bail on one count of open murder.\nCourt records indicate that the 38-year-old man is a Level 2 registered sex offender who served time in prison after being convicted in 2008 of lewdness with an 11-year-old.\nShe fought back: Police in Las Vegas found Guden, pictured left and right, lying naked inside her home on the night of March 10, with defensive injuries to her hands\nChanging story: When questioned by police, Roginsky claimed Guden was a victim of a drug deal gone awry, but at one point he admitted to choking her\nRoginsky was sentenced to 10 years but was released on parole in 2011 after serving only four years.\nIn 2014, he was convicted of violating the conditions of his supervised release by launching an online business under a fake name, Robert Bailey\nConvicted pedophile: Roginsky, pictured in a previous mugshot, is a Level 2 registered sex offender who served time in prison after being convicted in 2008 (mugshot above) of lewdness with an 11-year-old\nRoginsky pleaded guilty in that case and was again given probation.\nLaura Guden's sister told the station KLAS their family did not know about Robert Roginsky's criminal past, and Laura herself also may have been in the dark about it.\nAccording to a GoFundMe campaign launched by Laura Guden's grieving mother, her murder comes just two months after the death of her beloved brother, Michael Guden.\nLaura’s sister Agna paid tribute to her slain sibling on Facebook on Tuesday, writing: ‘I hope wherever you are there are a bunch of kittens waiting for you<3 I love you and wish I had the chance to tell you that more often.’\nHer close friend Rob Siklok Bastian, a Las Vegas DJ and club promoter, had a strong message for Laura’s accused killer: ‘I hope that you live the rest of your life incarcerated thinking about all the damage you've done,’ reported News 3 LV.\nLaura Guden's sister said their family did not know about Roginsky's criminal past, and the 21-year-old also may have been in the dark about it\nSecond tragedy: Guden's violent murder comes just two months after the death of her beloved brother, Michael Guden (pictured together)\nVideo courtesy of KTNV-TV","url":"https://www.dailymail.co.uk/news/article-4320012/Woman-strangled-death-sex-offender-boyfriend.html"}
