{"authors":["Breitbart News"],"date_download":"2018-10-30 21:35:30","date_modify":"2018-10-30 21:35:30","date_publish":"2015-12-22 05:21:26","description":"Las Vegas Crash Driver charged with Murder","filename":"data/vaneerConsumption/LasVegasCrashDriverchargedwithMurder.json","image_url":"https://media.breitbart.com/media/2015/12/ap_lakeisha-n-holloway_ap-photo1-wi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_21__1540935330.html","title":"Las Vegas Crash Driver charged with Murder","title_page":"Las Vegas Crash Driver charged with Murder","title_rss":"NULL","source_domain":"breitbart.com","text":"LAS VEGAS, Dec. 21 (UPI) — The motorist police say ran over dozens of pedestrians in Las Vegas on Sunday night, killing one, was named and charged with murder Monday — as investigators try and determine whether the incident had been planned or was a spontaneous act.\nAuthorities say 24-year-old Lakeisha Holloway intentionally plowed into a crowd of people on famous Las Vegas Boulevard, swerving her vehicle in deliberate movements to hit pedestrians on one of the busiest streets in the world.\nThe crash occurred just after 6:30 p.m. local time Sunday, when officials say Holloway’s 1996 Oldsmobile hopped onto the sidewalk and hit several people walking nearby.\nLas Vegas police said Holloway then drove the vehicle onto the road and back onto the sidewalk again before fleeing the scene.\nAn Arizona woman was killed and three dozen people were hurt, six critically. Four were treated for minor injuries. The woman killed was identified as Jessica Valenzuela, 32.\nNone of the injured were identified but police said they were citizens of Oregon, Colorado, Florida, California, Washington, Mexico and Quebec, Canada.\nPolice said they have ruled out terrorism, but stated the crash was deliberate. A 3-year-old child inside Holloway’s car was not harmed, they said.\nHolloway had only recently moved to Las Vegas, investigators said Monday, and had been living out of the vehicle for about a week. According to a police report, she told officers that she had become “stressed” by security guards at various hotel parking lots chasing her off the premises when she tried to sleep in her car there.\nHolloway was charged with one count of murder with a deadly weapon, the Las Vegas district attorney said Monday. Authorities are also considering charges of child abuse and neglect, for the toddler in her vehicle, and attempted murder for the dozens of injured victims.\nThe crash occurred on South Las Vegas Boulevard, known colloquially as The Strip, near the Planet Hollywood and Paris hotels, officials said. Vehicle and foot traffic in the area was greater than normal at the time, following the Miss Universe pageant that was held at Planet Hollywood.\nHolloway was ultimately captured by police about a mile away, authorities said, and tested positive for drugs and alcohol.\n“We don’t know what caused her to snap and whether it was planned previously,” Las Vegas Metro Police Sheriff Joe Lombardo said.\nAuthorities are trying to determine Holloway’s motive and background. They said she moved to Las Vegas from Oregon but noted that learning further details about her past has so far been difficult.\nNBC News reported that Holloway was convicted of two traffic offenses in 2011, and was even given an award for helping at-risk youths in the Portland area in 2012.\n“Lakeisha Holloway described being homeless during her freshman year in high school and explained that her mother had lost hope after struggling many years to earn a living with only an 8th Grade education,” an April 5, 2012, news article in The Skanner, acknowledging the award, said. “More and more [her mother] turned to alcohol, leaving Lakeisha to fend for herself.”\nThe report said Holloway was pursuing a career in the forest service.\n“I would like to thank the Forest Service for sending me an application and taking a chance on me,” Holloway said in the article, which was paired with a photo. “I’d like to thank Portland Opportunities Industrial Center for the love and support and for being more than a program, for being a blessing.”","url":"https://www.breitbart.com/politics/2015/12/21/las-vegas-crash-driver-charged-with-murder/"}
