{"authors":["Ildefonso Ortiz"],"date_download":"2018-10-30 22:19:04","date_modify":"2018-10-30 22:19:04","date_publish":"2015-05-05 14:58:42","description":"The daughter of a late Mexican drug kingpin traveled to McAllen, Texas, to give birth to her first child.","filename":"data/vaneerConsumption/LateMexicanDrugLordsDaughterGivesBirthinTexas.json","image_url":"https://media.breitbart.com/media/2015/05/plancarte.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_05_05__1540937944.html","title":"Late Mexican Drug Lord’s Daughter Gives Birth in Texas","title_page":"Late Mexican Drug Lord’s Daughter Gives Birth in Texas","title_rss":"NULL","source_domain":"breitbart.com","text":"MCALLEN, Texas – The daughter of a late Mexican kingpin from the hyper-violent Knights Templar drug cartel traveled to this border city to give birth to her first child.\nThis weekend, Melissa “La Barbie Grupera” Plancarte arrived at a local hospital in McAllen and gave a short, lighthearted interview to the Telemundo show Al Rojo Vivo about her expectations.\nPlancarte was a little-known Mexican folk music performer who gained fame in 2014 when she admitted – before Mexican news outlets picked up on it – that her father was Enrique “Kiki” Plancarte, one of the top commanders in the Knights Templar cartel.\nCashing in on her family’s fame, Melissa Plancarte performed one of her recorded songs wearing a black and white tunic with a red cross – a design similar to the Knights Templar uniform of old, and a style adopted by her father’s cartel.\nMelissa Plancarte is also a social media regular who often posts photographs of her lavish lifestyle, including the three tigers she has at her house, luxury cars, and other high-end accessories.\nThe Knights Templar cartel, a cult-like criminal organization with fanatically-devoted soldiers, began in 2006 as La Familia Michoacana. They originally planned to assist the larger Gulf Cartel in the area, but over time, the Knights Templar underwent several internal conflicts and lost key members to splinter organizations, considerably altering their ambitions.\nThe Knights Templars drew even more attention when Mexican officials confirmed the group had taken part in ritualistic cannibalism, eating the hearts of their victims.\nPlancarte died in a firefight with Mexican authorities on March 31 2014, in the Mexican State of Queretaro. Following her father’s death, Melissa often spoke about him in public, and claimed to miss him deeply.\nFollow Ildefonso Ortiz on Twitter and on Facebook.","url":"https://www.breitbart.com/border/2015/05/05/late-mexican-drug-lords-daughter-gives-birth-in-texas/"}
