{"authors":["Associated Press"],"date_download":"2018-10-22 22:40:02","date_modify":"2018-10-22 22:40:02","date_publish":"2016-01-11 03:29:21","description":"MEXICO CITY (AP) — Mexico's government has notified recaptured drug lord Joaquin \"El Chapo\" Guzman that he is wanted in the United States, formally beginning...","filename":"data/vaneerConsumption/LatestMexicostartsproceedingstoextraditeGuzmantoUS.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:778bf55686f74d318473f55a6c4c9fd8-3bWLCvS3pZb5eb4fce05c5fa3342-611_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393316_Latest-Mexico-starts-proceedings-extradite-Guzman-US_1540248002.html","title":"Latest: Mexico starts proceedings to extradite Guzman to US","title_page":"Latest: Mexico starts proceedings to extradite Guzman to US | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Latest: Mexico starts proceedings to extradite Guzman to US\nMEXICO CITY (AP) — Mexico's government has notified recaptured drug lord Joaquin \"El Chapo\" Guzman that he is wanted in the United States, formally beginning extradition proceedings against him.\nThe Attorney General's Office said Sunday in a statement that Guzman was told that two arrest warrants from the U.S. are being processed. The notification was done by agents of the international police agency Interpol at the maximum security prison where Guzman is being held.\nGuzman was recaptured Friday, six months after breaking out of a Mexican prison.\nMexican drug lord Joaquin \"El Chapo\" Guzman, right, is escorted by soldiers and marines to a waiting helicopter, at a federal hangar in Mexico City, Friday, Jan. 8, 2016. The world's most wanted drug lord was recaptured by Mexican marines Friday, six months after he fled through a tunnel from a maximum security prison in an escape that deeply embarrassed the government and strained ties with the United States.(AP Photo/Marco Ugarte)\nOfficials have cautioned that the extradition process might take a while. Guzman's attorney Juan Pablo Badillo has said that the defense already has filed six motions to challenge extradition requests.\nFILE - In this Oct. 8, 2015 file photo, Sean Penn speaks during a forum with young entrepreneurs during the IMF and World Bank annual meeting in Lima, Peru. Late Saturday, Jan. 9, 2016, Rolling Stone magazine published an interview that Guzman apparently gave to Penn in his hideout in Mexico months before his recapture. In the article and interview, Penn describes the complicated measures he took to meet the legendary drug lord. (AP Photo/Rodrigo Abd, File)\nJoaquin \"El Chapo\" Guzman is made to face the press as he is escorted to a helicopter in handcuffs by Mexican soldiers and marines at a federal hangar in Mexico City, Mexico, Friday, Jan. 8, 2016. Mexican President Enrique Pena Nieto announced that Guzman had been recaptured six months after escaping from a maximum security prison. (AP Photo/Eduardo Verdugo)\nMexican drug lord Joaquin \"El Chapo\" Guzman is loaded into a marine helicopter at a federal hangar in Mexico City, Friday, Jan. 8, 2016. The world's most wanted drug lord was recaptured by Mexican marines Friday, six months after he fled through a tunnel from a maximum secuirty prison in an escape that deeply embarrassed the government and strained ties with the United States. (AP Photo/Eduardo Verdugo)\nMexican Navy marines stand next to their vehicle after they participated in the recapture of Mexico's most wanted drug lord, Joaquin \"El Chapo\" Guzman in the city of Los Mochis, Mexico, Friday, Jan. 08, 2016. The world¿s most-wanted drug lord was captured for a third time, as Mexican marines staged heavily-armed raids that caught drug lord Joaquin \"El Chapo\" Guzman six months after he escaped from a maximum security prison. (AP Photo/Mahatma Millan)\nA Mexican army vehicle stands guard outside of a motel wheere Mexico's most wanted drug lord, Joaquin \"El Chapo\" Guzman was captured, in the city of Los Mochis, Mexico, Friday, Jan. 8, 2016. The world¿s most-wanted drug lord was captured for a third time, as Mexican marines staged heavily-armed raids that caught Guzman six months after he escaped from a maximum security prison.(Carlos Paulino via AP/EL DEBATE)","url":"https://www.dailymail.co.uk/wires/ap/article-3393316/Latest-Mexico-starts-proceedings-extradite-Guzman-US.html"}
