{"authors":["Brandon Riddle"],"date_download":"2018-10-30 19:14:25","date_modify":"2018-10-30 19:14:25","date_publish":"2016-10-19 00:00:00","description":"The latest proposal for redeveloping the site of Little Rock’s shuttered Sears includes two hotels and multiple outparcels for restaurants.","filename":"data/vaneerConsumption/LatestproposalforLittleRockSearssiteincludes2hotelsmultiplerestaurantspaces.json","image_url":"https://media.arkansasonline.com/img/photos/2016/10/19/resized_250499-sears-building-01_4-22020_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_apr_18__1540926865.html","title":"Latest proposal for Little Rock Sears site includes 2 hotels, multiple restaurant spaces","title_page":"Latest proposal for Little Rock Sears site includes 2 hotels, multiple restaurant spaces","title_rss":"NULL","source_domain":"arkansasonline.com","text":"The old Sears department store at Interstate 630 and South University Avenue is part of a $100 million restaurant and retail development planned by a Dallas firm. - Photo by Melissa Gerrits\nThe latest proposal for redeveloping the site of Little Rock’s shuttered Sears includes two hotels and multiple outparcels for restaurants.\nNow called The District at Midtown, the multimillion-dollar project also includes a reconfiguration of an on-ramp to Interstate 630, cutting off direct westbound access from University Avenue and creating an access road.\nThe mixed-used development had previously been dubbed The Shops at University Village and was set to be anchored by a grocery store.\nIn July, a site plan up for about a day named restaurants like Raising Cane’s Chicken Fingers, Panda Express and Uncle Julio’s Mexican restaurant. The most recent proposal doesn’t list any specific eateries.\nA roundabout is proposed to sit in the center of the The District, and a traffic signal is planned on the property’s east side at University Avenue.\nAccording to the site plan from Dallas firm Shop Companies, about 56,000 square feet of retail and restaurant space would sit just north of the interstate.\nTwo, four-story hotels — one with 107 rooms and another with 90 rooms — would be constructed near existing office buildings.\nThe site has sat dormant over the past two years after Sears, citing challenges in the retail industry, closed its only department store in Arkansas’ capital city.\nProvident Realty Advisors Inc. of Dallas purchased the property, which encompasses three medical buildings, from Little Rock Medical Associates for about $44 million in 2016.","url":"https://www.arkansasonline.com/news/2018/apr/18/latest-proposal-little-rock-sears-site-includes-2-/"}
