{"authors":[],"date_download":"2018-10-30 18:18:06","date_modify":"2018-10-30 18:18:06","date_publish":"2014-06-06 16:00:00","description":"A meticulous preservation of Pasaquan, the visionary art environment created by the late Eddie Owens Martin, is set to begin, the Kohler Foundation announced this week.","filename":"data/vaneerConsumption/LateartistsPasaquancompoundinSWGeorgiatobepreserved.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/MyAJC/2014/06/06/Images/photos.medleyphoto.5344052.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_late-artist-p_6951a24ed202a18e3e5e65e1d3e1f928__1540923486.html","title":"Late artist’s Pasaquan compound in S.W. Georgia to be preserved","title_page":"Late artist’s Pasaquan compound in S.W. Georgia to be preserved","title_rss":"NULL","source_domain":"ajc.com","text":"A meticulous preservation of Pasaquan, the visionary art environment created by the late Eddie Owens Martin, is set to begin, the Kohler Foundation announced this week. Once the two-year restoration is complete, the property will be given to the Columbus State University Foundation for programming directed by the university’s art department.\nFrom the mid-1950s until his death in 1986, the self-taught Martin, known as St. EOM, created a phantasmagoric compound on seven acres around a family farmhouse he inherited near Buena Vista, about 30 miles southeast of Columbus. Tom Patterson, a writer and authority on folk art, has described the site — with its brightly painted concrete walls, walkways, totems, temples and pagoda — as “a sort of mock pre-Columbian psychedelic wonderland.”\nFor more than two decades, the Pasaquan Preservation Society has owned and maintained the site. But preventing deterioration has been more than the small volunteer group could handle, with paint flaking and floors caving in. Last year, the group approached Wisconsin-based Kohler, nationally known for preserving art environments, folk architecture and the collections of self-taught artists, about safeguarding the site.\nThe cost of the Pasaquan project has not been disclosed, but it will include structural work as well as object and painting conservation. Professional conservators from Chicago, Houston and Los Angeles will collaborate with local craftsmen. Work is expected to begin Monday.\nCSU President Tim Mescon predicted the restoration “will have an indelible and positive impact on the region.”\nJoe Sanders, chair of the CSU art department and a Pasaquan Preservation Society board member, said Pasaquan could become a research site for advanced study in art environments. “Kohler will be using state-of-the-art processes and high-quality materials to maintain the integrity of the site for years to come,” he said.\nWith Kohler’s upcoming gift to CSU, Georgia’s two major folk art environments have been secured for future generations to experience. News of the Pasaquan rebirth follows nearly two years of improvements at Paradise Garden, Howard Finster’s folk art environment in Summerville in the state’s northwest corner. Chattooga County purchased Paradise Garden in 2011, and the property is open to the public during ongoing restoration by the nonprofit Paradise Garden Foundation.\nWhen CSU takes over Pasaquan, associate art professor Mike McFalls will direct a program of events and educational activities. But students will benefit almost immediately by having internships with Pasaquan conservators starting this summer.\nIn addition to Pasaquan, Martin left behind a trove of art objects that has been stored off-site — from the eccentric handmade regalia he wore in dance performances to medallions, beads and works on paper. All the works will be preserved, and a few pieces will be distributed to major museums. Martin’s work already is in the permanent collections of the High Museum of Art, Smithsonian American Art Museum and the New Orleans Museum of Art.\n“There are so many pieces that have not been exhibited or seen by the public, so this part of the collection will be of particular interest to scholars and museum curators,” Kohler Executive Director Terri Yoho said.","url":"https://www.ajc.com/entertainment/late-artist-pasaquan-compound-georgia-preserved/Ctp4G4vYX3fpS3ImMwCdIN/"}
