{"authors":["Edwin Mora"],"date_download":"2018-10-30 19:44:39","date_modify":"2018-10-30 19:44:39","date_publish":"2015-03-18 16:08:05","description":"The United States has spent millions of taxpayer dollars over more than a decade to build top-secret replicas of Iran nuclear sites at a secret location in the U.S., reports the Los Angeles Times. |","filename":"data/vaneerConsumption/LATimesUSSpentMillionstoBuildReplicaofIranNuclearSites.json","image_url":"https://media.breitbart.com/media/2015/01/iran-nuclear-reactor-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_03_18__1540928679.html","title":"LA Times: U.S. Spent Millions to Build Replica of Iran Nuclear Sites","title_page":"LA Times: U.S. Spent Millions to Build Replica of Iran Nuclear Sites | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The United States has spent millions of taxpayer dollars over more than a decade to build top-secret replicas of Iran nuclear sites at a secret location in the U.S., reports the Los Angeles Times.\nPresident Obama is expected to use research conducted at the replica sites to sell a nuclear deal with Iran to the public and Congress.\n“Using centrifuges acquired when Libya abandoned its nuclear program in 2003, as well as American-built equipment, the government has spent millions of dollars over more than a decade to build replicas of the enrichment facilities that are the pride of Iran’s nuclear program,” reveals the LA Times.\nThe article did not provide a specific dollar amount for how much was spent to build the replica enrichment sites in the U.S.\n“Since negotiations with Iran began in earnest, U.S. nuclear technicians have spent long hours tinkering with the machines to test different restrictions and see how much they would limit Iran’s ability to convert uranium into bomb fuel,” it adds. “Soon, the administration may be using the results of that secret research to try to convince the public that negotiations produced a good deal.”\nDiplomats from Iran and the P5+1 (U.S., Russia, China, U.K., France, Germany) have reportedly made significant progress in their efforts to reach the outline of a nuclear compromise by the end of March.\nUnder a deal, the P5+1 would ease economic sanctions on Iran if Tehran agrees to restrict its nuclear program for at least 10 years.\nThe Obama administration is expected to have a hard time selling the nuclear deal to the Republican-controlled Congress and the public.\n“The facts accumulated over more than a dozen years by a small army of experts from the Energy Department and other agencies will play a key role in that effort, officials hope,” notes the LA Times.\nAlthough U.S. officials have refused to comment on the classified research conducted at a secret location in the U.S., former officials and private analysts have provided information to the LA Times gleaned from informants in Iran, foreign governments, and the United Nation’s International Atomic Energy Agency (IAEA).","url":"https://www.breitbart.com/national-security/2015/03/18/la-times-u-s-spent-millions-to-build-replica-of-iran-nuclear-sites/"}
