{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 19:30:03","date_modify":"2018-10-30 19:30:03","date_publish":"2016-09-14 20:30:56","description":"The Los Angeles Times paid a visit to Donald Trump's L.A. headquarters and was stunned by the diversity of volunteers.","filename":"data/vaneerConsumption/LATimesStunnedbyDiversityofVolunteersatTrumpHQ.json","image_url":"https://media.breitbart.com/media/2016/09/IMG_2516.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_09_14__1540927803.html","title":"L.A. Times Stunned by Diversity of Volunteers at Trump H.Q.","title_page":"L.A. Times Stunned by Diversity of Volunteers at Trump H.Q.","title_rss":"NULL","source_domain":"breitbart.com","text":"The Los Angeles Times paid a visit to Donald Trump’s Southern California headquarters in Long Beach on Monday and was stunned by the diversity of volunteers who are committed to seeing him win the Golden State and the presidency.\n“It was as if the whole thing had been staged, in Cambodia Town, no less, to belie the notion that Trump’s appeal is largely limited to older white males,” the Times‘s Steve Lopez wrote. In Long Beach, one of America’s most diverse cities, that same diversity was reflected in Trump’s supporters at his Southern California headquarters.\nLopez spoke with a woman and millennials of Filipino descent, a Mexican-American, and a Jewish man, and saw the “names of volunteers from the African-American, Hispanic and Asian communities” written on blackboards adorning the names of volunteers. He noted that “two middle-aged white people [also] joined the party.”\nTrump’s grand opening for his headquarters took place this past Saturday, and Breitbart News was there to cover it. As Lopez was told, there were hundreds of people there over the course of the opening; many of them were able to enjoy a performance that was put on by dancers from the Khmer Arts Cultural Center, known as a traditional Cambodian “blessing dance;” something Lopez wrote he would have paid to see.\nLopez wrote that an unnamed Mexican-American Trump volunteer told him that “there are too many illegals here… and they dirty the place up and they take jobs and do things hey shouldn’t.” Lopez noted that once he found out he was with the Times, the man said “the only thing the Times is any good for is to wrap fish in it,” before walking away.\n(This Breitbart News reporter was similarly dismissed by a liberal couple at the state’s Democratic Convention last year.)\nA white male Trump supporter who was also present told the Times that at although one point he “wanted to strangle” Trump, he changed his mind when he saw that Trump “had received Christ.”\nGary Fultheim, the Jewish man who is also part-owner of the building that Trump’s HQ is located in, reportedly said one of the main reasons he is voting Trump for president is because he believes Trump will do a better job of protecting Israel from Iran than the Democrats will.\nFollow Adelle Nazarian on Twitter and Periscope @AdelleNaz","url":"https://www.breitbart.com/local/2016/09/14/l-a-times-stunned-by-diversity-during-visit-to-trump-h-q/"}
