{"authors":["Jordan Gass-Poore For Dailymail.Com"],"date_download":"2018-10-22 21:40:27","date_modify":"2018-10-22 21:40:27","date_publish":"2017-03-16 01:49:27","description":"Tracey Tong, 23, (pictured) defended 'Muslim' passengers on the New York City subway from bigoted harassment. A video of the incident posted on Facebook has gone viral.","filename":"data/vaneerConsumption/LatinawomandefendsMuslimpassengersonNewYorksubway.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E4FD50100000578-0-image-a-20_1489626406229.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318370_Young-Latina-woman-defends-Muslim-passengers-subway_1540244427.html","title":"Latina woman defends Muslim passengers on New York subway","title_page":"Latina woman defends Muslim passengers on New York subway | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the moment a New York City subway passenger defends Muslim riders from bigoted harassment.\nIn the video, an older Latina woman verbally attacks a man who 'looks Indian Muslim', asking him why he is in the United States.\n'Why are you here? Why are you in this country? You're not one of us,' the woman tells the unseen man by her side, who calmly defends himself.\nWhen a fellow E train passenger asks her in accented English to stop bothering him, the woman becomes combative.\nAn unidentified woman (above) verbally attacks a man who 'looks Indian Muslim' on the New York City subway in viral video footage\nA fellow E train passenger (right) asks the woman in accented English to stop bothering him\nWhen that doesn't work, Tracey Tong, 23, (left) intervenes\n'No, you don't understand; you're not even from here,' the woman yells.\nIt is at this point that Tracey Tong, 23, intervenes.\nTong asks the woman her country of origin.\n'I am from here! I was born here in America! It doesn't matter where I come from,' the woman yells at Tong.\nTong calmly tells the woman that she is half-Chinese and half-Latin American.\nAfter a short pause, the woman explains to Tong that although she was born in the US her family is from Puerto Rico.\nSwitching from English to Spanish, Tong reminds her fellow Latina that most Americans can trace their roots elsewhere.\n'We need to stick together,' Tong urges the woman.\nTong (pictured) is being hailed a heroine after the video of the incident went viral\nAs the conversation unfolds, Tong demands that the passengers be treated with respect - in any language necessary.\n'I’m asking you to please respect her,' insists Tong. 'In Spanish, in English, in Chinese, in French – whatever language you want me to say it, I will say it.'\nTong is being hailed a heroine after the video of the incident went viral, with more than one million views.\nHer intervention joins a list of similar incidents this year.\nIn Kentucky, a Caucasian woman insulted two Latinas in a mall, and in Dallas, a Caucasian man verbally assaulted a Hispanic Wal-Mart employee.","url":"https://www.dailymail.co.uk/news/article-4318370/Young-Latina-woman-defends-Muslim-passengers-subway.html"}
