{"authors":["Matt Levin","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:55:09","date_modify":"2018-10-30 23:55:09","date_publish":"2016-12-28 21:58:40","description":"Twenty years ago, if you plucked a random application from a University of California admissions office, it was pretty unlikely that you’d be looking at","filename":"data/vaneerConsumption/LatinoapplicationsskyrocketasrecordbreakingtallyappliestoUCcampuses.json","image_url":"https://calmatters.org/wp-content/uploads/favicon-150x150.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540943709.html","title":"Latino applications skyrocket as record-breaking tally applies to UC campuses","title_page":"Latino applications skyrocket as record-breaking tally applies to UC campuses | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Twenty years ago, if you plucked a random application from a University of California admissions office, it was pretty unlikely that you’d be looking at the transcript and SAT scores of a Latino high school senior. While Latinos accounted for about 40 percent of students in the state’s K-12 system, they made up just 14 percent of UC’s in-state applicant pool, trailing both Asian-American and white students by considerable margins.\nFast forward to 2017, and the number of Latino applicants to the state’s premier public university system has exploded. From the late 1990’s to today, applications from Latino Californians grew 500 percent—about five times faster than applications from Asian-Americans over the same time period, and almost 20 times faster than applications from white students.\nPreliminary data show that Latinos accounted for 37 percent of in-state applicants to UC for 2017, an all-time high. You are now more likely to find an application to one of UC’s nine undergraduate campuses from a Latino California teen than a white or Asian-American teen.\nThe explosion of Latino applicants to UC campuses\nIn sheer volume, the growth of in-state Latino applications is pretty astounding: from less than 7,000 to more than 40,000 in just two decades.\nAnd while applications from Asian-American and African-American students have kept pace with the overall growth in UC applicants, total applications from white students have barely ticked up.\nThe changing face of UC applicants\nThe changing demographics of UC applicants over the past two decades at least partly reflect the changing demographics of students in California’s K-12 system. In 1997, Latinos and whites each accounted for about 40 percent of California elementary and secondary school students. Now, Latinos make up over half of California K-12 students, while the share of white students has slipped to about one in four.\nOf course, application and admission are two very different things. While last year more Latinos applied to a UC campus than any other ethnic group, they still trailed the much smaller Asian-American population in acceptance rate.","url":"https://calmatters.org/articles/latino-applications-skyrocket-as-record-breaking-tally-applies-to-uc-campuses/"}
