{"authors":["Business Insider Intelligence"],"date_download":"2018-10-31 00:16:15","date_modify":"2018-10-31 00:16:15","date_publish":"2016-12-02 00:00:00","description":null,"filename":"data/vaneerConsumption/LatvianmarketplacelenderTwinoexpandstoRussia.json","image_url":"https://amp.businessinsider.com/images/5841994cba6eb69a018b72a2-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_latvian-marketplace-lender-twino-expands-to-russia-2016-12_1540944975.html","title":"Latvian marketplace lender Twino expands to Russia","title_page":"    Latvian marketplace lender Twino expands to Russia - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nTwino, a Latvian marketplace lender, began listing Russian subprime loans on its website yesterday, according to the Wall Street Journal.\nThe platform also sells loans made to borrowers in Latvia, Georgia, Estonia, Poland, and Denmark.\nIts most recent move may be part of an effort to diversify its revenue streams, as the past year has been a difficult one for marketplace lenders, with many expanding to new territories and products to combat declining or stagnating origination volumes.\nTwino's approach here is not typical of marketplace lenders. As with some other European and US lenders, Twino doesn't pair borrowers and investors, instead it makes loans itself and sells them on to investors via the platform, according to the WSJ. However, its approach to the Russian market differs from the most commonly used market lending scheme in two key ways:\nIt charges very high interest rates. Borrowers in Russia will be charged interest rates in excess of 100%, according to the WSJ. This is far higher than the rates charged by most other European alt lenders, which typically match their rates to those of high street banks. These high interest rates are passed on to investors, which can expect to receive returns of around 14% annually, significantly more than the average rate of around 7% from other European lenders such as Funding Circle.\nA buyback guarantee. The more than 100% rate charged to borrowers creates a margin large enough to allow Twino to guarantee investors in its riskiest loans that the company will pay an investor back if a borrower defaults.","url":"https://www.businessinsider.com/latvian-marketplace-lender-twino-expands-to-russia-2016-12"}
