{"authors":["Kristy Johnson For Daily Mail Australia"],"date_download":"2018-10-23 02:24:10","date_modify":"2018-10-23 02:24:10","date_publish":"2017-03-10 11:31:28","description":"Former Bachelor babe Laurina Fleure, 33, looked sensational as she flaunted her lean figure, alongside new beau Nicholas Agnew, 40, at a VAMFF runway show, in Melbourne on Thursday.","filename":"data/vaneerConsumption/LaurinaFleurecoziesuptoNicholasAgnewatVAMFFshow.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E228CA400000578-0-image-a-84_1489145643268.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300776_Laurina-Fleure-cozies-Prince-Charming_1540261450.html","title":"Laurina Fleure cozies up to Nicholas Agnew at VAMFF show","title_page":"Laurina Fleure cozies up to Nicholas Agnew at VAMFF show | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She confirmed in January this year, that she found love again with Greek businessman Nicholas Agnew.\nAnd former Bachelor star Laurina Fleure looked smitten, as she cosied up to her beau at the Private Liaison's VAMFF runway show, in Melbourne on Thursday.\nThe 33-year-old, who describes the 40-year-old as her 'Prince Charming', flaunted her frame in a pink body-con frock.\nShe's smitten! Former Bachelor babe Laurina Fleure, 33, cosied up to her 'Prince Charming' Nicholas Agnew, 40, at the Private Liaison's VAMFF runway show, in Melbourne on Thursday\nLaurina showed off not only her figure, but her new beau, as she took to the media wall.\nThe skin-tight design of the frock revealed her slimline frame, elongated further with a pair of nude strappy heels.\nStyling her locks in relaxed waves, Laurina pared back her makeup palette with a dewy complexion, defined brows, lashings of mascara and a nude lip.\nHer love: Beau Nicholas cut a low-key figure in a slim-fitting white T-shirt, teamed with distressed skinny leg jeans\nBeau Nicholas cut a low-key figure in a slim-fitting white T-shirt, teamed with distressed skinny leg jeans.\nTaupe suede boots and a statement watch worked as accessories.\nSporting a bronzed complexion, defined brows and a small amount of stubble, Nicholas styled his tresses into a voluminous do.\nFairy tale: 'I asked my friend who is a very high calibre gentleman himself, if he had any handsome friends that might like to take Cinderella to the ball. 'A few days later Prince Charming gave me a call,' Laurina gushed to Daily Mail Australia in early March\nHer Greek Adonis: Nicholas is an accomplished businessman, residing in Melbourne\nLaurina's romance reads just like a fairy tale.\n'After [comedian] Joel Creasey pulled out as my date at the last minute to the Alahna and Madeleine Foundation Stary Stary Night Gala Ball, I needed a date,' she told Daily Mail Australia exclusively, earlier this month.\n'I asked my friend who is a very high calibre gentleman himself, if he had any handsome friends that might like to take Cinderella to the ball.\n'A few days later Prince Charming gave me a call,' Laurina gushed.\nSmitten: Laurina is enjoying a new romance after having confirmed her split from boyfriend of one year Lewis Romano in October\nLaurina confirmed her split from boyfriend of one year Lewis Romano in October.\nSpeaking to Daily Mail Australia at the time, she explained their age gap was a reason for the breakup.\nThe star said: 'We're not together anymore. I haven't actually publicly released it yet. I was hoping to maybe work things out, but it's not possible.'\n'We'll always be friends,' she continued. 'I love him. I had one of the happiest years of my life. We're just on different paths.'\nParted ways: Speaking to Daily Mail Australia at the time, she explained their age gap was a reason for the breakup. 'We're not together anymore. I haven't actually publicly released it yet. I was hoping to maybe work things out, but it's not possible'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300776/Laurina-Fleure-cozies-Prince-Charming.html"}
