{"authors":["Stephanie Downs"],"date_download":"2018-10-31 01:52:09","date_modify":"2018-10-31 01:52:09","date_publish":"2018-09-13 20:55:17","description":"If you know anything about Lauren Conrad, you'd know that she's been a total pop-culture icon ever since she starred on Laguna Beach in 2004. But she wants to let you know that life can get a little messy for her, too. As People reported, Lauren…","filename":"data/vaneerConsumption/LaurenConradDiscussedThePressureOfMakingEverythingInLifeSeemPicturePerfect.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/13/9a56a001-557c-44c9-ae7e-8b9102d639a6-getty-929401780.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_lauren-conrad-discussed-the-pressure-of-making-everything-in-life-seem-picture-perfect-11910645_1540950729.html","title":"Lauren Conrad Discussed The Pressure Of Making Everything In Life Seem Picture-Perfect","title_page":"Lauren Conrad Discussed The Pressure Of Making Everything In Life Seem Picture-Perfect","title_rss":"NULL","source_domain":"bustle.com","text":"If you know anything about Lauren Conrad, you'd know that she's been a total pop-culture icon ever since she starred on Laguna Beach in 2004. But she wants to let you know that life can get a little messy for her, too. As People reported, Lauren Conrad admitted she's not perfect — despite what fans may think based on her social media presence. Basically, she's just super relatable.\nIn a new interview with Redbook Magazine, Conrad revealed that she's tired of one misconception about her in particular. She said,\n\"It's really funny to me when people have this idea that I have things very put together. My life is a bit of a mess, and I don't broadcast that, but I like it that way.\"\nThe former reality star continued to say that while she enjoys posting online about the \"prettier parts of life,\" that's obviously not what her real life looks like.\n“I like to focus on the prettier parts of life, but that doesn’t necessarily represent all of it. I feel bad. There’s such a high standard now to do everything and have it all look picture-perfect,” she said. The fashion designer also said that things really aren't supposed to look as perfect as they might on social media and offered up a great bit of advice in the process. \"You're not going to enjoy the pretty things if you've been up all night doing them. Your life isn't supposed to be Pinterest,\" Conrad explained.\nJohn Sciulli/Getty Images Entertainment/Getty Images\nAt the moment in her self-described messy life, Conrad's family and successful fashion business are two of the biggest things she's focused on. In July 2017, the former Hills star welcomed her first child Liam with her husband William Tell, according to People. As for her business, the LC Lauren Conrad brand for Kohl's is always growing. In her interview with Redbook, Conrad said that she's really into stretch denim after welcoming her son a little over a year ago. And that new interest in jeans helped the fashionista relaunch her denim collection for the retailer.\nOne thing she won't be busy with, though? The newly announced reboot of The Hills, titled The Hills: New Beginnings, which was announced by MTV in August. According to a source at People, Conrad may not make an appearance on the series, but she has nothing but well-wishes for her former castmates. \"She’s in a different place in her life,” the source said. “But she wants everyone to enjoy themselves. She wishes everyone the best.”\nConrad last appeared on the show midway through Season 5 in 2009. Based on what she said after she left, it doesn't seem like she would be totally down for the reboot. According to E! News, Conrad was ready to say goodbye to the TV world, \"I really struggled with leaving because I wasn't happy doing it anymore,\" she said, \"I was ready to start my real life.\"\nShe also said that she was \"glad\" that she made the hard decision to leave even though it was a bit difficult. And now, she truly is focused on her \"real life,\" messiness and all.","url":"https://www.bustle.com/p/lauren-conrad-discussed-the-pressure-of-making-everything-in-life-seem-picture-perfect-11910645"}
