{"authors":["Alanna Bennett"],"date_download":"2018-10-30 23:50:07","date_modify":"2018-10-30 23:50:07","date_publish":"2014-08-13 00:01:44","description":"Reports have surfaced that screen legend and Hollywood icon of the Golden Age Lauren Bacall is dead. She was 89 years old.\nTMZ is reporting that Bacall suffered a major stroke in her home on the morning of Tuesday, Aug 12. Following the death of…","filename":"data/vaneerConsumption/LaurenBacallDiesat89ButtheBigScreenLegendWontBeForgotten.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/ae823679-c7c7-4894-b81c-4dc093b28dbe.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35536-lauren-bacall-dies-at-89-but-the-big-screen-legend-wont-be-forgotten_1540943407.html","title":"Lauren Bacall Dies at 89 But the Big Screen Legend Won't Be Forgotten","title_page":"Lauren Bacall Dies at 89 But the Big Screen Legend Won't Be Forgotten","title_rss":"NULL","source_domain":"bustle.com","text":"Reports have surfaced that screen legend and Hollywood icon of the Golden Age Lauren Bacall is dead. She was 89 years old.\nTMZ is reporting that Bacall suffered a major stroke in her home on the morning of Tuesday, Aug 12. Following the death of comedian and beloved actor Robin Williams of apparent suicide on Aug 11, this marks the second big screen legend the world has lost in two days.\nBacall was a major leading lady of the era of Hollywood known as the Golden Age, starring in roles from comedy (How To Marry A Millionaire alongside Marilyn Monroe), to noir (The Big Sleep, Key Largo), and garnering an Oscar nomination for The Mirror Has Two Faces in 1996.\nLike many whose heyday reigned in that golden era, she spent as much time offscreen with her fellow icons as she did onscreen. In 1945 she married To Have And Have Not co-star Humphrey Bogart; she was 20, he was 45. They stayed together until Bogart's 1957 death, and later on she became one of Frank Sinatra's famous paramours. Now she leave behind three children — two from her marriage to Bogart and one from her eight year marriage to Jason Robards, Jr.\nBacall was also good friends with Katharine Hepburn, and it was a friendship she wrote about in her autobiography By Myself And Then Some . She wrote that \"although there is a large, empty space in my life without her, there is all that past to remember.\" Now that Bacall has passed it's suitable to remember that she, too, has left plenty to be remembered.\nIn honor of this passed icon, here is one of her most famous moments, from her breakout role in To Have And Have Not in 1944. \"You know how to whistle, don't you Steve? You just put your lips together and blow.\"","url":"https://www.bustle.com/articles/35536-lauren-bacall-dies-at-89-but-the-big-screen-legend-wont-be-forgotten"}
