{"authors":["Julia Pritchard For Mailonline"],"date_download":"2018-10-23 04:15:43","date_modify":"2018-10-23 04:15:43","date_publish":"2017-03-10 14:23:43","description":"The TOWIE star, 30, retaliated by penning a rant towards the girl , which branded her 'average' and 'hungry for the limelight'.","filename":"data/vaneerConsumption/LaurenGoodgerhitsoutafterInstagramdrama.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E233EAD00000578-0-image-a-197_1489155195138.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301438_Lauren-Goodger-hits-Instagram-drama_1540268143.html","title":"Lauren Goodger hits out after Instagram drama","title_page":"Lauren Goodger hits out after Instagram drama | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was called out last week for accidentally liking a random girl's photo from her boyfriend Joey Morrison's Instagram account.\nBut Lauren Goodger has lashed out at the beauty in a scathing Instagram post of her own - which has since been deleted.\nAfter the user accused Lauren of snooping her social media account in New! magazine, the former TOWIE star, 30, retaliated by penning a rant towards the girl on social media, which branded her 'average' looking and 'hungry for the limelight'.\nScroll down for video\nFighting talk: Lauren Goodger has hit out at Instagram user who accused of her snooping her page, after she accidentally liked her photo from her boyfriend Joey Morrison's account\nThe drama began earlier this month, when the user in question, Karis Butler, took to Twitter to reveal that one of her photos had been liked by Joey Morrison's Instagram account at 4:40am.\nHowever, Lauren has set up her boyfriend with the account and runs it while he is serving his time in prison, implying she had been the one to engage in the interaction.\nLater bringing up the incident with New!, Karis admitted she had found the thought of Lauren looking through her social media later at night unsettling.\nStrange: The drama began when the user in question, Karis Butler, took to Twitter to reveal that one of her photos had been liked by Joey Morrison's Instagram account at 4:40am\nShe explained: 'I have no idea why, out of all the girls who followed him, she went through my pictures and liked one at 4.40am. It's kind of a strange time.'\nNot having any of it however, Lauren then took to her own social media to lash out at Karis following her comments in a scathing rant - which has since been deleted.\nReplying to another user about the saga, the brunette admitted that her jailbird beau Joey had found the whole story ridiculous.\nShe said: 'Joey gets the magazines inside every week and got today and rang me laughing about the story tbh.\nNot having it: Lauren then took to her own social media to lash out at Karis following her comments in a scathing rant - which branded her 'average' looking and 'hungry for limelight'\n'He even said they have used really bad pics of me and used 'stunning' pics of this girl and laughed.'\nGoing on to even slam the girl's appearance in light of her social media faux-pas, she continued: 'So sad they would entertain such a pathetic story about a like of a pic and even Joey said to me, if he was home after 7 and a half years inside, hes 'jail goggles' wouldn't even class the girl as average.'\nBefore adding: '*He's words BTW** (sic)'\nClearly riled up by the girl's words, Lauren finished her statement by accusing her of using the mere Instagram to gain attention in the media.\nNothing on you babe: Lauren said of Joey's side of the story: 'Even Joey said to me, if he was home after 7 and a half years inside, hes 'jail goggles' wouldn't even class the girl as average'\nShe said in her usual feisty manner: 'So sad and hungry for limelight over a like on a picture…now it's me talking.\n'Well done girl, you got some media attention you be asking for appearance fees next and a Big Brother deal…so sad.'\nThe saga only adds to a week of social media blunders for Lauren, who was also caught sharing a message from a PR alongside a throwback snap she had seemingly been told to post.\nAwkwardly sharing the message straight from her team, she captioned a snap of her in front of a sprawling yacht: 'can you Instagram…thanks to Kevin and the team at @xlusiveyachts for a great time. Lovely to meet you guys. #holiday #break#abroad #2017 #sun #yachtlife.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301438/Lauren-Goodger-hits-Instagram-drama.html"}
