{"authors":["Jessica Chia For Mailonline"],"date_download":"2018-10-23 01:23:40","date_modify":"2018-10-23 01:23:40","date_publish":"2016-01-11 12:16:14","description":"Two men, compared to slapstick comedy duo Laurel and Hardy, are caught on film bungling their estate agents break-in as they desperately try to tug the doors open after business hours.","filename":"data/vaneerConsumption/LaurelandHardyburglarsarecaughtonCCTVrunningintoeachotherinBasildon.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3008E5E800000578-0-image-a-28_1452513524765.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393795_Laurel-Hardy-burglars-caught-CCTV-panicking-running-fleeing-estate-agents-handed_1540257820.html","title":"'Laurel and Hardy' burglars are caught on CCTV running into each other in Basildon","title_page":"'Laurel and Hardy' burglars are caught on CCTV running into each other in Basildon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A pair of bungling burglars were caught on CCTV struggling to break into an estate agents before setting off the alarm, bumping into each other and then fleeing empty-handed.\nThe two hooded men can be seen tugging at the door handles of Kingswood Estate Agents in Basildon, Essex after business hours.\nThey spend more time trying to get past the front door than they did inside the building.\nThey finally crawl into the shop front after one of the men kicks his foot through a glass panel in the door.\nTwo bungling burglars panic after setting off the alarm of an estate agents they tried to break into\nWithin seconds, the security alarm sounds and the pair, compared to slapstick comedy duo Laurel and Hardy, panic.\nOne man decides to turn back and collides with his accomplice before the two tiptoe back towards the front door and crawl out.\nRichard Frost, a director at the estate agents, said: 'We came to work the next day and saw the glass everywhere.\n'It seemed a bit stupid targeting here. There's nothing in here worth stealing apart from a few pens. We take everything away at night.\n'We checked the CCTV and it looked like the alarm went off and that seems to be what panicked them.\n'They literally came in and after about 15 seconds, they got scared and left.\n'They looked a bit like Laurel and Hardy bumping into each other.'\nRepairs to the damaged door will cost about £300.\nAn Essex Police spokesman said: 'Intruders forced the front door and attempted to open an\ninside door but failed.'\nAn investigation is ongoing.\nThey initially struggle to break in and try tugging at the door handles after business hours\nThe pair finally crawl in after one of the men kick through the glass panel in the front door","url":"https://www.dailymail.co.uk/news/article-3393795/Laurel-Hardy-burglars-caught-CCTV-panicking-running-fleeing-estate-agents-handed.html"}
