{"authors":[],"date_download":"2018-10-22 22:25:40","date_modify":"2018-10-22 22:25:40","date_publish":"2017-04-09 00:00:00","description":"Kipnis, a professor at Northwestern, argues that Title IX investigations of sexual misconduct on campus are vastly overexpanded, to the point of chilling intellectual freedom and academic debate.","filename":"data/vaneerConsumption/LauraKipnisTacklesCampusSexualPoliticsInUnwantedAdvances.json","image_url":"https://media.npr.org/assets/img/2017/04/06/2017-04-06-if-this-is-feminism-mcarrasquero-001_wide-8a0356f5f47a7c1f30ab6ffaf471581963fc4912.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=522909041_1540247140.html","title":"Laura Kipnis Tackles Campus Sexual Politics In 'Unwanted Advances'","title_page":"Laura Kipnis Tackles Campus Sexual Politics In 'Unwanted Advances' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"LOURDES GARCIA-NAVARRO, HOST:\nA few years ago, Laura Kipnis, a tenured professor at Northwestern, published an essay in The Chronicle of Higher Education. In it, she argued that the rules governing sexual relationships between students and professors had become draconian. It made a lot of people angry and uncomfortable, and two graduate students brought it up on a Title IX violation for having written the article. She was ultimately cleared in the investigation, but Professor Kipnis has more to say about that experience. Her new book is called \"Unwanted Advances: Sexual Paranoia Comes To Campus.\" She joins us today from our studios in New York. Welcome.\nLAURA KIPNIS: Hi.\nGARCIA-NAVARRO: Let's talk a little bit about Title IX. The law is conceived as a way to protect and support women. It's a federal law. Universities can have their funding taken away if they don't do enough to address complaints. You are a self-described feminist. Where do you think the law is wrong in your case and more broadly?\nKIPNIS: Well, what happened was that Title IX, which started out, you know, as something about equity for things like women's sports, was expanded in 2011 to include sexual harassment or creating, like, a hostile environment on campus. You know, very vague sorts of things can now be charged under Title IX. So since then, because they didn't really specify how campuses should do this, there's just an incredible amount of overreach because all the campuses are afraid of losing their federal funding and also being seen on soft - as soft on sexual assault. And, you know, there certainly is a sexual assault problem, but whether that should be handled...\nGARCIA-NAVARRO: I was about to say, I mean, that's clearly an issue on campuses.\nKIPNIS: It is an issue, but it's a question about whether it's more of an issue now or whether what's being defined as sexual assault is actually being expanded. And so there are a lot of cases where you have unwanted sex or ambiguous sex being labeled after the fact as sexual assault or even consent being withdrawn after the fact, sometimes even years after the fact. And I wrote about a case like that in the book.\nGARCIA-NAVARRO: So you've written this book now after everything that you've gone through. What do you feel that you needed to say more about this issue?\nKIPNIS: Well, I was in, like, an advantageous situation because I have tenure at a research university. But what happened was after I wrote about my Title IX, it was - the piece was called \"My Title IX Inquisition,\" I was just deluged with letters and emails from people all over the country that had been through similar procedures, not for an essay but for all manner of other things, including things like making eye contact that somebody else didn't like or telling a joke at an off-campus bar that somebody thought was overly sexual. So, you know, I had just all of this information that's just not public. And people have been charged or afraid of coming forward because they can be charged with more crimes if they go public, and the same thing in my case. I could have been charged with more retaliation complaints by going public. So I did feel there needs to be more transparency around this process and more of a public discussion about how Title IX is being used.\nGARCIA-NAVARRO: I'd like to sort of get at the heart of the book, which is about power dynamics and sexual dynamics. And you tell an anecdote in your book about a female grad student who at a public gathering found both of her knees being groped under the table, one by a fellow student, the other by a male professor. And you are critical of her. You write, quote, \"how can it be after 50 or so years of second-wave feminism, a grad student, a feminist can't bring herself to say to a man get your hand off my knee.\" Is that an oversimplification of a problem that's existed long before second-wave feminism?\nKIPNIS: Well, I think you're slightly oversimplifying me because I'm not so much critical of the student as critical of the forms of education or the failures of education that we're providing for women students. And I think what's happening is that this notion of power and male power are being regarded as so untouchable, unapproachable, that, I mean, if a woman student thinks she can't say get your hand off my knee in a bar, we are failing to educate these students.\nGARCIA-NAVARRO: Is it education, though? Isn't it about power? I mean, I can imagine a young man in that situation and a professor who has the power to - over that person's academic future and grades feeling equally paralyzed and unable to vocalize their rejection of that, no?\nKIPNIS: The thing is power is a reality in the world, and there are hierarchies and there are differentials of power. And we do have to train people, especially women, in how to confront those in real time as opposed to after the fact. And, you know, as a professor, I can tell you there are actually limits to the amount of power you have over students. It's not some vast, unchecked, you know, power to do what you want with someone's life and career. I mean, there are all sorts of checks on that sort of thing in universities, particularly now. And it's professors who whose careers can be ruined by complaints against them.\nGARCIA-NAVARRO: So I'm curious, what would be your prescription for this? How do you do that? How do you train, as you say, young people to deal with this?\nKIPNIS: Well, one of the things I say - and I'm not so much of a policy wonk, but I think women should be taught self-defense, physical self-defense. I think it changes your sense of yourself, your sense of agency, your ability to feel capable of dealing with situations where you are possibly threatened. So I'd start there, and I think we need to have honest discussions about such things as drinking and the amount of binge drinking that's going on. And, you know, that's not slut shaming, and it's not blaming the victim, but it is saying, women, we have to take responsibility for our bodies, not just leave it up to administrators and regulators and not just leave it up to men to change because what if they don't?\nGARCIA-NAVARRO: Laura Kipnis's book is called \"Unwanted Advances: Sexual Paranoia Comes To Campus.\" Thanks so much for joining us.\nKIPNIS: Thank you, Lulu.\nCopyright © 2017 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=522909041"}
