{"authors":["William Bigelow"],"date_download":"2018-10-30 21:09:17","date_modify":"2018-10-30 21:09:17","date_publish":"2015-03-24 17:41:53","description":"Parents and students from Revere Charter Middle School and Magnet Center in Los Angeles have launched a petition to restore a teacher to his job after the 29-year-veteran was suspended by the Los Angeles Unified School District (LAUSD) for allegedly using racial terms in class. The petition had neared 800 signatures by Monday morning.In addition, the students held a rally on Monday at the school. |","filename":"data/vaneerConsumption/LAUSDTeacherSuedforUsingNWordinClassinHistoricContext.json","image_url":"https://media.breitbart.com/media/2015/01/lincoln-memorial-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_03_24__1540933757.html","title":"LAUSD Teacher Sued for Using 'N-Word' in Class in Historic Context","title_page":"LAUSD Teacher Sued for Using 'N-Word' in Class in Historic Context | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Parents and students from Revere Charter Middle School and Magnet Center in Los Angeles have launched a petition to restore a teacher to his job after the 29-year-veteran was suspended by the Los Angeles Unified School District (LAUSD) for allegedly using racial terms in class. The petition had neared 800 signatures by Monday morning.In addition, the students held a rally on Monday at the school.\nThe LAUSD suspended Steven Carnine, 64, after a lawsuit was filed on March 18 by a student identified as Maggie B. She joined Carmine’s 8th grade honors history class the second week of January and claimed that Carmine said Michael Brown, who was killed in Ferguson, MO, “got what he deserved.” She also claims that Carnine pointed out that President Abraham Lincoln had been termed a “n-lover” by his enemies, according to he Los Angeles Times. The lawsuit states that the girl’s father complained and the school district did not act in response.\nThe LAUSD is conducting an internal investigation. The district stated, “District policy is adamant that all students are to be treated with respect. The safety of students is L.A. Unified’s highest priority.”\nCarnine’s students said he has inspired them and uses primary historical resources, which may contain offensive language, in order to show them history accurately.\nAfter the rally Monday, the principal held an assembly to allow protestors to confront district officials, but 8th-grader Will Elander, who was in Carnine’s class last year, told the Times there were few questions. He added, “This teacher is really knowledgeable in his field, really experienced. He really gets kids. I had him. Both of my sisters had him. He’s really caring and he really means well.”\nElander’s mother told the Times that she had discussed the matter with other parents. She concluded, “The students were talking about Abe Lincoln and the n-word. The n-word was spoken in class. They talked about how racism developed. He didn’t use the word against anyone in class. He was covering material in the syllabus for a U.S. history course.”\nAnother mother defended Carnine, saying, “My child was one of the 36 students in the class at the time when these accusations were made, and they are all false,” according to CBS Los Angeles. A third parent asserted, “One of the greatest teachers in the LAUSD has been unfairly maligned.”\nA student in the class, “Katie T,” wrote on the petition, “Mr. Carnine discussed how many people didn’t not like Lincoln, because they claimed he was an n-lover. He did not even use the word; he spelt it out and said, ‘excuse my language, I really do not like using this word, but this is how harshly the African American people were treated.’ Mr. Carnine also said he was completely against the word, but he was trying to teach us about the harshness of slavery before the civil war. It was important to learn about how harsh it really was in order to understand this history better. He did not want to ‘sugar coat’ it to us, like many other teachers tend to do.”","url":"https://www.breitbart.com/local/2015/03/24/lausd-teacher-sued-for-using-n-word-in-class-in-historic-context/"}
