{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:06:10","date_modify":"2018-10-30 19:06:10","date_publish":"2015-05-14 12:07:57","description":"Crowds of activists from both sides of the ferocious illegal immigration debate clashed in a war of words directed at the L.A. County Board of Supervisors as the elected officials voted 3-2 Tuesday to kill the 287(g) program that allows U.S. Customs and Immigration Enforcement (ICE) agents inside county jails in order to review inmates for legal status and potential deportation prior to release. |","filename":"data/vaneerConsumption/LAVotesICEEnforcementOutofCountyJailObamaSystemIn.json","image_url":"https://media.breitbart.com/media/2015/04/ICE-Officers-Apprehend-Mexican-Fugitive-Immigration-and-Customs-Enforcement.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_05_14__1540926370.html","title":"L.A. Votes ICE Enforcement Out of County Jail, Obama System In","title_page":"L.A. Votes ICE Enforcement Out of County Jail, Obama System In | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Crowds of activists from both sides of the ferocious illegal immigration debate clashed in a war of words directed at the L.A. County Board of Supervisors as the elected officials voted 3-2 Tuesday to kill the 287(g) program that allows U.S. Customs and Immigration Enforcement (ICE) agents inside county jails in order to review inmates for legal status and potential deportation prior to release.\nDirectly after the 287(g) vote came a 4-1 vote to adopt a new jail initiative involving the Obama administration’s preferred alternative, the Priority Enforcement Program (PEP). President Barack Obama announced the PEP initiative in a speech along with his executive action on immigration last November. A judicial ruling has temporarily stayed implementation of Obama’s executive actions.\nSupervisors Hilda L. Solis and Mark Ridley-Thomas introduced the resolution to end the long running program. Solis and Thomas’ motion criticized the coordination between Sheriff’s deputies and ICE agents. the Los Angeles Daily News reported. Ending the program means removing ICE officials from inmate reception at the Twin Towers Correctional Facility.\nAmnesty advocates have criticized the program harshly, calling it racial profiling and claiming that it erodes “immigrants’” trust in police.\nThose standing in favor of the 287(g) program cited numerous instances where dangerous illegal alien criminals have been released into the populous just before committing deadly crimes.\nThe L.A. County Sheriff will only be allowed to inform ICE officials of the release of very serious criminals, said Solis, according to the Los Angeles Times.\nImmigration officials have expressed frustration over not receiving information on the release illegal alien criminals. They have however, already altered enforcement priorities to focus on illegal aliens who have committed an additional crime.\nLocal authorities have rejected 4,230 of 58,500 ICE requests for citizenship status, the Times reports.\nAhead of the vote, a representative for Michael Antonovich conveyed the Supervisor’s strong support for the 287(g) program “as a strong public safety measure,” the Daily News reported.\nJamiel Shaw is the father of a young man shot and killed by a repeat violent offender illegal alien. The known gang member set out upon his release to kill a black person and succeeded with the death of Shaw’s son just 28 hours after his release from the L.A. County jail. “When you say this is a victimless crime, it is not,” Shaw said regarding illegal immigration. “We are Americans, we deserve the American dream…you don’t work for illegal aliens, you work for Americans.”\nIn February, Shaw testified before the Congressional Oversight and Government Reform Committee asking, “Do black lives really matter? Or does it matter only if you are shot by a white person or a while police man?”\nAdditional family members of Americans killed by illegal aliens were present to give account in support of continuing the 287(g) program. Many were from the “Remembrance Project” group.\nNumerous amnesty advocates from community organizations around the region provided statements as well.\nA representative from the Coalition for Humane Immigrant Rights of Los Angeles (CHIRLO) by the name Morales called on the Board to end 287(g), saying the action was “closing a dark chapter in U.S.” history.\nEmmanuel Nunez, identifying with the North East Los Angeles Alliance, called for awareness to displacement of working class residents and to remove 287(g).\nAnna Bryant, identifying with the L.A. Voice Congregation, commended Solis and Thomas for their “leadership in taking this important step of eliminating 287g and removing ICE from our jails.”\nJessica Bansal, with the National Day Labor Organizing Network, called the end of 287(g) overdue. Bansal’s group joined with the ACLU to take legal action against the county on behalf of Diego Rojas according to the Daily News. Later found to be a U.S. citizen, Rojas complained that he had been detained after posting bail while his legal status was determined.\nThe move comes following an effort last October to remove the program. At the time, the board voted unanimously 3-0 to continue the 287(g) program for another two years, with Supervisor Ridley-Thomas abstaining. The Los Angeles Times reported that “immigrant advocates” jeered and shouted, “Molina deports!” They then turned their backs on the county board for over an hour in protest.\nSince last October, Supervisors Solis and Sheila Kuehl won election to the board after including anti-287(g) messages in their campaigns.\nThe board voted unanimously in 2010 to continue the program–a vote that included Ridley-Thomas.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/05/14/la-county-supervisors-vote-ice-enforcement-out-of-county-jail-obama-system-in/"}
