{"authors":[],"date_download":"2018-10-30 18:24:33","date_modify":"2018-10-30 18:24:33","date_publish":"2017-02-20 23:07:00","description":"Legislators representing DeKalb County are considering whether to raise sales taxes for roads, public safety and MARTA","filename":"data/vaneerConsumption/LawmakersatoddsoverDeKalbtaxincrease.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/20/Images/2-20-17%20dek%20delegation.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_l_a9c66ec5e7cc269e0614c5452b7cdcb8__1540923873.html","title":"Lawmakers at odds over DeKalb tax increase","title_page":"DeKalb County sales tax for roads and infrastructure debated","title_rss":"NULL","source_domain":"ajc.com","text":"State legislators debated Monday whether to raise sales taxes in DeKalb County, mostly to pay for repairs of crumbling roads, but they were divided over several competing proposals.\nBoth Democrats and Republicans generally support a 1-cent sales tax increase, from 7 percent to 8 percent, to fund road repaving, police stations and fire stations.\nLawmakers disagree on whether money from the sales tax should also be used for other infrastructure, like construction of a government center. They’re also at odds over related tax proposals, including an additional sales tax for MARTA expansion and a tax break for homeowners.\nMany Democrats, who control all but three of the 23 legislative seats from DeKalb, prefer a broad special purpose local option sales tax (SPLOST) that isn’t limited to transportation and public safety.\nSome also want to curtail the homeowners’ tax break, known as the frozen exemption, which gives residents a discount on county property taxes to offset increases that occur when their properties gain value. Voters overwhelmingly approved renewing the frozen exemption in November, but legislators are warning that the county government may eventually raise tax rates to compensate.\nRepublicans, who hold a majority in the Georgia General Assembly, say they’ll agree to the sales tax increase, but only if the frozen exemption remains in place and a tax hike for MARTA is taken off the table.\nSen. Fran Millar, R-Atlanta, said the county needs much more than the $2 million generated annually from existing sales taxes for infrastructure, but not at the cost of sacrificing the property tax exemption.\n“Some of us can't live with that,” Millar said. “I'm not saying that in a threatening matter. I'm just making a statement of fact.”\nDeKalb has a 400-mile backlog of roads in need of repaving, which would cost about $162 million. Additional transportation projects like sidewalks, traffic signals and trails costs another $55 million.\nPublic safety facilities come with a price tag of $24 million to $58 million. Between $174 million and $235 million would be distributed to city governments.\nIn all, a SPLOST could raise about $100 million annually over five or six years.\nDeKalb CEO Mike Thurmond called for legislators to seek a compromise.\n“Nobody gets everything they want. That's just not how the game gets played,” Thurmond said.\nThurmond has sought an exemption for food and prescription drugs in any sales tax, a request that Millar included in his proposed tax legislation.\nRep. Howard Mosby, D-Atlanta, said he wants a meeting with Thurmond and the leaders of DeKalb’s delegation.\n“Time is of the essence,” he said. “We don’t need to be sitting around on this.”\nIf lawmakers agree on a SPLOST before the end of this year’s legislative session March 30, it could go on the ballot for voters’ consideration in a November referendum.","url":"https://www.ajc.com/news/local-govt--politics/lawmakers-odds-over-dekalb-tax-increase/c7L3mPGlSt7Aik4JbvrkeM/"}
