{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:10:28","date_modify":"2018-10-31 00:10:28","date_publish":"2016-01-20 08:00:00","description":"Is it safe for children to play on fields made of ground up old tires? Recycled tires on California parks The California Department of Resources Recycling","filename":"data/vaneerConsumption/Lawmakersrejectbillsaimedatartificialturf.json","image_url":"https://calmatters.org/wp-content/uploads/crumb_rubber.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944628.html","title":"Lawmakers reject bills aimed at artificial turf","title_page":"Lawmakers reject bills aimed at artificial turf | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Is it safe for children to play on fields made of ground up old tires?\nRecycled tires on California parks The California Department of Resources Recycling and Recovery gives grants to communities that use products made of recycled tires in their construction projects. Here are a few that won grants for using the substance known as “crumb rubber”: San Francisco Bay Area: The City of Dublin was awarded $99,445 in 2015 to use crumb rubber on a synthetic turf soccer field at Fallon Sports Park. The City of Fremont was awarded $150,000 in 2014 to put rubber surface on nine playgrounds and convert two grass soccer fields to synthetic turf. The City of San Pablo was awarded $125,064 in 2012 to provide rubber infill for artificial turf fields at Rumrill Sports Park. Los Angeles County: The City of Glendora was awarded $149,700 in 2012 to replace natural turf with artificial turf on the soccer field at Louie Pompei Memorial Sports Park.\nThat’s a question California scientists are studying in the wake of alarming media reports that featured cancer-stricken soccer players describing years of diving into artificial turf made of recycled tires.\nThe substance known as “crumb rubber” has made its way onto thousands of California schools and parks, where it helps cushion falls and conserve water. It’s formed into mats on playgrounds and ground up into granules that cover fields of synthetic grass.\nOne reason so many play spaces are made of crumb rubber is that the state gives away money to encourage its use. To keep some tires out of landfills, California’s recycling department has given $42 million in grants since 2005 to communities that use materials made from old tires.\nNo research has proven a link between cancer and exposure to crumb rubber. But given recent questions about its potential health risks, Sen. Jerry Hill (D-San Mateo) said he thinks California ought to hit pause. Yet the Legislature has rejected his attempts for two years in a row, with labor and business interests prevailing over the concerns of parents and health advocates.\nOrganized labor is often a powerful force in the Democratic-controlled Legislature, and the unions that opposed the crumb rubber bill are big political spenders with influential lobbyists. The International Union of Painters and Allied Trades (which includes artificial turf installers) has poured at least $1.2 million into California campaigns over the last five years, while the State Building and Construction Trades Council has spent $5.3 million.\nBoth unions reported giving donations to Sen. Tony Mendoza (D-Artesia) and Sen. Marty Block (D-San Diego), the two Democrats who helped defeat a bill this month that would have required communities planning new play areas made of crumb rubber to publicly discuss using alternative materials. The bill was a watered down version of one that stalled last year that would have prohibited the state’s recycling department from handing out grants for using crumb rubber while state health officials study potential health risks. The study is expected to be completed in June 2018.\n“On the one hand the state is providing schools and local governments with millions of dollars in grants to reduce the cost of fields made from used tires. Yet on the other hand, the state is studying this material to determine potential health impacts,” Hill said as he presented his Senate Bill 47 to the education committee.\n“Since we’re talking about the health of our children, I think it makes sense for schools to do their research.”\nThe California Department of Resources Recycling and Recovery didn’t take a position on the bill, but a spokesman said it’s demonstrated its commitment to protecting human health by paying $3 million for the health study.\nEnvironmental health advocates testified in favor of Hill’s bill, in addition to a self-proclaimed “soccer mom.”\n“After our children play on these fields, they blow their nose and it comes out black,” said Kathleen McCowin, who was arrested in 2014 for blocking trucks installing fake turf in San Francisco.\nBut tire recyclers, school construction groups and labor unions that lobbied against the tougher version of the bill last year returned to the Capitol to say they remain opposed. They argued it was scientifically unwarranted and would eliminate jobs.\nMaking communities discuss alternative materials – such as cork, coconut fibers or rice husks – would “chill the entire industry,” Mike West, communications director for the International Union of Painters and Allied Trades, said after the bill was defeated.\n“We stand to lose if under public discussion the community would say, ‘We want to retain the grass we have, we’re scared of turf products altogether because we’re being forced to have this conversation,’ ” West said.\n“If it’s natural turf or grass, then we don’t pick up that work.”\nThe union supports the state study that is under way, he said, but opposes making any changes until it’s complete.\nThat message was largely echoed by Senator Mendoza, who skipped the hearing but popped in at the last minute to vote “no.” After a labor lobbyist thanked him in the hallway, Mendoza said he voted against the bill because it was premature.\n“It was necessary for us to hold off a little bit more to make sure we get as much information as possible,” Mendoza said. “I want to make sure it’s conclusive, and it’s not there yet.”\nSenator Block, the other Democrat who helped defeat the bill, also skipped the hearing but showed up at the final vote. He said his position was influenced by opposition from the California School Boards Association.\n“The bill was an unnecessary impingement on local control in our school districts,” Block said. “We don’t need more mandates.”\nThe school boards association did not testify at the hearing and declined to comment for this story.\nCalifornia’s largest school district, Los Angeles Unified, removed crumb rubber from its preschool grounds in 2008, citing an advisory about lead content from the federal Centers for Disease Control and Prevention and a desire to act out of what the district called “an abundance of caution.” In 2009, the district stopped using crumb rubber in all new construction.\nIndustry representatives say the product is safe. But the federal Environmental Protection Agency says existing studies “do not comprehensively address new questions and concerns about children’s health risks” from playing on crumb rubber fields. The agency is working with California health investigators on the study now under way.","url":"https://calmatters.org/articles/lawmakers-reject-bills-aimed-at-artificial-turf/"}
