{"authors":[],"date_download":"2018-10-30 20:31:17","date_modify":"2018-10-30 20:31:17","date_publish":"2015-03-18 22:42:36","description":"Voters could decide themselves to raise local sales taxes to pay for transportation projects under a proposal unveiled Wednesday in the state Senate.","filename":"data/vaneerConsumption/Lawmakersconsiderrevampingtransportationsalestaxforlocals.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/03/05/Images/photos.medleyphoto.6866531.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_e42bc6e4681de64ec5bf881296569ce4__1540931477.html","title":"Lawmakers consider revamping transportation sales tax for locals","title_page":"Lawmakers consider revamping transportation sales tax for locals","title_rss":"NULL","source_domain":"ajc.com","text":"Voters could decide themselves to raise local sales taxes to pay for transportation projects under a proposal unveiled Wednesday in the state Senate.\nThe measure, however, has several key differences from the state’s 10-year, 1 percent regional transportation sales tax currently used in some areas. For starters, it would let local governments initiate the process of setting up a vote on the tax. It would give counties the option of going it alone if a regional consensus cannot be reached. And it could cost a fraction of a penny, rather than the whole coin as currently constructed.\nThe rewritten House Bill 106 would be an addendum to lawmakers’ efforts over the past 10 weeks to find $1 billion for the state’s roads and bridges.\n“What this would do is let locals raise a good deal of money for their own projects,” said Senate Transportation Committee Chairman Tommie Williams, R-Lyons. “It could actually help solve some of the congestion issues.”\nWilliams’ committee approved the new version of HB 106 on Wednesday.\nLawmakers five years ago first allowed what they dubbed T-SPLOST: a special purpose local option sales tax for transportation. They divided the state into 12 regions. Officials in each region then had to work together on a projects list to be put before voters.\nThe effort failed in nine of the 12 regions, grouping too many disparate counties with too many different needs. That was especially true in metro Atlanta, where the vote involved 10 counties and failed by 62 percent.\nThis time, Williams would first let a majority of county commissions within those same regions decide to try again. If they didn’t by January 2017, each of Georgia’s 159 counties could decide for themselves on a county-by-county basis.\nAnother difference: The proposed sales tax could be less than 1 percent. The law today mandates a 1 percent increase only.\nDespite voters’ rejection of the T-SPLOST in many regions in 2012, public sentiment toward local transportation sales taxes may be shifting. Especially when they are tailored to a single jurisdiction’s needs.\nLast year, Forsyth County embraced a $200 million bond referendum. Clayton County residents have voted to pay a 1 percent sales tax to join MARTA. Atlanta residents Tuesday approved a $250 million infrastructure bond referendum to fix roads, bridges and sidewalks.\nGiving locals more power pleased the state’s business community, and some local leaders — but not all.\n“We have been supportive of a local option to meet needs that are focused on a particular region or county,” said Seth Millican, with the Georgia Chamber of Commerce.\nCounties said the idea provides more local control and flexibility. They cautioned, however, that “voters still have to like it and like the projects,” said Shaun Adams, with the Association of County Commissioners of Georgia.\n“It’s a tool, it’s not a solution,” Adams said.\nA representative for Georgia cities, meanwhile, said the bill gives counties too much power to choose projects.\n“In many cases in this state, the revenues from sales taxes are generated in the economic hubs, which are the cities,” said Tom Gehl, with the Georgia Municipal Association. “Yet this proposal would allow revenue to be generated in these hubs with no guarantee that the congestion needs in those hubs would be met by this sales tax.”","url":"https://www.ajc.com/news/state--regional-govt--politics/lawmakers-consider-revamping-transportation-sales-tax-for-locals/ioL30A9A6jpvDOPLQE7mlJ/"}
