{"authors":["Associated Press"],"date_download":"2018-10-22 23:41:45","date_modify":"2018-10-22 23:41:45","date_publish":"2017-04-26 08:30:22","description":"WASHINGTON (AP) - President Donald Trump's former national security adviser, Michael Flynn, appeared to violate federal law when he failed to seek permission...","filename":"data/vaneerConsumption/LawmakersFormerTrumpaideFlynnmayhavebrokenUSlaw.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/08/wire-463899-1493191828-499_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446630_Lawmakers--Former-Trump-aide-Flynn-broken-US-law_1540251705.html","title":"Lawmakers: Former Trump aide Flynn may have broken US law","title_page":"Lawmakers:  Former Trump aide Flynn may have broken US law | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - President Donald Trump's former national security adviser, Michael Flynn, appeared to violate federal law when he failed to seek permission or inform the U.S. government about accepting tens of thousands of dollars from Russian organizations after a trip there in 2015, leaders of a House oversight committee say.\nThe congressmen also raised new questions about fees Flynn received as part of $530,000 in consulting work his company performed for a businessman tied to Turkey's government.\nThe bipartisan accusations that Flynn may have broken the law come as his foreign contacts are being examined by other congressional committees as part of investigations into Russian meddling in the 2016 election and potential ties between Trump associates and the Kremlin. Congress returned earlier this week from its spring recess, and Tuesday's announcements reflected renewed interest on Capitol Hill.\nFILE - In this Feb. 1, 2017 file photo, then-National Security Adviser Michael Flynn speaks during the daily news briefing at the White House, in Washington. The White House is refusing to provide lawmakers with information and documents related to President Donald Trump's first national security adviser's security clearance and payments from organizations tied to the Russian and Turkish governments. (AP Photo/Carolyn Kaster)\nReps. Jason Chaffetz, R-Utah, and Elijah Cummings, D-Md., said they saw no evidence that Flynn, a retired Army lieutenant general, properly disclosed foreign payments he received to military officials or on his security clearance paperwork. Flynn, who headed the military's top intelligence agency, was Trump's national security adviser until he was fired in February.\nAmong the payments in question was more than $33,000 that Flynn received in 2015 from the Russia Today television network, which has been described by U.S. intelligence officials as a propaganda front for Russia's government.\n\"That money needs to be recovered,\" said Chaffetz, chairman of the House Committee on Oversight and Government Reform.\nChaffetz said Flynn was obligated as a retired Army officer to request permission from both the Defense and State departments about prospective foreign government payments before he received them. \"There was nothing in the data to show that Gen. Flynn complied with the law,\" Chaffetz said.\nCummings said Flynn's failure to formally report the Russian payments on his security clearance paperwork amounted to concealment of the money, which could be prosecuted as a felony.\nFlynn's attorney, Robert Kelner, said Flynn reported his plans to travel to Russia to his former agency, the Defense Intelligence Agency, and he briefed officials there after he returned. Kelner declined to answer questions about whether Flynn properly disclosed the payments.\nThe congressmen spoke after reviewing classified documents regarding Flynn that were provided by the Defense Intelligence Agency. They were also briefed by agency officials. The congressmen declined to describe in detail the materials they reviewed. But Cummings said the documents were \"extremely troubling\" and he urged the administration to declassify them.\nChaffetz and Cummings said they planned to write to the comptroller of the Army and the Defense Department's inspector general for a final determination as to whether Flynn broke the law and whether the government needs to pursue criminal charges and seek to recover the payments Flynn received.\nCummings also criticized the White House for refusing to turn over documents the committee requested about Flynn's foreign contacts during his three-week stint as national security adviser. In response to a letter to White House Chief of Staff Reince Priebus, an administration official told the committee that documents relating to those contacts likely contained classified and other sensitive information, weren't relevant to the committee's investigation and could not be turned over.\n\"That is simply unacceptable,\" Cummings said.\nAt the White House, Press Secretary Sean Spicer said the committee's request for Flynn's security clearance information was referred to the Defense Department, which turned over documents. He said the White House did not release a detailed list of Flynn's contacts with foreign officials, a request he dismissed as \"outlandish.\"\nSpicer said that the president was confident in his decision to fire Flynn in February on grounds that Flynn had misled the vice president about a conversation he had with the Russian ambassador to the U.S. during the transition. Spicer declined to say whether the White House believed Flynn had violated the law. He said the conduct occurred before Flynn was appointed national security adviser in January.\nFlynn had led the DIA until 2014, when he was forced to retire by the Obama administration.\nDuring his briefings, Flynn \"answered any questions that were posed by DIA concerning the trip,\" said Kelner, his lawyer.\nA spokesman for the Defense Intelligence Agency, Jim Kudla, has said that Flynn briefed the agency in advance about his trip to Moscow \"in accordance with standard security clearance procedures.\" A spokesman for Flynn has said that Flynn also disclosed the RT trip when he last came up for a security clearance review in January 2016.\nChaffetz and Cummings said the documents they reviewed showed no evidence Flynn asked permission for the payments or later detailed the amounts he received to military authorities. Chaffetz added that while \"it would be a bit strong to say that Flynn flat-out lied,\" he should have sought and received permission before accepting any foreign government payments.\nBoth Cummings and Chaffetz said the committee's investigation into Flynn's foreign payments includes examining consulting work he did for a Turkish businessman last year.\nFlynn's firm last month registered as a foreign agent with the Justice Department for the consulting work and acknowledged that it may have principally benefited the government of Turkey. Flynn's client, Inovo BV, is owned by a Turkish businessman who is also a member of a committee overseen by Turkey's finance ministry. In government filings, Flynn disclosed that he personally received between $50,000 and $100,000 as part of his stake in Flynn Intel Group, the company that performed the foreign agent work.\nEarlier Tuesday, a Senate Judiciary subcommittee announced a public meeting May 8 to hear testimony for the first time from the former acting attorney general, Sally Yates, who played a role in Flynn's firing.\nYates was supposed to testify publicly before the House intelligence committee in March, but that was canceled and has yet to be rescheduled. Some Democrats believe the White House wants to limit what Yates says publicly, but the White House has denied this. Former National Intelligence Director James Clapper is also to testify at the May 8 hearing.\nAlso Tuesday, there were complaints that the Senate investigation was not moving quickly enough. Democratic Sens. Kamala Harris and Dianne Feinstein of California said they believed the committee needed to move at a faster pace.\nPreliminary interviews now have been completed with about 27 individuals from multiple intelligence agencies. And there are nine staffers working full-time on the investigation, according to one Senate aide, who was not authorized to discuss the matter publicly and spoke only on condition of anonymity. By contrast, the House Select Committee on Benghazi employed more than 50 congressional staffers.\nThe aide said the committee has gained access to additional materials at intelligence agencies, including categories and types of intelligence documents that have never been provided to Congress before.\nCommittee members and staff are reviewing thousands of pages of materials at CIA headquarters and the National Security Agency.\n___\nAssociated Press writers Eric Tucker, Eileen Sullivan and Deb Riechmann contributed to this report.","url":"https://www.dailymail.co.uk/wires/ap/article-4446630/Lawmakers--Former-Trump-aide-Flynn-broken-US-law.html"}
