{"authors":["Associated Press"],"date_download":"2018-10-23 01:14:13","date_modify":"2018-10-23 01:14:13","date_publish":"2016-01-29 14:59:28","description":"DOHA, Qatar (AP) — Paul Lawrie earned a two-shot lead at a windy Doha Golf Club on Friday to close in on an unprecedented third Qatar Masters title. The over...","filename":"data/vaneerConsumption/Lawrietaking2shotleadingintoQatarMastersfinalround.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422907_Lawrie-taking-2-shot-leading-Qatar-Masters-final-round_1540257253.html","title":"Lawrie taking 2-shot leading into Qatar Masters final round","title_page":"Lawrie taking 2-shot leading into Qatar Masters final round | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lawrie taking 2-shot leading into Qatar Masters final round\nDOHA, Qatar (AP) — Paul Lawrie earned a two-shot lead at a windy Doha Golf Club on Friday to close in on an unprecedented third Qatar Masters title.\nThe overnight leader started the third round with 13 straight pars before making his first birdie on the 14th hole, then picked up another shot on the par-5 18th to finish at 2-under-par 70.\nHe was on top of the leaderboard at 13 under, two ahead of Branden Grace, who had his chance to make history: The first player to successfully defend the title.\n\"Conditions were tough, but to go around there and not have a bogey ...,\" Lawrie said. \"It is a little bit frustrating for me. I hit a lot of good putts that didn't go in.\"\nThe 47-year-old Lawrie hasn't won on the European Tour since 2012, the same year he won in Doha for the second time.\nAt 11 under overall with South Africa's Branden Grace (68) was Denmark's Thorbjorn Olesen (69).\nGrace finished his bogey-free round with three successive birdies.\n\"Patience was the name of the game. It was a brutal day out there,\" Grace said. \"The wind was blowing and the greens were tricky. I pretty much got the most out of my round today. So 4 under was a great score.\"\nOlesen, winner of the Alfred Dunhill Links Championship last year, showed good touch in a 69 that featured one bogey on the fifth hole.\n\"To be honest, I played great down the last nine holes. Gave myself so many chances,\" Olesen said.","url":"https://www.dailymail.co.uk/wires/ap/article-3422907/Lawrie-taking-2-shot-leading-Qatar-Masters-final-round.html"}
