{"authors":[],"date_download":"2018-10-23 00:44:09","date_modify":"2018-10-23 00:44:09","date_publish":"2016-01-28 14:51:33","description":"Veteran Paul Lawrie took a major step towards becoming the first person ever to win three Qatar Masters titles after a scintillating round of 66 secured a on...","filename":"data/vaneerConsumption/LawriebreezesintooneshotleadatQatarhalfwaymark.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h0uo-4vVdYopwYQ7f641721b07ae50208-613_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421091_Lawrie-breezes-one-shot-lead-Qatar-halfway-mark_1540255449.html","title":"Lawrie breezes into one shot lead at Qatar halfway mark","title_page":"Lawrie breezes into one shot lead at Qatar halfway mark | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lawrie breezes into one shot lead at Qatar halfway mark\nVeteran Paul Lawrie took a major step towards becoming the first person ever to win three Qatar Masters titles after a scintillating round of 66 secured a one-shot lead in windy conditions on Thursday.\nThe Scot, who won in Doha in 1999 and 2012, posted six birdies, including two in his first three holes, to finish on 11 under.\nBut on a day of low scoring, players were bunching behind the 1999 British Open champion, promising an exciting finish for the final two rounds.\nScotland's Paul Lawrie won the British Open title in 1999 ©Glyn Kirk (AFP)\nHot on his heels is Belgium's Nicolas Colsaerts who followed up an opening round of 66 with a 68, to end on 10 under.\nLawrie is two ahead of three players on nine under, including Andrew Johnston of England who shot a 69 and France's Gregory Bourdy, whose round included a hole-in-one at the par three 8th.\nOne shot further back, on eight under, stands Sergio Garcia.\nThe 2013 Qatar Masters champion, like Lawrie, also shot a 66.\nAfterwards, the Aberdonian said he had enjoyed himself.\n\"I played nicely tee-to-grew, hit a lot of good shots,\" said the 47-year-old.\n\"Only made one mistake which was a three-putt from 20 feet at 15.\"\nHe added: \"I controlled the flight of the ball pretty well, which is what you have got to do when it's windy.\"\nLawrie also revealed he had been working on his putting since missing the cut last week at the Abu Dhabi Golf Championship.\nIn potential omens, on both occasions that Lawrie has won the Qatar Masters he has gone on to feature in the Ryder Cup in the same year. The Ryder Cup will take place in Hazleton in the US between September and October this year.\nLawrie also hit six birdies on the opening day, but was still five shots off the course record 61 set by Adam Scott in 2008.\nCourse officials had moved the tees forward because of anticipated high winds, but although conditions were again blustery, they were far from unplayable.\n\"This morning the wind was not blowing so hard,\" said Bourdy, one of the earlier starters. \"I think it is a good score, especially the hole-in-one, I'm very pleased about that.\"\nDefending champion Branden Grace from South Africa is handily placed on seven under par, after shooting 67.\nA shot further back are his fellow South Africans Louis Oosthuizen and Ernie Els.\nOosthuizen, one of the pre-tournament favourites, lost touch with the leaders after shooting a disappointing one-over-par 73, in a round that included three bogeys.\nThe cut was set at one under and more than 70 players qualified for the final two rounds on Friday and Saturday, when conditions are expected to be even windier.","url":"https://www.dailymail.co.uk/wires/afp/article-3421091/Lawrie-breezes-one-shot-lead-Qatar-halfway-mark.html"}
