{"authors":[],"date_download":"2018-10-23 01:30:36","date_modify":"2018-10-23 01:30:36","date_publish":"2016-01-29 15:35:46","description":"A last hole birdie gave Paul Lawrie a two-shot third round lead from defending champion Brandon Grace and Denmark's Thorbjorn Olesen at the Qatar Masters on ...","filename":"data/vaneerConsumption/LawrieGracesetforfinaldaybattleatQatarMasters.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i22p-3bmscybNe842cce83474b575bdde-410_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423007_Lawrie-Grace-set-final-day-battle-Qatar-Masters_1540258236.html","title":"Lawrie, Grace set for final day battle at Qatar Masters","title_page":"Lawrie, Grace set for final day battle at Qatar Masters | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lawrie, Grace set for final day battle at Qatar Masters\nA last hole birdie gave Paul Lawrie a two-shot third round lead from defending champion Brandon Grace and Denmark's Thorbjorn Olesen at the Qatar Masters on Friday\nBoth Lawrie and Grace are seeking to make tournament history.\nLawrie sank a 10-foot putt on the 589-yard par five 18th, for a score of 70, following rounds of 67 and 66.\nScotland's Paul Lawrie won the Qatar Masters in 1999 and 2012 ©Glyn Kirk (AFP)\nThat gave him a two-shot cushion over Grace, who raced up the field with three birdies on the final three holes, to finish at 11 under.\nIf Lawrie wins on Saturday, he will become the first player to win the tournament three times, having triumphed in 1999 and 2012.\nIf Grace wins he will become the first player to have successfully defended the Qatar Masters title.\nScotsman Lawrie had cut an increasingly frustrated figure towards the end of his round especially after he failed to convert a birdie chance at the par three 17th, following a fine tee shot.\nUp until then he had posted only one birdie all day at the 410-yard 14th.\nBut a superb up and down on the 18th, means he will start the final day with that two-shot advantage.\nAsked about his chances of victory, Lawrie said: \"There's a lot of good players obviously behind me.\n\"Branden Grace is obviously defending champion, won here before and well up the World Rankings. So tomorrow is going to be a different challenge but looking forward to it.\"\nGrace, who described conditions as \"brutal\", hit a four under par 68 to finish on 11 under, thanks to a storming finish.\nHis birdies at 16, 17 and 18 followed a birdie at the par five first, and 14 pars as he produced high-quality and consistent golf on a day when others struggled in cold and windy conditions.\n\"I pretty much got the most out of my round today. I don't really think I left any out there, so four under was a great score.\"\nPrior to the tournament, the South African said his chances of winning again in Qatar were \"slim\".\nLike Lawrie, Grace, who won with a score of 19 under last year, did not make a single bogey all day.\n- 'Brutal' conditions -\nConditions on Friday were probably the toughest of the week so far and temperatures hovered around 15 degrees celsius (59) fahrenheit, with the strong wind making it feel colder.\nAside from the two potential history-makers, and Olssen, Saturday's final round promises excitement as a number of players bunched up behind Lawrie and Grace.\nSpain's Rafa Cabrera-Bello and England's Tommy Fleetwood, both finished on 10 under.\n\"It was tough but, you know, you've just got to get on with it,\" said Fleetwood, who shot a 70.\nOne shot further back on nine under, sit a further four players, France's Gregory Bourdy, Sweden's Pelle Edberg, England's Andrew Johnston and Lee Slattery, whose round of 69 pushed him 14 places up the leaderboard.\nRound of the day came from England's Richard Bland, who shot a five under par 67 to finish on eight under and tied in 10th position.","url":"https://www.dailymail.co.uk/wires/afp/article-3423007/Lawrie-Grace-set-final-day-battle-Qatar-Masters.html"}
