{"authors":["Associated Press"],"date_download":"2018-10-22 21:45:34","date_modify":"2018-10-22 21:45:34","date_publish":"2017-04-26 02:50:35","description":"NEW YORK (AP) - An expanded lawsuit filed Tuesday accuses Fox News Channel of racial discrimination \"that appears more akin to Plantation-style management...","filename":"data/vaneerConsumption/LawsuitfiledagainstFoxallegesracialdiscrimination.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/03/wire-462753-1493172039-956_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446122_Lawsuit-filed-against-Fox-alleges-racial-discrimination_1540244734.html","title":"Lawsuit filed against Fox alleges racial discrimination","title_page":"Lawsuit filed against Fox alleges racial discrimination | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - An expanded lawsuit filed Tuesday accuses Fox News Channel of racial discrimination \"that appears more akin to Plantation-style management than a modern-day work environment.\"\nThe lawsuit, filed in state Supreme Court, adds eight former and current Fox employees to a case involving three former Fox workers and their accusations against a since-fired Fox financial executive. It also expands the case to include Dianne Brandi, Fox's chief counsel.\nFox News said it vehemently denies the allegations, calling them \"copycat complaints.\" It said Brandi denies the claims against her.\nFILE - In this combination photo, Tucker Carlson, host of \"Tucker Carlson Tonight,\" appears on the set in New York, Thursday, March 2, 2107, left, and Fox News personality Bill O'Reilly appears on the set of his show, \"The O'Reilly Factor\" on Oct. 1, 2015 in New York. O'Reilly says he's sad and surprised that he's off TV but is confident the truth will come out about his exit from Fox News. Five days after his firing amid sexual harassment allegations, O'Reilly aired an episode Monday of his personal website's \"No Spin News\" podcast. The show was replaced by \"Tucker Carlson's Tonight,\" which moved to O'Reilly's time slot Monday. (AP Photo/Richard Drew, File)\nThe original lawsuit was filed in late March by two black women who worked in the network's payroll department, and a third colleague later joined it. The expanded lawsuit, incorporating the other employees, seeks unspecified compensatory damages and an elimination of unlawful employment practices at Fox.\nThe workers allege that their complaints about the actions of Judith Slater, the fired former comptroller, went unanswered for years. They say Brandi told them it was because Slater \"knew too much\" about former Fox Chairman Roger Ailes and top-rated host Bill O'Reilly, who have been ousted over the past year because of sexual-harassment accusations.\nA lawyer for Slater, Catherine Foti, said the actions against Slater are meritless and frivolous. She said \"all claims of racial discrimination against Ms. Slater are completely false.\"\nOne plaintiff, on-air personality Kelly Wright, who's black, said he'd been effectively sidelined and asked to perform the role of a Jim Crow, an insulting slang term to refer to a black man, according to the lawsuit. Wright said O'Reilly, who's white, refused to show a piece Wright had prepared after racial protests in Ferguson, Missouri, because they showed blacks in too positive a light.\nA former employee, Musfiq Rahman, a dark-skinned Bangladeshi, said he was punished after mistakenly walking into Ailes' office by no longer being allowed on Ailes' floor without an escort.\nMark LeGrier, a former financial employee who's black, said he was subjected to retaliation when he complained to Brandi about Slater's behavior.\n\"When it comes to racial discrimination, 21st Century Fox has been operating as if it should be called 18th Century Fox,\" said Douglas Wigdor, a lawyer for the plaintiffs.\nMeanwhile, Nielsen company ratings showed that Tucker Carlson moved into O'Reilly's old time slot at Fox News on Monday night and took over his status as the most-watched host in cable news - at least for a night.\nO'Reilly, who hosted \"The O'Reilly Factor,\" was fired by Fox last week following news about Fox settling sexual-harassment cases involving him for millions of dollars. He has denied the allegations.\nNielsen said Carlson's first night at 8 p.m. attracted 3.17 million viewers, beating the combined audience of MSNBC's Chris Hayes, who reached 1.52 million viewers, and CNN's Anderson Cooper, who reached 1 million.\nCarlson did not beat O'Reilly's nearly 4 million average during the first three months of the year. Carlson had averaged 3.3 million in the 9 p.m. time slot following O'Reilly.","url":"https://www.dailymail.co.uk/wires/ap/article-4446122/Lawsuit-filed-against-Fox-alleges-racial-discrimination.html"}
