{"authors":[],"date_download":"2018-10-30 20:53:29","date_modify":"2018-10-30 20:53:29","date_publish":"2014-09-29 22:37:07","description":"A Clayton County mother is suing a clinic and a nurse midwife claiming they botched the circumcision of her newborn, allegedly scarring him to the extent that he cannot normally urinate and most likely will be unable to have sex once he is an adult.","filename":"data/vaneerConsumption/LawsuitfiledclaimingbotchedClaytonCountycircumcision.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_lawsuit-filed-claiming_af89500c1bdd4b07164e930e4998a5b5__1540932809.html","title":"Lawsuit filed claiming botched Clayton County circumcision","title_page":"Lawsuit filed claiming botched Clayton County circumcision","title_rss":"NULL","source_domain":"ajc.com","text":"A Clayton County mother is suing a clinic and a nurse midwife claiming they botched the circumcision of her newborn, allegedly scarring him to the extent that he cannot normally urinate and most likely will be unable to have sex once he is an adult.\nAccording to the attorney who filed the lawsuit in Clayton County State Court, the tip of the baby’s penis was amputated, leaving a stump.\n“They cut through his urethra,” attorney Jonathan Johnson told The Atlanta Journal-Constitution Monday.\nHe said child’s body is reacting to the wound by sealing up and they are “continuing having to go and have holes punched in that wound so he can urinate.”\nThe mother of the 1-year-old said she has to insert an instrument in the hole three times a day to prevent it from closing.\n“He will be deprived for the rest of his life. Our society is so judgmental,” Stacie Willis said about her son, the youngest of three boys she and her husband have. “This may be a kid who never wants to have intercourse or kids, or will be ashamed. He may be suicidal or depressed. Nobody knows.”\nHis medical bills so far have total $20,000, some of it covered by insurance.\nJohnson said psychiatric care for the child is expected to total at least $1 million over his lifetime.\nWillis says doctors still don’t know if any future surgeries can repair the damage.\nThe lawsuit, filed Thursday, says the boy was disfigured because of negligence of Life Cycle Pediatrics, nurse midwife Melissa Jones, who performed the circumcision on Oct. 3, 2013, and Anne Sigouin, owner of Life Cycle OB/GYN.\nNeither Jones, Sigouin nor other officials at the businesses could be reached for comment late Monday afternoon.\nThe suit asks for monetary damages for physical and mental pain and suffering, for medical expenses and costs of care and equipment for the child and any lost income he may suffer as an adult.\nWillis said there was an extraordinary amount of blood during the procedure, and she immediately took her son to a nearby emergency room.\n“That’s when I found out the tip of his glans (had been severed) and urethra was seriously damaged,” Willis said. “His penis will never be normal. He’ll have to go through (more) surgeries for the rest of his life.”","url":"https://www.ajc.com/news/lawsuit-filed-claiming-botched-clayton-county-circumcision/f50J10nK5R0nm0lntBaiJI/"}
