{"authors":["Jessica Chia For Dailymail.Com"],"date_download":"2018-10-23 02:40:11","date_modify":"2018-10-23 02:40:11","date_publish":"2017-03-16 13:16:42","description":"Louann Clem filed the suit in Trenton, New Jersey, against Case Pork Roll Company claiming that they discriminated against her husband Richard Cass due to his excessive gas problem.","filename":"data/vaneerConsumption/Lawsuitclaimingmanwasfiredforfartsisthrownout.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54198700000578-0-image-a-13_1489670198567.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320014_Lawsuit-claiming-man-fired-farts-thrown-out_1540262411.html","title":"Lawsuit claiming man was fired for farts is thrown out","title_page":"Lawsuit claiming man was fired for farts is thrown out | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A lawsuit filed by a woman claiming her husband was unjustly fired from his job as a result of his extreme flatulence has been thrown out by a federal court judge.\nLouann Clem filed the suit in Trenton, New Jersey, against Case Pork Roll Company claiming that they discriminated against her husband Richard Cass due to his excessive gas problem, which flared up after he underwent gastric bypass surgery.\nCass, a comptroller who worked for the pork roll company for 10 years, experienced 'extreme gas and uncontrollable diarrhea', which his bosses 'constantly' complained about before he was fired in 2014, the lawsuit said.\nLouann Clem filed the suit in Trenton, New Jersey, against Case Pork Roll Company claiming that they unjustly fired her husband Richard Cass due to his excessive gas problem\nClem, who worked alongside Cass at the company based in New Jersey, quit the same day her husband was fired.\nShe first filed the suit in November 2015, saying she suffered mental and physical anguish before it was dismissed last July.\nAn amended suit was thrown out by US District Court Judge Freda Wolfson, who ruled the company did not create a hostile work environment, NJ.com reported.\nCass, who once weighed 420 pounds, underwent gastric bypass surgery in 2010, and began experiencing 'extreme gas and uncontrollable diarrhea,' the lawsuit said.\nClem said the company’s president complained about her husband's gas several times before he was fired and made comments like, 'We cannot run an office and have visitors with the odor in the office'.\nCass said that his surgery was absolutely crucial and that it saved his life. Now he suffers with the consequences of its aftermath and called his termination 'embarrassing'.\nRichard Clem, an employee of the food company for ten years, said he only shared an office space with his wife and that he never had to interact with visitors\nHe managed to control the gas with the help of medication, but told the New York Daily News: 'I feel better, but there goes my reputation. Who wants to hire a fart boy?\n'The fact is that I was a loyal and trusted employee for 10 years,' he said.\nRichard said he only shared an office space with his wife and that he never had to interact with visitors.\n'We just opened a window if we wanted to. We used to burn candles all the time,' he said.","url":"https://www.dailymail.co.uk/news/article-4320014/Lawsuit-claiming-man-fired-farts-thrown-out.html"}
