{"authors":["Lana Shadwick"],"date_download":"2018-10-30 19:12:03","date_modify":"2018-10-30 19:12:03","date_publish":"2015-11-13 14:11:07","description":"Criminal defense lawyers in Texas took no time to condemn the \"cookie cutter indictments following cookie cutter arrest warrants.\"","filename":"data/vaneerConsumption/LawyersCondemnCookieCutterIndictmentsandArrestWarrants.json","image_url":"https://media.breitbart.com/media/2015/05/ap_ap-photo1148-e1432141848625.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_11_13__1540926723.html","title":"Lawyers Condemn 'Cookie Cutter' Indictments and Arrest Warrants","title_page":"Twin Peaks Bikers: Lawyers Condemn 'Cookie Cutter' Indictments and Arrest Warrants","title_rss":"NULL","source_domain":"breitbart.com","text":"Criminal defense lawyers in Texas took no time to condemn the “Cookie cutter indictments following cookie cutter arrest warrants” for 106 bikers in Waco this week.\nA Texas lawyer posted the “cookie cutter” comment on Facebook and added, “The only evidence possibly presented would be that they were wearing club colors.”\nThe indicted motorcycle enthusiasts were part of the 177 bikers arrested after the Twin Peaks restaurant shootings in May.\nAs reported by Breitbart Texas, the McLennan County grand jury took just nine hours on Tuesday to indict all 106 Twin Peaks bikers in cases presented to them during their session. The grand jury indicted all 106 bikers for the crime of engaging in organized criminal activity under a Texas criminal statute relating to a “criminal street gang.”\nHouston lawyer Grant Scheiner told Breitbart Texas, “This case has all the trappings of assembly line justice. 106 cases presented to the grand jury and not a single one no-billed or reduced. Assuming the grand jury took a bathroom break or two during its nine hour session, that’s less than five minutes spent on each case.”\nThe math works out to exactly 5.09 minutes to hear evidence and deliberate for each indictment.\nTim Huey, a lawyer from Ohio joined in on a Facebook page for criminal defense lawyers and quipped, “Come on some probably got 9 minutes and others 1 minute.” Albert Sandoval responded, “[The] idiots are insane.”\nReferring to a Waco Tribune Herald article, Ennis County lawyer Mark Griffith posted on Facebook, “A ‘marathon nine-hour session’ is ridiculous. I guess we all work a marathon or more each day of the week.” He asked, “How, in 9 hours, the Grand Jury heard honest and clear evidence regarding 106 INDIVIDUALS boggles the mind,” adding, “This is evidence that the old saying ‘you can indict a ham sandwich’ is true.”\nThe grand jury has not yet considered the evidence against 80 other bikers.\nThe indictments stem from a shootout at a Twin Peaks restaurant in Waco, Texas, on May 17 that killed nine bikers and injured 24 others. Police swept up over 175 bikers at the restaurant in a mass arrest and charged them with engaging in organized criminal gang activity.\nAs reported by Breitbart Texas, police characterized the afternoon gathering at the Waco Twin Peaks restaurant as a meeting of criminal biker gangs with violent intent. The bikers call the meeting a legitimate, organized gathering of motorcycle riders to discuss political and other issues. The groups gathered there, the Texas Confederation of Clubs and Independents (CoC&I), hold frequent meetings to discuss biker safety issues, proposed legislation, and other motorcycle issues. Those there included bikers from Christian clubs and veterans, riding clubs (as opposed to motorcycle clubs), and independents (riders not associated with a motorcycle or riding club).\nThe president of the Texas Criminal Defense Lawyers Association, Sam Bassett, told Breitbart Texas, “Such a large number of indictments in only one day of deliberations, reinforces the notion that indictments are not used as evidence of guilt in criminal trials. At this point, the indicted defendants can begin fully obtaining and analyzing the evidence and the real story will begin to be revealed.”\nHouston attorney Carmen Roe, the immediate past president of the Harris County Criminal Lawyers Association told Breitbart Texas, “The McClellan County District Attorney’s Office continues to mock our system of justice by presenting 106 accusations in 9 hours, giving the grand jury mere minutes to make a decision that could send anyone of the charged to prison for life. Organized criminal activity is a charge requiring little more than a conspiracy to engage in criminal conduct. Most attorneys know that conspiracy is one of the easiest charges to allege and the hardest to defend for any citizen accused.”\nThe Waco Tribune Herald reported that in McLennan County, an average grand jury session lasts about six hours and the panel returns about 90 indictments twice a month.\nAttorney Robert Callahan represents William Aikin, of Talco in northeast Texas. He told the local newspaper that he was not shocked that all 106 indictments were identical like the arrest affidavits. “Unfortunately, it doesn’t surprise me,” he said. That is a consistent theme in this case.”\nAs it relates to the grand jury deliberations Callahan added, “There are only two possibilities. The first possibility is that for the most complicated cases of this office’s tenure, [the DA] spent five minutes presenting each case. Or what is more likely, he just presented all those cases in bulk, with no individualized presentation of each case for each defendant. That is sad and unfortunate. That is not how it is supposed to work. There is supposed to be a critical, deliberate, methodical presentation of each case.”\nDallas criminal defense lawyer Paul Saputo told Breitbart Texas, “The engaging in organized criminal activity offense itself butts right up against the First Amendment. The difference between a ‘criminal street gang’ and a legal club is often in the eye of the beholder–the state attaches the criminal street gang label just as loosely as the infamous definition of pornography – ‘I know it when I see it.’”\nSaputo added, “The ‘criminal street gang’ offenses have come under frequent scrutiny by various state and federal appellate courts for this very reason. Attaching ‘criminality’ to a group as a whole is a dangerous way for the state to overstep its authority and our constitutional rights. The fact that it only took nine hours for the state to obtain 106 indictments is a testament to that fact.”\nSection 71.02 of the Texas Penal Code provides that engaging in organized criminal activity for these crimes is a first-degree felony. The possible sentence is up to life in prison or from 15 to 99 years in prison.\nDallas attorney Clint Broden said he could not discuss the matter with Breitbart Texas or the press because criminal district court Judge Matt Johnson imposed a gag order in his client’s case. Broden represents Matthew Clendennen.\nBroden said in a statement. “This gag order makes it difficult to respond to Mr. Reyna’s press conference, as I am prohibited from discussing the case and can only discuss the gag order itself.”\nBroden filed another brief in the Texas Court of Criminal Appeals on Wednesday asking the court to take action to lift the gag order. Broden’s motion accuses the prosecution and “other state actors” of “engag[ing] in an unrelenting campaign using world-wide media outlets which was designed to scare the public with pictures of roving ‘biker gangs.’”\nAs reported by Breitbart Texas, Broden has been fighting the gag order, as well as, the prosecution’s persistent and flagrant use of terms such as “outlaw bikers,” “biker gangs,” and “outlaw biker gangs” when referring to motorcycle riders and all of the bikers in Waco on May 17th.\nBroden has cited legal opinions that prevent such “guilt by association” arguments by the state.\nThe Dallas lawyer has also accused the prosecution of “cit[ing] its own repeated press conferences in order to allow it to repeatedly refer to these ‘clubs’ as “five outlaw biker gangs’” to support its legal motions.\nThe Waco newspaper reports that the grand jury will return on November 18. McLennan County District Attorney Abel Reyna has declined to say whether the 80 remaining cases will be considered on that day.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as an associate judge and prosecutor. Follow her on Twitter @LanaShadwick2","url":"https://www.breitbart.com/border/2015/11/13/twin-peaks-bikers-lawyers-claim-cookie-cutter-indictments-arrest-warrants/"}
