{"authors":["Ben Kew"],"date_download":"2018-10-30 18:44:09","date_modify":"2018-10-30 18:44:09","date_publish":"2016-06-02 22:13:03","description":"Lawyers working for a woman who claimed she was gang raped by three men at the University of Virginia in a much publicised story have admitted they had | Tech","filename":"data/vaneerConsumption/LawyersofUVARapeHoaxerAdmitAccessingAllegedRapistsEmailAccount.json","image_url":"https://media.breitbart.com/media/2015/01/rolling-stone-uva-rape-on-campus.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_06_02__1540925049.html","title":"Lawyers of UVA Rape Hoaxer Admit Accessing Alleged Rapist's Email Account","title_page":"Lawyers of UVA Rape Hoaxer Admit Accessing Alleged Rapist's Email Account | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Lawyers working for a woman who claimed she was gang raped by three men at the University of Virginia in a much publicised story have admitted they had access to the alleged rapist’s emails.\nThe complaint was made by “Jackie,” who had just began her freshman year at the university, where she claimed a group of three fraternity brothers gang-raped her at the initiation ceremony.\nThe claim led to a feature in Rolling Stone in magazine in November 2014 entitled “A Rape on Campus, A Brutal Assault and Struggle for Justice at UVA,” which focused on the concept of a campus “rape culture.”\nHowever, the article was pulled in April this year after after Charlottesville Police Department officials told the university that “their investigation has not revealed any substantive basis to confirm that the allegations raised in the Rolling Stone article occurred at the Phi Kappa Psi fraternity.”\nThe woman alleged that a student named Haven Monahan lured her into the situation, however police later found her story was unsubstantiated.\nUVa’s Associate Dean, Nicole Eramo, is now suing the magazine in a $10 million defamation law suit, after it claimed she was attempting to shun complaints of sexual assault at the university.\nEramo’s lawyers said they found evidence that Jackie’s lawyers had accessed the alleged rapist’s email account, a claim which they have now admitted to.\nThis strongly suggests that either ‘Jackie’ might have created the email account herself and the entire persona of Haven Monahan, or that her lawyers were attempting to pervert the course of justice.\nLibby Locke, a lawyer representing Eramo, told The Washington Post that the lawyer’s admission was proof that “Jackie is Haven, a point they’ve refused to answer all along.”\nIn response, Jackie’s lawyers said that Eramo’s lawyers’ attempts to further disprove the allegations were “unhinged” attempts to “harass and abuse” their client, who they describe as a “sexual assault victim who merely wants to be left alone.”\nYou can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at ben@yiannopoulos.net.","url":"https://www.breitbart.com/tech/2016/06/02/rolling-stone-article-rape-victim-jackie-pulled-lawyers-admit-made/"}
