{"authors":["Associated Press"],"date_download":"2018-10-22 20:52:06","date_modify":"2018-10-22 20:52:06","date_publish":"2016-01-28 04:47:57","description":"HOUSTON (AP) — Two anti-abortion activists facing charges after making undercover videos about Planned Parenthood did use fake driver's licenses to get into ...","filename":"data/vaneerConsumption/LawyerRunawaygrandjuryindictedabortionfoes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:df0342c534114791aa5a8dbda93c6665-4vVdYopwYQ7f641721b07a8c026b-137_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419786_Lawyer-Runaway-grand-jury-indicted-abortion-foes_1540241526.html","title":"Lawyer: 'Runaway grand jury' indicted abortion foes","title_page":"Lawyer: 'Runaway grand jury' indicted abortion foes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lawyer: 'Runaway grand jury' indicted abortion foes\nHOUSTON (AP) — Two anti-abortion activists facing charges after making undercover videos about Planned Parenthood did use fake driver's licenses to get into a Texas clinic, their attorneys acknowledged Wednesday, but their actions weren't meant to defraud or harm the abortion provider.\nAttorney Terry Yates said at a news conference that the case against anti-abortion activists David Daleiden and Sandra Merritt won't stand up in court.\nHarris County District Attorney Devon Anderson's office initially launched the grand jury investigation to look into Planned Parenthood after undercover videos surfaced claiming the nation's largest abortion provider illegally sold fetal tissue to make a profit. However, the Houston grand jury cleared Planned Parenthood of misusing fetal tissue and instead on Monday indicted Daleiden and Merritt, who made the videos, on felony charges of tampering with a governmental record for using fake driver's licenses. Daleiden also faces a misdemeanor related to purchasing human organs.\nA Planned Parenthood clinic is seen Tuesday, Jan. 26, 2016 in Houston. A Houston grand jury investigating undercover footage at the Houston clinic found no wrongdoing Monday, Jan. 25, 2016, by the abortion provider, and instead indicted anti-abortion activists involved in making the videos that targeted the handling of fetal tissue in clinics and provoked outrage among Republican leaders nationwide. (AP Photo/Pat Sullivan)\n\"How many of us have used a fictitious driver's license to buy beer?\" Yates said. \"Can you imagine every kid that did that being charged with a second-degree felony? This grand jury has overreached. Obviously a runaway grand jury would do that.\"\nJared Woodfill, another attorney for the activists, said the methods that Daleiden and Merritt used to make the undercover videos are not different \"than the tactics used by investigative reporters all around this country for decades.\"\nMost professional news organizations discourage or explicitly forbid reporters from posing as someone else or otherwise misrepresenting themselves.\nAnd Houston criminal defense attorney Grant Scheiner, who's not affiliated with the case, called the charges \"pretty straight forward,\" adding that the activists \"used fake IDs, which is not something that a legitimate or reputable journalist would do.\"\nAnderson has said she respects the grand jury's decision \"on this difficult case.\"\nThe video footage showed Daleiden and Merritt posing as representatives of a company called BioMax, which purportedly procured fetal tissue for research. Planned Parenthood has said the fake company offered to pay the \"astronomical amount\" of $1,600 for organs from a fetus. The Houston Planned Parenthood clinic said it never agreed to the offer and ceased contact with BioMax because it was \"disturbed\" by the overtures.\nAs for the misdemeanor charge related to the purchase of human organs that Daleiden faces, Yates called it \"ridiculous\", saying the activist \"never was going to actually purchase them.\"\nBut Scheiner said that all Daleiden needed to do to be charged was to make an offer to buy human organs or tissue.\nThe tampering with a governmental record charge is the more serious one in this case and carries punishment of up to 20 years in prison.\nHowever, legal experts say that even if the activists are convicted, it's unlikely they will face any prison time.\nArrest warrants have been issued for Daleiden and Merritt, but Yates said the district attorney's office has agreed to allow the two activists to travel from California, where they live, to Houston. They would then surrender to authorities, be processed at the Harris County Jail and could post bond. Yates said no date has been set for when that would happen. Bond for Daleiden and Merritt has been set at $11,000 and $10,000, respectively.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3419786/Lawyer-Runaway-grand-jury-indicted-abortion-foes.html"}
