{"authors":["Lana Shadwick"],"date_download":"2018-10-30 21:38:30","date_modify":"2018-10-30 21:38:30","date_publish":"2015-08-05 15:05:17","description":"The tactics of a Collin County lawyer who is reported to have contacted a Collin County grand jury are being questioned.","filename":"data/vaneerConsumption/LawyersTacticsQuestionedinContactingCollinCountyGrandJury.json","image_url":"https://media.breitbart.com/media/2015/08/WFAA-Screenshot.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_08_05__1540935510.html","title":"Lawyer's Tactics Questioned in Contacting Collin County Grand Jury","title_page":"Lawyer's Tactics Questioned in Contacting Collin County Grand Jury","title_rss":"NULL","source_domain":"breitbart.com","text":"The tactics of a Collin County lawyer, who is reported to have contacted a Collin County grand jury by sending letters to the homes and jobs of grand jurors, and visiting them in person, are being questioned. His mission — asking them to investigate Attorney General Ken Paxton.\nAttorney Ty Clevenger admitted, in a television interview, to contacting Collin County grand jurors to ask them to investigate whether Paxton broke the law by failing to register with the Texas State Securities Board.\nResponding to an inquiry from Breitbart Texas, Clevenger cited the law defining the duties of grand juries:\nSection 20.09 of the Texas Code of Criminal Procedure says under the heading “Duties of Grand Jury”: “The grand jury shall inquire into all offenses liable to indictment of which any member may have knowledge, or of which they shall be informed by the attorney representing the State, or any other credible person.” See also Roberson v. Texas, 2004 WL 2817123 (Tex.App.-Houston [1st Dist.] 2004, pet. dism’d).\n“I suppose my critics can question whether I am a credible person, but they cannot plausibly say that I broke the law,” Clevenger explained. “The real issue here is one of grand jury independence. As I wrote about on July 14, the law says the grand jury should be free to conduct its own inquiries, but judges and prosecutors want grand jurors to think otherwise. After all, we can’t have average citizens asking inconvenient questions of the political class.”\n“Incidentally,” he continued, “I have exposed as many Democrats as I have Republicans. I have been critical of the Rick Perry indictment from the outset, and I also think Wallace Hall was railroaded.”\n“But the Paxton case is very different,” Clevenger concluded. “The charges have nothing to do with his actions in an official or political capacity, and he has already admitted his guilt to one of those charges (i.e., failure to register).”\nHouston lawyer Paul Looney also responded to Breitbart Texas saying, “The attorney’s (Clevenger’s) actions, albeit legal are marginally questionable in terms of ethics. It is fortunate that this is not the same grand jury that indicted Paxton.” Looney, a criminal defense lawyer who has a firm with offices in Houston and Hempstead, was recently appointed to chair an independent commission looking into the circumstances surrounding the arrest and subsequent suicide of Sandra Bland.\nDallas lawyer Clint Broden also spoke with Breitbart Texas about Clevenger’s tactics. “While I might draw the line at physically going to a grand juror’s home,” Broden said, “I applaud Mr. Clevenger for his efforts. The grand jury was not designed to be simply a puppet for the prosecution; it was designed to be a check on the system and an integral part of our judicial system.”\n“From what I have read, it does not appear that Mr. Clevenger attempted to ‘influence’ a grand jury, instead, he brought a matter of great public importance to a grand jury’s attention and the grand jury acted upon that,” Broden said. “This is how the system is supposed to work and from here it will be up to a petit jury to determine Mr. Paxton’s guilt or innocence.”\nMr. Broden is board certified in criminal law and criminal appellate law.\nAccording to WFAA-ABC in Dallas, Clevenger’s actions successfully spurred one of the grand jurors to ask the Travis County District Attorney for the “investigative file” on Paxton. Clevenger contacted them in March.\nThe Travis County District Attorney had decided it did not have jurisdiction over the matter. Paxton lived and worked in Collin County at the time of any of the alleged acts in question.\nWhen pressure was placed on the Collin County District Attorney to prosecute, DA Greg Willis responded that it would be more appropriate for the Texas Rangers and other investigative authorities to investigate. Willis cited his friendship with Paxton when taking himself out of the investigation. Paxton has been a business partner and friend of the Collin County DA.\nAs reported by Breitbart Texas, Collin County Judge Scott Becker later appointed two special prosecutors from Houston to preside over an investigation.\nThe grand jury, and the investigation of the Attorney General, and now three indictments of Paxton, all involve a Collin County grand jury. Clevenger is a lawyer in Lavon, Texas, which is in Collin County.\nThe solo practitioner reportedly sent his first set of letters on March 6th, and then again on March 21st. The attorney says he received the names of the grand jurors from the district clerk’s office in Collin County.\nHis letters attached a copy of the May 2014 Texas State Securities Board Disciplinary Order of Ken Paxton. The Board reprimanded Paxton for failing to register as a securities adviser in 2004, 2005, and 2012, and fined him $1,000.\nWhether the Collin County grand jury’s investigation was illegally tainted will be an issue for Paxton’s attorneys. The attorneys may have difficulty in tying any action by Clevenger to Paxton’s present indictments. According to reports, the grand jury that indicted Paxton, is not the grand jury that Clevenger contacted.\nHowever, Clevenger is credited by WFAA with successfully moving Paxton’s investigation along. He said, “the investigation would have died” without his intervention.\nThe Collin County lawyer says he “is not part of some left-wing conspiracy” and has been active in the Republican Party.\nClevenger is a blogger who wrote about Paxton on July 20th, prior to Paxton’s indictment, and called him a “Peacock Baptist.” He also took issue with what he called Paxton’s “asp-tongued political consultant, Anthony Holm.”\nThe Dallas area lawyer has taken issue with Holm calling Paxton “the victim of a vast, left-wing conspiracy.” He writes that “As a Republican, conservative Christian, and active member of the aforesaid ‘conspiracy,’ I find that amusing.”\nPaxton’s personal spokesman, Anthony Holm, personally attacked the two special prosecutors assigned to the investigation. Both lawyers are from Houston and have a reputation for being ethical, good defense lawyers. One of them, Brian Wice, successfully represented former House Majority Leader Tom Delay in his appeal of his Travis County conviction.\nClevenger says he calls Paxton a “Peacock Baptist” because “Paxton has strong notions of right and wrong and, like all of us, he still does things that he knows are wrong … [but] seeks to offset his guilt and shame with aggressive displays of righteousness.”\n“It’s unconventional,” Clevenger told WFAA-ABC. “I don’t dispute that at all, but ‘unconventional’ is not wrong or illegal. And if there had not been the avenue of going directly to the grand jury, the investigation would have died.”\nThe term of those on the Collin County grand jury that Clevenger contacted has expired. When the new grand jury was sworn in, Clevenger intended to contact the new grand jurors, according to WFAA.\nA Collin County judge reportedly issued orders to prevent the names of the grand jurors from being public. The order was said to have stated, “information was received outside the grand jury process and in violation of the laws of the State of Texas.” It continued, grand jurors were “improperly contacted” at their “residences and places of employment and given information regarding an investigation.”\n“Show me what law I violated … any ethical code, any rule, any law. And they can’t do it, because the law says you can do what I did,” Clevenger told WFAA. “There was absolutely no lobbying. That just wasn’t what happened.”\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. Follow her on Twitter @LanaShadwick2","url":"https://www.breitbart.com/border/2015/08/05/lawyers-tactics-questioned-in-contacting-collin-county-grand-jury/"}
