{"authors":[],"date_download":"2018-10-22 22:55:52","date_modify":"2018-10-22 22:55:52","date_publish":"2014-06-10 22:11:36","description":"The two 12-year-old girls accused of stabbing a classmate 19 times in the Wisconsin woods face a general status hearing Wednesday.","filename":"data/vaneerConsumption/LawyerofSlenderManStabbingSuspecttoAskforMentalEvaluation.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/491626/140606-slender-man-mn-735_297a98e4b78681fe7a932d8c5069f8db.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_slender-man-stabbing_lawyer-slender-man-stabbing-suspect-ask-mental-evaluation-n127801_1540248952.html","title":"Lawyer of Slender Man Stabbing Suspect to Ask for Mental Evaluation","title_page":"Lawyer of Slender Man Stabbing Suspect to Ask for Mental Evaluation","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe attorney for one of the 12-year-old girls accused of brutally stabbing a classmate in the Wisconsin woods will ask for a mental health evaluation during Wednesday's court hearing.\nThe judge would then appoint an examiner who would have 15 days to file a report and advise whether the girl is mentally competent to exercise her rights, attorney Tony Cotton told NBC News.\nSign up for breaking news alerts from NBC News\nBoth suspects, whom NBC News is not identifying because of their age, are being tried as adults.\nProsecutors say the near-fatal stabbing in the Milwaukee suburb of Waukesha was inspired by an eerie online meme known as Slender Man. The alleged attackers reportedly told investigators they were trying to pay homage to the faceless ghoul they discovered on a horror-themed website by stabbing their 12-year-old victim 19 times.\nThe girls face one count each of first-degree \"attempted homicide with a knife enhancer\" and could get up to 65 years in the state prison system.\nWisconsin laws dictate anyone over 10 years old charged with homicide is automatically considered an adult. Four states set the age threshold at 13 years old.\nCotton has said he believed the two alleged attackers may be the youngest ever charged as adults in Waukesha County.\nThe alleged stabbers are set to appear in court Wednesday for a general status hearing before Waukesha County Circuit Judge Michael O. Bohren, according to the Milwaukee Journal Sentinel.\nThe prosecution of either or both of the girls could be ordered to children's court — a move their lawyers are expected to pursue, the newspaper reported.\nWaukesha County District Attorney Brad Schimel told the Journal Sentinel that he would resist such a move.\n“It’s troubling when a person lashes out in anger,” Schimel said. “It’s more troubling when they lash out in cold blood. Isn’t that the worst kind of killer, the cold-blooded killer?”\nMeanwhile, the young victim investigators say was lured to the woods by two supposed friends under the guise of a game of hide-and-seek is slowly recovering after being released from the hospital.\nShe is \"happy to be home,\" but every day is a struggle, according to family friend and spokeswoman Dana Hoffmann.","url":"https://www.nbcnews.com/storyline/slender-man-stabbing/lawyer-slender-man-stabbing-suspect-ask-mental-evaluation-n127801"}
