{"authors":[],"date_download":"2018-10-22 20:45:46","date_modify":"2018-10-22 20:45:46","date_publish":"2014-05-02 15:07:02","description":"People who can’t get relief from laxatives may have a drug-free alternative — a vibrating capsule that kick-starts the bowels.","filename":"data/vaneerConsumption/LaxativesFailYouTryaVibratingPill.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_laxatives-fail-you-try-vibrating-pill-n93856_1540241146.html","title":"Laxatives Fail You? Try a Vibrating Pill","title_page":"Laxatives Fail You? Try a Vibrating Pill","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nPeople who can’t get relief from laxatives may have a drug-free alternative — a vibrating capsule that kick-starts the bowels with a little massage from the inside.\nThe pill’s still experimental and not approved yet, so it's not available. A team of Israeli researchers, with U.S. federal funding, has been testing the device in volunteers with chronic constipation or irritable bowel syndrome.\nThe capsule nearly doubled the number of bowel movements from two to four a week, Yishai Ron of the Tel-Aviv Sourasky Medical Center and colleagues told the Digestive Disease Week meeting.\n“The capsule was activated and started vibrating six hours after administration in a special mode developed by Vibrant Ltd,” the researchers wrote in a summary of their findings. “Each patient received two capsules per week and filled a daily bowel movement and laxative use questionnaire. On each follow-up visit, expelled capsules were collected and side effects were recorded.”\nAll the patients were healthy and had been screened for colon cancer.\n“Two patients had minor complaints of abdominal pain during the study period which resolved spontaneously during the study, two patients complained about diarrhea, one about flatulence and one of sensation abdominal wall twitches. No other related side effects were reported,\" Ron's team wrote.\nUp to half of patients with chronic constipation are unhappy with the results they get from laxatives, the researchers reported.","url":"https://www.nbcnews.com/health/health-news/laxatives-fail-you-try-vibrating-pill-n93856"}
