{"authors":["Alanna Greco"],"date_download":"2018-10-31 01:35:49","date_modify":"2018-10-31 01:35:49","date_publish":"2014-08-12 19:33:17","description":"It’s a common situation; you’re in the throes of passion when you realize that neither you nor your partner has a condom. Now you have a few options— either someone runs down to the drug store (if it’s even open), you give up on having sex, or you…","filename":"data/vaneerConsumption/LCondomDeliveryServiceistheAnswertoOurHornyandWoefullyUnpreparedPrayers.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/8928ebb2-248f-42d9-884e-65e0e18bdbc5.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35485-l-condom-delivery-service-is-the-answer-to-our-horny-and-woefully-unprepared-prayers_1540949749.html","title":"\"L.\" Condom Delivery Service is the Answer to Our Horny and Woefully Unprepared Prayers","title_page":"\"L.\" Condom Delivery Service is the Answer to Our Horny and Woefully Unprepared Prayers","title_rss":"NULL","source_domain":"bustle.com","text":"It’s a common situation; you’re in the throes of passion when you realize that neither you nor your partner has a condom. Now you have a few options— either someone runs down to the drug store (if it’s even open), you give up on having sex, or you have unprotected sex and risk contracting STDs (a HORRIBLE idea). Well, not anymore. Enter L., a condom company and condom delivery service, and the answer to your prayers. For a flat rate of $8, L. will have a bike messenger discreetly deliver condoms anywhere in NYC, any hour of the day or night, within the hour.\nAs if that isn’t awesome enough, L. condoms are better than regular condoms. Female CEO Talia Frenkel redesigned condoms to address issues of irritation and drying out, and made L. condoms sustainably sourced, biodegradable, and boxed in recycled packaging. They are glycerin and paraben-free, making them ultra-sensitive on skin, and they meet and exceed FDA, WHO and ISO standards. This is also the company that released the viral video \"Good Men Give A F**k\" that we covered in February, featuring a hunk who makes our hearts melt and challenges traditional ideas about how masculine (and all) men should approach sex.\nWhile it's clear that Frenkel wants to change the way that we think about the cultural context of condoms and our accessibility to them, she is on a greater mission. Frenkel worked as a photojournalist for the Red Cross and the United Nations documenting natural disasters and humanitarian crises, and began to get angry documenting the effects of HIV and AIDs in women and children. The condom shortages in sub-Saharan African countries were making women unable to control their own sexual health, and killing them because of their lack of access to basic contraception. Frenkel saw that this was a preventable disaster and decided to take action. So for every L. condom that you purchase, a condom is donated to an area devastated by HIV and AIDS. Frenkel also set up a network of partnerships with non-profits ensuring a wide distribution of condoms and created programs dedicated to educating women on ways to prevent HIV and AIDS and promoting empowerment.\nProtecting yourself with 24/7 access to condoms and helping promote sexual health across the world? We love it.\nCheck out the \"Good Men Give a F**k\" video below.","url":"https://www.bustle.com/articles/35485-l-condom-delivery-service-is-the-answer-to-our-horny-and-woefully-unprepared-prayers"}
