{"authors":["Associated Press"],"date_download":"2018-10-23 00:49:48","date_modify":"2018-10-23 00:49:48","date_publish":"2016-01-28 14:55:56","description":"NICOSIA, Cyprus (AP) — The leaders of Cyprus, Greece and Israel pledged on Thursday to work together to seize opportunities emerging from newly found offshor...","filename":"data/vaneerConsumption/LeadersofCyprusGreeceIsraelmeettoboostcooperation.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:46d701d7c04a45cd9ab0ae6d2cdc72ff-2vdWmEltwXfba0ce28e6329c2b55-592_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420600_Leaders-Cyprus-Greece-Israel-meet-boost-cooperation_1540255788.html","title":"Leaders of Cyprus, Greece, Israel meet to boost cooperation","title_page":"Leaders of Cyprus, Greece, Israel meet to boost cooperation | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Leaders of Cyprus, Greece, Israel meet to boost cooperation\nNICOSIA, Cyprus (AP) — The leaders of Cyprus, Greece and Israel pledged on Thursday to work together to seize opportunities emerging from newly found offshore gas reserves in order to bolster stability and security in a region wracked by conflict.\nThe talks in the Cypriot capital are the first tripartite summit between Cypriot President Nicos Anastasiades, Greek Prime Minister Alexis Tsipras and Israeli Prime Minister Benjamin Netanyahu.\n\"Our states share the same values as well as the conviction that in order to effectively counter multiple challenges confronting us on a local, regional and international level, we must work collectively,\" Anastasiades said at a news conference.\nCypriot president Nicos Anastasides, right, welcomes the Israeli Prime Minister Benjamin Netanyahu outside from the presidential palace before their meeting in capital Nicosia in the mediterranean island of Cyprus, Thursday, Jan. 28, 2016. The leaders of Cyprus, Greece and Israel are meeting in the Cypriot capital with the aim to strengthen cooperation and bolster stability in a region wracked by conflict. Discussions will cover newly found offshore gas reserves and tourism, while the leaders will sign a cooperation agreement on water resources. (AP Photo/Petros Karadjias)\nDiscussions centered on cooperation to exploit newly found offshore gas reserves as well as migration, combatting terrorism and boosting tourism. The countries also signed a cooperation agreement on managing water resources.\nNetanyahu said the leaders agreed to set up a tripartite committee to study the possibility of building a pipeline to carry natural gas found in waters off Israel and Cyprus to Europe via Greece.\nNetanyahu said the committee would also assess the possibility of an undersea cable to link their countries' electricity grids.\nTsipras said Greece can act as a bridge for the transfer of east Mediterranean gas to the EU.\n\"These are momentous goals and by working together we can advance them more effectively than we can separately,\" Netanyahu said.\nTsipras said the leaders agreed that dealing with the largest migration of people since World War II means tackling the problem \"at its root\" — poverty and war.\nAnastasiades said that additional financial support and economic development in war-torn areas would help alleviate the migration crisis.\nThe leaders said they would meet again in the second half of this year.\nCypriot president Nicos Anastasides, center, Greek Prime Minister Alexis Tsipras, right, and Israeli Prime Minister Benjamin Netanyahu talk during their meeting at the presidential palace in capital Nicosia in the mediterranean island of Cyprus, Thursday, Jan. 28, 2016. The leaders of Cyprus, Greece and Israel are meeting in the Cypriot capital with the aim to strengthen cooperation and bolster stability in a region wracked by conflict. Discussions will cover newly found offshore gas reserves and tourism, while the leaders will sign a cooperation agreement on water resources. (Yiannis Kourtoglou, Pool Photo via AP)\nCypriot president Nicos Anastasides, center, Greek Prime Minister Alexis Tsipras, right, and Israeli Prime Minister Benjamin Netanyahu shake hands during their meeting at the presidential palace in capital Nicosia in the mediterranean island of Cyprus, Thursday, Jan. 28, 2016. The leaders of Cyprus, Greece and Israel are meeting in the Cypriot capital with the aim to strengthen cooperation and bolster stability in a region wracked by conflict. Discussions will cover newly found offshore gas reserves and tourism, while the leaders will sign a cooperation agreement on water resources. (Yiannis Kourtoglou, Pool Photo via AP)\nCypriot President Nicos Anastasides, left, shakes hands with Israeli Prime Benjamin Netanyahu outside the presidential palace before their meeting in capital Nicosia in the Mediterranean island of Cyprus, Thursday, Jan. 28, 2016. The leaders of Cyprus, Greece and Israel are meeting in the Cypriot capital with the aim to strengthen cooperation and bolster stability in a region wracked by conflict. Talks are the first tripartite summit. Discussions will cover newly found offshore gas reserves and tourism, while the leaders will sign a cooperation agreement on water resources. (AP Photo/Petros Karadjias)\nCypriot president Nicos Anastasides, center, Greek Prime Minister Alexis Tsipras, right, and Israel Prime Minister Benjamin Netanyahu talk during their meeting at the presidential palace in capital Nicosia in the mediterranean island of Cyprus, Thursday, Jan. 28, 2016. The leaders of Cyprus, Greece and Israel are meeting in the Cypriot capital with the aim to strengthen cooperation and bolster stability in a region wracked by conflict. Discussions will cover newly found offshore gas reserves and tourism, while the leaders will sign a cooperation agreement on water resources. (Yiannis Kourtoglou, Pool Photo via AP)\nCypriot president Nicos Anastasides, right, talks with Israeli Prime Minister Benjamin Netanyahu during their meeting at the presidential palace in capital Nicosia in the mediterranean island of Cyprus, Thursday, Jan. 28, 2016. The leaders of Cyprus, Greece and Israel are meeting in the Cypriot capital with the aim to strengthen cooperation and bolster stability in a region wracked by conflict. Discussions will cover newly found offshore gas reserves and tourism, while the leaders will sign a cooperation agreement on water resources. (Yiannis Kourtoglou, Pool Photo via AP)\nCypriot President Nicos Anastasides, right, talks with Greek Prime Minister Alexis Tsipras during their meeting at the presidential palace in capital Nicosia in the Mediterranean island of Cyprus, Thursday, Jan. 28, 2016. The leaders of Cyprus, Greece and Israel are meeting in the Cypriot capital with the aim to strengthen cooperation and bolster stability in a region wracked by conflict. Talks are the first tripartite summit. Discussions will cover newly found offshore gas reserves and tourism, while the leaders will sign a cooperation agreement on water resources. (Pianos Kourtoglou, Pool Photo via AP)\nCypriot President Nicos Anastasides, rear right, and Israeli Prime Minister Benjamin Netanyahu review a military guard of honor during a welcome ceremony at the presidential palace in capital Nicosia in the Mediterranean island of Cyprus, Thursday, Jan. 28, 2016. The leaders of Cyprus, Greece and Israel are meeting in the Cypriot capital with the aim to strengthen cooperation and bolster stability in a region wracked by conflict. Talks are the first tripartite summit. Discussions will cover newly found offshore gas reserves and tourism, while the leaders will sign a cooperation agreement on water resources. (AP Photo/Petros Karadjias)\nCypriot President Nicos Anastasides, left, and Israeli Prime Minister Benjamin Netanyahu review a military guard of honor during a welcome ceremony at the presidential palace in capital Nicosia in the Mediterranean island of Cyprus, Thursday, Jan. 28, 2016. The leaders of Cyprus, Greece and Israel are meeting in the Cypriot capital with the aim to strengthen cooperation and bolster stability in a region wracked by conflict. Talks are the first tripartite summit. Discussions will cover newly found offshore gas reserves and tourism, while the leaders will sign a cooperation agreement on water resources. (AP Photo/Petros Karadjias)\nCypriot President Nicos Anastasides, left, shakes hands with Greek Prime Minister Alexis Tsipras outside the presidential palace before their meeting in capital Nicosia in the Mediterranean island of Cyprus, Thursday, Jan. 28, 2016. The leaders of Cyprus, Greece and Israel are meeting in the Cypriot capital with the aim to strengthen cooperation and bolster stability in a region wracked by conflict. Talks are the first tripartite summit. Discussions will cover newly found offshore gas reserves and tourism, while the leaders will sign a cooperation agreement on water resources. (AP Photo/Petros Karadjias)\nCypriot president Nicos Anastasides, left, and Greek Prime Minister Alexis Tsipras review a military guard of honor during a welcome ceremony at the presidential palace in capital Nicosia in the Mediterranean island of Cyprus, Thursday, Jan. 28, 2016. The leaders of Cyprus, Greece and Israel are meeting in the Cypriot capital with the aim to strengthen cooperation and bolster stability in a region wracked by conflict. Talks are the first tripartite summit. Discussions will cover newly found offshore gas reserves and tourism, while the leaders will sign a cooperation agreement on water resources. (AP Photo/Petros Karadjias)\nCypriot President Nicos Anastasides, left, and Israeli Prime Minister Benjamin Netanyahu review a military guard of honor during a welcome ceremony at the presidential palace in capital Nicosia in the Mediterranean island of Cyprus, Thursday, Jan. 28, 2016. The leaders of Cyprus, Greece and Israel are meeting in the Cypriot capital with the aim to strengthen cooperation and bolster stability in a region wracked by conflict. Talks are the first tripartite summit. Discussions will cover newly found offshore gas reserves and tourism, while the leaders will sign a cooperation agreement on water resources. (AP Photo/Petros Karadjias)\nCypriot President Nicos Anastasides, right, speaks with Greek Prime Minister Alexis Tsipras during a welcome ceremony at the presidential palace in capital Nicosia in the Mediterranean island of Cyprus, Thursday, Jan. 28, 2016. The leaders of Cyprus, Greece and Israel are meeting in the Cypriot capital with the aim to strengthen cooperation and bolster stability in a region wracked by conflict. Talks are the first tripartite summit. Discussions will cover newly found offshore gas reserves and tourism, while the leaders will sign a cooperation agreement on water resources. (AP Photo/Petros Karadjias)","url":"https://www.dailymail.co.uk/wires/ap/article-3420600/Leaders-Cyprus-Greece-Israel-meet-boost-cooperation.html"}
