{"authors":[],"date_download":"2018-10-30 19:36:11","date_modify":"2018-10-30 19:36:11","date_publish":"2018-08-22 10:50:00","description":"The Washington Nationals have been in first place for only a dozen days all season, none since June...","filename":"data/vaneerConsumption/LeadoffAsNationalsoffloadBraveswanttoaddsomemoreplayers.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/06/19/Images/wire-1716352-1510614919-521_634x425.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_leadoff-nationals-of_ad021c5fcfcaba34356c706de4c2943f__1540928171.html","title":"Leadoff: As Nationals offload, Braves ‘want to add some more players’","title_page":"Leadoff: As Nationals offload, Braves ‘want to add some more players’","title_rss":"NULL","source_domain":"ajc.com","text":"The Washington Nationals have been in first place for only a dozen days all season, none since June 12. They haven’t been fewer than five games out since July 1.\nYet, for most of the season, they appeared to be a threat looming in the distance, seemingly capable of a streak that would vault them toward the top of the National League East.\nIt still hadn’t happened as of Tuesday afternoon, so with their team 62-63 and 7-1/2 games out of first place, Nationals executives all but conceded that the Braves or the Phillies will win the division that was supposed to be Washington’s for the taking.\nThe Nationals traded second baseman Daniel Murphy to the Chicago Cubs for a minor-league infielder and a player to be named later, and they sold first baseman-outfielder Matt Adams to the St. Louis Cardinals (the team that traded him to the Braves last year). Shedding Murphy and Adams will save the Nationals about $5 million in salary the rest of the season.\nThe moves, which came after the Nationals put those players and others on revocable waivers, represented a reversal of the organization’s decision to keep their talented team intact at the non-waiver trade deadline July 31.\nIn an open letter to fans Tuesday, Nationals principal owner Mark Lerner wrote “the time has come for us to make decisions that will bolster our roster for next season and beyond.”\nLerner described the decisions as “incredibly tough” but wrote: “The good news is this is not a rebuilding effort. … And (general manager) Mike Rizzo and his team will be busy during the offseason making sure we have all of the pieces necessary to come back and be competitive next year.”\nMeanwhile, the Braves and Phillies are intently focused on this year.\nBraves general manager Alex Anthopoulos, in an interview with Chip Caray and Joe Simpson on Fox Sports Southeast before Tuesday night’s game in Pittsburgh, made it clear that he hopes to further fortify the roster before the Aug. 31 deadline for acquiring postseason-eligible players.\n“We definitely want to add some more players if we can,” Anthopoulos said. “We’re going to look to do something to this team and add one way or the other by the time we get to the end of the month. Could be on the bench, could be in the bullpen. Anywhere we can get better, we’re going to look to do that.\n“But we also don’t want to disrupt what we have going on right now, and we’re very thoughtful in how these pieces are going to fit … with our current team.. ... We still have time to add. We still have time to get better. We’re going to look to do that any way we can.”\n\"We're going to look to do something to this team and add one way or the other by the time we get to the end of the month.\"\n— @Braves GM Alex Anthopoulos pic.twitter.com/SXDklkONPn — FOX Sports: Braves (@FOXSportsBraves) August 21, 2018\nThe waiver wire could be difficult for the Braves to navigate, however, because they had the second best record in the National League entering play Tuesday. For the Braves to have an opportunity to acquire a player placed on waivers by an NL team, all NL teams with a worse record would have to pass on claiming the player. And for the Braves to acquire a player placed on waivers by an AL team, all AL teams would have to pass on claiming the player, as would all NL teams with worse records than Atlanta.\n* * *\nTODAY’S LEADOFF LINKS\n> College football teams from near and far – Georgia and Oregon – will meet in Atlanta’s Mercedes-Benz Stadium at the start of the 2022 season. See story here.\n> Several Georgia Tech players recall their “welcome to college football” moments. Read Ken Sugiura’s story here.\n> The Falcons’ Vic Beasley has been a sack king before, and Michael Cunningham thinks he can do it again. Read his column here.","url":"https://www.ajc.com/sports/leadoff-nationals-offload-braves-want-add-some-more-players/1iq3GPy8bE9KO8pKl5aP9L/"}
