{"authors":[],"date_download":"2018-10-30 19:36:06","date_modify":"2018-10-30 19:36:06","date_publish":"2018-08-10 11:00:00","description":"Fifty games to go.","filename":"data/vaneerConsumption/LeadoffBravesopenlongesthomestandofseasontonight.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/Local_Wsbtv/2018/03/25/Images/721594323_SunTrustPark_1522004009532_11186026_ver1.0_640_360.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_leadoff-braves-open-longest-homestand-season-tonight__1540928166.html","title":"Leadoff: Braves open longest homestand of season tonight","title_page":"Leadoff: Braves open longest homestand of season tonight","title_rss":"NULL","source_domain":"ajc.com","text":"Fifty games to go.\nThat’s what’s left of the Braves’ regular season as they return home with a 62-50 record, just one game behind first-place Philadelphia in the National League East.\nThe Braves open an 11-game homestand Friday night at SunTrust Park with the first of three games against the Milwaukee Brewers, whose record (66-52) and place in the standings (two games behind the first-place Chicago Cubs in the NL Central) are comparable to Atlanta’s.\nFriday’s game launches the Braves’ longest homestand of the season. Following the weekend series against the Brewers, the Braves have four games against the Marlins and four against the Rockies next week at SunTrust Park.\nThirty of the Braves’ final 50 games are at home, a potential advantage in what nevertheless will be a grueling schedule down the stretch. But so far this season the Braves have fared slightly better on the road (34-27, .557 winning percentage) than at SunTrust Park (28-23, .549 winning percentage).\nAbout this weekend’s opponent: The Brewers won three of four games from the Braves in Milwaukee in early July – the teams’ only previous meetings this season -- and are currently one game ahead of Atlanta for the first NL wild card.\nAnd about the Braves: With 50 games left, they have returned meaningful late-season baseball to Atlanta.\n* * *\nTODAY’S LEADOFF LINKS\n> The Falcons will open their exhibition season with a Friday night game against the New York Jets at MetLife Stadium. Read D. Orlando Ledbetter’s preview here.\n> As planning continues and the NFL season approaches, here are five updates on the road to Super Bowl LIII in Atlanta.\n> Nobody is doubting Georgia placekicker Rodrigo Blankenship now. Read Chip Towers’ story here.","url":"https://www.ajc.com/sports/leadoff-braves-open-longest-homestand-season-tonight/FOfdckuFD2yMrouEvoZaUO/"}
