{"authors":[],"date_download":"2018-10-30 19:34:17","date_modify":"2018-10-30 19:34:17","date_publish":"2018-08-28 11:00:00","description":"The Braves open a nine-game homestand tonight, with five of the games – the first two and the...","filename":"data/vaneerConsumption/LeadoffBravescanmeasurethemselvesagainstALEastonhomestand.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/27/Images/RAYSCELEBRATE.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_leadoff-braves-can-m_7a4029a0d9a17ef2e66020300e5a814d__1540928057.html","title":"Leadoff: Braves can measure themselves against AL East on homestand","title_page":"Leadoff: Braves can measure themselves against AL East on homestand","title_rss":"NULL","source_domain":"ajc.com","text":"The Braves open a nine-game homestand tonight, with five of the games – the first two and the last three – against teams from the vaunted American League East.\nThe Braves play the Tampa Bay Rays tonight and Wednesday night at SunTrust Park. The Rays are in third place in the AL East, 19-1/2 games behind the first-place Boston Red Sox. But this tells you how strong that division is: The Rays’ 70-61 record would be only 3-½ games out of first place in the NL East, and the NL East-leading Braves’ 73-57 record would be 16 games out of first place in the AL East.\nThe homestand will conclude with a three-game series early next week against the Red Sox, who are a best-in-baseball 48 games over .500 at 90-42 despite a current three-game losing streak.\nBetween the visits from the Rays and the Red Sox, the Braves will play one game against the Chicago Cubs (a makeup of a May rainout) and three games against the Pittsburgh Pirates.\nIt should be a compelling homestand.\nFor starters, the Rays bring an eight-game winning streak to SunTrust Park, the longest active streak in the majors, despite having been aggressive sellers at the non-waiver trade deadline. They swept a three-game series from Boston over the weekend. The Braves won’t have to face the Rays’ best pitcher, Blake Snell, who has a 16-5 record and 2.05 ERA. He pitched Sunday against the Red Sox. The Rays also have gotten surprisingly good results from a novel pitching concept they call “the opener,” basically a bullpen arm starting the game before yielding early to other bullpen arms.\nBoth the Braves and the Rays are 19-11 in their past 30 games.\nThe Braves arrive at this juncture with a 73-57 record, which includes 42-21 against NL East opponents and 31-36 against everyone else. The Braves are 7-8 against the AL East – 1-2 against the Red Sox, 1-2 against the Yankees, 2-0 against the Rays, 2-2 against the Blue Jays and 1-2 against the Orioles.\nBRAVES’ HOMESTAND AT A GLANCE\n> Vs. Tampa Bay: games at 7:35 p.m. today and Wednesday\n> Vs. Chicago Cubs: game at 7:35 p.m. Thursday\n> Vs. Pittsburgh: games at 7:35 p.m. Friday, 7:10 p.m. Saturday and 5:05 p.m. Sunday\n> Vs. Boston: games at 1:05 p.m. Sept. 3, 7:35 p.m. Sept. 4 and 12:10 p.m. Sept. 5\n* * *\nLEADOFF LINKS\n> As the Braves open their next-to-last homestand of the regular season, they are closing in on 2 million in attendance and confident they’ll surpass the 2.5 million drawn in SunTrust Park’s inaugural season. See story here.\n> Mercedes-Benz Stadium turned one year old Sunday. The $1.5 billion stadium in downtown Atlanta opened Aug. 26, 2017, with a Falcons exhibition game. Here’s a tally of the stadium’s first year, by the numbers.\n> Mark Bradley’s forecast for Georgia’s football program: sunny with a chance of championships. Read his column here.","url":"https://www.ajc.com/sports/leadoff-braves-can-measure-themselves-against-east-homestand/Irxu5Ds6NYuTD2TV5t2tCJ/"}
