{"authors":[],"date_download":"2018-10-30 19:36:22","date_modify":"2018-10-30 19:36:22","date_publish":"2018-08-14 11:00:00","description":"Braves phenom Ronald Acuna is putting up big numbers so fast that it’s hard to keep up with al...","filename":"data/vaneerConsumption/LeadoffTakealookatthecrazynumbersRonaldAcunaisputtingup.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/02/17/Videos/4326334.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_leadoff-take-look-th_86f55a06ddd64d75b31509fd592b8abd__1540928182.html","title":"Leadoff: Take a look at the crazy numbers Ronald Acuna is putting up","title_page":"Leadoff: Take a look at the crazy numbers Ronald Acuna is putting up","title_rss":"NULL","source_domain":"ajc.com","text":"Braves phenom Ronald Acuna is putting up big numbers so fast that it’s hard to keep up with all of them. So here’s a summary:\n4: That’s how many players in MLB history have led off both games of a doubleheader with a home run – Harry Hooper (May 30, 1913), Rickey Henderson (July 5, 1993), Brady Anderson (Aug. 21, 1999) and Acuna (Monday). Hooper and Henderson are in the Baseball Hall of Fame.\n10: That’s how many home runs Acuna has hit since moving to the top of the Braves’ batting order 23 games ago. He has hit four leading off a game.\n4: That is the number of consecutive games (through Monday) in which the 20-year-old Acuna has hit a home run, making him the youngest player in MLB history to homer in four consecutive games.\n6: That’s how many home runs Acuna has hit in the Braves’ past seven games.\n3: That’s how many Braves players over the past 110 seasons have hit 15 career home runs before age 21 – Andruw Jones (26), Eddie Mathews (25) and Acuna (17 and counting). Acuna doesn’t turn 21 until December.\n5-for-8, 5 RBI, 5 runs, 2 HR, 2 walks, 1 double, 1 stolen base: Those are Acuna’s box-score totals from Monday’s doubleheader sweep of the lowly Miami Marlins.\n11: That’s how many points Acuna raised his batting average for the season Monday, from .271 at the start of Game 1 to .282 at the end of Game 2.\n.344: That is Acuna’s batting average (31-for-90) since becoming the Braves’ leadoff hitter immediately after the All-Star break.\n(Sources: Elias Sports Bureau, Baseball Reference, National Baseball Hall of Fame, Braves. All statistics are through Monday’s games.)\n* * *\nTODAY’S LEADOFF LINKS\n> Mark Bradley revisits the inspired trade in which the Braves acquired Touki Toussaint from the Diamondbacks. Read his column here.\n> There is an increasing chance, Chris Vivlamore writes, that Tiger Woods could make his long-awaited return to Atlanta and the Tour Championship. Read the story here.\n> As work continues on the makeover of Philips Arena, the Hawks announced Monday that several of the building’s new premium spaces are sold out for the 2018-19 season. Read the story here.","url":"https://www.ajc.com/sports/leadoff-take-look-the-crazy-numbers-ronald-acuna-putting/18PRx5sk3eRa3NLzqTTg9L/"}
