{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 21:06:54","date_modify":"2018-10-22 21:06:54","date_publish":"2017-03-16 00:45:52","description":"It seems to have been a clear ratings winner. For it has emerged Leah Remini's show Scientology And The Aftermath has been renewed for another season.","filename":"data/vaneerConsumption/LeahReminisScientologyAndTheAftermathrenewed.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FEA1800000578-0-image-a-65_1489624947512.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318220_Leah-Remini-s-Scientology-Aftermath-renewed_1540242414.html","title":"Leah Remini's Scientology And The Aftermath renewed","title_page":"Leah Remini's Scientology And The Aftermath renewed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Another purification rundown: Leah Remini's show Scientology And The Aftermath has been renewed for another season it emerged Wednesday\nIt seems to have been a clear ratings winner.\nFor it has emerged Leah Remini's show Scientology And The Aftermath has been renewed for another season.\nCable network A&E have ordered 10 new episodes of the reality show, which will continue to look at the lives of former members of the controversial religion.\nThe King OF Queens favourite said: 'It became clear to us that although we were telling painful stories of former members of the Church of Scientology, this show was resonating strongly with people everywhere.\n'The show is really about standing up for what is right and not letting bullies have their way.\n'I feel it is important for people to know that you can take action to bring about change, both for yourself and for others.'\nThe new season will feature more accounts of 'former members whose lives have been significantly impacted by the Church’s practices.'\nThe Church Of Scientology, founded by science fiction writer L Ron Hubbard, has been rocked by allegations of torture and abuse in recent years.\nIt was dealt a heavy blow when HBO aired the investigatory documentary Going Clear: Scientology and the Prison of Belief.\nDigging deep: Leah interviewing a former church member in season one\nAmong the claims it aired were worshipers had been held as prisoners, elite Sea Org members were tortured and that church chiefs even had a special blackmail file to keep famous follower John Travolta in check.\nThe 2015 film also featured an interview with famed former follower Paul Haggis, with the Oscar-winner claiming 'you have to choose to be blind' to ignore the sinister goings on, a charge he admitted being guilty of.\nLeah, 46, who became a Scientologist at the age of nine, claims there are plenty more revelations to come.\nReligion to the stars: The church has a famed Celebrity Centre in Hollywood\nShe said: 'Our intention is to send a clear message to abusers that they will not go unchecked and will not be permitted to continue harming people without being questioned and challenged.\n'We have been deluged with messages from those who have stories to tell who feel the show is a forum where their voices can be heard.\nWe have been overwhelmed with support from well-wishers and fans of the show from around the world. But most importantly we felt compelled to proceed with another season to continue to reveal truths and seek justice for all victims.”","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318220/Leah-Remini-s-Scientology-Aftermath-renewed.html"}
