{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 18:32:00","date_modify":"2018-10-30 18:32:00","date_publish":"2016-08-04 08:21:20","description":"A report confirming that anti-Semitism occured within OULC has been leaked after the Labour Party took measures to suppress its publication.","filename":"data/vaneerConsumption/LeakedCopyofSuppressedReportConfirmsLabourStudentsEngagedinAntiSemitism.json","image_url":"https://media.breitbart.com/media/2016/02/OULC.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_08_04__1540924320.html","title":"Leaked Copy of Suppressed Report Confirms Labour Students Engaged in Anti-Semitism","title_page":"Leaked Copy of Suppressed Report Confirms Labour Students Engaged in Anti-Semitism","title_rss":"NULL","source_domain":"breitbart.com","text":"A report confirming that anti-Semitism did occur within Oxford Union Labour Club (OULC) has been leaked three months after the Labour Party took measures to suppress its publication.\nThe report, by Baroness Royall, investigated allegations made earlier this year that students within the OULC were engaging in anti-Semitism, often times, but not exclusively, dressed up as anti-Zionism.\n“There have been some incidents of anti-Semitic behaviour,” Baroness Royall confirmed in the report.\n“Some Jewish members do not feel comfortable attending the [OULC] meetings, let alone participating,” she added.\nAlthough she found “no evidence that the Club is itself institutionally anti-Semitic,” she did find evidence that Jews were being excluded from discussion merely because of the fact of their Jewishness, and that in some cases anti-Zionism was being used as a foil for anti-Semitism.\n“No pre-conditions are placed on women debating sexism. It is not a prerequisite that Muslims condemn the atrocities of this or that government before they may enter debate on foreign policy,” Baroness Royall noted.\n“[Yet] many students reported that should a Jewish student preface a remark “as a Jew…” they are likely to face ridicule and behaviour that would not be acceptable for someone saying “as a woman…” or “as an Afro-Caribbean…”. This behaviour is also reported within the wider community.”\nHowever, although the Labour Party’s National Executive Committee (NEC) received a full copy of the report in May, they chose only to publish Baroness Royall’s eleven recommendations. Those included proper recording of allegations of anti-Semitism, training on dealing with allegations of anti-Semitism, and that Labour Clubs generally “should examine the culture of their Club” to ensure that they provide a “safe space [for everyone] to discuss and debate without discrimination”.\nMany within the Jewish community have therefore welcomed the full publication, but have questioned why it was necessary for the report to be leaked.\nMarie van der Zyl, Board of Deputies vice-president, said: “We have long called for the release of this report. Questions will continue as to why this document had to emerge as a leak rather than be published by the party itself.\n“We hope that these incidents, first reported in February, will be swiftly investigated, and that justice will be both done and be seen to be done to send a clear message about where Labour stands on this issue.\n“Antisemitism is simply unacceptable whether on campus, in our politics, or anywhere in our society.”\nPaul Charney, Zionist Federation chairman, said: “Despite the brevity of her report, Baroness Royall’s investigation is noteworthy for openly and honestly acknowledging the nexus between antisemitism and anti-Zionism, which lies at the heart of contemporary anti-Jewish prejudice.\n“That her findings were suppressed by Labour’s leadership will once again raise questions about the party’s desire to tackle this issue.”\nOthers have questioned the brevity of the report, which does not enter into any detailed discussion of specific allegations of anti-Semitism.\nJosh Nagli, Union of Jewish Students’ campaign director, said: “Despite the clear acknowledgement of antisemitic incidents occurring within OULC, it remains a concern that they haven’t been appropriately addressed as part of the Labour Party’s disciplinary procedures.\n“We appreciate the publishing of the report in full and the time and effort Baroness Royall dedicated to the report, but many Jewish students at Oxford are likely to be disappointed.\n“The report does not reveal much that wasn’t already thought to be the case. This raises questions as to why the report was initially suppressed, and we believe it is vital that there is full transparency as to why this happened.”\nThe report was commissioned following the resignation of Alex Chalmers as co-chair of the OULC, sparked by a decision by the club to endorse “Israel Apartheid Week”.\nIn his resignation statement, which is reprinted in full within the appendix of the Royall report, Mr. Chalmers wrote: “Whether it be members of the Executive throwing around the term ‘Zio’ (a term for Jews usually confined to websites run by the Ku Klux Klan) with casual abandon, senior members of the club expressing their ‘solidarity’ with Hamas and explicitly defending their tactics of indiscriminately murdering civilians, or a former Co-Chair claiming that ‘most accusations of antisemitism are just the Zionists crying wolf’, a large proportion of both OULC and the student left in Oxford more generally have some kind of problem with Jews.”\nMr. Chalmers has told the Jewish Chronicle that he is disappointed” that Baroness Royall’s report had not gone into more detail regarding that “problem” within the club.\nHe said: “More troubling has been the attitude of the party leadership, which has been an obstacle to transparency at seemingly every turn, suppressing the initial Labour Students investigation, blocking the publication of Baroness Royall’s report, and instead going ahead with the Chakrabarti Inquiry, which was characterised by a lack of focus and banal recommendations.\n“This lack of transparency has undoubtedly fuelled the abuse faced by many of those discussing antisemitism, who have found themselves denounced as liars or Zionist stooges.\n“The Labour Students group ran an initial investigation into the allegations and passed the details to the party, triggering the setting up of the Royall Inquiry.”","url":"https://www.breitbart.com/middle-east/2016/08/04/leaked-copy-suppressed-report-confirms-labour-students-engaged-anti-semitism/"}
