{"authors":["Lianna Brinded"],"date_download":"2018-10-30 22:58:16","date_modify":"2018-10-30 22:58:16","date_publish":"2016-12-09 00:00:00","description":"Davis \"does not believe that business leaders actually understand when [financial] passporting is actually required and is not as vital as many suggest.\"","filename":"data/vaneerConsumption/LeakedBrexitmemoshowshowDavidDavisisignoringLondonsHardBrexitwarnings.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_leaked-brexit-memo-david-davis-city-of-london-corporation-article-50-single-market-2016-12_1540940296.html","title":"Leaked Brexit memo shows how David Davis is ignoring London's 'Hard Brexit' warnings","title_page":"    Leaked Brexit memo: David Davis, City of London Corporation, Article 50, Single Market - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"David Davis Getty LONDON — A leaked memo detailing a meeting between Britain's chief Brexit negotiator and the City of London Corporation has given some incredible insight into how the UK is being represented in talks with the EU.\nThe memo, circulated within the City and leaked to the Financial Times, is dated November 15 and details how the London business community perceives the negotiating stance of David Davis, Britain's Secretary of State for Leaving the EU.\nThe memo gives insight into how Davis is approaching the EU negotiations and how worries over the biggest threats to the country from a \"hard Brexit\" are largely being pushed aside.\nHere are some of the highlights:\nDavis does not think US bank employees will relocate to Europe— The memo suggests that Davis does not believe what bank CEOs say, like JPMorgan boss Jamie Dimon, when they warn that tens of thousands of jobs may be relocated to somewhere else in Europe.\n\"[Davis] queried whether the employees of US banks warning of relocating in Europe would actually relocate, given the unattractiveness of Frankfurt and other cities in the EU, in comparison with London. As a result, jobs will go back to New York not Europe.\"\nDavis is \"not interested\" in a transition deal to make the pain of breaking off from the EU less \"sudden\"— The memo has a section which describes how he does not accept the idea from the Bank of England governor Mark Carney for a transitional period to phase in any Brexit deal. A transitional deal could maintain the UK's single market status until at least 2021, if Article 50 is triggered next year as planned.\nSpeculating on the positioning of certain countries, he thought that Spain would not, ultimately, pose a problem in the negotiations, neither would Germany but believed France would be the most hostile and difficult to compromise with.\nFrance poses a threat to Brexit negotiations— The City of London Corporation says in its Brexit meeting notes that Davis \"believed France would be the most hostile and difficult to compromise with\" while Spain and Germany \"would not, ultimately, pose a problem in the negotiations, neither would Germany.\"\nHe \"Opined that the EU Member States, such as France had 'no faith' in their economic models and ability to compete with an \"Anglo-Saxon approach',\" the memo added.\nDavis is \"emphatic\" over immigration control— This signals a big push for a \"hard Brexit\" because EU officials have repeatedly said that Britain cannot expect to stay in the Single Market and opt out of the Freedom of Movement at the same time.\n\"Emphatic that UK will 'take back control of its borders' but in the national interest. Speculated that a bespoke solution of permits and points style system would be used to determine entry to the UK,\" said the memo.\nApparently, Davis \"d oes not believe that business leaders actually understand when [financial] passporting is actually required and is not as vital as many suggest\"— The loss of passporting rights following Brexit is one of the biggest fears in the City of London. If the passport is taken away, then London could cease to be the most important financial centre in Europe, costing the UK thousands of jobs and billions in revenues.\nDavis thinks that Britain will be able to do a CETA style deal— The memo says Davis is aware that it is unlikely that the UK will achieve access to the Single Market but \"stated that if a trade deal such as the Canadian Comprehensive Economic and Trade Agreement (CETA) could be agreed, it would be unlikely to pose a significant problem as 'most advantages' would be gained.\"\nCETA took more than seven years to negotiate and nearly collapsed at the 11th hour before it was finally signed by the Canadian government and EU. The time it took to negotiate the deal was evidence of just how complex and time-consuming negotiating international free-trade deals can be. Trade expert Linda Lim told Business Insider that this kind of deal usually takes at least five years to agree, with some taking even longer.\nFor the full memo, click here.","url":"https://www.businessinsider.com/leaked-brexit-memo-david-davis-city-of-london-corporation-article-50-single-market-2016-12"}
