{"authors":["Leeor Samocha For Dailymail.Com"],"date_download":"2018-10-23 04:22:29","date_modify":"2018-10-23 04:22:29","date_publish":"2017-03-16 15:36:49","description":"She's getting ready to release her second studio album.And on Thursday's Ellen DeGeneres Show, Lea Michele looked vibrant and excited as she chatted with the comedienne about the upcoming record.","filename":"data/vaneerConsumption/LeaMicheletalksbreakupsongsinnewalbum.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E5521E100000578-0-image-a-11_1489677862852.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320646_Lea-Michele-talks-breakup-songs-new-album_1540268549.html","title":"Lea Michele talks breakup songs in new album","title_page":"Lea Michele talks breakup songs in new album | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's getting ready to release her highly-anticipated second studio album.\nAnd on Thursday's Ellen DeGeneres Show, Lea Michele looked excited as she chatted with the comedienne about the upcoming record.\nThe 30-year-old multi-talented star admitted that the album, titled Places, will include a few break up songs, which allowed her to be honest with her fans and confront past relationships.\nScroll down for video\nConfidence: On Thursday's Ellen DeGeneres Show, Lea Michele looked vibrant and excited as she chatted with the comedienne about the upcoming record\n'I'm in a very positive place in my life - but of course, love has its ups and downs,' she began, 'And there's a few of those break up songs on the album.'\nWhen the beloved morning show host prodded the Glee alumna to reveal who the songs are about, Michele hinted that listeners would have to guess that on their own.\n'You don't want to give anyone or any story in particular more attention than it already deserves, but for me, my music is my time to be honest.\nWho is it?! When the beloved morning show host prodded the Glee alumna to reveal who the songs are about, Michele hinted that listeners would have to guess that on their own\n'So, be careful dating a singer or you might get Taylor Swifted!'\nIt's rumoured that a track on the album, named Hey You, is about Michele's boyfriend and Glee co-star Cory Monteith, who died in 2013 of heroin- and alcohol-induced toxicity.\nLea's other public relationships include Glee co-stars Matthew Morrison and Mark Salling, Theo Stockman, and Matthew Paetz.\n'You might get Taylor Swifted!' Taylor has made a career from writing about exes in her songs\nThe Scream Queens star - looking flawless in a light mint dress with pink floral pattern by Saloni Official - also confessed that though she loved her first album, the second one hits closer to home.\nShe said: 'This album, for me, was kind of coming back to my roots. I'm in a different place in my life, I'm also not on a show where I'm singing all the time as well, so I can really just focus on this album. I'm going to be touring, it's really exciting.'\nEllen then suggested that she and Lea should add a photo to the actress's growing 'bed series' - a funny take on Mario Testino's Towel Series, in which Lea posts nearly naked photos from different beds she sleeps in while traveling.\nAw! Ellen then suggested that she and Lea should add a photo to the actress's growing 'bed series,' ending up with the actress and morning show host spooning\nThe pair got on top of a bed onstage and posed for photos, even having a pretend pillow fight\nThe pair got on top of a bed onstage and posed for photos, even spooning for one.\nPlaces is available for pre-order and is set for release on April 28.\nThe songstress has already released Love Is Alive and Anything Is Possible as the first two singles from the album.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320646/Lea-Michele-talks-breakup-songs-new-album.html"}
