{"authors":["Rachel Mcgrath For Dailymail.Com"],"date_download":"2018-10-23 02:55:14","date_modify":"2018-10-23 02:55:14","date_publish":"2016-01-11 15:21:42","description":"Gloria Cevallos sued the celebrity couple in October 2014 claiming she'd been insulted and called names by other household employees before being fired.","filename":"data/vaneerConsumption/LeAnnRimesandEddieCibrianagreeonsettlementwithfiredhousemaid.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/2FD3AA0D00000578-0-image-a-7_1452524986379.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394046_LeAnn-Rimes-Eddie-Cibrian-agree-confidential-settlement-fired-housemaid-sued-hostile-work-environment_1540263314.html","title":"LeAnn Rimes and Eddie Cibrian 'agree on settlement with fired housemaid'","title_page":"LeAnn Rimes and Eddie Cibrian 'agree on settlement with fired housemaid' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"LeAnn Rimes and Eddie Cibrian have reached a settlement with a former maid who filed a lawsuit against them.\nGloria Cevallos sued the celebrity couple in October 2014 claiming she'd been insulted and called names by other household employees before being fired.\nHowever, Cevallos has now withdrawn her lawsuit, TMZ reported Monday.\nScroll down for video\nNo more legal battle: Eddie Cibrian and LeAnn Rimes, pictured at LAX last month, are reported to have reached a settlement with former maid Gloria Cevallos who was fired in 2014 and subsequently sued them\nIn her legal documents, the maid alleged that she was called 'a fat old lady' and an 'old Salvadoran b****h' by two other women in Eddie and LeAnn's employment\nEddie's mother Hortensia was also mentioned in the lawsuit, according to TMZ.\nCevallos said she overheard Eddie's mom complaining about the state of the house to him.\nThe former maid claimed she heard Hortensia tell Eddie that he must make one of the employees pay for the disarray by firing one of them.\nTrouble with the help: After the celebrity couple agreed the confidential deal, the former housemaid dismissed her lawsuit against them\nMeanwhile, the uneasy relationship between LeAnn, 33, and Eddie's ex-wife Brandi Glanville, 43, almost threatened to overshadow the start of a new year.\nThe Bravo reality star had made an emotional request to her 42-year-old former spouse begging for the country singer to stop flaunting her closeness with Brandi and Eddie's two sons Mason, 12, and Jake, eight.\nShe said in an email that seeing the boys with their stepmother caused her to 'cry myself to sleep'.\nThe message appeared to have got through as on Saturday, LeAnn opted against sharing a picture of her stepsons online.\nThe singer shared a message about making breakfast for her 'fam', but despite the pointed reference to the two boys there was no photo attached.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394046/LeAnn-Rimes-Eddie-Cibrian-agree-confidential-settlement-fired-housemaid-sued-hostile-work-environment.html"}
