{"authors":["Alicia Menendez"],"date_download":"2018-10-31 01:45:00","date_modify":"2018-10-31 01:45:00","date_publish":"2018-09-14 15:20:36","description":"On Wednesday, the Planned Parenthood Federation of America announced that Dr. Leana Wen will be the next president of Planned Parenthood. Wen, 35, will be the first millennial and the first doctor in nearly 50 years to helm the organization, and she…","filename":"data/vaneerConsumption/LeanaWenPlannedParenthoodsNewPresidentGetsCandidAboutOvercomingSelfDoubtTheFightsAhead.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/d2839d3c-c342-4b69-90bf-fc5cc3d68a61-leanawen.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_leana-wen-planned-parenthoods-new-president-gets-candid-about-overcoming-self-doubt-the-fights-ahead-11913059_1540950300.html","title":"Leana Wen, Planned Parenthood's New President, Gets Candid About Overcoming Self-Doubt & The Fights Ahead","title_page":"Leana Wen, Planned Parenthood's New President, Gets Candid About Overcoming Self-Doubt & The Fights Ahead","title_rss":"NULL","source_domain":"bustle.com","text":"On Wednesday, the Planned Parenthood Federation of America announced that Dr. Leana Wen will be the next president of Planned Parenthood. Wen, 35, will be the first millennial and the first doctor in nearly 50 years to helm the organization, and she will start in the role on Nov. 12. In her current position as the Baltimore City health commissioner, Wen has brought the city’s infant mortality rate to record lows and started a program to provide free eyeglasses to school children. She’s also shown a willingness to go to the mat for health access and reproductive rights, encouraging the city to file suit against the Trump administration over cuts to teen pregnancy prevention funds.\nBustle spoke with Wen about how her upbringing impacts her approach to public health, her initial reservations about accepting the role and why she ultimately decided to take it on, and what she sees as the biggest fight ahead.\nAlicia Menendez: So much of your professional experience involves working to address health disparities. How have your personal experiences informed your passion for this particular element of public health?\nDr. Leana Wen: I know the work of Planned Parenthood and love the work of Planned Parenthood personally, because I've been a patient of Planned Parenthood. My little sister has been a patient of Planned Parenthood. My mother was a patient of Planned Parenthood.\nMy family brought me here just before I turned 8, and we — like many other immigrants — really struggled. My parents worked multiple jobs. We were dependent on food stamps. We were dependent on Medicaid. There were several times that we were evicted because we couldn't make rent. I saw all the time growing up how challenging it is to make the choices between food and medications, between rent and health insurance. And I saw all the time what happens when people have to make these gut-wrenching choices, that it literally is a life-and-death decision that nobody should have to make.\nSteven Senne/AP/Shutterstock\nAM: Given that experience then, do you view a legal right to an abortion more as a question of a right to privacy or as a question of economic justice?\nLW: It's both and more. I see it first as a health issue because I've seen what happens when women don't have access to medical care, including safe, legal abortions. Working in the ER, I treated a young woman who came in lying in a pool of blood, without a pulse. We did everything we could in the ER to try to save her, but we failed, and she died. And it turns out that she didn't have access to health care and resorted to having her cousin attempt an abortion on her at home.\nThis is what's at stake when women don't have access to health care, and when women don't have access to safe, legal abortions. It's a health care issue. It's also an economic justice issue. It's also a privacy issue. Why should government and politicians be making decisions for women about their bodies and their health? You may have your own opinion about abortion, but you don't have that right to impose that opinion on anyone else. I want to live in a society where society trusts women, and the ties between women's reproductive autonomy and their ability to live the life they choose are undeniable.\nAM: Can you give us any additional insight into Planned Parenthood’s process of selecting you for the role and what that was like?\nLW: I don't know that I am the most qualified to speak about this process, [but] I do want to share with you the thought process that I went through. I share this with you with some hesitation, because I don't want in any way to come across as if I'm uncertain about my decision to be the President of Planned Parenthood. This is the honor of a lifetime. I do have to say that it's something that I went into with some hesitation, and it's because of this sense of overwhelming responsibility.\nSo what am I thinking taking on this extraordinary challenge? I hope that you see my telling you this as being normal, and that the readers will see this as being normal because all of us have gone through periods of having self-doubt, of having a challenge that seemed really big.\nThis is the fight of our time. Everything is at stake, and everything is on the line. The person leading Planned Parenthood is not just leading an organization — she's also leading a movement. And so I thought to myself, who am I, this 35-year-old immigrant doctor, to take this on? I mean what hubris do I have that makes me think that I even have this, that I can do this?\nI also thought, on a selfish level, I love my job in Baltimore. I've put my heart and soul into being the health commissioner in the city. I love my city. I also have a baby. So what am I thinking taking on this extraordinary challenge?\nI hope that you see my telling you this as being normal, and that the readers will see this as being normal because all of us have gone through periods of having self-doubt, of having a challenge that seemed really big. And being the President of Planned Parenthood is an awesome responsibility.\nBut for me, it came down to this: At the Baltimore City Health Department, I work with many recent graduates and young professionals. Since November of 2016, they've been have been asking me, what can I do? And my message to them has always been, you need to do what you can now. You can't wait. That the cavalry isn't coming. The arc of the universe may bend toward justice, but it's not going to get there on its own. We are the cavalry. We are the ones that we've been waiting for.\nThe single biggest public health catastrophe of our time is the threat to women's health. And I am so deeply troubled by how women's health, specifically, is singled out.\nAM: What do you see as the biggest fight before you?\nLW: The single biggest public health catastrophe of our time is the threat to women's health. And I am so deeply troubled by how women's health, specifically, is singled out. It's stigmatized, and it's attacked. It just doesn't make sense to me that one aspect of health care is treated differently than anything else. Think about the injustice here. Imagine if we started asking about whether vasectomies should be legal? And then we passed laws to restrict access to vasectomies? It's ludicrous.\nBaltimore Sun/Tribune News Service/Getty Images\nAM: As you look at Supreme Court nominee Brett Kavanaugh's record, as you watch the confirmation hearing, what's the single biggest alarm bell that's going off in your own mind?\nLW: If Brett Kavanaugh is confirmed, we're going to be paying for it with women's lives. We've seen that Donald Trump has a litmus test for judicial nominees, and that's overturning Roe v. Wade. We've seen the long record that Brett Kavanaugh has of restricting women's access to care. The fact that he has not said anything in his hearings that will reassure us in any way that he will protect a woman's right to access the reproductive care that we need. I've seen what's at stake when there’s safety net women's care closing around the country, and women don't have access to basic health care like cancer screenings, STD tests, and family planning. And this is someone who will worsen the attacks on women's health and put people's lives in jeopardy.\nAM: You've already gone toe to toe with the Trump administration over the Affordable Care Act and cuts to teen pregnancy prevention funds. What have you learned from those fights?\nLW: Several things. One is that now is the time to fight with everything that we have. There are injustices that we see everywhere, but we cannot back down and we have to fight with everything that we have. So in Baltimore last year when our teen pregnancy prevention programs were cut, part of us was thinking, who are we? We're a city health agency. Who are we to sue the Trump administration?\nFor me, I saw the 20,000 students in our city who wouldn't have access to reproductive health care education. The young people who should be empowered to choose the life that they want to live for themselves. And so we sued, and we won. We recently sued the Trump administration again [because we believe it is] intentionally and willfully sabotaging the Affordable Care Act and putting at risk the lives of our most vulnerable residents who already bear the brunt of disparities and inequities.\nThis interview has been edited and condensed for clarity.\nClarification: This post has been updated to clarify that Leana Wen is the first doctor to take the role of president of Planned Parenthood Federation of America in nearly 50 years.","url":"https://www.bustle.com/p/leana-wen-planned-parenthoods-new-president-gets-candid-about-overcoming-self-doubt-the-fights-ahead-11913059"}
