{"authors":[],"date_download":"2018-10-23 05:48:43","date_modify":"2018-10-23 05:48:43","date_publish":"2016-01-26 00:00:00","description":"Take the train to the Queens neighborhood of Flushing, and you'll find newcomers who are reshaping the largest Chinese community of any city outside of Asia.","filename":"data/vaneerConsumption/LeavingChinasNorthImmigrantsRedefineChineseInNewYork.json","image_url":"https://media.npr.org/assets/img/2016/01/25/20160119_chineseimmigrantsflushing-1345_wide-2ddb5876622c5facdf2e152d0f1ce38f15c8d9dd.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=463857599_1540273723.html","title":"Leaving China's North, Immigrants Redefine Chinese In New York","title_page":"Leaving China's North, Immigrants Redefine Chinese In New York : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ROBERT SIEGEL, HOST:\nFor decades, most immigrants from China have come from its southern provinces. In recent years, more newcomers are coming from the north and many are landing in New York City. It's already home to the largest Chinese community of any city outside of Asia. And NPR's Hansi Lo Wang reports that the new immigrants are making a big impact.\nHANSI LO WANG, BYLINE: If you want to meet some of the newest Chinese immigrants of New York, don't go to New York's Chinatown. Take the train to the Queens neighborhood of Flushing and walk down to the basement of the local YMCA.\nCORBIN: A.\nUNIDENTIFIED PEOPLE: A.\nCORBIN: E.\nUNIDENTIFIED PEOPLE: E.\nCORBIN: I.\nUNIDENTIFIED PEOPLE: I.\nCORBIN: O.\nUNIDENTIFIED PEOPLE: O.\nWANG: We're in a packed classroom where there's a mix of immigrants learning English.\nJIAO LIU: And my name is Jiao Liu, and I'm from China. I came here four years ago.\nWANG: Liu moved from Liaoning, a province in northern China. That region has not been a traditional source of immigrants to the U.S. But more families from there are now calling Flushing home, says Geng Lei, another student in the class.\nGENG LEI: (Foreign language spoken).\nWANG: \"There's especially more people from the northeastern provinces,\" she says in Mandarin. \"And more and more people from Henan.\" Geng grew up in Shandong province where she says she had a good job as a musician playing traditional Chinese music. So why did she leave? She says to start a family with her husband who was already working in America.\nLEI: (Foreign language spoken).\nWANG: \"Some people in China have gotten rich,\" Geng tells me, \"and want their children to go to school overseas. Plus, China's environment and air quality aren't good,\" she adds to her list of reasons why more Northerners like her are coming to the U.S.\nPETER KWONG: What you notice now is a new group, much more diverse, coming from the north.\nWANG: That was Peter Kwong, a professor at Hunter College who studied Chinese immigrant communities. He says numbers about this group are hard to come by. But broadly, they tend to be from cities, and they're often professionals, small business owners and government bureaucrats with the means to buy valid visas. Kwong adds many are coming in search of economic opportunities and stability they couldn't find in northern China.\nKWONG: Many of these regions are much less developed than the south. So in the process of modernization, they're the one under a lot of pressure. A lot of people decide they want to leave.\nWANG: Walk through the streets of Flushing and if you understand Chinese, you'll quickly hear this is not your average Chinatown where Cantonese and Fuzhounese are the dominant dialects. Here, it's Mandarin in lots of different accents, says Bon Yu, who moved from Shandong's largest city, Qingdao.\nBON YU: Like, for example, ni hao ma, but we say ni hao ma, ni hao ma - I can tell the slight difference because like, you know, you're from their city so, you know, you know their accent.\nWANG: More Northerners living in Flushing also means that restaurants here are redefining what Chinese food means in America.\nYU: We are here right now in Flushing New World Mall downstairs. It's a food court.\nWANG: OK, so show me where can we find northern Chinese food?\nYu leads me to a food stall serving dishes from Qingdao and another stall with freshly-made Chinese-Korean-style dumplings from the northeast - some of the latest ingredients to make up the centuries-long story of Chinese immigrants in America.\nSABRINA ZHANG: For northern people, before they don't really want to come outs to America, but later on people notice that maybe it's better if you see more in the world.\nWANG: Sabrina Zhang and her mother are seeing more in the world. They left Liaoning four years ago to join her father in the U.S. Now she's studying for a degree in accounting and working part-time at the Flushing YMCA's New Americans Welcome Center, helping other recent immigrants register for English classes. She says Flushing is a good place to start.\nZHANG: It's still like in China. If you want to really get along with American people, you need to really know, like, what life they have. So if you still in Flushing then maybe the life you see is still Chinese people.\nWANG: Eventually, Zhang says, she wants to see even more in her new American world. Hansi Lo Wang, NPR News, Flushing, N.Y.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=463857599"}
