{"authors":["Breitbart News"],"date_download":"2018-10-30 18:00:18","date_modify":"2018-10-30 18:00:18","date_publish":"2018-08-06 23:31:23","description":"The LeBron James series looks at the changing role of athletes in the current political and cultural climate against the backdrop of the NBA.","filename":"data/vaneerConsumption/LeBronJamesSetsShowtimeDocumentaryShutUpandDribble.json","image_url":"https://media.breitbart.com/media/2018/08/Lebrondribbledoc1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_08_06__1540922418.html","title":"LeBron James Sets Showtime Documentary 'Shut Up and Dribble'","title_page":"LeBron James Sets Showtime Documentary 'Shut Up and Dribble'","title_rss":"NULL","source_domain":"breitbart.com","text":"BEVERLY HILLS, Calif. (AP) — LeBron James has yet to play a minute for the Los Angeles Lakers, yet the NBA superstar is already busy in Hollywood.\nJames is behind the three-part documentary series, “Shut Up and Dribble,” announced Monday by Showtime.\nSet to debut in October, the same month James suits up for his new team, the series looks at the changing role of athletes in the current political and cultural climate against the backdrop of the NBA.\nIts title comes from a comment Fox News host Laura Ingraham made to James in February when she sought to rebuke him for talking politics during an interview.\nJames is the executive producer of the series along with his business partner Maverick Carter and his agent Rich Paul. Gotham Chopra, who directed Showtime’s “Kobe Bryant’s Muse” in 2015, helmed the project.\nThe series traces the modern history of the league and its players starting with the 1976 merger of the freewheeling American Basketball Association and the National Basketball Association, how the top players have expanded their notoriety off the court in fields such as business and fashion while becoming icons in the process.\nJames has another show, “The Shop” debuting Aug. 28 on HBO in which he leads conversation and debate among his guests in barbershops around the country.\nJames found himself drawn into politics last week when President Donald Trump unleashed a withering attack on him in a tweet after an interview aired with CNN anchor Don Lemon in which he deemed Trump divisive.\nAlthough James has long been a Trump critic, calling the president “U bum” in a 2017 tweet, the tweet was Trump’s first attack on the player, who just opened up a school for underprivileged children in his hometown of Akron, Ohio.\n“Lebron James was just interviewed by the dumbest man on television, Don Lemon,” Trump posted. “He made Lebron look smart, which isn’t easy to do.”","url":"https://www.breitbart.com/entertainment/2018/08/06/lebron-james-sets-showtime-documentary-shut-up-and-dribble/"}
