{"authors":["Michael Cunningham"],"date_download":"2018-10-30 19:24:30","date_modify":"2018-10-30 19:24:30","date_publish":"2018-06-27 17:20:00","description":"LeBron James is chasing rings, so if he becomes a free agent this weekend he won’t be signing...","filename":"data/vaneerConsumption/LeBronJameswontbesigningwithHawksbuthislatestdecisio.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/USAT_Sports/2018/06/25/Images/111178914_gty_970199014_100486157-e1529930490170.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-hawks_lebron-j_e5e81616f9162092ac6093945d7c9025__1540927470.html","title":"LeBron James won’t be signing with Hawks, but his latest decisio","title_page":"LeBron James won’t be signing with Hawks, but his latest decisio","title_rss":"NULL","source_domain":"ajc.com","text":"LeBron James is chasing rings, so if he becomes a free agent this weekend he won’t be signing with the Hawks, who are years away from contending for an NBA championship.\nIn case that weren’t already obvious, James diplomatically crossed teams such as the Hawks off his free-agent list in the aftermath of Cleveland’s loss to the Warriors in the NBA finals earlier this month.\n\"Being a part of the start-fresh mode is something that you definitely don't want to be a part of,\" James told reporters.\nJames has until Friday to decide whether to opt out of his contract with the Cavaliers and become a free agent. If he does so, the Hawks won’t be one of his suitors but that doesn’t mean his choice of teams won’t affect them.\n» More: Trae Young tweets to recruit LeBron James\nTwo teams reportedly set to make pitches to James, the Sixers and Rockets, would need to create salary-cap space to sign him. The Hawks will have about $20 million in cap space they can use to take on high-salaried veteran players in trades for the price of draft picks, young players or both.\nIf the Sixers get a commitment from James, speculation about potential trades to clear cap room have centered on Jerryd Bayless, who will make $8.6 million in the final year of his contract in 2018-19. The Sixers own an extra first-round pick in the 2021 draft after they acquired it from the Suns (via the Heat) in a draft-night trade last week. Philadelphia also has several young players they could include in trades.\nIt would be harder for the Rockets to create the cap space to sign James outright.\nThey may have to commit significant cap space to retain promising young center Clint Capela, a restricted free agent, if he signs an offer sheet with another team. Also, two of Houston’s high-priced veterans, Ryan Anderson and Eric Gordon, will be difficult to move because they have two years left on their contracts. The Hawks, for one, are reluctant to take on veterans in trades who have multiple years left on their deals.\nHawks GM Travis Schlenk will be looking to make a deal similar to the trade he executed last summer that brought the Hawks a draft pick in exchange for absorbing salaries.\nThat three-team trade with the Nuggets and Clippers netted the Hawks a 2018 first-round pick along with Jamal Crawford and Diamond Stone. The Hawks subsequently bought out Crawford and last week used the draft pick they acquired, No. 30 overall, to select Villanova forward Omari Spellman.\nEven if the Hawks don’t execute any deals with a team looking to clear cap space for James, they could do so once ripples from his decision spread throughout the league.\nThe team that James picks will be looking to build a roster to his liking, and the contenders that miss out on James also will be looking to improve. The Hawks can get involved in those kind of deals, too, with Kent Bazemore, Dennis Schroder and Dewayne Dedmon likely to have some trade value for contending teams.\nIn January 2017, before Schlenk was hired, the Hawks made a trade that swapped a veteran for a draft pick and players with expiring contracts.\nIn that deal, the Hawks sent Kyle Korver to the Cavaliers for a protected first-round pick, Mike Dunleavy and the rights to Mo Williams. That draft pick will convey in 2019 or 2020 if it isn’t within the top 10 selections.","url":"https://www.ajc.com/blog/atlanta-hawks/lebron-james-won-signing-with-hawks-but-his-latest-decision-could-impact-them/ZPKFnkb5MMrdBpRFOOzCyH/"}
