{"authors":["Andrew Hutchinson"],"date_download":"2018-10-30 19:21:13","date_modify":"2018-10-30 19:21:13","date_publish":"2014-11-18 00:00:00","description":"Almer Lee, the player who broke the color barrier for Arkansas basketball, passed away Sunday night, according to head coach Mike Anderson.","filename":"data/vaneerConsumption/LeefirstAfricanAmericanbasketballplayeratArkansasdiedSunday.json","image_url":"https://media.arkansasonline.com/img/photos/2014/11/18/almer_lee_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2014_nov_17_lee-first-_4192185cea8603b5510b3d7f661e7217__page=1_1540927273.html","title":"Lee, first African-American basketball player at Arkansas, died Sunday","title_page":"Lee, first African-American basketball player at Arkansas, died Sunday","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Almer Lee, the first African-American to earn a letter in basketball at Arkansas, died Sunday night, according to head coach Mike Anderson.\nHe was 63.\n\"I found out that Almer Lee, an Arkansas great, passed away last night,\" Anderson said. \"I want to extend our condolences to his family on the passing of a true, true Razorback.\"\nHe lettered for the Razorbacks in 1970 and 1971, leading the team in scoring each year. He averaged 17 points per game as a sophomore and 19.2 points as a junior. His senior season was limited to only five games because of injury.\nDuring his time at Arkansas, he played for head coaches Duddy Waller and Lanny Van Eman.\nAs the first African-American basketball player for the Razorbacks, Lee paved the way for some of Arkansas' best players, including the famous \"Triplets\" - Ron Brewer, Marvin Delph and Sidney Moncrief - that led the Razorbacks to the 1978 Final Four.\nLee came to Arkansas after one year at Phillips County Junior College in Helena-West Helena, where he scored 25.2 points per game during the Region II NJCAA Tournament.\nHe was a standout at Fort Smith Northside High School before going to college. With the Grizzlies, he earned All-State honors twice, won a state championship and was a consensus prep All-American.\nIn 2011, he was inducted into the University of Arkansas Sports Hall of Honor.","url":"https://www.arkansasonline.com/news/2014/nov/17/lee-first-african-american-basketball-player-arkan/?page=1"}
