{"authors":[],"date_download":"2018-10-30 00:56:31","date_modify":"2018-10-30 00:56:31","date_publish":"2018-07-02 19:17:41","description":null,"filename":"data/vaneerConsumption/LeftyDownSouthObradorWinsMexicanPresidency.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/9754373672_811ae1a803_k-e1530573503342.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860991.html","title":"Lefty Down South: Obrador Wins Mexican Presidency","title_page":"Lefty Down South: Obrador Wins Mexican PresidencyThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Andrés Manuel López Obrador of the Morena Party, the Spanish short for the National Regeneration Movement, won 53.4% of the vote, securing his spot as Mexico’s next President. Riding on a wave of anger and desperation, Obrador more than doubled the next aspirant’s vote. To the electorate, the norm in Mexico will no longer do.\nObrador cast himself as the second coming of Benito Juarez, the renowned liberal reformer and national hero of the 19th century. Like Juarez, Obrador’s populist campaign has championed economic egalitarianism in the midst of unbearable civil strife.\nIn a remarkable year for sectarian violence, even by Mexico’s standards, Obrador has his hands full. Not even the politicians are safe. One hundred thirty candidates or their affiliates were killed this last campaign season. The violence, to Obrador, is the symptom of a far larger problem, corruption. And he has plans to end it.\nAt last night’s acceptance speech, Obrador talked of regeneration:\n“I call on all Mexicans to reconciliation, and to put above their personal interests, however legitimate, the greater interest, the general interest. The state will cease to be a committee at the service of a minority and will represent all Mexicans, rich and poor, those who live in the country and in the city, migrants, believers and nonbelievers, to people of all philosophies and sexual preferences.”\nSome have dubbed his program “economic nationalism,” but a more cogent descriptor would be welfare populism: the redistribution of government incomes from higher to lower level employees; pensions for the elderly; youth education programs; government aid for impoverished southern farmers; and new management of PEMEX, the state-owned oil company.\nNot to dampen the fiesta, but Obrador’s policies do not spell out well for the United States, in English or Spanish. Obrador’s rhetoric against corruption, to be sure, is welcome. Yet, in a country that defines homeownership as a right, some 44 percent of people live in utter poverty. It’s certainly tough to legislate economic prosperity.\nObrador’s intentions may be the best Mexico has seen in a generation, but his policies only point to more Pancho Villa.","url":"https://spectator.org/lefty-down-south-obrador-wins-mexican-presidency/"}
