{"authors":[],"date_download":"2018-10-30 01:16:15","date_modify":"2018-10-30 01:16:15","date_publish":"2018-07-23 21:24:11","description":null,"filename":"data/vaneerConsumption/LeftistToleranceUpdateWarrenSupporterPunchesHerGOPOpponent.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/6958450820_5b95e7b90c_z.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862175.html","title":"Leftist Tolerance Update: Warren Supporter Punches Her GOP Opponent","title_page":"Leftist Tolerance Update: Warren Supporter Punches Her GOP OpponentThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"He seems nice:\nBREAKING: Republican opponent of Elizabeth Warren punched in the face by Elizabeth Warren supporterpic.twitter.com/xRJGqXFVsg — Wired Sources (@WiredSources) July 22, 2018\nWe can quibble about whether or not shoving a bullhorn into a guy’s face is tantamount to a punch but it’s close enough for our purposes. Personally, I prefer to not be hit in the face with anything. (Side note: reality keeps smacking me there anyway.)\nTurtleboy (a hidden gem on the internet but WARNING: there’s some adult language there) has more:\nThe white guy in the LIBERAL shirt who assaulted the brown guy by shoving his megaphone down his throat, for the crime of having a different political opinion and being vocal about it, is the one calling other people racist and preaching tolerance.\nEmboldened by recent calls to public harassment by Maxine Waters and other leaders on the left, the perpetually unhinged progressive loons are, if possible, becoming even more unhinged.\nThe calls to violence from leftists didn’t just crop up in recent months. They have been using their self-reinforced misconceptions about people they have never met to justify violent “responses” ever since President Trump took office. This HuffPo piece from last year uses a complete lack of logic to say that violent responses from the left are logical.\nShortly after HuffPo posted that, the none-too-conservative Chicago Tribune ran an op-ed titled “Liberal America has a political violence problem.” It may have been written by a Republican, but the fact that it made it into the Tribune is significant. Liberal media outlets rarely let the home team get taken to task unless it’s a problem they are a) truly worried about and b) no longer able to lie about.\nThis surely won’t be the last incident of this kind between now and November, especially in the deep blue states, where the #Resist progressives are basically savage animals running free on a wildlife preserve. The 21st Century penchant for violent civil unrest by American leftists predates Trump’s presidency by quite a while (Ferguson riots, anyone?), so it’s ridiculous whenever they try to use the childish excuse that he made them that way. They just are that way. Protests and rioting are easier than knocking on doors or working a phone bank to get candidates elected. Rather than work for something positive in advance, they’d rather throw tantrums before and after an election.\nOf course, this is all done in the name of tolerance. They believe their opponents to be intolerant and justify intolerance in return because being an adult is super hard.\nI’ve written for years that progressivism is simply the toddler mindset manifested as a political philosophy in adults. American progressives are currently in the midst of a multi-year diaper soiling tantrum that is showing no signs of letting up any time soon.\nAs this seems to be their only real election strategy for this year we may as well let them cry it out.","url":"https://spectator.org/leftist-tolerance-update-warren-support-punches-her-gop-opponent/"}
