{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 19:47:46","date_modify":"2018-10-30 19:47:46","date_publish":"2015-08-10 13:52:07","description":"Left-wing groups have united in an \"Astroturf\" campaign to create a false impression of support for the Iran deal at town hall meetings.","filename":"data/vaneerConsumption/LeftsPlantoAstroturfTownHallMeetings.json","image_url":"https://media.breitbart.com/media/2015/08/image3.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_10__1540928866.html","title":"Left's Plan to 'Astroturf' Town Hall Meetings","title_page":"Iran Deal: Left's Plan to 'Astroturf' Town Hall Meetings","title_rss":"NULL","source_domain":"breitbart.com","text":"Several left-wing groups have united in an “Astroturf” campaign to create a false impression of public support for the Iran deal at town hall meetings across the nation.\nThe effort, called “60 Days to Stop a War,” is being coordinated by MoveOn.org, an anti-war group, the National Iranian American Council, a pro-Iran lobby group; Daily Kos, a left-wing blog site; and other left-wing groups.\nAs in the Obamacare effort in 2009, the apparent goal of “60 Days” is to create a media sensation that can drown out the American public’s overwhelming opposition.\nA statement on the “60 Days” website declares:\nRepublicans are trying to start a war with Iran by rejecting the historic deal announced by the U.S., Iran and five other world powers that will prevent Iran from obtaining a nuclear weapon. Republicans can’t start their war without votes from Democrats… Experts agree that without this agreement, we could face a new war in the Middle East. We have 60 days to defend diplomacy and stop a war. Find a town hall event with your member of Congress, and let them know you want diplomacy, not war.\nSome of the members of Congress targeted by the 60 Days effort, such as Rep. Doug LaMalfa (R-CA), are likely opponents of the Iran deal. The goal of the campaign is to create media attention, not to switch votes.\nA list of the events, in chronological order, follows. All times local.\n1. Sen. Jeff Merkley (D-WA) – Mon., Aug. 10, 2:30 p.m. – Wilsonville Public Library, 8200 Southwest Wilsonville Road, Wilsonville, OR 97070\n2. Rep. Diane Black (R-TN) – Mon., Aug. 10, 6:00 p.m. – Cannon County Courthouse, 200 West Main St., Woodbury, TN 37190 United States\n3. Rep. Robert Pittenger (R-NC) – Mon., Aug. 10, 6:30 p.m. – Marvin Ridge High School, 2825 Crane Road, Waxhaw, NC 28173 United States\n4. Rep. Danny Davis (D-IL) – Mon., Aug. 10, 7:00 p.m. – Council Chambers, 425 Hillside Avenue, Hillside, IL 60162 United States\n5. Rep. Tom Rice (R-SC) – Tues., Aug. 11, 10:00 a.m. – Joe’s Grill, 306 Russell Street, Darlington, SC 29532 United States\n6. Rep. John Shimkus (R-IL) – Tues., Aug. 11, 1:00 p.m. – Shawneetown City Hall, 330 North Lincoln Boulevard East, Shawneetown, IL 62984 -RSVP by phone at (618) 252-8271 United States\n7. Rep. Doug LaMalfa (R-CA) – Tues., Aug. 11, 2:30 p.m., Grass Valley City Council Chambers, 125 East Main Street, Grass Valley, CA 95945 United States\n8. Rep. Brett Guthrie (R-KY) – Tues., Aug. 11, 5:30 p.m. – Fiesta Brava Mexican Restaurant, 100 Tanglewood Drive, Taylorsville, KY 40071 United States\n9. Rep. Diane Black (R-TN) – Tues., Aug. 11, 5:30 p.m. -Putnam County Courthouse, 300 East Spring Street, Cookeville, TN 38501 United States\n10. Rep. Marc Veasey (D-TX) – Tues., Aug. 11, 6:00 p.m. – Hampton-Illinois Branch Library, 2951 South Hampton Rd., Dallas, TX 75224 United States\n11. Rep. Doug LaMalfa (R-CA) – Tues., Aug. 11, 6:00 p.m. – Colfax City Council Chambers, 33 South Main Street Colfax, CA 95713 United States\n12. Rep. Robert Pittenger (R-NC) – Tues., Aug. 11, 6:30 p.m. – Charles Mack Citizen Center, 215 North Main Street, Mooresville, NC 28115 United States\n13. Rep. Brett Guthrie (R-KY) – Wed., Aug. 12, 7:30 a.m. – Paula’s Hot Biscuit, 311 West Water Street, Hodgenville, KY 42748 United States\n14. Rep. Tom Rice (R-SC) – Wed., Aug. 12, 9:00 a.m. – Magnolia on Main, 224 East Main Street, Bennettsville, SC 29512 United States\n15. Rep. Hakeem Jeffries (D-NY) – Wed., Aug. 12, 9:00 a.m. – Spring Street Post Office, 1310 Pennsylvania Ave, Brooklyn – Canarsie, NY 11239 United States\n16. Rep. Trent Franks (R-AZ) – Wed., Aug. 12, 10:30 a.m. – Location TBD\n17. Rep. Tom Rice (R-SC) – Wed., Aug. 12, 11:30 a.m. – The Charcoal Grill, 107 North 1st Avenue, Dillon, SC 29536 United States\n18. Rep. Robert Pittenger (R-NC) – Wed., Aug. 12, 6:30 p.m. – Cornelius Town Hall, 21445 Catawba Avenue, Cornelius, NC 28031 United States\n19. Rep. John Shimkus (R-IL) – Thurs., Aug. 13, 9:30 a.m. – Breese City Hall, 500 North 1st Street, Breese, IL 62230 United States\n20. Rep. Lynn Jenkins (R-KS) – Thurs., Aug. 13, 10:30 a.m. – District Office, 3550 SW 5th Street, Topeka, KS 66606 United States – RSVP by phone at (618) 288-7190","url":"https://www.breitbart.com/politics/2015/08/10/iran-deal-lefts-plan-to-astroturf-town-hall-meetings/"}
