{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 20:25:56","date_modify":"2018-10-30 20:25:56","date_publish":"2015-10-01 13:14:26","description":"The left has seized on a remark by aspiring Speaker of the House Kevin McCarthy (R-CA) about the Benghazi select committee.","filename":"data/vaneerConsumption/LeftsFauxOutrageoverKevinMcCarthysBenghaziGaffe.json","image_url":"https://media.breitbart.com/media/2015/09/ap_john-boehner-kevin-mccarthy_ap-photo-wi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_01__1540931156.html","title":"Left's Faux Outrage over Kevin McCarthy's Benghazi 'Gaffe'","title_page":"Left's Faux Outrage over Kevin McCarthy's Benghazi 'Gaffe' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The left has seized on a remark by aspiring Speaker of the House Kevin McCarthy (R-CA) to the effect that the Benghazi select committee in the House has been useful because it has dented Hillary Clinton’s election chances.\nTo Democrats like Rep. Elijah Cummings (D-MD), and liberals like columnist E.J. Dionne, the “gaffe” is proof that the Benghazi investigation has really been all about politics, not about any real scandal that might exist at the core.\nGet that? The death of four Americans while President Barack Obama did nothing; the lies told by Obama and Clinton as they blamed a YouTube video for a terror attack; the secret email server kept by Clinton at her private home; the attempt by Clinton to destroy government emails; the efforts by Clinton staff to punish whistleblowers; the willful cover-ups by the State Department–these, by themselves, are not worthy of investigation, for Democrats.\nMcCarthy certainly earned himself no style points with his clumsy remarks, but he is being accused of saying something he did not actually say. He did not claim that the Benghazi select committee had been organized to damage Hillary Clinton; rather, he said that had been one of its positive political outcomes.\nIs that surprising?\nThe problem is not that Republicans might gain from Clinton’s misconduct; it is the misconduct itself.\nIn any case, it is worth noting that Republican leaders dragged their feet in forming a select committee. They dithered until the release of emails by Judicial Watch that the White House had previously denied to Congress, showing that the administration directed the false “talking points” about the YouTube video. Republican leaders were embarrassed into acting.\nThat’s hardly a point in McCarthy’s favor–but it exposes the left’s faux outrage.","url":"https://www.breitbart.com/politics/2015/10/01/lefts-faux-outrage-over-kevin-mccarthys-benghazi-gaffe/"}
