{"authors":["Lee Stranahan"],"date_download":"2018-10-30 20:41:39","date_modify":"2018-10-30 20:41:39","date_publish":"2017-01-16 17:41:16","description":"As a coalition of far-left protesters converge on Washington, D.C. for the #DISRUPTJ20 event, Breitbart News has learned that groups planning to attend the event were part of violent protests against Donald Trump that led to assaults against supporters and police.","filename":"data/vaneerConsumption/LeftistGroupsPlottingtoDisruptInaugurationHaveAttackedTrumpSupportersBefore.json","image_url":"https://media.breitbart.com/media/2017/01/anti-trump.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_01_16__1540932099.html","title":"Leftist Groups Plotting to Disrupt Inauguration Have Attacked Trump Supporters Before","title_page":"Leftist Groups Plotting to Disrupt Inauguration Have Attacked Trump Supporters Before","title_rss":"NULL","source_domain":"breitbart.com","text":"As a coalition of far-left protesters is converging on Washington, D.C. preparing to cause chaos at the Trump Inauguration during the #DISRUPTJ20 event, Breitbart News has learned that groups planning to attend the event were part of violent protests against Donald Trump that led to assaults against supporters and police, as well as other attacks on pro-liberty groups. One of the organizations involved has specifically reported that Donald Trump supporters are legitimate “targets” for violence.\nThe J20 event was originally planned just after Donald Trump’s election and is supported by a coalition of 75 different anarchist, socialist, and communist groups from across the county.\nThe organizers call the event “a bold mobilization against the inauguration of Donald Trump” and say its goal is “widespread civil resistance to the streets of Washington, DC.”\nOne member of the #DisruptJ20 coalition is the website It’s Going Down, which acts an information resource for the America-hating radical left. Last spring, It’s Going Down reported approvingly on the violent disruption of a Donald Trump event near Pittsburgh, Pennsylvania.\nBreitbart News has identified a number of Pittsburg area groups who have announced their solidarity with the #DisruptJ20 event, including the Pitt Students for a Democratic Society, Pittsburg Autonomous Student Network, the Pittsburgh Student Solidarity Coalition, Pitt Against Debt, the art group NightShade Pittsburgh.\nLast year’s “direct action” against people attending a Donald Trump event gives a test of what the #DisruptJ20 protesters have in store for the Trump inauguration and Trump supporters.\nUSA Today reported on the violent consequences of the group’s actions last year, writing:\nHundreds of demonstrators awaited Trump backers outside the David L. Lawrence Convention Center, dancing and shouting epithets about the presidential hopeful. At the height of the chaos, police shoved and Trump backers lingered for confrontations. A drum pounded, signs waved and megaphones blared near an exit for the rally, which drew thousands of attendees. Trump backers and protesters shouted at each other in some areas. In others, the demonstration had an almost jubilant flair, with protesters dancing as they chanted: “Hey hey, ho ho, racist bigots have to go,” or “F Donald Trump.”\nThe result was violence against people attending the Trump event and law enforcement, a foreboding sign for the upcoming D.C. events. TV Station WPXI reported about last spring’s event:\nOfficers arrested 31-year-old Kennon Hooper, of West Oakland, 27-year-old Lisa Cuyler of Polish Hill and 29-year-old Maxwell Yearick of Perry South. Police said Hooper kicked two officers after they had been pepper-sprayed by protesters. While he was being handcuffed, Cuyler allegedly jumped on an officer’s back. In Yearick’s case, he tried to fight an officer who has just been pepper-sprayed, according to investigators.\nAs Breitbart News reported last year, It’s Going Down bragged about the “full disruption and confrontation” of attendees and justified violence against them, reporting that:\nthe main factor tying Trump’s base together is support for authoritarianism and white supremacy. The main policy points of Trump’s campaign have been rooted in the widespread criminalization, detention, and expulsion of Muslims, Arabs, latin@s, blacks, and other non-whites from the United States. Support of Donald Trump and by extension these aims is enough to justify oneself as a target of anti-racist violence.\nThe Trump event was not the only example of Pittsburg’s far-left community using violent tactics and anarchy against those that they see as legitimate targets. Also last, the publication Three Rivers Rising Tide reported on another disruption by one of the group who’ve pledged support for the upcoming inauguration disruption, writing:\nTwo dozen Pittsburghers stormed into the American Legislative Exchange Council’s (ALEC) Spring Task Force Summit meeting on Thursday evening, disrupting the lobbying group’s Board of Directors Dinner. While ALEC’s Summit is taking place at the Omni-William Penn, the dinner was held a few blocks away at Heinz Hall. Hoisting yellow umbrellas with anti-ALEC slogans, a common prop from the 2014 pro-democracy mobilization in Hong Kong, participants rolled out ‘crime scene’ tape and shouted, “This is a crime scene! ALEC is killing us! With private prisons and attacks on workers fueled by greed and hunger for power ALEC is killing us!\nThe inclusion of the Pittsburgh chapter of Students for a Democratic Society or SDS among the groups supporting the coming #DisruptJ20 event is significant because of the Davis, California SDS chapter was behind Friday night’s violent anti-MILO protest at the University of California.\nThe SDS is a new incarnation of the 1960s radical group of the same name and has deep connections to a racist Marxist group called the Freedom Road Socialist Organization that is plotting the end of the United States as we know it by dividing the country into race-based nations.\nSecurity will be tight for the inaugural and members of the group Bikers for Trump will also be on hand to provide informal security.\nFollow Breitbart News investigative reporter and Citizen Journalism School founder Lee Stranahan on Twitter at @Stranahan.","url":"https://www.breitbart.com/politics/2017/01/16/leftist-groups-plotting-disrupt-inauguration-attacked-trump-supporters/"}
