{"authors":["Associated Press"],"date_download":"2018-10-23 03:47:37","date_modify":"2018-10-23 03:47:37","date_publish":"2016-01-29 19:06:16","description":"CHEYENNE, Wyo. (AP) — The single-engine Cessna aroused suspicion at the Yellowstone Regional Airport even before it landed. The pilot didn't radio the airpor...","filename":"data/vaneerConsumption/Legalfightoverplanehighlightspropertyseizuredebate.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:a16057d47ea449b1980ed364fa1d3064-4PuZeKVXE7cd9005b2c876d6212e-622_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423041_Feds-file-charges-stemming-seizure-plane-cash_1540266457.html","title":"Legal fight over plane highlights property seizure debate","title_page":"Legal fight over plane highlights property seizure debate | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Legal fight over plane highlights property seizure debate\nCHEYENNE, Wyo. (AP) — The single-engine Cessna aroused suspicion at the Yellowstone Regional Airport even before it landed.\nThe pilot didn't radio the airport before landing, prosecutors say. And, as the Cessna taxied to a hangar, they say the pilot and a passenger were lowering sunshades over the windows. That struck officials as odd, considering the plane was about to be stored indoors in a hangar.\nNow the plane is at the heart of a legal dispute over whether the federal government abused its powers in seizing property — or whether the pilot and his friend were part of an elaborate criminal enterprise.\nThis undated booking photo provided by the Park County, Wyo., Sheriff's Office shows Scott Michael Lewis. Federal prosecutors are pressing felony charges against two Colorado men accused of operating an unregistered airplane that authorities claim was involved in a criminal enterprise. The charges follow the government's seizure nearly two years ago of the Cessna airplane after it landed at the municipal airport in Cody, Wyo. Police also confiscated over $250,000 in cash from a Cody hotel room rented by Lewis, the pilot and a passenger. (Park County Sheriff's Office/Powell Tribune via AP)\nAfter an airport worker notified police, officers searched the room at a Holiday Inn where the pilot and passenger checked in after landing on Feb. 27, 2014. Prosecutors say officers found over $250,000 in cash and three allegedly fake Idaho driver's licenses.\nPilot Scott Michael Lewis, 27, has filed a claim in a federal forfeiture case pending in Wyoming asserting he has a legitimate interest in the plane and the money. San Francisco lawyer David M. Michael, representing Lewis in the forfeiture case, has contested the government's allegations in court papers and said the cash was from unspecified legitimate activities. He is demanding the funds back.\n\"In fact, there was absolutely no evidence, beyond pure speculation and threadbare suspicions,\" linking Lewis or his hotel room to any illegal activity, Michael wrote.\nKip Crofts, U.S. attorney for Wyoming, told Lewis in November that he was the subject of an investigation by the U.S. Homeland Security Department involving allegations of federal crimes including conspiracy to distribute marijuana, money laundering, identity theft and operation of an unregistered aircraft.\nBut the criminal charges Crofts' office filed this month don't allege any violation of drug laws. A federal indictment charges Lewis and passenger Gilbert Wayne Wiles Jr., 38, with conspiracy to operate an unregistered aircraft and aiding and abetting the operation of an unregistered aircraft.\nThe federal government oversees many aspects of air travel, including the occasional prosecution of people accused of operating unregistered aircraft. In one such recent high-profile case, the government prosecuted Doug Hughes, the former Florida mail carrier who landed a gyrocopter on the lawn of the U.S. Capitol last year. Hughes ultimately pleaded guilty to flying the craft without a license and is awaiting sentencing.\nJohn R. Powell, a spokesman for the U.S. Attorney's Office in Cheyenne, declined to comment on the forfeiture case involving the plane and the cash seized in Cody or the newly filed criminal charges against Lewis and Wiles.\nAuthorities allege Wiles paid someone in Texas $130,000 cash in 2013 for the 1968 Cessna TU-206 Super Skywagon. The single-propeller high-wing plane had been flying under \"visual flight rules,\" meaning no flight plan had to be filed and the aircraft's movements couldn't be tracked.\nWiles told people who serviced the plane that he and Lewis were working for an aerial photography business, prosecutors allege. Court records state Wiles lives in Denver, while Lewis is from Englewood, Colorado.\nThe issue of drug forfeitures is drawing increased scrutiny in Wyoming. Some state lawmakers are pushing a bill in the legislative session that starts next month that would require a criminal conviction before the state government can seize private property.\nWyoming Gov. Matt Mead vetoed a bill last year that would have required criminal convictions to support state forfeiture cases. Mead, a Republican and former state and federal prosecutor, said in his veto message last year that he was satisfied with current law enforcement procedures.","url":"https://www.dailymail.co.uk/wires/ap/article-3423041/Feds-file-charges-stemming-seizure-plane-cash.html"}
