{"authors":["Will Martin"],"date_download":"2018-10-30 23:04:27","date_modify":"2018-10-30 23:04:27","date_publish":"2016-12-08 00:00:00","description":"Banks including HSBC and UBS were allegedly involved in the rigging of silver markets, according to a legal filing in New York on Wednesday, Bloomberg reports.","filename":"data/vaneerConsumption/LegaldocumentsallegeUBSandHSBCconspiredtorigsilvermarkets.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ubs-hsbc-silver-market-rigging-lawsuit-2016-12_1540940667.html","title":"Legal documents allege UBS and HSBC conspired to rig silver markets","title_page":"    Legal documents allege UBS and HSBC conspired to rig silver markets - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"An employee packs granules of 99.99 percent pure silver at the Krastsvetmet non-ferrous metals plant, one of the world's largest producers in the precious metals industry, in the Siberian city of Krasnoyarsk, Russia October 24, 2016. Reuters/Ilya Naymushin Major banks including HSBC, UBS, and Barclays were allegedly involved in the rigging of the silver markets, according to a legal filing in New York on Wednesday, Bloomberg reports.\nLegal documents presented in the filing allegedly provide \"smoking gun\" evidence that banks worked together to manipulate the silver markets, and relate to a federal lawsuit filed in 2014 by those that bought or sold futures contracts.\n\"Plaintiffs are now able to plead with direct, 'smoking gun' evidence,' including secret electronic chats involving silver traders and submitters across a number of financial institutions, a multi-year, well-coordinated and wide-ranging conspiracy to rig the prices,\" the filing says.\nThe alleged evidence provided by the unnamed plaintiffs comes from a series of documents handed over by Deutsche Bank in an earlier suit over their alleged involvement in rigging the silver market. In October, Deutsche Bank settled a suit related to its alleged involvement in silver price manipulating agreeing to pay $38 million.\nAccording to Bloomberg, the plaintiffs allege that the documents \"show traders and submitters coordinating trades in advance of a daily phone call, manipulating the spot market for silver, conspiring to fix the spread on silver offered to customers and using illegal strategies to rig prices.\"\nA judge already dismissed a similar suit against UBS earlier this year, but the plaintiffs were allowed to file a further suit, after claiming the bank \"could directly influence the prices of silver financial instruments based on the sheer volume of silver it traded,\" Bloomberg's David Glovin and Edvard Pettersson report.\nThe claimants want to file a new complaint which involves Barclays, BNP Paribas, Standard Chartered, and Bank of America, as well as UBS, HSBC, Deutsche Bank, and Scotiabank — who were all named in the prior legal actions.\nUBS, HSBC, and Scotiabank declined to comment, while Barclays, BNP Paribas, Standard Chartered, and Deutsche Bank did not immediately respond to requests for comment.\nThe filing comes just a few days after Deutsche Bank agreed to pay $60 million to settle private U.S. antitrust litigation by traders and other investors who accused the bank of conspiring to manipulate gold prices at their expense.\nThat preliminary settlement was filed last Friday with the U.S. District Court in Manhattan, and requires a judge's approval. Deutsche Bank denied wrongdoing.","url":"https://www.businessinsider.com/ubs-hsbc-silver-market-rigging-lawsuit-2016-12"}
