{"authors":["Emma Cueto"],"date_download":"2018-10-30 22:26:35","date_modify":"2018-10-30 22:26:35","date_publish":"2014-08-15 17:29:18","description":"Turns out there's not only a moral reason to make gay marriage legal, but an economic one as well. According to a new study, legalizing gay marriage would result in over $40 million in state revenue over three years, and a total of $723 million…","filename":"data/vaneerConsumption/LegalizingGayMarriageBringsInHugeRevenueForStatesSoTheresAnotherReasontoAllowIt.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/22f341b4-0319-4033-b12c-264245e0c830.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35936-legalizing-gay-marriage-brings-in-huge-revenue-for-states-so-theres-another-reason-to-allow-it_1540938395.html","title":"Legalizing Gay Marriage Brings In Huge Revenue For States, So There's Another Reason to Allow It","title_page":"Legalizing Gay Marriage Brings In Huge Revenue For States, So There's Another Reason to Allow It","title_rss":"NULL","source_domain":"bustle.com","text":"Turns out there's not only a moral reason to make gay marriage legal, but an economic one as well. According to a new study, legalizing gay marriage would result in over $40 million in state revenue over three years, and a total of $723 million pumped into the economy. And that's just in the 11 states the study looked at. The total windfall could be much, much bigger. So we'll just let the deficit-obsessed conservatives mull on that one for a while, shall we?\nThese estimates come from research by the Williams Institute, a think tank based out of UCLA's School of Law. According to their analysis, most states that have legalized gay marriage have seen about half of the committed same-sex couples living within the state get legally married within three years. So the researchers ran the numbers, and came up with an estimate of how many couples would probably wed over the course of three years in the 11 states they examined.\nThen, bearing in mind that many same-sex couples might not receive the kind of financial assistance from their families that straight couples might expect, they then used the estimates from market research company The Wedding Report to determine how much an average same-sex couple might spend on their wedding. They also considered how many out of state guests might come for the ceremony, and how much those guests might spend on hotels and food. And in the end realized that legalizing gay marriage would, over the course of three years, pump over $700 million into the economy and create over $40 million in state revenue.\nAnd, funnily enough, the biggest beneficiary in the Williams Institute's analysis, would be Texas. Apparently Texans' conservative policies on marriage equality are going to cost them about $181 million over the next three years.\nThe Williams Institute also looked at the cash-strapped state of Michigan and found that legalizing gay marriage would give the economy a $53 million boost, plus $3 million in state revenue, which maybe they could use to turn people's water back on in Detroit.\nOverall, this study probably won't change many people's minds — people who believe God is opposed to something are notoriously difficult to sway. But the good news it that the people it might actually have a chance of winning over happen to be those in the greatest position to do something, namely elected officials trying to balance their state budgets. So start thinking it over, will you guys? Sooner rather than later, please.","url":"https://www.bustle.com/articles/35936-legalizing-gay-marriage-brings-in-huge-revenue-for-states-so-theres-another-reason-to-allow-it"}
