{"authors":["Nadra Nittle","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:52:28","date_modify":"2018-10-30 22:52:28","date_publish":"2016-11-03 08:00:00","description":"For rapper Jay Z, the war on drugs is personal: “Young men like me who hustle became the sole villain.\" That’s why the hip-hop mogul— who once dealt drugs","filename":"data/vaneerConsumption/LegalizingpotIsProp64reallyacivilrightsissue.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/marijuana-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939948.html","title":"Legalizing pot: Is Prop. 64 really a civil rights issue?","title_page":"Legalizing pot: Is Prop. 64 really a civil rights issue? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"For rapper Jay Z, the war on drugs is personal: “Young men like me who hustle became the sole villain.” That’s why the hip-hop mogul— who once dealt drugs in his New York public housing project and recently made a video denouncing current drug policy as an “epic fail”—is now endorsing a California ballot proposition to legalize recreational marijuana.\nIt’s also personal to Alice Huffman, who has backed efforts to ease marijuana restrictions during her 16-year tenure as president of the California NAACP, once even incurring the wrath of black pastors demanding her resignation. She says she’s no stoner—“I’ve never even touched it”—but her concern about the inequities of the war on drugs led her to back marijuana legalization. “We know any time there are some things that are illegal,” she says, “we [African Americans] will be targeted more.”\nSupporters of Proposition 64 have various motives. Some like getting high and would prefer not to have to break the law to do it. Some see it as a burgeoning industry and are eager to get in on the “Green Rush” to riches. But drafters also sought the support of civil rights groups, and included provisions that addressed their concerns. Today the NAACP, the American Civil Liberties Union and the Drug Policy Alliance all tout Prop. 64 as a way to help remedy the mass incarceration of people of color for drug offenses, uneven sentencing guidelines for drug crimes and gang violence rooted in the drug trade.\nProp. 64, they say, would take unprecedented steps to address racial and economic injustices in drug policy.\nAmong its provisions: People currently incarcerated for many marijuana offenses could have their sentences reduced or overturned, and there would be thousands fewer arrests in the future. Juveniles would no longer be arrested for such crimes at all. Some $50 million a year in tax revenue from cannabis sales would be funneled back into inner cities most plagued by the drug war. And individuals with previous drug convictions would not necessarily be barred from acquiring licenses to sell marijuana.\nIt’s not total legalization: While Prop. 64 would OK possessing an ounce or less of pot for recreational use, people could still be arrested for possessing more, and for selling it without a license.\nEven if California’s initiative is more progressive than other legalization attempt to date, it still has some critics contending it doesn’t go far enough to reduce racial disparities in drug arrests. And they say it would largely benefit the most privileged cannabis connoisseurs.\n“It’s a ruse to make a few people very wealthy,” said marijuana activist Dragonfly de la Luz of San Francisco, whose writings and weed reviews appear in several marijuana publications. “This is a corporate cannabis coup to take over the industry.”\nShe opposes Prop. 64, just as she did a similar initiative to legalize recreational marijuana in California six years ago—arguing that legalization efforts aim to commercialize the marijuana industry in the same vein as Big Tobacco. She also accuses the initiative’s backers of “wildly misconstruing” its purported advantages for people of color: “Proposition 64 won’t legalize offenses that people in urban communities are arrested for like selling, transporting or possessing more than an ounce of marijuana,” de la Luz said.\nAnd the cost of licenses and fees to legally cultivate and sell marijuana could shut low-income people out of what is destined to become a corporate cannabis industry.\nWhatever the merit of those concerns, “anybody who wants to vote against the marijuana law is nuts,” said criminal defense attorney Bruce Margolin, executive director of the pro-legalization National Organization for the Reform of Marijuana Laws. “I’ve seen the suffering, the terrible discrepancies (in policing) used against people of color.” He noted, for example, that Prop. 64 would strip police officers of the authority to search blacks and Hispanics simply because they smell marijuana.\nIn California, racial disparities in drug arrests have been glaring over the past decade, even though U.S. government statistics indicate that blacks and whites use and sell drugs at nearly the same rate.\nThe state authorized use of medical marijuana in 1996 and instituted lighter penalties for recreational use in 2011. But half a million Californians have been arrested for marijuana offenses over the past decade, according to an August analysis of California Department of Justice data by the Drug Policy Alliance, a national advocacy group urging greater drug decriminalization. Those arrests dropped dramatically, by 86 percent, after legislators lowered possession of an ounce or less from a misdemeanor to an infraction. But even that hasn’t stopped blacks, who make up 6.5 percent of California’s population, from being arrested for marijuana offenses at higher rates than whites.\nThe analysis found that in 2015, blacks were more than twice as likely as whites to be arrested for a marijuana misdemeanor and nearly five times more likely to be arrested for a marijuana felony. Latinos are 35 percent more likely than whites to be arrested for marijuana offenses.\nWhat would be different if voters approve Prop. 64? Adults who possess more than an ounce of marijuana (the equivalent of 40 joints), would still be charged with a misdemeanor, as they are now. They would also face the same punishment they do currently under California law—up to six months in jail, a $500 fine or both—and repeat offenders could face additional jail time. But the proposition would reduce penalties for selling. Now selling marijuana of any amount is a felony punishable by up to four years imprisonment. If recreational use is legalized, the charge may be reduced to a misdemeanor, with repeat offenders facing up to four years behind bars.\n“The war on drugs, to me, is a war on poverty,” said retired Torrance police officer Kyle Kazan, who represents Law Enforcement Against Prohibition in support of Prop. 64. “The whole drug war itself has just ravaged the relationship between law enforcement and the people they happen to serve.” Noting that with marijuana prohibition, poor people who use or sell marijuana are more likely to end up in the criminal justice system because they lack the financial resources to elude charges for drug offenses, he says legalization will spare many thousands of people from prison.\nEven so, racial disparities in pot arrests may not vanish if the initiative passes.\nOne explanation is that the police presence is higher in communities of color. As a result, a white, suburbanite 20 year old may smoke as much weed as a black inner-city 20 year old, but is less likely to come into contact with police in the neighborhood.\nConsider Colorado, where voters mostly legalized recreational marijuana in 2013, but still outlawed juvenile use, required a license to sell, and restricted where pot could be consumed. The results, according to a Colorado state assessment: Blacks remain three times more likely than whites to be arrested on a marijuana charge. (Police there say they are responding to more marijuana complaints in those communities.)\nColorado found marijuana arrests after legalization dropping significantly for all racial groups—but more so for whites. Arrests fell by 51 percent for whites, 33 percent for Hispanics and 25 percent for blacks.\nLauren Michaels, legislative affairs manager of the California Police Chiefs Association opposing Prop. 64, said that the proposition’s backers have swayed support by heralding legalization as the way to reduce the number of people arrested for marijuana offenses. “Even if Prop. 64 passes, if you are selling marijuana without a license, you could still go to jail,” she said. “If you possess with intent to sell, you could still go to jail. If you grow more than six plants, you could go to jail. That’s not going to change.”\nShe also noted that Gov. Jerry Brown signed the Racial Identity and Profiling Act of 2015 to try to pinpoint why people of color are disproportionately arrested for drug offenses.\nRegardless, say advocates of Prop. 64, the consequence of its passage will be to make fewer marijuana activities illegal for everyone.\n“We expect arrests to go down, but we expect racial disparities to be consistent,” said Lynne Lyman, California state director for the Drug Policy Alliance. “But by decriminalizing almost all adult use behavior, we expect to see a dramatic drop in arrests.”\nPerhaps the most persuasive case to be made for the “social justice” potential of Prop. 64: the revolutionary effect it would have on juvenile drug offenders. Drug crimes are among most common reasons juveniles, and particularly juveniles of color, enter the criminal justice system. But under Prop. 64, minors—whether they use, sell or grow marijuana— won’t face jail time.\n“We expect the juvenile numbers to go down by the thousands under Prop. 64,” said Lyman. “You can never arrest a child again for marijuana.”\nNow a juvenile who cultivates cannabis can be guilty of a felony punishable by up to three years imprisonment. Under Prop. 64, the same child would be guilty of a simple infraction punishable by eight hours of drug education and community service.\n(This differs dramatically from Colorado, one of four states that have legalized marijuana for recreational use. There, juvenile marijuana arrests soared after decriminalization in 2013, with blacks and Hispanics making up a disproportionate amount of youth arrested.)\n“We recognize that criminalizing young people for experimenting with marijuana does much more harm than good,” said Margaret Dooley-Sammuli, criminal justice and drug policy director for the ACLU of California.\nUnder Prop, 64, juveniles previously convicted of marijuana offenses could have their records expunged. (Adults also could have their convictions retroactively reduced or even removed.) This would apply to offenders currently incarcerated, on probation or who have completed their sentences.\nPublic consumption of cannabis would remain illegal. Users would only be able to enjoy the drug in a place licensed to sell pot or behind closed doors on private property (although how seriously those restrictions are enforced are likely to vary widely by locale.) But low-income people and people of color are less likely to own their homes, leaving landlords and public housing authority officials with power to prohibit tenants from using pot in their rental units.\nIf poor and working class individuals resort to using pot outdoors, they could be fined up to $250.\n“When you legalize marijuana, but you don’t legalize public use, then the people who get cited are the ones who don’t have a private place to use,” Lyman said. “We are concerned we’re going to see an increase for those tickets.”\nOf course the alternative—allowing pot smokers to light up anywhere—would have made Prop. 64 a harder sell, raising health concerns polluting the air, and exposing children to the sight of recreational drug use.\nIn addition, Prop. 64 would also create a community reinvestment fund that would route tens of millions of dollars from tax revenues back into the neighborhoods ravaged by the war on drugs—primarily communities of color. “This funding will build those communities back up as a way to repair the harm that has been done,” Lyman said.\nBut among impoverished and working class communities, concerns remain about he business side of pot legalization—what happens when illicit street dealing goes legit and even high tech and corporate. Under Prop 64, sellers would need to pay fees for licenses to sell marijuana in California. The prices have yet to be determined, but critics predict the costs will be a barrier to entry for the working class. In other states where marijuana is legal, licenses to grow, sell and process cannabis amount to tens of thousands of dollars collectively.\n“Certain people will have licenses to sell it, which makes the rich get richer while the urban and poor people have their lives destroyed for doing the same thing,” de la Luz said.\nTo wit, some states will only consider licensing sellers with no criminal record. But California has resisted such a ban. In fact, some locales already have gone to the opposite extreme. The Oakland City Council, for instance, voted in May to give applicants to sell medical marijuana priority if they had been jailed for pot offenses within the past decade—likening it to “reparations” to those who suffered most from the war on drugs.\nNadra Nittle is a freelance journalist based in Southern California and a contributor to CALmatters.org, a nonprofit news venture dedicated to covering state policy and politics.","url":"https://calmatters.org/articles/legalizing-pot-is-prop-64-really-a-civil-rights-issue/"}
