{"authors":[],"date_download":"2018-10-30 14:21:39","date_modify":"2018-10-30 14:21:39","date_publish":"2018-10-29 19:24:06","description":"The 2016 Kentucky game was the night the Rodrigo Blankenship legend was born as Georgia’s then...","filename":"data/vaneerConsumption/LegendofRodrigoborntwoyearsagovsKentucky.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/29/Images/Hot%20Rod%20110616%20uga%20photos%20CC25_edited.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_college_legend-rodrigo-born-two-years-ago-kentucky__1540909299.html","title":"Legend of Rodrigo born two years ago vs. Kentucky","title_page":"Rodrigo Blankenship legend born for Georgia vs. Kentucky in 2016","title_rss":"NULL","source_domain":"ajc.com","text":"The 2016 Kentucky game was the night the Rodrigo Blankenship legend was born as Georgia’s then-redshirt freshman place-kicker insisted on wearing his glasses and helmet during a televised postgame interview. Since that time, Blankenship has done an exemplary job for the Bulldogs, but he’s still able to easily recall that fateful game.\n“It was a special moment to go out and do that for that team,” said Blankenship, a preseason All-American who has recorded 75 points this season. “It was an intense moment that gave me a lot more confidence the rest of that season. It gave me something to build off of the rest of the way, and it meant a lot that they trusted me in that situation to execute my job.”\nBlankenship, who has yet to miss an extra point in 125 attempts during his career, has connected on 13 of 15 field-goal attempts, with a 53-yarder against Vanderbilt standing as his longest of the season. He said he was “flamed” on the Internet when he missed his first collegiate field-goal attempt, against Ole Miss in 2016, and assented that his glasses are still a topic of conversation among fans.\n“After that (Kentucky) game, it went from people roasting me for being a kicker with glasses that still can’t see the uprights to make a field goal to ‘Oh, his glasses actually help him make field goals,’” he said. “The attention kind of changed to positive at that point, and it’s been awesome to be at this point where I am right now, and it’s been an incredible journey so far.”\nSmart, who apparently tried on Blankenship’s glasses once, said he’s not sure about his kicker's eyesight, but he’s got plenty of confidence in Blankenship's vision.\n“I don’t understand eyesight, but I don't see how those could help anybody see,” Smart said. “I don’t really understand. I’ve never really tried anybody’s glasses on. I guess the harder it is for me to see with them on, then maybe the (more) he needs them.\n“But I know one thing, he sees that ball on the ground, and he gets his toe on the leather real well, so they must work for him. But he did a great job in that game two years ago, and I think that certainly gave him the confidence, gave us the confidence in him that he was a pressure player and enjoyed the moment and did a good job of that.”","url":"https://www.ajc.com/sports/college/legend-rodrigo-born-two-years-ago-kentucky/1xCBzxiDukzZIT80szmDTN/"}
