{"authors":[],"date_download":"2018-10-23 01:08:46","date_modify":"2018-10-23 01:08:46","date_publish":"2015-08-11 00:00:00","description":"American sex laws have not always kept pace with society's changing standards. In The Boundaries of Desire, Eric Berkowitz explores how the legal system has addressed sex in the last century.","filename":"data/vaneerConsumption/LegislatingDesireAnAuthorsTakeOnBadLawsAndGoodSex.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_08_11_429327060_legislating-desire-an-authors-take-on-bad-laws-and-good-sex_1540256926.html","title":"Legislating Desire: An Author's Take On 'Bad Laws And Good Sex'","title_page":"Legislating Desire: An Author's Take On 'Bad Laws And Good Sex' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Legislating Desire: An Author's Take On 'Bad Laws And Good Sex'\nAmerican sex laws have not always kept pace with society's changing standards. In The Boundaries of Desire, Eric Berkowitz explores how the legal system has addressed sex in the last century.\nTERRY GROSS, HOST:\nThis is FRESH AIR. I'm Terry Gross. The sex drive is one of the most fundamental human urges, and throughout history, there have been laws regulating what is considered acceptable sexual behavior. In the past century, the law has had trouble keeping up with changing social and moral standards according to my guest, Eric Berkowitz. He's the author of the new book \"The Boundaries Of Desire.\" It's about American sex laws of the past century - laws pertaining to marriage, homosexuality, adultery, rape, sex workers and pornography. His previous book \"Sex And Punishment\" covered 4,000 years of sex laws. Berkowitz is a lawyer and journalist who now represents lesbians and gays, as well as domestic abuse victims, seeking asylum in the U.S.\nEric Berkowitz, welcome to FRESH AIR. So before we get to 20th century and 21st century laws pertaining to sex, what do you consider to be among the very earliest laws regulating sexual behavior?\nERIC BERKOWITZ: Well, there were so many. There are some that are just strange that have to do this sex with animals - you know, pigs are accepted, cows aren't, et cetera. Those...\nGROSS: Really? When was that? (Laughter).\nBERKOWITZ: Yeah, those were laws of the Hittites and the Babylonians, and, in fact, most ancient societies had pretty clear lines as to what members of the animal kingdom were acceptable and not. But really the first death penalty law that I could find had to do with adultery. That was the first capital crime, and it was enforced vigorously. Also, there were...\nGROSS: Can I just stop you? Is that enforced only against women...\nBERKOWITZ: Sure.\nGROSS: ...Or was it enforced against men, too?\nBERKOWITZ: Women. In fact, we're going to find, as we go forward, many threads of law that were enforced only against women and not against men - adultery, in particular. Also, there were, we think - you know, this isn't exactly proven - but the earliest threads that we could find had to do with laws barring sex with women during their periods. That was considered a very volatile thing that might create atmospheric disturbances and, you know, the wrath of God. Also, incest itself, in some - not all - societies, were - was considered a bad thing.\nGROSS: So let me skip ahead several thousand years to the 20th century and the 21st century. You know, clearly, the civil rights movement, the women's movement, the gay rights movement changed social standards and changed our understanding of sexuality and sexual equality. What are some of the things from earlier in the 20th century - so we're talking, like, say, 100 years ago - some of the things that were legal or illegal then that would seem shocking to us now?\nBERKOWITZ: Oh my, gosh, Terry, there are so many. The first that I can think of is this whole notion of feeblemindedness. There is this very, very strong urge by the law, starting at the beginning of the century and really continuing to the present, of looking to the social sciences to tell us what's right and what's wrong. You know, religion had been fading as a real moral for us in the law for quite some time. It's still there, but it had been pulling back. And stepping into that role, science came in, and what were sins became mental illnesses.\nSo I think of the idea that prostitutes, at the beginning of the century, were not only considered sinners. They were considered to be feebleminded - congenitally promiscuous. Therefore, lots of prostitutes were sterilized. They were seen as a one-way flow of venereal disease toward men and then onward, upward the social scale, to wealthy men. Therefore, we had to not only control them, but also cut them out of the gene pool.\nSo there was this very, very strong sense that what were sometimes minor sins became major mental illnesses. Homosexuality, for one, went from being a sin, obviously, to something that was considered to be a congenital defect. In fact, homosexuals, even by their advocates - people who were advocating the reduction of penalties against homosexuals - saw them as troubled characters who were - well, they were called inverts, meaning that they were evolving in the wrong direction, (laughter) evolving backwards. So when we began to view them as sick people, we also began to add symptoms to that sickness. So homosexuals in the - starting in the '30s and '40s, began to be seen as naturally inclined toward crimes against children, toward political disloyalty, toward all kinds of anti-social things. So what was a sin - having sex with someone of the same sex - became a very, very broad and dangerous thing. So those are two selections of many.\nGROSS: I'll just, like, throw in the miscegenation laws that made it illegal...\nBERKOWITZ: Oh, sure.\nGROSS: ...For an African-American and a white person to marry. And it's really only very recently that those were finally taken off the books.\nBERKOWITZ: Absolutely. Miscegenation started with the idea that - well, one, it's to preserve white privilege, but also with the idea that blacks were naturally inferior - again, quack science - and that making children between blacks and whites - and also, not just blacks. I mean, people of all kinds of races would weaken the white gene pool. Eugenics was mainstream stuff. Everybody loved it in the early part of the century.\nGROSS: I think you can see a lot about how our understanding of gender equality and sexuality have changed by looking at how rape laws have changed. If you go back to the turn of the 20th century, what were rape laws like then, including spousal rape?\nBERKOWITZ: You know, if you're talking about spousal rape, we don't need to go back to the beginning of the 20th century. It was not until 1993 that all of the states had finally purged themselves of laws which held, explicitly, that it is impossible for a man to rape his wife. Now, that's 1993 reaching back thousands of years. That was simply the law for a long, long time. So...\nGROSS: Well, what was that based on? What's the larger law that - that understanding that a man could forcibly take his wife, and that's acceptable - what was that based on?\nBERKOWITZ: That - well, that was based on the very basic notion that when two people married, the wife lost her identity entirely. She became, essentially, merged into the being of her husband - sort of a metaphysical oddity called coverture. And so it was the idea that when a woman said I do on the altar, she said you can for the rest of her life. Saying I do was sort of a blanket consent, and it was also a blanket consent to male control, to the husband's control of the wife in a hundred different contexts. So the question of whether a husband could rape his wife wasn't resolved until, really, the end of the 20th century. Rape and marriage simply didn't cross paths. Of course, husbands had been forcing sex on their wives throughout this period, and wives were simply left in the legal cold. It's a terrible thing. The development and change in rape law really, in a sense, mirrors the women's movement.\nGROSS: So, you write that from 1927 on, the federal definition of rape was carnal knowledge of a female, forcibly, against her will. And it wasn't until 2012 that the FBI redefined rape so that it no longer required that the victim forcibly fight back against the rapist. Which - I mean, so many women would be afraid to fight back. So many rapists say, if you fight back, I'm going to kill you. So that's a tough judgment call there. But anyways, what does that - what does that say to you - that it was only in 2012 that the FBI changed the definition?\nBERKOWITZ: You know, when I was working on this book, there were so many things that astonished me, and this is one of them. I mean, 2012 is really yesterday, and the idea of physical force being a requirement - 2012 is at least a hundred years too late. I mean, there's so many ways in which sex can be extracted from someone without force. And more than that, the insertion of the word force was often interpreted to put the woman in a position of not just resisting, but often resisting to the death. And so if a woman didn't come out of her situation with cuts, bruises, torn underwear, there was a presumption that she must have wanted it.\nGROSS: Let me reintroduce you. If you're just joining us, my guest is Eric Berkowitz. He's the author of the new book \"The Boundaries Of Desire: A Century Of Bad Laws, Good Sex And Changing Identities.\" Let's take a short break, then we'll talk some more. This is FRESH AIR.\n(SOUNDBITE OF MUSIC)\nGROSS: This is FRESH AIR, and if you're just joining us, my guest is Eric Berkowitz, the author of the new book, \"The Boundaries Of Desire,\" and it's about the past century of laws regulating sexual behavior. It wasn't until 2003 that the Supreme Court overturned any remaining anti-sodomy laws. And the sodomy laws were used primarily to - in an attempt to make homosexual sex illegal. And what are some of the most interesting things that stand out in your mind about anti-gay laws from earlier in the 20th century?\nBERKOWITZ: There were many things. One, as I said earlier, you know, homosexuality was considered a mental illness, so when you call something an illness you should beware the cures, you know? Homosexuals were put in mental hospital. They were marked as sex offenders. They were lobotomized. They were chemically castrated. And so the - all of that was in sort of kind of a quasi-medical-legal effort. Essentially, what was going is there was simply the suppression of the homosexual population.\nAlso, homosexuals were considered to be treasonous. And, until recently, homosexuals were barred from being employed by the federal government - you know, the biggest employer - because they were believed to be politically disloyal. Homosexuals were excluded from society in a number of really, really critical ways, all in ways which were held to be sort of emblems of what the homosexual mental illness was.\nGROSS: Did the laws preventing gay people from holding federal positions - did those laws originate in the communist witch hunting era, or did they pre-exist that?\nBERKOWITZ: That's a great question. They absolutely came hand-in-hand with the Red Scare. There's something called the Lavender Scare, as well, which actually has gotten short shrift in the popular imagination. Along with the hunt for communists - in fact, it was said often, commies and queers - there was no less energetic a hunt to root out what were called perverts and perverts of all kinds from the federal government. In fact, about a week after McCarthy held up his fake list of communists in the State Department, it was revealed that there were also homosexuals in the State Department. This was back in around 1950. And so the purge - just the words used are just horrible against them - but the purge of homosexuals and sexual, quote, unquote, \"deviancy of any kind\" continued in force - '50s, '60s and '70s.\nGROSS: In your writing about laws regulating homosexuality and homosexual behavior, you write that the American military had no official policy for keeping homosexuals out of its ranks until World War II. Gay sex in the armed forces had been a crime since the beginning of the Republic, but not being a homosexual. You could be a homosexual. Why did that change during World War II?\nBERKOWITZ: It was a fascinating process. It all, again, comes to the idea of homosexuality being less something one does to something one is, OK? Homosexuality, until the 20th century, was not necessarily a type of person. It was a dimension of sex. So starting in - with World War II, a board of psychiatrists urged that the military start to exclude perverts and feebleminded people from the Armed Forces. And, you know, chief at the top of that list were homosexuals who were considered to be, again, politically disloyal, cowardly, et cetera. So as the entire country went to war, homosexuals were, at least in theory, barred from the effort.\nGROSS: And homosexuals were supposed to be weeded out at the draft board when they were...\nBERKOWITZ: Yeah, good luck with that.\n(LAUGHTER)\nGROSS: ...When they were being inducted. What was the process like for determining who is a homosexual when the person didn't volunteer that information?\nBERKOWITZ: It was really a futile effort because they're dealing with a population that had spent their lives learning how to, quote, unquote, \"pass,\" OK? So we have military recruiters who are, you know, processing people at a very, very fast clip. And, you know, the truth is very few people resisted the war effort, so homosexuals were no less ready to fight than anyone else, so getting past a recruiter wasn't so hard. But recruiters were counseled to look for men who were \"effeminate in dress or manner\" - that's a quote - \"had feminine body characteristics\" - that's a quote, also - and also who put down their occupational choices as interior decorators, dancers or window dressers. I mean, it's an absolutely ludicrous, infantile thing, but that's the sheet that the recruiters had in front of them when they were going through the recruiting process.\nGROSS: So that's an example of a legal attitude that's changed a lot in the past few decades.\nBERKOWITZ: Hasn't been easy, but it finally did. Yes.\nGROSS: Right. So during several decades of the 20th century, it was illegal to send birth control through the mail because of the Comstock Act. And I'd like you to describe the Comstock Act, which was passed in 1873, and how that ended up - how an anti-pornography law ended up affecting birth control.\nBERKOWITZ: Sure. Anthony Comstock is one of the more colorful and fun characters of the last 150 years. He was a dry goods salesman from Brooklyn, but his real metier was hunting sexual practices anywhere he could find them. And Comstock teamed up with the YMCA and got a federal law passed which barred pretty much - the use of the mail for pretty much anything - anything that smacked of sex, be it medical literature, birth control literature, playing cards or pornography.\nSo to expand on what you asked, it wasn't just sending birth control in the mail. Even sending a medical pamphlet about birth control in the mail was wrong. Anything - it was this notion that anything that was sexual was dangerous, and he didn't really trouble between the medical sexual, the counseling sexual or the traditionally, you know, pornographically sexual. Sex itself was wrong, so birth control information was illegal. And someone like Margaret Sanger, who's, you know, the giant of birth control movement, was constantly running up against Comstock Act prosecutions.\nI mean, and so eventually, birth control was sort of excised from the Comstock Act in the '30s. A court in New York said, well, we're not going to ban birth control if it prevents disease. We're going to - we still want to ban birth control if it's there for sport sex, but if it's there to prevent disease, we're going to allow it. And that had to do with some diaphragms that this Japanese doctor sent in from Japan to New York. And so once that happened, the dike cracked, and millions and millions and millions of condoms began to rain down from the sky. And birth control became much, much easier to acquire.\nGROSS: So when you look at the past hundred years and you look at what the sex laws are now, do you consider us, legally, to be in a relatively enlightened state?\nBERKOWITZ: I do. I mean, there's a lot to complain about, but all told, there is more protection for the individual body, particularly of the underprivileged, than in any other time I can recall.\nGROSS: Eric Berkowitz, thank you so much for talking with us.\nBERKOWITZ: It's been an absolute pleasure, Terry.\nGROSS: Eric Berkowitz is the author of the new book \"The Boundaries Of Desire\" about the past century of laws regulating sex. After we take a short break, Maureen Corrigan will review a new book by a writer whose home was built over a charnel house, a vault of bones. That sent her on a tour of bone houses through Europe. Also, we'll hear from Amanda Petrusich, who's written a book about 78s and the people who collect these recording, and we'll listen to some rare 78s. I'm Terry Gross, and this is FRESH AIR.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2015/08/11/429327060/legislating-desire-an-authors-take-on-bad-laws-and-good-sex"}
