{"authors":["Press Association"],"date_download":"2018-10-23 02:24:31","date_modify":"2018-10-23 02:24:31","date_publish":"2017-03-10 11:33:20","description":"The 25-year-old missed the eve-of-match captain´s run and will be given the next 24 hours to demonstrate he is ready for the Triple Crown decider.","filename":"data/vaneerConsumption/LeginjuryleavesOwenFarrelldoubtfulforScotlandclash.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/18/wire-197551-1489171388-405_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4300938_Leg-injury-leaves-Owen-Farrell-doubtful-Scotland-clash_1540261471.html","title":"Leg injury leaves Owen Farrell doubtful for Scotland clash","title_page":"Leg injury leaves Owen Farrell doubtful for Scotland clash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"England face the prospect of entering their Calcutta Cup clash against Scotland without Owen Farrell after concerns over his fitness escalated on the eve of the Twickenham showdown.\nFarrell was unable to take part in the captain’s run on Friday due to the unspecified leg injury sustained in training 24 hours earlier and he now faces a race against time to prove he can take part in the Triple Crown decider.\nThe Saracens playmaker, due to start at inside centre, faces a period of intensive rehabilitation in his quest to be ready, with England prepared to make a late call.\n“Owen didn’t train today (Friday) and we’re monitoring his leg injury. It’s a leg injury,” defence coach Paul Gustard said.\nLate decision to be made on Farrell. Gustard: 'We have until kick-off to make a call. He has at least another 24 hours of recovery' — Duncan Bech (@DuncanBech) March 10, 2017\nEngland have opted against summoning any fly-half or centre cover, instead relying on the 24 players retained for the penultimate round of the RBS 6 Nations.\nThe most probable contingency if Farrell is forced to withdraw would see Ben Te’o promoted from the bench to fill the void and Jonny May, who is currently acting as 24th man, stepping on to the replacements bench.\nHowever, if fly-half George Ford were to be struck by injury the reigning Six Nations champions would be left exposed at fly-half as beyond Ford and Farrell there is no established alternative in the matchday 23.\nAlex Lozowski is the next option on the pecking order but he has been named on the bench for Saracens’ Anglo-Welsh Cup semi-final against Leicester on Saturday evening, and England have already insisted he will not be involved at Twickenham.\nPaul Gustard\n“We’re not bringing anyone in. We’re obviously very happy with Ben in the squad. We have Jonny May with us at the moment as 24th man, so we have some flexibility as cover,” Gustard said.\n“We’re really confident (of the options if Owen misses out). We’re very happy with the squad that we’ve got and the 24 that we chose for this game. Whatever combination we end up with at 10, 12, 13, we’re happy.”\nUncertainty over Farrell’s injury has risen since a Eddie Jones on Thursday gave conflicting answers about his availability to face Scotland.\nJones joked that the Saracens playmaker initially sustained the injury - the details of which England will not divulge - during a collision with his dog Annie during the final training session of the week at the squad’s Surrey base.\nEddie Jones\nWhen asked for an update on Farrell, a prickly Jones offered contrary messages.\n“Owen could be a doubt, he could be a doubt. He’s got a bad leg, so he couldn’t finish training. He’ll be all right,” Jones said.\nFarrell was expected to be given the green light, but his inability to take part in the session at Twickenham on Friday has set alarm bells ringing.\nAlongside Ford and Mike Brown, the world player of the year nominee was involved in kicking practise overseen by Jonny Wilkinson but would only rehearse technique rather than actually putting boot to ball.\nEngland will give Farrell, who has emerged as their most important player under Jones, every opportunity to demonstrate his fitness for a match that could deliver a record-equalling 18th successive Test victory.","url":"https://www.dailymail.co.uk/wires/pa/article-4300938/Leg-injury-leaves-Owen-Farrell-doubtful-Scotland-clash.html"}
