{"authors":["Antoinette Siu","Laurel Rosenhall","Dan Morain"],"date_download":"2018-10-30 22:48:40","date_modify":"2018-10-30 22:48:40","date_publish":"2018-08-19 16:52:51","description":"Of all the constituencies clamoring for help as firenados ravage California, homeowners worried about their fire insurance seem among the least likely this year to get legislative relief.","filename":"data/vaneerConsumption/Legislaturehasbeensnuffingoutbillsthataimtohelpinsuredhomeownersinwildfirecountry.json","image_url":"https://calmatters.org/wp-content/uploads/IMG_8022-e1534627687768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939720.html","title":"Legislature has been snuffing out bills that aim to help insured homeowners in wildfire country","title_page":"Legislature has been snuffing out bills that aim to help insured homeowners in wildfire country | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Jen Burt lives with her husband and two kids in the woods not far from Grass Valley, in a four-bedroom foothill house in a stand of black oak and cedar trees. Tucked away on a private road, the five-acre spread is a hallmark California dream—and a potential California nightmare: It’s in wildfire country. Last February, Burt’s insurer of six years canceled her fire insurance. The scramble for new coverage was pricey and harrowing.\nNow, like a lot of rural homeowners, Burt is hoping for a solution in the form of wildfire legislation. Of the more than 13.6 million homes in the state, about a third are in or near areas vulnerable to wildfire, and many homeowners are having trouble finding or keeping their fire insurance.\nBut of all the constituencies—from utility companies to first responders—clamoring for state help as firenados ravage California and legislators rush toward the Aug. 31 end of session, homeowners who live in fire-prone areas and fear losing coverage seem among the least likely to get legislative relief.\nThe “new normal” of climate change-fueled natural disaster has also changed California’s policy landscape. Survivors of last year’s wine country fires want major upgrades in emergency communications. Utility companies, which by law are responsible for fires in areas where their lines run, have lobbied hard for a break on their fire liability.\nLawmakers have been working hard to address those issues, with varying degrees of success and deals in varying stages. But an ambitious package of consumer protections proposed by the Department of Insurance earlier this year that would make it harder for insurers to raise rates or cancel coverage in high-risk areas has mostly been quashed or sidelined. As key lawmakers continued working over the weekend, among the possibilities they discussed: creating some sort of fund to help fire victims, modeled on the protections afforded to homeowners living in flood zones. How to fund that, however, remains an open question.\nThe insurance industry, meanwhile, insists California is a big market and that insurers can still spread their risk enough to remain in it.\nBut soaring claims do drive up premiums, said Armand Feliciano, vice president of government relations at Property Casualty Insurers Association of America, a trade association representing about 1,000 insurance companies. “If you live in a very dry area,” said Feliciano, “it’s going to be very tough to spread that risk.”\nAlso, views are mixed on how to handle development in fire-prone regions. In Nevada County, where Burt resides, 70 percent of some 50,200 homes are at high risk of fires, according to the state Insurance Department.\nSome note that high premiums and policy cancellations send market signals that deter people from settling in wildfire country. Others argue that by the time homeowners notice the price of insurance, they’ve already made a home, and the state has a responsibility to protect them. And, they add, it is only in recent years that fire danger has spiked.\nIn the Legislature, that debate has continued, even as the largest fire in state history, the Ranch Fire, blackened a swath of Mendocino, Lake and Colusa counties the size of Los Angeles. So far, insurers have largely prevailed.\nOf the 10 or so bills originally proposed (some have been combined), six have died or stalled, including measures that would have expedited fire victims’ claims, advanced payment, helped curb rogue adjusters and let those who have suffered a total loss rebuild at a different location.\nThe few bills that remain have been substantially watered down from a consumer standpoint, says California Insurance Commissioner Dave Jones.\n“Most of those bills were hijacked by the insurance industry one way or another, substantially and hostilely amended,” Jones said. “It was very disappointing, notwithstanding California’s worst wildfire, that the Legislature was not willing to pass strong consumer protection bills but instead allowed the insurance industry to water down or outright kill those bills.”\nAmong the remaining measures is SB 894, authored by Sen. Bill Dodd, a Napa Democrat whose district was ravaged by last year’s Wine Country fires. Dodd’s bill would make it easier for homeowners to get coverage to rebuild, give them more time to claim living expenses after a disaster and extend policy renewal protections.\nThat bill, inspired by homeowners who discovered they were underinsured after last year’s fires, is bound for the Assembly floor after a tough fight in which its reach was narrowed by insurers. Dodd complained that lawmakers too readily buy insurers’ argument that any fire insurance legislation will increase costs for consumers. “It’s like a license to kill the bill,” Dodd said. “The insurance lobby in this building is incredibly strong with its influence on members and staff.”\nAssemblyman Marc Levine, a Greenbrae Democrat, also advanced two fire bills involving red tape issues. Passed in July, AB 1799 dealt with a chronic problem for disaster victims: the difficulty after a loss of simply getting a copy of complete policy documentation from insurers. AB 1797, awaiting a signature from the governor, would require insurance companies to provide a homeowner with rebuilding cost estimates every other year.\nAnd SB 824 from Bell Gardens Democratic Sen. Ricardo Lara, who is running to succeed Jones as insurance commissioner in November, aims to prevent insurers from dropping or not renewing homes after a disaster. It would ensure that homeowners get their policies renewed the year following a declaration of emergency in their area, and would require insurance companies to submit fire loss data to the state. The bill is up for a floor vote in the Assembly after initial opposition from the Property Casualty Insurers.\nMark Sektnan, the group’s vice president of state affairs, said insurers feared the initial mandates “would have a chilling effect on the entire market,” but backed off after the bill added some exceptions, such as allowing insurers to cancel in the case of fraud.\nRenewal, however, remains a worry. Besides consumers’ desire for coverage, fire insurance is a prerequisite for home mortgages.\nFrom 2015 to 2016, the number of policy non-renewals went from 8,796 to 10,151 across all the counties, according to the Department of Insurance.\nMeanwhile, in the wildland areas seen as at-risk of wildfires, policies purchased through the California Fair Access to Insurance Requirements Plan, an insurer of last resort for California homeowners, rose by about 8,000 between 2014 and 2017. Statewide, they total 30,432 policies—and although that may seem like a small number compared to the millions of homes insured by traditional carriers like AAA and Farmers, Jones calls them “the canary in the coal mine.” He said his office is fielding more homeowner complaints in high-risk areas about policy renewals, cancellations or premium increases.\n“We’re not in a crisis yet, but you can see where this problem is going to accelerate. California climate is changing for the worse, and the world is not doing anything fast enough to change the greenhouse gases to de-accelerate the temperature rise,” Jones said.\nIn Grass Valley, the Burts eventually found insurance after more than a month of looking. Jen Burt said their coverage with AAA is a bit more expensive than their previous policy with Grange, but other carriers would have doubled their premium.\nAnd like so many Californians, they’re not leaving.\n“This is our forever home,” she said. “We don’t plan to move from here.”","url":"https://calmatters.org/articles/california-wildfire-insurance-bills-snuffed-out/"}
