{"authors":[],"date_download":"2018-10-30 17:54:14","date_modify":"2018-10-30 17:54:14","date_publish":"2017-02-06 21:20:00","description":"A House Bill would allow automated driving systems to operate on public roads in Georgia.","filename":"data/vaneerConsumption/LegislationpavesroadforselfdrivingcarsinGeorgia.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/AP_Top_News_General_Stories/2017/02/01/Images/ccd97403034246458e3d51a5c577588e.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_e9089ea8ab672bc6785a0be52c7e12d7__1540922054.html","title":"Legislation paves road for self-driving cars in Georgia","title_page":"Legislation paves road for self-driving cars in Georgia","title_rss":"NULL","source_domain":"ajc.com","text":"The road has been paved for autonomous vehicles in Georgia.\n“I think the technology has changed, and I think the climate is prime here in Georgia,” said state Rep. Trey Kelley, a Republican from Cedartown.\nKelley is sponsoring House Bill 248, legislation that would allow self-driving cars to operate on public roads.\nIt’s an accelerated step after the Autonomous Vehicle Technology Study Committee concluded in 2015 that the state needed to first improve its business climate and develop skilled workers before allowing self-driving cars on the roadway. Kelley, who was chairman of that committee, said he felt, at the time, that the technology was advancing at a rate faster than Georgia’s business standards.\nFor Kelley, “the time’s right now” to put legislation into high gear. Still, questions regarding implementation remain.\nGeorgia would be joining five other states — California, Florida, Michigan, Nevada and Tennessee — and the District of Columbia in passing laws dealing with autonomous driving. It has been touted as innovative technology that will make transportation safer and more efficient, and in a sprawling, vehicle-dependent city such as Atlanta, that’s likely to appeal to consumers.\nBut while the National Highway Transportation Safety Administration has created guidelines for cohesion, the variation that still exists between states has created uncertainty and frustration for manufacturing companies that don’t want to build 50 versions of a car for 50 different state policies.\nGenerally, the federal government regulates vehicles, and states regulate drivers. With autonomous cars, where the vehicles are the drivers, existing law needs to be updated to reflect who is responsible in the event of a collision.\nAs long as the owner of the vehicle hasn’t made major modifications, Kelley said, the manufacturers will accept liability “because they recognize that they’re the ones who control the ability to alleviate problems and any error would come on their part.”\nThe language describing what is considered a manufacturer may be tweaked as the bill moves through committee. In other states, where similar legislation was considered, Google, Uber and other technology companies fought for representation under the definition.\nEvangeline George, a representative for Uber, said the current language is unacceptable.\n“As currently drafted, this legislation would slow self-driving technology advancement and includes anti-tech, protectionist elements,” she said in a statement. “Several cities and states have recognized that complex rules and requirements could have the unintended consequence of slowing down innovation. Our hope is that Georgia will continue to welcome technology with a similar view”\nKelley said his goal “has always been to put forth a program that’s friendly for traditional automobile manufacturers as well as tech companies coming into this space.”","url":"https://www.ajc.com/news/state--regional-govt--politics/georgia-bill-aims-set-self-driving-cars-track-mainstream/x7yfiI5lnjWTU79ipxBmsK/"}
