{"authors":[],"date_download":"2018-10-30 17:58:01","date_modify":"2018-10-30 17:58:01","date_publish":"2016-01-13 21:45:52","description":"A coastal Georgia lawmaker has introduced legislation that he says could boost Camden County’s chances of claiming a piece of the growing commercial space industry.","filename":"data/vaneerConsumption/LegislationproposedtoboostCamdenCountyschanceatspaceport.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_legislation-proposed-b_39f9b382f15f59acf10de6c9a2095189__1540922281.html","title":"Legislation proposed to boost Camden County’s chance at spaceport","title_page":"Legislation proposed to boost Camden County’s chance at spaceport","title_rss":"NULL","source_domain":"ajc.com","text":"A coastal Georgia lawmaker has introduced legislation that he says could boost Camden County’s chances of claiming a piece of the growing commercial space industry.\nState Rep. Jason Spencer, R-Woodbine said his bill, known as the Georgia Space Flight Act, would make the county an attractive spaceport site by spelling out that willing space flight participants could not sue under most circumstances. It also would prohibit local governments for enacting noise regulations to stop space flight operations, Spencer said.\nThe bill is patterned a similar law in Texas, he said.\nSpace travel isn’t all that far-fetched in this corner of southeast Georgia. In 1960, NASA chose Cape Canaveral over Camden County and Wallop’s Island, Va., as the place to launch the nation’s space program. Five years later, the world’s largest rocket engine was tested here in a 150-foot-deep pit.\nSpencer acknowledged that the legislation has had some initial negative reaction locally.\nThere’s concern, he said, from some residents that they won’t be able to sue if a space flight into their house. But that’s never happened, Spencer said.\nThe Federal Aviation Administration regulates the facility and each flight, he said.\n“We need to do this to be more competitive,” Spencer said.","url":"https://www.ajc.com/news/legislation-proposed-boost-camden-county-chance-spaceport/1d0FUT5b5hjXRoJIAToeHO/"}
