{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:10:56","date_modify":"2018-10-31 00:10:56","date_publish":"2016-02-03 08:00:00","description":"When President Barack Obama announced last month that he is taking executive action to ban the solitary confinement of juveniles in federal prisons, it","filename":"data/vaneerConsumption/Legislatorslockupbillstolimitsolitaryconfinementofjuveniles.json","image_url":"https://calmatters.org/wp-content/uploads/juvenile_prison.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944656.html","title":"Legislators lock up bills to limit solitary confinement of juveniles","title_page":"Legislators lock up bills to limit solitary confinement of juveniles | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"When President Barack Obama announced last month that he is taking executive action to ban the solitary confinement of juveniles in federal prisons, it was a rare case of Washington setting policy more liberal than what comes out of Sacramento.\nIn California’s Democratic-controlled Legislature, bills to restrict the use of solitary confinement on youth have stalled for the last four years amid objections from labor and law enforcement groups that run juvenile halls.\nNow, citing the “enormous mental health impacts” the practice has on youth, Sen. Mark Leno (D-San Francisco) is hoping that Obama’s action will bring momentum to the issue in California. He’s preparing to introduce a new version of his bill that died last year to limit the use of solitary confinement in state and county-run juvenile detention centers.\n“You have to remind yourself that these children are in our system to begin with because they are troubled,” Leno said. “They’ve got mental health issues when they come through our door, and we exacerbate their problem.”\nYet even with the nation’s most powerful Democrat in his corner, Leno is up against a formidable challenge: the influential law enforcement lobby. The unions that represent prison guards are major campaign donors in Sacramento and many politicians are reluctant to cross them.\nGroups that opposed Leno’s earlier bill – including the California Correctional Peace Officers Association and the State Coalition of Probation Organizations – have poured $14.3 million into California political campaigns over the last five years. Among sitting legislators, they’ve given the most – more than $26,000 – to Assemblyman Jimmy Gomez (D-Los Angeles). He chairs the Assembly’s Appropriations Committee, which killed Leno’s bill last year. Gomez declined to comment for this story.\nComplicating matters, juvenile detention officials – after years on the defensive over solitary confinement – are now working to advance their own bill that could clash with Leno’s. One issue is jargon. Juvenile corrections officials do not use the term “solitary confinement.” They talk about “separation,” “temporary intervention,” or keeping youth in their “rooms.”\nThe chief probation officers who run county-level juvenile detention programs want to maintain the current rules that allow “separation.” They are developing a bill that would define “solitary confinement” as something else.\n“We do not believe that youth should be in solitary confinement and our efforts will be to define what that is and prohibit the use of it,” said Rosemary McCool, deputy director of the Chief Probation Officers of California.\nGuards and local corrections officials say Leno’s bill is unnecessary because California already has sufficient rules on the treatment of youth offenders. The four state-run juvenile facilities – which together house about 700 youth – are under a 2004 court order that has significantly reduced the use of solitary confinement. About 8,000 youth offenders are housed in county-run programs, which are governed by regulations that were just updated in 2014.\n“Within those regulations, there are very stringent guidelines and standards as to how that is to be used and when,” Danielle Sanchez, lobbyist for the Chief Probation Officers of California, said in a hearing last year. “There has to be checks on the minor every 15 minutes.”\nBut existing rules don’t go far enough, say the human rights groups behind Leno’s bill. They say they routinely hear from young people who report being locked up alone.\n“My whole mind would play games,” said Eddie Flores, who said he spent two months in a Los Angeles County juvenile hall in 2012 after being convicted of assault with a deadly weapon.\nNow 19 and involved with the Youth Justice Coalition that is a sponsor of Leno’s bill, Flores said he was routinely alone in his cell for 16-hour stretches when the facility went into lockdown. The cells had no toilets, Flores said, so he and others would relieve themselves on a towel or a T-shirt.\n“All you hear is people screaming, a couple cuss words here and there. There’s pounding and kicking, doors being punched. You would hear people crying because they wanted to come out,” he said.\nFlores’ account could not be corroborated – juvenile crime records are sealed and the Los Angeles County probation department did not return calls for this story.\nJuvenile halls are not required to keep track of their use of solitary confinement. A lawsuit that was settled last year alleged that youth detained in Contra Costa County juvenile halls were routinely locked in small cells for up to 23 hours a day. In settling, the county probation department agreed to stop the practice as a form of punishment. The settlement allows youth to be separated for no more than four hours and only if their behavior poses a threat.\nLeno’s bill is modeled after the terms of that settlement, putting limits on the use of solitary confinement but not banning it entirely. It also would require facilities to log how much they use it. He said the measure is necessary because the current standard for solitary confinement is more lenient in California’s youth facilities than in its adult prisons, where a court order restricts it to violent inmates.\n“In California, a juvenile – a child – can be placed in solitary confinement for a lesser act of misbehavior than an adult,” Leno said. “That is tragic.”","url":"https://calmatters.org/articles/legislators-lock-up-bills-to-limit-solitary-confinement-of-juveniles/"}
