{"authors":[],"date_download":"2018-10-22 21:27:03","date_modify":"2018-10-22 21:27:03","date_publish":"2014-06-05 13:56:15","description":"Forget movie stars. The newest additions to the LEGO universe are female scientists.","filename":"data/vaneerConsumption/LEGOBuildsUpSTEMwithFemaleScientists.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/489461/femalelegoset_bd8ccb223c08e9c892eff168063c2d00.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gadgets_lego-builds-stem-female-scientists-n123421_1540243623.html","title":"LEGO Builds Up STEM with Female Scientists","title_page":"LEGO Builds Up STEM with Female Scientists","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nLittle girls who love LEGOS will soon be able to study dinosaurs, chemistry and the stars with the new “Research Institute” collection featuring female scientists.\nThe concept came from geochemist Dr. Ellen Kooijman, who garnered 10,000 votes from people who wanted to see LEGO make her idea a reality. Kooijman proposed three female scientists: a paleontologist, a chemist and an astronomer.\n“Although recently LEGO has started to design and add more female figures to their sets, they are still a minority,” Kooijman wrote in her proposal, adding that she wanted to show that “girls can become anything they want.”\nThe final decision came from the LEGO Review Board, who picked \"Research Institute\" over six other proposals, including sets based on “Back to the Future” and the BBC show “Sherlock.” (Worry not, Benedict Cumberbatch fans, you can still put together a LEGO version of his character Smaug from “The Hobbit.”)\nThe announcement comes on the heels of the White House Science Fair, which focused on girls who excelled in the STEM ( science, technology, engineering and math) fields.\nThe folks at LEGO are still finalizing the design and price, but the set should become available in August 2014.","url":"https://www.nbcnews.com/tech/gadgets/lego-builds-stem-female-scientists-n123421"}
