{"authors":["Euan Mclelland For Mailonline"],"date_download":"2018-10-22 23:17:07","date_modify":"2018-10-22 23:17:07","date_publish":"2016-01-28 12:10:10","description":"Despite not yet being publicly announced by Lego, the trail-blazing design - which is rumoured to also come with an assistance dog - was spotted at the Nuremberg toy fair.","filename":"data/vaneerConsumption/Legotounveilwheelchairusingcharactercompletewithguidedog.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/2vdWmEltwXfba0ce28e63282b82b-0-image-a-53_1453982756170.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420815_Everything-awesome-Campaigners-rejoice-toy-fair-photo-suggests-Lego-set-unveil-disabled-figure-wheelchair_1540250227.html","title":"Lego to unveil wheelchair using character complete with guide dog","title_page":"Lego to unveil wheelchair using character complete with guide dog | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lego is on the verge of releasing its first ever disabled character.\nThe latest figure from the Danish toy giant comes complete with a wheelchair and is rumoured to even be accompanied by an assistance dog.\nIt will form a new part of a set which is set to go on sale in June.\nDespite not yet being publicly announced by Lego, the trail-blazing design was spotted on display at the Nuremberg toy fair in Germany.\nIts image has since been shared widely on social media - much to the excitement of fans.\nLego is on the verge of releasing its first ever disabled character. The latest figure from the Danish toy giant comes complete with a wheelchair and is rumoured to even be accompanied by an assistance dog\nJournalist Rebecca Atkinson, who sparked a global campaign when she posted pictures of toys she had adapted with different disabilities on the internet, said it was a massive step towards ending 'cultural marginalisation'.\nThe mother of two, who is partially deaf and has tunnel vision due to genetic condition retinitis pigmentosa, established the #toylikeme movement to secure better representation of the 770,000 disabled children in the UK and 150 million across the globe.\nShe said: 'We are beyond happy right now. Lego have just rocked our brick-built world and made 150 million disabled kids, their mums, dads, pet dogs and hamsters very, very happy.\n'We're all conga-ing up and down the street chucking coloured bricks like confetti.\n'On a serious note, this move by Lego is massive in terms of ending cultural marginalisation, it will speak volumes to children, disabled or otherwise, the world over.'\nAfter her campaign gained tens of thousands of supporters on social media, Ms Atkinson was given a job as a creative disability consultant with Playmobil, working on adding characters to its range.\nMore than 20,000 people signed a petition urging Lego to follow suit - and it now has.\nA photograph of the figure - first shared by the Promobricks blog - was featured on the BrickFans website.\nUsers there paid tribute to Ms Atkinson's campaign.\nJournalist Rebecca Atkinson (pictured), who sparked a global campaign when she posted pictures of toys she had adapted with different disabilities on the internet, said it was a massive step towards ending 'cultural marginalisation'\nA post read: 'I'm sure you'll agree this is a great step in the right direction by The Lego Group. With Lego being the number one toy brand in the world right now, their products are greatly influential for its younger fan base.\n'Providing an able bodied person with the notion that a disability isn't something to be frowned upon while also offering a young disabled person with a positive representation for them to project themselves onto during play, is an achievement which should be saluted.'\nCampaigners are now urging more major toy manufacturers to make products featuring characters with disabilities.\nPasca Lane, head of PR at disability charity Scope, said: 'Everything is awesome!\n'Many parents tell us it is important for their children to have toys which they can identify with because it builds their confidence, self-esteem and the feeling of being included in society.\n'It is great that Lego has responded to this demand and will go on sale in June. We hope this move will help build a better future and improve attitudes towards disabled children and their families.","url":"https://www.dailymail.co.uk/news/article-3420815/Everything-awesome-Campaigners-rejoice-toy-fair-photo-suggests-Lego-set-unveil-disabled-figure-wheelchair.html"}
