{"authors":[],"date_download":"2018-10-23 03:33:29","date_modify":"2018-10-23 03:33:29","date_publish":"2016-01-29 18:32:33","description":"Inter Milan signed striker Eder on a two-year loan deal from Sampdoria on Friday in an attempt to solve their scoring problems. Leicester had been keen on signing the Italian.","filename":"data/vaneerConsumption/LeicestermissoutonSampdoriastarEderafterInterMilancompletedealforstriker.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B48DA900000578-0-image-a-12_1454092319517.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423240_Leicester-miss-Sampdoria-star-Eder-Inter-Milan-complete-deal-striker_1540265609.html","title":"Leicester miss out on Sampdoria star Eder after Inter Milan complete deal for striker","title_page":"Leicester miss out on Sampdoria star Eder after Inter Milan complete deal for striker | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Inter Milan signed striker Eder on a two-year loan deal from Sampdoria on Friday in an attempt to solve their scoring problems.\nInter, who led Serie A at the Christmas break but are now fourth and face AC Milan on Sunday, have managed only 26 goals in 21 games and have scored more than once in just three games.\nFrustrated coach Roberto Mancini publicly criticised his strikers after last Sunday's 1-1 draw at home to Carpi, saying that, even at the age of 51, he could have scored one of the chances missed by Mauro Icardi.\nInter Milan unveiled Eder on Friday alongside manager Roberto Mancini as they boosted their attacking options\nThe Italian is the joint-highest scorer in Serie A this season after impressing with Sampdoria\nHe also told his forwards they could not simply wait for the ball to come to them.\nBrazilian-born Italy international Eder joins Inter after four years at Sampdoria, where he scored 49 goals in 135 matches and is joint second-highest scorer in Serie A this season with 12 goals.\n'I'm delighted to be here. I've worked hard for years to play for a big club like Inter,' the 29-year-old said on the club's website.\nEder was raised at Brazilian club Criciuma but moved to Italy to join Empoli in 2005 as a teenager.\nMancini was critical of his strikers and in particular Mauro Icardi, who missed many chances against Carpi\n'I think he (Eder) could bring something different from other strikers, he can also benefit the other players because he is different from them,' Mancini told a recent news conference.\nThe move could be made permanent upon fulfillment of certain conditions, the club added.\nEder scored on his Italy debut against Bulgaria last March and has gone on to make eight appearances.","url":"https://www.dailymail.co.uk/sport/football/article-3423240/Leicester-miss-Sampdoria-star-Eder-Inter-Milan-complete-deal-striker.html"}
