{"authors":["Daniel Matthews For Mailonline"],"date_download":"2018-10-22 20:58:09","date_modify":"2018-10-22 20:58:09","date_publish":"2017-03-16 00:22:21","description":"Manchester City's exit on Wednesday means England have had only five Champions League quarter-finalists in the past six seasons, 12 fewer than Spain and 11 fewer than between 2006 and 2011.","filename":"data/vaneerConsumption/LeicestersUCLsuccessdowntoEnglishstyleDunne.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E46771B00000578-0-image-a-37_1489623336969.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4318444_Leicester-s-UCL-success-English-style-Dunne_1540241889.html","title":"Leicester's UCL success down to 'English' style - Dunne","title_page":"Leicester's UCL success down to 'English' style - Dunne | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Leicester's decision to stick to a traditionally 'English' style of play - rather than follow other sides in imitating foreign teams - is why they are the only Premier League side left in the Champions League, Richard Dunne has suggested.\nCraig Shakespeare's side overcame a 2-1 first-leg deficit to knock out Sevilla and book their place in the last-eight on Tuesday.\nBoth Arsenal and Manchester City crashed out, however, conceding 16 goals in four last-16 matches between them, while Tottenham went out at the group stage.\nLeicester beat Sevilla 2-0 on Tuesday to book their place in the Champions League last-eight\nCity's elimination at the hands of Monaco on Wednesday means England have had only five Champions League quarter-finalists in the past six seasons.\nThat is 12 fewer than Spain and 11 fewer than they managed in the same period between 2006 and 2011.\nFormer City defender Dunne suggested this decline could be down to English club's recent tendency to try and imitate clubs from other countries.\nArsenal exited at the last-16 stage for the seventh-straight year after losing to Bayern Munich\nManchester City squandered a 5-3 first-leg lead to go out at the hands of French side Monaco\nAnd he highlighted Leicester's unparalleled success in this season's competition as evidence of why an 'English' way of playing should not be discarded.\n'Over the last, maybe, 10 years, they have changed the way they play,' he said on BT Sport. 'They are playing in a more continental style whereas Leicester are the one side that are playing the sort of old, English style.\n'Route one, closing people down and working hard and they have benefited from it this year. For the other sides to face Leicester this season will be a big challenge for them'\nEngland had a team in the Champions League final for five consecutive seasons between 2005 and 2009.\nIn the last five seasons, however, Chelsea's triumph in 2012 is the only time an English team have made it that far.\nAtletico Madrid beat Bayer Leverkusen to ensure three Spanish teams made it to the last-eight\nRichard Dunne (centre) and Steve McManaman (right) were speaking after City's 3-1 defeat\nAnd Steve McManaman - who won the title with Real Madrid in 2000 and 2002 - said the consistent success of clubs in Spain is no coincidence.\n'It's very disappointing isn't it as an Englishman,' he said.\n'Arsenal went out (against Bayern Munich) after playing two very good 45 minutes - one over there, one over here - and they went out comfortably (losing 10-2 on aggregate).\n'City had a two-goal lead and they've gone out so it's really disappointing...we have a long way to go to catch up. It's no fluke that the Spanish teams have got three teams through into the last-eight again!'\nPep Guardiola reacts angrily after his side conceded their third goal at Stade Louis II\nSpeaking on ITV, former Manchester United captain Roy Keane suggested the failures of English teams in Europe has coincided with a decline in the quality in domestic football in this country.\n‘I think the standard in the Premier League has certainly dropped over the last few years. The top, world class players aren’t playing in England, they are in Spain,' he said.\nFormer Arsenal defender Lee Dixon hinted, however, that the problems faced by Premier League sides are merely part of ongoing cycle.\n‘We have the most exciting league, but the proof is in the Champions League. It is not really hard to work out, those stats don’t tell lies. These things tend to go around in circles, we have a batch, but at the moment it is pretty bad.'","url":"https://www.dailymail.co.uk/sport/football/article-4318444/Leicester-s-UCL-success-English-style-Dunne.html"}
