{"authors":["Chloe-Lee Longhetti","Bianca Soldani"],"date_download":"2018-10-23 03:02:15","date_modify":"2018-10-23 03:02:15","date_publish":"2016-01-11 15:30:39","description":"The swimming icon said she just wanted to be truthful about what goes on behind the scenes of sport in her book, claiming Stephanie Rice made 'bitchy' comments about her weight.","filename":"data/vaneerConsumption/LeiselJonesopensuponfeudwithStephanieRice.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300B0C6400000578-0-image-a-78_1452523348822.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393954_Leisel-Jones-opens-feud-Stephanie-Rice-admitting-memoir-comments-weren-t-meant-nasty_1540263735.html","title":"Leisel Jones opens up on 'feud' with Stephanie Rice","title_page":"Leisel Jones opens up on 'feud' with Stephanie Rice | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former Olympian Stephanie Rice recently downplayed claims of a feud between herself and former friend and fellow athlete Leisel Jones.\nAnd now Leisel, 30, has spoken out about their relationship and comments she made about the 27-year-old brunette in her memoir released last year and which made headlines.\nThe swimming icon this week told The Daily Telegraph she just wanted to shed light on what goes on behind the scenes of sport in her book, saying: 'I didn't write it to be nasty, I wanted to show how it's not all rosy for professional athletes.'\nScroll down for video\nHaving her say: Former Olympian Leisel Jones has this week opened up about her 'feud' with Stephanie Rice, and said her comments in her memoir about the brunette weren't meant to be 'nasty'\nShe told the newspaper they just don't gel well and said of the so-called feud detailed in her book: 'A lot of people say feud, but most of the story was lessons that I'd learnt along the way.'\nIn her memoirs entitled Body Lengths, Leisel claims their friendship collapsed claiming Stephanie had made 'bitchy' remarks about her weight and 'hurtful' comments to her London Olympics coach about her eating habits.\nShe also alleged she faced ridicule for the way she walked, her fashion choices and her performance in the pool.\nShe said Stephanie didn't own up to her actions, which is not what 'being in a team is about'.\nMaking headlines: In her book Body Lengths, Leisel (L) claims her friendship with Stephanie Rice (R) collapsed amid 'bitchy' remarks about her weight and 'hurtful' comments to her London Olympics coach\nTell all! Leisel is seen here with her book released last year\n'She can't remember bitching to my coaches about me or reporting on what I've eaten that day. What, she thinks I'm stupid? She thinks I don't hear?' Leisel wrote.\nShe also wrote of a failed confrontation with Stephanie in 2012, where she asked her what her 'problem' was, but said the brunette had nothing to say and walked out.\nIn December, Stephanie told NOVA's summer breakfast team she had no idea about the feud and would talk to her if their paths crossed.\nFeud? In December, Stephanie (second right) told NOVA 's summer breakfast team she had no idea about the feud with Liesel (pictured left)\n'I don't really know because all I've seen is what you've probably seen in the press and, to be honest, like who would want to reply to that,' Stephanie said at the time.\n'We trained together for a year, if I was to see her it's not like I would be not talking to her you know what I mean.'\nLeisel retired from the pool in November 2012, while Stephanie confirmed she was leaving the professional sport in April 2014.\nStephanie is now based in the US but has been back in Australia over Christmas.\nShe recently released an e-book called The Art Of Wellness to inspire others to live a healthy lifestyle.\nIn their career prime: Leisel (L) retired from the pool in November 2012, while Stephanie (R) confirmed she was leaving the professional sport in April 2014","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393954/Leisel-Jones-opens-feud-Stephanie-Rice-admitting-memoir-comments-weren-t-meant-nasty.html"}
