{"authors":["William Bigelow"],"date_download":"2018-10-30 21:14:35","date_modify":"2018-10-30 21:14:35","date_publish":"2016-02-25 12:46:37","description":"On Wednesday, a federal judge sentenced former California state senator Leland Yee, 67, to five years in prison.","filename":"data/vaneerConsumption/LelandYeeSentencedto5Years.json","image_url":"https://media.breitbart.com/media/2015/07/Leland-Yee-Justin-Sullivan-Getty1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_02_25__1540934075.html","title":"Leland Yee Sentenced to 5 Years","title_page":"Leland Yee Sentenced to 5 Years | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Wednesday, a federal judge sentenced former California state senator Leland Yee, 67, to five years in prison after Yee accepted a plea deal over charges of weapons trafficking.\nSenior District Court Judge Charles Breyer said he could not understand how Yee, a supposed gun control advocate, aided an undercover FBI agent in obtaining automatic weapons from the Philippines to be exported to the U.S.\nBreyer asserted, “I don’t feel I should be lenient. The crimes that you committed have resulted in essentially an attack on democratic institutions,” according to KCRA.\nIn 2006, the Brady Campaign named Yee to its Gun Violence Prevention Honor Roll for co-authoring a first-in-the-nation bill to require new semiautomatic handguns to be micro-stamped.\nProsecutors had wanted an eight-year sentence, while Yee’s attorneys, citing Yee’s years of public service and his wife’s illness, requested a sentence less than five years and three months behind bars.\nDuring the hearing, Yee acknowledged his guilt and his responsibility, allowing, “Nothing will ever take away those crimes and those actions. Nothing that I will ever do will take away the pain that I have caused to my family friends, constituents, supporters.” He had pled guilty in July to one count of conspiracy to engage in racketeering.\nThe charge against Yee derived from an organized crime investigation that also wound up nabbing Raymond “Shrimp Boy” Chow, the leader of the Ghee Kung Tong. Keith Jackson, a friend of Chow’s, raised money for Yee’s campaigns for San Francisco mayor in 2011 and secretary of state in 2012.","url":"https://www.breitbart.com/local/2016/02/25/yee-sentenced-to-5-years/"}
