{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 22:22:31","date_modify":"2018-10-22 22:22:31","date_publish":"2017-03-16 03:29:23","description":"Her roly poly physique used to be her comedy trademark. But it seems Lena Dunham will need some new material after she showcased her slimline new body","filename":"data/vaneerConsumption/LenaDunhamflauntsslimlinefigureatNewYorkopening.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E537CB000000578-0-image-a-254_1489661295134.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318636_Lena-Dunham-slimline-figure-mentor-Tracy-Anderson_1540246951.html","title":"Lena Dunham flaunts slimline figure at New York opening","title_page":"Lena Dunham flaunts slimline figure at New York opening | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She recently attributed her weight loss to Donald Trump's presidency - citing 'soul-crushing pain and devastation and hopelessness' in helping her slim down.\nAnd Lena Dunham proved the Trump diet is working a treat as she showcased her incredibly slimline new frame at the opening of mentor Tracy Anderson's studio in New York on Wednesday.\nThe Girls star, 30, looked thrilled to be flaunting her firmer form as she hammed it up with aplomb on the red carpet, at one point showing off her mobile phone after receiving a video call from fellow Anderson disciple Gwyneth Paltrow.\nScroll down for video\nPhone a friend: Tracy's most famous disciple Gwyneth Paltrow put in an appearance via video\nWhen she was recently quizzed over her weight loss, Lena revealed: 'Donald Trump became president and I stopped being able to eat food.\n'Everyone's been asking like: \"What have you been doing?\" And I'm like: \"Try soul-crushing pain and devastation and hopelessness and you, too, will lose weight\".'\nLena looks sensational in a slogan vest paired with bold multi-coloured leggings, which slotted in perfectly with her famously kooky style.\nFar from simply flaunting figure on the red carpet, she also used technology to enjoy some company with superstar guest Gwyneth.\nSkinny Girl: The slimline physique Lena Dunham showcased in New York on Wednesday is a far cry from her famously curvy figure she displayed on the set of Girls in 2015\nKiss goodbye: Far from simply flaunting figure on the red carpet, she also used technology to enjoy some company with superstar guest Gwyneth\nA serving of Goop: As one of Tracy's most staunch followers, the blonde beauty looked stunning as she delightedly chatted to the audiences and Lena\nAs one of Tracy's most staunch followers, the blonde beauty looked stunning as she delightedly chatted to the audiences and Lena.\nLena was joined by a host of big names, including model Hilary Rhoda, DJ Hannah Bronfman, chef Alexandra Guarnaschelli and, of course, Tracy Anderson herself.\nLena has claimed she has did not become dedicated to exercise as she wanted to lose weight or change the shape of her body.\nMentor: She was paying tribute to her fitness guru Tracy Anderson at the opening of her new studio in the Big Apple\nBeach bod buddies: Lena and Tracy were pictured together in August 2015\nSpeaking about her newfound love of fitness and her workouts with Tracy in 2015, she said Tracy Anderson's method is her 'main form of exercise'.\nShe said: 'It's a mix of aerobics, strength training and something that kind of resembles Pilates but that she created on her own.\n'What I like about it is that Tracy really listens to your body and what you're capable of. There's no weird pressure. It's honestly like if one day I have a UTI and I can't jump up and down, she'll say, \"OK, we'll adjust.\"\n'With Tracy it's not about getting everyone to look a specific way. It's about getting everyone to feel strong. And she uses the word \"connected\" a lot, which I really love. I love the idea of feeling connected.'\nBody of evidence: The small screen stunner is walking proof of the benefits of exercise\nPut it away love: 'With Tracy it's not about getting everyone to look a specific way. It's about getting everyone to feel strong. And she uses the word \"connected\" a lot, which I really love. I love the idea of feeling connected.'\nTracy found fame after her fitness method attracted celebrity disciples such as Madonna and Gwyneth Paltrow almost a decade ago.\nThe mother-of-two, who makes the claim that women should never lift weights heavier than three pounds, insists her workout regimen gives women a streamlined physique because her programs focus on 'accessory' muscles rather than major muscle groups.\nHowever many of her claims have not been backed by experts.\nFine fillies: Model Hilary Rhoda and DJ Hannah Bronfman trotted down to the event\nConfounding the critics: Tracy is going from strength-to-strength despite the AMA saying it sometimes looks like she is 'making up the moves as she goes along'\nAn American Running Association paper said: 'There is nothing to suggest that her exercises actually work only the \"accessory muscles,\" or what she means by that term. (The accessory muscles do exist; they are used in respiration.)\n'But Tracy never lists these muscles by name. Even more shaky is the claim that targeting these muscles will cause them to \"pull in\" the larger muscles around them.'\nIt later added: 'To watch Tracy on her infomercial, you get the sense that sometimes she is just bouncing around with 3-lb weights, moving them in different ways, making up the moves as she goes along.'\nMaking up the numbers: Iron Chef cook Alexandra Guarnaschelli was also there","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318636/Lena-Dunham-slimline-figure-mentor-Tracy-Anderson.html"}
