{"authors":["Christine Rendon For Dailymail.Com"],"date_download":"2018-10-23 05:23:34","date_modify":"2018-10-23 05:23:34","date_publish":"2017-04-26 16:51:33","description":"The 30-year-old Girls actress and Jack, the singer for Bleachers, have been dating for five years now, and on Monday the couple took to Instagram to mark the milestone with a sweet snap.","filename":"data/vaneerConsumption/LenaDunhamandboyfriendJackAntonoffpackonPDA.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA07B1200000578-0-image-a-21_1493220343784.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4448262_Lena-Dunham-boyfriend-Jack-Antonoff-pack-PDA_1540272214.html","title":"Lena Dunham and boyfriend Jack Antonoff pack on PDA","title_page":"Lena Dunham and boyfriend Jack Antonoff pack on PDA | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They just celebrated five years together.\nAnd sparks were flying as Lena Dunham, 30, and her boyfriend Jack Antonoff, 33, gave each other some kisses in Brooklyn on Wednesday.\nThe couple were spotted locking lips during an outing with a pal.\nThey have a spark! Lena Dunham and her boyfriend Jack Antonoff couldn't have looked anymore in love as they gave each other some kisses in Brooklyn on Wednesday\nLena looked in great spirits as she gave her beau some affection, clutching her bottle of green tea.\nThe star had her hair scraped back into a high ponytail and went without a trace of makeup.\nShe rocked a funky black and white Madewell cardigan, a striped jumpsuit, and a pair of bow-embellished sneakers from Rihanna's Fenty x Puma collection.\nJack wore a jean Tommy Hilfiger jacket, green and white hat, and glasses.\nPeace and love! Dunham, wearing a Madewell sweater, striped jumpsuit and green Fenty x Puma sneakers, looked in top spirits as she flashed the peace sign\nLena and Jack have been dating for five years now, and on Monday the couple took to Instagram to mark the milestone with a sweet snap.\nJack, who is the lead singer of Bleachers, shared a photo of himself wrapped up in Lena's arms.\n'5 years today,' he wrote in the caption. 'what a f**king glorious ride!'\nJean-ius! Jack wore a jean Tommy Hilfiger jacket, green and white hat, and glasses\n'What a f**king glorious ride!' Antonoff shared a snap of himself wrapped in his girlfriend's arms\nLena also posted a celebratory snap, which was of her smiling brightly as she hung out with her beau.\n'5 years today. Making a life and making art with this beautiful goon. Stay tuned for the Don't Take The Money music video which is how we celebrated half a decade,' she captioned the photo.\nMeanwhile, Lena's hit series, Girls, has recently come to an end after six seasons on HBO.\nThe series following the lives of various young women living in New York City aired it's series finale last week.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4448262/Lena-Dunham-boyfriend-Jack-Antonoff-pack-PDA.html"}
