{"authors":["Associated Press"],"date_download":"2018-10-22 23:21:17","date_modify":"2018-10-22 23:21:17","date_publish":"2016-01-11 05:22:56","description":"BEVERLY HILLS, Calif. (AP) — Leonardo DiCaprio did more than just survive a bear mauling in \"The Revenant.\" He won a Golden Globe as best dramatic actor for ...","filename":"data/vaneerConsumption/LeonardoDiCapriowinsGoldenGlobefordramaticactor.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:bd9b7adb50484d5e9d1b18eba591bb25-48qEJGFphM8d437f0aaf920b62f2-915_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393366_Leonardo-DiCaprio-wins-Golden-Globe-dramatic-actor_1540250477.html","title":"Leonardo DiCaprio wins Golden Globe for dramatic actor","title_page":"Leonardo DiCaprio wins Golden Globe for dramatic actor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Leonardo DiCaprio wins Golden Globe for dramatic actor\nBEVERLY HILLS, Calif. (AP) — Leonardo DiCaprio did more than just survive a bear mauling in \"The Revenant.\" He won a Golden Globe as best dramatic actor for the 19th century survival epic.\nThe movie also earned Globes for motion picture, and for director Alejandro Inarritu at the Sunday night ceremony.\n\"It's very rewarding,\" DiCaprio said backstage. \"We had a very solid opening weekend because I think people appreciate seeing a different type of cinema out there.\"\nAlejandro Gonzalez Inarritu, left, and Leonardo DiCaprio pose in the press room with the award for best motion picture - drama for ¿The Revenant¿ at the 73rd annual Golden Globe Awards on Sunday, Jan. 10, 2016, at the Beverly Hilton Hotel in Beverly Hills, Calif. (Photo by Jordan Strauss/Invision/AP)\nDiCaprio was saluted with a standing ovation from the audience when his name was called at the Beverly Hilton hotel.\nAs a fur trapper, DiCaprio braved icy waters, ate raw bison and went to find his mates who left him for dead in the unforgiving wilderness. The film was shot during nine months in what he described as \"rough conditions.\"\n\"I share the award with all the indigenous communities around the world,\" DiCaprio said in his acceptance speech. \"It is time we recognize your history and protect your indigenous lands from corporate interests and people who are out there to exploit them.\"\nDiCaprio beat out fellow nominees Bryan Cranston of \"Trumbo,\" Michael Fassbender of \"Steve Jobs,\" Eddie Redmayne of \"The Danish Girl,\" and Will Smith of \"Concussion.\"\nThe 41-year-old actor born in Hollywood earned his third career Golden Globe. His earlier wins came two years ago for \"The Wolf of Wall Street\" and in 2005 for \"The Aviator.\"\nIn this image released by NBC, Leonardo DiCaprio accepts the award for best actor in a motion picture drama for his role in \"The Revenant\" during the 73rd Annual Golden Globe Awards at the Beverly Hilton Hotel in Beverly Hills, Calif., on Sunday, Jan. 10, 2016. (Paul Drinkwater/NBC via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3393366/Leonardo-DiCaprio-wins-Golden-Globe-dramatic-actor.html"}
