{"authors":["Chris Wheeler For Mailonline"],"date_download":"2018-10-22 20:54:09","date_modify":"2018-10-22 20:54:09","date_publish":"2017-03-16 00:01:26","description":"Monaco coach Leonardo Jardim believes his side deserve their place in the Champions League quarter-finals, insisting that Manchester City were lucky in the first leg at the Etihad.","filename":"data/vaneerConsumption/LeonardoJardiminsistsMonacodeservedManCitywin.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4F645500000578-0-image-a-136_1489622417028.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4318346_Leonardo-Jardim-insists-Monaco-deserved-Man-City-win_1540241649.html","title":"Leonardo Jardim insists Monaco deserved Man City win","title_page":"Leonardo Jardim insists Monaco deserved Man City win | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Monaco coach Leonardo Jardim believes his side deserve their place in the Champions League quarter-finals, insisting that Manchester City were lucky in the first leg at the Etihad.\nMonaco lost that game 5-3 but recovered at the Stade Louis II on Wednesday night to win 3-1 and go through on away goals.\nJardim said: 'We didn't let them touch the ball in that first half. It was harder in that second half, and we didn't have the players on the bench to help.\nLeonardo Jardim celebrates at the full-time whistle after his Monaco side secured the win\nTiemoue Bakayoko fired a header past Willy Caballero to ensure Monaco's progression\n'But look, City won that first game with a dose of luck, and today we deserved to win. It's a deserved qualification.\n'Everyone is happy. We've achieved our objective, qualifying with a big performance. In that first half, we didn't let City play at all anywhere on the pitch, high pressing, and we scored goals. It was tighter in the second half but, if you analyse the two matches, home and away, Monaco deserved to qualify.'\nJardim had predicted before the game that Monaco would have to score three goals to go through.\n'Yes because I couldn't see them not scoring at all,' he added. 'I know their team. They've got some of the best attacking players in the world, so keeping them out was always going to be tough. But we've got some good attacking players, too. They believed me when I said that, if we scored three, we'd go through.\n'We do well against English teams. We've beaten Arsenal, Manchester City and Tottenham, a big team as well, in the last few years. I hope it's not the last big performance we put in.'\nBakayoko wheels away in celebration; Jardim believes his side's win was deserved","url":"https://www.dailymail.co.uk/sport/football/article-4318346/Leonardo-Jardim-insists-Monaco-deserved-Man-City-win.html"}
