{"authors":[],"date_download":"2018-10-22 20:33:01","date_modify":"2018-10-22 20:33:01","date_publish":"2015-06-13 00:00:00","description":"With his natty attire and laid-back grooves, the 25-year-old singer has attracted eager fans and Sam Cooke comparisons in abundance.","filename":"data/vaneerConsumption/LeonBridgesSoulfulComingHomeNPR.json","image_url":"https://media.npr.org/assets/img/2015/06/11/leon-bridges-2_wide-ee2b30bd30088c3ad329f9713de1e966fbaf9ff4.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=413660949_1540240381.html","title":"Leon Bridges' Soulful 'Coming Home' : NPR","title_page":"Bridging The Decades: Leon Bridges' Soulful 'Coming Home' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ARUN RATH, HOST:\nThis is ALL THINGS CONSIDERED from NPR West. I'm Arun Rath.\n(SOUNDBITE OF SONG, \"BETTER MAN\")\nRATH: Meet your new favorite singer.\n(SOUNDBITE OF SONG, \"BETTER MAN\")\nLEON BRIDGES: (Singing) I don't want much. I just want to be a better man to my baby. Meet me off, good luck. I was singing with them Jezebels under perfume sheets.\nRATH: His name is Leon Bridges. He's just 25 years old from Fort Worth, Texas, and he's about to blow up. The first tracks from his debut album started to sneak out a few months ago, and they've already become hits online, which sounds crazy, right? I mean, listen to this. This is straight out of 1958.\n(SOUNDBITE OF SONG, \"BETTER MAN\")\nBRIDGES: (Singing) I'd swim the Mississippi River if you would give me another start, girl.\nRATH: When I went to see Leon Bridges perform here in Los Angeles, not only did he sound like Sam Cooke, he even dressed like Sam Cooke. The comparisons are unavoidable.\nBRIDGES: You know, it's very flattering, you know, that people compare me to Sam Cooke. But I'm nowhere on his level, you know? He's one of my biggest inspirations. And so I try to pull from him, but whatever I write is whatever comes out naturally.\nRATH: But there's definitely something there in terms of - there's a sound, there's a certain quality, you know, to your songwriting and what you even produce these song that evokes that, right?\nBRIDGES: Yes, you know, in the sense of like the very smooth in doo-wop, simple R&B sound.\nRATH: And there's just kind of like a simplicity - like a purity to it?\nBRIDGES: You know, a lot of his songs - you know, R&B songs - were in that time were, you know, vice-oriented, you know? And so, you know, that's one thing I love about that time, you know, and what I'm drawn to. But when Austin Jenkins came up to me...\nRATH: That's Austin Jenkins of the band White Denim.\nBRIDGES: Yes. One night, you know, after a little solo performance, he told me the vision that he had, you know, after seeing my songs. And we got into the studio and the first song - the track was \"Coming Home.\" And there was something very special about that.\n(SOUNDBITE OF SONG, \"COMING HOME\")\nBRIDGES: (Singing) Baby, baby, babe, I'm coming home to your tender, sweet lovin'. You're my one-and-only woman. The world leaves a bitter taste in my mouth, girl. You're the only one that I want. I want to be around you.\nRATH: Maybe thanks to SoundCloud, like, you were already getting big before this record was even put together. Can you talk about - how did you get so big so fast? Was it just - you know...\nBRIDGES: (Laughter) Yeah.\nRATH: How did - explain your viral success.\nBRIDGES: Indeed. Well, thank God for Gorilla vs. Bear.\nRATH: You have to explain that.\nBRIDGES: Yeah. It's a blog out of Dallas, Texas. My management had reached out to them and showed them the \"Coming Home\" song and told them, you know, this is happening in your own backyard. And after they released it around October, the song just blew.\n(SOUNDBITE OF SONG, \"COMING HOME\")\nBRIDGES: (Singing) The world leaves a bitter taste in my mouth, girl. You're the only one that I want. I want to be around, want to be around, girl, want to be around, girl, oh, want to be around.\nRATH: Did you grow up listening to music from that time?\nBRIDGES: I didn't. I was a kid that was really fascinated with Ginuwine and Usher and 112 and Dru Hill, you know? That was good R&B for the time, you know - but didn't really get into classic soul music until about two years ago. I started writing songs and playing guitar about four years ago. And in that time, I wrote a song about my mother, \"Lisa Sawyer.\" A friend of mine asked me if Sam Cooke was one of my inspirations. And I had felt bad because I never really listened to Sam Cooke. And so after that, I started really digging in. And, you know, as I was listening to it, I started to see that that's the lane that I wanted to go down.\n(SOUNDBITE OF SONG, \"LISA SAWYER\")\nBRIDGES: (Singing) Never had much money, but was filthy rich with the wealth you couldn't get from a dark casino or lottery ticket. They had love, love, love, rich in love.\nRATH: \"Lisa Sawyer,\" which is actually - that's one of my favorite songs on this new record. I think that song has my favorite line about she's small, but a mansion in her eyes.\nBRIDGES: Yes, you know, my mother grew up - never really had a lot of money. But, you know, they were very, you know, content. Her mother and father, you know, worked hard to make sure, you know, they were always comfortable. And, you know, as a kid, everything is always big, you know, in your eyes. And so that's where that line came from.\nRATH: And it feels like that and other songs of yours, like \"River,\" there's definitely some biblical and spiritual connotations.\nBRIDGES: Indeed. I come from, you know, a spiritual background. And I can't never deny those roots. And so I like to really embrace that. You know, just, you know, undertones, not really shouting in anybody's face - but, you know, I definitely love to embrace that in my music.\n(SOUNDBITE OF SONG, \"RIVER\")\nBRIDGES: (Singing) Been traveling these wide roads for so long. My heart's been far from you, 10,000 miles gone. Oh, I want to come here and give you every part of me. But there's blood on my hands and my lips are unclean. In my darkness, I remember Mama's words reoccur to me - surrender to the good Lord, and he'll wipe your slate clean. Take me to your river. I want to go.\nRATH: And again, you know, I hate to keep bringing up Sam Cooke, but that's another thing where, obviously, he came from a gospel background. And there's that beautiful kind of churchy feeling - that haunting quality that's in so much of his music.\nBRIDGES: You know, with me it's almost like the same situation because before this sound that you hear now, I was writing nothing but gospel music, you know? And after I kind of had this realization, you know, and I changed, you know, I started writing love songs. And, you know, I was very worried about, you know, my friends and - that they wouldn't accept it. But, you know, everybody was really cool about it, even my mother - you know, a very religious person. I played her song one time in the car and she was like boy, did you write this? I was like yes, ma'am. But no, she was like yeah, I love it, you know? And so it was just cool that she - her support.\n(SOUNDBITE OF SONG, \"RIVER\")\nBRIDGES: (Singing) Take me to your river. I want to go. Oh, go on, take me to your river. I want to know\nUNIDENTIFIED SINGER: I want to go, want to go, want to go.\nRATH: That's Leon Bridges. His new album is called \"Coming Home.\" Leon, it was such a pleasure speaking with you. Thank you so much.\nBRIDGES: Really nice talking to you. Thank you.\n(SOUNDBITE OF SONG, \"SMOOTH SAILIN'\")\nBRIDGES: (Singing) Over the horizon, she's smooth sailin' these concrete seas.\nRATH: And when you get back to work on Monday, be sure to check out NPR Music for an exclusive First Listen with Leon Bridges and stream every track from the new album for free.\n(SOUNDBITE OF SONG, \"SMOOTH SAILIN'\")\nBRIDGES: (Singing) Said I like the way you sail your ship down. Let me be your cargo. I won't wear you down. No, honey, I won't wear you down.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=413660949"}
