{"authors":[],"date_download":"2018-10-23 00:49:45","date_modify":"2018-10-23 00:49:45","date_publish":"2016-01-28 14:55:25","description":"Pope Francis received US film star Leonardo DiCaprio at the Vatican on Thursday, with the pair bonding over their shared passion for defending the environmen...","filename":"data/vaneerConsumption/LeonardoDiCapriobondswithPopeoverprotectingplanet.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h0cc-2vdWmEltwXfba0ce28e6329c20c7-255_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421102_Leonardo-DiCaprio-bonds-Pope-protecting-planet_1540255785.html","title":"Leonardo DiCaprio bonds with Pope over protecting planet","title_page":"Leonardo DiCaprio bonds with Pope over protecting planet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Leonardo DiCaprio bonds with Pope over protecting planet\nPope Francis received US film star Leonardo DiCaprio at the Vatican on Thursday, with the pair bonding over their shared passion for defending the environment.\nBlue-eyed DiCaprio was spotted listening earnestly as the Argentine pontiff explained that he was presenting the actor with a copy of his hard-hitting thesis on climate change, Laudato Si, published last year.\nThe 41-year old star won the Crystal Award at the World Economic Forum in Davos this month for his green credentials.\nPope Francis exchanges gifts with US actor Leonardo DiCaprio (L) during a private audience at the Vatican on January 28, 2016\nThe movie great, who rose to fame with \"Titanic\" and has been nominated for a best actor Oscar for his role in \"The Revenant\", set up a foundation in 1998 dedicated to protecting endangered wildlife and vulnerable eco-systems.\nRaised in Los Angeles in a Catholic family of Italian and German origins, atheist DiCaprio -- looking dapper in a black suit and tie -- was all smiles with the white-robed pope, who has repeatedly blamed mankind for climate change.","url":"https://www.dailymail.co.uk/wires/afp/article-3421102/Leonardo-DiCaprio-bonds-Pope-protecting-planet.html"}
