{"authors":["Thomas Burrows For Mailonline"],"date_download":"2018-10-23 00:22:05","date_modify":"2018-10-23 00:22:05","date_publish":"2017-03-16 09:30:00","description":"Exclusive: This sickening footage shows a young leopard in Namibia being savagely attacked by four dogs before being bludgeoned to death by a man wielding an axe.","filename":"data/vaneerConsumption/Leopardsavagedbydogsthenbeatentodeathwithanaxe.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/16/3E4D592000000578-0-image-a-31_1489596739720.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4317034_Leopard-savaged-dogs-beaten-death-hammer_1540254125.html","title":"Leopard savaged by dogs then beaten to death with an axe","title_page":"Leopard savaged by dogs then beaten to death with an axe | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This sickening footage shows a young leopard in Namibia being savagely attacked by four dogs before being bludgeoned to death by a man wielding an axe.\nThe gruesome killing lasts for several minutes and the men can be heard laughing as they watch the barbaric scene unfold.\nAs the leopard lies in obvious distress on the ground, one of the men pokes him in the mouth with a stick before another launches the vicious axe attack.\nAudrey Delsink, director of Humane Society International, said: 'This attack will send shockwaves across Namibia and the world.'\nHorrific footage shows a group of four dogs attacking a defenceless leopard lying on the floor\nThe dogs savagely attack the leopard while a group of men with guns stand around laughing\nAs the barbaric attack continues, the man circle the leopard and start beating him with sticks\nAlthough trophy hunting of leopards with dogs is illegal in Namibia, there is a provision under the country's Nature Conservation Ordinance 4 of 1975 that allows a landowner to kill 'protected game' (which includes leopards) via a special permit when defending human or animal life or crops.\nThe problem is the provision leaves the door wide open for abuse and suffering, campaigners have said.\nSpeaking to MailOnline Masha Kalinina, International Trade Policy Specialist with Humane Society International, said: 'No appropriate kill methods are specified, meaning anything goes like cruel trapping, poisoning and hunting with dogs.\n'The troubling thing is that the men in the video have guns but never use them. The animal is incapacitated, it's in a trap and it never poses a danger. However it is threatened by dogs and then bludgeoned to death.\n'Under the law there is nothing to make landowners show they have tried alternative non-lethal measures first before resorting to killing. We don't know if this animal was indeed the 'problem' animal before it was killed.'\nShe added: 'We think this leopard was attacked because cattle was killed on the farm. The leopard looks like a juvenile, as a less mature animal finds livestock easier to catch than live game.'\nThe charity has launched a petition calling for reforms which would protect the animals.\nOne of the men shoves his stick into the leopard's mouth as he lies in agony on the ground\nDespite the men carrying guns, they do not shoot the leopard - instead prolonging his agony\nMs Kalinina said the loophole that landowners are exploiting required an urgent change to prevent leopards being killed inhumanely.\n'We are calling on the Namibian government, The Ministry of Agriculture, Water and Forestry, who we believe operate the farm in the video, as well as the Ministry of Tourism, that runs the nearby wildlife area, to amend the 1975 Ordinance', she explained.\n'We want to prohibit cruel killing methods like trapping, poisoning, hunting with dogs and bludgeoning - anything that causes unnecessary suffering to the animal.\n'These types of causes of killing are common but rarely investigated.\n'We want a proper investigation into what happened and we are trying to gather as much information together as we can.\n'The killing is also supposed to be reported within ten days [by law] but we believe this took place earlier this year, possibly, in February, and it's unclear if it was reported.'\nIn a distressing image, one of the men eventually kneels down and clubs the leopard to death with an axe\nThe savage killing comes at a time when the leopard is classified as 'vulnerable' on the International Union for Conservation of Nature Red List of Threatened Species.\nThis means it is at 'high risk of endangerment in the wild.'\nThe leopard population in sub-Saharan Africa, which includes Namibia, has declined by more than 30 per cent in the last 20 years.\nReacting to the gruesome footage, Mrs Delsink, director of Human Society International, said: 'The killing of this leopard is one of the most heinous examples of wanton animal cruelty I have ever seen.\n'This poor trapped creature endured a prolonged attack and will have suffered immensely throughout.\n'What is particularly shocking is the utter disrespect displayed by the men involved, who laugh as the animal is repeatedly savaged by dogs and beaten.\n'Such animal cruelty is abhorrent and will, I am sure, send shockwaves across Namibia and the world. It is imperative that the men who took part in this attack be held accountable and that the tragic death of this leopard leads to an urgent change in Namibia's law.\n'No animal should ever be treated this way, and the loophole that provides carte blanche for such cruel and barbaric killing must be closed.'\nCampaigners believe the attack was filmed on a government-owned commercial farm under the management of the Ministry of Agriculture, located on the east of the Waterberg Plateau National Park, which is run by the Ministry of Environment and Tourism.\nA call to the governmental department went unanswered last night.\n'This is a senseless and brutal act that is not justifiable under any circumstance,' said Dr Joseph Okori, Regional Director, Southern Africa for the International Fund for Animal Welfare (IFAW).\n'The Namibian government should consider reviewing its policies with regards to protected species as a whole, and to align itself with international best practices that do not allow such appalling cruelty.\n'Namibia should also set in motion a process to institute sound regulations and guidelines for dealing with Problem Animal Control, similar to those in regional countries like Botswana.'","url":"https://www.dailymail.co.uk/news/article-4317034/Leopard-savaged-dogs-beaten-death-hammer.html"}
