{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 18:31:16","date_modify":"2018-10-30 18:31:16","date_publish":"2017-02-21 17:13:37","description":"France's National Front leader Marine Le Pen has opted to cancel a meeting with Lebanon’s Grand Mufti rather than wear an Islamic veil","filename":"data/vaneerConsumption/LePenRefusestoWearHeadscarfCancelsMeetingWithGrandMufti.json","image_url":"https://media.breitbart.com/media/2017/02/GettyImages-643318158-e1487696731954.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_02_21__1540924276.html","title":"Le Pen Refuses to Wear Headscarf, Cancels Meeting With Grand Mufti","title_page":"Le Pen Refuses to Wear Headscarf, Cancels Meeting With Grand Mufti","title_rss":"NULL","source_domain":"breitbart.com","text":"\"It's a no\": Marine Le Pen refused to wear a headscarf for a meeting with Lebanon's grand mufti https://t.co/f6ATRYTV3B pic.twitter.com/lDcNOVL3A2\nThe leader of France’s National Front, Marine Le Pen, has opted to cancel a meeting with Lebanon’s Grand Mufti rather than wear an Islamic veil.\nMs Le Pen is in the country to meet its leaders ahead of the first round of voting in France’s Presidential elections in April, in which she is expected to top the polls. But when offered a scarf to wear to a scheduled meeting with the Sunni religious leader, the Grand Mufti Sheikh Abdul Latif Derian, she declined.\n“I met the grand mufti of Al-Azhar,” she told reporters, referring to a 2015 visit to Cairo’s historical centre of Islamic learning. “The highest Sunni authority didn’t have this requirement, but it doesn’t matter.\n“You can pass on my respects to the grand mufti, but I will not cover myself up,” she said.\nPress officers for the cleric said they were “surprised by her refusal” as her aides had been informed in advance of the requirement to wear a headscarf.\nLe Pen is using a two-day visit to Lebanon to bolster her foreign policy credentials, and may be partly targeting potential Franco-Lebanese votes. Many Lebanese fled to France, Lebanon’s former colonial power, during their country’s 1975-1990 civil war and became French citizens.\nOn Monday she met with Lebanon’s Christian President Michel Aoun – her first public handshake with a head of state – to discuss matters of mutual interest including the migrant crisis and combatting terrorism.\n“We discussed the long and fruitful friendship between our two countries,” she said following the 30 minute meeting, adding: We raised… the concerns we share over the very serious refugee crisis.\n“These difficulties are being overcome by the courage and generosity of Lebanon but this cannot go on for ever.”\nLater the same day she met with the country’s Sunni Prime Minister Saad al-Hariri, with whom she discussed Syria.\n“I explained clearly that … Bashar al-Assad was obviously today a much more reassuring solution for France than Islamic State would be if it came to power in Syria,” she told reporters, going against current French policy to describe Assad as the “only viable solution” for preventing Islamic State from colonising Syria.\nOn Tuesday she continued her visit by meeting with Lebanon’s Cardinal Mar Bechara Boutros al-Rai, the Maronite Patriarch of Antioch and the Whole Levant, at the Maronite Patriarchate in Bekerke north of Beirut.\nMs Le Pen’s refusal to don the Islamic scarf comes just a week after a delegation from Sweden’s “feminist” government were accused of hypocrisy for wearing headscarves for almost the entirety of their visit to Iran.\n“The veil is a symbol of the oppression of women in Iran, and it is not only customary, but legislated oppression of women,” the Swedish Liberal Party leader Jan Björklund said, adding: “It is very unfortunate that the Swedish ministers are appearing in pictures, now in circulation, with the veil on.”","url":"https://www.breitbart.com/europe/2017/02/21/le-pen-forgoes-meeting-with-grand-mufti-rather-than-wear-islamic-veil/"}
