{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:33:33","date_modify":"2018-10-30 18:33:33","date_publish":"2017-04-28 08:05:14","description":"Le Pen has reached out to supporters of her former rival Mélenchon, arguing her anti-establishment pitch reflects their outlook better than centrist Macron.","filename":"data/vaneerConsumption/LePenWoosHardLeftVotersCallstoNotSubmittoNeoliberalMacron.json","image_url":"https://media.breitbart.com/media/2017/04/GettyImages-671089620.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_04_28__1540924413.html","title":"Le Pen Woos Hard-Left Voters, Calls to Not 'Submit' to 'Neoliberal' Macron","title_page":"Le Pen Woos Hard-Left Voters, Calls to Not 'Submit' to 'Neoliberal' Macron ","title_rss":"NULL","source_domain":"breitbart.com","text":"Marine Le Pen has reached out to supporters of her hard-left former rival Jean-Luc Mélenchon, arguing her anti-establishment pitch reflects their outlook better than centrist former Economy Minister Emmanuel Macron.\nMr. Mélenchon ran for president under the slogan “Unsubmissive France”; the Front National leader urged her followers not to “submit” to the “neoliberal” capitalism of her establishment rival, which many on the left oppose.\n“I want to ask Mélenchon’s supporters, ‘Do you really intend to cast your votes for Mr. Macron?’” Ms. Le Pen said in a televised interview on Tuesday, referring to a new labour law reviled by leftists.\nMr. Macron, she claimed, “would pass legislation a thousand times” worse than the outgoing Socialist administration.\nShe said she was the “candidate of the people”, whilst repeatedly referring to her opponent as the choice of “oligarchs”, echoing the language of her former hard-left rival, France24 reports.\nA “submissive” Mr. Macron leading the nation would mean “France submitting to everything: to the European Union, to Germany, to the United States, etc”, she added.\nThe “anti-capitalist” candidate was eliminated in the first round of voting, after winning the support of more that 19 per cent of voters. Ms. Le Pen came a close second, with 21.3 per cent of the vote, behind Mr. Macron on 24.01 per cent.\nMr. Mélenchon has so far refused to endorse Mr. Macron, but has said he would not vote for Ms. Le Pen.\nFollowing her televised appearance, leaflets appeared on social media comparing Ms. Le Pen’s Front National policies to those of Mr. Mélenchon’s manifesto.\nThe two candidates agree on issues as diverse as bringing in protectionist measures to electoral reform and proportional representation, as well as leaving the European Union (EU) and NATO.\nThe major point of divergence is migration, integration, and multiculturalism. The right wing candidate wants to almost completely stop immigration, whereas the left winger “welcomes” migrants.\nMs. Le Pen has also been frank and direct about the problems associated with radical Islam and terror. Her former rival, however, has said there is no link between Islam and terror and has called Le Pen “racist”.","url":"https://www.breitbart.com/europe/2017/04/28/le-pen-woos-hard-left-melenchon-supporters-dont-submit-neoliberal-macron/"}
