{"authors":["Associated Press"],"date_download":"2018-10-23 00:46:42","date_modify":"2018-10-23 00:46:42","date_publish":"2017-04-26 10:45:36","description":"AMIENS, France (AP) - Far-right presidential candidate Marine Le Pen turned an appliance factory into a battleground Wednesday for France's blue-collar vote,...","filename":"data/vaneerConsumption/LePenupstagesMacroninbattleforbluecollarvotes.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/18/wire-466819-1493226972-166_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446978_Macron-risky-hunt-blue-collar-votes-against-Le-Pen_1540255602.html","title":"Le Pen upstages Macron in battle for blue-collar votes","title_page":"Le Pen upstages Macron in battle for blue-collar votes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"AMIENS, France (AP) - Far-right presidential candidate Marine Le Pen turned an appliance factory into a battleground Wednesday for France's blue-collar vote, upstaging rival Emmanuel Macron with a surprise campaign stop at the plant threatened with closure.\nChaotic scenes followed as Macron, a pro-European Union centrist, sought to wrestle back the initiative by making his own, impromptu stop at the Whirlpool clothes-dryer plant in Amiens, spending over an hour in Le Pen's wake trying to reason with angry employees who asked why the former finance minister hadn't come there earlier.\nThe remarkable drama, broadcast live on French news channels, transformed the plant in northern France into a symbol of the diametrically opposed campaigns of Le Pen and Macron before their May 7 runoff election.\nFar-right French presidential candidate Marine Le Pen is greeted by workers outside a whirlpool home appliance factory in Amiens, France, Wednesday April 26, 2017. While her centrist presidential opponent Macron was meeting with union leaders from the Whirlpool plant in northern France, Le Pen popped up outside the factory itself, amid its workers and declared herself the candidate of France's workers.(AP Photo)\nAs Macron met elsewhere with the workers' union leaders, Le Pen displayed her political guile by grabbing the spotlight and popping up outside the factory itself. Surrounded by employees in bright-yellow hazard vests, she declared herself the workers' candidate and vowed that if elected, she would not let the factory close.\n\"We'll get you out of here,\" Le Pen said as she hugged a woman in the crowd outside the plant, its fences decorated with workers' banners. \"I am the candidate of workers, the candidate of the French who don't want their jobs taken away.\"\nHer wily campaign maneuver stole Macron's thunder and put him on the defensive. It prompted him to make his own trip to the factory a few hours later - which quickly looked like he had fallen into a trap set by Le Pen. Live TV coverage of his visit looked chaotic and potentially damaging, with people whistling, booing and chanting \"Marine, president!\" in the background.\n\"Why didn't you come before?\" one woman asked.\n\"Save our jobs, Monsieur Macron!\" yelled a man.\nBut Macron, appearing in a suit and tie amid the workers, held his ground. Where Le Pen's visit was short - with a few selfies, hugs, kisses and a quick speech to the cameras - Macron spent over an hour patiently, and at times passionately, explaining in often-heated exchanges that as president, he wouldn't be able to stop companies from laying off workers. The back and forth was shown live on Macron's Facebook page, signaling a desire not to let Le Pen hog the limelight.\n\"I won't lie to you,\" he said. \"There is no miracle recipe.\"\nThe contrasting images of Le Pen smiling with workers and Macron debating them spoke to her political experience and laid bare their contrasting styles.\nThe 48-year-old populist is fighting her second presidential campaign after coming in third in 2012, while the 39-year-old former investment banker is waging his first, having never held elected office.\nLe Pen hit Macron close to home with her politicking: He was born in Amiens.\nNeeding millions more votes to beat Macron in the runoff, Le Pen hammered home her arguments that more French jobs would be lost abroad under Macron's more economically liberal program.\n\"I'm here, in my place, exactly where I should be, in the midst of Whirlpool's employees, these employees who are resisting this wild globalization, this shameful economic model,\" Le Pen said.\nIn a dig at Macron's meeting with union leaders, she added: \"I'm not eating little cakes with a few representatives who, in reality, represent only themselves.\"\nMacron said Le Pen was engaging in \"political haymaking.\"\nEven before Le Pen's surprise appearance, Macron's intervention in the Whirlpool factory's future, in a region where Le Pen got more votes in Sunday's first-round balloting, was fraught with risk. He had to tread a fine line between defending his program to tackle France's chronic unemployment without falling into the trap of making campaign promises that he may struggle to keep.\nBecause production at the Whirlpool plant is due to stop next year and move to Poland, the workers' plight is a prickly issue for Macron as he campaigns on a pro-EU platform.\nLe Pen seized on Whirlpool as a sign of the EU's ills, calling it \"the symbol of this odious globalization, which leads to plants moving abroad, destroying thousands of jobs.\"\nMacron insisted he did the right thing by meeting with union leaders before going the factory itself.\n\"If you don't speak to employees' representatives and engage in direct democracy, using invective or false promises, you don't solve any of the country's problems,\" he said.\nHe shot down Le Pen's plans to re-establish French borders - part of her program calling for \"French-first\" economic and social protectionism.\n\"The closure of borders is a promise made of lies,\" Macron said.\nThe Amiens factory joins a list of threatened plants that have become symbolic of job losses in French presidential campaigns.\nIn the 2012 race, Socialist Francois Hollande traveled to a threatened steel plant in eastern France's rust belt in a similar pursuit of blue-collar votes. Union leaders later felt betrayed when the Hayange plant's blast furnaces were mothballed in a deal that Hollande's government struck with steel giant ArcelorMittal.\n___\nLeicester reported from Paris.\n___\nThis story has been corrected to show that production at the Whirlpool plant is scheduled to halt next year, not this year.\nFrench centrist presidential election candidate Emmanuel Macron, center, talks to workers at the Whirlpool home appliance factory, Wednesday April 26, 2017 in Amiens, northern France. Far-right French presidential candidate Marine Le Pen has earlier upstaged Macron as she made a surprise campaign stop to the plant. (AP Photo/Thibault Camus)\nFar-right French presidential candidate Marine Le Pen, left, is greeted by workers outside a whirlpool home appliance factory in Amiens, France, Wednesday April 26, 2017. While her centrist presidential opponent Macron was meeting with union leaders from the Whirlpool plant in northern France, Le Pen popped up outside the factory itself, amid its workers and declared herself the candidate of France's workers.(AP Photo)\nFrench centrist presidential election candidate Emmanuel Macron, center, makes his way at the Whirlpool home appliance factory, Wednesday April 26, 2017 in Amiens, northern France. Far-right French presidential candidate Marine Le Pen has earlier upstaged Macron as she made a surprise campaign stop to the plant. (AP Photo/Thibault Camus)\nA worker light flares at the Whirlpool home appliance factory, Wednesday April 26, 2017 in Amiens, northern France. Far-right French presidential candidate Marine Le Pen has earlier upstaged centrist candidate Emmanuel Macron as she made a surprise campaign stop to the plant. (AP Photo/Thibault Camus)\nFrench centrist presidential election candidate Emmanuel Macron, center, addresses a group of workers at the Whirlpool home appliance factory, Wednesday April 26, 2017 in Amiens, northern France. Far-right French presidential candidate Marine Le Pen has earlier upstaged Macron as she made a surprise campaign stop to the plant. (AP Photo/Thibault Camus)\nFrench centrist presidential election candidate Emmanuel Macron enters the Whirlpool home appliance factory, Wednesday April 26, 2017 in Amiens, northern France. Far-right French presidential candidate Marine Le Pen has earlier upstaged Macron as she made a surprise campaign stop to the plant. (AP Photo/Thibault Camus)\nFar-right French presidential candidate Marine Le Pen is greeted by workers outside a whirlpool home appliance factory in Amiens, France, Wednesday April 26, 2017. While her centrist presidential opponent Macron was meeting with union leaders from the Whirlpool plant in northern France, Le Pen popped up outside the factory itself, amid its workers and declared herself the candidate of France's workers.(AP Photo)\nSupporters wait for the arrival of French independent centrist presidential candidate Emmanuel Macron prior to an election campaign rally in Arras, northern France, Wednesday, April 26, 2017. Battling for France's blue-collar vote and employing all of her political guile, far-right presidential candidate Marine Le Pen upstaged her centrist rival Macron by making a surprise campaign stop Wednesday to a home appliance factory threatened with closure. (AP Photo/Michel Spingler)\nMembers of National Front party take cellphone photos during a presentation of the new campaign poster and slogan of the far-right presidential candidate Marine Le Pen in Paris, France, Wednesday, April 26, 2017. Anti-European French presidential candidate Marine Le Pen upstaged her centrist opponent Emmanuel Macron by making a surprise campaign stop Wednesday to a home appliance factory that is the latest hot-button symbol of French job losses to plants overseas. (AP Photo/Michel Euler)\nThe new campaign poster and slogan of the far-right presidential candidate Marine Le Pen is pictured druing a presentation in Paris, France, Wednesday, April 26, 2017. Anti-European French presidential candidate Marine Le Pen upstaged her centrist opponent Emmanuel Macron by making a surprise campaign stop Wednesday to a home appliance factory that is the latest hot-button symbol of French job losses to plants overseas. Poster reads, \"choose France\". (AP Photo/Michel Euler)\nFrench centrist presidential election candidate Emmanuel Macron, center, addresses a group of workers at the Whirlpool home appliance factory, Wednesday April 26, 2017 in Amiens, northern France. Far-right French presidential candidate Marine Le Pen has earlier upstaged Macron as she made a surprise campaign stop to the plant. (AP Photo/Thibault Camus)\nA man walks past electoral posters of French centrist presidential candidate Emmanuel Macron, right, and far-right candidate Marine Le Pen in Saint Jean de Luz, southwestern France, Wednesday, April 26, 2017. (AP Photo/Bob Edme)\nA woman walks past electoral posters of French centrist presidential candidate Emmanuel Macron, right, and far-right candidate Marine Le Pen in Saint Jean de Luz, southwestern France, Wednesday, April 26, 2017. (AP Photo/Bob Edme)\nFrench centrist presidential election candidate Emmanuel Macron, arrives at the Whirlpool home appliance factory, Wednesday April 26, 2017 in Amiens, northern France. Far-right French presidential candidate Marine Le Pen has earlier upstaged Macron as she made a surprise campaign stop to the plant. (AP Photo/Thibault Camus)\nWorkers demonstrate with a banner reading \"Whirlpool makes jobless\" at the Whirlpool home appliance factory, Wednesday April 26, 2017 in Amiens, northern France. Far-right French presidential candidate Marine Le Pen has earlier upstaged centrist candidate Emmanuel Macron as she made a surprise campaign stop to the plant. (AP Photo/Thibault Camus)","url":"https://www.dailymail.co.uk/wires/ap/article-4446978/Macron-risky-hunt-blue-collar-votes-against-Le-Pen.html"}
