{"authors":["Euan Mclelland For Mailonline"],"date_download":"2018-10-23 01:25:54","date_modify":"2018-10-23 01:25:54","date_publish":"2016-01-29 15:24:37","description":"Sandrine Brown (pictured outside court), 31, began working at the school in Coventry in 2006. Her first encounter with a pupil occurred in May 2008. They continued until November 2011.","filename":"data/vaneerConsumption/LesbianCoventryPEteacherwhohadsexwithpupilisjailedforjust18months.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B417AC00000578-0-image-a-29_1454083693478.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422959_Lesbian-PE-teacher-groomed-one-teenage-girl-school-ski-trip-sex-school-store-room-jailed-just-18-months_1540257954.html","title":"Lesbian Coventry PE teacher who had sex with pupil is jailed for just 18 months","title_page":"Lesbian Coventry PE teacher who had sex with pupil is jailed for just 18 months | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sandrine Brown groomed two teenage schoolgirls and even had sex with one of them in a school store room. Yet she was today jailed for just 18 months\nA female PE teacher who groomed two teenage schoolgirls and even had sex with one of them in a school store room has been jailed for just 18 months.\nSandrine Brown, 31, got close to the first pupil when she was only 13-years-old in May 2008.\nThe teacher, who was head of girls PE, then started talking to the teen online before swapping numbers.\nA court heard they started a sexual relationship when the schoolgirl was just 14 after becoming close during the summer holidays.\nThe youngster regularly slept over at Brown's flat in Stoke, Coventry, and engaged in sexual activity with her in her car.\nThey even had a sexual liaison in a school store room.\nBrown then made contact with the girl's friend, starting a relationship with her in January 2010. The girl was only 16.\nThe jury were told how she then spent time with both girls, who can't be named for legal reasons, in a hotel room in February 2010.\nBrown admitted one charge of inciting a child to engage in sexual activity while in a position of trust as a teacher.\nShe also pleaded guilty to five counts of sexual activity with a child, again while in a position of trust.\nShe showed no emotion as she was jailed for only 18 months at Warwick Crown Court today.\nJudge Richard Griffith-Jones, the Recorder of Coventry, said: 'This case is a tragedy.\n'Most particularly it is a tragedy for the two now young women who were young girls at the time that they were sexually abused by you.\n'But it's also a tragedy for you because you were blessed with intelligence and athleticism and sensitivity.\n'Young people whose emotions are developing, whose bodies are developing, whose characters are not yet formed, who are there to be set examples by people like you to aspire to and mould their characters.\n'It's very often the case that young teenagers look up to people who teach them and regard them as role models and inspirations.\n'There couldn't be a greater betrayal of that responsibility to have these developing young people in your care and then to be so weak and self-indulgent as to take advantage of them sexually as you did.\n'I have to send you to prison because of that gross breach of trust and the effect it has upon the people who are the victims.\n'They will carry it with them, as you will, that's the terrible damage.'\nHe added: 'The other aspect which compels me to take the course I'm going to have to is that this involves a matter of public confidence.\n'Think if the thousands of parents who send their children to school thinking they are being looked after and this happens.'\nBrown started a relationship with the second female pupil in January 2010 when she was aged 16\nAlong with her jail term, Brown was also made the subject of a Sexual Harm Prevention Order for ten years and ordered to sign the Sex Offenders' Register.\nJudge Griffith-Jones accepted her plea that she was not in a relationship with both girls at the same time and there had never been an occasion where she had been found in bed with both girls at the same time.\nBrown was a PE teacher at the school Coventry, which cannot be named for legal reasons, from 2006 - first committing her offences in May 2008. They continued until November 2011.\nProsecutor Graeme Simpson told the court she was 11 years older than the first victim and ten years older than the second girl at the time.\nHe said: 'The first victim says she first started to talk to the defendant when she was 13.\n'It seems the defendant befriended her on that trip. She developed feelings for the defendant during the trip.\n'That friendship continued and developed starting with chats on MSN with the defendant asking if she would like to meet up outside school.\n'They exchanged mobile numbers and arranged to meet. They spent the evening at her flat together and they kissed.\n'The defendant asked if she wanted to be her girlfriend and she agreed.\n'During the school summer holidays she turned 14 and spent more time during the day at the defendant's flat and it was at that time sexual activity occurred beyond kissing.\n'She began to spend the night at the flat telling her parents she was going to stay at a friend's.\n'There were times they would meet to walk dogs and would engage in sexual activity in the defendant's car.\n'That included kissing, oral sex and digital penetration.\n'There were occasions when sexual activity would take place in the PE department store room.'\nThe court heard Brown then met the second teenager, who was a friend of the first victim, when both girls came to her flat together.\nMr Simpson added: 'She started visiting the defendant's flat with her friend but after she turned 16 in November 2009 she started visiting alone.\n'Both victims began spending time with the defendant in her hotel room [in February 2010].\n'In the second victim's case, the sexual activity involved kissing, oral sex and digital penetration.\nBrown admitted one charge of inciting a child to engage in sexual activity while in a position of trust as a teacher. She also pleaded guilty to five counts of sexual activity with a child, again while in a position of trust. She showed no emotion as she was jailed for only 18 months at Warwick Crown Court (pictured) today\n'It happened more than once per week and continued until November 2011, so over a period of two years when she was 16 and 17.'\nIn a victim impact statement read to the court, the second victim said she felt she was 'groomed into thinking she was gay' when she had 'never looked at the same sex in that way before'.\nIn her statement, the first victim said she felt she was 'taken advantage of both sexually and in a grooming sense'.\nBrown was arrested in April 2014 and initially gave no comment to police officers in interview.\nBut the court heard she made 'full admissions expressing remorse and saying she was disgusted with herself' at a school disciplinary meeting on October 15 that year.\nBrown, who was undergoing counselling at the time of the offences, was supported in court by her parents, brother, cousin and new female partner.\nLee Marklew, defending, said Brown - who had a history of depression and self-harming - wished her victims could have 'closure and some peace'.\nHe added: 'She is like many if not all in her position who have fallen from professional grace someone who is having difficulty coping.\nIn a letter sent to parents of pupils, the school's executive headteacher Mark Bailie said: 'The allegations relate to former pupils who have left the school.\n'We can confirm that no present pupils were involved. We can also confirm that Miss Brown no longer works at the school.\n'W take our safeguarding responsibilities extremely seriously and worked closely with the police and the local authority throughout their investigations.","url":"https://www.dailymail.co.uk/news/article-3422959/Lesbian-PE-teacher-groomed-one-teenage-girl-school-ski-trip-sex-school-store-room-jailed-just-18-months.html"}
