{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 02:56:53","date_modify":"2018-10-23 02:56:53","date_publish":"2016-01-29 17:42:33","description":"Appearing at Lewes Crown Court, Lesley Dunford, 37, admitting murdering her seven-month-old son Harley 13 years ago at her Sussex home, months before killing her daughter Lucy.","filename":"data/vaneerConsumption/LesleyDunfordjailedforkillingherdaughteralsomurderedherbabyson.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B496AF00000578-0-image-a-9_1454089128840.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423196_Mother-jailed-killing-three-year-old-daughter-admits-murdered-baby-son-13-years-ago_1540263413.html","title":"Lesley Dunford jailed for killing her daughter also murdered her baby son","title_page":"Lesley Dunford jailed for killing her daughter also murdered her baby son | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lesley Dunford, 37, pictured, pleaded guilty at Lewes Crown Court to murdering her seven-month-old son Harley at her former Sussex home in 2003\nA mother jailed for killing her three-year-old daughter has pleaded guilty to the earlier murder of her baby son 13 years ago.\nLesley Dunford, 37, was charged in October last year with the murder of seven-month-old Harley Dunford on August 27, 2003.\nHe was found dead in his cot at the family's former seaside home in Camber, near Hastings, East Sussex, and Dunford's three-year-old daughter Lucy died six months later, on February 2, 2004.\nPolice did not have enough forensic evidence to charge Dunford at the time, but a 2009 inquest into Lucy's death prompted police to reinvestigate the case and charge her.\nThat investigation led to Surrey and Sussex Police conducting a 16-month probe into Harley's death, leading to this charge.\nIn June 2012, Dunford was jailed for seven years for Lucy's manslaughter after Lewes Crown Court heard the child died from asphyxia caused by forced blockage of her airways.\nToday Dunford, formerly of Exeter, Devon, appeared at the same court, in front of Mr Justice Singh, to plead guilty to Harley's murder.\nAlan Kent QC, defending, said he met Dunford at Wandsworth Prison in London on Wednesday, where he concluded she had a defence to the murder charge.\nBut after arriving at court on Friday, Dunford told him she intended to plead guilty - because she did not want to travel to court every day of a trial.\nMr Kent said: 'That to me is not a good reason for a defendant to plead guilty and therefore we are submitting that it is an equivocal one.'\nMr Kent then asked for a brief adjournment to speak to Dunford, who sat rocking in her chair in the dock dressed in a T-shirt and wearing glasses.\nFollowing the half-hour adjournment to discuss her case with her counsel, Dunford refused to come up to the courtroom from her cell, Mr Kent said.\nDunford, pictured right outside the court, was previously convicted of the manslaughter of her three-year-old daughter Lucy, who died in 2004. Police did not have enough evidence to charge her at the time.\nMr Justice Singh asked Mr Kent whether Dunford was aware of the consequences, to which he replied: 'She does. I have spoken to her in clear and forthright terms about what will happen.'\nThe judge said: 'In those circumstances, the only thing I can do is accept the plea and adjourn the case for sentencing.'\nMr Kent said he was confident no psychiatrist would consider her unfit to plea, adding: 'It may be that the emotional turmoil is aggravating her but that, in my judgment, doesn't make her unfit to plead.'\nProsecutor Philippa McAtasney QC did not open the details of the case, which was adjourned until March 18 for pre-sentence and psychiatric reports to be prepared.\nShe said: 'So far as the Crown is concerned, we take the view that the defendant, having been properly advised, fully understands the court process.'\nFollowing the 2012 conviction, police reopened the case into Harley's death and after a 16-month investigation charged Dunford with his murder. She pleaded guilty at Lewes Crown Court, pictured, today\nDunford was arrested in February 2004 and interviewed by police then and again in May.\nHer case was passed to the Crown Prosecution Service who decided there was not enough evidence to charge Dunford with the murder of Lucy.\nBut during her inquest in 2009 East Sussex coroner Alan Craze demanded the case was revisited.\nThe inquest threw up new information which had been given by medical experts in 2005 during a Family Court hearing into Lucy's death.\nThis information had not been passed on to the CPS. Dunford was then rearrested and charged in July 2011.\nProsecutor Sally Howes QC said during the trial that the inquest had 'excluded the likelihood' of a serious infection and found that injuries to the airways were consistent with an 'application of force'.","url":"https://www.dailymail.co.uk/news/article-3423196/Mother-jailed-killing-three-year-old-daughter-admits-murdered-baby-son-13-years-ago.html"}
