{"authors":["Regina F. Graham For Dailymail.Com"],"date_download":"2018-10-23 04:43:35","date_modify":"2018-10-23 04:43:35","date_publish":"2017-04-26 16:19:29","description":"NBC news anchor Lester Holt is selling his luxury 2,168-square-foot midtown Manhattan apartment for a cool $6.6million.","filename":"data/vaneerConsumption/LesterHoltlistsManhattanapartmentfor66million.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA038B900000578-0-image-a-36_1493217212445.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448168_Lester-Holt-lists-Manhattan-apartment-6-6million_1540269815.html","title":"Lester Holt lists Manhattan apartment for $6.6million","title_page":"Lester Holt lists Manhattan apartment for $6.6million | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NBC news anchor Lester Holt is selling his luxury 2,168-square-foot midtown Manhattan apartment for a cool $6.6million.\nThe veteran journalist and his wife, Carol Hagen-Holt, purchased the pad located on Fifth Avenue in the 'Flatiron NoMad' district a decade ago for just $3.3million.\nShe works as a real estate agent who is sharing the listing of the spacious apartment with broker Joann Wasserman for Town Residential.\nThe apartment owned by the couple, who have been married for roughly 35 years, has 11-foot-tall ceilings, a 48-foot-long terrace, and offers views of Madison Square Park.\nGrand: NBC news anchor Lester Holt is selling his luxury 2,168-square-foot midtown Manhattan apartment for a cool $6.6million\nSplendor: The veteran journalist and his wife, Carol Hagen-Holt, purchased the pad located on Fifth Avenue in the 'Flatiron NoMad' district a decade ago for just $3.3million\nBright: The apartment owned by the couple, who have been married for roughly 35 years, has 11-foot-tall ceilings, a 48-foot-long terrace, and offers views of Madison Square Park through the large windows\nElegant: The open kitchen features bluestone countertops, Poggenpohl Marsh Oak wood cabinets, an island and Viking and Miele appliances. It also has a built-in espresso marker.\nThe Holts (pictured above in April) purchased their pad the same year Lester became the weekend anchor on NBC Nightly News in 2007. In June 2015 he took over the anchor chair on the show permanently\nIt comes complete with three bedrooms and 2.5 bathrooms, as it also features an open kitchen with bluestone countertops, Poggenpohl Marsh Oak wood cabinets, an island and Viking and Miele appliances. The kitchen also has a built-in espresso marker.\nIn addition, the bedrooms each have beautiful french doors that open to the spacious terrace that overlooks the building's garden in the courtyard.\nThe master bedroom inside the residence has custom closets, as the en suite bathroom contains Calacatta marble walls and flooring, soaking tub, separate shower and a double vanity.\nPlus, the apartment features automated custom window treatments and lights that can be controlled via a smartphone app.\nThe apartment is located inside of a 13-story building that was built in 1906 and was originally known as the Brunswick Building.\nSpacious: The apartment comes complete with three bedrooms that each have beautiful french doors that open to the spacious terrace that overlooks the building's garden in the courtyard\nDecadent: The master bedroom inside the residence has custom closets, as the en suite bathroom contains Calacatta marble walls and flooring, soaking tub, separate shower and a double vanity\nRelaxed: The Fifth Avenue apartment is sure to provide a relaxing setting, as the building is pet friendly to residents\nLuxurious: The 48-foot-long terrace provides plenty of space for residents to invite guests over for a fun evening\nThe entire building was renovated and reopened in 2005 as the 187-unit Grand Madison Condominiums.\nIt features a live-in super, gym, dry cleaners, concierge and has a doorman.\nFormer first daughter Chelsea Clinton owned a 10th floor apartment in the building with her husband Marc Mezvinsky until they sold it in 2016 for roughly $6million after buying for $4.75million in 2013.\nThe Holts purchased their pad the same year he became the weekend anchor on NBC Nightly News in 2007.\nIn June 2015 he took over the anchor chair Monday through Friday on the show permanently after Brian Williams admitted that he had exaggerated a story about the Iraq War.\nThe apartment is located inside of a 13-story building that was built in 1906 and was originally known as the Brunswick Building (file above)","url":"https://www.dailymail.co.uk/news/article-4448168/Lester-Holt-lists-Manhattan-apartment-6-6million.html"}
