{"authors":[],"date_download":"2018-10-30 01:02:56","date_modify":"2018-10-30 01:02:56","date_publish":"2015-05-23 00:00:00","description":null,"filename":"data/vaneerConsumption/LetBoysbeBoys.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_05_let_boys_be_boys__1540861376.html","title":"Let Boys be Boys","title_page":"Let Boys be Boys","title_rss":"NULL","source_domain":"americanthinker.com","text":"Let Boys be Boys\nThere are certain biological imperatives that make boys be boys. Boys are naturally drawn to the healthy, distinctively male \"white hat\" cowboy-lawman archetype that has made the Western genre highly popular in America for decades: from puppet \"Howdy Doody \" (1947-1960) to \"Roy Rogers\" in the 1950s, \"Bonanza\" (1959-1973) and \"Gunsmoke\"'s 20 seasons -- the longest-running Western in TV history -- concluding in 1975. Similarly, on the silver screen, acting legends like John Wayne, Gary Cooper, Jimmy Stewart, and Clint Eastwood have fleshed out self-assured moral compasses: the impulse to uncompromising independence and the uniquely American entrepreneurial spirit. This example, often with a more modern science fiction twist represented by both the Star Wars and \"Star Trek\" sagas, has been enjoyed and emulated by generations of American boys at play with Cowboy and Indian games. An evolving variety of toy guns from cap-guns to pop guns, BB guns, Star Trek phasers, Nerf Blasters, and the more recent laser tag weapons have found their way into boys' hands. Absent any toys at all, boys will use sticks and their imaginations. However, one boy, 7-year-old Josh Welsh, ran afoul of school bureaucrats when he supposedly chewed his strawberry breakfast pastry into a \"gun\" and allegedly wielded it saying, \"Bang, bang,\" to a fellow student. Such was the threat in a school -- a gun-free zone -- that the second-grader was suspended from Baltimore's Park Elementary School for two days. Obviously, school officials confused a Pop Tart with a pop gun.\nThe boy's father rightfully objected to this clearly Orwellian treatment of his son, “I would almost call it insanity. I mean with all the potential issues that could be dealt with at school, real threats, bullies, whatever the real issue is, it’s a pastry.” The real issue here is the systematic emasculation of boys by statists: political progressives that run the public school systems. Last time I checked, the purpose of educators is to enlighten, not to engage in radical beyond-the-scope hard-left social engineering. This situation exactly depicts the irrational intention to punish normal, masculine \"tough guy\" behavior in favor of that of the wussy, subservient pajama-boy. This politically-correct societal cancer is spreading. Just yesterday, the Boy Scouts of America have a new rule which bans water gun fights. Per their National Shooting Manual, “For water balloons, use small, biodegradable balloons, and fill them no larger than a ping pong ball. […] Water guns and rubber band guns must only be used to shoot at targets, and eye protection must be worn.” Biodegradable water balloons no larger than ping pong balls? Seriously? Whatever pea-brained committee that came up with these rules is taking the nanny-state paradigm into the outer reaches of the twilight zone. It would be funny if it was not so tragic. Another tragedy is the fact that other adolescents of scouting age are being trained as militants halfway around the world to target Americans with real guns, bullets, bombs and suicide vests. The world is a tough place. Because this is the unfortunate reality -- boys need to develop the kind toughness of their stand tall Western heroes -- something the hand-wringing, repressive Left knows nothing about.","url":"https://www.americanthinker.com/blog/2015/05/let_boys_be_boys_.html"}
