{"authors":[],"date_download":"2018-10-22 21:45:29","date_modify":"2018-10-22 21:45:29","date_publish":"2014-06-04 16:10:50","description":"Three condemned men have been given execution dates for later this month.","filename":"data/vaneerConsumption/LethalInjectionThreeMenAwaitTheirFateonDeathRowThisMonth.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/488356/140604-california-gurney-tnc-1909_a39ca5e08fb7d3ed12e9926cf633c0ff.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_lethal-injection_lethal-injection-three-men-await-their-fate-death-row-month-n122461_1540244729.html","title":"Lethal Injection: Three Men Await Their Fate on Death Row This Month","title_page":"Lethal Injection: Three Men Await Their Fate on Death Row This Month","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn the wake of controversial lethal injections, executions are temporarily on hold in two states: Oklahoma and Ohio.\nNationwide, no one has been put to death since Clayton Lockett, whose April 29 execution was so badly botched the White House ordered a review of state protocols.\nBut three condemned men have been given execution dates for later this month. Here's a look at their crimes and their efforts to extend their leases on life:\nMarcus Wellons, Georgia\nWellon, 59, has been on Georgia's death row since 1993 for raping and strangling a 15-year-old girl who was abducted on her way to school.\nHis execution is set for June 17 — a date chosen shortly after Georgia's top court rejected a challenge by Wellons and other inmates to a state law that shrouds execution-drug suppliers in secrecy.\nIt's expected that his defense team will be filing more appeals.\nWellons' case has already been before the U.S. Supreme Court, which ruled in 2010 that a lower court had to review his conviction and death sentence amid revelations that jurors gave chocolates shaped like a penis and breasts to the judge and bailiff.\nA federal appeals court deemed the gifts \"tasteless\" but said they had no bearing on the outcome of the trial.","url":"https://www.nbcnews.com/storyline/lethal-injection/lethal-injection-three-men-await-their-fate-death-row-month-n122461"}
