{"authors":["Kate Pickles For Mailonline"],"date_download":"2018-10-22 22:49:25","date_modify":"2018-10-22 22:49:25","date_publish":"2016-01-29 10:13:08","description":"Medical students at Keele University went into 62 outlets to buy the medication as secret shoppers. They found 30 per cent were prepared to sell an illegal amount of over-the-counter drugs.","filename":"data/vaneerConsumption/LethalamountsofpainkillersarebeingsoldbymorethanHALFofUKshops.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/09/30B0D7F000000578-0-image-a-13_1454059254082.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3421157_More-HALF-shops-selling-dangerous-amounts-painkillers-Investigation-finds-one-customer-sold-240-aspirin-one-EIGHT-times-recommended-limit_1540248565.html","title":"Lethal amounts of painkillers are being sold by more than HALF of UK shops","title_page":"Lethal amounts of painkillers are being sold by more than HALF of UK shops | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Shoppers are being allowed to buy potentially lethal amounts of over-the-counter painkillers in one transaction, an alarming investigation has revealed.\nMore than half of shops sold more than the recommended amount, with one customer allowed to buy 240 aspirins in one go - nearly eight times above the national regulations of 32 tablets.\nGuidelines from the UK's medicines' regulator, the Medicines and Healthcare products Regulatory Agency, state ‘no retailer should sell more than two packets of paracetamol (500mg) in one transaction'.\nThis is considered a reasonable balance between meeting someone's need for immediate pain relief while helping to prevent stockpiling and either an accidental or impulsive overdose, they state.\nBut the investigation found the regulations were frequently flouted - with potentially devastating consequences.\nAn investigation found that 58 per cent of shops handed out more than the maximum recommended amount for Paracetamol and 57 per cent did the same for aspirin\nThe research was conducted by medical students at Keele University, who acted as secret shoppers at 62 outlets in Staffordshire and Shropshire.\nThey found 58 per cent of shops handed out more than the maximum recommended amount for paracetamol, and 57 per cent breached the limit for aspirin.\nTHE TRAGEDY OF ACCIDENTAL PAINKILLER OVERDOSES Earlier this month, a coroner warned of the dangers of accidentally overdosing after a mother-of-three taking tablets for osteoporosis died when she also took Lemsip for flu. Michelle Walker, 52, of Bolton, Greater Manchester, died of multiple organ failure. She had been self-medicating with tablets to deal with pain caused by her bone condition. But in the days before her death, she had a;so started using Lemsip - which also contains paracetamol, an inquest was told. Assistant Coroner Rachel Griffin said the tragedy served to remind the public of the importance of sticking to recommended doses of pain killers. 'Sadly and tragically, Michelle's death highlights the importance of taking medication at the dose prescribed or stipulated,' he said. 'There is no suggestion that she has taken an overdose. I believe she has been taking tablets to try and ease her pain.'\nOf these, 30 per cent were prepared to sell an illegal amount of more than 100 tablets.\nNearly all shops sold paracetamol alongside flu remedies which contained paracetamol without explaining the potential dangers of combing products to customers.\nParacetamol misuse is the number one cause of overdose in the UK, according to the report published in BMJ Open.\nUp to 90, 000 people in the UK take paracetamol overdoses every year with about 200 resulting in death.\nDeliberate overdoses are often impulsive where individuals take drugs that are already stored at home, the study reports.\nAnd many accidental overdoses result from a person with poor pain management, taking more than the recommended limit.\nAnother risk is inadvertently exceeding the recommended dose by taking two or more different paracetamol-containing products.\n'Paracetamol is present in a range of over-the-counter medicines for coughs and colds. But two out of five people who take such remedies don't realise this,' warns Professor Donald Singer, a fellow of the British Pharmacological Society.\nAnd acute liver failure caused by paracetamol overdosing is twice as common in the UK as in other European countries, previous studies have found.\nThe Keele researchers hope their investigation will help toughen the law on overselling painkillers.\nThey have recommended a new law where it is illegal to sell more than 32 paracetamol, unless it is bought at a registered pharmacy.\nTable shows the number of paracetamol sold at the different shops (blue). The green line depicts the guideline threshold and the red line shows the legal threshold, with one shop selling more than 100 tablets and most selling above the recommended level\nThe number of aspirin sold at the different shops (blue). The green line depicts the guideline threshold and the red line shows the legal threshold, with four shops selling above the legal limit including one which sold a customer 240 tablets in one transaction and most selling more than guidelines recommend\nThe chart shows the comments and responses of staff who sold the medication to the mystery shoppers\nFurthermore, they suggest non-pharmacy counters are banned from selling paracetamol and paracetamol-containing medications -such as cold and flu remedies - in conjunction with one another.\nRemoving promotional offers was also recommended.\nStudy co-author Phill Molloy, a fourth year student, told the Stoke Sentinal: 'I started all this when I saw a sign offering aspirin packs at three for two in one shop.\n'I know advertising such drugs is illegal, so I set out collecting proper evidence helped by other students.\n'Though I suspected the rules were being flouted, I was still deeply shocked by what we found. It was outrageous.\n'I have since presented the paper to a national conference of GPs, and many mouths fell open.\n'These sales must be better regulated to reduce deaths from either deliberate or accidental overdoses.'\nWHY PARACETAMOL CAN SO DANGEROUS Excess paracetamol can overwhelm the liver's processing abilities, resulting in acute liver failure that can prove fatal. Concern over this led the Government in 1998 to rule that shops can sell only packs of 16 paracetamol tablets. Pharmacies can sell packs of 32 tablets. But the danger remains, not least because of 'staggered overdosing' - this is where taking just a little more paracetamol than the recommended dose over the course of several days or weeks leads to a dangerous build-up in the liver. Taking too many paracetamol can cause severe liver and kidney damage. Studies found staggered overdosing is as risky as one large overdose The concern is that people can unwittingly overdose by also taking other over-the-counter products without realising these contain paracetamol. Staggered overdosing is just as risky as taking one large overdose, according to a study from the Royal Infirmary of Edinburgh, published in 2012 in the British Journal of Clinical Pharmacology. Professor Donald Singer, a fellow of the British Pharmacological Society, warns: 'Paracetamol is present in a range of over-the-counter medicines for coughs and colds. But two out of five people who take such remedies don't realise this. 'It is a useful drug when used in the right way, but it is a powerful drug with powerful side-effects when taken excessively. Doses of paracetamol are usually taken every four to six hours. It is important to allow the recommended time between doses, and not exceed the maximum dose for a 24-hour period People should never take a double dose to make up for the missed dose and should continue to leave four to six hours between doses. If someone accidentally takes an extra dose of paracetamol, they should miss out the next dose so they don't exceed the maximum over a 24-hour period. Overdosing can lead to severe kidney or liver damage, feeling sick and vomiting that lasts up to 24 hours. Anyone who has overdosed should visit accident and emergency.","url":"https://www.dailymail.co.uk/health/article-3421157/More-HALF-shops-selling-dangerous-amounts-painkillers-Investigation-finds-one-customer-sold-240-aspirin-one-EIGHT-times-recommended-limit.html"}
