{"authors":["Lauren Holter"],"date_download":"2018-10-31 01:46:30","date_modify":"2018-10-31 01:46:30","date_publish":"2018-09-14 12:13:45","description":"In the competitive race for New York attorney general, Letitia James is likely to become the first black woman to hold statewide office in New York, The Hill reports. After former New York Attorney General Eric Schneiderman resigned in May amid…","filename":"data/vaneerConsumption/LetitiaJamesWonTheAttorneyGeneralPrimaryForNewYorkIsSetToBreakThisRecord.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/ff3f113a-f203-4f0f-a49d-c38dbc5f95c0-getty-680929114.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_letitia-james-won-the-attorney-general-primary-for-new-york-is-set-to-break-this-record-11917050_1540950390.html","title":"Letitia James Won The Attorney General Primary For New York & Is Set To Break This Record","title_page":"Letitia James Won The Attorney General Primary For New York & Is Set To Break This Record","title_rss":"NULL","source_domain":"bustle.com","text":"In the competitive race for New York attorney general, Letitia James is likely to become the first black woman to hold statewide office in New York, The Hill reports. After former New York Attorney General Eric Schneiderman resigned in May amid abuse allegations, State Solicitor General Barbara Underwood was chosen to take over the role — and Thursday's primary set the stage for another woman to assume Schneiderman's former position.\nFives years ago, James became the first black woman elected to citywide office in New York when she was elected New York City public advocate, The New York Times notes. In that role, James sued the city over tenants' rights, the treatment of children in foster care, and a lack of air conditioning on buses for mentally disabled children. Her bid for attorney general was endorsed by Gov. Andrew Cuomo, who also beat a progressive challenger to win his Democratic primary.\n“This campaign was never really about me or any of the candidates who ran,” James said in her victory speech Thursday night, per The Times. “It was about the people, but mostly it was about that man in the White House who can’t go a day without threatening our fundamental rights.”\nMore locally, James' campaign released her plan for criminal justice reform in New York last month. It outlined how she wants to push for state funding to expand body cameras for cops, champion legislation aimed at holding prosecutors accountable for any misconduct, and change the law that currently allows prosecutors to withhold evidence until a trial begins.\n\"We can do better than this. We need to reform our criminal justice system,\" James said in a video for NowThis. \"We need to end cash bail. We need more alternatives to incarceration. We don't need trial by ambush, which means we have to reform our discovery laws in the state of New York. We should not criminalize mental illness or poverty. And we also need to reform our grand jury system which is cloaked in secrecy.\"\nAfter Thursday's victory, James is expected to beat her Republican opponent, Keith Wofford, on the November ballot, as The Hill notes. So come 2019, she'll probably become the first black woman to serve as attorney general in New York.\nSchneiderman's departure rocked the New York political world in May, largely because he championed women's rights while in office and sued Harvey Weinstein for restitution for the women who alleged the Hollywood exec assaulted them (which Weinstein denied). A New Yorker article published in May included four women who accused Schneiderman of physical abuse. Hours later, the attorney general issued a statement denying the allegations and stepping down from his position. Like Weinstein, Schneiderman found himself out of a job in the #MeToo era.\nBecause of the circumstances surrounding Schneiderman's exit, James' historic primary win holds even more significance for the surge of women candidates challenging the status quo this year.\n\"Tonight, we rewrite the history of generations of New Yorkers who have been treated differently simply because of their gender, the color of their skin, the language they speak, the God they pray to, the people they love, or the zip code they come from,\" she tweeted after the primary election was called.","url":"https://www.bustle.com/p/letitia-james-won-the-attorney-general-primary-for-new-york-is-set-to-break-this-record-11917050"}
