{"authors":["Fort Worth Star-Telegram"],"date_download":"2018-10-30 18:33:52","date_modify":"2018-10-30 18:33:52","date_publish":"2017-03-12 01:52:00","description":"President Trump is right.","filename":"data/vaneerConsumption/Letsgetthisgoing.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_mar_12__1540924432.html","title":"Let’s get this going","title_page":"Let’s get this going","title_rss":"NULL","source_domain":"arkansasonline.com","text":"President Trump is right.\nCongress must investigate, fully and aggressively, whether President Barack Obama or his administration implemented or condoned wiretaps at Trump Tower at any time during last year’s election campaign and thus injected itself into the political process.\nTrump has said emphatically, via Twitter, that the wiretaps happened. He has offered no proof, but that doesn’t reduce the gravity of his allegation.\nHe is the president of the United States and commander-in-chief of our military forces.\nIf our government eavesdropped on Trump during the run-up to the election, for whatever reason, we want to know. We deserve to know.\nThere are people who believe Obama has operated behind the scenes to undermine Trump. We need to know if they are right.\nFor reasons no less serious than the future of our nation, we need to know whether Trump had good reason to say what he said.\nThere are significant threats against us and our interests and allies on the world stage—the Islamic State and other terrorist groups, and countries like North Korea, China, Russia—that at any moment could require our commander-in-chief to act decisively, even with military force.\nIf that moment comes, we must know that we can trust Trump to give us reasoned and accurate information.\nWe can’t leave his accusations about Obama hanging without resolution. Congress must tell us the truth.","url":"https://www.arkansasonline.com/news/2017/mar/12/lets-get-going/"}
