{"authors":["Mytheos Holt"],"date_download":"2018-10-30 21:12:54","date_modify":"2018-10-30 21:12:54","date_publish":"2015-11-02 18:14:34","description":"Her inability to talk about games without making embarrassing factual errors is well-documented.","filename":"data/vaneerConsumption/LetsStopPretendingAnitaSarkeesianIsanArtCritic.json","image_url":"https://media.breitbart.com/media/2015/07/sarkeesian-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2015_11_02__1540933974.html","title":"Let’s Stop Pretending Anita Sarkeesian Is an Art Critic","title_page":"Let’s Stop Pretending Anita Sarkeesian Is an Art Critic","title_rss":"NULL","source_domain":"breitbart.com","text":"When Anita Sarkeesian’s “Tropes vs Women in Video Games” series of feminist criticism videos came out, many gamers reacted with anger at their hobby being slandered.\nThey were right to be upset. But what first upset me when I saw her series was something entirely different — namely, that the videos are so otiose, lazy, historically ignorant and chronically unsubtle as to call into question whether they can really be called art criticism at all.\nIt’s not impossible to imagine an inventive, thought-provoking left-wing feminist critique of gaming, but this isn’t it. And because someone with Sarkeesian’s modest intellectual gifts has set herself up as its self-appointed face in gaming, now anyone who wants to talk seriously about the artistry of games is set the unenviable, though clearly not insuperable, task of proving they’re not as stupid as she is.\nThe problem with Sarkeesian trying to sell herself as an art critic is that if you want to hold such a position, you should ideally know something not only about the art form you’re critiquing, but about art generally, especially if you’re talking about video games. After all, modern games often employ cinematic and/or theatrical storytelling, music recorded with a full orchestra, and diverse visual styles that sometimes draw explicitly from the styles of famous artists.\nYou cannot speak intelligently about this combination of media without knowing something about the various art forms from which it draws. At a bare minimum, Sarkeesian should educate herself on how the narrative elements she is critiquing have been employed in other art forms.\nThere is no evidence she has done so. Her inability to talk about games without making embarrassing factual errors is well-documented, as is her claim to have not been a fan of the art form as recently as 2010. For instance, her praise of the main character in Bayonetta for being a single mother stands out. Bayonetta is not a single mother, and Sarkeesian appears to have invented this attribute out of whole cloth.\nPerhaps the best example of her wider artistic ignorance, however, is Sarkeesian’s time-worn argument that games treat female pain as instrumental or secondary to the feelings and desires of male protagonists, either by setting them up as victims or incentives for victory.\nI suppose she has a point here. Who can forget the infamous game that opens with its protagonist seducing a woman, then killing her father when he tries to intervene? Or the game where your goal is to sneak into a defenseless woman’s boudoir and ravish her? Or the game where your goal is to abuse a woman until she stops asserting herself?\nOr the one where you get rewarded with a formerly inaccessible woman’s hand in marriage if you get enough money? Or the one where a woman is kidnapped by a villain, only for the plot twist to be that he was doing it for her own good because her mother is a monster, and the true final boss?\nOr the one where, despite playing as a woman, you only get points for being “cheerful to your husband all the time?” Or that truly awful, excessive, infamous game where your goal is to seduce your best friend’s girlfriend before he seduces yours, in order to win money?\nI imagine many gamers are scratching their heads at this point and wondering what the hell I’m talking about.\nWell, that’s the thing. None of the plots I’ve just cited actually come from games. Rather, the first refers to the opening scene of Mozart’s opera Don Giovanni, the second to Shakespeare’s poem The Rape of Lucrece, the third to Shakespeare’s play The Taming of the Shrew, the fourth to the central plot of F. Scott Fitzgerald’s The Great Gatsby, the fifth to Mozart’s opera The Magic Flute, and the sixth to Christine de Pizan’s early feminist work, The Book of the City of Ladies, which actually instructs its female reader to be “cheerful to her husband at all times.”\nOh, and the last? That’s Mozart again, in his classic opera Cosi Fan Tutte, whose title literally translates to “Thus Do They All,” or in more colloquial terms, “#YesAllWomen.”\nNot only do the existence of these titles prove that games aren’t alone in using women as fruit for male character development, but every single one of these works is considered a classic in its genre, which can still speak to our shared humanity despite being written in a different time and bearing narrative elements that some critics might now consider problematic.\nNone of this stops feminists from mounting critiques of them, but the most subtle of these writers realize that if you’re going to accuse some of the most transcendentally beautiful works of art of being retrograde, then you’d better come up with a way to explain why you’re not trying to write Shakespeare and Mozart out of the Western canon.\nThis isn’t simply a matter of respect, but of self-preservation. Art critics aspire to be guides for artists, and if artists see you claiming that even Mozart and Shakespeare fall afoul of your standards, they might quite reasonably assume that your standards can’t be met… and start to ignore you.\nIf you’ve ever wondered why AAA developers try to politely ignore the likes of Sarkeesian, you have your answer here.\nIt makes you wonder what gave anyone the idea that Sarkeesian was a competent media critic in the first place. A lot of people have probably forgotten this, but Sarkeesian’s original Tropes vs Women series centered around film tropes, and was a co-production with the commendably honestly-named Bitch magazine.\nBut we shouldn’t forget, because if you need to see how shallow Sarkeesian’s artistic understanding is whilst knowing nothing about video games, the original Tropes vs Women gives you a pretty good idea. Thus:\nThe Manic Pixie Dream Girl is really a muse who exists to be the inspiration for the troubled, tortured man. In fact we should talk about this whole idea of a muse which is the foundation for this trope. For centuries male filmmakers, writers, painters, artists of all kinds have often cited women as the inspiration for their brilliant masterpieces. I swear if I hear one more story like this I’m going to scream. Or puke. Or both.\nCharming. Now, I don’t want to make Anita grab a paper bag, but doesn’t it seem like she forgot something? Like maybe the origin of the word “Muse,” which actually comes from the Ancient Greek myth that all art was actually the domain of nine Goddesses, from whom every artistic work was a boon? You know, the myth that gives all the credit for all art everywhere to women? That myth?\nI mean, she brought up “this whole idea of a muse which is the foundation for this trope,” so you’d think she’d acknowledge that the actual idea of a muse in its original form is pretty damned feminist, and then maybe explain why she thinks it degenerated? Say, somewhere around Shakespeare’s Richard III, which cruelly subverts the muse trope by having the main character treat Lady Anne as an accessory to his own murderous behavior because he murdered out of love for her?\nThe problem isn’t that Sarkeesian considers but rejects these interpretations. It’s that, judging by her videos, Sarkeesian has no idea the Greek myth, or its subsequent subversion by Shakespeare, even exists.\nPerhaps recognizing that her initial effort lacked the historical awareness necessary to pass a Film 101 seminar, Sarkeesian moved on to criticizing comic books and video games in her second entry in the series, Women in Refrigerators. Here, Sarkeesian’s complaint was that female characters (particularly in comics) are deprived of heroic deaths and often killed off just to give the heroes something to react to, or for the sake of “torture porn.”\nYes, terrible. Who can forget the comic where Batgirl has her hands cut off and her tongue removed after being brutally raped, or where all of Spiderman’s girlfriends are forced to undergo four months of excruciating torture, including sodomizing themselves with excrement frozen in a condom?\nOh wait, those are scenes from Shakespeare’s Titus Andronicus and the 1975 Pier Pasolini film 120 Days of Sodom, adapted from the book of the same name by the Marquis de Sade. You know, just works of art that any film or drama critic would know about.\nThen there’s the fact that Sarkeesian’s attacks on the “Smurfette Principle,” that is, the practice of including a single female character in a show’s cast to embody “feminine attributes,” aren’t so much artistic criticism as an open demand for quotas in narrative storytelling that even classic films like Fritz Lang’s Metropolis can’t pass.\nOr the fact that her one contribution to film criticism, the Bechdel Test, pretty much works the same way and was a test that Hollywood was capable of satisfying, when it chose to, in the 1950 classic All About Eve before Sarkeesian was ever heard of.\nOr the fact that Sarkeesian regards the virgin birth as morally equivalent to Mary being raped by aliens. No, really, she describes Mary’s impregnation with Christ as the “original Mystical Pregnancy narrative,” despite the fact that every other example of the “Mystical Pregnancy” she can come up with involves a character being inseminated by alien life forms against her will, and even flat out calls the virgin birth a “ghastly pregnancy experience.”\nThis might be a bit of an insulting read of centuries of Christian theology.\nThese are subtle problems, as Sarkeesian’s sins against taste and history go. Even her commenters couldn’t fail to notice the more obvious ones, like Sarkeesian’s refusal to acknowledge that the film Elizabethtown is told from the viewpoint of an unreliable narrator, or her hilarious belief that the term “immaculate conception” refers to the virgin birth of Christ, when it actually refers to Mary being born without sin.\nSarkeesian has the aesthetic capacity of a wine critic who would praise a champagne glass filled with the contents of a dog’s bladder for being “unpretentious” while dismissing Dom Perignon as sparkling grape juice.\nIf gaming is to be considered high art, then it deserves critics with an artistic palette that can tell champagne from dog piss. Sarkeesian’s work offends me not just as a lifelong fan of video games, but as a lifelong lover of art, too. At the risk of sounding snobbish, I knew more about the history of artistic expression as a 13-year-old watching Teaching Company lectures on the history of opera than Sarkeesian knows as a 31-year-old producing lectures from her own home-grown preaching company.\nYou could call her as highbrow as Trofim Lysenko was scientific, but that’s unfair to Lysenko, who at least tried to learn science before using it to flatter his socialist masters. To quote the fans of one of my most beloved game franchises, the only thing that can be said to Anita Sarkeesian of her facile attempts at criticism is: Git gud, scrub.","url":"https://www.breitbart.com/tech/2015/11/02/lets-stop-pretending-anita-sarkeesian-art-critic/"}
