{"authors":[],"date_download":"2018-10-30 14:33:20","date_modify":"2018-10-30 14:33:20","date_publish":"2015-04-23 00:00:00","description":null,"filename":"data/vaneerConsumption/Letsstoppayingforspacepork.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_04_lets_stop_paying_for_space_pork_comments_1540910000.html","title":"Let's stop paying for space pork","title_page":"Blog: Let's stop paying for space pork","title_rss":"NULL","source_domain":"americanthinker.com","text":"The Washington Post had an article, ostensibly to celebrate the 25th anniversary of the Hubble Telescope. It read like an article planted by a government bureaucrat to lay the groundwork to spend even more taxpayer dollars on the HT. The Hubble was designed to be serviced by the space shuttle. But the space shuttle fleet was retired in 2011, and the Hubble hasn’t had a repair job since that 2009 mission. At some point, under the laws of entropy that dominate the cosmos, the Hubble will begin to deteriorate — for example, losing its navigational ability as its gyroscopic sensors fail one by one. “It’s kind of like predicting when’s the next time your car’s going to break down,” said Jim Jeletic, deputy project manager for the Hubble at NASA Goddard. They want more money to be spend on it, clearly. But what exactly is this money buying? What great discoveries has the HT made? “It’s fantastic.... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/04/lets_stop_paying_for_space_pork_comments.html"}
 Hubble at NASA’s Goddard Space Flight Center.\nWow! That sounds really impressive!\n“This is 1970s technology, and it is still, after 25 years, the most powerful scientific instrument in the world,” said astronomer Patrick McCarthy, who’s working on the Giant Magellan Telescope under construction in Chile.\nWow again!!\n“Hubble gave us beauty in a way that no other telescope had ever done,” said John Mather, the Nobel Prize-winning astrophysicist\nIncredible!\nBut what have we actually learned by using it?\nAstronomers a couple of decades ago said the universe is 10 billion to 20 billion years old. Thanks to the Hubble and other telescopes, they can now say it’s 13.8 billion years old.\nSo thanks to the Hubble, we can say the universe is 13.8 billion year old, not merely 10 to 20 billion!\n“Before Hubble, we didn’t know how many galaxies there are in the universe,” Grunsfeld said. The orthodoxy was that there were tens of billions of galaxies. Now, thanks to the Hubble, scientists can say there are roughly 200 billion.\nNot just billions, but 200 billion!\nBut speaking of billions, nowhere in this article is it mentioned how much the HT actually cost. The actual initial cost was 2.5 billion dollars. But billions more were spent on multiple space shuttle missions to service it.\nTherein lies the problem. It's nice knowing that the universe may be 13.8 billion years old instead of 10 to 20 billion. But knowing this fact, if it is a fact, is hardly essential. A fact that is essential is that we have a federal debt of 19 trillion dollars and unfunded obligations of perhaps 200 trillion dollars.\nIn light of that, what are we doing spending billions on researching science that has no practical value? The answers fall into two categories:\n1) By spending money on an expensive space program, even a useless one, we incidentally create new technologies that can be helpful in other areas. That's great, but it would be much more cost-effective for private companies to directly aim to create new inventions, and to do it with private money, not vital taxpayer dollars. Federal taxpayer dollars are too scarce to spend on technology R&D.\n2) Two point five billion or more dollars cannot meaningfully reduce a 19-trillion-dollar debt. That's also true, but if we can't cut things like the Hubble Telescope, what can we cut? Is it \"essential\" for the government to find out how many galaxies there are out there, or the \"precise\" age of the universe (which, by the way, I believe is unknowable, for many reasons)? If you say \"we can't cut that\" because it is essential to know how many galaxies there are, then everything is \"essential.\"\nSo if you want to spend money on playing Star Trek, start a Kickstarter campaign and spend your own money. But stop reaching into the pockets of other taxpayers for your space pork.\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/04/lets_stop_paying_for_space_pork.html"}
