{"authors":["Press Association"],"date_download":"2018-10-23 02:06:55","date_modify":"2018-10-23 02:06:55","date_publish":"2017-03-16 12:28:09","description":"One person was injured in the explosion, police in Paris have said.","filename":"data/vaneerConsumption/LetterbombexplodesatFrenchofficeofIMF.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/12/wire-228303-1489667658-777_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4320044_Letter-bomb-explodes-French-office-IMF_1540260415.html","title":"Letter bomb explodes at French office of IMF","title_page":"Letter bomb explodes at French office of IMF | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A letter bomb has exploded at the French office of the International Monetary Fund, lightly injuring one person, according to Paris police.\nStaff from the IMF office were evacuated and armed military officers and police guarded the area, in a chic district of western Paris.\nThe World Bank office in France is in the same compound.\nNo other damage was reported in the explosion, according to a police official.\nPolice officers take position after a letter bomb exploded at the French office of the International Monetary Fund\nIt is unclear who sent the explosive.\nThursday’s incident came a day after a package arrived at the German finance ministry containing low-grade explosives, like those used in firecrackers.\nMail room employees at the ministry quickly identified the package as suspicious and called in explosives experts, who destroyed it with a controlled explosion.\nFrance remains in a state of emergency after a string of deadly Islamic extremist attacks over the past two years.\nThe homemade explosive was like a “big firecracker” and sent by regular mail, said Paris police chief Michel Cadot.\nA soldier directs the traffic after a letter bomb exploded at the French office of the International Monetary Fund\nHe said the IMF office had received threatening phone calls in recent days but they were not necessarily linked to Thursday’s incident.\nIMF director Christine Lagarde, who is French, said in a statement that she was informed about the explosion while on a trip to Germany.\n“I condemn this cowardly act of violence and reaffirm the IMF’s resolve to continue our work in line with our mandate,” she said.\nThe secretary who opened the letter was injured by shrapnel in the face and hurt in the eardrum because of a “rather violent noise”, the police chief said.\nPolice searched all four floors of the building, Mr Cadot said.\nNo-one else was injured and only light damage was incurred.","url":"https://www.dailymail.co.uk/wires/pa/article-4320044/Letter-bomb-explodes-French-office-IMF.html"}
