{"authors":[],"date_download":"2018-10-30 00:51:53","date_modify":"2018-10-30 00:51:53","date_publish":"2018-09-17 00:05:00","description":"Yesterday we ran the first of these letters. Today we include two more, from mothers in the Raleigh, N.C. diocese to which I belong as well. These women further reflect the important voice the laity is giving to Catholic reactions to the unconscionable behavior of Church leadership. Catholic believers are out to defend their faith and determined to save their church from corruption, scandal, and malfeasance. These voices aren’t going away.","filename":"data/vaneerConsumption/LettersFromCatholicMothersPartII.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/Holy_Name_Cathedral.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860713.html","title":"Letters From Catholic Mothers (Part II)","title_page":"Letters From Catholic Mothers (Part II)The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Yesterday we ran the first of these letters. Today we include two more, from mothers in the Raleigh, N.C. diocese to which I belong as well. These women further reflect the important voice the laity is giving to Catholic reactions to the unconscionable behavior of Church leadership. Catholic believers are out to defend their faith and determined to save their church from corruption, scandal, and malfeasance. These voices aren’t going away.\nBeyond McCarrick\nAs a mother, I am livid about the McCarrick situation. The Pennsylvania report was bad enough, but that covered events from years ago. I thought that things had been dealt with since, but they have not.\nI find it very hard to discuss this situation with my adult children. Yes, I know that Christ is still and always will be present in the Eucharist and that the Church will survive, Christ promised that. But the leadership of the Church has failed spectacularly in more ways than one, but most damning of all in morality. It should be the one body in the world capable of taking on evil, instead of cooperating with it and enabling it.\nOne of my sons works for a large Fortune 500 company. Its secular corporate ethics are better than the American Church hierarchy’s. How do I talk to him about the culture of silence and enabling? Had 1% of the allegations that have been leveled at McCarrick been leveled at an employee of his company, that person would have been gone years ago. If his company operated like the USCCB [United States Conference of Catholic Bishops], it would be bankrupt by now. Pensions and stocks would have been lost, but not souls. That is the most horrific thing of all: souls are being lost and the beauty of the Catechism of the Catholic Church is being squandered by miserable example. I have resolved not to give any money to the BAA [Bishop’s Annual Appeal] in future years, unless there are major improvements. And by that I do not mean another committee, or more rules. As one article that I read said: “The devil is not afraid of committees.” In fact, I am sure he relishes them.\nI hope that the USCCB and my Diocese will no longer insult me by using the word “transparent.” I also hope that they will not further insult me by stating that some of the money that is collected will be given to the poor. Judas used the same argument. I can give to the poor as well as the bishops. Amongst my friends, I do not have one person who is going to give to the BAA next year and I know that some of them have made large contributions in the past. The Church has not lost its mandate and never will, but the USCCB has. By creating a culture of enabling evil and even promoting it, it has lost its moral authority and should shrink. And rather than giving support to the dioceses and parishes, it is destroying them by this scandal. It is taking away moral influence from the “first responders,” the soldiers on the ground, namely our parish priests. Their lives and mission have been greatly undermined by this.\nAs the saying goes: With friends like this, who needs enemies?\n— Maggie Beaton","url":"https://spectator.org/letters-from-catholic-mothers-part-ii/"}
