{"authors":["Associated Press"],"date_download":"2018-10-23 01:32:25","date_modify":"2018-10-23 01:32:25","date_publish":"2017-03-16 11:39:37","description":"PARIS (AP) - French prosecutors are investigating a possible Greek link after a letter exploded Thursday at the Paris' office of the International Monetary...","filename":"data/vaneerConsumption/LetterbombexplodesatParisIMFsofficeGreektiesseen.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/21/wire-230923-1489701573-605_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319822_Letter-bomb-explodes-France-office-IMF-injuring-1_1540258345.html","title":"Letter bomb explodes at Paris IMF's office; Greek ties seen","title_page":"Letter bomb explodes at Paris IMF's office; Greek ties seen | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"PARIS (AP) - French prosecutors are investigating a possible Greek link after a letter exploded Thursday at the Paris' office of the International Monetary Fund, lightly injuring one person.\nThe IMF incident came as a Greek anarchist group claimed responsibility for a letter bomb sent to the German Finance Ministry the day before.\nThe Paris prosecutor's office said Thursday night investigators found \"residues of Greek stamps\" on the letter bomb at the IMF's office in the French capital.\nFrench police officers take position after letter bomb exploded at the French office of the International Monetary Fund, lightly injuring one person, Thursday, March 16, 2017. A police official said no other damage was been reported in the incident. (AP Photo/Thibault Camus)\nFrench President Francois Hollande called Thursday's explosion in Paris \"an attack\" and noted \"a similarity with another event of the same nature in Berlin. ... We are trying to establish the causes of what happened as part of an international investigation.\"\nAuthorities in Athens confirmed the Greek lead in the investigation.\n\"We've just been informed by the French authorities that (the parcel) was posted from Greece,\" Greece's deputy minister for public order Nikos Toskas told Antenna TV.\nToskas added that whoever sent the Paris' letter bomb used the name of a senior Greek conservative opposition lawmaker, Vassilis Kikilias, and \"the address of an office that is no longer in use.\"\nThe failed letter bomb sent Wednesday to the German Finance Ministry also had the name of a false sender, that of another senior lawmaker from the same party, Adonis Georgiadis.\nFrance remains on edge and under a state of emergency from Islamic extremist attacks that killed 235 people over the past two years.\nAfter the late morning explosion in Paris, employees of the IMF office in a chic district of western Paris were evacuated while armed military officers and police guarded the area.\nIt was unclear who sent the homemade explosive, which was like a \"big firecracker\" and sent by regular mail, Paris police chief Michel Cadot said. He said the IMF office had received threatening phone calls in recent days but they were not necessarily linked to Thursday's incident.\nIMF director Christine Lagarde, who is French, said she was told about the explosion while on a trip to Germany.\n\"I condemn this cowardly act of violence and reaffirm the IMF's resolve to continue our work in line with our mandate,\" she said in a statement.\nThe secretary who opened the letter was injured by shrapnel in the face and hurt in the eardrum because of a \"rather violent noise,\" the police chief said.\nPolice searched all four floors of the building, which also houses the World Bank office in France, Cadot said. No one else was injured and only light damages were incurred.\nA Greek public order ministry official said French authorities sent Greek police photographs of the blast site, which were being examined by Greece's anti-terrorism squad.\nGreek authorities were awaiting information on potential evidence from the injured secretary in the hope she might remember details about the sender's address, the ministry official said.\nThe official spoke to The Associated Press on condition of anonymity because he was not authorized to brief reporters on the record.\nThe official later said it looks as if both parcel bombs were the work of the same group.\n\"It is very likely that they were sent by the same organization, although we can't be quite sure yet,\" he told the AP.\nHe said, \"It looks as if it could be a repeat of 2010,\" when Conspiracy Cells of Fire sent a series of explosive parcels to the offices of European politicians - including German Chancellor Angela Merkel - and foreign embassies in Athens.\nThe official said Greek authorities are concerned that the group may have sent more parcels that have not yet been detected.\nThe Greek group that claimed responsibility for the German bombing, Conspiracy Cells of Fire, claimed in an online posting Thursday on a Greek left-wing website that the attack was part of a concerted campaign by international anarchist groups.\nMany Greeks resent the austerity measures imposed by the IMF and the European Union in order for their financially strapped country to get international bailouts. While France has been an ally to Greece's government in negotiations over the bailout, far-left and anarchist groups oppose the whole international financial system.\nThe bomb sent to Germany, containing low-grade explosives like the ones used in fire crackers, was destroyed Wednesday before it could explode.\n___\nPaphitis reported from Athens, Jeffrey Schaeffer, Elaine Ganley, Sylvie Corbet and Philippe Sotto in Paris contributed to this report.\nFrench police officers take position after letter bomb exploded at the French office of the International Monetary Fund, lightly injuring one person, Thursday March 16, 2017. A police official said no other damage was been reported in the incident. (AP Photo/Thibault Camus)\nFrench police officers take position after letter bomb exploded at the French office of the International Monetary Fund, lightly injuring one person, Thursday March 16, 2017. A police official said no other damage was been reported in the incident. (AP Photo/Thibault Camus)","url":"https://www.dailymail.co.uk/wires/ap/article-4319822/Letter-bomb-explodes-France-office-IMF-injuring-1.html"}
