{"authors":[],"date_download":"2018-10-30 00:58:59","date_modify":"2018-10-30 00:58:59","date_publish":"2016-11-24 00:05:59","description":null,"filename":"data/vaneerConsumption/LettertoaYoungFriend.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/11/Protesters_march_against_Donald_Trump_30606577750.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861139.html","title":"Letter to a Young Friend","title_page":"Letter to a Young FriendThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Dear Justin,\nI’m not sure if you’ll see this letter, as we’ve been out of touch since you unfriended me on Facebook. That wasn’t my wish; I have several Democrat friends, and I generally just pass over their political posts without comment, as I always did with yours. But you could not tolerate having anyone as a friend who refused to condemn Donald Trump entirely, all his works and all his ways. I’ve never been terribly enthusiastic about the man, but I couldn’t honestly do that.\nSo here we are, post-election, looking at an outcome neither of us expected. I’m not about to do an end zone dance — this election wasn’t exactly a triumph for conservatism. Frankly, I expect the new president will do a lot more that will please you than you expect at this point.\nBut now seems to me a good time for a thought experiment.\nLet’s suppose your fears are justified. Let’s imagine that Trump is in fact Hitler. That he’s about to send Brownshirts rampaging through the streets, rounding up liberals, Hispanics, and homosexuals and transporting them to death camps. Let’s imagine that this year marks the beginning of a reign of terror unprecedented in American history.\nNow suppose I said to you (which I never would; I have too much respect for you. Also I’m not a scoundrel), “Well, you know, times change. Your flaccid liberalism was good enough for the 20th century, but we’ve all evolved now. This is the age of Authoritarianism. You’ve got to keep up with the times. If you don’t change, you’ll be crushed under the wheels of history. Evolve or die.”\nI’m pretty sure, knowing you as I do, that you wouldn’t assent to that. You’d say, “No. I don’t care how many people have become fascists. I don’t care if the whole world is fascist, and only I’m left to stand against it. I still won’t pretend to believe what I don’t believe.”\nWelcome to my world, Justin.\nBecause the argument above (the fascist one) is the argument you and your fellow liberals have been using against me for decades.\nNow I’d like you to think about your (entirely correct) reaction to my Brownshirts scenario.\nYou reject with disgust the idea that it could ever be right to become the kind of person you imagine someone on my side to be (a false imagination by the way, based on media depictions. Kind of like judging black people by how they were portrayed in 1930s movie comedies). Some things are just wrong, you think. I refuse to become a monster, even if the whole world is becoming monstrous.\nNow I ask you to think about that reaction. It’s a good and laudable reaction — assuming you’re right about who the monsters are in the world.\nBut what makes that reaction a good one?\nMy best understanding of your thinking is that you believe in social relativism. That a thing may be right in one time and place, and wrong in another. That it’s all a societal construct, adjustable to changes in environment.\nBut if that were true, the bullies would be right. You’d be morally obligated to change your beliefs to match those of the majority whatever they were. By that logic, Wilberforce was wrong to oppose slavery. Bonhoeffer was wrong to oppose Nazism. The homosexual activists you admire were wrong to oppose the overwhelming social majority that despised them back when they began their movement — up until the moment that society changed and it suddenly became right.\nThat doesn’t really work, does it?\nYou can adopt some kind of moral evolutionism, I suppose, the kind I mentioned above. I hear a lot of arguments that seem to assume that view. “Long ago we were savages and believed savage things. But now we’ve evolved into a finer, more sensitive species. Our brains have changed physically, so that now we have to be a better kind of people.”\nOf course that’s a pseudo-scientific view, based on a 19th century conception of evolution as some kind of inevitable climb toward perfection. Modern evolutionists reject that view completely. Evolution is mindless and has no morality, they say. Any particular change is as likely to lead the individual over a cliff as up to mountain pastures.\nIn other words, that kind of talk applied to morality is a statement of faith, not of scientific fact.\nNo, if you’re going to stand on principle in a changing world, the principle has to be based on something outside the world. You can’t measure the volume of water flow in a river while you’re floating on it. You have to be anchored to do that. There has to be a fixed place somewhere, or else we’re just arguing whose feelings are more important.\nI have a feeling a lot of discussion these days is just people yelling at each other, saying, “My feelings are more important than yours!”\nThe only way to resolve that kind of an argument is with fists or weapons.\nI think that’s something both you and I would like to prevent.\nNow, I understand there’s an inherent problem in this approach. You might commit to a system of values, and then society’s stream runs off another way. You might find yourself all alone, out of step with your whole culture.\nYou wouldn’t be the first.\nThat was Bonhoeffer’s problem too, after all.\nAll the best,\nLars\nLars Walker is the author of several fantasy novels, the latest of which is Death’s Doors. He works as librarian for the schools of the Association of Free Lutheran Congregations in Minneapolis.","url":"https://spectator.org/letter-to-a-young-friend/"}
