{"authors":[],"date_download":"2018-10-30 00:51:50","date_modify":"2018-10-30 00:51:50","date_publish":"2018-09-16 00:34:13","description":"Pope Francis’s ongoing refusal to respond to the allegations of Archbishop Carlo Maria Viganò continues to cause great harm to the church and the laity. The Catholic News Agency reports on the evidence received by the Vatican as far back as 2000.","filename":"data/vaneerConsumption/LettersFromCatholicMothers.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/1024px-Sacred_Heart_Church_Raleigh_interior_2017.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860710.html","title":"Letters From Catholic Mothers","title_page":"Letters From Catholic MothersThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Pope Francis’s ongoing refusal to respond to the allegations of Archbishop Carlo Maria Viganò continues to cause great harm to the church and the laity. The Catholic News Agency reports on the evidence received by the Vatican as far back as 2000.\nThe Catholic Church has existed for two thousand years because its teachings are directly from Jesus Christ. Unfortunately, many in leadership are acting as though they have to answer only to themselves.\nThe failure of the Pope, Cardinals, and Curia to cleanse the church of predatory priests and their protectors is causing great pain to families and the laity. The time for a complete cleansing of the Catholic Church is now. Commissions, new policies, and conferences may be useful in the future, but now is the time to act. Pope Francis must force the resignations of all cardinals and bishops responsible for covering up corruption within the church.\nThe great news from this scandal is that Catholic laity, courageous priests and bishops are energized to cleanse the church of corrupt leadership and return the Catholic Church to its rightful place.\nIn the coming days we will be running excerpts of letters to the Pope and others from mothers in the Diocese of Raleigh, North Carolina, my diocese. Below is the first of these excerpts, from Suzanne N. Temple:","url":"https://spectator.org/letters-from-catholic-mothers/"}
