{"authors":[],"date_download":"2018-10-30 14:15:54","date_modify":"2018-10-30 14:15:54","date_publish":"2018-10-30 02:50:00","description":"This can't be normal","filename":"data/vaneerConsumption/Letters.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30_letters-20181030__page=1_1540908954.html","title":"Letters","title_page":"Letters","title_rss":"NULL","source_domain":"arkansasonline.com","text":"This can't be normal\nOne week after my daughter's joyous wedding, gathering families, friends and community, a gunman shot and killed 11 people, many quite elderly, at a baby-naming ceremony.\nThe president suggested the congregation was neglectful by not hiring an armed guard to protect its house of worship, just as he said nine months ago after yet another horrific act of domestic terrorism that we must \"harden\" our schools. What of our nightclubs, our concerts? Is hiring armed guards part of sensible wedding planning too?\nI am a teacher and each semester I go over active-shooter procedures. It breaks my heart that my students think this is normal, the way things are.\nIt's not really that complicated: Do you think this should be \"normal\"?\nCHAIM GOODMAN-STRAUSS\nFayetteville\nParties distort reality\nAs a psychologist, I read research on how people actually vote, and Arkansas appears to be a good example of what the experts describe. In the coming election, Republicans likely will win all statewide offices and congressional seats. Why? Because Arkansans, along with the rest of the South, decided years ago they were Republicans. Arkansas was slow to make a complete conversion because of big Democratic personalities here, but the South turned Republican after 1964 over race and civil rights. When LBJ said that with the Voting Rights Act of 1964 the Democratic Party had lost the South for a generation, he was wrong only in his time estimate.\nResearch shows that most people pick their party, vote accordingly, and distort reality to believe their party represents their interests. Most people in Arkansas will not profit from the recent Republican tax cut and do not approve of driving up the deficit by a trillion dollars a year. Most need the Social Security and Medicare they have paid into their whole working lives that Republicans plan to cut. Many need the protection for pre-existing medical conditions that Republicans have voted to kill. Still, these people are going to vote for the party that is doing the very things they do not want because they are Republicans.\nROGER WEBB\nLittle Rock\nNeed a new mascot\nAfter the less than stellar performance against that SEC powerhouse Vanderbilt, I think it is time to consider an alternative Razorback mascot. I propose Razorback Clams. Instead of feasting on pork, the opponents can feast on clam chowder. Their only decision will be New England-style or Manhattan-style. Bon appetit.\nDON ENTENMAN\nBlytheville\nConsequences yours\nThis administration is depriving asylum-seekers and immigrants of their rights in the same prejudicial manner that minorities have experienced throughout history.\nThis administration is the deep-state wannabe. This administration cannot exist without unquestioning obedience. Failure to blindly follow this administration draws levies of persecution and imprisonment. Failure to stand against immorality leads to damnation.\nThere is no moral distinction between killing a human being because their skin is an \"unacceptable\" color and destroying a child's sense of right, wrong and security. To represent and support the subversive practices of this administration's flagrant disregard for humanity, to elevate the money-changers to elite and privileged status, is to relegate principles of religion and justice to irrelevance.\nWhat will it profit a man if he gains the whole world, yet forfeits his soul? Be aware: \"Evangelicals\" in support of this administration are precisely what is meant by taking the Lord's name in vain. You claim to be what you are not. You give false testimony against others. The commandments exist because evil exists. Obey or, at the very least, respect the commandments. Otherwise you and your ilk will deserve the designer eternity you purchase on the toll road to hell. The toll is your soul and you are actively earning your fate.\nThe choice is yours to make. The consequences are deservedly yours. God and humanity oppose you. Who do you really think will prevail?\nJAMES MAXWELL JENKINS\nLittle Rock\nVoting does matter\nOn the eve of this most important midterm election, let us reflect on the fact that the 2016 election was decided by fewer than half of Americans age-eligible to vote. That means that every voter out there knows at least one person who didn't vote. Presumably, those Americans believed that their votes don't matter; that they would change nothing.\nNow reflect on how many Americans bought a lottery ticket recently for the one in 300 million chance that they would hold the winning ticket.\nI implore you voters to get involved and reach out to the nonvoters you know and do your best to get them to exercise their most important freedom. I suggest downloading the app called Vote With Me. It will easily facilitate your reaching out to anyone on your contact list.\nVoting does matter. One vote can literally make all the difference in the world. It could be yours. It could be theirs. Vote.\nDANE BUXBAUM\nLittle Rock\nDefine 'fine,' please\nIn August 2017 President Trump defended white nationalists who protested in Charlottesville, saying they included \"some very fine people,\" while expressing sympathy for their demonstration against the removal of a statue of Confederate General Robert E. Lee.\nOn Saturday, authorities named the 11 people killed when a man armed with three pistols and a semiautomatic assault-style rifle burst into a synagogue in Pittsburgh--the deadliest attack on Jews in the history of the United States. Are these the same people?\nJOEL SEAMAN\nLakeview\nEditorial on 10/30/2018","url":"https://www.arkansasonline.com/news/2018/oct/30/letters-20181030/?page=1"}
r problem, isn't it, as long as they don't come over here. We have our own problems, like defending our right to not make a wedding cake. Or deciding if there is anybody at all who shouldn't carry a gun, and anyplace at all where they shouldn't carry it.\nCORALIE KOONCE\nFayetteville\nEditorial on 03/07/2017","url":"https://www.arkansasonline.com/news/2017/mar/07/letters-20170307/?page=1"}
//www.arkansasonline.com/news/2016/jul/30/letters-20160730/?page=1"}
