{"authors":["Euan Mclelland For Mailonline","Chris Greenwood Crime Correspondent For The Daily Mail"],"date_download":"2018-10-22 20:05:55","date_modify":"2018-10-22 20:05:55","date_publish":"2016-01-29 00:26:24","description":"The triple killer (pictured) - serving two life sentences at HMP Wakefield, West Yorkshire - has converted to Islam while behind bars, a move which grants him better meals and more time out of his cell.","filename":"data/vaneerConsumption/LeviBellfieldhasconvertedtoIslambehindbarscallinghimselfYusufRahim.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/10/30A38C5F00000578-0-image-a-2_1454064874420.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421973_Did-monster-kill-8-women-girls-Levi-Bellfield-linked-murders-Lin-Megan-Russell-multiple-rapes-death-childhood-sweetheart-string-jail-cell-admissions_1540238755.html","title":"Levi Bellfield has converted to Islam behind bars, calling himself Yusuf Rahim","title_page":"Levi Bellfield has converted to Islam behind bars, calling himself Yusuf Rahim | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Triple killer Levi Bellfield has converted to Islam in prison - a move which grants him better meals, more time out of his cell and an excuse to withdraw from work and classes.\nCalling himself Yusuf Rahim, the warped murderer is now gorging on much sought-after vegetarian curries and is allowed to avoid his jail duties to attend prayer meetings instead.\nPrison bosses have seen a surge in Muslim inmates in recent years, with one in five of those serving sentences in Britain's maximum security jails now following Islam.\nScroll down for video\nTriple killer Levi Bellfield (pictured) has converted to Islam in prison - a move which grants him better meals, more time out of his cell and an excuse to withdraw from work and classes\nCalling himself Yusuf Rahim, the warped murderer is now gorging on much sought-after vegetarian curries and is allowed to avoid his jail duties at HMP Wakefield (pictured) to attend prayer meetings instead\nThe Officers' Association union previously put that down to thousands of lags becoming so-called 'convenience Muslims' - converting to the religion to deliberately play the system.\nBy doing so, dangerous prisoners have also found it easier to form gangs, leading to heightened tensions with guards and the fuelling of extremism.\nNews of Bellfield's conversion comes as his sister urges police to investigate the disappearance of two woman more than 15 years ago.\nAnn-Marie Bellfield is convinced her 'monster' brother is responsible for Elizabeth Chau, 19, and US-born computer graduate Lola Shenkoya, 27, both going missing.\nTheir whereabouts remains a mystery, but the 67-year-old is adamant her triple murderer sibling - serving two life sentences for the murders of three women, who this week finally admitted killing Milly Dowler in 2002 - is behind their disappearance.\nShe said: 'Them two girls just disappeared off of the street. At the time, Levi had a clamping business in West Ealing, which was in the area, and I do believe he is somehow linked to those cases.\nMs Bellfield added: 'Levi is manipulative, psychotic, cruel and unfeeling. I am certain he is behind more horrific crimes.'\nBellfield is again at the centre of a police inquiry after he apparently admitted to a string of murders and rapes in jail cell confessions.\nAnn-Marie Bellfield - the killer's sister - is urging police to investigate the missing person cases of student Elizabeth Chau (left), 19, and US-born computer graduate Lola Shenkoya (right), 27. Both vanished from London streets more than 15 years ago, with their whereabouts still a mystery\nNine forces are examining the alleged admissions that would significantly widen the killer's known reign of terror.\nThe 47-year-old has suggested he is responsible for up to 25 unsolved crimes, including the murders of five other victims.\nScotland Yard, which is co-ordinating the investigation, last night refused to comment on which cases are being reviewed, say his claims are still being assessed.\nAt the time of his conviction for Milly's murder in June 2011, detectives said they believed Bellfield may have been responsible for 20 unsolved attacks on women. And it has been long suspected that his appalling crimes may have begun in 1980 when he was just 12.\nHis school sweetheart, Patsy Morris, 14, was found strangled on Hounslow Heath and no-one has been convicted. Other potential crimes include the murders of Judith Silver in London in 1990 and Lin and Megan Russell in their Kent village in 1996.\nBellfield is also suspected of raping and sexually assaulting numerous women and girls over more than a decade, often after drugging them with spiked drinks.\nHowever, senior detectives urged caution and said the pathological liar had a history of attempting to manipulate the authorities. They believe he may be trying to win privileges by appearing to co-operate.\nOne sceptical retired detective even suggested that the twisted paedophile could be getting a 'thrill' from stringing police along.\nAnn-Marie Bellfield is urging Scotland Yard to reopen Elizabeth Chau and Lola Shenkoya's cases.\nChau, 19, was caught on CCTV near Ealing police station, West London, as she walked home from Thames Valley University in April 1999. She was never seen again.\nIn January the following year, Shenkoya, 27, was spotted getting off a bus at Burger King near Ealing Broadway station.\nThe 47-year-old is serving two whole life terms for the murder of Milly Dowler and two other young women\nShe also vanished.\nSpeaking to The Mirror, Ms Bellfield, 67, said her brother may have followed his victims while running a car clamping business in the area.\nShe said: 'He rang me when he was on remand for the murders of Marsha McDonnell and Amelie Delagrange. He said the police were trying to pin the other two cases on him.\n'He was jumpy and said, \"They're trying to do me for them missing girls in Ealing but I never had anything to do with it.\"\n'It sends a shiver down my spine whenever I think about the awful things he has done. I hope he rots in hell.'\nThe 'confessions' came to light as Surrey Police interviewed Bellfield at Wakefield Prison over fears an accomplice assisted him in the abduction of Milly in 2002. Although they found no evidence to support this, the serial killer stunned investigators by admitting to her abduction, rape and murder for the first time.\nIt is understood he went on to suggest he was involved in other crimes and even implicated several other men.\nThe forces reviewing violent attacks on women and young girls are thought to include Greater Manchester, Avon and Somerset, Sussex and Lancashire.\nAlthough the majority of Bellfield's crimes took place in West and South West London, the former doorman and wheel-clamper travelled widely.\nDet Chief Insp Colin Sutton, who brought Bellfield to justice in 2008 over the murders of Marsha McDonnell and Amelie Delagrange, said police had evidence he abducted and raped five young girls.\nHe said he was surprised that Bellfield would admit to anything while his mother Jean, to whom he is close, is alive. He added: 'There is always an angle with Levi, always something he is trying to manipulate.\n'I don't know whether he is thinking down the line if there is a challenge to the whole life tariff, whether he might be able to apply for parole. I think he could be that calculating.","url":"https://www.dailymail.co.uk/news/article-3421973/Did-monster-kill-8-women-girls-Levi-Bellfield-linked-murders-Lin-Megan-Russell-multiple-rapes-death-childhood-sweetheart-string-jail-cell-admissions.html"}
