{"authors":["Dan Ripley For Mailonline"],"date_download":"2018-10-23 05:52:33","date_modify":"2018-10-23 05:52:33","date_publish":"2017-03-16 16:38:06","description":"The team appeared to have moved on from Hamilton’s controversial race tactics, but Hill also believes that the Brit could walk away from Mercedes should another row with the team emerge.","filename":"data/vaneerConsumption/LewisHamiltonandMercedescouldpartsaysDamonHill.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E49BEEC00000578-0-image-a-27_1489682245822.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_formulaone_article-4321006_Lewis-Hamilton-Mercedes-says-Damon-Hill_1540273953.html","title":"Lewis Hamilton and Mercedes could part, says Damon Hill","title_page":"Lewis Hamilton and Mercedes could part, says Damon Hill  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mercedes won’t be afraid to dismiss Lewis Hamilton if the three-time world champion goes ‘too far’ by disobeying team orders, according to Damon Hill.\nHamilton ignored direct team orders to improve his pace during last-season’s dramatic final-race in Abu Dhabi by slowing down and pushing team-mate Nico Rosberg into a chasing pack.\nThe Brit needed Rosberg to finish lower than third to win the world championship, but the German hung on to second to claim the title before retiring from the sport.\nLewis Hamilton will once again be behind the wheel of a Mercedes during the 2017 season\nHamilton, pictured with team principal Toto Wolff and new team-mate Valtteri Bottas\nThe team appeared to have moved on from Hamilton’s controversial race tactics, but Hill also believes that the Brit could walk away from Mercedes should another row with the team emerge.\nHamilton previously refused to deny suggestions that he was prepared to quit following a first-lap crash with Rosberg at last year’s Spanish Grand Prix.\n‘There’s always a limit, there’s always a point where someone has gone too far and in which case the team will say “ok well this is costing us more than we are prepared to pay” – I don’t mean money I mean more in relationships and the effectiveness as a team,’ Hill said.\n‘There’s a balance to be struck. You forgive the occasional blitz and tantrums as long as on average they are delivering over the season.\nDamon Hill believes Hamilton and his team could part if there is a repeat of last season's issues\nFORMULA ONE 2017 SCHEDULE March 26 - Australia (Melbourne) April 9 - China (Shanghai) April 16 - Bahrain (Bahrain) April 30 - Russia (Sochi) May 14 - Spain (Barcelona) May 28 - Monaco (Monte Carlo) June 11 - Canada (Montreal) June 25 - Azerbaijan (Baku) July 9 - Austria (Spielberg) July 16 - Great Britain (Silverstone) July 30 - Hungary (Budapest) August 27 - Belgium (Spa) September 3 - Italy (Monza) September 17 - Singapore (Singapore) October 1 - Malaysia (Sepang) October 8 - Japan (Suzuka) October 22 - USA (Austin) October 29 - Mexico (Mexico City) November 12 - Brazil (Sao Paulo) November 26 - Abu Dhabi\n‘We will see what happens. It may be Lewis is an emotional beast and there might be a situation where he says I’ve had enough, I don’t want to do it.’\nThe 1996 world champion however did back Hamilton’s Abu Dhabi tactics, claiming that with the constructors’ championship already won for Mercedes the 31-year-old had every right to try and clinch a fourth drivers’ crown in any reasonable way he could.\n‘I was quite pleased he did do that,’ Hill added. ‘There’s a couple of times where Lewis has said “no I want to do what I want to do” and I’m very much in favour of drivers having the courage to choose their career over team results because there are two championships and it’s a valid point.\n‘Last year was all about question over the equipment which I can’t see Mercedes be in any doubt. I think it will be more settled. If it’s not going well for Lewis then he does have a tendency to make his feelings known.\nHill also urged F1 fans to give the new era of the sport a chance, even if Mercedes go on to dominate as they have done for the previous three years.\nHamilton, pictured in his Mercedes at winter testing in Spain earlier this month\nWolff said Hamilton's behaviour in Abu Dhabi had caused anarchy within the Mercedes team\nThe former Williams driver claims that even in the dullest of championship battles there are always good races in a season arising from elements out of a team’s control.\n‘Even in the most dominant era, there’s always interesting and exciting races,' Hill added.\n‘Some races can be extremely disappointing with cars just seemingly following each other around unable to race. That happens.\n‘But in those seasons there’s also really exciting races. Some mishaps, rain or surprising results from other teams – it does happen.’\nHill, right, pictured launching Sega's sponsorship of Williams with Alain Prost in 1993\nSky Sports F1 will show all 20 races this season, live in UHD for the first time with Sky Q, starting at the Australian GP on 26 March.","url":"https://www.dailymail.co.uk/sport/formulaone/article-4321006/Lewis-Hamilton-Mercedes-says-Damon-Hill.html"}
