{"authors":[],"date_download":"2018-10-22 21:13:34","date_modify":"2018-10-22 21:13:34","date_publish":"2014-05-06 14:22:46","description":"\"Sure, my boss took advantage of me, but I will always remain firm on this point: it was a consensual relationship,\" she writes in Vanity Fair.","filename":"data/vaneerConsumption/LewinskyItsTimetoBurntheBeretandBurytheBlueDress.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/423216/140506-monica-lewinsky-1030a_003ec2f4aed89c47212fd7fc65308d9b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_politics-news_lewinsky-its-time-burn-beret-bury-blue-dress-n98146_1540242814.html","title":"Lewinsky: 'It's Time to Burn the Beret and Bury the Blue Dress'","title_page":"Lewinsky: 'It's Time to Burn the Beret and Bury the Blue Dress'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMonica Lewinsky has opened up about her affair with President Bill Clinton in a piece in Vanity Fair, saying that she “deeply regrets” her relationship with him but insisting that it was “consensual.”\n\"It's time to burn the beret and bury the blue dress,\" she writes in the piece. \"I, myself, deeply regret what happened between me and President Clinton. Let me say it again: I. Myself. Deeply. Regret. What. Happened.\"\nLewinsky also responds to a report that Hillary Clinton referred to her as a \"narcissistic loony toon\" but also blamed herself for her husband's extramarital exploits.\n\"She may have faulted her husband for being inappropriate, but I find her impulse to blame the Woman—not only me, but herself—troubling,\" she writes.\nAnd she claims that, at 24, she declined an offer by interrogators to wear a wire in the presence of Clinton's confidantes in exchange for immunity.\n\"Courageous or foolish, maybe,” she writes. \"But narcissistic and loony?\"\nDespite some critics' persistent accusations that Bill Clinton engaged in \"predatory behavior\" with Lewinsky, she maintains that the sexual relationship was consensual and not abusive.\n“Sure, my boss took advantage of me, but I will always remain firm on this point: it was a consensual relationship,” she continues. “Any ‘abuse’ came in the aftermath, when I was made a scapegoat in order to protect his powerful position. . . . The Clinton administration, the special prosecutor’s minions, the political operatives on both sides of the aisle, and the media were able to brand me. And that brand stuck, in part because it was imbued with power.”\nLewinsky says she decided to go public after the suicide of Tyler Clementi, the Rutgers University freshman who took his own life in 2010 after his encounter with another man was streamed over the web without his knowledge. The story reminded her and her mother of the shame and scorn she faced and the suicidal impulses she experienced, she says.\n“Perhaps by sharing my story, I reasoned, I might be able to help others in their darkest moments of humiliation. The question became: How do I find and give a purpose to my past?” she writes.","url":"https://www.nbcnews.com/politics/politics-news/lewinsky-its-time-burn-beret-bury-blue-dress-n98146"}
