{"authors":[],"date_download":"2018-10-22 20:28:45","date_modify":"2018-10-22 20:28:45","date_publish":"2014-06-01 03:48:12","description":"\"There were no survivors,\" said Matthew Brelis, a spokesman for the Massachusetts Port Authority, which operates Hanscom Field in Bedford.","filename":"data/vaneerConsumption/LewisKatzAmongSevenKilledinFieryMassachusettsPlaneCrash.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_22/479881/140601-plane-crash-jsw-805a_106d172591e5f8eb0849c066c86251ab.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_lewis-katz-among-seven-killed-fiery-massachusetts-plane-crash-n119491_1540240125.html","title":"Lewis Katz Among Seven Killed in Fiery Massachusetts Plane Crash","title_page":"Lewis Katz Among Seven Killed in Fiery Massachusetts Plane Crash","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe private plane that crashed on takeoff in Massachusetts, killing Philadelphia Inquirer co-owner Lewis Katz and six others, hurtled 2,000 feet off the end of the runway, plunged into a watery gully and burst into flames, investigators said Sunday.\n\"There were no survivors,\" said Matthew Brelis, a spokesman for the Massachusetts Port Authority, which operates Hanscom Field in Bedford, where the Gulfstream IV crashed as it was taking off at about 9:40 p.m. en route to Atlantic City International Airport in New Jersey.\nKatz, who once owned the New Jersey Devils and New Jersey Nets, was among the dead, the newspaper's editor said Sunday.\nHe was flying home from an educational fundraiser at the home of historian Doris Kearns Goodwin, who called him \"a force of nature\" in a statement.\n\"Afterward we all went to dinner, where we talked at length about our shared passions for sports and journalism, politics and history,\" Goodwin said in a statement.\n\"But the last thing he said to me upon leaving for the plane was that most of all what we shared was our love and pride for our children. I have lost a great friend, his family has lost a great father and grandfather, and the country has lost a great man.\"\nNational Transportation Safety Board senior investigator Luke Schiada said there were two pilots, a cabin attendant and four passengers on the plane. The bodies were being removed Sunday afternoon.\nThe plane traveled 2,000 feet beyond the paved runway, losing its landing gear in the process, as it struck an antenna and a chain-link fence, Schiada said.\nThen it went down an embankment and into the gully, where it broke apart and was engulfed by a post-crash fire, he said. Investigators were looking for the aircraft's flight data and cockpit voice recorders in the hopes they would provide clues to the cause of the accident.\nBased on a witness report, it does not appear the plane ever got airborne, Schiada said. An airport worker told investigators he did not see any fire before the crash.\nThe NTSB is also looking into the mechanical history of the plane, which was co-owned by Katz.\n\"He never forgot where and how he grew up, and he worked tirelessly to support his community in countless ways that were seen and unseen.\"\nThe prominent businessman and philanthropist was mourned by his family and public figures from Philadelphia's mayor to the NBA commissioner.\n\"My father was my best friend. He taught me everything. He never forgot where and how he grew up, and he worked tirelessly to support his community in countless ways that were seen and unseen,\" his son Drew Katz said in a statement.\n\"His sudden passing adds to our family's grief over the recent passing of our beloved mother, Marjorie Katz. We will miss both of them tremendously but will work to carry on the enormous legacy that they both created.\"\nAccording to Philly.com, last Tuesday, Katz and H.F. \"Gerry\" Lenfest bought out their partners in the publishing business for $88 million, gaining control of the media company that owns the Inquirer.\n\"We all deeply mourn the loss of my true friend and fellow investor in ownership of The Philadelphia Inquirer, The Daily News and Philly.com,\" Lenfest said, adding that Drew Katz would replace his father on the board,\nPhiladelphia Mayor Michael Nutter said he spoke to Katz a few days ago to congratulate him on the newspaper deal.\n\"Lewis was such a 'full of life' guy, always optimistic and forward looking, always wanting to push the envelope and do good things for Philadelphia and Camden,\" Nutter said.\n\"He would talk with me and other officials about what he could to do to make life better for children and improve the image of our great city. His passion for education, children's sports programs and improving the business climate in our city were just a few of the things that he would always talk to me about.\"\nThe names of the other victims were not immediately released, but Longport, New Jersey, Commissioner Jim Leeds told the Press of Atlantic City that his wife, Anne Leeds, was on board.\nNearby residents recounted seeing a fireball and feeling the blast of the explosion shake their homes.\nJeff Patterson told The Boston Globe he saw a fireball about 60 feet in the air and suspected the worst for those aboard the plane.\n\"I heard a big boom, and I thought at the time that someone was trying to break into my house because it shook it,\" said Patterson's son, 14-year-old Jared Patterson. \"I thought someone was like banging on the door trying to get in.\"\nFormer NTSB investigator Gregory Feith said the probe will focus on whether there was some kind of mechanical problem that took the plane off the end of the runway and whether the crew had the proper settings in place before takeoff.\n\"Normally, on takeoff you wouldn't use the entire length of the runway. The fact that it went off the runway — either it had a mechanical problem or perhaps the crew decided to abort the takeoff and in trying to stop, ran out of runway,\" Feith told NBC News.\nHe said that once a plane goes off the runway, it can hit things like lights and other equipment that can start breaking the aircraft apart or rupture a fuel tank, causing the kind of inferno that engulfed the Gulfstream.\nHe said NTSB investigators will try to determine if the crew and passengers were killed by the initial mishap or if they survived but were somehow trapped or incapacitated when the fire broke out.\nThe air field, which is about 20 miles northwest of Boston and serves the public, was closed after the crash.\nNBC News' Andrew Blankstein and the Associated Press contributed to this report.","url":"https://www.nbcnews.com/news/us-news/lewis-katz-among-seven-killed-fiery-massachusetts-plane-crash-n119491"}
