{"authors":["Cleve Jones"],"date_download":"2018-10-23 01:09:11","date_modify":"2018-10-23 01:09:11","date_publish":"2016-11-29 00:00:00","description":"Jones became an activist after Harvey Milk's assassination, and he lost countless friends to the AIDS epidemic. He says, \"There are some days when it is so painful that I really can barely function.\"","filename":"data/vaneerConsumption/LGBTQActivistCleveJonesImWellAwareHowFragileLifeIs.json","image_url":"https://media.npr.org/assets/img/2016/11/29/cleve_at_supreme_court-fpo-jw_wide-0287ae127b86ed0d8e08e86a59b038ba7970b546.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_11_29_503724044_lgbtq-activist-cleve-jones-im-well-aware-how-fragile-life-is_1540256951.html","title":"LGBTQ Activist Cleve Jones: 'I'm Well Aware How Fragile Life Is'","title_page":"LGBTQ Activist Cleve Jones: 'I'm Well Aware How Fragile Life Is' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"LGBTQ Activist Cleve Jones: 'I'm Well Aware How Fragile Life Is'\ntoggle caption Hachette Books\nLongtime activist Cleve Jones has dedicated his life to working with members of the LGBTQ community, but growing up he felt like the only gay person in the world. He tells Fresh Air's Terry Gross that he felt so isolated as a teenager that he considered suicide. Then he read about the gay liberation movement in Life magazine and his outlook changed.\n\"This magazine, in a matter of minutes, revealed to me that there were other people like me,\" Jones says. \"There were a lot of us. We were organizing. ... There was a community, and there were places we could live safely. And one of those places was called San Francisco.\"\nJones moved to San Francisco when he was in his early 20s. There, he found a mentor in Harvey Milk, one of the country's first openly gay elected officials. He marched alongside Milk for gay rights, and when Milk was assassinated in 1978, Jones decided to dedicate his life to the cause. \"Meeting Harvey, seeing his death, it fixed my course,\" he says.\nAfter the AIDS epidemic hit San Francisco, Jones co-founded the San Francisco AIDS Foundation and started the AIDS Memorial Quilt.\nJones describes his life and his involvement in the gay rights movement in his new memoir, When We Rise. He says it's a story of hardship, but also one of triumph. \"I have these memories of great struggle and great pain and great loss, but I also in my lifetime have seen extraordinary progress and amazing change.\"\nInterview Highlights\nOn considering suicide as a kid\nWhen We Rise My Life in the Movement by Cleve Jones Hardcover, 291 pages | purchase close overlay Buy Featured Book Your purchase helps support NPR programming. How?\nI felt that my life was over before it even really began because it just seemed then that there was no way to have a decent life and to be gay. So I was terrified that I was going to be caught and I had already experienced quite bit of bullying and I just thought that only misery lay ahead and when I got caught that that would be the solution.\nI wish I could say that was thing of past, but you know it's not. And even today, every year we lose an awful lot of young people, teenagers, who take their own lives because they are gay or transgender.\nOn being at the scene of Harvey Milk's City Hall assassination by former San Francisco Supervisor Dan White\nIt changed my life forever. ... Dan White had invited him into his office and shot him there. And his feet were sticking out in the hall and I recognized his wingtip shoes — he had second-hand shoes he had bought at a thrift store. Then we couldn't leave. We were stuck there because the police were doing their thing.\nAnd we played the tape that he had left for us to play, because he predicted his assassination. I used to tease him for it and tell him he wasn't important enough to get shot, so that was pretty eerie and very horrible to be sitting in his office, listening to his voice predicting his death while his body is there in the hallway.\nI knew by the end of the day that that was the single most important moment of my life, and it was the single most important thing that happened to me.\nOn Milk's importance to the gay rights movement\n[Harvey Milk]'s often described as the first openly gay person to be elected to public office. That is inaccurate, and in my book I make sure to credit the half dozen or so individuals who came before him in various places in the country. But I think Harvey's significance really was that he became our first shared martyr. Word of his assassination spread far and wide, and even though gay people had lost many people to violence, to suicide, to drugs and alcohol, here was this symbolic figure that just struck a chord with people. For those of us in San Francisco, it was fascinating to see this guy who was really just one of your local neighborhood characters assume this worldwide significance.\nOn testing positive for HIV\nBy the fall of 1985, almost everyone I knew was dead or dying or caring for someone who was dying. I tested positive for HIV the week the test came out, which I'm thinking was 1985. That time is a bit of a blur. ...\nI had been in a study I had volunteered for, so I knew that they had samples of my blood going back all the way to 1977. So I learned that not only did I have HIV, but I learned that I had had it since the winter of '78, '79, so I never expected to survive.\nOn where he got the idea for the AIDS Memorial Quilt\nEvery year in San Francisco on November 27, we gather at the corner of Castro and Market Street and light our candles to remember Harvey [Milk] and George [Moscone, the late San Francisco mayor who was assassinated with Milk]. That year, as we were getting ready for the annual tribute, the death toll in San Francisco rose to 1,000 and there was a headline in the paper about \"1,000 San Franciscans Dead From AIDS.\" ...\nI was just so struck by that number: 1,000. ... So that night of the march, I had Harvey Milk's old bullhorn and I got stacks of poster board and stacks of markers and I asked everybody to write the name of someone they knew who had been killed by the new disease. At first people were ashamed to do it, but finally began writing their first and last names, and we carried these placards with us with our candles to ... the building that housed the Health and Human Services West Coast offices for the federal government for the Reagan administration. ...\nWe had hidden ladders in the shrubbery nearby and climbed up the front grey stone façade of this building and taped the names to the wall. After I got off my ladder I walked through the crowd. There were thousands of people. It was gentle rain, no speeches or music, just thousands of people reading these names on this patchwork of placards up on that wall. And I thought to myself, \"It looks like some kind of quilt,\" and when I said the word \"quilt\" I thought of my great-grandma. ... And it was such a warm and comforting and middle-American traditional-family-values sort of symbol, and I thought, \"This is the symbol we should take.\"\nThere are some days when it is so painful that I really can barely function. But I have to, and I do, and I find that I get my strength from my community and my friends.\nOn the pain of having lived through AIDS epidemic and Milk's assassination\nIt's similar, I think, to being in a war. I think of my friends every day. There are some days when it is so painful that I really can barely function. But I have to, and I do, and I find that I get my strength from my community and my friends. And I'm surrounded by people who went through that time with me, and we support each other and we love each other are grateful for every bit of laughter and joy that comes our way. ...\nWhenever I get to these junctures in my life — and we just had one with this last election — where everything I've been through kind of flashes before my eyes again ... I think, \"Well, here we go.\" But finding Harvey's body, watching all those people die during AIDS — I'm well aware how fragile life is and how short it can be and how important it is to use it fully.","url":"https://www.npr.org/2016/11/29/503724044/lgbtq-activist-cleve-jones-im-well-aware-how-fragile-life-is"}
