{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 18:47:22","date_modify":"2018-10-30 18:47:22","date_publish":"2016-08-04 08:07:30","description":"A number of LGBT activists have slammed Pope Francis after the pontiff denounced attempts to teach children that gender is fluid.","filename":"data/vaneerConsumption/LGBTGroupsBlastPopeFrancisOverGenderComments.json","image_url":"https://media.breitbart.com/media/2016/08/trans-gender.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_04__1540925242.html","title":"LGBT Groups Blast Pope Francis Over Gender Comments","title_page":"LGBT Groups Blast Pope Francis Over Gender Comments","title_rss":"NULL","source_domain":"breitbart.com","text":"A number of LGBT activists have slammed Pope Francis after the pontiff denounced attempts to teach children that gender is fluid and can be chosen, rather than a biological fact and a gift from God.\nIn a meeting with Polish bishops during World Youth Day last week, the Pope lamented the infiltration of “gender theory” into educational materials for children.\n“Today, schools are teaching children—children!—that everyone can choose their own sex. And why is this being taught? Because their textbooks are chosen by the people and institutions that give money. This is ideological colonization, promoted by very influential nations. This is terrible,” the Pope said.\nOn numerous occasions, Pope Francis has reaffirmed Catholic teaching that God creates human beings as male and female, and that young people should be taught to embrace the sexuality that God gave them.\nSarah McBride, a transgender woman and National Press Secretary of the pro-LGBT Human Rights Campaign, said that Francis’ words were “not only hurtful, and frankly harmful, but really demonstrating a misunderstanding of what it means to be transgender.”\nAsked to speak at the Democratic National Convention, McBride said that in today’s America “LGBTQ people are still targeted by hate that lives in both laws and in hearts,” but all that can change if Hillary Clinton is elected president.\nFrancis DeBernardo, the executive director of New Ways Ministry, a Catholic LGBT advocacy group, said that the Pope was ignorant about LGBT issues.\n“Nobody chooses a gender identity. They discover it. Transgender people come to know themselves in a process is [sic] similar to the way that lesbian, gay, and bisexual people discover their sexual orientation,” he said.\nDeBernardo added that “most reputable scientific experts say that allowing children to transition in youth is both a physically and psychologically healthy thing for them to do in most cases.”\nLast spring, the American College of Pediatricians issued a position paper warning against the physical and psychological dangers to children posed by advocates of transgenderism. Failing to identify with one’s biological sex signals a psychological disorder that must be dealt with, not pandered to, the physicians argued.\nThe doctors declared that human sexuality is “an objective biological binary trait” rather than an infinite series of self-determined “genders.” The norm for human design, the doctors said, “is to be conceived either male or female. Human sexuality is binary by design with the obvious purpose being the reproduction and flourishing of our species,” and therefore, “XY” and “XX” are “genetic markers of health – not genetic markers of a disorder.”\nWhile everyone is born with a biological sex, the doctors noted, a child’s awareness of his or her sexuality develops over time and “may be derailed by a child’s subjective perceptions, relationships, and adverse experiences from infancy forward.” Helping them accept their objective sexual identity is one of the objectives of good parenting and intelligent education.\n“A person’s belief that he or she is something they are not is, at best, a sign of confused thinking,” the physicians said. “When an otherwise healthy biological boy believes he is a girl, or an otherwise healthy biological girl believes she is a boy, an objective psychological problem exists that lies in the mind not the body, and it should be treated as such.”\nIn a recent letter on marriage and the family, Amoris Laetitia (“The Joy of Love”), Pope Francis said that sex education should teach “respect and appreciation” for sexual differences, as a way of helping the young to overcome self-absorption. This respect includes self-acceptance and learning to embrace the body one is born with, rather than playing with fictional identities that deny reality.\n“An appreciation of our body as male or female,” he added, is “necessary for our own self-awareness in an encounter with others different from ourselves.”\nAn effort to cancel out sexual differences based in anatomy is a symptom of a society that “no longer knows how to deal with it,” he wrote.\nAs he has done in the past, Francis decried an ideology of gender that “denies the difference and reciprocity in nature of a man and a woman and envisages a society without sexual differences, thereby eliminating the anthropological basis of the family.”\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/politics/2016/08/04/lgbt-groups-blast-pope-francis-gender-comments/"}
