{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 20:31:45","date_modify":"2018-10-30 20:31:45","date_publish":"2016-12-30 00:00:00","description":"Danish DONG Energy is investing £12 billion in renewable energy in Britain and Chinese construction group CNBM is spending £2.5 billion building UK homes.","filename":"data/vaneerConsumption/LiamFoxattracts15billionofinvestmentintoBritainsinceBrexit.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_liam-fox-department-for-international-trade-investment-into-britain-since-brexit-2016-12_1540931505.html","title":"Liam Fox attracts £15 billion of investment into Britain since Brexit","title_page":"    Liam Fox attracts £15 billion of investment into Britain since Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Britain's International Trade Secretary Liam Fox listens as Prime Minister Theresa May gives her speech on the final day of the annual Conservative Party Conference in Birmingham, Britain, October 5, 2016. REUTERS/Toby Melville LONDON — The Department for International Trade has attracted over £15 billion of foreign investment to the UK since Brexit, according to the Telegraph.\nLiam Fox, the minister in charge of the department, is taking credit for investment worth £15.8 billion. The figure is largely down to a commitment from Danish DONG Energy to invest £12 billion in renewable energy in Britain by 2020 and a £2.5 billion deal that will see Chinese construction group CNBM build 25,000 modular homes in the UK.\nFox told the Telegraph that the figure demonstrates a \"clear vote of confidence in the UK.\" Tory MP and Vote Leave campaigner Iain Duncan Smith told the paper: \"This latest announcement is the turning point. You are now either in the camp that fundamentally believes that Britain can do anything, anytime and anywhere, or you are in the a doom and gloom camp that doesn't believe in Britain.\"\nThe figures from the Department for International Trade come on the same day as data from Thomson Reuters shows that deal making did not suffer a major set back in 2016 despite Brexit. British firms were involved in mergers and acquisitions worth £144.5 billion this year, with the fall in the pound after the referendum spurring activity as British firms became cheaper to buy.","url":"https://www.businessinsider.com/liam-fox-department-for-international-trade-investment-into-britain-since-brexit-2016-12"}
