{"authors":["Emily Sheridan For Mailonline"],"date_download":"2018-10-23 03:10:19","date_modify":"2018-10-23 03:10:19","date_publish":"2016-01-11 15:52:55","description":"The Northern Irish actor, 63, looked fuller in the face and body than he had done in recent months as he arrived in Seoul, South Korea on Monday.","filename":"data/vaneerConsumption/LiamNeesonlookshappyafterregainingweighthelostfornewfilmrole.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B7EDE00000578-0-image-a-95_1452526597711.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394098_Liam-Neeson-looks-happy-healthy-regaining-weight-lost-new-film-role_1540264219.html","title":"Liam Neeson looks happy after regaining weight he lost for new film role","title_page":"Liam Neeson looks happy after regaining weight he lost for new film role  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"His gaunt appearance shocked fans when he was pictured out and about last summer.\nBut after completing filming on his new movie Silence, it looks like Liam Neeson is swiftly getting back to his previous weight.\nThe Northern Irish actor, 63, looked fuller in the face and body than he had done in recent months as he arrived in Seoul, South Korea on Monday.\nScroll down for video\nHealthy and happy: Liam Neeson looked in good spirits as he flew into Seoul, South Korea on Monday\nThe Taken star had gone method and lost about 20lbs to play a Jesuit Portuguese priest in upcoming Martin Scorsese film Silence.\nHe was first pictured in July looking incredibly thin with his clothes hanging off his 6ft 4in frame.\nAt the time, his representative insisted the actor was 'healthy' despite his decreasing frame, with Liam only going public with the reason behind his weight loss at a festival in November.\nBack on track: The actor had lost about 20lbs to play a Jesuit Portuguese priest in upcoming Martin Scorsese film Silence\nSpeaking at the Los Cabos Film Festival two months ago, Liam said: 'Martin requires this level of dedication and I think it pays off.\n'He's legendary - so as a performer you have to get over that. I had to get over that… He requires absolute silence on set, like everybody has to stop work when he's giving a direction or explaining a scene.\n'I mean everybody - the guy that's painting 400 yards away has to stop. If he hears one tiny sound, it's shattered for him so he commands that respect. He commands that silence and especially for this film it was necessary.'\nGaunt: Liam was spotted looking much thinner in New York City back in July 2015 as he lost weight to star in new film Sience\nWith Silence now in the editing suite ahead of its release later this year, Liam is starting work on his next movie Operation Chromite.\nThe upcoming war drama, directed by Korean film-maker John H Lee, tells the story of a group of soldiers during the Battle of Inchon during the Korean war in 1950.\nLiam is one of the main western actors in a cast dominated by South Korean actors.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394098/Liam-Neeson-looks-happy-healthy-regaining-weight-lost-new-film-role.html"}
