{"authors":[],"date_download":"2018-10-30 14:32:23","date_modify":"2018-10-30 14:32:23","date_publish":"2015-07-23 00:00:00","description":null,"filename":"data/vaneerConsumption/LiberalsMankindhasevolvedtothepointwherejailsnolongerneeded.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_07_liberals_mankind_has_evolved_to_the_point_where_jails_no_longer_needed_comments_1540909943.html","title":"Liberals: Mankind has evolved to the point where jails no longer needed","title_page":"Blog: Liberals: Mankind has evolved to the point where jails no longer needed","title_rss":"NULL","source_domain":"americanthinker.com","text":"Liberals: Mankind has evolved to the point where jails no longer needed An opinion piece in the New York Times called for Riker's Island, the main jail in New York, to be shut down, with most prisoners simply released on the streets. Shuttering Rikers would be an audacious move for Mr. de Blasio, who would have to find alternatives for the island’s roughly 10,000 overwhelmingly male, African-American and Latino inmates. Do you think flooding the streets with 10,000 people accused of crimes would be \"audacious\"? No doubt he would be branded a softy by the tough-on-crime crowd. No doubt! I guess the \"tough-on-crime\" crowd are now the hard-right radicals who want criminals locked away. The mayor’s plan to expand supervised release programs would be a substantial achievement.... Eliminating money bail, or at least greatly modifying it, could lead to the release of another large portion of the jail... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/07/liberals_mankind_has_evolved_to_the_point_where_jails_no_longer_needed_comments.html"}
could absorb some of the remaining slots. Finally, the roughly 15 percent of Rikers residents who are sentenced prisoners could be moved to state prisons. This is an admittedly crude analysis\nVery crude. Let's start with the basic understanding that a significant number of people accused of crimes are guilty. If you release these people before trial, guess what they are going to do: commit more crimes! It doesn't take a rocket scientist to realize this, but it does take a liberal to hide from this fact.\nThe new, fashionable liberal approach is to say that drug addicts are not a security risk and shouldn't be locked up. But where do addicts get the money to buy drugs? Their addiction, not very surprisingly, prevents them from holding down jobs in many cases. So they have to rob or steal to get what they need. You can send an addict to \"drug rehab,\" but he is not continually monitored and required to detoxify. Releasing thousands of accused criminals on the streets of New York will be like releasing wolves with a taste of mutton into a flock of sheep.\nFor hundreds of years, societies put people in jail pending trial for many sorts of crime. Now liberals seem to be saying that mankind has changed, and that is no longer necessary. Has human nature really changed, or have liberals simply lost touch with reality?\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/07/liberals_mankind_has_evolved_to_the_point_where_jails_no_longer_needed.html"}
