{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 19:50:51","date_modify":"2018-10-30 19:50:51","date_publish":"2017-02-15 23:15:32","description":"The left is after New England Patriots quarterback Tom Brady once again, this time for daring to post a poem from celebrated Jungle Book author Rudyard Kipling. | Sports","filename":"data/vaneerConsumption/LiberalsAttackPatriotsTomBradyforSharingRacistRudyardKiplingPoem.json","image_url":"https://media.breitbart.com/media/2017/02/brady-balls.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2017_02_15__1540929051.html","title":"Liberals Attack Patriots' Tom Brady for Sharing 'Racist' Rudyard Kipling Poem","title_page":"Liberals Attack Patriots' Tom Brady for Sharing 'Racist' Rudyard Kipling Poem | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The left is after New England Patriots quarterback Tom Brady once again, this time for daring to post a poem from celebrated Jungle Book author Rudyard Kipling.\nAfter becoming the most-winning quarterback in Super Bowl history, with five Super Bowl rings, Brady posted the Kipling poem If to his social media account.\nKipling’s poem has often been cited a one of the best poems in the English language and famously starts with a line many know even if they’ve never heard of the poem: “If you can keep your head when all about you are losing theirs and blaming it on you…”\nThe poem has long been a touchstone for self-confidence and humility, Heatstreet.com noted. The site also points out that the poem has served as inspiration in a variety of venues, saying, “The poem has been featured in Apocalypse Now, adapted into a song by Joni Mitchell, read out on the BBC to conclude their 1998 World Cup soccer coverage, and used by the Boston Red Sox for a video tribute last year to retiring player David ‘Big Papi’ Ortiz.”\nBut, despite the upbeat message of the poem, leftists now attack Brady for posting the famed verse, calling it and its author “racist.”\nOnce considered one of the most brilliant writers in English, Kipling, who died in 1936, has recently come under fire by liberals and social justice warriors for being an imperialist, a white supremacist, and racist for his writings about the Indian subcontinent from a British perspective.\nA recent piece by the vulgar writers at the Gawker website typifies the hate modern leftists have showered upon Kipling with a 2016 piece entitled, “Reminder: Rudyard Kipling Was a Racist Fuck and The Jungle Book Is Imperialist Garbage.”\nWith that in mind, a list of leftists attacked Brady for daring to post the poem to his Instagram account calling Brady a racist for doing so.\nConsidering all the vitriol over Brady's friendship w/ Trump, mayyybe Rudyard Kipling (\"The White Man's Burden) not the best poet to quote. pic.twitter.com/qECefrU6YZ — Daniel Roberts (@readDanwrite) February 9, 2017\nTom Brady quoting a Rudyard Kipling poem on Facebook after repeatedly being called a white supremacist is…not great. — me gutpunched (@ass_dad) February 9, 2017\nDo you think Tom Brady realizes the irony of quoting a Kipling poem to celebrate a super bowl win? Especially without even crediting RK. — Will (@williamstreit) February 9, 2017\nA #SuperBowl poem: Roses are red\nViolets are blue\nTom Brady sucks\nWhen you smash him in the mouth — Deplorable11 (@Antagonizer11) February 6, 2017\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/sports/2017/02/15/liberals-attack-patriots-tom-brady-sharing-racist-rudyard-kipling-poem/"}
