{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 21:03:25","date_modify":"2018-10-30 21:03:25","date_publish":"2015-12-04 02:22:37","description":"After the San Bernardino shooting, liberals attacked Christians and GOP candidates who had offered prayers for the victims and families.","filename":"data/vaneerConsumption/LiberalsSaidTakingSyrianRefugeestheChristianThingtoDoNowAttackPrayersforVictimsofTerror.json","image_url":"https://media.breitbart.com/media/2015/12/memorial-for-san-bernardino-shooting-victims-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_12_03__1540933405.html","title":"Liberals Said Taking Syrian Refugees the 'Christian Thing to Do,' Now Attack Prayers for Victims of Terror","title_page":"Liberals Said Taking Syrian Refugees the 'Christian Thing to Do,' Now Attack Prayers for Victims of Terror","title_rss":"NULL","source_domain":"breitbart.com","text":"Before the smoke from the terror attack in San Bernardino had cleared, the liberal narrative was turned to an effort to make the murders into a means to attack Christians and those Republican candidates who had offered prayers for the victims and their families.\nBut only a month before, liberals were citing Christianity as a positive thing and saying that taking in Syrian refugees was “the Christian thing to do.” Once again, we see liberals using Christianity when they want to push an agenda but at all other times ridiculing it as a great evil.\nFor the terror attack in San Bernardino, California, not even the first facts where known about who perpetrated the December 2 attacks before liberals went on the attack against Republicans and conservatives who, early in the crisis, expressed desires to pray for the victims of the attack.\nBreitbart’s Ben Shapiro ably documented the dozens of tweets from liberals who immediately attacked the right for the San Bernardino terror attack, even as the situation was ongoing.\nEarly out of the box, people like liberal Democrat Party activist Markos Moulitsas jumped to Twitter—even as the murders were unfolding—to attack guns, the Second Amendment, the NRA, pro-lifers, and any manner of liberal boogiemen.\nMoulitsas, for instance, blurted out on Twitter, “Yo GOP, kinda hard to talk about ‘keeping people safe’ when your peeps are shooting up America.”\nWithout a clue about what he was talking about, Geraldo Rivera disgorged a long series of bizarre tweets, one of which said, “The NRA is full of shit,” even as the NRA had nothing whatsoever to do with the attack.\nGeraldo also made the misinformed statement, “The key now is for us to be as outraged by San Bernadino massacre as we would be if Muslim extremists were doing the killing. This is terror.”\nOf course, we now know the absurdity of Rivera’s point because it was likely Muslim extremists who perpetrated the attack.\nEven more liberals came after conservatives and Christians for saying that they were “praying” for the victims in California.\nOne of the most egregious was the cover of the New York Daily New, which, the next morning, published a headline in giant letters that screamed, “GOD ISN’T FIXING THIS.”\nHuffington Post pushed a similar narrative with a headline insisting, “Another Shooting, Another Deluge of Tweeted Prayers,” and containing a lede reading, “Public officials are the people society trusts to solve society’s ills. Like, say, gun violence. But every time multiple people have been gunned down in a mass shooting, all these officials can seemingly do is rush to offer their useless thoughts and prayers.”\nLiberals also quickly filled Twitter with attacks on Christians.\nMediate writer Andrew Husband, for instance, was absolutely enraged by those praying for the victims. He ran to Twitter to slam such Christians in no uncertain terms.\nIf you’re a political candidate tweeting about all the thoughts and prayers you have for San Bernardino, you can go fuck yourself. — Andrew Husband (@AndrewHusband) December 2, 2015\nComedian and actor Billy Eichner was similarly upset at prayers for those hit by the terror attack.\nYour “thoughts and prayers” don’t mean a damn thing. #GunControlNOW — billy eichner (@billyeichner) December 2, 2015\nOther liberals jumped in with both feet to push the meme.\nOther countries must have fewer mass shootings because their conservative politicians offer thoughts and prayers more vigorously. — Matthew Yglesias (@mattyglesias) December 2, 2015\nYour “thoughts” should be about steps to take to stop this carnage. Your “prayers” should be for forgiveness if you do nothing – again. — Chris Murphy (@ChrisMurphyCT) December 2, 2015\nOfficial GOP position: “Praying.” “God bless.” “Praying.” “Thoughts and prayers.” “Praying.” “Thoughts and prayers.” pic.twitter.com/OyW3fQvm4w — Scott Bixby (@scottbix) December 2, 2015\nIn the minds of these liberals, it is apparently a venal thing for someone to want to pray for the comfort of victims of Muslim terror. Christianity is an evil seemingly worse than terror in their minds.\nBut the same sort of liberals were playing a different tune only a month ago when they wanted to convince Americans to bring tens of thousands of Syrian refugees into the U.S.A.\nIn November after ISIS terrorists with ties to Syrian “refugees” killed over 100 innocent civilians in Paris, France, over half of America’s governors banded together to say “no more” to Obama’s plans to import tens of thousands of Syrian “refugees”—an importation policy that France indulged prior to the vicious Friday the 13th attacks.\nBut almost immediately, members of the left in the U.S. began to claim that anyone who opposed taking in tens of thousands of Syrians—any number of whom could be ISIS terrorists—were somehow “bad Christians” for refusing the refugees.\nOnly three days after the attacks in Paris, for instance, in an article for the Washington Post, Michael Boorstein was asking, “would Jesus take in Syrian refugees?” In the piece, he then laid out the case for Christians to set aside concerns for security and quoted those touting the idea that Jesus would have taken the refugees regardless of the troubles they might bring.\nThe Post’s piece brought a hail of criticism on Twitter, but that didn’t stop other outlets from similarly using Christianity to justify their Syrian refugee policy.\nFor Time magazine, Christopher J. Hale also jumped into the fray to claim, “there is nothing Christian about blocking” refugees from entering the U.S., saying the “idea flies in the face of the gospel of Jesus Christ.”\nNot long afterward, The Week added its voice to claim that it was the “Christian thing to do” to take in refugees regardless of whether or not terrorists would come in right along with them. In her article, Gracy Olmstead said voices opposing taking in refugees were “belligerent” and “offensive.”\nEven The Guardian promulgated this narrative with a piece by Giles Fraser, who said that it was the “Christian thing” to “let the refugees in, every last one.”\nTV pundits also plied the left’s newly-realized interest in what Jesus would do.\nOn ABC’s “The View,” comedienne and show panelist Whoopi Goldberg criticized Republicans who were against bringing in Syrian refugees by making the odd—and false—argument that Hitler was a Christian, so taking in Muslims should be no big deal for the U.S.\nGuests on MSNBC similarly attacked Christians fearful of importing terrorists along with Syrian “refugees.”\nFar left-wing website TinkProgress.org also pushed the meme by claiming that the governors wishing to put the brakes on the Syrian refugee program were “hypocrites” and acting contrary to Jesus’s ideals.\nFinally, President Obama, who was pushing his plan to import tens of thousands of Syrian refugees, also used the left-wing line. The president even insisted that it was “un-American” to try and put limits on the number of Syrian refugees brought into the U.S., especially if they are Muslims.\nFortunately, there were a few voices out there affirming that you aren’t a “bad Christian” if you want to be cautious about importing more Muslims into the U.S.\nIn any case, these are just a few examples of the dozens of liberals from print, TV, radio, Hollywood, and everywhere else who were all “wee-weed up“—as the president might say—over what Jesus would do for Syrian refugees. Quite a contrast to how they instantly attacked Christians for the San Bernardino shooting, isn’t it?\nAs we see, the same sort of people who attacked Christians for having the compassion to pray for victims and mocking Christianity for somehow making matters worse were also invoking “what would Jesus do” when they wanted to push the idea that the U.S. should import tens of thousands of Muslims from Syria.\nOnce again we see that liberals are all in favor of “Christianity” if it can be used as cover to push their policies, but otherwise, they see Christianity as an evil that should be destroyed.\nFollow Warner Todd Huston on Twitter @warnerthuston, or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/national-security/2015/12/03/liberals-said-taking-syrian-refugees-christian-thing-now-attack-prayers-victims-terror/"}
