{"authors":["Patrick Howley"],"date_download":"2018-10-30 22:18:39","date_modify":"2018-10-30 22:18:39","date_publish":"2016-08-04 14:44:39","description":"Libertarian Party presidential nominee Gary Johnson exposed himself as a shill for Hillary Clinton during a CNN town hall.","filename":"data/vaneerConsumption/LibertarianCandidatesExposeThemselvesasAntiTrumpShillsforHillaryClinton.json","image_url":"https://media.breitbart.com/media/2016/08/Gary-Johnson-William-Weld-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_08_04__1540937919.html","title":"Libertarian Candidates Expose Themselves as Anti-Trump Shills for Hillary Clinton","title_page":"Libertarian Candidates Expose Themselves as Anti-Trump Shills for Hillary Clinton","title_rss":"NULL","source_domain":"breitbart.com","text":"Libertarian Party presidential nominee Gary Johnson and his running mate William Weld exposed themselves as shills for Democrat Hillary Clinton during an extensive primetime town hall with CNN’s Anderson Cooper.\nWeld defended Hillary Clinton on her private email scandal and played attack dog on Donald Trump.\nJohnson seemed sleepy, but he answered a question at length about THC amounts in marijuana and another from a young man asking about legalized prostitution. Johnson only lightly and perfunctorily criticized Clinton, instead focusing most of his low-energy attacks on Trump. He also revealed a personal gluten allergy and said that he himself would not patronize the services of prostitutes.\nThese two marginal politicians are clearly enjoying the spotlight that the pro-Clinton media are finally giving them in their effort to stop Trump. (Something tells me the folks at CNN have not secretly been reading Reason magazine all these years.)\nThe Johnson-Weld team seems to think that libertarianism is mostly about admitting as many immigrants to the United States as possible. This is a far cry from Ron Paul’s pro-borders libertarian movement of a few years ago. The libertarian movement has shifted to the progressive globalist Left.\nBill Weld has called Clinton “by and large a good secretary of state,” and Johnson has called her “a wonderful public servant.”\nWhen Johnson criticizes Clinton, he often goes after her for “big government” spending in a bald-faced attempt to sound conservative and to peel off Trump’s support with the #NeverTrump crowd.\nA top Clinton-supporting official at the “libertarian” Niskanen Center think tank (which advocates for more Syrian refugee settlement in America) spelled out the strategy in no uncertain terms: the Libertarians need to adopt a Right-sounding platform so they can take some of Trump’s support and prop up Clinton.\nDid you notice that the mainstream networks began touting a Clinton lead in a new “3-Way Poll.”\nBut what about Jill Stein? Will CNN give Green Party candidate Jill Stein the same primetime platform?\nLibertarian insiders, by their own admission, went into their convention in Orlando with one modest goal: to nominate Gary Johnson against various insurgent challengers, including Gonzo software recluse John McAfee, and then to get five percent of the popular vote in November to get the party on future state ballots. This could be the year, the insiders said. The five percent year!\n“Everyone who gets paid by the Kochs says so,” longtime Libertarian insider Tim Cavanaugh quipped when the Johnson-Weld ticket was taking shape.\nSee, Gary Johnson does not just have a weed habit. He also has a Koch problem. As Breitbart News first reported, the Kochs’ secret Beltway bank pulled out of the race as soon as it became clear Trump was going to be the nominee, but they left the door open to supporting Clinton.\nIndeed, a source within the Johnson campaign wanted people to think that Johnson had a Koch connection, leaking to the Daily Caller that “tens of millions” were heading Johnson’s way. They were not hiding it. The Libertarian party chairman begged like a dog for Koch money in a press conference in Orlando.\nThe Libertarians are finally showing their hand: they’re globalist Clintonites.\nThis is what happens when Koch-funded activists straight out of liberal arts college join Koch-funded Washington advocacy groups that throw happy hours aimed at “Conservatarians”–because Libertarian Koch-funded people are totally friendly to the tea party!\nThe Kochs run the tea party, don’t they? That’s certainly how the Kochs made it seem in the mainstream media after they started funding, funding, funding things attached to what was once a leaderless tea party revolution in this country that aimed to disrupt the power of the elites.\nAnd then when the chips are down and Hillary Clinton goes for the White House, the Kochs roll over. And William Weld defends Clinton on the emails.\nCongratulations, Libertarian movement. You guys finally went Left enough on immigration to make it onto CNN in primetime!\nMaybe Don Lemon will come to the next happy hour. Just tell him not to bring gluten.","url":"https://www.breitbart.com/politics/2016/08/04/libertarian-candidates-expose-themselves-as-anti-trump-shills-for-hillary-clinton/"}
