{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 21:02:10","date_modify":"2018-10-30 21:02:10","date_publish":"2016-07-15 18:14:52","description":"The Klu Klux Klan (KKK) is officially recruiting members in San Francisco, citing a rise in interest due to the Black Lives Matter movement.","filename":"data/vaneerConsumption/LiberalSanFranciscoBesiegedbyKKKRecruiters.json","image_url":"https://media.breitbart.com/media/2016/03/Denver-students-art-KKK-cop-pointing-gun-at-black-kid-Twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_07_15__1540933330.html","title":"Liberal San Francisco Besieged by KKK Recruiters","title_page":"Liberal San Francisco Besieged by KKK Recruiters | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Klu Klux Klan (KKK) is officially recruiting members in San Francisco, citing a rise in interest following a series of police shootings, protests, and cop-killings that have garnered national attention.\n“Black Lives Matter Black Panthers are telling followers to kill white people and police officers in the name of justice for the killing of Negro’s [sic] by policemen in the line of duty,” a KKK recruitment flyer which was acquired by Hoodline read. “These Negro’s [sic] were not innocent, they were thugs breaking the law, and standing up against police.”\nThe flyers were reportedly being passed around San Francisco’s Haight & Clayton and Oak & Lyon districts somewhere between 9:30am and 2 p.m. on Tuesday.\nHey everyone, the KKK is now recruiting in… San Francisco. https://t.co/XQGBTXSgqw — AntiDisplacementCoup (@AsterZephyrIsis) July 13, 2016\nAccording to the San Francisco Chronicle, Will Quigg, grand dragon of the KKK’s West Coast region, said his “organization is actively recruiting in all of California and all of the United States,” adding,”We’re getting a lot more calls, especially in the last few months with what Obama’s doing, what Hillary’s doing and especially Black Lives Matter calling for war and saying they’re trying to kill all whites.”\nQuigg reportedly told the Chronicle that his group is a “new Klan,” adding “We are a white, Christian, nonviolent civil rights organization.”\nCivil rights groups like the National Association for the Advancement of Colored People (NAACP) insist that Black Lives Matter is not to blame for strained race relations, but point the finger at Republican presidential candidate Donald Trump instead, citing his straightforward and inflammatory rhetoric.\n“Donald Trump ought to be ashamed of himself,” San Francisco NAACP President Amos Brown told the Chronicle. “He is the one — out of his self-centered interest — who has created this climate.”\nSan Francisco resident Mahsa Ashabi told the local NBC News affiliate in the area: “I found a flier for the KKK, saying come join us and saying a lot of terrible things about black people and the Black Lives Matter movement. No matter how racist or ignorant your beliefs, you’re allowed to have them, but don’t bring them to this neighborhood; not going to be received well.”\nPhoto: file\nFollow Adelle Nazarian on Twitter @AdelleNaz","url":"https://www.breitbart.com/local/2016/07/15/kkk-officially-starts-recruiting-in-san-francisco/"}
