{"authors":[],"date_download":"2018-10-30 00:55:26","date_modify":"2018-10-30 00:55:26","date_publish":"2015-11-05 00:00:00","description":null,"filename":"data/vaneerConsumption/LiberalsNotLoyaltoAnything.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2015_11_liberals_not_loyal_to_anything_comments_1540860926.html","title":"Liberals: Not Loyal to Anything","title_page":"Articles: Liberals: Not Loyal to Anything","title_rss":"NULL","source_domain":"americanthinker.com","text":"A new report from Pew Research confirms what most of us have known all along: Democrats tend to have no religious affiliation (28%, to be exact). Among the other 72%, only 16% are evangelical Protestants (versus 38% for Republicans). Large numbers belong to liberal \"universalist\" churches and non-Christian groups, including black Muslims. The Pew \"Religious Landscape Study\" reveals a lot about liberals in America. In increasing numbers, they are rejecting Christianity. Millions are self-professed atheists or agnostics. Politically, they identify as socialists, a fact that underlies the appeal of socialist candidate Bernie Sanders. Vast numbers of Democrats have relinquished their faith in God and, at the same time, in capitalism, both of which are at the heart of American identity. This loss of faith in American values, if it continues, has dire implications for the future of our country. In essence, religious faith... (Read Full Article)","url":"https://www.americanthinker.com/articles/2015/11/liberals_not_loyal_to_anything_comments.html"}
conomic and cultural decline is the inevitable result, as seen in every communist regime. The Soviet Union failed because its people lost faith in the goodness of life. Cuba is impoverished because its people have no free-market incentives to work.\nLiberals like to think they are \"above\" those ordinary Americans who \"cling to their guns or religion,\" as President Obama put it. They believe in universalism, social justice, and saving the Earth. These \"beliefs,\" however, are not the same thing as religion. They are a rejection of religious faith, and they are intended to undermine the competitive instinct at the heart of capitalism.\nFor example, the belief in universalism – the idea that one's own nation is no more exceptional than any other, and that all cultures are equally viable – is by definition a rejection of faith in the superiority of one's own country. Liberals do not \"believe in\" America. They believe in \"humanity,\" and they believe that world government, supported by world courts, international armies, and global economic arbitration, should govern all nations, including their own. To the liberal mind, Obama's failure to assert American power on the global stage is a virtue. It is a perfect expression of a key tenet of liberal beliefs.\nThis is why Obama and Clinton have scorned our allies while showing themselves willing to engage with our deadliest enemies. From the liberal point of view, there is no such thing as an ally or an enemy. The particular loyalty of the USA to its traditional allies – Britain, Canada, Australia, and more recently Germany and Japan – means nothing to the liberal mind. One is just as willing to \"reset\" with Russia, kibbutz with Kim, or engage with Castro.\nHillary Clinton's part in the Arab Spring is a case in point. Hillary was cheerleader-in-chief in bringing about the fall of pro-American regimes in Tunisia, Egypt, Yemen, and Libya, and in promoting the destabilization of pro-American regimes in Bahrain and Saudi Arabia. Just as Jimmy Carter helped to bring about the fall of the shah of Iran and thus the rise of Islamic extremism in Iran, Hillary's rash foreign policy has brought about the rise of ISIS across the Middle East. As a consequence of the chaos in Syria, Iraq, Libya, Yemen, and Egypt, millions of lives have been lost.\nHad the pro-American strongmen been left in power in these and other countries, order would have been maintained. But Hillary was too high-minded to think she should remain loyal to our allies, however unsavory some of them may have been. She wanted to bring about a perfect world, a utopia with no favorites, no loyalties, no strongmen, no use of force.\nIt's Jeane Kirkpatrick's \"Dictators and Double Standards\" all over again. That masterful essay has been around for 40 years, but liberals never got around to reading it. Had they done so, the Arab Spring would have been suppressed from the start, with U.S. assistance, and ISIS would never have gained footing in the region.\nIt's not just foreign policy. Liberals are willing to throw their own country under the bus just as much economically as in terms of national security. Like Obama, Hillary opposes restraints on immigration and supports bringing hundreds of thousands of Muslim refugees to our shores. She supposes that we are all just one people – human beings, not Christians, Muslims, Jews, Hindus, or any other particular religion, not Westerners with a firm sense of democracy as opposed to Middle Easterners who have never known anything but tyranny. She thinks that once those hundreds of thousands of Islamic refugees make it to our shores, they will enroll their kids in Y soccer and sign up for multifaith picnics with their Christian and Jewish neighbors. All will be kumbaya. No worries.\nLikewise, liberals believe that social justice trumps capitalism. But again, the liberal belief in equality amounts to a rejection of a fundamental pillar of Western civilization: the belief in individual self-responsibility and the freedom to pursue opportunity in a free market. Social justice, with its goal of universal equality, is a rejection of economic liberty. To achieve equality, liberals such as Ms. Clinton always return to the same proposition: increased taxation and redistribution of capital.\nSocial justice is not a benign form of liberation; it is a cynical theft of assets that are the product of hard work on the part of others. There is nothing noble, or even remotely righteous, about the belief in social justice. From a political point of view, those who demand enforced equality, as Hillary Clinton has just done with her $12 minimum wage proposal, are simply buying the votes of the poor in the most cynical manner. Redistributionist schemes in America are no less cynical than in Peronist Argentina, Chavez's Venezuela, or any other failed socialist state.\nSurprisingly, those same liberals who support universal equality are among the stingiest when it comes to charitable giving. It seems they are ardent supporters of social justice in the abstract, but they are less likely to contribute to their churches or local communities than are conservatives.\nThe reason for this lack of charitable giving, I believe, is that liberals have no particular faith in anything. They believe in \"the environment,\" but what is that? It is something far away, diffuse, distant in time and place. Global warming cannot be seen or felt. \"Climate change\" is a mantra, a magic potion, a cult-like incantation. It is the opposite of one particular gardener's affection for one particular planting of hydrangeas, or the touching concern of a pet owner's feelings for her aging black lab. Just as universalism is the opposite of patriotism, and income equality is the opposite of faith in education and hard work.\nIn their faithlessness, liberals are on the wrong side of history. America is going to survive and prosper, and it will do so because the vast majority of Americans are conservative by nature. Americans believe in the goodness of life; they believe that the pursuit of happiness is a fundamental right; they love their families and their country, and they believe that both are exceptional and deserving of their special loyalty.\nFor their part, liberals believe in nothing other than abstractions like universalism, social justice, and the environment. No great civilization has ever prospered by believing that it is just average or that it should redistribute the results of its success to those who are too weak or too corrupt to achieve anything. Democrats may well continue on their faithless way, but America, I believe, will not be joining them.\nJeffrey Folks is the author of many books and articles on American culture including Heartland of the Imagination (2011).","url":"https://www.americanthinker.com/articles/2015/11/liberals_not_loyal_to_anything.html"}
