{"authors":["Rachel Eddie For Daily Mail Australia"],"date_download":"2018-10-22 22:43:46","date_modify":"2018-10-22 22:43:46","date_publish":"2017-04-26 05:38:44","description":"Liberal MPs in Victoria have attacked their colleague and new mother-of-two Kelly O'Dwyer for 'holding her baby like a gypsy' to 'steal' superannuation, according to claims.","filename":"data/vaneerConsumption/LiberalVICMPsKellyODwyersuffersracistattack.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/05/3F9C62DF00000578-0-image-a-95_1493181011768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446216_Liberal-VIC-MPs-Kelly-O-Dwyer-gypsy-baby-superannuation_1540248226.html","title":"Liberal VIC MPs Kelly O'Dwyer suffers racist attack","title_page":"Liberal VIC MPs Kelly O'Dwyer suffers racist attack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Liberal MPs have made vile and racist attacks on their colleague and new mother-of-two Kelly O'Dwyer for 'holding her baby like a gypsy' to 'steal' superannuation, according to claims.\nThe member for Higgins in Melbourne's inner south-east is on maternity leave, two weeks after giving birth to her son, Edward.\nMs O'Dwyer, Minister for Revenue and Financial Services, was behind superannuation reforms which add a tax to wealthy workers.\nSky News political reporter Samantha Maiden claims Liberal MPs in Victoria have attacked Ms O'Dwyer for 'holding her baby like a gypsy' to 'steal' super.\n'There was the suggestion in Victoria that some of her Liberal Party critics said of Kelly O'Dwyer that she, quote, \"holds her baby like a gypsy\",' Ms Maiden said.\n'The suggestion was that gypsies in Europe hold their babies and then steal your wallet, she's going to steal your super.'\nScroll down for video\nLiberal MPs in Victoria have reportedly attacked Kelly O'Dwyer and said she 'holds her baby like a gypsy' to distract people while she 'steals' superannuation (Ms O'Dwyer is pictured with her newborn baby boy, Edward)\nMs Maiden described the comments as 'disgusting skulduggery'.\nThe word 'gypsy' is a racial slur on Romani or Roma people, an ethnic group of nomadic people in Europe.\nMs O'Dwyer is one of five women in Malcolm Turnbull's cabinet.\nShe was behind superannuation reforms which passed in November.\nThe reforms put a 15 per cent tax on earnings for those with more than $1.5 million superannuation.\nThe changes have angered wealthy voters, who are behind a move to push Ms O'Dwyer out, prompting rumours Peta Credlin – the former chief of staff to former Prime Minister Tony Abbott – would challenge for the seat.\nMs O'Dwyer is pictured while pregnant with Prime Minister Malcolm Turnbull\nMs O'Dwyer's baby boy Edward is pictured, after she gave birth to him about two weeks ago\nMr Turnbull is pictured with his women cabinet ministers in September 2015, including Ms O'Dwyer holding her baby daughter Olivia\nMs Credlin said she has been approached to run for parliament but is not interested.\nShe dismissed rumours she was contemplating a challenge to Ms O'Dwyer.\n'The thought of going back into politics at the moment is about as appealing as chewing glass,' Ms Credlin wrote in The Australian on Tuesday, adding she'd 'often' been approached to run.\nSuggestions she was part of a plot by disgruntled locals to challenge Ms O'Dwyer for preselection in the Victorian seat of Higgins were 'complete, utter fake news', she said.\nSpecial Minister of State Scott Ryan told Sky News it was 'appalling' Ms O'Dwyer has been attacked shortly after giving birth.\nKelly O'Dwyer is pictured with Prime Minister Malcolm Turnbull before she gave birth to her newborn son\nPeta Credlin (left) dismissed rumours she was contemplating a challenge to Ms O'Dwyer (right)\n'She was responsible, along with the whole government, for a very difficult set of policies that brought equity back to superannuation and that ensured we can bring our budget back into balance,' he said.\nJack Hammond QC, a barrister who lives in Ms O'Dwyer's seat, set up the Save Our Super group following the reforms. It is not suggested Mr Hammond made the gypsy claims.\nHe rejected the timing was related to Ms O'Dwyer's maternity leave.\n'It's a complete, if you pardon the pun, misconception. It's got nothing to do with her being on maternity leave or otherwise,' Mr Hammond told ABC.\n'They gave birth to an appalling policy which is affecting thousands of Australians, not only now but in the future. They're the people who they should be thinking about.'\nMs O'Dwyer and her first child Olivia are pictured with Mr Turnbull in July last year\nMember for Higgins Kelly O'Dwyer is pictured with her first child, Olivia, in July 2016\nGreens senator Larissa Waters criticised the Liberal Party plotters for pressuring Ms O'Dwyer shortly after giving birth.\n'Remember more than half of all working mums say they have been discriminated against because they have kids to look after,' Ms Waters wrote on Twitter.\nMs Dwyer gave birth to her son Edward shortly before Easter.\n'He's arrived. Welcome to the world Edward!' she posted to Facebook shortly after the baby boy's birth.\nMs O'Dwyer also has a 22-month-old daughter, Olivia, to her husband Jon Mant.\nFinance Minister Mathias Cormann is acting in her portfolio while she is on maternity leave for six weeks.\nDaily Mail Australia has contacted Ms O'Dwyer's office for comment.","url":"https://www.dailymail.co.uk/news/article-4446216/Liberal-VIC-MPs-Kelly-O-Dwyer-gypsy-baby-superannuation.html"}
