{"authors":["John Hayward"],"date_download":"2018-10-30 18:50:41","date_modify":"2018-10-30 18:50:41","date_publish":"2015-03-06 20:56:24","description":"Liberals aren't going to let facts slow their fund raising efforts. They're still doggedly trying to raise money with debunked global-warming mythology. |","filename":"data/vaneerConsumption/LiberalsStillTryingToRaiseFundsWithDebunkedGlobalWarmingMythology.json","image_url":"https://media.breitbart.com/media/2015/03/climate-change-activist-polar-bear-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_06__1540925441.html","title":"Liberals Still Trying To Raise Funds With Debunked Global Warming Mythology","title_page":"Liberals Still Trying To Raise Funds With Debunked Global Warming Mythology | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In the middle of the Left’s big witch hunt against climate-change “skeptics” whose work is supposedly invalidated by tenuous financial connections to the fossil-fuel industry – facts and data matter less than where your money comes from, because that’s how SCIENCE! works – liberals are still doggedly trying to raise money with debunked global-warming mythology.\nThe truth is that the big money is in Big Climate, everywhere from billion-dollar crony-capitalist business models that profit from government regulations imposed in the name of global warming, to raising funds from people who don’t know any better by telling them the Angry Sky Gods will smite them with hurricanes unless they pay up.\nThe latest example is a fundraising letter from Obama For America… no, wait, I’m sorry, they’re “Organizing for Action” now, certified non-partisan by our good friends at the IRS even though Barack Obama still ostensibly signs their fundraising letters… which invites donors to sign up for the posse they’re organizing to gang-muzzle “climate change deniers.” Modern “liberalism,” you see, is all about suppressing dissent and treating the resulting silence as “consensus.”\nFriend — When it comes to fighting climate change, the single biggest obstacle we face isn’t scientific or economic. It’s political. Right now, in Congress and across the country, too many of our elected officials still publicly deny the science of climate change. That needs to change. Americans across the country are standing up for science — OFA is building a team right now to take the fight to climate change deniers. Every year, the effects of climate change are felt in more of our communities — consider the consequences of extreme weather like historic droughts and record-breaking storms. It jeopardizes the future we’ll leave for our children. This shouldn’t be a controversial opinion.\nIt’s not “controversial” – it’s been thoroughly discredited. Extreme weather is not increasing, and it has nothing to do with man-made “climate change,” which hasn’t been happening for almost 20 years. The debunking came not from a heretical “denier” scientist who let an oil-company representative pay for his lunch 20 years ago, but from the National Oceanic and Atmospheric Administration, as James Taylor explained at Forbes in October:\nAccording to NOAA’s new publication, Explaining Extremes of 2013 from a Climate Perspective, there is no discernible connection between global warming and 2013 extreme weather events such as the California drought, Colorado floods, the UK’s exceptionally cold spring, a South Dakota blizzard, Central Europe floods, a northwestern Europe cyclone, and exceptional snowfall in Europe’s Pyrenees Mountains. The California drought provides a good example of global warming activists making false and irresponsible claims regarding global warming to deliberately mislead people who aren’t familiar with scientific studies and evidence. The liberal Center for American Progress and its media allies such as the Washington Post, San Jose Mercury News, Associated Press, and others have all published stories claiming global warming caused or worsened the ongoing California drought. Scientists, however, say just the opposite. “[F]or the California drought, which was investigated by three teams from the United States, human factors were found not to have influenced the lack of rainfall,” NOAA reported in an accompanying press release. Adding additional emphasis to the NOAA publication’s findings, scientists reported in the peer-reviewed Proceedings of the National Academy of Sciences that natural factors such as ocean current cycles and varying wind patterns caused most of the warming along the U.S. West Coast since 1900.\nTaylor wryly noted that anti-science hysterics including Barack Obama and Secretary of State John Kerry kept repeating the debunked claim that global warming caused the California drought, “all the while claiming people who disagree with them are members of the Flat Earth Society.” Here we are, six months later, and they’re still trying to squeeze money out of their gullible supporters with the same old fairy tales.\nFor extra added fun, there is a substantial body of thought that if global warming ever does start happening again, it would actually reduce the occurrence of intense storms, by increasing the amount of water vapor in the atmosphere. Also, strong storms are caused by sharp temperature differentials, and a generally warming globe would tend to reduce the occurrence of such clashes between warm and cold air masses.\nIt’s an interesting theory – unless, of course, you’re a pack of greedy political operators looking to terrorize unwitting dupes into giving you money. In that case, there isn’t much room for nuance or elaborate discussion of complex scientific theories. You just want them to think they’ll die unless they give you cash.\nAlso debunked: the “97 percent consensus” canard used by the Church of Global Warming to convince the gullible that virtually no one in the scientific community disagrees with their groupthink. (Because that’s also how SCIENCE! works – if a lot of people intensely hold a belief unsupported by data, it magically becomes true.) OFA tries that one, of course, because it knows its marks love having their intellectual vanity flattered – or, I think increasingly in the bitter twilight of the mentally exhausted Left, they’re hungry for reassurance that the people they hate are stupid.\n“We need to listen to our friends at NASA and the 97 percent of climate scientists who agree that climate change is real, man-made, and happening right now. Now is the time for serious action, not excuses or outright denial,” claims the OFA fundraising letter.\nThat much-repeated statistic is not remotely true, and never has been. It’s a paperwork trick performed by a couple of activists using ridiculously sloppy survey methodology. They took two extremely broad propositions – carbon dioxide is a “greenhouse gas,” and human activity has warmed the planet to some extent – tallied up the papers in their survey sample that agreed with these propositions to even the slightest degree, and manufactured the “97 percent consensus” factoid. With these methods, even papers sharply skeptical of global-warming mythology – the work of scientists the cult loves to smear as the equivalent of Holocaust deniers – could be counted as affirmative parts of the “consensus.” Many scientists dragged into this “consensus” have objected to their inclusion in the total.\nThe funny thing about the “climate change consensus” bunkum is that it wasn’t good enough for power-hungry politicians as it was, so they had to keep embellishing it. As Andrew Montford noted in his debunking paper, they have a tendency to pile on additional claims not made by the paper their 97 percent claim is based upon, such as Obama’s claim that “Ninety-seven percent of scientists agree: climate change is real, man-made, and dangerous.” The paper never tries to claim that the mythical “consensus” believes climate change is “dangerous,” or that it’s primarily due to human activity.\n(I wonder if they got burned by that claim of Obama’s and modified his words to the “real, man-made, and happening right now” formulation in the OFA email. That’s not true either – it’s not happening right now, to the extreme consternation of the global warming cult, and the opportunistic politicians who mine it for power and money.)\nThe public-relations wing of Big Climate is entirely based on the combination of manufactured hysteria and tribal politics exemplified by the OFA letter, with the latter becoming an increasingly large part of its appeal as a shower of inconvenient data douses the hysteria – give us money or else people you severely dislike could win some political fights. That’s also why the effort is shifting so decisively into jackboot tactics to intimidate “skeptics” and “deniers” into silence.\nOne of the targets of Democrat Rep. Raul Grijalva’s witch hunt, Dr. Roger Pielke Jr. of the University of Colorado, is noted for his skepticism of the “global warming causes hurricanes and droughts” alarmism OFA peddles in its letter. Another, Steven Hayward (no relation) writes at the Powerline blog that he suspects he was targeted because he has pointed out that meeting the emissions targets favored by climate-change activists would blow the United States back to 1910 or 1905 in terms of hydrocarbon energy use. (He also has some observations about the true origins of Grijalva’s witch hunt that are well worth reading.) It’s no coincidence that those who challenge the most spectacular, fear-inducing, tribally satisfying, and profitable appeals of Big Climate will be silenced first.","url":"https://www.breitbart.com/politics/2015/03/06/liberals-still-trying-to-raise-funds-with-debunked-global-warming-mythology/"}
