{"authors":["Alex Swoyer"],"date_download":"2018-10-30 19:41:20","date_modify":"2018-10-30 19:41:20","date_publish":"2016-01-18 18:21:55","description":"Liberty University president Jerry Falwell, Jr. introduced GOP frontrunner Donald Trump to thousands of people gathered to listen to him at his campaign rally at Liberty University in Virginia on Monday and said, “I see a lot of parallels between my father and Donald Trump.” |","filename":"data/vaneerConsumption/LibertyUniversityPresidentJerryFalwellJrALotofParallelsBetweenMyFatherandDonaldTrump.json","image_url":"https://media.breitbart.com/media/2016/01/Trump-L-Jerry-Fallwell-Sr.-AP-Photos.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_18__1540928480.html","title":"Liberty University President Jerry Falwell, Jr: ‘A Lot of Parallels’ Between My Father and Donald Trump","title_page":"Liberty University President Jerry Falwell, Jr: ‘A Lot of Parallels’ Between My Father and Donald Trump | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Liberty University president Jerry Falwell, Jr. introduced GOP frontrunner Donald Trump to thousands of people gathered to listen to him at his campaign rally at Liberty University in Virginia on Monday and said, “I see a lot of parallels between my father and Donald Trump.”\nHe described Trump as “one of the greatest visionairies of our time” and praised him for several good deeds Trump has done, such as donating 100,000 dollars to a friend who leads a ministry and paying off a couple’s mortgage.\nFalwell also told the audience that Trump was the only candidate who walked down off the stage after the more-than-two-hour GOP primary debate to greet the crowd.\n“I’ve seen first hand that his staff loves him and is loyal to him,” Falwell said, adding that Trump “lives a life of loving and helping others as Jesus taught in the great commandment.”\nFalwell said his father was criticized for supporting Ronald Reagan because Reagan was from Hollywood and not a Sunday school teacher. “I see a lot of parallels between my father and Donald Trump,” he added.\n“He honors his fiduciary responsibilities…he speaks the truth publically even if it is uncomfortable for people to hear,” Falwell said of Trump, adding that he has “stunned the political world.”\n“Donald Trump is a breath of fresh air in a nation where the political establishment from both parties has betrayed their constituencies,” Falwell said, adding that Trump is the only candidate who can claim he’s “not a puppet on a string,” while the wealthy campaign donors are the puppet masters.\nFalwell said it would be “wonderful” for someone to be president who refuses contributions and has built a business from scratch.\n“It is not our elected leaders that make our country great,” Falwell said, explaining that it’s the citizens and the private sector.\n“I believe that the polls are indicating to us now that the American public is finally ready to elect a candidate who is not a career politician,” but who has succeeded in real life, Falwell concluded before introducing Trump to the crowd.\nTrump took the stage and said, “To be compared to his father just a little bit is really an honor for me, so I want to thank Jerry for saying that.”\n“I said, that’s the best compliment of all,” Trump added.","url":"https://www.breitbart.com/politics/2016/01/18/liberty-university-president-jerry-falwell-jr-a-lot-of-parallels-between-father-and-donald-trump/"}
