{"authors":[],"date_download":"2018-10-30 01:10:31","date_modify":"2018-10-30 01:10:31","date_publish":"2015-11-28 00:00:00","description":null,"filename":"data/vaneerConsumption/LiberalismmeetsitsWaterloo.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_11_liberalism_meets_its_waterloo_1540861831.html","title":"Liberalism meets its Waterloo","title_page":"Liberalism meets its Waterloo","title_rss":"NULL","source_domain":"americanthinker.com","text":"“A liberal is somebody who is so open-minded that he won’t take his own side in a fight.”\nAnd so it is proving. The only problem with Obama being unable to take his own side in a fight is that it is our side as well. And the rest of us are not ready to go gentle – and take our families – into that beheading good night.\nWhat’s going on? Liberalism is the philosophy of giving away that which has been built by its forebears. To liberals, defending themselves, their society, their institutions, their customs, their culture is anathema because that would offend the attacker! And they can’t have that! Not giving offense is liberalism’s highest value.\nThe people who built and/or are a part of what is being attacked don’t count. Their sacrifice, their achievement in having created what is being attacked make them privileged in the liberal mind and therefore their opinion, their very existence, is invalid.\nIf Obama were to stand in front of Congress and call for unconditional surrender of our enemy – ISIS – he would be validating all that he hates: the history of America as run by dead white men. Where would that leave him as the avatar of retribution on America for her sins, the very reason he is president?\nObama sees Islam as a culture superior to our Judeo-Christian one – that is to say to the one that he is leading and is sworn to defend. He cannot bring himself to see jihadi Islam – ISIS – as an enemy, even though there has perhaps never been one so stark.\nLiberalism cannot defend itself, or us, because doing so would invalidate, would evaporate, the mirage that is the world that it has constructed for itself. Since liberalism regards all other cultures as superior to its own, if one of those cultures is a ruthless, relentless warrior culture that cares only for victory and dominance, liberalism has no vocabulary, no thought process, no sense of self-preservation with which to arm itself against it. It cannot defend itself against barbarism because it believes that the barbarians are right.\nThat why ISIS is pursuing us – and Europe – so ruthlessly even though it knows we are more powerful that it is. We are the Eloi (look it up), so refined in our sensibilities that the only historic role we have left is to commit suicide. It is that attitude that also pervades the administrations of our universities, who are surrendering to barbarism on their campuses. Liberalism is oblivion.\nExcept…Donald Trump has picked up the trampled flag and raised it to the top of the flagpole. Those dust clouds you see out there? They are the American public, from every corner of the country, from every race, from every part of society, riding to the colors.","url":"https://www.americanthinker.com/blog/2015/11/liberalism_meets_its_waterloo.html"}
