{"authors":["Flora Drury For Mailonline"],"date_download":"2018-10-23 04:01:55","date_modify":"2018-10-23 04:01:55","date_publish":"2016-01-29 19:31:41","description":"The leaders are said to have been picked off one-by-one over the course of 10 days in Sirte, the Libyan coastal city where Muammar Gaddaffi was born, which the militants took control of last year.","filename":"data/vaneerConsumption/LibyanISISchiefslivinginfearofmysterysniperafter3menareassassinated.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/30B4DB1D00000578-0-image-a-17_1454095771224.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423340_Libyan-ISIS-chiefs-living-fear-mystery-sniper-three-terror-group-s-men-assassinated-long-range-marksman_1540267315.html","title":"Libyan ISIS chiefs living in fear of ‘mystery sniper’ after 3 men are assassinated","title_page":"Libyan ISIS chiefs living in fear of ‘mystery sniper’ after 3 men are assassinated | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"ISIS chiefs are living in fear of a mystery sniper after it was rumoured three of the evil terror group's leaders had been assassinated within 10 days of each other by a long-range marksman.\nThe leaders are said to have been picked off one-by-one in Sirte, the Libyan coastal city where Muammar Gaddaffi was born, which the militants took control of last year.\nAccording to unconfirmed social media reports, ISIS fighters are now sweeping the city for the man ordinary Libyans are said to be dubbing 'Daesh hunter'.\nScroll down for video\nThree ISIS leaders have been picked off by an unknown gunman in the Libyan city of Sirte, pictured in 2011, in just 10 days, according to social media - with the lone assassin being dubbed 'Daaesh hunter' in the press\nISIS fighters are now sweeping the city, which they took control of last year, in an attempt to catch the gunman\nThe first ISIS leader to lose his life was Hamad Abdel Hady, a Sudanese national who was killed on January 13, according to Libya Prospect.\nHe is said to have been an official in the sharia court, handing out ISIS' warped and violent sense of justice.\nAbu Mohammed Dernawi was killed on January 19 near his home in the city, according to some reports.\nThe most recent death is rumoured to be that of Abdullah Hamad al Ansari, a high-up commander from southern Libya, who was shot dead as he left the mosque on January 23.\nHowever, this may not be the start of such a campaign against ISIS fighters in the city.\nJournalist Daniele Raineri pointed out a similar assassination took place in July, when an ISIS preacher was shot dead.\nThe terroro group reportedly has up to 3,000 militants in Sirte. Above, a man is shot for 'cursing god'\nThousands of people have fled ISIS rule Sirte to Misrata Above, the men are flogged for drinking alcohol\nThe reporter also urges caution in believing what could be nothing more than 'wild rumours' on his Twitter account.\nEven so, social media is ablaze with reports of rumours of the sniper, who has become somewhat of a hero to those living under the control of the evil terror group, according to the Libya Herald.\nThe Islamists are not popular in the city, and days after the first assassination a 'photo report' emerged, showing the terror group executing at least three men and whipped another for drinking alcohol.\nISIS reportedly has 3,000 fighters in Sirte and has imposed the strict rules familiar with residents in their defacto capital in Raqqa, Syria.","url":"https://www.dailymail.co.uk/news/article-3423340/Libyan-ISIS-chiefs-living-fear-mystery-sniper-three-terror-group-s-men-assassinated-long-range-marksman.html"}
