{"authors":["Amie Gordon For Mailonline"],"date_download":"2018-10-23 02:37:00","date_modify":"2018-10-23 02:37:00","date_publish":"2016-01-28 17:26:28","description":"Horrified shopper Noeleen O'Reilly, from Kensington, claims she found 'faeces' in a bag of Lidl sprouts. Mrs O'Reilly said Lidl 'failed to take her seriously' after she made the purchase in a London store.","filename":"data/vaneerConsumption/LidlshopperhorrifiedtofindFAECESinabagofsprouts.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30ACA38100000578-0-image-a-75_1454002098628.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420973_Shopper-horrified-FAECES-bag-sprouts-bought-Lidl_1540262220.html","title":"Lidl shopper ‘horrified to find FAECES in a bag of sprouts’","title_page":"Lidl shopper ‘horrified to find FAECES in a bag of sprouts’  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A horrified shopper has described her distress after she found what she claimed to be faeces in a bag of Lidl sprouts.\nNoeleen O'Reilly, from Kensington, told the Evening Standard she purchased the vegetables at Lidl - but was shocked to find the 'foreign body' in the product when she got home.\nAfter sending a photograph of the flower sprouts and returning the packaging, Lidl said the 'organic matter' was in fact a decomposed potato and offered her a £10 voucher - but Mrs O'Reilly remains unconvinced.\nThe offending item: Noeleen O'Reilly, from Kensington, claims she found this 'faeces' in the bag of Lidl sprouts\nWash before use: The customer has demanded an apology from the store, asking them to phone her personally\nShe says Lidl have failed to take her seriously, telling the Evening Standard: 'I couldn't eat that evening, I felt sick. It really, really upset me. If that had of entered my body I could have been extremely unwell.\n'I want someone to phone me personally and apologise over what has happened.'\nMrs O'Reilly said she purchased the bag of flower sprouts on January 8 in Lidl in Mile End.\nWHAT IS A FLOWER SPROUT? A superfood which is a cross between brussels sprouts and kale, the flower sprout has seen a surge in sales in recent years. With its green leaves streaked with purple, the flower sprout combines powerful antioxidants and high levels of vitamins. It was developed more than a decade ago and is now stocked in leading supermarkets including Waitrose, M&S, Asda, Sainsburys and the Co-op.\nA spokesman for Lidl said: 'We were very sorry to hear that this particular product did not meet the high standards that both we and our customers expect.\n'We take matters such as these extremely seriously, and as soon as the customer got in touch our Quality Assurance team immediately launched an investigation in conjunction with our supplier.\n'We work with highly reputable suppliers who have thorough procedures in place to ensure that issues such as these are investigated to an appropriate level.\n'Standard procedures include both human sense assessments and laboratory practices where necessary.\n'On this occasion it was clear from the first stage of the investigation that the evidence received was organic and field originated.\n'This was further substantiated by the presence of three sprouts which commonly protrude from seeding potatoes.\n'We would like to reassure customers that this is an isolated incident and apologise sincerely for any distress caused.'","url":"https://www.dailymail.co.uk/news/article-3420973/Shopper-horrified-FAECES-bag-sprouts-bought-Lidl.html"}
