{"authors":["Bianca London For Mailonline"],"date_download":"2018-10-23 00:08:59","date_modify":"2018-10-23 00:08:59","date_publish":"2016-01-29 12:47:13","description":"The store has unveiled its Esmara Spring collection, which hits stores on February 4, and say 'you don’t have to pay catwalk prices to dress to impress.'","filename":"data/vaneerConsumption/Lidllaunchesmaritimechicclothescollectionandnothingismorethan699.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B238D100000578-0-image-a-33_1454070998574.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3422679_Would-wear-Lidl-s-thrifty-new-range-Budget-store-launches-maritime-chic-collection-6-99_1540253339.html","title":"Lidl launches 'maritime chic' clothes collection and nothing is more than £6.99","title_page":"Lidl launches 'maritime chic' clothes collection and nothing is more than £6.99 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"With fashion month kicking off across the globe, high-end designers are sending covetable collections down the runways.\nBut if you can't afford the hefty price tag that comes with your favourite designer's wares, Lidl is hoping to offer thrifty shoppers something a little more affordable.\nThe German supermarket giant, which has long attempted to lure bargain-conscious shoppers away from the bigger supermarkets with cheap groceries and alcohol, recently entered the worlds of fashion and beauty - and things are going from strength to strength.\nLidl is hoping to offer thrifty shoppers something a little more affordable in the form of its new 'maritime chic' range of casual tops, blouses and leggings\nThe store has unveiled its Esmara Spring collection, which hits stores on February 4, and say 'you don’t have to pay catwalk prices to dress to impress.'\nFrom soft jumpers and shift dresses, to chiffon-style blouses and cotton tops, the spring collection promises to have everything needed to refresh outfits for the new year.\nDrawing inspiration from the coast, this collection, which is dubbed 'maritime chic', focuses on classic primary and monochrome colours and the store say it will slip seamlessly into your existing wardrobe.\nThe store has unveiled its Esmara Spring collection, which hits stores on February 4, lets you look on trend for less, with tops costing £6.99 and leggings costing £2.99\nFrom soft jumpers and £6.99 shift dresses, right, to chiffon-style blouses and cotton tops, left, the spring collection promises to have everything needed to refresh outfits for the new year for less\nThe nautical themed range focuses on classic primary and monochrome colours and the store say it will slip seamlessly into your existing wardrobe\nThere's shift dresses for £6.99, which the store say are perfect for both work and play, and leggings are £2.99 and hailed by the brand as 'the ultimate style solution' that pair perfectly with the long-sleeved causal tops (£6.99, 2 pack).\nThere's also blouses in a range of colours for £4.99 and foldable ballerina pumps, which will set you back £4.99.\n'These folding versions are super convenient to carry in handbags and can take the pain out of partying, travelling or commuting,' say the brand.\nThe cheap and chic new range comes just weeks after Lidl launched its own version of the £80 Nutribullet for £29.99.\nThe store this week unveiled 100 per cent Raw Organic Extra Virgin Coconut Oil to its own-brand Deluxe range for £2.99 (300ml).\nJoshua Smith, Lidl Buyer said: 'Coconut oil is a topical, on-trend superfood, which consumers are demanding more and more. It is an extremely versatile product with a number of health benefits and we are pleased to annouce that we will be selling a 100% Raw Organic Coconut Oil under our Deluxe brand.\n'As this can be used in a multitude of ways we hope that it will aid our customers who are looking to get 2016 off to a healthy start.'\nThe Esmara jumpers cost £6.99, left, whilst simple vests will set you back £4.99, right","url":"https://www.dailymail.co.uk/femail/article-3422679/Would-wear-Lidl-s-thrifty-new-range-Budget-store-launches-maritime-chic-collection-6-99.html"}
