{"authors":["Ron Elving"],"date_download":"2018-10-22 21:18:00","date_modify":"2018-10-22 21:18:00","date_publish":"2015-02-03 00:00:00","description":"The 114th Congress so far has displayed all the dominant traits inherited from its parents — the 113th and 112th Congresses. It's all about honoring past promises and settling old scores.","filename":"data/vaneerConsumption/LifeInTheNewWashingtonInYourFaceNoInYOURFace.json","image_url":"https://media.npr.org/assets/img/2015/02/03/ap238841242488_wide-beb75de8210e7843f06cd908348533e7a67dd19e.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_itsallpolitics_2015_02_03_382557922_life-in-the-new-washington-in-your-face-no-in-your-face_1540243080.html","title":"Life In The 'New' Washington: In Your Face! No, In YOUR Face!","title_page":"Life In The 'New' Washington: In Your Face! No, In YOUR Face! : It's All Politics : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Life In The 'New' Washington: In Your Face! No, In YOUR Face!\nEnlarge this image toggle caption Evan Vucci/AP Evan Vucci/AP\nPresident Obama entertained a group of Americans on Tuesday in the intimate Roosevelt Room at the White House, thanking them for their written testimonials to the benefits of his Affordable Care Act. A few hours later, the House of Representatives voted to repeal the ACA in its entirety.\nNothing will change as a result of either event. But this was no mere coincidence of timing. It was one more example of how much time Washington spends on \"in your face!\" demonstrations of political posturing. The expanded House Republican majority includes many new members who promised their voters they would repeal Obamacare. Today they get their chance to vote that way, and the president responds with a facial expression of his own.\nIt was another day of conflict much like the day before, when the president released his budget, making no notable concessions to Republican rule on Capitol Hill, and when GOP leaders promptly declared the document dead on delivery.\nSo if you were among those who found hope in the coming of a new year and a new lineup in Washington, our condolences.\nThe two power centers of the capital city and the two different parties that control them are as much at odds as ever — if not more so.\nWas there ever a chance of the parties setting aside their weapons and war paint and working toward some sort of arrangement?\nThe 114th Congress in its first few weeks has instead displayed all the dominant traits it inherited from its parents — the 113th and 112th. And the president has responded in kind.\nIt's been all \"in your face!\" from the Congress to the president, and vice versa.\nThe main reason is that the campaign mode of 2014 has already begat the campaign mode of 2016. Every event and issue is weighed on the scales of electoral advantage.\nCandidates for all levels of elected office are being recruited and money raised. It is as though the election settled nothing and the next campaign is underway.\nSo sitting down to lengthy negotiations over details and costs is simply not a compelling prospect. It makes more sense to keep the partisan blood up and the bricks and bottles flying.\nThe Republicans came out of the box pushing a pipeline project, a sanctions bill against Iran and a ban on abortion after 20 weeks. The president had promised to veto all three. If negotiations are underway to produce a compromise on any of these bills, they are a well-kept secret.\nAs for the White House, it has been firing off veto threats faster than at any time in recent memory — nine so far — after having vetoed only three in Obama's first six years. That is one measure of how broadly the battle lines have been drawn.\nMoreover, the president is issuing these veto threats directly and personally, as he did in the State of the Union address. This leaves little room for later negotiation and compromise. The president seems less interested in driving a compromise via the veto than he is in the confrontation value itself.\nOne reason the president's budget has no future as a guide to Congress is that its tax changes are anathema to GOP legislators, including tax increases on wealth transfer, big investors and the Wall Street banks. Republicans bristle at his suggestion that these moves are meant to finance tax cuts for working families and savers. They say the president wants more money for wasteful Washington to spend.\nNot only did the White House expect this reaction, it clearly relishes it. The president and his team are looking beyond their present predicaments, preparing the way for the Democratic campaign of 2016 to focus on \"middle class economics.\"\nJust as important, the president seems less concerned than ever with passing bills and dealing with the present Congress. At this point, and under these circumstances, presidents tend to think of how they and their administration will be remembered in a decade from now — or by future generations.\nHere is the problem with expecting Congress to be better right now. It was always an illusion to think the new Republican majority would control the Senate and establish complete GOP hegemony on the Hill. No one truly controls the Senate unless he has 60 votes to shut off debate and seven more to override a presidential veto.\nSo the new 54-vote Republican majority in the Senate cannot steamroll the president. Then why doesn't it try to negotiate with him? To some extent, the GOP senators have and will try to do this on trade and some aspects of policy in the war against terrorism. But Senate Republicans remain beholden to the dictates of the House and the demands of the party's voting base.\nThat is to say, having the Senate in Republican hands only makes the Republican House more determined to pursue a partisan course and confront President Obama.\nAnd the newly Republican Senate also means that president no longer worries about putting vulnerable Democratic senators at risk in red states. That dynamic, so powerful in the past three election cycles, has now run its course.\nThe president feels he has a freer hand to pursue his priorities, not the opposite. And he has seen his approval ratings rise nationally as well as within Democratic ranks, since he began doing so.\nTherefore, given the Republicans' fresh confidence that they and not the president speak for the voters, the collision course is sure — from both directions.\nConsider these examples from the opening weeks.\nExhibit A — approving the Keystone XL pipeline. This leftover from previous sessions will go to the president's desk early in February, having won approval in both House and Senate. But the Senate is at least five votes short of the override margin, and the House is nowhere near the two-thirds it would need.\nExhibit B — defying the president on immigration policy. House Republicans passed a version of the spending bill for Homeland Security that is not likely to clear the Senate. That is because it denies the president's power to defer deportation for up to 4 million people in the country unlawfully. If it somehow got the votes to close off debate in the Senate, it would still lack the votes to override a promised veto.\nExhibit C — enacting new sanctions on Iran. Here the president himself has conceded that the chances of a deal with Iran to restrict that country's nuclear program are less than 50-50. But Congress wants to be on record as pressuring Teheran and taking a tougher stance than the president. This has led to an invitation to Netanyahu to speak just before his election, a species of endorsement in the eyes of many. The speech was arranged without input from the White House.\nExhibit D — grilling Loretta Lynch and entertaining her opponents despite the absence of any actual objection to her appointment as the new attorney general. Lynch is still not slated for a confirmation vote, although it is clear she will win committee approval. Her hearing was largely a two-day assault on the record of the current attorney general, Eric Holder. The furor over Holder seems to prompt the delay in Lynch's confirmation, even though every day Lynch waits is another day Holder remains in power.\nExhibit E — The House voted to repeal the Affordable Care Act in full and also plans to return to a bill banning abortions after 20 weeks. Although no one expects either measure to become law or come close to it, these issues are important to many who voted for Republican candidates in the 2014 election and expect campaign promises to be honored. So the new Congress is less about a new atmosphere than it is about honoring past promises and settling old scores.","url":"https://www.npr.org/sections/itsallpolitics/2015/02/03/382557922/life-in-the-new-washington-in-your-face-no-in-your-face"}
