{"authors":[],"date_download":"2018-10-23 01:08:29","date_modify":"2018-10-23 01:08:29","date_publish":"2014-12-07 00:00:00","description":"In China's capital city, even the humblest apartment can cost a fortune. But more affordable housing hides below the city's bustling streets, in tiny (and illegal) basements and bomb shelters.","filename":"data/vaneerConsumption/LifeInBeijingsUndergroundNPR.json","image_url":"https://media.npr.org/assets/img/2014/12/07/ahighres_00113373-1-1_wide-7dd20334ccf514aa4e91402a6eee19760375ff49.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=368760646_1540256909.html","title":"Life In Beijing's Underground : NPR","title_page":"'A Universe Beneath Our Feet': Life In Beijing's Underground : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ARUN RATH, HOST:\nMore than 21 million people live in Beijing, so even the tiniest apartments can cost a fortune. But there is an underground market. Literally, people are living underground. Below the city's bustling streets, bomb shelters and storage basements are turned into apartments. An estimated 1 million of Beijing's residents live underground. Annette Kim, an urbanization researcher at the University of Southern California, spent last year in China's capital city, studying Beijing's underground housing market.\nANNETTE KIM: Part of why there's so much underground space is because it's the official building code to continue to build bomb shelters and basements. That's a lot of new underground space that's increasing in supply all the time. They're everywhere.\nRATH: Kim says apartments go as deep as three stories below ground. Residents have communal bathrooms and shared kitchens, and the tiny, windowless rooms have just enough space to fit a bed.\nKIM: It's tight. But I also lived in Beijing for a year, and the city, in general, is tight. (Laughter).\nRATH: Living underground at about 70 bucks a month offers an affordable alternative, but there's a stigma to living in basements and bomb shelters. During her research, Kim interviewed residents above-ground about their neighbors directly below.\nKIM: They weren't sure who was down there. There is actually very little contact between above-ground and below-ground, and so there's this fear of security.\nRATH: She says the underground dwellers are mostly young migrants who moved from the countryside looking for work in the big city.\nKIM: They're all the service people in the city. They're your waitresses, store clerks, interior designers, tech workers who just can't afford a place in the city.\nRATH: Kim says there's a range of units from the dark and dingy to the neatly decorated. But it's rare to get a glimpse below. Property owners are strict about who they let in. That didn't stop Beijing-based photographer Chi Yin Sim.\nCHI YIN SIM: I started to try and find ways to get down there because I was fascinated by the fact that there was a universe beneath our feet.\nRATH: The first basement-dweller she met was a young woman, a pedicurist at a salon who lived with her boyfriend.\nSIM: I was just like, can I come and visit? And she was like, sure, come and visit us.\nRATH: In the photo, the couple sits on their bed, surrounded by clothes, boxes and a giant teddy bear - all two floors below a posh Beijing apartment complex. Sim's pictures reveal rooms that look like prison cells, personalized to varying degrees.\nSIM: The air's not so good. Ventilation is not so good. And the main complaint that people have is not that they can't see the sun. It's that it's very humid in the summer, so everything that they put out in their rooms gets a bit moldy 'cause it's just very damp and dank underground.\nRATH: Sim says many people simply adapt to the close quarters.\nSIM: At dinner time, you can hear people cooking. You can hear people chitchatting in the next room. You can hear people watching television. It's really not so bad. I mean, you're spending almost all your day at work anyway. You're coming back, and all you need is a clean and safe place to sleep in.\nRATH: She also met a number people who were too embarrassed to have their photo taken, especially since one Chinese newspaper referred to Beijing's underground residents as the Rat Tribe. It's especially difficult for the older residents - the ones who have been down there for years, says Annette Kim.\nKIM: They're hoping that their next generation, their children will be able to live above ground. It's this sense of longing and deferring a dream. And so it makes me wonder how long this dream can be deferred.\nRATH: Kim says housing laws changed in 2010, and living underground is now illegal. But she says it's still an active market. For hundreds of thousands of people, it's the only viable option for living in or under Beijing. To see more of Chi Yin Sim's amazing photos, check out our website, npr.org.\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=368760646"}
