{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 22:29:08","date_modify":"2018-10-30 22:29:08","date_publish":"2014-08-15 15:11:45","description":"If you've seen the trailers for Life After Beth, you know that Aubrey Plaza plays a zombie in the movie which she, co-star Dane DeHaan, and director Jeff Baena call a \"rom zom com dram.\" Get it? A romance zombie comedy drama? With the recent…","filename":"data/vaneerConsumption/LifeAfterBethStarAubreyPlazaSharesHerSecretsForBeingAZombie.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/65f400c9-6bf8-46a2-b944-cc49f0dabd61.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35917-life-after-beth-star-aubrey-plaza-shares-her-secrets-for-being-a-zombie_1540938548.html","title":"'Life After Beth' Star Aubrey Plaza Shares Her Secrets For Being A Zombie","title_page":"'Life After Beth' Star Aubrey Plaza Shares Her Secrets For Being A Zombie","title_rss":"NULL","source_domain":"bustle.com","text":"If you've seen the trailers for Life After Beth, you know that Aubrey Plaza plays a zombie in the movie which she, co-star Dane DeHaan, and director Jeff Baena call a \"rom zom com dram.\" Get it? A romance zombie comedy drama? With the recent onslaught of zombie movies and television shows (lookin' at you Zombie Sharks ) you might wonder how Plaza geared up to play an undead lady. She spoke about her zombification at the AOL Build Speakers Series.\n\"I would consider myself a method actor. And I killed myself and dug myself up,\" she says.\nYes, she's just as candid in real life as you'd think she'd be. The Parks and Rec star explains she prepped for the role just by interpreting it in her own style; an actor doesn't want to just copy what another actor has done. You gotta be your own original zombie!\n\"When I thought about how I was gonna play it, I kind of thought, maybe I should watch a million zombie movies, and you know, get into that mode. But then I also thought, maybe I shouldn't watch a million zombie movies because zombies aren't real, so every movie about a zombie is just someone's idea of what they think a zombie is.\"\nMark Davis/Getty Images Entertainment/Getty Images\nShe's not wrong.\n\"So I just.. wung it. Is that a phrase? Wanged it? Wanged it. I winged it. I just showed up and like... did weird things.\"\nApparently, Plaza's natural instincts meshed perfectly well with the script. In fact, she implies that she was born ready for this role.\n\"I also have [...] a history of having a fascination with demonic energies, so I have this demon voice and stuff just in my back pocket.\" Good to know. So if Parks and Rec has a zombie apocalypse, we know who'll be the last woman standing.\nAnd speaking of a zombie apocalypse, if there were to be one among the cast and crew of Life After Beth, and she had to sacrifice someone, who would she sacrifice from the cast?\n\"Um... I would kill Dane.\"\nLife After Beth arrives in theaters on Aug. 15.","url":"https://www.bustle.com/articles/35917-life-after-beth-star-aubrey-plaza-shares-her-secrets-for-being-a-zombie"}
