{"authors":["Breitbart News"],"date_download":"2018-10-30 19:51:57","date_modify":"2018-10-30 19:51:57","date_publish":"2016-12-02 21:46:49","description":"LifeNews.com reports on Kellogg's decision to pull ads from Breitbart News because Breitbart and our 45 million monthly readers don’t share the cereal giant’s “values.”","filename":"data/vaneerConsumption/LifeNewscomKelloggsPullsAdsfromProLifeBreitbartNews.json","image_url":"https://media.breitbart.com/media/2016/12/Special-K-Kelloggs-Kellogg-ProLife-Rally-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2016_12_02__1540929117.html","title":"LifeNews.com: Kellogg’s Pulls Ads from Pro-Life Breitbart News","title_page":"LifeNews.com: Kellogg’s Pulls Ads from Pro-Life Breitbart News","title_rss":"NULL","source_domain":"breitbart.com","text":"Steven Ertelt of the pro-life news site LifeNews.com reports on the Kellogg Company’s decision to pull ads from Breitbart News because Breitbart and our 45 million monthly readers don’t share the cereal giant’s “values.”\nFrom LifeNews.com:\nYesterday, Kellogg Co., which manufactures popular breakfast cereals and other products, decided to pull its advertising from Brietbart News, which reports conservative news — including pro-life news. The company claimed the web site’s conservative readers are not “aligned with our values as a company.”\n…\nBreitbart News Editor-in-Chief Alexander Marlow encouraged the boycott of Kellogg’s products, describing their war against Breitbart News as bigoted and anti-American: “Breitbart News is the largest platform for pro-family content anywhere on the Internet. We are fearless advocates for traditional American values, perhaps most important among them is freedom of speech, or our motto ‘more voices, not less.’ For Kellogg’s, an American brand, to blacklist Breitbart News in order to placate left-wing totalitarians is a disgraceful act of cowardice. They insult our incredibly diverse staff and spit in the face of our 45,000,000 highly engaged, highly perceptive, highly loyal readers, many of whom are Kellogg’s customers. Boycotting Breitbart News for presenting mainstream American ideas is an act of discrimination and intense prejudice. If you serve Kellogg’s products to your family, you are serving up bigotry at your breakfast table.”\nRead the rest here.","url":"https://www.breitbart.com/the-media/2016/12/02/lifenews-com-kelloggs-pulls-ads-pro-life-breitbart-news/"}
