{"authors":["Carly Goodman","Carly Goodman Is A Historian Of Immigration","American Foreign Relations. She Is A Mellon Acls Public Fellow","Communications Analyst At The American Friends Service Committee."],"date_download":"2018-10-21 03:29:35","date_modify":"2018-10-21 03:29:35","date_publish":"2018-07-02 10:01:17","description":"The power of protest.","filename":"data/vaneerConsumption/LikeDonaldTrumpRonaldReagantriedtokeepoutasylumseekersActiviststhwartedhim.json","image_url":"https://www.washingtonpost.com/resizer/XQSdHnv18R4LWlQ2B3kt767BTxk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QLHCXKITDM3OLE3UM5B45AE34M.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_made-by-history_wp_2018_07_02__1540092575.html","title":"Like Donald Trump, Ronald Reagan tried to keep out asylum seekers. Activists thwarted him.","title_page":"Like Donald Trump, Ronald Reagan tried to keep out asylum seekers. Activists thwarted him. - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Members of a caravan of Central Americans who spent weeks traveling across Mexico walk to the U.S. side of the border to ask authorities for asylum on April 29 in Tijuana. (David McNew/Getty Images)\nCarly Goodman is a historian of immigration and American foreign relations. She is a Mellon/ACLS Public Fellow and communications analyst at the American Friends Service Committee.\nThe Trump administration is working to make it impossible for people fleeing violence in Central America to gain asylum in the United States. If it succeeds, the family separations and family detentions we have already seen are only the beginning of the suffering, and even death, that will result from these brutal changes to U.S. immigration policy.\nThat the United States should be a haven for the persecuted is an old idea, one that has been made concrete through international agreements and domestic laws governing refugees since the end of World War II. Yet the country has not always lived up to these ideals, and ensuring that immigrants, refugees and asylum seekers are treated fairly and humanely has often been left to activists and other people of conscience. Indeed, when President Ronald Reagan attempted to deny asylum seekers in the 1980s, a movement formed to stop him, creating a model for activists today.\nLike President Trump, Reagan systematically denied asylum to people from El Salvador and Guatemala by refusing to consider those fleeing violence and arriving at the U.S.-Mexico border as refugees.\nTo do so, though, he had to disregard a recent change in U.S. policy. The Refugee Act of 1980 underscored the obligation of the United States to welcome refugees, bringing the country in line with international standards, specifically the 1951 U.N. Convention and the 1967 Protocol Relating to the Status of Refugees, which the United States had ratified in 1968.\nBefore 1980, the United States had frequently been a haven for people fleeing communist regimes; its refugee policy served Cold War foreign-policy aims, signaling to a global audience that it was more humane than repressive regimes. Resettling thousands of Hungarians fleeing political oppression behind the Iron Curtain in the 1950s, for example, the federal government smoothed the integration of these newcomers in U.S. communities, portraying them sympathetically as aspiring Americans.\nBut the Refugee Act adopted a less ideological definition of refugee. Instead of exclusively resettling people fleeing communism, the United States now defined a refugee as someone with a well-founded fear of persecution because of race, religion, nationality, membership in a social group or political opinion. Additionally, the Refugee Act provided a statutory right to asylum that meant people arriving at the border or already in the United States now had a right to claim asylum.\nThe passage of this law coincided with a growing number of people fleeing deadly violence in Central America, including from countries that the United States considered its allies. When Reagan took office, his administration classified Salvadorans arriving at the U.S.-Mexico border as “economic migrants,” not refugees. Why? Because economic suffering, unlike political persecution, was not considered a valid reason for seeking asylum under the law. This was rooted in the Cold War origins of the international norms governing refugee protection: People fleeing political violence were considered worthy of protection, while people whose social and economic rights were violated were not.\nBy characterizing asylum seekers as migrants, the government aimed to skirt its legal obligations to asylum seekers who didn’t serve its foreign-policy aims — and to bolster the U.S.-supported regime in El Salvador, which was fueling the violence so many thousands of people were fleeing. In addition, while the public had previously willingly accepted the resettlement of white, European refugees fleeing communism, the increasingly racist anti-immigrant politics of the 1980s framed the public’s understanding of these new asylum seekers. By portraying all migrants at the border as an economic threat — whether they were seeking asylum or not — the Reagan administration helped build support for increasingly militarized border policies and immigrant detention.\nJust like today, the government intimidated the people arriving at the border seeking asylum by coercing them to drop their claims and threatening to take away their children. People who did make asylum claims were denied overwhelmingly. Instead of finding safe haven, many asylum seekers were detained and deported back to violence in their home countries.\nBut the Reagan administration faced stiff resistance. Activists, people of faith and human rights lawyers were outraged at the violations they witnessed in the treatment of asylum seekers. People took the refugees into church sanctuaries to protect them from deportation and save their lives, creating a vast network — a sanctuary movement — that spread across the country in the 1980s. Even when the Reagan administration prosecuted sanctuary activists, communities continued to take vulnerable people into sanctuary.\nAnd their efforts paid off. Activists and policymakers worked throughout the decade to create temporary protected status for people who could not get a fair asylum hearing but who feared returning home to civil war and violence.\nHuman rights lawyers pushed to ensure that asylum seekers from places such as El Salvador could get a fair hearing of their claims. Lengthy litigation, including the landmark Orantes-Hernandez case, upheld certain rights of Salvadoran asylum seekers in immigration detention, and the American Baptist Churches v. Thornburgh settlement, known as the ABC cases, ensured that many of the people who’d been unfairly denied could present new asylum claims and receive a fair hearing.\nThrough tireless advocacy work through the 1980s, the public pushed the U.S. government to recognize the humanity of asylum seekers from Central America and the validity of their claims under the law, making asylum law more robust, humane and fair.\nPushing the United States to live up to its self-image as a haven to the persecuted was an ongoing, incomplete project, even before Trump. But today these hard-fought gains are under attack, and the challenges facing asylum seekers severe. As the administration floats its plans to further criminalize asylum seekers, it is critical that the public continue to voice its objections to this cruelty, through protest, calls to elected officials and constant litigation.\nThe public response in recent weeks to the Trump administration’s cruel treatment of asylum seekers, particularly people traveling with their children, has been massive. Advocates, activists and ordinary people are fighting back, calling for an end to the family-separation policy, family detention, and a system that cages children and treats immigrants like “animals.”\nEnsuring that the United States builds a fair and generous asylum system is critical. But we must also reject policies that criminalize migration more broadly, militarize our borders, fund the abuse of immigrants by Immigration and Customs Enforcement (ICE) and Customs and Border Protection (CBP), and treat both undocumented people and legal asylum seekers inhumanely. Only then can the United States begin to live up to its self-professed role as a beacon to the world’s huddled masses.","url":"https://www.washingtonpost.com/news/made-by-history/wp/2018/07/02/line-donald-trump-ronald-reagan-tried-to-keep-out-asylum-seekers-activists-thwarted-him/"}
