{"authors":[],"date_download":"2018-10-21 02:47:06","date_modify":"2018-10-21 02:47:06","date_publish":"2018-08-30 11:01:22","description":"Elizabeth Acevedo’s “The Poet X” is the first selection for the new monthly book club on @TheLilyNews.","filename":"data/vaneerConsumption/LilyLitClublaunchesonInstagram.json","image_url":"https://www.washingtonpost.com/resizer/rFQTFgstrNJ9lwZ-vmdXwX_nEEE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2QK37UEOIE7GRIYIZIEXQYBWII.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_08_30__1540090026.html","title":"Lily Lit Club launches on Instagram","title_page":"Lily Lit Club launches on Instagram - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"The Lily, a women-focused publication from The Washington Post, today launched Lily Lit Club, a new monthly book club that will highlight female authors and live on The Lily’s Instagram account, @TheLilyNews. Author Elizabeth Acevedo’s “The Poet X” is the first book club selection.\n“Team Lily is made up of avid readers and Lily Lit Club grew out of this interest in recommending and discussing books amongst ourselves,” said Amy King, editor-in-chief of The Lily. “Instagram, as a platform, is a natural fit that makes it easy for readers to participate in a variety of ways — from weighing in on discussion questions to sharing favorite excerpts. Our goal is to create an open environment for our followers where reading for pleasure is encouraged and where they can engage with fellow readers and authors.”\nEach month, editors will share a shortlist of options for the coming month and followers can vote to select the next book to be featured. Followers can engage with fellow Book Club members by sharing their answers to author-selected discussion questions, photos of themselves with the featured book and more by tagging #LilyLitClub on Instagram.\nAcevedo will be in discussion with Neema Roshania-Patel, deputy editor of The Lily, at the National Book Festival on Saturday, Sept 1 from 10 to 11 a.m. at the Walter E. Washington Convention Center in Washington, D.C.","url":"https://www.washingtonpost.com/pr/wp/2018/08/30/lily-lit-club-launches-on-instagram/"}
