{"authors":["Bobbie Whiteman For Dailymail.Com"],"date_download":"2018-10-22 23:01:51","date_modify":"2018-10-22 23:01:51","date_publish":"2017-03-10 01:53:28","description":"She's the face of Chanel No 5 and walked for brand designer Karl Lagerfeld's Spring/Summer show in Paris in January. But the 17-year-old was very low-key when she jetted out of Los Angeles on Thursday.","filename":"data/vaneerConsumption/LilyRoseDepptriestogounnoticedinahoodieatLAX.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1EFA6400000578-0-image-a-66_1489107549357.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299642_Lily-Rose-Depp-tries-unnoticed-hoodie-LAX_1540249311.html","title":"Lily-Rose Depp tries to go unnoticed in a hoodie at LAX","title_page":"Lily-Rose Depp tries to go unnoticed in a hoodie at LAX | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the face of Chanel No 5 and walked for brand designer Karl Lagerfeld's Spring/Summer haute couture show in Paris in January.\nBut Lily-Rose Depp kept her beautiful face undercover when she turned up at Los Angeles International Airport to catch a flight out of the city on Thursday.\nThe 17-year-old kept things simple in a black hoodie, matching sweat pants and sneakers.\nScroll down for video\nKeeping it low key: Lily-Rose Depp kept her beautiful face undercover when she turned up at Los Angeles International Airport to catch a flight out of the city on Thursday\nAnd she pulled the hood of her top up to hide her face and tresses and kept her eyes down as she walked across the concourse.\nIt's a far cry from the blush pink wedding dress that featured layers of ruffles that she modelled for Chanel just a few weeks earlier.\nThe teen, who is the daughter of Johnny Depp, 53, and his former long-time love Vanessa Paradis, 44, wasn't wearing any make-up and she looked a little pale and wan for her trip.\nHer only accessory appeared to her small yellow padded Chanel handbag.\nEyes down: The 17-year-old wore and black hoodie and matching sweat pants as she walked along the concourse\nSo an assistant must have been handling her luggage.\nThere was no of her British boyfriend Ash Stymest, which may explain why Lily-Rose looked a little down.\nShe and Ash, 25, both walked for Chanel's pre-Fall 2017 show at the Ritz in Paris in early December.\nHooded star: The model and actress pulled the hood of her top over her face\nMeanwhile, Lily-Rose is adding actress to her resume.\nShe appeared in three films in 2016: Planetarium with Natalie Portman; The Dancer; and Yoga Hosers with her father Johnny.\nThis year she is due to appear in Kevin Smith's comedy chiller Moose Jaws.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299642/Lily-Rose-Depp-tries-unnoticed-hoodie-LAX.html"}
