{"authors":["Nick Enoch For Mailonline"],"date_download":"2018-10-23 04:44:07","date_modify":"2018-10-23 04:44:07","date_publish":"2017-04-26 16:20:39","description":"The website, bullykillers, was set up by students at Lincoln University. They hope that the metaphorical killing can provide a 'cathartic release' for bullying victims.","filename":"data/vaneerConsumption/LincolnUniversitysBullykillersdestroysbullysname.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3FA034FD00000578-0-image-a-103_1493218769766.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447940_Bullykillers-bizarre-website-lets-destroy-bully-name_1540269847.html","title":"Lincoln University's Bullykillers destroys bully's name","title_page":"Lincoln University's Bullykillers destroys bully's name | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A bizarre website allows bullying victims to have their tormentors virtually 'killed' and placed in an online 'graveyard'.\nThe bully's name is sent to a website whose staff write it on a object which is filmed being imaginitively destroyed.\nSo far, bullies' names have been written on items including bits of paper, eggs and bread.\nOne shows the name Jodie written using tomato ketchup and placed in a hotdog-bun combo before it is consumed; another name, Dennis, is written on an Uno playing card, whereupon his name disappears in a magic trick.\nA bizarre website - bullykillers.com - allows bullying victims to have their tormentors virtually 'killed' and placed in an online 'graveyard'. Above, 'Oliver' is about to meet his doom\nThe bully's name is sent to a website whose staff write it on a object which is filmed being imaginatively destroyed. In this video, 'Oliver' has his name written on a piece of bread before being fed to pigeons\nHere, 'Ben', written in baking powder, is sucked up a vacuum cleaner. The site has been created by students at Lincoln University who insist they are not condoning actual violence\nThe videos are then posted to bullykillers.com for the victims and others to enjoy at their leisure.\nThe site has been created by students at Lincoln University who insist they are not condoning actual violence and hope that the metaphorical killing can provide a 'cathartic release' for bullying victims.\nIn one of the videos, a bully known as 'Oliver' has his name written on a piece of bread before being fed to pigeons.\nIn another, a bully called 'Rob' has his name written in whipped cream on a wooden floor, before a man rubs the cream with his foot, destroying the name.\nAnd 'Martina' is written on a bottle-cap which is subsequently flicked down a drain.\nAnother shows 'Bob' on an egg, which then explodes in a microwave, and one shows 'Ben', written in baking powder, getting sucked up a vacuum cleaner.\nThe students hope the metaphorical killing can provide a 'cathartic release' for bullying victims. Above, 'Rob' has his name written in whipped cream on a wooden floor, before a man rubs the cream with his foot, destroying the name. 'Martina' is written on a bottle-cap which is subsequently flicked down a drain\n'Bob' the bully appears in egg form in a microwave - before 'he' hatches as a chick and is squashed\nIn one video, 'Donald Trump' is written on a piece of paper which is then flushed down the toilet, while an unidentified man urinates into the toilet bowl.\nExplaining the motivation behind the website, an unnamed founder wrote: 'We wanted to do something to help those that experience bullying.\n'As bullying can be seen as a taboo subject, it can be difficult for those experiencing bullying to seek the help they need.\n'We do not condone any actual killing. We hope that upon seeing the videos, people can achieve a bit of cathartic release from any painful memories towards bullies they may feel.\n'It's definitely a tongue-in-cheek approach. We wanted to create a fresh, unique approach to bullying.\nExplaining the motivation behind the website, an unnamed founder wrote: 'We wanted to do something to help those that experience bullying. As bullying can be seen as a taboo subject, it can be difficult for those experiencing bullying to seek the help they need'\n'While the message behind our site - that we need to talk about bullying more - is very serious, we have found a slightly less serious way to get people talking about it.'\nSocial media users found the website hilarious.\nOne Instagram user known as bohemein_choclates wrote: 'So cool! We love seeing things like this pop up in our feed. Would love to see more.'\nCommenting on a particular video, another, called KirstyMae95, said: 'Finally got what he deserved.'\nSimon Heal added: 'Like the Trump one.'\nFlushed with success? The Donald gets the treatment...","url":"https://www.dailymail.co.uk/news/article-4447940/Bullykillers-bizarre-website-lets-destroy-bully-name.html"}
