{"authors":["Lucy Mae Beers","Brianne Tolj For Daily Mail Australia"],"date_download":"2018-10-22 20:49:43","date_modify":"2018-10-22 20:49:43","date_publish":"2016-01-28 04:06:25","description":"Lindy Olsen, who is Australia's only five time World Figure Champion, says it's rare for women to risk their health to compete and said those taking extreme lengths would not have a lengthy career.","filename":"data/vaneerConsumption/LindyOlsendefendsbodybuildingindustryafterphotosemergedoffemalecompetitors.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/03/30A6968F00000578-0-image-a-60_1453953569922.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3418763_World-champion-bodybuilder-Lindy-Olsen-defends-industry-shocking-photos-emerged-female-competitors_1540241383.html","title":"Lindy Olsen defends bodybuilding industry after photos emerged of female competitors","title_page":"Lindy Olsen defends bodybuilding industry after photos emerged of female competitors | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A champion female body builder has defended her sport arguing it is all about being healthy and fit after photos emerged showing the extreme lengths some women go to compete.\nLindy Olsen, who is Australia's only five time World Figure Champion, believes it is rare for women to risk their health just to compete and said those taking extreme lengths would not have a lengthy career.\nOne of the extreme practices believed to be currently used by fitness models and female bodybuilders is 'waterloading, which involves drinking up to five times the recommended amount of water per day and then dehydrating the night before a competition.\nScroll down for video\nLindy Olsen, who is Australia's only five time World Figure Champion, believes it is rare for women to risk their health just to compete and said those taking extreme lengths would not have a lengthy career\nDisturbing pictures have also emerged on social media of women drinking bottles of wine and spirits while waiting backstage in competition areas to intentionally dehydrate their bodies.\nThere are also claims some women and men take diuretics prior to competing to aid them.\nMs Olsen, who is also a fitness model and mother, said she has never witnessed this behaviour taking place at the national and international standard of the sport, but admits it could be occurring in unsanctioned events.\n'In all my years of competing at the highest national and international stages, I've never personally seen anyone do that sort of thing when competing,' she told Daily Mail Australia.\n'Competing on a natural (drug tested) stage means that you must be clean. In the... sanctioned events in which I compete, we are subjected to the same testing that Olympic athletes are subjected to.'\nMs Olsen said there were no mystery techniques or concoctions to get results.\nMs Olsen, who is also a fitness model and mother, said those competing at the highest national and international stages were subjected to the same drug testing that Olympic athletes are subjected to\nLindy Olsen said there were no mystery techniques or concoctions to get results in the body building industry\nLindy said without prioritising your health there is no way that you can keep training or competing, especially at the World Natural Pro level\n'Back 15 years ago, I used to hear stories about people trying some pretty extreme methods to get ready for a show, but these days people are smarter than that. If they're not, they should be. You don't need to do anything except plan in advance, eat well and exercise daily,' she said.\n'The black and white truth of competing is that you can only achieve great results if you're prepared to put the work in! I'm living proof of that!\n'Without prioritising your health there is no way that you can keep training or competing, especially at the World Natural Pro level. It would be like trying to build a house without a solid foundation.\n'Others may ignore the health aspects when it comes to looking to achieve short term success or results however those approaches quickly become unmaintainable and unhealthy. This usually results in a short career and long term health issues.'\nOne of the extreme practices believed to be currently used by fitness models and female bodybuilders is 'waterloading, which involves drinking up to five times the recommended amount of water per day\nBodybuilders and fitness models are drinking up to five times the recommended amount of water per day\nAustralian doctor, David Mountain, warned that intense techniques - like gorging on junk food, binge drinking vodka and downing 10 litres of fluids a day - was putting the lives of the young women at risk\nIt comes after Australian doctor, David Mountain, warned that intense techniques - like gorging on junk food, binge drinking vodka and downing 10 litres of fluids a day - was putting the lives of the young women that use them at risk by threatening their long-term health.\nDr David Mountain, the head of emergency medicine at Sir Charles Gairdner Hospital in Perth, said the use of steroids and oestrogen blockers could leave women with kidney problems, liver disease and fertility issues, Perth Now reports.\nBut Ms Olsen said the fitness industry as a whole was focused on helping people to improve their health and fitness.\n'In any industry, you'll always have a small minority who are in it for all the wrong reasons… but those people ARE the minority,' she said.\n'Without making health and fitness the priority, there is no way I would be able to compete for a solid 10 years, win 5 world titles, work as the Editor in Chief for Oxygen Magazine Australia working 60+ hours a week, then have my first child at almost 40 years of age.'\nMs Olsen, who exercises for roughly five hours a week, says most people don't realise they can get in shape without starving or depriving themselves of the foods they love, like chocolate and ice cream.\nLindy Olsen said the fitness industry as a whole was focused on helping people to improve health and fitness\nMs Olsen said without making health and fitness the priority, there is no way she would be able to compete for a solid 10 years, win 5 world titles and have her first child at 40","url":"https://www.dailymail.co.uk/femail/article-3418763/World-champion-bodybuilder-Lindy-Olsen-defends-industry-shocking-photos-emerged-female-competitors.html"}
