{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 21:16:52","date_modify":"2018-10-22 21:16:52","date_publish":"2016-01-28 07:14:07","description":"The 29-year-old former child star initially complained about her parent's lack of attention, but then swiftly deleted the message.","filename":"data/vaneerConsumption/LindsayLohanpostspicturesayingsheisdonewithhermotherDina.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/06/30A71E4800000578-0-image-a-10_1453962227304.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420427_Lindsay-Lohan-posts-picture-saying-mother-Dina_1540243012.html","title":"Lindsay Lohan posts picture saying she is 'done' with her mother Dina","title_page":"Lindsay Lohan posts picture saying she is 'done' with her mother Dina | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They have hardly enjoyed the most stable of relationships.\nAnd Lindsay Lohan posted an image on Instagram on Wednesday saying she was 'done' with her mother Dina due to the fact she is apparently never there for her.\nThe troubled former child star initially complained about her parent's lack of attention, but then swiftly deleted the message.\nScroll down for video\nThe Parent Trap: Lindsay Lohan said she was 'done' with mother Dina in an Instagram message Wednesday\nThe original image showed a Bitmoji cartoon of Lindsay, 29, throwing her phone next to the words 'we're done.'\nIn a revealing caption the Herbie Fully Loaded star said: '@dinalohan ... Sometimes it sucks when your mom isn't there for you.\nIt is currently unknown why the troubled starlet, who is taking something of an extended sabbatical from movie-making these days, decided to delete the message.\nShe has frequently clashed with her 53-year-old mother, who is herself a former singer and dancer, in the past.\nDeleted: She claimed it 'sucks when your mom isn't there for you' but then wiped the message\nLast year it was reported the Parent Trap actress had threatened to report her mother to the police for selling her belongings - including clothing, furniture, and artwork - on the Internet and directly to friends without her permission.\nDina has also been slated for using her daughter's fame and struggles in order to launch her own career, even bringing cameramen from the Entertainment Tonight to film her visiting Lindsay in rehab.\nLindsay has also previously cut off contact with her father Michael, claiming she finds his behavior unpredictable and hard to deal with.\nShe has even said that growing up she felt like a 'second parent' to her siblings due to the problems between her parents, who divorced in 2007,\nStrife: The pair's relationship was a feature of the OWN reality show revolving around the starlet\nThe latest strife comes after it emerged earlier this month Lindsay allegedly racially abused a bartender then spat in the face of a fellow customer who tried to intervene in the dispute after she was thrown out of a New York bar.\nAccording to RadarOnline the former child star and her sister Ali were asked to leave the Manhattan establishment after locking themselves in the toilets for upwards of 20 minutes.\nA fellow drinker told the site the pair were 'aggressive and belligerent' after being asked to leave the VBar in Greenwich Village.\nA current representative for Lohan could not be reached.\nFull of beans: Lindsay seemed in high spirits back in November on a night out in London","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420427/Lindsay-Lohan-posts-picture-saying-mother-Dina.html"}
