{"authors":["Chloe-Lee Longhetti","Monique Friedlander For Daily Mail Australia"],"date_download":"2018-10-23 02:24:48","date_modify":"2018-10-23 02:24:48","date_publish":"2016-01-11 14:29:45","description":"For months rumours have been swirling that Lindy and Michael Klim, 38, have called time on their nine-year marriage","filename":"data/vaneerConsumption/LindyKlimdotesonchildrenStellaRoccoandFrankieatthepark.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/300A51CF00000578-0-image-a-33_1452517080768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393781_Lindy-Klim-dotes-children-Stella-Rocco-Frankie-park-husband-Michael-seen-fueling-rumours-pair-split_1540261488.html","title":"Lindy Klim dotes on children Stella, Rocco and Frankie at the park","title_page":"Lindy Klim dotes on children Stella, Rocco and Frankie at the park | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For months rumours have been swirling that Lindy and Michael Klim have called time on their nine year marriage.\nAnd Balinese princess Lindy was spotted on Friday performing motherly duties lone as their young children, Stella, nine, Rocco, seven, and Frankie, four, played in a Melbourne park.\nThe 37-year-old former model doted on her brood as they played in the sun, while former Olympic swimmer Michael, 38, was spotted elsewhere in Melbourne leaving a residence.\nScroll down for video\nDoting mother: Lindy Klim was spotted on Friday on motherly duties as children, Stella, nine, Rocco, seven, and Frankie, four, played in a park in Melbourne, while husband Michael was seen elsewhere\nLooking casual for the outing but ultra-stylish, Lindy wore a light washed pair of jeans and a bright white T-shirt with sleeves rolled up.\nShe finished the look with white sneakers and had her dark locks tied up off her face and into a messy bun.\nAppearing to go make-up free, the exotic beauty instead showed off a golden tan and let her naturally flawless complexion radiate.\nFor the day, Lindy stepped out once again without her wedding ring, and was spotted smiling and keeping a watchful eye on her young ones.\nSplitsville? Meanwhile, husband Michael Klim was spotted alone in Melbourne but in a completely different area to his family, leaving a residence\nOn duty! Looking casual for the outing but ultra-stylish, Lindy wore a light washed pair of jeans and a bright white T-shirt\nSolo: For the day, Lindy stepped out without her wedding ring, and was spotted smiling and keeping a watchful eye on her young ones\nAt one point, she pushed Frankie on a swing and became distracted by looking at her mobile phone.\nWhile there, her eldest children swung on a tyre and she seemed amused by their playful antics.\nThe children's father Michael was also spotted in Melbourne but was not seen at the park with his family.\nInstead, he was spotted walking along a street and leaving a different house to where Lindy and the children are staying while in the city.\nSolo trip: Michael was also spotted in Melbourne but was not seen at the park with his family\nHe cut a casual figure in a black T-shirt and jeans, teamed with runners, and clutched a large can of Red Bull in one hand.\nAt the weekend, Lindy flew solo as she attended the Portsea Polo in Melbourne, and ditched her wedding ring for the event.\nDressed head to toe in designer labels including Gucci, Louis Vuitton and Dior, she appeared in good spirits as she posed for the cameras and holding up her hands and making the peace sign.\nMeanwhile, Michael took to Instagram on Saturday to update his fans on his weekend activities, which included a trip to Bells Beach in Victoria for a surfing session.\nGlamour queen! On Saturday, Lindy attended the Portsea Polo draped in a 1970's inspired outfit consisting of Gucci, Louis Vuitton and Dior garments and ditched the wedding ring\nFeeling herself: Taking to Instagram as she posed in the Peroni marquee, Lindy wrote, 'Incoming @portseapolo wearing @gucci and @louisvuitton hanging out in @peroni_au #peronistyle #portseapolo'\nOther plans: Meanwhile, Michael took to Instagram on Saturday to update his fans on his weekend activities, which included a trip to Bells Beach in Victoria for a surfing session\nIt is one of the latest incidents fuelling rumours that the pair have called it quits.\nOn Sunday, Michael also enjoyed drinks with the 'boys' and shared a picture of himself in a helmet, joking he needed it for the catch up.\nEarlier that day he also enjoyed spending time with Stella and took her to the National Gallery of Victoria and shared a picture of her there.\nLindy, meanwhile, has posted Instagram pictures from the Portsea Polo of her and the children.\nHaving fun: On Sunday, Michael also enjoyed going out for drinks with the 'boys' and shared a picture of himself in a helmet, joking he needed it for the catch up\nKeeping occupied? Lindy meanwhile has posted to Instagram of late, pictures from the Portsea Polo and that of her children\nThe pair have remained decidedly absent from each other's social media updates for almost a year.\nOn New Year's day, Lindy rang in the new year by going swimming at Sydney's Bondi Beach, while Michael posted photos on social media in Port Phillip Bay, 30 kilometres out from Melbourne's Central Business District.\nA week earlier, Lindy and Michael travelled to Tasmania with their children for a family holiday, but failed to even mention each other's presence on social media; with both parties opting only to photograph their children.\nMaking a splash! On New Year's day, Lindy rang in the new year by going swimming at Sydney's Bondi Beach without Michael\nLast year, the pair made headlines after New Idea magazine published an article attesting that they had ended their nine-year marriage.\nThe publication stated at the time that Lindy was left 'distraught' and 'humiliated' following her separation and that the pair have been going to marriage counselling for two years.\n'They have been in relationship counselling for two years now,' a friend is said to have told the publication.\nJust photographing the kids! A week earlier, Lindy and Michael travelled to Tasmania with their children for a family holiday, but failed to even mention each other's presence on social media","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393781/Lindy-Klim-dotes-children-Stella-Rocco-Frankie-park-husband-Michael-seen-fueling-rumours-pair-split.html"}
