{"authors":["Deborah Danan"],"date_download":"2018-10-30 17:56:32","date_modify":"2018-10-30 17:56:32","date_publish":"2016-09-14 03:10:40","description":"TEL AVIV – Israel and the U.S. are reported to have reached an agreement on a landmark defense aid package to the tune of $3.3 billion, but the White House is reluctant to sign the deal due to opposition from Senator Lindsey Graham, who claims to have told Prime Minister Benjamin Netanyahu to \"Tell the administration to go F themselves.”","filename":"data/vaneerConsumption/LindseyGrahamToNetanyahuOverDefenseDealTellObamaAdministrationToGoFThemselves.json","image_url":"https://media.breitbart.com/media/2016/03/GOP_2016_Adelson_Prim_Lesn.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_13__1540922192.html","title":"Lindsey Graham To Netanyahu Over Defense Deal: Tell Obama Administration 'To Go F*** Themselves'","title_page":"Lindsey Graham To Netanyahu Over Defense Deal: Tell Obama Administration 'To Go F*** Themselves' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Israel and the U.S. are reported to have reached an agreement on a landmark defense aid package to the tune of $3.3 billion, but the White House is reluctant to sign the deal due to opposition from Senator Lindsey Graham, who claims to have told Prime Minister Benjamin Netanyahu to “Tell the administration to go F themselves.”\nThe Memorandum of Understanding, which has taken more than a year to formulate, would increase the 10-year deal from $3.1 billion to $3.3 billion, beginning in 2018.\nHowever, The Washington Post reported that Graham was advancing a deal for $3.4 billion.\n“I’m offended that the administration would try to take over the appropriations process. If they don’t like what I’m doing, they can veto the bill,” Graham said. “We can’t have the executive branch dictating what the legislative branch will do for a decade based on an agreement we are not a party to.”\nIn a phone conversation with Netanyahu following the spat, the latter said he was willing to sign the deal but that it was being held up due to Graham’s opposition.\n“The Israeli prime minister told me the administration is refusing to sign the MoU until I agree to change my appropriation markup back to $3.1 billion,” Graham said. “I said, ‘Tell the administration to go F themselves.’”\nThe MoU includes a stipulation that Israel will not seek additional funding from Congress. According to Israel’s Channel 2, Netanyahu agreed to this, effectively siding with the White House over Graham.\nU.S Ambassador to Israel Dan Shapiro said the deal would be “the U.S.’s biggest aid package to any other country in history.”\n“In keeping with America’s commitment to preserve Israel’s qualitative military advantage, by the end of this year the Israeli Air Force will take delivery of the first F-35 Joint Strike Fighter,” Shapiro said.\n“This is the latest manifestation in a long history of Americans helping Israel defend itself with cutting-edge airborne platforms.”\nIsrael is hoping the aid package will allow it to maintain a military edge – especially in light of the fact that Iran is awash with cash now that sanctions have been lifted as part of the U.S.-led nuclear deal.\nGraham and other senators were put out by not being part of the nuclear deal, and according to the Post, Republicans are now doubly aggravated by some of the aid deal’s provisions, including phasing out the purchase of weapons from local contractors in Israel.","url":"https://www.breitbart.com/middle-east/2016/09/13/sen-graham-to-netanyahu-over-defense-deal-tell-obama-administration-to-go-f-themselves/"}
