{"authors":["Associated Press"],"date_download":"2018-10-22 22:43:19","date_modify":"2018-10-22 22:43:19","date_publish":"2017-04-26 05:40:32","description":"NEW YORK (AP) - Campaign promises may have been reshaped and some self-imposed deadlines reset. But among the things kept intact in the opening months of the...","filename":"data/vaneerConsumption/LinguistssearchforwordsinparsingTrumpsoratory.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/19/wire-467155-1493231159-688_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446314_Trumps-speaking-style-flummoxes-linguists_1540248199.html","title":"Linguists search for words in parsing Trump's oratory","title_page":"Linguists search for words in parsing Trump's oratory | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - Campaign promises may have been reshaped and some self-imposed deadlines reset. But among the things kept intact in the opening months of the new administration is the unmistakably distinct style of President Donald Trump's speech.\nTrump's trademark talk is full of rambling, aside-filled bursts of simple but definitive words, laden with self-congratulatory bravado and claims that have fact-checkers working overtime, all dispatched from mind to lips in such record time it seemingly bypasses any internal filter.\nIt has been a source of curiosity for language scholars and laymen alike, sparked anew by a recent Associated Press interview with Trump that has brought newfound opportunity for parsing a brand of presidential oratory not previously recorded.\nFILE - In this Tuesday, April 18, 2017 file photo, President Donald Trump speaks at Snap-On Tools in Kenosha, Wis. Trump garnered the attention of the masses, in part, because he sounded different than what the public had come to expect from politicians. Kathleen Hall Jamieson, director of the Annenberg School of Publication at the University of Pennsylvania, said Trump's extemporaneous speech is best described as stream-of-consciousness, a big change from what we're used to from those seeking _ and occupying _ the highest office in the land. (AP Photo/Kiichiro Sato)\n\"This kind of pushes the limits of linguistic analysis,\" said historian Kristen Kobes Du Mez.\nA look at some features of Trump-speak:\n___\nA NEW PRESIDENTIAL SCRIPT\nTrump garnered the attention of the masses, in part, because he sounded different from what the public had come to expect from politicians. Kathleen Hall Jamieson, professor at the Annenberg School for Communication at the University of Pennsylvania, said Trump's extemporaneous speech is best described as stream-of-consciousness, a big change from what we're used to from those seeking - and occupying - the highest office in the land.\n\"The public speech of the president in the past has been crafted speech, it has been considered speech. Presidents prepared before speeches, presidents prepared before press conferences, presidents had stock answers ready to give,\" she said.\nWith Trump, the mold of focus-group-tested, carefully selected words was broken.\n___\nREPETITION, ASIDES AND NON SEQUITURS\nThe AP interview is just the latest example of some of Trump's favored tactics in speaking. Word choice is typically simple - to Trump, things are terrible or incredible, best or worst. Asides are frequent. And repetition is rampant: When Trump wants to get a point across, he makes it again and again.\nThen there are the familiar non sequiturs. In one campaign speech, for example, Trump begins to talk about the Iran nuclear deal only to veer far afield into talking at length about his uncle, who was a scientist.\nEarly in the AP interview, he makes an unprompted mention of German Chancellor Angela Merkel, saying his chemistry with her was great. He then goes on to say the credit he's been given for his \"great chemistry with all of the leaders,\" and even when the interviewer attempts to shift the discussion, returns to the point he wants to make, talking again of establishing \"amazing relationships\" and \"great relationships\" and \"great chemistry.\"\n\"There is a lot of repetition, building up patterns of trust with the listener, repetition of 'you know,'\" said Paul Breen, a senior lecturer at the University of Westminster in England. \"I think there is actual method in what others may portray as his madness.\"\nTrump has suggested there's method to his word choice too, that the simple terms he often opts for can be more effective than the flowery eloquence listeners may be used to from presidents. \"I went to an Ivy League school. I'm very highly educated. I know words; I have the best words,\" he said during the campaign.\n___\nVERY, SUPER-DUPER, GREAT\nThroughout Trump's interview with AP, his remarks are littered with \"verbal intensifiers,\" in the parlance of Du Mez, chair of the history department at Calvin College. That means things like \"very, very\" and \"many, many\" or, the rare \"super-duper.\"\n\"I don't know that any president has ever used 'super-duper' in his rhetoric before,\" Du Mez said. Still, while she said the president is sometimes mocked for his elementary word choices, \"In terms of oral rhetoric, you want a simpler grade level. That's a more effective way to communicate.\"\nEric Acton, a linguist at Eastern Michigan University, noted Trump's penchant for superlatives including 'biggest,' 'toughest,' and 'strongest.' And, of course, the word Trump stitched into campaign hats and repeats, dozens of times, in an hour-long conversation.\n\"He really does seem to love the word 'great,'\" Acton said.\n___\nTELEPROMPTER VS. TOUGH GUY\nAs with anyone, Trump's manner of speaking can vary with the setting. John Baugh, a linguist at Washington University, says Trump's communiques can be generally pooled into three groups: spontaneous speeches; scripted, carefully-delivered addresses; and tweets.\nThe scripted speeches hew closest to the presidential norm, with his address to a joint session of Congress in February most often pointed to as an example of Trump mirroring leaders past. The most bombastic talk is delivered in Trump's spontaneous remarks or hastily penned tweets.\nAll of it, though, comes tinged in a very specific voice.\n\"There is a style of speaking that's associated with tough New Yorkers, the stereotype of men in New York and we typically associate this with working-class men,\" said Baugh. \"They're not only plain-spoken but they're tough guys.\"\n___\nSALESMAN'S SPIEL?\nIn Barack Obama, you often heard a lawyer at work, speaking carefully and with some semblance of self-monitoring, Jamieson said. With Trump, glimpses of a businessman come through in his use of categorical statements and his repeated assertions that he's successful and admired.\n\"He's telling you that the Trump brand is a good brand, that everyone likes the Trump brand,\" Jamieson said.\nDavid Beaver, a linguist at the University of Texas at Austin, said Trump mirrors the tactics of advertisers, going with an emotional type of persuasion over rationality. That means graphic imagery stirred by vivid words, and language more typical on streets than of statesman.\n\"When was the last time you heard a president say 'scum' twice in one sentence?\" Beaver asked.\n___\nSedensky can be reached at msedensky@ap.org or https://twitter.com/sedensky","url":"https://www.dailymail.co.uk/wires/ap/article-4446314/Trumps-speaking-style-flummoxes-linguists.html"}
