{"authors":["Press Association"],"date_download":"2018-10-23 03:46:04","date_modify":"2018-10-23 03:46:04","date_publish":"2016-01-11 16:47:22","description":"A Whitehall mandarin who faced intense criticism from MPs while holding key Civil Service roles is quitting, the Government has announced. Lin Homer will sta...","filename":"data/vaneerConsumption/Linhomertostanddownasrevenueandcustomschief.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-d8784477-9176-4f55-a7f4-e62dde63f1e9-48qEJGFphM8d437f0aaf9271f83a-243_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393810_Lin-Homer-stand-Revenue-Customs-chief_1540266364.html","title":"Lin homer to stand down as revenue and customs chief","title_page":"Lin homer to stand down as revenue and customs chief | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lin Homer to stand down as Revenue and Customs chief\nA Whitehall mandarin who faced intense criticism from MPs while holding key Civil Service roles is quitting, the Government has announced.\nLin Homer will stand down as HM Revenue and Customs chief executive in April after four years in the role, the department said.\nMs Homer, who was made a Dame in the New Year's Honours list, came under fire last year for her handling of tax-dodgers.\nLin Homer will stand down as HM Revenue and Customs chief executive in April\nChancellor George Osborne said: \" Lin Homer has made a real contribution to public service modernisation and transformation. She has put the foundations in place that will see HMRC become one of the most digitally-advanced tax authorities in the world.\n\"It is to Lin's great credit that the National Audit Office last year judged HMRC to be one of the strongest Departments in Government - a legacy of which she can be rightly proud.\"\nMs Homer faced a scathing attack by MPs for her ''catastrophic leadership failure'' when she was in charge of the U K Border Agency.\nShe went on to become head of Britain's tax office but was forced to defend the department after securing only one prosecution from a list of 6,800 UK-related secret Swiss bank accounts provided in 2010 by French authorities.\nHMRC said Ms Homer had led the department \"through a period of recovery and significant performance improvements\", including a reduction in the tax gap and an increase in the number of customer calls being answered from 48% in 2011 to almost 90% in December 2015.\nMs Homer said: \" After 10 years as a chief executive and permanent secretary in the Civil Service, the start of the next spending review period seemed to be a sensible time to move on.\n\"HMRC has secured ministerial support and funding for our ambitious transformation programme and it has the leadership team in place to deliver it. My successor will be able to put their full weight behind seeing the transformation through to 2020.\n\"It has been a privilege to have been with HMRC during a period when the improved performance of the department has been increasingly recognised and we have the full backing of ministers for our future plans.\n\" HMRC is a critical organisation which does vital things - to collect the revenues to pay for public services, support families with targeted financial support and facilitate trade for UK businesses.\n\"I have found commitment to public service and dedication to customers among our people wherever I have been, coupled with a deep level of specialist expertise and operational excellence.\"\nCabinet Secretary Sir Jeremy Heywood, who is head of the Civil Service, said Ms Homer was a \"dedicated, professional and courageous colleague\".\n\"Following a succession of challenging and important roles in a long and varied public sector career, Lin has led HM Revenue and Customs for the last four years with great distinction,\" he said.\n\"She not only leaves behind a significantly more effective and efficient organisation, delivering more for less, she has also helped to transform HMRC into one of the most open, digitally advanced revenue services in the world.\"\nLabour's Margaret Hodge, who was one of Ms Homer's chief critics while heading the Public Accounts Committee (PAC), said: \" Lin Homer retiring at 58? Always polite and solid performer at PAC but presided over awful service to public, huge tax gap and poor morale.\"\nConservative Andrew Tyrie, chairman of the Treasury committee, said: \"Lin has done a tough job in difficult circumstances.\n\"It is now very important that the Government finds a high quality replacement. The taxpayer experience of HMRC is still well short of what they have the right to expect. The committee will want to hold a pre-appointment hearing with her successor.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3393810/Lin-Homer-stand-Revenue-Customs-chief.html"}
