{"authors":["Rebecca Santiago"],"date_download":"2018-10-30 23:39:06","date_modify":"2018-10-30 23:39:06","date_publish":"2014-08-13 15:04:09","description":"I'm not cool enough to date, much less to date online, but my friends who do have faced an interesting (and very Millennial) conundrum as of late. In hot pursuit of meal tickets/slampieces/true love, they've been swiping merrily through Tinder…","filename":"data/vaneerConsumption/LinkedUpEHarmonyCareersandWhatHappensWhenDatingAppsMeetNetworkingTools.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c7a16b10-beab-45eb-920d-87c75aa30cb4.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35555-linkedup-eharmony-careers-and-what-happens-when-dating-apps-meet-networking-tools_1540942746.html","title":"LinkedUp, EHarmony Careers, and What Happens When Dating Apps Meet Networking Tools","title_page":"LinkedUp, EHarmony Careers, and What Happens When Dating Apps Meet Networking Tools","title_rss":"NULL","source_domain":"bustle.com","text":"I'm not cool enough to date, much less to date online, but my friends who do have faced an interesting (and very Millennial) conundrum as of late. In hot pursuit of meal tickets/slampieces/true love, they've been swiping merrily through Tinder potentials or scrolling through Hinge matches, when, suddenly, they've been confronted with something unexpected: a really and truly phenomenal networking contact.\nIf nothing else, this \"I should message him. Should I message him? For career advancement or Friday drinks?\" moment highlights the ways in which our professional and dating lives are weirdly converging in this digital era. And according to The New York Times, matters of love and business are about to get more confusing — and maybe better? Maybe worse? — thanks to some new genre-blurring techy advents, like a networking-inspired dating app called LinkedUp and an upcoming EHarmony careers platform.\nThe iOS-compatible LinkedUp syncs with LinkedIn, shedding light on a potential match's professional life and personal side. As an ambitious New Yorker who met her boyfriend through work (well, \"work.\" Does the school paper count, if we took it pretty seriously?), I have to say that I don't hate this idea. It's nice when two people share similar levels of ambition and interest in an industry; it explains coworker crushes and hookups. Why wouldn't interesting resumes attract interesting resumes?\nAs the Times explains, the app's 28-year-old CEO Max Fischer was also inspired by the ways in which people use networking apps for social purposes. His app deconstructs the first stages of flirting into the sort of cut-and-try small talk you'd haul out at a networking event, but, as he explains below, he thinks that small talk of that nature isn't so small at all:\nLinkedUp [...] argues instead that knowing a few fundamentals can be enough to spark a meeting. “Where is that person from? What do they do? Where did they go to school?” Mr. Fischer writes, “are some of the most important questions in dating rapport between two people in terms of the first interaction.”\nAm I getting an elitist vibe from this? Sure, although that might just be me projecting — stuff like this is no good for recovering school snobs. I agree that it could be nice and orienting to know about a match's academic and professional background from the get-go, but I also shudder to think how resume language like \"motivated self-starter\" would come across from a dating prospective.\nMoving on to EHarmony's careers platform, which launches this fall, and, just, what? An explanation from the company's CEO:\nThe company’s founder and chief executive, Neil Clark Warren, told Marketwatch that it isn’t kindness but adaptability that is most important in a marriage — and also at work. Similarly, “conscientiousness, honesty, emotional stability, extrovert/introvert, conflict resolution and whether they are apt to follow the rules” — all indicators of a successful relationship — are likely to be important in the professional world as well, says Mr. Warren.\nOK, I get that, sort of. I like the idea of a company \"taking into account an applicant’s personality, how it might fit with the company’s culture and how it might mesh with management.\" But, I also sort of thought companies did that already, throughout the hiring process? Like, with cover letters and interviews and whatever?\nOn the one hand, I can appreciate the idea of trying to re-envision recruiting and HR from a matchmaking perspective. I loathe being boiled down to a list of duties and accomplishments; I am so much more, as we all are. But the problematic thing about EHarmony's career platform, at least as it's described here, is that it's narrowing a human being down in the exact same way, except to traits instead of skills. No matter the platform's good intentions, the person in question is still reduced to a Scantron of characteristics that can't account for everything. What about the people who just \"get it\" at work, or people who have a little je ne sais quoi?\nTL;DR getting dates and jobs in the Internet age is overwhelming; let's maybe hide out on our couches until it's over.\nImage: Beth Dubber/FOX","url":"https://www.bustle.com/articles/35555-linkedup-eharmony-careers-and-what-happens-when-dating-apps-meet-networking-tools"}
