{"authors":["Kristian Wilson"],"date_download":"2018-10-31 01:40:42","date_modify":"2018-10-31 01:40:42","date_publish":"2018-09-14 20:46:52","description":"Heads up, Hamiltonians! Hamilton creator Lin-Manuel Miranda and Jonny Sun's book of affirmations has an official release date, and it is coming out this fall from Penguin Random House. Gmorning, Gnight!: Little Pep Talks for Me & You will be…","filename":"data/vaneerConsumption/LinManuelMirandasBookOfAffirmationsIsComingOutThisFallItMakesThePerfectHolidayGift.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/4d59e1c5-38ec-4aac-b8f9-b7e6e65f5afa-lin1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_lin-manuel-mirandas-book-of-affirmations-is-coming-out-this-fall-it-makes-the-perfect-holiday-gift-11926787_1540950042.html","title":"Lin-Manuel Miranda's Book Of Affirmations Is Coming Out This Fall & It Makes The Perfect Holiday Gift","title_page":"Lin-Manuel Miranda's Book Of Affirmations Is Coming Out This Fall & It Makes The Perfect Holiday Gift","title_rss":"NULL","source_domain":"bustle.com","text":"Heads up, Hamiltonians! Hamilton creator Lin-Manuel Miranda and Jonny Sun's book of affirmations has an official release date, and it is coming out this fall from Penguin Random House. Gmorning, Gnight!: Little Pep Talks for Me & You will be available on Oct. 16, so get ready to have Lin-Manuel Miranda's wake-up and bedtime tweets available on your nightstand for years to come. Even better, the October release date means that you can order multiple copies to gift all your friends this holiday season.\nLin-Manuel Miranda has been tweeting \"Gmorning\" and \"Gnight\" messages to his Twitter followers since 2011, when he sent out the first of his book-worthy tweets: \"Well, I'm having a serious Season 4 West Wing Marathon tomorrow. Game on. Gnight Tweetonia!\" Since then, the Tony Award-winning Broadway star has posted hundreds, if not thousands, of Gmorning and Gnight tweets, which come with inspirational poems in their more recent iterations, like this one from Friday: \"Gmorning / Take it easy on those who love you / Life is short, you're gonna need 'em / Take it easy on yourself / Life is long, you're gonna need you.\"\nIn case you're wondering just how popular Miranda and his tweets have gotten over the last seven-and-a-half years, the first Gmorning/Gnight tweet has six likes and no comments; the most recent has nearly 34,000 likes and 8,700 comments.\nLin-Manuel Miranda gave his Twitter followers a sneak peak at Gmorning, Gnight! in August, when he shared a picture of the book's cover for the first time. The book is illustrated by Jonny Sun, the author of Everyone's a Aliebn When Ur a Aliebn Too, \"and one of Time’s 25 Most Influential People on the Internet in 2017,\" according to Variety. Gmorning, Gnight! will be available in hardcover, eBook and eAudiobook editions when it makes its official debut on Oct. 16.\nGmorning, Gnight!: Little Pep Talks for Me & You by Lin-Manuel Miranda, illustrated by Jonny Sun, $12, Amazon\nGmorning, Gnight! is exactly the dose of positivity we all could use when it seems like the world is falling in on top of itself. It's full of Miranda's one-man attempts to make the Internet in general, and Twitter in particular, a more positive place. That's an admirable effort, and it comes at a time when Internet trolls and bots are making it difficult to find refuge in our online social networks.\nLin-Manuel Miranda probably can't save the world — although he's basically a creative supergenius, so who the hell knows? — but he's doing his best to make it better for other people. Gmorning, Gnight! won't fix everything that's wrong with your life, but if it makes you feel a little bit happier and more content, it'll have done its job.\nGmorning, Gnight!: Little Pep Talks for Me & You hits stores on Oct. 16. You can pre-order it today from your favorite bookseller.","url":"https://www.bustle.com/p/lin-manuel-mirandas-book-of-affirmations-is-coming-out-this-fall-it-makes-the-perfect-holiday-gift-11926787"}
