{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-23 00:01:58","date_modify":"2018-10-23 00:01:58","date_publish":"2016-01-28 13:28:59","description":"The footage was captured at the Jugomaro Predator Park in Groblersdal, Mpumalanga, South Africa and showed young lioness Laylie jumping all over a man sitting inside a safari vehicle.","filename":"data/vaneerConsumption/LIONjumpsintoasafarivehicleandclimbsontomanslap.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA6D9100000578-0-image-a-36_1453986164682.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420915_Cat-seat-driver-unbelievable-moment-LION-jumps-safari-vehicle-climbs-man-s-lap_1540252918.html","title":"LION jumps into a safari vehicle and climbs onto man's lap","title_page":"LION jumps into a safari vehicle and climbs onto man's lap | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Man turns on engine, causing lioness to flee and then growl at buggy\nLion later jumps from buggy before returning and getting on man's lap\nYoung lioness Laylie climbs on top of man, who appears calm in vehicle\nThis is the unsettling moment a lioness jumped into a safari vehicle before settling down on the lap of the man inside.\nThe footage was captured at the Jugomaro Predator Park in Groblersdal, Mpumalanga, South Africa and featured a young lion named Laylie.\nIn the clip the fierce predator is seen climbing on top of the man, who appears relatively relaxed while at the controls of the buggy.\nBrave: The athletic lioness named Laylie leaps onto the man's lap, who attempts to help her into the vehicle\nThe lioness later jumps out of the vehicle before turning around and athletically leaping back onto the man's lap, who attempts to help her in.\nHe can be heard saying: 'You're getting too fat, girl,' as Laylie dives over the top of him and straight out the other side of the buggy.\nThe lioness then becomes more energetic and leaps behind the man as he attempts to start the vehicle.\nOnce the engine is running the lion jumps out of the buggy and stands back cautiously before growling.\nRelaxed: The fierce predator climbs on top of the man, who appears calm while at the controls of the buggy\nThe man, who is believed to be a worker at the park, responds by turning off the engine and telling Laylie he is going to take her for a ride.\nThe clip concludes with the predator growling loudly once more.\nThis is not the first time a big cat has been caught on camera getting up-close and personal with someone sitting inside a vehicle.\nIn July 2015, a tourist came face-to-face with a cheetah, who climbed into the jeep he was sitting in, while he was on safari at the Masai Mara game reserve in Kenya.\nThe man can be heard saying: 'You're getting too fat, girl,' (left) before the lioness jumps all over him (right)\nAfter entering the vehicle, it slowly sauntered over to holidaymaker Mickey McCaldin until it was barely a foot away from his face.\nFamily friend David Horsey captured the tense stand-off between the pair as it looked like the cheetah was going to make himself comfortable on Mickey's lap.\nAt the time David, 62, from Mombasa, Kenya, said: 'I've been living in Kenya all my life and I've never seen anything like this.'\nIn July 2015, a tourist came face-to-face with a cheetah, who climbed into the jeep he was sitting in, while he was on safari at the Masai Mara game reserve in Kenya","url":"https://www.dailymail.co.uk/news/article-3420915/Cat-seat-driver-unbelievable-moment-LION-jumps-safari-vehicle-climbs-man-s-lap.html"}
