{"authors":["Robert Cottingham For Mailonline"],"date_download":"2018-10-23 04:05:31","date_modify":"2018-10-23 04:05:31","date_publish":"2017-04-26 15:47:08","description":"Lionel Messi is not as good as his compatriot Diego Maradona was because he only plays well for Barcelona not Argentina, according to legendary forward Romario.","filename":"data/vaneerConsumption/LionelMessivsDiegoMaradonaRomariopicksthebest.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/35B61E8500000578-0-image-a-47_1493217841216.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4448072_Lionel-Messi-vs-Diego-Maradona-Romario-picks-best_1540267531.html","title":"Lionel Messi vs Diego Maradona: Romario picks the best","title_page":"Lionel Messi vs Diego Maradona: Romario picks the best | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lionel Messi is not as good as Diego Maradona was because he only plays well for Barcelona, according to legendary forward Romario.\nRomario also rates himself as 'much better' than the Argentinian pair while he ranks Neymar as the world's best player currently.\nRomario thinks Messi's lack of success at international level puts him below Maradona - who won the 1986 World Cup with Argentina.\nRomario thinks that five-time Ballon d'Or winner Lionel Messi does not play well for Argentina\nDiego Maradona enjoyed more success with Argentina - pictured with the 1986 World Cup\nRomario explained his thinking to Fox Sports Brasil via FourFourTwo: 'Messi has to win a World Cup. That's why I consider Maradona to be better than him.\n'Diego won things with Argentina. Messi, on the other hand, plays well for Barcelona but doesn't do it with the national team.'\nFive-time Ballon d'Or winner Messi reached 500 goals for Barcelona with his brace in their El Clasico victory over Real Madrid on Sunday.\nDiego Maradona talks to Messi in 2010 during his spell as coach of the Argentina national team\nMaradona scored 312 goals in his club career, which also included a spell at Barcelona, but Romario doesn't believe either are on the same level he was.\n'Within the area, I was much better than Messi and Maradona anyway,' Romario added. 'That's what I think and I say it with a lot of humility.'\nAnd the player Romario currently rates as the world's best is Messi's team-mate and his compatriot Neymar.\nRomario's compatriot Neymar has scored 52 times in 77 appearances for Brazil's national team\n'Today, for how he plays with his club and the national team, I would give the prize of the best in the world to Neymar,' Romario explained.\nCurrently a senator in his birthplace Rio de Janeiro, Romario claims to have scored 1000 goals over his career - though that figure remains disputed.\nThe striker played for Barcelona for two seasons between 1993-95 and won the World Cup with Brazil in 1994.","url":"https://www.dailymail.co.uk/sport/football/article-4448072/Lionel-Messi-vs-Diego-Maradona-Romario-picks-best.html"}
