{"authors":["Abe Hawken For Mailonline"],"date_download":"2018-10-23 01:42:22","date_modify":"2018-10-23 01:42:22","date_publish":"2017-04-26 12:13:27","description":"Shalom, a five-year-old rare white lion, showed off its huge mane by proudly posing for the camera as if it was strutting its stuff on the catwalk at the GG Conservation Centre in South Africa.","filename":"data/vaneerConsumption/LionproudlyposesforcamerainSouthAfrica.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/22/3F9F825400000578-0-image-a-5_1493241248482.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447300_Dandy-lion-King-Jungle-proudly-poses-camera_1540258942.html","title":"Lion proudly poses for camera in South Africa","title_page":"Lion proudly poses for camera in South Africa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This lion has proven that he is king of the catwalk as he proudly poses for the camera in an amazing video.\nThe rare white lion was showing off his mesmerising mane which has been compared to the hairstyles of famous singers Beyonce and Ellie Goulding.\nShalom, five, is the alpha male and king of 73 other lions looked after at the GG Conservation Centre in South Africa.\nShalom, a five-year-old white lion, posed for the camera and showed off its huge mane in South Africa\nPat Shannon and Suzanne Scott care for the lions and have filmed Shalom in all his beauty, standing on a log overlooking his 'pride', reminiscent of the Lion King.\nMs Scott, 48, said: 'Shalom is a beautiful lion and he has so many fans.\n'He has an amazing mane and he's a rare white lion, his white coating and pale eyes are on show due to a recessive white gene which some lions carry.\n'He eats 40kg of meat a week and looks just like a king lion.'\nThe rare white lion (pictured) has attracted a large number of fans because of his mane\nHe is the alpha male and king of 73 other lions looked after at the GG Conservation Centre in South Africa\nWild lion numbers are rapidly declining in Africa due to loss of habitat, poaching, and diseases.\nGG Conservation are a non-profit organisation, and to help the lions and assist them in looking after them, you can donate at http://www.ggconservation.org/donate/.","url":"https://www.dailymail.co.uk/news/article-4447300/Dandy-lion-King-Jungle-proudly-poses-camera.html"}
