{"authors":["Euan Mclelland For Mailonline"],"date_download":"2018-10-22 23:04:53","date_modify":"2018-10-22 23:04:53","date_publish":"2016-01-28 11:44:34","description":"Four lionesses were photographed together in Tanzania's Ngorongoro Crater as they began their hunt for food. But as they closed in on a pack of wild buffalo, not all went exactly how they had planned.","filename":"data/vaneerConsumption/Lionessgoesinforthekillbutgetsbootedinthefacebyabuffalo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A99F1F00000578-0-image-a-42_1453979657353.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420727_That-s-kick-teeth-Lioness-thinks-s-dinner-time-goes-kill-gets-booted-face-buffalo-herd-chase-away_1540249493.html","title":"Lioness goes in for the kill but gets booted in the face by a buffalo","title_page":"Lioness goes in for the kill but gets booted in the face by a buffalo | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"These incredible photos show the moment a lioness goes in for the kill on an unsuspecting buffalo - but the quick-thinking half-tonne beast has other ideas.\nThe hungry lionesses were stalking a large herd of buffalo, and when two got separated from the pack the big cats made their move and pounced.\nBut the buffalo gave as good as he got, booting the lioness off before the whole herd joined him and chased the predators down.\nTake that: A buffalo - cut off from his pack - fights back against a lioness who had sized him up for lunch. As the predator went in for the kill, she was given a hefty kick to the chops...before the tables turned completely\nI'll be having you instead: The buffalo then went after the lioness, chasing after her as she tried to make a desperate escape\nBack to square one: Two of the magnificent beasts regroup on safer ground after their failed attempt at snagging a sizeable lunch\nThe amazing scenes were caught on camera in the Ngorongoro Crater in Tanzania, Africa.\nPhotographer Julia Sundukova said: 'To say that I was excited is an understatement.\n'It was a rainy afternoon, and I was lucky to see the start of the hunt - nine lionesses, one of them pregnant, went towards a huge group of buffalo.\nOn the prowl: Four lionesses are photographed together in Tanzania's Ngorongoro Crater as they begin their hunt for food\nTargetted: The hungry lionesses were stalking a large herd of buffalo, and when two got separated from the pack they made their move\nThe race is on: Having cut off a single buffalo, one of the lionesses makes chase, hurtling after the half-tonne beast across grassland\nBackfired: With her front legs outstretched and sharp claws grasping, the lioness makes her finest effort at stopping her prey. However, the buffalo responds with his own attack - kicking out his hind leg\n'Two buffalos, perhaps a mother and kid, got separated from the others.\n'The lionesses then made a trap, and managed to catch one of them - but when the buffalo realised what had happened they chased the lionesses away.\n'The lionesses tried to take their prey back, but failed.\nTurning the tables: Following her failed attempt, the injured lioness turns away from the herd of buffalo - who then decide to hunt her down\nHow do you like it? With their deadly horns pointed to the skies, the herd of at least fourteen buffalo go after the now fleeing pack\nHunter becomes the hunted: One of the huge buffalo closes in on the lioness, despite being notably slower than the killer cat\nAnd don't come back: With a look of fear in her eyes, the lioness makes her escape - with her new nemesis now breathing down her neck\n'After some time four lions appeared from the bushes - they were warm and sleepy, and ready to have a good dinner.\n'When they realised the lionesses hadn't caught any buffalo they weren't very pleased - they tried again to catch some dinner, but the buffalo chased them away again.","url":"https://www.dailymail.co.uk/news/article-3420727/That-s-kick-teeth-Lioness-thinks-s-dinner-time-goes-kill-gets-booted-face-buffalo-herd-chase-away.html"}
