{"authors":["Gareth Davies For Mailonline"],"date_download":"2018-10-23 01:16:51","date_modify":"2018-10-23 01:16:51","date_publish":"2017-03-16 11:12:12","description":"A pair of lions worked in tandem to tire out the bull giraffe before eventually taking it down and suffocating it in a nature reserve spanning Botswana and South Africa.","filename":"data/vaneerConsumption/LionstagteamtotakedowngiraffeinBotswanaSAreserve.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E536B0F00000578-0-image-a-22_1489662697821.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319614_Incredible-moment-two-lions-tag-team-giraffe_1540257411.html","title":"Lions tag team to take down giraffe in Botswana-SA reserve","title_page":"Lions tag team to take down giraffe in Botswana-SA reserve | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Dramatic photographs have emerged revealing the moment a lion leaps high into the air to sink its teeth into the neck of an adult giraffe in a coordinated ambush.\nA pair of lions worked in tandem to tire out the bull giraffe before eventually taking it down and suffocating it in a nature reserve spanning Botswana and South Africa.\nThe incredible pictures were taken by wildlife photographer Vincent Grafhort who said he was surprised to see the lions target an adult giraffe in an attack that lasted half an hour.\nThe lion leaps high into the air and sinks its teeth into the neck of the passive-looking giraffe after a long, coordinated chase\nThe giraffe runs away from chasing lions as one attempts to leap up onto its back with its mouth open and its claws exposed\nThe pair of lions worked together to tire out the bull giraffe and didn't give up after initial attempts saw them easily shaken off.\nBut after one of them clung on to the giraffe's hind leg, the other made its move and leapt for its neck.\nVincent revealed they pulled the long-necked animal down and suffocated him by covering his muzzle at a nature reserve spreading between Botswana and South Africa\nDescribing what happened, the 42-year-old said: 'Working together with surprising agility, the lions were wearing out the giraffe first. It can run fast but tires easily due to its long windpipe.\n'The lions made two attempts to take down the giraffe, only to be shaken off, but managed to avoid kicks from the larger animal.\n'The giraffe then tried to escape, but before he could reach full speed, one lion managed to get a firm grip on its hind leg.\n'The big cat held on as the giraffe tried to shake him off. The powerful giraffe was tiring as the second lion made his move.\n'They attacked him from two angles followed by hanging on to his rear.\n'Approximately 440kg of lion pulled him down, and once down, it was easy to hold him down.'\nThe lions chased the giraffe for half an hour and the long-necked bull managed to brush off a number of attacks like this one\nAfter a long battle, the giraffe was finally felled by the two lions and one suffocated it by clamping its windpipe\nVincent, who is originally from the Netherlands but lives in Gaborone, Botswana, said it was surprising to see lions take on an adult bull.\nIn his experience, they tend to target babies, but this pride roaming the Kgalagadi Transfrontier Park had their eyes firmly fixed on a bigger prize.\nThe whole sequence took a little over half an hour, and Vincent admitted he was lucky to witness it at all because he was tracking a leopard at the time when the giraffe came running into his sight.\nHe added: 'In my experience lions will think twice before attacking a giraffe, they are dangerous opponents with their long legs with large hooves and long swaying necks with strong stubby horns.\n'Normally the young are targeted mostly and the mortality rate amongst baby giraffes is quite high in many areas.\n'This, however, was a large adult bull.\n'I was quite surprised that only two lions took down this enormous animal.\n'I was actually following a leopard which disappeared in a clump of bushes.\n'As I waited and waited and waited, a giraffe came running past followed by these two lions.'","url":"https://www.dailymail.co.uk/news/article-4319614/Incredible-moment-two-lions-tag-team-giraffe.html"}
