{"authors":["Paul Greenberg"],"date_download":"2018-10-30 18:14:39","date_modify":"2018-10-30 18:14:39","date_publish":"2015-04-22 02:53:00","description":"Military justice is to justice as military music is to music. Not the same. Not the same at all. Yes, it may have clashing cymbals and all the other trappings of a musical performance, like any stirring march, but there is something missing. A lot missing. Namely, music—the kind that carries us along note by note, variation after variation, reaching for the heights, then plunging into the depths, or just lulling and soothing us till the next revelation.","filename":"data/vaneerConsumption/Lipservice.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2015_apr_22_lip-service__page=3_1540923279.html","title":"Lip service","title_page":"Lip service","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Military justice is to justice as military music is to music. Not the same. Not the same at all. Yes, it may have clashing cymbals and all the other trappings of a musical performance, like any stirring march, but there is something missing. A lot missing. Namely, music—the kind that carries us along note by note, variation after variation, reaching for the heights, then plunging into the depths, or just lulling and soothing us till the next revelation.\nAt its best military justice, like military music, may only reveal the obvious. But even the obvious has to be spelled out for the military’s lawheads by some higher authority. The way congressmen like French Hill and Tim Griffin, now our lieutenant governor, had to fight for months on end to make the vast bureaucracy that is the U.S. Army recognize that American soldiers who are attacked by terrorists have been attacked by terrorists. And they deserve Purple Hearts—whether that attack took place in the States or overseas, at Fort Hood in Texas or at an Army recruiting station in the middle of Little Rock, Ark. It doesn’t matter, it’s all part of today’s worldwide jihad against the West.\nNow, at last, those wounded and killed in these acts of war are to receive Purple Hearts, and they and their families the modest benefits that come with the decoration. It’s little enough recognition, and it’s certainly taken long enough. It’s a familiar enough story: When the country finds itself under attack, and the soldier is among the first to respond, he is cheered on. (“Nothing’s too good for our boys!”) But when the danger is past and nigh-forgotten, he becomes The Forgotten Man.\nBut an army of conscripts is less an army than a holding pen. Those of us taking ROTC at the University of Missouri in the now forgotten Fifties would be sent to Fort Leonard Wood on weekends to familiarize us with our 105-mm howitzers. But the visits familiarized us with a lot more: the nature of a peacetime army in the doldrums. The air was heavy with the presence of young men in rumpled fatugues who wanted to be anywhere but there. The language was thick with profanities, the boredom inescapable. Time hung heavy. It was as close to the atmosphere of a prison or an ante-bellum plantation dependent on slave labor as any of us ever wanted to come.\nBill Mauldin, whose Willie and Joe became the incarnation of G.I. Joe during the Second World War, returned home to find those same boys everybody once cheered ignoredor dumped into hospitals run by the Veterans Administration, where delays were endemic. Investigators found that the system’s records had been systematically altered to make it seem the VA was treating patients on schedule. Some died still awaiting treatment.\nYes, the country needed a professional army, a proud and proficient force ready to respond when needed—and it finally got one. But we also created a great divide between those who have served in uniform and those who wouldn’t know a howitzer from a ukelele.\nThat division was going to be avoided by preserving the principle of universal military service, so that professional soldiers would be backed up by Reservists, as they still are to an important extent. But soon enough, once the draft was abandoned, the divide between citizen and soldier became ever greater.\nIf democracy means an equal sharing of burdens, then an American democracy only some of us are willing to defend has become a sham. Fathers who once had to serve in the military now have children who wouldn’t think of doing so. There is a word for that development in a republic: decadence.\nOur leaders never seem to miss an opportunity to praise our brave soldiers, posing for photo-ops with wounded heroes, and effusive in their praise for the military. Yet presidents like Barack Obama and Bill Clinton, much as they admire those who serve in uniform, somehow never got around to serving themselves. Which reduces their fine sentiments to just lip service.\nThe old colonel in charge of recruiting students for the University of Arkansas’ ROTC program has left us a detailed account of how Bill Clinton used him as a foil in order to escape the draft and save his precious “political viability.” Colonel Holmes’ now yellowed letter on an old typewriter is worth saving as an historic document: It records the shock and innocence of an older America, with its simple assumption that duty was to be done, on encountering the new, self-absorbed, all-self-important Me Generation.\nThe citizen-soldier has become the rare exception in American politics. (See Cottton, Tom, Capt., U.S. Army, and U.S. senator from Arkansas.) By praising those who serve, but finding reasons not to serve ourselves, we risk becoming a nation of hypocrites.\nYes, the country needs a professional army, but its members need to have their service recognized, respected, honored . . . . Instead, in these cases out of Fort Hood and Little Rock, they’ve been made to wait like beggars, instead of simply being given their due as a matter of course. With the awarding of these Purple Hearts a measure of justice, however small and however long delayed, has been achieved. Let us here and now resolve that no other soldiers—nor their families—will ever be treated so shabbily again.\n—––––– › –––––—\nPaul Greenberg is the Pulitzer Prize-winning editorial page editor of the Arkansas Democrat- Gazette.","url":"https://www.arkansasonline.com/news/2015/apr/22/lip-service/?page=3"}
