{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:19:04","date_modify":"2018-10-22 23:19:04","date_publish":"2017-04-26 07:15:47","description":"The 53-year-old reality star screamed at Kim Richards during part three Tuesday of The Real Housewives Of Beverly Hills Reunion and called her a 'sick woman'.","filename":"data/vaneerConsumption/LisaRinnascreamsatKimRichardsoverbunnyatreunion.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/07/3F9CBF4B00000578-0-image-a-102_1493187229445.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446152_Lisa-Rinna-screams-Kim-Richards-bunny-reunion_1540250344.html","title":"Lisa Rinna screams at Kim Richards over bunny at reunion","title_page":"Lisa Rinna screams at Kim Richards over bunny at reunion | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lisa Rinna screamed at Kim Richards during part three Tuesday of The Real Housewives Of Beverly Hills Reunion and called her a 'sick woman'.\nThe show opened with Kim returning the fluffy bunny toy that Rinna had gifted to her grandson.\n'I don't feel it was given to me with the right energy,' huffed Kim, 52.\nBunny drama: Lisa Rinna told Kim Richards that she was a 'sick woman' after returning a gift bunny during Tuesday's third and final installment of the RHOBH Reunion\nAdding: 'It would mean a lot to me if I knew she was was sincere'.\nRinna left the room, telling Eileen Davidson: 'She can't demean me and hurt me because I have a beautiful life and I have a beautiful family, and you know what, that's her stuff'.\nKim found Rinna backstage with the bunny and tried talking to her about it.\n'That was the most humiliating thing that's ever happened to me…you are a sick woman,' raged Rinna, 53.\nMutual feeling: Kim shot back that she feels the same way about Rinna\nStormed off: Rinna stormed away while Kim holding the bunny tried to talk to her\nBad energy: Kim returned the gift bunny meant for her grandson to Rinna because it was given with bad energy\nTogether again: Andy Cohen moderated the third and finale reunion episode\n'I want the bunny for the clubhouse,' joked host Andy Cohen, 48, as the women bickered backstage.\nWhen Rinna and Kim finally re-entered the studio Rinna used an electronic toy to tell Kim to 'f*** off' repeatedly.\n'I think you're a sick woman,' repeated Rinna.\nToy time: Rinna used an electronic toy to tell Kim to 'f*** off' repeatedly\nBunny coveting: Andy admitted that he wanted the toy bunny for the Bravo clubhouse\n'I feel the same way about you,' shrugged Kim.\n'You know what Kim, you just want to be on a show and I'm your meal ticket,' griped Rinna.\n'We were the first two on the show, seven years ago,' chimed in Kyle Richards, Kim's younger sister.\nChiming in: Kyle Richards reminded Rinna that she and Kim were the first two on the show\n'You have a very big mouth, you go for the jugular, you go low,' said Dorit Kemsley, 40.\nEden Sassoon vehemently denied trying to 'create a storyline' for herself by badmouthing Kim.\n'You're wrong,' she shouted.\nNot true: Eden Sassoon vehemently denied trying to create a storyline by badmouthing Kim\nLisa Vanderpump then laid into Rinna for 'pretending' to forget saying that Kim was 'close to death'.\nEileen and Kim also shouted at each other about the kerfuffle on game night.\n'Just because you're obnoxious doesn't mean you're right,' raged Eileen, 57.\nBad blood: Eileen Davidson also exchanged harsh words with Kim\nRinna had been the brunt of jokes after she said she'd 'popped a Xanax' in her smoothie.\nBut Dorit denied accusing Rinna of having an actual drug problem.\nRinna brought out her famous 'bag of pills' and ran through its contents, which included Benadryl, estrogen, progesterone, green tea extract and something called 'Relaxed Wanderer'.\nUnited front: Kyle and Kim were a united front as were Lisa Vanderpump and her friend Dorit Kemsley\n'With all due, you could use a Xanax,' said Andy as Rinna prattled on.\nDuring the past season Rinna suggested that people had been using cocaine at Dorit's party.\n'You did it deliberately to defame my character,' complained Dorit.\nCharacter defamation: Dorit alleged that Rinna suggested drug use at her party to defame her character\nWith a rare display of emotion Vanderpump talked about Max, her adopted son who was searching for his birth mother.\n'We found her,' said Vanderpump, who had hired a private investigator for the task.\n'I love him so much, I want him to do what's best for him,' sobbed the restaurateur, who has recently opened a dog rescue center in Los Angeles.\nGetting emotional: Lisa Vanderpump got emotional while talking about adopted son Max\nRinna discussed the nude selfie she'd recently posted on Instagram.\n'I love attention Andy, you know that,' she admitted.\n'My daughters made me take it down,' she added bashfully.\nDorit said she regretted humiliating Erika Girardi (aka Erika Jayne) by giving her some panties, after her husband had caught a glimpse of her nether region at a party.\nLooking back: Dorit said she regretted humiliating Erika by giving her panties and further escalating Pantygate\n'Knowing now, how it affected her and embarrassed her, that was not something that I wanted to do,' she said.\nThe show ended with everyone drinking a green smoothie and Andy taking the infamous bunny to his clubhouse.\nThe third and final reunion wrapped up the seventh season of the hit Bravo show.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446152/Lisa-Rinna-screams-Kim-Richards-bunny-reunion.html"}
