{"authors":["Brenton Garen At Dailymail.Com"],"date_download":"2018-10-23 02:26:34","date_modify":"2018-10-23 02:26:34","date_publish":"2016-01-28 17:15:38","description":"Real Housewives of Beverly Hills star Lisa Vanderpump says she regrets discussing co-star Yolanda Foster’s children Bella and Anwar's health battles on Tuesday's episode.","filename":"data/vaneerConsumption/LisaVanderpumpsayssheregretstalkingaboutMohamedHadidschildren.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC47DF00000578-0-image-a-20_1453998411875.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421265_Lisa-Vanderpump-says-regrets-talking-Mohamed-Hadid-s-children-s-Lyme-disease-Real-Housewives-Beverly-Hills_1540261594.html","title":"Lisa Vanderpump says she regrets talking about Mohamed Hadid's children","title_page":"Lisa Vanderpump says she regrets talking about Mohamed Hadid's children | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She regrets she even acknowledged the subject, adding 'but we live and we learn.'\nReal Housewives Of Beverly Hills star Lisa Vanderpump, 55, took to her Bravo blog on Wednesday to say she regretted discussing co-star Yolanda Foster’s children’s health battles on Tuesday's episode of the reality show.\nThe controversy was sparked when Vanderpump told co-stars that Foster’s ex-husband Mohamed Hadid had denied their children Bella and Anwar suffered from Lyme disease.\nScroll down for video\nRegretful: Real Housewives Of Beverly Hills star Lisa Vanderpump wrote on her Bravo blog on Wednesday, saying she regretted discussing co-star Yolanda Foster and ex-husband Mohammed Hadid's children’s health battles on Tuesday's episode of the reality show\nLisa has been friends with Mohamed for many years and made the comments on the episode during a group dinner.\nWhen asked by Lisa how his children were, Lisa said that Mohamad had replied 'fine,' with the Real Housewives star then alleging that Mohamed told her that only Yolanda has the disease.\n'[Mohammed] just said no, that she’s the only one that has it. He said he doesn’t think that they had it,' Lisa was heard telling her co-stars.\nBrave: Anwar and Bella Hadid revealed their secret battle with Lyme disease at the 2015 Global Lyme Alliance Gala in New York City in October\nMisconstrued: Watch What Happens Live host Andy Cohen read a statement from Mohamed on Tuesday that suggested his response to a question about his children was misconstrued\nOn her Bravo blog, Vanderpump she said she would never delve into the health history of somebody's children, but added that the subject had become a topic after Yolanda brought it to the forefront a week earlier.\nShe said she had no alternative but to speak her truth.\n‘My truth being over the years of interacting with all of the children there had never been any mention of illness,’ the Vanderpump Rules star said. ‘I knew them to thrive, flourish, but I state I had no reason to question their well being.’\nOut of line? The 55-year-old she the subject of Lyme disease had become a topic after being brought to the forefront by Yolanda a week earlier\nTime to clarify: The Vanderpump Rules star said she interpreted Mohamed as always saying his children were fine, and that he had not divulged information that they had Lyme disease\nShe clarified her position, writing: 'Mohamed had always said they were fine, but that is their prerogative as parents, whatever medical issues or information they choose to divulge.'\nThe reality star continued: 'I obviously interpreted that as they were not infected by this insidious disease, and as it is not contagious, I understood them to be healthy.'\nShe ended her blog post by saying she loved and adored them, before signing off.\nYolanda, 52, revealed in October that the former couple's children Bella, 19, and Anwar Hadid, 16, have been secretly battling Lyme disease for over three years. The Real Housewives star was diagnosed herself with the disease in 2012.\nMohamed, 67, took to Bravo's Watch What Happens Live on Tuesday following the episode of RHOBH in which the claims were made that Mohamed had told Vanderpump that Bella and Anwar didn't have the debilitating disease.\nTalk show host Andy Cohen read a statement from Mohamed - who also is the father of top model Gigi Hadid - addressing the matter.\n‘I can only imagine that my response to a question asking how my kids are doing with ''fine'' was misconstrued,’ read the statement.\n‘I have too much respect for all five of my children to speak about them publicly in a restaurant or otherwise. I will not speak further on something that should now be put to rest,' the statement said.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421265/Lisa-Vanderpump-says-regrets-talking-Mohamed-Hadid-s-children-s-Lyme-disease-Real-Housewives-Beverly-Hills.html"}
