{"authors":["Rebecca Lawrence For Mailonline"],"date_download":"2018-10-22 21:06:14","date_modify":"2018-10-22 21:06:14","date_publish":"2017-03-16 00:38:14","description":"Her mother has made quite the stir in the showbiz world following a stint on Big Brother in 2008. And now it looks like time for Sophia to follow in her mother's reality star footsteps.","filename":"data/vaneerConsumption/LisaAppletonsdaughterintalkstostaronLoveIsland.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E50106E00000578-0-image-a-4_1489627307287.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318464_Lisa-Appleton-s-daughter-talks-star-Love-Island_1540242374.html","title":"Lisa Appleton's daughter 'in talks to star on Love Island'","title_page":"Lisa Appleton's daughter 'in talks to star on Love Island' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Her mother has made quite the stir in the showbiz world following a stint on Big Brother in 2008.\nAnd now it looks like it's time for Lisa Appleton's daughter, Sophia-Maria, 26, to take the spotlight as she is reportedly in talks to appear on ITV2's Love Island this summer.\nA source told Daily Star Online: 'Sophia-Maria has seen the press her mum has been getting recently and wants to jump on board.\nScroll down for video\nLike mother, like daughter: It's time for Lisa Appleton's daughter, Sophia-Maria, to take the spotlight as she is reportedly in talks to appear on ITV2's Love Island this summer\n'She applied just like everyone else earlier this year but her link to Lisa will no doubt help her set her apart.'\nLisa was fully behind her 'mini-me's' decision to appear on the show, telling the site: 'She loves to party and socialise and is straight talking and will stand up to anyone as well.'\nMailOnline have contacted a Love Island spokesperson for comment.\nWoah mumma! Lisa Appleton, 48, is known for her wild antics and has made quite the stir in the showbiz world following a stint on Big Brother in 2008\nWhilst the cast of this year's series has yet to be announced, the Appleton ladies were very vocal on about the rumours.\nTaking to Twitter on Wednesday, Sophia tweeted: '@MsLisaAppleton bring it on!!!! @LoveIslandUK #yolo xxxxx'\nLisa then replied: 'You'll be amazing show em what you made of'.\nLookalike: Sophia could be set to take on the ITV2 reality show, with Lisa throwing her support fully behind her 'mini-me' daughter\nReady and raring: Whilst the cast of this year's series has yet to be announced, the Appleton ladies were very vocal on about the rumours\nSophia will no doubt be hoping for a taste of fame similar to her mother's, who is known for her carefree and outrageous photoshoots.\nLisa, 48, shot to fame on the 2008 series of Big Brother when she appeared with then-boyfriend Mario Marconi\nThe couple went on to make history as the first couple to get engaged on the show, before tying the knot on Channel 4 series The Wedding House.\nIn 2013 they called time on their eight-and-a-half year romance, with Lisa claiming that whilst they had been 'unhappy for a while'.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318464/Lisa-Appleton-s-daughter-talks-star-Love-Island.html"}
