{"authors":["Alicia Vrajlal For Daily Mail Australia"],"date_download":"2018-10-22 23:27:31","date_modify":"2018-10-22 23:27:31","date_publish":"2016-01-11 05:42:56","description":"Lisa Origliasso left little to the imagination on Sunday when she posted a revealing snap on Instagram.","filename":"data/vaneerConsumption/LisaOrigliassowearsivorybraonInstagrambutthelightingmakeshertopless.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/2FFCCEFC00000578-0-image-a-121_1452488258352.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393381_Lisa-Origliasso-wears-ivory-bra-social-media-snap-lighting-makes-look-topless_1540250851.html","title":"Lisa Origliasso wears ivory bra on Instagram but the lighting 'makes her topless'","title_page":"Lisa Origliasso wears ivory bra on Instagram but the lighting 'makes her topless' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lisa Origliasso left little to the imagination on Sunday when she posted a revealing snap to Instagram.\nThe 31-year-old, who forms one half of Australian twin singing duo The Veronicas, posed in an ivory bra for the social media image, revealing just a glimpse of her cleavage.\nBut the image was a little overexposed and thanks to too much light she appeared topless in the snap.\nFlaunting it: Lisa Origliasso left little to the imagination on Sunday when she posted a revealing snap on Instagram\nThe singer teamed the busty number with a pair of orange trousers from local label Lenni, allowing her toned stomach and slim arms to be on show for all to see.\n'Viva Italia,' the brunette beauty captioned the snap, leading many fans to believe she and twin sister Jessica were heading to Italy for a holiday.\nOn the official Veronicas Instagram page Lisa posed in another one of Lenni's statement designs.\nAgain a high-exposure shot, the photo made it look as though the singer was wearing nothing beneath her purple vest.\nThe image was captioned thanking the clothing label 'for helping us get wild with 50,000 people at Etihad Stadium last night', making reference to when the girls took to the stage at the Big Bash League match in Melbourne on Saturday night.\nBaring all? Posting another high-exposure shot, this photo made it look as though The Veronicas singer was wearing nothing beneath a purple vest\nGet your engines running: A day earlier The Veronicas hitched a ride on motorbikes to arrive at Melbourne's Etihad Stadium ahead of their performance at the Big Bash League match\nMaking quite the entrance at Melbourne's Etihad Stadium, the twins arrived on the back of motorbikes ahead of the match between the Melbourne Renegades and Melbourne stars.\nThe girls' last major public appearance before the game was at the ARIA Awards in November.\nThey were nominated for two ARIA awards for Song Of The Year and Best Video for their chart-smashing hit You Ruined Me.\nThe song was released in August 2014 and debuted at number one in the ARIA charts.\nSince forming their act in 2005 the sisters have received two ARIA awards.\nRevving it up: Making quite the entrance, the twin singers reclined as they were driven towards the stage","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393381/Lisa-Origliasso-wears-ivory-bra-social-media-snap-lighting-makes-look-topless.html"}
