{"authors":["Kayleigh Giles","Becky Freeth For Mailonline"],"date_download":"2018-10-22 22:02:03","date_modify":"2018-10-22 22:02:03","date_publish":"2016-01-28 09:43:18","description":"Far from camera shy, the 44-year-old model directs her body toward the lens as she stands before the mirror and takes a snap of her enviable frame in a skimpy two-piece.","filename":"data/vaneerConsumption/LisaSnowdonflauntsherampleassetsinskimpytiedyebikini.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9DA3A00000578-0-image-a-35_1453982158570.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420610_Make-free-Lisa-Snowdon-flaunts-ample-assets-skimpy-tie-dye-bikini-poses-racy-snap-Thailand-break_1540245723.html","title":"Lisa Snowdon flaunts her ample assets in skimpy tie-dye bikini","title_page":"Lisa Snowdon flaunts her ample assets in skimpy tie-dye bikini | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She showed off her slim curves in a daring snap that saw her stand in nothing but a neon bra on Wednesday.\nAnd Lisa Snowdon proved there's plenty more where that came from as she stripped down to her bikini and posed up a storm for the camera once again on Thursday as she continues to enjoy a Thailand getaway that caters to her detox needs.\nFar from camera shy, the 44-year-old model directs her body toward the lens as she stands before the mirror and takes a snap of her enviable frame in a skimpy two-piece.\nScroll down for video\nBeach babe: Lisa Snowdon has once again drawn attention to her ample assets as she posed in a floral bikini during her Thailand getaway\nThe radio DJ draws attention to her ample assets in the swimwear, which is emblazoned in a tie-dye print in varying shades of blue.\nThe star's skin is completely free of make-up as she holds her hair away from one side of her face so that her 35,800 followers can recognise her natural beauty.\nUnsurprisingly, Lisa's trip looks to be doing wonders for her frame of mind as a beaming smile is plastered across her face.\nBold: The model also shared the results of her recent well-being efforts when she posed in just her bra for a sexy selfie on Instagram on Tuesday\nLike the most of the celebrity world, Lisa has kicked off 2016 with a wellness regime to beat the bloat.\nThe star boasted about the results for the first time on Tuesday as she posed in the mirror in nothing but her bright bra.\nTaking the self snap from Thailand, where she's committing to three booze-free days of clean eating, the brunette left very little to the imagination about her refined shape.\nPosing with just one hand protecting her modesty, the television personality captioned it: 'Tummy feeling flatter and less bloated this morning.'\nA little R+R: Lisa has taken herself off to Thailand and while she's there she's attempting to 'give her digestive system a break'\nA testament to her neon lingerie and deep tan, the brunette continued that she was feeling 'lighter and brighter' after 'a juice and soup day yesterday and an intense Chi Nei Tsang abdominal massage and Colonic hydrotherapy'.\nLisa has taken herself off to Bangkok for a few days of R&R, where she announced plans ditch carbohydrates and refined sugars.\nKeeping her followers up to date, she shared a holiday snap in her gym knit on Monday outlining her intention to 'keep her curves'.\nShe said: 'Eating clean for 3 days and no booze starting to pay off.. Still got my curves don't want to lose them!!\nLisa added: 'Lots of veg, salads, juices and broths and a little protein. The only thing I slightly crave is dark chocolate but I'm just giving my digestive system a break- I'll be back on the chocolate when I'm back and probably everything else too!'\nThe radio DJ recently confessed that as a young model, she was able to eat whatever she wanted and not gain weight.\nKeeping her curves: The brunette said she would be committing to three days of healthy eating in a bid to keep her curves but beat the bloat\nAt the start of her career, having attended London's Italia Conti School and been scouted as a model, the star was travelling a lot and admittedly binged on bad foods including spaghetti, jacket potatoes and burgers.\nTelling all to The Guardian, Lisa once said: 'At 19, I was in Tokyo on a three-month modelling agency contract, living on my own. Big Macs featured heavily. Not only was the agency above a McDonald's but they'd give me a little map showing western food landmarks.'\nOn her comfort eating habits, she also added: 'Between 14 and 16, I ate a jacket potato with beans and grated cheese on top every day for two years in the [school] canteen.\n'I was very much a creature of habit then. The most exotic meal I'd make then was grilled spag cheese. That's spaghetti with grated cheese on top.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420610/Make-free-Lisa-Snowdon-flaunts-ample-assets-skimpy-tie-dye-bikini-poses-racy-snap-Thailand-break.html"}
