{"authors":["Katie Storey For Mailonline"],"date_download":"2018-10-23 03:29:38","date_modify":"2018-10-23 03:29:38","date_publish":"2017-03-16 14:26:49","description":"The former Big Brother star, 48, has been been soaking up the sunshine overseas and managed to turn the heads of other beach-goers as she flashed her nipples in a racy sheer bikini on Thursday.","filename":"data/vaneerConsumption/LisaAppletonflashesanippleinsheerbikinitop.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54788300000578-0-image-a-99_1489671996200.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320342_Lisa-Appleton-flashes-nipple-sheer-bikini-top_1540265378.html","title":"Lisa Appleton flashes a nipple in sheer bikini top","title_page":"Lisa Appleton flashes a nipple in sheer bikini top | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been soaking up the sunshine overseas.\nAnd Lisa Appleton returned to the beach on Thursday to top up her tan, but it wasn't her bronzed glow that grabbed attention from onlookers.\nThe former Big Brother star, 48, decided to leave her gym wear at home and turned the heads of other beach-goers as she flashed her nipples in a racy sheer bikini while enjoying a game of bat and ball.\nScroll down for video\nTurning heads: Lisa Appleton, 48, turned heads while donning a sheer bikini that flashed her nipples at a Spanish beach on Thursday\nLisa put her famously curvaceous figure on display, teaming a pair of black bikini pants with her daring and intricately cut top.\nThe sheer panels on her bikini left little to the imagination, but a carefree Lisa didn't seem to care as she frolicked in the sunshine.\nThe TV personality cut a confident figure, following her decision to undergo 3D liposuction on her thighs, and seemed in high spirits as she straddled a pile of sand before amusingly throwing it in the air in front of waiting photographers.\nNot a care! The former Big Brother star wasn't fazed by her revealing bikini top and cut a carefree figure in the sand\nLike mother, like daughter: It's time for Lisa's daughter, Sophia-Maria, to take the spotlight as she is reportedly in talks to appear on ITV2's Love Island this summer\nLisa has become known for her over-the-top behaviour and she recently confessed that her audacious antics - which are thought to be behind her split from partner Paul in December - are the result of 'coming out of severe depression.'\nShe told The Sun: 'My behaviour has been over the top and I’ve also had a blow out – I’ve ate and drunk too much. I feel like I have been let out of a cage.\n'I am just starting to live again. I know I have upset a lot of people by rolling around on the beach.\nMeanwhile, Lisa is set to see her lookalike daughter, Sophie-Maria, 26, step into the limelight, as she is reportedly in talks to appear on Love Island this summer.\nA source told Daily Star Online: 'Sophia-Maria has seen the press her mum has been getting recently and wants to jump on board.\n'She applied just like everyone else earlier this year but her link to Lisa will no doubt help her set her apart.'\nLookalike: Sophia could be set to take on the ITV2 reality show, with Lisa throwing her support fully behind her 'mini-me' daughter\nLisa was fully behind her 'mini-me's' decision to appear on the show, telling the site: 'She loves to party and socialise and is straight talking and will stand up to anyone as well.'\nMailOnline have contacted a Love Island spokesperson for comment.\nWhilst the cast of this year's series has yet to be announced, the Appleton ladies were very vocal on social media about the rumours.\nTaking to Twitter on Wednesday, Sophia tweeted: '@MsLisaAppleton bring it on!!!! @LoveIslandUK #yolo xxxxx'\nLisa then replied: 'You'll be amazing show em what you made of'.\nReady and raring: Whilst the cast of this year's series has yet to be announced, the Appleton ladies were very vocal on about the rumours\nSophia will no doubt be hoping for a taste of fame similar to her mother's, who is known for her carefree and outrageous photoshoots.\nLisa, 48, shot to fame on the 2008 series of Big Brother when she appeared with then-boyfriend Mario Marconi\nThe couple went on to make history as the first couple to get engaged on the show, before tying the knot on Channel 4 series The Wedding House.\nIn 2013 they called time on their eight-and-a-half year romance, with Lisa claiming that they had been 'unhappy for a while'.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320342/Lisa-Appleton-flashes-nipple-sheer-bikini-top.html"}
