{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 21:34:14","date_modify":"2018-10-22 21:34:14","date_publish":"2017-04-26 02:04:41","description":"On Tuesday, Lisa Vanderpump looked elegant in a lovely pastel ensemble as she prepped for a flight out of LAX. For her trip, the 56-year-old was joined by one of her eight furry pals.","filename":"data/vaneerConsumption/LisaVanderpumplookslovelyassheprepsforaflightout.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/00/3F9B4A0400000578-0-image-a-31_1493164035140.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4445886_Lisa-Vanderpump-looks-lovely-preps-flight-out_1540244054.html","title":"Lisa Vanderpump looks lovely as she preps for a flight out","title_page":"Lisa Vanderpump looks lovely as she preps for a flight out | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is arguably one of the most beautiful stars in the Real Housewives franchise.\nAnd on Tuesday, Lisa Vanderpump looked elegant in a lovely pastel ensemble as she prepped for a flight out of LAX.\nFor her trip, the 56-year-old was joined by one of her eight furry pals.\nPretty in pink! On Tuesday, Lisa Vanderpump, 56, looked elegant in a lovely pastel ensemble as she prepped for a flight out of LAX\nThe Real Housewives of Beverly Hills star paired a black top with a set of skinny pants.\nLisa layered a light blush coat over her ensemble and added a set of grey pumps, adorned with glitter appliques.\nThe pretty brunette matched her make-up to her coat, choosing a pale pink gloss and cheek to complete her look.\nMeanwhile, her Pomeranian looked adorable with a bright-colored necktie.\nTraveling buddy: For her trip, the reality star was joined by one of her eight furry pals\nThe destination for Lisa's travels is unknown, but perhaps, it had to do with work.\nAside from her rise to fame on the Bravo franchise, the London native is an accomplished businesswoman in her own right.\nShe and her husband of 35 years, Ken Todd, opened 26 restaurants and bars in England's capitol.\nHard workers: Aside from her reality show fame, she and her husband of 35 years, Ken Todd, are successful entrepreneurs. They are pictured in Beverly Hills earlier this month\nStateside, the couple run Villa Blanca in Beverly Hills and SUR in West Hollywood, the latter of which has spawned Vanderpump Rules on Bravo.\nLisa has also used her name to launch a home line, pet accessories, and a collection of emojis.\nThe British beauty is also the author by Simply Divine: A Guide to Easy, Elegant, and Affordable Entertaining.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4445886/Lisa-Vanderpump-looks-lovely-preps-flight-out.html"}
