{"authors":["Deborah Danan"],"date_download":"2018-10-30 19:34:11","date_modify":"2018-10-30 19:34:11","date_publish":"2015-12-23 16:13:10","description":"A large British Muslim family was stopped from boarding a flight bound for Los Angeles amid concerns of a suspected terrorist threat.","filename":"data/vaneerConsumption/LISTENMemberofBritishMuslimFamilyBannedFromUSAWasAlsoBlockedFromIsrael.json","image_url":"https://media.breitbart.com/media/2015/01/disneyland-reuters-e1420683357753.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2015_12_23__1540928051.html","title":"LISTEN: Member of British Muslim Family Banned From USA Was Also Blocked From Israel","title_page":"LISTEN: Member of British Muslim Family Banned From USA Was Also Blocked From Israel","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – A large British Muslim family was stopped from boarding a flight bound for Los Angeles amid concerns of an American overreaction to a suspected terrorist threat, the Guardian reported.\nIn an interview on British radio, it was revealed that one of the family members was also denied entry into Israel. Hear the interview below:\nThe family of 11 was travelling to Disneyland on December 15 but were barred from entering the plane at London’s Gatwick airport, with no reason reportedly given by the U.S. Department of Homeland Security.\nIn an interview with London’s LBC radio, one of the family members claimed that his brother flew to Israel a decade ago but was denied entry at the airport. His brother went to Israel “out of the blue” to visit the “holy mosque” (Al Aqsa) with a group of men, all of whom were detained overnight at the airport.\nThe interviewee claimed that Israel prevented entry to his brother because he is “a bearded man.” The interview was noticed by the Israellycool blog.\nMeanwhile in the UK, senior politicians are warning that an increasing number of British Muslims are being denied entry to the US without being given an explanation.\nBritish Labour MP Stella Creasy asserts that the lack of information from US authorities is contributing to resentment within British Muslim communities.\nMohammad Tariq Mahmood, one of the family members turned away from the flight, told the Guardian that even though there was no official explanation as to why his family were barred entry, the reason is “obvious.”\n“It’s because of the attacks on America – they think every Muslim poses a threat,” Mahmood said.\nTwo days after the family was prevented from boarding their flight, another British traveller, Ajmal Mansoor, an imam and lecturer, was turned away from boarding a flight bound for New York.\nMansoor wrote in a Facebook post, “I am amazed how irrational these processes are but does USA care about what you and I think? I don’t think so!”","url":"https://www.breitbart.com/middle-east/2015/12/23/listen-member-of-british-muslim-family-banned-from-usa-was-also-blocked-from-israel/"}
