{"authors":["Jeff Poor"],"date_download":"2018-10-30 19:28:05","date_modify":"2018-10-30 19:28:05","date_publish":"2016-01-27 01:23:52","description":"Tuesday on Mark Levin's radio show, Sen. Ted Cruz (R-TX), a candidate for the 2016 Republican presidential nomination, reacted to the news that |","filename":"data/vaneerConsumption/ListenCruzChallengesTrumptoOneonOneDebate.json","image_url":"https://media.breitbart.com/media/2016/01/ted-cruz-speaks-at-christian-bookstore-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_01_26__1540927685.html","title":"Listen: Cruz Challenges Trump to One-on-One Debate","title_page":"Listen: Cruz Challenges Trump to One-on-One Debate | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Tuesday on Mark Levin’s radio show, Sen. Ted Cruz (R-TX), a candidate for the 2016 Republican presidential nomination, reacted to the news that the GOP presidential front-runner Donald Trump would not be participating in Thursday night’s debate hosted by the Fox News Channel.\nIn light of Trump’s absence from the Thursday debate, Cruz proposed a one-on-one debate between the two of them with or without moderators.\n“If Donald is afraid of Megyn Kelly, I would like to invite him on your show to participate in a one-on-one debate between me and Donald, mano-a-mano,” Levin said. “Now we could do a number of ways. We could have you moderate it, Mark. We could have Sean Hannity moderate it. We could have Rush Limbaugh moderate it. But you know what, if he is afraid of Megyn Kelly, afraid of you and afraid of Hannity and afraid of Rush, then we could do it without any moderators whatsoever.”\n“I’m happy to go an hour-and-a-half of mano a mano with me and Donald with no moderators any time before the Iowa caucuses. That’s what a candidate who actually wants to work for the people, wants to earn the support of the people — is just stand up and defend your record. And so let’s this – and by the way, he’s been saying this past week he thinks I’m stupid. He should do very well in a debate with someone who is so stupid away from moderators that he is so afraid of.”\nFollow Jeff Poor on Twitter @jeff_poor","url":"https://www.breitbart.com/video/2016/01/26/listen-cruz-challenges-trump-to-one-on-one-debate/"}
te/"}
