{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-31 00:17:48","date_modify":"2018-10-31 00:17:48","date_publish":"2018-07-11 00:00:00","description":"The US has already applied tariffs on $34 billion worth of Chinese imports. Another $16 billion are expected to be implemented within the next two weeks. UBS says the new tariffs are likely to be implemented.","filename":"data/vaneerConsumption/ListofChineseimportshithardestbynewlyproposedUStariffs.json","image_url":"https://amp.businessinsider.com/images/5b45b1907b67142d058b458b-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_china-imports-ustr-tariffs-largest-impact-2018-7_1540945068.html","title":"List of Chinese imports hit hardest by newly proposed US tariffs","title_page":"    List of Chinese imports hit hardest by newly proposed US tariffs - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Gorodenkoff/Shutterstock\nWith $34 billion in tariffs already in place, and another $16 billion arriving within the next two weeks, the US is now planning to apply even more tariffs on Chinese imports.\nIn statement from the US Trade Representative released late Tuesday, it offered a list of around 6,000 goods, totalling $200 billion, that could be hit with additional 10% tariffs by the end of August.\nThe table below from UBS provides a rough guide on what imports will be affected most, detailing the dollar value of imports being targeted based on trade data from last year.\nIt shows the new proposals affect almost $49 billion worth of electrical goods, along with around $38 billion in machinery parts. Some $29 billion worth of furniture and over $11 billion in vehicle imports will also be hit.\nKey targeted products in US trade war USTR, US Census, UBS estimates/Business Insider\nWhile these are only proposed tariffs, if implemented, they point to higher prices for both US businesses and consumers.\nTao Wang, Economist at UBS, says there's little to suggest the US won't follow through with its threat in the absence of a suitable deal with China.\n\"We expect these tariffs to be imposed in September as there is little reason for the US to back down since tough trade actions seem to be boosting the President's popular support according to polls and the US economy is strong,\" she says.\n\"We think it likely that this current escalation becomes reality, but don't see it degenerating soon into an all-out trade war — defined as US imposing significant tariffs on all Chinese exports and China does the same plus serious non-tariff barriers.\"","url":"https://www.businessinsider.com/china-imports-ustr-tariffs-largest-impact-2018-7"}
