{"authors":["Natalia Lusinski"],"date_download":"2018-10-31 01:48:11","date_modify":"2018-10-31 01:48:11","date_publish":"2018-09-11 14:00:55","description":"When it comes to sexually transmitted infections (STIs), although there are a lot of statistics out there, there are also a lot of myths. Whether the myths come from a lack of sufficient sex ed in school, rumors from friends, or stigma, they all do…","filename":"data/vaneerConsumption/LiterallyAnyoneCanGetAnSTIAndItsTimeWeStartTalkingAboutIt.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/10/e7bf2308-5c03-400d-b074-dc46aa7eee37-2t4a1165.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_literally-anyone-can-get-sti-its-time-we-start-talking-about-it-11456698_1540950491.html","title":"Literally Anyone Can Get An STI - And It's Time We Start Talking About It","title_page":"Literally Anyone Can Get An STI — And It's Time We Start Talking About It","title_rss":"NULL","source_domain":"bustle.com","text":"When it comes to sexually transmitted infections (STIs), although there are a lot of statistics out there, there are also a lot of myths. Whether the myths come from a lack of sufficient sex ed in school, rumors from friends, or stigma, they all do the same thing: Relay incorrect information about STIs. So, instead of getting more informed about STI facts, people get less informed. And perhaps one of the biggest — and most dangerous myths around STIs — has to do with the sex-negative stigma around who gets them. STIs do not discriminate. While our culture might have you thinking that you’re sexually irresponsible if you get one, anyone can get an STI — whether they’ve slept with 100 people, one person, or, depending on the STI, even no one. And it's time we start talking honestly about this truth surrounding transmission.\nIn a recent Bustle survey of 226 women ages 18 to 34, one participant said the biggest stigma around women's sexual health is, \"That you won't get an STI if you aren't a 'slut'.\" Another said, \"If you have or have had an STI, it means you sleep around a lot.\" For another, it was, \"That women are somehow less clean for having sex (which makes it harder for them to come forward in the early stages of STIs).\" Clearly, there's a lot of shame and misinformation associated with something that's so common. And that needs to change.\nTake herpes, for example. Although you may think that genital herpes, herpes simplex virus type 2 (HSV-2) — which more than one out of six people aged 14 to 49 years have — can only be passed on through sex, that’s not true. Skin-to-skin sexual contact, aka contact around the genitals with an infected person, can also be a way to get herpes. In other words, you don’t need to be having penetrative sex with someone in order to get the virus — and it’s the same case for other STIs like HPV and syphilis. \"Syphilis, HPV, and herpes are definitely transmitted from skin-skin contact (technically, direct contact with the fluid in a herpetic lesion or warts with HPV). These three STIs are able to pass through intact skin,\" Lawrence A. Siegel, clinical sexologist and certified sexuality educator at the Modern Institutes for Sex Therapy Training and Sage Institute for Family Development, tells Bustle.\n“While herpes is sexually transmitted, it is not true that this only happens to people who have had sex or have had multiple sexual partners.”\nSiegel says herpes infections can be tricky. “What makes these viruses unique is that unlike most other viruses, which require specific ways to get in, HSV is transmitted from point of infection [to] point of contact — no matter where that point of contact is, the mouth, hands, arm, shoulder, anus, foot, etc.,\" he says.\nRegardless of how many sex partners you've had, you're not alone if you get an STI — and it doesn’t say anything about your character if you do. In a way, they’re like colds or the flu: You obviously want to do everything you can to prevent them, but it’s OK if you get one. In fact, can you imagine if people who got colds were stigmatized the same way as people who get STIs?\n“While herpes is sexually transmitted, it is not true that this only happens to people who have had sex or have had multiple sexual partners,” Dr. Martha Tara Lee, relationship counselor and clinical sexologist of Eros Coaching, tells Bustle. “It can happen to anybody. Even kissing or skin-to-skin contact could transfer the herpes virus to someone.”\nIn fact, virgins can get herpes and other STIs, Jamie Dresselhaus, content manager at STDAware, tells Bustle. “[J]ust because a vagina or anus is not penetrated does not mean that there is no risk of herpes transmission. Unprotected contact with an infected area, such as the genitalia, even when no penetration occurs, can present a herpes infection risk.” Even if a condom is used, it’s not foolproof since a herpes infection can be outside of the area the condom protects. “So even with the use of a correctly applied condom, the risk of herpes transmission still exists,” Dresselhaus says.\nHuman papillomavirus (HPV) is another STI that’s commonly associated with reckless sex — but falsely. To that point, in October 2015, researchers analyzed 51 studies about HPV and found that the virus can be in the genital tract of up to 51 percent of women who are virgins.\nScientists believe this was due to various causes, including hand-to-genital contact and masturbation. So, as you can see, both HPV and herpes do not discriminate — both are examples of common STIs that can be acquired without having penetrative sex. Below, a few women share what it was like to be diagnosed with herpes, as well as how they acquired it.\nGetting Diagnosed With Herpes\nAshley Batz/Bustle\nCaitlin, 27, was diagnosed with herpes when she was 22. “It breaks my heart that there’s such a negative stigma tied to it, that people assume you must be a promiscuous person,” she tells Bustle. “The person who gave me herpes was the person I lost my virginity to; someone I loved and thought I could trust.” She says they’d broken up for a while and then tried getting back together. “He told me he’d been tested,” she says. “We had sex with a condom, but it came off halfway through.” A few days later, Caitlin thought she had a yeast infection — but it turned out she had herpes.\nJessica, 31, found out she had herpes 10 years ago after her first visit to the OB/GYN where she got her annual exam. She didn't have any symptoms, but decided to get an STI test when her doctor asked. When she got her results back, she was shocked. \"I was in a relationship, using protection, and had only slept with two people in my life,\" she tells Bustle. \"I'd never had unprotected sex before. I wrongly thought that I needed to sleep around or have unprotected sex all the time in order to get an STI. At first, it was a tough diagnosis, but only because of the shame and stigma associated with herpes. My boyfriend was fine with it and I've been asymptomatic. I've never passed it to anyone. Honestly, the only time it ever affects me is that initial conversation I have with a new partner — and the only reason it does is because of the stigma associated with STIs.\"\nPaige, 26, also unknowingly got herpes — and it came from oral sex. “Last summer, I hooked up with a girl who, after my outbreak, told me that she’d never had any signs or symptoms of HSV,” Paige tells Bustle. “We’d had oral sex and the pattern of my outbreak was consistent with HSV being the likely source. What I think is that she was an asymptomatic carrier of oral HSV-1 and then passed it on to me. Because she didn’t (outwardly) have symptoms, she didn’t think that she could have given it to me. ... The whole experience was pretty intense and really showed me how misinformed myself and other people were about the nature of HSV and how it’s transmitted!”\nEnding The Stigma\nAshley Batz/Bustle\nWhether you have had zero partners, a few partners, or 75, no one \"deserves\" an STI — it's not some sort of punishment. “Anyone who has had sexual contact can get an STI — this includes men and women of all ages, nationalities, ethnic backgrounds, and economic levels,” Dr. Lee says. “While we can do what we can to prevent them ... we may still get a STI.”\nDr. Lee believes that education, communication, and safe sex is crucial when it comes to STIs, as well as lessening their stigma. “It is important to not slut-shame or guilt-trip ourselves so much so that we stop living our lives and expressing our sexuality,” Dr. Lee says. She says it’s important to take care of yourself, but then let go of the rest. “There are always things out of our control within our lives, short of doing what you can,” she says. “Getting an STI does not make you any less lovable or less of a person — and you should never give anybody so much power to make you feel that way.”\nAll that said, if you do get an STI, you’re not alone, and educating yourself about it is the first step.","url":"https://www.bustle.com/p/literally-anyone-can-get-sti-its-time-we-start-talking-about-it-11456698"}
