{"authors":["Riley Morgan For Daily Mail Australia"],"date_download":"2018-10-23 00:48:20","date_modify":"2018-10-23 00:48:20","date_publish":"2017-03-10 07:52:42","description":"A Lithgow man, 27, has been arrested over the incident that saw an 11-month-old baby seriously injured and requiring surgery at the end of last year.","filename":"data/vaneerConsumption/Lithgowmanchargedoverassaultonbabygirl.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E220A3100000578-0-image-a-16_1489140009195.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300088_Man-charged-11-month-old-baby-girl-injured_1540255700.html","title":"Lithgow man charged over assault on baby girl","title_page":"Lithgow man charged over assault on baby girl | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man, 27, has been arrested over the incident that saw an 11-month-old baby fighting for her life and requiring surgery at the end of last year.\nThe baby was seriously injured and found unresponsive when paramedics attended the scene on October 16 last year.\nThe baby girl was rushed to hospital by paramedics before she was then airlifted to the intensive care unit at Children's Hospital where she underwent surgery at Westmead in a critical condition.\nA man, 27, has been arrested over the incident that saw an 11-month-old baby fighting for her life and requiring surgery at the end of last year\nPolice were told initially that the girl had suffered the injuries after falling from her cot.\nFollowing the State Crime Command's Child Abuse Squad investigation into the incident on Friday the 27-year-old man was arrested in Lithgow.\nHe was charged with reckless grievous bodily harm and assault occasioning actual bodily harm, according to the police.\nThe men was refused bail and and appeared at Lithgow Local Court on Friday.\nThe man appeared at at Lithgow Local Court (above) on Friday over the incident","url":"https://www.dailymail.co.uk/news/article-4300088/Man-charged-11-month-old-baby-girl-injured.html"}
