{"authors":["Fehintola Betiku For Mailonline"],"date_download":"2018-10-23 05:26:43","date_modify":"2018-10-23 05:26:43","date_publish":"2016-01-11 18:25:54","description":"Getting 2016 off to a sunny start, Little Mix's Perrie Edwards, 22, is currently enjoying a winter break in the Maldives.","filename":"data/vaneerConsumption/LittleMixsPerrieEdwardsshowsoffherpertposteriorinwhitestringbikini.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/19/300DB6BA00000578-0-image-a-7_1452540766233.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394378_Little-Mix-s-Perrie-Edwards-shows-pert-posterior-white-string-bikini-soaks-sun-break-Maldives_1540272403.html","title":"Little Mix's Perrie Edwards shows off her pert posterior in white string bikini","title_page":"Little Mix's Perrie Edwards shows off her pert posterior in white string bikini | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She overcame heartbreak last year when her ex fiancé Zayn Malik called off their engagement.\nBut getting 2016 off to a sunny start, Little Mix's Perrie Edwards is currently enjoying a winter break in the Maldives.\nTaking to her Instagram account on Monday to give her followers a glimpse of her tropical paradise, the singer, 22, cut a cheeky figure as she uploaded a bikini snap.\nScroll Down For Video\nCheeky: Perrie Edwards showed off her pert posterior in a string bikini on Monday in the Maldives\nResting one hand on the trunk of a tree, the 22-year-old had her back to the camera as she flaunted her stunning curves.\nWith her golden tresses cascading down her back, Edwards appeared to be embracing the glorious weather as she enjoyed some time off her hectic schedule.\nDonning a white string bikini, Perrie simply accompanied the snap with an emoji of a palm tree.\n'Holiday crib': The 22-year-old gave fans a glimpse of her accommodation for her winter break to South Asia\n'Farewell': On Saturday, Edwards hid behind a pair of reflective shades as she uploaded a selfie\nThe former X Factor champion also shared a shot of her picturesque accommodation for the duration of her winter getaway.\nEdwards captioned the photograph, which showcased the bungalow, blue skies and sandy floor: 'Holiday crib'.\nBefore touching down in South Asia, Perrie shared a pre-holiday selfie as she hid behind a pair of reflective sunglasses.\nMeanwhile Edwards recently thanked her Little Mix bandmates for helping her move on after being dumped by Zayn Malik last summer.\nSpeaking to Fabulous magazine, Perrie revealed: 'My bond with Jade, Jesy and Leigh-Anne this year has become even stronger.\n'They’re the most incredibly supportive girls and I'm very grateful to have them.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394378/Little-Mix-s-Perrie-Edwards-shows-pert-posterior-white-string-bikini-soaks-sun-break-Maldives.html"}
