{"authors":["Rebecca Taylor For Mailonline"],"date_download":"2018-10-23 00:22:31","date_modify":"2018-10-23 00:22:31","date_publish":"2017-03-16 09:40:55","description":"Cherry Mactavish's father had been working in Antarctica for four months but managed to return early to surprise his daughter at the school gates in Norwich, in what was an emotional reunion.","filename":"data/vaneerConsumption/Littlegirloverwhelmedwithemotionsheseesherfather.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53305300000578-0-image-a-65_1489663400225.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319376_Little-girl-overwhelmed-emotion-sees-father_1540254151.html","title":"Little girl overwhelmed with emotion she sees her father","title_page":"Little girl overwhelmed with emotion she sees her father | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 'daddy's girl' was overcome with emotion when she saw her father waiting to pick her up from school for the first time in four months.\nCherry Mactavish's father had been working at the Halley Research Base in Antarctica as an electrician, but returned early to surprise his family.\nCherry was leaving school at Buxton Primary in Norwich on March 1 when she spotted her dad in the crowds of waiting parents.\nCherry Mactavish spots her father in the playground, who she hasn't seen in four month as he was away in Antarctica for work\nCherry leaps into dad Alun's arms and he is heard saying 'that's the reaction I wanted' as he hugs her tightly\nShe can be heard shouting 'I see daddy' before beginning her charge towards her much-missed father.\nThe overwhelmed pupil jumps into her father Alun's arms, with four months of anticipatory emotion flooding out at once.\nHer mother Haley caught the reunion on camera before jumping in for a hug herself.\nAlun, above, had been at the Halley Research Base after seeing the incredible job opportunity in his local paper. He released a balloon with his daughter's school from there after she began learning about the Antarctica\nShe said: 'Cherry and Alun have such a close bond, these last few months have been really hard on her.\n'She broke down a number of times at school, she really is a daddy's girl.\n'Her reaction was so emotional, there wasn't a dry eye on the playground, everybody was cheering for her.\n'It had to stop filming and get in on the cuddles, because I too couldn't hold back the tears.'\nAlun, 33, had been working at the Halley Research Base in Antarctica as an electrician since the beginning of November 2016, spending his first Christmas away from the family.\nCherry's mother Haley said the pair have a very close bond and she is a 'daddy's girl' so the four months without him had been particularly hard on her\nThe couple have three children together, aged between three and 11 and he told the Eastern Daily Press the separation was difficult but it was a once in a lifetime experience.\nHe told the paper: 'At the interview in Cambridge I thought there was no way I’d get it. Everyone seemed very academic and spoke so well, but a week after the interview I got the job offer.\n'They all [his family] really pushed me to go for it which, obviously, was the decider in me applying.\n'[My wife] is still glad I came for a once-in-a-lifetime experience.'\nHaley said: 'It means everything to have Alun back with us again, we're a very close family who do everything together.\n'Before this we'd never spent more than two weeks apart in 13 years together.\n'It felt amazing to cuddle up together as a five again.'","url":"https://www.dailymail.co.uk/news/article-4319376/Little-girl-overwhelmed-emotion-sees-father.html"}
