{"authors":["Cynthia Howell"],"date_download":"2018-10-30 14:08:49","date_modify":"2018-10-30 14:08:49","date_publish":"2018-10-30 04:30:00","description":"Arkansas Education Commissioner Johnny Key on Monday authorized a two-week extension to the Little Rock School District's negotiated agreement with its employees that is otherwise due to expire at midnight Wednesday.","filename":"data/vaneerConsumption/LittleRockteacherspactgivenextension.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30__1540908529.html","title":"Little Rock teachers' pact given extension","title_page":"Little Rock teachers' pact given extension","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Arkansas Education Commissioner Johnny Key on Monday authorized a two-week extension to the Little Rock School District's negotiated agreement with its employees that is otherwise due to expire at midnight Wednesday.\nLeaders of the Little Rock Education Association -- the bargaining agent for teachers and support staff -- had asked for a lengthier extension in a meeting with district officials earlier Monday over a proposed waiver of employee protection laws in the district's 22 D- and F-rated schools.\nSuperintendent Mike Poore said Monday night that he had forwarded the association's request for an extension to Key after that 1½-hour negotiations session.\n\"The Little Rock School District and the union have just concluded their first meeting with regards to my proposed amendments to the union contract,\" Key said in a statement late Monday afternoon. \"As a result, I have authorized Mr. Poore to agree to a two-week extension to allow the union to consider language that gives more flexibility to the school district in managing performance.\"\nLittle Rock Education Association President Teresa Knapp Gordon said her team had requested \"a much lengthier\" extension at the bargaining table on Monday.\n\"We'll work with two weeks and if we get to the end of two weeks and we need more time, I assume we can ask again,\" Gordon said in a later interview.\nThe extension -- if formally accepted by association leaders when they return to talks with Poore and his staff on Wednesday morning -- puts to rest at least for the time being the possibility of an employee job action, such as a work stoppage, which had been speculated by some district employees and members of the public in recent days.\nTo that end, both Poore and Gordon issued similarly worded letters to the association members, other district employees, parents and the general public Monday afternoon saying that it is their intention for school to continue for students this week and into the future.\n\"We have been assured by LREA leadership that no vote has been taken to enact any work stoppage,\" Poore's letter stated. \"The District will continue its commitment to work with the union in a manner that fosters two-way communication, with the ultimate goal of doing what is best for our students and staff.\"\nGordon's letter said students are the first priority.\n\"Our goal is for our students to have a wonderful school year with no disruptions,\" she wrote.\nBoth Poore and Gordon wrote that they \"look forward to continued negotiations\" and believe \"these negotiations will result in a positive outcome.\"\nAlso on Monday, in response to questions from reporters, Gov. Asa Hutchinson fully endorsed the proposal made by Key for a waiver of the state's Teacher Fair Dismissal Act and the Public School Employee Fair Hearing Act in the 22 Little Rock schools, which is the point of sharp contention between the district and the union.\nKey acts as the school board in the state-controlled Little Rock district that has no elected school board.\nHutchinson said the state is constitutionally responsible for ensuring that every child has access to a good education, and that the proposed waiver of the school employment protection laws would help to ensure that in Little Rock.\n\"Whenever you look at a D or F school, that's not fair to the children and its not fair to the parents,\" Hutchinson said. \"We want exceptional schools here in Arkansas and that includes Little Rock. No one should be left behind or left out.\"\nMost of teachers do an incredible job, are dedicated and in big demand, the governor said. The proposed amendment to the 2018-19 professional negotiated agreement would \"make it a little bit easier\" to make a change \"if we have a non-performing teacher -- a bad teacher who is not doing a good job.\"\nHutchinson said the union is arguing for the unacceptable status quo and \"fear mongering\" about the possibility of large scale employee firings.\n\"If you look at teachers across Arkansas, they do a good job and they do a good job in Little Rock school district, he said. \"We want to make sure they are rewarded but it is not fair to the excellent teachers we have to stand beside someone who is not doing a good job, who doesn't show up in the classroom and ... year after year they are non-performing, and nothing is done about that. This gives more flexibility and I think the excellent teachers in Little Rock understand that this is necessary to move the schools in a better direction.\"\nKey on Oct. 22 had rejected a 2018-19 tentative agreement between the district and the Little Rock Education Association. He directed Poore to re-enter negotiations with the union to insert language in which the district and association would both support a waiver of the school employee protection laws in the 22 Little Rock schools -- including three high schools -- that recently received D and F ratings from the state.\nThe school ratings or grades are based on student achievement and academic gains on the 2018 ACT Aspire as well as on factors such as student attendance, high school graduation data, and college entrance exam scores.\nThe Arkansas Board of Education would ultimately have to approve any waiver of the school employee protection laws. It has the legal authority to do that in a Level 5-Intensive Support district, such as Little Rock, because of provisions in Act 930 of 2017, that sets up the state's school accountability system.\nGordon said Monday night that she had told Poore that a lengthier extension of the existing 2017-18 negotiated agreement was necessary to study the proposed waiver of the laws.\n\"I communicated to Mr. Poore that I feel we need to be very careful and more deliberate about this directive and that we really need to consider the ramifications on all employees,\" she said. She said, for example, that state Board of Education waivers typically apply to a whole district and not to specific campuses, as is being proposed.\nThe proposed waiver would eliminate time-consuming requirements for principal observations of teachers and the writing and carrying out of employee improvement plans. Key has said repeatedly -- and again on Monday -- that he expects the proposed waiver to be used like a scalpel to remove ineffective teachers and not a chainsaw, and that there would not be mass firings.\n\"The academic success of nearly 11,000 LRSD students in these schools depends on having all administrative tools available,\" Key said Monday. \"The outstanding teachers, administrators and support staff who come to work every day with the sole focus of helping our students achieve their potential have no reason to worry.\"\nBut Gordon questioned what would happen if Key is replaced.\n\"Somebody else could decide to use it like a chainsaw,\" Gordon said of the waiver if it is put into place. \"We have no guarantees if we agree to that and put it in our contract.\n\"Those laws were fought for a long time ago and were fought for a reason,\" she also said in calling for careful deliberation and research.\nMetro on 10/30/2018","url":"https://www.arkansasonline.com/news/2018/oct/30/teachers-pact-given-extension-20181030/"}
