{"authors":["Chelsea Boozer Ryan Tarinelli"],"date_download":"2018-10-30 22:17:28","date_modify":"2018-10-30 22:17:28","date_publish":"2017-03-18 00:00:00","description":"A decade of warnings, memos and complaints about understaffing and long 911 wait times at the Little Rock 911 Communications Center has produced few changes.","filename":"data/vaneerConsumption/LittleRock911centerstaffingperennialproblemvacanciespileupascallloadrises.json","image_url":"https://media.arkansasonline.com/img/photos/2017/03/18/resized_250499-911staffing06_79-22777_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_mar_19__1540937848.html","title":"Little Rock 911 center staffing perennial problem; vacancies pile up as call load rises","title_page":"Little Rock 911 center staffing perennial problem; vacancies pile up as call load rises","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Call-takers work next to empty seats Thursday at the Little Rock 911 Communications Center, where understaffing has long been a problem. - Photo by Stephen B. Thornton\nA decade of warnings, memos and complaints about understaffing and long 911 wait times at the Little Rock 911 Communications Center has produced few changes.\nDespite an ongoing push that began as early as 2005 when Little Rock's police chief first asked city officials to help maintain sufficient manpower at the center that answers emergency calls and dispatches emergency responders within the city limits, manpower problems have persisted. Today, the call center is 13 people short of its full complement of 67. Earlier this year, it was 20 people down.\nLittle Rock's 911 call load has jumped by more than 50 percent since 2010, exacerbating the problem, and city officials say they are concerned about call response times and what can happen when callers can't get through during emergencies.\nThose concerns aren't limited to Little Rock, as officials across the country scramble to keep their call centers fully staffed.\nIn Dallas, two deaths -- one an infant -- have been attributed to callers being unable to reach the city's dispatch center because of technical problems involving a phone service provider. Also, Mayor Tom Rawlings admitted last week that the center is understaffed.\nAlthough Little Rock has had no reported deaths because of an inability to reach 911 assistance, there've been reports of close calls and frustration over not being able to get through, or having to wait several minutes longer than what's considered optimal to reach a call-taker.\nIn January, unanswered 911 calls left Pamela Butler scrambling to save her friend's life.\nButler's friend had called her from an auto parts store and said he planned to commit suicide. Butler rushed to the store. Her four calls to 911 had not been answered by the time she arrived at the store and found her friend unconscious. She was able to resuscitate him, and another caller eventually got through to the dispatch center.\nRELATED ARTICLE LR making tweaks to retain 911 center staffing\nPhoto by Staton Breidenthal\nCity Manager Bruce Moore has said he plans to recommend a new salary system to help retain employees at the Little Rock 911 Communications Center.\nPhoto by Arkansas Democrat-Gazette\nLittle Rock 911 Communications Center vacancies\nAuthorities said a surge of midday calls that day prevented Butler's calls from being answered immediately, and that even a fully staffed communication center could not have handled the onslaught of calls that day.\nSince January, the Little Rock center has answered 67 percent of its 48,025 calls to 911 within 10 seconds. National Emergency Number Association standards require at least 90 percent of an agency's 911 calls to be answered within 10 seconds.\nTwo percent of Little Rock 911 calls during that time, or 1,087 calls, took longer than one minute to answer, data show.\nNonemergency calls to the communications center fare worse. Of the 69,953 nonemergency calls since the start of the year, only 46 percent were answered within 10 seconds and 4 percent, or 3,106 calls, took more than 60 seconds to be answered.\nNOT A NEW PROBLEM\nA paper trail dating back more than a decade documents city officials' inability to hire and keep employees in call-taker positions.\nIn 2005, Police Department leaders begged City Manager Bruce Moore to lift a citywide hiring freeze as it related to call-taker positions.\n\"It is essential that we try to keep these critical positions filled. The hiring process is lengthy, and the qualified applicant pool is limited,\" the police chief at the time wrote in a memo.\nMoore agreed to lift the hiring freeze. A year later a new police chief told Moore in a memo, \"We are constantly faced with high employee turnover\" in the 911 call center.\nIn 2008, the department complained again, with the chief writing that the center \"has never been fully staffed.\"\nFast forward to 2017, and officials are still saying the same things.\nLack of retention is \"haunting,\" said Capt. Russell King, who oversees the division that includes the center.\nYear after year, requests to fill positions are made and granted, yet resignations and terminations result in just as many spots unfilled.\nIn 2012, the number of vacancies reached 24 that December out of 84 positions. Moore wrote in a memo at the time that the city \"might need to think of incentives for filling these vacancies.\"\nIn 2013, the city's Human Resources Department reported concerns about call-taker retention and low pay, and said addressing recruiting and the quality of candidates would be \"meaningless if the retention issue is not addressed.\"\nIn 2015, an independent auditor told city officials that the communications center was \"critically understaffed,\" and that quality of service suffered because employees were working \"a considerable amount of overtime to cover staffing gaps.\"\nSo what's been done since?\nMoore points to an investment in equipment, recent changes in the shifts and the separation of the 311 service request center from the dispatch center so that 911 call-takers don't have to handle service requests.\nVacancies persist.\nThe city has scrambled to ramp up recruiting and retention efforts in the past few months after several people shared stories with the media, expressing disappointment about not getting through to 911 assistance during emergencies.\nMoore is reviewing the center's starting pay and said he plans to have a recommendation by Monday on implementing a step-and-grade system for emergency dispatch center employees within the next 30 days.\nHe also started a committee made up of city employees to brainstorm about ways to retain call-takers -- including looking at the possibility of hiring more part-time trainers.\n\"It's my goal to get us to an adequate staffing level in 2017,\" Moore said. \"It's just a very high-stress type of environment. We've invested in technology, equipment, but it's imperative we do the things we are doing now to ensure we get the people hired and retained. And I think the things we are doing now will definitely enhance our ability to do that.\"\nLOW STAFFING, LONG WAITS\nLast month, Kara Darling arrived home on a Friday afternoon with her 6-year-old daughter to find her carport door had splinters of wood sticking out and its glass broken.\nDarling, unsure whether burglars were still in the house, drove away and called 911.\n\"It kept ringing and ringing. No one ever picked up,\" she said.\nShe hung up and immediately called again. The cellphone time stamp read 1 minute after her first call. She got the same results. The phone rang, but no one answered.\nShe then called the 311 nonemergency request line. An operator picked up, and officers arrived at her home 30 minutes later.\n\"Luckily no one was in need of immediate emergency medical care, however I had no clue if anyone was still in my home,\" Darling wrote in an email to her city board representative. \"What can be done? Why could I never get through to 911? How can I be reassured that our emergency system will work if/when I need it again?\"\nVice Mayor and Ward 3 City Director Kathy Webb responded, saying that what happened \"is horrible and unacceptable,\" and calling the city's efforts an \"inexcusable response.\" Ward 3 includes the Heights and Hillcrest neighborhoods of Little Rock.\nIn response to Darling's email, Assistant City Manager James Jones told Darling that the city's emergency system \"does work\" and that a team was \"looking at how to revamp, improve and speed up the process of hiring, staffing and training.\"\nThe 2015 audit by the Association of Public-Safety Communications Officials-International concluded that callers hanging up the phone and immediately calling back contributed to the problem of them not being able to get through quickly. The city paid $22,100 for the independent audit.\nCalls are answered in the order they are received. If a caller hangs up and calls back, he then moves to the back of the line. Also, dispatchers have to call back any abandoned calls, which takes away time from handling incoming calls.\nAnd, officials say, tests have shown that a call rings on the caller's phone three or four times before the phone ever rings in the dispatch center.\n\"Never should one hang up and redial because one loses their place in the queue and goes back to the end of the line when calling again,\" Jones said.\nUsually, there are only two to three workers on duty to handle calls. Optimally, there would be eight to 10, Communications Center Director Laura Martin said.\nCall-takers answer 911 calls and obtain some information before forwarding the information to a dispatcher, who is then responsible for figuring out what emergency units should respond.\nThe Little Rock Communications Center has 22 call-takers positions and 29 dispatcher positions.\nThe center reported double-digit job openings in end-of-year personnel totals for the past nine years.\nFrom 2008-11, job vacancies hovered between 14 percent and 21 percent. A sales tax increase in 2011 funded a dozen new call-taker positions. The vacancy rate jumped to 29 percent in 2012 when the center reported a total of 24 vacancies in a unit authorized for 84 positions.\nVacancy rates stayed between 25 percent to 30 percent in end-of-year personnel totals from 2013-16.\nNATIONWIDE COMPARISON\nReports nationwide make clear that staffing-level struggles and the resulting problems aren't unique to Arkansas' capital city.\nMoore had his staff provide him with a comparison of starting salaries from nearby 911 centers.\n\"Maybe there's not enough separation between Little Rock and some of the smaller cities. When you have to work every weekend or are scheduled to be off and they call you in, that impacts you. You might say, 'I'll take $5,000 less and have weekends with my family,'\" he said.\nLittle Rock's starting salary for a call-taker is $28,494, and it's $30,780 for a dispatcher. The call center handled 629,663 emergency and nonemergency calls last year.\nThe center is one of three in Pulaski County, along with the North Little Rock 911 dispatch center and the Pulaski County sheriff's office emergency call center. Potential employees can go to either of those and make about the same amount of money, or more if they have some experience, and handle fewer calls.\nAt the county and North Little Rock agencies, 911 operators answer calls and dispatch responders -- rather than there being separate positions for those duties. The county's dispatcher position has a starting salary of between $29,121 and $32,758 at a center of 18 employees who handle 180,486 calls a year. There are currently no vacant positions at the county.\nIn North Little Rock, the call center has 32 employees with eight full-time vacancies and three part-time vacancies right now. Dispatchers with no experience start out at $29,872. The center's call load last year was 197,394 calls.\nThe Arkansas Democrat-Gazette reviewed salaries and the vacancies at emergency dispatch centers in Southern cities similar in size to Little Rock. In many cases, lower salaries meant higher vacancy rates.\nIn Augusta, Ga., there are 15 vacancies out of 70 positions. The starting salary is $22,732.\nIn Montgomery, Ala., there are 15 vacancies on a staff of 56. The starting salary is $28,205 for call-takers and $31,700 for dispatchers.\nIn Chattanooga, Tenn., the call center is countywide. Out of 137 positions, there are usually no more than 15 vacant at any given time. The starting salary is $29,072, but that increases after a year probationary period to $31,307.\nBaton Rouge has 39 call center positions and about four are vacant at any given time. The center is currently fully staffed and the starting salary is $37,293.\nChristopher Carver, director of 911 operations for the National Emergency Number Association, said vacancies at emergency dispatch centers are \"incredibly widespread.\"\nThere are a list of factors, including long hours and a stressful work environment. Often employees are underpaid and can be ordered to work overtime, which can drain employee morale.\nWhen an employee leaves, that creates more work for the remaining staff. Employees have been known to suffer from post-traumatic stress disorder and other health problems related to stress, Carver said.\nAlthough vacancies are common, he said, the problem is solvable.\nIt takes community members and elected officials to engage in solving it, sometimes by focusing more on 911 operators -- who are the first line of contact -- instead of prioritizing the hiring of police officers or firefighters, he said.\nIn Little Rock, lack of funding isn't an issue in keeping the call center jobs filled, officials say. The 911 franchise fees that people pay on their phone bills fund the call center operations. Whatever is left over goes into the city's general fund.\nCall center salaries come out of the general fund. The city uses a formula to budget for a certain percentage of vacancies citywide each year. Officials say there's adequate funding to fill all 13 current call center vacancies and keep that department fully staffed.\nMoore said he has already approved a change from eight-hour shifts to 12-hour shifts for call center workers, which he said will be a great advantage in recruiting employees because they will work fewer days and have every other weekend off.\nHe noted that call-takers received a 5 percent bonus in 2016 that no other city employees received.\n\"It's not like we haven't tried. Our recruitment efforts have continued,\" Moore said.\nMetro on 03/19/2017","url":"https://www.arkansasonline.com/news/2017/mar/19/911-center-staffing-perennial-problem-2/"}
