{"authors":["Heather Waugh For Dailymail.Com"],"date_download":"2018-10-22 20:09:48","date_modify":"2018-10-22 20:09:48","date_publish":"2016-01-28 00:26:09","description":"The season four premiere of Little Women: LA airs tonight and it looks to be an explosive series as two of the women hurl glasses of drinks at each other and trade insults.","filename":"data/vaneerConsumption/LittleWomenLAsChristyMcGinityhasaglassthrowninherfacebyTerraJole.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/27/23/30A5B4AE00000578-0-image-a-23_1453938607095.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420086_Little-Women-LA-star-Christy-McGinity-glass-thrown-face-star-Terra-Jole-bar-fight-left-hospitalized_1540238988.html","title":"Little Women: LA's Christy McGinity has a glass thrown in her face by Terra Jole","title_page":"Little Women: LA's Christy McGinity has a glass thrown in her face by Terra Jole | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The season four premiere of Little Women: LA airs tonight - and it looks to be an explosive series.\nNew footage from an upcoming episode shows two of the reality stars, Christy McGinity and Terra Jole, go head-to-head in a bar fight - and things turn ugly pretty quickly.\nIt is the first glimpse of the brawl - which took place at Borderline Bar & Grill in Thousand Oaks - that put Christy, 38, in hospital with a head injury earlier this month.\nScroll down for video\nKicking off: The moment that Christy McGinity was hit with a glass has been revealed in a clip from the new season of Little Women: LA which premieres on Wednesday\nIt all begins when Terra commands 'Do you swear on your parents that you never said anything about me?'\nChristy responds defiantly 'Yeah I didn't say s**t about you!'\nTerra, 35, accuses her co-star of lying 'Once a liar always a f***ing liar - everything that comes out of your mouth is a f***ing lie'\n'You're lying to my face!' Christy came head-to-head with Terra Jole who accused her of lying\n'You b***h!: The 38-year-old turned the tables on Terra and accused her of lying about her drinking\nWhen Christy turns the tables on her pal and accuses her of lying, Terra asks 'about what?' which leads Christy to spit back 'About my drinking you b***h'\nWith that, Terra hurls a full glass of water at Christy's face and the women go back and forth with missiles.\nChristy eventually gets up and leaves the table telling her cast-mate 'You know what, we've been friends forever' as Terra yells back 'Bye wet cowboy'\nOn the attack: When Christy called her the B-word Terra responded by throwing a full glass of water in her face\nRetaliating: After her drenching Christy threw a drink back at Terra\nGirls' night gone wrong: The women were hanging out at Borderline Bar & Grill in Thousand Oaks, California\nThe brunette reality star heads to the back of the bar crying inconsolably where she tells Briana 'She hit me in the head with the f***ing glass'\nJust as producers claimed earlier this month, the ladies do indeed appear to have been drinking iced tea in the clip - so alcohol was likely not a factor in the fall out.\nTMZ reported earlier this month that Christy was hospitalized with two brain contusions after the attack by reportedly two of her cast-mates.\n'You know what, we've been friends forever' Christy reminded her co-star as she walked off\n'Bye wet cowboy': Terra kept hurling abuse at Christy as she walked off\nShow producers said the mother-of-two was taken to urgent care, but when her headaches wouldn't cease she checked herself in to Cedars-Sinai Medical Centre.\nChristy claimed in an Instagram post on January 4 that she has been sober for six years.\n'I'm six years sober today,' she wrote. 'Thanks to my higher power, steps, sponcer, AA Meetings, My AA Family, my kids, my family and everyone else for your love and support xo I love you all' (sic)\nSeason four of Little Women: LA premieres Wednesday at 9pm ET on Lifetime\nThe reality star was inconsolable at the back of the bar as she said 'She hit me in the head with the f***ing glass'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420086/Little-Women-LA-star-Christy-McGinity-glass-thrown-face-star-Terra-Jole-bar-fight-left-hospitalized.html"}
