{"authors":[],"date_download":"2018-10-22 20:58:49","date_modify":"2018-10-22 20:58:49","date_publish":"2014-06-03 00:00:00","description":"Meet some of the original “boys of summer” from the first-ever season of Little League.","filename":"data/vaneerConsumption/LittleLeagueTurns75FindOutHowItAllBegan.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/485426/nn-140603-little-league-1704_63d19b510ea7ae15986256669e569610.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_mr-smith-goes-to_little-league-turns-75-find-out-how-it-all-began-n121646_1540241929.html","title":"Little League Turns 75: Find Out How It All Began","title_page":"Little League Turns 75: Find Out How It All Began - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"In 1939, Williamsport, Pennsylvania, was a proud and prosperous industrial town, still struggling with the effects of the great depression. If you were a kid you spent a lot of time outdoors, and a lot of time playing pickup baseball games.\nNot everyone had a glove. So you’d leave your mitt in the field when it was your side’s turn to hit. And if you had a bat or a ball it was wrapped in electrical tape: the bat to hold it together and the ball because the cover had long since worn off.\nPlay Facebook\nTwitter\nEmbed ‘I Got a Hit!’ First Little League Players Share Their Memories 2:26 autoplay autoplay Copy this code to your website or blog\nInto that scene walked a man named Carl Stotz, a local guy who loved baseball and thought it might be a great way to teach kids sportsmanship and teamwork. He contacted business after business in Williamsport. Jumbo Pretzel, Lycoming Dairy and Lundy Lumber came up with sponsorship money and Little League was born.\nBill Bair, Al “Sonny” Yearick, Thomas “Tuck” Frazier, Dick Hauser, Charlie Smith and Dave Hinaman, now all in their 80s, were original members of those first teams.\n“Little did we realize back in 1939 that it would blossom into a big thing like this,” Bair said fondly.\nSix of the original “boys of summer,” who played on the first-ever Little League in 1939. From left to right, in the back row: Bill Bair and Dick Hauser. In the middle row: Charlie Smith, Thomas “Tuck” Frazier, and Dave Hinaman. In the front: Al “Sonny” Yearick. Little League Baseball, Incorporated\nThe men talk of the games as if they had been played yesterday. They were rivals and friends. One guy loved his uniform so much he didn’t want to take it off. Hauser remembered thinking, “Holy Jeepers! This is great! This is almost out of a dream!”\nSeventy-five years later, more than 160,000 teams play in 80 different countries. But those first boys of summer knew what happened to them was special. It was like a gift.\n“We were just the luckiest guys in the world,” Yearick said. “That’s all I can say.”\nWatch the story tonight on “Nightly News with Brian Williams.”","url":"https://www.nbcnews.com/feature/mr-smith-goes-to/little-league-turns-75-find-out-how-it-all-began-n121646"}
