{"authors":["Linda Satter"],"date_download":"2018-10-30 01:16:48","date_modify":"2018-10-30 01:16:48","date_publish":"2018-09-14 00:00:00","description":"A Little Rock attorney pleaded guilty Thursday in federal court to a wire fraud charge, admitting he stole more than $400,000 from a client's trust account in the past three years.","filename":"data/vaneerConsumption/LittleRockattorneyadmitsstealingmorethan400000fromtrust.json","image_url":"https://media.arkansasonline.com/img/photos/2018/09/14/Screen_Shot_2018-09-14_at_6.49.31_AM_t600.png?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_sep_14_lr-attorney-admits-stealing-funds-from-__page=1_1540862208.html","title":"Little Rock attorney admits stealing more than $400,000 from trust","title_page":"Little Rock attorney admits stealing more than $400,000 from trust","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A Little Rock attorney pleaded guilty Thursday in federal court to a wire fraud charge, admitting he stole more than $400,000 from a client's trust account in the past three years.\nU.S. District Judge James Moody accepted a guilty plea from Matthew Mahlon Henry, 45, who has been a licensed attorney for 13 years. U.S. District Judge Billy Roy Wilson, for whom Moody was filling in Thursday, will sentence Henry at 2 p.m. Dec. 19.\nHenry faces up to 20 years in prison and a fine of up to $250,000, and will be required to pay restitution of at least $440,658.09, according to court documents. The amount of money he took and the fact that he abused a position of trust, as the victim's attorney, will subject him to a higher penalty range than a single count of wire fraud would otherwise bring, according to his plea agreement.\nAccording to a charging document, Henry, who ran The Henry Firm in Little Rock, was retained in February 2015 to perform probate work related to a client's deceased relative. As part of his representation of the client, he received about $440,000 in estate funds between August 2015 and August 2016, which he deposited into his client's trust account.\nBetween August 2015 and January of this year, the charging document states, Henry intentionally schemed to defraud the trust account by making multiple incremental transfers from the account at Arvest Bank into his own business account at Arvest. He then used his business account to pay for business and personal expenses.\nIt says he made about 200 transfers out of the trust account, with the amounts typically ranging from $500 to $5,000. The frequency of the transfers varied from two in one month to 14 in a single month, and ended when the account was depleted, the document states.\nIt noted that Henry had agreed to represent the client for a minimum $12,000 retainer.\nHenry didn't pay any of the estate funds to the client, who retained another attorney, according to the charging document. It said that on Feb. 23, Henry emailed the client's new attorney and said that in three days, he would deliver $403,658.09 that he owed the client. It said he attached a fake email chain indicating he had asked an Arvest Bank official to prepare a certified check in that amount from the trust account, but in fact, on Feb. 26, the account had a balance of only $6.59.\nThe email to the client's new attorney is what constituted the wire fraud charge to which Henry pleaded guilty Thursday, accompanied by his attorney, Jeff Rosenzweig of Little Rock.\nRecords at the Arkansas Supreme Court show that on March 7, the Supreme Court Office on Professional Conduct suspended Henry from practicing law for violating Rule 1.15 of the Arkansas Rules of Professional Conduct, which concerns safekeeping property and trust accounts.\nAn order signed that day doesn't place a time limit on the suspension. It said that Stark Ligon, the office's executive director, had alleged that Henry \"poses a substantial threat of serious harm to the public and to his clients if he continues to practice law.\"\nIn response to Ligon's petition, the Committee on Professional Conduct classified the allegations as \"serious misconduct,\" and noted that about $400,000 in client funds from a Jefferson County Circuit Court case \"are not presently accounted for by Mr. Henry.\"\nThe order of interim suspension said Henry had also been ordered to show cause in March why he failed to obey a Pulaski County Circuit judge's Jan. 23 order directing him to pay over $25,000 in funds that he claimed to be holding as part of a civil case, and to provide the court all of the firm's trust account records dating back to Oct. 1, 2017.\nADVERTISEMENT\nMore headlines\nMetro on 09/14/2018","url":"https://www.arkansasonline.com/news/2018/sep/14/lr-attorney-admits-stealing-funds-from-/?page=1"}
