{"authors":["Arkansas Democrat-Gazette"],"date_download":"2018-10-30 21:57:29","date_modify":"2018-10-30 21:57:29","date_publish":"2015-05-18 00:00:00","description":"A Little Rock physician who admitted to illegally distributing addictive opiates has been sentenced to nine years in prison.","filename":"data/vaneerConsumption/LittleRockdoctorwhosoldfraudulentprescriptionsgets9yearsinprison.json","image_url":"https://media.arkansasonline.com/img/photos/2015/05/18/DR._Richard_Johns_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_aug_30_little-roc_342fc70ce81c9bae0dca11c709085497__page=1_1540936649.html","title":"Little Rock doctor who sold fraudulent prescriptions gets 9 years in prison","title_page":"Little Rock doctor who sold fraudulent prescriptions gets 9 years in prison","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A Little Rock physician who admitted to illegally distributing addictive opiates has been sentenced to nine years in prison.\nIn a hearing before U.S. District Judge Brian Miller in Little Rock, Richard Johns called his actions \"deeply shameful\" and acknowledged taking money for prescriptions that \"were neither necessary nor warranted.\"\nJohns, whose medical license has been suspended since June 2015 after his arrest in Lonoke County, originally faced charges that included conspiring to distribute oxycodone without an effective prescription, the use of which caused a Cabot man's death, and six counts of distribution of oxycodone.\nThe inclusion of the death in the conspiracy charge would have made the crime punishable by up to 20 years in prison had he been convicted.\nIn a plea agreement earlier this year, prosecutors dropped some charges in exchange for Johns' guilty plea to a new charge of conspiring to distribute the Schedule II controlled substance without an effective prescription — without the added element of causing a death.\nUnder the plea deal, Johns agreed to turn over to the government $155,620 in cash that was seized from his home during a search in April 2015 and a 2006 Ford F250 pickup in which he conducted prescription-selling transactions.\nRead Thursday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2017/aug/30/little-rock-doctor-who-sold-fraudulent-prescriptio/?page=1"}
