{"authors":["Kate Thomas For Mailonline"],"date_download":"2018-10-23 04:46:12","date_modify":"2018-10-23 04:46:12","date_publish":"2017-03-10 14:55:39","description":"The Little Mix singer, 23, isn't hiding her feelings for the Aresenal footballer, showering her new man with compliments in a recent interview.","filename":"data/vaneerConsumption/LittleMixsPerrieEdwardsswoonsoverboyfriendAlex.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E23668200000578-0-image-a-105_1489157366382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301570_Little-Mix-s-Perrie-Edwards-swoons-boyfriend-Alex_1540269972.html","title":"Little Mix's Perrie Edwards swoons over boyfriend Alex","title_page":"Little Mix's Perrie Edwards swoons over boyfriend Alex | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She only recently went public with her boyfriend Alex Oxlade-Chamberlain.\nAnd now the secret is out, Perrie Edwards isn't hiding her feelings for the Aresenal footballer, showering her new man with compliments in a recent interview.\nThe Little Mix singer, 23, was quizzed about her love life in a filmed chat, which has surfaced on Twitter.\nScroll down for video\nSmitten kitten: Perrie Edwards has lavished her boyfriend Alex Oxlade-Chamberlain with compliments in a recent interview\nThe reporter goes around all the girls, grilling them about who they're dating, and finishing off with Perrie.\nThe Shout Out To My Ex hitmaker certainly didn't hold back, squealing: 'I have a boyfriend and his name is Alex.\n'He plays for Arsenal. He's very cute and hot… and sexy.'\nLoved up: The Shout Out To My Ex hitmaker certainly didn't hold back, squealing, 'He's very cute and hot… and sexy'\nJesy Nelson nods in agreement, chiming in: 'He is very hot!'\nProbed further about her man's football career, Perrie jokes: 'I don't know much about football, but I know a lot about him!'\nThe other girls weren't quite as forthcoming about their men, with Leigh-Anne Pinnock sweetly saying, 'My darling boyfriend is called Andre Gray and I love him greatly.'\nEnamored: Probed further about her man's football career, Perrie jokes, 'I don't know much about football, but I know a lot about him!'\nJade Thirwall quipped, 'My boyfriend's called Jed and he's over there', with the camera panning over to The Struts rocker in the corner.\nJesy Nelson set the rumour mill into overdrive, seemingly confirming she was seeing someone new by simply stating, 'Not ready for that yet'.\nThe stunner has been linked to TOWIE star Chris Clark of late following a host of cosy looking social media videos and posts.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301570/Little-Mix-s-Perrie-Edwards-swoons-boyfriend-Alex.html"}
