{"authors":["Associated Press"],"date_download":"2018-10-22 22:51:20","date_modify":"2018-10-22 22:51:20","date_publish":"2017-04-26 06:05:23","description":"BOSTON (AP) - The rate at which minorities are subjected to stops, searches and frisks by police doesn't appear to be improving in Boston in the year since...","filename":"data/vaneerConsumption/LittlechangeonraceinBostonpolicestops.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4446382_Little-change-race-Boston-police-stops_1540248680.html","title":"Little change on race in Boston police stops","title_page":"Little change on race in Boston police stops | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BOSTON (AP) - The rate at which minorities are subjected to stops, searches and frisks by police doesn't appear to be improving in Boston in the year since the department claimed it was narrowing racial disparities in their tactics.\nAt least 71 percent of all street level, police-civilian encounters from 2015 through early 2016 involved persons of color, while whites comprised about 22 percent, an Associated Press review of the most recently available data shows.\nThat's only a slight decline from the 73 percent that minorities comprised in such street-level encounters between 2011 and early 2015, according to data the city made available last year.\nIt's also higher than the roughly 63 percent that blacks comprised between 2007 and 2010, according to a report the department released in 2015. That report didn't include the tallies for other minority groups.\nAnd the gap between minorities and whites in the most recent reporting period is likely higher.\nOver 7 percent of all police-civilian encounters compiled in the department's 2015 to 2016 \"Field Interrogation, Observation, Frisk and/or Search\" reports don't list the civilian's race at all.\nCivil rights activists have complained for years that blacks, in particular, comprise a majority of these kinds of police interactions in Boston, despite accounting for about 25 percent of the population.\nThe disparity matters because it affects how some residents in largely minority communities perceive police, said Carl Williams, of the Massachusetts chapter of the American Civil Liberties Union, which provided the recent police data the AP analyzed.\n\"People feel uncomfortable talking with police when they feel they're getting stopped unjustly,\" he said.\nBig city police departments vary in how they collect data on such encounters and how public they make it.\nNew York City Police, prompted by a class action lawsuit, has been releasing quarterly reports for years, something the Massachusetts ACLU chapter has also sued Boston to provide.\nNew York's data shows at least 83 percent of stops through the first three quarters of 2016 involved blacks or other minorities. From 2011 to 2014, they averaged roughly 84 percent of stops.\nPhiladelphia police also provide regular data as part of a court order. The most recent report , which covers the first half of 2015, shows minorities accounted for 77 percent of stops during that time period.\nBoston Police spokesman Michael McCarthy argued the AP's review was \"not appropriate and quite frankly irresponsible\" because it didn't account for other variables. The department has said neighborhood crime statistics, a subject's prior arrests and gang affiliations, among other factors not addressed in the data, also should be considered.\n\"Anything short of that is a complete disservice,\" McCarthy said in an email. \"Too many reporters think they can look at this data set and accurately describe what it means.\"\nLast year, the department enlisted independent researchers to conduct a deeper study of the 2011 to 2015 data. Further analysis would bear out how police are making gains in perceived disparities in treatment, it said at the time.\nBut that study won't be complete at least until this summer because researchers are seeking more information from police, said Anthony Braga, head of Northeastern University's criminal justice school and a researcher on that study.\nHe also dismissed analysis of the raw data before that study was complete as \"overly simplistic, woefully incomplete, and, quite frankly, irresponsible.\"\nBut Shea Cronin, a criminal justice professor at Boston University, who is not affiliated with the police data study, said the numbers were fairly clear cut.\n\"My reading of the statistics is that there has not been much change in the racial composition,\" he said.\nCronin suggested the department should incorporate reviews of these and other statistics in their management evaluations to see whether specific officers, units or shifts use such tactics most often.\nIn an improvement on past data, the latest numbers from Boston Police provide more detail about the reasons for the police-civilian encounters and some of the actions police took as a result.\nIn about 21 percent of the incidents from 2015 to early 2016, for example, officers cited \"reasonable suspicion\" as the reason they engaged suspects. In 31 percent of the time, officer's cited \"probable cause.\"\nGenerally, police need at least \"reasonable suspicion\" a crime has been, is being or will be committed in order to stop, briefly detain or frisk an individual. \"Probable cause\" is a higher legal threshold needed to arrest someone.\nOf the more than 17,300 total incidents, officers frisked civilians about 21 percent of the time, searched them or their vehicles over 16 percent of the time, and issued a summons 2 percent of the time.\nThe data covering 2011 to early 2015, in contrast, provided little to no detail about why officers engaged with civilians, why a person was subsequently subjected to a search or frisk, and what the outcome of the encounters was, an AP review found.\nThe new data, however, still lack details about what, if anything, came of the stops in terms of arrests or seizures. Civil rights groups have said such information is critical to gauging whether the methods are effective.\n\"The question remains: Are there aggressive tactics being used?\" said Darnell Williams, of the Urban League of Eastern Massachusetts. \"We're not here to second-guess what police are doing, but if there is a disproportionate amount of blacks being stopped for non-obvious reasons, then that's a concern.\"\n___\nFollow Philip Marcelo at twitter.com/philmarcelo. His work can be found at http://bigstory.ap.org/journalist/philip-marcelo .","url":"https://www.dailymail.co.uk/wires/ap/article-4446382/Little-change-race-Boston-police-stops.html"}
