{"authors":["Press Association"],"date_download":"2018-10-22 22:34:13","date_modify":"2018-10-22 22:34:13","date_publish":"2016-01-28 10:41:52","description":"The widow of poisoned spy Alexander Litvinenko will meet Theresa May today. Marina Litvinenko will have private talks with the Home Secretary a week after an...","filename":"data/vaneerConsumption/Litvinenkowidowtomeethomesecretary.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-99e5f9b5-933d-496b-8130-05b9c878ee9c-2vdWmEltwXfba0ce28e632769bd5-216_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420462_Litvinenko-widow-meet-Home-Secretary_1540247653.html","title":"Litvinenko widow to meet home secretary","title_page":"Litvinenko widow to meet home secretary | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Litvinenko widow to meet Home Secretary\nThe widow of poisoned spy Alexander Litvinenko will meet Theresa May today.\nMarina Litvinenko will have private talks with the Home Secretary a week after an official inquiry into her husband's death concluded that his killing was \"probably approved\" by Russian president Vladimir Putin.\nFollowing the publication of the inquiry report, which sparked a diplomatic row and calls for the UK to impose sanctions against Moscow, Mrs May said the findings were \"deeply disturbing\".\nThe recent findings have deepened the diplomatic row between the UK and Russia\nAhead of the meeting, a Home Office spokeswoman said: \"The Home Secretary made clear that she would meet with Mrs Litvinenko and listen very carefully to what she has to say.\n\"We are not going to confirm details or timings of what is a private meeting.\"\nMrs Litvinenko called on Prime Minister David Cameron to impose \"targeted economic sanctions and travel bans\" against individuals, including Mr Putin.\nMoscow has dismissed the findings, describing the inquiry as a political \"whitewash\".\nEarlier this week Russian foreign minister Sergei Lavrov warned it would \"certainly worsen\" relations between London and Moscow and even suggested that British officials could be sued for slander.\nThe Government has announced financial sanctions against Andrei Lugovoi and Dmitri Kovtun, who allegedly carried out the killing. Both deny involvement.","url":"https://www.dailymail.co.uk/wires/pa/article-3420462/Litvinenko-widow-meet-Home-Secretary.html"}
