{"authors":["Elliott Bretland For Mailonline"],"date_download":"2018-10-22 23:46:15","date_modify":"2018-10-22 23:46:15","date_publish":"2016-01-29 12:09:56","description":"Liverpool have been told to forget about signing Alex Teixeira this January by Shakhtar Donetsk chief executive Sergei Palkin. The Ukrainian club claim the player has a 70million euros release clause.","filename":"data/vaneerConsumption/LiverpoolcanforgetaboutsigningAlexTeixeirainsistsShakhtarchiefexecutive.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/306D576B00000578-0-image-a-7_1454069225069.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422659_Liverpool-forget-signing-Alex-Teixeira-insists-Shakhtar-chief-executive_1540251975.html","title":"Liverpool can forget about signing Alex Teixeira, insists Shakhtar chief executive","title_page":"Liverpool can forget about signing Alex Teixeira, insists Shakhtar chief executive  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Liverpool have been told to forget about signing Alex Teixeira this January by Shakhtar Donetsk chief executive Sergei Palkin.\nShakhtar have already turned a bid down of £24.5million from Liverpool for the Brazilian with Palkin claiming the player has a release clause of 70million euros (£53.4million).\nThe Ukrainian giants are adamant the player will remain at Shakhtar for the rest of the season as they aim to win this season's Europa League.\nShakhtar Donetsk have told Liverpool they can forget about signing Alex Teixeira this January\nTeixeira has a 70million euro release clause, according to Shakhtar Donetsk chief executive Sergei Palkin\n'Liverpool stopped at the amount of 32million Euros and 4million bonus,' Palkin told Ukrainian TV.\n'This is the last number that was announced. Our position is that we do not want to sell Teixeira today.\n'We will sell only at the end of the season. We need to show serious results in the Europa League and the championship of Ukraine. At the end of the season we will sit down at the negotiating table.'\nShakhtar have insisted they will not sell the player for less than 50m euros with Palkin hinting clubs should only come forward if they are willing to activate his release clause.\n'Teixeira has compensation in his contract and the price is 70million Euros,' said Palkin. 'Please, if someone is going to trigger that let him come and declare himself.'\n'Our coach (Mircea Lucescu) wants Teixeira to remain until the end of the season. We must adhere to a common goal.'","url":"https://www.dailymail.co.uk/sport/football/article-3422659/Liverpool-forget-signing-Alex-Teixeira-insists-Shakhtar-chief-executive.html"}
