{"authors":["Glen Williams For Mailonline"],"date_download":"2018-10-23 04:43:07","date_modify":"2018-10-23 04:43:07","date_publish":"2017-04-26 16:18:14","description":"Midweek fixtures, six-point swings, relegation battles and, of course, those four important Champions League spots up for grabs - the Premier League campaign is quickly reaching its climax.","filename":"data/vaneerConsumption/LiverpoolbossJurgenKloppingoodspiritsintraining.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA06D3A00000578-0-image-a-132_1493219645382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4448150_Liverpool-boss-Jurgen-Klopp-good-spirits-training_1540269787.html","title":"Liverpool boss Jurgen Klopp in good spirits in training","title_page":"Liverpool boss Jurgen Klopp in good spirits in training | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Midweek fixtures, six-point swings, relegation battles and, of course, the four important Champions League spots up for grabs - the season's climax is fast approaching.\nBut even amid the whirlwind that is the final weeks of the season, Liverpool manager Jurgen Klopp appeared to be in good spirits during his team's training session at their Melwood training complex.\nAt this stage of the season it can be difficult to get control of your bearings. Liverpool sit in third place, but have played two more games than Manchester City and Manchester United, in fourth and fifth place respectively.\nLiverpool manager Jurgen Klopp appears in good spirits as he hugs defender Joe Gomez\nKlopp shares a joke with the young defender during his side's training session at Melwood\nKlopp's spirits were high despite reaching the most intense period of the season\nThe German gives Gomez clear instructions as his side gear up for clash against Watford\nThe Manchester derby on Thursday could have a huge impact on the battle for Champions League qualification. Meanwhile Klopp's men will have to wait until next Monday before they play their next fixture against Watford.\nBoth Manchester clubs will have played the same number of games as Liverpool come Sunday evening - and that is when Klopp will be able to get a fuller sense of where his team stand.\nBut preparations for their next clash were well underway at their training base on Wednesday.\nThe Reds were put through their paces by the German and he was not the only one who wore a grin on his face. Perhaps the squad were still buoyed by the news that the manager wants to take everyone to Australia for the post-season tour.\nDaniel Sturridge was all smiles in training despite his frustrating injury woes this season\nThe striker made cameo appearances against West Brom and Stoke but missed Crystal Palace\nLiverpool no longer rely on the England international and his future appears in doubt\nKlopp could look to bolster his strike force this summer after Sturridge's injury troubles\nOne Liverpool player who may not be in Klopp's distant plans, however, is Daniel Sturridge.\nThe striker was all smiles at Melwood during the session, but his injury woes have cast serious doubt over his career at Anfield.\nMuch of the goalscoring burden has seemingly fallen onto the shoulders of Philippe Coutinho, who also appeared relaxed during training.\nThe Brazilian, fresh from his 10th goal of the season in the loss against Crystal Palace, was embraced by his manager and fellow players during the session - much like a prized asset you cannot afford to lose.\nReds defender Alberto Moreno laughs and embraces Philippe Coutinho during training\nKlopp and Coutinho also share a smile as the pair appear relaxed at Melwood training ground\nCoutinho, who has contributed 10 goals for the Reds this season, leaps to chest the ball down\nThe manager watches on as the Brazil international whips a ball with the instep of his foot\nJames Milner has been another solid performer throughout the season for Liverpool\nThe 31-year-old has adapted for his manager this season, being deployed at left back\nAnd the 24-year-old will have to be on top form during Liverpool's remaining fixtures to ensure they get over the line and into those Champions League spots.\nWith just four games left for the Merseyside outfit, every game is crucial and each point gained, or dropped, is vital.\nThey will face a Watford side at Vicarage Road who are in decent form, winning three of their last five league outings - the same wins Liverpool have claimed in as many games.\nKlopp, and the rest of his side, will watch on with intrigue this week as his side wait for the chance to pick up more points at the London club on Monday.\nKlopp oversees a drill as he assesses the players during Wednesday's training session\nNathaniel Clyne, one of Liverpool's stars throughout the campaign, looks to control the ball\nBrazilian midfielder Lucas stretches his leg during the warm-up for the session ahead\nThe 30-year-old looks on as the ball bounces towards him during a warm-up drill\nLiverpool left back Moreno slides a pass across the training grounds of Melwood","url":"https://www.dailymail.co.uk/sport/football/article-4448150/Liverpool-boss-Jurgen-Klopp-good-spirits-training.html"}
