{"authors":["Sportsmail Reporter"],"date_download":"2018-10-23 00:02:51","date_modify":"2018-10-23 00:02:51","date_publish":"2016-01-29 12:41:50","description":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats.","filename":"data/vaneerConsumption/LiverpoolvsWestHamTeamnewskickofftimeprobablylineupsoddsandstatsfortheFACupclash.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B13EF200000578-0-image-a-40_1454071306341.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422722_Liverpool-vs-West-Ham-Team-news-kick-time-probably-line-ups-odds-stats-FA-Cup-clash_1540252971.html","title":"Liverpool vs West Ham: Team news, kick-off time, probably line-ups, odds and stats for the FA Cup clash","title_page":"Liverpool vs West Ham: Team news, kick-off time, probably line-ups, odds and stats for the FA Cup clash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ahead of this weekend's FA Cup action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats. Here is all the information you need for Liverpool's clash with West Ham.\nTeam news\nLiverpool\nDejan Lovren is set to return to the starting line-up for the first time in six matches to face West Ham at home in the FA Cup.\nThe Croatia international has fully recovered from a hamstring injury and will be in a much-changed side as manager Jurgen Klopp looks to rest some weary legs at the end of a busy January.\nFellow centre-back Steven Caulker, on loan from QPR, could make his first start alongside him while Christian Benteke will be asked to lead the line.\nProvisional squad: Ward, Randall, Caulker, Lovren, Smith, Allen, Brannagan, Stewart, Ibe, Benteke, Teixeira, Mignolet, Flanagan, Sakho, Moreno, Ilori, Lucas, Toure, Lallana, Firmino, Ojo, Sinclair.\nLiverpool boss Jurgen Klopp will see his side host West Ham in the fourth round of the FA Cup\nWest Ham\nWest Ham are hopeful captain Mark Noble will be fit to face Liverpool in the FA Cup after he missed training on Thursday with flu.\nCarl Jenkinson is out with the knee injury he suffered against Manchester City last weekend, and with new signing Sam Byram cup-tied, fit-again James Tomkins will fill in at right-back.\nWinger Michail Antonio is available despite a wrist injury but Andy Carroll (hamstring), Manuel Lanzini and Diafra Sakho (both thigh) are still sidelined.\nProvisional squad: Adrian, Randolph, Hendrie, Tomkins, Collins, Reid, Ogbonna, Cresswell, Noble, Kouyate, Song, Obiang, Moses, Payet, O'Brien, Valencia, Antonio, Cullen, Jelavic, Parfitt-Williams.\nWest Ham are hopeful captain Mark Noble will be fit to face Liverpool in the FA Cup\nKey match stats (supplied by Opta)\nLIVERPOOL v WEST HAM Kick-off: Saturday, 5.30pm - BT Sport Odds (subject to change): Liverpool: 11/10 Draw: 13/5 West Ham: 3/1 Referee: Martin Atkinson Managers: Jurgen Klopp (Liverpool), Slaven Bilic (West Ham)\nLiverpool have never lost in six previous FA Cup meetings with the Hammers (W4 D2), most recently in the 2006 final, when the Reds won on penalties after a 3-3 draw.\nHowever, West Ham have won three of their last four meetings with Liverpool, including two league victories this season - a 3-0 win at Anfield back in August and a 2-0 victory at home in January.\nThe Reds’ last seven all Premier League FA Cup ties have ended in a 2-1 scoreline, with four wins and three defeats.\nThe Hammers have won just one of their last eight FA Cup games away from home (D1 L6).\nIn all competitions, West Ham United have won just two of their last 10 away matches (W2 D4 L4).\nEnner Valencia has scored four goals in his last three competitive appearances for West Ham, this after going seven in a row without a goal prior to this run.","url":"https://www.dailymail.co.uk/sport/football/article-3422722/Liverpool-vs-West-Ham-Team-news-kick-time-probably-line-ups-odds-stats-FA-Cup-clash.html"}
