{"authors":["Ashley Clements For Mailonline"],"date_download":"2018-10-23 00:31:56","date_modify":"2018-10-23 00:31:56","date_publish":"2016-01-29 13:33:00","description":"After a slow start to his career at Anfield, Roberto Firmino has rediscovered his form in front of goal finding the net four times in his last four appearances for Klopp's side.","filename":"data/vaneerConsumption/LiverpoolstarRobertoFirminoisoneofthebestintheworldhecanbeJurgenKloppsAndresIniestainsistsRonaldinho.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/307F333900000578-0-image-a-23_1454074243656.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422289_Liverpool-star-Roberto-Firmino-one-best-world-Jurgen-Klopp-s-Andres-Iniesta-insists-Ronaldinho_1540254716.html","title":"Liverpool star Roberto Firmino is one of the best in the world... he can be Jurgen Klopp's Andres Iniesta, insists Ronaldinho","title_page":"Liverpool star Roberto Firmino is one of the best in the world... he can be Jurgen Klopp's Andres Iniesta, insists Ronaldinho | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Brazilian legend Ronaldinho believes Jurgen Klopp should build his team around Roberto Firmino, while comparing the Liverpool striker to the likes of Andres Iniesta and David Silva.\nAfter a slow start to his career at Anfield, Firmino has rediscovered his form in front of goal finding the net four times in his last four appearances for Klopp's side.\nAnd former Barcelona star Ronaldinho has backed his compatriot to become a key member of Liverpool's first-team for years to come.\nRonaldinho believes Liverpool boss Jurgen Klopp should build his team around Roberto Firmino (left)\nKlopp embraces Firmino after the Brazilian scored twice during Liverpool's 5-4 victory against Norwich\nFIRMINO'S SEASON SO FAR Appearances (in all comps): 28 Goals: 5\nHe told the Daily Mirror: 'I didn't ever question if he would be a great player for Liverpool, I knew that he would be.'\n'He's one of the best at what he does in the world. He's in the same class as Ozil, [David] Silva, Iniesta, and all the other great players who play that role.'\n'He's the player that I'm sure Klopp will build his new Liverpool team around.\n'Klopp is one of the best coaches in the world, he will know that Liverpool need better players, he will know that Firmino will need better players around him to get the most out of his game.'\nLiverpool signed Firmino from Hoffenheim on a five-year deal for a fee of £29million during the summer, but the Brazilian struggled to make an impact during his first few months in England.\nIt was 14 games before the 24-year-old scored his first Reds goal, finding the net during his side's 4-1 demolition of Manchester City last November.\nMore recently, Firmino helped Liverpool secure a dramatic 5-4 win over Norwich with the Brazilian bagging a brace at Carrow Road before Adam Lallana's late winner.","url":"https://www.dailymail.co.uk/sport/football/article-3422289/Liverpool-star-Roberto-Firmino-one-best-world-Jurgen-Klopp-s-Andres-Iniesta-insists-Ronaldinho.html"}
