{"authors":["Dominic King For Mailonline"],"date_download":"2018-10-23 03:23:20","date_modify":"2018-10-23 03:23:20","date_publish":"2017-03-10 12:57:02","description":"The Brazil forward, who scored one and created another for Sadio Mane in the 3-1 dismissal of Arsene Wenger's side, has not been able to take part in any sessions at Melwood this week.","filename":"data/vaneerConsumption/LiverpoolFCforwardRobertoFirminoamajorBurnleydoubt.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E0607C900000578-0-image-a-157_1489150616794.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301194_Liverpool-forward-Roberto-Firmino-major-Burnley-doubt_1540265000.html","title":"Liverpool FC forward Roberto Firmino a major Burnley doubt","title_page":"Liverpool FC forward Roberto Firmino a major Burnley doubt | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Roberto Firmino is a major doubt for Liverpool's clash with Burnley after struggling to recover from his exertions against Arsenal.\nThe Brazil forward, who scored one and created another for Sadio Mane in the 3-1 dismissal of Arsene Wenger's side, has not been able to take part in any sessions at Melwood this week.\nJurgen Klopp bases his team selection around how much players have been able to work in the build up to a game and to stand any chance of featuring on Sunday, Firmino will, at the very least, have to take part in Saturday's final session.\nLiverpool could be without Roberto Firmino for the visit of Burnley in the Premier League\nReds boss Jurgen Klopp will be without Jordan Henderson and Daniel Sturridge at Anfield\n'We will have to wait and see,' said Klopp.\nLiverpool's manager is already resigned to being without Daniel Sturridge, who has not recovered from a hip problem, while Jordan Henderson is also out of the game with a foot issue.\nIt remains to be seen whether Henderson, who damaged his foot two weeks ago in a training ground tackle, will be available for the trip to Manchester City seven days later and there is also a question whether he will be included in the England squad for the forthcoming games with Germany and Lithuania.\nFirmino scored in the win over Arsenal but he has not trained all week due to fatigue\nJames Milner (left) is in line to make his 600th career appearance in the game on Sunday\nKlopp has no other major fitness concerns, though, ahead of a game that will be significant in Liverpool's quest to reach a place in the Champions League and also marks a personal milestone for James Milner.\nThis will be the 600th appearance of Milner's career and Klopp has hailed the former England international for how he has adjusted to life this season as a left back, having predominantly been a midfielder.\n'That is quite a number,' said Klopp. 'That is impressive. He doesn't look like he has played 600 games and I mean that in a good way. The full back position is always possible for a player like Milly.'","url":"https://www.dailymail.co.uk/sport/football/article-4301194/Liverpool-forward-Roberto-Firmino-major-Burnley-doubt.html"}
