{"authors":["Glen Williams For Mailonline"],"date_download":"2018-10-23 01:49:33","date_modify":"2018-10-23 01:49:33","date_publish":"2017-03-16 12:00:41","description":"The playmaker is adored by Reds and lauded for his performances on the field. But even the most ardent Kopites may question the Brazilian's latest exploit... his new tattoo which he revealed in training.","filename":"data/vaneerConsumption/LiverpoolstarPhilippeCoutinhorevealsnewtattoo.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53C78600000578-0-image-a-32_1489664336211.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319838_Liverpool-star-Philippe-Coutinho-reveals-new-tattoo_1540259373.html","title":"Liverpool star Philippe Coutinho reveals new tattoo","title_page":"Liverpool star Philippe Coutinho reveals new tattoo | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Philippe Coutinho is the darling of Liverpool.\nThe playmaker is adored by Reds and lauded for his performances on the field. But even the most ardent Kopites may question the Brazilian's latest exploit off it.\nThe 24-year-old showed off his new tattoo in training on Wednesday as Jurgen Klopp's side prepare to face Manchester City on Sunday. And what did he reveal? Mickey Mouse. Yes, the lovable Disney character.\nLiverpool talisman Philippe Coutinho showed off his new Mickey Mouse tattoo in training\nCoutinho flashed his torso at Melwood to uncover his latest ink, which cuts the figure of the Disney icon.\nThe playmaker will hope to carve out his own icon status on Merseyside as he strives to rekindle his early-season form.\nCoutinho was taking the Premier League by storm before being struck down with an ankle injury against Sunderland at the end of November.\nIt was no coincidence that Jurgen Klopp's side struggled after the star was sidelined as Liverpool's results deteriorated as they fell from the top of the table.\nAlthough Coutinho has failed to recover his best form since returning in the new year, Liverpool will need the Brazilian back firing on all cylinders to retain a coveted Champions League spot.\nManchester City will welcome Liverpool on Sunday as Klopp's men look to fend off the competition and cling on to a top four place.\nArsenal and Manchester United are within six points of the Reds, both with two games in hand. A win on Sunday would be a huge boost to Liverpool's hopes of playing in Europe's premier competition next season.\nIt is not the first time the midfielder has had some ink done, with his left arm covered in tattoos","url":"https://www.dailymail.co.uk/sport/football/article-4319838/Liverpool-star-Philippe-Coutinho-reveals-new-tattoo.html"}
