{"authors":["Simeon Gholam For Mailonline"],"date_download":"2018-10-22 22:49:03","date_modify":"2018-10-22 22:49:03","date_publish":"2016-01-29 10:08:44","description":"He may not be getting much time on the pitch, but Jose Enrique is still clearly a popular man in the Liverpool dressing room as his team-mates turned out in force to celebrate his 30th birthday.","filename":"data/vaneerConsumption/LiverpooldefenderJoseEnriquecelebratesturning30withhisteammatesgirlfriendandabarbershopquartet.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1B5E600000578-0-image-a-23_1454066051767.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422471_Liverpool-defender-Jose-Enrique-celebrates-turning-30-team-mates-girlfriend-barbershop-quartet_1540248543.html","title":"Liverpool defender Jose Enrique celebrates turning 30 with his team-mates, girlfriend and a barbershop quartet","title_page":"Liverpool defender Jose Enrique celebrates turning 30 with his team-mates, girlfriend and a barbershop quartet | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He may not be getting much time on the pitch, but Jose Enrique is still clearly a popular man in the Liverpool dressing room as his team-mates turned out in force to celebrate his 30th birthday.\nChristian Benteke, Dejan Lovren, Mamadou Sakho, Divock Origi, Lucas Leiva, Philippe Coutinho, Alberto Moreno, Tiago Ilori, Joao Teixeira and Martin Skrtel were all in attendance as Enrique celebrated his milestone, while girlfriend Amy Jaine captured the event on Instagram.\nEnrique, whose birthday was last Saturday, stood with a barbershop quartet that had been arranged for the festivities, as well as posing with his girlfriend in front of two balloons depicting his age.\n(L-R clockwise from top left) Lucas Leiva, Philippe Coutinho, Alberto Moreno, Tiago Ilori, Joao Teixeira, Martin Skrtel, Christian Benteke, Dejan Lovren, Mamadou Sakho and Divock Origi were in attendance for Jose Enrique's birthday\nEnrique poses with girlfriend Amy Jaine during his 30th birthday celebrations\nHe has played just twice for Liverpool so far this season in their FA Cup third round tie against Exeter as well as the replay last week.\nIn fact, Enrique made just nine appearances in the whole of the last campaign with Moreno preferred at left back, and hasn't appeared in the Premier League in more than a year.\nHis most recent action came for Liverpool's Under 21 side on Monday night, as they recorded a comfortable 2-0 victory over Tottenham.\nEnrique could be back in action for the first-team this weekend as Jurgen Klopp looks to rotate his squad again for the FA Cup fourth round tie at home to West Ham.\nThe game on Saturday evening comes just three days before their pivotal trip to Premier League leaders Leicester City on Tuesday night.\nEnrique's current deal with Liverpool expires this June, and he can sign a pre-contract agreement with another club this month.\nEnrique has featured just twice under Liverpool boss Jurgen Klopp so far this season","url":"https://www.dailymail.co.uk/sport/football/article-3422471/Liverpool-defender-Jose-Enrique-celebrates-turning-30-team-mates-girlfriend-barbershop-quartet.html"}
