{"authors":["Tony Lee"],"date_download":"2018-10-30 21:27:06","date_modify":"2018-10-30 21:27:06","date_publish":"2015-10-22 13:16:03","description":"Hillary Clinton will testify before the House Benghazi Select Committee about the attacks that killed four Americans. A new AP poll found that a majority |","filename":"data/vaneerConsumption/LiveUpdatesHillaryTestifiesBeforeBenghaziCommittee.json","image_url":"https://media.breitbart.com/media/2015/10/Hillary-Benghazi-Hearing-.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_22__1540934826.html","title":"***Live Updates*** Hillary Testifies Before Benghazi Committee","title_page":"***Live Updates*** Hillary Testifies Before Benghazi Committee | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Hillary Clinton will testify before the House Benghazi Select Committee about the attacks that killed four Americans. A new AP poll found that a majority of Americans believe the investigation is justified while a plurality believe that Clinton used a private email account and server to avoid government transparency.\nDemocrats have mulled resigning from the Committee while Republicans, after Rep. Kevin McCarthy’s (R-CA) gaffe suggesting that the committee was formed to harm Clinton, will try to prevent the mainstream media from portraying the hearing as a “witch-hunt,” as they are priming to do. Clinton, who will have to answer plenty of questions about her private email scandal, will try to run out the clock and not have another “what difference does it make?” moment a day after Vice President Joe Biden decided not to run for president, giving Clinton arguably a clear path to her party’s nomination.\nStay tuned to Breitbart News for live updates throughout the day.\n9: 05 PM: Gowdy adjourns the hearing. And liberals like MSNBC’s Rachel Maddow, who has an interview with Clinton on Friday evening, are already gushing over Clinton’s “remarkable display of endurance” and surviving the 11-hour “beating” she took. Look for Democrats to also say the 11-hour hearing puts to rest any concerns about Clinton’s health and use the hearing to try to boost Clinton politically in the months ahead.\n9:00 PM: Clinton again spins, in response to Gowdy’s line of questioning, that it wasn’t until she was asked to help the State Department fill in some “record-keeping gaps” that she realized her work-related emails were not on the State Department’s system.\n8:53 PM: Clinton does not answer the question whether previous Congressional Committees and Accountability Review Boards and access to her emails. She keeps answering that 90-95% of her emails were in the State Department’s system. Gowdy is not buying it, saying the State Department could not name the source of that 90-95% figure. Gowdy points out that the Inspector General found that less than 1% of the emails were secured on the State Department’s servers. Gowdy wonders why his Committee only initially received 8 emails from the State Department if they indeed had 90-95% of her work-related emails. Clinton says she has no idea why she had emails Blumenthal she did not and she had emails he did not have.\n8: 40 PM: Clinton has a coughing fit while speaking about Messrs. Pickering and Mullen and pauses to get a lozenge. Cummings keeps asking her if she needs a 60-second break, but Clinton says she does not need one.\n8: 33 PM: Cummings says what bothers him about the attacks on the Accountability Review Board (ARB) is that it is, according to Cummings, an attack on the 83-year-old Ambassador Thomas Pickering, who co-chaired the ARB with Adm. Mike Mullen.\n8:30 PM: Pompeo asks Clinton whether she had the authority to put a letter of reprimand in any State Department employee’s file regarding Benghazi and Clinton punts on the question, saying Secretary Kerry made whatever the determinations were.\n8: 20 PM: Clinton, one of the most partisan figures in American politics (ask Joe Biden), says that it is “deeply unfortunate” that Benghazi can be used for “partisan political purposes.”\n8:15 PM: Cummings again comes to Clinton’s defense. He says he has done a lot of depositions in his life as a lawyer and says Clinton should be proud of “creating a culture” in the State Department in which Clinton loyalists like Cheryl Mills brought to tears in describing what their boss did/reacted/felt during and after the Benghazi attacks. Cummings says it bothers him when people imply that Clinton didn’t care about her personnel.\n8: 10: Rep. Westmoreland says Clinton must have the “fastest-reading attorneys” because they went over over 60,000 emails in two months. He says Clinton’s story about her private emails just “doesn’t smell right.” Clinton again repeats her spin that she turned over 55,000 pages (not emails) to the State Department to help them fill in the gaps in their system.\n7: 53 PM: Jordan grills Clinton on her private email server, and asks if Clinton only had one email server. Clinton doesn’t directly answer the question and says there was a server that was already being used by her husband’s team and the FBI has the server that she used during her tenure at the State Department. She says there was nothing “marked” classified on her emails that she sent or received. When asked if she, “as the most transparent person ever” would allow a neutral third party to review any emails that may have been deleted from her server, Clinton punts and says she would leave it up to the Justice Department.\n7:45 PM: Rep. Jim Jordan (R-OH) says to get to the truth about Benghazi, the Committee needs a complete record and the record may be incomplete because Clinton’s story about her emails keeps changing. Clinton says her email server was protected by secret service agents and she says she mentioned that “out of an abundance of being transparent.”\n7: 30 PM: Rep. Adam Smith (D-WA) again defends Clinton, saying the questions after nine exhausting hours are now becoming more badgering, wishing to “wear you down” and “get you to say something that they can later use.” He says he does not see the utility of that and wonders if there is going to be an “end point” to this or if the hearing will go on all night.\n7:20 PM: In response to questioning from Rep. Martha Roby (R-AL), Clinton says she spoke with President Barack Obama after the Benghazi attacks and says she is not going to reveal what they talked about. She says she did not speak with then-Defense Secretary Leon Panetta but met with him the next day. Clinton says she did not need to speak with Panetta and Gen. Martin Dempsey, the Chairman of the Joint Chiefs of Staff, while U.S. officials on the ground were being attacked. Clinton says she had a “rolling series of conversations” with the survivors when they came back to the State Department. Roby implies Clinton was not concerned about State Department personnel.\n7:10 PM: Rep. Susan Brooks (R-IN) says there is no record of Clinton even talking to Ambassador Stevens after he was sworn in. She asks if Clinton personally spoke to him after he was sworn in in May.\n“I believe I did,” Clinton says before saying she does not recall when exactly that was.\nClinton says that she was the boss of the ambassadors in 270 different countries. She says she is “very well aware” of the dangers that U.S. diplomats face and there was no recommendation from Benghazi to close the consulate.\nAfter Clinton says she “would have given anything” to ensure Chris Stevens’s safety, Brooks says that had he talked to Stevens in July, he would have told her that he was denied his security request by the State Department. “We didn’t give him everything,” Brooks says.\nClinton responds by saying Stevens had the opportunity to reach her directly whenever he thought there was something of importance.\n6: 55 PM: Rep. Tammy Duckworth (D-IL) asks Clinton to talk about the various security improvements that were made after the Benghazi attacks and allow her to go over her laundry list.\n6:43 PM: Clinton says it is a “disservice” for Roskam to say that Clinton should have told Congress that “Stevens kept faith with the State Department that I headed even when we broke faith with him” and “accepted my invitation to serve in Benghazi even though he was denied the security he implored us to give him. I and my colleagues were distracted by other matters and opportunities and ambitions and we breached our fundamental duty to mitigate his danger and secure his safety and that of Glen Doherty, Sean Smith, and Tyrone Woods.”\n“Of course I would not say that,” Clinton says. She says it is a “disservice” to the people who are given security responsibilities.\n6:40 PM: Clinton, in response to Roskam, says her “responsibility” to Benghazi was to be briefed, to discuss with the security and policy experts whether “we would have a post in Benghazi, whether we would continue it, whether we would make it permanently.” She insists that nobody recommended closing the Benghazi post and claims there were “many affirmative responses” to requests for more security. Clinton implies that it was Stevens’s responsibility to get more security because “ambassadors are the ones who pass on security recommendations and requests.”\n6:30 PM: The hearing resumes and Roskam says he has developed a theory from his listening today. He says it is that Clinton initiated a policy to put the United States into Libya and was successful in doing that. He says Clinton was the prime mover in the Obama administration’s Libya policy and she was concerned about getting credit and her image. He says his theory is that after Qaddafi’s death, her interest and attention waned and essentially gave a “mission accomplished” quote in October of 2013 when she told the Washington Post that she set in place a policy that was “on the right side of history, on the right side of our values, on the right side of our strategic interests in the region.” Roskam says the problem was that there were “storm clouds that were gathering,” which were the deteriorating security conditions in Benghazi and Clinton had “a lot to lose” if things went south.\nHe asks “how is it possible that these urgent requests” from two ambassadors did not break through to the upper levels of her inner circles? Roskam suggests that to admit the need for more security would be to admit that there was a deteriorating situation, which would mean her foreign policy in Libya was not succeeding.\nClinton claims the administration knew the post-Qaddafi era in Libya would be challenging and “we planned accordingly.” She concedes the “volatile security environment” in Libya complicated matters.\nClinton then says, “I absolutely did not forget about Libya after Qaddafi fell.”\nShe says “we were doing everything we could think of” to help Libya succeed, including helping Libyans get rid of Qaddafi’s chemical weapons.\n6:10 PM: Clinton tries to explain/spin that “there is no contradiction” regarding the administration’s spin that there was “no pre-planned attack” and the experts in Libya finding that there was a “well-planned attack.” She says that when the video footage of the attack arrived on September 18, “we needed to revisit our analysis” and the “CIA changed its assessment” of the attacks.\n6:05 PM: Clinton: “I believe to this day the video played a role” in the Benghazi attacks.\nJordan tells her the experts do not.\n5:58 PM: Rep. Jim Jordan to Clinton: “You Raised the Video”\nIn response to Clinton’s comments about some Members of Congress having raised the YouTube video, Jordan points out that Clinton raised the video in her initial statement at 10:08 PM EST on the night of the attacks about an “inflammatory video posted on the Internet.”Jordan notes that Clinton said that an inflammatory video “caused vicious behavior” that led to the death of four Americans.\nClinton then reads her initial statement in full and claims there was “no cause” and “no motive” presented in her statement.\nJordan again emphasizes that “what bothers us” is that Clinton told friends and other foreign leaders that the attacks were terrorism while leading the American public to believe it was a “spontaneous” attack in response to a YouTube video.\n“Privately your story was much different than it was publicly,” Jordan tells her. “Your story privately is much different that what you were telling the American people…. That’s what bothers us.”\nHere’s the State Department’s initial statement on the Benghazi attacks that Jordan was referencing:\nI condemn in the strongest terms the attack on our mission in Benghazi today. As we work to secure our personnel and facilities, we have confirmed that one of our State Department officers was killed. We are heartbroken by this terrible loss. Our thoughts and prayers are with his family and those who have suffered in this attack. This evening, I called Libyan President Magariaf to coordinate additional support to protect Americans in Libya. President Magariaf expressed his condemnation and condolences and pledged his government’s full cooperation. Some have sought to justify this vicious behavior as a response to inflammatory material posted on the Internet. The United States deplores any intentional effort to denigrate the religious beliefs of others. Our commitment to religious tolerance goes back to the very beginning of our nation. But let me be clear: There is never any justification for violent acts of this kind. In light of the events of today, the United States government is working with partner countries around the world to protect our personnel, our missions, and American citizens worldwide.\n5:48 PM: Rep. Adam Schiff (D-CA) tries to paint Blumenthal, who reportedly was the last person Clinton spoke to before her first national television interviews during the Monica Lewinsky affair, was just an annoying acquaintance who sent her unsolicited advice regarding Libya. Clinton, though, encouraged Blumenthal to send her the “unsolicited emails.” He says the Benghazi Committee called Clinton to testify because she is running for president and has “high poll numbers.”\n5:40 PM: Westmoreland grills Clinton on why the Foreign Emergency Support Team (FEST) was not deployed to Benghazi to rescue Chris Stevens while he was under attack.\nClinton ultimately says that she was “responsible for quite a bit” but she was not responsible for “specific security requests and decisions. That was not something I was responsible for.”\n5:35: Westmoreland asks Clinton what she came up with during her sleepless nights about what happened in Benghazi. He asks her to name two things that she could have done differently. Clinton says the contractors/militia the State Department relied on could have been more reliable. Westmoreland replies that Clinton has previously insisted she had noting to do with that, and Clinton scrambles a bit in her response, saying “there are many elements” that go into security.\n5:32 PM: Rep. Westmoreland asks her to give Congress a play by play account of Benghazi and says that it is hard for him to comprehend why she would give the “blow by blow” account of the Tunisia incident that “we are not even investigating.” Clinton says that it is “unfortunate” that “several of you” have dismissed the importance of the YouTube and says Congress must consider the “totality of the circumstances” so “we can learn the best lessons.”\n5:30 PM: Clinton claims that no Americans were killed in nations like Tunisia during the 2012 unrests partly because “I had been consistent in speaking out about that video from the very first day we knew it had sparked the attacks on the Embassy in Cairo.”\n5:24 PM: Cummings finally asks a question and asks if Clinton ordered then-Secretary of Defense Leon Panetta to “stand down” on the night of the attacks?\n“Of course not,” Clinton replies.\n5: 18 PM: Cummings says that the August 17, 2012 memo is “not something new” and not something that the Benghazi Committee uncovered. “That’s right,” Clinton says to her top defender and ally on the Committee. Cummings tries his best to frame the Benghazi investigation as a partisan one meant to hurt Clinton, citing comments by Rep. Darrell Issa (R-CA).\n“The idea that you would intentionally take steps to prevent assistance to Americans under attack in Benghazi is simply beyond the pale,” Cummings says, claiming that the claim has been disproven “multiple times over.”\n5:15 PM: Roby asks why it did not occur to Clinton to pick up the phone and call Stevens and ask him what he needed in terms of security. Clinton says “we knew what he was looking for” and again says Stevens’s request went to the “security professionals.”\n5:05 PM: The Benghazi hearing resumes, and Rep. Martha Roby (R-AL) asks Clinton about a $20 million contingency fund that Clinton approved. She asks how she found $20 million to support Libyan security but could not find the funds to “support our own people.” Clinton responds with a technocratic answer about how Congress sets spending levels in categories in spending and the request for diplomatics security was “continuously underfunded.” She says that “we began to get more support” from Congress after the Benghazi tragedy.\n3:47: Roskam tries again to frame Clinton as the architect of the administration’s Libya policy and he says he believes the Clinton Doctrine is “where an opportunity is seized to turn progress in Libya into a political win for Hillary Rodham Clinton and at the precise moment when things look good, take a victory lap” on all the Sunday shows. Clinton says that Obama actually deserves the “historic credit” for going into Libya but Obama told the New York Times‘s Thomas Friedman that the way the administration managed Libya’s transition was probably one of his biggest foreign policy regrets. The hearing is adjourned while Representatives go to cast votes.\nBreitbart’s Joel Pollak, regarding Clinton’s suggestion that Stevens was joking about the lack of security at the Benghazi compound, points out that “in 2007, Clinton wrote to the Government Accountability Office expressing concern that U.S. soldiers in Iraq were forced to find their own body armor because the body armor they had been issued was inadequate.”\n3:21 PM: Clinton says Stevens did not even have her cell phone number, her fax number, her home address. Rep. Mike Pompeo (R-KS) notes Blumenthal had her phone number, fax number, and home address. When asked if all ARBs are created equal, Clinton responds by saying “they have all been led by distinguished Americans” and gets slammed by Pompeo for not answering simple “yes or no” questions. From Breitbart’s Alex Swoyer: GOP frontrunner Donald Trump posted on Twitter his opinion of Hillary Clinton’s record the day before her testimony in front of the House Select Committee on Benghazi – the same day Vice President Joe Biden decided not to enter the presidential race to be the Democrat nominee. “I think Joe Biden made correct decision for him & his family. Personally, I would rather run against Hillary because her record is so bad,” Trump posted on Twitter:\nI think Joe Biden made correct decision for him & his family. Personally, I would rather run against Hillary because her record is so bad. — Donald J. Trump (@realDonaldTrump) October 21, 2015\nOn the day of Clinton’s testimony Trump’s Twitter account retweeted:”@toddinwichita @realDonaldTrump Hillary is doing a HORRIBLE job at #BenghaziHearings reading from the script. #pathetic . She is no leader GOP presidential candidate former Florida Gov. Jeb Bush weighed in on Twitter about Democrat frontrunner Hillary Clinton’s time as Secretary of State on Thursday – the day Clinton testified before the House Select Committee on Benghazi. “Benghazi security failures were a stunning example of an incompetent foreign policy. ‪@HillaryClinton’s role as SOS deserves scrutiny today,” Bush posted.\nBenghazi security failures were a stunning example of an incompetent foreign policy. @HillaryClinton’s role as SOS deserves scrutiny today. — Jeb Bush (@JebBush) October 22, 2015\nFellow GOP candidate Sen. Lindsey Graham (R-SC) also took to Twitter to comment on Hillary Clinton’s Benghazi testimony in a series of three tweets:\n“On @HillaryClinton watch the U.S. consulate in Benghazi became a death trap. #BenghaziCommittee”\n“I agree with @HillaryClinton they can’t operate from bunkers, but they shouldn’t be required to operate in death traps. #BenghaziCommittee”\n“As threats increased, security decreased. @HillaryClinton is responsible above all others for this dynamic. #BenghaziCommittee”\n3:10: In response to a softball question from Cummings, Clinton says she does not want anything she says or said about her to take away from the heroism of the diplomatic security officers and those who died in Benghazi. Clinton says “sometimes there are unintended consequences” even when we try to get it right. She says the attackers used diesel fuel to set the compound on fire and the safe room meant to shield diplomats from attack was “anything but safe,” pointing out that Stevens died from smoke inhalation.\n3: 09: Rep. Adam Smith (D-WA) doesn’t ask a question, instead helping Clinton run out the clock by saying the Benghazi investigation is a prosecution and not uncovering new facts. He says the Committee is not doing justice to the four Americans who died.\nFrom Breitbart’s Alex Swoyer:\nGOP presidential candidate Carly Fiorina posted on Twitter a video of her speaking about the “Clinton Way” on the same day Democrat frontrunner Hillary Clinton is testifying before the House Select Committee on Benghazi. “Hillary Clinton must not be President of the United States, but not because she is a woman. Hillary Clinton cannot be President of the United States because she is not trustworthy,” Fiorina states. “We are learning once again what the Clinton way is. The Clinton way, ‘do as I say not as I do,’ the Clinton way, ‘lets rake in millions from foreign governments behind closed doors,’ ‘lets promise transparency, which we never intend to keep.’ Now, of course they’re scrambling to re-file their tax returns, and account for her decisions as Secretary of State. And I tell you what, when the general election rolls around we better have a nominee that can throw those punches all day long.”\n2:50 PM: In response to questions from Rep. Susan Brooks (R-IN), Clinton suggests Stevens was joking and praises his “great sense of humor” regarding emails about not security at the Benghazi compound and not knowing whether it would remain open. When Clinton references an email to which Stevens was responding, Brooks points out that Stevens was emailing about picking up a few things from a Brit fire sale and those things were actually barricades because we were not providing them what they needed to stay safe. Clinton then praises Stevens’s “entrepreneurial spirit.”\n2:36 PM: Rep. Linda Sanchez (D-CA) again plays the role of Clinton defense lawyer and tries to debunk the Gowdy’s point that Blumenthal had unfettered access to her while Stevens did not even have her personal email account.\n2:30 PM: Responding to Gowdy’s line of questioning, Clinton says that personal and work-related email came to her account. She says Chris Stevens communicated with a number of people she worked with on a daily basis in the State Department and, as far as she knows, did not raise the need for more security with any of them. Again, Clinton says he requested more security from the “security professionals.”\n2:20 PM: The hearing resumes, and Gowdy says it is a fair question to ask about Blumenthal and starts his line of questioning. He asks Clinton again how Blumenthal had so much access to Clinton while Chris Stevens did not.\nClinton says that Stevens dealt with security issues by “dealing with the security professionals” and Stevens understood that’s where the experts were.”\nGowdy points out that Hillary Clinton responded to Huma Abedin’s email requesting help for the Libyan people (needing gasoline and milk) in four minutes but requests for more security for Ambassador Stevens did not even make it to her inbox.\nClinton repeats the talking point that Stevens requested more security from the security professionals and not her.\n1: 45 PM: Cummings tells MSNBC he does not understand why Republicans want to question Clinton about Blumenthal. He says he is “not here to defend Hillary Clinton” and claims he is at the hearing just to defend the truth “so help me God.”\n1: 15 PM: Ater accusing Gowdy of making “several false statements,” Cummings calls on Gowdy to release Blumenthal’s transcript. Cummings’s antics deflects attention from Gowdy’s question to Clinton about whether she recalled the email in which Blumenthal asked Clinton to help him with a business venture–Clinton never answered Gowdy’s question. The hearing is adjourned for about an hour.\n1:10 PM: Gowdy asked Clinton whether she recalls when Blumenthal asked her to help him with a business venture. Clinton tries her best to avoid answering the question. Gowdy says Blumenthal’s emails were relevant because Amb. Stevens had to respond to his drivel.\nFrom Breitbart’s Alex Swoyer: Rick Santorum: Mainstream Media Have ‘Already Written Off’ Benghazi Investigation:\nEarlier this week GOP presidential candidate former Pennsylvania Sen. Rick Santorum commented on Democratic frontrunner Hillary Clinton’s Benghazi hearing, saying that the mainstream media is suggesting it is all politics and has “already written off this story.” “It seems to me that the mainstream media – the left wing media – has already written off this story. I would think even if there are files, they’re going to downplay,” he said, of the evidence and information obtained by the House Select Committee on Benghazi. Santorum also commented on Rep. Kevin McCarthy (R-CA) suggesting the Benghazi committee damaged Clinton’s poll numbers – something Clinton capitalized on in claiming the committee isn’t credible and is simply targeting her over politics. “Obviously, that was really damaging,” Santorum said of McCarthy’s comment on Benghazi. Santorum was asked if he thinks the Benghazi committee hearings are important. “Absolutely,” he answered. “Obviously, you can complain about the length of the time, but they’re still getting releasing of documents. So, in part the people drawing this thing out are the people who are not cooperating with the investigation.” Santorum said he is “almost never” asked about Benghazi specifically on the campaign trail. He added, “The one question I get that I guess is Benghazi related is as president would you investigate and potentially prosecute criminal activity from prior administration?” Santorum followed that up by saying “of course” he would investigate criminal activity because “no one’s above the law.”\n1:03 PM: Gowdy notes that this is an “investigation” and not a “prosecution.” He tells Rep. Schiff (D-CA) that the real tragedy is that so many witnesses and documents were missed during seven investigations and an Accountability Review Board investigation. Gowdy says that Blumenthal was Clinton’s most prolific emailer on Libya and Benghazi and Clinton insists that Blumenthal was not a formal adviser.\n“Sid Blumenthal was not my adviser, official or unofficial, on Libya,” she said.\n12: 55 PM: Clinton says it is “personally painful” to be accused of interfering with security requests that led to the murder of Ambassador Chris Stevens. She says it is “deeply distressing” … she says she has “lost more sleep” than “all of you put together” and has been “racking my brain” about what more could or should have been done. She speaks in her patented “feel sorry for me” voice that many Americans find to be phony.\n12: 42: Clinton says she wrote a whole chapter about Benghazi in her book and would gladly send Jordan a copy. She says Jordan’s insinuation do a great disservice to the work that the Obama administration did and says that “there is no doubt in my mind that we did the best we could with the information we had at the time.” Jordan tells her he is “not insinuating anything” and simply reading what Clinton said. He asks why she did not just speak plainly to the American people?\n12: 40 PM: Jordan points out that 27 minutes after Clinton falsely blamed the Benghazi attacks on a YouTube video, her advisers were already talking politics. He says Clinton “picked the video narrative” because Libya “was supposed to be a great success story for the Obama White House and the Clinton State Department.” Jordan says that the Obama was running on slogan that GM is alive while Osama bin Laden is dead and Al Qaeda is on the run and a terrorist attack in Benghazi would have undercut one of Obama’s central re-eleciton themes.\nHe says “Americans can live with the fact that good people sometimes give their lives for their country” but “what they can’t take, what they can’t live with is when their government is not square with them.”\n12: 35 PM: Jordan calls out Clinton for telling her family and world leaders one thing while falsely telling the American public another and insisting that the Benghazi attacks were a spontaneous response to a YouTube video.\nJordan says he is troubled because he thinks Clinton knew the truth about the attacks (cites an email Clinton sent to her family about officers being killed by an Al Qaeda-like group and a phone call with the Libyan president claiming that that Ansar al-Sharia was claiming responsibility along with a call with the Egyptian Prime Minister in which Clinton claimed that she knew that it was a terrorist attack and had nothing to do with a video).\n12: 32: Rep. Jim Jordan (R-OH): The False Narrative “Started with You, Madam Secretary.”\nHe eviscerates Clinton for starting the false narrative that the Benghazi attacks were a spontaneous response to a YouTube video. He asks why the official narrative of the State Department blamed a video while Tyrone Woods and Glen Doherty was still on the roof of the annex fighting for his life?\n12: 25: Rep. Linda Sanchez (D-CA) tries to rehabilitate Clinton and allow her to claim that she did not rely on Blumenthal for intelligence. Mainstream media go nuts over an Andrea Mitchell clip that Sanchez used.\n12: 21 PM: Pompeo finds it “deeply disturbing” that Clinton was unaware that State Department officials were wittingly or unwittingly meeting with some Al Qaeda members on the ground in Libya days before the attack.\n12:12 PM: Rep. Mike Pompeo (R-KS) asks how so many of Sidney Blumenthal’s emails got to Clinton but not the hundreds of security requests. Clinton tries to claim that Bluemental was not an adviser and Pompeo points out that his emails were filled with sensitive intelligence information. He notes that Clinton said Stevens and the best knowledge of anyone of Libya but did not receive extra security when he requested it. Pompeo continues to point out that there was no additional security provided to Stevens even though there was an increase in the number of security incidents and requests.\nFrom Breitbart’s Patrick Howley:\nWASHINGTON – Former Secretary of State Hillary Clinton made a remark about how Southerners talk slow at Thursday’s House Benghazi Committee hearing.\n“I talk a little slower” than other congressmen, said Georgia Rep. Lynn Westmoreland when he started asking Clinton questions at the hearing, asking Clinton to bear with him. “I lived in Arkansas for a long time,” Clinton said, appropriating a vaguely southern twang. “I don’t need a translator, congressman.” Westmoreland was not necessarily referring to his Southern accent. Also, Westmoreland is from Georgia, not Arkansas. And Westmoreland was not speaking a different language of the South that would require a translator.\n12: 08 PM: Hillary says Amb. Chris Stevens did not have her personal email.\n12: 05 PM: Clinton says the CIA had a “much bigger presence” than the State Department and stayed in Libya despite the overall decline in stability. She seems to be now be passing the buck to the CIA. Rep. Lynn Westmoreland (D-GA) asks Clinton how many major security instances would it have taken for Clinton to take extra security measures and Clinton punts.\nFrom Breitbart’s Patrick Howley:\nWASHINGTON – Former Secretary of State Hillary Clinton said that someone in the State Department “misheard” her when she wondered aloud whether the United States still had a presence in Benghazi, Libya in 2012.\nRep. Martha Roby asked Clinton at Thursday’s House Benghazi Committee hearing about an email exchanged between two State staffers on February 9, 2012, seven months before the attack on the U.S. consulate that left four Americans dead. The staffers said that Clinton asked aloud whether the U.S. still had a presence in Benghazi, and said that Clinton would be “upset” to know that we were still there but that security was very weak.\n“I can’t speak to that,” Clinton said of the email. “Of course I knew we had a presence in Benghazi. I can’t speak to what someone either heard or misheard.”\n“I have no recollection of it and it doesn’t correspond with the facts of what were doing on a regular basis,” Clinton said.\nClinton also admitted that it still had not been decided by the day of the attack whether the U.S. compound in Benghazi was a consulate or some other kind of official entity.\n11: 50: Rep. Adam Smith (D-WA) continues to repeat the talking point about the millions the Committee has wasted on the Benghazi investigation. Democrats on the Committee seem uninterested in even probing Clinton about what happened in Benghazi and seem to be using the hearing to attack Republicans and defend Clinton.\nRep. Charlie Rangel (D-NY), who is not on the Committee, showed up to the hearing and apparently has nodded off:\nCharlie @cbrangel — on GOP side of Benghazi dais — appears to have nodded off. pic.twitter.com/6EQrjD5HTn — Dana Milbank (@Milbank) October 22, 2015\nFrom Breitbart’s Alex Swoyer: GOP presidential candidate former Arkansas Gov. Mike Huckabee, who has been highly critical of former Secretary of State and Democratic frontrunner Hillary Clinton’s whereabouts the night of the attack in Benghazi where four Americans were killed, is tuning into Clinton’s testimony before the House Select Committee on Benghazi even while on the campaign trail between events.\n11: 47: Clinton concedes Ambassador Stevens did not get “everything they requested” regarding security measures.\n11: 45: Rep. Martha Roby (R-AL) says it is frustrating that Clinton talked up taking responsibility in her opening statement yet continues to not have knowledge or any recollection regarding important emails regarding Benghazi sent by State Department officials.\n11:36 AM: Clinton says the CIA was in Benghazi to collect and destroy arms and get “weapons out of the wrong hands.”\nWhy was @HillaryClinton sworn in privately? I’m told Gowdy offered it to try to prove its not political. swear in pics are obviously loaded — Dana Bash (@DanaBashCNN) October 22, 2015\nFrom Breitbart’s Patrick Howley:\nWASHINGTON – Hillary Clinton said Thursday that she did not send or receive emails during the daytime during her tenure as Secretary of State, despite copious evidence to the contrary. “I did not email during the day except on rare occasions when I was able to,” Clinton said. Clinton spent a chunk of time at Thursday’s House Benghazi Committee hearing defending herself against the suggestion that she exposed classified information on email, saying that she did not conduct the business of the U.S. government on email. Clinton said that she did agency business in classified briefings, including times when couriers brought her information that was “so top-secret it was brought into my office in briefcases” and had to be immediately returned to the courier. However, State Department email dumps show many instances of Clinton emailing during the day, with her top aides, with her personal friends, with her adviser Sidney Blumenthal, and with many others. In fact, Clinton sent an email the very morning of the Benghazi attack, trying to find a copy of a “Harvey [Weinstein] movie about Libya in which she appeared to talk about gender issues.\nShe needed space on her desk for the fax machine, Olivetti typewriter, mimeograph, and Victrola. https://t.co/LpFst5ex2Q — John Hayward (@Doc_0) October 22, 2015\nHouse Minority Leader Nancy Pelosi (D-CA) has reportedly said that Democrats may boycott the Benghazi Committee after Clinton testifies:\nPelosi says ongoing talks about Ds boycotting Benghazi comm “let’s just see how the hearing goes today. What’s next? Is this thing forever?” — Deirdre Walsh (@deirdrewalshcnn) October 22, 2015\n11: 20 AM: Clinton claims some CIA memos were brought to her in a “locked briefcase.” 11: 17 AM: Rep. Susan Brooks (R-IN) says that Stevens was falling off of Clintons radar in 2012 when the situation was getting much worse. She says “there is not one e-mail to you or from you in 2012 when an explosive device went off in our compound in April.” “What kind of culture was created in the State Department where your folks couldn’t tell you in an email about a bomb in April of 2012?” she asks. Clinton says she did not conduct most of the country’s business on emails and says she made secure phone calls and had tons of meetings. “I did not do the vast majority of my work on emails,” Clinton claims. Clinton hypes up her White House meetings, but one of her emails that the State Department released showed she was once clueless about a meeting that was being held in the White House. 11:15 AM: Clinton refers to Chris Stevens’s mission in Libya as “expeditionary diplomacy” when asked if she was briefed about his security plans. Former U.N. Spokesman Richard Grenell calls out Clinton and Cummings’s questioning about her “stamp” on the cables and points out Clinton never saw relevant the cables because she had a private email account and could not access the cables without a State Department government email account:\nImportant Fact: Hillary only saw information that her staff flagged for her. She couldn’t read cables on the system without an email. — Richard Grenell (@RichardGrenell) October 22, 2015\nOutrageous! @HillaryClinton didn’t see cables because she had no official email account. — Richard Grenell (@RichardGrenell) October 22, 2015\nHillary’s stamp on cables are only irrelevant because SHE DIDNT HAVE AN OFFICIAL EMAIL ACCOUNT. had she had one, they would be in her inbox! — Richard Grenell (@RichardGrenell) October 22, 2015\n11: 00 AM: Clinton tries to absolve herself of any responsibility regarding rejecting Chris Stevens’s requests for more security. She claims she was not an expert on diplomatic security and had to rely on State Department experts that she would not “second-guess.” But she is being called out for “misleading.”\nClinton is misleading here. The requests for more security went up to her Undersecretary for Management Patrick Kennedy. — Josh Rogin (@joshrogin) October 22, 2015\n10: 56 AM: Cummings gives Clinton a chance to again defend the Accountability Review Board, which did not even ask for her emails or those of the late Chris Stevens. 10: 50 AM: Rep. Pete Roskam (R-IL) points out that Vice President Joe Biden disagreed with Clinton regarding military intervention in Libya. He says “our Libya policy couldn’t have happened without you because you were its chief architect.” He says Libya is a “disaster” because of Clinton. From Breitbart’s Patrick Howley: Hillary Defends Muslim Religion in Opening Remarks:\nWASHINGTON – Former Secretary of State Hillary Clinton defended the Muslim religion in her opening remarks at the House Benghazi Committee hearing Thursday. Clinton pointedly cited the existence of some signs at a rally in Libya after the Benghazi attack that read “Thugs don’t represent Islam” and “This is not the behavior of our Islam or our prophet.” Clinton noted in her remarks that she personally asked Ambassador Chris Steven to “go to Libya as our envoy” but noted that she did not meet fallen Foreign Service official Sean Smith. Clinton notably appeared to confirm that Stevens’ mission was to buy back American missiles from jihadist groups. Clinton said that it was a priority to make sure that missiles “did not fall into the wrong hands” so close to Israeli government targets. Clinton also acknowledged in her response that terrorism was responsible for the four Benghazi deaths, but she did not cite the Youtube video “Innocence of Muslims.” Clinton took the stairs entering the Committee room, clad in a dark blue sportcoat. Democratic Rep. Sheila Jackson-Lee and a friend chatted and occasionally laughed in the gallery behind Clinton as Rep. Trey Gowdy delivered his opening remarks. Clinton nodded as top Committee Democrat Rep. Elijah Cummings railed against supposed Republican partisanship with respect to the case, calling the Committee itself a “taxpayer-funded fishing expedition.” Though Clinton cited the findings of “a a nonpartisan,-hard hitting Accountability Review Board,” which did not find wrongdoing on Clinton’s part, Rep. Trey Gowdy pre-emptively dismissed that board’s findings in his own opening remarks. “You will hear a lot about the Accountability Review Board today,” Gowdy said. “Secretary Clinton mentioned the ARB more than 70 times in her previous testimony before Congress. But when you hear about the ARB you should also know State Department leadership handpicked members of the ARB, the ARB never interviewed Secretary Clinton, the ARB never reviewed her emails and Secretary Clinton’s top advisor was allowed to review and suggest changes to the ARB report before the public ever saw it. There is no transcript of ARB interviews, so it is impossible to know whether all relevant questions were asked and answered. And because there is no transcript it is impossible to cite ARB interviews with any particularity at all. That is not independent. That is not accountability. That is not a serious investigation.” Gowy also disparaged previous congressional investigations. “You will hear there were previous congressional investigations into Benghazi. That is true. It should make you wonder why those previous investigations failed to interview so many witnesses and failed to access so many documents. If those previous congressional investigations really were serious and thorough, how did they miss Ambassador Stevens’ emails? If those investigations were serious and thorough, how did they miss Secretary Clinton’s emails? If those previous congressional investigations were serious and thorough, why did they fail to interview dozens of key State Department witnesses including agents on the ground, who experienced the terrorist attacks firsthand?”\nRep. Sheila Jackson-Lee (D-TX), notorious for waiting hours before the State of the Union address to get a coveted aisle seat in order to get camera time, somehow managed to get a seat behind Clinton so that she is seen on all television networks right behind Clinton’s shoulder:\nNotable audience members in Hillary Clinton’s shot for Benghazi hearing: Reps. Sheila Jackson Lee and Joyce Beatty. pic.twitter.com/KfGPx4EudL — Matt Fuller (@MEPFuller) October 22, 2015\n10: 39: Clinton says part of America’s strength is that we learn, adapt, and get stronger. She notes that she asked Amb. Thomas Pickering and Adm. Mike Mullen to lead an ARB, which she claims did “not pull a single punch.” Clinton says she felt “great pride and honor” when she travelled to over a 100 countries as Secretary of State “representing the country that I love.” She talks up bipartisanship after even Vice President Joe Biden called her out for talking about Republicans as her “enemies” during the last debate. 10: 36: Clinton seems intent on making it seem like she cared deeply about Ambassador Chris Stevens. If Chris Matthews is right about her team wanting to use the hearing to create videos that will counterbalance her “what difference does it make?” moment, her remarks about Stevens, in her soft voice, may be an attempt at that. 10: 32: Clinton claims she “took responsibility” after the Benghazi attacks and mentions she stood next to President Barack Obama when the bodies of the four Americans who were killed returned from Benghazi. She doesn’t mention casting blame for the attacks on a parody video. She claims the ARB was “hard-hitting.” She says she enacted reforms after the attacks to protect Americans in the field. Here is the full text of Trey Gowdy’s opening statement:\nChris Stevens, Sean Smith, Glen Doherty and Tyrone Woods served our country with courage and with honor. They were killed under circumstances most of us could never imagine. Under cover of darkness, terrorists poured through the front gate of our facility and attacked our people and our property with machine guns, mortars and fire. It is important we remember how these four men died. It is equally important we remember how and why they lived. They were more than four images on a television screen. They were husbands, fathers, sons, brothers, family and friends. They were Americans who believed in service and sacrifice. Many people speak wistfully of a better world, but do little about it. These four men went out and tried to make it better. And it cost them their lives. We know what they gave us. What do we owe them? Justice for those who killed them. We owe their families our everlasting respect and gratitude. We owe them – and each other – the truth. The truth about why we were in Libya. The truth about what we were doing in Libya. The truth about the escalating violence in Libya before we were attacked and these four men lost their lives. The truth about requests for additional security. The truth about requests for more personnel. The truth about requests for more equipment. The truth about where and why our military was positioned as it was on the anniversary of 9-11. The truth about what was happening and being discussed in Washington while our people were under attack. The truth about what led to the attacks. The truth about what our government told the American people after the attacks. Why were there so many requests for more security personnel and equipment, and why were those requests denied in Washington? Why did the State Department compound in Benghazi not even come close to meeting proper security specifications? What policies were we pursuing in Libya that required a physical presence in spite of the escalating violence? Who in Washington was aware of the escalating violence in Libya? What special precautions, if any, were taken on the anniversary of 9-11? What happened in Washington after the first attack and what was the response to that attack? What did the military do or not do? What did our leaders in Washington do or not do and when? Why was the American public given such divergent accounts of what caused these attacks? And why is it so hard to get information from the very government these four men were representing and serving and sacrificing for? Even after an Accountability Review Board and half a dozen congressional investigations, these and other questions still lingered. These questions lingered because those previous investigations were not thorough. These questions lingered because those previous investigations were narrow in scope and either incapable or unwilling to access the facts and evidence necessary to answer all relevant questions. So the House of Representatives, including some Democrats, asked this Committee to write the final, definitive accounting of what happened in Benghazi. This committee is the first committee to review more than fifty thousand pages of documents because we insisted they be produced. This committee is the first committee to demand access to more eyewitnesses, because serious investigations talk to as many eyewitnesses as possible. This committee is the first committee to thoroughly and individually interview scores of other witnesses, many of them for the first time. This committee is the first committee to review thousands of pages of documents from top State Department personnel. This committee is the first committee to demand access to relevant documents from the CIA, the FBI, the Department of Defense, the State Department, and even the White House. This committee is the first committee to demand access to the emails to and from Ambassador Chris Stevens. How could an investigation possibly be considered credible without reviewing the emails of the person most knowledgeable about Libya? This committee is the first committee, the only committee, to uncover the fact that Secretary Clinton exclusively used personal email on her own personal server for official business and kept the public record – including emails about Benghazi and Libya – in her own custody and control for almost two years after she left office. And it was Secretary Clinton’s lawyers who determined what would be returned and what would not be returned. You will hear a lot about the Accountability Review Board today. Secretary Clinton mentioned the ARB more than 70 times in her previous testimony before Congress. But when you hear about the ARB you should also know State Department leadership handpicked members of the ARB, the ARB never interviewed Secretary Clinton, the ARB never reviewed her emails and Secretary Clinton’s top advisor was allowed to review and suggest changes to the ARB report before the public ever saw it. There is no transcript of ARB interviews, so it is impossible to know whether all relevant questions were asked and answered. And because there is no transcript it is impossible to cite ARB interviews with any particularity at all. That is not independent. That is not accountability. That is not a serious investigation. You will hear there were previous congressional investigations into Benghazi. That is true. It should make you wonder why those previous investigations failed to interview so many witnesses and failed to access so many documents. If those previous congressional investigations really were serious and thorough, how did they miss Ambassador Stevens’ emails? If those investigations were serious and thorough, how did they miss Secretary Clinton’s emails? If those previous congressional investigations were serious and thorough, why did they fail to interview dozens of key State Department witnesses including agents on the ground, who experienced the terrorist attacks firsthand? Just last month, three years after Benghazi, top aides finally returned documents to the State Department. A month ago, this Committee received 1500 new pages of Secretary Clinton’s emails related to Libya and Benghazi. 3 years after the attacks. A little over two weeks ago, this Committee received roughly 1400 pages of Ambassador Stevens’ emails. 3 years after the attacks. It is impossible to conduct a serious, fact-centric investigation without access to the documents from the former Secretary of State, the Ambassador who knew more about Libya than anyone else, and testimony from witnesses who survived the attacks. Madame Secretary, I understand some people – frankly in both parties -have suggested this investigation is about you. Let me assure you it is not. And let me assure you why it is not. This work is about something much more important than any single person. It is about four U.S. government workers, including our Ambassador, murdered by terrorists on foreign soil. It is about what happened before, during, and after the attacks that killed these four men. It is about what this country owes those who risk their lives to serve it. It is about the fundamental obligation of our government to tell the truth – always – to the American people. Not a single member of this Committee signed up for an investigation into you or your email system. We signed up because we wanted to honor the service and sacrifice of 4 people sent to a foreign land to represent us – who were killed – and do everything we can to prevent it from happening to others. Our Committee has interviewed half a hundred witnesses, not a single one of them has been named Clinton until today. You were the Secretary of State for this country when our facility was attacked. So, of course this Committee is going to talk to you. You are an important witness, but you are just one important witness, among half a hundred important witnesses. I understand you wanted to come sooner than today so let me be clear why that did not happen. You had an unusual email arrangement with yourself, which meant the State Department could not produce your emails to us. You made exclusive use of personal email and a personal server. When you left the State Department you kept those public records to yourself for almost two years. You and your attorneys decided what to return and what to delete. Those decisions were your decisions, not ours. It was only in March of this year we learned of this email arrangement. Since we learned of your email arrangement we have interviewed dozens of witnesses, only one of whom was about your email arrangement, and that was a very short interview because he invoked his Fifth Amendment privilege against self-incrimination. Making sure the public record is complete is what serious investigations do. So, it was important to gain access to Ambassador Stevens’ emails, the emails of other Sr. leaders and witnesses, and it was important to gain access to your emails. Your emails are no more or less important than anyone else’s. It just took longer to get them and garnered more attention in the process. I want you to take note during this hearing how many times congressional Democrats call on this administration to make long awaited documents available. They won’t. Take note of how many witnesses congressional Democrats ask us to schedule for interview. They won’t. We would be much closer to finishing this investigation and writing a final report if our Democrat colleagues decided to help us pursue the facts. If the Democrats on this committee had their way, dozens of witnesses never would have been interviewed, tens of thousands of documents never would have been reviewed, your public record would still be private, and we would never have accessed the emails of our Ambassador. All of that may be smart politics, but it is not the way to run a serious investigation. There are certain characteristics that make our country unique in the annals of history. We are the greatest experiment in self-governance the world has ever known. And part of that self-governance includes self-scrutiny – even of the highest officials. Our country is strong enough to handle the truth. And our fellow citizens expect us to pursue the truth, wherever the facts take us. So this committee is going to do what we pledged to do, and what should have been done long ago, which is interview the witnesses, examine the relevant evidence, and access the documents. We are going to pursue the truth in a manner worthy of the memory of the four men who lost their lives and worthy of the respect of our fellow citizens. We are going to write that final, definitive accounting of what happened in Benghazi. We would like to do it with your help, but we are going to do it nonetheless. Because understanding what happened in Benghazi goes to the heart of who we are as a country and the promises we make to those we send into harm’s way. They deserve the truth, the whole truth and nothing but the truth. The people we work for deserve the truth. The family and friends of those killed representing this country deserve the truth. There is no statute of limitations on that truth.\n10: 27: In her opening remarks, Clinton claims she is in Congress to honor the service of the four Americans who were killed in Benghazi. She says she “knew and admired” Chris Stevens. 10: 17: AM: Rep. Elijah Cummings (D-MA), the Committee’s Ranking Member, accuses Republicans of an “abusive effort” to wreck Clinton’s presidential bid with the Benghazi Committee. He accuses Republicans of spinning “conspiracy theories” and tries to downplay Hillary Clinton’s involvement with Sidney Blumenthal. 10: 15 AM: Gowdy says if Democrats had their way dozens of witnesses would have never been interviewed and Clinton’s emails would have been kept secret. “That may be smart politics, but it is a lousy way to run a serious investigation,” Gowdy says. 10: 03 AM: Gowdy, in his opening remarks, notes that the four Americans killed in Benghazi “served this country with honor” and “were killed under circumstances that most of us can never imagine.” He says it is important that we remember how they died and lived. He adds that these four went out to make the world better and “it cost them their lives.” He says we owe them justice and their families “everlasting gratitude” and the truth about why we were in Libya and what we were doing in Libya in addition to the truth about the request for additional security, personnel and equipment. Gowdy points out that the Benghazi Committee discovered that Clinton used a private email address and says no investigation could be taken seriously if Clinton’s emails were not reviewed. Gowdy also notes that the State Department’s Accountability Review Board did not even interview Clinton or examine her emails. Gowdy assures Clinton that the investigation is not about her. Instead, he says it is about the four people who were killed representing “our country on foreign soil.” He says it is “about what this country owes to those who serve it” and about government’s fundamental obligation to tell the truth to those it purports to represents. He says nobody on the Committee signed up to investigate Clinton’s emails but to honor the four Americans who were murdered and ensure that nothing like that ever happens again. 10: 15 AM: Gowdy says if Democrats had their way, dozens of witnesses would have never been interviewed and Clinton’s emails would have been kept secret. “That may be smart politics, but it is a lousy way to run a serious investigation,” he says, vowing to pursue the truth worthy of the four people who lost their lives and our fellow citizens. 10:00 AM: The Benghazi hearing begins as Chairman Trey Gowdy (R-SC) calls the Committee to order. 9:55 AM: MSNBC’s Chris Matthews concedes that Clinton’s “what difference does it make?” moment damaged her and Clinton may try to use this hearing to create a more positive moment that will counterbalance the negatives from her last appearance. 9: 45 AM: Hillary Clinton arrives in Congress, along with Huma Abedin, to testify before the Benghazi Committee.\nHappening now: Hillary Clinton arrives on Capitol Hill for Benghazi special committee hearing. pic.twitter.com/E3tdB2eMj5 — CNBC Now (@CNBCnow) October 22, 2015\n9:10 AM EST: The cable networks have their cameras on a car in front of Clinton’s Washington, D.C. home that will take Clinton to the hearing.","url":"https://www.breitbart.com/politics/2015/10/22/live-updates-hillary-testifies-before-benghazi-committee/"}
