{"authors":["Sami Mokbel For Mailonline"],"date_download":"2018-10-23 01:54:48","date_modify":"2018-10-23 01:54:48","date_publish":"2017-04-26 12:34:55","description":"Marvin Johnson will be the centre of attention at Oxford this weekend with a host of Premier League clubs due to check on the talented left-footer. He has scored seven goals from left back this season.","filename":"data/vaneerConsumption/LiverpoolandEvertonscoutstowatchMarvinJohnson.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F81F16000000578-0-image-a-72_1493205952282.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447400_Liverpool-Everton-scouts-watch-Marvin-Johnson_1540259688.html","title":"Liverpool and Everton scouts to watch Marvin Johnson","title_page":"Liverpool and Everton scouts to watch Marvin Johnson | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Marvin Johnson will be the centre of attention at Oxford this weekend with a host of Premier League clubs due to check on the talented left-footer.\nA number of scouts from top-flight clubs, including Leicester, Liverpool and Everton, are expected to watch the 26-year-old against Shrewsbury on Sunday.\nJohnson has been one of Oxford's stand-out performers this season; his performances attracting interest from a number of bigger clubs.\nA number of Premier League scouts are expected to watch Marvin Johnson this weekend\nThe former Motherwell player has been been deployed in an unfamiliar left back role this season but has impressed in the position, scoring seven goals.\nBut Oxford look to have an uphill task in trying to keep hold of Johnson this summer as clubs line up to sign him.\nJohnson spent the entirety of his career in non-League football before spending the 2015-16 season at Motherwell. He joined Oxford for an undisclosed fee last summer.","url":"https://www.dailymail.co.uk/sport/football/article-4447400/Liverpool-Everton-scouts-watch-Marvin-Johnson.html"}
