{"authors":[],"date_download":"2018-10-30 21:12:05","date_modify":"2018-10-30 21:12:05","date_publish":"2018-08-06 20:47:00","description":"Live updates: Rick Gates admits affair, embezzlement at Manafort trial","filename":"data/vaneerConsumption/LiveupdatesRickGatesadmitsaffairembezzlementatManaforttrial.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/10/30/Videos/4212443.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_rick-gates-testifying-paul-manafort-trial__1540933925.html","title":"Live updates: Rick Gates admits affair, embezzlement at Manafort trial","title_page":"Live updates: Rick Gates admits affair, embezzlement at Manafort trial","title_rss":"NULL","source_domain":"ajc.com","text":"Rick Gates, Paul Manafort’s right-hand man for more than 12 years, has finished testifying in Manafort’s financial fraud trial.\nGates, 46, testified under cross-examination by Manafort attorney Kevin Downing on Tuesday that he had an extra-marital affair that he helped finance with money he embezzled from Manafort.\nIn addition, he admitted that he and Manafort set up offshore accounts to avoid paying taxes, altered documents used for loans, and may have taken money from President Donald Trump’s inauguration coffers as reimbursement for personal expenses. Gates was on the president’s inauguration team.\n>> Read more trending news\nGates cut a plea deal with special counsel Robert Mueller's team earlier this year in exchange for his testimony. Mueller is investigating Russian interference in the 2016 election.\nGates was indicted Oct. 27 on charges that he conspired against the United States, conspired to launder money, gave false statements and did not file reports of foreign bank transactions and foreign financial accounts.\n>>Paul Manafort trial: When does it start, what is he accused of?\nHe and Manafort, 69, were additionally charged with tax evasion and bank fraud. Gates entered his pleas deal Feb. 23 and admitted to two felony charges.\nGates, who along with Manafort served in a senior role in Trump's campaign, has been a key cooperator with Mueller's team after he cut the plea deal in February.\nLive updates\nWednesday:\n11:10 a.m.: Gates has stepped down from the witness stand. Before he left, Downing asked if he had other extramarital affairs between 2010 and 2014. Downing said $3 million in transactions happened during that time period and suggested the money was embezzled and could have been used for such things as affairs. He asked Gates if he remembered telling prosecutors he had four extramarital affairs. Prosecutors objected to the question. After a conference with Judge Ellis, Downing rephrased the question, asking instead if the years 2010-2014 were part of the time he led a “secret life.” Gates admitted an affair on the stand on Tuesday after Downing suggested he led a secret life. “Mr. Downing, I’d say I made many mistakes, over many years,” Gates answered on Wednesday. Judge Ellis instructed Gates to answer the question specifically. “It did,” Gates said.\n11 a.m.: Gates tells Andres that Manafort knew of his extramarital affair. He said is lasted five months and happened 10 years ago. Gates brought up the affair in cross-examination testimony on Tuesday.\n10:45 a.m.: Andres asks Gates about the plea deal he made with the U.S. government. On Tuesday defense attorney Downing said that prosecutors had agreed not to oppose a request from Gates for a probationary sentence. He faces more than 19 years in prison. Gates says that the prosecutors’ deal is not a sure thing. It depends on how useful his information is to prosecutors, he says.\n10:35 a.m.: Federal prosecutor Greg Andres on re-direct examination asks Gates if he was told how to answer questions at the trial. Gates says, \"The only answer I was told was to tell the truth.\"\n10:15 a.m.: Prosecutors say they will need 30 minutes for re-direct questioning of Gates.\n10:10 a.m.: Downing asks Gates about an FBI interview that took place in 2014. Manafort was there and it concerned a forfeiture investigation. Gates says he told the FBI about the accounts in Cyprus, St. Vincent and the Grenadines. He says Manafort told him to be “open” about the accounts during the interview. Downing ends his cross-examination.\n9:55 a.m.: Court is now in session. Gates will be called to the stand for his third day of testifying.\n9:30 a.m.: Manafort defense attorneys will continue to question Gates this morning. Downing told Judge Ellis they expected to spend another hour cross-examining Gates.\nTuesday:\n5:28 p.m.: Gates says Manafort knew what was going on when it came to his finances. “Mr. Manafort was very good at knowing where the money was and where it was going,” Gates says. Judge Ellis challenged Gates saying, “He didn’t know about the money you were stealing, so he didn’t do it that closely.” The jury was sent home for the night. The cross-examination of Gates will continue on Wednesday.\n5:19 p.m.: Downing confronts Gates about lying and asks him if he expects the jury to believe him now when he says he is telling the truth. From The Washington Post: “After all the lies you’ve told and fraud you’ve committed, you expect this jury to believe you?” Downing asked. “Yes,” Gates responded flatly. “… I’m here to tell the truth. Mr. Manafort had the same path,” Gates said. “I’m here. I’m trying to change,” he said.\n4:57 p.m.: Gates admits to using the same tactic Manafort used – creating fake invoices to give to offshore banks to get money wired to certain accounts – to get money for a company he ran by himself. Gates testifies that some of the transfers were authorized and some were not. He says the transfers were not part of a “secret life,” that his wife knew about them.\n4:16 p.m.: Downing begins to ask Gates about his time with the Trump campaign, and prosecutors object. After the two attorneys talk with Judge Ellis, Ellis announces a 30-minute break.\n4:10 p.m.: Downing asks Gates if he submitted personal expenses to President Trump’s inaugural committee for reimbursement. Gates says, “It’s possible.”\n3:40 p.m.: Downing asks Gates if there is “a secret Richard Gates.” He asks if he had “another relationship” at one time. Gates admits to an affair that took place 10 years ago while he was in London. He admits he used money embezzled from Manafort to pay for an apartment in London and for first-class flights in relation to the affair.\n3:30 p.m.: Manafort defense attorney Kevin Downing calls Gates a liar as cross-examination begins. “When did you start providing false and misleading information to the special counsel’s office?” Downing asks. Downing goes on to ask if prosecutors told Gates he had “no chance of getting a plea agreement” after it was learned that he had lied. Gates explains that he had to agree to plead guilty to the lie and to being part of the conspiracy. “You knowingly and intentionally lied?” The Washington Post reports Downing asked. “Uh…. yes,” Gates said.\n2:45 p.m.: The prosecution has finished Gate’s direct examination. Manafort’s defense attorney will begin cross-examination of Gates any minute.\n2:40 p.m.: Gates says that in 2016 Manafort suggested Steve Calk be considered for secretary of the Army. Calk is the founder and CEO of Federal Savings Bank, one of the banks that extended Manafort a loan. Gates was on the Presidential Inaugural Committee at the time that Manafort emailed the request.\n2:25 p.m.: Gates testifies that he sent a profit and loss statement to Manafort in October of 2016. Manafort sent him an email asking how to convert the document into a non-PDF Word document. Prosecutors asked Gates why Manafort would want a Word document. Gates says, “to make some sort of change to it.” He says he sent Manafort the Word document and received an email back saying, in capital letters, “I HAVE ATTACHED A REVISED P&L. PLEASE REVIEW IT AND CALL ME TO DISCUSS THIS AND OTHER MATTERS.”\n2:20 p.m.: Gates testifies that he altered a profit and loss statement to make it look like Manafort had more income than he did so he could get a loan from Banc of California. Prosecutors asked him who directed him to do that. “Mr. Manafort,” Gates says.\n1:10 p.m.: Gates testifies that he provided a bank with documentation saying that Peranova Ltd., one of Manafort’s companies, forgave a loan. That would make Manafort’s income look higher and qualify him for a loan from the bank. However, the loan never existed, so it was never forgiven.The “forgiveness” of the loan was designed to have the money reclassified as income, allowing Manafort to qualify for the loan.\n12:45 p.m.: Gates testifies that he was asked by Manafort to give a bank fake home insurance documents so Manafort could get a loan. The bank discovered that there was a mortgage on the house – Manafort had said there was no mortgage when he applied for the loan. Gates said he then asked insurance broker Donna Duggan to provide an older insurance policy that showed there was no mortgage on the home.\n12:30 p.m.: Gates says that in 2015 and early 2016, the money from work in Ukraine was gone and Manafort’s company was in trouble. In the spring of 2016, Manafort hired him to work on “one of the presidential campaigns,” meaning Donald Trump’s campaign for president.\n12:18 p.m.: Gates says he and Manafort’s accountant reclassified income as a debt to cut Manafort’s tax bill. That moved saved Manafort around half a million dollars in income tax. Gates testified earlier that Manafort’s money had dried up in 2014 after Viktor Yanukovych was no longer in power in Ukraine.\n11:50 a.m.: Gates says that he was told by Manafort not to tell his accountant about any payments from Cyprus.\n11:40 a.m.: Gates says he created fake invoices for banks in St. Vincent and the Grenadines after Manafort moved his banking operations there. He needed the fake invoices because the Grenadines required more documentation in banking then Cyprus did, Gates testifies. “They asked for invoices.” Manafort asked him to “modify” invoices of legitimate payments, changing the invoice to include the company’s name.\n11:25 a.m.: Gates says he and Manafort were asked in 2014 by the FBI to be interviewed as part of a “forfeiture investigation” involving interest in Ukraine. He says he believed neither he nor Manafort was under investigation at the time. He and Manafort met with Serhiy Lyovochkin, a Ukrainian politician, to “notify him and determine the status of his Ukrainian company.” From that point, they were paid through one bank instead of international wire transfers.\n11 a.m.: Gates says that he and Manafort used a lawyer in Cyprus to set up various accounts. Referred to as “Dr. K,” the lawyer’s firm “handled everything,” Gates says. Neither he nor Manafort interacted with the bank. “I believe (Manafort) understood his name would not be represented, nor would mine,” Gates testifies.\n10:45 a.m.: Gates says Manafort reported some of the income from the shell companies to the IRS as loans.\n10:40 a.m.: Gates explains how he and Manafort set up the shell companies so they could get paid for their work in Ukraine -- Ukrainian businessmen would set up companies in Cyprus then issue payments to a company that Manafort had set up there. From Washington Post reporting: “Did these companies sell a product,” prosecutor Greg Andres asked Gates. “No,” he replied. “Did they have any employees?” Andres asked. “No,” Gates repeated. “The purposes of the companies was to accept payments and to make payments,” he said.\nGovernment's star witness in the Manafort trial is back on the stand, and Rick Gates is telling jurors how he and Manafort used offshore shell companies and bank accounts in Cyprus to funnel foreign income and hide it from the IRS: https://t.co/YUr572u7bQ — AP Politics (@AP_Politics) August 7, 2018\n10:20 a.m.: Gates says Ukrainian politicians, including Serhiy Lovochkin and Borys Kolesnikov, paid Manafort through accounts in Cyprus.\n10:05 a.m.: Gates is being asked about the Cyprus bank accounts set up by Konstantin Kilimnik, a Ukranian political consultant.\n9:40 a.m.: The trial has resumed and Gates is on the stand.\n9:30 a.m.: According to prosecutors, they expect to question Gates for the next three hours. Manafort’s defense attorneys will then begin to cross-examine Gates.\n9:15 a.m.: Gates will continue his testimony Tuesday. Trial is set to begin at 9:30 a.m. ET\nBREAKING: Longtime Manafort deputy Rick Gates returns to the witness stand in fraud trial of former Trump campaign chairman. — AP Politics (@AP_Politics) August 7, 2018\nWhat happened Monday:\nGates is asked by prosecutors whether he was involved in any criminal activity with Manafort. He says, “Yes.”\nGates says he conspired with Manafort to falsify Manafort’s tax returns.\nGates testifies that he and Manafort failed to report foreign bank accounts and they did it knowingly.\nGates admits to embezzling from Manafort. According to The Washington Post, Gates testifies that he, “added money to expense reports and created expense reports” to pad his salary by “several hundred thousand” dollars.\nRick Gates testifying against Paul Manafort:\n“Did you commit crimes with Mr. Manafort?” the prosecutor asked.\n“Yes,” Gates responded. https://t.co/Src9rYQVGk — Washington Post (@washingtonpost) August 6, 2018\nGates says that he and Manafort held 15 foreign bank accounts that they did not disclose to the federal government.\nGates says Manafort's associate Konstantin Kilimnik, a Ukrainian political consultant, was listed on the foreign accounts.\nGates says Manafort was paid by Ukrainian operatives for political work. They wired money from their companies to foreign accounts in Cyprus, he says.\nGates says the financial filings were not submitted “at Mr. Manafort’s direction.”\nProsecutors and Judge T.S. Ellis argue over the pace of the questioning. Ellis asks prosecutor Greg Andres about expediting the trial. Andres says “We’re doing everything we can to move the trial along.” Later, Ellis says, “We need to focus sharply.” As Andres tries to explain his questioning, Ellis says, “Next question.”\nGates testifies that he met with investigators 20 times.\nGates testifies that if the government determines his help in the Manafort case is “substantial” then he could avoid jail time. Judge Ellis reminds him the judge in his trial would decide his jail time.\nThe trial has ended for the day. Gates will be back on the stand on Tuesday morning.\nSources: The Washington Post; The New York Times; The Independent","url":"https://www.ajc.com/news/national/rick-gates-testifying-paul-manafort-trial/3NgiBxK4TUenkeq21PIPHK/"}
