{"authors":["Reuters Reporter"],"date_download":"2018-10-23 01:54:40","date_modify":"2018-10-23 01:54:40","date_publish":"2017-04-26 12:37:21","description":"Liverpool are third in the Premier League but have conceded the most goals amongst the top six teams, leading to disappointing results including Sunday's loss to 12th-placed Crystal Palace.","filename":"data/vaneerConsumption/LiverpoolFCteamworkcansortdefencesaysRagnarKlavan.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F5E7100000578-0-image-a-72_1493206558450.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447444_Liverpool-FC-teamwork-sort-defence-says-Ragnar-Klavan_1540259680.html","title":"Liverpool FC teamwork can sort defence, says Ragnar Klavan","title_page":"Liverpool FC teamwork can sort defence, says Ragnar Klavan | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Liverpool must work together as a team to improve in defence and stop giving away goals, defender Ragnar Klavan says.\nLiverpool are third in the Premier League table but have conceded the most goals amongst the top six teams, leading to disappointing results including last Sunday's 2-1 loss to 12th-placed Crystal Palace.\n'It's not easy to put it down to a couple of things, but we have to work together as a team,' Klavan told the club's website.\nLiverpool must work together to stop giving away goals, defender Ragnar Klavan says\nChristian Benteke (2nd left) scores Crystal Palace's winner against Liverpool at the weekend\n'That's our goal, of course, to not concede any goals in any game, but this is football and everybody has good strikers as well. It's not so easy to pinpoint exactly what is going on.'\nLiverpool have managed to keep just eight clean sheets in 34 league fixtures this season.\n'I think it's not just one thing, there are multiple things put together that make the whole difference,' the 31-year-old said.\n'At this level, it can be one moment, just a lack of concentration, and that's it. In this harsh league, those things get punished straight away and that's how it is when you play at the highest level.'\nLiverpool have a two point lead over fourth-placed Manchester City, having played two games more and must win their maintain their slender advantage.","url":"https://www.dailymail.co.uk/sport/football/article-4447444/Liverpool-FC-teamwork-sort-defence-says-Ragnar-Klavan.html"}
