{"authors":["Associated Press"],"date_download":"2018-10-23 02:21:05","date_modify":"2018-10-23 02:21:05","date_publish":"2016-01-29 16:45:06","description":"NEW YORK (AP) — Eagle-eyed viewers of \"Grease: Live\" might see some familiar faces during the broadcast — two stars of the 1978 film have cameos. In a nice t...","filename":"data/vaneerConsumption/LiveGreaseshowwillhavesomefamiliarfacesfromfilm.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:b44777720ad4419bb0e25cf455712050-3bmscybNe842cce83474b57ef204-233_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423125_Live-Grease-familiar-faces-film_1540261265.html","title":"Live 'Grease' show will have some familiar faces from film","title_page":"Live 'Grease' show will have some familiar faces from film | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Live 'Grease' show will have some familiar faces from film\nNEW YORK (AP) — Eagle-eyed viewers of \"Grease: Live\" might see some familiar faces during the broadcast — two stars of the 1978 film have cameos.\nIn a nice tip of the hat to the past, Fox asked Didi Conn, who played Frenchy in the John Travolta-led movie, and Barry Pearl, who was Doody onscreen, will appear in small roles on Sunday (Fox, 7 p.m. EST and tape-delayed for Pacific time).\n\"The fact that the two us should be chosen to be part of this as an homage — an overall collective homage to the piece — is just delicious,\" said Pearl. \"That has been the 'Grease' experience all the way along. It's been one magical moment after the next.\"\nThis image released by Fox shows Carly Rae Jepsen, left, and Didi Conn during a rehearsal for \"Grease: Live.\" Conn, who played Frenchy in the 1978 John Travolta-led movie, will make a cameo appearance as a waitress at the Frosty Palace malt shop. Jepsen will play Frenchy in the new production airing Sunday, Jan. 31, on Fox. (Kevin Estrada/FOX via AP)\nIn this new rock 'n' roll paean to puberty set in the 1950s, Conn, 64, will play a waitress at the Frosty Palace malt shop, while Pearl, 65, plays a TV producer, a role written for him.\nThe pair will join stars Julianne Hough as Sandy, Aaron Tveit as Danny Zuko, Vanessa Hudgens as Rizzo, Carly Rae Jepsen as Frenchy, KeKe Palmer as Marty and Mario Lopez as Vince Fontaine. The show is being filmed on two massive Warner Bros. soundstages in Burbank, California.\nConn said her first meeting with Jepsen — in her old role — was emotional. \"I started to cry. I think partly it was 'That could be my daughter that I never had,'\" said the actress. \"She is absolutely yummy-adorable.\"\nOther cameos will be done by \"Saturday Night Live\" alum Ana Gasteyer, \"Brady Bunch\" star Eve Plumb, \"The Fresh Beat Band\" star Yvette Gonzalez-Nacer and \"The Wire\" star Wendell Pierce. A live audience will add a dash of theater, which won't rattle Pearl or Conn, who are both stage veterans.\nOver the years, Pearl and Conn have become the keepers of the \"Grease\" flame, organizing reunions and protecting the actors' copyright. \"He's the troop leader of the T-Birds and I'm the den mother,\" said Conn.\nThis time, they added their deep knowledge of all things \"Grease.\" During rehearsals, Conn noticed the boys in leather jackets weren't being nearly amorous enough around the girls, while Pearl pointed out that the script called for the guys to high-five but no one did that during the Eisenhower administration.\nPearl, whose link to \"Grease\" started when he joined the first national tour in 1973, said natural changes have crept in over the years. For instance, on Sunday there will be no f-bombs or cigarette smoking, and the lyrics for \"Greased Lightnin' have been sanitized.\nBut the broadcast will have a lot of Broadway DNA. It's being directed by Thomas Kail (\"Hamilton\"), with music supervision by Tom Kitt (\"Next to Normal\"), production design by David Korins (\"Hamilton\") and costume design by William Ivey Long (\"Cabaret\").\nConn, who after starring with Travolta in \"Grease\" went on to play \"Lost in Yonkers\" on Broadway and voiced the animated film \"Raggedy Ann & Andy: A Musical Adventure,\" said there's a reason \"Grease\" never dies.\n\"'Grease' is about firsts — first love, first car, first heartbreak. For Frenchie, first career disappointment,\" she said. \"It's a story of excitement and newness and energy.\"\nFor Pearl, who made his Broadway debut in \"Bye Bye Birdie\" and also was in \"Oliver!\" it's all about finding a surrogate family of friends: \"At the core of it is a group of kids that just love each other.\"\n___\nOnline:\nhttp://www.fox.com/grease-live\n___\nFollow Mark Kennedy on Twitter at http://twitter.com/KennedyTwits\nIn this image released by Fox, Barry Pearl, left, and Ana Gasteyer appear during a rehearsal for \"Grease: Live.\" Pearl, 65, who starred as Doody in the 1978 film, \"Grease,\" will make a cameo as a TV producer in the Fox presentation airing live on Sunday. (Kevin Estrada/Fox via AP)\nThis image released by Paramount Pictures, Didi Conn appears as Frenchy in the 1978 film, \"Grease.\" Conn, 64, will make a cameo appearance in \"Grease: Live,\" playing a waitress at the Frosty Palace malt shop in the live production airing Sunday on Fox. (Paramount Pictures via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3423125/Live-Grease-familiar-faces-film.html"}
