{"authors":["Rohan Banerjee For Mailonline"],"date_download":"2018-10-23 04:08:09","date_modify":"2018-10-23 04:08:09","date_publish":"2016-01-11 17:10:09","description":"Liverpool manager Jurgen Klopp has moved to distance the club from transfer speculation linking them with a bid for Corinthians forward Alexandre Pato.","filename":"data/vaneerConsumption/LiverpoolsJurgenKloppplaysdownAlexandrePatolink.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300D283400000578-0-image-a-14_1452532131313.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3394212_Liverpool-boss-Jurgen-Klopp-plays-Alexandre-Pato-link-Corinthians-forward-s-future-remains-uncertain_1540267689.html","title":"Liverpool's Jurgen Klopp plays down Alexandre Pato link","title_page":"Liverpool's Jurgen Klopp plays down Alexandre Pato link | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He has since seen his career stall and is now at Corinthians\nThe 26-year-old was tipped for a big future while at AC Milan\nLiverpool manager Jurgen Klopp has moved to distance the club from transfer speculation linking them with a bid for Corinthians forward Alexandre Pato.\nThe 26-year-old, once tipped as a potential world-beater during his prior spell with AC Milan, has since seen his career stall after a series of injuries and a dip in form.\nItalian journalist Alfredo Pedulla recently claimed that Liverpool were ready to take a £12million gamble on Pato, who has openly admitted a desire for a fresh start at a new club, preferably in the Premier League.\nCorinthians' Alexandre Pato, who spent last season on loan at Sao Paulo, has been linked with Liverpool\nHowever, Reds manager Jurgen Klopp has ruled out a move for Pato during this month's transfer window\nHowever, quizzed on the matter at his press conference on Monday Reds boss Klopp said: 'My private advice is you don't follow the Pato path any longer.'\nPato revealed to Sportsmail in an exclusive interview last year: 'I like the emotion in the English league. You look at the TV and you see the stadium and the fans. I remember that when we (Milan) played Arsenal, they were very strong and very fast.\n'My special thing is my speed. I'm fast. I think that's because the football here is very quick.'\nHe added: 'I don't think the physical part of English football would be a problem. When you get the ball you need to be ready. The defenders here are very tough but I like that.'\nAfter falling out of favour at the San Siro, Pato left Milan to join Corinthians in January 2013.\nBut that hasn't worked out for the 2009 winner of FIFA's Golden Boy award and following a similarly ill-fated loan spell with Sao Paulo last season, he finds himself being offered around. Pato is also reportedly a target for West Ham.\nSince leaving AC Milan in 2013, Pato has struggled to replicate the sort of form that shot him to stardom\nPato's loan spell at Sao Paulo was not especially successful and he is now looking for a new club\nWhile Klopp has confirmed that Liverpool will not bid for Pato, the Merseysiders could still be in the market for a striker this month.\nDanny Ings remains on the sidelines with a long-term anterior cruciate ligament injury, while Daniel Sturridge and Divock Origi are out of action with hamstring strains.","url":"https://www.dailymail.co.uk/sport/football/article-3394212/Liverpool-boss-Jurgen-Klopp-plays-Alexandre-Pato-link-Corinthians-forward-s-future-remains-uncertain.html"}
