{"authors":["Jasmin Sahota","Ryan Smith For Mailonline"],"date_download":"2018-10-23 00:40:37","date_modify":"2018-10-23 00:40:37","date_publish":"2017-03-16 10:11:26","description":"The actress, 39, and her fiancé Dave Gardner proved they were closer than ever as she fished through his trouser pockets as they attended the Cheltenham Festival's Ladies' Day.","filename":"data/vaneerConsumption/LivTylercheekilyfishesthroughDaveGardnerspockets.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E531C5B00000578-0-image-a-13_1489656295497.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319390_Liv-Tyler-cheekily-fishes-Dave-Gardner-s-pockets_1540255237.html","title":"Liv Tyler cheekily fishes through Dave Gardner's pockets","title_page":"Liv Tyler cheekily fishes through Dave Gardner's pockets | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They looked every inch the perfect couple as they enjoyed a trip to Cheltenham Festival's Ladies' Day.\nAnd cheeky Liv Tyler and her fiancé Dave Gardner proved they were closer than ever as she fished through his trouser pockets as they watched the horse racing festivities on Wednesday morning.\nThe actress, 39, looked in high spirits as she flaunted her famous smile while cheekily resting her hand in her partner's pocket.\nScroll down for video\nWhat's she looking for? Cheeky Liv Tyler, 39, fished through her fiancé Dave Gardner's trouser pockets as they attended the Cheltenham Festival's Ladies' Day\nThe couple - who share son Sailor Gene, two, and daughter Lula, Rose, seven months - enjoyed their short break from parenting as they giggled and shared jokes throughout the day.\nJoined by her future hubby, Liv kept her eyes concealed with chic sunglasses while watching the horse racing on the star-studded balcony as she cosied up to Dave.\nThe actress looked elegant in a flowing black dress with full sleeves and a high neckline, adding an extra touch of glamour with a matching wide-brimmed hat.\nLooking for some spare change? The actress looked in high spirits as she flaunted her famous smile while cheekily resting her hand in her partner's pocket\nLoved up: Joined by her future hubby, Liv kept her eyes concealed with chic sunglasses while watching the horse racing on the star-studded balcony as she cosied up to Dave\nLiv-ing it up! Liv and Dave cut very chic figures at the popular horse racing event\nWith black heels adding extra height to her statuesque frame, the screen beauty looked every inch the movie star as she threw on a pair of stylish sunglasses.\nWith her voluminous brown hair falling to her shoulders in bouncy waves, deep pink lipstick added a flourish of colour to her look, as did a multi-coloured handbag.\nGetting comfortable for the highly-anticipated horse racing, the actress later took off her fabulously chic hat to expose her long chestnut tresses.\nRunning well: The couple made a beeline for their enclosure, where they lapped up the races\nElated: The daughter of Aerosmith rocker Steven Tyler looked particularly excited on the day\nShady lady: The 39-year-old star peeled off her sunglasses as she took in all of the action\nSpirited: She clutched a set of binoculars, allowing her a better view of the racing action\nWas it a win? Liv and her pals appeared to be celebrating a win during the fun-filled day\nGrin: Dave shared her excitement, leaning forwards to watch the action as he grinned broadly\nToo hot to handle: Once in their VIP box, Dave peeled off his blazer as the races heated up\nFlutter: The pal of David Beckham also appeared to enjoy a winning flutter at the meet\nShe held hands with her handsome beau - a close friend of David Beckham - who looked dapper in a double-breasted grey suit with a crisp white shirt and black tie.\nThe loving couple were among a host of stars who made their way down to the annual horse-racing event, which is a much favoured fixture on the social calendar.\nCamilla, Duchess of Cornwall donned a racing green felt hat and sea-foam herringbone coat as she joined racegoers on the sunny day.\nThe 69-year-old royal looked in good spirits as she arrived on day two of the world-renowned Gloucestershire meet, smiling for photos in the spring sunshine.\nHand-in-hand: The couple arrived at the prestigious annual horse-racing event holding hands\nBlack: The actress opted to forgo bright colours, wearing an elegant black dress to the event\nCat's the way to do it: She teamed added a stylish pair of cat eye sunglasses to her ensemble\nBags of colour: While her ensemble was all-black, her embroidered bag provided some colour\nDapper gent: Meanwhile, her partner Dave looked dapper in a double-breasted light grey suit\nLayered: Liv teamed her dress with a matching overcoat when she arrived via helicopter\nHigh neckline: The screen star's flowing full-sleeved dress featured a high neckline\nThe wife of Prince Charles brought a contrasting splash of colour to the bold look with a pale pink and white scarf.\nShe finished the outfit with a pair of black suede calf-length boots and small black handbag, and appeared to have her Canon camera slung over her shoulder.\nHer niece-in-law Zara Tindall was spotted arriving alongside close friend Dolly Maude, actor James Nesbitt and Chanelle McCoy, wife of star jockey Tony.\nTake a look at that! Liv shared her observations with her loving partner during the races\nPretty in pink: A smudge of deep pink lipstick added a flourish of colour to her ensemble\nPals: Actress Sadie Frost, left, was also among the group who joined the couple in their box\nJet-setter: American actress Liv has been spending much of time in the UK since meeting Dave\nAdoration: Dave, who's friends with sports star David Beckham, peered at his fiancée adoringly\nLet's hug it out! She enthusiastically greeted a pal with a warm hug as her sporting day wore on\nAll together now: The group huddled up to snap a selfie together\nLoving life: Liv was all smiles as she joined her friends in the huddle\nSeen something you like? Liv beamed broadly as she peered out over the binoculars\nAll smiles: Liv beamed broadly and was full of giggles as she watched the races unfold\nDance it out: She was very animated as she watched the races with her friends\nCan't hold it in: Liv erupted into fits of giggles as she watched the races from the stands\nEye see you! Liv snaped a picture of her pals peering out through their binoculars\nZara looked stylish in a black-and-white checked coat, which she accessorised with a vibrant fuchsia hat.\nThis year is set to be a more sedate affair at the iconic racecourse after bosses introduced a restriction on purchasing alcohol\nFollowing drunken scenes last year, when well-heeled festival-goers saw footballers urinating into glasses and women flashing their breasts, the Jockey Club has decided that enough is enough.\nPucker up! Sadie Frost was also in the stands with her boyfriend Darren Strowger\nCute couple: The pair cosied up to one another and looked very loved-up on the day\nEyes forward! The pair seemed more interested in each other than the races taking place\nDistracted? Darren did break away, however, to check his phone during the kiss\nCute couple: The pair were very cosy on the outing as they leant against the railings\nHat's a good look! Sadie looked sensational in a navy velvet trouser suit that she wore with a grey hate and black chunky soled shoes\nKeen: Zara Tindall, herself a keen esquestrian, was also among the attendees at the event\nChic: She looked chic in a wool gingham coat, which she teamed with a purple fascinator\nStepping out: Meanwhile, Zara was seen making a stylish arrival with her large group of pals\nSmile! She flashed a smile as she posed for a playful snapshot with actor James Nesbitt\nShock! Horror! Zara appeared shocked as she watched the proceedings from lofty heights\nAction: Her mother Anne, Princess Royal watched the action with Andrew Parker-Bowles\nCome one! She shouted support for her racer of choice as she watched from the Royal box\nThose hoping to buy a round of several pints will be limited to just four at a time. The cap will apply to all alcoholic drinks, including wine, beer and spirits.\nEvery bar will have a water point, and the closing times for complimentary bars in hospitality will be brought forward.\nRacegoers are set for a fruitful day ahead with the a forecast for dry conditions, with some sunny spells.\nRacing green: The Duchess of Cambridge donned a vibrant green felt hat and sea-foam herringbone coat as she arrived at the event\nMaking a statement: The duchess seemed to draw on the upcoming St Patrick's Day festivities\nInspired by spring: The hat and coat were paired with a silk scarf in hues of pink and white\nShielding from the sun: The wide-brimmed hat helped Camilla see in the brilliant sunlight\nA-list party: Zara Tindall, left, smiled as she arrived with close friend Dolly Maude, actor James Nesbitt and Chanelle McCoy, wife of star jockey Tony, for the second day of races\nLayering up: James donned a green blazer over a dark sweater, blue shirt and pink tie\nFans were getting into the spirit of the day from early on, sipping on mini bottles of champagne from the bar as they waited for the action to begin.\nOthers came well stocked, bringing their own supplies of bubbly as well as elaborate spreads which they laid out on picnic tables in the car park.\nOne man was even spotted carving a joint of meat prepared specially for al fresco dining.\nTan: Gareth Gates arrived sporting his trusty terracotta tan and a smart grey three-piece suit\nHair we go again: The erstwhile Pop Idol runner-up also sported an eye-catching combover\nStyle: Jockey and former cyclist Victoria Pendleton was appropriately dressed for the occasion\nSoaring to new heights: Footballer Peter Crouch towered over his Stoke City teammate Glen Johnson Race as they made their arrival\nDaddy long legs: The sports star has two daughters with his glamour model wife Abbey Clancy\nCooling off: As he took in all of the action, the striker couldn't resist enjoying a cold beverage\nTeammates: The players from Stoke City FC all enjoyed a day out on the Gloucestershire tracks\nOn Tuesday, Simon Claisse, Clerk of the Course at Cheltenham, said: 'We had a dry night. It was a bit a little bit murky and cloudy this morning. We expect the cloud to rise during the day and hopefully we will have some sunny spells.\n'The going on the chase and hurdle courses on the Old Course remains Good to Soft.\n'If the sun comes out and the wind just blows a little bit, it may dry out and we may end up with good in places sometime through the afternoon.'\nAll things bright and beautiful: As usual, the day wasn't short of bright and eye-catching outfits\nWinner: David Bass was seen celebrating after winning the Neptune Investment Management Novices Hurdle on Willoughby Court\nRestrictions: This year is set to be a more sedate affair at the iconic racecourse after bosses introduced a restriction on purchasing alcohol","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319390/Liv-Tyler-cheekily-fishes-Dave-Gardner-s-pockets.html"}
