{"authors":["Ciara Farmer For Mailonline"],"date_download":"2018-10-22 22:39:05","date_modify":"2018-10-22 22:39:05","date_publish":"2017-03-10 01:16:23","description":"The 47-year-old former WAG looked incredible as she flaunted her eye-popping assets in a red push-up bra with a sheer top which she tucked the number into jeans","filename":"data/vaneerConsumption/LizzieCundyflashesbraheadingtoFubarRadioStation.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1F09D800000578-0-image-a-157_1489106173038.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299602_Lizzie-Cundy-leaves-imagination_1540247945.html","title":"Lizzie Cundy flashes bra heading to Fubar Radio Station","title_page":"Lizzie Cundy flashes bra heading to Fubar Radio Station | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Her sensational body is seldom covered up.\nAnd Lizzie Cundy once again bared all as she headed to her show at Fubar Radio Station in London on Tuesday, where she sizzled in a barely-there ensemble for her hot interview with Jessica Cunningham.\nThe 47-year-old former WAG looked incredible as she flaunted her eye-popping assets in a red push-up bra with a sheer top which she tucked the number into jeans while the Apprentice beauty wowed in leather.\nScroll down for video\nOh my! Lizzie Cundy once again bared all as she headed to her radio show at Fubar Radio Station in London on Tuesday, as she sizzled in a barely-there ensemble for her hot interview with Apprentice star Jessica Cunningham\nLizzie has become a stalwart of the London party scene, where she frequents all the hot bashes looking sensational in various states of undress.\nHer eye-popping assets were the focal point of the look as she gave her cleavage a push with the help of a red bra which was given a sexier edge with a black trim.\nThe brunette beauty made sure her taut abs were also displayed as she paired the look with high-waisted jeans to meet the hem of the cropped top.\nProving she knows how to work all her best assets she boosted her endless legs with the addition of staggering heels with a tasseled tie around the ankle.\nSexy ladies: The 47-year-old former WAG looked incredible as she flaunted her eye-popping assets in a red push-up bra with a sheer top which she tucked the number into jeans while the Apprentice beauty wowed in leather\nCheeky! Lizzie has become a stalwart of the London party scene, where she frequents all the hot bashes looking sensational in various states of undress\nLizzie's make-up was naturally flawlessly applied as she wore a smokey eyeshadown with lashings of highlighter and a slick of pink lipstick.\nHer lengthy raven tresses were worn in dead straight lengths with a sweeping fringe, which tickled her eyes in length and perfectly framed her pretty features.\nJessica meanwhile went for a subtle sexy look as she opted for a skin-tight leather dress with a sexy red leather biker jacket over the top.\nShe too wore her long raven locks in dead straight lengths as she strutted her stuff into the radio show for her chat with Lizzie.\nStunner: Lizzie's make-up was naturally flawlessly applied as she wore a smokey eyeshadown with lashings of highlighter and a slick of pink lipstick\nHot mama: Jessica meanwhile went for a subtle sexy look as she opted for a skin-tight leather dress with a sexy red leather biker jacket over the top\nRed hot: She too wore her long raven locks in dead straight lengths as she strutted her stuff into the radio show for her chat with Lizzie\nJust days before the dazzling outing, Lizzie was left majorly red-faced after she suffered a major wardrobe malfunction as she split her figure-flaunting leather trousers.\nThe former WAG documented her embarrassing fashion faux pas on Instagram with her social media followers sharing her racy mishap.\nPosting the X-rated snap online, the mother-of-two's ripped pants split from the top of her peachy derriere right down to her thighs, exposing her cheeks.\nAnd while it's unknown what exactly she managed to do to dramatically tear her skintight trousers, she did illustrate her lacy intimates as her hand rested on her thigh for the saucy picture.\nOh my: Just days before the dazzling outing, Lizzie was left majorly red-faced after she suffered a major wardrobe malfunction as she split her figure-flaunting leather trousers\nThe brunette - who is mother to Josh, 22, and James, 15 - captioned the lingerie flashing snap: 'Good start to the day... anyone got a needle and cotton ? Doh\nHer underwear flaunting snap comes a day after she enjoyed pal Amy Childs' baby shower in Essex.\nFubar radio presenter Lizzie was previously married to ex-Chelsea footballer Jason Cundy, 47, for 16 years and made a career as a self-appointed spokesperson for WAG culture.\nIn early 2010, she discovered her husband was having an affair with an opera singer he’d met by chance on a train and with whom he had fallen in love.\nSlinky: She told the Mail in an interview at the time: 'I just didn’t see it coming. At first, I didn’t know how to handle it. After all the years together, I thought we were a successful team – that we would grow old together'\nShe told the Mail in an interview at the time: 'I just didn’t see it coming. At first, I didn’t know how to handle it. After all the years together, I thought we were a successful team – that we would grow old together.\n'I felt physically sick, but I kept telling myself that it was all a mistake. When I confronted him, I said I know something’s going on. He looked at me and I just knew it was true.'\nShe added in the revealing chat: 'He said I was always busy at work and he felt neglected... that it was my fault. We ended up crying. I desperately wanted to save our marriage and he seemed as if he wanted that too. Unfortunately, I couldn’t save it – I didn’t realise the strength of feelings Jason had for her.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299602/Lizzie-Cundy-leaves-imagination.html"}
