{"authors":["Stephen Bisset For Daily Mail Australia"],"date_download":"2018-10-23 02:33:30","date_modify":"2018-10-23 02:33:30","date_publish":"2017-04-26 13:36:42","description":"Lizzy Caplan has opened up about her time on the set of the Brad Pitt and Marion Cotillard WWII romantic thriller Allied which hit the DVD shelves in Australia on Wednesday.","filename":"data/vaneerConsumption/LizzyCaplanopensuponWW2epicAlliedrole.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9FAF6F00000578-0-image-a-5_1493210039490.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447184_Lizzie-Caplan-opens-WW2-epic-Allied-role_1540262010.html","title":"Lizzy Caplan opens up on WW2 epic Allied role","title_page":"Lizzy Caplan opens up on WW2 epic Allied role | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the quirky US actress who has wowed audiences in the likes of Now You See Me 2, The Interview and The Night Before.\nNow Lizzy Caplan has opened up about her time on the set of the Brad Pitt and Marion Cotillard WWII romantic thriller Allied.\nSpeaking to Yahoo Be, the brunette beauty gave quite a succinct retelling of what her role in the film entails.\nWar epic: Lizzy Caplan has opened up about her time on the set of the Brad Pitt and Marion Cotillard WWII romantic thriller Allied which hit the DVD shelves in Australia on Wednesday\n'I, uh, am Brad's [Pitt] sister. And I am living in London, uh, working in the military as well. And I'm a hot s**t lez,' the star revealed.\nWhile having the opportunity to star alongside such big box office draws as Brad Pitt and Marion Cotillard would be enough for anyone to want to jump at the chance, for Lizzy, it was the chance to work with iconic director Robert Zemeckis.\n'Well, it feels like a bit of a no-brainer, wanting to be a part of this film, Robert Zemeckis, I'm like a crazy fan of his, Back to the Future, I mean, that alone. If he asked me to take out his garbage i would agree to do it.'\nStar power: 'I, uh, am Brad's [Pitt] sister. And I am living in London, uh, working in the military as well. And I'm a hot s**t lez,' the star revealed to Yahoo Be. Marion Cotillard pictured left\nBig business: Allied is certainly resonating with fans as the war-torn romantic drama raked in more than $12 million on its US opening weekend\nAllied follows the story of a Canadian intelligence officer (Pitt) who meets a French resistance fighter (Cotillard) while on a dangerous mission in North Africa. Planning to marry on their return to London, but the war may have other plans.\nAllied is certainly resonating with fans as the war-torn romantic drama raked in more than $12 million on its US opening weekend.\nHaving already made a name for herself plating Virginia Johnson in the HBO drama Masters Of Sex, Lizzy's star has continued to rise with substantial turns in the illusion-heist flick Now You See Me 2, Seth Rogan comedies The Interview and The Night Before and the romantic comedy The Bachelorette.\nLizzy will next be seen on the big screen in the sci-fi thriller Extinction, due for release in 2018.\nSoaring: Having already made a name for herself plating Virginia Johnson in the HBO drama Masters Of Sex, Lizzy's star continues to rise","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447184/Lizzie-Caplan-opens-WW2-epic-Allied-role.html"}
