{"authors":["Liz Hull For The Daily Mail"],"date_download":"2018-10-22 20:32:41","date_modify":"2018-10-22 20:32:41","date_publish":"2016-01-28 01:46:49","description":"Organiser Ted Harding, 76 – a retired joiner who has been ballroom dancing for more 50 years – said the management committee for the Trinity Centre in Llandudno, Wales, were ‘killjoys’.","filename":"data/vaneerConsumption/Llandudnoballroomdancersbannedfromtheirpracticespaceforputtingdowndust.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/30A0D08E00000578-0-image-a-65_1453945558022.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420257_Troupe-ballroom-dancers-banned-practice-space-accused-putting-dust-accelerant-help-glide-around_1540240361.html","title":"Llandudno ballroom dancers banned from their practice space for 'putting down dust'","title_page":"Llandudno ballroom dancers banned from their practice space for 'putting down dust' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A troupe of ballroom dancing pensioners have been banned from their practice space amid a row over a slippery floor.\nThe group of 40 dancers were accused of putting down dust as an ‘accelerant’ to help them glide around more smoothly.\nThey strongly deny the claims – however they have now been barred from the hall after making it ‘dangerous for others’.\nA troupe of ballroom dancing pensioners have been banned from their practice space amid a row over a slippery floor. The group, led by organiser Ted Harding (pictured with his wife Doris), strongly deny the claims\nOrganiser Ted Harding, 76 – a retired joiner who has been ballroom dancing for more 50 years – said the management committee for the Trinity Centre in Llandudno, Wales, were ‘killjoys’.\n‘I’m shattered,’ he said. ‘For eight years my wife Doris and I have run the Saturday dances. We don’t use anything on the floor – the dust is caused by the lacquer they [the management] use.’\n‘It’s broken down and is producing a powder. They’re blaming us for putting down the powder but we’re not responsible.’\nHe added: ‘We have been treated very badly, and I really feel for those elderly people who look forward to each Saturday night\n‘Many of them don’t get out very often, it’s ironic since the centre is supposed to help the elderly.’\nBut councillor Linda Groom, chairman of the committee, said warnings about using dust on the floor or on shoes had been ignored.\nThe retired joiner, who has been ballroom dancing for more 50 years, said the management committee for the Trinity Centre in Llandudno, Wales (pictured) were ‘killjoys’\nAnd although there have so far been no accidents at the centre, the group’s contract has been terminated.\n‘We have to put safety first,’ she said. ‘They were putting accelerants on the floor, which made it dangerous for the next users. There have been complaints.’\nAnother regular dancer, 73-year-old Rosina Wompra, said the group plan to launch a petition to fight the decision.\n‘We never put accelerants on the floor because we try to keep upright,’ Mrs Wompra added. ‘Most of the ladies have special shoes with a suede bottom and they would be ruined. It wouldn’t make any sense.","url":"https://www.dailymail.co.uk/news/article-3420257/Troupe-ballroom-dancers-banned-practice-space-accused-putting-dust-accelerant-help-glide-around.html"}
