{"authors":["Will Martin"],"date_download":"2018-10-30 22:01:36","date_modify":"2018-10-30 22:01:36","date_publish":"2016-12-15 00:00:00","description":"Lloyd's, which focuses on marine, energy, and political risk insurance, will set up a subsidiary in a country that will still be part of the EU.","filename":"data/vaneerConsumption/LloydsofLondontosetupaEuropeansubsidiaryin2017.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_lloyds-of-london-part-of-business-will-leave-london-2016-12_1540936896.html","title":"Lloyd's of London to set up a European subsidiary in 2017","title_page":"    Lloyd's of London to set up a European subsidiary in 2017 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Lloyd's of London staff hold their annual Armistice Day service at the Lloyd's building in the City of London, Britain November 11, 2016. Reuters/Eddie Keogh\nLondon's 328-year old Lloyd's insurance market will definitely create an office somewhere within the European Union and move some of its operations to the continent in reaction to the UK's Brexit vote.\nThe Financial Times reports that the insurance market, the world's oldest, has created a shortlist of five possible destinations for the new subsidiary and will put a proposal before members of the market early next year, before the triggering of Article 50.\nLloyd's, the non-stock market listed group which focuses on marine, energy, and political risk insurance, will set up a subsidiary in a country that will still be part of the EU because of a Brexit will likely strip the UK of its financial passport— the right to operate across the remaining 27 EU nations.\nAccording to Lloyd's, last year business within the European Economic Area \"accounted for £2.93 billion or 11% of Lloyd's Gross Written Premium.\" It does not want to risk that 11% once Britain leaves the EU, so will now set up elsewhere.\n\"Insurance is a mobile business,\" Lloyd's of London chairman John Nelson said, according to the FT. \"In common with other financial institutions, we need to put our plans in place — at least on a precautionary basis.\"\nIdeally, Lloyd's would keep 100% of its operations in the UK, but realises that the UK's potential loss of financial passporting could severely hinder its ability to operate in Europe, and it simply does not want to take that risk.\nThe move has been heavily trailed, with CEO Inga Beale saying in an interview with the BBC in September that Brexit fallout \"is a major issue for us to deal with\" and that leaving the EU could make the group lose 4% in revenues so it is looking to set up a subsidiary or branches within the bloc to make sure it counteracts some of that hit.\n\"It's the lack of certainty for our clients. Business cannot hang around,\" she said. \"Boards are going to insist that they make plans [for life after Brexit]. Boards are going to insist that they make plans [for life after Brexit],\" Beale said.\n\"Some people may end up doing their jobs in other parts of Europe rather than in London.\"\nAccording to figures from the Financial Conduct Authority, released by the House of Commons' Treasury Select Committee in September, 5,476 UK firms have at least one passport that allows them to do business in other EU and European Economic Area nations. Many firms hold several passports, meaning that the total number in the UK stands at 336,421.\nThe loss of passporting rights following Brexit is probably the biggest fear in the City of London right now. If the passport is taken away, then London could cease to be the most important financial centre in Europe, costing the UK thousands of jobs and billions in revenues.\nIt now appears that the City of London will not be given any special treatment during the UK's Brexit negotiations and the government is ready to let businesses leave.\n\"There was quite a blunt warning that politically the Government does not want to be seen to do a deal to favour rich bankers if it doesn't comply with Brexit voters' wishes - that there is more to the negotiation that just the City,\" an unnamed \"industry leader\" told The Daily Telegraph last week after a summit between ministers and key City figures, including Beale.","url":"https://www.businessinsider.com/lloyds-of-london-part-of-business-will-leave-london-2016-12"}
