{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 20:46:01","date_modify":"2018-10-30 20:46:01","date_publish":"2016-12-28 00:00:00","description":"Lloyds Banking Group is planning to open a subsidiary in mainland Europe to maintain access to the single market post-Brexit.","filename":"data/vaneerConsumption/LloydsplansEUunittomaintainsinglemarketaccessafterBrexit.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_lloyds-europe-office-germany-netherlands-brexit-unit-2016-12_1540932361.html","title":"Lloyds plans EU unit to maintain single market access after Brexit","title_page":"    Lloyds plans EU unit to maintain single market access after Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Lloyds Chief Executive Antonio Horta-Osorio speaks at the British Chambers of Commerce annual meeting in central London February 10, 2015. Reuters\nLONDON — Lloyds Banking Group is planning to open a subsidiary in mainland Europe to maintain access to the European Union's single market post-Brexit, according to a report in the Financial Times.\nThe lender is targeting either Germany or the Netherlands for the unit, the report said, where it already has branches.\nLloyds declined to comment.\nSubsidiaries are generally more expensive to run than branches, because they are fully capitalised separately from the parent bank.\nThe EU is in the process of tightening rules for subsidiaries of non-EU banks.\nBritain looks likely to lose its financial passport in Brexit negotiations due to start next year. Passporting rights allow UK-based financial firms to access clients across the 28-nation EU via branches.\nThe so-called financial passport has allowed London's financial centre to act as a hub for global firms looking to do business in the EU. According to figures from the Financial Conduct Authority, released by the House of Commons' Treasury Select Committee in September, 5,476 UK firms have at least one passport that allows them to do business in other EU and European Economic Area nations. Many firms hold several passports, meaning that the total number in the UK stands at 336,421.\nIn September, the chief of Germany's Bundesbank, Jens Weidmann, warned that the UK won't get a special deal from the EU on the passports and will need to allow free movement of citizens from EU nations if it wants to maintain the right. The current Conservative government does not look likely to fight for passporting during Brexit negotiations, instead prioritising control over immigration.\nLloyds isn't the only firm looking to beef up abroad to counter the effects of Brexit. London's 328-year old insurance market, Lloyd's of London, is planning to move some of its operations to the continent in reaction to the UK's Brexit vote.\nYou can read the full FT story here.","url":"https://www.businessinsider.com/lloyds-europe-office-germany-netherlands-brexit-unit-2016-12"}
