{"authors":["Press Association"],"date_download":"2018-10-23 04:45:59","date_modify":"2018-10-23 04:45:59","date_publish":"2017-03-10 14:58:06","description":"Lloyds is providing the additional funds after the Financial Conduct Authority laid down a deadline of the end of August 2019 for making new claims.","filename":"data/vaneerConsumption/Lloydsearmarksfurther350mforPPIcasesafterclaimsdeadlineextended.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/16/wire-196895-1489162707-850_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4301580_Lloyds-sets-aside-extra-350m-funding-cover-PPI-cases_1540269959.html","title":"Lloyds earmarks further £350m for PPI cases after claims deadline extended","title_page":"Lloyds earmarks further £350m for PPI cases after claims deadline extended | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lloyds Banking Group has forked out an extra £350 million to cover mis-sold payment protection insurance (PPI) claims, bringing its total bill for the scandal to £17.3 billion.\nThe high street lender hived off additional funds after the Financial Conduct Authority (FCA) extended its proposed deadline for new claims by two months to the end of August 2019.\nLloyds said the increased provision would also cover a rise in both the number of claims, and the size of compensation payouts, following the Plevin ruling – a Supreme Court judgment on PPI complaints handling.\nLloyds\n“The additional provision has been taken to reflect the estimated impact of the policy statement including the revised arrangements for Plevin cases, which includes a requirement to pro-actively contact customers who have previously had their complaints defended,” it added.\nThe part taxpayer-backed bank said the extra funds would be noted in its first-quarter results published in April this year.\nThe FCA said earlier this month that consumers would have until August 29 2019 at the latest to make their PPI complaint, but some, including those who have previously been told by their firm that they may have been mis-sold, may run out of time sooner.\nA total of £26.2 billion has already been paid out since January 2011 as a result of the PPI scandal, according to the regulator’s figures.\nLloyds\nThe update comes after Lloyds posted its highest annual profits for a decade in February as it moved a step closer to full privatisation.\nIts bottom-line profits more than doubled to £4.24 billion last year from £1.64 billion in 2015, marking its biggest profit haul since 2006.\nHowever, the group said its performance was “inextricably linked to the health of the UK economy”, which faces an uncertain outlook amid Brexit negotiations.\nThe Government reduced its stake in Lloyds to less than 4% in February, cutting its holding by around 1%.\nIt means more than £19 billion has been returned to Government coffers since the lender’s £20.3 billion bailout.","url":"https://www.dailymail.co.uk/wires/pa/article-4301580/Lloyds-sets-aside-extra-350m-funding-cover-PPI-cases.html"}
