{"authors":["Ildefonso Ortiz"],"date_download":"2018-10-30 20:47:25","date_modify":"2018-10-30 20:47:25","date_publish":"2015-11-14 20:48:54","description":"A prominent Mexican Social Democrat has called his fellow Mexicans hypocrites for voicing their outrage at the Islamic terrorist massacre in Paris, yet the country remains silent about the many massacres that have taken place in Mexico. |","filename":"data/vaneerConsumption/LocalPoliticianDecriesMexicosHypocrisyonParisTerrorismasTheyIgnoreAtrocitiesatHome.json","image_url":"https://media.breitbart.com/media/2015/10/Knights-Templar-Cartel-Killings.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_14__1540932445.html","title":"Local Politician Decries Mexico's Hypocrisy on Paris Terrorism as They Ignore Atrocities at Home","title_page":"Local Politician Decries Mexico's Hypocrisy on Paris Terrorism as They Ignore Atrocities at Home","title_rss":"NULL","source_domain":"breitbart.com","text":"A prominent Mexican Social Democrat has called his fellow Mexicans hypocrites for voicing their outrage at the Islamic terrorist massacre in Paris, yet the country remains silent about the many massacres that have taken place in Mexico.\nJust hours after Islamic terrorists massacred scores of innocent victims in Paris in that country’s deadliest terrorist attack, people in Mexico quickly took to social media to voice their unity and support.\nOn Saturday, many Facebook and Twitter profiles had turned their photographs to variations of the French flag as well as photos that had the hash tag #OremosPorParis.\nHowever, on Friday night as news of the brutal attack began to spread, Jose Gerardo Fernandez Norona, a prominent politician with the Worker’s Party (PT), posted his retort calling the Mexican people hypocritical.\n“As much as this may irritate some, it is profoundly hypocritical to be outraged by the massacre in Paris yet play dumb with the ones in Mexico,” Fernandez Norona said through his Twitter account Friday night.\nThe politician spent part of the night debating with people on social media as to why the Mexican people were hypocrites since Mexico has seen thousands of persons butchered yet the public remains complacent.\n“The ones in Mexico are an everyday thing and some of those outraged could care less about the ones in their country,” the politician tweeted.\nFernandez Nornona even joked about the terrorist attacks giving a “what if” scenario if it had happened in Mexico.\n“Horrible what happened in France and I’m not even joking in saying that (If it happened here) @EPN (Mexican President Enrique Pena Nieto) would blame the narco (drug cartels) and that would be that.” Fernandez Norona joked.\nThe politician further expanded on his joke claiming Pena Nieto would have a large number of innocents arrested claiming they were dangerous criminals and claim that all the victims were tied to drug trafficking.\nIldefonso Ortiz is an award winning journalist with Breitbart Texas you can follow him on Twitter and on Facebook.","url":"https://www.breitbart.com/politics/2015/11/14/hold-politician-calls-mexicans-hypocrites-for-paris-outrage-while-remaining-silent-for-mexicos-massacres/"}
