{"authors":["Patrick Howley"],"date_download":"2018-10-30 19:45:28","date_modify":"2018-10-30 19:45:28","date_publish":"2015-08-25 16:06:57","description":"Disgraced former Internal Revenue Service (IRS) official Lois Lerner used a fake email identity to conduct official government business.","filename":"data/vaneerConsumption/LoisLernerUsedaFakeEmailAccountNamedTobyMiles.json","image_url":"https://media.breitbart.com/media/2015/04/Lois-Lerner-looks-down-her-nose-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_25__1540928728.html","title":"Lois Lerner Used a Fake Email Account Named 'Toby Miles'","title_page":"Lois Lerner Used a Fake Email Account Named 'Toby Miles'","title_rss":"NULL","source_domain":"breitbart.com","text":"Disgraced former Internal Revenue Service (IRS) official Lois Lerner used a fake email identity to conduct official government business.\nLerner used the false name “Toby Miles” to send and receive some of her emails, according to a court filing made by an IRS attorney in the agency’s civil case involving the nonprofit group Judicial Watch.\nThe IRS has steadfastly claimed that all of Lerner’s official IRS emails were lost when her computer crashed in 2011, and her computer hard drive was destroyed. But copies of some emails were later turned over to U.S. House investigators.\nThe investigation into Lerner’s improper targeting of conservative nonprofit groups is ongoing. As this reporter revealed, the White House and IRS exchanged confidential taxpayer information on groups during the period in which the IRS was harassing conservatives.\nSo who was Toby Miles? The character, that is. Was he a mid-level traveling salesman hitting hotel bars in a Hawaaian shirt? An aging musician still barnstorming out-of-the-way blues bars with nothing but a harmonica and a fading dream? The imagination wanders…","url":"https://www.breitbart.com/politics/2015/08/25/lois-lerner-used-a-fake-email-account-named-toby-miles/"}
