{"authors":["Chris Kitching For Mailonline"],"date_download":"2018-10-22 23:22:57","date_modify":"2018-10-22 23:22:57","date_publish":"2016-01-28 12:12:32","description":"An annual study that tracks international arrivals found Britain's capital had 17.3million foreign visitors - the most of any city in Europe - but is in danger of lagging behind its rivals.","filename":"data/vaneerConsumption/LondonnamedthesecondmostvisitedcityintheworldbyEuromonitor.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A9526A00000578-0-image-a-13_1453979373382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3420729_London-named-second-visited-city-world-Euromonitor_1540250577.html","title":"London named the second most visited city in the world by Euromonitor","title_page":"London named the second most visited city in the world by Euromonitor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"London has jumped two spots to become the second most visited city in the world, according to an annual study that tracks international arrivals.\nBritain’s capital overtook Bangkok and Singapore with a total of 17.3million foreign visitors, but was a distant second behind Hong Kong (27.7million), which claimed top spot for the sixth consecutive year.\nSingapore jumped one spot to third, while Bangkok dropped to fourth and Paris rounded out the top five.\nLondon jumped to spots to claim second spot on Euromonitor's annual list, trailing only Hong Kong\nTHE MOST VISITED CITIES IN THE WORLD 1. Hong Kong – 27.7million (+8.2%) 2. London – 17.3million (+3.6%) 3. Singapore – 17million (-0.4%) 4. Bangkok – 16.2million (-7%) 5. Paris – 14.98million (-1.9%) 6. Macau – 14.96million (+7.4%) 7. Shenzhen – 13.1million (+8%) 8. New York City – 12.2million (+3.2%) 9. Istanbul – 11.8million (+13.2%) 10. Kuala Lumpur – 11.6million (+4%) Source: Euromonitor\nMacau jumped to sixth spot and was followed by Shenzhen, China, New York, Istanbul and Kuala Lumpur.\nWith 3.6 per cent more international visitors on the previous year, London was the top destination in Europe and the only UK city to crack the top 100, but Euromonitor warned its growth is at risk of stalling.\nWouter Geerts, travel analyst at Euromonitor, said: ‘London is one of the most iconic cities in the world. The resounding success of the London Olympics in 2012 has boosted visibility and popularity even further.\n‘However, with London airports nearing capacity, the capital risks losing out to European rivals. To remain competitive in the international city destinations landscape, ensuring connectivity and innovation is key.’\nThe study by Euromonitor International was released today and is based on figures from 2014, the latest full-year data available.\nIt ranked the top 100 cities for international arrivals, with Asia and Europe each boasting 35 on the list. North America had nine.\nHong Kong topped the list for the sixth consecutive year, with nearly 28 million visitors, the study found\nIn terms of countries, China and the US led with seven cities each.\nRio de Janeiro had the biggest increase, at 46.6 per cent, thanks to the FIFA World Cup, and this year’s Summer Olympics are expected to drive further growth, the report said.\nFamed for its white beaches and crystal clear waters, Cancun, Mexico, followed at 42.1 per cent.\nKyiv dropped off the list amid a deadly conflict in Ukraine, while St Petersburg and Russia each saw a double-digit decline.\nGreece, meanwhile, saw an all-time high in international arrivals, with Athens and two other cities entering the ranking. Next year’s study will reveal what impact the migrant crisis has had on arrivals at Greek airports.\nAsia has seen rapid growth thanks to the growing number of Chinese travellers, improved flight connections and relaxed visa restrictions.","url":"https://www.dailymail.co.uk/travel/travel_news/article-3420729/London-named-second-visited-city-world-Euromonitor.html"}
