{"authors":["Keiligh Baker For Mailonline"],"date_download":"2018-10-23 01:42:06","date_modify":"2018-10-23 01:42:06","date_publish":"2017-04-26 12:12:23","description":"Paul Birchmore, 43, has been found guilty of assault after he allegedly clipped Angus Fitzgerald’s back wheel three times as he drove a Big Bus Tours double decker northbound over Waterloo Bridge.","filename":"data/vaneerConsumption/Londontourbusdrivershovedcyclistoffbike.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9ED88B00000578-0-image-a-9_1493205137215.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447200_Bus-driver-shoved-cyclist-bike-traffic_1540258926.html","title":"London tour bus driver ‘shoved cyclist off bike'","title_page":"London tour bus driver ‘shoved cyclist off bike' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Paul Birchmore, 43, (pictured) allegedly clipped Angus Fitzgerald’s back wheel three times as he drove a Big Bus Tours double decker northbound over Waterloo Bridge\nA tourist coach driver has been convicted of assault after he shoved a cyclist off his bike into oncoming traffic.\nPaul Birchmore, 43, was convicted in just an hour by a jury in Southwark Crown Court after denying assaulting Angus Fitzgerald on Waterloo Bridge on July 29 last year.\nBirchmore, 43, allegedly clipped Mr Fitzgerald’s back wheel three times as he drove a Big Bus Tours double decker northbound over Waterloo Bridge.\nWhen Mr Fitzgerald tried to ask him for his details over the ‘slow speed collision’, Birchmore and a tour guide put their middle fingers up at him and drove off, jurors heard.\nThe cyclist caught up with Birchmore at a bus stop on Aldwych, central London, and parked in front of him while calling the police to stop him from driving off.\nBirchmore then decided to ‘try to bulldoze the cyclist out of his way,’ before allegedly getting out of the bus to push him off his bike headfirst into oncoming traffic.\nGoPro footage played to jurors at Southwark Crown Court showed Mr Fitzgerald hitting his head off the left-hand side of a moving car, though he suffered no injuries.\nA jury of five men and seven women took just an hour to find Birchmore guilty of assaulting Mr Fitzgerald. They failed to reach a verdict on a charge of dangerous driving and were discharged.\nProsecutors will announce tomorrow whether Birchmore will face a retrial on the dangerous driving charge.\nBirchmore, who represented himself during the trial, told the court any 'close passes' in the lead up to the confrontation were accidental.\nAlec Williams, prosecuting, said: ‘In a nutshell, it is all about road rage, that phrase which has somewhat fallen out of fashion, but that is very much what the prosecution say has happened here.\n‘On 29 July, on a warm summer’s evening, Mr Birchmore was working as a bus driver, driving one of those large tourist double decker buses and he came into contact, or conflict, with a cyclist by the name of Mr Fitzgerald.\n‘The disagreement between Mr Fitzgerald and Mr Birchmore took place south of the river, south of Waterloo Bridge, near the large IMAX roundabout.\n‘The disagreement between Mr Fitzgerald and Mr Birchmore took place south of the river, south of Waterloo Bridge, near the large IMAX roundabout (pictured)\n‘Both Mr Fitzgerald, who is cycling with two friends, and Mr Birchmore, who is on his bus, are both going in the same direction, both going north heading over Waterloo Bridge.’\nMr Williams said there ‘was some jockeying for position on the road’ before Birchmore began ‘bumping into the back of Mr Fitzgerald’s bike and tempers, the Crown say, started to get frayed.’\n‘This is a slow speed collision. Mr Fitzgerald moves to go and speak to the driver as the bus slows up in traffic to get his details and complain about his driving, but Mr Birchmore does not want to engage with them.’\nMr Williams said that there were ‘in total three similar incidents of the bike and bus coming to blows, albeit these are at slow speed.’\nHe added that Mr Fitzgerald then decided to call the police ‘because he was so concerned about the nature of the driving by Mr Birchmore.’\nWhen Mr Fitzgerald saw Birchmore at a bus stop, ‘he decides to take the proactive step of placing himself directly in front of the bus in order to say, “you are going nowhere.”\n‘Rather than doing any number of things, one of which could have been simply to wait for the police...Mr Birchmore makes the decision to effectively try to bulldoze the cyclist out of his way.\n‘There are two separate occasions in which the bus is used to physically try to shove the bicycle out of his way,’ which Mr Williams said were the actions that constituted the charge of dangerous driving.\n‘Mr Birchmore then exits the bus and pushes the cyclist with sufficient force that he falls off his back and, most concerningly of all, at the time he is pushed, he is pushed into the path of oncoming traffic and collides with a car.\n‘Fortunately, his injuries were nowhere near as bad as they potentially could have been.’\nGiving evidence Mr Fitzgerald said that when he initially tried to get details from the driver, Birchmore and a colleague were ‘putting their middle fingers up.’\nHe said that he was parked in front of Birchmore’s bus and ‘still on the phone to the police. Next thing, someone pushes me from behind and I head into oncoming traffic and I hit my head on the side of a car.’\nBirchmore, who represented himself during the trial, told the court any 'close passes' in the lead up to the confrontation were accidental.\nThe driver, who boasts 20 years' experience driving buses and also on behalf of the London Fire Brigade, also claimed the 'abusive' cyclists refused his offers to exchange details.\n'The only reason I have pushed him is to push him out of the way from doing damage to the bus,' he said, claiming to have heard 'scratching' from the bicycle against the bus' fibreglass front.\n'I would not say I lost control. The only reason I got out of the bus was to stop him.\n'I was protecting my company's property.'","url":"https://www.dailymail.co.uk/news/article-4447200/Bus-driver-shoved-cyclist-bike-traffic.html"}
