{"authors":["Liam Deacon"],"date_download":"2018-10-30 18:07:07","date_modify":"2018-10-30 18:07:07","date_publish":"2016-09-19 15:50:55","description":"On a trip to New York City, London’s Muslim Mayor Sadiq Khan has said terror attacks are just \"part and parcel\" of urban life.","filename":"data/vaneerConsumption/LondonsMuslimMayorTellsNewYorkTerrorAttacksNormal.json","image_url":"https://media.breitbart.com/media/2016/09/ggg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_09_19__1540922827.html","title":"London’s Muslim Mayor Tells New York Terror Attacks Normal","title_page":"London’s Muslim Mayor Tells New York Terror Attacks Normal","title_rss":"NULL","source_domain":"breitbart.com","text":"On a trip to New York City, London’s Muslim Mayor Sadiq Khan has said terror attacks are “part and parcel” of urban life, just hours after an Islamic terrorist bombed the city.\nMr. Khan also seized the opportunity to launch an explicit attack on the Brexit vote and rise of Republican presidential candidate Donald Trump. He compared to two movements, claiming they are both driven by “scapegoating”.\n“All these problems will not be solved by voting to leave the EU or voting for – I don’t want to name the candidate – a president of the USA,” he said.\nHe said that he and Bill de Blasio, the Mayor of New York, “believe in building bridges rather than walls” and that there are leaders “who address people’s concerns” and others “who play on people’s fears”.\nThe London Mayor joked that he “shouldn’t really get involved in the American elections”, but added: “I hope the best candidate wins – I’m sure she will”, repeating his endorsement of Hillary Clinton which he first made in Chicago last week.\nBuilding Inclusive Cities: Mayor Bill de Blasio in conversation with London Mayor Sadiq Khan at LaGuardia Community College in Long Island City. Posted by Mayor Bill de Blasio on Sunday, 18 September 2016\nThe two left-wing mayors, of London and New York, were speaking at an event called ‘Building Progressive, Inclusive Cities’ in New York. It is the second time the men have met, after coming together before at the Labour party conference in Britain last year.\nEarlier on Sunday, Mr. Khan had spoken at a “meeting for Muslim community leaders” where he also addressed the attacks.\n“It is a reality I’m afraid that London, New York, other major cities around the world have got to be prepared for these sorts of things,” he said, the Evening Standard reports.\n“That means being vigilant, having a police force that is in touch with communities, it means the security services being ready, but also it means exchanging ideas and best practice,” he added.\nAt the meeting with New York’s Mayor, he began: “It’s important, in the context of the explosion last night, for me to say this to you: Londoners stand shoulder to shoulder with New Yorkers.”\nHe then appeared to draw an equivalence between people who say offence things and terrorists who commit violence.\nHe slammed “some people who try and divide our communities”, people who “say things they shouldn’t be saying”, along with “people who try to commit acts of terror”.\n“We are the West”, he asserted, insisting that it is “compatible to be someone with Western liberal values… [and] to be a mainstream Muslim”.\nBuilding bridges not walls: with young people from all faiths & backgrounds here at Temple Sholom in Chicago w @ifyc pic.twitter.com/RQEyvILkQc — Sadiq Khan (@SadiqKhan) September 17, 2016\nIn New York, he also said of the Brexit it Vote: “I tell you what happened when we voted to leave the EU, there was a spike in race attacks”, despite the fact this claim has been widely discredited.\nMr. Khan also attacked those who raise concerns about his connections with radical Islam, claiming his Conservative opponent in the London mayoral election ran a “negative” and “divisive” campaign containing “some of the worst sorts of Islamophobia you have every seen”.\nDuring the campaign, it emerged Mr. Khan had shared a platform with numerous anti-Semites, defended 9/11 terrorists as a barrister, and had a brother-in-law who was a member of banned jihadi group Al-Muhajiroun.\nAnd since taking office, he has appointed an extremism-linked “Integration Deputy Mayor”, as Breitbart London revealed last week.","url":"https://www.breitbart.com/europe/2016/09/19/londons-muslim-mayor-tells-new-york-terror-attacks-normal-trump-scapegoating/"}
