{"authors":["Chris Kitching For Mailonline"],"date_download":"2018-10-23 02:31:03","date_modify":"2018-10-23 02:31:03","date_publish":"2016-01-11 14:52:11","description":"Luxury yachts worth millions of pounds are the main attraction at the London Boat Show, but it also features some of the latest toys or gadgets for wealthy buyers.","filename":"data/vaneerConsumption/LondonBoatShow2016toysgadgetsandaccessoriesforluxuryyachts.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300BA8AA00000578-0-image-a-43_1452526674083.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3393839_London-Boat-toys-gadgets-accessories-luxury-yachts_1540261863.html","title":"London Boat Show 2016 toys, gadgets and accessories for luxury yachts","title_page":"London Boat Show 2016 toys, gadgets and accessories for luxury yachts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Luxury yachts worth millions of pounds are the main attraction at the London Boat Show, but it also features some of the latest toys or gadgets for wealthy buyers.\nWith hundreds of exhibitors on hand at this year's event, yacht owners have plenty of options to keep guests entertained while sailing the Mediterranean or Caribbean.\nThis year's must-have accessories include a high-performance personal watercraft that can do a top speed of nearly 75mph and a device that allows riders to swim in the sea like a dolphin.\nScroll down for video\nSeabob F5 S\nThe Seabob F5 S, created by German firm Cayogo, propels riders at a top underwater speed of nearly 10mph at depths of 131ft\nAll riders have to do is point the Seabob in the direction they want to travel and set the speed. It can travel 12.5mph on the surface\nHolidaymakers who have dreamed of swimming like a fish can do so with the Seabob F5 S, which propels riders at an underwater speed of nearly 10mph at depths of 131ft.\nIt is even faster on the surface, where it can hit a top speed of nearly 12.5mph.\nAll riders have to do is point the Seabob in the direction they want to travel and set the speed. If they let go or dive beyond their pre-set limit, the £7,800 device will stop automatically and float to the surface.\nPowered by a high-energy lithium-manganese battery, the Seabob F5 S runs for about 60 minutes before it needs a charge.\nSea-Doo RXT-X 300\nWith a top speed of nearly 75mph, Sea-Doo's RXT-X 300 will be one of the hottest toys when superyachts return to the Mediterranean\nThe beastly machine boasts a supercharged 300-horsepower Rotax engine which is the biggest ever on a Sea-Doo model\nPersonal watercraft are a superyacht staple and one of the newest and fastest in the world is now one of the most sought-after.\nSea-Doo's RXT-X 300 will be one of the hottest toys when superyachts return to the Mediterranean this spring.\nWith a top speed of just under 75mph, the beastly machine boasts a supercharged 300-horsepower Rotax engine which has been completely redesigned and is the biggest ever on a Sea-Doo.\nPriced at just under £16,000, is big enough to hold three occupants and powerful enough to pull a wakeboarder or waterskier.\nTim Dutton amphibious cars\nThe 2016 Dutton Reef (front) is Dutton's first new model in 14 years and is based on the Ford Fiesta MK8 (background: Dutton Surf)\nThe Dutton Surf, a four-wheel drive model based on the Suzuki Jimny. A fully-assembled model costs £18,450, plus a donor car and VAT\nSince he started making them in 1989, Tim Dutton has twice crossed the English Channel in one of his amphibious cars.\nAt this year's boat show, he displayed two models that can take buyers almost anywhere they choose.\nThe 2016 Dutton Reef is Dutton's first new model in 14 years and is based on the Ford Fiesta MK8.\nThose who want to build it themselves can purchase a kit for £8,990, plus VAT, or they can splash £18,958, plus the cost of the car, to have their amphibious vehicle assembled.","url":"https://www.dailymail.co.uk/travel/travel_news/article-3393839/London-Boat-toys-gadgets-accessories-luxury-yachts.html"}
