{"authors":[],"date_download":"2018-10-22 21:50:23","date_modify":"2018-10-22 21:50:23","date_publish":"2014-05-08 14:52:36","description":"Smile, London! You're on Axon cameras, made by the people who brought the world the Taser.","filename":"data/vaneerConsumption/LondonCopsTesting500WearableCamerasontheStreets.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/429076/140508-mps_police-1036_12ae5a95b970d5953085d58416a27619.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_innovation_london-cops-testing-500-wearable-cameras-streets-n100366_1540245023.html","title":"London Cops Testing 500 Wearable Cameras on the Streets","title_page":"London Cops Testing 500 Wearable Cameras on the Streets","title_rss":"NULL","source_domain":"nbcnews.com","text":"But all of those trials involved only a few dozen officers. London residents in 10 boroughs will have to get used to law enforcement walking around the city with smartphone-sized devices clipped to their chests.\n“Our experience of using cameras already shows that people are more likely to plead guilty when they know we have captured the incident,” MPS Commissioner Sir Bernard Hogan-Howe said in a statement. “That speeds up justice, puts offenders behind bars more quickly and protects potential victims.”\nTo assuage privacy concerns, the MPS stressed that the cameras “will not be permanently switched on” and that “members of the public will be informed as soon as practical that they are being recorded.”\nIn the past, civil rights groups have raised questions about surveillance, while some police officers have worried about the stress of being constantly watched.\nAfter a judge ordered the NYPD to test wearable cameras in the wake of controversy around stop-and-frisk, former mayor Michael Bloomberg said at a press conference that the cameras would be \"a nightmare\" because they would show parts of police interactions out of context.\nOther police departments, however, have been enthusiastic about wearable cameras. The Rialto Police Department claimed that citizen complaints dropped 87.5 percent during its experiment.\nLondon is at least used to surveillance. A 2012 study by Big Brother Watch found that an average London resident could expect to be recorded by 300 closed-circuit cameras in a single day.","url":"https://www.nbcnews.com/tech/innovation/london-cops-testing-500-wearable-cameras-streets-n100366"}
