{"authors":["Ben Spencer Medical Correspondent For The Daily Mail"],"date_download":"2018-10-22 20:30:27","date_modify":"2018-10-22 20:30:27","date_publish":"2016-01-28 01:37:33","description":"More than half of all people aged 75 and over in Britain now live alone, and more than three-quarters of GPs say they see between one and five lonely people a day in their surgeries.","filename":"data/vaneerConsumption/Lonelinessadevastatinghealthissueforamillion.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/01/1C163F8F00000578-0-image-a-58_1453944663960.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3420262_Loneliness-devastating-health-issue-million_1540240227.html","title":"Loneliness 'a devastating health issue for a million'","title_page":"Loneliness 'a devastating health issue for a million' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"More than half of all people aged 75 and over in Britain now live alone, and more than three-quarters of GPs say they see between one and five lonely people a day in their surgeries\nLoneliness should be recognised as a major public health concern, council chiefs have warned.\nThey fear the rising loneliness epidemic among the elderly could pile further strain on services unless action is taken.\nMore than half of all people aged 75 and over live alone, and more than three-quarters of GPs say they see between one and five lonely people a day.\nThe Local Government Association (LGA) estimates more than a million people aged over 65 are struggling with loneliness.\nAs well as producing personal tragedies, loneliness is heaping pressure on council and health services, as it is often the tipping point for referrals to adult social care and the cause of a significant number of GP visits.\nLoneliness is known to increase the risk of high blood pressure, and one study found that lonely people have a 64 per cent increased chance of developing dementia.\nA recent US study estimated that people without strong social relationships were 30 per cent more likely to die early.\nThe LGA, which represents more than 370 authorities, has produced a publication offering guidance for councils, Combating Loneliness, in partnership with charity Age UK and the Campaign to End Loneliness.\nLGA public health spokesman Izzi Seccombe said: ‘Loneliness is a significant and growing concern for many older people and is something that is now being identified as a major public health issue. Council public health teams are taking action and reducing the need for health and care services in the future.\n‘The impact of loneliness can be devastating and costly – with consequences comparable to smoking and obesity. As our population profile changes, and we have a larger proportion of over-65s and over-85s, loneliness is becoming an increasingly important public health concern.’\nCaroline Abrahams, of Age UK, said: ‘Loneliness blights the lives of over a million older people, with many going for weeks without any meaningful human contact.\nLoneliness is known to increase the risk of high blood pressure, and one study found that lonely people have a 64 per cent increased chance of developing dementia\n‘It is a serious condition which can be enormously damaging, both mentally and physically. We believe that we all have a responsibility to take action and that the right interventions can make a huge difference to the older people in our lives.\n‘This new guidance for councils is a welcome opportunity to shed light on good practice and support the development of promising approaches to tackling loneliness.’\nMarcus Rand, director of the Campaign to End Loneliness, added: ‘Local authorities have a key role to play in providing effective policies and solutions on the ground and this new report is a much welcomed tool.’\nSophie Andrews, chief executive of The Silver Line helpline, said: ‘We see the effects of the loneliness epidemic every day.","url":"https://www.dailymail.co.uk/health/article-3420262/Loneliness-devastating-health-issue-million.html"}
