{"authors":[],"date_download":"2018-10-23 01:20:40","date_modify":"2018-10-23 01:20:40","date_publish":"2016-05-29 00:00:00","description":"Claire North's moving new novel The Sudden Appearance of Hope centers on a young woman who cannot be remembered; only animals or people with brain damage can recall their interactions with her.","filename":"data/vaneerConsumption/LonelyHopeAppearsButIsQuicklyForgotten.json","image_url":"https://media.npr.org/assets/img/2016/05/23/suddenappearanceofhope_north_01_wide-b8b06e49238803a8542982e79fbd59bc1424ac31.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_05_29_478691177_lonely-hope-appears-but-is-quickly-forgotten_1540257640.html","title":"Lonely 'Hope' Appears, But Is Quickly Forgotten","title_page":"Book Review: 'The Sudden Appearance Of Hope,' By Claire North : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Lonely 'Hope' Appears, But Is Quickly Forgotten\nAfter devouring Touch last year, I was fiercely excited for Claire North's next book, all the more so when I learned its premise: Hope Arden is a young woman who cannot be remembered, except by animals or people whose brains have been damaged. Turn away from her, and everything about her and your interaction with her fades from your mind's view. When a life improvement app called Perfection leads to a friend's suicide, Hope sets out on a dangerous path to investigate its makers and whether there's any connection between the \"treatments\" Perfection's clients receive and her own condition.\nAt a glance, this doesn't seem to have much in common with Touch — a book about a once-human entity that can occupy people's bodies by touching their skin. But start reading and the similarities run so deep as to be almost distracting, as if Claire North's entire purpose as a pseudonym of Catherine Webb is to write variations on one core theme.\nForgotten by her family at the age of 16, Hope grows into an accomplished thief, drifting through a life of repeated first impressions and moment-by-moment reinvention: Hope cases people as easily as places, circling their psyches, desires and motivations one forgotten conversation at a time. Where Touch's Kepler steals bodies and whole lives, Hope steals jewels — but the unbearable violence their existence does to intimacy is very much the same. For someone to wake alone in a hotel room surrounded by evidence of sexual activity they can't remember initiating or experiencing is a horrible violation; for Hope, it's the unavoidable cost of interaction.\nBut Hope, like Kepler, is at her core benevolent and well-intentioned. In both books, I was dazzled by the depth, loneliness and longing of the narrators; Hope is a wonderful character, willing to work on a heist for months before dashing it all to pieces for the opportunity to punish someone who was cruel to a person she liked. Where Kepler has lived for centuries, Hope can only live in the present moment, unable to plan for a future or maintain relationships outside of computer screens; her motivations whirl between whim and rage at the unfairness of her situation. Like Touch, which spins between Kepler's recollections of past bodies and lives and a present threat, Hope recalls the people with whom she's layered repeated interactions, threading them through the narrative of her current pursuit.\nIf I keep comparing this book to Touch, it's because it's impossible not to, having read both — and unfortunately, the comparison isn't always flattering. The remarkable similarities were initially welcome to me as I wanted more of that voice, style and pace, which I certainly got — but things that I could write off as quirks of Kepler's character became difficult to ignore with Hope. Both characters are well-travelled, skimming the world's surface like skipping stones, but speak with an unchecked authority about places and cultures that occasionally fall into stereotype and cliché. Hope, who is dark-skinned, comments on the racism of Japan in a way she doesn't about any other place, and remarks on the misogyny of Omani men:\nThese men might be married, might beat another man to death for even looking at their wives, their sisters, their children, but when a lone Western woman walks through the streets of Oman, that's fair game, because Western women are like that, aren't they? They must be, to walk the way they walk, talk the way they talk.\nMy experience of living in the Gulf was definitely that the misogyny was either equal opportunity, or far more directed at women who were wearing face coverings and abayas — and I certainly never felt it was a unique cultural artifact. Facing street harassment in Britain has not led me to make broad generalizations about British men. This observation from a narrator whose perspective I wanted to trust in other respects, who frequently engages in musings on hypocrisy and inconsistency, stuck out in ways that I couldn't just chalk up to unreliability.\nThat said, I was for the most part as thoroughly absorbed by The Sudden Appearance of Hope as I was by Touch; it's in surfacing from it that I can cast a critical eye backwards and say, this plot petered out, this part went on too long. But the experience of sitting with it, sinking into it, aching along with Hope as her loneliness shapes and breaks her, was wonderful, painful and moving. Though I was far more interested in her day-to-day life than I was in the sometimes creeping, sometimes whipping tendrils of a thriller's action plot, I was never bored and always invested. If you've never yet read a book by Claire North, this would be a great place to start.\nAmal El-Mohtar is the author of The Honey Month and the editor of Goblin Fruit, an online poetry magazine.","url":"https://www.npr.org/2016/05/29/478691177/lonely-hope-appears-but-is-quickly-forgotten"}
