{"authors":[],"date_download":"2018-10-30 01:12:31","date_modify":"2018-10-30 01:12:31","date_publish":"2018-07-02 19:48:00","description":"This month, sky-watchers in several regions of the world will get to witness the longest total lunar...","filename":"data/vaneerConsumption/LongestlunareclipseofthecenturycominginJuly.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/06/30/Videos/4123097.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_longest-lunar-eclipse-the-century-coming-july__1540861951.html","title":"Longest lunar eclipse of the century coming in July","title_page":"Longest lunar eclipse of the century coming in July","title_rss":"NULL","source_domain":"ajc.com","text":"This month, sky-watchers in several regions of the world will get to witness the longest total lunar eclipse of the 21st century.\n>> Read more trending news\nThe eclipse on Friday, July 27, will be fully visible for 1 hour and 43 minutes and partially visible for 3 hours and 55 minutes from parts of South Africa and most of Africa, the Middle East and Central Asia.\nAccording to timeanddate.com, the eclipse will peak at 8:21 p.m. UTC (or 4:21 p.m. EST) and the full eclipse will end at 9:13 p.m. UTC (5:13 p.m. EST).\n>> On AJC.com: The next total solar eclipse is only 7 years away — 14 states where you’ll experience totality in 2024\nDuring a lunar eclipse, Earth’s shadow blocks the sun’s light, which otherwise reflects off the moon. A total lunar eclipse occurs when Earth’s dark umbral shadow completely covers the moon.\n>> Supermoon 2018: 12 must-see photos capture New Year’s ‘wolf moon’\n“Total eclipses are a freak of cosmic happenstance,” Space.com reported. “Ever since the moon formed, about 4.5 billion years ago, it has been inching away from our planet (by about 1.6 inches, or 4 centimeters per year). The setup right now is perfect: the moon is at the perfect distance for Earth's shadow to cover the moon totally, but just barely. Billions of years from now, that won't be the case.”\nThe July 27 eclipse will be the second lunar eclipse of the year. The first took place Jan. 31 and gave way to a super blue blood moon, which occurred when the full moon passed through the Earth’s shadow for a total lunar eclipse and gave off a reddish tint.\n>> On AJC.com: Sun-eating demons? 7 bizarre (but brilliant) myths and superstitions about solar eclipses\nUnfortunately, the United States will miss out on the celestial spectacle this month and will have to wait until July 2020 to witness a lunar eclipse, according to NASA.gov.","url":"https://www.ajc.com/news/national/longest-lunar-eclipse-the-century-coming-july/7JJsngOafb4XWm9DiBofqJ/"}
