{"authors":[],"date_download":"2018-10-30 18:10:11","date_modify":"2018-10-30 18:10:11","date_publish":"2016-04-21 05:14:18","description":"Los Angeles (AFP) – US authorities have uncovered what they believe to be the longest ever cross-border drug trafficking tunnel connecting Mexico","filename":"data/vaneerConsumption/LongestdrugtunnelfoundonCaliforniaMexicoborder.json","image_url":"https://media.breitbart.com/media/2016/04/wi/afp_fe91e46a2502e7f6cd3a951a6ef7fe31fc629a8d.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/news__1540923011.html","title":"'Longest' drug tunnel found on California-Mexico border","title_page":"'Longest' drug tunnel found on California-Mexico border - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Los Angeles (AFP) – US authorities have uncovered what they believe to be the longest ever cross-border drug trafficking tunnel connecting Mexico and California, a statement said.\nEstimated to span more than 800 yards (730 meters), it contains an elevator, as well as lights and rail and ventilation systems, the US Attorney’s Office for the Southern District of California said Wednesday.\nThe narrow tunnel connects a house in Tijuana, Mexico, to a commercial lot in Otay Mesa, California, where the exit is a three-foot (0.9 meter) diameter hole that, at one point, was hidden from view by a dumpster, it said in a statement.\nInside the tunnel, federal agents found 68 bales of marijuana weighing 1,638 pounds (743 kilograms), with another 1,430 pounds hidden in the dumpster.\nOverall, authorities seized more than 14,000 pounds of marijuana and 2,242 pounds of cocaine during the probe, which resulted in six arrests in San Diego on Friday.\n“On the surface, few would ever suspect that traffickers were moving multi-ton quantities of cocaine and marijuana worth tens of millions of dollars in such an unassuming way, through this rabbit hole in the ground, in full view of the world around it,” US Attorney Laura Duffy said.\nThe statement from the US Attorney’s Office compared the tunnel’s estimated length to that of more than eight American football fields, adding that “federal officials have seized what they believe to be the longest cross-border tunnel ever discovered along the California-Mexico border.”\nSix months ago, authorities from both countries dismantled another drug-trafficking tunnel in the same border area.","url":"https://www.breitbart.com/news/longest-drug-tunnel-found-on-california-mexico-border/"}
