{"authors":[],"date_download":"2018-10-22 20:46:18","date_modify":"2018-10-22 20:46:18","date_publish":"2014-06-02 22:56:05","description":"NASA is just waiting to see which way the wind is blowing before it sends up a flying saucer to test technologies for landing on Mars.","filename":"data/vaneerConsumption/LookOutMarsNASAGetsItsFlyingSaucerReadyforLaunch.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/482796/140602-coslog-saucer3_acd848cfe94dfe5a0748e907f3561a46.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_look-out-mars-nasa-gets-its-flying-saucer-ready-launch-n120741_1540241178.html","title":"Look Out, Mars: NASA Gets Its Flying Saucer Ready for Launch","title_page":"Look Out, Mars: NASA Gets Its Flying Saucer Ready for Launch","title_rss":"NULL","source_domain":"nbcnews.com","text":"It'll be quite a sight: The 15-foot-wide (4.7-meter-wide) LDSD is due to rise up at the end of a 100-foot-wide helium-filled balloon, to an altitude of 120,000 feet. The craft, which has been nicknamed Keiki O Ka Honua (Hawaiian for \"Boy From Earth\"), will drop from the balloon and light up a solid-fueled rocket engine with 17,500 pounds of thrust. That'll send the saucer up to a peak height of 180,000 feet at a speed of Mach 4.\nKeiki O Ka Honua's flying-saucer shape isn't motivated by mere whimsy on NASA's part. It's the same shape that's been used for Mars descent modules like the one that carried the Curiosity rover to the Martian surface. The aim of this whole exercise is to simulate the conditions that future Mars landing craft would have to face, including an atmosphere that's only 1 percent as dense as Earth's.\nSuch conditions can't be achieved on the required scale in a wind tunnel, Ian Clark, principal investigator of the LDSD project at NASA's Jet Propulsion Laboratory, told reporters Monday. \"To find that thinness of the atmosphere, we have to go halfway to the edge of space,\" he said.\nAs the craft descends from its peak height at 3.8 times the speed of sound, it will inflate its coated Kevlar \"inner tube,\" also known as a supersonic inflatable aerodynamic decelerator or SIAD-$. That will widen the craft's total diameter to about 20 feet (6 meters). The added drag should slow the saucer down to Mach 2.5, when a 100-foot-wide (30.5-meter-wide) parachute would be unfurled.\nIf the chute holds up — and ground-based tests suggest it should — the saucer should settle into a slow drift and splash down into the Pacific about 45 minutes later. \"If we fire that motor and get data back from it, that is a great day,\" LDSD project manager Mark Adler told NBC News.\nTwo more tests are being planned next year in Hawaii. Eventually, the inflatable drag shield and the supersonic parachute could be used for entry, descent and landing of Mars probes. Clark said a probe equipped with the system being tested in Hawaii could land payloads twice as large as NASA's 1-ton Curiosity rover.\nIf the system can be scaled up further, with bigger shields and multiple parachutes, NASA could start thinking about landing the 20- to 40-ton payloads that would be required for human habitation on Mars.\n\"We'll take a few more steps over the next decade to build up to the capability of landing people on Mars,\" Adler said.\nNASA's current timetable calls for astronauts to visit Mars and its moons sometime around the 2030s. But for now, let's focus on the timetable for this week's flying-saucer test: To get the latest word on the weather outlook in Hawaii, keep tabs on the LDSD mission's website or follow @NASA_Technology on Twitter.","url":"https://www.nbcnews.com/science/space/look-out-mars-nasa-gets-its-flying-saucer-ready-launch-n120741"}
