{"authors":["Kenneth Dickerman","Photo Editor","Hosam Katan"],"date_download":"2018-10-21 02:56:43","date_modify":"2018-10-21 02:56:43","date_publish":"2018-06-29 10:00:37","description":"Photographer Hosam Katan documents the war in his home country.","filename":"data/vaneerConsumption/LookingatthewarinSyriathroughaSyrianphotographerseyes.json","image_url":"https://www.washingtonpost.com/resizer/wLWizYNQVfzdojbMhfyUBwCwj2U=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FKM4PJNZZA4UFB7YL73UPPULNM.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/news_in-sight_wp_2018_06_29__1540090603.html","title":"Looking at the war in Syria through a Syrian photographer’s eyes","title_page":"Looking at the war in Syria through a Syrian photographer’s eyes - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"A boy dives into a crater filled with water in the Al-Shaar neighborhood. The crater was made by a barrel bomb. (Hosam Katan)\nA survivor sits on the rubble of collapsed buildings at a site struck by barrel bombs in the Al-Sakhour neighborhood. (Hosam Katan)\nIn 2011, during the Arab Spring uprisings, peaceful protests also broke out in Syria. Protesters there wanted Bashar al-Assad, the country’s leader, to undertake democratic reforms. But Assad had no plans to do that. Instead, the Syrian government responded with violence. In turn, some of the people protesting joined forces with military defectors and formed the Free Syrian Army, seeking to overthrow the government. The conflict would end up becoming a full-blown war by 2012 and is continuing.\nFor most of the war, journalists have had trouble getting into the country because of the dangers. Many have been kidnapped and killed. And, of course, Syrian journalists have been working under extraordinarily dangerous conditions. Photojournalist Hosam Katan is one of those Syrian journalists, and his new book, “Yalla Habibi: Living with War in Aleppo’” (Kehrer Verlag, 2018), takes us into the conflict that has been ravaging his country for nearly a decade.\nKatan says in the book that while growing up in Aleppo, he never imagined war could happen. He was just 17 when the protests broke out in 2011. He decided to pick up a camera and document what was going on after the Syrian government responded with violence. He explains his decision in more detail: “I felt the responsibility to document what was happening around me. As many international news organizations were pulling out of the country for security reasons, I realized the importance to not let the events and people in Aleppo go unseen.”\nKatan’s work was dangerous. In May 2015, he was shot by a sniper, but that didn’t deter him. After seeking treatment in Turkey, he returned to Aleppo and continued to work until the end of 2015.\n“Yalla Habibi: Living with War in Aleppo” is Katan’s personal account of the conflict in his homeland. The images in the book weave between harrowing scenes of destruction to small moments of seeming normalcy, showing how the people of Aleppo have tried to keep their sanity and their dignity under extreme duress.\nKatan covered the war in Syria between 2012 and 2015. From 2013 to 2015, he worked as a freelance photographer for Reuters. He is now studying photojournalism at the University of Applied Sciences and Arts in Hanover, Germany.\nPeople shop for vegetables and fruits in a market that had been targeted by a government airstrike in Aleppo’s Bustan al-Qasr neighborhood. (Hosam Katan)\nAn injured girl leans against a wall near a site hit by a barrel bomb in the Al-Sheikh Khodr neighborhood of Aleppo. (Hosam Katan)\nA street vendor rests near containers of diesel for sale in the Al-Halk neighborhood. (Hosam Katan)\nChildren play with toy weapons along a street in the al-Jazmati neighborhood. (Hosam Katan)\nKitchenware is left suspended on a wall after a house was destroyed by a barrel bomb in the Al-Myassar neighborhood. (Hosam Katan)\nUm Muhammad asks people to look for her daughters Asma’a and Nadima near her home, which was hit by a government airstrike on the Masaken Hanano neighborhood. (Hosam Katan)\nAlaa, an ambulance driver, feeds cats. Alaa buys about $2 worth of meat a day to feed about 150 abandoned cats in the Masaken Hanano neighborhood. (Hosam Katan)\nA damaged street in the Saif al-Dawla neighborhood. The street is on the front line, with half controlled by opposition forces, and the other by forces loyal to the Assad regime. (Hosam Katan)\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\nMore on In Sight:\nWhat life is like in the coal-mining boomtowns of Appalachia\nHaunting landscapes taken from thousands of hacked surveillance cameras\nInside the U.S.’s ‘National Radio Quiet Zone’ where there’s no WiFi or cellphone service","url":"https://www.washingtonpost.com/news/in-sight/wp/2018/06/29/looking-at-the-war-in-syria-through-a-syrian-photographers-eyes/"}
