{"authors":["Wolf Richter","Wolf Street"],"date_download":"2018-10-30 22:34:39","date_modify":"2018-10-30 22:34:39","date_publish":"2018-07-31 00:00:00","description":"Outsourcing giant Carillion collapsed after hiding much of its debts. Fitch Ratings warns this technique could be widespread in the US and Europe. The debt loophole, called reverse factoring, allows a buyer to borrow without disclosing it.","filename":"data/vaneerConsumption/LoopholethatbroughtdownCarillionmaybewidelyusedinUSEurope.json","image_url":"https://amp.businessinsider.com/images/5b60a9d83beb6e43308b46b6-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_loopholethat-brought-down-carillion-may-be-widely-used-in-us-europe-2018-7_1540938879.html","title":"Loopholethat brought down Carillion may be widely used in US, Europe","title_page":"    Loopholethat brought down Carillion may be widely used in US, Europe - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"As regulators and stiffed creditors were poking through the debris of collapsed outsourcing giant Carillion - once employing 43,000 people worldwide - they found that the UK company had hidden much of its debts. And Fitch Ratings warned that this \"technique\" - a \"debt loophole\" - may be \"widespread\" in the US and Europe.\nCarillion provided services to governments. It didn't manufacture anything, didn't have a lot of assets, and didn't have a lot of debt - at least not disclosed on its books. Net debt on its balance sheet amounted to £219 million. But Fitch estimates that it had an additional financial debt of £400 million to £500 million.\nThis debt was hidden by a \"technique commonly referred to as reverse factoring,\" Fitch says. And it was \"a key contributor to Carillion's liquidation.\"\nThis \"reverse factoring\" - part of supply chain financing - allowed Carillion to hide a debt of £400 million to £500 million in \"other payables,\" such as money owed suppliers. There were indications that something was off: Over a four-year period, \"other payables\" had nearly tripled, from £263 million to £761 million. According to Fitch, \"This appears largely to have been the result of a reverse factoring program.\"\nBut this was financial debt owed to banks - not trade accounts payable.\nAny disclosure?\nAlmost none. Fitch explained in the report (press release here):\nThere was one passing reference to the company's early payment program in the non-financial section of the accounts, but nothing in the audited financial statements and no numbers. The only clue to the scale of the supply chain financing was the growth in \"other payables,\" the implications of which do not appear to have been appreciated by many in Carillion's broader stakeholder group.\nCarillion was no exception. Disclosure rules are \"complex\" and \"highly dependent on specific circumstances, auditor, and jurisdiction,\" Fitch says:\nPromotional literature in the field regularly cites as a benefit the fact that supply chain financing - and reverse factoring in particular - can be shown as accounts payable rather than debt. Companies borrow cash while avoiding its inclusion in financial covenants or debt reported on the balance sheet. A review of a number of companies with supply chain financing program shows precious little by way of disclosure.\nReverse factoring programs are aggressively marketed by banks and specialized financial institutions in the supply chain finance industry. And this lack of disclosure requirements is one of the key selling points.\nHow much reverse factoring is going on?\n\"We believe the magnitude of this unreported debt-like financing could be considerable in individual cases and may have negative credit implications,\" Fitch says. But due to lacking disclosures, no one knows the magnitude.\nGreensil, which provides supply-chain financing and claims to have financed $30 billion to date, estimates in its promotional literature that about $3.5 trillion globally is tied up in working capital. But not all of it can be leveraged in supply-chain finance.\nFitch tried to estimate if \"reverse factoring\" is increasing. It looked at a sample of 337 companies and found that the metric \"payable days\" - the average number of days companies were stringing out their suppliers - had grown by 17% since 2014, to 96 days in 2017. Fitch believes that in 2017 alone, payables days rose 6%.\n\"Assuming all of this increase was reverse factoring, then this could be as much as $327 billion additional reverse factoring since 2014\" among the 337 companies, Fitch said. That's an average increase of about $1 billion per company in the sample.\nBut not all of this growth is reverse factoring. Other dynamics play a role too, including the \"ongoing cash management efforts by the companies in the sample, with supplier terms being squeezed.\" But due to lacking disclosures, it's \"impossible for a third party to tell one way or another.\"\nHow does reverse factoring work?\nSupply chain finance in general describes working capital management techniques with which a company extracts financial benefits from its supply chain. The \"most publicized\" of these techniques is reverse factoring. Fitch explains how it works and the reasons for doing it:\nCompany A, the buyer, purchases goods in the normal course of business from company B [often not rated or junk rated]. Company A, typically a large well-rated corporate, will arrange a reverse factoring program with a financial institution. Once it has been on-boarded into the program and negotiated terms with the bank, B will be able to submit the invoices it has issued to A, once A has validated (or confirmed) them, to the bank for accelerated payment. It could get paid after 15 days rather than its usual 60 days.\nThe supplier benefits because it gets quicker access to cash but at the lower borrowing cost associated with the stronger credit rating of its customer.\nThe buyer benefits because reverse factoring allows it to borrow without disclosing it as debt:\nAs part of this process, the bank will also often allow company A longer to pay the invoice than B would have accepted without the supply chain finance arrangement. So rather than paying in 60 days it may pay only after 120 days. This is effectively using a bank to extend payment terms….\nThus, the buyer is borrowing 120 days of its accounts payable from the bank, while the bank pays the supplier. None of this debt that the buyer owes the bank shows up as \"debt\" on the buyer's balance sheet but remains in \"accounts payable\" or \"other payables.\" The money borrowed from the bank becomes cash inflow on the cash-flow statement. And the highly touted figure \"cash\" increases. Hallelujah.\nHow does Fitch treat reverse factoring — if it's disclosed?\nIf a company provides \"sufficient and reliably consistent disclosure,\" Fitch adds the dollar amount resulting from an extension in \"payable days\" - for example from 60 days to 180 days - to the amount of the debt.\nIf the buyer has $100 million in unpaid invoices after an extension of payables days from 60 days to 180 days, Fitch assumes that 120 days of that outstanding invoice amount, or 66.7%, is due to a reverse factoring program. It would therefore treat $66.7 million of that $100 million as financial debt, rather than trade payables, and adjust its credit metrics accordingly.\nBut that increase in financial debt might put the buyer in violation of its debt covenants or impact negatively other credit metrics that would increase its costs of borrowing. Hence, this \"sufficient and reliably consistent disclosure\" is precisely what few companies do. And this financial debt remains hidden in trade accounts payable.\nCreditors and shareholders are at risk without knowing it - see Carillion\nThe fact that this financial debt is not disclosed, \"combined with the potentially serious consequences where companies' use of factoring programs goes unnoticed, is cause for concern,\" Fitch says tersely.\n\"As seen in the case of Carillion, reverse factoring could have a potentially large impact on vulnerability to default for specific issuers, making awareness critical.\"\nCash obtained via reverse factoring is particularly fragile because when this company gets into financial distress, the bank simple cancels the reverse factoring program, and the company will have to come up with funding to pay down its accounts payable to the terms agreed to with suppliers.\nTo use our example above, the buyer would have to come up with $66.7 million to pay down its payables from 180 days to 60 days - and this would happen as the buyer is already under financial stress, just when it can no longer borrow money at survivable rates. This is how reverse factoring increases the likelihood of a sudden default and Carillion-style collapse.\n\"Sectors that are large users of reverse factoring include consumer packaged goods, telecommunications, chemicals, retail, and aerospace,\" Fitch says.","url":"https://www.businessinsider.com/loopholethat-brought-down-carillion-may-be-widely-used-in-us-europe-2018-7"}
