{"authors":["Matt Lawton For The Daily Mail"],"date_download":"2018-10-23 03:19:47","date_modify":"2018-10-23 03:19:47","date_publish":"2016-01-29 18:15:37","description":"EXCLUSIVE - MATT LAWTON: Lord Coe may be recalled to appear before a parliamentary committee to answer questions about whether he misled MPs over what he knew.","filename":"data/vaneerConsumption/LordCoemaybegrilledbyMPsAGAINover2017briberyclaims.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/302A5B5B00000578-0-image-a-4_1454091329874.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_sportsnews_article-3423190_Lord-Coe-grilled-MPs-2017-bribery-claims_1540264787.html","title":"Lord Coe may be grilled by MPs AGAIN over 2017 bribery claims","title_page":"Lord Coe may be grilled by MPs AGAIN over 2017 bribery claims | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lord Coe may be recalled to appear before a parliamentary committee to answer questions about whether he misled MPs over what he knew of rumours of bribery and corruption in athletics.\nAs Sportsmail revealed on Thursday, Coe was the ‘very senior IAAF person’ who warned UK Athletics officials of rumours that ‘brown envelopes’ of cash were being handed out by rivals ahead of the vote for the 2017 World Championships.\nDamian Collins MP, a prominent member of the culture, media and sport select committee that first questioned Coe in December, told Sportsmail he believes the double Olympic medallist still ‘has questions he needs to answer’.\nLord Coe could be called back in front of a select committee over what he knew about rumours of bribery\nSPortsmail revealed this week that Coe warned Athletics officials of rumours that ‘brown envelopes’ were being handed out of the 2017 World Championships vote\nA spokesperson for the under-fire IAAF president admitted he may have engaged in a conversation about rumours – principally with UK Athletics chairman Ed Warner - at Monaco’s Fairmont Hotel in November 2011 but insisted he ‘denies knowing of bribes being offered or received linked to the 2017 World Championships’.\n‘As he and Ed Warner discussed on Five Live Sportsweek there was rumour piled upon rumour, as is often the case on these occasions,’ the IAAF spokesperson added.\nBut when Coe first appeared before the select committee he denied even having heard rumours of bribery and corruption in his sport.\nWhen asked by John Nicolson MP whether he had ever heard 'any chat around the trackside' about bribes or from anyone who said 'I was offered money', Coe said he had not.\nAsked specifically about what Coe said to the select committee, his spokesperson said: 'He has been consistent in asserting that he does not know of anyone who has been 'offered money'.'\nCollins told Sportsmail the select committee has the power to recall Coe for further questioning about exactly what he knew about those ‘brown envelopes’.\nUK Athletics chairman Ed Warner revealed that a 'very senior IAAF person' made an allegation of corruption\nCoe celebrates in Monaco in 2011 after London was named as the venue for the 2017 World Championships\n‘It will be a decision for the whole committee but Lord Coe can be recalled,’ said Collins. ‘I personally feel he has questions he needs to answer about the evidence he gave.\n‘If it’s true he did tell Ed Warner about the rumours of brown envelopes, then I think he misled the committee when he said he had no knowledge of bribery in athletics. It seems to me he clearly had knowledge.’\nCollins said he was surprised by Coe’s attempt to deny the story of the ‘brown envelopes’ that Warner revealed on BBC 5 Live’s Sportsweek earlier this month. Coe – a studio guest on the same programme – was asked if he had heard the story before. He denied he had.\nWarner has said he will confirm the identity of the senior IAAF official to the world governing body’s ethics commission, after which one would expect the commission to include his testimony in a published report.\nWarner leaves Portcullis House in London after meeting the Culture, Media and Sport Committee on Tuesday\nCoe still has questions to answer about his knowledge of corruption, according to Damian Collins MP\n‘It’s so stupid,’ said Collins of Coe. ‘If it is then out in the public domain that he (Coe) was the person who told Ed Warner, what then?\n‘And it will raise other questions. Why didn’t Coe do anything about it at the time?\n‘It is being referred to the ethics commission now but there have been other allegations of corruption around the Qatari bids for the world championships. When the ethics commission was set up he could have raised it then.\n‘That would have been a difficult conversation for him but I think it could be a lot easier than the ones he might now have to have.’\nLondon won the 2017 championships ahead of Doha, with the Qataris subsequently awarded the 2019 event.\nTwo witnesses have told Sportsmail that Coe warned them over possible bribes being exchanged for votes\nSportsmail has spoken to two witnesses — both of whom were linked to the London 2017 bid team — who recall Lord Coe walking into the London bid office at the Fairmont Hotel to warn them of possible bribes being offered in exchange for votes.\nAccording to Lord Coe’s spokesperson he does not deny having a conversation with Warner in Monaco but does not regard it as being significant.\nIn the end it could come down to the word of one man against another’s, although it is understood there were a number of witnesses in the room at that particular time. Hugh Robertson, then the sports minister and a strong Coe ally, supported the bid team but has denied to Sportsmail that he was in the room at the relevant moment.","url":"https://www.dailymail.co.uk/sport/sportsnews/article-3423190/Lord-Coe-grilled-MPs-2017-bribery-claims.html"}
