{"authors":["Press Association"],"date_download":"2018-10-22 22:11:01","date_modify":"2018-10-22 22:11:01","date_publish":"2016-01-29 08:52:49","description":"Lord Coe has denied flagging up allegations of bribery ahead of the vote to decide the host city for the 2017 World Championships. Coe was a vice-president o...","filename":"data/vaneerConsumption/Lordcoedeniesflaggingupallegationsofbriberyaheadof2017vote.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-506fa4ba-4d2d-4a7c-8741-b97686643f76-3bmscybNe842cce83474b52e84cb-541_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421725_Lord-Coe-denies-flagging-allegations-bribery-ahead-2017-vote_1540246261.html","title":"Lord coe denies flagging up allegations of bribery ahead of 2017 vote","title_page":"Lord coe denies flagging up allegations of bribery ahead of 2017 vote | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lord Coe denies flagging up allegations of bribery ahead of 2017 vote\nLord Coe has denied flagging up allegations of bribery ahead of the vote to decide the host city for the 2017 World Championships.\nCoe was a vice-president of the IAAF at the time of the vote which was held in Monaco in November 2011. He led London's final presentation before the 26 members of the IAAF council cast their votes.\nHe has since been elected president of athletics' world governing body, with the two-time former Olympic 1,500metres champion stating his determination to clean up the sport after recent doping scandals.\nIAAF president Sebastian Coe has denied he knew of bribes in the run-up to voting for the 2011 World Championships\nCo e has repeatedly denied he knew of major corruption within athletics during his time as vice-president.\nTwo bids by Qatar's capital Doha for the 2017 and 2019 editions of the World Championships have been referred to the IAAF's ethics commission following allegations of \"brown envelopes\" and bribe demands, UK Athletics chairman Ed Warner this week told the culture, media and sport select committee in London.\nWarner said he had been told of the referrals by the IAAF but refused to reveal the name of the \"very senior IAAF person\" who had told him of reports of brown envelopes full of cash being handed out just before the vote for the 2017 World Championships.\nThe Daily Mail reported on Thursday it had two witness accounts of Coe warning London 2017 officials of a possible bribes-for-votes plot in Monaco.\nA spokesperson for Coe told the newspaper: \"Sebastian Coe denies knowing of bribes being offered or received linked to the 2017 World Championships.\"\nLondon won the vote 16-10 and will stage the World Championships next year. The Qatar Athletics Federation has always denied any wrongdoing during the voting process.\nReacting to the latest claims, Conservative MP Damian Collins suggested Coe still had questions to answer.\nCollins, a member of the culture, media and sport select committee, wrote on Twitter: \"Seb Coe denies knowing bribes were paid. That's not the same as knowing there were rumours bribes were being paid & warning UKA.\"\nSir Hugh Robertson, sports minister at the time of London being awarded the World Championships, said: \"What I do not remember is allegations of money changing hands in brown envelopes, of people being bribed, and during my times as sports and Olympics minister I took part in a lot of leadership elections and a lot of bids for major sporting events.\n\"And there were occasions when those allegations did surface but not during this specific bid as I remember.\n\"Personally I have no recollection of this at all.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3421725/Lord-Coe-denies-flagging-allegations-bribery-ahead-2017-vote.html"}
