{"authors":["William Bigelow"],"date_download":"2018-10-30 22:16:57","date_modify":"2018-10-30 22:16:57","date_publish":"2016-01-21 18:47:36","description":"Loretta Sanchez attacked rival California Attorney General Kamala Harris: “I think we need a Latina in the U.S. Senate.”","filename":"data/vaneerConsumption/LorettaSanchezWeNeedaLatinaintheSenate.json","image_url":"https://media.breitbart.com/media/2015/12/Loretta-Sanchez-JC-Olivera-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_01_21__1540937817.html","title":"Loretta Sanchez: ‘We Need a Latina’ in the Senate","title_page":"Loretta Sanchez: ‘We Need a Latina’ in the Senate | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Wednesday, Rep. Loretta Sanchez (D-CA) attacked rival California Attorney General Kamala Harris as bluntly as possible, telling a candidate forum hosted by the Latino Journal: “I think we need a Latina in the U.S. Senate.”\nSanchez buttressed her claim by noting that unlike many in Congress, she spoke Spanish when she met leaders from Central and South America, according to the Sacramento Bee. Sanchez stated that as a senator, she could make the world pay more attention to Latin America than she could do as a mere U.S. Representative, arguing, “I can stand up as a congresswoman. Xavier (Becerra) can stand up. Lucille (Roybal-Allard) can stand up … You get a United States senator to stand up and say something, all of a sudden the world hears. They listen. And you can really begin to move an agenda. That’s on my to-do list.”\nSanchez also asserted that her experience growing up poor gave her more understanding of immigrants’ issues:\nMs. Harris I believe does not have the experience that I have. I don’t think she grew up in a seven-kid family where we stood in line to get the Velveeta cheese block, with parents who were not educated, but who sacrificed and put their kids through” school. I am very proud of my Mexican American roots; of my ability to speak Spanish; of my ability to move between. I am one of those, if you think of an immigrant kid, you go into the house and it’s kind of all Spanish … and you walk out and it’s America, right? Those are the experiences of so many people up and down the state of California. It’s not just Latino. It’s the immigrant experience. And I have experienced it.\nHarris, who enjoys a wide lead in the polls, passed up the event, reportedly citing conflicts in her schedule.\nSanchez came under criticism in December when she offered her opinion of radical Islam in speaking with Larry King:\nWe know that there is a small group, and we don’t know how big that is – it can be anywhere between 5 and 20 percent, from the people that I speak to – that Islam is their religion and who have a desire for a caliphate and to institute that in any way possible, and in particular go after Western norms. They are not content enough to have their way of looking at the world, they want to put their way on everybody in the world. And again, I don’t know how big that is, and depending on who you talk to, but they are certainly, they are willing to go to extremes. They are willing to use and they do use terrorism.\nA January 7 Field Poll found Harris garnering 27% of the vote; Sanchez followed at 15%.","url":"https://www.breitbart.com/local/2016/01/21/sanchez-says-we-need-a-latina-in-the-senate/"}
