{"authors":["Fionn Hargreaves For Mailonline"],"date_download":"2018-10-23 01:28:12","date_modify":"2018-10-23 01:28:12","date_publish":"2017-03-10 09:46:51","description":"The HGV hit a pothole near the National University of Science and Technology in Bulawayo. Three people were seriously injured and the coffin was smashed to pieces.","filename":"data/vaneerConsumption/LorryoverturnedontoafuneralprocessioninZimbabwe.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/09/3E21F46C00000578-0-image-a-46_1489138255091.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300544_Lorry-overturned-funeral-procession-Zimbabwe_1540258092.html","title":"Lorry overturned onto a funeral procession in Zimbabwe","title_page":"Lorry overturned onto a funeral procession in Zimbabwe  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A lorry has overturned on a road in Zimbabwe, killing 16 mourners in a funeral procession.\nThe HGV is believed to have hit a pothole near the National University of Science and Technology in Bulawayo, overturning and crushing the mourners.\nThe coffin was also smashed to pieces.\nA lorry overturned on a road in Zimbabwe, killing 16 people who were in a funeral procession. Pictured, the main frame of the lorry still maintained its shape after the crash, but wood and glass is spread everywhere\nThe HGV hit a pothole near the National University of Science and Technology in Bulawayo, in the western Matabeleland region\nThe coffin was smashed to pieces and three people were seriously injured in the incident. Pictured, firemen at the site\nThree people were seriously injured in the incident and taken to United Bulawayo Hospital, two of whom are in critical condition.\nThere were five survivors, including the lorry driver.\nRichard Peterson, Bulawayo's fire chief, said the accident happened at 11pm.\nHe added: 'The driver is saying the truck reportedly hit a pothole and lost control before its load fell on the Kombi (Volkswagen camper van).'\nTwo of the people taken to United Bulawayo Hospital are in a critical condition. Pictured, a recovery vehicle next to the pothole the lorry hit\nRichard Peterson, Bulawayo's fire chief said: 'The driver is saying the truck reportedly hit a pothole and lost control before its load fell on the Kombi (Volkswagen camper van)'\nPictured, firemen work into the night to clear the wreckage. None of the victims have been named yet\nThe area had a run of bad luck as a police car attending the scene crashed after its brakes failed.\nIt is not known what damage was caused or whether any officers were injured.\nPolice did not reveal whether the lorry driver had been tested for alcohol or whether any legal proceedings were active.\nThe victims have not been named yet.\nA police car attending the scene also crashed after its brakes failed. The crash spread wood and glass debris across the road","url":"https://www.dailymail.co.uk/news/article-4300544/Lorry-overturned-funeral-procession-Zimbabwe.html"}
