{"authors":["Joshua Caplan"],"date_download":"2018-10-30 18:31:21","date_modify":"2018-10-30 18:31:21","date_publish":"2018-07-31 19:22:18","description":"Los Angeles prosecutors have decided not to move forward with charging CBS CEO Les Moonves with sex abuse crimes.","filename":"data/vaneerConsumption/LosAngelesProsecutorsWontChargeLesMoonvesWithSexAbuseCrimes.json","image_url":"https://media.breitbart.com/media/2018/07/Lesnocharges1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_07_31__1540924281.html","title":"Los Angeles Prosecutors Won't Charge Les Moonves With Sex Abuse Crimes","title_page":"Los Angeles Prosecutors Won't Charge Les Moonves With Sex Abuse Crimes","title_rss":"NULL","source_domain":"breitbart.com","text":"The case was handled by the Los Angeles County DA’S Entertainment Sex Crimes Task Force, which is reviewing about a dozen cases involving Hollywood figures accused of criminal misconduct ranging from inappropriate touching to rape. Prosecutors have declined to bring charges in another dozen cases citing issues including the expiration of the statute of limitations and insufficient evidence to uncooperative victims.\nCBS announced Monday its decision to keep Moonves in place while an outside counsel investigates sexual misconduct allegations against the television executive. The company also says it will postpone its annual shareholders meeting, scheduled to take place Aug. 10, to a later date.\nOn Friday, a New Yorker article quoted six women spanning three decades accusing Moonves of sexual harassing them. The CBS chief has been a prominent figure in television for decades, credited with turning around a network that had been mired for years in last place in the ratings race.\nLes Moonves’ wife, Julie Chen, is staying mum about the sexual harassment allegations against her husband. On Monday’s episode of her daytime CBS chat show, “The Talk,” she said she will not discuss the issue on the air. Chen says she has already made one statement on the matter and she will “stand by that statement today, tomorrow, forever.” On Friday, she tweeted that she “fully supported” Moonves, calling him a “kind, decent and moral human being.” Chen and Moonves have been married for nearly 14 years and are the parents of a son, Charlie. She is a former CBS news anchor who also hosts the Big Brother reality show.\nMoonves’, one of America’s highest compensated CEOs, has an estimated net worth of $700 million, according to Forbes. The network executive is widely credited for launching numerous successful programs, including Survivor and Everybody Loves Raymond.","url":"https://www.breitbart.com/entertainment/2018/07/31/los-angeles-prosecutors-wont-charge-les-moonves-with-sex-abuse-crimes/"}
