{"authors":["John Binder"],"date_download":"2018-10-30 22:02:17","date_modify":"2018-10-30 22:02:17","date_publish":"2016-12-19 20:38:45","description":"The City of Los Angeles is setting up a “legal fund” to shield illegal immigrants from federal immigration law.","filename":"data/vaneerConsumption/LosAngelesPlans10MLegalFundforIllegalImmigrants.json","image_url":"https://media.breitbart.com/media/2015/08/illegal-drivers-license-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2016_12_19__1540936937.html","title":"Los Angeles Plans $10M 'Legal Fund' for Illegal Immigrants","title_page":"Los Angeles Plans $10M 'Legal Fund' for Illegal Immigrants","title_rss":"NULL","source_domain":"breitbart.com","text":"In an effort to defy federal immigration law and an upcoming plan by President-Elect Donald Trump to tighten immigration policies, the City of Los Angeles is setting up a “legal fund” to shield illegal immigrants from the law.\nLos Angeles officials announced that a $10 million illegal immigrant fund would be set up to pay for the legal expenses of those facing deportation under the incoming Trump administration, according to the Los Angeles Times.\nThe “LA Justice Fund” is a joint effort by the City of Los Angeles and Los Angeles County, where the county’s Board of Supervisors will put forward $3 million and the city is expected to designate at least $1 million for the fund. The remaining funds will be gathered from “philanthropic groups,” according to the Times.\nLos Angeles is the latest city to create a somewhat taxpayer-funded effort to pay for illegal immigrants’ legal expenses, as Chicago has recently set up a similar fund to shield illegals, according to the Chicago Herald.\nUnder Trump’s immigration plan, illegal immigrants with a criminal record will be deported and a southern border wall will be built under a massive infrastructure program.\nJohn Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.","url":"https://www.breitbart.com/border/2016/12/19/los-angeles-plans-10m-legal-fund-illegal-immigrants/"}
