{"authors":["Chriss W. Street"],"date_download":"2018-10-30 17:57:53","date_modify":"2018-10-30 17:57:53","date_publish":"2017-01-11 13:59:12","description":"The Board of the George Lucas \"Museum of Narrative Art\" picked Los Angeles’ Exposition Park over San Francisco’s Treasure Island on Tuesday as home of the highly anticipated museum of the Star Wars creator’s digital and populist art collection. | Entertainment","filename":"data/vaneerConsumption/LosAngelesTriumphsinBattleforGeorgeLucasMuseum.json","image_url":"https://media.breitbart.com/media/2015/01/George-Lucas-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2017_01_11__1540922273.html","title":"Los Angeles Triumphs in Battle for George Lucas Museum","title_page":"Los Angeles Triumphs in Battle for George Lucas Museum | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Board of the George Lucas “Museum of Narrative Art” picked Los Angeles’ Exposition Park over San Francisco’s Treasure Island on Tuesday as home of the highly anticipated museum of the Star Wars creator’s digital and populist art collection.\nIn a project that includes a $700 million endowment gift, George Lucas and his wife Mellody Hobson will donate their mix of classic and pop art that is conservatively valued at $400 million. The breadth of pieces includes movie memorabilia, storyboards and costumes pieces from Lucas’ Star Wars and the Cecil B. DeMille’s Ten Commandments. The Lucas fine art collection includes Americana paintings from Norman Rockwell, N.C. Wyeth and R. Crumb.\nMayor Eric Garcetti told the Los Angeles Times, “It feels like this incredible gift has come home. I always thought Los Angeles was the natural place to spread the vision of George Lucas and Mellody Hobson, to make art and creativity accessible and inspirational to the next generation.” He added that “It’s a natural place to have this museum in the creative capital of the world and in the geographic center of the city. It’s a banner day for L.A.”\nBreitbart News reported that it had once seemed like a done deal for the Lucas museum to locate on an eight-acre site in San Francisco’s Crissy Field in February 2014. The location was identified by the Presidio master plan in 2002 as a potential museum site, and there was vigorous support from Gov. Jerry Brown, San Francisco Mayor Ed Lee, U.S. Sen. Dianne Feinstein, and House Minority Leader Nancy Pelosi, plus support from such cinematic heavyweights as Martin Scorsese.\nBut San Francisco’s powerful environmentalist lobby sabotaged the plan, because it did not want the Crissy Park view of the Marin Headlands and the Golden Gate Bridge interrupted.\nAfter four years of planning and trying to accommodate stakeholders in the community, the seven-member Presidio Trust board voted unanimously to reject Lucas’s bid. A stunned David Perry, spokesman for Lucas, said, “This is something that caught us completely by surprise.”\nAt that point, Los Angeles Mayor Eric Garcetti jumped into competition offering a permanent seven-acre lease of downtown next to the Coliseum for just $20 a year. The L.A. ,ayor emphasized that 45.5 million people visit L.A. each year, compared to just 24.6 million that visit San Francisco.\nGarcetti assured the Lucas board that the museum-trafficked site is near California Science Center, Natural History Museum and California African American Museum. The location is also across from USC and there are already plenty of bus and Metro stops.\nLos Angeles’ entertainment and cultural leaders quickly backed bringing the Museum of Narrative Art to L.A. Academy Museum of Motion Pictures leader Kerry Brougher, Los Angeles County Museum of Art Director Michael Govan, and DreamWorks Animation Chief Executive Jeffrey Katzenberg showed their support for the project at a L.A. County Board of Supervisors meeting in November.\nSan Francisco suggested an alternative eight-acre South of Market site, but there was pressure to change the look of Lucas’ museum from a “mock-classical temple” with four ceremonial domes. Mayor Ed Lee finally offered Treasure Island site in the middle of the San Francisco Bay for $23 million.\nBut the city’s Project Manager Adam Van De Water told the local CBS news affiliate that the Lucas board has concerns about sea-level rise at the Treasure Island site: “They are looking at seismic performance for the building and some of the geographic and temperature conditions of being here on the Bay.”\n“This is a real triumph for the city of L.A., and this will be a transformative opportunity for L.A.,” Katzenberg told the Times. “First and foremost for our residents who are going to have an outstanding cultural, iconic new force here — the force will be with us — and I think for tourism, and for the continued, extraordinary transformation of downtown Los Angeles, and for Exposition Park and the other museums it will be joining.”","url":"https://www.breitbart.com/entertainment/2017/01/11/los-angeles-triumphs-battle-george-lucas-museum/"}
