{"authors":[],"date_download":"2018-10-30 14:31:56","date_modify":"2018-10-30 14:31:56","date_publish":"2015-06-13 00:00:00","description":null,"filename":"data/vaneerConsumption/LosAngelesranked1placetolivebyhomelesspeople.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_06_los_angeles_ranked_1_place_to_live_by_homeless_people_1540909916.html","title":"Los Angeles ranked #1 place to live by homeless people","title_page":"Los Angeles ranked #1 place to live by homeless people","title_rss":"NULL","source_domain":"americanthinker.com","text":"And so what is responsible for this increase in homelessness? The Democratic city council? The Democratic mayor? Decades of Democratic Party rule in Los Angeles? The Democratic governor? The Democratic president?\nIf it's Tuesday, you should hate the police; if it's Wednesday, you should hate white people; if it's Thursday, you should hate men; and if it's Friday, it's time for some good old-fashioned class envy. And so, appropriately enough, the New York Times had an article talking about the enormous swelling population of the homeless in Los Angeles and its predictable causes.\nNo, it's people who work for a living. The Times is claiming that gentrification, the reclamation of old, dirty, dangerous neighborhoods, is pushing people into homelessness.\n“It’s all being gentrified,” said Alice Callaghan, an advocate for the homeless.\" It’s not drugs that are putting these people out on the streets — it’s the housing.” The sheer number of people living on the streets and out of doors makes L.A. the homeless capital of the nation,” said Jerry Jones, the executive director of the National Coalition for the Homeless. That distinction, to a considerable extent, is due to a temperate climate that has long been a great draw of Southern California, for those with or without homes. “I mostly came for the weather,” said Gloria Davis, 57, who said she was facing eviction and a return to the streets from her latest low-cost apartment just off Skid Row. She smiled up at the warm afternoon sun. “Give me this weather all year round,” she said. “You can’t find this in New York. You can’t find this in Miami.”\nOn the one hand, the article claims that gentrification is causing homelessness. But in the section quoted above, it sounds more like Los Angeles is a magnet, that homeless people move to LA because LA is the place to be – if you're homeless!\nMs. Davis, holding on to a walker as she moved down the street, said the landlord of her tiny $418-a-month room at the Baltimore Hotel had informed her that her rent was going up imminently. Because she relies on government assistance checks and cannot afford to pay more, she faces the prospect of winding up back on the streets. “They want $675 a month,” she said.\nI don't understand the gentrification-causes-homelessness argument at all. If low-cost housing is displaced by higher-cost rentals, the people displaced can still find homes. The homes they find may be farther out into the suburbs, but they will be there. It is only people who insist on the \"right\" to live in a certain neighborhood who may find themselves priced out of a home. These, then, are the voluntary homeless.\nAs in New York, various factors contribute to homelessness here, but the biggest one may be the huge gap between housing costs and income. The Los Angeles City Council voted recently to increase the minimum wage to $15 an hour by 2020, but that can go only so far.\nThat will do the trick. When more and more people are let go by employers who can't afford the $15-an-hour wage, those newly unemployed will be the first to understand how their unemployment helps fight homelessness.\nSome business leaders and neighborhood groups dispute the idea that gentrification and rising housing costs are the main causes of the increase in the homeless population. Carol Schatz, the president of the Central City Association of Los Angeles, a business group, said much of the problem was caused by a judicial ruling that restricted the hours that the police can enforce laws preventing people from sleeping on sidewalks. “We do not share the view of some advocates that everybody wants to be housed,” Ms. Schatz said. “That is simply not our experience over the years. A lot of these people have been living on the street for a very long time because of mental illness and addiction.”\nIf Republicans were in charge, we would know that they are the cause of homelessness. But since Democrats are in charge, we know that real problem is not enough money. Never will it be said that the problem lies in the failed policies of those in charge for decades, or the very fault of many of those who choose such lifestyles.","url":"https://www.americanthinker.com/blog/2015/06/los_angeles_ranked_1_place_to_live_by_homeless_people.html"}
