{"authors":["Wally Hall"],"date_download":"2018-10-30 14:12:23","date_modify":"2018-10-30 14:12:23","date_publish":"2018-10-29 00:00:00","description":"Driving home from Fayetteville on Saturday was the perfect time to reflect.","filename":"data/vaneerConsumption/Lostseasonfindsmanyfansstayingaway.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/29/Wally1030_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30_lost-season-finds-many-fans-staying-awa__page=1_1540908743.html","title":"Lost season finds many fans staying away","title_page":"Lost season finds many fans staying away","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Driving home from Fayetteville on Saturday was the perfect time to reflect.\nTraffic was OK, but there were zero cars with Razorback flags or decals -- although a few had University of Arkansas license plates. The 45-31 loss to Vanderbilt had been a bit surprising.\nNothing against the Commodores, but this scribe never expected to cover a season in which the Arkansas Razorbacks would lose to Colorado State, North Texas and Vanderbilt in one season.\nOr that their only two wins would come against Eastern Illinois and Tulsa, which are a combined 3-14.\nThere have been other forgettable seasons. In Jack Crowe's first season in 1990, the Razorbacks went 3-8 but they beat Colorado State, Tulsa and SMU. That had to be looked up because it had been forgotten.\nNo doubt the lack of wins is taking a toll on Razorbacks Nation. The previous six seasons were a burden, and now this season accompanies the grand opening of a $160 million renovation that added 3,200 seats, all for wealthy people.\nThat means for the past two games, about 34,000 seats were either unused or unsold.\nThat's an alarming number. The trend was there last season, but the public was fed false attendance numbers by the previous administration. Now the UA gives two attendance figures -- tickets distributed and tickets scanned, which indicate the actual attendance.\nIt was obvious as far back as May 2017 there was concern about the direction of the UA athletic department. That was when UA System President Donald Bobbitt said he would personally be involved in all future contract negotiations, including for the athletic department.\nBy then, the damage had been done. Jeff Long had guaranteed Bret Bielema and himself multimillion-dollar buyouts.\nIt seems most fans were fine when Long and Bielema were fired, but not so fine with the dollars it took to pay off the ludicrous contracts.\nCombine that with this season, and fans are mentally, emotionally and almost financially exhausted.\nHunter Yurachek was hired to replace Long, and he's mended about a million miles of fence with the fans, but he knows there is still work to do. He probably understands he raised some eyebrows when he kept Long's staff, some of whom were handpicked by Long.\nChad Morris was hired as the head coach, and he was exciting with his talk of getting in the left lane and putting the hammer down.\nWhat most, including him, didn't think about was he hadn't seen this team on a field.\nIt would be almost impossible for any coach to take a Big Ten offense that had been in place for five years and change it to a Spread offense in one season.\nIt has been more like the Razorbacks are stuck in the middle lane behind an 18-wheeler. The only hammering is the end-zone renovation.\nNot only did Morris not inherit his style of players, but he's also found some who don't like discipline. Most likely there will be some leaving for softer ground when the season is over.\nStill, with more than 40,000 showing up and most radio-talk shows consumed with the Razorbacks, apathy has not taken over. It may be on the radar, but it isn't there yet.\nWhat's better today is recruiting. If all the commitments sign, Arkansas will have the 16th best recruiting class in America, and Morris will have signed seven players from Texas. Arkansas had 13 in the previous four seasons combined.\nThen all he has to do is continue to out-recruit his last class every year. That's how the problem gets fixed.\nSports on 10/30/2018","url":"https://www.arkansasonline.com/news/2018/oct/30/lost-season-finds-many-fans-staying-awa/?page=1"}
