{"authors":[],"date_download":"2018-10-22 22:00:02","date_modify":"2018-10-22 22:00:02","date_publish":"2014-06-07 16:53:21","description":"But for Francoise Piloy, the anniversary of D-Day inspires a mix of pride and pain at her role in history: a generation born to GI's who simply disappeared.","filename":"data/vaneerConsumption/LostFathersofNormandyChildrenofDDaySeekAnswers.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/494281/140607-francoise-baby-mn-1100_f8b8da3232df427dc02ff24d4d9be2db.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_d-day-70th-anniversary_lost-fathers-normandy-children-d-day-seek-answers-n125286_1540245602.html","title":"Lost Fathers of Normandy: Children of D-Day Seek Answers","title_page":"Lost Fathers of Normandy: Children of D-Day Seek Answers","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFor many, the weekend commemorations marking the 70th anniversary of the Normandy landings recall glory and valor. But for Francoise Piloy and others like her, the anniversary of D-Day inspires a mix of pride and pain over their role in history: part of a generation born to \"lost fathers,\" mostly African-American GI's who simply disappeared after the war.\nIt was 1944 when Piloy’s mother, Simone Gautier, met a polite, well-spoken GI. He had brought his laundry over to their house in Caen, a small town in Normandy. Pvt. Jim Guice, from Ohio, spoke no French and Gautier, little English — but despite the language gaps, they fell in love.\nGuice sent letters to Gautier as his unit moved onto Paris, then Belgium and finally, Germany, writing in pigeon English so she’d understand.\n\"Me love Simone,\" reads one of the undated letters. Another contained a proposal: \"Me speak you me marry.\"\nThe soldier later wrote warmly to express his joy about becoming a father.\n\"Darling, you speak your baby from me — very good for me, for you, 1 baby,\" the letter said.\nThat baby was Piloy. Now 68, she has spent years wondering why, after arranging through an Army chaplain for her mother to apply for a marriage license, Guice never returned to Normandy for the wedding.\nPiloy's mother waited two or three years for Guice to come back, raising their child in the meantime and scraping by as a seamstress.\nDesperate for answers about her missing fiancé, Gautier then wrote to the War Department in Washington. A letter from the Adjutant General, dated April 17, 1946, informed her that one Pvt. James W. Guice had been discharged from the service.\n\"I grew up thinking I would never see him again.\"\nIt was Army policy not to furnish home addresses of former soldiers, the adjutant general’s letter said, adding that any correspondence would be forwarded to Guice's last known address.\nMonth's later, Gautier's letter to her love was returned to sender, unclaimed.\n\"My mother told me he disappeared,\" recalled Piloy, speaking to NBC News from her home in Caen. \"Thinking he was dead, I never questioned it further. I grew up thinking I would never see him again.\"\nUntil, that is, she stumbled upon an article about the work of Alice Mills, a professor of African-American studies at the University of Caen and local expert on black GI’s during the Normandy invasion.\nMills has spent years digging up clues on the 1,700 or so African-American soldiers who reached the beaches but whose stories were airbrushed out of the then-segregated U.S. Army's archives.\nIn her book, \"Black GI's — Normandy 1944,\" Mills explains why she chose such a mission.\n\"When I arrived at the University (of Caen) in 1994, the city was displaying huge photographs commemorating the 50th anniversary of the (Normandy) Landing. Not a single black GI was represented in them.\"","url":"https://www.nbcnews.com/storyline/d-day-70th-anniversary/lost-fathers-normandy-children-d-day-seek-answers-n125286"}
