{"authors":[],"date_download":"2018-10-22 22:45:36","date_modify":"2018-10-22 22:45:36","date_publish":"2014-05-12 16:16:41","description":"Scientists plan to explore one of Earth's coldest, deepest ocean trenches starting Saturday, the first stop in a three-year examination of the ocean's most mysterious depths.","filename":"data/vaneerConsumption/LostDeepDivingROVImplodes6MilesBeneaththeSea.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/436616/nereus-rov-1_268cee4d87620e82a600b1e98a5db5e6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_lost-deep-diving-rov-implodes-6-miles-beneath-sea-n103266_1540248336.html","title":"Lost! Deep-Diving ROV Implodes 6 Miles Beneath the Sea","title_page":"Lost! Deep-Diving ROV Implodes 6 Miles Beneath the Sea","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA hybrid remotely operated vehicle (ROV) dubbed Nereus was lost while diving 6.2 miles (10 km) beneath the sea surface in a deep trench northeast of New Zealand on Saturday (May 10), representatives for the Woods Hole Oceanographic Institution have confirmed.\nPart of the ROV, diving in the Kermadec Trench, may have imploded under pressures reaching a seam-bursting 16,000 lbs. per square inch (psi). (On Earth, humans are exposed to pressures of nearly 15 psi.)\nThe Kermadec Trench is the world's second-deepest trench, plunging 32,963 feet (10,047 meters) below the sea surface, second only to the Mariana Trench, which reaches 36,201 feet (11,034 m) beneath the surface of the Pacific Ocean.\nThe deep-diving vehicle, which operates remotely via an optical fiber tether and also as a free-swimming autonomous vehicle, was 30 days into a 40-day expedition to explore the deep-ocean trench aboard the research vessel Thomas G. Thompson. [See Photos of Nereus and Deep-Diving Expedition]\nAt 2 p.m. local time Saturday (10 p.m. Friday ET), about seven hours into a planned nine-hour dive to the deepest part of the Kermadec Trench, researchers aboard the Thompson lost contact with the ROV. The researchers spotted floating debris, which was later identified as part of Nereus, suggesting the vehicle had imploded, said representatives for the Woods Hole Oceanographic Institution (WHOI) in Massachusetts, where the vehicle was designed and built in 2008. The ship's crew is collecting the debris to confirm its identity and hopefully reveal information about the implosion.","url":"https://www.nbcnews.com/science/science-news/lost-deep-diving-rov-implodes-6-miles-beneath-sea-n103266"}
