{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-23 00:51:11","date_modify":"2018-10-23 00:51:11","date_publish":"2016-01-29 14:23:25","description":"Susanne Hinte, of Worcester, said she had a ticket with the winning numbers on it but had put it through the wash. After the real winner came forward yesterday, she'll get nothing","filename":"data/vaneerConsumption/LottograndmotherSusanneHintehasherhouseEGGED.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2D9D600000578-0-image-a-83_1454077145841.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422850_Lotto-grandmother-house-EGGED_1540255871.html","title":"Lotto grandmother Susanne Hinte has her house EGGED","title_page":"Lotto grandmother Susanne Hinte has her house EGGED | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The grandmother who claimed she had won £33million on the lottery has had eggs thrown at her home.\nSusanne Hinte, 48, said she had a ticket with the winning numbers on it which she had accidentally put it through the wash.\nHowever, it emerged yesterday that the actual winner has now come forward and Ms Hinte's crumpled ticket was not the winning one.\nEggs were thrown at the home of Susanne Hinte today following anger at her claims of lottery winnings\nSteve Allen, who is said to have thrown the eggs, told of his fury after reading about her claim\nThe news has apparently caused anger in her local area and eggs were hurled at the front door of her £145,000 housing association home in Worcester today.\nMechanic Steve Allen, who is said to have thrown the eggs, said: 'I just had to do something. She's a horrible person.'\nThe father-of-two added: 'When I read the papers this morning I just thought, \"I've had enough of this\".\n'I'm very glad she hasn't won. It would have been the worst if she had. You can see what sort of person she is.'\nMiss Hinte has not been seen in public since she emerged she had tried to claim the prize.\nShe has previously insisted she did not know if she had the winning ticket, but the numbers were the same and she had sent it to the lottery for them to investigate.\nBizarrely, the notoriety she has gained during the hunt for the real winner could now stand her in good stead to make money from 'nightclub appearances'.\nMs Hinte said she had washed her ticket in her jeans in the washing machine seen in this picture\nBarry Tomes, who represents Benefits Street star White Dee, claimed Miss Hinte could earn £2,000 in a nightclub this weekend and earn a seven-figure amount over the next few years.\nA neighbour of Miss Hinte said she hoped the former prison custody officer and barmaid would be prosecuted for her claim. Susan Gormley, 70, said: 'I didn't think for one minute that she had won it. I was hoping she had won so she'd move.'\nDozens took to social media calling for Miss Hinte to be investigated. Rachel Smith wrote on Facebook 'she should be done for fraud'.\nMiss Hinte has had court appearances for non-payment of fines, failing to reveal a driver's identity and failure to pay her TV licence. She is facing two trials in March for theft and motoring offences.\nIt emerged yesterday that Ms Hinte is also facing a criminal trial after being accused of stealing a purse and an Xbox controller.","url":"https://www.dailymail.co.uk/news/article-3422850/Lotto-grandmother-house-EGGED.html"}
