{"authors":["Shannon Carlin"],"date_download":"2018-10-31 01:38:34","date_modify":"2018-10-31 01:38:34","date_publish":"2018-08-28 19:34:12","description":"Less than a year after Louis C.K. admitted to sexual misconduct he's returning to the comedy stage. The New York Times reported that C.K. performed his first stand-up performance since confirming that the five women’s claims that he asked to, and in…","filename":"data/vaneerConsumption/LouisCKReturnedToStandupForTheFirstTimeSinceBeingOutedByMeTooTwitterIsntHappyAboutIt.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/28/87068ce0-6a3b-4adf-a008-37977d93837d-getty-848120814.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_louis-ck-returned-to-standup-for-the-first-time-since-being-outed-by-metoo-twitter-isnt-happy-about-it-10354328_1540949914.html","title":"Louis C.K. Returned To Standup For The First Time Since Being Outed By #MeToo & Twitter Isn't Happy About It","title_page":"Louis C.K. Returned To Standup For The First Time Since Being Outed By #MeToo & Twitter Isn't Happy About It","title_rss":"NULL","source_domain":"bustle.com","text":"Less than a year after Louis C.K. admitted to sexual misconduct he's returning to the comedy stage. The New York Times reported that C.K. performed his first stand-up performance since confirming that the five women’s claims that he asked to, and in many cases did, masturbate in front of them against their will were true. His surprise return to the stage at a New York comedy club on Sunday, Aug. 27, was reportedly met with a standing ovation, but there is already Twitter backlash against C.K.'s standup comeback by those who are worried about what it means for the #MeToo movement and his accusers: Dana Min Goodman, Julia Wolov, Abby Schachner, Rebecca Corry, and a fifth woman, who spoke to the New York Times on condition of anonymity.\nC.K. reportedly performed a 15-minute set at the Comedy Cellar in New York City that included “typical Louis C.K. stuff,\" according to Comedy Cellar owner Noam Dworman, which included jokes on \"racism, waitresses’ tips, parades.\" Based on reports, it seems as if C.K's set didn't include any acknowledgement of #MeToo or his own sexual misconduct. “It sounded just like he was trying to work out some new material,\" Dworman told the Times, \"Almost like any time of the last 10 years he would come in at the beginning of a new act.”\nThe paper reported that, despite not being previously announced as a performer that night, C.K. received a warm welcome from the sold-out crowd of 115 people before he even started his set. Dworman — who was not present for the show, but did see a tape of the performance after — did, however, say that one person called the club the following day to complain about the unannounced appearance. \"He wished he had known in advance, so he could’ve decided whether to have been there or not,” Dworman said, adding that others in attendance wrote in a \"standard email follow-up\" that they were \"happy they caught the show.\"\nBen Gabbe/Getty Images Entertainment/Getty Images\nBut many on Twitter think it's too soon for C.K. to be making his comeback. Especially, since he hasn't suffered any serious consequences for his actions. \"He was literally greeted with an ovation while the women who were brave enough to come forward have been ostracized and threatened,\" Lara Witt, the managing editor of Wear Your Voice, tweeted.\n\"This is what I mean when I say that this so-called court of public opinion will never ever keep abusers from having support systems waiting to uplift them,\" Witt continued on Twitter. \"Because you care more about the lives of people like Brock Turner & CK than the lives of those they harmed.\" (Turner, who was convicted of sexually assaulting an unconscious woman in California, was only given six months jail time, but ended up serving just three months.)\nUnlike Turner, C.K. was not accused of rape or convicted of any crimes, which actor Amir Talai tweeted, makes the question of \"'how long' Louis CK should be 'punished' for before he's 'allowed to do comedy'\" a hard one to answer. There is no time to be served, no timeline set from an impartial judge, which means that people have to come make their own judgements, and they might not always agree.\nBut, as Talai pointed out, there are some things that people should be keep in mind when thinking about when or even if to welcome C.K. back into the role of comedian: \"1) he's not been punished. 2) For non-famous men, each count of indecent exposure and false imprisonment (which CK's admitted to) carries a sentence of ~1yr in jail.\"\nWhat C.K.'s standup comeback shows is how easily some are willing to forget his wrongdoing and in doing so, diminish the effect his actions had on the women. Back in May, one of C.K.'s accusers, comedian Rebecca Corry wrote a piece for Vulture, claiming she “experienced vicious and swift backlash from women and men, in and out of the comedy community,” for coming forward with her allegations. “I’ve received death threats, been berated, judged, ridiculed, dismissed, shamed, and attacked,\" Corry wrote. But, instead of paying attention to the women, those cheering for C.K.'s return have decided to focus on how the comedian's career was affected, giving his behavior a pass because they liked his comedy. Yes, C.K.'s career did take a hit after he admitted to masturbating in front of women without their consent; his movie I Love You Daddy was all but erased from the theaters or any type of release. But it's worth noting that having his film shelved wasn't a punishment, it was a consequence of his own bad behavior. And even then, it was not a legal consequence, simply a public one — one that had no effect on his freedom whatsoever.\nC.K. did find some allies after news of his on stage comeback circulated. Comedian Michael Ian Black tweeted that perhaps C.K. deserved to at least attempt a comeback because \"people have to be allowed to serve their time and move on with their lives.\" But, as writer Kara Brown pointed out, his reasoning was missing one major point. \"It seems I missed the part when Louis CK 'served time. I just remember him living quietly as a millionaire for a less than a year,\" Brown wrote.\nC.K.'s return isn't all that surprising. Back in April, The Hollywood Reporter wrote that C.K.'s path back to a comeback likely runs through comedy clubs. But it doesn't make it any less disappointing to know that less than a year after he admitted to sexual misconduct, he could be back in the spotlight, while the women who came out against him are still struggling to find work and recover from the effects of his actions.\nAs writer and MAD Magazine editor Allie Goertz tweeted, \"I believe people can grow and change, but this urgency to bring him (and others) back SO soon just sends such a bad message.\"\nAnd that's really what's especially disappointing about this news of C.K.'s return — how quickly it happened. In his November 2017 statement to the New York Times in which he admitted that \"the stories are true,\" he wrote, \"I have spent my long and lucky career talking and saying anything I want. I will now step back and take a long time to listen.\" But is nine months really enough time for him to listen and learn, like he promised? C.K. has yet to take any public action that suggests that he has actually listened to women and learned from his mistakes. He never even publicly apologized, as his statement failed to contain the word \"sorry\" or \"apology.\" And yet, the comedian is already on the road to redemption.\nBut Ella Dawson, @TEDtalks social media lead, pointed out that just because he's talking doesn't mean you have to listen. Those who aren't interested in C.K.'s comeback aren't powerless. \"If you are at a comedy club or a music venue and a celebrity accused of sexual harassment or assault like Louis CK shows up for a surprise performance, it is your ethical duty to LEAVE,\" Dawson wrote. \"Walk out. Punish him, and the business that hosted him, by removing your patronage.\"\nFor all those who stood up and cheered C.K.'s comeback this past weekend, there are many others who will continue to stand up for what they believe in. And what they believe is that C.K. doesn't deserve a second chance right now. The hope is if this response is loud enough, C.K. will finally hear it.\nIf you or someone you know has been sexually assaulted, call the National Sexual Assault Telephone Hotline at 800-656-HOPE (4673) or visit online.rainn.org.","url":"https://www.bustle.com/p/louis-ck-returned-to-standup-for-the-first-time-since-being-outed-by-metoo-twitter-isnt-happy-about-it-10354328"}
