{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:27:47","date_modify":"2018-10-30 21:27:47","date_publish":"2014-12-02 13:34:00","description":"Louisiana U.S. Sen. David Vitter (R) has abruptly changed his position on the Common Core standards, and now states he opposes the controversial education |","filename":"data/vaneerConsumption/LouisianaUSSenVitterChangesCourseNowOpposesCommonCoreStandards.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/12/02/Vitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_12_02__1540934867.html","title":"Louisiana US Sen. Vitter Changes Course, Now Opposes Common Core Standards","title_page":"Louisiana US Sen. Vitter Changes Course, Now Opposes Common Core Standards | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Louisiana U.S. Sen. David Vitter (R) has abruptly changed his position on the Common Core standards, and now states he opposes the controversial education reform initiative.\nIn an email sent to Breitbart News from the Senator’s office, Vitter, a candidate for Louisiana governor in 2015, said that, while he had supported Common Core four months ago, he also wanted to ensure local control over curriculum and instructions materials.\n“After listening to literally thousands of parents, teachers, and others…I don’t believe that we can achieve that Louisiana control, buy-in, and success I’m committed to if we stay in Common Core,” Vitter said, citing several reasons why he changed his direction.\n“First, Common Core is controlled by national groups and interests outside Louisiana,” he continued. “And many Louisianans legitimately fear that it will become a federal government takeover of education under President Obama and his far-left allies.”\n“Second, Common Core is causing deep frustration and worse in many classrooms and homes, and not because of greater rigor,” Vitter said. “It’s preventing lots of involved parents and teachers — our most important education leaders — from being effective and helping kids learn.”\nVitter added that a third reason for his change of heart is his view that “an entrenched few in public education are trying very hard to manipulate the Common Core controversy to greatly weaken or reverse accountability measures.”\nThe Senator proposed the following course of action for his home state:\nExit the Common Core PARRC testing consortium immediately and adopt a rigorous interim test that is not aligned with Common Core.\nHave the Governor, Legislature, and BESE convene a blue-ribbon panel of Louisiana parents, teachers, experts from higher education, and business leaders to develop an updated system of rigorous Louisiana standards and testing outside of Common Core/PARCC.\nRequire that this new system be developed, debated, and adopted in a fully inclusive, transparent, and democratic way.\nImplement it in a careful, methodical manner, unlike the roll-out of Common Core.\n“I’ll also attack other key education challenges that standards alone won’t fix,” Vitter added. “We must empower great school-based leaders, demand strict discipline in our classrooms, and dramatically improve reading proficiency in the early grades (now a dismal 23% in Louisiana).”\nAs Breitbart News reported in August, Vitter stunned his conservative supporters when he announced his strong support of the nationalized standards in both an article in the Associated Press (AP) and in a taped interview for C-SPAN’s “Newsmakers.”\nMany conservatives remarked that Vitter’s alarming support of Common Core was due to promised campaign contributions from pro-Common Core business groups and a lack of awareness of how the standards came to be adopted by 45 states in the first place.\nGov. Bobby Jindal (R) also once supported the standards, but over the past months has changed his course and has even taken legal action against the controversial initiative. In November, Jindal joined legislators in Louisiana in a lawsuit that alleges the state’s education officials did not comply with state law when they began implementing the Common Core.\nIn a statement to Breitbart News regarding Vitter’s announcement, Jindal said, “I applaud Senator Vitter for his decision to oppose Common Core. The more people learn about Common Core, the more they are opposed to it.”\n“Parents don’t want a national curriculum designed by the federal government,” the Governor continued. “Decisions about curriculum are best left to local control. That’s why we are going to keep improving education based on local control, and it is why we will absolutely continue to fight to get Common Core out of Louisiana.”\nParent activist against Common Core in Louisiana Dr. Anna Arthurs had been surprised by Vitter’s support for the standards in August.\n“I was so pleased to hear that Senator Vitter has made a public statement against Common Core,” Arthurs told Breitbart News. “I am thankful that he has listened to his constituents and the majority of the citizens of our state and country who are opposed to the initiative associated with the Common Core State Standards.”\n“Apparently, Senator Vitter has done his homework and researched the reasons that there is such strong opposition and realizes that this is not something he can support,” she added.","url":"https://www.breitbart.com/border/2014/12/02/Louisiana-US-Sen-Vitter-Changes-Course-Now-Opposes-Common-Core-Standards/"}
