{"authors":["Jack Gaughan For The Daily Mail"],"date_download":"2018-10-23 01:28:40","date_modify":"2018-10-23 01:28:40","date_publish":"2016-01-11 12:32:17","description":"Louis van Gaal blamed the notorious Manchester traffic for the thousands of early leavers streaming out of Old Trafford on Saturday.","filename":"data/vaneerConsumption/LouisvanGaalsaysManUnitedfansleftSheffieldUtdFACupgameearlyduetotraffic.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/2FF55ACF00000578-0-image-a-64_1452515524083.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393845_Louis-van-Gaal-says-Manchester-United-fans-left-early-Sheffield-United-game-traffic_1540258120.html","title":"Louis van Gaal says Man United fans left Sheffield Utd FA Cup game early due to traffic","title_page":"Louis van Gaal says Man United fans left Sheffield Utd FA Cup game early due to traffic  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Louis van Gaal has blamed the Manchester traffic for thousands of supporters streaming out of Old Trafford early against Sheffield United.\nPlenty of fans missed Wayne Rooney’s penalty in added time as Manchester United limped into the FA Cup fourth round.\nSupporters booed their team and ironically cheered shots on goal but Van Gaal believes logistics were behind fans leaving before full time.\nLouis van Gaal said that traffic was to blame for Manchester United supporters leaving early on Saturday\nVan Gaal (left) saw Manchester United fans stream out of Old Trafford early in an uninspiring display\n‘They are thinking that we could not score and maybe because of the traffic to leave a few minutes earlier,’ he said ahead of tonight’s trip to Newcastle.\n‘It’s not an easy time now. How many stadiums were like ours, full? You can mention how they leave but you can also mention how they come.\n‘You can be very negative but we are in the next round, won two matches out of a very bad period. You have to be happy as a fan of Manchester United.’\nSome Manchester United fans missed Wayne Rooney's winning penalty in injury time on Saturday\nManchester United laboured past Sheffield United in the third round of the FA Cup at Old Trafford\nVan Gaal did however admit he empathises with fan frustration.\n‘There are matches where I’m very bored or angry because we’re not disorganising our opponent’s defence,’ he said. ‘It’s not every match that every club is playing fantastically.’\nVan Gaal was again critical of Sheffield United sitting men behind the ball but he could be in for similar on travelling to St James’ Park to face Newcastle on Tuesday.\n‘Newcastle are playing very well,’ he added. ‘When I saw the match against Arsenal they played very well but they didn’t win - that’s the most important thing. We have to beat them.’\nPaul Scholes lambasted Manchester United's performance in their FA Cup victory over Sheffield United\nUnited legend Paul Scholes cut a distraught figure as a BT Sport pundit immediately after the limp weekend win, claiming players and even the manager must be bored with what is being served up.\nVan Gaal would not be drawn on Scholes, but did agree that disgruntled supporters had every right to jeer. Many cheered ironically when Memphis Depay - a second-half substitute but easily their beat player - saw an effort fizz wide from 30 yards.","url":"https://www.dailymail.co.uk/sport/football/article-3393845/Louis-van-Gaal-says-Manchester-United-fans-left-early-Sheffield-United-game-traffic.html"}
