{"authors":["Lucy Mapstone","Kayleigh Giles For Mailonline"],"date_download":"2018-10-23 00:14:52","date_modify":"2018-10-23 00:14:52","date_publish":"2016-01-29 13:00:25","description":"The 24-year-old stylist - who shares one-week-old baby Freddie Reign with One Direction's Louis Tomlinson - was seen out with her new addition on Thursday near her home in Los Angeles.","filename":"data/vaneerConsumption/LouisTomlinsonsexBrianaJungwirthlooksrelaxedwithbabyFreddie.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B1FD9E00000578-0-image-a-12_1454068811107.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422627_Louis-Tomlinson-s-ex-Briana-Jungwirth-looks-relaxed-refreshed-stylish-outfit-gets-grips-motherhood-outing-baby-Freddie_1540253692.html","title":"Louis Tomlinson's ex Briana Jungwirth looks relaxed with baby Freddie","title_page":"Louis Tomlinson's ex Briana Jungwirth looks relaxed with baby Freddie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Briana Jungwirth appears to have taken to motherhood like the proverbial duck to water.\nThe 24-year-old stylist - who shares one-week-old baby Freddie Reign with One Direction's Louis Tomlinson - was seen out with her new addition on Thursday near her home in Los Angeles.\nShe looked rather lovely in her off-duty ensemble, comfortable and still stylish as she carried her infant in his seat, protecting him from the sunshine underneath a blanket.\nScroll down for video\nTaking to motherhood: New mum Briana Jungwirth looked relaxed as she stepped out with her baby son Freddie Reign on Thursday in Los Angeles\nThe new mother appeared relaxed in her new role, deftly taking baby Freddie out for the day, while his famous father was not present.\nShe looked lovely in a denim jacket and short dress teamed with semi-sheer black tights and low-heeled ankle boots.\nBriana made sure she had everything she needed as she carried an on-trend black leather rucksack on her back, allowing her hands to be free to tend to her child.\nSee One Direction updates on Louis Tomlinson, Briana Jungwirth and baby Freddie\nRefreshed: The 24-year-old looked lovely in a little dress teamed with tights, a stylish denim jacket and heeled ankle boots\nLearning the ropes: Carrying a utilitarian yet on-trend rucksack on her back, the stylist went about her day, while the father of her child Louis Tomlinson was elsewhere\nShe wore her long, blonde locks loose and slightly wavy for the day and she sported a face of natural make-up, perhaps to hide her tiredness from the past week of interrupted nights.\nMeanwhile, across town, Freddie's dad Louis was spotted out in Beverly Hills, emerging from his hotel and looking notably cool, calm and collected.\nThe 24-year-old appeared to be staying away from his temporary living quarters as his assistant was seen loading a guitar and an Xbox One into the back of his vehicle.\nLouis and Briana are said to be living in rented accomodation together in Calabasas while they begin their new lives as parents, although the singer is currently in a romance with actress Danielle Campbell.\nSettling in: Louis was spotted looking cool, calm and collected while stepping out of his Beverly Hills hotel on Thursday, while Briana was with Freddie\nTrue to form, the British singer was clad in a casual ensemble as he pounded the pavement in a loose-fitting black T-shirt and skinny jeans.\nHe attempted to block out the breeze with a wool-lined black jacket, while offering the look his signature edge with a pair of vivid red and yellow trainers.\nLouis looked to want to keep a low profile as he swept his brown locks across his face, which he partly concealed beneath some tinted aviator shades.\nPared-down: True to form, the One Direction star was clad in a casual ensemble as he pounded the pavement in a loose-fitting black T-shirt and skinny jeans\nFeeling the chill? The Midnight Memories crooner attempted to block out the breeze with a wool-lined black jacket, while offering the look his signature edge with a pair of vivid red and yellow trainers\nLouis' outing came the same day as TMZ reported that Briana's family registered FreddieTomlinson.com on January 27, merely minutes after the stylist welcomed her son into the world.\nSources told the outlet that once the name was confirmed, One Direction fans instantly began creating fake social media accounts with the tots name, and feigning a relationship with the family.\nMeanwhile, Louis - who welcomed a son with former flame Briana on Friday - has reportedly been every inch the hands-on dad he promised.\nClearly smitten with his new bundle of joy, Louis proudly shared a photograph of the newborn with his fans on Wednesday for the very first time.\nNot only is the One Direction singer taking an active role in parenthood, but he is also alleged to have spent days with Briana choosing a name they both love, ensuring it was a mutual decision.\nUnder the radar: Louis looked to want to keep a low profile as he swept his brown locks across his face, which he partly concealed beneath some tinted aviator shades\nChange of scenery: The 24-year-old appeared to be staying away from his temporary living quarters as his assistant was seen loading a guitar and an Xbox One into the back of his vehicle\nDoting dad: Louis, pictured visiting his newborn son Freddie Reign in LA on Wednesday, is making his son his top priority and reportedly spent ages picking out the name with the baby's mother, Briana Jungwirth\nA source close to Louis told MailOnline: 'Louis and Briana picked out the name together over the last few days.\n'Louis is already loving being a father and is so proud of Freddie. His son is his number one priority and he's supporting Briana and Freddie in every way possible.\n'His mum and her husband are in Los Angeles with Louis to help Louis, Briana and her family in any way they can.'\nThe Perfect hitmaker and his former flame were said to have disagreed about what to call their child, with Louis wanting a more traditional name than his ex, but the insider insisted that couldn't have been further from the truth.\n'Love of my life': Louis' former flame Briana also shared a photo with the sweet little boy. An insider told MailOnline: 'His son is his number one priority and he's supporting Briana and Freddie in every way possible'\nTMZ reported that Louis and Briana eventually compromised about the name; with the 1D star picking out the first moniker and Briana choosing the middle name.\nThe gossip site claimed the blonde beauty originally had her heart set on Rain, but opted to spell it Reign to give it a more manly feeling.\nThis comes after Louis shared the first picture of his newborn baby son on social media, sending fans into a frenzy with the adorable image.\nThe pop star took to Twitter on Wednesday evening to reveal not only a tender image of his first child, but also his full name.\nIn the touching black and white snap, the boyband heartthrob stands shirtless as he cradles his sweet little lad for an intimate selfie.\nProud daddy: Louis shared the adorable first image of his newborn son Freddie on Twitter on Wednesday\nLouis captioned the heartwarming image, in which you could also see the tattoo inked across his chest: 'Meet my little lad, Freddie'.\nThen minutes later he tweeted that the little tyke will carry his last name Tomlinson, writing: 'Freddie Tommo'.\nShortly after, the British star, who is currently in California spending time with his newborn, added his gratitude to his fans for their well wishes: 'Thank you so much for the all nice messages :)'.\nFans of the Steal My Girl hitmaker have also picked up on the fact that his former 1D co-star Zayn Malik has liked a retweeted picture of Louis with Freddie on Twitter.\nMeanwhile, Briana - who gave birth a week ago - also shared a photo of the baby boy on Instagram, revealing that his middle name is Reign.\nChuffed: Louis also revealed on Twitter that Freddie will take his second name Tomlinson, calling him 'Freddie Tommo', before thanking his fans for the 'nice messages'\nThe picture showed the little boy bundled up in her arms as she lay in a hospital bed, and she captioned it: '1/21/16. Freddie Reign. Love of my life.'\nFans had speculated before Louis revealed his son's moniker that he'd named the boy Sydney Rain.\nHowever, on Wednesday he dispelled such talk, revealing that he and his ex-girlfriend Briana had settled on a much more traditional name for the child.\nLouis proudly confirmed the birth of his son on Saturday, after rumours of the birth were spread online by his loyal fans over the previous 24 hours.\nThe excited star posted on Twitter: 'I'm pleased to say my baby son was born yesterday :) He is healthy and pretty amazing, I'm very happy!!'\nHe then indicated he was relishing his new status as a parent as he added: 'Daddy daddy cool,' moments later.\nSpecial time: She only gave birth to her baby boy on Thursday, but Briana looked incredible when she was pictured out with her bundle of joy for the first time in LA on Wednesday\nAnd as if his happiness wasn't evident enough, he followed his latest comment up with three smiley faces which appeared as ':) :) :)', on his personal account.\nDespite claims the One Direction star had splashed out on a multi-million pound pad for Briana and their son, TMZ have reported that Louis is leasing a much more modest three bedroom home in Calabasas for her and Freddie.\nThe report claims 'the home is in the hundreds of thousands of dollars ... not in the millions,' while stylist Briana has been paying for furniture.\nWhat a man: The day before, Louis was pictured talking on his mobile phone as he went to visit his baby once again on Tuesday\nDaddy cool: He looked casual as he stepped out while chatting on the phone\nLouis meanwhile is renting his own home nearby for at least the next six months so he can be close to his son, with previous reports suggesting his five-bed mansion is worth £10million.\nIt's not yet known if Louis and Briana has settled on a child support figure yet with The Sun claiming this week that the Brit singer will 'pay more than £2.1million in child support.'\nThe paper reports that the star has agreed to pay almost £10,000 a month for his son, although it's noted that child support payments in California are based on income and the child's needs.\nRevealed: Last week, Louis announced his happy news on Twitter\nThe 1D star was pictured going to meet his pride and joy as well as his former flame in Calabasas, along with another friend on Monday, stopping by Briana's modest-looking apartment.\nLouis is now dating new girlfriend Danielle Campbell, 20, with the pair spotted out and about on several occasions together in Los Angeles over the last few weeks.\nRecently, a friend of Louis' exclusively told the MailOnline that singer is planning to be a hands-on dad and support Briana in any way he can, despite being in a new relationship with Disney star Danielle.\nThe pal said: 'Although they're not romantically involved, Louis thinks Briana is a great woman and will be a fabulous mother.'\nRomance: Last year, Briana and Louis were seen enjoying a string of nights out, although they aren't believed to have actually been in a proper relationship\nThe news that Louis and Briana would be having a baby together was revealed in July last year, while he was in the midst of One Direction's On The Road Again world tour.\nLouis, who rose to fame in 2010 with the X Factor pop group, later confirmed the baby news the following month, during an interview in the US, admitting, 'it's a very exciting time, so I'm buzzing.'\nThe singer and the stylist were first seen partying together in May around Los Angeles.\nAnd, while they were never said to have had a proper relationship, it's thought they were involved in a brief fling.\nHowever, they have maintained a close relationship in the past year, with Louis regularly returning to the US, and their families met up as the birth drew nearer.\nSee One Direction updates on Louis Tomlinson as Briana Jungwirth is with their baby son","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422627/Louis-Tomlinson-s-ex-Briana-Jungwirth-looks-relaxed-refreshed-stylish-outfit-gets-grips-motherhood-outing-baby-Freddie.html"}
