{"authors":["Paul Hirst","Press Association"],"date_download":"2018-10-23 02:36:42","date_modify":"2018-10-23 02:36:42","date_publish":"2016-01-11 15:02:32","description":"Louis Van Gaal had recalled Januzaj from his loan at Borussia Dortmund last week after the club became annoyed at the forward's lack of game time in Germany.","filename":"data/vaneerConsumption/LouisvanGaalpullsAdnanJanuzajoutofManchesterUnitedUnder21squad.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/2FE14B1B00000578-0-image-a-70_1452524496569.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3394049_Adnan-Januzaj-Manchester-United-21-squad-fitness-concerns-manager-Louis-van-Gaal_1540262202.html","title":"Louis van Gaal pulls Adnan Januzaj out of Manchester United Under 21 squad","title_page":"Louis van Gaal pulls Adnan Januzaj out of Manchester United Under 21 squad | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Adnan Januzaj has been pulled out of Manchester United's Under 21 squad for Monday's game at Reading because Louis van Gaal does not think he is fit enough.\nVan Gaal recalled Januzaj from his loan at Borussia Dortmund last week after the club became annoyed at the forward's lack of game time in Germany.\nJanuzaj, 20, started just three matches during his four-month spell at Dortmund - all of which were in the Europa League.\nAdnan Januzaj has been pulled out of Manchester United's Under 21 squad for their clash with Reading\nManager Louis van Gaal does not think the Belgian is fit enough after returning from a loan spell\nThe United manager wants Januzaj to regain his fitness with the Under 21s before bringing him back into the first-team fold and had identified Monday's game against Reading as the ideal place for him to start.\nBut Van Gaal now claims he is not satisfied that Januzaj, who last played for Dortmund over a month ago, is fit enough to play in the game at Adams Park.\n'We have reconsidered and we think we have to build him up for the game and not risk too much by putting him in a game at once,' the United manager told MUTV.\nThe 20-year-old started only three games during a four-month loan spell at Borussia Dortmund","url":"https://www.dailymail.co.uk/sport/football/article-3394049/Adnan-Januzaj-Manchester-United-21-squad-fitness-concerns-manager-Louis-van-Gaal.html"}
