{"authors":["Michelle Fields"],"date_download":"2018-10-30 20:14:43","date_modify":"2018-10-30 20:14:43","date_publish":"2015-11-17 16:11:24","description":"The group that helped a Syrian refugee resettle into Louisiana now says it doesn't know where the refugee went. It hasn't kept track.","filename":"data/vaneerConsumption/LouisianaGroupResponsibleForSettlingRefugeesAdmitsToLosingTrackofSyrianRefugee.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_17__1540930483.html","title":"Louisiana Group Responsible For Settling Refugees Admits To Losing Track of Syrian Refugee","title_page":"Louisiana Group Responsible For Settling Refugees Admits To Losing Track of Syrian Refugee | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The group that helped a Syrian refugee resettle into Louisiana now says it doesn’t know where the refugee went, because it hasn’t kept track of the individual.\nAccording to WBRZ:\nWBRZ has learned Catholic Charities helped the refugee who settled in Baton Rouge, but said the immigrant left for another state after a couple of days, and they don’t know where the refugee went since they don’t track them. The Executive Director of the group told WBRZ that they help refugees settle, but they don’t track them to see where they go. “We’re at the receiving end,” Executive Director of Catholic Charities, Chad Aguillard said. “We receive them, we welcome them into our community and help them resettle. There has been a lot of commotion and fear with Syrians. The fear is justified, but we have to check that against reality.”\nOn Monday, Louisiana Governor Bobby Jindal sent a letter to President Obama demanding information about the Syrian refugees resettling into his state.\nLast week, the city of New Orleans began receiving its first wave of Syrian refugees. As with former immigration crises and federal relocation policy, Louisiana has been kept in the dark about those seeking refuge in the state. It is irresponsible and severely disconcerting to place individuals, who may have ties to ISIS, in a state without the state’s knowledge or involvement. As Governor of Louisiana, I demand information about the Syrian refugees being placed in Louisiana in hopes that the night of horror in Paris is not duplicated here.\nJindal joins a growing number of governors in the United States who are rejecting President Obama’s plan to resettle thousands of Syrian immigrants. More than 22 U.S. Governors have publicly blasted the President’s plan.\nThe concern over Syrian refugees continues to grow as details emerge regarding the terrorists who took part in the Paris attacks on Friday. At least one of the terrorists, who was found with a Syrian passport, entered into Europe by posing as a Syrian refugee.","url":"https://www.breitbart.com/politics/2015/11/17/louisiana-group-responsible-settling-refugees-admits-losing-track-syrian-refugee/"}
