{"authors":[],"date_download":"2018-10-22 22:14:25","date_modify":"2018-10-22 22:14:25","date_publish":"2014-06-09 14:36:59","description":"Nobody was hurt by the \"love lock\" incident. The bridge reopened and the two grills were replaced temporarily by wooden panels.","filename":"data/vaneerConsumption/LoveLocksCollapsePartofParisFamedPontdesArts.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/496506/140609-paris-bridge-cover-1030a_29d9963c9cc7dfafde42dff233895c9e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_love-locks-collapse-part-paris-famed-pont-des-arts-n126246_1540246465.html","title":"Love Locks Collapse Part of Paris' Famed Pont des Arts","title_page":"Love Locks Collapse Part of Paris' Famed Pont des Arts ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Nobody was hurt by the \"love lock\" incident, a city official told French media on Monday, adding that the bridge had reopened and the two grills across a 2.4 meter stretch of the bridge had been replaced temporarily by wooden panels.\nBut in a tweet posted on the city's official web site, Bruno Juillard, the city's elected head of cultural affairs, said it \"confirms that our desire to find an alternative to these locks is a real necessity.\"\nThe railings of several Paris bridges, including the central Pont des Arts which has a commanding view of the Ile de la Cite from the west, have since all but disappeared behind festoons of padlocks.\nParis authorities, who inspect and replace panels twisted or made unsafe by the weight of the locks, have faced calls to clamp down on the practice on aesthetic grounds. But they have been reluctant to take stiffer measures for fear of hurting the city's tourist industry and its worldwide reputation as a city of love.\nParis Mayor Anne Hidalgo last month invited citizens to \"open a debate around the phenomenon of 'love locks' with a view to finding alternatives\".\n- Reuters","url":"https://www.nbcnews.com/news/world/love-locks-collapse-part-paris-famed-pont-des-arts-n126246"}
