{"authors":[],"date_download":"2018-10-22 23:02:14","date_modify":"2018-10-22 23:02:14","date_publish":"2014-06-11 18:22:59","description":"Lowe's is launching a virtual reality room that enables customers to view a 3-D representation of their renovation projects before they start.","filename":"data/vaneerConsumption/Lowes3DRoomMakesRemodelingaVirtualReality.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/502801/holoroomdemo_june14_release_1_c61ab7507e0756fb9b4213eeb10d2a61.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_lowes-3-d-room-makes-remodeling-virtual-reality-n128661_1540249334.html","title":"Lowe's 3-D Room Makes Remodeling a (Virtual) Reality","title_page":"Lowe's 3-D Room Makes Remodeling a (Virtual) Reality","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFor anyone who has ever pondered a home remodeling project, the challenge is figuring out what it actually will look like when it’s done.\nLowe's home improvement chain thinks it has a solution for customers that also tackles its own challenge of how to get shoppers offline and back into the store.\nSign up for top Business news direct to your inbox.\nThe second-largest home improvement store announced Wednesday that it will transform the in-store experience by building a 30-foot-by-30-foot virtual reality room that enables customers to view a 3-D representation of their renovation projects before they start with demolition.\nThe proprietary technology, developed in partnership with SciFutures technology firm, starts by letting shoppers design their ideal room on one of the store's iPads.\nBy first entering the dimensions of the space they want to renovate, they then select the features they are considering for their home, including flooring and countertop options. Once the selections are made, the customer enters the Holoroom, which projects a realistic 3-D rendering of what their future room would look like.\nIf they're satisfied, customers will be handed a list of their selected items, which can be purchased in-store or online. If, say, the tiling doesn't match the faucets, they can swap out different aspects of the design to get the look they want. And if they're still not sure, they can get a printed copy of the design, which can be scanned using a free app to be revisited down the road.\n\"Many homeowners are overwhelmed by defining and articulating their vision for a home improvement project and may never even start a project for that reason,\" said Kyle Nel, executive director of Lowe's Innovation Labs. \"The Holoroom removes a significant barrier for customers in helping them visualize how a finished project will look in their homes.\"\nThe Holoroom will debut later this year in two of the company's Toronto stores — a smaller market where its 35-store footprint is dwarfed by its U.S. store count, which tops 1,700.\nThe initial launch will be limited to bathroom remodeling, but over the next 12 to 18 months, Lowe's plans to add new categories and rooms such as kitchen, living and outdoor spaces.\nThe retailer has not yet set any plans for a U.S. launch.\nThe Holoroom's creation stems from Lowe's Innovation Labs, an initiative developed by the company to harness existing technologies, as well as work with start-ups, universities and other companies, to create the store of the future. The retailer's technology tie-ins extend outside of the retail universe, including multiple appearances at the Consumer Electronics Show.\nLowe's isn't the only retailer looking to revamp its in-store experience to boost engagement and customer loyalty; a multitude of other brands are tackling the issue with myriad approaches.\nUrban Outfitters is opening a series of store concepts that include third-party offerings, such as a coffee shop, hair salon and rooftop bar, to keep shoppers in its stores longer. LVMH-owned Sephora, on the other hand, is taking a more tech-savvy approach by testing augmented reality mirrors, through which customers can virtually try on different makeup palettes. And Macy's and other stores have begun experimenting with in-store GPS technologies to help shoppers navigate once they're inside.\n\"I think [in-store technology] absolutely will be the norm,\" said Joanne Podell, a vice chairman at commercial real estate firm Cushman & Wakefield. \"Any retailer today that does not look at using technology to engage the customer experience is making a mistake.\"\nNew technologies are one way Lowe's is looking to capitalize on the recovering housing market, which helped the retailer post a comparable-store sales gain of 0.9 percent in the most recent quarter, despite an extended winter that delayed consumers' purchases for the critical spring selling season.\nStill, the retailer is lagging the performance of major competitor Home Depot, which posted stronger sales growth in the most recent quarter despite a more difficult comparison from the prior-year period.","url":"https://www.nbcnews.com/business/consumer/lowes-3-d-room-makes-remodeling-virtual-reality-n128661"}
