{"authors":["Pam Fessler"],"date_download":"2018-10-23 01:08:25","date_modify":"2018-10-23 01:08:25","date_publish":"2016-03-29 00:00:00","description":"Most people who end up facing eviction simply can't afford to pay their rent. Many low-income tenants work, but their rent outpaces their wages. An unexpected bill or a lost job can mean homelessness.","filename":"data/vaneerConsumption/LowIncomeTenantsStruggleToPayRentNPR.json","image_url":"https://media.npr.org/assets/img/2016/03/23/edit_meagen-0006_wide-023c01b22da3469631f421232f3aed8f43d52cec.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_03_29_471347542_living-from-rent-to-rent-tenants-on-the-edge-of-eviction_1540256905.html","title":"Low-Income Tenants Struggle To Pay Rent : NPR","title_page":"Low-Income Tenants Struggle To Pay Rent : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Living From Rent To Rent: Tenants On The Edge Of Eviction\nEnlarge this image toggle caption Pam Fessler/NPR Pam Fessler/NPR\nEvery morning for weeks, Meagen Limes made the same phone call: to a court in Washington, D.C., to see if that day was the day she'd be evicted from her home.\nLimes faced eviction because she couldn't pay rent on her three-bedroom apartment in Southeast Washington, where many of the city's poorest residents live.\nIt can sometimes take weeks before the marshals actually show up at your door, and Limes fully expected to be homeless any day.\n\"And it's like really scary,\" the 28-year-old said. \"I try so hard not to cry. Like, I would be like, 'Oh my God, if they come today, what am I gonna do?' \"\nI first met Limes outside the courtroom of the Landlord and Tenant Branch of the Superior Court of the District of Columbia, where tenants go when they've been sued by their landlords for not paying rent.\nThat day, a judge ordered a writ of restitution — directions for the marshals to begin eviction proceedings.\nLimes wore a black apron and purple shirt with the logo of a local grocery store where she works part time. When the judge asked why she owed more than $3,300, Limes said she was struggling to make ends meet.\n\"And basically he was like, 'So the only reason why you're behind on rent is because you can't pay rent?' And I was like, 'Yeah, that's the only thing,' and he was just looking at me like, he said, 'We'll send out a writ,' \" Limes recalls. \"And I was just like, 'Wow, like, is there any way I can get some help?' \"\nLimes is among the hundreds of thousands of Americans who face eviction because they simply can't afford their rent. One in four low-income families pays more than 70 percent of its income on rent, leaving little money for other bills and almost no room for an unexpected expense.\nAccording to the Harvard Research Center's State of the Nation's Housing report in 2015, rising rents and stagnating wages nationwide have contributed to a record number of cost-burdened renters — a situation that is worsened by the shortage of affordable housing for low-income tenants.\nLiving On A Tight Margin\nLimes lives with her 4-year-old son and 8-year-old daughter. Her ailing father had been living with her, too, until he died recently.\n\"I also have my niece. She's 18 and she's been going from house to house,\" Limes says. \"So I told her just come stay with me until she get on her feet.\"\nTheir apartment feels like someplace people are just passing through, with empty walls and plastic bins stuffed with clothes on the floor.\nLimes is pretty typical of those who end up in rent court: She's a single mother, juggling things on her own. She says the father of one of her children is in prison and the other is a deadbeat dad. She lost a full-time job last October; her new job is only 20 hours a week. At $10.50 an hour, that's not nearly enough to cover her $1,275 monthly rent.\n\"They're living on a very tight margin,\" says Judge Judith Bartnoff, who presides over the D.C. court that includes the Landlord and Tenant Branch. \"And if something happens, if somebody gets sick, if somebody gets hurt, if somebody loses their job, then it throws the whole system off.\"\nShe thinks many of the thousands of tenants who come before the court each year can afford their rent at some point — but just barely.\nEnlarge this image toggle caption Brandon Chew/NPR Brandon Chew/NPR\nEviction Means Losing More Than Just A Home\nThe hallway outside the landlord tenant courtroom is routinely packed with renters who are trying to work out deals with their landlords' attorneys. Some offer payment plans so a tenant can catch up, but many renters just agree to move out. Or, like Limes, they resign themselves to eviction, which can make things worse.\n\"It really drives people deeper into a state of hardship,\" says Matthew Desmond, a Harvard sociologist who spent more than a year following low-income renters and landlords in Milwaukee that he details in his new book, Evicted.\nDesmond says evictions are not just a result of poverty but a cause. It makes lives more unstable. People don't just lose their homes in evictions, he says.\n\"But you often lose your neighborhood and your school. Children often have to switch schools and miss long stretches,\" he says.\nFamilies often end up in areas with more crime and poorer-quality housing, Desmond adds.\nLimes says she is worried about that. She wants to move, but even studio apartments are $800 a month, which she can't afford.\n\"It's like I'm stuck here. I don't know where else to go. I don't want to go to the shelter. I'm trying to get help. But I can't find help anywhere,\" she says.\nShe did get some temporary aid from the city a few years ago, but permanent housing assistance is almost impossible to find. Limes applied eight years ago for housing vouchers to help cover her rent.\n\"And nothing. I'm still what, 1,000 something,\" she says.\nThat's No. 1,000 on the waiting list. In fact, the city recently shut down the list because more than 70,000 families were on it. Only one in four people in the U.S. who qualify for public housing or vouchers actually gets them.\nEnlarge this image toggle caption Brandon Chew/NPR Brandon Chew/NPR\nNo Homeless Shelter ... For Now\nFive weeks after my first visit with Limes, furniture was piled on the curb outside her apartment complex. There were mattresses, CDs, a flat-screen TV. Two other families had been evicted that day. But Limes was still waiting, worried that she and her kids would end up back in the city's homeless shelter where they were in 2012.\n\"It was hard, and it's like it was disgusting. And I don't want to put my kids in that situation again,\" she says.\nA week later, Limes got a reprieve — but only a temporary one: She received her earned income tax credit check from the IRS and was able to pay off what she owed.\nShe still has to worry about next month's rent.\nThis story was produced for broadcast by Evie Stone.","url":"https://www.npr.org/2016/03/29/471347542/living-from-rent-to-rent-tenants-on-the-edge-of-eviction"}
