{"authors":["John Hayward"],"date_download":"2018-10-30 18:14:08","date_modify":"2018-10-30 18:14:08","date_publish":"2016-09-23 15:46:16","description":"On Friday's edition of Breitbart News Daily on SiriusXM, retired Lt. Gen. Michael Flynn took a moment to discuss how his own personal experience with Donald Trump led him to become a supporter and then an adviser to Trump's presidential campaign, despite being a lifelong Democrat. | Radio","filename":"data/vaneerConsumption/LtGenMichaelFlynnTrumpWillingtoTakeaBagofYouKnowWhatfromObamaandClintonBecauseHeBelievesDeeplyintheFutureofAmerica.json","image_url":"https://media.breitbart.com/media/2016/07/wi/ap_ap-photo-88-e1470501100127.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/radio_2016_09_23__1540923248.html","title":"Lt. Gen. Michael Flynn: Trump Willing to Take a ‘Bag of You-Know-What’ from Obama and Clinton Because He ‘Believes Deeply in the Future of America’","title_page":"Lt. Gen. Michael Flynn: Trump Willing to Take a ‘Bag of You-Know-What’ from Obama and Clinton Because He ‘Believes Deeply in the Future of America’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Flynn explained:\nNumber One, he’s very serious about this country. He’s a huge patriot. He loves this country. He has a family, and he’s got children, and he wants to see their lives and the kind of country he was raised in where there’s enormous opportunity.\nSo for those in the inner city — you know, the Hispanic-American community, the African-American community — I grew up in a community of sort of lower-middle-class. My father was a sergeant in the Army. He got out and he became a teller in a bank with nine children. I’m one of nine kids. We were taught to work hard. If you work hard; you can do great things. That was sort of the Democratic principles at that time.\nNow we have this dependency. We have got to lift this lid of dependency off of America, particularly the American inner cities, and rebuild what it is that we know we can do. We need to have this. We will not last as a country if we do not lift off this lid of dependency on the federal government that the progressive movement, the current Democratic Party, Hillary Clinton, and the ilk around her want to basically put us under. We cannot have that.\nDonald Trump, again, he represents a new leader that our country needs. And boy, I’ll tell you what, the world needs him too because the world’s a mess.\nAnd he knows. The one thing that Donald Trump knows is, he knows he is going to take on, he’s going to be given a bag of you-know-what by this current Administration, and that included four years of Hillary Clinton as the Secretary of State, with just leaving a mess around the world in all sorts of places, from the Asia-Pacific theater to the Eastern European theater of operations where Russia’s dominating, to the Middle East and North Africa, which is just a total disaster.\nDonald Trump knows this. He is taking this on because he believes deeply in the future of America. One of the big ways he’s doing it, I believe, and one of the strengths of Donald Trump is his ability to get our country’s economic engines going again, which we must have.","url":"https://www.breitbart.com/radio/2016/09/23/lt-gen-michael-flynn-trump-willing-take-bag-know-obama-clinton-believes-deeply-future-america/"}
