{"authors":[],"date_download":"2018-10-22 20:52:08","date_modify":"2018-10-22 20:52:08","date_publish":"2014-05-04 21:28:14","description":"An outrageous mix of lucha libre and scantily clad ladies called Lucha VaVoom has taken L.A. by storm, and has now taken its show on the road.","filename":"data/vaneerConsumption/LuchaVaVoomIfYouDontKnowWhatItIsYoullKnowSoon.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/419476/140504-lucha-vavoom-jms-1934_d7fc2dd3bfbb82dfdddfad59d2f9f7e1.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_lucha-vavoom-if-you-dont-know-what-it-youll-know-n96801_1540241528.html","title":"Lucha VaVoom? If You Don't Know What It Is, You'll Know Soon","title_page":"Lucha VaVoom?  If You Don't Know What It Is, You'll Know Soon ","title_rss":"NULL","source_domain":"nbcnews.com","text":"New York has Broadway. Las Vegas has Cirque du Soleil. Mexico has Lucha Libre wrestling. Only Los Angeles mashes the whole thing together, then leavens it with ample doses of loud, blaring rock music, flashing lights, a celebrity guest performer and a cadre of burlesque-style comedians, said Diane Christensen of Los Angeles.\n\"This is everything about LA that you love,\" said Christensen, adding, \"People get dressed up to come here.\nAll of this madness was born about a dozen years ago on the set of a movie about genetically enhanced baboons that was filmed in Mexico.\n\"It was a really bad film,\" recalled Liz Fairbairn, who was the movie's costumer. But it did introduce her to a luchador who became her boyfriend.The love affair with the wrestler didn't last, but the one with wrestling did.\nSoon Fairbairn decided she wanted to put on traditional Lucha Libra matches for gringos like herself. But she wondered if the hipster crowd of LA artists and film people she hangs with would buy that.\n\"Nobody ever went broke presenting lovely girls,\" said her friend Rita D'Albert, a choreographer who joined her as co-producer.\nOvernight, Lucha VaVoom was a hit, selling out a dozen or so shows a year at the Mayan, a majestically restored old theater in a seedy section of downtown.\nNow they are taking their show on the road, going to Chicago and even Japan.\n--Reporting by the Associated Press","url":"https://www.nbcnews.com/news/latino/lucha-vavoom-if-you-dont-know-what-it-youll-know-n96801"}
