{"authors":["Rebecca Lawrence","Sharnaz Shahid For Mailonline"],"date_download":"2018-10-23 03:47:20","date_modify":"2018-10-23 03:47:20","date_publish":"2016-01-29 18:57:56","description":"She likes to motivate her fans with a mid-workout selfie. But on Friday, Lucy Mecklenburgh decided to up the sauciness of her typical social media offerings, stripping down to a lacy black bra.","filename":"data/vaneerConsumption/LucyMecklenburghstripsofftoalacyblackbraassheflauntshergymhonedbody.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/30B4EFD300000578-0-image-a-35_1454096444488.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423247_Lucy-Mecklenburgh-strips-lacy-black-bra-flaunts-gym-honed-body-sizzling-selfie_1540266440.html","title":"Lucy Mecklenburgh strips off to a lacy black bra as she flaunts her gym-honed body","title_page":"Lucy Mecklenburgh strips off to a lacy black bra as she flaunts her gym-honed body | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She likes to keep her fans motivated by sharing her workout selfies.\nBut on Friday, Lucy Mecklenburgh decided to up the sauciness of her typical social media offerings, stripping down to a lacy black bra as she flaunted her gym-honed body in its entirety.\nExplaining that she was shooting Polaroids for her agency, Select Model Management, the 24-year-old dazzled in the sultry snap, flashing an impressive amount of cleavage as she twiddled her chestnut coloured locks between her fingers.\nScroll down for video\nBra-vo! On Friday, Lucy Mecklenburgh, 24, decided to up the sauciness of her typical social media offerings, stripping down to a lacy black bra as she flaunted her gym-honed body in its entirety\nWith her toned abs on full display, it was clear the star had been putting in the hours at the gym to sculpt her lithe frame.\nSporting minimal make-up, the former TOWIE star looked surprisingly fresh faced following her early morning workout.\nAlways keen to squeeze in a fitness session wherever possible, Lucy had shared another pre-workout selfie on Thursday as she revealed she'd scheduled training in the early hours of the morning.\n'6am start today!' she posted. 'Workout then on to a photoshoot. Looking forward to today!!!'\nDedicated: Always keen to squeeze in a fitness session wherever possible, Lucy had shared another pre-workout selfie on Thursday as she revealed she'd scheduled training in the early hours of the morning\nDonning a black sports bra for the session, the brunette beauty hinted at her cleavage whilst baring her make-up free face in the snap.\nJust two days previously, Lucy had decided to share yet more workout selfies, adding another snap to her Instagram page on Tuesday.\nThe reality star, who runs a successful fitness website, proudly flaunted her tiny waist and slender frame as she posed in front of a mirror while perched on top of a bench.\nFitness fan: Lucy Mecklenburgh showed off her slender frame in yet another workout selfie on her Instagram page on Tuesday\nDressed appropriately in a plunging sports bralet and cropped leggings, it was clear to see the 24-year-old’s training has certainly been paying off.\nThe night before, Lucy looked incredible in a black halter crochet dress when she attended a movie screening for Eating Happiness in London.\nThe intricate number was see-through in parts and showed off a sexy slip which had a sweetheart neckline which showed off her ample assets.\nToned: The former TOWIE star, who runs a successful fitness website, proudly flaunted her tiny waist and slender frame as she posed in front of a mirror\nWith a peplum hem drawing attention to her tiny waist, Lucy's hourglass frame looked phenomenal in the figure-hugging dress.\nMeanwhile, her sighting at the fancy event comes soon after she returned to the UK after celebrating the New Year in Thailand with handsome beau Louis Smith.\nThe stars, who met last August after appearing on the BBC show Tumble, have been dating since December 2014 and have been inseparable ever since.\nTowards the end of last year, the former Tumble contestant opened up to MailOnline about her relationship, gushing: 'We're really happy.'\nJust the ticket! The night before, the 24-year-old showed off the results of her intense fitness regime when she attended a movie screening for Eating Happiness at the Mondrian hotel in London\nTalking about the more serious side of things, she said that the couple are in no rush to settle down, saying they've found a perfect balance in life - something she struggled to do with her ex Mario Falcone.\n‘I don’t feel any pressure to settle down at all, I kind of love my life the way it is, I love that I don’t get to see Louis every day,’ she explained.\n‘At the moment, we’re keeping it the way it is [living apart],' she said. 'Maybe [we'll move in together] in the future.'\nHalterback girl! She looked incredible in a black halter crochet dress which clung to all the right places. The intricate number was see-through in parts and showed off a sexy slip","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423247/Lucy-Mecklenburgh-strips-lacy-black-bra-flaunts-gym-honed-body-sizzling-selfie.html"}
