{"authors":["Rosie Narasaki"],"date_download":"2018-10-30 23:52:15","date_modify":"2018-10-30 23:52:15","date_publish":"2014-08-12 22:00:02","description":"Lucy Hale's collaboration with Hollister (their first celebrity-designed collection, ever!) launched last week, just in time for back to school. According to Hollister, it's \"inspired by So-Cal\" — and as such it's not exactly Rosewood-approved.…","filename":"data/vaneerConsumption/LucyHalexHollistervsPLLxAeropostaleWhichIsTheBetterCollection.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/a523c473-dfa4-4046-937e-c9c7aec11c48.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35468-lucy-hale-x-hollister-vs-pll-x-aeropostale-which-is-the-better-collection_1540943535.html","title":"Lucy Hale x Hollister vs. 'PLL' x Aeropostale: Which Is The Better Collection?","title_page":"Lucy Hale x Hollister vs. 'PLL' x Aeropostale: Which Is The Better Collection?","title_rss":"NULL","source_domain":"bustle.com","text":"Lucy Hale's collaboration with Hollister (their first celebrity-designed collection, ever!) launched last week, just in time for back to school. According to Hollister, it's \"inspired by So-Cal\" — and as such it's not exactly Rosewood-approved. Perfect, because that makes for less direct competition for Pretty Little Liars x Aeropostale collaboration by costume designer Mandi Line: Her newest collection just launched mere days before Hale's Hollister efforts did.\nSure, the two collections are sure to be consumed by a similar audience (because, really, it's a quite narrow demographic that both shops at stores like Hollister and Aeropostale and watches the show), but at least it caters to different fashion senses. Yes, the two collections are as different as Lucy's on and offscreen styles (can you imagine Lucy hitting the road for her Road Between tour in Aria's rocker-inspired duds?). Think flowy summer camis and well-worn lacy sweatshirts, as opposed to faux leather-trimmed ponte mini skirts and studded denim vests.\nEven so, there's a little overlap — they are both products of the latest trends, after all — so we can safely expect to see iterations of popular conventions such as the ubiquitous crop top and circle skirt. With that in mind, let's take a look at the two capsule collection's respective (and very distinct) takes on the same concepts!\nSummer Dress vs. Summer Dress\nThis one has a lovely flowy skirt and adorable tiny floral print.\nAnd this one is similarly flowy, but with a punky plaid-and-roses twist.\nI'm giving the edge to Hollister here — I'm a sucker for delicate florals. Hollister 1, Aeropostale 0\nStatement Pants vs. Statement Pants\nThese sweatpants look comfortable and fetchingly boudoir-esque with their pink roses, but...\n... these plaid leggings are undeniably cooler. Hollister 1, Aeropostale 1\nCrop Top vs. Crop Top\nInvokes nostalgic imagery of the palm tree-studded Santa Monica pier.\nA striking blue made even more striking by a spiky statement necklace and... er, interesting pants.\nI'm a Santa Monica native, so I have to give this one to Hollister. Hollister 2, Aeropostale 1\nRose Printed vs. Rose Printed\nUm, adorable. I've also recently turned the corner on rompers (thanks, Taylor Swift!), so I might just be inclined to give this the win...\n... then again, there's something special about this je ne sais quoi -infused sheer button down. Hollister 2, Aeropostale 2\nSweater vs. Sweater\nCute again, but the sweater is undeniably pajama-adjacent, especially when paired with the aforementioned floral pants.\nAgain, this studded number is cool. Cool-cool-cool. Hollister 2, Aeropostale 3\nSo with careful consideration, I have to declare myself as more of a PLL x Aero fan. After all, it is helmed by a professional in the field (though no shade is intended towards Ms. Hale; her clothes are very cute-sweet), and I'm a fan of its edginess and courageousness when it comes to more out-there pieces.\nThen again, I'm hardly the target demographic.\nImages: Hollister (5), Aeropostale (5)","url":"https://www.bustle.com/articles/35468-lucy-hale-x-hollister-vs-pll-x-aeropostale-which-is-the-better-collection"}
