{"authors":["Lily Waddell","Rebecca Lawrence For Mailonline"],"date_download":"2018-10-23 04:57:01","date_modify":"2018-10-23 04:57:01","date_publish":"2017-03-16 15:59:42","description":"She has built up quite a repertoire for her exercise empire since she left TOWIE. The TV starlet has taken her fitness regimes to the next level as she added a whole series of new intense workouts.","filename":"data/vaneerConsumption/LucyMecklenburghflauntsflatstomachinInstagrampost.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54B24600000578-0-image-a-12_1489673657102.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320452_Lucy-Mecklenburgh-flaunts-flat-stomach-Instagram-post_1540270621.html","title":"Lucy Mecklenburgh flaunts flat stomach in Instagram post","title_page":"Lucy Mecklenburgh flaunts flat stomach in Instagram post | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She has built up quite a repertoire for her exercise empire since she left TOWIE.\nAnd Lucy Mecklenburgh showed off her ample assets and incredibly taut abs in a very sexy Instagram on Thursday.\nThe 25-year-old looked incredible as she posed wearing a tiny figure-hugging black sports bra.\nWork it out! Lucy Mecklenburgh showed off her ample assets and taut tummy in a tiny sports bra on Instagram on Thursday\nThe adrenaline junkie showed off the fruits of her labour as she put her well earned abs and flat stomach on display.\nShe also sported grey and white patterned leggings perfect for her vigorous exercises sessions by Ellesse.\nThe reality TV star pulled off a natural look with a neutral makeup colour palette as she wore her chocolate locks in a bob letting her tresses loose around her face.\nBeach babe: Lucy regularly posts pictures of her incredible figure on the social networking site\nAnd the busty model was keen to share the secrets to her sought after figure.\nThe ex TOWIE babe revealed she had been working on a number of insane new workouts including Pilates and cardio.\nShe posted the snap, saying: 'Started today with some @resultswithlucy. Pilates with Lisa & cardio/legs with Liz.\n'Time to stretch & get ready for a busy day.\nTop tips! Fans flooded her Instagram posts with compliments as they praised the rewards of her intense workouts\n'I've added lots of insane new workouts to Ondemand. Enjoyyy!!!!' (sic)\nThe hot snap has already collected more than 3,000 likes as her fans have flooded her Instagram post with compliments.\nOne follower said: 'I'd love to know how you changed your career into fitness as I really want to do the same!'\nAn admirer wrote: 'Miss Lucy...Lookin rather sporty.' (sic)\nAnother added: 'Beautiful lady fitness body photo.'\nOther admirers complimented her 'incredibly' beautiful looks and one even picked up on her lovely sports top.\nBut the ex TOWIE star doesn't just share a series of fitness pictures with her legion of 1.1million followers.\nIn February following her glam trip to Dubai, the Essex beauty posted a throwback snap showing off her enviable figure in a tiny red bikini.\nThe scanty two piece offered a look at her impeccably toned abs and perky bust as she smiled down the lens.\nWhile relaxing on the beach under the red-hot sun, the tanned beauty enjoyed sipping delicious cocktails.\nThe reality starlet turned fitness guru captioned the shot: 'Summer bodies are made in winter girlies!!!'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320452/Lucy-Mecklenburgh-flaunts-flat-stomach-Instagram-post.html"}
