{"authors":["Adam Shergold For Mailonline"],"date_download":"2018-10-22 23:47:57","date_modify":"2018-10-22 23:47:57","date_publish":"2017-03-16 07:50:09","description":"Luis Enrique will leave Barcelona 'with a trail of glory' even if they fail to win anything this season, according to Vicente del Bosque. The 46-year-old steps down from the post this summer.","filename":"data/vaneerConsumption/LuisEnriquewillleaveBarcelonawithtrailofglory.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/07/3E15B57A00000578-0-image-a-11_1489650528334.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319132_Luis-Enrique-leave-Barcelona-trail-glory_1540252077.html","title":"Luis Enrique will leave Barcelona 'with trail of glory'","title_page":"Luis Enrique will leave Barcelona 'with trail of glory' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Luis Enrique will leave Barcelona 'with a trail of glory' even if they fail to win anything this season, according to Vicente del Bosque.\nThe 46-year-old, who has guided the club to two La Liga titles, two Copa del Rey triumphs and the Champions League in 2015, will step down this summer.\nBarcelona remain in contention for a Treble of trophies - they are two points behind Real Madrid at the top of La Liga, play Alaves in the Copa del Rey final, and are into the quarter-finals of the Champions League.\nLuis Enrique will leave a glowing legacy at Barcelona, according to Vicente del Bosque\nLuis Suarez, Lionel Messi and Neymar celebrate Barcelona's 2015 Champions League win\nFormer Real Madrid and Spain manager Vicente del Bosque had warm words for Enrique\nAnd former Real Madrid and Spain manager Del Bosque, who won a host of trophies in his career, believes Luis Enrique's legacy is secure.\nHe told RAC1: 'Beyond the three titles which he can still win this season, Luis Enrique has already won so many titles that he will leave a permanent legacy.\n'He's given such high levels of performance to the club as both a coach and a player. He leaves with a trail of glory.'\nLuis Enrique runs onto the pitch to celebrate after Barcelona's incredible win over PSG\nThe manager is trying to guide Barcelona to another triple crown of trophies this season\nIn addition to his managerial success, former midfielder Luis Enrique won two league titles, two Spanish Cups and the European Cup Winners' Cup as a player with Barcelona.\nHis successor, likely to be either Sevilla boss Jorge Sampaoli or Athletic Bilbao's Ernesto Valverde, will have big shoes to fill.","url":"https://www.dailymail.co.uk/sport/football/article-4319132/Luis-Enrique-leave-Barcelona-trail-glory.html"}
