{"authors":["Real Vision Tv"],"date_download":"2018-10-30 22:52:17","date_modify":"2018-10-30 22:52:17","date_publish":"2016-12-10 00:00:00","description":"Josh Wolfe, co-founder of Lux Capital, a Silicon Valley venture capital firm focused on backing scientists and entrepreneurs, on the future of investing.","filename":"data/vaneerConsumption/LuxCapitalJoshWolfeRealVisiononventurecapitalinvesting.json","image_url":"https://amp.businessinsider.com/images/584b56ceca7f0c43228b4a1a-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_lux-capital-josh-wolfe-real-vision-on-venture-capital-investing-2016-12_1540939937.html","title":"Lux Capital Josh Wolfe Real Vision on venture capital investing","title_page":"    Lux Capital Josh Wolfe Real Vision on venture capital investing - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Members of the media and TEPCO employees walk down the steps of a fuel handling machine on the spent fuel pool inside the No.4 reactor building in Fukushima Thomson Reuters For the venture capitalists spearheading innovation in Silicon Valley, the speed of development is so fast that it's almost impossible to say what the next big breakthrough technology will be. But they have a pretty good idea where they will find it.\nJosh Wolfe is the co-founder and Managing Partner of Lux Capital, the Silicon Valley venture capital firm focused on backing scientists and entrepreneurs to solve the world's toughest problems. He literally cleaned up as his start-up Kurion, which uses advanced robotics and chemistry to remove nuclear waste, was the only US company on the ground in Fukushima, removing 99% of the radioactive cesium and strontium from that disaster.\nFrom a $3 million initial investment, Kurion was sold to Veolia for $400 million this year, while his venture into metamaterials with Bill Gates, Kymeta, is making science fiction science fact, replacing giant space antennas with something as flat as a magazine or iPad.\n\"I like to say that I have 100% certainty that I will be investing in some cutting edge things in the next one or two years. And I have close to 0% certainty what those things will be,\" Wolfe said in an interview with Real Vision TV. \"But I have another close to 100% certainty of where they will come from. And it's at the edge of the already cutting edge companies that we're in.\"\nAsian Money Flooding VC, Replacing \"Dumb\" Middle East Capital\nOne of the most interesting dynamics at present in the VC market is the disconnect between the largest ever year of capital deployment in the sector, but at the same time being the worst year in history for IPOs.\nGreat companies will still go public, Wolfe said, while alternatives are secondary trades to investors or an acquisition. Looking at acquisitions globally, Wolfe outlines a transient phenomenon, because the money from Asia, is return seeking and arguably seeking amnesty as well.\n\"The amount of Asian money flooding into venture is huge,\" Wolfe said. \"Five or seven years ago, the sort of dumb money that people were looking for in the valley, historically, was let's go to the Middle East. And I think that has shifted, and you see serious players like SoftBank, making huge acquisitions and arguably trying to turn themselves into a Berkshire,\" Wolfe said.\nJack Ma. Shu Zhang/Reuters \"The amount of money that they're deploying is really large. Same thing for Alibaba, Tencent, and some of the other players in China,\" he adds. \"China, Japan, Korea, I think are huge forces of money that are coming into this market. In part, because they want to get out of their native currencies and I think in part, for strategic reasons it makes sense to invest in some of these companies. So trade sales and M&A to some of the sovereign funds and some of the Asian players, I think, is going to be a big exit path when IPOs are scarce.\"\nThe Future is Here - It's Just Not Evenly Distributed\nFor a fast paced venture capitalist with money flooding into the latest technologies, in what is essentially a slow growth world, Wolfe's perspective is firmly fixed on the future as he keeps one or more steps ahead of everybody else.\n\"There's two quotes about the future that I love,\" Wolfe said, \"One is, the future's here, it's just not evenly distributed. The other being, the best way to predict the future is to invent it. And the people that are inventing the future are also almost by definition the people that asymmetrically know what's going to happen before everybody else does. And in fact, our argument is we're always trying to find people that are literally at the cutting edge.\"\nForget juvenile, desktop 3D printers, Wolfe says. Look instead at some of the metal 3D printers and textile innovations. \"These are the kinds of things that you can shift back in a smaller footprint and actually have people running and get the kind of productivity yield on a geographic basis that's localized to certain major industrial cities.\n\"You look at the real time delivery, autonomous vehicles able to do some of this stuff,\" he adds. \"You will see a bike lane with autonomous vehicles that are doing 24-hour deliveries of certain things, whether it's drugs from your local CVS or food. That stuff will automatically be brought into your apartment with access controls.\"\nAlso making the future a reality are companies like Auris, doing tiny robotic surgeries and secretive autonomous vehicle company Zoox, which Wolfe invested in two years ago. The cars' exterior features LIDAR, lasers, optics and thermal vibrational sensors, running on special GPUs (Graphics Processing Units) made by Nvidia, which you would find in an X-Box or Playstation 4\nThe Most Valuable Investments Will Rot Your Brain\n\"They say that the most dangerous words in investing are this time is different. I actually think the most valuable words in anticipating what the big things in the future are going to be now are parents that say, it'll rot your brain,\" Wolfe said.\n\"It'll rot your brain literally predicted every major $10 billion industry from the '50s on,\" he said, with television and rock 'n roll, then the early internet chat rooms and the internet, with video games in the 2000s. \"The biggest and most important jobs today where there's very high demand, drone pilots, robotic surgeons. They all learned at the heels of playing PlayStation and XBox. So wherever you hear parents bemoaning it will rot your brain, I think it's predictive of the next $10 billion industry of Generation X.\"","url":"https://www.businessinsider.com/lux-capital-josh-wolfe-real-vision-on-venture-capital-investing-2016-12"}
