{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 18:07:23","date_modify":"2018-10-30 18:07:23","date_publish":"2016-10-02 19:00:05","description":"A Lyft driver who was trying to help a drunk passenger in his car was struck and killed by a vehicle in a hit-and-run incident.","filename":"data/vaneerConsumption/LyftDriverKilledinHitandRunWhileHelpingSickPassenger.json","image_url":"https://media.breitbart.com/media/2016/10/Screen-Shot-2016-10-02-at-11.57.44-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_10_02__1540922843.html","title":"Lyft Driver Killed in Hit-and-Run While Helping Sick Passenger","title_page":"Lyft Driver Killed in Hit-and-Run While Helping Sick Passenger","title_rss":"NULL","source_domain":"breitbart.com","text":"A Lyft driver who was trying to help a drunk passenger in his car was struck and killed by a vehicle in a hit-and-run incident early Saturday morning on State Route 94 in San Diego.\n“I saw two guys jumping the fence over there,” a man named Abraham told local ABC News affiliate in San Diego KGTV. “The guys looking us and they run again over here. Run all the way down.”\nThe incident took place around 1:00 a.m on Saturday morning.\nAccording to NBC affiliate in San Diego NBC 7, California Highway Patrol and the medical examiner said the victim was Henry O. Reyes, 41.\nSaturday would have been Reyes’s 41st birthday.\nReyes was reportedly transporting three women who were out drinking Friday night when one of them reported she was feeling sick and began throwing up. He pulled over between 25th and 28th Street to help her, when a silver Toyota struck his red Kia from behind, killing him and sending the three female passengers to the hospital.\nTwo of the women wound up at UCSD, the other at Mercy.\nTwo men were in the silver vehicle, which wound up rolling down an embankment on the freeway near the fatal crash scene. They reportedly fled the scene on foot along with a dog, but were located and apprehended after their brief getaway by CHP officers and the San Diego Police Department’s ABLE helicopter at 28th and “G” streets.\nA memorial was created at the cell phone lot at San Diego International Airport, where Lyft drivers wait for passengers.\nMemorial for the #Lyft driver who was killed this weekend in a hit and run #SanDiego #NBC7 pic.twitter.com/804oM43fw0 — Ramon Galindo (@RamonGalindoNBC) October 2, 2016\nAnyone with information about the crash is asked to contact authorities.\nTips can be sent to the Diego Police Department be calling (619) 531-2000.\nFollow Adelle Nazarian on Twitter and Periscope @AdelleNaz","url":"https://www.breitbart.com/local/2016/10/02/lyft-driver-killed-in-hit-and-run-while-helping-sick-passenger/"}
