{"authors":[],"date_download":"2018-10-30 19:11:11","date_modify":"2018-10-30 19:11:11","date_publish":"2018-08-10 21:21:54","description":"Lyft, the ridesharing company, has opened a recording studio for its metro Atlanta drivers inside its main office off Howell Mill Road. At the launch party, a few drivers performed with Atlanta’s Yung Joc, the man behind June 2006’s absolute banger “It’s Goin’ Down.”","filename":"data/vaneerConsumption/LyftopensrecordingstudioforitsmetroAtlantadrivers.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/10/Images/Lyft1_2370x1581.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_lyft-opens-recor_034dcab7035bc8fab7f4fe9c2e080e3d__1540926671.html","title":"Lyft opens recording studio for its metro Atlanta drivers","title_page":"Lyft opens recording studio for its metro Atlanta drivers","title_rss":"NULL","source_domain":"ajc.com","text":"If liner notes still existed, Lyft might appear in some.\nThe ridesharing company has opened a recording studio for its metro Atlanta drivers inside its main office off Howell Mill Road.\n“There’s a lot of artists within the driver community,” Sam Bond, general manager of Lyft in the southeast, told The Atlanta Journal-Constitution on Friday.\nSomeone on their team was thinking up ideas of how to best help drivers and heard about Lyft in Detroit renting out studio time for its drivers. The southeast team thought to do one better.\nREAD | Rhythm and hashbrowns: 10 times Waffle House is mentioned in rap songs\nREAD | 12 hip-hop landmarks to visit in metro Atlanta\nThis is the first dedicated Lyft recording studio anywhere in the country.\nIt’s pretty barebones: An installed microphone and an iPad in a soundproof room.\nThe studio is free for drivers to use, and so far, about 20 of them have done so.\nBond said they reached out to drivers to see who’d want to perform at the launch party in late June. They got more than 100 demos.\n\"It's Goin' Down\" in this photo with Yung Joc (dancing right) at the launch party for the new Lyft recording studio in Atlanta.(Provided by Lyft)\n“The quality of those is really incredible,” he said, noting that most were from hip-hop and rap artists.\nAt the launch party, a few drivers performed with Yung Joc, the Atlanta rapper behind June 2006’s absolute banger “It’s Goin’ Down.”\nBond ensured that all of the artists own their music. This is for artists who “in many cases need a shot,” he said.\nOther Lyft hubs in the country are looking into the model.\n“We don’t see this ending on the ground here in Atlanta,” Bond said.\nFollow The Atlanta Journal-Constitution on Facebook and Twitter","url":"https://www.ajc.com/news/local/lyft-opens-recording-studio-for-its-atlanta-drivers-make-tracks/tM4bim1VQaoefhUwcesFPP/"}
