{"authors":["Amy E. Robertson"],"date_download":"2018-10-22 21:47:44","date_modify":"2018-10-22 21:47:44","date_publish":"2017-04-11 00:00:00","description":"For Christians and Muslims in the Middle East, maamoul is an essential part of Easter and Eid respectively. Stuffed with date paste or nuts, this buttery cookie dates back to ancient Egypt.","filename":"data/vaneerConsumption/MaamoulAnAncientCookieThatUshersInEasterAndEidInTheMiddleEast.json","image_url":"https://media.npr.org/assets/img/2017/04/10/maamoul1_wide-1f60041dd8681662f51a3503717835cabb00f562.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thesalt_2017_04_11_522771745_maamoul-an-ancient-cookie-that-ushers-in-easter-and-eid-in-the-middle-east_1540244864.html","title":"Maamoul: An Ancient Cookie That Ushers In Easter And Eid In The Middle East","title_page":"Maamoul: An Ancient Cookie That Ushers In Easter And Eid In The Middle East : The Salt : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Maamoul: An Ancient Cookie That Ushers In Easter And Eid In The Middle East\nEnlarge this image toggle caption Amy E. Robertson for NPR Amy E. Robertson for NPR\nBe it Easter or Eid, holidays in the Levantine region of the Middle East are incomplete without a shortbread cookie called maamoul. Stuffed with date paste or chopped walnuts or pistachios, and dusted with powdered sugar, these buttery cookies are the perfect reward after a month of fasting during Ramadan or Lent.\nThe dough is made with wheat flour or semolina (or a combination of the two), then pressed into special molds, traditionally carved in wood. And the fillings are fragrant with rosewater or orange blossom.\nEnlarge this image toggle caption Amy E. Robertson for NPR Amy E. Robertson for NPR\nIn the weeks leading up to Easter, the Beirut sweet shop Helwayat Al-Salam becomes a veritable factory of maamoul. Owner Mitri Hanna Moussa dips pitted dates into rosewater, then passes them through a meat grinder to make a paste. Mitri's mother, Samira, a small, older woman with wrinkled hands but perfectly manicured nails, sits at a makeshift table sorting pistachios. She makes sure that neither a speck of shell nor a single shriveled pistachio makes its way into their renowned cookies. Once all ingredients are ready, Mitri and his assistant pinch off balls from their mountain of semolina dough. They shape the dough balls into small cups which they stuff with either date paste, pistachios or walnuts.\nThen, Samira presses each stuffed dough ball into an antique wooden mold, which she thwacks against a wooden stump to toss out a perfectly formed cookie, ready to be baked. In a matter of minutes, the three of them prepare dozens more.\n\"I also make maamoul in the winter, but it's a must for Easter\" says Mitri. In a country where many Christians give up dairy, sugar and meat during Lent, the 40-day period of penitence, the luxurious cookies are a welcome reward at Easter.\nEnlarge this image toggle caption Amy E.Robertson for NPR Amy E.Robertson for NPR\nMitri says his father Hanna opened his sweet shop in 1949, on a busy corner in Achrafieh, a predominantly Christian quarter in Beirut. Back then, they didn't even own an oven. So the family would prepare the sweets in their shop and walk them over to the neighborhood baker for baking.\n\"My father bought our oven in 1973 or 1974, and it was already second-hand,\" Mitri says. Like the ramshackle building where Helwayat Al-Salam is housed, the oven bears the scars of Lebanon's civil war, which raged from 1975 to 1990. Mitri points to pock marks on his oven door. \"That is from shrapnel,\" he says. \"There were bombs even right on this same street.\" The family had taken refuge in a bomb shelter, but when they returned to the shop, glass was everywhere. \"We cleaned up and we continued, because it was Easter, and that is very special for us.\"\nMitri makes his maamoul with two kinds of semolina, and adds both rosewater and orange blossom to his walnut and pistachio fillings. He unleashes a blizzard of powdered sugar onto the nut-filled cookies before serving, but never on the date, \"because it's already sweet.\"\nEnlarge this image toggle caption Courtesy of Sawsan Abu Farha Courtesy of Sawsan Abu Farha\nPalestinian-Jordanian food blogger Sawsan Abu Farha, better known as \"Chef in Disguise,\" makes several versions of maamoul, some with both semolina and wheat flour in the crust, others with wheat flour alone. She adds mastic, a sun-dried resin from trees, and mahlab, a spice made from the inner kernels of cherry pits, to her dough. \"Maamoul is usually made a few days before Eid, then stored to be served with Arabic coffee and chocolate to the guests who come during the holiday,\" says Sawsan, who now lives in the United Arab Emirates. \"Plates full of it are also exchanged as gifts between neighbors and relatives.\"\nJust as Easter follows Lent, Eid-al-Fitr is celebrated after Ramadan, the Muslim month of fasting. Eid lasts three days, and according to Sawsan, \"Any house you go into during Eid has maamoul. It doesn't matter if it is homemade or store bought, it just has to be there. Of course, the ladies of the house get extra points if it is homemade and there is the yearly competition of who makes the best maamoul in the family. Recipes are exchanged, cookies are critiqued, it is all part of the Eid fun.\"\nSawsan reminisces fondly about making maamoul with friends and family when she was growing up. She remembers the \"heavenly\" smells of spices and roasted nuts and the fun of those gatherings. \"On the day of making maamoul, everyone is divided into teams,\" she says. \"Some divide the dough into balls, others stuff them, a third team is in charge of pressing them into the molds, and if it is summer, the unlucky team is in charge of baking. They spend hours in front of the hot oven. But since everyone is in such a good mood, chatting, telling stories, and sneaking a taste of the maamoul hot out of the oven, no one minds.\"\nMaamoul, as it's called in Syria, Jordan, Lebanon, Israel and Palestine, goes by kombe in southern Turkey, and as kahk in Egypt.\nKahk seems to be the indisputable ancestor of maamoul, as it's depicted in temple paintings and carvings dating to the Pharaonic era. \"Even now, we pile kahk the same way, like a pyramid,\" says Ahmed Hameed, a tour guide and Egyptologist in Cairo. Like maamoul in other countries, kahk in Egypt is traditional for both Easter and Eid. But in addition to nut fillings, Egyptians also have versions stuffed with agameya (a honey-walnut concoction) and loukoum (Turkish delight).\nHow these cookies came to be associated with Easter and Eid is less certain. \"Some say the cookies are meant to remind you that though fasting is hard, within it is a sweet reward, exactly like maamoul's outer shell is bland but the core is sweet,\" says Sawsan.\nEnlarge this image toggle caption Amy E. Robertson for NPR Amy E. Robertson for NPR\nThe Jewish community in the region also loves maamoul. They eat it during Purim, a holiday that commemorates the salvation of the Jewish people in ancient Persia. It is said that as Queen Esther, heroine of the Purim story, was forced to hide her Jewish origin, \"so the dainty pastry hides the rich nut filling inside.\"\nEvery baker has his or her secret for making the best maamoul. For Sawsan, \"the secret to a great maamoul is a good recipe, with a delicate balance between the ingredients to get a cookie than melts in your mouth yet holds its shape without crumbling. It goes without saying that using high quality dates or nuts is a must because they are really the star of the show in maamoul.\"\nWhen asked for his baking secrets, Mitri laughs. \"You'll find out when you try it!\" he says. He is not ready to reveal his recipe, but does have this bit of baking advice: \"The real secret is that you do it with love. It's in how you do it, how you work the dough, how you bake the cookie. You do it with love.\"\nAmy E. Robertson is a writer currently based in Beirut, Lebanon. Follow her on Twitter.","url":"https://www.npr.org/sections/thesalt/2017/04/11/522771745/maamoul-an-ancient-cookie-that-ushers-in-easter-and-eid-in-the-middle-east"}
