{"authors":["Ben Moshinsky"],"date_download":"2018-10-30 21:34:20","date_modify":"2018-10-30 21:34:20","date_publish":"2016-12-20 00:00:00","description":"Robey Warshaw, a Mayfair-based M&A advisory firm with around 20 employees, made $105 million in fees in 2016, according to figures from Dealogic.","filename":"data/vaneerConsumption/MAboutiqueRobeyWarshawmademorethan105millioninfeesin2016.json","image_url":"https://amp.businessinsider.com/images/56c2013cdd08952c5d8b45a0-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_ma-boutique-robey-warshaw-fees-2016-105-million-2016-12_1540935260.html","title":"M&A boutique Robey Warshaw made more than $105 million in fees in 2016","title_page":"    M&A boutique Robey Warshaw made more than $105 million in fees in 2016 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"LONDON - Robey Warshaw, a Mayfair-based M&A advisory firm with around 20 employees, made $105 million (£85 million) in fees in 2016, according to figures from Dealogic.\nThe firm, set up by former Morgan Stanley and UBS bankers Simon Robey and Simon Warshaw, advised on four mega-deals worth a total of $67 billion (£54.1 million) in 2016 against a backdrop of a cooling M&A market.\nThe boutique is growing fee revenue rapidly. It earned £23.9 million in the year ended March 31, 2015, according to accounts filed last year. The partners didn't draw a salary, but accounts show the \"a profit of £9,414,881 is provisionally attributable\" to the highest-earning member of the firm.\nIn 2016, Robey Warshaw advised Softbank on its £24 billion ($29.7 billion) takeover of chipmaker ARM as well as on the National Grid's sale of a majority shareholding in its UK gas distribution business. The firm declined to comment on the Dealogic data.\nHere's the Dealogic table for global M&A boutiques: Dealogic Meanwhile, total global deal volume dropped to $3.7 trillion (£2.9 trillion) from last year's record high of $4.7 trillion (£3.8 trillion). The dip follows three year-on-year rises.\nHere's how that looks in context: Dealogic UK M&A plunged more than 50% in 2016, as political uncertainty and currency volatility hit dealmaking: Dealogic The value of withdrawn M&A topped $839 billion (£677.9 billion) globally in 2016, the highest since 2008.\n\"Two of the top five $100bn+ withdrawn deals on record, were pulled in 2016, led by Pfizer's $160bn bid for Allergan, withdrawn in April 2016 - the largest withdrawn deal on record,\" Dealogic said.\nThe fourth quarter of 2016 was more promising. The average deal size was $304 million (£245.6 million) - the highest quarterly average on record.","url":"https://www.businessinsider.com/ma-boutique-robey-warshaw-fees-2016-105-million-2016-12"}
