{"authors":["Richard Spillett For Mailonline"],"date_download":"2018-10-23 02:15:31","date_modify":"2018-10-23 02:15:31","date_publish":"2016-01-28 17:04:52","description":"Security guards have been turning away disabled shoppers from the Grosvenor shopping centre in Macclesfield, Cheshire","filename":"data/vaneerConsumption/MacclesfieldsGrosvenorshoppingmallbanswheelchairs.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC7FA300000578-0-image-a-90_1454000537537.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421290_Fury-Macclesfield-s-Grosvenor-shopping-mall-bans-wheelchairs_1540260931.html","title":"Macclesfield's Grosvenor shopping mall bans wheelchairs","title_page":"Macclesfield's Grosvenor shopping mall bans wheelchairs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Wheelchair users and people on mobility scooters have been left furious after a shopping centre banned them from entering due to health and safety rules.\nSecurity guards have been turning away disabled shoppers from the Grosvenor shopping centre in Macclesfield, Cheshire and escorting them into shops with street entrances to stop them entering the mall through other routes.\nThe Draconian step is reportedly due to scooters and wheelchairs being labelled as a 'fire hazard' by local authorities.\nNora Leigh, 93 (left) and Diane Parton (right) are among those barred from entering the shopping centre\nA 93-year-old pensioner says she was escorted from the premises after she tried to go shopping and see her friends earlier this week.\nNora Leigh said: 'This place is our lives. We come here for shopping, for company. It's hopeless.'\nDiane Parton, 51, has staged a protest by the outdoor market, refusing to leave.\nShe said: 'We are being told by staff that the centre failed a fire safety inspection because in an emergency anyone in a wheelchair or scooter in one of the shopping units cannot get out without having to go up or down stairs.\n'I don't know what has changed, but I've been coming here for years without any problem. The disabled and elderly are being discriminated against. It's outrageous.'\nOne shopper, who asked not to be named, was seen remonstrating with security staff after her grandmother was asked to leave.\nShe said: 'I'm fuming. She's an 85-year-old woman and she has been told to leave. She's very upset.'\nThe sign outside the Grosvenor shopping centre in Macclesfield, Cheshire states it is a fire precaution\nThe unpopular measures are said to have been introduced after a safety inspection by Cheshire Fire and Rescue Service.\nA sign posted outside the centre said: 'Following instruction from Cheshire Fire Authority, we regret that we are currently unable to allow access to the Grosvenor Centre for disabled or mobility impaired persons.\n'We are working with our tenants and the Fire Authority to resolve this matter as quickly as possible.'\nTonight Simon Gibbins, Cheshire’s Head of Fire Protection said the move was taken out of concern for the safety of disabled shoppers.\n“We have serious concerns that if a fire was to break out in the Macclesfield Grosvenor Shopping Centre some people would simply not be able to get out,\" he said.\n“We have not prohibited people with disabilities from visiting the centre – we simply need the owners to satisfy us they have effective means in place to ensure the safe evacuation of everyone, particularly those with mobility issues.\n“Cheshire Fire Authority has a duty to ensure that businesses are not putting the public at risk of fire. We have been in extensive discussions with those responsible for this building since Christmas over our concerns and we will continue to work with them to resolve the matter and ensure that the building is safe for all groups of people going forwards.”","url":"https://www.dailymail.co.uk/news/article-3421290/Fury-Macclesfield-s-Grosvenor-shopping-mall-bans-wheelchairs.html"}
