{"authors":[],"date_download":"2018-10-30 21:58:11","date_modify":"2018-10-30 21:58:11","date_publish":"2016-03-10 17:52:37","description":"Macedonia hopes stopping migrants at its border with Greece, which has effectively closed the Balkan route into northern Europe, will help the country join NATO.","filename":"data/vaneerConsumption/MacedoniaHopesResponsibleActionClosingBorderWillWinItSeatAtNATO.json","image_url":"https://media.breitbart.com/media/2016/03/Screen-Shot-2016-03-10-at-17.45.52.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_03_10__1540936691.html","title":"Macedonia Hopes 'Responsible' Action Closing Border Will Win It Seat At NATO","title_page":"Macedonia Hopes 'Responsible' Action Closing Border Will Win It Seat At NATO | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"(Reuters) – Macedonia hopes stopping migrants at its border with Greece, which has effectively closed the Balkan route into northern Europe, will help the country join NATO, Defence Minister Zoran Jolevski said on Thursday.\nMacedonia’s bid to join the defence bloc has been blocked because Athens has disputed the country’s name since Macedonia declared independence from Yugoslavia in 1991, saying it implies territorial claims to a Greek province of the same name.\n“I hope that Macedonia will get its … place at a NATO table. We have shown that we are a responsible member of the international community,” Jolevski said when asked whether Macedonia’s conduct in the crisis could enhance its NATO bid.\nHe told a news conference during a visit to Slovenia the Balkan region would be more stable when more countries from the region join the military alliance. Montenegro was invited to join NATO in December. Bosnia also aspires to become a member.\n“An invitation for Montenegro is a big step forward, we believe an invitation for Macedonia would also be important, as well as the process (on NATO membership) being activated for Bosnia and Herzegovina. That will help the stability and prosperity of southeastern Europe,” Jolevski said.\nJolevski said the Macedonian border with Greece was not completely closed to migrants, but some 14,000 to 15,000 migrants have built up at the border in recent days as Macedonia strictly limits the migrant flow.\nJolevski said the country was coordinating its actions with Serbia, Croatia, Slovenia and Austria.\nHe said Macedonia would continue to prevent illegal migrant crossings of its border with the help of the army, and urged the European Union, other European states and Turkey to find a joint solution for the conflict in Syria.\n(Reporting by Marja Novak; Editing by Alison Williams)","url":"https://www.breitbart.com/europe/2016/03/10/macedonia-hopes-responsible-action-closing-border-will-win-it-seat-at-nato/"}
