{"authors":["Stephanie Linning For Mailonline"],"date_download":"2018-10-23 04:36:42","date_modify":"2018-10-23 04:36:42","date_publish":"2016-01-28 20:40:37","description":"The woman, 65, was arrested in Macedonia after parents installed a secret camera to check if she was mistreating their 10-month-old baby, as the child had unexplained bruises on his body.","filename":"data/vaneerConsumption/Macedonianannyisjailedforshakingbabyafterparentssetupsecretcamera.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/20/30AD4B9500000578-0-image-a-5_1454013546938.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421617_Nanny-jailed-14-months-slapping-shaking-ten-month-old-baby-parents-set-secret-camera-film-Macedonia_1540269402.html","title":"Macedonia nanny is jailed for shaking baby after parents set up secret camera","title_page":"Macedonia nanny is jailed for shaking baby after parents set up secret camera | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"If convicted, faces up to 10 years jail in Macedonia, where abuse took place\nhe is claiming footage was illegally taken and is therefore\nA nanny has been jailed for 14 months after she was caught on camera slapping and violently shaking a baby while shouting, 'sleep, scumbag, shut up!'.\nThe woman, 65, was arrested after parents installed a secret video camera to check if she was mistreating their 10-month-old baby, as the child had unexplained bruises on his body.\nThe nanny, who has not been named, was recorded slapping the child in the face and head and shaking him saying: 'Why are you screaming? Why?'\nShe also said: 'Sleep, scumbag, shut up, you son of a b***h.'\nDespite the video the nanny denied the incident even happened and tried to claim it was illegally taken and was therefore irrelevant.\nThe appalling footage was released online in Skopje, the capital of Macedonia, after the parents became suspicious and police were called.\nThe couple had noticed bruises on the child's body and thought at first they might have been accidentally caused by his older brother.\nBut they were completely shocked when the video showed what was really happening when they were away at work.\nShocking: The woman can be seen slapping the baby on the head while stretched out on the sofa\nCruel: As the baby continues to cry, the nanny violently shakes the child and shouts at it to 'shut up!'\nHidden camera: The woman was filmed after the child's parents noticed he had some unexplained bruises\nThe nanny, who had worked for the family for five months, was seen pinching, slapping and covering the child's face up\nShe was heard shouting at him because he would not sleep while she wanted to watch TV.","url":"https://www.dailymail.co.uk/news/article-3421617/Nanny-jailed-14-months-slapping-shaking-ten-month-old-baby-parents-set-secret-camera-film-Macedonia.html"}
