{"authors":[],"date_download":"2018-10-30 00:53:56","date_modify":"2018-10-30 00:53:56","date_publish":"2017-03-24 00:04:56","description":null,"filename":"data/vaneerConsumption/MacedoniatoGeorgeSorosandUSAIDGoAway.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/03/Soros_talk_in_Malaysia.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860836.html","title":"Macedonia to George Soros and USAID: Go Away","title_page":"Macedonia to George Soros and USAID: Go AwayThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Small but mighty Macedonia is the mouse that roared this year, declaring war on George Soros, 86, and his U.S. Government handmaidens, who, incredibly, have financed a left-wing agenda to divide the nation and bring a socialist-Muslim coalition to power.\nIt was the kind of Obama Administration manipulation that was so routine that it passed unnoticed in 2012, when USAID/Skopje selected Soros’ Foundation Open Society Macedonia (FOSM) to manage $2.5 million in taxpayer dollars earmarked for oxymoronic “democracy building,” an amount increased to $4.8 million two years later.\nAs we speak, and yes, I mean currently, Macedonia’s Open Society Foundation is a USAID partner recruiting candidates for “Youth Engagement Support (YES) grants” — concept papers were due five days after Donald J. Trump’s inauguration. It’s some part of a $9.5 million, five-year “civic engagement” boondoggle kicked off last year, which surely would be squelched if the Tillerson State Department were running on all cylinders.\nCollusion between the Hungarian-American billionaire and the U.S. against Macedonia’s national interest is outlined on the website, StopSoros.mk, launched in late January by journalists in Skopje, the capital city and, incidentally, birthplace of Mother Teresa.\nOver the last three weeks, inspired by the Trump Revolution, tens of thousands of Macedonians have held peaceful rallies for national unity, an end to chaos-creating Soros/USAID largess, and the removal of the U.S. Ambassador. One of the most common posters is a black and white, “No Soros Government.”\nMacedonia’s plight has caught the attention of Capitol Hill: six Republican House members wrote to U.S. Ambassador Jess Baily on January 17, quizzing him about “disturbing reports” that the U.S. Mission “actively intervened” in domestic politics to promote “parties, media, and civil society groups of the center left.” They followed up with the Government Accountability Office, requesting an investigation. Last week, six Republican Senators directed a similar letter to Secretary of State Rex Tillerson.\nUnfortunately, conservative Members of Parliament from Macedonia have trouble finding Administration interlocutors to listen to their complaints — though several have flown to D.C. over the last three weeks to brief anyone who will listen. (USAID, they consider an utterly lost cause.)\nPaging Mr. Trump\n“Soros was Clinton and Clinton was Soros in the Balkans,” explained an agitated Macedonian MP, member of the Christian democratic VMRO-DPMNE party (commonly known as VMRO, pronounced VOOM-row), cooling his heels last week in a Dupont Circle cafe.\n“Soros was Obama and Obama was Soros,” added the MP, who asked not to be named.\nHe fanned a stack of papers on the table before me, eager to make two well-documented points: First, Macedonia, the only nation to escape Yugoslavia without war, has been led by VMRO’s pro-growth, low-tax, family-values government for the last 11 years.\nMacedonia is currently ranked #10 in the World Bank’s “Ease of Doing Business” standings, higher than any other Central or Eastern European country — and just two places below the U.S. Five years ago, the Financial Times lauded VMRO for introducing a 10% flat tax on personal and corporate taxes, the lowest in Europe.\nBesides being fiscally conservative, the nation of 2.1 million is socially conservative. Macedonia is the only European country where restrictions on abortion have tightened. Since 2013, a waiting period and personal counseling is required when a woman seeks abortion; the government runs a multimedia public service campaign, “Choose Life!”\n“We became a Soros target because we’re a conservative nation,” the politician ruefully observed.\nWordy but historical, VMRO-DPMNE refers to the Internal Macedonian Revolutionary Organization (VMRO) an 1893 movement for autonomy within the Ottoman Empire, updated in 1990 as Democratic Party for Macedonian National Unity (DPMNE), when the center-right party was founded in newly independent Macedonia.\nSecond, the MP’s file demonstrates, rather than applauding Macedonia’s progress — or at least, leaving it alone — U.S.-funded programs have provoked Saul Alinsky-style violence and ethnic division, inspiring a political crisis since 2015 as well as the empowerment of VMRO’s only political rival, the Social Democratic Union of Macedonia (SDSM), a socialist party led by Zoran Zaev, who has close ties to the Soros network extending beyond his homeland.\n“It’s still going on, despite the new Administration!” the clean-cut, 40-something, MP exclaimed, waving a copy of the Soros/USAID YES grants Request for Proposals in my face.\n“Awaiting Hillary Clinton’s coronation, they extended this fusion between Soros and the U.S. Government through 2021!”\nInviting me to consider what it means to pour $6-$7 million, Soros’ estimated annual budget for Macedonia, into a country of some two million people, the distraught man attracted attention from neighboring tables when he bellowed, “They are destroying my country!”\nHoping my new friend was exaggerating, I contacted several smart, reasonable, conservative analysts in Macedonia and a few in the U.S. who travel there frequently. All agree: Not only has the U.S. played negative, counterproductive games in Macedonia, they report our foreign policy has destabilized the country and promoted Islamic extremism.\nU.S. goals are so unsavory to the majority Orthodox population that many are beginning to look toward Russia as a more sympathetic — not to mention Christian — ally.\nNon-Electoral Tactics for Gaining Power\nA fascinating 1995 New Yorker article describes how, and why, Soros jumped into newly independent Macedonia with both feet.\nUnconvinced by Bulgarians who say there’s no such thing as a Macedonian ethnic group (Macedonians and Bulgarians speak virtually the same language; Macedonia was controlled by Bulgaria intermittently from the tenth century until 1918) and resentful of the Greek government’s efforts to snuff out the tiny country over its name (Athens imagines Macedonia has territorial designs on its northern region, known as Macedonia), Soros was enamored with the country’s first post-Communist president, Kiro Gligorov, a top boss under Marshall Josip Broz Tito, who competently staked out the country’s independent course.\nWith a sizable Albanian minority of some 25% of the population (at least, that was the percentage in 2002 when the last census was taken), Soros considered Macedonia a valuable example of a viable multiethnic nation in a region where ethnicity has been Hellishly weaponized. The foundation’s early programs concentrated on inter-ethnic relations and media development, then broadened to include Soros passions such as LGBT activism and “sex worker” rights, minority views with little popular support in a country where the majority is quietly devoted to the Macedonian Orthodox Church, an unloved stepchild, still claimed by the Serbian Orthodox Church.\nSoros’ preferred policies had zero traction as long as VMRO held power. Having controlled the unicameral legislative branch 1992-1998 and 2002-2006, the socialists lost consecutive parliamentary elections to VMRO in 2006 and 2008. It won seats in 2011 after provoking a parliamentary crisis that brought early elections. SDSM saw the advantage of using bullying tactics to gain power and turned to its friends in the burgeoning civil society world for a longer-term strategy.\nAs the New Yorker’s prescient reporter, Connie Bruck, observed over 20 years ago, “[T]he problem with Soros is the extremity of his views — his tendency to beatify one side and demonize the other — and the way in which that’s reflected in his activism.”\nMacedonian Information Agency editor, Cvetin Chilimanov, age 38, watched as FOSM beatified SDSM and demonized VMRO.\n“The Soros foundation has always been partisan but it became completely supportive of the Social Democrat party over the last four or five years,” Chilimanov explained. “Very openly, to the point that about 50 groups funded by Soros meet regularly with SDSM representatives; they call it a coalition between party and citizens, to organize joint protests, coordinate talking points, and coordinate joint positions of attack on the conservatives.”\n“It’s been a five-year campaign to bring down the conservative government,” Chilimanov summarized, a timeline that coincides with USAID’s 2012 cooperative agreement with FOSM to foment “civic activism,” “fertilizing grassroots actions,” and “greater CSO [civil society organization] mobilization,” to use USAID’s somewhat ominous boilerplate.[10] To provide guidance, FOSM translated Saul Alinsky’s “Rules for Radicals,” a manual teaching social change through conflict, Chilimanov confirmed.\nA 2014 FOSM internal document that surfaced via DCLeaks last year offers a small window on Soros entities as U.S. Government pick pockets: Metamorphosis, a foundation spun off by FOSM staff in 1999, and funded by the Soros Mother Ship, is listed as receiving funds from three USG funding streams, USAID, the U.S. Embassy, and the National Endowment for Democracy (NED).\nWhat exactly does this group do? God only knows. Its website loftily reports, “Metamorphosis mission is to contribute to the development of democracy and increase the quality of life through innovative use and sharing of knowledge. Our guiding values are openness, equality and freedom.” So they do whatever they want with our money, and it must have been a success, since Metamorphosis is one of the four local groups, including FOSM, that received a $9.5 million earmark from USAID last year.\n“Ten years ago, USAID was a normal organization supporting schools and water supply systems,” observed the MP visiting Washington, D.C. “Under Obama’s ideological programs, it became the super crack of the Left.”\nIt’s all a rich joke on the American taxpayer: as we transferred millions to Soros’ destructive projects abroad, he stiffed the U.S. Treasury: It was widely reported in 2015 that George Soros owed the Internal Revenue Service approximately $6.7 billion and there’s no evidence he ever settled the debt.\nJudicial Watch submitted a Freedom of Information Act request to the State Department last month to scrutinize collusion between Soros, USAID, and the U.S. Embassy: The document lists 29 organizations, Soros clones, that have implemented Soros/USG strategy.\nPolitics of Mobilization\nNot surprisingly, mobilization and protest became the opposition’s modus operandi in the spring of 2015, when Zoren Zaev, SDSM’s leader, produced phone recordings that allegedly revealed VMRO corruption — the governing party denied wrongdoing and called the tapes dubious. The well-trained activists came out to the streets.\nProtests were replete with photogenic moments, designed to go viral, such as a seasoned NGO professional applying her lipstick, using a police shield as a mirror. Opposition claimed 100,000 demonstrators while state sources reported more like 10,000.\nMeanwhile, in the midst of the wiretapping scandal came evidence that radical elements of the Albanian minority are a constant threat: extremists from neighboring Kosovo clashed with Macedonian security forces in a northern town, leaving eight officers and 14 civilians dead — the first fatalities due to ethnic violence in Macedonia in 14 years.\nLast March, the Macedonian government boldly closed its border to prevent the tsunami of economic migrants and refugees surging from Greece toward Western Europe, allowing restricted numbers to enter. Open borders is one of George Soros’ most keenly felt priorities. How did his Team respond? Activism! With an admixture of violence and vandalism.\nOstensibly protesting pardons extended to 56 politicians by VMRO President Gjorge Ivanov, which he soon retracted, the socialist party and its well-trained “Soros Army” (as some professionally printed T-shirts actually declared) employed paint guns, slingshots with paint-filled balloons, and eggs to denigrate, albeit colorfully, public buildings and monuments.\nThe fertilized grassroots also broke into the president’s office, vandalized property, and burned office furniture. Three policemen were injured.\nFilip Stojanovski, Metamorphosis’ program director and main man, maintains a Twitter profile pic (@razvigor) obscured by bright paint splats — an overt reference to his glory days during last summer’s “Colorful Revolution,” as it is known.\n“I heard Soros and SDSM activists chanting, ‘No Justice, No Peace,’ which isn’t even a meaningful slogan in Skopje,” recalled Cvetin Chilimanov. “The transfer of tactics from U.S. Left-wing groups funded by Soros to Macedonia is striking.”\nSimultaneously, the government had to defend its southern border with Greece, while diverting security forces 100 miles away from Skopje, to defend property against political agitators.\nThe traveling MP remembers, “It was a nightmare. The Soros army threw rocks at police guarding VMRO headquarters. Meanwhile, they were handing scissors out on the border to help people cut fences. Chaos.”\nInformation Service editor Chilimanov considers last summer’s melee to signal George Soros’ deepest objectives: “By controlling Macedonia, he can open or close the flow of migrants. The far Left Greek government has accepted no end of migrants. [Soros is close to the Greek Prime Minister, Alexis Tsipras.] It was our government that stopped the flow so his grand objective is to control this situation.”\nExternal Intervention\nIn an excellent account of Macedonia’s political situation over the last two years, “Macedonia’s Crisis isn’t Going Away,” in this month’s issue of the American Interest, Chris Deliso, an American journalist and author who lives with his family in Skopje, writes, “Since 2015 in particular, active U.S. diplomacy has not only failed to resolve Macedonia’s political crisis, but it has in fact prolonged it, with every initiative (both covert and overt) having backfired in some way.”\nHaving helped position SDSM for a return to power, as a result of investments in its media and civil society infrastructure, the U.S. began shaping the process of creating the next government.\nDeliso thinks the U.S. Government “could have just sat this one out.” In light of its extensive investments in the NGO superstructure, which is an investment in the SDSM party, there’s no way the State Department was going to stay on the sidelines.\nVictoria Nuland, Assistant Secretary of State for European Affairs, became prominently involved last summer in political negotiations toward parliamentary elections, ostensibly a neutral diplomatic role. She was clearly stirring the pot, though, announcing as she left in July, “Today, I met and talked with civil activists and journalists and encouraged them to continue with the work they are doing.”\nRescheduled from April to June to December, parliamentary elections were finally held on December 11, yielding a slight two-seat majority for VMRO over SDSM, 51-49. To form a governing majority 61 seats are necessary, so VMRO turned to its 2011-2016 partner, the Albanian Democratic Union for Integration (DUI), with ten seats. But DUI turned its back on its old VMRO ally, looking outside the country’s borders for guidance.\nVMRO was to be frozen out of the election it had just narrowly won.\nA new actor came onstage: Albanian Prime Minister Edi Rama, leader of the Socialist Party of Albania — so close to George Soros, he attended the billionaire’s third wedding, in 2013. Rama and his Foreign Minister gathered Macedonia’s three largest Albanian political parties, which together have 18 seats, forging a new alliance, outlined in the so-called Tirana Platform. It’s a provocation from top to bottom, calling for Albanian as an official language at all levels of government (“full linguistic equality”), alluding to ethnic “nation building” as a legitimate goal, and calling for basic matters of national identity to be renegotiated including the country’s name, coat of arms, anthem, and flag.\nSDSM leader Zoran Zaev adopted the Tirana Platform and obtained support — and 18 seats — from the three Albanian parties on February 25, declaring that he expected President Ivanov to give him the mandate that would make him Prime Minister. But on March 1, the president clapped back, denying Zaev a mandate because “his program advocates the destruction of sovereignty, territorial integrity, and independence.”[29]\nHence…daily rallies and organized strolls, around the country, featuring the signs of a lively, proud nation: Macedonia’s yellow sunburst on a red field, boys and girls in traditional costumes, a Robert Putnam-ian assortment of old-school NGOs such as handball leagues, dance troupes, and scouts.\nJason Miko, an American businessman who spends extensive time in Macedonia, highlighted that the Tirana Platform is “just an ethnic platform, with nothing about creating jobs” in a country where exclusive focus on ethnicity has led to war.\n“This is what’s happening,” Miko said. “Low-level State Department bureaucrats are calling the shots because the President hasn’t been able to fill key jobs on the seventh floor. There is no oversight. They are telling the U.S. Ambassador to pressure Ivanov to give the mandate to Zaev.”\nHe continued, “In my opinion, this directly contradicts what President Trump said in his Inaugural address, that we want to let other nations put their own interests first. Instead, in Macedonia, we have an activist ambassador, Jess Baily, working with and funding the Soros organizations saying that no, you don’t have a right to put your own interests first.”\n“What we really need from Washington is an adult in the Administration to stand up and say, ‘No, the Macedonians are going through their process, they know their constitution, and let the Macedonians take their process forward. That is what we really need from some senior official in Washington, DC.”\nSince average people are shut out of process for now, they’ve displacing Soros activists in the street.\n“What’s most important about these very calm gatherings is, they are regular people, from old to young,” observed Chris Deliso. “This is a simple, conservative society of people who know who they are. They don’t like to be looked down as second class Europeans.”\nThe author continued, “Something had to change and the Tirana Platform has galvanized people who were cynical until now about the value of their own preferences in their own country.”\nDeliso says the political funding he has witnessed “just alienated one side of the country — the majority — and emboldened the other side to become more irresponsible. I’ve talked to people who work at USAID and always argued, either give equal funding to both sides or give no funding at all. Obviously, they haven’t listened.”\n(Our series, “Soros in the Balkans Under the American Flag,” will continue.)","url":"https://spectator.org/macedonia-to-george-soros-and-usaid-go-away/"}
