{"authors":["Will Martin"],"date_download":"2018-10-30 23:12:18","date_modify":"2018-10-30 23:12:18","date_publish":"2018-07-20 00:00:00","description":"BI Prime: Macquarie's Viktor Shvets, an analyst known for his unconventional perspectives, includes topics like \"bullets and prisons\" and \"opium of the people\" in his presentation.","filename":"data/vaneerConsumption/MacquariesViktorShvetsontheendoftheworldasweknowit.json","image_url":"https://amp.businessinsider.com/images/5b50bbd695d4381c008b47ef-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_macquarie-viktor-shvets-on-the-end-of-the-world-as-we-know-it-2018-7_1540941138.html","title":"Macquarie's Viktor Shvets on the end of the world as we know it","title_page":"    Macquarie's Viktor Shvets on the end of the world as we know it - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"ricardo/Flickr\n\"The world as we know it is ending, but not tomorrow.\"\nThat's the somewhat bleak perspective put forward by the Macquarie strategist Viktor Shvets in a presentation to clients this week seen by Business Insider.\nShvets, a strategist known for his unconventional perspectives, put forward the idea that things once considered to be normal in the markets had been flipped on their heads.\nFor instance, Shvets noted, conventional market wisdom would suggest that a recession should be coming in the US in the next year or two. Traditional indicators, such as the impending inversion of the US Treasury yield curve (in which short-term bonds have higher yields than long-term ones), have previously augured recessions, but this time that's not necessarily the case.\n\"Neither duration of recovery, yield curves nor tightness of labour markets have the same informational values as they did decades ago,\" Shvets wrote in his presentation.\n\"The post-capitalist world has different dynamics. Much longer, shallower, uneven, distorted and unequal recoveries is the theme.\"\nAn example of that different dynamic comes in the shape of the Phillips curve — the inverse relationship between inflation and unemployment.\nThe relationship between unemployment and inflation \"is far from perfect,\" Shvets says, adding that \"although the Philips curve still underpins most of the Fed's models, it has not been a good indicator for decades.\"\nWhile the change in market dynamics makes for a headache in things like forecasting, like every major change, it presents an opportunity.\nAs such, Shvets identified seven \"themes\" that investors should look toward in their future portfolios. Rather than specific industries or sectors, Shvets puts forward an esoteric selection of concepts that he feels will boom in the coming years.\n\"While themes seldom work on a consistent basis, there are times when they dominate for years (decades),\" he wrote. \"This is one of these times.\"\nAll seven themes, Shvets said, are \"focused around the concept of 'declining returns on humans and conventional capital' and 'rising returns on social and digital capital.'\"\nThe concepts are as follows:\n\"Replacement of humans\"— This encompasses areas like robotics, automation and AI. \"Augmentation of humans\"— Areas like \"biotechnology, gene slicing & sequencing.\" \"Opium of the people\"— Where people spend their money during their leisure time, including entertainment, gaming, and artificial reality. \"Bullets and prisons\"— Shvets specifies \"weapon and drone manufacturers\" and \"operators of places of detention.\" \"Education & skilling\"— This, Shvets says, is \"mostly counting on parents' desire to educate their children.\" \"Morbid demographics\"— Relying on \"ageing and demographic dividends turning into curses.\" \"Disrupters and facilitators\"— Shvets' presentation does not elaborate on this point.\nShvets make clear in his presentation that Macquarie has \"no quality or valuation screen\" and that the topics above should be seen only as \"purely themes.\"\nA portfolio of stocks using these themes was the bank's best performing in 2017, Shvets said, gaining 27% against the MSCI AC World index.","url":"https://www.businessinsider.com/macquarie-viktor-shvets-on-the-end-of-the-world-as-we-know-it-2018-7"}
