{"authors":["Will Martin"],"date_download":"2018-10-30 21:40:09","date_modify":"2018-10-30 21:40:09","date_publish":"2016-12-19 00:00:00","description":"Despite gold's fall in the 2nd half of the year, every major price driver suggests that the precious metal should not be worth 7% more than it was last year.","filename":"data/vaneerConsumption/Macquarieonwhygoldissohigh.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_why-is-gold-so-expensive-2016-12_1540935609.html","title":"Macquarie on why gold is so high","title_page":"    Macquarie on why gold is so high - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A worker scoops gold shots at Japanese jewellery brand, Ginza Tanaka's original equipment manufacturer (OEM) factory in the Chiba prefecture, east of Tokyo September 14, 2009. REUTERS/Yuriko Nakao Gold is about to have one of its worst quarters in nearly 35 years, but its price is still significantly higher than it should be right now, and there does not seem to be any real reason why.\nThat is according to the latest research from analysts at Macquarie, who ask in a note circulated to clients last Friday: \"Why is the gold price so ... high?\"\nMacquarie's team, headed up by Matthew Turner, argue that despite gold's fall in the second half of the year, almost every major price driver suggests that the precious metal should not be worth almost 7% more than it was at the same time last year.\nWriting in the Australian bank's \"Commodities Comment\" Turner and his team say: \"Gold might be on course for its second-worst quarterly performance since 1982, but it remains well above last year's price low, despite a stronger dollar, high bond yields and ominous signs physical demand is hamstrung. So we ask - why is it so high?\"\nMacquarie's analysts then run through a whole heap of possible reasons for gold's relatively elevated level, but nothing really fits.\nFirst up, a weaker dollar. As the analysts note: \"If that was the case then gold might be lower in key currencies of consumers, helping demand, or producers, curbing supply.\"\nHowever, obviously, the dollar is not at all weak. In fact, it is incredibly strong right now. The US dollar index is trading above 100, a mark it previously hadn't crossed since 2004. Macquarie adds that \"while that is perhaps a misleading comparison given the sickly British pound is a large part of that index, it is up 2% against the Indian rupee, 4% against the euro and 7% against the Chinese yuan.\"\nSo it is not any weakness on the dollar's part providing relative support to gold. Neither is it low yields on government debt.\n\"If it is not the dollar that is keeping gold up, another possibility is low yields, the other financial market metric that is closely correlated to the gold price. As Figure 3 shows, the 10yr US Treasury yield has, however, soared far higher than it was last year (it is in fact the highest it has been since mid-2014),\" Turner et al write.\nHere is Figure 3 (axes are inverted):\nMacquarie\nOne possible explanation posited by Macquarie's team is that real yields — nominal yields minus the rate of inflation — remain subdued from late 2015 levels. Here is the quote (emphasis ours):\n\"The yields which have not yet reached last year's level, however, are the real yields as measured by Treasury Inflation Protected Securities (TIPs). These have increased significantly in recent weeks and even days - closing 15 December at 0.70%, up from 0% at the end of 3Q, marking their third-biggest quarterly increase since 2000. But they remain below the peak seen this time last year of 0.84%.\"\nLater in its research, Macquarie concludes:\nIndeed, of the main metrics we use to 'value' the gold price, only lower real yields really justifies it, and then only to an extent. A larger stock of ETF investment (and indeed futures positioning) than last year surely plays a role and can be justified if investors are focusing on things other than US yields and the dollar, eg, higher global risk or future inflation prospects.\nGold may have dropped by more than 17% since its peak in the aftermath of Britain's vote to leave the EU (as the chart below illustrates) but it is still significantly overvalued, and Macquarie can't work out why.","url":"https://www.businessinsider.com/why-is-gold-so-expensive-2016-12"}
