{"authors":["David Scutt","Business Insider Australia"],"date_download":"2018-10-30 23:35:50","date_modify":"2018-10-30 23:35:50","date_publish":"2018-07-18 00:00:00","description":"Mounting trade tensions with the US, along with the Chinese government’s continued deleveraging push, has many concerned about Chinese industrial activity. Macquarie Bank says good news is unlikely from upcoming China manufacturing PMI reports, suggesting that they will fall “significantly.”","filename":"data/vaneerConsumption/MacquariewarnsChineseindustrialdatawillsoongetweaker.json","image_url":"https://amp.businessinsider.com/images/595d433cd084cc163f8b7221-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_china-market-macquarie-warns-chinese-industrial-data-will-soon-get-weaker-2018-7_1540942550.html","title":"Macquarie warns Chinese industrial data will soon get weaker","title_page":"    Macquarie warns Chinese industrial data will soon get weaker - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters\nMarkets are once again on starting to fret about the Chinese economy.\nMounting trade tensions with the United States, along with the Chinese government's continued deleveraging push, has many concerned about the outlook for economic activity, especially in its industrial sectors.\nAccording to data released by China's National Bureau of Statistics (NBS) earlier this week, industrial output over the past year grew by just 6%, well below the 6.8% level seen in the 12 months to May and forecasts for a smaller deceleration to 6.5%.\nBy Chinese standards, it was pretty weak.\nGiven recent trends, heightening concerns about the broader economy, it's likely many will be eyeing off the release of manufacturing purchasing managers indexes (PMIs) over the next couple of weeks, providing an indication as to whether the slowdown seen in June continued into July.\nAccording to Australia-listed Macquarie Bank, they're unlikely to be great.\nIt's newly created Macquarie China Business Cycle Indicator, or MCBCI for short, weakened sharply in July, pointing to significant downside risks for the PMI reports released in the weeks ahead.\n\"The MCBCI slowed noticeably in July, with the moderation occurring in both the copper and steel supply chains,\" it says.\n\"Specifically our index fell by 0.8 points, from 51.4 to 50.6, suggesting that the PMIs for July will fall significantly, and that industrial production growth has slowed.\"\nThis chart shows how Macquarie's MCBCI compares to the average movement in China manufacturing PMIs released by the Chinese government and IHS Markit.\nMacquarie Bank\nWhile not perfect by any stretch, there's clearly a relationship between the two.\nThe MCBCI is constructed using proprietary surveys of market participants in the steel and copper sectors, providing what Macquarie deems to be a \"strong real-time indication of underlying industrial growth in China\".\nRather than mounting trade tensions with the US, Macquarie says the weakening in July largely reflects the Chinese government's ongoing deleveraging push across industrial sectors.\n\"While many will attribute this slowdown to the trade war underway between the US and China, we feel that, at this stage at least, it is more about the ongoing deleveraging process,\" it says.\n\"However, the imposition of tariffs earlier this month is likely to impact over the second half of the year.\"\nChina's official manufacturing PMI report will be released on Tuesday, July 31. IHS Markit's smaller private sector PMI report will arrive a day later on Wednesday, August 1.\nBased on Macquarie's analysis, neither are likely to be too flash.","url":"https://www.businessinsider.com/china-market-macquarie-warns-chinese-industrial-data-will-soon-get-weaker-2018-7"}
