{"authors":[],"date_download":"2018-10-30 20:09:55","date_modify":"2018-10-30 20:09:55","date_publish":"2017-04-05 19:01:00","description":"The so-called Macy's \"Backstage The Outlet Store\" opened Saturday inside the retailer's Gwinnett Place Mall location.","filename":"data/vaneerConsumption/Macysoutletwithinastorenowopen.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/MyAJC/2016/10/26/Images/photos.medleyphoto.11909942.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_macy-outlet-with_bb201d291678eeb1cc9d2e373b8abfc0__1540930195.html","title":"Macy's outlet-within-a-store now open","title_page":"Gwinnett Place Mall: Macy's outlet-within-a-store now open","title_rss":"NULL","source_domain":"ajc.com","text":"Macy’s has opened a bargain-driven outlet store inside its already existing location at Gwinnett Place Mall.\nThe move comes as traditional malls across the country scramble to compete with online retailers and newer, trendier shopping experiences, and Macy’s also plans to open outlet locations this summer at malls in Cobb and DeKalb counties. It’s a concept the retailer, which has closed dozens of stores in recent months, has been experimenting with at least since late last year.\nMacy's to close dozens of stores (www.accessatlanta.com)\nBut at long-struggling Gwinnett Place Mall, [...] the change in strategy from Macy’s, one of its last remaining anchor tenants, may be just the first wave of a notable sea change.\nThe outlet location, dubbed “Macy’s Backstage,” carves out about 19,000 square feet on the second floor of the Duluth mall’s traditional Macy’s department store.\nIt made its official debut on Saturday. Other outlets will open at Cobb County’s Cumberland and Town Center malls in May, and at DeKalb’s Stonecrest Mall in June.\nThe target audience is “the seasoned outlet shopper who enjoys the excitement of the treasure hunt but whose time and money is a commodity,” Vanessa LeFebvre, senior vice president and general merchandise manager for the outlet concept, said in a news release. Shoppers can expect “a wide selection of merchandise from the previous season, as well as fresh merchandise from new brands and internationally recognized labels,” the news release said.\nOther, much bigger changes are also in the works for Gwinnett Place Mall and the surrounding area. At least in theory.\nMoonbeam Capital Investments, which has owned the mall since 2013, told The Atlanta Journal-Constitution in January that it has plans to dramatically alter the shopping center, both physically and philosophically.\nThose plans would include demolishing a former Belk department store and replacing it with two apartment buildings and converting two full wings into office space.\nShawl Pryor, a Moonbeam senior vice president, told The AJC that redevelopment plans would be submitted to Gwinnett County in March. It's unclear if that has actually happened.\nPryor did not respond to inquiries. No Gwinnett Place-related plans were included in documents posted online for the county planning commission’s Monday night or May 2 meetings.\nGwinnett Place Mall’s current anchor tenants include Macy’s, Sears, MegaMart and Beauty Master. More than half of its other retail spaces are empty.\nA few blocks down Pleasant Hill Road, developers are also hoping to revitalize the mostly abandoned Gwinnett Prado shopping center. Insignia LLC plans to demolish the existing center (minus an existing supermarket) and create a sprawling mixed-use center that would include apartments, retail, office space and a hotel.\nNo plans have been officially submitted to the county yet.\nOnce-proud Gwinnett Place Mall isn’t alone in its struggles to stay afloat, or its dreams for redevelopment.\nDeKalb County’s Northlake Mall was sold last year and visions of new uses were floated.\n“We’re looking at every possibility at Northlake to see what would fit in the market and what the market is asking for,” Tony Ruggeri, a partner at Texas-based ATR Corinth Partners, which bought the mall, said at the time.\nThe Macy’s location at North DeKalb Mall, which had been up and running since 1965, was among closures announced by the retailer last spring. Macy’s was the last of the traditional department stores to leave the mall. At the time, mall operators suggested tearing it down and replacing it with a mixed-use development.\nClayton County’s Southlake Mall was foreclosed on in 2013 before being scooped up by a group called Vintage Real Estate. The mall’s former JCPenney’s location, which had been empty for years, is now a call center called Chime Solutions.\n“This non-traditional use has proven to be a valuable addition to Southlake Mall,” Southlake general manager Judy Pritchett said last year.\nNon-traditional shopping experiences like Avalon in Alpharetta, meanwhile, are flourishing. Officials are preparing to launch Phase II of the development later this week. That will include nearly 300 apartments, a brick and glass office tower that will host regional offices for Microsoft and more chef-driven restaurants.","url":"https://www.ajc.com/news/local/macy-outlet-within-store-now-open-gwinnett-place-mall/tBPYC79NeQyF0kAonWGSVN/"}
