{"authors":["Alex Seitz-Wald","Jonathan Allen","Benjy Sarlin","Mark Peterson"],"date_download":"2018-10-22 20:01:11","date_modify":"2018-10-22 20:01:11","date_publish":"2018-09-04 04:00:00","description":"Disdain between Republicans and Democrats has grown under President Trump, as the Democratic Party has become more liberal and the Republican Party has become more Trump.","filename":"data/vaneerConsumption/MadAboutTrump.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/2018/06/leftright-alignment/images/01/cover01.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/specials_mad-about-trump_1540238471.html","title":"Mad About Trump","title_page":"How Trump's polarizing presence impacts midterm, 2020 election\n     - NBCNews\n    \n  ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Part One Democratic Enthusiasm Sows Division\nOMAHA, Neb. — A gay bar may not be a typical campaign stop in ruby-red Nebraska.\nBut progressive upstart candidate Kara Eastman beat the typical Nebraska Democrat in a primary earlier this year, so one warm summer evening, she showed up at Flixx, a fixture of the nightclub scene in downtown Omaha, to greet supporters.\n“There are people who are skeptical about an actual, unapologetic Democrat, running on a Democratic platform, because they’ve been trained to believe that this is not a winning strategy for this district,” Eastman, a social worker who runs a nonprofit, said in an interview. “I believe it is the winning strategy for this district. We have to ignite this base.”\nWith her all-in progressive platform of Medicare for All, free college and stricter gun control, Eastman breaks every rule about how Democrats should run in a place like Omaha. But after the 2016 election left her party with less power in Washington and in state capitals than it had in nearly a century, the old rules are being questioned.\nEastman is emblematic of the progressives, women and political newcomers who are remaking the Democratic Party for the post-Clinton-Obama era, outraged by Donald Trump’s election and fueled by a backlash to his administration’s actions.\nThe New Order\nAs progressives see it, the half-loaf incrementalism preached by Barack Obama and Bill Clinton had one job — to win — and it failed, so what good is it now? Better to demand it all, they say, and ask moderates to compromise, just as in the past moderates have asked progressives to move toward the middle.\n“The question is always, ‘How are you going to get the Republicans to vote for you?’ The answer is we’re not,” said Crystal Rhoades, a close Eastman ally who leads the Douglas County Democratic Party, which includes Omaha.\nThat kind of thinking unnerves traditional Democrats, like the Democratic Congressional Campaign Committee, which backed Eastman’s opponent in the primary but ultimately decided to get behind her in the general election.\nInside the Omaha, Nebraska, headquarters of Kara Eastman, a first-time candidate and progressive Democrat who won her party’s primary in an upset and is challenging incumbent GOP Rep. Don Bacon in November in the state’s 2nd Congressional District. Mark Peterson\nSome in the party see a rare opportunity to welcome disaffected refugees from Trump’s GOP, but progressives like Stacey Abrams, the Democratic nominee for governor in Georgia, and Alexandria Ocasio-Cortez, who won the Democratic primary for a House seat in New York City, are more interested in capitalizing on the surging energy in their own base.\n“It’s never been done here before,” Rhoades acknowledged. “We finally have a crop of candidates nationwide who are saying the things that need to be said, and they’re doing so unabashedly.”\nFor years, Rhoades has been trying to convince her colleagues that Democrats in Omaha are no different from Democrats in Los Angeles, so the party is better off giving its base what it wants than sacrificing its liberal values to try to win over Republicans.\nTrump Supercharged It\nJust as the tea party movement led to a reawakening of the right after eight years of Republican control of the White House, from 2001 to January 2009, the anti-Trump “resistance” has reinvigorated the left.\nProgressives are protesting against their own party’s leaders and shifting the policy debate to the left, and the so-called establishment is listening. Tom Perez, chairman of the Democratic National Committee, even declared that Ocasio-Cortez, a self-described Democratic Socialist, “represents the future of our party” after she unseated a powerful congressman in a primary.\nExclusive poll: How Democrats say democracy is working, before and after Trump Before Trump took office Today 60% 50 40 30 20 10 0 0 10 20 30 40 50 60% Very well 2% 33% Somewhat well 53% 9% Not too well 11% 33% Not at all well 2% 56% Before Trump took office Today 60% 50 40 30 20 10 0 0 10 20 30 40 50 60% Very well 2% 33% Somewhat well 53% 9% Not too well 11% 33% Not at all well 2% 56% Before Trump took office Today 0 20 40 60% Very well Somewhat well Not too well Not at all well The NBC News | SurveyMonkey poll was conducted July 20-July 26, 2018. The survey included 2,192 registered Democrats and Democratic-leaners (+/- 2.9). Respondents for this nonprobability survey were selected from the nearly 3 million people who take surveys on the SurveyMonkey platform each day. See the full poll results here Source: NBC News / Survey Monkey\nJake Sullivan, the top policy adviser in Hillary Clinton’s presidential campaign, recently offered a mea culpa for not recognizing that the country was ready for a more muscular progressivism than he had anticipated.\n“I have to confess that I did not fully appreciate the need for a more dramatic rethink at the start of the 2016 campaign,” he wrote in a lengthy essay for the journal Democracy.\nTrump has only supercharged a hard shift to the left that was already under way.\nWhen the president tried to repeal the Affordable Care Act, liberals responded by calling for single-payer health care. When Trump separated migrant families at the border, the left called for the abolition of ICE, the Immigration and Customs Enforcement agency.\nThe most telling ideological shift in the party is the explosion of support for Medicare for All, an idea Clinton had dismissively brushed aside during the Democratic presidential primary two years ago as a “theoretical debate about some better idea that will never, ever come to pass.”\nIn 2016, 62 Democrats in the House co-sponsored the main Medicare for All bill, which would replace the current health insurance system with a single-payer one. Now, more than 120 Democrats have signed on — nearly two-thirds of the caucus.\nSingle-payer health care has become the critical litmus test for any Democrat who wants to be seen as a progressive. Bernie Sanders used to be its only supporter in the Senate, but when he rolled out an updated version of the bill last year, he was joined by a who’s who of ambitious Senate Democrats: Elizabeth Warren, Cory Booker, Kamala Harris, Kirsten Gillibrand — all potential presidential hopefuls in 2020.\nWomen have reached their tipping point. Jane Kleeb — Nebraska Democratic Party Chairwoman\nAnd it’s not just those usual-suspect liberals. Converts include at least four members of the moderate Blue Dog coalition and former Sen. Max Baucus, whom liberals blame for watering down the Affordable Care Act.\nOn social issues, there is now virtual unanimity among Democrats at the federal level on abortion rights and LGBTQ equality, in a way that would have been difficult to imagine just a few years ago. Obama didn’t back gay marriage until May 2012, deep into his first term and six months before he faced re-election.\nAs African-Americans have demanded more recognition from a party they loyally support, opposition to overhauling the criminal justice system has melted away. And on immigration, Obama’s deportations and Clinton’s opposition to driver’s licenses for undocumented immigrants now seem anachronistic as the party increasingly backs sanctuary policies and pro-immigrant positions to counter Trump. (Perhaps feeling the winds of change, Clinton announced she supported driver’s licenses for undocumented immigrants in 2015.)\nOf course, moderates warn that the approach could end disastrously for Democrats, plunging the party into a 1970s and ʼ80s-style political slump.\nBut the country looks very different today.\nWhen Walter Mondale lost 49 states to Ronald Reagan in 1984, whites made up 85.5 percent of reported voters and self-identified “conservatives” vastly outnumbered those calling themselves “liberals.”\nToday, 73.3 percent of reported voters are white. And while the ranks of liberals in the party are rising fast, the number of Democrats who consider themselves conservative is falling.\nInside the party, the shift has come as it loses its former strongholds in the South, rural areas and small blue-collar cities.\nMeanwhile, Trump has stripped Democrats of their interest in compromise.\nMore Democrats are more liberal Democrats’ desire for compromise plummets Moderate Total Liberal Dem/Lean dem Conservative Rep/Lean rep 50% 80% 69% 60 40 46% 46% The number of liberals in the Democratic Party is increasing, while conservatives and moderates are shrinking. 40 30 44% The historical gap in which Democrats favored compromise more than Republicans has disappeared. 31% 20 20 10 10 0 0 2001 ’03 ’05 ’07 ’09 ’11 ’13 ’15 ’17 2011 ’12 ’13 ’14 ’15 ’16 ’17 ’18 Democrats’ desire for compromise plummets More Democrats are more liberal Conservative Liberal Moderate Total Rep/Lean rep Dem/Lean dem 50% 80% 69% 60 40 46% 46% 40 30 44% The historical gap in which Democrats favored compromise more than Republicans has disappeared. 31% 20 20 The number of liberals in the Democratic Party is increasing, while conservatives and moderates are shrinking. 10 10 0 0 2011 ’12 ’13 ’14 ’15 ’16 ’17 ’18 2001 ’03 ’05 ’07 ’09 ’11 ’13 ’15 ’17 More Democrats are liberal Conservative Liberal Moderate 50% 40 30 20 The number of liberals in the Democratic Party is increasing, while conservatives and moderates are shrinking. 10 0 2001 ’03 ’05 ’07 ’09 ’11 ’13 ’15 ’17 Democrats’ desire for compromise plummets Total Rep/Lean rep Dem/Lean dem 80% 69% 60 46% 46% 40 44% 31% The historical gap in which Democrats favored compromise more than Republicans has disappeared. 20 10 0 2011 ’12 ’13 ’14 ’15 ’16 ’17 ’18 Sources: NBC News / Gallup, Pew Research Center\nFor years, Democrats were far more likely than Republicans to say they wanted politicians who would work with the other side to get things done, but that gap has disappeared, according to the Pew Research Center.\nWomen Will Be Heard\nWhen the freshmen of the 116th Congress assemble on the steps of the Capitol in January for their class photo, the most notable difference from every portrait hanging next to it will probably be the number of women present.\nThere are now more women running, donating and winning primaries than ever. That surge is limited to the Democratic side, two years after a man accused of sexual assault beat the first woman nominated for president by a major party, a result that helped give rise to the #MeToo movement.\nEastman, who faces an uphill battle in the Republican-leaning district and whose opponent has raised more money than she has, campaigns door-to-door and remains optimistic. “I always thought people like me don’t get elected,” she said. Mark Peterson\n“Women are tired of handing their politics over to men and seeing it not get done,” said Jane Kleeb, the chairwoman of the Nebraska Democratic Party. “Women have reached their tipping point.”\nThat helps explain Eastman’s win, Kleeb said, and it helps explain numerous other races where women beat expectations to win Democratic primaries this year.\nWomen have won about 65 percent of Democratic primaries this year for open House, Senate and governor seats that included at least one man and one women, according to an analysis by FiveThirtyEight.\nIn 2012 and 2014, women were about equally likely to donate to Democratic candidates or liberal groups as they were to Republican and conservative ones. As of earlier this year, however, 68 percent of women’s political contributions are going to Democratic candidates or liberal groups, according to Open Secrets, a project of the Center for Responsive Politics, a nonpartisan nonprofit that tracks money in American politics.\nActivism On the Rise\nThe force powering all of this, of course, is the backlash to Trump.\n“I shouldn’t thank him, but I do,” said Precious McKesson, a community organizer in heavily African-American North Omaha, the birthplace of Malcolm X.\nDemocratic Party activist Precious McKesson works the phones in her office in Omaha. McKesson, a single-mom who hadn’t been active in party politics, got deeply involved because of Trump’s election and now handles outreach for the Nebraska Democratic Party. McKesson says she doesn’t want minority voters taken for granted any longer. Mark Peterson\nMcKesson was deeply involved with social welfare groups in her community, but she didn’t pay close attention to politics until after the 2016 election, when she noticed the drop-off in votes from African-Americans.\nShe complained to party officials that Democrats had a habit of ignoring black voters until election season — “we’re the break-glass-in-case-of-emergency vote,” she said — so the state party put her in charge of outreach to the community.\nTwo years ago, she supported Clinton, like the vast majority of black Democrats. “But if I could go back and do it again, I would very definitely vote for Bernie,” she said of Sen. Bernie Sanders, the Vermont independent who challenged Clinton in the primary and may run again for the White House in 2020.\nMcKesson is just one of thousands of Americans who became political activists — and candidates — because of Trump.\nExplosion of activism: A new breed of Democrat rises in a red state To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video Video by Andrew Stern and Nirma Hasty\nFor the first time in years, Democrats have fielded candidates in every congressional district in states like Texas and Alabama, where they used to not even bother competing.\nThree years ago, just 19 percent of Republican lawmakers were facing Democratic challengers who had raised at least $50,000, a sign of viability. At the same point in this cycle, 58 percent of GOP incumbents faced challengers who met that threshold.\nActBlue, which processes online payments for most Democratic candidates and groups, has run out of superlatives as they smash through fundraising record after record.\nThat enthusiasm and energy will be the hardest thing for Democrats to sustain.\nAnd many worry the party’s leftward lurch will be an even bigger liability for Democrats in 2020 and perhaps beyond.\n“We have a tendency to alienate rather than to welcome,” said Rep. Jim Himes, D-Conn., the chairman of the moderate New Democrat Coalition.\nBut for Eastman, the realignment is worth the risk.\n“I always thought people like me don’t get elected,” she said. “But I think people are looking for authenticity and integrity in their candidates. You might not agree with me on every issue, but I won’t lie to you, and I have nothing to hide.”","url":"https://www.nbcnews.com/specials/mad-about-trump"}
