{"authors":["Jessica Aquilina","Karishma Sarkari For Daily Mail Australia"],"date_download":"2018-10-23 01:35:45","date_modify":"2018-10-23 01:35:45","date_publish":"2016-01-28 15:58:27","description":"Maddy King enjoyed a night out with the girls in Sydney on Thursday, while boyfriend Kris Smith films a new show in Africa.","filename":"data/vaneerConsumption/MaddyKingtalksaboutlongdistancerelationshipwithKrisSmith.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB357600000578-0-image-a-46_1453993804165.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420872_Maddy-King-talks-long-distance-relationship-Kris-Smith_1540258545.html","title":"Maddy King talks about long-distance relationship with Kris Smith","title_page":"Maddy King talks about long-distance relationship with Kris Smith | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Maddy King enjoyed a night out with the girls on Thursday night.\nAttending the Social Diary Reality TV party at Sydney bar Bungalow 8 the brunette beauty was travelling solo as her other half, Kris Smith filmed a new show in Botswana, Africa.\nSpeaking to Daily Mail Australia about maintaining their relationship long-distance, the model admitted: 'When he's away we try and talk as much as we can.'\n'We try and talk when we can': Maddy King revealed how she and her hunky TV presenter beau Kris Smith keep their long-distance love alive as the busy couple travel the globe for work\n'He's in Africa for a new show, so he doesn't have that much WiFi and connection, but when he can we speak,' she explained, adding: 'gotta make it work'.\nWith both Kris and Maddy's careers taking them around the world, the pair try their best to travel together when they can.\nThis time, while the hunky TV presenter is on the other side of the world for three weeks working on a new European reality show, Maddy will also be overseas for work.\nLetting her hair down! The brunette beauty (centre) was almost unrecognisable as she sported a blonde wig and tiara at the Social Diary Reality TV party at Bungalow 8 in Sydney on Thursday\nThe model is set to fly out to Singapore for a Chinese New Year-based shoot there.\nIn June this year, the on-again, off-again couple will mark four years together, after meeting through mutual friends when he was on a trip to Sydney.\nHowever, the brunette jokes about the upcoming anniversary: 'I don't know if he remembers that'.\nMaddy, who dressed in a blonde wig with a tiara in her hair for the reality TV themed party, also talked about keeping her trim and toned physique in shape.\n'I don't know if he remembers that': The couple will mark four years together in June but it hasn't all been smooth sailing for the on-again, off-again pair, who met through mutual friends\nModel mode! Maddy revealed the couple try to travel together as much as possible but couldn't join Kris in Botswana as she has a shoot in Singapore\n'Nutritional medicine studying that helps. I do Pilates. I walk everywhere, so I kind of feel like it's incidental exercise,' she listed.\n'It's just gotta be about balance,' Maddy added, explaining: 'I'm having a drink right now but tomorrow I will train and it's just keeping that balance.'\nAnother secret to her model figure is not making it a job, saying: 'You make it fun and it makes it more enjoyable and easier.'\nWork it! The Pilates fan admits she works hard to stay in shape but tries to make exercise fun","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420872/Maddy-King-talks-long-distance-relationship-Kris-Smith.html"}
