{"authors":[],"date_download":"2018-10-22 22:42:44","date_modify":"2018-10-22 22:42:44","date_publish":"2014-05-12 15:29:22","description":"Small is beautiful, even when it comes to exports, and the upshot could be a stronger economy and more jobs at home","filename":"data/vaneerConsumption/MadeinUSAExportGospelSpreadstoSmallBusinesses.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_20/436396/140512-exports_1123_cd2ecc014ef026f30a33dcdcae7b0173.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_economy_made-usa-export-gospel-spreads-small-businesses-n103146_1540248164.html","title":"'Made in USA' Export Gospel Spreads to Small Businesses","title_page":"'Made in USA' Export Gospel Spreads to Small Businesses","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA mid-sized Pennsylvania company is shipping building materials to Mongolia. A Tennessee business is ramping up patterned glass production, destined for churches and homes in South America and Europe. A Florida maker of porcelain lighting is not only exporting but has opened an Australian outpost after orders climbed.\nMore medium-to-small businesses are making bigger bets on exports, as many American consumers spend cautiously amid a still-sluggish recovery.\nLarge multinationals have been exporting for decades. Now, even smaller companies based in smaller cities—thanks to e-commerce and access to ports—are courting international markets. Inside regional U.S. airports, entrepreneurs are boarding international flights to pitch products. Workers at U.S. ports are loading more containers, packed with everything from U.S.-origin lumber to glass.\nSmall is beautiful, even when it comes to exports, and the upshot could be a stronger economy and more jobs at home.\n\"Manufacturing is key to providing jobs and driving the economy,\" said Bryan Scott, co-owner of Barn Light Electric based in Titusville, Florida.\n\"Even small companies are participating and exporting their products to China,\" said Hal Sirkin, senior partner at The Boston Consulting Group in Chicago.\n\"It used to be that if you said more or less you wanted a low-cost manufacturer, you go to South America and Asia. If you wanted a high-cost manufacturer you go to Europe and the U.S. That's no longer true.\"\nTriggered by changes in wages and energy costs, the difference between China and U.S. in manufacturing costs—before transportation—has narrowed to less than five points, as recently measured by the consulting group in an April report. A decade ago, that gap between the U.S. and China was wider at 14 points, said Sirkin, who led the research.\n\"It used to be that if you said more or less you wanted a low-cost manufacturer, you go to South America and Asia. If you wanted a high-cost manufacturer you go to Europe and the U.S.,\" Sirkin said. \"That's no longer true.\"\nOf course domestic manufacturing gains have yet to replace the thousands of U.S. jobs lost to overseas markets.\nNew reshoring of jobs back to the U.S. combined with offshoring reached a virtually flat net level last year, said Harry Moser, president of the Reshoring Initiative, which monitors U.S. manufacturing. \"The bleeding has stopped,\" said Moser, whose firm tracks both small and large businesses.\nBut exports continue to rise and reached record levels in March, according to the U.S. Census. U.S. exports have been growing seven times faster than GDP since 2005, Boston Consulting notes.\nAnd that growth may be just beginning as manufacturers take advantage of stable wages and lower energy prices in the U.S., where everyone pays at least 40 percent less than the rest of the world for natural gas and electricity, key ingredients in manufacturing.\nLow-cost manufacturer\nThat's in part why the U.S. is on track to become one of the developed world's top low-cost manufacturers, lapping parts of Europe and Japan, according to research from the Boston Consulting Group.\nOne entrepreneur firmly staking a claim on U.S. export gains is Heritage Glass in Kingsport, Tennessee.\nHeritage is reopening a 100-year-old manufacturing plant that has been shuttered for two years. Tucked amid the Appalachians, Kingsport was founded after the Civil War to capitalize on expanding rail lines and increased trade. Its industrial heritage includes glass making, and Heritage Glass is slated to ramp up production by summertime, and hire about 120 workers. Patterned glass is used in everything from table tops to solar panels.\nHeritage Glass President Eric Kerney envisions 60 percent to 70 percent of sales eventually coming from the Philippines, Europe and South America. He's not waiting for the U.S. housing recovery to solidify.\n\"Every company needs a fallback contingency plan,\" said Kerney. \"Our contingency plan is we can diversify.\"\nSuch targeted efforts at growing exports can work, and have contributed to the recovery. Exports accounted for 54 percent of output growth in the top 100 U.S. metro areas from 2009 to 2012, compared with 37 percent nationally for that period, according to a report last year from the Brookings Institution.\nAmerican cities that are exporting a lot, not surprisingly, are highly specialized. Making a specific widget that a pocket of the world wants gets you a bite of the global economy.\nThat's what happened to Barn Light Electric. Based near the Kennedy Space Center, the business of about 125 employees survived the government shutdown last year with domestic and international growth. Owners noticed more orders from Australia. In some cases, customers were paying more on shipping than for the actual lamp.\nAbout a year ago, Barn Light opened a manufacturing shop in Melbourne. American parts and materials are shipped overseas, where a handful of trades people in Australia assemble the lamps for regional customers.\nTotal international sales account for roughly 10 percent of sales. They also export to Canada and Mexico. Its products have even been shipped to high-end hotels in China and Hong Kong.","url":"https://www.nbcnews.com/business/economy/made-usa-export-gospel-spreads-small-businesses-n103146"}
