{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 03:02:42","date_modify":"2018-10-23 03:02:42","date_publish":"2016-01-11 15:32:03","description":"Their on/off relationship almost completely derailed before Christmas. But lovebirds Tiffany Watson and Sam Thompson are clearly keen to put on a united front.","filename":"data/vaneerConsumption/MadeInChelseasTiffanyWatsonandSamThompsonenjoytheMaldives.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300BCF3000000578-0-image-a-64_1452528176942.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394009_Tiffany-Watson-Sam-Thompson-pack-PDA-enjoy-winter-sun-holiday-Maldives_1540263762.html","title":"Made In Chelsea's Tiffany Watson and Sam Thompson enjoy the Maldives","title_page":"Made In Chelsea's Tiffany Watson and Sam Thompson enjoy the Maldives | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Their on/off relationship almost completely derailed before Christmas.\nBut, after reconciling with one another during Louise’s festive dinner party, lovebirds Tiffany Watson and Sam Thompson are clearly keen to put on a united front.\nWhich is exactly what they did as they holidayed at the Maldives' LUX* South Ari Atoll resort, this week.\nScroll down for video\nWinter sun: Tiffany Watson and Sam Thompson are clearly keen to put on a united front - as they proved when they holidayed in the Maldives\nThe duo packed on the PDA as they strolled along the lavish white beaches and gazed into the blue waters, while Britain endures a cold snap.\nFlaunting her figure in a white bikini with a baby blue lace trim, the blonde reality TV star was certainly feeling body-confident on her winter sun break.\nCapping her look with a Sloaney pair of reflective sunglasses, she was clearly keen to look fashionable.\nLikewise, Sam ensured he flashed his torso as he went shirtless along the shoreline.\nGood times: The duo packed on the PDA as they strolled along the lavish white beaches and gazed into the blue waters at the Maldives' LUX* South Ari Atoll resort\nLife's a beach! Flaunting her figure in a white bikini with a baby blue lace trim, the blonde reality TV star was certainly feeling body-confident on her winter sun break\nStrutting his stuff in a pair of relaxed-fit swimshorts in navy blue, the handsome holidaymaker was later treated to a rub-down by his partner, who lathered him in suncream.\nSeemingly enjoying the moment, he appeared both relaxed and romanced.\nNot that it was all lazing around in the warm weather - instead they indulged in some friendly and refreshing watersports.\nHe's beach body-ready! Likewise, Sam ensured he flashed his torso as he went shirtless along the shoreline\nMaking a splash: Not that it was all lazing around in the warm weather - instead they indulged in some friendly and refreshing watersports\nRiding a wave: Seen strapping on some bright red lifejackets, they were briefly joined by a local instructor who showed them how to jet-ski - before venturing out on their own\nSeen strapping on some bright red lifejackets, they were briefly joined by a local instructor who showed them how to jet-ski.\nSam was first to lest the waters - quite literally - before him and Tiffany enjoyed a romantic jaunt into the skyline.\nHaving returned to their indulgent hotel, Tiffany took to Twitter to write: 'Far too relaxed. Can I just never return to England?'.\nThe wetter the better: Sam enjoys a power surf device, which projects users out of the water\nUp, up and away! Sam experiences life-off as he's pushed into the air by the jet stream\nAdrenaline rush: Sam clearly enjoyed his fun in the waves and wanted Tiffany to join in the fun\nEnjoying herself: Having returned to their indulgent hotel, Tiffany took to Twitter to write: 'Far too relaxed. Can I just never return to England?'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394009/Tiffany-Watson-Sam-Thompson-pack-PDA-enjoy-winter-sun-holiday-Maldives.html"}
