{"authors":[],"date_download":"2018-10-22 21:10:15","date_modify":"2018-10-22 21:10:15","date_publish":"2014-05-06 10:48:23","description":"Investigators would use high-tech radar equipment to search for sites in or near Portugal’s Praia da Luz resort, said a police source.","filename":"data/vaneerConsumption/MadeleineMcCannCaseSendsBritishCopstoPortugal.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/262436/140319-madeleine-mccann-mn-750_011c3f8f6f3f039de6dee142f7d2c2c9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_madeleine-mccann-case-sends-british-cops-portugal-n97916_1540242615.html","title":"Madeleine McCann Case Sends British Cops to Portugal","title_page":"Madeleine McCann Case Sends British Cops to Portugal","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nLONDON — Detectives investigating the 2007 disappearance of Madeleine McCann will start working at the Portuguese vacation resort where she went missing in the next two weeks, police said Tuesday.\n\"Activity will occur in forthcoming weeks,\" Mark Rowley, an Assistant Commissioner with London's Metropolitan Police said in a letter sent to editors.\n\"The most important task for me is to build momentum and protect our investigation given the many lines of inquiry that we see are necessary in order that we can do everything possible to solve the case,\" he added.\nThey would not provide anymore details in a letter to British media asking them to refrain from speculating on the case.\nBritish police would not comment on earlier reports that investigators would use high-tech equipment to search in or near Portugal’s Praia da Luz resort where the 3-year-old went missing seven years ago.\n`\nMadeleine's disappearance from an apartment in a Portuguese vacation complex on the night of May 3, 2007, garnered international attention. Since then, her parents Kate and Gerry McCann have worked to keep the case in the spotlight.\nKate McCann said on Thursday that great progress has been made with the investigation since London’s Metropolitan Police reopened the case in July after two years of reviewing case documents.\nPortuguese officials closed the original probe in 2008.Last month investigators launched an appeal for information about a man who police said targeted British tourists and their daughters in and near Portugal’s Prai de Luz resort around the time of Madeleine’s disappearance.\n— Henry Austin and F. Brinley Bruton","url":"https://www.nbcnews.com/news/world/madeleine-mccann-case-sends-british-cops-portugal-n97916"}
