{"authors":[],"date_download":"2018-10-30 21:17:21","date_modify":"2018-10-30 21:17:21","date_publish":"2018-10-29 15:00:00","description":"When you hear that Katie Watts began blending teas in college, you might think, “Who takes up...","filename":"data/vaneerConsumption/MadeinGeorgiafoodproductsKTeastea.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/10/29/Images/newsEngin.23262037_kteas2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/entertainment_dining_for-at_a27596f76ebe58f2384543cd230f252a__1540934241.html","title":"Made in Georgia food products: K-Teas tea","title_page":"Made in Georgia food products: K-Teas tea","title_rss":"NULL","source_domain":"ajc.com","text":"When you hear that Katie Watts began blending teas in college, you might think, “Who takes up tea blending as a hobby? And in college?”\nThen, you meet Watts, and it’s clear that blending tea wasn’t just a passing enthusiasm. Watts and her husband Dustin are the proprietors of K-Teas, an Atlanta-based company offering creative tea blends and mulling spices. And, Watts loves what she does.\n“You can paint with flavors and create amazing things for taste buds,” Watts said.\nKatie Watts blends and packages her teas in shared commercial kitchen space in Chamblee. CONTRIBUTED BY JR MARRANCI (For the AJC)\nIn 2013, she and Dustin moved to Atlanta. She was making tea blends just for herself and friends, and it seemed like the right time to see if her efforts would interest a larger audience. “We sold our first tea that December, at an artist festival at Grace Midtown Church,” she said. “It was great. People we didn’t know sampled our tea and bought it.”\nA Kickstarter campaign the next year brought funds to get K-Teas (the riff on “Katie” was dreamed up by Dustin) into a commercial kitchen, and to incorporate the business.\nSpiced orange chamomile, K-Teas’ most popular offering, is an herbal tea blend of Egyptian chamomile, orange peel, cinnamon, cardamom seeds, cocoa nibs, clove, rose petals and pink peppercorns. CONTRIBUTED BY HANNAH YOUNGBLOOD (For the AJC)\n“We grew the company by selling first at arts festivals and at smaller farmers markets,” she said. “Then, in 2015, we got into the Peachtree Road Farmers Market. We also started growing our online market, so we could sell nationwide, and now we’re growing our wholesale market.”\nK-Teas is appreciated for the elegance of its tea. Open a bag, and there are no dusty bits of tea with a jumble of crumbs that could be spices or who knows what. Each ingredient is distinct, and the fragrance is intoxicating. Their teas are so deliciously fragrant that they could be sold as potpourri or bath soaks.\nSurrounded by bags of dried roses, whole cloves, green cardamom pods, cinnamon chips, dried orange peel and much more, Watts, full-time assistant Hannah Ryden and a rotating crew of three to eight people work in a commercial kitchen, blending and packaging what they need for the day.\nDustin and Katie Watts are the founders of K-Teas, an Atlanta-based company. CONTRIBUTED BY K-TEAS (For the AJC)\nThey could be blending Hopeprint chai, a mix of organic Assam and keemun black tea with whole cardamom pods, black peppercorns and bits of cinnamon. (Ten percent of sales of Hopeprint chai go to benefit Syracuse, New York-based Hopeprint, a refugee resettlement organization.)\nOr, the tea could be Sazerac, from their line of cocktail tea blends, a mix of orange peel, star anise, cinnamon, fennel seed, allspice, rye berries, black pepper, peppermint, ginger and wormwood, all mixed with black tea.\n“I grew up watching my mom and grandmom cook,” Watts said. “They were not big recipe followers. They’d add a pinch of this and a drop of that, taste it, and keep going. It encouraged me to put my own spin on things.”\nThe story of how she created Autumn Evening is a case in point. “I was inspired by a tea my sister-in-law brought to my bridal shower,” she said. “We were drinking it one autumn evening, and I thought I could re-create it, but make it better. I did research on the ingredients, and started combining them. The base is caffeine-free rooibos, and it gets tartness of apple, orange and cranberry, a bit of spice from cinnamon and cloves. And it’s rounded out with hibiscus.”\nWith mulling spices, Watts again has put her spin on the traditional. In addition to the expected ingredients for a classic mulling spice of cinnamon, clove and orange, she adds hibiscus and cardamom.\nKatie Watts began experimenting with tea blends while in college. She sold her first blends to the public in 2013. CONTRIBUTED BY HANNAH YOUNGBLOOD (For the AJC)\n“I love working on the layers of flavors and digging through the history and cultural connections to create something delicious,” Watts said.\nOn the horizon for K-Teas are the launch of their bubble tea brand, the Boba Box, and doing more with their cocktail tea line. “Lots of people have been interested in those, and many are not traditional tea drinkers,” she said. She wants to serve those customers not only with teas, but with things like bitters to make at home, and mixers.\nTheir new Dragon Label brand offers pure teas. And, Watts is working on coffee shop partnerships, meeting with local roasters to create custom blends for their shops.\nAs for what tea Watts drinks, she said she tends to enjoy pure teas, like a good Darjeeling. But, she also loves Campfire (an herbal mix with cacao nibs, marshmallow root, cinnamon, oak chips, sarsaparilla and marigold petals) and spiced orange chamomile (their best seller) for fall evenings.\nYou can find K-Teas at k-teas.com, the Peachtree Road Farmers Market (through the end of its season on Dec. 15) and Citizen Supply at Ponce City Market.\nRELATED:\nMore Made in Georgia products\nRead the 2018 AJC Fall Dining Guide: Dining on Buford Highway\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/entertainment/dining/for-atlanta-woman-blending-teas-like-painting-with-flavors/WRAlcbPPdqb8mnrCCHCfSL/"}
