{"authors":[],"date_download":"2018-10-21 02:50:39","date_modify":"2018-10-21 02:50:39","date_publish":"2018-09-04 11:51:07","description":"She will lead a flagship effort for The Post, developing and managing a critical newsroom-wide initiative that will bring our journalism to new audiences.","filename":"data/vaneerConsumption/MadhulikaSikkajoinsasExecutiveProducerofnewflagshippodcast.json","image_url":"https://www.washingtonpost.com/resizer/ZIwdtFReqPMJh15-SBE1si-PDjE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/K745CI4HXM5QBLJKZWU3RUL5MU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_09_04__1540090239.html","title":"Madhulika Sikka joins as Executive Producer of new flagship podcast","title_page":"Madhulika Sikka joins as Executive Producer of new flagship podcast - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from Managing Editor Emilio Garcia-Ruiz and Director of Audio Jessica Stahl:\nWe are delighted to announce that Madhulika Sikka, the former executive editor at NPR News and executive producer of “Morning Edition,” will be joining us as the executive producer in charge of our new daily podcast. She will lead a flagship effort for The Post, developing and managing a critical newsroom-wide initiative that will bring our journalism to new audiences.\nAs executive producer for “Morning Edition,” Madhulika was credited with revitalizing the show and making it more relevant and lively. She was then promoted to run the NPR newsroom as executive editor, where she helped integrate audio and digital and led cross-newsroom coverage, including the Peabody Award-winning coverage of the Ebola crisis.\nMadhulika, who spent the past year as the public editor for PBS, has won Emmy, Peabody and duPont awards during her distinguished career, which includes working for NBC News in London and CBS News in Tokyo. She rose from researcher to senior producer during her more than 13 years with ABC News Nightline With Ted Koppel. More recently, she served as executive editor of the Mic digital news site and wrote the book “A Breast Cancer Alphabet” after her own experience with the disease.\nMadhulika has a master’s of philosophy in Economics and Politics of Development from Cambridge University in England and a bachelor’s degree from the University of London. She moved to the U.S., from her hometown of London, after graduate school, and lives with her husband in the District. They have two daughters in college. She likes to cook and read great books.\nShe will arrive Sept. 10 and immediately begin assembling a staff for the show, which will launch later in the year. Please join us in welcoming her.","url":"https://www.washingtonpost.com/pr/wp/2018/09/04/madhulika-sikka-joins-as-executive-producer-of-new-flagship-podcast/"}
