{"authors":["Anna Klassen"],"date_download":"2018-10-30 22:33:45","date_modify":"2018-10-30 22:33:45","date_publish":"2014-08-15 11:00:04","description":"Elisabeth Moss is having a killer year. Not only does she star on Mad Men, one of the hottest films on cable television, she's been nominated for more than one Emmy, has time to do indie passion projects on the side, and is rumored to take a leading…","filename":"data/vaneerConsumption/MadMensElisabethMossTalksTheOneILoveSpoilersHerGuiltyPleasure.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/8ad414db-7993-41c9-9135-3f696a8d2476.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35803-mad-mens-elisabeth-moss-talks-the-one-i-love-spoilers-her-guilty-pleasure_1540938825.html","title":"'Mad Men's Elisabeth Moss Talks 'The One I Love' Spoilers & Her Guilty Pleasure","title_page":"'Mad Men's Elisabeth Moss Talks 'The One I Love' Spoilers & Her Guilty Pleasure","title_rss":"NULL","source_domain":"bustle.com","text":"Elisabeth Moss is having a killer year. Not only does she star on Mad Men, one of the hottest films on cable television, she's been nominated for more than one Emmy, has time to do indie passion projects on the side, and is rumored to take a leading role in HBO's True Detective .(\"She can't say anything,\" her publicist told me). Now, Elisabeth Moss is promoting one of the most interesting and bizarre films of 2014, The One I Love, a film that still has Sundance audiences' mouths on the floor. In the vaguest of terms, the film's basic plot follows Sophie [Elisabeth Moss] and Ethan [Mark Duplass], a couple whose marriage is on the brink of falling apart. They escape for a weekend in pursuit of reconciliation, only to discover an unusual dilemma awaits them.\nBut the dilemma that they will face is a spoiler to rival spoilers. To reveal it would deny you the pleasure of discovering it yourself. So when I spoke to Elisabeth Moss about the film, we attempted to talk in a way that wouldn't reveal the movie's biggest secret. So, while the interview that follows is spoiler free, I would suggest a second read of our conversation after viewing the film, once the puzzle pieces have fallen into place.\nAnna: So, I don't really know how to execute a conversation about this film without giving everything away immediately.\nElisabeth: Ha! I've been doing it for a little while now, so I'll help you out.\nAnna: Perfect. So what drew you to the material?\nElisabeth: Honestly I didn't feel like I'd read anything like it. It was such a great idea. I just said \"Yes!\" I signed on immediately. I couldn't wait to see more, to see how we'd flesh out the script. I'd known Mark [Duplass] for a while and I wanted to work with him, and Charlie [McDowell]. They are so smart and creative and I kind of had the feeling I was getting in on something at the ground floor.\nAnna: We live in a world where news and spoilers travel at lightning speed. Did you have any hesitations in taking on a film where keeping the ending a secret is so crucial?\nElisabeth: Two things: One, I'm so used to not being able to talk about things because of Mad Men. So for me, I didn't think anything of it. And two, we didn't know we were going to be trying to keep it a secret. We thought it would be impossible. But once it debuted at Sundance, our first reviews came out and the critics were the ones that were saying, \"Hey there's this great movie but we're not going to talk about what it's about.\" So we decided to go for it and keep it a secret. It's funny that in today's day and age, that's a surprising idea. We're so used to Twitter where everyone talks about everything and information is so available. The idea of not talking about scenes in a movie is like revolutionary.\nAnna: Completely. There is a duality to your character, what was it like to explore someone as multidimensional as Sophie?\nElisabeth: The thing about not talking about the spoiler, that's the most difficult thing. I'm looking forward to when enough people have seen this movie and we feel like we can finally talk about it.\nAnna: Well at its core, this movie is about a failing relationship. Why do you think these two people are so determined to make it work?\nElisabeth: I think at the beginning of the film they don't really know. They're at this 50/50 place where they don't know whether or not they should try to make it work. It's a now or never moment in their relationship. I think when you're married and you love eachother, they're not going to just throw this out, it's their Hail Mary pass. They get themselves in a situation that is potentially way worse for their relationship, it could be really dangerous. But somehow it does clarify things for them in the way it's supposed to.\nAnna: Can you talk a little bit about the film's improvisation? Charlie McDowell, the director, gave you and Mark a lot of leeway. Did that make your job harder or easier?\nElisabeth: Yeah... I was not into the improvisation. I have a huge respect for writers. I do not consider myself a writer, if left entirely to my own devices, it will be a lot of \"um\"s and \"like\"s and swearing. I'm not a good writer. None of us wanted the film to have an improvised quality, we wanted it to feel like a movie, to look like a movie, even though it was shot in 15 days. So I was the one that was constantly fighting to be given lines.\nAnna: I was really impressed by the film's ability to be so compelling and enthralling with few bells and whistles. It was really just you and Mark in a house for most of film. Do you prefer this stripped down sense of storytelling?\nElisabeth: I think it's something that worked well for us in the situation. You have to have a good script to be able to do it. [The filmmakers] did something really smart: They had two people who knew eachother, so their relationship was already in the bag, they didn't have to worry about building chemistry.\nAnna: The trailer for this film is partially deceiving in the sense that it plays like a straight comedy. I thought it was darker, like a thriller. Did you pick up on any eerie elements when reading the script?\nElisabeth: I always pictured it as a Charlie Kaufman kind of thing. It does have these creepy and weird elements to it. The first time I saw the movie it was a lot creepier than I thought it would be. I had a close friend who went to see it and she was like, \"Umm.. you didn't tell me it was scary!\" She was expecting some fun little indie comedy. She's like \"I couldn't sleep!\" I never pictured it as a romcom, but I think it's one of the reasons I wanted to do it. However, I'm all about doing a straight romantic comedy at some point, those are my favorite kinds of movies. I would do Runaway Bride 7.\nAnna: I'd love to see that. I think it was the music that really added that eery element, it was almost like a third character in the film.\nElisabeth: Totally, you're so right. It's so about the music, it really adds this creepy, creepy element to it. They did such a beautiful job.\nAnna: Talking in vague terms, do you think the ending was satisfying to your character's arc?\nElisabeth: The ending... you know, I obviously have an opinion about the ending. I have a pact with the writer Justin [Lader] that we aren't going to talk about it. But I go back and forth on what I feel about the ending. I used to think about it one way, but lately I've been thinking about it another way. I know that sounds so vague for people who haven't seen the movie. I love that it's open for discussion, but I will never tell what I think it is. I think people should be able to think about it themselves, you know.\nAnna: I feel like its hard, in a film like this, with supernatural elements, to establish rules — if we're going to allow this to happen how come this can't happen — Did this cause any frustrations?\nElisabeth: Yes. Charlie and Justin, before we started filming, worked out all of the logic of the film, and all of the logic of that supernatural element in the film. Since we were moving so quickly and creating a lot of it as we went along, it would be so easy to make a misstep, defy our own logic and trip over ourselves. They were these nerdy masters of the world they created and they knew everything. I'd be like, \"Why can't I blah blah blah?\" and they'd be like \"blah blah!\" And I'd be like, \"Ohhhh....\" I ask a lot of questions. I was the person saying, \"I don't get it!\" Even to this day we'll do Q&As and Justin and Charlie will explain something, and I'll literally look at them and be like, \"Really? I had no idea!\"\nThe One I Love is currently available on VOD and hits theatres on August 22.\nImages: Submarine Entertainment","url":"https://www.bustle.com/articles/35803-mad-mens-elisabeth-moss-talks-the-one-i-love-spoilers-her-guilty-pleasure"}
