{"authors":["Kipp Jones"],"date_download":"2018-10-30 19:30:39","date_modify":"2018-10-30 19:30:39","date_publish":"2015-06-28 19:00:04","description":"Residents of a farming community in New York are upset at pop singer Madonna, and claim she cheated the system when she purchased an old potato farm next to her home in the Hamptons. |","filename":"data/vaneerConsumption/MadonnatoReceiveFarmingTaxIncentivesinNYforPlantingTreesNeighborsClaimFraud.json","image_url":"https://media.breitbart.com/media/2015/06/madonna-sings-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_06_28__1540927839.html","title":"Madonna to Receive Farming Tax Incentives in NY for Planting Trees, Neighbors Claim Fraud","title_page":"Madonna to Receive Farming Tax Incentives in NY for Planting Trees, Neighbors Claim Fraud | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Residents of a farming community in New York are upset at pop singer Madonna, and claim she cheated the system when she purchased an old potato farm next to her home in the Hamptons.\nThe New York Post reports Madonna, who owns a $4.9 million mansion next door, recently purchased a taxpayer-owned piece of land in the Hamptons, and her plan to use the property as a tree nursery is more about the financials and privacy than the farming.\nSuffolk County officials approved a plan for Madge to buy the property for use as a nursery last year, and in June her crews have been planting Leyland Cypress, eastern white pines and Robusta juniper trees.\nThe star will reportedly collect multiple tax benefits because of the land’s “agricultural” use, and East Hampton farmer Sam Lester is calling it “a front and a fraud.”\nThe problem for he and others: the county and the Town of Southampton purchased the development rights to the 24-acre farm, once owned by the Grabowski family, for $10 million in 2010, and planned to preserve it.\nMadonna only paid $2.2 million, and because the land was specified for “production for commercial purposes of agricultural products,” residents say she is only growing the trees out of a legal obligation and to give her mansion more privacy.\n“Madonna should be ashamed for stealing from [taxpayers],” Lester told the Post, before saying government officials should be “embarrassed” by the taxpayer money lost in the deal.\n“Someone would have paid $17.5 [million] — substantially more than what it sold for” if development rights were intact, Douglas Elliman broker Enzo Morabito told the paper.\nMadonna is set to receive big tax breaks from the county that are only given to farmers, and will pay just $2,260.28 a year in local property taxes.\nThe Post reports the owner of a single acre across the street pays $6,841.52 annually.\n“That’s not a nursery,” area farmer John White said. “She just doesn’t want people to see her riding — and falling.”","url":"https://www.breitbart.com/entertainment/2015/06/28/madonna-to-receive-farming-tax-incentives-in-ny-for-planting-trees-neighbors-claim-fraud/"}
