{"authors":["Ciara Farmer For Mailonline"],"date_download":"2018-10-23 03:00:02","date_modify":"2018-10-23 03:00:02","date_publish":"2017-03-16 13:35:08","description":"The 58-year-old songstress looked typically sensational in the clip in which she wore a funky caged top paired with fingerless leather gloves with a studded cross","filename":"data/vaneerConsumption/MadonnagorgesoncrispsonInstagram.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E548FEB00000578-0-image-a-24_1489672107089.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320058_Madonna-delightedly-gorges-crisps-hilarious-clip_1540263602.html","title":"Madonna gorges on crisps on Instagram","title_page":"Madonna gorges on crisps on Instagram | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She is famed for her militant fitness regime and strict macrobiotic diet.\nYet Madonna took a break from the diet on Wednesday as she posted a hilarious clip in which she gorged on a pack of crisps while announcing the hunt for her new fitness trainer.\nThe 58-year-old songstress looked typically sensational in the clip in which she wore a funky caged top paired with fingerless leather gloves with a studded cross along the top as she devoured the cheeky treat.\nMadonna showed her fun side as she chatted away in the video while revealing she was on the hunt for a new trainer to help maintain her famously sensational figure.\nAs she chatted to the camera, she held on to a large pack of crisps which she went on to tear open and withdraw a crisp with delight.\nIn the Instagram video she said: 'Hey everyone, hey everyone... I'm talking to the light! I'm teaming up with Dance On to find my new trainer. Submit to #madonnachallenge. Shutup over there!'\nMadonna's personal trainer of two years Craig Smith previously spoke to MailOnline about the lengths the stunner goes to in her bid for the perfect body.\nEating away: Yet Madonna took a break from the diet on Wednesday as she posted a hilarious clip in which she gorged on a pack of crisps while announcing the hunt for her new fitness trainer\nChomp: The 58-year-old songstress looked typically sensational in the clip in which she wore a funky caged top paired with fingerless leather gloves with a studded cross along the top as she devoured the cheeky treat\nBut behind the scenes the Queen of Pop is a woman of discipline, focus and unwavering work ethic – according to personal trainer Craig Smith.\nSmith has worked alongside Madonna for two years, and revealed to Daily Mail Australia just what it takes to keep one of music’s biggest stars in shape. Smith is currently in Australia with Madonna for her Rebel Heart Tour.\nBut despite her travel commitments and demanding on stage schedule, Madonna still makes the time to work out six days a week for a minimum of 30 minutes.\nTo make is easier, Smith said he has a ‘portable gym’ of everything they need to maintain the 57-year-old's regular routine.\nBiting off: But behind the scenes the Queen of Pop is a woman of discipline, focus and unwavering work ethic – according to personal trainer Craig Smith\nLook at me: Smith has worked alongside Madonna for two years, and revealed to Daily Mail Australia just what it takes to keep one of music’s biggest stars in shape. Smith is currently in Australia with Madonna for her Rebel Heart Tour\n‘I vary the workouts every single day,’ Smith said. ‘She does a combination of circuit training, interval training and resistance training. Dance is obviously a huge part of that.’\nSmith said he varies the workouts to include bar training, yoga, martial arts and boxing to cover everything from core strength to flexibility.\nWhen using the bar method of training Madonna will use light weights, between just 2.2 and 1.1 kilograms (five and 2.5lbs), with 20 to 30 reps of each exercise.\n‘We focus on elongating the muscles … and maintaining a svelte, lean dancer’s physique,’ Smith said.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320058/Madonna-delightedly-gorges-crisps-hilarious-clip.html"}
