{"authors":["Associated Press"],"date_download":"2018-10-23 04:37:24","date_modify":"2018-10-23 04:37:24","date_publish":"2016-01-29 20:20:16","description":"MADRID (AP) — The transfer bans imposed by FIFA on Real Madrid and Atletico Madrid have been temporarily suspended until the appeals process is finalized, th...","filename":"data/vaneerConsumption/MadridclubssayFIFAstransferbanshavebeenputonhold.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:a2fc8135caa34c7fade1b490231e8d9a-4PuZeKVXE7cd9005b2c876df7661-455_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423348_Madrid-clubs-say-FIFAs-transfer-bans-hold_1540269444.html","title":"Madrid clubs say FIFA's transfer bans have been put on hold","title_page":"Madrid clubs say FIFA's transfer bans have been put on hold | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Madrid clubs say FIFA's transfer bans have been put on hold\nMADRID (AP) — The transfer bans imposed by FIFA on Real Madrid and Atletico Madrid have been temporarily suspended until the appeals process is finalized, the soccer's world governing body said Friday.\nFIFA confirmed that its appeals committee granted the clubs relief from the sanctions.\nThe decision comes two weeks after both clubs were banned from registering new players for two transfer windows for breaching rules involving underage players. The bans would only take effect at the start of the next summer window, so they could still be imposed pending the outcome of the appeals process.\nReal Madrid's coach Zinedine Zidane gestures during the La Liga soccer match between Real Betis and Real Madrid, at the Benito Villamarin stadium, in Seville, Spain, Sunday, Jan. 24, 2016. (AP Photo/Angel Fernandez)\nReal Madrid and Atletico announced FIFA's decision with brief statements on their websites. Both teams have denied wrongdoing regarding the registering of underage players.\nAtletico Madrid said that in its appeal it \"stated that (the) club did not agree with the sanctioning resolution and ... considered that (it) had acted within the law in all cases.\"\nIf they lose the appeals, the Spanish clubs won't be allowed to register anyone until after the 2016-17 season. The teams can reach agreements to buy players but cannot register them to play until then.\nFIFA also issued reprimands and fined both clubs. The governing body had said the clubs \"violated several provisions concerning the international transfer and first registration of minor players.\"\nBarcelona served a similar sanction for 2015 after stalling the transfer ban to enable them to sign players in the 2014 window. The Catalan club signed players such as Arda Turan and Aleix Vidal after the ban took effect again, but couldn't register them until last month.\n___\nTales Azzoni on Twitter: http://twitter.com/tazzoni","url":"https://www.dailymail.co.uk/wires/ap/article-3423348/Madrid-clubs-say-FIFAs-transfer-bans-hold.html"}
