{"authors":[],"date_download":"2018-10-30 19:26:19","date_modify":"2018-10-30 19:26:19","date_publish":"2016-04-29 12:13:48","description":"CARACAS, Venezuela, April 29 (UPI) — The Venezuelan opposition has gathered more than 1 million signatures over the course of two days for a","filename":"data/vaneerConsumption/Madurorecallpetitiontops1MsignaturesinVenezuela.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/news__1540927579.html","title":"Maduro recall petition tops 1M signatures in Venezuela","title_page":"Maduro recall petition tops 1M signatures in Venezuela - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"CARACAS, Venezuela, April 29 (UPI) — The Venezuelan opposition has gathered more than 1 million signatures over the course of two days for a petition to hold a referendum in order to recall President Nicolas Maduro.\nEl Pais reported that the opposition gathered 1,102,236 signatures as part of the first round of the petition. That was five times more than the 200,000 required by the National Electoral Council, also known as the CNE.\nAfter the signatures are verified the opposition must start the next step of the process, which will require signatures from 20 percent of the South American country’s voting-eligible population be gathered within three days.\n“We don’t need any more signatures, we are preparing for the next goal: 4 million,” Governor Henrique Capriles Radonski, a political rival of Maduro, said.\nDespite the early victory for the opposition, Democratic Unity Table electoral expert Anibal Sanchez told Fox News Latino that he expects further obstacles, including delays and arbitrary vetoes as the process moves forward.\n“They released the official forms, but delays will happen again in every step of the process,” he said in reference to the 90 days it took CNE to release the forms required to collect the signatures. “They kept the right to invent ways to eliminate or question some of the signatures if they want.”\nThe CNE is expected to announce whether or not the signatures have been verified in five business days, which will actually take two weeks because public administration only works Monday and Tuesday until 1:00 in the afternoon, by order of the government. Earlier this week, Maduro ordered a two-day work week for all federal government officials in reaction to the country’s energy crisis.\nOpposition leadership believes the government is using this operating schedule to delay the referendum process until next year.\n“If we realize that that is going to be the case, other options will have to be considered, such as massive protests or calling for a Constituent Assembly to modify the Constitution and replace all the elected officials,” Congressman Ismael Leon said.","url":"https://www.breitbart.com/news/maduro-recall-petition-tops-1m-signatures-in-venezuela/"}
