{"authors":["Kristy Johnson","Monique Friedlander For Daily Mail Australia"],"date_download":"2018-10-22 22:37:40","date_modify":"2018-10-22 22:37:40","date_publish":"2017-03-16 04:17:59","description":"He is one of the few Married At First Sight contestants who has enjoyed a largely successful on-screen relationship this season.","filename":"data/vaneerConsumption/MAFSSimonwonttellAlenethathelovesher.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/06/00/3DFDDF6500000578-0-image-a-4_1488760156721.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318810_MAFS-Simon-wont-tell-Alene-loves-her_1540247860.html","title":"MAFS' Simon wont tell Alene that he loves her","title_page":"MAFS' Simon wont tell Alene that he loves her | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He is one of the few Married At First Sight contestants who has enjoyed a largely successful on-screen relationship this season.\nAnd Simon McQuillan has revealed that his 'slow burn' approach to romance is the key behind his lasting romance with Alene.\n'I don't go just throwing out the L word,' the 39-year-old told QT this week, complaining that the show's experts would relentlessly bring up the topic of love.\n'I don't go just throwing out the L word': Married At First Sight's Simon McQuillan has revealed that his 'slow burn' approach to romance is the key behind his lasting romance with TV wife Alene\n'We had to get to know each another and if that takes another two weeks or two months or two years longer compared to the people next door then that's our business,' he told QT.\n'Other couples may have been all guns blazing, but a few weeks later they didn't want to know each other ever again. Slow and steady wins the race,' he later added.\nSimon has previously lashed out at producers for constantly askuing questions about his feelings toward Alene, having recently told Who! magazine that it made him want to quit the show.\nSlow and steady: 'We had to get to know each another and if that takes another two weeks or two months or two years longer compared to the people next door then that's our business,' he told QT\nToo pushy? Simon has previously lashed out at producers for constantly askuing questions about his feelings toward Alene, having recently told Who! magazine that it made him want to quit the show\nEarlier this week, Simon revealed to New Idea, that he and Alene are still going strong, hinting at the possibility of babies.\n'All my friends are getting married and having kids,' he said.\n'Becoming a dad is definitely something I've thought about,' the farmer shared exclusively to New Idea.\n'All my friends are getting married and having kids': Earlier this week, Simon revealed to New Idea , that he and Alene are still going strong, hinting at the possibility of babies\nAnd despite Alene staying mum as to whether a baby is on the cards, a friend of the 31-year-old told the magazine that she won't waste any time.\n'Alene went on the show because she found that the men she was dating in Sydney wanted to take things slow.\n'She is tired of waiting around and doesn't see any reason for her and Simon to wait any longer to live their dreams,' the source continued.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318810/MAFS-Simon-wont-tell-Alene-loves-her.html"}
