{"authors":["Daily Mail Australia Reporter"],"date_download":"2018-10-23 03:50:30","date_modify":"2018-10-23 03:50:30","date_publish":"2017-03-16 14:54:06","description":"It's one of the highest-rated shows on TV. But not everybody is a fan of Married At First Sight, with one psychologist calling it 'the psychological sewer of Australian television'.","filename":"data/vaneerConsumption/MAFSisasewerofAustralianTVsayspsychologist.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54BAE600000578-0-image-a-37_1489676029999.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320560_Psychologist-calls-MAFS-sewer-Australian-TV_1540266630.html","title":"MAFS is a 'sewer of Australian TV' says psychologist","title_page":"MAFS is a 'sewer of Australian TV' says psychologist | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's one of the highest-rated shows on TV.\nBut not everybody is a fan of Married At First Sight, with one expert calling it 'the psychological sewer of Australian television'.\nSpeaking to The Daily Telegraph, psychologist Dr. Michael Carr-Gregg said the Channel Nine reality series could do some 'serious damage' to contestants.\nScroll down for video\n'It's the psychological sewer of Australian television!' Dr. Michael Carr-Gregg slammed reality TV series Married At First Sight, in an interview with The Daily Telegraph\n'I know it rates its socks off, but so did the Colosseum in Rome because people liked watching lions rip Christians apart,' he added.\nDaily Mail Australia has reached out to Channel Nine for comment.\nWhile Dr. Carr-Gregg had some harsh things to say about the 'social experiment', the show's psychologist, John Aiken, insists the participants are well cared for.\n'From the outset of this show, it has been of utmost importance to myself and all other professionals involved to constantly assess and monitor the well-being of all the participants in the social experiment,' he clarified to 9Honey.\n'I know it rates its socks off, but so did the Colosseum in Rome because people liked watching lions rip Christians apart,' the expert told The Daily Telegraph on Friday\nJohn adds: 'Duty of care is something that we take extremely seriously.'\nClare Verrall, who appeared in the second season, has been very outspoken when it comes to criticising Married At First Sight.\n'You go through this whole audition process with the producers and the casting managers until you get to the point where you meet with the executive producers,' she explained to The Kyle and Jackie O Show last year.\n'Duty of care is something that we take extremely seriously': While Dr. Carr-Gregg had some harsh things to say about the 'social experiment', the show's psychologist, John Aiken, insists the participants are well cared for\nEmotional journey: John claimed that he and the other professionals involved 'constantly assess and monitor the well-being of all the participants in the social experiment'\n'And they think, \"Wow you’re a great character and we’ve got another great character that we’ve either approached or headhunted or may have applied and we’re going to put you guys together\".\n'Some of these couples were legitimately put together for love but some of it is just for drama. And I was unlucky enough to be the drama couple last year.'\nClare also alleged that her TV 'husband' Jono never actually applied to go on the show, saying: 'He had a friend who worked at the network who knew that he had a very hot head and would blow up and make great TV. So he approached him.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320560/Psychologist-calls-MAFS-sewer-Australian-TV.html"}
