{"authors":["Caitlin O'Toole For Dailymail.Com"],"date_download":"2018-10-22 23:38:48","date_modify":"2018-10-22 23:38:48","date_publish":"2016-01-11 06:43:55","description":"But actress Maggie Gyllenhaall's patterned dress perfectly blended into the background as she arrived at HBO's star-studded Golden Globes after-party on Sunday.","filename":"data/vaneerConsumption/MaggieGyllenhaaljoinsHarrisonFordandAmyAdamsatHBOsGoldenGlobes2016party.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/06/3004E59000000578-0-image-a-42_1452494163010.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393464_Where-d-Maggie-Gyllenhaal-s-plunging-floral-dress-blends-background-joins-Harrison-Ford-Amy-Adams-HBO-s-party_1540251528.html","title":"Maggie Gyllenhaal joins Harrison Ford and Amy Adams at HBO's Golden Globes 2016 party","title_page":"Maggie Gyllenhaal joins Harrison Ford and Amy Adams at HBO's Golden Globes 2016 party | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Celebrities typically carefully choose their awards show outfits in order to stand out on the red carpet.\nBut actress Maggie Gyllenhaall's patterned dress perfectly blended into the background as she arrived at HBO's star-studded Golden Globes after-party on Sunday.\nThe 38-year-old wore a floral yellow and black gown that matched the bright yellow background at the HBO bash.\nCamouflage: Actress Maggie Gyllenhall wore a black and yellow floral dress that matched the background as she arrived at HBO's Golden Globes after-party at the Beverly Hilton on Sunday\nThe actress's plunging gown featured a swirling floral pattern and a striking flower detail on one shoulder.\nThe HBO background showed their logo on a black background with bright yellow leaves and white roses.\nMaggie wore her dark hair curled around her face, and added pretty bright pink lipstick for some extra color.\nUnique look: Maggie's dress had a plunging neckline and large flower on one shoulder\nFloral pattern: The actress wore gold drop earrings and bright pink lipstick\nThe Honorable Woman star accessorized with gold drop earrings, gold bangles and a gold clutch.\nOnce inside the party, the actress stopped to chat with fellow star Amy Adams at the after-party at the Beverly Hilton.\nAmy, 41, looked great in a fitted red gown with beaded waist and sides.\nThe redhead wore her long hair down and showed off her toned arms in the gown's sleeveless design.\nBright spark: Amy Adams wore a bright red gown with sequined waist and sides\nAlso at the HBO party were star Harrison Ford and his wife, actress Calista Flockhart.\nThe Star Wars actor, 73, seemed in high spirits, laughing and pulling Supergirl actress Calista, 51, close for an embrace.\nHarrison wore a classic tuxedo, while Calista looked pretty in a blue gown with embossed bodice and flowing short sleeves.\nBig smiles: Harrison Ford and wife Calista Flockhart were in high spirits as they attended the party\nCracking up: The Star Wars actor and Calista shared a joke after the show\nLook of love: Harrison pulled his wife close as they goofed around at the HBO bash\nThe actor also caught up with British star David Oyelowo, who looked stylish in a purple patterned tuxedo.\nThe 39-year-old Selma star beamed as he posed with the screen legend.\nDavid added a black bow tie and black dress shoes to his tuxedo, which featured a tiny blue square pattern.\nSharp: Harrison chatted with British actor David Oyelowo, who looked stylish in a purple tuxedo\nLooking sharp: The British actor stood out in a fashion-forward purple tuxedo\nActor Jon Hamm also attended the party, bringing his new Golden Globe for Best Actor in a television drama with him.\nThe Mad Men star, 44, flashed a big smile as he arrived at the party after joking onstage that he wanted the beloved show to end on a Chumbawamba song.\nActor Bryan Cranston also attended the party with wife, actress Robin Dearden.\nDon Draper returns: Jon Hamm won a Golden Globe for his iconic role on Mad Men, which ended last year\nElegant: Trumbo actor Bryan Cranston and Robin Dearden looked stylish as they attended the HBO bash\nHe's done it again: Host Ricky Gervais chatted with actor Sean Bean after making fun of everyone from Caitlyn Jenner to Ben Affleck during the awards show\nNot a fan? Harrison Ford looked less than impressed as he chatted with the British comedian\nThe Trumbo star wore a black tuxedo and smiled as he posed with Robin, who looked elegant in a pink and red floral skirt and dark top.\nRicky Gervais was also at the party, no doubt celebrating his hilarious return to the Golden Globes.\nThe Office star took no prisoners as he ripped into celebrities during the awards ceremony, including joking that Caitlyn Jenner was bad for female drivers, calling Sean Penn 'a snitch' and joking that Matt Damon was the only person Ben Affleck hasn't cheated on.\nShow-stopper: Actress Regina King wore a stunning gold gown with white cape\nHe also ambushed Mel Gibson at the microphone to ask 'what the f*** does sugart**s mean?', in a reference to one of the Aussie actor's infamous rants.\nRicky flashed a big smile as he posed with Game of Thrones star Sean Bean, who wore a blue suit and looked thrilled to meet the controversial comedian.\nHow To Get Away With Murder star Viola Davis also attended the bash, looking gorgeous in a shimmering silver and blue gown by Marchesa.\nStrike a pose: Laverne Cox flashed her cleave in a plunging white gown with matching cape\nGorgeous: Actress Viola Davis, left, wore a pretty Marchesa gown covered with silver star detailing, while Queen Latifah went for a light blue dress with shimmering neckline\nThe 50-year-old's pretty dark blue dress featured a sheer chest and sleeves, covered in a silver star embellishment.\nRapper and actor Queen Latifah, 45, also went with a blue, sparkling gown for the evening. The Bessie star's light blue gown featured a glittery neckline, and she wore matching silver drop earrings.\nAnd Orange Is The New Black star Laverne Cox, 31, showed off her cleavage in a plunging white dress with sheer sides, and a stylish cape.\nDownton Abbey actress Joanne Froggatt, 35, also attended the HBO party, wearing a flowing purple gown.\nEnglish roses: Downton Abbey star Joanne Froggatt wore a flowing purple gown, while Game of Thrones actress Emilia Clarke wore a tight white dress with red rose design\nScandal star: Tony Goldwyn posed with costar Bellamy Young, who wore a plunging black ensemble\nDare to bare: Bellamy Young, left, showed off her figure in a revealing black dress, while Life in Pieces actress Angelique Cabral, right, flashed some leg in a black gown\nThe British star bared her cleavage and shoulders in the flowing dress, which featured a sheer inlay across the chest.\nAlso at the party was Game of Thrones star Emilia Clarke, look looked stunning in a white dress with a red floral pattern and bright red lipstick.\nScandal stars Tony Goldwyn and Bellamy Young also attended the star-studded after-party.\nLBDs: Kathryn Hahn, left, wore a plunging black and silver dress while Disney star Laura Marano wore a skin-tight gown with sheer panels and flowing train\nTaking the plunge: Law & Order actress Elisabeth Rohm wore a low-cut beige gown with a silver and gold pattern\nHaving fun: Brooklyn Nine-nine star Andy Samberg looked sharp in a black tux\nClassy: Liev Schreiber wore a black suit and slim tie as he arrived at the party\nBellamy, 45, flashed her cleavage in a skin-tight dress with daring cut-outs on the front and sides, and a high center slit.\nAlso at the star-studded party were actors Kathryn Hahn and Laura Marano, who both chose black gowns.\nTransparent actress Kathryn, 45, wore a plunging black dress with a silver pattern, paired with silver strappy heels.\nAustin & Ally actor Laura, 20 showed off her figure in a tight black dress with sheer panels across the thighs, arms and chest, and a frilly train.\nTransparent stars: Amy Landecker, a male guest, Kathryn Hayn and Jay Duplass arrive at the HBO party\nCry for attention: The cast goofed off as the tumbled to the floor\n2016 GOLDEN GLOBE AWARDS WINNERS- TELEVISION Best Performance by an Actress in a Limited Series or Motion Picture Made for Television Uzo Aduba, Orange is the New Black Joanne Froggatt, Downton Abbey Regina King, American Crime Judith Light, Transparent Maura Tierney, The Affair Best Performance by an Actor in a Limited Series or Motion Picture Made for Television Idris Elba, Luther Oscar Isaac, Show Me a Hero David Oyelowo, Nightingale Mark Rylance, Wolf Hall Patrick Wilson, Fargo Best Performance by an Actress in a Television Series – Drama Caitriona Balfe, Outlander Viola Davis, How to Get Away with Murder Taraji P Henson, Empire Eva Green, Penny Dreadful Robin Wright, House of Cards Best Performance by an Actor in a Television Series – Musical or Comedy Aziz Ansari, Master of None Gael Garcia Bernal, Mozart In The Jungle Rob Lowe, The Grinder Patrick Stewart, Blunt Talk Jeffrey Tambor, Transparent Best Performance by an Actor in a Television Series – Drama Jon Hamm, Mad Men Rami Malek, Mr Robot Wagner Maura, Narcos Bob Odenkirk, Better Call Saul Liev Shreiber, Ray Donovan Best Performance by an Actress in a Television Series – Musical or Comedy Rachel Bloom, Crazy Ex-Girlfriend Jamie Lee Curtis, Scream Queens Julia Louis Dreyfus, Veep Gina Rodriguez, Jane the Virgin Lily Tomlin, Grace and Frankie\nBest Performance by an Actress in a Supporting Role in a Series, Limited Series or Motion Picture made for Television Lady Gaga, American Horror Story Sarah Haye, Flesh and Bone Felicity Huffman, American Crimes Queen Latifah, Bessie Kirsten Dunst, Fargo Best Television Limited Series or Motion Picture Made for Television American Horror Story Fargo Flesh And Bone Stars Wolf Hall Best Performance by an Actor in a Supporting Role in a Series, Limited Series or Motion Picture made for Television Alan Cumming, The Good Wife Damian Lewis, Wolfhall Ben Mendelson, Bloodline Tobias Menzies, Outlander Christian Slater, Mr Robot Best Television Series - Musical or Comedy Orange Is The New Black Silicon Valley Transparent Veep Casual Mozart In The Jungle Best Television Series - Drama Empire Game of Thrones Mr Robot Narcos Outlander","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393464/Where-d-Maggie-Gyllenhaal-s-plunging-floral-dress-blends-background-joins-Harrison-Ford-Amy-Adams-HBO-s-party.html"}
