{"authors":[],"date_download":"2018-10-22 22:16:26","date_modify":"2018-10-22 22:16:26","date_publish":"2014-05-09 16:18:11","description":"Mail-order chicks from a single Ohio hatchery have infected 63 people with Salmonella, putting a third of them into the hospital.","filename":"data/vaneerConsumption/MailOrderChicksInfect63PeopleCDCSays.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/408006/140429-chickens-jms-2330_24cb39eb25efac82eb9ef600e730d6bc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_health-news_mail-order-chicks-infect-63-people-cdc-says-n101541_1540246586.html","title":"Mail-Order Chicks Infect 63 People, CDC Says","title_page":"Mail-Order Chicks Infect 63 People, CDC Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMail-order chicks from a single Ohio hatchery have infected 63 people with Salmonella, putting a third of them into the hospital, federal health officials said Friday.\nIt’s the sixth outbreak linked to Mt. Healthy Hatcheries in Ohio, and it’s affecting people in 23 states, the Centers for Disease control and Prevention reports.\n“This hatchery uses multiple source flocks to obtain eggs and chicks, so it is unclear at this time where the contamination originated. This is the same mail-order hatchery that has been associated with multiple outbreaks of human Salmonella infections linked to live poultry in the past, including in 2012 and 2013,” CDC says in an update on its website.\nThe CDC’s been following up on infections linked to pet chickens and has found a startling number — nearly 2,200 between 1990 and 2013, including five deaths.\nChickens and other poultry are often infected with Salmonella. It can be carried on their eggs and feathers and in their droppings.\n“Always wash your hands thoroughly with soap and water right after touching live poultry or anything in the area where they live and roam,” CDC advises. “Do not let live poultry inside the house.”\nPeople also frequently kiss the birds and they really should not, experts say.\nCDC estimates that for every salmonella infection they know about, there are 30 others that are never reported.\nSalmonella can cause severe diarrhea as well as fever and stomach cramps.","url":"https://www.nbcnews.com/health/health-news/mail-order-chicks-infect-63-people-cdc-says-n101541"}
