{"authors":["Breitbart London"],"date_download":"2018-10-30 18:28:10","date_modify":"2018-10-30 18:28:10","date_publish":"2016-01-31 09:34:46","description":"From the Daily Mail: The romantic picture shows a young couple in love as they pose in the summer sunshine on their wedding day. Syed Bokhari and his |","filename":"data/vaneerConsumption/MAILTheCalaisCampHoneymoonCoupleCreatingMilitancyAmongstMigrants.json","image_url":"https://media.breitbart.com/media/2016/01/syemona.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_01_31__1540924090.html","title":"MAIL: The Calais Camp Honeymoon Couple Creating 'Militancy' Amongst Migrants","title_page":"MAIL: The Calais Camp Honeymoon Couple Creating 'Militancy' Amongst Migrants | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The romantic picture shows a young couple in love as they pose in the summer sunshine on their wedding day.\nSyed Bokhari and his bride Mona Dohle were pictured before they left to spend their honeymoon visiting migrants at the squalid ‘Jungle’ camp at Calais last year.\nThey were portrayed in the Communist newspaper Morning Star as an ordinary West London couple who had suddenly been inspired to make the humanitarian trip.\nThe newly-weds, both 28, said they were proud of setting up an organisation, London2Calais, to collect food and clothes for migrants from the Middle East and Africa who wait in the French port to slip illegally into UK-bound lorries and trains.\n…\nEarlier this month, during a protest against Government immigration policy outside St Pancras station’s Eurostar terminal, Mona told a crowd of banner-waving London2Calais supporters: ‘David Cameron and Theresa May, they’re killing people, and that’s something we can’t accept.’\nMore disturbingly, I have discovered that the two founders of London2Calais have marched with their followers alongside anarchist groups whom French police this week complained had encouraged migrants to riot in Calais.\nThe French officers said 300 of the 4,000 migrants, aged between 17 and 25, are under the influence of far-Left activists from Britain and elsewhere in Europe.\nUsing quasi-military tactics, they have given migrants walkie-talkies to organise themselves and chainsaws to cut through the fencing erected to protect the port and rail terminal from those trying to cross the Channel.\nThe anarchists, say police, pursue a deliberate ‘political agenda’, creating militancy among migrants, as they campaign for no borders anywhere in Europe.","url":"https://www.breitbart.com/europe/2016/01/31/mail-the-couple-who-honeymooned-in-calais-jungle-camp-and-the-truth-about-their-hardline-political-activity/"}
