{"authors":[],"date_download":"2018-10-23 01:46:14","date_modify":"2018-10-23 01:46:14","date_publish":"2016-01-28 16:09:58","description":"MailOnline Sport and a host of writers have been shortlisted for the SJA awards. MailOnline has 213m global monthly unique visitors to make it the world's most popular newspaper website.","filename":"data/vaneerConsumption/MailwritersnominatedforSportsJournalismAssociationawardswithMailOnlineSportupforwebsiteoftheyear.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/1CC72D1700000578-0-image-a-68_1453997259801.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_article-3421055_Mail-writers-nominated-Sports-Journalism-Association-awards-MailOnline-Sport-website-year_1540259174.html","title":"Mail writers nominated for Sports Journalism Association awards with MailOnline Sport up for website of the year","title_page":"Mail writers nominated for Sports Journalism Association awards with MailOnline Sport up for website of the year | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MailOnline Sport and a host of writers have been shortlisted for the Sports Journalism Association awards.\nMailOnline - which has 213 million global monthly unique visitors to make it the world's most popular newspaper website - is shortlisted for the Laureus Sports Website award, which it won at the 2014 ceremony.\nBoth Daily Mail chief sports writer Martin Samuel and Mail on Sunday chief sports writer Oliver Holt have been shortlisted for the sports feature writer award.\nMartin Samuel (left) and Oliver Holt have been shortlisted for the sports feature writer award\nNeil Ashton, Matt Lawton and Charles Sale have all be nominated for sports news reporter.\nMail on Sunday sports editor Alison Kervin and reporter Sam Cunningham have been shortlisted for scoop of the year.\nKervin interviewed Paul Radcliffe after she was wrongly accused of doping, while Cunningham exclusively revealed that Leyton Orient players had been forced to stay in a hotel for a week as a punishment.\nNeil Ashton (left) and Matt Lawton have been nominated for sports news reporter\nCharles Sale (left) and Jeff Powell are also in the running for SJA awards\nDerek Lawrenson (golf) and Martha Kelner (athletics) are in the specialist correspondent category\nBoxing correspondent Jeff Powell, golf correspondent Derek Lawrenson and athletics correspondent Martha Kelner have all be shortlisted for specialist correspondent.\nNick Harris - who has written extensively on FIFA corruption for the Mail on Sunday - is nominated for investigative sports reporter.\nPaul Newman and Lawrence Booth are in the running for the cricket correspondent award.\nFootball reporter Jack Gaughan has been nominated for young sports writer for reporters under the age of 30.\nNick Harris and Alison Kervin will be hoping to walk away with an award at the end of February\nWe're well represented for the Cricket Correspondent award with Paul Newman (left) and Lawrence Booth\nJack Gaughan (left) is nominated for Young Sports Writer and Sam Cunningham for Scoop of the Year\nThe Daily Mail has been named Newspaper of the Year at the last two SJA awards nights, while Martin Samuel is the reigning sports writer of the year.","url":"https://www.dailymail.co.uk/sport/article-3421055/Mail-writers-nominated-Sports-Journalism-Association-awards-MailOnline-Sport-website-year.html"}
