{"authors":["Valerie Edwards For Dailymail.Com"],"date_download":"2018-10-23 03:40:49","date_modify":"2018-10-23 03:40:49","date_publish":"2016-01-29 18:47:34","description":"Maine's governor Paul LePage suggested that citizens take matters into their own hands as he discussed increasing current penalties against drug dealers.","filename":"data/vaneerConsumption/MainesgovernorsuggestsSHOOTINGheroindealerstodealwithstatesdrugproblems.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4C46900000578-0-image-a-53_1454092674917.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423260_We-constitutional-carry-load-Maine-s-governor-suggests-SHOOTING-heroin-dealers-deal-state-s-overdose-problems_1540266049.html","title":"Maine's governor suggests SHOOTING heroin dealers to deal with state's drug problems","title_page":"Maine's governor suggests SHOOTING heroin dealers to deal with state's drug problems | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Maine's governor has suggested that citizens should turn vigilante and shoot drug dealers to help solve the state's overdose problems.\nGovernor Paul LePage suggested that people take matters into their own hands as he discussed increasing current penalties against drug dealers.\nLePage said: 'And I'll tell you, 'everybody in Maine, we have constitutional carry, load up and get rid of the drug dealers. Cause folks, they're killing our kids.'\nMaine doesn't have the death penalty for any crime, but the Governor insists he would like to make the penalties 'so tough that they don't want to come to me'\nHis communications director said LePage was exaggerating to make his point and was not advocating any vigilante action, according to WCSH.\nLePage talked about the death penalty for drug dealers on a radio program on Tuesday, but wouldn't propose it in Maine this year. He said next year he might bring it up when there is new legislature.\nMaine doesn't have the death penalty for any crime, but the Governor insists he would like to make the penalties 'so tough that they don't want to come to me'.\nHe also said he wants to increase current penalties to allow drug dealers to be charged with murder, if it can be proven that the drugs they sold caused a user's death.\nEarlier this month LePage said out-of-state drug dealers were impregnating 'young white girls'.\nHe later apologized for his remark, calling it a slip of the tongue and saying he didn’t mean to inject race into discussion of Maine’s heroin epidemic, according to the NY Daily News.\nThere were also efforts to impeach LePage when a legislative committee investigated allegations of misconduct against him.\nBut lawmakers voted to indefinitely postpone debate on the issue.","url":"https://www.dailymail.co.uk/news/article-3423260/We-constitutional-carry-load-Maine-s-governor-suggests-SHOOTING-heroin-dealers-deal-state-s-overdose-problems.html"}
