{"authors":["Helen Turnbull For Mailonline"],"date_download":"2018-10-23 04:01:38","date_modify":"2018-10-23 04:01:38","date_publish":"2016-01-29 19:29:49","description":"The Games of Thrones actress cut a cute figure as she enjoyed a roller-skating session with her friends at a local beach in Santa Monica, on Thursday.","filename":"data/vaneerConsumption/MaisieWilliamslookscuteinminiskirtandfootballsockswhileskatinginLosAngeles.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/19/30B4E4AA00000578-0-image-a-50_1454095739142.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423330_Maisie-Williams-looks-cute-pretty-mini-skirt-football-socks-skating-Los-Angeles_1540267298.html","title":"Maisie Williams looks cute in mini skirt and football socks while skating in Los Angeles","title_page":"Maisie Williams looks cute in mini skirt and football socks while skating in Los Angeles | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's currently enjoying a sun-soaked break in Los Angeles as she relishes a rare gap in her hectic filming schedule.\nAnd Maisie Williams looked to have transformed from a Bristol beauty into a fully-fledged California girl as she lapped up the LA lifestyle in Santa Monica on Thursday.\nThe Games of Thrones actress was spotted enjoying a roller-skating session with her friends at a local beach.\nScroll down for video\nGetting her skates on: Maisie Williams cut a cute figure as she headed out roller-skating with friends in Santa Monica, Los Angeles, on Thursday\nMaisie, 18, certainly looked the part as she cut a cutesy figure dressed in a pretty mini skirt and contrasting sport socks.\nShe slipped into a pale denim mini, which featured a scallop hem and a white lace-detail overlay, and a plain white T-shirt - a staple for every LA teen.\nThe award-winning actress offset her girlie outfit with a pair of thick white football socks which added a tomboy touch.\nBristol beauty to Cali cutey: Maisie, 18, slipped into a denim mini skirt, featuring a white floral design and a scallop hem, a white T-shirt and a pair of striped football socks\nMaisie appeared to be getting of the hang of the activity, favoured among the residents of LA, as she whizzed along the concrete promenade.\nShe protected her eyes from the beating afternoon sun with a pair of mirror-lens sunglasses, and wore minimum make-up with her grown-out brunette bob styled in its natural state.\nThe Arya Stark actress is currently gearing up for the season premiere of the sixth GoT season which will be broadcast later this year.\nThe question on every viewers' lips is whether Jon Snow is going to be seen again - dead or alive - after the season five finale saw his killed.\nSpeaking to The Upcoming on the red carpet at the London Film Critics’ Circle Awards on Sunday, the 18-year-old bemoaned how unpleasant it was having to continuously tell people he wasn't coming back... before hinting that that's exactly what is going to happen.\n'It was awful, it was really awful, people were so sad about it. And I feel so mean because I speak to people and they’re all like, \"Jon Snow, is he back?\" and it’s really heartbreaking because people are like, \"yeah, but is he coming back though?\",' she said.\nAdding: 'It’s a great twist but I can’t say he’s going to be alive.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423330/Maisie-Williams-looks-cute-pretty-mini-skirt-football-socks-skating-Los-Angeles.html"}
