{"authors":["Anna Hodgekiss For Mailonline"],"date_download":"2018-10-22 23:56:50","date_modify":"2018-10-22 23:56:50","date_publish":"2016-01-28 13:14:49","description":"Maisie Littlefair's mother Charlene, from Preston, first noticed her daughter's symptoms when her ankle and knees started to swell up three weeks ago. Tests revealed she has juvenile arthritis.","filename":"data/vaneerConsumption/MaisieLittlefairisdiagnosedwithARTHRITISagedthree.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/13/30AA43B800000578-0-image-a-22_1453986875583.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3420875_Girl-3-diagnosed-ARTHRITIS-joints-sore-couldn-t-walk_1540252610.html","title":"Maisie Littlefair is diagnosed with ARTHRITIS aged three","title_page":"Maisie Littlefair is diagnosed with ARTHRITIS aged three | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A little girl who developed sore knees and struggled to walk has been diagnosed with arthritis - at just three years old.\nMaisie Littlefair's mother Charlene first noticed her daughter's symptoms when her ankle and knees started to swell up three weeks ago.\nThe 22-year-old, from Preston, Lancashire, said: 'She was crying in the morning when I tried to get her dressed.\nI thought she just didn’t want to go to nursery - I never imagined that she was suffering from arthritis.'\n'Then one morning she woke up and couldn’t walk.\nMaisie Littlefair has been diagnosed with arthritis at just three years of age. Her mother Charlene (pictured) first noticed her daughter's symptoms when her ankle and knees started to swell up\n'I thought she had cramp or pins and needles, so I gave her legs a quick rub and she seemed fine, but two days after that woke up with her left ankle swollen and she couldn’t stand up.\n'She kept saying \"I can’t walk\".'\nExtremely concerned, Ms Littlefair took her daughter to their GP, who referred Maisie to the Royal Preston Hospital for further tests.\n'By the time we got to the hospital, Maisie’s symptoms were worse. Her ankle was swollen, red and hot to touch. We could feel the heat coming off it and she was in a lot of pain.'\nAs the swelling spread to Maisie’s hands, neck, and jaw, X-rays and blood tests revealed the cause.\n'The doctor said it was looking more and more like juvenile arthritis, recalled Ms Littlefair.\n'I was shocked, I’ve never heard of a child getting arthritis, it’s something you normally associate with older people.'\nThe most common symptoms are swollen, painful and stiff joints that are usually worse in the morning. The joint areas may look red and feel hot to touch.\nThe exact cause of the condition isn’t known, but it is thought to be an autoimmune disorder.\nThis means the immune system attacks the body instead of defending the body against infection and other harmful substances.\nSo immobile was Maisie that her mother had to carry her around for three weeks.\n'Eventually I borrowed a double pram for Maisie to share with her younger brother Charlie,' she said.\nOver the next few days the swelling had spread to Maisie’s knees, neck and jaw - leaving her in so much pain she couldn’t sleep.\nWhen Maisie’s symptoms got worse, she was rushed to hospital. 'Her ankle was swollen, red and hot to touch,' her mother said. 'We could feel the heat coming off it and she was in a lot of pain'\nAs the swelling in her knees spread to her hands, neck, and jaw, X-rays and blood tests revealed the cause - juvenile arthritis. This is where the condition appears before the age of 16\nThe most common symptoms of juvenile arthritis are swollen, painful and stiff joints that are usually worse in the morning. The joint areas may look red and feel hot to touch\n'She wouldn’t eat and she couldn’t sleep at night because she couldn’t get comfortable,' her mother said.\n'It has been heartbreaking to watch. She's lost weight and she been on ibuprofen for eight weeks.\nMaisie is having steroid IV drips and injections of methotrexate at Alder Hey Children’s Hospital.\nShe will also need at least two years of further treatment until the symptoms subside.\nDr Stephen Simpson, Director of research and programmes at Arthritis Research UK, said: 'Juvenile idiopathic arthritis, commonly abbreviated to JIA, affects around 15,000 children and young people in the UK, causing pain, stiffness of the joints, fatigue and disability.\n'Children with arthritis and other musculoskeletal disorders can suffer severe and painful disease which impacts enormously on their health, education and quality of life throughout their lives.\n'Some children with JIA respond well to treatment but unfortunately there are others in whom the disease can be difficult to control.\n'The Arthritis Research UK Experimental Treatment Centre for Children, based at the University of Liverpool, has been set up with the aim of developing new drugs which are safe and effective for children with all forms of arthritis.'","url":"https://www.dailymail.co.uk/health/article-3420875/Girl-3-diagnosed-ARTHRITIS-joints-sore-couldn-t-walk.html"}
