{"authors":[],"date_download":"2018-10-22 23:01:10","date_modify":"2018-10-22 23:01:10","date_publish":"2014-05-13 13:50:25","description":"One of the most popular dogecoin wallets gets shut down after the service was \"compromised by attackers.\"","filename":"data/vaneerConsumption/MajorDogecoinWalletHackedShutDown.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/438656/140513-dogecoin_nascar-0951_de0d5a51bf80af973073d882c111f8fc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_security_major-dogecoin-wallet-hacked-shut-down-n104096_1540249270.html","title":"Major Dogecoin Wallet Hacked, Shut Down","title_page":"Major Dogecoin Wallet Hacked, Shut Down ","title_rss":"NULL","source_domain":"nbcnews.com","text":"On Sunday, a Doge Vault user reported to the Cryptocurrency Times that 950,000 dogecoins (around $437) had been transferred out of his or her account to another online wallet.\nThat wallet currently holds more than 121 million dogecoins, worth more than $55,000. It’s not clear if everything in that wallet was stolen. What is clear is that Doge Vault had been hacked and is now offline.\n“On the 11th of May, the Doge Vault online wallet service was compromised by attackers, resulting in a service disruption and tampering with wallet funds,” the service wrote on its website. “We are currently in the process of identifying the extent of the attack and potential impact on user's funds.”\nNBC News reached out to Doge Vault for comment, but the company did not respond.\nIt has been a rough year for cryptocurrencies. Bitcoin became a media and Silicon Valley darling before hitting some serious speed bumps, including the collapse of the Mt. Gox exchange, multiple hacks, and a warning from the SEC. In December, Dogewallet was hacked, with $16,000 worth of dogecoins stolen.\nDogecoin was supposed to be the smart alternative to bitcoin. With a lovable Shiba Inu as a mascot, the cryptocurrency's users prided themselves on not being wealthy speculators (cough, Winklevoss twins, cough), instead rallying around charities.\nBut the anonymous nature of the currency — users are identified only as dogechain addresses — makes it difficult to refund stolen funds. Banks might collect personal information through credit cards, but they can also protect consumers against fraudulent charges. Bitcoin and dogecoin work like cash. Once they are stolen, they are essentially gone, and no adorable puppies can bring them back.","url":"https://www.nbcnews.com/tech/security/major-dogecoin-wallet-hacked-shut-down-n104096"}
