{"authors":["Rachael Burford"],"date_download":"2018-10-23 05:50:34","date_modify":"2018-10-23 05:50:34","date_publish":"2017-04-26 17:05:22","description":"Sandhurst-educated Major Cyrus Karumba (pictured) was found dead after he failed to show up to the Majors course he was two months into at a British Army Defence Academy.","filename":"data/vaneerConsumption/MajorCyrusKarumbafoundhangedaftersplitfromwife.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/17/3FA0BDCB00000578-0-image-a-119_1493222646965.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448348_Senior-black-British-Army-officer-36-hanged-himself_1540273834.html","title":"Major Cyrus Karumba found hanged after split from wife","title_page":"Major Cyrus Karumba found hanged after split from wife | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A British Army Major and United Nations consultant hanged himself in his barracks after separating from his wife and racking up debts, an inquest heard.\nSandhurst-educated Major Cyrus Karumba was found dead after he failed to show up to the Majors course he was two months into at an Army Defence Academy.\nOriginally from Kenya, the respected 36-year-old soldier joined the British Army in 2003 and had served in Afghanistan, Kenya and Germany.\nSandhurst-educated Major Cyrus Karumba (pictured) was found dead after he failed to show up to the Majors course he was two months into at an Army Defence Academy\nHis estranged wife, Suchada Karumba, who was also from Kenya, had moved to the site in September so that he could see their two young children.\nHe was found in his room on December 6, 2016 by Major Dayan Pozo, who had been sent to find him when he failed to show up to his course.\nA statement, read out by coroner Darren Salter, explained that the soldier punched his way into the father-of-two's bathroom after finding it locked with the light on.\n'It was about 2.15pm when I arrived at Cyrus' room, CO15,' he said.\nThe respected 36-year-old major, joined the British Army in 2003 and served in Afghanistan\n'I knocked on his door and was saying his name, trying to raise him. I must have knocked on his door for around five minutes.\n'I then tried to get hold of him through social media but to no avail. I saw his car parked up so I decided to go to reception to get a spare key.\n'I entered his room and and saw the bathroom door was closed but the light was on. I started to shout and made it clear that I would knock down the door. I punched a hole in the door and then entered. It was clear that he was deceased.'\nThe Oxfordshire coroner said Major Karumba was found next to a handwritten note - which he refused to read out to the inquest - and a copy of his will.\nMr Salter read out a statement written by his estranged wife, who had recently moved to the Defence Academy site in Faringdon Road, Watchfield, although she lived with their children in a separate house.\n'We had been married for seven years in July 2016 when we separated,' she wrote.\n'In September 2016 Cyrus was transferred to the UK to take a course. The children remained with me and I moved to the UK too, partly so Cyrus could see the children and secondly it was a good opportunity for the children. We did not live together.\n'I am aware that Cyrus had some debt issues. He did not have any health issues that I was aware of. I am totally shocked that Cyrus did this and I cannot understand why.\nMr Karumba was leading a professional development course for Army officers at the academy at the time of his death\n'He was always such a confident person. For him to have done this is completely out of character.'\nMajor Karumba was leading a professional development course for Army officers at the academy at the time of his death.\nHe was the Army's Telecommunications and ICT Director for more than 10,000 of his comrades during a two-year stint in Kenya and was a web consultant for the UN Convention to Combat Desertification before he became an Army officer.\nHe had trained as an officer at the Royal Military Academy in Sandhurst, and had also served in the Falkland Islands.\nMajor Andrew Richards, who ran the course, explained in a written statement how Major Karumba had suffered sleep problems and had failed to attend classes once before.\n'On Thursday, September 1, for the first time since the course began, Cyrus didn't come to work,' he said.\n'I sent him a message over WhatsApp and Cyrus said \"I couldn't sleep last night\".\n'I went to see him in his room later that day and had a lengthy conversation about his marriage issues and about his issues with sleep.'\nSpeaking of the day he died, he continued: 'Cyrus didn't show for work but sent me a WhatsApp message at 10.12am saying, \"Sorry I overslept, I will be over shortly. I have booked a doctor's appointment and hopefully they will be able to help me sleep\".'\nMajor Pozo then replied saying, 'Roger, go to your appointment but you need to be in work' to which Cyrus answered 'RGR', meaning 'Roger'. It was the last time that anyone heard from him.\nA toxicology report carried out by Dr Reza Morovat found no traces of alcohol or drugs in his system while pathologist Dr Eve Morovat, who carried out the post-mortem examination, gave the cause of death as hanging.\nMr Salter summarised a statement written by Dr Lucy Elphinstone, who was the senior medical officer at the defence academy, about an appointment Major Karumba had made with her.\n'She says he had two or three problems which he mentioned, a couple of physical problems which weren't serious but the other issue he raised was stress.'\nShe added: 'He had been through marital difficulties. He said he didn't have any difficulties keeping up with the requirements of the staff course.'\nThe coroner recorded the death as suicide and added: 'It's a sad case and a surprise for all concerned when it occurred.'\nFor confidential support call the Samaritans on 116123 or visit a local Samaritans branch, see www.samaritans.org for details.","url":"https://www.dailymail.co.uk/news/article-4448348/Senior-black-British-Army-officer-36-hanged-himself.html"}
