{"authors":["Chris Tomlinson"],"date_download":"2018-10-30 21:59:25","date_modify":"2018-10-30 21:59:25","date_publish":"2017-02-12 09:56:25","description":"A new survey has shown that although there have been a number of protests against deporting failed asylum seekers to Afghanistan, the majority of the German public agree with the deportations.","filename":"data/vaneerConsumption/MajorityofGermansSupportAfghanDeportations.json","image_url":"https://media.breitbart.com/media/2017/02/AP_16349702134905.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_02_12__1540936765.html","title":"Majority of Germans Support Afghan Deportations","title_page":"Majority of Germans Support Afghan Deportations","title_rss":"NULL","source_domain":"breitbart.com","text":"A new survey has shown that although there have been a number of protests against deporting failed asylum seekers to Afghanistan, the majority of the German public agree with the deportations.\nThe study, commissioned by a German magazine and carried out by research institute Emnid, shows that 74 percent of those surveyed agreed that failed asylum seekers should be deported back to Afghanistan. The same amount also agreed that Afghan migrants who had committed criminal offences in Germany should also be deported, FOCUS Online reports.\nThe survey asked 1,004 people their opinion on Afghan deportations on February 7th and 8th and found, perhaps unsurprisingly, the largest supporters for the deportations were people who classified themselves as supporters of the anti-mass migration Alternative for Germany (AfD) party.\nThe AfD voters went even further with 51 percent of them saying that they would support deportations of all failed migrants, regardless of what country they originally came from. Only 20 percent of the total people surveyed wanted to see deportations on all failed asylum seekers.\nThe German government announced its intentions to start deporting failed asylum seekers late last year and began the process of sending them back to their home country in December. The initial round of deportations at Frankfurt airport was heavily protested by left-wing groups and pro-migrant activists who argue that Afghanistan is too dangerous to send the failed asylum seekers.\nLeft-wing parties across Germany have been heavily critical of the government’s move to deport Afghan nationals and many in regional governments have flat out refused to help facilitate deportations. The left-wing coalition in Berlin has led the way on the issue along with several other regions that also have left-wing coalition governments.\nAfghan migrants themselves have also been looking at ways to prevent being deported back to their home country. One of the ways some migrants have tried to achieve this is by claiming that they are members of the radical Islamists group, the Taliban.\nAccording to German law, the migrants would have to be arrested and investigated if they were suspected of being members of a terror group and many believe that would buy them enough time so that pro-migrant groups and left-wing parties can overturn the deportation program and they can remain in Germany.\nWhile many Afghans may claim to be members of the Taliban to avoid deportation, there have been multiple Afghan migrants arrested in Germany for having links to the terror group. Earlier this month German prosecutors indicted a 28-year-old who is said to have joined the group in 2009 and received weapons training.","url":"https://www.breitbart.com/europe/2017/02/12/majority-germans-support-afghan-deportations/"}
