{"authors":["Tyler Atwood"],"date_download":"2018-10-30 22:43:14","date_modify":"2018-10-30 22:43:14","date_publish":"2014-08-14 20:00:04","description":"What do Pati Dubroff, Kabuki, and William Lemon III all have in common? They contributed gorgeous, personally crafted colors to Make Up For Ever's new 30 Years 30 Colors 30 Artists palette to celebrate the brand's birthday. Each of the 30 new shades…","filename":"data/vaneerConsumption/MakeUpForEver30Years30Colors30ArtistsPaletteReviewAllTheEyeshadowsYouNeverKnewYouNeeded.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/37374ea4-319c-49a5-8eaf-d325038e8c28.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35610-make-up-for-ever-30-years-30-colors-30-artists-palette-review-all-the-eyeshadows-you_1540939394.html","title":"Make Up For Ever 30 Years 30 Colors 30 Artists Palette Review: All The Eyeshadows You Never Knew You Needed","title_page":"Make Up For Ever 30 Years 30 Colors 30 Artists Palette Review: All The Eyeshadows You Never Knew You Needed","title_rss":"NULL","source_domain":"bustle.com","text":"What do Pati Dubroff, Kabuki, and William Lemon III all have in common? They contributed gorgeous, personally crafted colors to Make Up For Ever's new 30 Years 30 Colors 30 Artists palette to celebrate the brand's birthday. Each of the 30 new shades was developed by a different world-renowned makeup artist, from Dubroff to Joyce Bonelli, and sits in a three-tiered leather-lined box, its cover autographed by each artist. Dubroff herself and avant-garde artist Kabuki were on hand at the line's debut to describe their first experiences with Make Up For Ever and explain the impetus behind 30.30, citing its impeccable quality and exhaustive range of colors as favorite features of the new product.\nMake Up For Ever was founded by Dany Sanz as an artist-specific brand and gradually developed into one that even the most cosmetics-inept consumer could use, thanks to the superior quality of each product. Since partnering with LVMH in 1999, Make Up For Ever has made an effort to encourage non-professional makeup aficionados to play with its products. Amongst the most adored are the brand's HD line, which promises skin so flawless even a high definition camera won't pick up a single blemish, no Instagram filter needed, and the waterproof Aqua line, ideal for heat soaked summer days. And if the plethora of makeup tutorial YouTube videos touting the products as incomparable are any indication, it appears Make Up For Ever has achieved a place of pride amongst other cosmetics giants.\nHowever, the brand needed something truly extraordinary to commemorate 30 years of cosmetic genius, and thus, the 30 Palette came into existence. As if the palette weren't enough, Make Up For Ever also added 210 eyeshadow shades via the impressive Artist Shadow collection, and 15 velvety eye pencils entitled Artist Liners. To a self-proclaimed makeup addict whose hands and face are often covered with contrasting test stripes of shadow, liner, gloss, and lipstick after a jaunt to the nearest cosmetics counter, Make Up For Ever's new collection seemed like an invitation to play. And so I did.\nOn opening the luxurious palette, I was greeted by the signatures of each artist who contributed a shade, as well as a handy leaflet describing the inspiration behind each shade and helpful beauty tips to get the most out of one's makeup routine. And the palette itself? I was reminded of why I adore makeup so much. Each rich shade is thoughtfully crafted to flatter a range of skin tones and color preferences, from a deep, radiant mahogany that begs to be worn on a crisp autumn day to a matte shocking pink that looks nightclub-ready. The Artist Liners were similarly impressive, with a creamy, blendable texture and jewel-tone shades to suit every style. During the nighttime debut of the product, Kabuki perfectly encapsulated the genius of the product, stating, \"I get ideas from the tactile way it goes on.\" If the mark of a good makeup palette is one's desire to play with it repeatedly, Make Up For Ever may consider its mission accomplished.\nImages: Tyler Atwood","url":"https://www.bustle.com/articles/35610-make-up-for-ever-30-years-30-colors-30-artists-palette-review-all-the-eyeshadows-you"}
