{"authors":["Alison Millington"],"date_download":"2018-10-31 00:16:36","date_modify":"2018-10-31 00:16:36","date_publish":"2016-12-02 00:00:00","description":"From selecting the best seat to making your own amenities kit, here are five things you can do to make your economy flight feel like first class.","filename":"data/vaneerConsumption/MakeaneconomyflightfeellikeFirstClass.json","image_url":"https://amp.businessinsider.com/images/58418d02dd089535448b472b-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_make-an-economy-flight-feel-like-first-class-2016-12_1540944996.html","title":"Make an economy flight feel like First Class","title_page":"    Make an economy flight feel like First Class - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Frequent flier and points expert Gilbert Ott told us five easy ways to improve your economy flight. godsavethepoints While many of us may never afford a flight in first class, the extra leg room, fine dining, and swanky lounges certainly have their appeal.\nWith the busy holiday travel season approaching, we asked frequent flier and points expert Gilbert Ott, who runs the air miles site God Save the Points, for his top tips on how travellers can upgrade their economy experience to make it feel like first class.\nOtt has made a career out of helping fliers use miles to get free seats in business and first class - and even once bagged a free ride on a private jet. He told Business Insider: \"With holiday travel, it's more chaotic than ever, and there are so many things people can do.\"\nFrom tools to help you select the best seat to tips on what to bring on board, here are five things you can do to make your economy flight feel like first class.\n1. Pick the best seat\nI took Ott's advice and checked out seatguru.com for an upcoming Air Canada flight to Toronto. seatguru.com\n\"Airlines love to try and charge you for the best seats now, and a lot of them have caught onto the fact that there are better seats than others, but it's not always the case,\" Ott said.\n\"You want to shoot for the bulkhead or exit row. They usually have double the usual leg room, so you're already winning on that front and you can stretch out your legs.\"\nHe said that while seats can differ by plane, there are tricks to figuring out which seat is the best. One involves looking at seatguru.com, which presents a colour-coded map of your flight showing the best and worst row. \"It gives you a fair shot at finding something awesome,\" Ott said.\nAnother option is to look at expertflyer.com, which allows you to set alerts for when the seat you want becomes free. \"If you want a window seat or a specific seat, it will notify you if one opens up,\" Ott said. \"Seats turn over pretty regularly, so if you have alerts you can get the best seat on board.\"\nHe also suggests checking whether the app of the airline you're flying with had a seat map, as some will show which seats are free right up until boarding. \"You can quite often find the row everybody has moved out of, and then have a row to yourself,\" Ott said.\n2. Make your own amenities kit\nOwen. S / Rory. S\nAirlines like Emirates, Ethiad, and even British Airways are known for offering high-end toiletries and fine dining and drinks to their big spending passengers, but Ott says there are ways of creating your own first class feel when in your seat.\n\"You can make your own amenity kit and fill it with the things you need or want to cater to yourself,\" he said. \"I have a bunch of carry on things that are great to bring that help with the actual journey. I'm always big on bringing my own blanket, a change of clothes, eye masks, ear plugs, universal plugs, socks, shoes, a toothbrush, toothpaste, chapstick, and a pen - nobody likes the person who has to ask for a pen.\"\nHe also suggested bringing a cocktail kit. \"They give you the alcohol on board, but then you have the mixers,\" he said. \"You can make a Moscow Mule or a Manhattan to make it feel fun and refined.\"\n3. Opt for fast track\nBritish Airways\nOtt said it's also the things you do before you board your flight that can make a difference.\n\"There's so much you can do to make getting on the plane feel a lot better,\" he said. \"A lot of airports have fast track security, which they sell as a one-off thing, so that even if you're not a frequent flyer you can buy the fast track pass. During holidays that can be massive.\"\n4. Pay for a porter\nImYanis / Shutterstcok\nWhile paying for your bag ahead of time saves time — you simply need to go to bag drop instead of the check-in desk — an even more convenient way is to pay for a porter.\nIn the UK, the Airportr service will pick up your bags from home or the airport and deliver them to wherever you're going, so you can travel bag-free. \"The idea is that they'll pick up your bag and you can meet it at the airport,\" Ott said.\n5. Make the most of airport lounges\nBritish Airways\nYou may think the airport lounges are only for those travelling in first or business class, but this isn't the case.\n\"I love airport lounges — they're one of the things I believe in more than anything,\" Ott said.\nHe said that it's easier than ever to gain access, with sites like Priority Pass, No1 Lounges and Lounge Buddy offering passes for around £15. This covers more than a thousand airline lounges around the world.\n\"People don't realise what's in lounges,\" Ott said. \"You can eat and drink whatever you want, there are couches, and there are easy access options to purchase on the spot.\"","url":"https://www.businessinsider.com/make-an-economy-flight-feel-like-first-class-2016-12"}
