{"authors":["Anneta Konstantinides For Daily Mail Australia"],"date_download":"2018-10-22 22:04:44","date_modify":"2018-10-22 22:04:44","date_publish":"2017-04-26 03:35:02","description":"Australian TV host Lisa Wilkinson, 57, showed off Joanne Bentley's work with before and after photos. Joanne used a sheer NARS foundation with enhancer drops to make Lisa's skin glow.","filename":"data/vaneerConsumption/MakeupartistsharesLisaWilkinsonsLogiesbeautyregime.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/02/3F9BB4C400000578-0-image-a-18_1493171817483.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446102_Makeup-artist-shares-Lisa-Wilkinson-s-Logies-beauty-regime_1540245884.html","title":"Makeup artist shares Lisa Wilkinson's Logies beauty regime","title_page":"Makeup artist shares Lisa Wilkinson's Logies beauty regime | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lisa Wilkinson's stunning black gown brought plenty of drama to the Logies' red carpet on Sunday night, but it was her glowing skin that fans couldn't get enough of.\nAnd now make up artist Joanne Bentley has revealed the secret to duplicating the Today Show host's iridescent complexion.\nLisa, 57, was happy to show off Joanne's amazing work this week, sharing before and after photos on Instagram that pictured her make-up free prior to the show.\nSo just what went into Lisa's incredible Logies makeover?\nScroll down for video.\nMakeup artist Joanne Bentley has shared the secrets behind Today show host Lisa Wilkinson's gorgeous makeover for the Logies Awards on Sunday night\nThe Sydney makeup artist revealed on her Instagram page that she first applied Nars Sheer Glow foundation to Lisa's face, providing the perfect base to add some glow to the TV host's face.\nJoanne upped the ante on the foundation with Cover FX Custom Enhancer Drops in Candelight to add some highlights - no strobing required.\nAfter giving Lisa a face packed with glow, Joanne turned to Hourglass Ambient Lighting Bronzer in Luminous Bronze Light.\nThe bronzer made Lisa's skin look sun-kissed even in the middle of autumn, with some additional help from the brand's Euphoric Strobe Light highlighter.\nThe Sydney makeup artist revealed that she first applied Nars Sheer Glow foundation to Lisa's face, providing the perfect base to add some glow to her face\nJoanne actually turned to eye shadow to create Lisa's subtle shade of blush, using a colour from Makeup For Ever to give her cheeks just a hint of pink.\nShe gave Lisa a smoky but natural eye, using brown shades from MAC and NARS and topping off the look with Model Rock fake eyelashes in 204, which only cost $7.\nJoanne completed her work by swiping Lisa's lips with MAC lipstick in Ravishing, as well as the TV presenter's beloved Melli Cosmetics Custom Gloss in Icon.\nThe shade, which was created just for Lisa, can now be pre-ordered online for the wallet-friendly price of $25.\nLisa was praised by her followers for sharing the revealing before and after snap, crediting Joanne for one picture and her 'mum and dad' for the make-up free shot.\nJoanne actually turned to eye shadow to create Lisa's subtle shade of blush, using a colour from Makeup For Ever. She added $6 fake lashes to give Lisa's look even more drama\nJoanne later shared the same photo on her own Instagram, applauding Lisa for having no fear when it comes to 'no makeup' shots.\n'Gorgeous Lisa Wilkinson has no hang ups baby,' Joanne wrote in the caption.\n'When chatting this morning she mentioned people said she is brave to take a \"no makeup shot\" of herself. We think it's not brave...IT'S NORMAL.'\n'Embrace and love your normal & your glowing-glitter-glam too ladies!'","url":"https://www.dailymail.co.uk/femail/article-4446102/Makeup-artist-shares-Lisa-Wilkinson-s-Logies-beauty-regime.html"}
