{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 20:03:26","date_modify":"2018-10-30 20:03:26","date_publish":"2016-08-11 16:00:22","description":"Rum is popping up all over Atlanta cocktail menus.","filename":"data/vaneerConsumption/Makearumrunforthese5cocktailsatAtlantabars.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/08/09/Images/WPIMAGE_cmgajcfoodandmore_10126.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_ma_98f6aa382d0eee6c4b6cb70ea6bb9b34__1540929806.html","title":"Make a rum run for these 5 cocktails at Atlanta bars","title_page":"Make a rum run for these 5 cocktails at Atlanta bars","title_rss":"NULL","source_domain":"ajc.com","text":"Rum is popping up all over Atlanta cocktail menus. While most people associate it with cloyingly sweet tropical drinks and frozen concoctions, long before its neon-infused, party girl image, rum was the star in many classic cocktails due to its versatility and fair play with other spirits. Atlanta’s bartenders have taken a shine to the spirit that bolstered colonial America’s economy - and we’re all the better for it. From tiki to classic to modern takes, these cocktails make it fun to sip rum again.\nNo Shrubs\nWe couldn’t start a rum drinks list off without bowing down to the tiki gods first. The garnish game is strong at Decatur’s S.O.S. Tiki Bar , and so are the tropical tipples. Aside from lighting cocktails on fire and garnishing them with half-naked mermaids, wily monkeys and fruit salad, this tiki bar knows a thing or two about concocting Navy strength rum drinks that not only satisfy, but also might help drown your sorrows in the process. We suggest the No Shrubs with a dual base of rich, aged dark rum and cognac, the sweet tang of mango shrub and pineapple, lime juice and a little fizz from tonic water to wash away the day’s dirty laundry.\nS.O.S. Tiki Bar, 340 Church St., Decatur. 404-377-9308, vicsandwich.com/sos.\nEl Presidente\nNow that the United States and Cuba have restored diplomatic relations, we may soon be able to head to the island's El Floridita to sip daiquiris and take selfies with Hemingway’s statue at the bar. But, before you venture south to warmer climes, take a detour to Bookhouse Pub to pre-game with the Cuban classic El Presidente. This rum-soaked export found its way to American shores during the last days of Prohibition and became wildly popular during the late 1920s and 30s. Made with Bacardi Superior, vermouth blanc and orange curacao, Bookhouse stays true to the classic’s roots giving you a taste of Cuban cocktail culture with what can only be described as a cross between a Manhattan and a daiquiri.\nThe Bookhouse Pub, 736 Ponce De Leon Ave. NE, Atlanta. 404-254-1176, thebookhousepub.net.\nMoonwalker\nIn the four months Amer has been open in the happening cocktail mecca that is Inman Quarter , this bitters bar has garnered a reputation for mixing strong drinks in which rum frequently plays a starring role. Looks can be deceiving, so don’t let the Moonwalker’s list of ingredients fool you. While it may not be Amer’s most bitter drink, it is definitely one of the booziest. This daiquiri-like imbibe has all of our favorite things: the grassy notes of agricole rhum, brightness of chartreuse, zesty lime and bubbles. While the name most likely describes the ghostly hue of the cocktail, this drink is best sipped slowly lest you end up with your head feeling a little zero-gravity by night’s end.\nThe Moonwalker from Amer boasts the grassy notes of agricole rhum, brightness of chartreuse, zesty lime and bubbles. / Photo: Dan Durnell.\nAmer, Inman Quarter, 299 North Highland Ave. NE, Atlanta. 404-600-5895, ameratlanta.com.\nThe Rich Peach\nIf you haven’t been to Saltyard in Midtown, we suggest you head there straight away to dine on chef Nick Leahy’s seasonal and regional menu which is as rich and diverse as Atlanta itself. Like the cuisine, the cocktails showcase Saltyard’s commitment to the city’s cultural diversity, farmers markets and Georgia’s Slow Food movement. The Rich Peach is full of local love, mixing summer peaches with the rye whiskey-like notes of south Georgia’s Richland Rum. A hint of herbal sweetness from thyme syrup and a pop of bright fizz from bubbly cava, and this just might be Atlanta’s version of the classic New Orleans French 75 .\nSaltyard, 1820 Peachtree St. NW, Atlanta. 404-382-8088, saltyardatlanta.com .\nCaribbean Queen\nSummer is not officially over for another month and you’re longing for one more beach vacation. Leave it to Chris McNeill of East Cobb’s Seed Kitchen & Bar to find just the right combination of ingredients to produce a sophisticated cocktail to channel a few island vibes. The Caribbean Queen is rich, luscious and wonderfully boozy, highlighting rum’s serious versatility; especially when paired with other spirits. Sherry and the figgy flavors of Carpano Antica play up the chocolate and oak notes of the golden Diplomatico rum for what we feel is the perfect cocktail for whiskey lovers looking for a tropical escape.\nSeed Kitchen & Bar, Merchant's Walk, 1311 Johnson Ferry Road, Marietta. 678-214-6888, eatatseed.com.\nGo here to read more of our coverage of the Atlanta bar scene\nOne Eared Stag mixes it up behind the bar with themed cocktail menus\n4 cocktail books to quench your summer reading thirst\nYour handy guide to shooting the ‘hooch\nAria’s revamped cocktail program\nClick here to read the AJC’s Ultimate Guide to Brunch in Atlanta\nClick here to read about dining in Atlanta around the clock\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook , following @ATLDiningNews on Twitter.","url":"https://www.ajc.com/blog/atlanta-restaurants/make-rum-run-for-these-cocktails-atlanta-bars/AasFCjagL9zbCkMeHDjR4H/"}
