{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 00:15:15","date_modify":"2018-10-23 00:15:15","date_publish":"2017-04-26 09:38:00","description":"Paris Jackson was putting the drama aside when she stepped out in Los Angeles on Tuesday, cutting a casual figure as she headed out for the day.","filename":"data/vaneerConsumption/MakeupfreeParisJacksonputsonaleggydisplay.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9D78F900000578-0-image-a-6_1493195874481.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446820_Make-free-Paris-Jackson-puts-leggy-display_1540253715.html","title":"Make-up free Paris Jackson puts on a leggy display","title_page":"Make-up free Paris Jackson puts on a leggy display | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Her family is caught in the midst of a legal battle.\nAnd Paris Jackson was putting the drama aside when she stepped out in Los Angeles on Tuesday, cutting a casual figure as she headed out for the day.\nThe 19-year-old star showed off her extensive collection of tattoos in a pair of loose blue shorts, set off with Converse trainers.\nScroll down for video\nStepping out: Paris Jackson was putting the drama aside when she stepped out in Los Angeles on Tuesday, cutting a casual figure as she headed out for the day\nParis pulled her look together with a simple T-shirt and some laid back jewellery.\nShe went make-up free for her outing, showing off her bare faced beauty.\nThis comes after a California judge dismissed Katherine Jackson's elder abuse lawsuit against her nephew Trent Lamar Jackson, whom she had a temporary restraining order against in February.\nAu naturel: She went make-up free for her outing, showing off her bare faced beauty\nThe ailing matriarch - who turns 87 next week - and her attorneys were 'unprepared to go forward' with a full-blown trial on Tuesday, according to TMZ.\nThe Jehovah's Witness had previously claimed the 52-year-old son of her estranged husband Joe Jackson's brother Luther abused her and stole $40K from her accounts as her caretaker and driver since 2009.\nMeanwhile, Trent thinks Katherine (born Kattie B. Scruse) is being manipulated by sinister family members trying to gain control over the late Michael Jackson's $1B estate.\nPictured in 2014: A judge just dismissed Katherine Jackson's elder abuse lawsuit against her nephew Trent Lamar Jackson, whom she had a temporary restraining order against in February\nJackson was allegedly so afraid of Trent she fled to London for two months to be with her daughter Janet, who just welcomed son Eissa Al Mana with estranged third husband Wissam Al Mana.\nThe Indiana-raised mother-of-10 has reportedly been staying at her daughter Rebbie's Encino home since March 30, and granddaughter Paris is not happy about it.\nKatherine shares full legal custody of Michael's 15-year-old son 'Blanket' with her great nephew TJ, but the A-student has been mostly alone in her $10.7M Calabasas home.\nPictured in 2016: The ailing matriarch - who turns 87 next week - and her attorneys were 'unprepared to go forward' with a full-blown trial on Tuesday, according to TMZ\nPictured in 2010: The Jehovah's Witness had previously claimed the 52-year-old son of her estranged husband Joe Jackson's brother Luther abused her and stole $40K from her accounts as her caretaker and driver since 2009\nPictured in 2010: Meanwhile, Trent thinks Katherine (born Kattie B. Scruse) is being manipulated by sinister family members trying to gain control over the late Michael Jackson's $1B estate\n'My baby and me after nap time': Jackson was allegedly so afraid of Trent she fled to London for two months to be with her daughter Janet, who just welcomed son Eissa Al Mana with estranged third husband Wissam Al Mana\n'Paris feels her little brother is living without real family,' a source told TMZ on April 11.\n'Paris loves her grandma and is worried Rebbie and several other siblings of Michael's have intentionally put a wall up to control the matriarch. She believes some of her aunts and uncles are trying to control Katherine for financial motives.'\nThe former Sears clerk receives over $1M a year from Jackson's estate - according to E! News.\n'Queen of the Jacksons': The Indiana-raised mother-of-10 has reportedly been staying at her daughter Rebbie's Encino home since March 30, and granddaughter Paris is not happy about it\nPictured February 3: Katherine shares full legal custody of Michael's 15-year-old son 'Blanket' with her great nephew TJ, but the A-student has been mostly alone in her $10.7M Calabasas home","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446820/Make-free-Paris-Jackson-puts-leggy-display.html"}
