{"authors":[],"date_download":"2018-10-30 18:33:52","date_modify":"2018-10-30 18:33:52","date_publish":"2017-02-20 17:18:00","description":"U.S. Department of Veterans Affairs staffers in DeKalb County were upset after a coworker put up a \"Make Killing Great Again\" poster, according to WSB.","filename":"data/vaneerConsumption/MakeKillingGreatAgainsignturnsupatAtlantaVA.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/02/20/Images/Make%20killing%20great%20again.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_make-killing-great-again-sign-turns-atlanta__1540924432.html","title":"'Make Killing Great Again' sign turns up at Atlanta VA","title_page":"'Make Killing Great Again' sign turns up at Atlanta VA","title_rss":"NULL","source_domain":"ajc.com","text":"U.S. Department of Veterans Affairs staffers in DeKalb County were upset after a coworker put up a \"Make Killing Great Again\" poster, according to Channel 2 Action News.\nThe sign features Secretary of Defense James Mattis above the phrase and was on an office door at the VA building on Clairmont Road. The VA said the matter is being looked into and the sign has been taken down, the station reported.\nBut some are upset that it took complaints from workers to get the sign, a clear reference to President Donald Trump’s slogan, down.\n\"You need to be sending him to a fitness of duty to see what his mindset is,” a concerned worker, who asked the news station not to be named, said. “Something needs to be done.”\nThe worker said the sign’s message encouraging killing made caused nervousness in the workplace.\nThe worker also feared that, had the man who put up the poster been a person of color, he would’ve been treated differently.\nThe man who put the sign up remains on the job, the station said.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/make-killing-great-again-sign-turns-atlanta/CSPS3dAJEE28LC2xhMFa8N/"}
