{"authors":[],"date_download":"2018-10-30 18:55:46","date_modify":"2018-10-30 18:55:46","date_publish":"2016-03-31 21:40:00","description":"The Georgia film industry has been soaring for years. In fiscal year 2013, film and television production budgets in Georgia totaled $933.9...","filename":"data/vaneerConsumption/Makemoneyinthefilmindustryasanextra.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/31/Images/photos.medleyphoto.9236992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_employment_ways-in_54366de51195c7da28d55daf39845b1f__1540925746.html","title":"Make money in the film industry as an extra","title_page":"Make money in the film industry as an extra","title_rss":"NULL","source_domain":"ajc.com","text":"The Georgia film industry has been soaring for years. In fiscal year 2013, film and television production budgets in Georgia totaled $933.9 million, according to the Georgia Department of Economic Development. In March, there were 31 movies and television shows filming in Georgia.\nIn fact, Shannon Mall is being demolished to make way for a new movie studio.\nBecause of the boom in film production in Atlanta, most film and television shows are in need of extras. Extras (or background actors) are people who make the background of movies and television shows come alive. If you're looking to make extra money or aspire to be the next breakout film star, adhere to the points below to increase your chances of rubbing elbows with Hollywood elite.\nTake Pictures\nNo, the latest selfie that received over 500 likes on Instagram won't count. You will need professional photos that best represent your look. Three different shots would be preferred: a head shot, a 3/4 shot, and a full-length photo. Make sure that a professional photographer, which means you will have to spend money, takes the photos. Hey, it takes money to make money.\nRegister with local casting agents\nAtmosphere Casting founder Jon Kinnas says that registering with a casting agency is required. Film studios and casting directors often use agencies to fill roles for extras, and many agencies allow people to register on their website. Registering with an agency consists of filling out an online form, which asks for basic and contact information. Here are a few agencies in Atlanta: Extras Casting Atlanta, Hylton Casting, Tammy Smith Casting.\nFollow casting notices on social media\nIn addition to registering with casting agencies, you will increase your chances of finding postings for casting calls if you actively seek them. Many casting calls are posted on Twitter or Facebook so make sure you \"follow\" agencies and \"like\" their company pages.\n» Who's getting the jobs in Georgia's film industry? «\nPay attention\nWhen submitting by email to agencies or submitting for certain roles, make sure that you pay attention to the required information. You might get asked for information, such as age, height, weight, location, and contact information. Don't provide additional information such as your specific measurements or clothing size unless specified.\nBe patient and persistent\nNow that you're excited to get to work, you must know that casting directors have many submissions to look through, and often times they are looking for a specific look. After you get the job, ExtraOrdinary Casting founder Darlene Hunt says you have to be patient while on set. \"I recommend bringing a magazine or book or iPad while you wait. It's also a nice time to make friends. A lot of times you will make friends talking to other people while waiting.\"\nBe prepared to change your look\nIf you change your look drastically after registering with a casting agency, you must update your photo. If not, you risk being sent home from a job if you look different than your photo. Update your clothing sizes, new tattoos, piercings, etc.\nRemain professional\nOnce you get called for work, make sure that you arrive on time, dress appropriately (in the attire in which you've been asked). 4 Star Casting co-founder Jess Gisin says that you should not talk to actors unless they talk to you first. \"They're there to work, not to have a conversation with you. Focus on the scene.\" Gisin told the Chicago Tribune.\nLearn about the industry\nActor/producer Douglas Taurel tells Backstage that it's important to learn industry basics. If you are naïve to the film industry, please learn the basics. \"Do three or four jobs and focus really hard on learning how the camera is moving around you. Watch how the main players prepare. Really try to learn.\" Taurel said.\nFor more information on casting opportunities, you can call the Help Wanted Hotline (404-962-4055) or visit Georgia.org.","url":"https://www.ajc.com/business/employment/ways-increase-your-chances-making-money-film-extra-georgia/aivAVzs1g8IY4kqe6KLQmI/"}
