{"authors":[],"date_download":"2018-10-22 20:52:26","date_modify":"2018-10-22 20:52:26","date_publish":"2014-06-03 00:00:00","description":"Paul Raeborn makes the case for dads with his new book, “Do Fathers Matter?”","filename":"data/vaneerConsumption/MakingTheCaseForWhyDadsMatter.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/482151/140602-father-son-child-development-1417_9adf644df1427356b66f0f0c1daa5b4b.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_maria-shriver_making-case-why-dads-matter-n121216_1540241546.html","title":"Making The Case For Why Dads Matter","title_page":"Making The Case For Why Dads Matter  - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"A man pushes a baby carriage in London, Nov. 11, 2011. Yui Mok / Press Association Images\nCultural stereotypes of bumbling dad burning dinner and twisting baby’s diaper in a knot have long been around. But where did the idea that dad couldn’t handle kid duty come from? And why have dads long been relegated to a very distant second in the childhood development debate?\nWith his new book, “Do Fathers Matter? What Science Is Telling Us About The Parent We’ve Overlooked,” father of five and author Paul Raeburn delivers a data rich dive into history, the animal kingdom, and societal assumptions, and comes to the conclusion that not only does dad play an essential role in the development of happy, healthy, well-adjusted kids, but in fact researchers are only just beginning to understand how essential.\nRaeburn finds evidence of dads’ crucial influence almost everywhere, from language development and empathy building to a host of research connecting father absence to accelerated reproductive development and sexual risk-taking in daughters. Even the simple act of play is revealed as illustrative of the huge influence of fathers.\n“Fathers who play with their kids have children who have fewer behavioral problems in their school years, adjust better to their transition to school from toddlerhood, and have less likelihood to be involved in delinquency or criminal behaviors as teenagers and even more as adults,” says Raeburn. “This has a lifelong effect on children and it’s really only in the last few years that this has begun to be recognized.”\nHaving made the case for fathers, Raeburn sees the research having real social impact.\n“If the research is showing that it’s important that fathers be around and be involved, then they now have a stronger argument to be home,” says Raeburn. “That’s a change that I predict, and that I think we all expect.”\nHere, Raeburn discusses the male biological clock (yes, men have one too), reveals why masculinity is not a quality that fathers can instill through discipline, and explains why men need not panic about fatherhood being associated with a drop in testosterone.\nYou point out that childhood development studies had a significant blind spot for a long time because the focus was almost exclusively on mothers. Can you talk about that?\nClearly, it’s very easy to watch pregnancy and labor and delivery, and understand that there’s something fundamentally important about mothers and the relationship with their children. The father’s relationship in those early months is obscured, obviously he’s involved in getting that process started, but then he doesn’t seem to have too much to do with it until the child is born or maybe until the child is older.\nResearchers...saw the obvious importance of the mother and they expanded that into a psychological theory that essentially excluded fathers altogether from the child’s early development.\nThe way research on parents and children developed historically began with a very strong focus on the mother. Sigmund Freud, a hundred years ago roughly, gave us our first really complex and interesting picture of the family, but a lot of what he said has not stood the test of time. But one of the people who came after him, a British psychologist by the name of John Bowlby, turned out to be very influential in research on families. His huge contribution was something called Attachment Theory, the idea that mothers and infants needed to attach securely at birth and shortly after, and if that didn’t happen the child would have a very difficult time developing normally in psychological terms. Attachment Theory became extremely important. I think researchers have some of the same blind spots as those who don’t study this for a living, and that is they saw the obvious importance of the mother and they expanded that into a psychological theory that essentially excluded fathers altogether from the child’s early development.\nYou say that fewer American fathers are participating in the lives of their children now than at any time since the US began keeping records. Is there a self-fulfilling prophecy aspect to this?\nYes, I think that’s absolutely right: when fathers are told over and over again for decades -- through most of the second half of the twentieth century -- that they are not relevant, or not important, they began to believe that themselves. I think many of us know fathers who are in fact not too involved in the early months and years of their children’s lives. You know, the cliche is the father who’s putting a baseball in his son’s crib, mainly looking forward to when the boy is old enough to stand and throw a ball back and forth; that’s when the father thinks he’ll be able to be involved in his boy’s life.\nWhen fathers are told over and over again for decades...that they are not relevant, or not important, they began to believe that themselves.\nNow, there are all kinds of cliches and sexism and stereotypes involved in that description, but I think that’s been the case for a lot of fathers. Many just felt they weren’t important and had to sort of struggle to be important.\nOf all the data you looked at, what stood out to you as the most remarkable influence fathers have on their children?\nThat’s a toughie, but here’s one that I thought was interesting and surprising: you might think that fathers don’t have too much influence on their children during pregnancy. But it turns out, that when fathers are not involved in the pregnancy, or at least they’re not involved with their partner who is pregnant, the risks to the child are much higher.\nThe child is more likely to be born prematurely if the father isn’t involved with the mother; the child is more likely to be born with a low birth weight, which can lead to all kinds of adverse health effects for the child. It also turns out that this connection between the father and the child during pregnancy -- when the father can’t touch, feel, or see the child -- has an important effect on the father.\nThe thinking is that the drop in testosterone and the rise in prolactin are changing the father’s temperament away from being a competitor and toward being nurturing.\nFathers who are involved during pregnancy with their partners, show a decline in testosterone, and even a rather mysterious rise in their prolactin, which is a hormone associated with nursing. Why fathers would show a rise in prolactin is not yet clear, but the thinking is that the drop in testosterone and the rise in prolactin are changing the father’s temperament away from being a competitor and toward being nurturing. He’s competed with other males for his spouse or his partner, and now that job is done, he becomes a more nurturing figure for the child he’s about to have.\nDo you think men will feel conflicted about that considering the emphasis the culture places on testosterone and its link to competitive edge and prowess?\nYou know we’re not aware of what our testosterone level is. We can’t feel when it’s going down. Some men might feel that they’re somehow impaired because their testosterone is falling, but there’s no research that suggests that if men’s testosterone falls during their partner’s pregnancy, that they will be less competitive at work. There’s no evidence that it will impair them in any way. In fact it’s not proven that a drop in testosterone makes them more nurturing, but at this point in the research, that’s the strong suspicion. Men certainly should have no reason to fear a drop in testosterone. Will some men feel conflicted and feel somehow diminished as men because their testosterone is falling? I’m sure there will be some of those.\nWomen hear non-stop about the risks associated with having children later. The data you present however, shows quite clearly that men also have a biological clock. Why is that not discussed more?\nWell, that’s a good question. The increasing evidence shows that as men have children at later ages, their children have an increased risk for some very serious problems: schizophrenia, autism, maybe ADHD, lots of developmental problems and genetic abnormalities. There’s a whole series of things that are associated with the father’s older age at the child’s time of birth.\nThe statistics are pretty strong, I believe. On the other hand it isn’t so large that fathers should make their decisions about childbearing based solely on their age. For example, the risk in general population of having a child who later develops schizophrenia is about 1%, for a father in his 40’s or 50’s the risk is probably about 2%, so it’s something to think about, but it’s probably not enough alone to decide not to have children; but that’s an individual decision.\nI think the reason we are only now finding about fathers’ biological clocks goes back to the bias towards studying mothers...so until recently nobody looked at fathers.\nI think the reason we are only now finding about fathers’ biological clocks goes back to the bias towards studying mothers, and the feeling that mothers are more important to children, so until recently nobody looked at fathers.\nThis was observed a long time ago, and nobody studied it or paid attention until the last few years. There was a German obstetrician who noticed that problems were more common in the fifth or sixth child than in the first child, and thought, “What’s happening? Is the child bearing machinery breaking down?” It turned out after studies, that what was happening was that the fathers were older by the time of the birth of the fifth or sixth child, and that’s what was leading to an increased risk. Now, there’s a complication here because older fathers are often married to or partnered with older mothers, so the researchers had to look at that, but the findings are pretty clear that there’s a real risk associated with older fathers, and that they do have a biological clock.\nOne point you raise, is that in the past dads’ responsibility was viewed as instilling masculinity in their sons. Can you discuss that idea and what researchers in fact discovered?\nGoing back to World War II, a lot of recruits didn’t make the physical, or didn’t qualify to go into the armed services. There was a big debate at the time about what was wrong, and that fathers were not instilling the proper masculinity in their sons, that they needed to be disciplinarians and show strength to pass that on to their sons.\nIt’s not the father’s demonstrations of masculinity that inculcate masculinity in his son, it is in fact the closeness of their relationship.\nMuch more recently, the research started to look at that more closely, and what we’ve discovered is that it’s not the father’s demonstrations of masculinity that inculcate masculinity in his son, it is in fact the closeness of their relationship. So, when fathers are close to their sons emotionally and intellectually, the sons see the connections with their fathers and they want to be like their fathers. If they don’t have a close relationship with their fathers, they’re much more likely to reject that, which has important effects on their personality as they grow up.\nYou spent a lot of time talking to researchers and specialists, but how have dads reacted to your book?\nI think, without exception, fathers have loved it. I think they see it as a validation of what a lot of them have felt. Our society is changing with respect to fathers. In part, that’s because many more women are working outside the home, economic factors make it more essential for both parents to work in many families, and so fathers are becoming more involved in childcare. They’re not doing as much as women, those statistics are out there, but they’re doing twice what they were 15 or 20 years ago. So, that’s changing. Many fathers feel that it’s changing, they feel that they’re important but they haven’t had the data to know why that’s the case. I think it gives a lot of validation to fathers and helps them understand why they’re important and how much they contribute to their children. None of this takes away from mothers’ contributions, it just adds a lot more about father’s contributions.\nThis interview has been edited.\nFor more information and inspiration visit MariaShriver.com","url":"https://www.nbcnews.com/feature/maria-shriver/making-case-why-dads-matter-n121216"}
