{"authors":["Alison Tyler"],"date_download":"2018-10-23 04:16:38","date_modify":"2018-10-23 04:16:38","date_publish":"2016-01-11 17:18:28","description":"They may taste fantastic, and be the gourmet equivalent of gold - but you need a resolute nose to go on a search for pongy truffles. Alison Tyler does just that in the hills of Umbria - and strikes lucky.","filename":"data/vaneerConsumption/MakingastinkinidyllicUmbriaOnahuntforpongytrufflesinthewoodsandhillsofcentralItalyaresilientstomachrequired.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/00011A7800000CB2-0-image-a-22_1452532607431.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_article-3394278_Making-stink-idyllic-Umbria-hunt-pongy-truffles-woods-hills-central-Italy-resilient-stomach-required_1540268198.html","title":"Making a stink in idyllic Umbria: On a hunt for pongy truffles in the woods and hills of central Italy (a resilient stomach required)","title_page":"Making a stink in idyllic Umbria: On a hunt for pongy truffles in the woods and hills of central Italy (a resilient stomach required) | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Walking through woodland, the sun's rays shimmying between the trunks, and our feet rustling through the leaves, we could be on a meandering stroll.\nBut we're not here to take in the gentle Umbrian scenery.\nSetting the pace and leading the way is Giuseppe, a truffle hunter, and his dog Leda. We're on the hunt for the prized wild tartufo bianco that has a short season and can't be farmed.\nGourmet gold: Truffles are a highly sought-after commodity - and fetch a high price\nThanks to its elusive habit and the incredibly rich, umami flavour that it brings to any dish, white truffles are the most expensive food on the planet, regularly costing £2,000 a kilo.\nThe dog barks and rummages excitedly in the undergrowth; Guiseppe steps in with his knife. He's struck gold -we can smell it!\nThe truffle looks like a dirty stone. By lunchtime, it will be on the menu at L'Antica Osteria in the tiny hilltop town of Montone, or for sale in the square at the annual Festa del Bosco, which takes place between October 30 and November 2.\nWe are staying in a converted medieval farm and church, Chiesa del Carmine, in a valley surrounded by olive groves, vines and its own truffle woods. At this time of year you can still eat alfresco - which we do - and drink the estate's own Sangiovese.\nAfter lunch of tagliatelle with white truffle, venison stew with shaved truffles and a slab of steak covered in truffle, washed down with local Umbrian wine, we head north to Citta di Castello.\nThe Tartufo Bianco Festival takes place here over the last three weekends in November, when the atmosphere in the evening is more like a carnival, with dancers, street performers and plenty of food and wine.\nBy day, the Truffle tents greet you with their intense, woody whiff and you can try truffle pate, oils, truffled honey and cheese: you can pick up a small black truffle for about €10 (£7) or oils and other treats from about €5 (£3).\nFor rather less pongy presents, there's porcini, hazelnuts, wild boar, wine and olive oil. Delicious.","url":"https://www.dailymail.co.uk/travel/article-3394278/Making-stink-idyllic-Umbria-hunt-pongy-truffles-woods-hills-central-Italy-resilient-stomach-required.html"}
