{"authors":[],"date_download":"2018-10-22 20:49:10","date_modify":"2018-10-22 20:49:10","date_publish":"2014-05-04 10:17:22","description":"Malaysia’s Inspector General of Police has denied any link between the arrest of 11 alleged militants and the disappearance of Flight MH370.","filename":"data/vaneerConsumption/MalaysiaPoliceChiefDeniesTerrorArrestLinktoMissingMH370.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_26/237921/140308-malaysia-plane-js-0659_8faeb8287368d4013607739c8cbb487d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_malaysia-police-chief-denies-terror-arrest-link-missing-mh370-n96576_1540241350.html","title":"Malaysia Police Chief Denies Terror Arrest Link to Missing MH370","title_page":"Malaysia Police Chief Denies Terror Arrest Link to Missing MH370","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nOne of Malaysia’s most senior police chiefs has denied there is any link between the arrest of 11 alleged militants and the disappearance of Flight MH370.\nThe suspects, all aged between 22 and 55, were detailed in the Kedah and Selangor regions last week, local media reported.\nMultiple news outlets reported that the suspects had links to al Qaeda and were arrested over the disappearance of the Malaysia Airlines Boeing 777 which took off from Kuala Lumpur for bound for Beijing on March 8.\n\"There is absolutely no connection between the arrests and the MH370,\" Malaysia’s Inspector General of Police, Khalid Bakar, told NBC News.\nHe also denied reports that the detainees were student activists.\nThe suspects, who were rounded up by the Bukit Aman Special Branch Anti-Terrorism Unit, are believed to have links to terror networks in Syria and southern Philippines and were planning to send Malaysian fighters to Damascus, The Star in Kuala Lumpur reported.\nThe development came on the same day as the first funeral for passengers missing on the flight, and a day after the airline said it had started talking to the families to discuss compensation.\nArata Yamamoto and Alastair Jamieson","url":"https://www.nbcnews.com/storyline/missing-jet/malaysia-police-chief-denies-terror-arrest-link-missing-mh370-n96576"}
