{"authors":["Associated Press"],"date_download":"2018-10-22 23:19:57","date_modify":"2018-10-22 23:19:57","date_publish":"2017-03-16 06:29:40","description":"KUALA LUMPUR, Malaysia (AP) - Malaysian officials said Thursday that the family of Kim Jong Nam, who was killed last month, has given its consent to Malaysia...","filename":"data/vaneerConsumption/MalaysiasaysithasfamilyconsenttodecideonKimsbody.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/10/wire-227755-1489660482-412_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4319012_Malaysia-says-family-consent-decide-Kims-body_1540250397.html","title":"Malaysia says it has family consent to decide on Kim's body","title_page":"Malaysia says it has family consent to decide on Kim's body | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"KUALA LUMPUR, Malaysia (AP) - Malaysian officials said Thursday that the family of Kim Jong Nam, who was killed last month, has given its consent to Malaysia to decide what to do with his body.\nDeputy Prime Minister Ahmad Zahid Hamidi said police confirmed Kim's identity using DNA from his son which was obtained overseas and brought to Malaysia, local media reported. Kim was holding a diplomatic passport bearing the name Kim Chol when he was attacked Feb. 13 at Kuala Lumpur's airport by two women who smeared the banned VX nerve agent on his face, officials say. He died within 20 minutes.\nDeputy national police Chief Noor Rashid Ibrahim said Kim's family will let the government decide what to do with his body.\nA women walks past the North Korean Embassy in Kuala Lumpur, Malaysia, Thursday, March 16, 2017. A senior Malaysian police official said Thursday that the family of Kim Jong Nam, who was killed last month, has given consent to Malaysia to decide what to do with his body. (AP Photo/Vincent Thian)\n\"I was made to understand that they are leaving it to our government to deal with it (body) ... yes, they have given their consent,\" Noor Rashid said.\nHe said any decision will be subject to negotiations between the two countries amid a diplomatic standoff over the killing. Kim was the estranged half brother of North Korea's leader, Kim Jong Un, and relations between Malaysia and North Korea have deteriorated sharply since Kim's death, with each expelling the other's ambassador.\nNorth Korea blocked Malaysians from leaving the country until a \"fair settlement\" of the case is reached. Malaysia then barred North Koreans from exiting its soil. The two countries have also scrapped visa-free travel for each other's citizens.\nNoor Rashid declined to comment on whether the two women had been given different components that would form a binary version of VX, but described it as a \"professional job.\"\nNational police chief Khalid Abu Bakar separately told reporters that four North Korean suspects who left Malaysia on the same day as the killing have been put on Interpol's red notice list, which is a request to locate and hold a person pending extradition.\nPolice say three other North Korean suspects, including a North Korean diplomat and an employee of Air Koryo, North Korea's state airline, are believed to be in the North Korean Embassy in Kuala Lumpur.\nThere are currently nine Malaysians in North Korea - three embassy staff members and their family members. About 315 North Koreans are in Malaysia.\nAlthough Malaysia has never directly accused North Korea of being behind the attack, many speculate that it must have orchestrated it.\nExperts say the VX nerve agent used to kill Kim was almost certainly produced in a sophisticated state weapons laboratory, and North Korea is widely believed to possess large quantities of chemical weapons.\nIn Beijing, a North Korean diplomat said Thursday that the killing was a political conspiracy engineered by Washington and Seoul.\nPak Myong Ho, a minister at the North Korean Embassy in Beijing, said the death was a \"despicable and extremely dangerous\" plot by the U.S. and South Korea aimed at smearing North Korea's image and subverting its regime.\nA staff member of the North Korean Embassy picks up a newspaper from the gate of the embassy in Kuala Lumpur, Malaysia, Thursday, March 16, 2017. A senior Malaysian police official said Thursday that the family of Kim Jong Nam, who was killed last month, has given consent to Malaysia to decide what to do with his body. (AP Photo/Vincent Thian)","url":"https://www.dailymail.co.uk/wires/ap/article-4319012/Malaysia-says-family-consent-decide-Kims-body.html"}
