{"authors":[],"date_download":"2018-10-22 20:54:49","date_modify":"2018-10-22 20:54:49","date_publish":"2014-05-05 02:38:23","description":"The search for missing Malaysian Airlines Jet 370 will enter a new phase that focuses on intensifying the undersea search in a larger area.","filename":"data/vaneerConsumption/MalaysianJetMH370SearchtoUseMoreSophisticatedTools.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/396466/140423-malaysia-search-plane-1831_4c3fe80de37b667d925332847db863b5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_malaysian-jet-mh370-search-use-more-sophisticated-tools-n96931_1540241689.html","title":"Malaysian Jet MH370 Search to Use More Sophisticated Tools","title_page":"Malaysian Jet MH370 Search to Use More Sophisticated Tools","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe search for missing Malaysian Airlines Jet 370 will enter a new phase that focuses on intensifying the undersea search in a larger area, a top Australian official said Monday.\nThe new phase will undertake more detailed oceanographic mapping of areas that have not been mapped before, Deputy Prime Minister Warren Truss said at a briefing with officials from Malaysia and China.\nThat will require more sophisticated equipment — most likely coming from the private sector — that can operate deeper in the ocean than the Bluefin 21 autonomous sub.\nPlanes, ships and investigators from 26 nations have been scouring the southern Indian Ocean for the Boeing 777 that vanished on March 8 as it flew from Kuala Lumpur to Beijing with 239 people on board.\nThe unmanned Bluefin 21 — launched from the Australian Defense Vessel, Ocean Shield — has been the only vehicle available to survey the floor of the southern Indian Ocean for wreckage of Flight MH370. It has been taken out of action while the Ocean Shield returns to port for supplies and maintenance, but will return to search a wider area.\nLaunched on March 30, the Ocean Shield found the “most promising lead” in the hunt for the missing plane, when it recorded signals consistent with transmissions from aircraft black boxes, when towing a U.S. Navy owned “pinger locator.” The U.S. Navy will continue its support of the search for the next four weeks, Australia's Joint Agency Coordination Centre said in a news release.\nThe locator searchers to zero in on the area they believe could be the plane’s resting place, although officials assume the batteries in the black box recorders died before they could triangulate its final position.\nSince then, Bluefin 21 has failed to find any wreckage.","url":"https://www.nbcnews.com/storyline/missing-jet/malaysian-jet-mh370-search-use-more-sophisticated-tools-n96931"}
