{"authors":[],"date_download":"2018-10-22 21:41:31","date_modify":"2018-10-22 21:41:31","date_publish":"2014-05-07 20:16:54","description":"The Pakistani teenage activist who survived an assassination attempt said she is compelled to speak out about the kidnappings.","filename":"data/vaneerConsumption/MalalaSaysKidnappedNigerianSchoolgirlsAreHerSisters.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/428101/140507-malala-jms-2331_a42e6568e18789b0b62f69ad448aa1ae.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_malala-says-kidnapped-nigerian-schoolgirls-are-her-sisters-n99701_1540244491.html","title":"Malala Says Kidnapped Nigerian Schoolgirls Are Her 'Sisters'","title_page":"Malala Says Kidnapped Nigerian Schoolgirls Are Her 'Sisters'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nHundreds of schoolgirls kidnapped in Nigeria have found a powerful ally — Malala Yousafzai, the Pakistani teenager who survived a Taliban assassination attempt and became a global symbol of girl-power, equal rights and triumph over terror.\n\"These girls are my sisters,\" the brave 16-year-old activist told NBC News' Bill Neely on Wednesday in Birmingham, England, where she has been living since being targeted for death in 2012 because of her tireless campaigning.\n\"And I am feeling very sad.\"\nShe offered a message to the abducted Nigerians: \"Never lose hope because we are with you.\"\nYousafzai, a remarkable figure who was a contender for the Nobel Peace Prize and was invited to the White House, called on the world to speak out against the brutal Islamic extremist group Boko Haram, which bragged about abducting more than 200 girls and threatened to sell them.\n\"We should all stand up together and we should speak,\" she said.\n\"It's like another kind of terrorism.\"\nAlthough the Nigerian crisis is unfolding a world away from where she was ambushed on a school bus in the Swat region of Pakistan, Yousafzai saw disturbing parallels between the two situations.\n\"It is what happened in Swat as well. In Swat we were suffering … girls were banned from going to school and banned from going to market, and the same is happening in Nigeria,\" she said.\n\"They were in schools trying to study thinking about their future, and then suddenly some people came and abducted them.\"\nShe added, \"I think it is beyond our imagination and a very horrible situation, so it is like another kind of terrorism.\"\nYousafzai was just 11 when she outraged the Taliban with a speech entitled, “How dare the Taliban take away my basic right to education?”\nDespite the danger, she continued to speak out about girls' right to schooling. She was on a bus on her way home from an exam when a gunman stormed on and shot her point-blank in the head.\nEven though her insistence on speaking out nearly cost Yousafzai her life, she feels she has no choice but to join the international chorus calling for increased pressure on the Boko Haram to release the Nigerian girls.\n\"It is my duty that I will speak even if no one is listening to me,\" she said. \"I will continue … until people take action.\n\"I have learned from my life when you are speaking from truth, when you are speaking from justice, then no one can defeat you. And this is what I believe in.\"\nProtesting against the abductions is the only hope of preventing more of them, she said: \"The thing is, if you want to protect other girls as well, then we have to speak.\"\nYousafzai runs a foundation in her name and she said its next project will be focused on secure education for girls in Nigeria.\n\"I think this is just a small globe,\" she said.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/malala-says-kidnapped-nigerian-schoolgirls-are-her-sisters-n99701"}
