{"authors":["Associated Press"],"date_download":"2018-10-22 21:50:26","date_modify":"2018-10-22 21:50:26","date_publish":"2016-01-28 09:05:05","description":"KUALA LUMPUR, Malaysia (AP) — Malaysia on Thursday cut its 2016 growth forecast and slashed spending plans as the economy reels from the slump in oil prices,...","filename":"data/vaneerConsumption/Malaysiacutsgrowthforecastcutsbudgetasoilslides.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:b488b6c6a3e34366ba11989c7d7396e4-4vVdYopwYQ7f641721b07ab0f610-610_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420486_Malaysia-cuts-growth-forecast-oil-price-slump-hits_1540245026.html","title":"Malaysia cuts growth forecast, cuts budget as oil slides","title_page":"Malaysia cuts growth forecast, cuts budget as oil slides | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Malaysia cuts growth forecast, cuts budget as oil slides\nKUALA LUMPUR, Malaysia (AP) — Malaysia on Thursday cut its 2016 growth forecast and slashed spending plans as the economy reels from the slump in oil prices, dealing a new setback to embattled Prime Minister Najib Razak.\nIn a speech, Najib said the government had based the 2016 budget on oil prices averaging $48 a barrel, but that estimate has been lowered to $30-$35 a barrel.\nState oil company Petronas contributes about a third of all revenue collected by the Malaysian government, which loses around 300 million ringgit ($70 million) for every $1 drop in oil prices.\nMalaysian Prime Minister Najib Razak, right, with Deputy Prime Minister Ahmad Zahid Hamidi stands for the national anthem during a special announcement on the budget revision at the Putrajaya International Convention Center outside Kuala Lumpur, Malaysia, Thursday, Jan. 28, 2016. Najib said the government had based the 2016 budget on oil prices averaging $48 a barrel, but that estimate has been lowered to $30-$35 a barrel. He said the government loses around 300 million ringgit ($70 million) for every $1 drop in oil prices. (AP Photo/Joshua Paul)\nNajib said economic growth will be between 4 and 4.5 percent this year, down from an earlier estimate of 4 to 5 percent.\nThe economy has also been hit by a sharp fall in the Malaysian ringgit, which tumbled nearly 20 percent last year partly due to a financial scandal involving hundreds of millions of dollars channeled into Najib's personal accounts.\nThe attorney-general on Tuesday said Najib had not committed any criminal wrongdoing. It said most of the money was a personal donation from the Saudi royal family, a claim met with widespread skepticism. Malaysia's anti-corruption agency was appealing the attorney general's decision to clear Najib to a review panel.\nNajib said the ringgit, currently at around 4.25 to the dollar, doesn't reflect its true value and is expected to strengthen once the global economy stabilizes.\nBrent crude, a benchmark for international oil prices, was trading at about $34 a barrel on Thursday, down from $49 a year ago and $107 two years ago.\nFinance Ministry officials said the budget revision will include cutting 5 billion ringgit ($1.2 billion) from development expenditure and 4 billion ringgit ($952 million) from operating expenses.\nNajib said worker contributions to a national provident fund will be slashed by three percent from March until December 2017, a move that is expected to boost household spending by eight billion ringgit ($1.9 billion).\nSome two million tax payers will also be given special tax relief. He said the government will lose 350 million ringgit ($83 million) but it will give the taxpayers total savings of 475 million ringgit ($113 million).\nNajib said the government also plans to change the status of illegal immigrants, allowing them to work to meet labor shortages in various industries. He didn't give further details.\nMeasures planned to reduce the cost of living include setting up outlets offering cheaper local agricultural produce, building cheaper homes for first-time owners and skill training for retrenched workers.\nTo boost tourism, visitors from China can enter the country visa-free for 15 days.\nMalaysian Prime Minister Najib Razak delivers his speech during a special announcement on the budget revision at the Putrajaya International Convention Center in Putrajaya, outside Kuala Lumpur, Malaysia, Thursday, Jan. 28, 2016. Najib said the government had based the 2016 budget on oil prices averaging $48 a barrel, but that estimate has been lowered to $30-$35 a barrel. He said the government loses around 300 million ringgit ($70 million) for every $1 drop in oil prices. (AP Photo/Joshua Paul)\nMalaysian Prime Minister Najib Razak delivers his speech during a special announcement on the budget revision at the Putrajaya International Convention Center outside Kuala Lumpur, Malaysia, Thursday, Jan. 28, 2016. Najib said the government had based the 2016 budget on oil prices averaging $48 a barrel, but that estimate has been lowered to $30-$35 a barrel. He said the government loses around 300 million ringgit ($70 million) for every $1 drop in oil prices. (AP Photo/Joshua Paul)","url":"https://www.dailymail.co.uk/wires/ap/article-3420486/Malaysia-cuts-growth-forecast-oil-price-slump-hits.html"}
