{"authors":["Gareth Davies For Mailonline"],"date_download":"2018-10-22 23:57:50","date_modify":"2018-10-22 23:57:50","date_publish":"2017-04-26 08:52:30","description":"Mohamed Thaqif Amin Mohd Gaddafi, 11, was in a coma Sultan Ismail Hospital, Malaysia, having lost both legs and doctors were going to remove his arm but his condition worsened.","filename":"data/vaneerConsumption/Malaysianboydiesafterseverebeatingbyschoolstaff.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9D454400000578-0-image-a-5_1493193045932.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446658_Boy-11-dies-severe-beating-staff-school_1540252670.html","title":"Malaysian boy dies after 'severe beating by school staff'","title_page":"Malaysian boy dies after 'severe beating by school staff' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A schoolboy who had his legs amputated after an alleged beating by staff at a school in Malaysia had died from his injuries after a month-long fight for his life.\nMohamed Thaqif Amin Mohd Gaddafi, 11, was in an induced coma at the High Dependency Ward in the Sultan Ismail Hospital having already lost both his legs to amputation. Doctors planned to remove his arm this morning before his condition worsened.\nPolice say the boy and 14 others were lashed with a water hose because they made a noise in the school's Islamic assembly building.\nMohamed Thaqif Amin Mohd Gaddafi in his hospital bed just days before he died of his injuries\nThe boy died today with his father Mohd Ghadiffi Mat Karim, 43, and his mother Felda Wani Ahmad by his side.\nMr Karim said the family had accepted his son's death as fate.\nThe local force said Thaqif had been beaten multiple times by an assistant warden at his school's hostel, the latest being on March 24.\nOfficers obtained a four-day remand order on the 29-year-old suspected attacker, who has served a two-year jail sentence in the past and has a criminal record for theft.\nThe boy's auntie Nurul Nabilah Ahmad, 30, said he was taken to hospital after suffering severe pain which emerged days after it is thought he was beaten at the religious school in Kota Tinggi.\nDoctors were monitoring a blood clot in his left shoulder and were planning to operate this morning.\nSadly, the boy's condition was never stable enough to take him into surgery and he died hours later.\nThaqif's legs were amputated on Friday to stop infection spreading and he had undergone surgery a day after he was admitted to treat congealed blood in one of his hands.","url":"https://www.dailymail.co.uk/news/article-4446658/Boy-11-dies-severe-beating-staff-school.html"}
