{"authors":[],"date_download":"2018-10-23 02:19:08","date_modify":"2018-10-23 02:19:08","date_publish":"2017-03-10 11:18:11","description":"Malaysia's police chief confirmed Friday that the man assassinated at Kuala Lumpur's international airport last month was Kim Jong-Nam, half-brother of North...","filename":"data/vaneerConsumption/MalaysiapoliceconfirmKimJongNamidentity.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/13/wire-196103-1489151292-143_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300836_Malaysia-police-confirm-Kim-Jong-Nam-identity_1540261148.html","title":"Malaysia police confirm Kim Jong-Nam identity","title_page":"Malaysia police confirm Kim Jong-Nam identity | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kim Jong-Nam (C, in grey suit), half-brother of North Korea's leader Kim Jong-Un, was attacked with a lethal nerve agent at Kuala Lumpur's international airport in February\nMalaysia's police chief confirmed Friday that the man assassinated at Kuala Lumpur's international airport last month was Kim Jong-Nam, half-brother of North Korea's leader Kim Jong-Un.\nInspector General Khalid Abu Bakar told a news conference that he could not release details of how the identity was determined due to \"security\" concerns, but Malaysian authorities had earlier declined to officially confirm the victim's identity or release his body without a DNA sample from next-of-kin.\n\"For the security of the witnesses so I'm not going to tell you how it was done,\" he said of the identification process.\nThe 45-year-old was carrying a passport bearing the name of Kim Chol when he was attacked on February 13 with the lethal nerve agent VX by two women.\nHis wife and children, who were living in exile in the Chinese territory of Macau, have since gone into hiding over fears that his 21-year-old son, Kim Han-Sol, could be seen as a potential rival by his uncle Kim Jong-Un in a country roiled by bloody purges.\nThe brazen Cold War-style killing triggered a bitter diplomatic row between the previously friendly Asian nations, which have expelled each other's ambassador and refused to let their citizens leave.\nNorth Korea has never confirmed the identity of the dead man, but has denounced the Malaysian investigation as an attempt to smear the secretive regime, insisting that he most likely died of a heart attack.\nNorth Korean leader Kim Jong-Un (R) ordered the killing of his half-brother Kim Jong-Nam (L), according to South Korea\nExpelled North Korean ambassador Kang Chol slammed what he called a \"pre-targeted investigation by the Malaysian police\" on Monday, just before leaving the country.\nPyongyang retaliated by formally expelling his Malaysian counterpart, who was already back in Kuala Lumpur for consultations.\nPrime Minister Najib Razak on Friday urged Malaysians to pray for the safe return of nine compatriots barred from leaving North Korea.\nThree Malaysian embassy staff and six family members remain stuck in Pyongyang after North Korea barred Malaysians from leaving the country on Tuesday, prompting a tit-for-tat move by Malaysia.\nTwo Malaysians working for the UN World Food Programme were permitted to leave North Korea on Thursday.\n- Football match postponed -\nThe Asian Football Confederation (AFC) said on Friday that it would postpone an Asian Cup qualifier between Malaysia and North Korea due to their souring ties.\nThe Harimau Malaysia squad had been due to play in the North Korean capital on March 28 as a lead up to the 2019 tournament in the United Arab Emirates.\nBut the fate of the match was thrown into doubt after Malaysian officials this week banned the team from playing in Pyongyang.\n\"The AFC Competitions Committee have taken the decision to postpone the tie after escalating diplomatic tension between the Governments of DPR Korea and Malaysia,\" the AFC said in a statement.\n\"A new date for the game will be announced in due course.\"\nSouth Korea has blamed Pyongyang for the assassination and Malaysian police are seeking seven North Korean suspects, four of whom left Malaysia on the day of the murder.\nThe Malaysian police chief has said he believes the other three are hiding in North Korea's embassy in Kuala Lumpur.\nTwo women -- one Vietnamese and one Indonesian -- have been arrested and charged with the murder. Airport CCTV footage shows them approaching the victim and apparently smearing his face with a piece of cloth.","url":"https://www.dailymail.co.uk/wires/afp/article-4300836/Malaysia-police-confirm-Kim-Jong-Nam-identity.html"}
