{"authors":["Freya Noble For Daily Mail Australia"],"date_download":"2018-10-22 20:11:12","date_modify":"2018-10-22 20:11:12","date_publish":"2016-01-28 00:29:02","description":"According to a report published in The Art Magazine, Malcolm Turnbull complained that a 1994 portrait of him by artist Lewis Miller made him look like a 'big, fat, greedy, c***'.","filename":"data/vaneerConsumption/MalcolmTurnbullsaidLewisMillermadehimlooklikeabigfatgreedycinportrait.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/30A5D17E00000578-0-image-a-27_1453940111690.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420140_Malcolm-Turnbull-said-artist-Lewis-Miller-look-like-big-fat-greedy-c-portrait_1540239072.html","title":"Malcolm Turnbull said Lewis Miller made him 'look like a big, fat, greedy c***'' in portrait","title_page":"Malcolm Turnbull said Lewis Miller made him 'look like a big, fat, greedy c***'' in portrait | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Turnbull later appeared in an Archibald Prize painting in 2007\nMiller is said to have destroyed the painting and all\nof the then merchant banker in the Archibald Prize\nWhen artist Lewis Miller painted a portrait of then merchant banker Malcolm Turnbull in 1994, he hoped it would win him an Archibald Prize.\nHowever, according to the The Art Magazine, Turnbull complained to art critic Ray Hughes at a function that the painting made him look like a 'big, fat, greedy c***'.\n'That artist of yours is no good; he's made me look like a big, fat, greedy c***', Turnbull reportedly told Hughes at the time.\nMalcolm Turnbull is said to have criticized a portrait of himself from 1994 apparently saying the artist made him look like a 'big, fat, greedy c***'\nLewis Miller, pictured here with his painting of Ronald Dale Barassi in 2000, was so upset he destroyed the painting of Turnbull and any photographs of it\n'He is a realist painter, you know', Hughes responded.\nMiller was so upset by this criticism he took to the portrait with a knife and tore it to shreds, according to the Sydney Morning Herald.\n'The message from Malcolm was that he didn't like it, obviously,' Miller told the publication.\n'I think he was taken aback because I had started it without consulting him.'\nThe Prime Minister's office declined to comment when contacted by Daily Mail Australia.\nThe revelations about Turnbull come after Ray Hughes' son announced he would be running contesting the PM's seat at the next federal election for the Australian Labor Party.\nMiller said he suspected this was the reason the story had been brought to life over two decades since it occurred.\nTurnbull later featured in Vivian Falk's 2007 Archibald Prize portrait, 'A moment with Malcolm'\nMiller was a finalist in the 2011 Archibalds for his painting 'Small self portrait'\nHe said that he did not believe the current prime minister possessed any of the qualities the anecdote portrayed him as having.\nDespite destroying the 1994 painting, Miller later won an Archibald Prize in 1998 for his portrait of Allan Mitelman.\nIn 2000 he took out the Sporting Portrait Prize for 'Portrait of Ronald Dale Barassi', and he was also a finalist in the 2011 Archibalds for his painting 'Small self portrait'.","url":"https://www.dailymail.co.uk/news/article-3420140/Malcolm-Turnbull-said-artist-Lewis-Miller-look-like-big-fat-greedy-c-portrait.html"}
