{"authors":["Cindy Tran For Daily Mail Australia"],"date_download":"2018-10-23 00:28:25","date_modify":"2018-10-23 00:28:25","date_publish":"2017-03-16 09:48:00","description":"Prime Minister Malcolm Turnbull has awkwardly explained why Carrie Bickmore hasn't been invited to dinner at his multi-million dollar mansion.","filename":"data/vaneerConsumption/MalcolmTurnbullonCarrieBickmoresdinnerinvite.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E5333EC00000578-0-image-a-14_1489657652486.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319408_Carrie-Bickmore-asks-Malcolm-Turnbull-dinner-invitation_1540254505.html","title":"Malcolm Turnbull on Carrie Bickmore's dinner invite","title_page":"Malcolm Turnbull on Carrie Bickmore's dinner invite | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Malcolm Turnbull has awkwardly explained why Carrie Bickmore hasn't been invited to dinner at his multi-million dollar mansion.\nAppearing on The Project on Thursday night, the Australian Prime Minister discussed about the Snowy Mountains hydro scheme and electricity prices.\nBut going off topic to wrap up the end of his television interview, Bickmore asked the top leader why he hasn't kept his promise to have her around for dinner.\nScroll down for video\nCarrie Bickmore (pictured with her co-host Waleed Aly) asked the Prime Minister when she was coming around for dinner at his multi-million dollar mansion\n'When are Pete [Helliar] and I coming over for dinner? You promised us we'd come for dinner,' Bickmore asked.\nThe cheeky politician responded: 'Well you're very busy... But if you could fit me into your schedule, you let me know.\nStunned by the Prime Minister's response, Bickmore replied: 'Oh okay, great.'\n'Well I'm looking forward to that fish you promised me,' she said, to which Mr Turnbull responded: 'Okay done, we'll line it up.'\nCheeky Malcolm Turnbull told Bickmore that she has been too busy to fit him into her schedule\n'We'll have that on the same day the power bills come down?' Bickmore insisted\nMr Turnbull responded: 'Well the Snowy hydro scheme take about four years to finish. So I reckon we should have dinner before then.\n'But the most important thing is to make sure that the gas is affordable too and I'm dealing with that as well, otherwise, that's how we'll cook the fish.'","url":"https://www.dailymail.co.uk/news/article-4319408/Carrie-Bickmore-asks-Malcolm-Turnbull-dinner-invitation.html"}
