{"authors":["Associated Press"],"date_download":"2018-10-22 22:36:04","date_modify":"2018-10-22 22:36:04","date_publish":"2016-01-29 09:49:13","description":"COLOMBO, Sri Lanka (AP) — The Maldives' government said Friday it hopes the country's jailed former president will return after undergoing surgery in Britain...","filename":"data/vaneerConsumption/MaldiveshopesjailedexpresidentwillreturnfromBritain.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422362_Maldives-hopes-jailed-ex-president-return-Britain_1540247764.html","title":"Maldives hopes jailed ex-president will return from Britain","title_page":"Maldives hopes jailed ex-president will return from Britain | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Maldives hopes jailed ex-president will return from Britain\nCOLOMBO, Sri Lanka (AP) — The Maldives' government said Friday it hopes the country's jailed former president will return after undergoing surgery in Britain following comments by the former leader suggesting he may not.\nMinister for Legal Affairs Azima Shakoor said the government will have limited options if Mohamed Nasheed doesn't return because he will be out of Maldives' jurisdiction.\n\"I believe that he would return. He is a former president and a man of stature. He has given a guarantee as all other people serving a prison sentence would give,\" she said.\nThe government allowed Nasheed, who is serving a 13-year sentence for ordering the arrest of a judge while in power, a 30-day medical leave to travel to Britain for spinal surgery. However, Nasheed told reporters in London that there is a question of how and when he would return.\nThe Maldives government accused Nasheed of misusing his leave for political purposes after he met with Prime Minister David Cameron and appeared in a series of media interviews.\nNasheed's rushed trial and conviction drew wide international condemnation for lack of due process, and the United Nations working group on arbitrary detention called his imprisonment unlawful.\nNasheed was elected president in the country's first multiparty polls in 2008, ending 30 years of autocratic rule by current President Yameen Abdul Gayoom's half-brother.\nHe resigned in 2012 amid weeks of public protests over his arrest of the judge.\nNasheed lost to Gayoom in a disputed presidential election in 2013.","url":"https://www.dailymail.co.uk/wires/ap/article-3422362/Maldives-hopes-jailed-ex-president-return-Britain.html"}
