{"authors":[],"date_download":"2018-10-23 04:59:19","date_modify":"2018-10-23 04:59:19","date_publish":"2017-03-10 15:08:10","description":"Maldivian opposition parties protested Friday a planned visit by King Salman following reports that Saudi business interests were buying an entire atoll in...","filename":"data/vaneerConsumption/MaldivesoppositionprotestsSaudikingsvisit.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/15/wire-196601-1489158493-986_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4301598_Maldives-opposition-protests-Saudi-kings-visit_1540270759.html","title":"Maldives opposition protests Saudi king's visit","title_page":"Maldives opposition protests Saudi king's visit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Maldives 1,192 tiny coral islands account for just 300 square kilometres (115 square miles) of land\nMaldivian opposition parties protested Friday a planned visit by King Salman following reports that Saudi business interests were buying an entire atoll in the politically-troubled Indian Ocean republic.\nA coalition of opposition parties and dissidents said they would stage street demonstrations against the alleged sale of islands when the Saudi monarch and his 1,000-strong entourage visits the Maldives.\n\"We will make it very clear to the Saudi Royals that we are against the sale of our land,\" former Maldives foreign minister Ahmed Naseem told reporters in Colombo.\nHe said there were persistent reports in the Maldives that either the Saudi government or a Saudi business entity was buying an atoll of 28 small coral islands for billions of dollars.\nThe announcement by the Colombo-based Maldives United Opposition (MUO) came a day after the government of President Abdulla Yameen denied it was selling islands to the Saudis or anyone else.\nHowever, the MUO insisted that the government was planning to go ahead with a deal that could be worth twice the $5.2 billion economy of the island nation of 340,000 Sunni Muslims.\nMUO leaders accused Yameen's regime of ordering a crackdown on opposition activists ahead of the royal visit, which is part of the monarch's Asian tour which began in Malaysia and has taken him to Indonesia.\nHe is due to travel to China and Japan before ending the tour in the Maldives.\nThe Maldivian opposition accuses Yameen of ceding control of the inhabited atoll of Faafu to Saudi Arabia. In 2015, Yameen lifted a ban on foreign ownership of real estate.\nLand is scarce in the Maldives where 99.9 percent of its territory is sea and the nation's 1,192 tiny coral islands account for just 300 square kilometres (115 square miles) of land.\nHowever, the islands are strategically located -- scattered some 800 kilometres (500 miles) across the equator -- straddling the main East-West international shipping lanes.\nThe country is a popular upmarket holiday destination but its image has been hit by political unrest in recent years.\nOpposition leader and former president Mohamed Nasheed is currently living in exile in London after he was jailed on terror-related charges widely criticised as politically motivated.\nThe low-lying islands are also threatened by rising sea levels and the United Nations has warned the country could be underwater by 2100.","url":"https://www.dailymail.co.uk/wires/afp/article-4301598/Maldives-opposition-protests-Saudi-kings-visit.html"}
