{"authors":[],"date_download":"2018-10-22 22:35:15","date_modify":"2018-10-22 22:35:15","date_publish":"2016-01-29 09:45:26","description":"The Maldives said Friday it could extend the prison leave granted to former president Mohamed Nasheed to go to London for medical treatment after he hinted a...","filename":"data/vaneerConsumption/MaldivesreadytoextendNasheedsprisonleave.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h80o-3bmscybNe842cce83474b539def7-609_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422361_Maldives-ready-extend-Nasheeds-prison-leave_1540247715.html","title":"Maldives ready to extend Nasheed's prison leave","title_page":"Maldives ready to extend Nasheed's prison leave | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Maldives ready to extend Nasheed's prison leave\nThe Maldives said Friday it could extend the prison leave granted to former president Mohamed Nasheed to go to London for medical treatment after he hinted at delaying his return.\nNasheed, who is serving a 13-year jail term after being convicted on controversial terrorism-related charges, arrived in London last week.\nHe has hinted he may stay beyond the 30 days' leave the government granted him in a deal brokered by Sri Lanka, India and former colonial power Britain.\nFormer Maldives president Mohamed Nasheed, who is serving a 13-year jail term after being convicted on controversial terrorism-related charges, arrived in London last week ©Ben Stansall (AFP/File)\n\"Our belief is he would return. He is a man of great stature. I don't think there is a question of him not returning,\" the minister for legal affairs in the president's office Aishath Azima Shakoor told reporters in Colombo.\n\"If he requests an extension of medical leave, he will certainly get it.\"\nNasheed was accorded a red carpet welcome and received by Prime Minister David Cameron when he arrived in Britain last Thursday for spinal cord surgery.\nThe 48-year-old told reporters in London that he had not yet decided whether to return to the Maldives after his leave.\n\"I know the question you all want to ask is will I go back. This has been more eloquently answered by The Clash in 1982 when I was doing my A-Levels -- 'Should I Stay Or Should I Go?'\" said Nasheed, who was educated in Britain.\n\"Let me be clear. I will go to the Maldives. I will definitely go to the Maldives, there is no doubt about that. But only the question is how and when.\"\n- Sanctions threat -\nNasheed became the first democratically elected president of the Maldives in 2008 and served for four years before he was toppled in what he called a coup backed by the military and police.\nLast year, a court sentenced him to 13 years in jail on terrorism charges that were widely seen as politically motivated.\nMaldives Foreign Secretary Ali Naseer Mohamed said his government did not have an extradition treaty with Britain and would not be able to force Nasheed to return.\nNasheed's high-profile lawyer, Amal Clooney, has argued for targeted sanctions including asset freezes in the European Union and United States and travel bans against leaders in the Maldives allegedly responsible for human rights abuses.\nNasheed's release had come about as a \"direct result of the threat of sanctions\", said another of his lawyers, Jared Genser.\nBut Maldives Foreign Secretary Mohamed said Friday it was \"unfair\" to impose sanctions on his country of 340,000 people.\n\"Those people who are in jail are there because they violated our laws,\" Mohamed said. \"The Maldives cannot be penalised for upholding the rule of law.\"\nEnvironment Minister Thoriq Ibrahim said international sanctions would affect the government's attempts to mitigate the effects of climate change on the nation of 1,192 tiny low-lying coral islands.","url":"https://www.dailymail.co.uk/wires/afp/article-3422361/Maldives-ready-extend-Nasheeds-prison-leave.html"}
