{"authors":[],"date_download":"2018-10-23 01:00:12","date_modify":"2018-10-23 01:00:12","date_publish":"2015-11-23 00:00:00","description":"NPR's Ari Shapiro talks to retired Gen. Carter Ham, former head of U.S. Africa Command, about U.S. military efforts to counter jihadist groups in Africa.","filename":"data/vaneerConsumption/MaliAttackHighlightsUnderlyingConnectionsBetweenTerrorGroupsInAfrica.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_11_23_457139726_mali-attack-highlights-underlying-connections-between-terror-groups-in-africa_1540256412.html","title":"Mali Attack Highlights Underlying Connections Between Terror Groups In Africa","title_page":"Mali Attack Highlights Underlying Connections Between Terror Groups In Africa : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Mali Attack Highlights Underlying Connections Between Terror Groups In Africa\nNPR's Ari Shapiro talks to retired Gen. Carter Ham, former head of U.S. Africa Command, about U.S. military efforts to counter jihadist groups in Africa.\nARI SHAPIRO, HOST:\nA state of emergency continues in Mali following a terrorist attack that left 20 people dead in the capital city Bamako. Three groups have now claimed responsibility. They are considered among the most dangerous terrorist organizations in the region, and these organizations are growing. Retired general Carter Ham is the former head of the United States Africa Command. Here's here in the studio. Thanks for coming in.\nCARTER HAM: Thanks, Ari.\nSHAPIRO: When three different groups claim responsibility for an attack like this, does that mean that they're coordinating or that multiple groups want to take credit, responsibility for what one group carried out?\nHAM: It's more likely that different groups are claiming credit for a single operation. And while there certainly is a measure of collaboration amongst some of these groups, I think, in this particular case, it's more likely that one group committed the attack and other's taking credit.\nSHAPIRO: The group that initially claimed responsibility is an offshoot of al-Qaida. We've heard a lot about Boko Haram, which is an offshoot of ISIS. How are these groups connected to each other? How are they relating to each other?\nHAM: The underlying connection is the ideology - a jihadist ideology that is anti-just-about-everything-that-is-Western, certainly strongly anti-Christian. But I don't think that there are necessarily long-lasting collegial ties amongst these organizations.\nSHAPIRO: Why are these jihadi groups growing?\nHAM: It's the underlying causes. It is the lack of opportunity for a young, growing youth population that look at the inability of their governments to provide basic services. In short, I think young people who have lost hope are susceptible to the message of jihadist organizations.\nSHAPIRO: Is there sort of one single problem with jihadist groups across Africa, or are there many different problems with many different groups in many different regions of the continent depending on where you look?\nHAM: It's a little bit of both. Each group tends to have a specific way of looking at the ideology. And of course, as is in our own nation, all politics are local. So the tribal influences, the ethnic influences that are operative in West Africa also play into this complexity.\nSHAPIRO: The U.S. has been fighting insurgents in Africa at least since 2011 after NATO-backed rebels helped oust Libya's Colonel Moammar Gadhafi. Have American efforts made progress?\nHAM: Yes, but the progress has been uneven. In a place like Somalia, much work remains to be done. But the fact that it is African-led - the African Union leads a force that the U.S. and other international partners support - is indicative of the way that Africa Command and the U.S. thinks about helping these efforts. And I think that's the best role for the U.S., is in supporting African-led efforts.\nSHAPIRO: What does it mean to say that the U.S. is supporting African-led efforts? Is it training? Is it technology? What exactly are American troops doing?\nHAM: It's all of those things. The U.S. has significant technical intelligence capabilities that few nations possess. So if U.S. technological advances in intelligence can be applied and combined with the African-led human intelligence, that can be very, very helpful.\nSHAPIRO: You ran American military efforts in Africa, and there are critics who have said this problem will not be solved through military efforts; it will be solved through development efforts - through food, through education, through other large-scale initiatives. What do you think of that criticism?\nHAM: I would say that the military is an essential but non-decisive component. The military action by itself, without addressing the underlying issues of services, governance, rule of law and meeting the basic needs of a disadvantaged population - military action will - can only keep the instability to a manageable level.\nSHAPIRO: Is there any chance that military activity will have the opposite effect in radicalizing local populations and turning them more against the United States towards jihadist groups?\nHAM: There is that potential, and I think that's one of the reasons why I believe the U.S. military approach in Africa is what it is - light footprint in support of African-led efforts, very cautious when strikes are conducted to make sure that the action - the intended target is struck without effect on noncombatants. So it is a very delicate balance.\nSHAPIRO: Did you leave this job feeling better or worse about the prospects of peace and stability in Africa?\nHAM: When I left in 2013, my sense was in the near term, there will continue to be a high degree of instability and uncertainty across Africa. But I am a long-term optimist. With some help from the U.S. and other international partners, they'll achieve the outcomes that they so desperately seek.\nSHAPIRO: Retired general Carter Ham is the former head of the United States Africa Command. Thank you for coming in.\nHAM: Thanks, Ari.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2015/11/23/457139726/mali-attack-highlights-underlying-connections-between-terror-groups-in-africa"}
