{"authors":[],"date_download":"2018-10-30 20:35:22","date_modify":"2018-10-30 20:35:22","date_publish":"2015-05-01 18:02:53","description":"A grand jury has indicted a 40-year-old Dunwoody man in connection with what authorities say was his botched attempt to impersonate a DEA agent.","filename":"data/vaneerConsumption/Manaccusedofimpersonatingcopindictedforstoppingrealcop.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/05/01/Images/photos.medleyphoto.7201203.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_man-accused-impersonat_fb2663190936198eea453040a17e4789__1540931722.html","title":"Man accused of impersonating cop indicted for stopping real cop","title_page":"Man accused of impersonating cop indicted for stopping real cop","title_rss":"NULL","source_domain":"ajc.com","text":"A grand jury has indicted a 40-year-old Dunwoody man in connection with what authorities say was his botched attempt to impersonate a DEA agent.\nDaniel Harbison was arrested after he had allegedly conducted a traffic stop while posing as an agent on April 3, acting U.S. attorney John Horn said.\nHarbison had pulled over a Chevrolet Suburban in Doraville that, coincidentally and, unknown to Harbison, was being driven by an off-duty Doraville police corporal, Horn said. Harbison wore a t-shirt bearing the letters DEA, had an ID card that appeared to be issued by the DEA, and had a realistic-looking gold and blue badge embossed with the letters “US,” Horn added, as well as what appeared to be a .45 caliber handgun in a thigh holster.\nWhen the Doraville police officer asked Harbison why the LED lights he flashed when making the stop were green and white instead of the standard police blue and white lights, Harbison allegedly said it was because he was a federal officer. The Doraville officer then said other police were on their way to the scene to see if Harbison was really law enforcement, at which time he got back in his car and drove off, Horn said.\nAt Harbison’s home, police found a .45 caliber handgun, a DEA t-shirt, LED Lights, a purported DEA card and a gold and blue “US” badge, authorities said.\nHarbison was arraigned on federal charges of being a felon in possession of a firearm. Authorities said he had previously been convicted of a felony and could not legally possess a gun.\n“Had he not stopped our officer, who knows what damage he could have done to citizens? It is still unknown how many victims remain, but we can say there won’t be more,” Doraville chief of police John King said.","url":"https://www.ajc.com/news/man-accused-impersonating-cop-indicted-for-stopping-real-cop/g1rIGIbagbT3MO2EqqFm3N/"}
