{"authors":[],"date_download":"2018-10-30 21:56:08","date_modify":"2018-10-30 21:56:08","date_publish":"2016-12-13 10:39:00","description":"The man arrested in a shooting that injured two officers Monday night in Franklin County was ou...","filename":"data/vaneerConsumption/Manarrestedafter2policeofficersshotinLavonia.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/13/Images/gordon.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_chief-will-_47d7ea37322f240c3a0ecbd64a6b45f0__1540936568.html","title":"Man arrested after 2 police officers shot in Lavonia","title_page":"Man arrested after 2 police officers shot in Lavonia","title_rss":"NULL","source_domain":"ajc.com","text":"The man arrested in a shooting that injured two officers Monday night in Franklin County was out on bond in connection with an alleged homicide in another state.\nKhari Anthony Dashaun Gordon, 22, of Greenville, S.C., has a long criminal history, which includes an attempted murder charge in March 2015, according to an incident report from the Greenville County Sheriff’s Office.\nWhile out on bond in that incident, he was stopped Monday night in Lavonia about 8 p.m. around the I-85 exit at a Zaxby’s restaurant.\nThe area is about 93 miles northeast of Atlanta.\nLavonia police Capt. Michael Schulman (left) and Officer Jeffery Martin were injured in a shooting Monday in Franklin County. (Credit: Channel 2 Action News)\nLavonia police Officer Jeffery Martin and Capt. Michael Schulman were making a traffic stop when they determined the man later identified as Gordon was driving a stolen car, Lavonia police Chief Bruce Carlisle said.\n“On attempting to take the driver into custody, the driver produced a handgun — we believe to be a .40 caliber handgun — (and) shot both of my officers,” Carlisle said.\nSchulman, 50, of Lavonia, was struck under the armpit while wearing a bulletproof vest. Martin, 22, of Toccoa, was shot in the right hand, Carlisle said.\nPolice Body cam video of moment officers are shot in Lavonia GA. Why the accused gunman was freed on bond in South Carolina. Live at 6pm. pic.twitter.com/qocQteOLdI — Tom Regan (@tomreganWSB) December 13, 2016\n“The bullet is still in his hand, and he will have to seek a specialist for surgical removal,” Carlisle said.\nSchulman was in intensive care Tuesday at Greenville Memorial Hospital, but his condition was unknown.\nSchulman, who is married with three children, started working with the Lavonia Police Department in 2001, Carlisle said. Martin, a married U.S. Army veteran, started with the department less than a year ago.\n“It’s a sad day, but we will survive,” Carlisle said.\nGBI: Attempted murder suspect Khari Anthony Dashaun Gordon ran, after incident. Search team found him in woods 2 m. from scene, across I-85. pic.twitter.com/nh3eOPY9CT — Rikki Klaus (@RikkiKlausWSB) December 13, 2016\nAfter the shooting, Gordon fled, literally running out of his shoes to escape arrest, according to Channel 2 Action News.\nThat launched a wide-reaching manhunt. Officers arrested Gordon about three hours later after a police dog found him about two miles away, Channel 2 reported.\nThe GBI does not believe the officers fired at the shooter.\nGordon faces two counts of aggravated assault on a police officer, two counts of criminal attempt to commit murder and one count of possession of a weapon during the commission of a felony, according to the GBI.\nSince early November, seven other law enforcement officials have been shot in Georgia.\n» Two Byron police officers were shot and injured Monday serving a warrant during a drug raid at a Fort Valley home. Officer William Patterson was treated and released shortly after being shot. James Wynn was seriously injured and underwent surgery.\n» Two Peach County sheriff’s deputies were ambushed in Byron on Nov. 6. Sgt. Patrick Sondron was pronounced dead at the county hospital, while deputy Daryl Smallwood died two days later. The GBI charged the alleged shooter, Ralph Stanley Elrod, with murder and aggravated assault.\n»Patrick Carothers, a 26-year veteran of the U.S. Marshals Service, was fatally shot Nov. 18 while serving a fugitive with a warrant in Long County. The fugitive, Dontrell Montese Carter, was shot and killed when marshals working with Carothers returned fire.\n»Americus police Officer Nicholas Smarr and Georgia Southwestern State University Officer Jody Smith were shot and killed after responding to a domestic call last week in Americus. Minquell Kennedy Lembrick, who police say was the shooter, was found dead Thursday from a self-inflicted gunshot.","url":"https://www.ajc.com/news/crime--law/chief-will-survive-after-police-officers-shot-lavonia/R3tyeNyXstXRUI3FKPv46L/"}
