{"authors":[],"date_download":"2018-10-22 21:14:10","date_modify":"2018-10-22 21:14:10","date_publish":"2014-05-06 17:15:19","description":"A New Jersey man pleaded guilty Tuesday to kidnapping and beating an Israeli man who had refused to divorce his wife.","filename":"data/vaneerConsumption/ManAdmitsKidnappingBeatingaHusbandforDivorcePapers.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_man-admits-kidnapping-beating-husband-divorce-papers-n98361_1540242850.html","title":"Man Admits Kidnapping, Beating a Husband for Divorce Papers","title_page":"Man Admits Kidnapping, Beating a Husband for Divorce Papers","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA New Jersey man pleaded guilty Tuesday to kidnapping and beating an Israeli man who had refused to divorce his wife.\nDavid Wax, 51, a Talmudic scholar from Lakewood, New Jersey, admitted conspiring to kidnap the Jewish man in October 2010 to force him to give his wife a religious divorce, known as a \"get,\" U.S. Attorney Paul J. Fishman said.\nAccording to Jewish law, the get must be presented by a husband to his wife for a divorce to happen.\nProsecutors said Wax lured the man — who was not identified — from Brooklyn, New York, to his home in Lakewood under the pretense that the man would work on Talmudic books Wax was publishing. When he arrived, the victim was brought upstairs, blindfolded, handcuffed, and bound, and then assaulted by Wax and his conspirators until he provided the get.\nThe family of the man's wife paid Wax about $100,000 to obtain the get. His conspirators received about $50,000, according to court documents.\nThe U.S. attorney’s office did not provide further details on who else faces charges in the case or the status of the victim’s marriage.\nThe conspiracy to commit kidnapping charge carries a maximum potential penalty of life in prison and a $250,000 fine. Sentencing is scheduled for Aug. 19.\n—Elizabeth Chuck","url":"https://www.nbcnews.com/news/crime-courts/man-admits-kidnapping-beating-husband-divorce-papers-n98361"}
