{"authors":[],"date_download":"2018-10-30 21:06:02","date_modify":"2018-10-30 21:06:02","date_publish":"2018-09-14 14:31:50","description":"In a major step forward for the investigation of Russian interference in the 2016 elections, former Trump Campaign Manager Paul Manafort plead guilty to two charges in a federal court Friday, as prosecutors for Special Counsel Robert Mueller's office said Manafort had agreed to cooperate with the in...","filename":"data/vaneerConsumption/ManafortpleadsguiltyagreestocooperatewithMuellerprobe.json","image_url":"https://cmgajcjamiedupree.files.wordpress.com/2018/09/manafort29.jpg?w=124","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/jamiedupree.blog.ajc.com/2018_09_14__1540933562.html","title":"Manafort pleads guilty, agrees to cooperate with Mueller probe","title_page":"Manafort pleads guilty, agrees to cooperate with Mueller probe | Jamie Dupree - AJC","title_rss":"NULL","source_domain":"ajc.com","text":"View Caption Hide Caption\nIn a major step forward for the investigation of Russian interference in the 2016 elections, former Trump Campaign Manager Paul Manafort plead guilty to two charges in a federal court Friday, as prosecutors for Special Counsel Robert Mueller’s office said Manafort had agreed to cooperate with the investigation, and had already started providing information to investigators.\n“I plead guilty,” Manafort said to federal judge Amy Berman Jackson.\nIn a cooperation agreement with the Special Counsel’s office, Manafort is required to testify about any subject that the Special Counsel’s office is reviewing.\n“Your client shall cooperate fully, truthfully, and forthrightly with the Government and other law enforcement authorities identified by the Government in any and all matters as to which the Government deems the cooperation relevant,” the agreement states.\nBREAKING: Ex-Trump campaign chair Paul Manafort pleads guilty to federal charges as part of a cooperation deal with prosecutors. — AP Politics (@AP_Politics) September 14, 2018\nIt was not immediately apparent if Manafort would be providing information related to any contacts between the Trump Campaign and Russian intermediaries, but as a top aide – and a participant in the infamous Trump Tower meeting of June 2016 with a Russian lawyer representing herself as having direct ties to Moscow – that could certainly be part of the cooperation involved.\n“If anyone knows the truth about the Trump campaign’s ties to Russia, it’s Paul Manafort,” said Rep. David Cicilline (D-RI), as Democrats again said the Mueller investigation should be allowed to proceed without any interference by the President.\n“Today’s admission of criminal guilt by Paul Manafort clearly demonstrates that the President’s 2016 campaign manager conducted illegal activity in conspiracy with Russian-backed entities and was beholden to Kremlin-linked officials,” said Sen. Mark Warner (D-VA).\nManafort’s guilty plea came on two charges – 1) Conspiracy against the United States, for money laundering, tax fraud, violating laws on registering as an agent for a foreign government, and making false statements to investigations;\n2) Conspiracy to obstruct justice through witness tampering. None of those charges had anything to do with the 2016 elections investigation.\nThe plea agreement will force Manafort to forfeit over $45 million in real estate, bank accounts, and other items of value to the federal government.\n“A tough day for Mr. Manafort,” said his lawyer Kevin Downing, “but he’s accepted responsibility.”\nAttorney for former Trump campaign chairman Paul Manafort speaks after his client entered a plea deal and agreed to cooperate with the special counsel: \"A tough day for Mr. Manafort, but he's accepted responsibility.\" https://t.co/hAPFn25E4l pic.twitter.com/EOZOainFET — ABC News Politics (@ABCPolitics) September 14, 2018\nManafort's place at Trump Tower must be forfeited. — Brandi Buchman (@BBuchman_CNS) September 14, 2018\nIt was not immediately clear from the Friday court proceedings what assistance and information would be provided by Manafort, and whether it would be directly related to the Russian interference investigation – or not.\nThe immediate reaction from the White House and President Donald Trump’s lawyers was to downplay the Manafort plea.\n“Once again an investigation has concluded with a plea having nothing to do with President Trump or the Trump campaign,” said Rudy Giuliani, who has led Mr. Trump’s legal efforts in recent months.\nAt the White House, Press Secretary Sarah Huckabee Sanders also indicated it was of no import.\n“This had absolutely nothing to do with the President or his victorious 2016 Presidential campaign,” Sanders said in a statement given to reporters. “It is totally unrelated.”\nAs part of plea, Manafort agrees to cooperate. That entails: sitting down with special counsel, not always with his lawyer, and answering all questions. He will have to provide requested documents. And he has agreed to testify in court if needed. He must be truthful. — Del Quentin Wilber (@DelWilber) September 14, 2018\nNone of the legal trouble for Manafort has been tied to the Trump Campaign or the 2016 elections; but prosecutors seem to believe he has information that could assist their probe into contacts between the campaign and Russian intermediaries.","url":"http://jamiedupree.blog.ajc.com/2018/09/14/manafort-pleads-guilty-agrees-to-cooperate-with-mueller-probe/"}
