{"authors":[],"date_download":"2018-10-22 20:46:36","date_modify":"2018-10-22 20:46:36","date_publish":"2014-06-03 01:47:03","description":"At his preliminary hearing, Alberto Serrato, 57, was bound over for trial on a charge of arson during a state of emergency.","filename":"data/vaneerConsumption/ManAccusedofArsonDuringWildfirestoStandTrial.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/482956/140602-alberto-serrato-jms-2043_954c0c0653af220d63c75e940f24fcd6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_man-accused-arson-during-wildfires-stand-trial-n120906_1540241196.html","title":"Man Accused of Arson During Wildfires to Stand Trial","title_page":"Man Accused of Arson During Wildfires to Stand Trial","title_rss":"NULL","source_domain":"nbcnews.com","text":"When they drove up to the 5200 block of N. River Road, McCutcheon says he and his partner saw Serrato gathering sage brush.\n“And he throws the dead brush down onto where it appeared the smoke was coming from,” the officer told the court.\nHe said they saw the suspect add fuel to the fire at least twice.\n“We see a fire start again and engulf the tree with flames probably growing higher than 10 feet,” said McCutcheon. “It was seconds; it was pretty quick.”\nSoon after, the officers took Serrato into custody and booked him into jail.\nSerrato’s defense attorney pointed out McCutcheon had written in his police report that the fire diminished down quickly and did not spread, which the officer conceded was true.\nBut the defense and Serrato’s family argues it was not brush that Serrato was throwing on the flames.\n“He was over there and he was throwing dirt on the fire to try to get it out,\" said Traci Phebus Serrato, the defendant’s sister-in-law.\nShe told NBC 7 that Serrato is being targeted because of his name and prior affiliation with a gang.\n\"He hasn't been in trouble so long. Why would he do something to get back into that type of trouble? There's no way,” she said.\nSerrato’s attorney said he denies each and every allegation against him when the judge ordered he be bound over. His trial is scheduled for July 22.\nIf convicted, Serrato faces up to 13 years in prison because of the arson charge's enhancement and prior convictions.\nThe prosecution says the defendant was on probation at the time of the alleged incident.\nThe San Luis Rey Riverbed Fire was one of eight blazes to pop up across the North County between late morning and sundown on May 14, raising the suspicion that some had been started intentionally.\nOceanside is the first community to bring charges against anyone in connection to the fires. Serrato has not been connected to any of the other blazes.","url":"https://www.nbcnews.com/news/us-news/man-accused-arson-during-wildfires-stand-trial-n120906"}
