{"authors":["Rachael Levy"],"date_download":"2018-10-30 22:34:09","date_modify":"2018-10-30 22:34:09","date_publish":"2016-12-13 00:00:00","description":"MANA Partners' Manoj Narang says hedge fund investors using quant strategies to analyze data are missing fundamental skills.","filename":"data/vaneerConsumption/MANAPartnersManojNarangonquantamentaldatafundamentals.json","image_url":"https://amp.businessinsider.com/images/5849d1b1ba6eb6771b8b80b5-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mana-partners-manoj-narang-on-quantamental-data-fundamentals-2016-12_1540938849.html","title":"MANA Partners' Manoj Narang on quantamental, data, fundamentals","title_page":"    MANA Partners' Manoj Narang on quantamental, data, fundamentals - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Manoj Narang. Courtesy of Manoj Narang. People are getting quantitative hedge funds all wrong, according to a manager who is launching a new $1 billion fund.\nManoj Narang is launching New York-based MANA Partners next month, using a mix of quant and alternative data strategies.\nQuant funds have historically analyzed data using mathematical techniques to search for patterns of trends. The idea here is that quants can pick up on relationships between financial assets that human traders miss out on.\nThat model is outdated, according to Narang. Quants funds don't generate returns by being smarter, and picking out trends before everyone else, but by predicting what everyone else is going to do.\n\"People have this misapprehension that quants make money because they're smarter,\" Narang told Business Insider in a wide-ranging interview. \"But that's not how you make money in the market.\"\nHe added:\n\"You have to make money by doing the same thing as the rest of the market, only doing it first before the rest of people commit their capital. That's the only way to make money when you're automated or discretionary. The same thing goes for machines. To me, the most fertile ground for building quant trading strategies that are profitable is by anticipating, is by orienting those strategies to have a very strong structural component that understands how human beings make decisions.\"\nIn other words, quant funds need to think like humans, but make moves before the humans act.\nHe said:\n\"More and more, you're going to see machines replicating the decision processes that human beings engage in when they trade securities. As things stand now, humans still are responsible for the vast majority of capital allocation, and that's because long-term investors control the largest amount of capital and it's controlled by human beings. I'm not talking about passive stuff, which is mostly automated. But when it comes to active management, long-term capital allocation decisions are made by human beings.\nEven when it comes to indexes and how you allocate to indexes ... it's pretty much done by human beings as well. So the way to really build a compelling quantitative strategy is to understand how humans make those decisions and attempt to replicate those behaviors, and anticipate those asset flows and those allocation decisions and investment decisions. Ultimately, that's what moves markets.\nYou can read the rest of the interview here.","url":"https://www.businessinsider.com/mana-partners-manoj-narang-on-quantamental-data-fundamentals-2016-12"}
