{"authors":["Martin Robinson Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 00:33:39","date_modify":"2018-10-23 00:33:39","date_publish":"2017-04-26 10:19:51","description":"Aidan McAteer, 23, has pleaded guilty at Liverpool Crown Court to causing the death of Violet-Grace Youens by dangerous driving in St Helens on March 24.","filename":"data/vaneerConsumption/ManadmitscausingthedeathofgirlinStHelenscrash.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F5D543400000578-0-image-a-9_1493198351161.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446874_Man-admits-causing-death-four-year-old-crash_1540254819.html","title":"Man admits causing the death of girl in St Helens crash","title_page":"Man admits causing the death of girl in St Helens crash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A young driver has today admitted killing a four-year-old girl in a hit and run crash while driving a stolen car.\nAidan McAteer, 23, was in the dock at Liverpool Crown Court today and pleaded guilty to causing the death of Violet-Grace Youens by dangerous driving on March 24 this year.\nViolet-Grace was struck by a black Ford Fiesta while walking through St Helens, Merseyside with her family.\nViolet-Grace's grandmother, Angela French, 56, was seriously injured in the crash and left in a wheelchair.\nIn the dock: Aidan McAteer has admitted causing the death of Violet-Grace Youens by dangerous driving\nMcAteer had been sought by police following the crash and his mother, Alicia McAteer, 41, appealed for him to come home after recognising him in a CCTV image released by police.\nSix days after he killed Violet-Grace with a car McAteer was detained at Manchester Airport.\nIn a post on Facebook, Violet-Grace's uncle Kieran Byrne uploaded a picture believed to show the moment McAteer was held.\nOfficers were seen standing beside a police van, which was parked beside a plane and the terminal building.\nFollowing the four-year-old's death, her mother Rebecca Youens posted on Facebook: 'My beautiful baby girl passed away in my arms\n'Thank you for all your well wishes. She was just too poorly. However, my brave baby girl saved two lives by donating her kidneys and pancreas. I am truly heartbroken but proud of my little fighter.'","url":"https://www.dailymail.co.uk/news/article-4446874/Man-admits-causing-death-four-year-old-crash.html"}
