{"authors":["Rachael Levy"],"date_download":"2018-10-30 22:22:56","date_modify":"2018-10-30 22:22:56","date_publish":"2016-12-14 00:00:00","description":"Manoj Narang of MANA Partners says he has found a way to beat out competitors — by parsing info about the stock market that others aren't looking at.","filename":"data/vaneerConsumption/MANAPartnersManojNarangonoptionsmarketdataforstocks.json","image_url":"https://amp.businessinsider.com/images/584ffeb8ca7f0cc2178b4994-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mana-partners-manoj-narang-on-options-market-data-for-stocks-2016-12_1540938176.html","title":"MANA Partners' Manoj Narang on options market data for stocks","title_page":"    MANA Partners' Manoj Narang on options market data for stocks - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Manoj Narang. Brendan Smialowski / Getty Images A hot new hedge fund says it has found a way to beat competitors by parsing info about the stock market that few are looking at.\nManoj Narang of MANA Partners told Business Insider that his New York hedge fund would process data from the options market.\n\"There are certain areas, because of the nature of our business, where we have a proprietary edge in data collection,\" Narang told Business Insider in a recent interview. \"So for example, we have a very strong infrastructure for both high-frequency trading and for options trading, and that allows us to collect and manipulate data that arises from those markets very effectively.\"\nThe data is technically available to anybody but is hard to access unless the firm is already set up to trade options, according to Narang. He said:\n\"The options market generates more than 10 times the data as the equities market does, and same with micromarket structure. You're talking about over a dozen exchanges with their own direct feeds, and you have to properly collect the data and synchronize and time-stamp it. And it's just a massive amount of data. That kind of data is, we feel, very differentiated. There aren't that many firms that have the ability to incorporate signals from those markets into their strategies.\nIt is possible to collect this data on the options market from OPRA, or the Options Price Reporting Authority, but few firms do, Narang said. He added:\n\"The options market definitely contains information about the equity market. The options market is all about how investors are pricing in risk. That's why there's this notion of implied volatility. Implied volatility is essentially how investors are pricing their estimates of risk into the market. There's definitely information there about the underlying stocks. We think that that is very fertile ground for alpha.\"\nRead the full interview with Narang here.","url":"https://www.businessinsider.com/mana-partners-manoj-narang-on-options-market-data-for-stocks-2016-12"}
