{"authors":["Press Association"],"date_download":"2018-10-23 01:48:21","date_modify":"2018-10-23 01:48:21","date_publish":"2017-04-26 12:24:19","description":"The youngster was struck while walking in St Helens, Merseyside, in March.","filename":"data/vaneerConsumption/ManadmitscausinghitandrundeathoffouryearoldVioletGraceYouens.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/12/wire-464821-1493205862-546_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447348_Man-admits-causing-hit-run-death-four-year-old-Violet-Grace-Youens_1540259301.html","title":"Man admits causing hit-and-run death of four-year-old Violet-Grace Youens","title_page":"Man admits causing hit-and-run death of four-year-old Violet-Grace Youens | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man has admitted causing the death of a four-year-old girl in a hit-and-run.\nViolet-Grace Youens was struck while walking in St Helens, Merseyside, on March 24.\nAidan McAteer, 23, pleaded guilty at Liverpool Crown Court via prison video link to causing her death by dangerous driving.\nViolet-Grace Youens\nViolet-Grace’s mother, Rebecca, wept in the public gallery as she sat hand-in-hand with husband Glenn.\nMcAteer also admitted causing serious injury to Violet-Grace’s grandmother, Angela French, 55, who is recovering in hospital.\nHis co-defendant, Dean Brennan, 27, also appearing from HMP Liverpool, pleaded guilty to aggravated vehicle taking and assisting an offender. Both will be sentenced on May 19.\nJudge Dennis Watson QC told the pair they were facing lengthy jail sentences as he further remanded them in custody.\n(Dave Thompson/PA)\nMcAteer sat with his head bowed for the majority of the 13-minute hearing.\nMr and Mrs Youens did not take their eyes off the screen showing the defendants as they were joined in a packed public gallery by family and friends all wearing violet-coloured ribbons.\nIn the days after the crash, McAteer’s mother Alicia made a public appeal for her son to return home after he fled the country.\nThe next day he was arrested – thought to be at Manchester Airport – and questioned by detectives. Brennan admitted obtaining McAteer’s passport and supplying it to him.\nMcAteer’s barrister, Lloyd Morgan, said his client had been “anxious” to be sentenced on Wednesday. He then asked if McAteer could be dealt with next month by the prison video link. Judge Watson replied that the importance of the case required the defendants to be produced.","url":"https://www.dailymail.co.uk/wires/pa/article-4447348/Man-admits-causing-hit-run-death-four-year-old-Violet-Grace-Youens.html"}
