{"authors":["Liz Dunphy For Mailonline"],"date_download":"2018-10-23 01:05:19","date_modify":"2018-10-23 01:05:19","date_publish":"2017-03-16 10:51:17","description":"Those Golden Arches - ever on hand to cater to fussy eaters - took the man's request very seriously indeed and delivered one lonely piece of cheese for 99p - the price of a cheese burger.","filename":"data/vaneerConsumption/ManasksforaMcDonaldscheeseburgerwithjustcheese.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E533D9B00000578-0-image-a-16_1489659061546.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319404_Man-asks-McDonald-s-cheeseburger-just-cheese_1540256719.html","title":"Man asks for a McDonald's cheeseburger with just cheese","title_page":"Man asks for a McDonald's cheeseburger with just cheese | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man got a little less than he bargained for when he ordered a VERY simple cheese burger in McDonald's.\nAnd those Golden Arches - ever on hand to cater to fussy eaters - took the man's request very seriously indeed and delivered one lonely piece of cheese which looked a little lost in the trademark red and yellow cardboard burger box.\nThe order stated that he did not want anything but cheese - no burger, no bun, no pickles, no onions, no ketchup or mustard.\nThe man behind the order took to Twitter with pictures of the lone piece of cheese which still cost him 99p - the price of a cheese burger.\nJust cheese please? A man's very plain cheeseburger order at McDonald's\nThe lone piece of cheese looked a little sad sitting on its own in the burger box\nTwitter user @coL_Merchant who works at Complexity Live gaming company where he helps to create video games seemed a little surprised by his 'cheeseburger'.\n'I ordered cheese - not sure what I expected,' the bemused customer wrote on Twitter.\nThe customer accepted the cheeseburger order which stated that he did not want onion, ketchup, mustard, pickles or most surprisingly - a bun or beef pattie\nThe reaction on Twitter was predictably bemused and amusing.\nOne person shared a story of a friend who previously ordered a milkshake without a cup and was served the drink in a plastic bag.\nAnother person tweeted about serving a customer only salad when they requested a burger without the 'burger or bun.'\nMilkshake no cup please: @lev_lafayette shared a story on a Twitter of a friend who was served a milkshake in a plastic bag after they ordered it without a cup\nPeople referenced cartoons and TV shows when they joined the online conversation about the VERY plain cheeseburger which was pictured on Twitter\nComments on Twitter joked about the cheeseburger which had nothing but cheese","url":"https://www.dailymail.co.uk/news/article-4319404/Man-asks-McDonald-s-cheeseburger-just-cheese.html"}
