{"authors":["Jack Bezants For Mailonline"],"date_download":"2018-10-23 01:22:08","date_modify":"2018-10-23 01:22:08","date_publish":"2017-03-16 11:14:22","description":"Zlatan Ibrahimovic's ability to stay fit and firing throughout the Premier League season at 35 has been a hallmark of his hugely impressive first campaign in England with Manchester United.","filename":"data/vaneerConsumption/ManchesterUnitedstarZlatanIbrahimoviclistenstoJayZ.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/11/3E53DDCA00000578-0-image-a-22_1489665008334.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319638_Manchester-United-star-Zlatan-Ibrahimovic-listens-Jay-Z_1540257728.html","title":"Manchester United star Zlatan Ibrahimovic listens to Jay Z","title_page":"Manchester United star Zlatan Ibrahimovic listens to Jay Z | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Zlatan Ibrahimovic's ability to stay fit and firing throughout the Premier League season has been a hallmark of his hugely impressive first campaign in England with Manchester United.\nHe turned 35 in October but has been central to Jose Mourinho's squad, scoring 26 times in 40 appearances in all competitions so far.\nHe is known to have a strict training regime to stay in peak condition and he has shared the workout playlist he listens to in order to remain focused in the gym.\nZlatan Ibrahimovic has shared the list of songs he listens to while working out at the gym\nThe United striker has a strict gym routine to stay in peak fitness throughout the season\nJay-Z and LL Cool J are some of the names that features on a list mainly consisting of hip-hop\nAnd he's clearly a big fan of hip-hop, with Jay-Z, LL Cool J and the Notorious B.I.G three of the most notable names on the 19-song list, published by a-z.\nThe theme tune for Bad Boys also features, as well as Ice Ice Baby by Vanilla Ice alongside Eminem and Rick Ross.\nSwedish rapper Ken Ring is on the list, as is Swedish rap group Grillat and Grandy.\nThe Swede has previously explained that those who doubted whether he could handle the physicality of English football only fuelled his motivation.\nIbrahimovic said after the EFL Cup final that his doubters only fuel his level of motivation\n'The older I get, the more mature I get, the more I am surrounded by a winning mentality,' he said after scoring the winning goal in the EFL Cup final against Southampton. 'It is all about winning those trophies. This is what I am doing. Wherever I have gone I have won.\n'This is what I predicted. Everything I thought would happen has. I think the other ones didn't see it. When I came here to show them what I saw apparently to many I could not do it.\nIbrahimovic is serving a three-match ban for elbowing Bournemouth defender Tyrone Mings when United drew 1-1 with Eddie Howe's side.\nIbrahimovic has scored 26 goals in 40 appearances for United so far this season\nIbrahimovic is currently serving a three-match ban for elbowing Tyrone Mings\nIbrahimovic is free to feature for United against Rostov in the Europa League\nHe missed the 1-0 defeat by Chelsea in the FA Cup on Monday, and will be absent for United's next two Premier League games against Middlesbrough and West Brom.\nIbrahimovic is, however, available to play against Rostov in the Europa League on Thursday.","url":"https://www.dailymail.co.uk/sport/football/article-4319638/Manchester-United-star-Zlatan-Ibrahimovic-listens-Jay-Z.html"}
