{"authors":[],"date_download":"2018-10-22 20:43:41","date_modify":"2018-10-22 20:43:41","date_publish":"2014-06-02 22:49:03","description":"A man is facing several felony charges for allegedly detonating a series of \"bottle bombs\" inside five movie theaters in Maryland and Virginia.","filename":"data/vaneerConsumption/ManChargedwithBottleBombsinMovieTheaters.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/482626/140602-bottle-bombs-1707_18b242565df21c64f3a3c68ca5d09766.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_man-charged-bottle-bombs-movie-theaters-n120726_1540241021.html","title":"Man Charged with 'Bottle Bombs' in Movie Theaters","title_page":"Man Charged with 'Bottle Bombs' in Movie Theaters","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFrom NBC Washington\nA man is facing several felony charges for allegedly detonating a series of \"bottle bombs\" inside five movie theaters in Maryland and Virginia.\nManuel Joyner, 20, was arrested Sunday by officers from the Prince George’s County Office of the Fire Marshal with help from county police. Investigators said Joyner made and exploded a chemical \"bottle bomb\" inside the Magic Johnson Movie Theatre in Largo, Md., on May 24.\nJoyner is also charged with two separate bottle-bomb explosions at the AMC Theater in Tyson's Corner, Va., News4's Darcy Spencer reported Sunday night. People in that packed theater heard the explosions and thought someone was shooting a gun; police active shooter teams responded to the theater that night.\nAdditionally, Joyner is facing charges for doing the same thing at a theater in Alexandria, Va. and another in downtown Silver Spring, Md. And he is a suspect in the explosion at a theater in Arundel Mills, in Hanover, Md.\nNews4 Reporter Jackie Bensen tweeted Monday that the suspect used \"Lipton Brisk\" plastic bottles -- and he listed Brisk as a \"like\" on his Facebook page.\nThe bottle bombs were filled with acid and metal. The material inside reacted, exploded the bottles and spewed acid; they are capable of sending the acid 20 to 30 feet, fire officials have said. Joyner is officially charged with six counts of manufacture/possession/detonation of a destructive device – a felony charge. If convicted, he could face up to 25 years in jail.\nInitially, Joyner was held on a $50 million bond, but officers announced Monday he would be held without bond.\nAfter the arrest, ATF, FBI, Anne Arundel County Fire Marshal, Fairfax County Fire Marshal, City of Alexandria Fire Marshal and the Montgomery County Fire Marshal executed a search warrant at a home in the 600 block of Stillwater Place in Bowie.\nThere have been no injuries in any of the cases, but authorities have said they can be considered an act of terrorism.\nThe Associated Press reports online court records show Joyner pleaded guilty in late 2012 to malicious destruction of property and was given probation before judgment. A person who answered the phone at Joyner's home on Sunday said she was unaware of the arrest and did not say whether he had an attorney.","url":"https://www.nbcnews.com/news/us-news/man-charged-bottle-bombs-movie-theaters-n120726"}
