{"authors":["Nicholas Godden For Mailonline"],"date_download":"2018-10-23 02:37:34","date_modify":"2018-10-23 02:37:34","date_publish":"2016-01-28 17:35:52","description":"Fresh from sealing their place in the Capital One Cup final the Manchester City players were back in the gym on Thursday as they began preparations for this weekend's trip to Aston Villa.","filename":"data/vaneerConsumption/ManchesterCitystarshitthegymadayafterreachingWembleyfinalasfocusturnstoFACupclashwithAstonVilla.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30ACBA7600000578-0-image-a-80_1454003425007.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421388_Manchester-City-stars-hit-gym-day-reaching-Wembley-final-focus-turns-FA-Cup-clash-Aston-Villa_1540262254.html","title":"Manchester City stars hit the gym a day after reaching Wembley final as focus turns to FA Cup clash with Aston Villa","title_page":"Manchester City stars hit the gym a day after reaching Wembley final as focus turns to FA Cup clash with Aston Villa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fresh from sealing their place in the Capital One Cup final the Manchester City players were back in the gym on Thursday as they began preparations for this weekend's trip to Aston Villa.\nManuel Pellegrini's side beat Everton 3-1 at the Etihad Stadium in the second leg of their last-four tie to progress 4-3 on aggregate and travel to Villa Park for an FA Cup fourth round clash on Saturday.\nThere was no time for the players to celebrate reaching their first Wembley final since losing 1-0 to Wigan in the 2012 FA Cup as they were put through their paces with a weights an stretching session before making their way out on to the training pitch.\nRaheem Sterling (left) and Fernandinho (centre) go through a stretching routine in the gym on Thursday\nFabian Delph does press ups as he works on his strength a day after City reached the Capital One Cup final\nWilly Caballero, who is set to deputise for Joe Hart on Saturday, works in the Manchester City gym\nRaheem Sterling, who controversially set up Kevin De Bruyne to score City's second against Everton after the ball appeared to go out for a goal kick, was pictured stretching in the gym with team-mate Fernandinho.\nMidfielder Fabian Delph and goalkeeper Willy Caballero worked on their strength before the squad headed out for a light session as the focus switches to their FA Cup fixture.\nManchester City, trailing 2-1 after the first leg of Capital One Cup semi-final, gave themselves a mountain to climb after falling behind to Ross Barkley's 18th-minute goal on Wednesday.\nSergio AGuero (centre) and Sterling prepare for the light training session on Thursday\nHart (centre) and Delph (left) get ready in the kit room before making their way on to the training pitch\nCity and England team-mates Hart (right) and Sterling share a joke together during training\nBut Fernandinho levelled on the night shortly after before Kevin De Bruyne, who left the field on a stretcher with his knee in a brace after falling awkwardly , and Sergio Aguero swung the tie in City's favour in the second half.\nBrazilian midfielder Fernandinho revealed that it was a half-time speech and some small tactical changes by manager Pellegrini that helped City turn the game around.\n'The first half was tough for us after they scored but luckily we scored before the end of the first half,' he said.\nBacary Sagna (left), Eliaquim Mangala (centre) and Aguero (right) make their way out for training\nHart, who was rested for Capital One Cup win over Everton, and No 3 goalkeeper Richard Wright\n'And after our meeting in the dressing room, when we re-arranged some things, especially in defending, and in the second half we played very good football and made so many chances.\n'It was the manager who made a speech – he watches the game from off the pitch and it's easier for him to see what was wrong and what was good,' said the midfielder.","url":"https://www.dailymail.co.uk/sport/football/article-3421388/Manchester-City-stars-hit-gym-day-reaching-Wembley-final-focus-turns-FA-Cup-clash-Aston-Villa.html"}
