{"authors":["Laurie Whitwell For Mailonline"],"date_download":"2018-10-23 02:38:26","date_modify":"2018-10-23 02:38:26","date_publish":"2016-01-29 17:16:10","description":"LAURIE WHITWELL EXCLUSIVE: Emails sent out to interested parties show prices have been frozen, but fans will get a 15 per cent discount if United miss out on Europe altogether next season.","filename":"data/vaneerConsumption/ManchesterUnitedplantoreducecostofboxesandsuitesiftheyfailtomakeEurope.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B4567A00000578-0-image-a-22_1454087746993.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423105_Manchester-United-prepared-lose-1m-club-plan-reduce-cost-boxes-suites-fail-make-Europe_1540262306.html","title":"Manchester United plan to reduce cost of boxes and suites if they fail to make Europe","title_page":"Manchester United plan to reduce cost of boxes and suites if they fail to make Europe | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester United are preparing for potential failure to qualify for Europe by mapping out reduced prices to executive supporters in the event of Louis van Gaal's disastrous season continuing.\nEmails sent out to interested parties on Thursday show prices for boxes and suites have been frozen, but fans will get a 15 per cent discount if United miss out on either of the continent's club competitions next year.\nThat would cost United more than £1million in expected cash, a drop in the ocean for a club with such commercial revenue, but costly and embarrassing nonetheless.\nWayne Rooney (L) and his Manchester United team-mates look dejected during their defeat by Southampton\nThe club will reduce the cost of boxes and suites by 15 per cent next season if they don't qualify for Europe\nUnited make huge money on their premium packages at Old Trafford, with the most expensive option being a Centennial Club Suite. There are only eight in the stadium and each costs £125,000 per year, representing an overall loss on these seats alone of £150,000 should United miss out on Europe altogether.\nUsually, such high-end space is used by companies to wine and dine guests, with a testimonial by Audi used on the club website.\nUnited have more than 150 boxes and 20 suites available, ranging from the £1,995 per-person seats of The Academy, 500 Club, Kit Room, and 100 Club, to the £6,800 per-person seats in The Gallery.\nEach price is based on a 28-match season, but will be slashed by 15 per cent if United fail to qualify for Europe. The overall total in that scenario reaches the seven-figure mark.\nShould United qualify for the Europa League, executive fans get a five per cent cut on prices.\nThe email to supporters read: 'In the Executive Club you're in a special place, the club within, that gets you and your guests closer to Manchester United, and with the second half of the season well underway, I wanted to share with you the Executive Club pricing for your facility next season.\nLouis van Gaal (centre) has led Manchester United to fifth place in the Premier League after 23 games\nIf Manchester United qualify for the Europa League, executive fans will receive a five per cent discount\n'I am pleased to inform you that Executive Club prices will be frozen for the 2016/17 season. In addition to this, the following would apply based on UEFA cup qualification:\n'If the Club qualifies for the group stage of the UEFA Champions League next season, the full rate card will apply (prices frozen as per 2015/16); all first team cup fixtures, domestic and European, continue to be included.\n'If the Club qualifies for the group stage of the UEFA Europa League, there will be a 5% discount on the full rate card value; all first team cup fixtures, domestic and European, continue to be included.\n'If the Club does not qualify for the group stage of any UEFA competition, there will be a 15% discount on the full rate card value; all first team domestic cup fixtures will continue to be included.'\nJesse Lingard (centre) and his United team-mates look glum after exiting the Champions League this season\nThe move, with 15 games remaining in the Premier League, illustrates United's gross underperformance this season. In the days of Sir Alex Ferguson Champions League qualification would be nearly assured by this stage.\nVan Gaal is facing huge pressure having led United to only 37 points from 23 games, five points off Tottenham Hotspur in fourth. West Ham, Liverpool, Southampton, Stoke, Watford and Crystal Palace all have realistic aims of finishing above United in Europa League positions.","url":"https://www.dailymail.co.uk/sport/football/article-3423105/Manchester-United-prepared-lose-1m-club-plan-reduce-cost-boxes-suites-fail-make-Europe.html"}
