{"authors":["Nicholas Godden For Mailonline"],"date_download":"2018-10-22 23:52:24","date_modify":"2018-10-22 23:52:24","date_publish":"2016-01-29 12:24:48","description":"The 34-year-old, who spent eight and a half seasons at Old Trafford, has decided to call time on his playing career after leaving Inter Milan by mutual consent earlier this month.","filename":"data/vaneerConsumption/ManchesterUnitedheroNemanjaVidicretiresfromfootballTheinjurieshavetakentheirtoll.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/306ED3CC00000578-0-image-a-44_1454070267725.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422692_Manchester-United-hero-Nemanja-Vidic-retires-football-injuries-years-taken-toll_1540252344.html","title":"Manchester United hero Nemanja Vidic retires from football: 'The injuries have taken their toll'","title_page":"Manchester United hero Nemanja Vidic retires from football: 'The injuries have taken their toll' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former Manchester United defender Nemanja Vidic has retired from football.\nThe 34-year-old, who spent eight and a half seasons at Old Trafford, has decided to call time on his playing career after leaving Inter Milan by mutual consent earlier this month.\nManchester United, who Vidic captained before moving to Italy in 2014, announced the news of the former Serbia international's retirement with a statement on their official website.\nAston Villa have been offered the chance to sign Nemanja Vidic on a free transfer this January\nVidic played for Manchester United for eight years before leaving for Inter Milan in 2014\nNEMANJA VIDIC CAREER Red Star (2001-04) – 95 apps 6 goals Spartak Moscow (2004-05) – 41 apps 4 goals Man United (2006-14) – 300 apps 21 goals Inter Milan (2014-16) – 28 apps 1 goal Serbia (2002-11) – 56 apps 2 goals\nVidic said: 'The time has come for me to hang up my boots,' he said. 'The injuries I have had in the last few years have taken their toll.\n'I would like to thank all the players I have played with, all the managers and staff I have worked with, and say a big 'thank you' to the fans for their support over the years.'\nVidic came to an agreement with Inter Milan on January 18 to terminate his contract after 18 months at the San Siro.\nThe former United skipper had been plagued by injuries – notably hernia and back complaints – throughout his time in Italy.\nVidic helped Manchester United win five Premier League crowns during his time at Old Trafford\nVidic also earned three League Cup winners' medals throughout a trophy-laden spell in England\nOLD TRAFFORD HONOURS Premier League – 2006-07, 2007-08, 2008-09, 2010-11, 2012-13 League Cup – 2005-06, 2008-09, 2009-10 Champions League – 2007-08 Club World Cup – 2008\nVidic had not featured at all this season for Inter, who are enjoying a revival under former Manchester City manager Roberto Mancini, after making 28 appearances in the last campaign.\nVidic left United in the summer of 2014 electing to allow his contract to run down after announcing his intention to leave the club midway through the season.\nThe Serbian - who made 56 appearances for his country - joined United in the 2005-06 season from Spartak Moscow and went on to form a fine centre-back partnership with Rio Ferdinand.\nVidic's time with the Red Devils saw him win the 2007-08 Champions League, plus five Barclays Premier League titles.\nCongrats Vida on an amazing career.\nI was one of the lucky ones to have played with you. Great memories.\nNow Golf 😉 pic.twitter.com/iPIFbdAffk — Michael Carrick (@carras16) January 29, 2016\nIt was a pleasure to play alongside this man, a player who I always looked up too! A legend @ManUtd Congrats Vida pic.twitter.com/N9K9bHfRtt — Phil Jones (@PhilJones4) January 29, 2016\nFormer defensive partner Ferdinand paid tribute to Vidic with a lengthy Facebook post on Friday.\n'Where is he from? He is well out of his depth... these were the type of comments flying around the training ground after the 1st few training sessions we saw Vida\n'So to see what an unbelievable force he became while at Man Utd means the work he committed himself to physically and mentally is truly huge.\n'He became a defender that was feared, he could fight with the most physical, he crunched into tackles, he attacked the ball better than anyone I've ever seen but as he will tell you with a smile, he could also play with the ball too, which made him complete & a great defender.'\nManchester United midfielder Michael Carrick tweeted: 'Congrats Vida on an amazing career. I was one of the lucky ones to have played with you. Great memories. Now Golf.'\nDefender Phil Jones wrote: 'It was a pleasure to play alongside this man, a player who I always looked up too! A legend. Congrats Vida.'","url":"https://www.dailymail.co.uk/sport/football/article-3422692/Manchester-United-hero-Nemanja-Vidic-retires-football-injuries-years-taken-toll.html"}
