{"authors":["Ian Ladyman For Mailonline"],"date_download":"2018-10-23 01:18:11","date_modify":"2018-10-23 01:18:11","date_publish":"2016-01-11 12:02:17","description":"Harry Kane has revealed he sees his future at Tottenham. The England centre forward is a target for Manchester United this summer and has also been linked with a move to Real Madrid.","filename":"data/vaneerConsumption/ManchesterUnitedtargetHarryKaneMylongtermfutureisdefinitelyatTottenham.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/11/3001471800000578-0-image-a-28_1452510630746.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393611_Manchester-United-target-Harry-Kane-long-term-future-Tottenham_1540257491.html","title":"Manchester United target Harry Kane: My long-term future is definitely at Tottenham","title_page":"Manchester United target Harry Kane: My long-term future is definitely at Tottenham | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Kane was asked if his long-term future was at Spurs and said: 'Definitely'\nHarry Kane has revealed he sees his future at Tottenham.\nThe England centre forward is a target for Manchester United this summer and has also been linked with a move to Real Madrid.\nAnd BBC pundit Alan Shearer believes he is now worth in the region of £80million.\nTottenham Hotspur striker Harry Kane scored the equaliser against Leicester to stay in the FA Cup\nKane has revealed he sees his future at Tottenham with Manchester United among the interested clubs\nBut after scoring his 50th Spurs goal from the penalty spot to earn his team a 2-2 draw with Leicester at White Hart Lane in the FA Cup on Sunday, the 22-year-old revealed he has no plans to go anywhere.\nAsked if he sees his long-term future at Tottenham, Kane said: 'Yeah, definitely.\n'There are always going to be rumours flying around but I'm happy here. The club is in a good shape, we have a great future and I'm raring to go so we will see what happens.\n'We have got a lot of young players raring to go who are getting better and better with each game and that is all we have got to do.\n'Keep working hard on the training field, we are getting better and more experienced the more we play and I think we can only get better.'\nKane began Sunday's game on the bench as manager Mauricio Pochettino looked to rest some of his star players ahead of the resumption of Barclays Premier League action – also against Leicester – back at White Hart Lane on Wednesday.\nBut Kane was thrown on to try and save the game and was given his chance from the penalty spot with three minutes to go.\n'It is down to the manager who he picks,' he said. 'If I had been called upon today I would have been ready to go. But it is down to the manager who he wants to play.\nBBC pundit and former striker Alan Shearer believes Kane is now worth in the region of £80million\nKane scored his 50th goal for Tottenham from the penalty spot to earn his team a 2-2 draw with Leicester\n'When I was on the bench I was just hoping I could make an impact when I came on as the other subs did and thankfully I was able to get the goal. I was always going to take the penalty.\n'Scoring a penalty in the last minute of the game to keep your team in the cup, it is what football is all about so I was happy to step up and thankful it went in.'\nKane has played pretty much non-stop for two years now since coming through the ranks at Tottenham and is showing no signs of physical frailty as he heads in to a six-month period that will see Tottenham push for a top-four place and even the title and culminate in the European Championship finals with England in France.\n'I think my fitness is down to the staff at Tottenham, the manager and the fitness staff,' Kane said.\n'They condition every training session, they plan it out week by week on what players need, if players need a rest they will do that, if players need to work hard they will do that as well.\n'They are also not afraid to take risks and it has been working for us, hopefully we can keep doing that, work hard in training and keep going for the rest of the season.'\nKane is a target for Manchester United this summer and has also been linked with a move to Real Madrid","url":"https://www.dailymail.co.uk/sport/football/article-3393611/Manchester-United-target-Harry-Kane-long-term-future-Tottenham.html"}
