{"authors":["Aimee Brannen For Mailonline"],"date_download":"2018-10-23 03:24:19","date_modify":"2018-10-23 03:24:19","date_publish":"2016-01-11 16:03:15","description":"Kristen Hanby, 22, from St Helier, Jersey, gave a whole new meaning to the term 'annoying younger brother' when he filmed a series jokes pulled on his elder sister Natalie on a trip to town.","filename":"data/vaneerConsumption/Mancoverssisterintalcumpowderandpushesherinalakeinvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300B35AE00000578-0-image-a-23_1452523831560.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3393849_Is-annoying-brother-Prankster-films-sister-s-reaction-covers-talcum-powder-pushes-lake-shoves-bush-series-stunts-internet-t-enough_1540265059.html","title":"Man covers sister in talcum powder and pushes her in a lake in video","title_page":"Man covers sister in talcum powder and pushes her in a lake in video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A prankster took the role of an annoying younger brother to the extreme when he filmed a series of mean stunts unleashed on his sister.\nKristen Hanby, 22, from St Helier, Jersey, has become an overnight online hit with the comedic video filmed after he promised to take elder sister Natalie into town to buy her a birthday gift on Saturday.\nInstead, she came away empty handed, soaking wet and covered in talcum powder.\nScroll down for video\nKristen Hanby, 22, from St Helier, Jersey, played the series of pranks on his sister Natalie, 25, on Saturday - and, unsurprisingly, it's taken her a few days to reply to his last text\nThe first prank saw Kristen brake suddenly while his sister was trying to do her make-up as they made their way into town under the false pretense of buying her a birthday gift\nAnd the clip, in which she is subjected to five separate pranks, has gone viral with some 6 million views since being uploaded to Facebook at the weekend.\nFirst of all, it shows Natalie, 25, trying to do her make-up while Kristen is driving - but he suddenly brakes, leaving her flying into the dashboard and her lipstick application ruined.\nThe carpenter-by-trade gets an angry response, but he isn't deterred and invites her to take a selfie with him, but launches her into a bush instead.\nThen the comedic clip shows them walking down the street together with Natalie eating - but Kristen knocks his sister's food out of her hands, leaving her less than impressed.\nAnd in the final two pre-meditated pranks, Kristen takes things even further.\nWhile beside a clock tower surrounded by a pond, he asks Natalie to come and look at something on his phone - before pushing her into the water.\nBy the time she gets back into his car, she doesn't think things can get any worse. Kristen giggles and tries to apologise, to which she replies: 'F**k off. Turn the heating on, I'm freezing.'\nThen poor Natalie found herself ending up in a bush after her mean brother invited her to take a selfie\nHer food was left all over the floor in the third prank and while, Kristen laughs away, his sister is clearly unimpressed\nThinking her ordeal is over, Kristen then tells her to look at something on his phone - but she's in for a shock\nHe does just that - but he had earlier filled his air con with talcum powder, ensuring he coated her soaked clothes, face and hair in a layer of white dust.\nSpeaking to MailOnline, Kristen said: 'At first, she wasn't happy - she thought she was going out to get her birthday present but I ruined her life instead.\n'Before I even picked her up I had filled my air con up with talcum powder, so as soon as I turned it on she got covered.'\nNatalie is launched into the pond next to a clock tower in the harbour town of St Helier, Jersey\nWhen she gets in the car and asks for the heating to be turned up, little does she know that her brother had filled his air con up with talcum powder\nKristen is known among his friends for being a prankster and even has his own Facebook page, Instagram and YouTube channel dedicated to his stunts\n'It's the first time she's been pranked - I've pranked other people a few times. I started making the videos about five months ago.'\nHaving always been known as the joker among friends and family, Kristen has his own Facebook page dedicated to his pranks - and it's liked climbed by 12,000 people overnight after he uploaded his latest video.\n'I've started doing two videos a week. I've always been the prankster, even among my friends. At school, I was always the joker - loved taking the mick and making people laugh.'\nWhile many found the clip amusing, others weren't impressed with the prank\nBut the video has divided opinion. While many were left amused, Kristen has also been criticised for playing the 'brutal' prank on his sister - and he says he has even received death threats.\nJames Beaumont called it 'golden' and Steven Pinglaux found it funny but 'so brutal'.\nHowever, Jesper Wahl called it 'garbage' and said he would be blocking the prankster from his news feed - and he wasn't the only one to be unimpressed.","url":"https://www.dailymail.co.uk/femail/article-3393849/Is-annoying-brother-Prankster-films-sister-s-reaction-covers-talcum-powder-pushes-lake-shoves-bush-series-stunts-internet-t-enough.html"}
