{"authors":["Joseph Curtis For Mailonline"],"date_download":"2018-10-23 04:46:27","date_modify":"2018-10-23 04:46:27","date_publish":"2016-01-11 17:48:50","description":"A man in North America found out raccoons are more dangerous than they look after he tried to film them playing in woodland only for one of them to bite him on the hand.","filename":"data/vaneerConsumption/Mancoaxesraccoonsintoplayingforhiscamerabeforetheybitehiminvideo.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/300D501700000578-0-image-a-14_1452534490232.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394163_Man-coaxes-family-raccoons-playing-camera-nasty-bite-reminds-not-cute-look_1540269987.html","title":"Man coaxes raccoons into playing for his camera before they bite him in video","title_page":"Man coaxes raccoons into playing for his camera before they bite him in video | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"To some they are one of the cutest species in all of nature and to others they are disease-ridden pests to be avoided at all costs.\nBut whatever you think about raccoons, one man has proved you should not try to play with them in the wild after he ended up getting bitten.\nIn a video that appears to have been filmed in North America, the man approaches two of the creatures in a wooded area and describes them as 'so freakin' friendly', moments before one bites his hand.\nThe moment a man realises a raccoon is not as friendly as it looks when it bites him on the hand\nNarrating the video, he said: 'There are some raccoons right there. I'm trying to get a better look at them. Oh my gosh, they are so freakin' (sic) friendly.\n'Oh my god this is so freakin' scary. Oh my god this is freakin'...Ow! He attacked me. Oh that hurt. Ok. I think I'm going to get rabies. This was a bad idea.'\nHe then tries to stop the raccoons chewing on his water bottle before describing the incident as 'the craziest thing that has ever happened to me'.\nThe video was uploaded to YouTube where viewers were critical of his decision to approach the small beasts in the comments section.\nSoko Shoko said: 'They're not mean..this is how they react when they sense danger. You were making fun of them and didn't give them food. They were hungry...we all act badly when we're' hungry.\n'Why would you even put your hand like that? Of course he' s gonna bite it.'\n'Enderman9985' added: 'Good luck with the rabies'.\nThe man approached the two raccoons and described them as 'so freakin' friendly' before one lashed out\nThe video of the raccoons was uploaded to YouTube and is thought to have been filmed in North America\nRaccoons are found predominantly in North America and are omnivorous, meaning they eat both meat and plants.\nThey are known to be highly intelligent with scientific tests proving they can remember how to carry out tasks for up to three years after learning them.","url":"https://www.dailymail.co.uk/news/article-3394163/Man-coaxes-family-raccoons-playing-camera-nasty-bite-reminds-not-cute-look.html"}
