{"authors":["Paul Hirst","Press Association"],"date_download":"2018-10-22 23:15:46","date_modify":"2018-10-22 23:15:46","date_publish":"2016-01-11 05:09:18","description":"Manchester United fans may be feeling low, but Matteo Darmian insists confidence within the squad is improving despite recent poor performances by Louis van Gaal's side.","filename":"data/vaneerConsumption/ManchesterUniteddefenderMatteoDarmianpicksthepositivesfromrecentresults.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/05/2FF5483000000578-0-image-a-41_1452488938502.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393374_Matteo-Darmian-takes-positives-recent-Manchester-United-results_1540250146.html","title":"Manchester United defender Matteo Darmian picks the positives from recent results","title_page":"Manchester United defender Matteo Darmian picks the positives from recent results | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester United fans may be feeling low, but Matteo Darmian insists confidence within the squad is improving despite recent poor performances.\nUnited fans vented their anger at Louis van Gaal on Saturday as they scraped into the fourth round of the FA Cup by the finest of margins at Old Trafford.\nLeague One side Sheffield United held Van Gaal's team until injury time, when Wayne Rooney scored a penalty to send the 20-time English champions into the last 32 of the competition.\nManchester United right-back Matteo Darmian played the full 90 minutes against Sheffield United\nDarmian (right) celebrates with team-mate Daley Blind (left) after Wayne Rooney's late winner\nUnited's inability to score in the first period for the 10th consecutive home game prompted boos from the home crowd at half-time, while Marouane Fellaini was jeered when he was substituted.\nIronic cheers were heard when George Long was tested for the first time in the 69th minute. Darmian delivered the shot, a weak effort which the Blades goalkeeper gathered comfortably.\nThe Italian right back preferred to offer only positive thoughts after the match and claimed United were always going to find it hard to break down Nigel Adkins' men because of the defensive tactics they adopted.\n'It is difficult for us because Sheffield United, like a lot of teams when they come here, have all their team behind the ball and behind the 60metre line it is not easy to find space,' the United defender said.\n'Sometimes we tried to pass the ball in behind to create the space.\n'This sort of game can always happen with a team from League One but we fight and in the end we got the penalty, we scored it, we won and we are happy with the result.\nMarouane Fellaini appeared to be jeered by United fans after being replaced by Andreas Pereira\n'Now we have to continue in the way we have started the new year. We have beaten Swansea and won today and now we must continue in this way.'\nThe United fans who paid to attend Saturday's third round tie will find it harder to think so positively, but the fact the team has now won back to back games appears to have improved self-belief in the dressing room ahead of Tuesday's trip to Newcastle.\n'Wins always help to increase our confidence,' Darmian added.\n'Now we have two days to prepare for the game with Newcastle. We have to recover and then focus on that game.'\nRooney is mobbed by his United team-mates after scoring from the penalty spot in stoppage-time\nLike his team, Darmian began the season reasonably well until a hamstring injury kept him out for the majority of December, when United went on their worst run in 26 years.\nThe Italy international was linked with a return to his homeland during his period in the sidelines - but he insists he has no intention of leaving Old Trafford.\nThe 26-year-old summer signing from Torino said: 'I am happy here with the team, the staff and the city.\n'I am happy so I just try to ignore the rumours. I want to continue on my way.\n'To return after a hamstring injury is not easy. Sometimes it affects you mentally. It is not easy. But now I feel good. I want to play like I did at the beginning of the season and that is what I'm trying to do.\n'I think the manager is happy with my progress and when I train I try to improve day by day.'","url":"https://www.dailymail.co.uk/sport/football/article-3393374/Matteo-Darmian-takes-positives-recent-Manchester-United-results.html"}
