{"authors":["Press Association"],"date_download":"2018-10-22 21:01:14","date_modify":"2018-10-22 21:01:14","date_publish":"2016-01-28 06:14:35","description":"Manchester City controversially came from behind on the night to overturn a first-leg deficit and reach the Capital One Cup final with a 4-3 aggregate win ov...","filename":"data/vaneerConsumption/Manchestercitysetupliverpoolfinalbutcontroversysurroundssecondgoal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-3e93b81a-2e39-4620-9153-e1f643df63dc-4vVdYopwYQ7f641721b07a96b5b7-628_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3419966_Manchester-City-set-Liverpool-final--controversy-surrounds-second-goal_1540242074.html","title":"Manchester city set up liverpool final - but controversy surrounds second goal","title_page":"Manchester city set up liverpool final - but controversy surrounds second goal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester City set up Liverpool final - but controversy surrounds second goal\nManchester City controversially came from behind on the night to overturn a first-leg deficit and reach the Capital One Cup final with a 4-3 aggregate win over Everton.\nAn early Ross Barkley goal at the Etihad Stadium put Everton in sight of a Wembley date with rivals Liverpool but City replied through Fernandinho.\nControversy then erupted as Raheem Sterling then appeared to take the ball out of play before teeing up substitute Kevin De Bruyne to level the tie, but Sergio Aguero completed City's fightback.\nRaheem Sterling, centre, was the subject of controversy as Manchester City booked a place in the Capital One Cup final.\nThe major downside for title-chasing City was the loss of the influential De Bruyne through injury late on, with the Belgian carried off after appearing to get his studs caught in the turf.\nThat took the shine off City's achievement but the team could still reflect on an excellent comeback after a compelling cup tie.\nAfter their late push to sell tickets, City tried to stoke up the atmosphere with loud pyrotechnics while fans brought out their 1980s throwback inflatable bananas in their hundreds.\nCity controlled the majority of possession but Everton looked dangerous on the counter-attack.\nIt was from such a break the visitors took the lead after 18 minutes. As Aguero appealed for a foul after a tumbling under a Ramiro Funes Mori challenge, Everton quickly surged forward and fed the dangerous Barkley.\nCity had begun with Yaya Toure playing deep at the base of a midfield diamond, but the Ivorian was caught out of position as Barkley raced into space. Nicolas Otamendi was also outpaced as Barkley reached the edge of the area and fired a low shot past Willy Caballero, the City goalkeeping choice in cup football.\nTrailing 3-1 on aggregate, City needed to respond and did so quickly. They looked to supply Aguero at every opportunity and David Silva found him with a clever flick. The Argentinian's long-range shot was blocked but Fernandinho followed up and fired home via a deflection off Leighton Baines.\nAguero rattled the post with a ferocious effort soon after and Joel Robles produced a brilliant reflex save as Silva pounced on Phil Jagielka's failed clearance.\nThe contest was a gripping and entertaining one and the pace was maintained after the break as Barkley broke clear and tested Caballero before Aguero got into position, only to miskick.\nSilva became the second City player to hit the woodwork when he headed against the post from a Pablo Zabaleta cross and Toure could not quite reach the rebound.\nEverton began to look like a team clinging on as Aguero almost turned in a cross from Sterling and the latter then had a shot blocked.\nThe goal City's play warranted, and levelled the tie, came after 70 minutes - but with a huge slice of controversy.\nSterling appeared to do well as he reached the byline to cross for substitute De Bruyne to rifle home - but the ball had gone out of play before it was pulled back by the England forward. None of the officials spotted it and Everton were left to rue their luck.\nAfter being controversially denied a penalty in the first leg - while Sterling himself had a strong shout for a spot-kick turned down in the league match between the clubs a fortnight ago - City took full advantage.\nSix minutes later Aguero put City ahead on aggregate with a superb glancing header from a pinpoint De Bruyne cross.\nThe tension was evident in the closing minutes as players from both sides flew into tackles but City held on, although the loss of De Bruyne was a late blow.\nTWEET OF THE MATCH\n\"That ball was never out ! #GoodCall #Mcfc\" - Former Manchester City striker Darren Huckerby (@hucks6dh6) jokingly refers to the incident which led to De Bruyne's crucial - and highly controversial - goal.\nPLAYER RATINGS\nManchester City\nWilly Cabellero: 6\nPablo Zabaleta: 6\nMartin Demichelis: 6\nNicolas Otamendi: 5\nGael Clichy: 6\nFernandinho: 6\nFabian Delph: 5\nRaheem Sterling: 7\nYaya Toure: 5\nDavid Silva: 5\nSergio Aguero: 7\nSubstitutes:\nFernando (on for Silva, 80): 5\nJesus Navas (on for Delph, 46): 5\nKevin De Bruyne (on for Toure, 66): 7\nEverton\nJoel Robles: 7\nJohn Stones: 5\nPhil Jagielka: 6\nRamiro Funes Mori: 6\nLeighton Baines: 6\nGareth Barry: 6\nTom Cleverley: 5\nGerard Deulofeu: 6\nRoss Barkley: 7\nLeon Osman: 6\nRomelu Lukaku: 5\nSubstitutes\nArouna Kone (on for Deulofeu, 59): 5\nJames McCarthy (on for Osman, 59): 5\nSeamus Coleman (on for Stones, 78): 5\nSTAR MAN\nDe Bruyne. He may have only been a 66th-minute substitute but the Belgium international breathed new life into City's bid to turn around the tie and his 24-minute contribution was pivotal.\nMOMENT OF THE MATCH\nIntroduction of De Bruyne from the bench just after the hour for the ineffectual Toure. David Silva dropped into a deeper position to provide the ammunition but De Bruyne made the difference with the goal to level up the tie on aggregate and then crossing for Aguero's winner.\nVIEW FROM THE BENCH\nEverton got off to the perfect start as they benefited from Roberto Martinez's decision to give Barkley the freedom to play in the space left by Toure but gradually they were worn down by City's pressure. Counterpart Manuel Pellegrini was calm throughout, replacing the more defensive Fabian Delph with winger Jesus Navas at half-time but the introduction of De Bruyne proved to be the match-winning decision.\nMOAN OF THE MATCH\nFor the second successive night the officials got a key decision wrong. Sterling's cross for De Bruyne's crucial goal, which swung the momentum in City's favour, appeared to have clearly crossed the line before he centred but assistant linesman Scott Ledger on the far side was not in a position to spot it.\nWHO'S UP NEXT?\nAston Villa v Manchester City (FA Cup, Saturday January 30)\nCarlisle v Everton (FA Cup, Sunday January 31)\nReflecting on the incident which led to De Bruyne's goal 20 minutes from time, Sterling was philosophical.\n\"I was only interested in the ball hitting the back of the net, I wasn't looking if the ball was out or not,\" he told Sky Sports.\n\"The most important thing is we got the luck this time, last time we didn't get a penalty, this time it might have been out but we scored and we're in the final.\"\nSterling is used to controversy, with his big-money summer move from Liverpool irking fans on the red half of Merseyside.\nThe 21-year-old, though, is looking forward to renewing acquaintances with his old club at Wembley on February 28.\n\"I might get a few (texts from old team-mates) but it's strictly business when it comes to Wembley, this is what I've been wanting to do, and I'm lucky enough to be in a final. Well done to Liverpool too, and may the best team win on the day.\"\nFernandinho, who scored a deflected equaliser just six minutes after Barkley opened the scoring for Everton, admits City had to dig deep.\n\"(Showing fighting qualities) was the best way to win the game after conceding the goal in the first half, and we turned it around with three goals at the end and we defended amazingly,\" said the Brazilian.\n\"It was important (to equalise quickly) because in the second half we only had to score one goal to force extra time, but we scored two beautiful goals and we are in the final now.\"\nToffees boss Roberto Martinez, though, could only reflect on what might have been after claiming the decision to allow De Bruyne's goal cost his side.\n\"It was a really good game of football, we were very strong in the performance, but goals are big calls and the second goal is heartbreaking,\" said Martinez.\n\"When you watch the replay it is incredible that you don't get that decision right and, you can go into many aspects of the performance, but goals were going to be very important, we knew that.\n\"It's impossible to describe how you feel when you see the decision once more, it's so clear and so big in how the game was developing, it's heartbreaking.","url":"https://www.dailymail.co.uk/wires/pa/article-3419966/Manchester-City-set-Liverpool-final--controversy-surrounds-second-goal.html"}
