{"authors":[],"date_download":"2018-10-30 01:03:33","date_modify":"2018-10-30 01:03:33","date_publish":"2017-02-25 16:00:30","description":null,"filename":"data/vaneerConsumption/ManchesterbytheSeaWhyItsNotforMe.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/02/Casey1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861413.html","title":"‘Manchester by the Sea’ - Why It’s Not for Me","title_page":"‘Manchester by the Sea’ — Why It’s Not for MeThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Though I am not, curiously, tortured with guilt about it, I confess to a prejudice. I don’t like acting. Or perhaps it’s only “acting” I don’t like? It’s so hard to tell the difference — especially now that it has become so prestigious an art that no actor does not aspire to it. It has not always been so, but the late 20th century view of acting as something above mere stardom and as emoting rather than declaiming, though it has produced some wonderful works of both theatre and cinema, has ended up all but ruining both, in my opinion. A great illustration of what I mean is Kenneth Lonergan’s Manchester by the Sea, which is undoubtedly a great actor’s movie, but which is less than great itself because of the fact. It is, indeed an almost perfect illustration of both the good and the bad in pandering to the thespian artiste’s sense of self-importance.\nOn the good side, it offers several fine portrayals of deep emotion and two, in particular, by Casey Affleck and Michelle Williams as the formerly married couple Lee and Randi of the film’s eponymous Massachusetts coastal town, of paralyzing guilt. So paralyzing in fact that, although it must seem almost scandalous of me to say so, the movie itself becomes paralyzed, static, unable to get on with things. For it, as for its main characters, there is virtually nothing left of the world outside the great Black Hole of their feelings — that light-swallowing emptiness that nothing can escape. I hasten to add the family tragedy that causes this emotional devastation, its objective correlative, is fully up to the job, but that only makes the emotion overdetermined and, to that extent, uninteresting.\nIt’s great for the actors to show their stuff with, in other words, but not so great for the movie. Mr. Lonergan should have left himself some room to look at the characters from outside, even at the cost of what he must have seen as the cruelty of anything less than complete fellow-feeling or empathy with such desperately forlorn people. For as well-drawn as their emotional portraits are, they are basically all the film has to offer, and it has no idea what to do with them beyond putting them out there. There is almost no plot, and the characters are the same at the end of the film as they are at the beginning. All its energy goes into showing, through a series of flashbacks, how they got that way through the tragedy which has driven Mr. Affleck’s character from his home and rendered him incapable of any permanent return.\nThat’s not nothing, of course, and there are some excellent bits, as in Mr. Lonergan’s two earlier films, You Can Count on Me (2000) and Margaret (2012) about how families can survive trauma or tragedy — or how they can’t. The film begins with the lesser tragedy of the death of Lee’s brother, Joe (Kyle Chandler), who is also divorced and whose will appoints Lee to the guardianship of his 16-year-old son, Patrick (Lucas Hedges). The by-play between Lee and Patrick — and between Patrick and his two girlfriends and Lee and one of the girlfriends’ mother and Patrick and his surviving parent, the desperately fragile and high-strung Elise (Gretchen Mol), now married to the Matthew Broderick-like Jeffrey (Matthew Broderick) — are all finely sketched in. They also show once again that Mr. Lonergan possesses that rarest of gifts for an American filmmaker of the block-busting era, the gifts of wit and, above all, of understatement.\nWhich makes it all the more to be regretted that he has given in to the actors’ preference for overstatement. In the end, Mr. Lonergan’s wit and observational acumen prove too delicate to stand up to the searing emotional pain of the film’s central incident, portrayed in flashback about half way through the film, and beautifully — by which, of course, I mean horrifically — represented by him. All that we learn of the relationships between Lee and Patrick and Lee and Randi and Lee and the rest of his natal community must appear to be pretty trivial by comparison with the virtuoso acting-as-emoting which here overwhelms everything more subtle and every sort of aesthetic experience but pity.\nThe characters, that is, are so thoroughly represented by their emotions that they become them. Their feelings of loss, heartbreak, horror, and guilt are, to use the currently fashionable expression, “who they are” — and all they are. We cannot see through the acting to some deeper truth about them as human beings, since we can see only the acting. You’d think that so good a writer as Mr. Lonergan would want his words to do more of the work and his actors’ capacity for vicarious suffering to do less. But perhaps his experience with Margaret, which took seven years to get to the screen after wrangles now presumably buried in the decent obscurity of legal gag orders, must have taught him that there’s a limit to how far even the most creative directors and writers can work outside of the current Hollywood idiom.","url":"https://spectator.org/manchester-by-the-sea-why-its-not-for-me/"}
