{"authors":["Kieran Gill For Mailonline"],"date_download":"2018-10-22 22:58:07","date_modify":"2018-10-22 22:58:07","date_publish":"2016-01-29 10:37:14","description":"Thought you had it bad in the Barclays Premier League, Manchester United fans? Well, it hasn’t been much better in the cup competitions under Louis van Gaal either, unfortunately.","filename":"data/vaneerConsumption/ManchesterUnitedswoefulcuprecordunderLouisvanGaalincludesdefeatsbyMKDonsandMiddlesbroughsocantheyavoidanotherupsetagainstDerby.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B23D6D00000578-0-image-a-2_1454071287296.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422522_Manchester-United-s-woeful-cup-record-Louis-van-Gaal-includes-defeats-MK-Dons-Middlesbrough-avoid-upset-against-Derby_1540249087.html","title":"Manchester United's woeful cup record under Louis van Gaal includes defeats by MK Dons and Middlesbrough... so, can they avoid another upset against Derby?","title_page":"Manchester United's woeful cup record under Louis van Gaal includes defeats by MK Dons and Middlesbrough... so, can they avoid another upset against Derby? | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Thought you had it bad in the Barclays Premier League, Manchester United fans? Well, it hasn’t been much better in the cup competitions under Louis van Gaal either, unfortunately.\nThe manager's record in the FA Cup, Capital One Cup and Champions League is uninspiring, and defeat on Friday night would leave him on the brink of being sacked.\nTheir FA Cup fourth-round tie against Derby County could represent their best hope of a trophy this season and here, Sportsmail takes a closer look at Van Gaal’s recent cup record.\nManchester United's cup record under boss Louis van Gaal (centre) has been poor over the last 18 months\nMK Dons 4-0 Manchester United, Capital One Cup second round, August 26, 2014\nThis Capital One Cup tie ended in utter humiliation as League One MK Dons, inspired by Dele Alli, scored four against United.\nThey were pulled apart by a side two divisions below them and did not even register a shot on target until the 72nd minute – sound familiar?\nThis also came on the same night United announced the £60million signing of Angel Di Maria from Real Madrid as they lost to a team put together for less than £500,000.\nMidfielder Anderson (centre) looks glum during Manchester United's 4-0 defeat by MK Dons in August 2014\nMK Dons' Will Grigg opens the scoring for the hosts during a comfortable Capital One Cup win against United\nManchester United 1-2 Arsenal, FA Cup quarter-finals, March 9, 2015\nUnited were agonisingly close to reaching the semi-finals but lost to eventual FA Cup winners Arsenal at Old Trafford.\nDanny Welbeck, formerly of United, scored the winner as the Gunners sealed their first victory at Old Trafford since 2006.\nThis defeat all but confirmed that Van Gaal – the man who sanctioned Welbeck’s sale to Arsenal – would end his first season empty-handed.\nWayne Rooney celebrates after equalising against Arsenal, but United could not build on their captain's goal\nFormer Manchester United striker Danny Welbeck scores the winner for Arsenal at Old Trafford last March\nManchester United 0-0 Middlesbrough AET (1-3 pens), Capital One Cup fourth round, October 28, 2015\nMiddlesbrough moved into the quarter-finals of the Capital One Cup by beating Manchester United on penalties.\nIt wasn’t a smash and grab by Middlesbrough, though. The Championship side deserved to progress, even if they had to do it via a shootout.\nVan Gaal made nine changes from their 0-0 draw in the Manchester derby three days before but had insurance with a substitutes’ bench signed for £196m. It did no good in the end.\nMiddlesbrough players celebrate after beating Manchester United on penalties in the Capital One Cup\nRooney covers his face after missing a chance to score against the Championship side in late October\nWolfsburg 3-2 Manchester United, Champions League, December 8, 2015\nUnited were eliminated from Europe’s elite competition after an 84th-minute winner by Wolfsburg defender Naldo meant they would finish third in Group B.\nVan Gaal knew they could qualify for the last 16 by beating Wolfsburg but could not do so.\nIt was only the fourth time that United had failed to qualify from the Champions League group stage (the other three being 1994-95, 2005-06 and 2011-12).\nWolfsburg defender Naldo celebrates after scoring his side's winner in the Champions League group stage","url":"https://www.dailymail.co.uk/sport/football/article-3422522/Manchester-United-s-woeful-cup-record-Louis-van-Gaal-includes-defeats-MK-Dons-Middlesbrough-avoid-upset-against-Derby.html"}
