{"authors":["Jack Bezants For Mailonline"],"date_download":"2018-10-23 02:12:21","date_modify":"2018-10-23 02:12:21","date_publish":"2017-03-16 12:36:28","description":"Manchester United's players have been snapped on their way out of their team hotel as they prepare to face Rostov at Old Trafford in the Europa League.","filename":"data/vaneerConsumption/ManchesterUnitedsidesnappedathotelbeforeRostovtie.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E541B3200000578-0-image-a-121_1489667873534.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4320066_Manchester-United-snapped-hotel-Rostov-tie_1540260741.html","title":"Manchester United side snapped at hotel before Rostov tie","title_page":"Manchester United side snapped at hotel before Rostov tie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester United's players have been snapped at their team hotel as they prepare to face Rostov at Old Trafford in the Europa League.\nUnited were held to a 1-1 draw in the last-16, first-leg encounter - a match which was tarnished due to the poor state of Rostov's pitch.\nThe Russians have since been banned from hosting matches on the surface until the condition improves.\nPaul Pogba heads into Thursday's match on the back of criticism for his display at Chelsea\nJose Mourinho has defended Pogba from critics ahead of the second leg against Rostov\nZlatan Ibrahimovic is free to play against Rostov but has a three-match ban in English football\nZlatan Ibrahimovic is set to feature for United after missing the FA Cup defeat by Chelsea on Monday through suspension.\nBut they will be without Wayne Rooney, who is injured, and Luke Shaw and Anthony Martial who were unable to train on Wednesday.\nAhead of the match, United manager Jose Mourinho launched a stern defence of Paul Pogba, who received heavy criticism after a ponderous display against Chelsea on Monday.\nMourinho claimed that many of Pogba's critics are envious of how much he earns at United.\n'I feel that the world is losing values and we all know that and envy is coming up to certain levels that I am scared about,' said Mourinho.\nA close up of the pitch United had to contend with last Thursday in Rostov\nRostov have since been banned from hosting matches on the pitch until it improves\n'It is not Paul's fault that he gets 10 times the money some players did in the past.\n'It is not his fault that some pundits are in trouble with their lives and need every coin to survive and Paul is a multi-millionaire.\n'It is not his fault. I think he deserves respect, I think his family deserve respect. He is from a working family, a family with three boys, and I am sure they need a lot of food on their table each day because they are all giants. So I am sure that the mum and dad had to work hard for many, many years for them.\n'He is a kid that came to Manchester, who fought for his career here and was not afraid to move and go to another country and look for better conditions.\nDavid de Gea is set to feature in United's last-16 second-leg tie against Rostov\n(From left) Chris Smalling, Marcus Rashford, Phil Jones and Jesse Lingard at the hotel\nMichael Carrick and Ashley Young are also in contention for United's game on Thursday\n'He is a kid that reached the top of the world with this work, nobody gave him anything. So I am really, really worried that things are going in such a direction that envy is everywhere.\n'I am very happy with Paul and the club is very happy with Paul. And he doesn't give an ass what people say.'\nThe draw for the quarter-final is on Friday.","url":"https://www.dailymail.co.uk/sport/football/article-4320066/Manchester-United-snapped-hotel-Rostov-tie.html"}
