{"authors":["Associated Press"],"date_download":"2018-10-23 05:40:18","date_modify":"2018-10-23 05:40:18","date_publish":"2016-01-11 18:34:50","description":"BOSTON (AP) — A drug dealing suspect charged with shooting a policeman during a traffic stop was ordered held on $1.5 million bail at his arraignment Monday,...","filename":"data/vaneerConsumption/ManchargedwithshootingBostonofficerheldon15Mbail.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:83c71386018f46a89433edaabf3afb2c-48qEJGFphM8d437f0aaf9281af00-851_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394301_Man-charged-shooting-Boston-officer-held-1-5M-bail_1540273218.html","title":"Man charged with shooting Boston officer held on $1.5M bail","title_page":"Man charged with shooting Boston officer held on $1.5M bail | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Man charged with shooting Boston officer held on $1.5M bail\nBOSTON (AP) — A drug dealing suspect charged with shooting a policeman during a traffic stop was ordered held on $1.5 million bail at his arraignment Monday, and he shouted during court, \"The officers tried to assassinate me!\"\nGrant Headley, 27, was held on $1 million bail on gun and assault-with-intent-to-murder charges in Friday's shooting of Officer Kurt Stokinger and on an additional $500,000 in connection with the sale of crack cocaine on Jan. 5.\nAuthorities say Headley shot Stokinger in the city's Dorchester neighborhood after being pulled over. According to police accounts, Headley was pulled over because he was out on probation and known to be selling drugs and because he was driving on a suspended license.\nA crime scene investigation vehicle, top, heads into the Dorchester neighborhood where a Boston police officer was was shot, Friday morning, Jan. 8, 2016, in Boston. Police Commissioner William Evans said the officer, who was shot in the leg after pulling over a known drug dealer, is expected to survive. The suspect, identified as Grant Headley, 27, was apprehended by other officers after a short foot pursuit. (AP Photo/Stephan Savoia)\nHe opened fire on Stokinger and tried to run away, police said. Stokinger returned fire but didn't strike Headley. Headley was apprehended by other officers as he tried to flee on foot, authorities said. Police also recovered a gun they think was used in the shooting.\nHeadley pleaded not guilty Monday to all charges. After bail was set, he shouted, \"The officers tried to assassinate me!\"\nHis court-appointed lawyer had argued for $25,000 bail, saying Headley has always shown up for court despite a lengthy criminal record.\nStokinger, who was shot in the leg, was released from the hospital Sunday. The nine-year veteran and married father of two is expected to make a full recovery.\nHeadley's relatives refused to comment outside court.\nLaw enforcement officers muster near the scene where a Boston police officer was shot, Friday morning, Jan. 8, 2016, in Boston's Dorchester neighborhood. Police Commissioner William Evans said the officer, who was shot in the leg after pulling over a known drug dealer, is expected to survive. The suspect, identified as Grant Headley, 27, was apprehended by other officers after a short foot pursuit. (AP Photo/Stephan Savoia)","url":"https://www.dailymail.co.uk/wires/ap/article-3394301/Man-charged-shooting-Boston-officer-held-1-5M-bail.html"}
