{"authors":["Chris Wheeler For Mailonline"],"date_download":"2018-10-23 00:45:17","date_modify":"2018-10-23 00:45:17","date_publish":"2016-01-29 14:06:54","description":"Manuel Pellegrini has told Everton to stop moaning, claiming that his team suffered more at the hands of poor refereeing decisions over three games between the two clubs this month.","filename":"data/vaneerConsumption/ManchesterCityhavemorecomplaintswithrefereesthanEvertoninsistsbossManuelPellegriniafterCapitalOneCupcontroversy.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2E26A00000578-0-image-a-30_1454076739431.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422840_Manchester-City-complaints-referees-Everton-insists-boss-Manuel-Pellegrini-Capital-One-Cup-controversy_1540255517.html","title":"Manchester City have more complaints with referees than Everton, insists boss Manuel Pellegrini after Capital One Cup controversy","title_page":"Manchester City have more complaints with referees than Everton, insists boss Manuel Pellegrini after Capital One Cup controversy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manuel Pellegrini has told Everton to stop moaning about Manchester City’s controversial goal in their Capital One Cup semi-final, claiming that his team suffered more at the hands of refereeing decisions over three games between the two clubs this month.\nRoberto Martinez described Everton’s defeat as ‘hurtful and unfair’ after referee Martin Atkinson and his assistants failed to spot that the ball had crossed the dead ball line before Raheem Sterling crossed for Kevin De Bruyne to level the tie in Wednesday’s second leg at the Etihad.\nBut Pellegrini believes he has more reason to be upset after City were denied penalty appeals when they lost the first leg at Goodison Park and were held to a goalless draw there in the league earlier this month.\nManuel Pellegrini believes Manchester City were hard done by during their three games with Everton\nManchester City's players train ahead of their FA Cup fourth round clash with Aston Villa on Saturday\n‘We have more complaints but we never talk, that’s the difference,’ said Pellegrini ahead of City’s FA Cup trip to Aston Villa. ‘We lost that game (the first leg) at Goodison Park and didn’t say anything about that.\n‘The ball was just one centimetre over the line. It was very difficult for the linesman to see with the two posts, and the position of the referee cannot allow him to see if the ball is completely out or not.\n‘That was less of a mistake than the two penalties when he (the referee) didn’t whistle against Everton in the Premier League and in the first leg.\n‘Their first goal was also offside so Everton cannot complain about one refereeing decision that was a mistake.\nRaheem Sterling offered up the cutback for the goal but the ball appeared to have crossed the line already\nTelevision replays showed that Sterling had run the ball out of play but Kevin De Bruyne's goal still stood\n‘We had more damage from the referee than Everton, so I don’t think we are in the final because of that refereeing decision.’\nDe Bruyne was later carried off after injuring the knee and ankle in his right leg, and will be out of action for up to 10 weeks.\nIt means that City’s £54million summer signing is set to miss a minimum of 12 games, including the cup final against Liverpool next month and the Champions League double header with Dynamo Kiev.\nSterling heads the ball during training at the club's Football Academy ahead of their FA Cup clash\nBut Pellegrini is still set to name De Bruyne in his Champions League squad on Tuesday, with the injured Samir Nasri in danger of losing his place to Kelechi Iheanacho.\n‘It’s an option,’ said Pellegrini. ‘We are talking with the doctor to be realistic in when Samir can be again in our squad, but we will leave the decision until the last day.\n‘We hope Kevin will be ready at the end of March, so I don’t think we will take him out of the Champions League list.’\nKevin De Bruyne has been ruled out for ten weeks following the knee injury suffered against Everton\nThe City boss challenged his players to fill the gap left by De Bruyne, who has scored 12 goals and made the same number of assists this season.\nHe added: ‘I think that Raheem (Sterling), Jesus (Navas) and David (Silva) will have more responsibility knowing that Kevin is not here.","url":"https://www.dailymail.co.uk/sport/football/article-3422840/Manchester-City-complaints-referees-Everton-insists-boss-Manuel-Pellegrini-Capital-One-Cup-controversy.html"}
