{"authors":["Andy Hampson","Press Association Sport"],"date_download":"2018-10-23 02:06:43","date_modify":"2018-10-23 02:06:43","date_publish":"2017-03-16 12:22:50","description":"Bacary Sagna admitted Manchester City lacked fight as they were dumped out of the Champions League in Monaco. City surrendered their 5-3 first-leg advantage as they lost 3-1 at Stade Louis II.","filename":"data/vaneerConsumption/ManchesterCityforgottoplayinMonacosaysSanga.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E4F105300000578-0-image-a-73_1489666907316.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319968_Manchester-City-forgot-play-Monaco-says-Sanga_1540260403.html","title":"Manchester City 'forgot to play' in Monaco, says Sanga","title_page":"Manchester City 'forgot to play' in Monaco, says Sanga | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Bacary Sagna admitted Manchester City lacked fight as they were dumped out of the Champions League in Monaco.\nCity surrendered their 5-3 first-leg advantage as they lost 3-1 at Stade Louis II, exiting the competition at the last-16 stage on away goals.\nManager Pep Guardiola's bold attempts to combat Monaco's dangerous forwards by going with an all-out attacking approach himself backfired as City failed to gain any meaningful first-half possession.\nFabinho of AS Monaco celebrates after giving his side a 2-0 lead as Bacary Sagna looks on\nBy the interval they were 2-0 down after goals from Kylian Mbappe and Fabinho, and although Leroy Sane put City back in control, a powerful header by Tiemoue Bakayoko settled the tie.\nThe loss realistically leaves the FA Cup as City's only remaining route to silverware this season, but a quick response is required ahead of a vital Premier League clash against top-four rivals Liverpool on Sunday.\nRight-back Sagna said: 'It is a massive disappointment. We forgot to play in the first half, we forgot to fight as a team, defend as a team and press as a team. We gave them too much respect and against these kind of players, we put ourselves in danger.\n'We have to congratulate them, they are through. We are out and we have to recover because on Sunday we have an important game.\nMonaco players celebrate with team-mate Bernardo Silva in front of fans after their victory\n'I expect a reaction from the team. I expect more desire, to show more passion. We did show passion in the second half but it is not enough.\n'We have to recover because it was quite a difficult game and then we have to think about Liverpool.'\nAll three goals City conceded raised questions about their defence, particularly the winner, when Bakayoko was allowed to rise unchallenged to head home Thomas Lemar's free-kick 13 minutes from time.\nGuardiola had vowed to try to get on the front foot against the free-scoring Ligue 1 leaders - whose goal tally for the season now stands at 126 - but the decision to leave Yaya Toure on the bench came as a surprise.\nSagna looks dejected alongside Sergio Aguero as he applauds the travelling fans in Monaco\nWithout the in-form Toure in midfield, City only had Fernandinho to protect a back four that contained only one specialist centre-back in John Stones.\nConsequently City found themselves facing wave after wave of Monaco attacks and against a team of such potency, even without the injured Radamel Falcao, goals seemed inevitable.\nCity were first breached in the eighth minute by Mbappe, who had already forced a fine save from Willy Caballero, and their defence was cut open time after time.\nOnly in the second half did they finally manage to gain a foothold, but the impact of Sane's 71st-minute close-range strike was quickly undone.\nMonaco forward Kylian Mbappe challenges Manchester City star Sagna for the ball\nManchester City's Argentinian goalkeeper Willy Caballero (R) blocks a shot on goal\nSagna said: 'We (said at half-time we) couldn't keep going this way or we are out. We had to go on the front step and we had to give them problems.\n'We changed the system and I think it worked quite well, we managed to create more chances, but unfortunately we didn't score (enough).\n'We knew they had quality, they are probably the most scoring team in Europe at the minute. We knew they had quality players, we knew they had dangerous players.\n'We conceded six goals over two games. It is never easy to take but we have to, unfortunately.'","url":"https://www.dailymail.co.uk/sport/football/article-4319968/Manchester-City-forgot-play-Monaco-says-Sanga.html"}
