{"authors":["Jonathan Spencer For Mailonline"],"date_download":"2018-10-23 00:42:00","date_modify":"2018-10-23 00:42:00","date_publish":"2017-03-10 07:43:14","description":"The likes of Paul Pogba, Zlatan Ibrahimovic, Juan Mata, Ashley Young and Jose Mourinho were pictured on arrival in Manchester and it's fair to say that they could do with some much-needed sleep.","filename":"data/vaneerConsumption/ManchesterUnitedstarslookwearyfollowingRostovtrip.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E2173BD00000578-0-image-a-5_1489134660336.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300288_Manchester-United-stars-look-weary-following-Rostov-trip_1540255320.html","title":"Manchester United stars look weary following Rostov trip","title_page":"Manchester United stars look weary following Rostov trip | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester United have returned home following their 1-1 draw with Rostov in the Europa League on Thursday night in Russia.\nAnd no surprise to see that many of the United stars looked very jaded as they touched down in Manchester in the early hours of Friday morning.\nThe likes of Paul Pogba, Zlatan Ibrahimovic, Juan Mata, Ashley Young and Jose Mourinho were pictured on arrival at 3:30am in Manchester and it's fair to say that they could do with some much-needed sleep.\nZlatan Ibrahimovic and Henrikh Mkhitaryan look jaded on arrival in Manchester on Friday\nJose Mourinho and his Manchester United side have returned home from Russia\nUnited scored a crucial away goal on Thursday night in the Europa League last 16 first-leg clash with Russian side Rostov.\nHenrikh Mkhitaryan put Jose Mourinho's side ahead in the first half before Aleksandr Bukharov levelled the scoring after the break with a fine finish.\nHowever, Mourinho and his United team will be very confident of progressing through to the last eight of the Europa League when they take on Rostov at Old Trafford next Thursday.\nJuan Mata, Ashley Young and Paul Pogba pictured looking weary eyed in Manchester\nYoung looks as if he is about to drift off while walking through the airport on Friday morning\nDespite looking drained, United will be satisfied after drawing 1-1 with Rostov on Thursday\nFollowing the hard-fought draw in Russia, Mourinho appeared to be in a satisfied mood, insisting that his side earned a positive result.\nMourinho told MUTV: 'It was a very good performance in relation to the conditions. It was impossible to play better, impossible to play a passing game.\n'We played what the game demanded and we played well. We made one defensive mistake. We have an open result for the second leg with a little advantage for us.\nDavid de Gea were also snapped on arrival in Manchester at 3:30am on Friday morning\nA tired looking Marcus Rashford wraps up after touching down following United's draw\nAnder Herrera appears to be one of the only United players in good spirits on arrival\n'There are no injuries. I think we had a positive result. We know we need to win or to have a 0-0 draw so the game is open, the tie is open. But, in these circumstances, I think it was a good result.'\nDespite needing some recovery time following their long trip home from Russia, United are straight back in action as they face Chelsea in the FA Cup quarter-finals on Monday night.\nAnd Mourinho will be hoping that his players won't be mentally and physically drained when they face Antonio Conte's Chelsea side at Stamford Bridge as they look to secure more silverware this season.","url":"https://www.dailymail.co.uk/sport/football/article-4300288/Manchester-United-stars-look-weary-following-Rostov-trip.html"}
