{"authors":["Press Association"],"date_download":"2018-10-23 01:08:20","date_modify":"2018-10-23 01:08:20","date_publish":"2016-01-28 15:23:24","description":"Kevin De Bruyne will be assessed this week after suffering suspected medial ligament damage in Manchester City's Capital One Cup semi-final win over Everton....","filename":"data/vaneerConsumption/Manchestercitytoassesskevindebruynekneeinjury.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-ec56447c-70fc-4cb3-9fd9-9f77b4976695-2vdWmEltwXfba0ce28e632a1f375-208_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420126_Manchester-City-assess-Kevin-De-Bruyne-knee-injury_1540256900.html","title":"Manchester city to assess kevin de bruyne knee injury","title_page":"Manchester city to assess kevin de bruyne knee injury | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester City to assess Kevin De Bruyne knee injury\nKevin De Bruyne will be assessed this week after suffering suspected medial ligament damage in Manchester City's Capital One Cup semi-final win over Everton.\nThe Belgian, who scored a vital - albeit controversial - goal and set up another after coming off the bench in City's 3-1 win in the second leg at the Etihad Stadium, was carried off in the closing minutes.\nThe 24-year-old appeared to get his studs caught in the turf and then landed awkwardly on his knee as City closed in on their 4-3 aggregate success.\nManchester City's Kevin De Bruyne suffered a serious-looking knee injury against Everton\nInitial medical reports suggest the problem is not related the cruciate ligament but still prompted plenty of concern on the City bench.\nManager Manuel Pellegrini said: \"We will see tomorrow. The doctor thinks he has a problem in his medial ligament but it is impossible to know before tomorrow.\nAsked if De Bruyne could miss the rest of the season for quadruple-chasing City, Pellegrini said: \"I hope not. It is very difficult to know in this moment but I am optimistic he will not be out for the rest of the season.\"\nMeanwhile Everton goalkeeper Joel Robles has apologised to De Bruyne for attempting to pick the player up as he lay down in pain.\nRobles tweeted: \"I would like to apologise to Kevin De Bruyne for my reaction to his injury. In the heat of the moment I didn't realise he was badly hurt.","url":"https://www.dailymail.co.uk/wires/pa/article-3420126/Manchester-City-assess-Kevin-De-Bruyne-knee-injury.html"}
