{"authors":["Chris Wheeler For Mailonline"],"date_download":"2018-10-23 00:50:13","date_modify":"2018-10-23 00:50:13","date_publish":"2016-01-28 14:57:24","description":"The Dutchman came under renewed pressure following last weekend's defeat at home by Southampton amid speculation that he offered to resign halfway through his three-year contract.","filename":"data/vaneerConsumption/ManchesterUnitedsLouisvanGaalblastsspeculationoverfutureasawfulandhorrible.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB31D100000578-0-image-a-7_1453996487804.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421104_Manchester-United-boss-Louis-van-Gaal-blasts-speculation-future-awful-horrible-insists-fighting_1540255813.html","title":"Manchester United's Louis van Gaal blasts speculation over future as 'awful and horrible'","title_page":"Manchester United's Louis van Gaal blasts speculation over future as 'awful and horrible' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester United boss Louis van Gaal has described his treatment as 'horrible and awful' following the recent home defeat by Southampton.\nThe Dutchman has come under renewed pressure amid reports he offered to resign halfway through his three-year contract at Old Trafford.\n'It is awful and horrible but you can write....It is the third time I am sacked and I am still sitting here,' he told reporters.\nVan Gaal believes his treatment has been 'horrible and awful' following the defeat by Southampton\nUnder pressure: Van Gaal, pictured during the press conference, says he is going nowhere\nLouis van Gaal has branded media speculation over his future as 'awful and horrible'\nUnited were beaten 1-0 by Southampton at Old Trafford last weekend to leave them five points off the top four\nBut a defiant Van Gaal said: 'I am always fighting.\n'It's your duty as a manager and a player to stand up again and do what you do because that is a professional attitude.\n'It is always like that when you lose a game, certainly in the last minute, that you are fed up. How we have played (against Southampton) is not always the main issue because you can play badly and win.\n'When that happens, you are not so fed up. But we have played very well and lost, like Chelsea away last season, so when that happens you are more fed up than ever.'\nAsked if he had offered his resignation to United chief Ed Woodward, Van Gaal replied: 'I have not mentioned that, ever.\nCharlie Austin (centre) scored the only goal of the game as United suffered their sixth defeat of the season\nVan Gaal insists he is 'always fighting' and has the support of chief executive Ed Woodward\n'(Woodward's support) is fantastic of course, but that also gives you a lot of pressure. When the board has such confidence, the pressure is much higher than when they say it is the last game.","url":"https://www.dailymail.co.uk/sport/football/article-3421104/Manchester-United-boss-Louis-van-Gaal-blasts-speculation-future-awful-horrible-insists-fighting.html"}
