{"authors":["Gavin Lesnick"],"date_download":"2018-10-30 19:05:33","date_modify":"2018-10-30 19:05:33","date_publish":"2014-11-14 00:00:00","description":"An 18-year-old North Little Rock man has been arrested in the battery and robbery of his elderly grandmother, police said Friday.","filename":"data/vaneerConsumption/Manchargedinrobberybatteryof84yearoldgrandmother.json","image_url":"https://media.arkansasonline.com/img/photos/2014/11/14/paulholt_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2014_nov_14_man-charge_9e1038d67f1dbb3a4f28027c18cddb92__page=1_1540926333.html","title":"Man charged in robbery, battery of 84-year-old grandmother","title_page":"Man charged in robbery, battery of 84-year-old grandmother","title_rss":"NULL","source_domain":"arkansasonline.com","text":"An 18-year-old North Little Rock man has been arrested in the battery and robbery of his elderly grandmother, police said Friday.\nPaul Holt Jr. faces charges of robbery, theft of property and second-degree domestic battery, all felonies, in the Thursday afternoon assault.\nAccording to a Little Rock Police Department report, Holt and his friends went to his 84-year-old grandmother's home in the 12000 block of Chicot Road to get money.\nPolice say Holt \"charged his grandma and intentionally struck her [on her head] with his forearm,\" which caused her to fall. According to the report, Holt later \"threw her on the ground once he realized she was trying to get help.\"\nHolt left the scene with his grandmother's television and car. He was arrested about 4:45 p.m. at an address in the 4000 block of Arkansas 161 in Jacksonville.\nPolice on Thursday reported officers found the victim outside her home bleeding from the nose and unaware of who had assaulted her. She was treated and released for her injuries.\nHolt remained in the Pulaski County jail Friday morning with bail not yet set and a court date scheduled for Thursday.","url":"https://www.arkansasonline.com/news/2014/nov/14/man-charged-robbery-battery-84-year-old-grandmothe/?page=1"}
