{"authors":["Steph Cockroft For Mailonline"],"date_download":"2018-10-23 00:16:47","date_modify":"2018-10-23 00:16:47","date_publish":"2017-03-16 09:27:48","description":"The football club set up secret cameras at the Old Trafford fast food joint after takings repeatedly went missing. Seven employees were then caught red-handed helping themselves to the money.","filename":"data/vaneerConsumption/ManchesterUnitedburgerstandworkersstolemoney.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E5319F700000578-0-image-a-10_1489656256425.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319392_Manchester-United-burger-stand-workers-stole-money_1540253807.html","title":"Manchester United burger stand workers stole money","title_page":"Manchester United burger stand workers stole money | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A group of burger stand staff at Manchester United's ground were caught on camera shoving money down their trousers in a 'skimming' racket after £4,500 disappeared from the till.\nThe football club set up secret cameras at the Old Trafford fast food joint after takings repeatedly went missing during home matches and other sporting events at the ground.\nSeven employees were then caught red-handed helping themselves to the money, which came from fans buying burgers and other fast food items.\nFliavio Andrade (left) and Lugman Arogundad (right) were among the men caught stealing from a kiosk at Old Trafford. Andrade was the kiosk boss and said to be the scam ringleader\nThe racket was dubbed 'skimming off the top' which is slang for taking cash 'off the top' of the daily receipts of a business.\nThe workers - who were linked to £600 which went missing during the Super League Grand Final between rugby League clubs Warrington Wolves and Wigan Warriors - could now be facing jail for theft.\nAnthony Agabaje, 21, of Clayton, and Mustafa Belkhair, 20, of Ardwick, denied any wrongdoing but were found guilty at trial.\nLugman Arogundada, 22, of Blackley, Mwila Bwanga, 20, of Gorton, Olamide Oyawaye, 21, of Sandbach, Justino Edmilson, 22, and Fliavio Andrade, 22, of Rochdale, all pleaded guilty to theft.\nBut police are still investigating the disappearance of around £4,500 in cash, which is still unaccounted for.\nProsecutor Heather Alsop told the court that a peephole camera was installed at that kiosk after bosses realised money was missing.\nMwila Bwanga, 20, (left) and Olamide Oyawoye, 21, pictured arriving at court, also admitted their part in the scam\nJustino Edmilson, 22, was one of the defendants who helped steal a collective £600 from the kiosk. The money came from fans buying hot items such as burgers\nFliavio Andrade, who was team leader at the EK03 kiosk, was at the centre of the scam, she said.\nShe said that, after the rugby clash between Warrington Wolves and Wigan Warriors, the tills at the kiosk were found to be £382 short.\nA full stock check revealed more than £200 of food and drink was missing as well.\nCCTV was analysed and the men were arrested.\nMrs Alsop said: 'There is evidence the defendants took money from the till and put it down their trousers as well as inside blue gloves meant for hygiene. The money was passed around and shared out.\n'It is said Mr Andrade took a cut of that money before the other team members pocketed the remainder.'\nAnthony Agabaje, 21, of Clayton, and Mustafa Belkhair, 20, of Ardwick, pictured arriving at court, denied any wrongdoing but were found guilty at trial\nEmma Crompton, public catering manager at Old Trafford told the hearing: 'I noticed that money had gone missing and as a result it was decided that CCTV would be installed and was concerned with the staff that appear today.\n'The defendant's have all worked between one to four years at the stall. A Number of cameras were installed on the front tills and on the rear of the kiosk following the incident on the 8th of October I viewed the CCTV and noticed money appeared to be taken from the tills.\n'Following this I compiled a full report which showed who was on what till at the time. Seven males were working that match day and six kiosks were down by £382 and a further stock count was taken which showed a loss of £597.'\nAt his trial, Agabaje said he had not stolen any money and the package he was seen putting down his trousers contained cannabis and two joints.\nHe claimed he was high on the drug during his shift so 'didn't really know what he was doing.'\nBelkhair, of Ardwick, claimed he had been given a'considerable' amount of money in tips and hid them in his trousers as he was scared at having them confiscated.\nHowever District Judge Mark Hadfield described their explanations as 'fanciful' and found them both guilty of theft.\nHe said: 'I have absolutely no doubt you were acting dishonestly and in doing so were trying to deprive the club of that money.'\nAll seven will be sentenced at Manchester Crown Court at a later date.","url":"https://www.dailymail.co.uk/news/article-4319392/Manchester-United-burger-stand-workers-stole-money.html"}
