{"authors":["Associated Press"],"date_download":"2018-10-23 00:25:30","date_modify":"2018-10-23 00:25:30","date_publish":"2016-01-28 14:20:48","description":"SAN DIEGO (AP) — A former Cub Scout leader who often invited children to his suburban home to swim denied that he is the former host of a children's televisi...","filename":"data/vaneerConsumption/MandeniesheisTVhostwantedonchildsexcharges.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:b818ba01df104e4baac1b562414d4fdc-4vVdYopwYQ7f641721b07ae1355c-919_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421020_Man-denies-TV-host-wanted-child-sex-charges_1540254330.html","title":"Man denies he is TV host wanted on child sex charges","title_page":"Man denies he is TV host wanted on child sex charges | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Man denies he is TV host wanted on child sex charges\nSAN DIEGO (AP) — A former Cub Scout leader who often invited children to his suburban home to swim denied that he is the former host of a children's television show who went by the name \"Mr. Wonder\" and is wanted in Louisiana on charges that he sexually abused children during a camping retreat nearly four decades ago.\nA man identified by authorities as Frank John Selas III on Wednesday contested that he is the 76-year-old fugitive. San Diego Superior Court Judge David Szumowski ordered him to be held without bail and scheduled a hearing Feb. 11 to establish identity.\nThe man arrested by the U.S. Marshals Service at his home Monday in Bonita, near San Diego, goes by Frank Szeles and advertised swim lessons and other activities for young children. Authorities say the former television host changed his name.\nFrank John Selas shackled hands rest at his side as he is arraigned Wednesday, Jan. 27, 2016, in San Diego. Salas who once hosted a children's show on local television under the name \"Mr. Wonder\" was arrested on charges he sexually abused children during a camping retreat nearly four decades ago. (AP Photo)\nIn the late 1970s, Selas hosted the \"Mr. Wonder\" show on KNOE-TV in north Louisiana. In 1979, the Rapides Parish sheriff's office fielded complaints from parents who accused Selas of abusing their children.\nSelas, then 39, allegedly fled the country before investigators could arrest him. He is charged with two counts of obscene behavior with a juvenile.\nFamily of the man arrested Monday was in the courtroom but didn't speak with reporters. The man's attorney, Marc Carlos, read a statement from the family that pleaded for privacy.\n\"Despite the allegations, for 37 years, Frank Szeles has been a husband, father and grandfather and has always provided for his family,\" the family said. \"He is well-loved, respected and supported by his family and friends and the community here in San Diego.\"\nCarlos said the developments were \"a shock to everyone.\"\nSzeles Enterprises advertised swim lessons, Cub Scouts and Saturday field trips for boys 5 to 11 years old in the San Diego area. Neighbors said Wednesday that parents often took their children to play in his backyard pool.\n\"He always had a lot of kids around him,\" said Haywood Gammon, who lives next door and said the man had been living there with his wife at least since he arrived in 1999.\nThe Boy Scouts of America said Frank Szeles was Cubmaster of Pack 888 in Bonita but was \"removed from Scouting several years ago for non-compliance with our youth protection policies and procedures.\" The organization said his removal followed a complaint from a parent who was not involved in the group and was unrelated to scouting.\nLt. Tommy Carnline, a spokesman for the Rapides Parish sheriff's office, said investigators identified seven alleged victims. Steve Jurman, supervisory deputy U.S. marshal in San Diego, said there have been no reports of victims in the San Diego area, where authorities believe he has lived since the 1980s.\nJurman said the man who was arrested Monday admitted to authorities that he changed his name.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3421020/Man-denies-TV-host-wanted-child-sex-charges.html"}
