{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-22 23:28:01","date_modify":"2018-10-22 23:28:01","date_publish":"2016-01-11 06:03:59","description":"Fire crews from three towns rushed to the Kennet and Avon Canal in Moulton Drive, Bradford-on-Avon, Wiltshire, and despite using breathing apparatus, could not board the boat (pictured)","filename":"data/vaneerConsumption/MandiesaftercanalboatinBradfordonAvoncaughtfireasheslept.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/09/300037AE00000578-0-image-a-93_1452504706600.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393406_Man-dies-canal-boat-living-caught-fire-slept_1540250881.html","title":"Man dies after canal boat in Bradford-on-Avon caught fire as he slept","title_page":"Man dies after canal boat in Bradford-on-Avon caught fire as he slept | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Man's remains found inside and fire service believe blaze was an accident\nCould not board safely, even with breathing\nA man living on a canal boat was burned to death yesterday when flames swept through the vessel which was moored at the riverside.\nEmergency services were alerted when a passer-by noticed the canal boat on fire shortly before 3.30am.\nFirefighters stayed at the scene for 12 hours and found the man's remains inside the burned out hull.\nA man living on a canal boat was burned to death yesterday when flames swept through the vessel which was moored at the riverside in the Kennet and Avon Canal in Moulton Drive, Bradford-on-Avon, Wiltshire\nEmergency services were alerted when a passer-by noticed the fire shortly before 3.30am on Sunday\nFire crews from three towns rushed to the Kennet and Avon Canal in Moulton Drive, Bradford-on-Avon, Wiltshire, but despite using breathing apparatus were unable to safely board the craft.\nThe victim, who has not yet been identified, was taken to a local hospital mortuary where a post mortem examination will be carried out.\nFirefighters said that the cause of the canal boat blaze was still being investigated but early indications were that it started accidentally as the man was sleeping.\nA spokesman for the Wiltshire Fire and Rescue Service said: 'A man has lost his life following a fire on a canal boat this morning.\nFire crews from three towns rushed to the blaze and despite using breathing apparatus were unable to safely board the craft\nFirefighters said that the cause of the canal boat blaze was still being investigated but early indications were that it started accidentally as the man was sleeping\n'We were called to the Kennet & Avon Canal at 3.33am after a passer-by saw the boat well alight.\n'Crews from Bradford on Avon, Trowbridge and Melksham attended, together with the heavy rescue unit from Trowbridge.\n'Four breathing apparatus wearers used two hose reel jets and a main jet to tackle the blaze.\n'Because of the damage to the boat and the difficulty in getting safe access on board, firefighters remained on scene for some 12 hours, with a relief crew being mobilised from Corsham.","url":"https://www.dailymail.co.uk/news/article-3393406/Man-dies-canal-boat-living-caught-fire-slept.html"}
