{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 18:40:36","date_modify":"2018-10-30 18:40:36","date_publish":"2016-08-30 18:33:16","description":"An Oklahoma man is demanding that a \"religious\" image of a woman wearing a hijab be removed from a library vehicle because it promotes Islam on public property.","filename":"data/vaneerConsumption/ManDemandsRemovalofReligiousImageofHijabWearingWomanonGovernmentCar.json","image_url":"https://media.breitbart.com/media/2016/08/Screen-Shot-2016-08-30-at-2.22.02-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/faith_2016_08_30__1540924836.html","title":"Man Demands Removal of 'Religious' Image of Hijab-Wearing Woman on Government Car","title_page":"Man Demands Removal of 'Religious' Image of Hijab-Wearing Woman on Government Car | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"An Oklahoma man is demanding that a “religious” image of a woman wearing a hijab be removed from a library vehicle because it promotes Islam on public property.\n“I see a public vehicle that is paid for by the taxpayer’s money that displays, has a picture of a lady in Islamic attire,” Chad Grensky told KFOR.\nGrensky says that the hijab represents the Muslim faith and wants it removed.\nHe says that his complaint has nothing to do with Islam or being against any peaceful religion and says he is not racist.\n“What I have a problem with is we can’t put a nun on the side of that car because she’s wearing a head garment,” Grensky said. “We have to remove ‘In God We Trust’ from our police cars.”\nGrensky took his complaint to the Pioneer Library System, where they were surprised because they never had a complaint like this before.\nThe library system has images of various people of different ages and races posing with a book with the words “good things coming my way” on their vehicles.\n“We don’t believe that image is promoting a religion. We think it is expressing a culture,” said Anne Masters, the executive director, to KFOR.\nThe Oklahoma Supreme Court asked for the removal of a monument of the 10 Commandments on Oklahoma state capitol grounds because it violated the state’s constitution that bans the promotion of religion on public property.\nArticle 2, section 5 of the Oklahoma State Constitution says:","url":"https://www.breitbart.com/faith/2016/08/30/man-demands-removal-religious-image-hijab-wearing-woman-government-car/"}
