{"authors":[],"date_download":"2018-10-30 21:33:27","date_modify":"2018-10-30 21:33:27","date_publish":"2016-03-08 18:41:14","description":"A woman’s random act of kindness will result in a lot of help for cancer patients.Right before Christmas, Tracy Warshal swung by the Aldi grocery store in Smyrna on her way home from work to pick up a few items to make smoothies.","filename":"data/vaneerConsumption/Mandonates10000toPiedmontafterwomans7actofkindness.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/08/Images/photos.medleyphoto.8943508.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_man-donates-000-_3c654bce6e2c5b7940fc41b9d8d0abd9__1540935207.html","title":"Man donates $10,000 to Piedmont after woman's $7 act of kindness","title_page":"Man donates $10,000 to Piedmont after woman's $7 act of kindness","title_rss":"NULL","source_domain":"ajc.com","text":"A woman’s random act of kindness will result in a lot of help for cancer patients.\nRight before Christmas, Tracy Warshal swung by the Aldi grocery store in Smyrna on her way home from work to pick up a few items to make smoothies.\nAfter she paid for her frozen fruit and spinach, she noticed an older man behind her getting flustered because he had accidentally left his wallet at home and couldn’t pay for his items.\nWarshal offered to pay instead, shelling out between $5 and $7.\nHe thanked her and asked for her name. She wished him a Merry Christmas.\n“It really wasn’t a big deal,” she said. “He forgot something. I was able to help him and I did.”\nEnd of story, right?\nNot quite.\nEarlier this year, Warshal was at her job as a scheduling coordinator at the Piedmont Cancer Institute when she was told by a co-worker that there were some people waiting to see her. Turned out they were officials from the Piedmont Healthcare Foundation.\nThe man she helped in December wanted to pay it forward.\nHe was able to track her down because that day she was wearing a black T-shirt with the words “Piedmont Cancer, MD Anderson Cancer (with a line through it) Network” and scrubs.\nHe wanted to make a $10,000 donation in her name to the foundation. The donation will go toward the Dana G. Smith Cancer Assistance Endowment, which provides financial assistance to cancer patients.\n“Tracy is an angel and proof that kindness and compassion are always inside you,” said Mendal Bouknight, vice president of philanthropy at Piedmont Healthcare Foundation. “Little did she know that this one random act of kindness would lead to someone paying it forward in such a big way.” He said the foundation expects the funds soon.\nThe man, who wishes to remain anonymous, has apparently given to Piedmont in the past.\nWarshal was speechless.\n“I think sometimes we forget that it’s really about the small things in life that matter,” said Warshal, who is uncomfortable with all the attention she has received lately.\nWarshal said she talks to patients some days who don’t have a ride to get to their chemo treatments or have to come by themselves.\n“I think because I’ve worked in cancer care for so long that I realize there are bigger issues that people are dealing with. I think we forget to be thankful for the blessings we have.”\nShe also likes to think that someone would do the same for her older relatives.\nShe said she respects the man’s desire for privacy, although she would like to see him again, give him a big hug and say thank you.\nAs for the $10,000 donation?\n“I don’t even really have the words to express myself, to be honest,” she said. “The help that it’s going to provide for patients is just tremendous. One small gesture can really change people’s lives in the blink of an eye.”","url":"https://www.ajc.com/lifestyles/man-donates-000-piedmont-after-woman-small-act-kindness/Op9meNR14BoaUkttmaiXlM/"}
