{"authors":["Bryant Hevesi For Daily Mail Australia"],"date_download":"2018-10-23 02:27:58","date_modify":"2018-10-23 02:27:58","date_publish":"2017-04-26 13:33:36","description":"A mystery man is on the run after dumping two chickens inside a crowded peak-hour train carriage in Sydney. The man threw the chickens onto the train at Mascot station on Tuesday.","filename":"data/vaneerConsumption/MandumpschickensonaSydneytrainandthenflees.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F08C300000578-0-image-a-20_1493207282489.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447404_Man-dumps-chickens-Sydney-train-flees_1540261678.html","title":"Man dumps chickens on a Sydney train and then flees","title_page":"Man dumps chickens on a Sydney train and then flees  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's the fowl incident which has ruffled a few feathers.\nA mystery man is on the run after dumping two chickens inside a crowded peak-hour train carriage in Sydney.\nThe man threw the chickens - believed to be a white silky and Rhode Island red - onto the train at Mascot station on Tuesday about 7pm before fleeing the area, 7 News reported.\nScroll down for video\nTwo chickens were dumped inside a Sydney train carriage at Mascot station during the evening peak on Tuesday\nThe chickens were picked up by two commuters who kept hold them until the train pulled into Central station two stop away\nVision of the chickens on board the train show the intrigued duo mixing among bemused commuters, many of them tourists as the train was operating on the city's airport line.\nThe chickens were then picked up by a man and woman, who kept hold of the chickens until the train pulled into Central station, two stops away.\n'He just dumped them,' the woman said of the mystery man.\nThey then handed the chickens over to station staff who kept them safe, with an office turned into a makeshift chicken coop.\nThe chickens were given to staff at Central station (pictured) and are now in the care of a NSW Train Link employee\n'They were handed to staff at Central Station by two well-meaning customers and are now in the care of a NSW Trainlink employee,' a Sydney Trains statement said.\n'We'd like to thank our customers for handing the birds in and remind anyone who experiences a similar situation to notify station staff.\n'The incident has been referred to police.'","url":"https://www.dailymail.co.uk/news/article-4447404/Man-dumps-chickens-Sydney-train-flees.html"}
