{"authors":["Ashleigh Davis For Daily Mail Australia"],"date_download":"2018-10-22 23:07:16","date_modify":"2018-10-22 23:07:16","date_publish":"2017-04-26 06:45:51","description":"A Victorian man has escaped paying more than $114,000 in unpaid tolls, parking fines and traffic infringements after telling the court he didn't know how the E-tag system worked.","filename":"data/vaneerConsumption/Manescapespaying114000indrivingfinesinVictoria.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9C8AED00000578-0-image-a-52_1493184337985.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446298_Man-escapes-paying-114-000-driving-fines-Victoria_1540249636.html","title":"Man escapes paying $114,000 in driving fines in Victoria","title_page":"Man escapes paying $114,000 in driving fines in Victoria | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man has avoided more than $114,000 in unpaid tolls, traffic infringements and parking fines after he told the court he was living in his car and didn't know how Victoria's E-tag system worked.\nThe Indian national from Victoria appeared in Geelong Magistrates Court on Wednesday, reported SBS Punjabi.\nThe court quashed the unpaid fees and administrative costs after hearing an application for consideration of special circumstances under the Infringements Act.\nA man has avoided more than $114,000 in unpaid tolls, traffic infringements and parking fines after he told the court he was living in his car and didn't know how the E-tag system worked\nThe man's lawyer Bernie Balmer told the court his client had accumulated the fines between 2012 and 2013.\nMr Balmer said his client was living in a car and therefore couldn't receive infringement letters from authorities during this time.\nMr Balmer also said two-thirds of the amount owed were administrative charges adding up to what he described as an 'insurmountable amount'.\nHe added that his client did not know how the E-tag system worked, saying in India people physically paid the toll at booths.\nThe Geelong Magistrates Court quashed the the unpaid fees and administrative costs after hearing an application for consideration of special circumstances under the Infringements Act\nMr Balmer said his client's parents had stopped supporting him, and he had lost his license due to demerit points and this affected his ability to work.\nThe Australian Road Safety Foundation told Nine News the case set a bad example for drivers new to Australia's roads.\nCityLink told Nine News they were unable to comment on individual cases, but said they offer 'first-time forgiveness and hardship programs.'","url":"https://www.dailymail.co.uk/news/article-4446298/Man-escapes-paying-114-000-driving-fines-Victoria.html"}
