{"authors":[],"date_download":"2018-10-30 20:20:46","date_modify":"2018-10-30 20:20:46","date_publish":"2015-12-08 11:05:14","description":"Homicide detectives are trying to determine who shot and killed a 23-year-old southwest Atlanta man late Monday, then took the victim’s car and possibly his dog.","filename":"data/vaneerConsumption/ManfatallyshotdogandcarmissingfromSWAtlantahome.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/08/Images/photos.medleyphoto.8469720.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_man-fatally_36436cb5baa37c39d8ab735c61a1166b__1540930846.html","title":"Man fatally shot, dog and car missing from SW Atlanta home","title_page":"Man fatally shot, dog and car missing from SW Atlanta home","title_rss":"NULL","source_domain":"ajc.com","text":"Homicide detectives are trying to determine who shot and killed a 23-year-old southwest Atlanta man late Monday, then took the victim’s car and possibly his dog.\nThe shooting happened at a home in the 1000 block of Allegheny Street, in a neighborhood off Cascade Avenue.\nThe victim’s roommate returned home just before midnight to find the man, identified by the Fulton County Medical Examiner’s Office as Quintavius Waters, face down on a bed, according to Channel 2 Action News.\n“After checking him out,” Atlanta police Major Adam Lee III told Channel 2, “it appeared he suffered a gunshot wound to the head.”\nDetectives found no sign of forced entry into the home.\n“Whoever did this,” Lee said, “apparently they were invited in or they knew the subject.”\nChannel 2 reported Waters’ Yorkshire terrier was missing, along with his black 2001 Ford Mustang convertible with Alabama tag 3AG5624.\nWaters’ friend, Toboris Character, told The Atlanta Journal-Constitution that Waters worked as a security guard at Club Lacura on Metropolitan Parkway and for the Atlanta rapper known as Young Thug. Character said he had previously warned Waters about bringing strangers into his home.\n“When I first met him, he was so welcoming, letting me into his home,” Character said. “And I told him, ‘You can’t do that in Atlanta.’ I guess he did that to someone else, to the wrong person.”\nCharacter last heard from Waters around 6 p.m. when his friend called to ask if he wanted to go the mall, Character said. Character said he had music rehearsal at his church Monday night and couldn’t go to the mall.\nThrough Facebook, Character said he found out Waters had died, though he didn’t want to believe it.\n“I tried to call his phone and it went straight to voice mail,” Character said. “I rolled by his house, and that’s when I saw the news truck.”\nThe shooting remained under investigation late Tuesday.","url":"https://www.ajc.com/news/crime--law/man-fatally-shot-dog-and-car-missing-from-atlanta-home/LDgjb4D5AqcBldnOHHMIGM/"}
