{"authors":[],"date_download":"2018-10-30 18:34:33","date_modify":"2018-10-30 18:34:33","date_publish":"2016-10-03 22:20:00","description":"Authorities are searching for a man who was convicted of murder Monday in DeKalb County and didn't return to hear the verdict.","filename":"data/vaneerConsumption/Manfleescourthousebeforehearinghesguiltyofmurder.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/03/Images/dekalb-guy.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_man-flees-courthouse-before-hearing-guilty-murder__1540924473.html","title":"Man flees courthouse before hearing he's guilty of murder","title_page":"Man flees courthouse before hearing he's guilty of murder","title_rss":"NULL","source_domain":"ajc.com","text":"Authorities are searching for a man who was convicted of murder Monday in DeKalb County and didn't return to hear the verdict.\nTaiquan Mitchell, 24, of Atlanta, had been out on $125,000 bond in connection with the January 2014 death of Marcus Beanite Waters, 29, according to jail records. When the jury returned its verdict Monday, Mitchell was gone, said Marcus Garner, spokesman for the district attorney's office.\n\"He was found guilty of all charges, but as of now he’s a fugitive,\" Garner told The Atlanta Journal-Constitution at 6 p.m.\nMitchell was granted bond on May 7, 2014, by Judge Asha F. Jackson, according to court records. The judge ordered the bond with the condition that the murder suspect wear an ankle monitor and be on house arrest with a 7 a.m. to 7 p.m. curfew.\n>Related: As gang killings persist, feds grant $500k to help DeKalb\n>Related: Cops: Woman kidnapped from DeKalb Bojangles' and raped\nIt wasn’t immediately clear if the ankle monitor was still active Monday night. A spokeswoman for the sheriff’s office, which seeks fugitives in the county, said she couldn’t comment on the case.\nCo-defendant Deon Dorsey was also granted bond but never posted it and has remained in the county jail, according to records.\nBoth defendants were found guilty of various charges, including murder, aggravated assault, possession of a firearm in the commission of a felony and armed robbery, Garner said.\nWaters was found naked in an apartment off I-285 at 130 Carteret Place, with the door apparently kicked in by the two men.\nEfforts to reach Mitchell’s attorney weren’t immediately successful.\n-\nLike DeKalb County News Now on Facebook | Follow us on Twitter and Instagram","url":"https://www.ajc.com/news/local/man-flees-courthouse-before-hearing-guilty-murder/XpxW440OYHniJ4xej8feWI/"}
