{"authors":["Ekin Karasin For Mailonline"],"date_download":"2018-10-23 02:12:56","date_modify":"2018-10-23 02:12:56","date_publish":"2017-03-16 12:39:17","description":"Stuart Railton, 54, is believed to have lost his balance and plunged over the railing of the balcony, which was littered with empty beer bottles, at his apartment in Udon Thani, northern Thailand.","filename":"data/vaneerConsumption/Manfallsfromapartmentwhileurinatingfrombalcony.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E541DBB00000578-0-image-a-57_1489667498104.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320020_Man-falls-apartment-urinating-balcony_1540260776.html","title":"Man falls from apartment 'while urinating from balcony'","title_page":"Man falls from apartment 'while urinating from balcony' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Stuart Railton, 54, fell to his death from a fourth floor flat while reportedly urinating from the balcony after a night out\nA former police worker plummeted to his death from a fourth floor flat while reportedly urinating from the balcony after a night out.\nStuart Railton, 54, returned to his apartment after visiting his favourite karaoke bar in Udon Thani, northern Thailand, in the early hours of Wednesday morning.\nThe former accountant for the Lancashire Constabulary is believed to have lost his balance while trying to urinate and plunged over the railing of the balcony, which was littered with empty beer bottles. .\nSecurity guards at the 'Top Mansion' apartment block heard a loud thud after he plunged from his room. His body was found at 4.45am local time.\nPolice searched the room and discovered empty beer bottles, two bottles of 'unknown medicine' and a pool of urine on the balcony.\nSecurity guard Pichit Burawad, 44, said: 'We heard a loud noise and thought a signboard had fallen off.\n'On the ground of the parking area, we found the body of a foreigner.'\nForensic officers found Stuart in a pool of blood while police who checked the room said there was no sign of a struggle.\nThey said he suffered a fractured skull, neck, and left arm.\nMr Railton had moved to the country a year ago after leaving Lancashire Constabulary, according to his Linkedin profile\nHe had returned to his apartment after visiting his favourite karaoke bar in Udon Thani, northern Thailand, in the early hours of Wednesday morning (pictured, the balcony he fell from)\nPol Lt Ginyotin Sapsin, from Mueang Udon Thani Provincial Police Station, said that they had questioned staff who told them that Stuart regularly visited the karaoke bar.\nPol Lt Ginyotin Sapsin, from Mueang Udon Thani Provincial Police Station, said that they had questioned staff who told them that Stuart regularly visited the karaoke bar.\nHe added: 'On the day of the incident, Mr Railton came back alone from the bar at around 03:20 and went up to his room as usual.\n'We inspected room 420 on the fourth floor where Mr Railton had been staying.\n'We believe that the deceased was drunk and fell while he was urinating on or from the balcony.'\nPolice (pictured) searched the room and discovered empty beer bottles, two bottles of 'unknown medicine' and a pool of urine on the balcony\nPol Lt Ginyotin said that two bottles of the unknown medicine collected from the fridge had been taken for examination.\nHe added: 'We're going to send the bottles to the lab to determine what kind of medicine it contains.'\nStuart describes himself as an accountant who worked in various finance departments at Lancashire Constabulary between November 1998 and December 2015.\nHe wrote on LinkedIn that he was 'seeking permanent or contract work in Thailand' and he had previously taken 'voluntary redundancy'.","url":"https://www.dailymail.co.uk/news/article-4320020/Man-falls-apartment-urinating-balcony.html"}
