{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 20:02:29","date_modify":"2018-10-30 20:02:29","date_publish":"2017-03-31 03:13:06","description":"A Florida judge sentenced a man to five years in prison for a fatal wreck that killed his wife while they had sex and he drove drunk. | Politics","filename":"data/vaneerConsumption/ManGets5YearsinPrisonforFatalDUICrashthatKilledHisWifeWhileTheyHadSex.json","image_url":"https://media.breitbart.com/media/2017/03/husband-prison-dui-Palm-Beach-County-Sheriffs-Office-Facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_03_30__1540929749.html","title":"Man Gets 5 Years in Prison for Fatal DUI Crash that Killed His Wife While They Had Sex","title_page":"Man Gets 5 Years in Prison for Fatal DUI Crash that Killed His Wife While They Had Sex","title_rss":"NULL","source_domain":"breitbart.com","text":"A Florida judge sentenced a man to five years in prison for a fatal wreck that killed his wife while they had sex and he drove drunk.\nPalm Beach County Circuit Judge Laura Johnson sentenced Matthew Notebaert, 33, Wednesday for the fatal March 8, 2014 crash, calling it one of the “most senseless, tragic acts” she had ever seen, the New York Post reported.\n“This isn’t your first chance,” Johnson told Notebaert, according to the Palm Beach Post. “You’ve been to jail before, you’ve been on probation … You failed your wife, you failed your children and you failed all your family that is here today.”\n“Notebaert told Johnson that he missed his wife “more than words can express,” as he explained through tears what happened the night of the wreck.\nHe said the couple started drinking from a flask of whisky they snuck into a country music concert and then, as they were on the way home, Notebaert pulled over and the couple started getting intimate.\nNotebaert said she was sitting on his lap at one moment and the next memory he had after a turn of the wheel was waking up next to her dead body in the couple’s Chevrolet Equinox.\nAccording to arrest reports, Amanda Notebaert’s head hit the dashboard and windshield and she died at the scene.\nThe SUV had been traveling at 55 mph in a 30 mph zone and missed three signs on the dirt road warning of a canal ahead.\nThe SUV hit the canal so hard it went airborne for 30 feet and crashed into the opposite bank of the canal.\nNeighbors at the time of the crash said it was hard to believe how the couple could have missed the signs on a dead-end street, especially when it was just a block away from their home.\n“As soon as you come down the street, you see the reflectors all the way down the street,” neighbor Noelle Zulli Adams told WPBF. “You know it’s a dead-end.”\nA toxicology report found Matthew Notebaert’s blood-alcohol level to be nearly two times the level at which Florida drivers are considered to be impaired and also found marijuana in his system.\nProsecutors felt the 10-year minimum sentence was too harsh and recommended Notebaert be sentenced to seven years behind bars. Notebaert’s attorney, however, asked for probation so his client could be with his 12-year-old son and three-year-old daughter.\nJohnson noted Notebaert’s previous criminal history—that included charges of cocaine possession, burglary, grand theft, and reckless driving and leaving the scene of a crash—before making her decision.","url":"https://www.breitbart.com/politics/2017/03/30/man-gets-5-years-in-prison-for-fatal-dui-crash-that-killed-his-wife-while-they-had-sex/"}
