{"authors":["Wolf Richter","Wolf Street"],"date_download":"2018-10-31 00:17:51","date_modify":"2018-10-31 00:17:51","date_publish":"2018-07-11 00:00:00","description":"Manhattan office property sales fell by more than a quarter this spring — partly because of a lack of mega-deals from big companies and Chinese conglomerates. Meanwhile, there is plenty of new supply is coming on the market.","filename":"data/vaneerConsumption/Manhattansofficebuildingbubbleisofficiallydeflating.json","image_url":"https://amp.businessinsider.com/images/5ab2a7495bd8b81a008b46e7-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_manhattans-office-building-bubble-is-officially-deflating-2018-7_1540945071.html","title":"Manhattan's office-building bubble is officially deflating","title_page":"    Manhattan's office-building bubble is officially deflating - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"In the second quarter, sales of large office properties in Manhattan fell 26% from the same period a year ago. It was the worst Q2 dollar volume in years:\nWolf Street\nLast year's Q2 sales - as weak as they'd been - were propped up by the last-hurrah-deal undertaken by a Chinese conglomerate. The $2.2-billion sale of 245 Park Avenue to HNA Group was the sixth largest transaction in Manhattan ever. HNA paid $1,282 per square foot for the tower, which was called \"among the highest price-per-pound for this type of asset.\" It was the last big Chinese property purchase in Manhattan.\nThis year, Q1 was propped up by the $2.4-billion sale of Chelsea Market to Google. The deal accounted for over half the total transaction volume in the quarter. The price was a blistering $2,181 per square foot.\n\"What brought the sales volume down in Q2 was the absence of the high-profile, billion-dollar office deals we've become accustomed to in this thriving market,\" CommercialCafé, a division of Yardi, said in its report. All Q2 had to show for as its largest office deal was the sale of 5 Bryant Park for $640 million.\nWith 10 small-ish office deals, no mega-deals from Google and Chinese conglomerates, the quarter was a \"disappointment,\" according to CommercialCafé:\nWolf Street\nThe price Google had forked over for its trophy building in Q1 ($2,181 per square foot) pushed the average price to a record $1,266 per square foot. But in Q2, the average price fell 16% from a year ago to $867 per square foot, near the lower portion of the range of the past few years:\nWolf Street\nSo volume has collapsed. But prices aren't exactly crashing. There are no forced sales. Everything is slow and orderly. Hope prevails. And the rationalizing has begun.\n\"Over the past two years, office sales activity in Manhattan has slowed to a more sustainable level, finally coming down from the highs of 2014 and 2015,\" CommercialCafé said.\nMeanwhile, everyone is patiently waiting for the next Google to come along, now that the Chinese conglomerates with their murky structure and unlimited funds and their thirst for overpriced trophy projects have been sidelined by unfortunate events - including China's crackdown on capital flight, a state take-over of some of the conglomerates including long prison sentences for some of the executives, and a blanket prohibition last summer on squandering capital on acquiring commercial real estate, such as office buildings and hotels, in foreign countries.\nCommercialCafé used Yardi Matrix data to analyze all Manhattan office transactions recorded through July 2, 2018, of $5 million or more, and larger than 50,000 square feet. In the case of mixed-use properties, only those with over 50% office space were taken into account.\nThe largest deal in Q2 was the sale of 5 Bryant Park to Savanna for $640 million, by Blackstone and Brookfield Properties, which had acquired the 34-story tower in 2006 as part of a larger deal involving numerous properties across the US.\nThere was a foreign buyer - but not the kind Manhattan's office sector has been praying for. It involved the fourth largest deal in Q2. Germany's second largest bank, Commerzbank, in which the German government still holds a 15% stake as a result of its bailout, paid $333 million for the 400,000-square-foot tower at 222 E. 41st St. The building is leased entirely to NYU Langone Medical Center. The seller was Columbia Property Trust.\nAnd plenty of new supply is coming on the market. In Q1, three properties totaling 1 million square feet were delivered. In Q2, 3 World Trade Center, an 80-story tower with 2.8 million square feet was delivered. While some high-profile companies have leased some space, including McKinsey Group, according to Yardi Matrix data, 1.5 million square feet of office space remain available.\nFor the remainder of the year, 4.7 million square feet of office space are scheduled to be delivered, including 55 Hudson Yards, a 1.4 million-square-foot 51-story tower.\nNow if we could just get our Chinese conglomerates back! They were so much fun!","url":"https://www.businessinsider.com/manhattans-office-building-bubble-is-officially-deflating-2018-7"}
