{"authors":["Meenal Vamburkar","The Real Deal"],"date_download":"2018-10-30 23:05:02","date_modify":"2018-10-30 23:05:02","date_publish":"2018-07-24 00:00:00","description":"Units in Manhattan that are priced below $1 million are rising, and inventory jumped by more than 25% in June from a year earlier. As units pile up, prices have dropped and could leave options for buyers across the board.","filename":"data/vaneerConsumption/Manhattanisnowabuyersmarketatallpricepoints.json","image_url":"https://amp.businessinsider.com/images/5b57713a85c74f32008b4616-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_manhattan-is-now-a-buyers-market-at-all-price-points-2018-7_1540940702.html","title":"Manhattan is now a buyer's market at all price points","title_page":"    Manhattan is now a buyer's market at all price points - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Shutterstock/turtix\nEven the cheap apartments aren't selling.\nIn Manhattan, units priced below $1 million are piling up, according to a study by StreetEasy. Inventory climbed 27 percent in June from a year earlier — to the highest level for the month since 2013, the website found.\nIt's essentially a buyers' market across the board, and the total number of available homes in Manhattan is at the highest for the month since 2011. In Brooklyn and Queens, total inventory for June was the most since 2008.\n\"There are a lot of options out there, so be picky,\" Grant Long, senior economist for StreetEasy, told Bloomberg. \"The power is in your hands to negotiate.\"\nIn September, listings are expected to see another surge as sellers come off the summer slowdown, Long said. If some of the supply isn't cleared out before then, prices will fall, he told Bloomberg.\nIn the second quarter, Manhattan sales saw a third consecutive decline. As units pile up, condominium developers have been ramping up discounts and incentives. This month, Toll Brothers is holding a nationwide sales event in an attempt to boost sales. And Extell Development has offered price cuts and perks on sponsor units at One57. [Bloomberg]— Meenal Vamburkar","url":"https://www.businessinsider.com/manhattan-is-now-a-buyers-market-at-all-price-points-2018-7"}
