{"authors":["Herbert Lash"],"date_download":"2018-10-30 22:16:42","date_modify":"2018-10-30 22:16:42","date_publish":"2016-12-14 00:00:00","description":"Prices were pushed higher by a jump in sales of condominiums valued at $10 million or more.","filename":"data/vaneerConsumption/Manhattanapartmentsalespricesareskyrocketing.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_manhattan-apartment-sales-prices-are-skyrocketing-2016-12_1540937802.html","title":"Manhattan apartment sales prices are skyrocketing","title_page":"    Manhattan apartment sales prices are skyrocketing - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A view of the Brooklyn Bridge and DUMBO neighborhood on June 24, 2016 in the Brooklyn borough of New York City. Drew Angerer/Getty Images The average sales price of an apartment in Manhattan is expected to top $2 million this year for the first time, but prices are seen leveling off in 2017 after nearly doubling over the past decade.\nPrices were pushed higher by a jump in sales of condominiums valued at $10 million or more, which skewed results, CityRealty, a real estate listings and data website for New York City, said on Wednesday.\nThe opening of 432 Park Avenue, a 96-story tower marketed by developers as the tallest residential building in the Americas, had an outsized effect on prices, said CityRealty research director Gabby Warshawer.\nFifty-two of the 75 units sold at the tower overlooking Central Park fetched more than $10 million, she said. Some units are priced at more than $40 million.\nAn increase in new developments and a rise in the price of existing units also lifted the market, Warshawer said.\nPrices have climbed every year since 2011 but are expected to flatline next year. A lack of expensive, large new buildings will act to keep prices in check in 2017, CityRealty said.\nThe potential impact on sales and prices of the recent rise in mortgage rates was not analyzed, Warshawer said.\nMortgage rates have shot up since the Nov. 8 U.S. election as interest rates have climbed broadly on expectations of faster economic growth and accelerating inflation under stimulus programs President-elect Donald Trump wants to enact.\nThe interest rate for a 30-year fixed-rate mortgage now averages 4.27 percent, a two-year high, according to the Mortgage Bankers Association, up from about 3.60 percent in the weeks before the election.\nDrew Angerer/Getty\nCityRealty examined sales registrations from New York City's Department of Finance. Much of Harlem and nearby areas were excluded because it is a small piece of the market and affordable housing data is more difficult to glean, she said.\nDecember 2016 sales were extrapolated based on the year's data through Nov. 30.\nThe average co-op and condo price in Manhattan excluding Harlem and nearby areas rose to $2.2 million in 2016 from a record $1.9 million the year before, CityRealty estimated. For all of Manhattan, the average sales price was $2.1 million.\nA condo is owned directly, but the buyer of a co-op obtains shares in a corporation that owns the building.\nThe median price for apartments, or the middle of all sales considered, also set a record at $1.2 million, up from $1.1 million last year, in the area examined.\nA decade ago, the price of new condo units was almost the same as existing ones, but prices at new developments since 2008 have outpaced those of existing ones.\nThe average price for an apartment in the area of Manhattan examined was 91 percent higher than in 2006, CityRealty said.\n(Editing by Peter Cooney)","url":"https://www.businessinsider.com/manhattan-apartment-sales-prices-are-skyrocketing-2016-12"}
