{"authors":[],"date_download":"2018-10-30 14:07:43","date_modify":"2018-10-30 14:07:43","date_publish":"2018-10-30 02:00:00","description":"Snellville police said a father was driving down Scenic Highway with his three-month-old daughter on...","filename":"data/vaneerConsumption/Manhidinfantdaughteroncarfloorontopofstolenhandgun.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/10/29/Videos/4518527.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_cops-man-hi_e26d4dd056ebc09fafc065b8d02f3c51__1540908463.html","title":"Man hid infant daughter on car floor on top of stolen handgun","title_page":"Cops: Man hid infant daughter on car floor on top of stolen handgun","title_rss":"NULL","source_domain":"ajc.com","text":"Snellville police said a father was driving down Scenic Highway with his three-month-old daughter on his lap, and when he was pulled over, officers said what they found in his car was much more troubling.\nDetavis Madison, 24, of Conyers, allegedly put his infant down on the floor of his car during the traffic stop and told officers there wasn’t anyone else in the vehicle, Channel 2 Action News reported.\nHowever, when police looked through his car, found her and lifted her up, the officers said they found a stolen handgun beneath the baby, Channel 2 reported.\nThis is what Snellville Police say officers found UNDER a baby in a car . The gun was reported stolen out of Atlanta. I’m tracking down some of the weapon’s history and what else SPD says they found in the car .At 6:20 . @wsbtv #Gwinnettcounty pic.twitter.com/8CFwSijg8x — Tony Thomas (@TonyThomasWSB) October 29, 2018\nWhen they continued their search, they allegedly found marijuana and at least 500 ecstasy pills in the shape of Lego characters, the news station reported.\n“This is obviously a dangerous situation for that baby on many fronts,” Snellville police Lt. John Tainter told Channel 2. “We are just glad it turned out for the best.”\nSnellville Police say underneath the infant found on the floorboard of a car —- was a stolen handgun. Details on what else they found at 5:15 @wsbtv #gwinnettcounty pic.twitter.com/7ix0NRzKvX — Tony Thomas (@TonyThomasWSB) October 29, 2018\nPolice told the news station the infant was given to her mother after her father was taken to jail where he remains without bond.\nMadison faces 10 charges, including felony theft, possession of a firearm during the commission of a felony, felony drug charges and transporting a child in a passenger vehicle, Gwinnett County Jail records show.\nIn other news:","url":"https://www.ajc.com/news/crime--law/cops-man-hid-infant-daughter-car-floor-top-stolen-handgun-gwinnett/xdvKKpIEnvyeiK4MZyA4VK/"}
