{"authors":[],"date_download":"2018-10-30 17:56:43","date_modify":"2018-10-30 17:56:43","date_publish":"2018-06-26 21:29:00","description":"A man got onto the tarmac at Hartsfield-Jackson International Airport on Tuesday, authorities confir...","filename":"data/vaneerConsumption/ManincustodyaftergettingontoHartsfieldJacksontarmac.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/06/27/Videos/4425496.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_breaking-news_breaking_6c4c5f5ca0519ddfc2a73229d3dad9ef__1540922203.html","title":"Man in custody after getting onto Hartsfield-Jackson tarmac","title_page":"Man in custody after getting onto Hartsfield-Jackson tarmac","title_rss":"NULL","source_domain":"ajc.com","text":"A man got onto the tarmac at Hartsfield-Jackson International Airport on Tuesday, authorities confirmed, and approached a Delta Air Lines flight from Miami that had just landed.\nJhryin Jones, 19, scaled a fence at the airport and ran onto an active taxiway, Atlanta police spokeswoman Stephanie Brown said.\nHe then approached the aircraft, jumped on the wing and began to pound on the windows, she said.\nMan in custody after getting access to tarmac at Atlanta airport, authorities say: https://t.co/tjSonV968h pic.twitter.com/aIiKOi6BIi — WSB-TV (@wsbtv) June 26, 2018\nVideo obtained by Channel 2 Action News appears to show the man approaching the aircraft while wearing only underwear.\n#ItsTimeToFreakOutWhen a dude tries to board the plane from the outside after landing. #atlairport pic.twitter.com/AKLIn0FYrz — Garth Magness (@GarthMagness) June 26, 2018\nThe incident happened on the taxiway shortly before 5 p.m., the airport tweeted. The man was taken into custody by Atlanta police.\nJones was charged with criminal trespassing, public indecency and obstruction of law enforcement officers, Brown said.\nThe airport initially tweeted that someone “exited an aircraft stopped on a taxiway after arrival.” They later backed off that narrative.\nThere are conflicting reports as to how the male apprehended on the airfield accessed the airfield. He is currently in custody....1/2 — Atlanta Airport (@ATLairport) June 26, 2018\nThe airport said operations were not impacted by the incident.\n....2/2. There is no impact to operations at this time. — Atlanta Airport (@ATLairport) June 26, 2018\nAn investigation is ongoing.","url":"https://www.ajc.com/news/breaking-news/breaking-passenger-jumps-out-plane-onto-hartsfield-jackson-tarmac/ZHkGQ6MK5KfyLk1QQ7kN5J/"}
