{"authors":["Kiri Blakeley For Dailymail.Com"],"date_download":"2018-10-22 22:13:46","date_modify":"2018-10-22 22:13:46","date_publish":"2017-03-16 02:51:37","description":"Tyler Ray Price, 21, of West Virginia was charged with second degree sexual assault Monday after he allegedly admitted to sexually assaulting a woman during his cop job interview.","filename":"data/vaneerConsumption/Maninterviewingtobecomecopadmitssexualassault.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/04/3E50DBE000000578-0-image-a-40_1489637388199.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318728_Man-interviewing-cop-admits-sexual-assault_1540246426.html","title":"Man interviewing to become cop 'admits sexual assault'","title_page":"Man interviewing to become cop 'admits sexual assault' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tyler Ray Price, 21, allegedly admitted to sexually assaulting a woman while he was having a job interview to be a police officer\nA would-be cop has been charged with sexual assault after he allegedly admitted raping a drunk woman while she was passed out during his interview to become a police officer.\nTyler Ray Price, 21, of Nitro, West Virginia, was at the South Charleston Police Department on February 8 participating in the third phase of his interviews to become a cop.\nThat's when he said he'd had a sexual encounter with a woman and then videotaped her while she was naked and unconscious, police say.\nReports suggest, Price told Sgt. A.R. Gordon during the course of the final interview that he had sex with the woman without her consent.\nIt is not known what line of questioning the interview had taken that caused Price to reveal his alleged crime.\nPolice spoke to the woman on February 23 who said she had no knowledge of having sex or being videotaped with Price, but admitted having had a lot to drink that night.\nShe said on February 8, Price called her and also admitted the incident.\n'We knew we had to do something, we couldn't just let this go,' South Charleston Chief of Detectives Pat Rader told WCHS.\nVideo courtesy of WCHS\nTyler Ray Price, above, was arrested two weeks after a job interview to be a police officer in which he allegedly admitted committing sexual assault\nPrice was on his third interview for the South Charleston Police when 'it all went bad'\nRader said the interviews were going fine up until the third one when 'it all went bad.'\nOn Monday, Price was charged with second degree sexual assault.\nPart of the interview process is asking questions while the candidate is hooked up to a lie detector machine.\nIt's unclear if this is when Price allegedly admitted the assault.\nThe department says it's been hard to find qualified candidates, but in this case its tough vetting process worked.\n'We're not just hiring people off the street and giving them a badge and a gun and the authority to relieve people of their freedoms,' said Rader.\n'We want to make sure we're getting the best people possible.'\nPrice is currently being held at South Central Regional Jail on a $25,000 bond. If convicted, he faces up to 25 years.","url":"https://www.dailymail.co.uk/news/article-4318728/Man-interviewing-cop-admits-sexual-assault.html"}
