{"authors":[],"date_download":"2018-10-22 22:51:56","date_modify":"2018-10-22 22:51:56","date_publish":"2014-05-12 21:49:05","description":"Ioane Teitiota argues that he should be granted asylum because his homeland is threatened by rising waters caused by global warming.","filename":"data/vaneerConsumption/ManLosesBidinNewZealandtoBecomeFirstClimateChangeRefugee.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/438011/140513-kirbati-430a_3ed35fe0283bb8bd2a7c60c4aee19ef6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_man-loses-bid-new-zealand-become-first-climate-change-refugee-n103606_1540248716.html","title":"Man Loses Bid in New Zealand to Become First 'Climate Change Refugee'","title_page":"Man Loses Bid in New Zealand to Become First 'Climate Change Refugee'","title_rss":"NULL","source_domain":"nbcnews.com","text":"“The appellant does not wish to return to Kiribati because of the difficulties they faced due to the combined pressures of over-population and sea-level rise,” the court noted.\nBut the appeal court said Teitiota’s arguments do not fall within the definition of a refugee as spelled out in the 1951 Refugee Convention adopted by the United Nations. That convention was meant to protect people who didn’t want to return to their country for fear being persecuted because of race, religion, nationality, membership of a particular social group or political opinion.\nThe ruling paves the way for Teitiota and his family to be deported.\n“Although the Court has every sympathy with the people of Kiribati, Mr. Teitiota’s claim for recognition as a refugee is fundamentally misconceived. It attempts to stand the Convention on its head,” the Court of Appeal ruling said.\nBut the court also expressed compassion for the plight of people whose lives are uprooted by climate change:\n“No one should read this judgment as downplaying the importance of climate change. It is a major and growing concern for the international community. The point this judgment makes is that climate change and its effect on countries like Kiribati is not appropriately addressed under the Refugee Convention.”\nTeitiota’s lawyer, Michael Kidd, did not immediately respond to an email from NBC News for comment on Monday. He was quoted by Radio Australia as saying Teitiota and his family want to stay in New Zealand and may still continue their fight.","url":"https://www.nbcnews.com/science/environment/man-loses-bid-new-zealand-become-first-climate-change-refugee-n103606"}
