{"authors":["John Pye","Associated Press"],"date_download":"2018-10-23 00:27:49","date_modify":"2018-10-23 00:27:49","date_publish":"2017-04-26 10:06:50","description":"The 38-year-old from the Philippines may not have fought in front of a bigger crowd than what promoters are predicting for Pacquiao's 'Battle of Brisbane' on July 2 against Jeff Horn.","filename":"data/vaneerConsumption/MannyPacquiaowontunderestimateJeffHorn.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9CDF8F00000578-0-image-a-22_1493197532143.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_boxing_article-4446800_Manny-Pacquiao-won-t-Jeff-Horn-lightly-title-bout_1540254469.html","title":"Manny Pacquiao 'won't underestimate' Jeff Horn","title_page":"Manny Pacquiao 'won't underestimate' Jeff Horn | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manny Pacquiao has had bigger, more significant fights while compiling world titles in an unprecedented eight divisions.\nThe 38-year-old senator from the Philippines may not have fought in front of a bigger crowd, though, than what promoters are predicting for Pacquiao's 'Battle of Brisbane' on July 2 against Jeff Horn.\nThe on-again-off-again fight was confirmed after a rich deal for a Pacquiao-Amir Khan bout in the Middle East fell through.\nManny Pacquiao is preparing to face Jeff Horn for WBO welterweight title in Brisbane on July 2\nPac-Man insists he is not taking his opponent lightly, despite boasting a record of 59-6-2\nMANNY PACQUIAO Age: 38 Fights: 67 Wins: 59 Draws: 2 Losses: 6 KO percentage: 57 Height/Reach: 5ft 5.5in/67in\nJEFF HORN Age: 29 Fights: 17 Wins: 16 Draws: 0 Losses: 1 KO percentage: 65 Height/Reach: 5ft 9in/68in\nPacquiao and Horn met for the first time on Wednesday at the venue where local promoters are expecting a crowd of 55,000 for the WBO welterweight world title bout.\nThat, at least according to veteran American promotor Bob Arum, would beat Pacquiao's biggest live crowd to date - 50,994 at Cowboys Stadium in Texas.\nSuncorp Stadium, usually the home ground for the Brisbane Broncos in Australia's National Rugby League and the annual State of Origin rugby league grudge match, has witnessed plenty of brawls, but none of them sanctioned like this one.\nPacquiao is putting his WBO title on the line against Horn, a trained teacher who took up boxing because he was bullied at high school, had his first professional bout in 2013, and is 16-0-1.\nPacquiao and Horn met for the first time Wednesday Suncorp Stadium, where they will fight\n'Inside my heart, I have confidence to win the fight, but I'm not taking it lightly,' said Pacquiao\nPacquiao has fought twice since his loss to Floyd Mayweather in Las Vegas in Aprial 2015\n'If you ask inside my heart, I have confidence to win the fight, but I'm not taking it lightly,' said Pacquiao, who has 11 major world titles and has a record of 59-6-2, with 38 knockouts. 'I'm not underestimating him.'\nSince losing to Floyd Mayweather in Las Vegas in April 2015, a fight which generated a world record 4.4 million pay-per-view buys, Pacquiao has had two fights - wins over Tim Bradley and Jessie Vargas on either side of a brief retirement.\nThe win over Vargas in November earned Pacquiao his third reign as the WBO welterweight champion.\nHorn is a trained school teacher who began boxing because he was bullied in high school\nThe 38-year-old claims he will 'throw a lot of punches' which will hamper Horn's style\nWhen Pacquiao arrived in Australia, he said he didn't know a lot about Horn, but knew the 29-year-old Australian had the kind of style that would make for an entertaining fight.\n'I want an opponent that wants to fight toe-to-toe, throwing a lot of punches, aggressive,' Pacquiao said. 'My style is to throw a lot of punches and I believe that will be very effective for Jeff Horn's style. That's why I accepted this fight.\nArum, who sat beside Pacquiao at the news conference Wednesday and first saw Horn fight in New Zealand last November, compared the bout with a young lion lying in wait to challenge on old one.\nPacquiao claimed the WBO welterweight title after defeating Jessie Vargas last November\nHorn is undefeated in his 17 bouts so far, with a record of 16-0-1 since his debut in 2013\n'This fight certainly has that theme,' he said.\nThe packed news conference was a new experience for Horn, who says he's raw compared with Pacquiao but raring to go.\n'He's done so much. He's fought a lot of champions,' Horn said. But, 'If he underestimates me, he's going to know about it July 2. It's going to be a very tough fight - he's going to see that.'","url":"https://www.dailymail.co.uk/sport/boxing/article-4446800/Manny-Pacquiao-won-t-Jeff-Horn-lightly-title-bout.html"}
