{"authors":["Associated Press"],"date_download":"2018-10-22 20:41:39","date_modify":"2018-10-22 20:41:39","date_publish":"2016-01-29 02:58:35","description":"ENGLEWOOD, Colorado (AP) — What's whispered into Bill Belichick's ear stays in Bill Belichick's ear. Peyton Manning may have told him, \"This might be my last...","filename":"data/vaneerConsumption/ManningwontshareretirementplansoneveofSuperBowl.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:1459a7e3cea34d7b90a881a85f0a136e-4PuZeKVXE7cd9005b2c8763c9d3d-275_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422129_Manning-wont-share-retirement-plans-eve-Super-Bowl_1540240899.html","title":"Manning won't share retirement plans on eve of Super Bowl","title_page":"Manning won't share retirement plans on eve of Super Bowl | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manning won't share retirement plans on eve of Super Bowl\nENGLEWOOD, Colorado (AP) — What's whispered into Bill Belichick's ear stays in Bill Belichick's ear.\nPeyton Manning may have told him, \"This might be my last rodeo,\" but he's not telling anyone else anything about his thoughts on retirement.\nNFL Network cameras caught an intriguing exchange between Denver's quarterback and New England's coach after Denver's 20-18 win over the Patriots in the AFC championship game on Sunday.\nDenver Broncos quarterback Peyton Manning jokes with reporters after an NFL football practice at the team's headquarters, Thursday, Jan. 28, 2016, in Englewood, Colo. The Broncos are preparing to face the Carolina Panthers in Super Bowl 50 on Sunday, Feb. 7. (AP Photo/David Zalubowski)\nManning didn't want to talk about the eavesdropped exchange.\nHe joked, \"I don't know if it's been confirmed or not, you know? What happened to private conversations on the 50-yard line? I guess they just don't exist anymore. So, no confirmation on that whatsoever. ... We're on to Carolina.\"\nThe Broncos (14-4) face the Panthers (17-1) in Super Bowl 50 on Feb. 7.\nWhat Manning said to Belichick is apparently more than he's told his own coach regarding his thoughts on retirement as this 18th and very trying season comes to a conclusion.\n\"He hasn't said anything to me,\" Gary Kubiak said. \"I know he's enjoying the playoffs and enjoying this opportunity with this football team. I can't speak for him. He'll have to answer those questions. But I know it's special to have him back in the huddle leading the way and I'm just very proud of his work getting back to be in this position.\"\nManning's favorite target, receiver Demaryius Thomas, said Manning hasn't said anything to his teammates, either.\n\"Not at all. We're assuming,\" Thomas said. \"You never know with him. He hasn't said anything, so I really don't know what he's going to do.\"\n___\nAP NFL website: www.pro32.ap.org and www.twitter.com/AP_NFL\n___\nFollow AP Pro Football Writer Arnie Melendrez Stapleton on Twitter: http://twitter.com/arniestapleton\nDenver Broncos quarterback Peyton Manning takes the podium to respond to questions after an NFL football practice at the team's headquarters, Thursday, Jan. 28, 2016, in Englewood, Colo. The Broncos are preparing to face the Carolina Panthers in Super Bowl 50 on Sunday, Feb. 7. (AP Photo/David Zalubowski)\nDenver Broncos quarterback Peyton Manning looks on during an NFL football practice at the team's headquarters Thursday, Jan. 28, 2016, in Englewood, Colo. The Broncos are preparing to face the Carolina Panthers in the Super Bowl. (AP Photo/David Zalubowski)\nDenver Broncos quarterback Peyton Manning, back, looks to throw to wide receiver Andre Caldwell, front, during an NFL football practice at the team's headquarters Thursday, Jan. 28, 2016, in Englewood, Colo. The Broncos are preparing to face the Carolina Panthers in the Super Bowl. (AP Photo/David Zalubowski)","url":"https://www.dailymail.co.uk/wires/ap/article-3422129/Manning-wont-share-retirement-plans-eve-Super-Bowl.html"}
