{"authors":["Associated Press"],"date_download":"2018-10-22 21:22:52","date_modify":"2018-10-22 21:22:52","date_publish":"2016-01-11 00:44:29","description":"NEW YORK (AP) — This year's winners of the Andrew Carnegie Medal for Excellence, given annually by the American Library Association, each have strong persona...","filename":"data/vaneerConsumption/MannNguyenwinnersofCarnegiemedalsgivenbylibrarians.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:5247dd6005d6479eb8df7407df617720-3bWLCvS3pZb5eb4fce05c5de810e-453_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393154_Mann-Nguyen-winners-Carnegie-medals-given-librarians_1540243372.html","title":"Mann, Nguyen winners of Carnegie medals given by librarians","title_page":"Mann, Nguyen winners of Carnegie medals given by librarians | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mann, Nguyen winners of Carnegie medals given by librarians\nNEW YORK (AP) — This year's winners of the Andrew Carnegie Medal for Excellence, given annually by the American Library Association, each have strong personal feelings about libraries.\nViet Thanh Nguyen, winner of the fiction prize for his debut novel, \"The Sympathizer,\" told The Associated Press that a book about Vietnam he read as a boy at the local library in San Jose, California, helped inspire his future work. Photographer Sally Mann, the nonfiction winner for her memoir \"Hold Still,\" explained that her mother learned to drive so she could raise money for the library she founded in rural Virginia.\n\"She wanted to drive so she could go to these meetings and give these impassioned speeches about the importance of the library,\" Mann told the AP.\nThis book cover image provided by Little, Brown and Company shows, \"Hold Still: A Memoir With Photographs,\" by Sally Mann. Viet Thanh Nguyen's debut novel \"The Sympathizer\" and Mann's memoir \"Hold Still\" are this year's winners of the Andrew Carnegie Medals for Excellence, presented by the American Library Association. Nguyen and Mann each received $5,000, the association announced Sunday, Jan. 10, 2016. (Little, Brown and Company via AP)\nThe library association, currently gathered in Boston for its annual midwinter meeting, announced the medals Sunday evening. Nguyen and Mann each receive $5,000 for their prizes, funded by a grant from the Carnegie Corp. of New York. The four other finalists, who include Hanya Yanagihara for her novel \"A Little Life,\" each receive $1,500.\nThe Carnegie Medals were established in 2012, and previous winners include Doris Kearns Goodwin, Donna Tartt and Richard Ford.\nNguyen said his local library in San Jose was \"like a second home\" because his parents, refugees from Vietnam, were so busy running a grocery store. He remembered the library as a place he could \"challenge himself with difficult ideas,\" such as the time he read Larry Heinemann's harsh saga of an American soldier in Vietnam, \"Close Quarters.\"\n\"It left a deep imprint on me and I hated that book for many years,\" he said.\nNguyen would come to admire the novel for its candor and even-handedness, but he also sensed what the book and other famous Vietnam stories lacked: People like him, the Vietnamese. \"The Sympathizer\" is set during the end of the Vietnam War, but narrated by a spy for North Vietnam who is the son of a Vietnamese mother and French father.\n\"I wanted to refute the idea that there's only an American point of view, or only a Vietnamese point of view. I wanted to account for all views,\" he said.\nMann, known for her stark black-and-white photographs and for the portraits of her own children, said she and her family lived so far out in the country that books became \"her lifeline to the rest of the world.\" By age 13, she was not only borrowing books from the library her mother started, but also working there.\n\"I'm just sort of a library type person,\" she said. \"My mother went on to run a bookstore, which is not as pure\" because people have to pay for books.\n\"That makes this award all the sweeter.\"\nThis undated photo provided by Little, Brown and Company shows photographer and author Sally Mann on her farm in Lexington, Va. Viet Thanh Nguyen's debut novel \"The Sympathizer\" and photographer Mann's memoir \"Hold Still\" are this year's winners of the Andrew Carnegie Medals for Excellence, presented by the American Library Association. Nguyen and Mann each received $5,000, the association announced Sunday, Jan. 10, 2016. (Liz Liguori/Little, Brown and Company via AP)\nThis book cover image provided by Grove Atlantic shows, \"The Sympathizer,\" by author Viet Thanh Nguyen. Nguyen's debut novel \"The Sympathizer\" and photographer Sally Mann's memoir \"Hold Still\" are this year's winners of the Andrew Carnegie Medals for Excellence, presented by the American Library Association. Nguyen and Mann each received $5,000, the association announced Sunday, Jan. 10, 2016. (Atlantic Grove via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3393154/Mann-Nguyen-winners-Carnegie-medals-given-librarians.html"}
