{"authors":["Rachael Levy"],"date_download":"2018-10-30 22:51:13","date_modify":"2018-10-30 22:51:13","date_publish":"2016-12-12 00:00:00","description":"MANA Partners' Manoj Narang says there are pitfalls to the quant investing trend that has taken over hedge funds.","filename":"data/vaneerConsumption/ManojNarangofMANAPartnersandTradeworxonbigdata.json","image_url":"https://amp.businessinsider.com/images/5849b8f1ba6eb619268b7f7b-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mana-partners-tradeworx-manoj-narang-on-big-data-2016-12_1540939873.html","title":"Manoj Narang of MANA Partners and Tradeworx on big data","title_page":"    Manoj Narang of MANA Partners and Tradeworx on big data - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Manoj Narang. Brendan Smialowski / Getty Images Computer-driven investing has taken hold of the hedge fund world, but people are getting it wrong.\nThat's according to Manoj Narang, who is launching a hot new hedge fund, the $1 billion MANA Partners.\nQuantitative strategies use computers to parse data and make investment decisions.\n\"There is so much data out there and there are so may people now with a data science pedigree that if you take a purely data-driven approach, there are two pitfalls there,\" Narang told Business Insider in wide-ranging interview. \"The first pitfall is that other people are likely to find the same thing as you are, because everyone knows the same analytical techniques for the most part.\n\"And the other pitfall is that there's just so much data and the search space for models has such high dimension that you're likely to find strong signals in the data that are just really spurious in real life, just from overfitting to the data.\"\nThe New York firm is riding a wave of interest as hedge funds have been adding so-called alternative data to their investment analyses and hiring people who can sort through it. This kind of data includes credit card payment data to track sales trends and satellites tracking weather patterns that would affect the prices of commodities.\nThe market for this data is expected to double in the next five years. At the same time, quant funds have been attracting capital as the old guard of traditional fund managers incorporates new ways to parse the fresh data.\nThat surge in interest has the potential to create overcrowding, according to Narang, as all the models would have similar results:\n\"The whole notion of quantamental and this convergence between man and machine — it's more than just looking at next-generation data. It's not just about looking for more and more kinds of data. That's super important, and it's a key component, but most people doing that don't have a strong grounding in how markets work, or how companies work, or how market microstructure works, or about how the macroeconomy works. And so they're relegated to taking a truly data-driven approach to mine those data sets for alpha. And that's going to lead to lack of differentiation and overcrowding. There are too many people who can do that. There's no barrier to entry to do that.\"\nIn other words, settling on a quant strategy and hiring a bunch of people with doctorates isn't enough to beat the market. Investors still need to be able to understand the fundamentals behind why other investors make decisions, Narang said:\n\"The real barrier to entry is still knowledge of how markets work, how companies work, knowledge of how fundamentals work, knowledge of how macroeconomics works, knowledge of how microeconomics works. And if you can bring that knowledge to bear, you can harness that data in a more structured way, and build models that are less overcrowded, and have considerable differentiation. Also, it's more likely to work from the following fundamental perspective — which is models should only be expected to work if they properly anticipate what other people's models are going to do. To do that, you have to understand how people who are committing capital think.\"","url":"https://www.businessinsider.com/mana-partners-tradeworx-manoj-narang-on-big-data-2016-12"}
