{"authors":["Amitai Winehouse For Mailonline"],"date_download":"2018-10-23 00:59:59","date_modify":"2018-10-23 00:59:59","date_publish":"2017-03-10 08:28:25","description":"The Italian striker has hit six goals in his first four games for Southampton after a finding his opportunities limited at the Stadio San Paolo with Napoli prior to his January transfer.","filename":"data/vaneerConsumption/ManoloGabbiadinisurprisedbyfaststartatSouthampton.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3DF64E1D00000578-0-image-a-40_1489134190181.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300346_Manolo-Gabbiadini-surprised-fast-start-Southampton_1540256399.html","title":"Manolo Gabbiadini surprised by fast start at Southampton","title_page":"Manolo Gabbiadini surprised by fast start at Southampton | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manolo Gabbiadini has admitted he has been stunned by his start at Southampton after escaping Napoli in January.\nThe Italian striker has hit six goals in his first four games for Southampton after a finding his opportunities limited at the Stadio San Paolo prior to his January transfer.\nHe has been highly praised for his first few appearances in England, especially after his brace in the EFL Cup final against Manchester United, but Gabbiadini did not expect to acclimatize so rapidly.\nStriker Manolo Gabbiadini has surprised himself with his rapid start to life at Southampton\nGABBIADINI'S SOUTHAMPTON STATS Appearances - 3 | Goals - 4 Shot accuracy - 60 per cent Pass accuracy - 71 per cent *All stats from Premier League only*\n'I'll be honest, even I didn't expect a start like this,' Gabbiadini told Sky Sport Italia. 'I am in a completely different style of football and everything is different here, from the city to my team-mates. I didn't think this would happen.\n'I have to thank all my team-mates and the coach, who have been extraordinary and really helped me. The important thing is to give my all to make the fans happy.'\nEven though Gabbiadini only made 13 appearances for Napoli this season, the majority of them came out of position.\nGabbiadini thought it would take longer to adapt to the style of football in England\nGABBIADINI'S NAPOLI 2016-17 STATS Appearances - 13 | Goals - 3 Shot accuracy - 74 per cent Pass accuracy - 70 per cent *All stats from Serie A only*\nAnd the £17million-man admitted he was left feeling low after a lack of game-time in Italy.\n'I could not carry on like that,' he said. 'I finished games and came home and felt really sad, because I didn't feel that I was involved, it was a bad feeling.\n'When I left, I told myself that I had to start over and I had to prove to myself that I was still capable of playing. Waiting six months would have been really hard.'\nSouthampton's next game sees them travel to Tottenham Hotspur on March 19.","url":"https://www.dailymail.co.uk/sport/football/article-4300346/Manolo-Gabbiadini-surprised-fast-start-Southampton.html"}
