{"authors":[],"date_download":"2018-10-22 20:42:51","date_modify":"2018-10-22 20:42:51","date_publish":"2014-05-02 23:25:01","description":"The man failed to crack open the cash register, giving workers time to run him down and hit him with the pitchfork before he got away, police said.","filename":"data/vaneerConsumption/ManRobsSouthernDinerWithaPitchfork.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/417561/140502-ala-waffle-house-1838_27c298cf7f052891c015e207848b4665.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_man-robs-southern-diner-pitchfork-n96151_1540240971.html","title":"Man Robs Southern Diner -- With a Pitchfork","title_page":"Man Robs Southern Diner -- With a Pitchfork","title_rss":"NULL","source_domain":"nbcnews.com","text":"(For the uninitiated, Waffle Houses are 24-hour diners that are ubiquitous across the Southeast. Finding separate Waffle Houses at all four ramps onto or off the same interstate exit isn't unusual — that's the sign you're not in Kansas anymore.)\n\"The suspect was armed with a pitchfork,\" Norcross Police Chief Warren Summers said matter-of-factly Friday. Security camera video confirms that, indeed, the robber was armed with a pitchfork — a wood-handled pitchfork with three metal prongs.\nThe man \"herded the employees into the stockroom with the pitchfork\" and tried to open the cash register, Summers said, but he wasn't able to crack it open, \"so he picked up the cash register and left with it.\"\nA police statement briskly relates what happened next, beginning with the two employees who ran out of the stockroom to follow the man.\nOnce outside, the man tripped and dropped the pitchfork. One of the employees picked it up and chased him first into a drugstore and then back outside to where he'd parked a white getaway van.\nThereupon ensued a fight, during which \"the suspect was struck with the pitchfork by one of the employees,\" according to the statement. He made it into the van, and as he was driving away, \"the rear window was broken out by one of the employees.\"\nBut Pitchfork Bubba wasn't out of the woods yet.\nAs he sped away, a police officer saw the van make a U-turn on Jimmy Carter Boulevard. That kicked off a pursuit, during which the robber drove off the roadway and got away. The van was found abandoned on a nearby street, with its back window blown out and glass shards littering the driver's seat.\nSummers said Friday that Jeffery Willard Wooten, 50, was being sought on an armed robbery warrant. He's described as a white male, 5 feet, 9 inches tall, with a brown buzz cut and mustache, a scraggly beard and hazel eyes.\nSummers said Wooten would likely be easy to spot: He'll have unusual injuries to his face and the back of his head.","url":"https://www.nbcnews.com/news/us-news/man-robs-southern-diner-pitchfork-n96151"}
