{"authors":["Anthony Joseph For Mailonline"],"date_download":"2018-10-23 00:52:14","date_modify":"2018-10-23 00:52:14","date_publish":"2017-04-26 10:56:17","description":"Jay Oxenham (pictured), 46, from Berkshire, caught the enormous porbeagle, which is related to the deadly Great White, one mile from shore.","filename":"data/vaneerConsumption/Manreelsinamonster450lbSHARKinCornwall.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9D6A1E00000578-0-image-a-20_1493200556449.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446994_Man-reels-monster-450lb-SHARK-Cornwall_1540255934.html","title":"Man reels in a monster 450lb SHARK in Cornwall","title_page":"Man reels in a monster 450lb SHARK in Cornwall | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Frank Sinatra impersonator stared down the 'pearly white' teeth of a monster 450lb shark he reeled in off the coast of Cornwall.\nJay Oxenham, 46, from Berkshire, caught the enormous porbeagle, which is related to the deadly Great White, one mile from shore.\nProfessional swing singer, Mr Oxenham, spent almost two hours tussling with the gigantic 8ft long shark which was 'as wide as a cow' after it went for his mackerel bait.\nThe shark was far too big to lift on board the fishing boat so all he could do was bring it alongside to measure and photograph it - including the obligatory selfie - before releasing it safe and well.\nThis is the moment a Frank Sinatra impersonator stared down the 'pearly white' teeth of a monster 450lb shark he reeled in off the coast of Cornwall\nJay Oxenham, 46, from Berkshire, caught the enormous porbeagle (pictured), which is related to the deadly Great White, one mile from shore\nDescribing his monster porbeagle catch, Mr Oxenham, who performs all around Europe, said: 'I had no idea how big the porbeagle was at first but after wrestling with it for half an hour I knew it was a big fish.\n'I was fighting it for one and three quarter hours. My forearms were in agony and I was worried I was going to lose my rod. The last 15 minutes I had to put it in a harness.\n'We eventually managed to get the shark up against the boat and take some pictures.\n'We were hopping around the boat. My son John was with me and he had never seen a porbeagle before. We had to pick his jaw up off the floor.\n'It was 8ft long and as wide as a cow. We reckon it must have weighed 450lb. We were absolutely ecstatic and also so, so relieved.'\nThe skipper of the charter boat, Jerry Rogers, calculated the weight of the porbeagle at 450lbs - 32st - by using a tried and tested formula of measuring its length and girth.\nProfessional swing singer, Mr Oxenham, spent almost two hours tussling with the gigantic 8ft long shark which was 'as wide as a cow' after it went for his mackerel bait\nPictured is Jay Oxenham's son John, 13, with the shark they caught off the coast of Cornwall\nIt is one of the largest sharks ever caught in British waters and is bigger than the 28st porbeagle caught by Sam Narbett off Cornwall earlier this month.\nIt is not the first shark Mr Oxenham has snaffled while fishing off Cornwall. He has previously reeled in a 120lb blue shark and another blue weighing 80lb.\nHe added: 'I love catching sharks. They are amazing creatures and just getting them alongside the boat or in the boat is great.'\nIt was a great day for the Oxenham family as his 13 year-old son John snaffled a 170lb porbeagle on the same outing.\nBoat skipper Jerry Rogers, of Fast Cast Chartets of Falmouth, Cornwall, confirmed them size of the shark and added: 'It was a great catch.'\nIt is not the first shark Mr Oxenham has snaffled while fishing off Cornwall. He has previously reeled in a 120lb blue shark and another blue weighing 80lb.\nAlong with blue sharks, porbeagles are the most common species of shark found in British waters. Pictured is another shark they caught previously\nAlong with blue sharks, porbeagles are the most common species of shark found in British waters.\nDespite their association with the Great White - Carcharodon carcharias in Latin - they are not considered to be a threat to humans with only three recorded non-fatal attacks before.\nThe porbeagle shark - Lamna nasus in Latin - is classed by the International Union for Conservation of Nature (IUCN) as critically endangered in the north east Atlantic.\nWhen Mr Oxenham is not singing, he is out fishing. He is pictured with another shark he has caught in the past.\nMr Oxenham has sung since his childhood and was prompted to become a Sinatra tribute act after being told his vocals were 'uncannily close' to the legend.\nHe said he has studied Sinatra down to the finest detail, sifting through hundreds of hours of live performances to nail his mannerisms and voice.\nHe said: 'I sang a couple of Sinatra songs and people were saying you don't half sound like him so I went away and started working on perfecting my act.\n'I did my research - I spent endless hours watching how he moved, walked and talked - and from that I started putting on my own shows.\n'You get an adrenaline rush from both shark catching and singing.\n'When you do a good show a get a massive buzz and it is very similar when you come across a big fish!'","url":"https://www.dailymail.co.uk/news/article-4446994/Man-reels-monster-450lb-SHARK-Cornwall.html"}
