{"authors":[],"date_download":"2018-10-30 20:17:54","date_modify":"2018-10-30 20:17:54","date_publish":"2016-02-28 14:24:04","description":"A fatal crash shut down all lanes of I-85 in northeast Atlanta early Sunday morning and were re-opened at about 6:45 a.","filename":"data/vaneerConsumption/ManstruckkilledafterexitingcaronI85.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/02/28/Images/photos.medleyphoto.8830407.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_man-struck-killed-after-exiting-car__1540930674.html","title":"Man struck, killed after exiting car on I-85","title_page":"Man struck, killed after exiting car on I-85","title_rss":"NULL","source_domain":"ajc.com","text":"A fatal crash shut down all lanes of I-85 in northeast Atlanta early Sunday morning and were re-opened at about 6:45 a.m., police said.\nA dead man was found lying in the road when Atlanta police arrived, Donald Hannah, a spokesman for Atlanta police, said.\n“The vehicle that struck him first was stopped just ahead,” Hannah said. “According to the driver, and three separate witnesses, the deceased ran out onto the interstate and in front of the car.”\nPolice believe the man, who had not been identified as of 11 a.m. Sunday, was struck by at least one more car after the initial collision, Hannah said.\nA witness told Channel 2 Action News he thinks the driver got out of a disabled black Camaro that was in the center lane of I-85 around 4 a.m.\nAnother driver, Torry Sumlin, told Channel 2 he saw the Camaro stopped with emergency flashers on, and the body of the victim on the ground nearby.\n“Look like he’d been run over a couple times,” Sumlin said. “I swerved around him to the left and came back to the right and side of the road and dialed 911. There was nothing I could do. I couldn’t get back out there in traffic.”\nThe investigation is ongoing, Hannah said.\n—Please return to AJC.com for updates.","url":"https://www.ajc.com/news/local/man-struck-killed-after-exiting-car/1FLhqIL2Xp2zr54fTlaIZM/"}
