{"authors":[],"date_download":"2018-10-30 20:10:24","date_modify":"2018-10-30 20:10:24","date_publish":"2016-03-22 23:52:17","description":"A north Georgia man is suing the Georgia State Patrol after being injured in a 2014 police chase that he was not involved in, according to Channel 2 Action News.","filename":"data/vaneerConsumption/MansuesGeorgiaStatePoliceforinjuryresultingfrompolice.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/22/Videos/4813077042001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_man-sues-georgia_3e3f36af168aff75c36abca123a8af08__1540930224.html","title":"Man sues Georgia State Police for injury resulting from police...","title_page":"Man sues Georgia State Police for injury resulting from police...","title_rss":"NULL","source_domain":"ajc.com","text":"A north Georgia man is suing the Georgia State Patrol after being injured in a 2014 police chase that he was not involved in, according to Channel 2 Action News.\nTerry Grizzle is suing the state for $1 million because he was thrown 30 feet in the midst of a police chase, the television station said.\nGrizzle was on a 12-foot ladder repairing a sign in front of a business, when he was hit by a stolen truck that police were chasing in Lumpkin County.\nThe police performed a PIT maneuver, which is a controlled crash intended to steer a car to a stop. The maneuver caused the truck to spin out and crash into the ladder, propelling Grizzle through the air. He was critically injured, requiring surgery, and now wants the state patrol to pay his medical bills, he told Channel 2.\nGrizzle said his medical bills are nearing $200,000.\n“[I’ve had] two bone graphs on this arm, three plates and 18 screws in it and we’re still working on it,” Grizzle told Channel 2.\nGrizzle’s attorney, Steve Leibel, told the station on Tuesday that police chases for stolen vehicles or other non-loss-of-life crimes should be stopped. He is pushing for change in this lawsuit, which was filed Monday in Lumpkin County, according to Channel 2.\nLeibel said this incident is a perfect example of why law enforcement should stop chasing criminals for things such as stolen cars.\n“There was no reason in the world to chase this individual when you knew who he was and where he was going,” Leibel told Channel 2. “We are very pro police here, we are not against the police, but we are against this policy. All the effects of what happened in this accident are from a move that was unnecessary.”\nThe state patrol so far has claimed immunity, and said it shouldn’t pay a dime, according to the news station.\nA spokesperson for the state patrol told Channel 2 that they won’t comment on open litigation.","url":"https://www.ajc.com/news/local/man-sues-georgia-state-police-for-injury-resulting-from-police-chase/88qZqakpTA7LnYzrl0L0zN/"}
