{"authors":[],"date_download":"2018-10-30 00:59:26","date_modify":"2018-10-30 00:59:26","date_publish":"2016-04-22 00:00:00","description":null,"filename":"data/vaneerConsumption/ManspreadersinCaliforniatofacefinebytransitauthority.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_04_manspreaders_in_california_to_face_fine_by_transit_authority_1540861166.html","title":"'Manspreaders' in California to face fine by transit authority","title_page":"'Manspreaders' in California to face fine by transit authority","title_rss":"NULL","source_domain":"americanthinker.com","text":"Nevertheless, the California transit authorities will fine \"manspreaders\" $100.\nReuters:\nIn the car-choked cities of Los Angeles and San Francisco, public transit commuters fed up with \"seat hogs\" and \"manspreaders\" will soon find relief as transit agencies crack down on passengers occupying more than their share of space as others are left standing.\n\"This is directed at that knucklehead who, when asked by a courteous person to vacate a seat, refuses to do so,\" said Joel Keller, a member of the Bay Area Rapid Transit Agency in San Francisco.\nLast week, the agency's board voted 5-4 to adopt a new \"one ticket, one seat\" rule imposing a $100 fine on commuter train riders who, after a warning continue to use a seat for something other than sitting.\nSubway riders who park a backpack on a seat or spread out in wide-legged oblivion have long been the bane of the rush-hour crowd in major commuter cities across the United States.\nThe effort to prevent these faux pas in California follows similar campaigns launched by transit agencies in New York, Philadelphia and Seattle with slogans such as \"Two seats? Really?\" and \"Dude ... Stop The Spread. Please.\"\nAt SeatHogs.com, commuters are shown splaying their sleeping bodies over a row of seats, putting their feet up or placing anything from a stack of newspapers to a handbag on the nearest seat.\nKeller said there is no space to spare with ridership at an all-time high on the Bay Area Rapid Transit (BART) network, which carries passengers between San Francisco and distant suburbs.\nA similar proposal in Los Angeles will be considered by the regional Metropolitan Transportation Authority in the coming months, said Alex Wiggins, executive officer for security for the agency.\nThe Los Angeles region, which according to tracking firm INRIX ranks worst in the nation for traffic, is opening two commuter rail extensions that, at a cost $2.5 billion, are expected to attract tens of thousands of new riders.\nOfficials with the agency, which already has a $75 fine for seat blocking, said many new riders will need an education on commuting \"dos and don'ts.\"","url":"https://www.americanthinker.com/blog/2016/04/manspreaders_in_california_to_face_fine_by_transit_authority.html"}
