{"authors":["Kelly Yamanouchi"],"date_download":"2018-10-30 17:55:00","date_modify":"2018-10-30 17:55:00","date_publish":"2018-06-26 21:24:00","description":"A passenger was apprehended after being found on the airfield at Hartsfield-Jackson International, according to the airport.","filename":"data/vaneerConsumption/ManscaledfenceranontotaxiwayatAtlantaairport.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/08/28/Images/photos.medleyphoto.5988380.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_airport_passenger-gets_7c971103809886e35154f12e6ade07d8__1540922100.html","title":"Man scaled fence, ran onto taxiway at Atlanta airport","title_page":"Man scaled fence, ran onto taxiway at Atlanta airport","title_rss":"NULL","source_domain":"ajc.com","text":"A man scaled a fence and ran onto an active taxiway at Hartsfield-Jackson International, according to the Atlanta Police Department.\nThe incident occurred shortly after 4:30 p.m. on Tuesday, when the man approached a Delta plane from Miami that had landed. He jumped on the wing and began to pound on the windows, according to Atlanta police.\nPassengers posted video of the man wearing only underwear while outside the plane.\nMan in custody after getting access to tarmac at Atlanta airport, authorities say: https://t.co/tjSonV968h pic.twitter.com/aIiKOi6BIi — WSB-TV (@wsbtv) June 26, 2018\nThe man was taken into custody five minutes later and the Atlanta Police Department is investigating the incident.\nAtlanta police said the man, who they identified as Jhryin Jones, 19, is being charged with criminal trespassing, public indecency and obstruction of law enforcement officers.\nAirport officials initially said in a post on Twitter that a passenger exited a plane while it was stopped on a taxiway after arrival.\nBut later, the airport said: “There are conflicting reports as to how the male apprehended on the airfield accessed the airfield. He is currently in custody.”\nAccording to the Federal Aviation Administration air traffic control system command center’s airport status updates, there was a security-related gate hold and taxi delays of 16 to 30 minutes affecting departures Tuesday afternoon.","url":"https://www.ajc.com/blog/airport/passenger-gets-out-plane-taxiway-hartsfield-jackson/55jLRNrjceS1apdYTqewxL/"}
