{"authors":["Sara Malm For Mailonline"],"date_download":"2018-10-22 23:35:42","date_modify":"2018-10-22 23:35:42","date_publish":"2016-01-29 11:52:25","description":"The 20-year-old man had put the e-cigarette to his mouth,when the battery exploded, causing him severe facial injuries and blowing a number of his teeth out, police in Cologne, Germany said.","filename":"data/vaneerConsumption/Mansteethareblownoutwhenecigaretteexplodesinhismouth.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/253165AE00000578-0-image-a-21_1454068338526.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422612_Man-s-teeth-blown-e-cigarette-explodes-mouth-causing-facial-injuries_1540251342.html","title":"Man’s teeth are blown out when e-cigarette explodes in his mouth","title_page":"Man’s teeth are blown out when e-cigarette explodes in his mouth | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The incident took place in a shop for e-cigarettes in Cologne, Germany\nHe suffered severe facial injuries and a number of his teeth blew out\nMan, 20, had put the e-cigarette to his mouth to inhale when it exploded\nA German man suffered serious facial injuries and lost a number of his teeth when an e-cigarette exploded in his mouth.\nThe 20-year-old was smoking an electric cigarette, and had put the device to his mouth to inhale, when the battery exploded, Cologne police reports.\nHe suffered severe injuries to his face, including wounds to his mouth, with the explosion itself knocking out several teeth.\nThe 20-year-old man had put the e-cigarette to his mouth when the battery exploded, causing him severe facial injuries and blowing a number of his teeth out\nThe incident took place in a vape shop on Saturday afternoon as the man was purchasing new parts for his e-cigarette, The Local.de reports.\nThis is just the latest incident reported involving e-cigarettes or vapes exploding and injuring users.\nLast week, mother-of-two Kirby Sheen, 24, said she had been lucky not to lose an eye after an e-cigarette exploded in her face.\nMs Sheen's eyelid was split in two by the mouth piece of the device which blew up as she put a battery in the device on Wednesday afternoon.\nThe 24-year-old, from Salford, was testing the battery in her partner's device after her machine stopped working.\nThe incident took place in a vape shop in central Cologne, Germany, on Saturday afternoon as the man was purchasing new parts for his e-cigarette\nShe wanted to check if it was the battery or device that was faulty but now says she could be scarred for life after it exploded.\nThis week it was reported that teenagers who use e-cigarettes are more likely to take up smoking a year later.\nNever-smokers who tried e-cigarettes were almost three times more likely to smoke cigarettes a year later compared with those who had never had an e-cigarette, a UK study found.\nJust under a third of more than 2,300 students had used e-cigarettes when they were first questioned in 2013.","url":"https://www.dailymail.co.uk/news/article-3422612/Man-s-teeth-blown-e-cigarette-explodes-mouth-causing-facial-injuries.html"}
