{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:59:10","date_modify":"2018-10-30 17:59:10","date_publish":"2015-11-04 17:34:03","description":"A woman in Pakistan died after her ex-boyfriend set her on fire when she turned down his marriage proposal.","filename":"data/vaneerConsumption/ManSetsWomanonFireforRejectingProposal.json","image_url":"https://media.breitbart.com/media/2015/11/Sonia-Bibi-Getty-Image.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_04__1540922350.html","title":"Man Sets Woman on Fire for Rejecting Proposal","title_page":"Pakistan: Man Sets Woman on Fire for Rejecting Proposal","title_rss":"NULL","source_domain":"breitbart.com","text":"A Pakistani woman died days after her ex-boyfriend set her on fire when she turned down his marriage proposal.\nLatif Ahmed proposed to 20-year-old Sonia Bibi in October, but the young woman said no. That is when he “sprinkled her with petrol and set her alight.”\n“Police arrested the man after recording the statement of Sonia Bibi in the presence oin f her parents,” explained Jamshaid Hayat, a local police official in the Multan district in Punjab province. “The girl told us that she was in love with Latif, whom she accused of dousing her in gasoline and setting her alight.”\nBut officer Mukhtar Cheema claimed Bibi told authorities she said no “because she was no longer in love with him.”\nAt the time, doctors stated that 40 to 50% of her body was covered in burns, but “she was out of danger.”\nHowever, her injuries became infected and she passed away on Tuesday.\nDomestic violence against women is extremely common in Pakistan. In June 2014, 22-year-old Fayyaz Aslam doused 18-year-old Sidra Shaukat with gasoline and set her on fire when she turned down his proposal. She died before she arrived at the hospital. A few weeks later, a family hacked to death their 17-year-old daughter and her 30-year-old husband after they married without the family’s consent.\nIn January, Sajid Qureshi set 18-year-old Aqsa on fire when her family turned down his marriage proposal. Her mother said no because it was believed among the community that Qureshi is an alcoholic.\nIn early October, a woman and her two daughters were hacked to death with an axe by the girls’ uncle because he did not approve of his niece’s marriage proposal.\nA woman turned down a proposal from a man identified as Abdul Jabbar in September. He later broke into her house and threw acid on her face as she slept.\nLast year, Ryot documented four women who turned down marriage proposals in Pakistan. Photographer Emilio Morenatti took pictures of the women to raise “domestic violence awareness and giving long-silent victims a voice.” The majority of the women were burned with acid, scarred for life.","url":"https://www.breitbart.com/national-security/2015/11/04/pakistan-man-sets-woman-fire-turning-marriage-proposal/"}
