{"authors":["Associated Press"],"date_download":"2018-10-22 20:45:28","date_modify":"2018-10-22 20:45:28","date_publish":"2016-01-28 03:31:56","description":"NEW ORLEANS (AP) — A 25-year-old man, apparently homeless, was arrested Wednesday for setting a fire for warmth that ended up blanketing part of the city in ...","filename":"data/vaneerConsumption/Manseekingwarmtharrestedforsettingfireinbuilding.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:270d1d2b217d4df5a2de24ed3a641795-4vVdYopwYQ7f641721b07a80ab00-242_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420322_Man-seeking-warmth-arrested-setting-fire-building_1540241128.html","title":"Man seeking warmth arrested for setting fire in building","title_page":"Man seeking warmth arrested for setting fire in building | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Man seeking warmth arrested for setting fire in building\nNEW ORLEANS (AP) — A 25-year-old man, apparently homeless, was arrested Wednesday for setting a fire for warmth that ended up blanketing part of the city in smoke and forcing the closure of historic Canal Street, the city's fire chief said.\nDarren Denley was booked on municipal charges of setting fires and crossing police lines, Fire Chief Timothy McConnell said in a statement late Wednesday.\n\"Mr. Denley set a fire in the alcove of a business in the 1000 block of Canal St. in order to keep warm,\" McConnell said. \"The fire then extended into the building and grew unchecked for over two hours until it caused a window in the building to break. At that time, an employee in another business on that block became aware of the fire.\"\nFirefighters battle a fire on Canal Street in downtown New Orleans, Wednesday, Jan. 27, 2016. (AP Photo/Gerald Herbert)\nThe blaze broke out in a largely empty four-story building and spread to an adjacent building. Flames were no longer visible and smoke had greatly diminished by daybreak, but firefighters kept steady streams of water pouring onto the structures from ladder trucks and from the street. The fire was declared under control shortly before noon.\n\"Due to an extraordinary response by the firefighters, this catastrophic fire that had the potential to turn deadly was contained. Numerous shelter facilities are available throughout the city, and people seeking warmth are encouraged to seek shelter at one of these locations when necessary,\" McConnell said.\nSome lanes of Canal Street, which is located between the city's central business district and the French Quarter, re-opened Wednesday evening and McConnell said streetcar traffic was resuming.\nBut the stability of the structure was being investigated and the damage could result in some minor changes in the route of Mardi Gras season parades that will roll down the famous boulevard over a 12-day period beginning Friday.\n\"That sidewalk, that area of the street will be closed through Mardi Gras,\" McConnell said.\nThe top three floors of the building were empty. Ground-floor businesses, including a cellphone repair shop and a beauty supply store, were closed when the fire was reported about 3:20 a.m., and only one person was in the building at the time, McConnell said. The businesses were heavily damaged and unlikely to reopen anytime soon, he said.\nNo injuries were reported, and no evacuations were ordered. But some nervous residents of an apartment building around the corner decided to get out amid acrid smoke and temperatures in the 40s.\nResident Michael Mallin said fire alarms in the apartment building went off about 3:30 a.m.\n\"They told us it was safe to stay,\" neighbor Kate Otto said. \"We decided we needed to get out.\"\nThe scene is around the corner from the tony Roosevelt Hotel. It also is near upscale apartment buildings and the Orpheum and the Saenger, ornate early 20th century theaters that were restored to their earlier grandeur after Hurricane Katrina.\nBut the fire site itself was a largely unused building on a rundown block. \"This is a stretch of Canal Street that has not yet seen the level of revitalization of the rest of Canal Street,\" said Kurt Weigel, president of the Downtown Development District.\n____\nAssociated Press Writer Bill Fuller contributed to this report.\nFirefighters battle a blaze on Canal Street in downtown New Orleans, Wednesday, Jan. 27, 2016. (AP Photo/Gerald Herbert)\nFirefighters battle a fire on Canal Street in downtown New Orleans, Wednesday, Jan. 27, 2016. (AP Photo/Gerald Herbert)","url":"https://www.dailymail.co.uk/wires/ap/article-3420322/Man-seeking-warmth-arrested-setting-fire-building.html"}
