{"authors":["Mary Chastain"],"date_download":"2018-10-30 17:57:42","date_modify":"2018-10-30 17:57:42","date_publish":"2016-03-04 14:02:36","description":"A man in Pakistan shot and killed his two sisters to protect his family's \"honor,\" he claims, after his family forgave him for killing his mother.","filename":"data/vaneerConsumption/ManShootsHisSistersinHonorKillingAfterBeingForgivenforMurderingMother.json","image_url":"https://media.breitbart.com/media/2016/03/Pakistani-police-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_04__1540922262.html","title":"Man Shoots His Sisters in 'Honor Killing' After Being Forgiven for Murdering Mother","title_page":"Pakistan: Man Shoots His Sisters in 'Honor Killing' After Being Forgiven for Murdering Mother","title_rss":"NULL","source_domain":"breitbart.com","text":"A man in Pakistan shot and killed his two sisters to protect his family’s “honor,” he claims, after his family forgave him for killing his mother, leaving him free from charges. This incident was one of a string of such “honor killings” committed recently in the country.\nAuthorities said Muhammad Asif shot his sisters Fozia Bibi, 22, and Suriya Bibi, 24, because he believed they were having affairs. Police officer Tariq Mehmood explained, “Muhammad Asif killed his two sisters last night over their character and lifestyle, which he didn’t like,” adding, “Fozia was shot in her chest and Suriya was shot in her waist.”\nThe police also said he killed his mother five years ago, but they released him after the family pardoned him. A provision in the law allows this “following the payment of blood money.” They did not release any details about that killing.\nIn a separate incident, a man named Rehmat shot and killed his 18-year-old daughter, Komal, after she left the house without his permission. Her mother Razia said, “He went to this room, brought out a gun and shot his daughter dead. He then fled from the scene.”\nThe police said he did it for his family’s “honor.”\nOn Sunday, Pakistani film director Sharmeen Obaid-Chinoy won an Oscar for her documentary A Girl in the River: The Price of Forgiveness, which is about a girl who survived an honor killing. Statistics have found that between 500-1,000 women die in honor killings every year. She met with Prime Minister Nawaz Sharif, who “vowed to eradicate the ‘evil’ of honour killings in Pakistan.” Honor killings have long plagued the country.\n“This is totally against Islam and anyone who does this must be punished and punished very severely,” Sharif said. “Changing the law is something that needs to be done at the earliest possibility.”\nOn Monday, a court sentenced two brothers to death after they killed “their sister and brother-in-law in 2009 because the couple married without family consent.”\nIn May 2014, a family stoned to death a pregnant woman outside a courthouse because she married the man she loved. According to the Associated Press:\nNearly 20 members of Parveen’s extended family, including her father and brothers, had waited outside the building that houses the high court of Lahore. As the couple walked up to the main gate, the relatives fired shots in the air and tried to snatch her from Iqbal, her lawyer said. When she resisted, her father, brothers and other relatives started beating her, eventually pelting her with bricks from a nearby construction site, according to Mujahid and Iqbal, the slain woman’s husband.\nA year earlier, a man killed his two stepsisters because they were caught dancing together in rain.\n“Elders in the town raised objections on the character of these girls,” exclaimed human rights activist Atiya Jehan. “When the footage was circulated via mobile phones, it caused outrage in the conservative Pakistani town.”","url":"https://www.breitbart.com/national-security/2016/03/04/pakistan-man-shoots-his-two-sisters-in-honor-killing-after-being-forgiven-for-murdering-mother/"}
