{"authors":["Sarah Mooney For Mailonline","Carly Stern For Dailymail.Com"],"date_download":"2018-10-23 01:56:15","date_modify":"2018-10-23 01:56:15","date_publish":"2017-03-10 10:24:19","description":"When writer Martin Schneider, from Philadelphia, used Nicole Pieri's signature, clients were suddenly 'rude' and 'condescending' over email. One even asked if he was single.","filename":"data/vaneerConsumption/Manswitchesnameswithhisfemalecoworkerforaweek.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E22130900000578-0-image-a-15_1489140606983.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4300564_Man-switches-names-female-coworker-week_1540259775.html","title":"Man switches names with his female coworker for a week","title_page":"Man switches names with his female coworker for a week | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Pennsylvania man was shocked and disheartened when he got a taste of the sexism that women face in the workplace — simply by switching email signatures with a female colleague.\nAt work one day, writer Martin Schneider from Philadelphia was baffled by a client's 'rude, dismissive' responses to his emails. After a few exchanges, he realized that due to a shared inbox, he had been unkowingly signing his emails with his coworker's name, Nicole Pieri.\nOnce the client knew he was conversing with a man, Martin, 28, witnessed an 'immediate improvement' in their dialogue — and the dramatic change inspired a little experiement.\nWriter Martin Schneider switched email signatures with his female co-worker\nHis colleague, Nicole Pieri, ended up having 'the most productive week of her career'\nMartin described the experience in a series of tweets which have since gone viral\nConvinced the client's tone had shifted because he thought he was dealing with a woman — since that is was the evidence indicated — Martin switched signatures with Nicole for two weeks to test his theory out.\nSure enough, he says his work life at the small employment service firm rapidly began to 'f***ing suck', while Nicole, by contrast, says she had the 'most productive' stint of her entire career when clients thought she was a man.\nMartin outlined the pair's drastically different experiences in a series of tweets that has since gone viral.\nMartin admits he was confused at first when he was receiving 'dismissive' responses from a client\nAs Nicole's supervisor, Martin said he was always under pressure from his own boss to make her more efficient, since work often took her longer.\n'I figured the reason I got things done faster was from having more experience,' Martin said.\nAfter the experience with the rude client who thought he was talking to Nicole, though, his persepctive changed. During the initial exchange, the difficult client told Martin that 'his methods were the industry standards (they weren't) and I couldn't understand the terms he used (I could).'\nWhen Martin noticed Nicole's signature on his email, he had his 'aha' moment: 'It was Nicole he was being rude to, not me. So out of curiosity I said \"Hey this is Martin, I'm taking over this project for Nicole.\"\n'IMMEDIATE IMPROVEMENT,' he went on. 'Positive reception, thanking me for suggestions, responds promptly, saying \"great questions!\" Became a model client. Note: My technique and advice never changed. The only difference was that I had a man's name now.'\nThe writer goes on to say that once he realized he had been using Nicole's email signature and told the client, there was an 'IMMEDIATE IMPROVEMENT'\nThe pair decided to conduct an experiment by switching names, and Martin admits he 'was in hell'\nWhen he asked Nicole if this kind of thing happened to her frequently, she replied: 'I mean, not ALL the time... but yeah. A lot.'\nDuring the ensuing experiment, Martin said he was 'in hell'.\n'Everything I asked or suggested was questioned. Clients I could do in my sleep were condescending. One asked if I was single,' he said. Meanwhile, 'Nicole had the most productive week of her career.I realized the reason she took longer is bc she had to convince clients to respect her.\n'By the time she could get clients to accept that she knew what she was doing, I could get halfway through another client. I wasn't any better at the job than she was, I just had this invisible advantage.'\nHe added that he didn't actually change anything about the way he did work\nNicole, meanwhile, had a great time at work and saw clients work with her more easily\nAnd though Martin was stunned by the way he was treated when people thought he was female, the writer said that the most shocking thing about the process was realizing how his friend had come to accept such treatment as the norm.\nHe wrote: 'For me, this was shocking. For her, she was USED to it. She just figured it was part of her job.\n'I mean, she knew she was being treated different for being a woman, she's not dumb. She just took it in stride.'\nDuring the Twitter thread, followers began to chime in with their own stories and points, with one noting that things may be harder for women in general, but there's an extra built-in penalty for those with names like TaNeisha.\nNicole, meanwhile, wrote her own take on the experience in a piece for Medium called Working While Female.\nShe explained that the experiment didn't surprise her, since she's regularly faced sexism — both direct and indirect — in the workplace.\nHe realized that simply being a man had given him an 'invisible advantage' in the workplace\nMartin was stunned that Nicole was used to the treatment she received on a regular basis\nHowever, she was upset that when she and Martin brought the experiment to the attention of their boss, it was dismissed.\n'He actually said \"There are a thousand reasons why the clients could have reacted differently that way. It could be the work, the performance… you have no way of knowing,\"' she wrote. 'For the first time in two years, I almost lost my cool.\n'I will always wonder. What did my boss have to gain by refusing to believe that sexism exists? Even when the evidence is screaming at him, even when his employee who makes him an awful lot of money is telling him, even when THE BOY on staff is telling him?' she went on.\nSince the incident, which seems to have happened some time ago, Nicole has quit her job at the firm and begun freelance writing.","url":"https://www.dailymail.co.uk/femail/article-4300564/Man-switches-names-female-coworker-week.html"}
