{"authors":["Jack Bezants For Mailonline"],"date_download":"2018-10-23 01:55:08","date_modify":"2018-10-23 01:55:08","date_publish":"2017-03-16 12:07:14","description":"Gary Neville has urged Manchester United to offer Zlatan Ibrahimovic a two-year contract in reward for the Swede's formidable form at Old Trafford so far this season.","filename":"data/vaneerConsumption/ManUnitedmustofferZlatanIbrahimovicatwoyeardeal.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3DB6138700000578-0-image-a-78_1489665918062.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319970_United-offer-Ibrahimovic-two-year-deal-says-Neville_1540259708.html","title":"Man United 'must offer Zlatan Ibrahimovic a two-year deal'","title_page":"Man United 'must offer Zlatan Ibrahimovic a two-year deal' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Gary Neville has urged Manchester United to offer Zlatan Ibrahimovic a two-year contract in reward for the Swede's formidable form at Old Trafford so far this season.\nThe 35-year-old Ibrahimovic has scored 26 goals in 40 games, including a late winner in the EFL Cup final against Southampton at Wembley.\nHis United deal only lasts until the end of the season and club legend Neville believes they need to move decisively to secure his future.\nGary Neville believes Manchester United should offer Zlatan Ibrahimovic a two-year extension\nNeville believes that Ibrahimovic's professionalism makes him deserving of a new deal\nIbrahimovic has scored 26 times in 40 appearances for United so far this season\nNeville told Omnisport that he would offer the Swede a two-year deal 'because of the professionalism, the training and his commitment to the club.\n'I think United needed personalities and characters after what happened in the previous few seasons. A lot of United's success has revolved around him.'\nBut Neville believes Mourinho will not be able to depend on Ibrahimovic as much as he has this season due to his age.\n'What I would say is, it will be impossible for him to play every single match in that period,' Neville said.\n'There has to be a dip at some point. Ultimately, it's how Mourinho manages him over a two-year period because he wants to play every match.\n'The reality is, I'm not quite sure that will be able to happen as he continues to get a little bit older.'\nNeville said that if Ibrahimovic stays, Jose Mourinho will have to manage him carefully\nIbrahimovic has a three-game ban to serve in English football after elbowing Tyrone Mings\nIbrahimovic is currently serving a three-match ban in English football for elbowing Bournemouth defender Tyrone Mings when United drew 1-1 with Eddie Howe's side.\nHe missed the 1-0 defeat by Chelsea in the FA Cup on Monday, and will be absent for United's next two Premier League games against Middlesbrough and West Brom.\nIbrahimovic is, however, available to play against Rostov in the Europa League on Thursday.","url":"https://www.dailymail.co.uk/sport/football/article-4319970/United-offer-Ibrahimovic-two-year-deal-says-Neville.html"}
