{"authors":["Matthew Smith For Mailonline"],"date_download":"2018-10-23 03:22:28","date_modify":"2018-10-23 03:22:28","date_publish":"2017-03-10 12:47:17","description":"Seeing a modern football icon like Manchester United boss Jose Mourinho in person is awe-inspiring for any fan, and particularly for children, and one ball boy was no exception.","filename":"data/vaneerConsumption/ManUtdbossJoseMourinhogreetsstarstruckballboy.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22E5B300000578-0-image-a-22_1489150209928.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301068_Man-Utd-boss-Jose-Mourinho-greets-starstruck-ball-boy_1540264948.html","title":"Man Utd boss Jose Mourinho greets starstruck ball boy","title_page":"Man Utd boss Jose Mourinho greets starstruck ball boy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Seeing a modern football icon like Jose Mourinho in person is awe-inspiring for any fan, and particularly for children, and one young Russian ball boy was certainly no exception.\nAs the ball boys lined up in the tunnel at the Olimp-2 Stadium ahead of the Europa League last 16 tie between Rostov and Manchester United on Thursday, Mourinho came out to greet them.\nHe soon caught the eye of one particularly star struck young football fan, who covered his mouth in adorable shock as the Manchester United boss gave him a cheeky grin.\nThat moment when you meet Josè Mourinho. Exclusive scenes before Rostov vs United. pic.twitter.com/BoDkaP7U8M — Stefano Conforti (@confortistefano) March 10, 2017\nManchester United manager Jose Mourinho greets a star struck ball boy in Rostov\nMourinho gave the lad a hug, with the ball boy unable to believe his good fortune\nIn the video shared on Twitter by Russian football writer Stefano Conforti, Mourinho gets up close and personal with the lad, who cannot believe his luck, to give him a hug while his colleagues look on jealously.\nThe Portuguese manager the, slightly bizarrely, leans his face into the top of the boy's woolly hatted head, before going on his way down the tunnel.\nAs he leaves the ball boy behind, his fan still cannot quite grasp what has happened, his hands on his head and eyes wide as he reflects on a moment with a hero that he will not forget.\nIt was a rare moment of levity from Mourinho, who was left frustrated with United's 1-1 draw in Russia having led in the first half through Henrikh Mkhitaryan, and angry at the desperately poor state of the Rostov pitch.\nMourinho walks off down the tunnel, leaving one young fan with memories to treasure\nMourinho's Manchester United drew 1-1 with Rostov on a poor pitch at the Olimp-2 stadium\n'It was a very good performance in relation to the conditions,' Mourinho said. 'It was impossible to play better, impossible to play a passing game.\n'To see my players coping with it and the humility to fight for every ball is a good feeling for me. I said before the game that I didn't want to go more and more into this. It is done. There are no injuries.'\nUnited face Rostov at Old Trafford in the second leg next Thursday, where all the ball boys will be on tenterhooks, hopeful they will be the next to catch Mourinho's eye.","url":"https://www.dailymail.co.uk/sport/football/article-4301068/Man-Utd-boss-Jose-Mourinho-greets-starstruck-ball-boy.html"}
