{"authors":["Ben Grounds For Mailonline"],"date_download":"2018-10-23 00:40:20","date_modify":"2018-10-23 00:40:20","date_publish":"2017-03-16 10:12:14","description":"Roy Keane has slammed modern footballers who take selfies after winning games, with the former Manchester United midfielder claiming they should already be moving on to the 'next battle'.","filename":"data/vaneerConsumption/ManUnitediconRoyKeaneSLAMSdressingroomselfies.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E5352BF00000578-0-image-a-27_1489659130584.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4319472_Roy-Keane-slams-selfies-ready-battle_1540255220.html","title":"Man United icon Roy Keane SLAMS dressing room selfies","title_page":"Man United icon Roy Keane SLAMS dressing room selfies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Roy Keane has slammed modern footballers who take selfies after winning games, with the former Manchester United midfielder claiming they should already be moving on to the 'next battle'.\nThe Republic of Ireland assistant launched a withering attack on those who seem preoccupied with capturing the moment of routine success when they ought to be focusing on preparing themselves for the next encounter.\nKeane, who once said the Arsenal squad are 'more interested in selfies and six-packs', has again hit out at the Instagram-obsessed culture breeding in the dressing rooms of professional clubs.\nTheo Walcott scored a hat-trick against former club Southampton and savoured the moment\nCristiano Ronaldo posted a team photo after Real Madrid's 3-0 win over Atletico in November\nRepublic of Ireland assistant Roy Keane is against the culture of dressing room selfies\nThe 45-year-old believes the biggest teams should not dwell on victories when nothing by way of silverware has been achieved, and having won 15 major honours during his playing career, Keane would like to see greater introspection among the elite.\n'I see players nowadays, they get a result and they're taking selfies or swapping jerseys at half-time... they're almost enjoying it too much,' Keane said in an interview with Newstalk.\n'If you're playing for a big club and you get a result, of course enjoy it. But you have to move on pretty quickly and get ready for the next battle. Because this game, it can beat you up.'\nKeane did not dwell on the epic Champions League semi-final victory over Juventus in 1999\nParis Saint-Germain midfielder Adrien Rabiot was a bit smug after the 4-0 win over Barcelona\nBarcelona were more than happy to revel in the moment of overturning the four-goal deficit\nTottenham midfielder Dele Alli celebrated Harry Winks' first goal in the 3-2 win over West Ham\nParis Saint-Germain recently fell victim to the premature selfie, after Adrien Rabiot posted a picture of himself showing four fingers ahead of an anti-doping test in the aftermath of the 4-0 victory in the first leg of their Champions League last-16 clash with Barcelona.\nKeane is staunchly against the sharing of such images, with such outpourings of premature joy in contrast to the mentality of the United squad during his heyday, but many players see them as a way of connecting with supporters.\nChelsea, who rarely post selfies after victories, got in on the act earlier this season after beating United 4-0 at Stamford Bridge - perhaps significant given it came against former manager Jose Mourinho.\nFormer Chelsea midfielder Oscar posted a selfie after beating Manchester United in October\nA quartet of PSG players celebrate the win over Marseille even though they trail Monaco\nArsenal are notorious for the dressing room selfie, with Keane previously saying of Arsene Wenger's squad: 'There's too many Arsenal players interested in selfies, I think, whatever they are.\n'Instead of focusing on winning Premier League titles, it's all about how their bodies look, how their hair is, more so than winning football matches, which is the way things are going.\n'They've got good players, really good players, it's just one or two of their players are more interested in selfies and six-packs.'","url":"https://www.dailymail.co.uk/sport/football/article-4319472/Roy-Keane-slams-selfies-ready-battle.html"}
