{"authors":["Jack Gaughan For Mailonline"],"date_download":"2018-10-23 03:07:48","date_modify":"2018-10-23 03:07:48","date_publish":"2017-03-16 13:49:27","description":"JACK GAUGHAN: It is a fact that will be gnawing away at Zlatan Ibrahimovic. For all the goals, medals and adulation, significant silverware remains absent from his glittering cabinet.","filename":"data/vaneerConsumption/ManUnewsZlatanIbrahimovicyettowinaEuropeanmedal.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E546FD500000578-0-image-a-112_1489670499935.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4320160_Man-U-news-Zlatan-Ibrahimovic-win-European-medal_1540264068.html","title":"Man U news: Zlatan Ibrahimovic yet to win a European medal","title_page":"Man U news: Zlatan Ibrahimovic yet to win a European medal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It is a fact that will be gnawing away at Zlatan Ibrahimovic. For all the goals, medals and adulation, significant silverware remains absent from his glittering cabinet.\nDespite an 18-year career, the physical phenomenon still does not own a European title.\nHaving no luck in the Champions League will be of specific angst but leading Manchester United to Stockholm on May 24 would at least fill a hole.\nZlatan Ibrahimovic has won pretty much everything in his club career - but he doesn't have a winners' medal from one of the major European competitions\nThis could be the last chance Ibrahimovic has to win a European medal as Manchester United compete in the UEFA Europa League\nThis is now a competition which matters more to Jose Mourinho and his No 9, with United desperate to brush Rostov aside and progress to the last eight on Thursday night.\nFor them, lifting the Europa League 380 miles away from Ibrahimovic's home in Malmo means qualification to next season's Champions League - something the Glazers are counting on given the financial implications without a place among the elite for a second campaign running.\nMourinho has made it very clear that the Europa League is considered a priority amid what continues to be a helter-skelter race for the top four. United are six points behind Liverpool with two games in hand.\nSo, these nights - starting with the second leg against Rostov - should become Ibrahimovic's biggest in a United shirt.\nFor him, with the lure of silverware in Europe, and his manager, whose remit was a passage back to the big time.\nA cloud of mystery floats over Ibrahimovic's future at Old Trafford. Mourinho insisted he will stay next year before the striker revealed the 'option is already fulfilled on my side'. The decision, he claimed, is down to him.\nIbrahimovic and his Juventus team were knocked out of the Champions League by Arsenal at the quarter-final stage back in 2006\nAt Inter Milan in 2009, it was Manchester United who dumped them out of Europe\nWhen a Milan player, they lost in the round of 16 to Tottenham Hotspur in 2011\nHis medal collection Ajax Eredivisie: 2001–02, 2003–04 KNVB Cup: 2001–02 Johan Cruyff Shield: 2002 Juventus Serie A: 2004–05, 2005–06 (both revoked due to the Calciopoli scandal) Internazionale Serie A: 2006–07, 2007–08, 2008–09 Supercoppa Italiana: 2006, 2008 Barcelona La Liga: 2009–10 Supercopa de Espana: 2009, 2010 UEFA Super Cup: 2009 FIFA Club World Cup: 2009 Milan Serie A: 2010–11 Supercoppa Italiana: 2011 Paris Saint-Germain Ligue 1: 2012–13, 2013–14, 2014–15, 2015–16 Coupe de France: 2014–15, 2015–16 Coupe de la Ligue: 2013–14, 2014–15, 2015–16 Trophee des Champions: 2013, 2014, 2015 Manchester United EFL Cup: 2016–17 FA Community Shield: 2016\nWhether the thought process behind delaying signing is down to Champions League football has been hotly debated over the last few weeks.\nIbrahimovic maintained it was not and LA Galaxy are keen on offering him a route into the MLS.\nIt does, however, seem inconceivable he would not want another crack at the big one - especially with the sheer volume of minutes he has accumulated during nine months in England.\nAnd one thing he has always been adept at is talking. Ibrahimovic is generous with his time, often stopping to be asked questions, which usually revolve around where he will end up.\nItaly's Fox Sports was no different this week, with ex-England boss Fabio Capello interviewing him for a piece to be shown on Friday.\nThis time the topic was Napoli. Again, he trotted out a similar answer. 'You never know, but I'm happy here,' he said. 'Let's just wait and see what happens.'\nHe even has his former Juventus manager on a string.\nFor the here and now, though, Mourinho needs to count on the 35-year-old against Rostov and potentially beyond.\nIt was telling that Ibrahimovic did not start three of United's first four group matches as his game time was managed. That culminated in two defeats - away at Feyenoord and Fenerbahce - in which he came off the bench during both.\nHe has led from the front in each of the five after, four wins and a draw last week on Rostov's now banned cabbage patch.\nThree of United's seven defeats this season have come when Ibrahimovic has been afforded a breather or suspended which, given that only amounts to 10 games as opposed to the 36 he has started, cannot be ignored.\nIbrahimovic's European frustrations continued during his time with Paris Saint-Germain\nIt was Manchester City who ended PSG's hopes of Champions League glory last season\nThe Swedish striker will be desperate to have another crack at the Champions League with United - or perhaps another club - next season\nMan United fixtures Premier League unless stated Thursday Rostov (H) Europa League last-16, second leg Sunday Middlesbrough (A) April 1 West Bromwich Albion (H) April 4 Everton (H) April 9 Sunderland (A) April 16 Chelsea (H)\nThe Swede cannot play domestically until April owing to the three-match ban he received for an elbow on Bournemouth's Tyrone Mings and so Thursday should see him go hell for leather.\nHe will sit out the must-win Premier League games with Middlesbrough and West Brom, with Marcus Rashford expected to fill the void after linking up with England over the international break.\nIbrahimovic returns for Everton on April 4, with Sunderland to follow shortly after, but will doubtless have eyes on the following midweek should United beat a team sitting eighth in the Russian Premier League.\nThe Europa League then resumes at the quarter-final stage, with the prospect of finally securing a European medal doubtless praying on Ibrahimovic's mind.","url":"https://www.dailymail.co.uk/sport/football/article-4320160/Man-U-news-Zlatan-Ibrahimovic-win-European-medal.html"}
