{"authors":["Jack Gaughan For Mailonline"],"date_download":"2018-10-23 02:23:57","date_modify":"2018-10-23 02:23:57","date_publish":"2017-03-10 11:30:53","description":"JACK GAUGHAN: Henrikh Mkhitaryan's guile in the final third presents more and more chances for a Manchester United team who have struggled to take them. He is becoming ever more essential.","filename":"data/vaneerConsumption/ManUfindingHenrikhMkhitaryantobeevermoreessential.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22A73E00000578-0-image-a-15_1489147241516.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300774_Man-U-finding-Henrikh-Mkhitaryan-essential_1540261437.html","title":"Man U finding Henrikh Mkhitaryan to be ever more essential","title_page":"Man U finding Henrikh Mkhitaryan to be ever more essential | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This last week, Henrikh Mkhitaryan has furthered thoughts about his importance to Manchester United in both his absence and his presence.\nOn Saturday afternoon, after Manchester United's tempestuous and ultimately discouraging draw with Bournemouth, Jose Mourinho was counting the cost of the Armenian's absence.\nUnited spurned a number of early chances before falling flat as the game wore on, missing an injection of invention after Andrew Surman's sending off.\nHenrikh Mkhitaryan celebrates scoring Manchester United's away goal in Russia on Thursday\nMkhitaryan scored the opener on his return from injury against Rostov in the Europa League\nHENRIKH MKHITARYAN STATS - 2016-17 Appearances: 20 (6 as sub) Goals: 6 Assists: 1 Yellow cards: 2 Premier League and Europa League games only\n'We lost quality in our football, we lost the vision in our football,' Mourinho said.\n'We didn't lose the intensity, we didn't lose the ambition, we didn't lose the number of our opportunities we had to win.\n'But we lost quality and we lost vision in our football so once more we are punished in a game that we should win.'\nWe will never know whether having Mkhitaryan available would have seen United find a second goal and elevate them above Arsenal into fifth.\nYet the 28-year-old's guile in the final third presents more and more chances for a team who have struggled to take them this year.\nHis hamstring injury sustained at Saint-Etienne last month was immediately followed by limping past Southampton in the EFL Cup final and that draw against Eddie Howe's stubborn Cherries.\nAnd during his comeback on Rostov's cabbage patch, Mkhitaryan was the one to find a pocket of space to poach a vital away goal. He offers them more energy, a greater willingness to run beyond Zlatan Ibrahimovic and a nose for goal.\nNo other — not even the impressive Juan Mata — can legitimately claim they break past Ibrahimovic with such regularity while operating directly in behind this season.\nThe Armenian gives energy and direction to United's attacks with his runs through\nZlatan Ibrahimovic and Co were left frustrated by Bournemouth in Mkhitaryan's absence\nIt is why Mkhitaryan missing Bournemouth went even further to prove how integral he is to Mourinho right now.\nAnd he is adding more goals to his game, with three in consecutive Europa League games and four in his last seven since the FA Cup win over Wigan in January.\nThe first at Leicester in February was sublime, nicking possession away from Robert Huth on halfway and single-mindedly driving towards, and then beating, Kasper Schmeichel.\nIt was the third straight month in which Mkhitaryan has won United's goal of the month competition. Noticeably, his prize in January came from a counter-attack against Wigan, too.\nUnited handed Mkhitaryan their goal of the month award for the third straight month\nFormer Borussia Dortmund team-mate Mats Hummels joked about his friend's repeated wins\nHe just has that extra edge and if United could've harnessed that earlier in the season — when the former Dortmund man was left kicking his heels — they might well be comfortably nestled inside the top four.\nStarting him in Rostov was a definite risk, his first game back following injury on an unpredictable surface full of potential problems. Whether he plays at Chelsea in the FA Cup on Monday remains to be seen.\n'We know he couldn't play 90 minutes,' Mourinho said. 'We knew he would only play 60 minutes — it doesn't matter [what] the result [was], we made that decision together as he is not in the best condition.\nJose Mourinho did not utilise Mkhitaryan initially this season - now he is ever more essential\n'We gave him freedom to play in attacking positions with Zlatan, to try to find spaces to score. He did well and managed to finish the game without injury, which is important for us.'\nThe case for him playing at Stamford Bridge is a strong one, evidenced by that strike at Leicester. United will need pace on the break as they bid to unsettle Antonio Conte's champions elect, who have won every home game since the middle of September.\nIn effect, Mkhitaryan changes United's dimensions and — for a team who need so many opportunities to score goals — is becoming ever more essential. That is ever more obvious when he does not play.","url":"https://www.dailymail.co.uk/sport/football/article-4300774/Man-U-finding-Henrikh-Mkhitaryan-essential.html"}
