{"authors":[],"date_download":"2018-10-22 23:41:37","date_modify":"2018-10-22 23:41:37","date_publish":"2017-04-26 08:27:25","description":"Manchester United can look forward to 'better years' after winning the League Cup and qualifying for the Europa League semi-finals, manager Jose Mourinho has said.","filename":"data/vaneerConsumption/ManUnitednewsJoseMourinhosaysbetteryearsawait.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F6E531700000578-0-image-a-60_1493191528259.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4446586_Jose-Mourinho-says-better-years-await-Man-United_1540251697.html","title":"Man United news: Jose Mourinho says 'better years' await","title_page":"Man United news: Jose Mourinho says 'better years' await | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Manchester United can look forward to 'better years' after winning the League Cup and qualifying for the Europa League semi-finals, manager Jose Mourinho has said as he begins to take stock of his first season at the Premier League club.\nIt has been a mixed campaign so far for United, who won their first trophy under Mourinho but also face a fight to finish in the top four of the Premier League and claim an automatic Champions League spot.\nUnited can also secure a place in Europe's elite club competition by winning the Europa League - they face Spanish side Celta Vigo in the first leg of the semi-final on May 4.\nJose Mourinho has been pleased with Manchester United's progress this season\nAnthony Martial and Wayne Rooney celebrate the Frenchman's goal against Burnley on Sunday\nUnited are currently fifth in the Premier League, but just one point off the top four\n'I would say this can be the first season of the next five or six or seven. It can be the first season of better years,' Mourinho was quoted as saying by Sky Sports.\n'And the reality is even in the first season of better years we won already and we have already the chance to do good things until the end of the season.\nMourinho has hinted that he plans to stay at United for at least five years\nMan United fixtures Premier League unless stated Thursday Manchester City (A) April 30 Swansea City (H) May 4 Celta Vigo (A) Europa League May 7 Arsenal (A) May 11 Celta Vigo (H) Europa League May 14 Tottenham Hotspur (A) May 17 Southampton (A) May 21 Crystal Palace (H)\n'If we manage to win the Europa League and in August to play the European Super Cup against the Champions League winner, it will be magnificent.'\nMourinho also denied that his recent public criticism of defender Luke Shaw and striker Anthony Martial was a psychological tactic aimed at inspiring them.\n'It is not a psychological approach,' Mourinho added. 'It is common sense. When you give everything you have, I cannot demand more from you.\n'Some other guys don't give everything they have so that's the point. They have to and when they do it, I'm happy with them, it doesn't matter how they perform.'\nUnited play Manchester City, who occupy fourth spot in the league, on Thursday.","url":"https://www.dailymail.co.uk/sport/football/article-4446586/Jose-Mourinho-says-better-years-await-Man-United.html"}
