{"authors":["Sam Cunningham For Mailonline"],"date_download":"2018-10-23 01:57:28","date_modify":"2018-10-23 01:57:28","date_publish":"2016-01-11 13:28:31","description":"SAM CUNNINGHAM EXCLUSIVE: United have been monitoring Hesketh for a number of years and have identified him as a bright prospect who has the potential to become a Premier League star.","filename":"data/vaneerConsumption/ManUnitedconsidermoveforSouthamptonsJakeHeskethintransfernewslatest.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/300A7CC400000578-0-image-a-43_1452518850964.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393932_Manchester-United-consider-Southampton-starlet-Jake-Hesketh-kick-start-overhaul-dwindling-youth-academy_1540259848.html","title":"Man United consider move for Southampton's Jake Hesketh in transfer news latest","title_page":"Man United consider move for Southampton's Jake Hesketh in transfer news latest | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"United desperate not to lose pace with city rivals Manchester City\nManchester United are considering a move for Southampton’s highly-rated teenager Jake Hesketh as part of their recruitment drive to re-stock young talent.\nUnited have instructed scouts to identify the best teenagers in the country to improve their ailing academy.\nThey have been busy this month working their web of contacts after senior officials made it clear they feel the club’s talent pool, which once delivered the Class of ’92, is dwindling.\nManchester United are considering a move for Southampton teenage starlet Jake Hesketh\nThey ordered a complete overhaul of the academy in December to ensure they do not lose pace with Manchester City.\nTheir rivals opened a £200million training complex 13 months ago and are already attracting the brightest potential talent.\nUnited have been monitoring Hesketh for a number of years and have identified him as a bright prospect who has the potential to become a Premier League star.\nThey have sent scouts to watch him several times this season.\nUnited have instructed scouts to identify the best teenagers in the country to improve their ailing academy\nPlaying as an attacking midfielder Hesketh was Southampton’s Under 18 top scorer in 2013 with 13 goals, which won him Scholar of the Season — an accolade James Ward-Prowse has also won.\nLast season, playing for the Under 21s, he helped win the Premier League Cup. He now trains regularly with the first team.\nSouthampton have indicated they have no intention of selling him and sources deny United have made contact about the player.\nUnited have been monitoring Hesketh for a number of years and scouts have regularly watched him\nThe 19-year-old has 18 months left on his contract, but even if he were to move when it expires the south coast club would be entitled to compensation at a tribunal worth several millions of pounds.\nHe has been at the club since he was eight years old and the fact he is becoming integrated with the first team would also add to his value.\nHesketh has played twice for the first team — coming on as a substitute against United and starting against Burnley last season — and Ronald Koeman sees him as one of the academy players who could become a regular in the first team.","url":"https://www.dailymail.co.uk/sport/football/article-3393932/Manchester-United-consider-Southampton-starlet-Jake-Hesketh-kick-start-overhaul-dwindling-youth-academy.html"}
