{"authors":["Pauline Bartolone","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:45:21","date_modify":"2018-10-30 22:45:21","date_publish":"2015-08-11 08:00:00","description":"Not far from the Amish farms of Central Pennsylvania, in the rolling hills southwest of coal mining country, Dennis Brubaker raises 30,000 pigs a year","filename":"data/vaneerConsumption/Manureforsomedollarsforothers.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/fiscalini_edit1-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939521.html","title":"Manure for some, dollars for others","title_page":"Manure for some, dollars for others | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Not far from the Amish farms of Central Pennsylvania, in the rolling hills southwest of coal mining country, Dennis Brubaker raises 30,000 pigs a year for slaughter. In four enclosed barns, the hogs gain two pounds a day away from predators. That is, until they are shipped away to be processed for supermarkets.\nMethane Digesters on California Dairy Farms SHARE Facebook\nTwitter\nEmail View More\n“All they have to do is eat and drink,” says Brubaker, co-owner of Ideal Family Farms in Beavertown, Pennsylvania. “They’re just very comfortable, and that’s what turns into growth.”\nAfter Brubaker and his three brothers bought the farm in 2007, energy costs were spiking. So Dennis started researching renewable energy methods to reduce electricity costs.\nWind power and solar energy weren’t the best options. Instead, he chose a system that gave purpose to the seven million gallons of pig waste that run through his farm every year: a million dollar methane digester.\nThe 16-foot deep concrete cauldron in the ground captures the potent greenhouse gas from the manure and routes it to an engine, where the methane combusts, and generates enough electricity every day to power 100 homes and heat half his farm.\n“Because of the manure that we had, and the need for energy, it was just the perfect fit,” says Brubaker.\nNow the farm is poised to receive thousands of dollars as an “offset” project through California’s cap and trade program. The carbon marketplace allows large California polluters to pay other businesses to reduce emissions instead of them. The system was set up through AB32, the California Global Warming Solutions Act of 2006.\nIdeal Family Farms is one of 50 livestock projects around the country that are approved by the California Air Resources Board (CARB) to offset emissions. Not one of those state-approved offset locations is in California.\nBut methane digesters on farms are not unheard of in California. In fact, the dairy industry estimates there are 11 operating from Kern to Sacramento County, and another two in Marin. Nine California methane digesters are listed on a private offset registry, the Climate Action Reserve.\nThe Reserve’s President, Gary Gero, says it may be just a question of time before the California digester projects are approved by CARB, to receive ongoing money for offsetting emissions. As to why the state-certified businesses so far are out-of-state, that simply points to the greater number of methane – capturing farms outside of California, Gero says.\n“It’s a question of ‘who is going to cross the finish line first.’”\nGero adds that some California farmers who own methane digesters may already receive money for offsetting emissions through private contracts.\nTOUGH REGULATORY ENVIRONMENT\nAs of March, 247 methane capture projects were operating on farms across the country, according to the Environmental Protection Agency.\nWhile Brubaker is paying a little more than a million dollars for the system on his pig farm, recent state grant information suggests the cost could reach six million on a California dairy farm.\nThe Western United Dairymen, a California dairy farmer’s association, claims environmental standards in California make it more difficult to get a manure digester off the ground here.\nPaul Sousa, Director of Environmental Services at the organization makes these points:\nAir quality standards require methane engines in the Central Valley to run extremely cleanly. That can require expensive technology, such as one piece of equipment that costs as much as a quarter of a million dollars.\nFood waste, such as deep fryer grease, enhances the biological process in the methane digester. But groundwater regulations restrict salt build-up, which requires controls on the waste leaving the digesters.\nThe price of electricity that farmers sell back to the grid is not high enough to help farmers pay off the cost of the digesters.\nThe San Joaquin Valley Air Pollution Control District recognizes its rules around Nitrogen Oxides (NOx) emissions are some of the most stringent in California. The air district also regulates Sulfur Oxides (S0x) emitted by methane engines.\nThe California Air Resources Board does not enforce those NOx and SOx emissions rules, but it also acknowledges that farmers running methane engines need a higher level of technology to comply with local air quality rules.\n“Because of the extreme air conditions in the Valley, they have to have very stringent controls,” says Stanley Young, Director of Communications for CARB.\nFUNDING CHANGES FOR CALIFORNIA FARMS\nThe economic feasibility of capturing methane on large animal farms may be changing with the influx of state dollars. For some farmers, it already has.\nIn July, five dairy farms up and down the Central Valley received a total of $11.1 million from the California Department of Food and Agriculture, for the start-up or redevelopment of digesters. The money was made available through the state’s cap and trade program.\nGov. Jerry Brown’s revised 2015-2016 budget pencils in an additional $20 million dollars for dairy digester systems. The reduction of the heat-trapping gas is one of his key proposals for reducing greenhouse gas levels to 40% below 1990 levels by 2030. Lawmakers will return to the Capitol later this month to finalize the amount.\nThe proposed $20 million is a fraction of the $500 million over five years that the Western United Dairymen requested. According to the group, the Governor’s proposal would “barely make a dent,” in curbing greenhouse gas emissions on California farms.\nBut back in Pennsylvania, Dennis Brubaker says even just thousands of dollars in ongoing revenue to offset California emissions will help sustain his project. He’s expecting his first check this year.\n“It’s pretty cool that we can have joint partnerships in trying to help make the environment better from one end of the country to the next,” says Brubaker.\nHis digester also brings in revenue by generating power for the grid, providing affordable waste disposal for local food producers, and creating renewable energy credits through a North Carolina program. And when the digester itself is paid off, barring any mechanical setbacks, he hopes to gain even more from his pigs’ manure.","url":"https://calmatters.org/articles/manure-for-some-dollars-for-others/"}
