{"authors":["Chris Wheeler For Mailonline"],"date_download":"2018-10-23 03:30:09","date_modify":"2018-10-23 03:30:09","date_publish":"2017-03-10 13:01:43","description":"Marouane Fellaini insists Chelsea's hammering of Manchester United in the Premier League in October will have no bearing on Monday's FA Cup quarter-final between the two clubs.","filename":"data/vaneerConsumption/ManUwillnotfeeleffectsofChelsealosssaysFellaini.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E1E43A400000578-0-image-a-41_1489147215651.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4301030_Man-U-not-feel-effects-Chelsea-loss-says-Fellaini_1540265409.html","title":"Man U will not feel effects of Chelsea loss, says Fellaini","title_page":"Man U will not feel effects of Chelsea loss, says Fellaini | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Marouane Fellaini insists Chelsea's hammering of Manchester United in the Premier League in October will have no bearing on Monday's FA Cup quarter-final between the two clubs at Stamford Bridge.\nJose Mourinho returns to his old side looking to avenge a 4-0 defeat having criticised Chelsea boss Antonio Conte for what he felt were over-exuberant goal celebrations on the touchline in the previous fixture.\nBut Fellaini does not believe there will be any hangover from that game as the FA Cup holders look to retain the trophy and add to their success in the EFL Cup last month.\nMarouane Fellaini says Chelsea's previous win over Manchester United is no longer relevant\nChelsea handed Jose Mourinho's team a pasting in October, running out 4-0 winners at home\n'It will be a tough game,' said the Belgium midfielder. 'Obviously we lost there a few months ago, but now it is the FA Cup and we will see what happens.\n'It will be tight. It is the FA Cup, it is one game. They are top of the league, they have confidence, they have great players, but we will show our quality there. Of course, they are confident so let's go there and see what we can do.'\nThe trip to Chelsea falls in between United's two Europa League last 16 ties against Rostov after Mourinho's side picked up a 1-1 draw on an awful pitch in Russia on Thursday night.\nFellaini, who played in Zlatan Ibrahimovic to set up Henrikh Mkhitaryan for United's goal, believes it will be a very different game when the teams meet at Old Trafford next week.\n'We have to do the job at Old Trafford,' he added. 'I think the pitch is bigger, there is more space for us, so we know how to play there.\n'It was a tough game on a hard pitch. There were a lot of duels, a lot of physicality so it was tough but it's 1-1 and we have a big chance at Old Trafford.\nFellaini competes for the ball with three Rostov players on the difficult pitch in Russia\n'The second game will be at Old Trafford on a better pitch, better atmosphere so we have a chance – 1-1 is a good result for us.\n'We know the Rostov team better, the players. It will be a difficult game at Old Trafford – completely different.\n'We only want to go game by game, try to win the games and make the quarter-finals. We have next Thursday first and then we will see.'","url":"https://www.dailymail.co.uk/sport/football/article-4301030/Man-U-not-feel-effects-Chelsea-loss-says-Fellaini.html"}
