{"authors":["Nik Simon For The Daily Mail"],"date_download":"2018-10-23 00:38:10","date_modify":"2018-10-23 00:38:10","date_publish":"2016-01-29 13:47:45","description":"Manu Tuilagi's hopes of appearing in this year's Six Nations appear to be as good as over after he suffered a hamstring injury in training for Leicester. The centre will be out for two weeks.","filename":"data/vaneerConsumption/ManuTuilagiunlikelytoplayforEnglandduringtheSixNationsafterinjuringhamstringintrainingwithLeicester.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30883C4800000578-0-image-a-18_1454075261943.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_rugbyunion_article-3422820_Manu-Tuilagi-unlikely-play-England-Six-Nations-injuring-hamstring-training-Leicester_1540255090.html","title":"Manu Tuilagi unlikely to play for England during the Six Nations after injuring hamstring in training with Leicester","title_page":"Manu Tuilagi unlikely to play for England during the Six Nations after injuring hamstring in training with Leicester | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"keep him out for two weeks\nManu Tuilagi has suffered yet another injury setback ahead of the RBS 6 Nations.\nTuilagi recently made his comeback from a 15-month groin problem and had fought his way into Eddie Jones’ England plans. After only three appearances for Leicester, however, he now faces ‘a couple of weeks’ out with a hamstring strain.\nThe 24-year-old had been earmarked to return against Wales on March 12, but Saracens fly-half Owen Farrell now seems destined to fill in at inside centre.\nManu Tuliagi takes on the Stade Francais defence in a Champions Cup game last weekend\n‘It’s obviously a shame for Manu,’ said England defence coach Paul Gustard. ‘Everybody wants to see Manu play rugby again, not least a defensive coach. As and when he gets back fit, we’ll welcome him with open arms.’\nFarrell will start outside Bath fly-half George Ford, rekindling the partnership they formed at England age-group level and used sparingly at Test level under Stuart Lancaster.\n‘Owen can play for England in both positions with aplomb,’ said Gustard. ‘He’s just a wonderful rugby player — his awareness, his skill set and his attitude in terms of wanting to go and get people defensively as a No 12.\nBath centre Ollie Devoto (left) gets a chance for England in Tuilagi's absence\n‘Owen and George played with each other as kids. They are both very good. If we can get them both on the pitch and performing, then it could be their time.’\nWith Henry Slade also sidelined by long-term injury, uncapped Bath centre Ollie Devoto is expected to provide cover for the opening Test against Scotland at Murrayfield.\nDespite failing to nail down a starting place at Bath, Devoto survived Jones’s first squad cull because of his versatility to cover multiple positions.","url":"https://www.dailymail.co.uk/sport/rugbyunion/article-3422820/Manu-Tuilagi-unlikely-play-England-Six-Nations-injuring-hamstring-training-Leicester.html"}
