{"authors":["Matt Dathan","Mailonline Political Correspondent"],"date_download":"2018-10-22 22:48:36","date_modify":"2018-10-22 22:48:36","date_publish":"2016-01-28 11:10:43","description":"The accuser, known only as 'Nick', claimed that the former army chief and D-Day veteran abused him from 1976 to 1984 but his family told police last summer that his claims were 'ridiculous'.","filename":"data/vaneerConsumption/ManwhoaccusedLordBramallofsexabuseisafantasist.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/10/30A6B27100000578-0-image-a-3_1453976799029.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420699_Man-accused-Lord-Bramall-sex-abuse-fantasist-says-family_1540248516.html","title":"Man who accused Lord Bramall of sex abuse is a 'fantasist'","title_page":"Man who accused Lord Bramall of sex abuse is a 'fantasist' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Lord Bramall's accuser, known as 'Nick', claimed he had been abused by the former army chief\nThe family of the man who accused war hero Lord Bramall of historical sex abuse warned police of contradictions in his evidence last summer, it has emerged.\nThe accuser, known only as 'Nick', alleged that the former army chief and D-Day veteran abused him at an army base from 1976 to 1984.\nBut Scotland Yard dropped its investigation into Lord Bramall earlier this month and it was revealed that the case against him was so weak that a file was not even submitted to the Crown Prosecution Service.\nNow members of Nick's own family have described some of his allegations as 'fantasy' and have submitted evidence – including photographs – which they say will discredit the claims.\nLord Bramall was among a number of high profile figures accused of abuse by Nick and included Sir Edward Heath, the former prime minister and Lord Brittan, the former home secretary.\nAllegations by Nick sparked the Metropolitan Police's Operation Midland investigation, which is estimated to have cost the taxpayer £2 million to run.\nNick, who is in his 40s, told police that he had been passed to the VIP paedophile ring by his late stepfather, who he claimed had also abused him.\nNick also claimed to be a Jimmy Savile victim while appearing on a TV crime documentary in 2014\nBut his stepfather's ex-wife, who cannot be named for legal reasons, told the Daily Telegraph that although Nick's stepfather - who died in the mid-1990s - was 'not a particularly good husband,' he was a 'very proper man' and said his family could not believe Nick's 'ridiculous' claims.\n'I knew him and I just can't believe for one minute what has been said about him,' she said.\n'I simply do not recognise the person Nick has described. It just sounds like fantasy.'\nShe added that her daughter has photographs that can prove Nick's statements were inconsistent with the truth.\nIn a statement to police Nick had said his stepfather explained away bruising on his body by saying he had fallen off a horse, but Nick insisted he had never ridden a horse in his life.\nOne of the photographs handed to the police shows Nick on horseback, which his family hope will clear his stepfather's name.","url":"https://www.dailymail.co.uk/news/article-3420699/Man-accused-Lord-Bramall-sex-abuse-fantasist-says-family.html"}
