{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:51:13","date_modify":"2018-10-30 19:51:13","date_publish":"2015-11-11 21:21:12","description":"Man Who Equates Gun Rights With Motocycle Ownership Gets White House Invite","filename":"data/vaneerConsumption/ManWhoEquatesGunRightsWithMotorcycleOwnershipGetsWhiteHouseInvite.json","image_url":"https://media.breitbart.com/media/2015/11/Motorcycles-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_11__1540929073.html","title":"Man Who Equates Gun Rights With Motorcycle Ownership Gets White House Invite","title_page":"Man Who Equates Gun Rights With Motorcycle Ownership Gets White House Invite | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On October 3, Mark Carman posted a YouTube video in which he equated gun rights with motorcycle ownership–arguing that the licensing requirement for the latter provides some standard to guide licensing requirements for the former–and the White House responded by inviting him to come visit on November 16 and 17.\nWhile there Carman is scheduled “to meet one-on-one with Valerie Jarrett, senior advisor to President Obama,” and to address Congress in a bid to secure more gun control.\nAccording to PRWeb, Carman refers to himself as “just a guy” who owns guns but believes the actions of criminals justify expanding gun control to cover the law-abiding as well. This expansion entails requiring all would-be gun owners in every setting–retail or private–to pass the same background check that was passed by Gabby Giffords’ attacker and the Umpqua Community College attacker when they acquired their guns.\nCarman admits that the shootings that get so much attention are not being committed by law-abiding citizens, then he calls for more gun control for law-abiding citizens.\nHe does all of this without ever mentioning two things: 1. It is harder to find a mass public attacker who did not pass a background check than it is to find one who did. 2. These events are not the result of gun availability but of gun free zones. We’ve always had guns–guns are part of American culture–but we haven’t always had gun free zones. The left invented gun free zones and they have proven to be nothing less than killing fields.\nIn addition to expanding background checks to cover all gun sales, Carman believes a licensing requirement for all gun owners should be place. And he explains his thinking on this in a way that equates the natural rights hedged in by the Second Amendment with laws that allow us to drive motorcycles.\nCarman said:\nWhat if we just took the same kind of rules it takes to get an operator’s license for a motorcycle? First of all, you have to take the written exam and you have to understand motorcycle safety. Then you have to show proficiency in the use thereof, so that you don’t kill yourself or somebody else. Now it’s legal to operate an airplane in the United States of America but you have to take a test and have specific training. Why couldn’t we do that with firearms?\nHe said, “It is not an infringement of one’s constitutional right under the Second Amendment if we just have some rules in place.”\nNow, if you wonder how he can say these things with a straight face, just consider his view of the Second Amendment. He says it was not intended to protect an individual right, rather, it was put in place to protect a collective right framed around the militia. Carman said, “Now whether you want to believe it or not, the Founders. when they put that Second Amendment together, that was indeed intended for the militia.” He explains that that basically means the Second Amendment protects the right to keep and bear arms if you are in the “National Guard.” Carman argues this shifted when the Supreme Court applied the right to individuals, which is the very same argument The New York Times and Los Angeles Times have been making via their contentions that an individual right to keep and bear arms did not exist prior to a Supreme Court decision in 2008.\nThis is who the White House invited up for a meeting with Valerie Jarrett and a full-on gun control presentation to the Congress of the United States.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/11/11/man-equates-gun-rights-motorcycle-ownership-gets-white-house-invite/"}
