{"authors":[],"date_download":"2018-10-22 22:09:16","date_modify":"2018-10-22 22:09:16","date_publish":"2014-05-09 02:53:32","description":"Gonzalez-Herrera and his co-conspirators used several stash houses in the Phoenix area.","filename":"data/vaneerConsumption/ManWhoHelpedSmuggleOver800PeopleIntoUSSentenced.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_man-who-helped-smuggle-over-800-people-u-s-sentenced-n101011_1540246156.html","title":"Man Who Helped Smuggle Over 800 People Into U.S. Sentenced","title_page":"Man Who Helped Smuggle Over 800 People Into U.S. Sentenced ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Guatemalan man was sentenced to 57 months in federal custody Wednesday after he pleaded guilty to conspiracy to illegally transport and harbor more than 800 people, court documents filed in Arizona show.\nBeginning in 2012 and through April, 2013, Rony Abimael Gonzalez-Herrera, 37, and his co-conspirators \"would transport and move, conceal, harbor and shield from detection\" at least 827 people into the United States from Mexico, according to the indictment papers filed in August in the Arizona District Court. Gonzalez-Herrera also demanded smuggling fees, documents show.\nThe smuggling operation was based out of Little Rock, Arkansas.\nOne man told officials Gonzalez-Herrera instructed him to deposit $2,700 in a Bank of America account to pay for his brother's smuggling fee, according to the official court complaint. When his brother was arrested by law enforcement, the man contacted Gonzalez-Herrera to request a refund, but received threats instead. Court documents allege Gonzalez-Herrera warned the man he would retaliate against his family.\n\"Your family will pay if you keep asking for the return of any money!\" he said, according to the official complaint.\nTo conduct this operation, Gonzalez-Herrera and his co-conspirators used several stash houses in the Phoenix area, including one discovered in January 2013 with more than 40 people who illegally entered the United States inside.\n—Becky Bratu","url":"https://www.nbcnews.com/news/us-news/man-who-helped-smuggle-over-800-people-u-s-sentenced-n101011"}
