{"authors":[],"date_download":"2018-10-22 21:07:32","date_modify":"2018-10-22 21:07:32","date_publish":"2014-06-04 09:51:10","description":"A judge agreed Tuesday to toss out a conviction in a 1997 fatal shooting, the seventh defendant this year cleared in an probe of old homicide cases.","filename":"data/vaneerConsumption/ManWalksFreeAfter17YearsinPrisonFollowingDAReview.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_man-walks-free-after-17-years-prison-following-da-review-n122071_1540242452.html","title":"Man Walks Free After 17 Years in Prison Following DA Review","title_page":"Man Walks Free After 17 Years in Prison Following DA Review","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA judge agreed on Tuesday to toss out a conviction in a 1997 fatal shooting, making it the seventh time this year a defendant has been cleared in an exhaustive reexamination of old homicide cases.\nBrooklyn District Attorney Kenneth Thompson asked the judge to release Roger Logan based on new evidence turned up by prosecutors' conviction review unit that called into question the credibility of a purported eyewitness.\nLogan, 53, walked out of court a free man on Tuesday after serving nearly 17 years of a 25-years-to-life sentence.\nSince taking office in January, Thompson has intensified the work of the review unit, agreeing to re-examine 90 cases from the 1980s and 1990s to determine if there were wrongful convictions. Most of them stem from concerns about the investigative tactics of now-retired police detective Louis Scarcella.\nNew evidence that Scarcella coached a witness to pick a suspect out of a lineup led to the release last year of David Ranta, who served 23 years in prison in the slaying of a Brooklyn rabbi. That decision sparked renewed allegations that Scarcella fabricated confessions, manipulated witnesses and intimidated suspects in other cases, charges he denies.\nAfter seeing press coverage of the Ranta decision, Logan contacted prosecutors from prison and said Scarcella and other detectives had framed him in a fatal shooting that stemmed from a dispute at a dice game. The review turned up old police records showing that a woman who claimed she had seen Logan at the dice game was in fact in custody at the time of the game.\nOf 57 Scarcella-related cases, the review board has determined that 11 convictions should stand, prosecutors said.\n— The Associated Press","url":"https://www.nbcnews.com/news/crime-courts/man-walks-free-after-17-years-prison-following-da-review-n122071"}
