{"authors":[],"date_download":"2018-10-30 19:43:25","date_modify":"2018-10-30 19:43:25","date_publish":"2018-08-20 19:52:00","description":"The man accused of killing 24-year-old Taylor Bins in DeKalb County is asking for bond.","filename":"data/vaneerConsumption/ManwantsbondafterallegedlykillingwomanoverawatchinDeKalb.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/02/Images/Capture_474x297.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_man-wants-bond-a_981be90bbeeb34a48015ff670e10112f__1540928605.html","title":"Man wants bond after allegedly killing woman over a watch in DeKalb","title_page":"Man wants bond after allegedly killing woman over a watch in DeKalb","title_rss":"NULL","source_domain":"ajc.com","text":"The man accused of killing 24-year-old Taylor Bins in DeKalb County is asking for bond.\nJason Leroy Brown, 34, who is accused of murder for allegedly killing her during a fight over a watch, is set to appear in court at the county courthouse Friday at 9 a.m\nThe woman died July 26 around 7 or 8 a.m. on Hitt Lake Trail off Rockbridge Road outside Stone Mountain. Warrants say witnesses told police the suspect came looking for the victim about a watch.\nREAD: Brother: Atlanta family saw miraculous sights in New Mexico desert\nREAD: Fake ‘City of Atlanta’ Facebook page back after Stone Mountain prank\nREAD:2 young people accused in death of DeKalb man stabbed 33 times\nWhile arguing with her about it, he began to beat her and dragged her down the stairs and into the street, the warrants allege. Along the way, it appeared Bins had a seizure and died.\nThe suspect’s relationship to the victim hasn’t been released, but warrants call the case one of family violence. Brown is said to have left the scene but was booked into jail days later on a murder charge.\nLike DeKalb County News Now on Facebook | Follow on Twitter\nIn other news:","url":"https://www.ajc.com/news/local/man-wants-bond-after-allegedly-killing-woman-over-watch-dekalb/xQI6YSXaOQlJdaNjb0wQmK/"}
