{"authors":["Linda Satter"],"date_download":"2018-10-30 18:18:03","date_modify":"2018-10-30 18:18:03","date_publish":"2018-07-26 04:30:00","description":"A Cuban citizen admitted Wednesday that in 2015 and 2016, he personally collected $1.3 million from worried taxpayers in Arkansas, 16 other states and the District of Columbia as part of a nationwide scam through which a group of Cubans posed as U.S. government officials.","filename":"data/vaneerConsumption/ManwhoposedasIRSofficialtook13MadmitsguiltinArkansasbasedscam.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_jul_26_cuban-admits-guilt-in-state-based-scam--1__page=1_1540923483.html","title":"Man who posed as IRS official, took $1.3M admits guilt in Arkansas-based scam","title_page":"Man who posed as IRS official, took $1.3M admits guilt in Arkansas-based scam","title_rss":"NULL","source_domain":"arkansasonline.com","text":"A Cuban citizen admitted Wednesday that in 2015 and 2016, he personally collected $1.3 million from worried taxpayers in Arkansas, 16 other states and the District of Columbia as part of a nationwide scam through which a group of Cubans posed as U.S. government officials.\nAngel Chapotin Carrillo, 42, has been in federal custody in Arkansas since April 2017, after he and nine others were indicted in Little Rock on fraud charges involving more than 750 victims in Arkansas, North Carolina, Virginia, Maryland, New Jersey, Pennsylvania, Oregon, Utah, Idaho, Oklahoma, Alabama, Minnesota, Wisconsin, Missouri, Kansas, Iowa, Washington state and Washington, D.C.\nThe Arkansas indictment covers only part of a nationwide scheme that has also led to indictments in other federal jurisdictions and is believed to have defrauded about 7,000 victims of about $9 million altogether.\nCarrillo was considered one of the \"top runners\" in the Arkansas-based scheme, in which people pretending to be IRS officials called taxpayers, telling them they had outstanding tax debts and were about to be arrested or sued unless the debts were paid immediately.\nFloyd Orrell, an agent for the Office of the Treasury Inspector General for Tax Administration, testified at a hearing in Little Rock last summer that the callers urged their victims to immediately go to a bank, often while the caller remained on the line, and wire cash to an IRS official in another state.\nThe \"IRS official\" in the other state was actually one of several runners, like Carrillo, who would be dispatched to pick up the cash, usually from Walmart-2-Walmart Money Transfer stations, Orrell said. He said that service was preferred because it only required a recipient to supply a name and address to pick up the money, and the money could be obtained at any Wal-Mart location in the designated state. Orrell said MoneyGram was also used, but recipients were required to show identification there and fill out receipts.\nAssistant U.S. Attorney Hunter Bridges told U.S. District Judge Billy Roy Wilson at Carrillo's plea hearing Wednesday that officials were able to obtain numerous photographs and videos showing Carrillo picking up the cash.\nBridges said Carrillo and two other people he traveled with would then send the proceeds to Yosvany Padilla, 27, in Florida, in the form of bulk cash drops or by depositing the funds in bank accounts associated with Padilla. Orrell described Padilla as \"the main leader of this particular group.\"\nIn January, Padilla pleaded guilty to a charge of wire-fraud conspiracy -- the same charge to which Carrillo pleaded guilty Wednesday. Padilla's sentencing was set for April but has been postponed. Carrillo's sentencing is set for 10:30 a.m. Oct. 23.\nPadilla admitted being involved in the Arkansas-based conspiracy between March 2015 and May 2016. He said he coordinated, produced and distributed false identification documents for other co-conspirators.\nTwo other defendants in the Arkansas case -- Dennis Delgado Caballero, 39, of Miami and Jeniffer Valerino Nunez, 21, of Cuba -- have pleaded guilty and are awaiting sentencing before Wilson. The others are awaiting trial, except for one person who remains at large.\nCarrillo was living in Hialeah, Fla., when he was arrested in 2017. Orrell said Carrillo was able to travel easily across the country by plane and automobile, using his various false identities.\nThe wire-fraud conspiracy charge is punishable by up to 20 years in prison and a fine of up to $250,000.\nFederal sentencing guidelines, which suggest penalty ranges within the statutory maximum, won't suggest a particular sentence range for Carrillo until a pre-sentence investigation is complete. However, Bridges and defense attorney Richard Mays Jr. stipulated in Carrillo's plea agreement that he will face several sentencing enhancements because the loss totaled more than $1.5 million, the crime resulted in substantial financial hardship to 25 or more victims and Carrillo carried out his crime by acting like he was representing a government agency.\nHe will receive credit for pleading guilty, but the enhancements far outweigh the credit.\nADVERTISEMENT\nMore headlines\nMetro on 07/26/2018","url":"https://www.arkansasonline.com/news/2018/jul/26/cuban-admits-guilt-in-state-based-scam--1/?page=1"}
