{"authors":["Kipp Jones"],"date_download":"2018-10-30 19:38:15","date_modify":"2018-10-30 19:38:15","date_publish":"2014-12-29 15:50:46","description":"A man in Ohio reportedly attempted to to cash in on all the controversy surrounding Seth Rogen and James Franco’s The Interview last week but failed to do so after purchasing $650 in tickets.","filename":"data/vaneerConsumption/ManWantsRefundAfterFailingtoSellTicketstoTheInterview.json","image_url":"https://media.breitbart.com/media/2014/12/The-Interview-Posters-upside-down-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2014_12_29__1540928295.html","title":"Man Wants Refund After Failing to Sell Tickets to 'The Interview'","title_page":"Man Wants Refund After Failing to Sell Tickets to 'The Interview'","title_rss":"NULL","source_domain":"breitbart.com","text":"A man in Ohio reportedly attempted to to cash in on all the controversy surrounding Seth Rogen and James Franco’s The Interview last week but failed to do so after purchasing $650 in tickets.\nAfter Sony’s reversal of its initial decision to shelve the film’s release in the wake of the hacking scandal that left the studio reeling, and the issuance of terroristic threats against exhibitors planning to show the film, Jason Best purchased 50 tickets at $13 each, hoping to resell them for a higher price.\nBest purchased the tickets online for the film’s Christmas Day release at the Esquire Theatre in Clifton, Ohio, according to WCPO in Cincinnati.\n“I saw all the hype about The Interview on the 23rd and thought, ‘Hey, folks are selling these tickets in other cities and it seems like that’s the thing to do right now, so why not give it a shot so see how it goes,”’ he said.\nAfter Sony announced it would also be streaming the film online for half the box-office price, Best saw the demand for tickets drop and requested a refund.\n“I thought I’d get my money back because the theater’s website *very clearly* said the tickets were refundable,” he told WCPO in an email.\nHe was reportedly informed by theater management that the venue didn’t have a website and that The Interview was actually listed as a special event.\nThe man had apparently bought the tickets from movietickets.com, which had warned on its website that theater owners could reserve the right to withhold refunds for special events.\nBest was also informed by management that ticket scalping is an illegal practice, and instead of giving him a refund, offered to donate his $650 to charity.\nThe Interview earned nearly $3 million of its $44 million budget in U.S. theaters over the extended holiday weekend and another $15 million online.","url":"https://www.breitbart.com/entertainment/2014/12/29/scalper-demands-refund-after-failing-to-sell-tickets-to-the-interview/"}
