{"authors":[],"date_download":"2018-10-23 03:53:25","date_modify":"2018-10-23 03:53:25","date_publish":"2016-01-29 19:10:28","description":"An assault to retake the Iraqi city of Mosul from the Islamic State group won't start for many months, a spokesman for the US-led coalition fighting the jiha...","filename":"data/vaneerConsumption/ManymonthsbeforestartofbattleforMosulcoalition.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i51v-4PuZeKVXE7cd9005b2c876d6c88d-931_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423323_Many-months-start-battle-Mosul-coalition_1540266805.html","title":"'Many months' before start of battle for Mosul: coalition","title_page":"'Many months' before start of battle for Mosul: coalition | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'Many months' before start of battle for Mosul: coalition\nAn assault to retake the Iraqi city of Mosul from the Islamic State group won't start for many months, a spokesman for the US-led coalition fighting the jihadists said Friday.\nIraq's second largest city fell to IS fighters in June 2014 as they overran vast regions in northern and north-central Iraq, as well as in Syria.\nIraqi security forces who were supposed to secure the city collapsed in the face of the extremists' advance.\nIraqi Kurdish forces are seen stationed on a hill top as smoke billows during an operation by Iraqi Kurdish forces backed by US-led strikes in the northern Iraqi town of Sinjar, in the northern Iraqi province of Mosul, on November 12, 2015 ©Safin Hamed (AFP/File)\nIt \"is going to be many months before we see actual operations for Mosul begin,\" Colonel Steve Warren, a Baghdad-based spokesman for the coalition told reporters\n\"Right now, our focus is let's start training some brigades, let's start building some combat power, let's continue to train some police,\" he said via videoconference from Baghdad.\nWhen the offensive can be launched will depend on the speed of the training effort, he added.\nUS officials -- who have been pushing Iraq to launch an assault on Mosul following recent successes including the recapture of the city of Ramadi -- have repeatedly highlighted the need to increase the number of Western military trainers in Iraq.\nThe question is expected to be taken up during a February 11 Brussels meeting of coalition defense ministers.\nWarren said the coalition currently envisioned launching roughly 10 brigades for the Mosul assault, with each one representing about 2,000 to 3,000 soldiers.\n\"These are all to be trained,\" Warren said of the soldiers.\nSome of the brigades have already been trained by the coalition but \"we want to give them additional training,\" he added.\nThe United States has deployed some 3,500 soldiers in Iraq, with the mission to train and advise local troops.\nMosul, in northern Iraq, lies some 50 miles (80 kilometers) west of the Kurdish capital, Arbil.\nThe city holds special significance for the IS group, as it was where IS leader Abu Bakr al-Baghdadi proclaimed his \"caliphate\" straddling Iraq and Syria.","url":"https://www.dailymail.co.uk/wires/afp/article-3423323/Many-months-start-battle-Mosul-coalition.html"}
