{"authors":[],"date_download":"2018-10-30 01:22:14","date_modify":"2018-10-30 01:22:14","date_publish":"2018-09-10 00:00:00","description":"More people with high incomes in metro Atlanta are choosing to rent instead of buy homes.","filename":"data/vaneerConsumption/ManyhigherincomeAtlantahouseholdsarechoosingtorent.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/10/Videos/4479822.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/business_metro-atlanta-many_6c3dac9fa683a483a66ff1c57094a9d3__1540862534.html","title":"Many higher income Atlanta households are choosing to rent","title_page":"Many higher income Atlanta households are choosing to rent","title_rss":"NULL","source_domain":"ajc.com","text":"Jake Mendelson really likes his apartment in Chamblee, a nice place near the Brookhaven line that is close to stores and restaurants and just a 10-minute drive to work. He’s a renter because he wants to be, not because he needs to be.\nThe 24-year-old investment expert isn’t philosophically opposed to owning. He just doesn’t want to be locked into a mortgage if his life takes a turn out of town.\nThe need for flexibility is only one of the reasons behind a growing number of people in metro Atlanta who find renting places to live more appealing than buying, even though they have good paying jobs.\nA study by the Atlanta Regional Commission shows that, in the past decade, the number of renter households with incomes of at least $75,000 has surged from 69,000 to 181,000, outpacing population growth. In that time, the share of renters with income of $75,000 or more jumped from 12 percent to nearly 23 percent.\n“Historically, we’ve always assume that, once people got the means to buy a house, they would buy one,” said Mike Carnathan, manager of research and analytics at the ARC. “That is no longer the case.”\nA generation or two ago, renting in metro Atlanta was generally for those who were new to town or who simply couldn’t afford to buy. New homes were plentiful and — especially if you were willing to drive a little — affordable.\nWhat has changed?\nFor starters, there was the burst of the housing bubble and a painful recession. Metro Atlanta saw an estimated quarter-million foreclosures and double-digit unemployment. Many people had to dig out of deep financial holes, and they remember.\n“Atlanta was ground zero for the foreclosure crisis, and it wasn’t that long ago,” said Dan Forsman, president and CEO of Berkshire Hathaway HomeServices in Georgia. “Some people got stung. They think, if I experienced a loss previously, I just won’t do it again.”\nBut “there is no one single explanation,” Carnathan said.\nDemographics are also part of the story, explained Chris Salviati, economist for Apartment List, a national online catalog of rentals.\nAt one end of the working-age spectrum, millennials are still finding their ways into careers and not yet having children. At the other, boomers are retiring, downsizing and looking to live in a place close to their leisure activities.\n“Both have reasons to rent rather than own,” Salviati said. “That is something that’s true of both generations.”\nJake Mendelson, 24, could buy a home, but isn’t quite sure about his long-term plans, so he prefers to rent. (Contributed) (The Atlanta Journal-Constitution)\nEven the millennials with good jobs — like Mendelson — don’t make long-term assumptions, he said “The days are gone when you would work at one company for 30 years,” Salviati said. “You want to keep your options open, so you can be flexible geographically.”\nFor some, though, it does boil down to affordability.\nWhile Atlanta rents have climbed, the increase is nothing like the hike in home prices.\nMany people with solid incomes have debts — student loans, credit cards — that make it especially hard to put together the down-payment for a home.\nMoreover, in the first years after the housing crash, few new homes were built. Even now, despite the growth in population, construction is less than half of what it was at the peak of the boom. Inventory – that is, the supply of homes listed for sale – is limited, so home prices have risen dramatically.\nMany unable to buy homes in the areas they want to live are choosing to rent.\nInvestors add to the market’s momentum. They see the chance to make money – so they scoop up homes and rent them out, figuring at some point to sell them at a healthy profit, said Torrence Ford, an Atlanta broker for Re/Max.\n“About 50 percent of my business has turned to investors. They are taking advantage … and they are creating cash flow.”\nAdding to the demand for rentals is the burgeoning film industry, he said. “People come in and need rentals for the short-term, for six months or less.”\nBrad Dillman, chief economist for Atlanta-based Cortland Partners. (Contributed) (The Atlanta Journal-Constitution)\nIn the past year, average rents in the region were up 1.5 percent, according to Apartment List. In contrast, the price of a home has climbed 8.4 percent, according to Re/Max of Georgia.\nWhatever the reasons, the trend is national.\nThe rate of home ownership overall in the United States dropped from nearly 70 percent in 2005 to 62.9 percent, according to the Federal Reserve Bank of St. Louis. If the rate were still at that higher level, there would be 6.18 million more homeowners nationally and 202,500 more homeowners in Georgia.\n“A lot of people who would have been homeowners before are not owners today,” Brad Dillman, chief economist for Atlanta-based Cortland Partners, an investment firm that owns and manages more than 45,000 apartment homes.\nStill, the trajectory need not go on indefinitely — not if the millennials’ personal finances continue to improve.\n“The home ownership rate for people under the age of 35 has actually been increasing, even if the rate is still very low,” Dillman said. “A lot of people are skipping the entry-level home phase and then, when they buy, they will go to their ‘forever’ home. I am personally an example of that.”\nAnd some day, Mendelson expects he will be a homeowner, as well.\n“I would definitely want a typical single-family home at some point,” he said. “But I’m not sure where I’m going to be in three to five years.”","url":"https://www.ajc.com/business/metro-atlanta-many-higher-income-households-are-choosing-rent/fRNXoKc043OYpvhMNAFFNI/"}
