{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline","Larissa Brown","Ian Drury For The Daily Mail"],"date_download":"2018-10-23 01:41:58","date_modify":"2018-10-23 01:41:58","date_publish":"2016-01-29 15:50:16","description":"Mr Justice McCloskey also said many in the Calais camp, pictured, have 'no real basis' to be there and will decline asylum in France in favour of Britain because of 'perceived advantages'.","filename":"data/vaneerConsumption/ManyinCalaisJungleARENTrefugeesandAREafterbenefitsjudgesays.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B445A300000578-0-image-a-53_1454086569235.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422995_Many-migrants-Calais-Jungle-aren-t-actually-refugees-choose-Britain-advantages-leading-immigration-judges-rule_1540258918.html","title":"Many in Calais Jungle AREN'T refugees and ARE after benefits, judge says","title_page":"Many in Calais Jungle AREN'T refugees and ARE after benefits, judge says | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ruling: Immigration judge Mr Justice McCloskey, said migrants are claiming asylum because of the 'perceived advantages' of lodging an application in Britain\nMany migrants living in the 'Jungle' camp in Calais are 'probably not' genuine refugees who flock there just to get to the UK, a senior immigration judge said today.\nMr Justice McCloskey also said many have 'no real basis' to be there and will decline to claim asylum in France in favour of Britain because of 'perceived advantages'.\nHe also said there was no reason for many in the squalid camp to remain there.\nHis warning came in a landmark ruling allowing three teenagers and a disabled man from Syria to come to Britain from Calais because their siblings are already here.\nCampaigners claim the case could clear the way for hundreds more to come from the Calais camp\nJustice McCloskey said their case was 'special' but admitted that it could lead to hundreds more similar asylum applications.\nHis full judgment, issued today said: 'It seems likely that there is no real basis for many of its occupants remaining indefinitely in The Jungle and enduring the conditions that obtain there.\n'Many are probably not refugees in any general sense or any sense entitled to recognition.\n'Rather, they are migrant nationals of a number of countries outside the European Union, who, while intending to make a claim for refugee status, decline to make the claim in France due to perceived advantages, correct or otherwise, of doing so in the United Kingdom.\n'In general terms there is no basis at all for thinking that a person who claims asylum in France will not be treated properly and will not have the benefit of the reception and other facilities which those duties entail.'\nThe comments won strong applause last night. ‘The judge is absolutely right,’ said Tory MP David Davies. ‘They are all economic migrants because they have travelled through many safe countries to be there.\n‘There is no reason for them to be there because they could claim asylum anywhere. They perceive that they can get more benefits and work in the UK.’ Conservative colleague Peter Bone added: ‘Judges don’t say these things lightly and he is saying what most people know – that most people there are not genuine refugees.’\nSpecial case: Four Syrian refugees who won a landmark legal case to come to Britain (blurred for legal reasons) and could lead to hundreds more similar asylum applications\nLawyers for the young men - three teenagers and a 26-year-old with mental health problems - argued that they faced 'intolerable' conditions and had a right under Article 8 of the Human Rights Act to be reunited with family members already living in Britain legally.\nGERMANY FACED WITH 'NEW LEVEL OF HATE AND VIOLENCE AGAINST MIGRANTS Anti-migrant tensions in Germany rose to a ‘new level of hate and violence’ yesterday when a live hand grenade was thrown into a refugee centre. Police said ‘it was just luck’ that the device failed to detonate at the home in Villingen-Schwenningen in the southern state of Baden-Wurttemberg, where around 200 migrants live. Germany took in nearly 1.1million asylum seekers last year and figures released yesterday showed there were 1,005 attacks on refugee homes there last year – five times more than in 2014. Federal justice minister Heiko Maas said the grenade attack was a ‘new level of hate and violence’, adding: ‘We need to … ensure xenophobic crimes are more rapidly solved and punished more severely.’\nThe four fled Syria in September and ended up in a refugee camp known as The Jungle in Calais in October but have since been unable to get to the UK.\nSpeaking under the condition of anonymity, one said: ‘I’m very glad the case is now going to open the door to so many others to get here safely.’\nAt the High Court a week ago Mr Justice McCloskey outlined his case for granting the four young men the chance to reunite with family members who have already been granted asylum in the UK.\nHe said: 'The spotlight in these proceedings is on an area just across the English Channel from Dover which has become known as 'the jungle'.\n'This is a bleak and desolate place on the coast of northern France. Unlike other jungles, this place is inhabited by human beings not animals.'\nHe recounted the experience of a 'concerned English public representative in the camp' who wrote: 'I have just returned from the camps in Calais and Dunkirk.\n'The conditions are so bad, that describing them cannot capture the squalor. You have to smell conditions like these and feel the squelch of the mud to appreciate the horror.'\nMany of the people living in The Jungle in Calais, pictured, are probably not refugees 'in any general sense', Britain's most senior immigration judge has said\nThe comments won strong applause last night. ‘The judge is absolutely right,’ said Tory MP David Davies\nMr McCloskey went on to explain that he had to balance the applicants' 'right to respect for a family life, under Article 8 of the Human Rights Convention' against the 'secretary of state's refusal to admit the applicants to the United Kingdom with the full rigour of the Dublin Regulations'.\nHe said: 'The answer to this question involves a balance of public interest, namely the maintenance of immigration control, with the family life of the applicants.'\nIn deciding he took into account the 'applicants ages, the mental disability with regards one of the applicants, accrued psychological damage, a clear likelihood of further psychological turmoil, their previous family life.\n'The balance tips in favour of the applicants' human rights.'\nOne woman carries her baby wrapped in a silver thermal blanket after arriving into Europe\nGeorge Osborne’s new national living wage, due to reach £9 an hour by 2020, could be a ‘magnet’ that lures more European migrants to Britain, officials fear\nGeorge Gabriel, of charity Citizens UK, said they expect the judgment to affect 200 or 300 young people and unaccompanied minors in Calais and Dunkirk.\nHe added: 'We hope to roll out legal support for them in a matter of days.'\nUnder European asylum rules known as the Dublin Regulation, the teenagers were entitled to seek sanctuary in the UK because of their family links.\nEarlier this week, the vice-president of the European Commission said that more than half of all migrants to Europe were motivated by economic reasons. Dutch politician Frans Timmermans said most were from North African countries such as Morocco or Tunisia, where there is no conflict.\nGeorge Osborne’s new national living wage, due to reach £9 an hour by 2020, could be a ‘magnet’ that lures more European migrants to Britain, officials fear. ‘Someone sitting in southern Italy or Romania will be thinking that Britain looks a very attractive proposition,’ a Whitehall source said.","url":"https://www.dailymail.co.uk/news/article-3422995/Many-migrants-Calais-Jungle-aren-t-actually-refugees-choose-Britain-advantages-leading-immigration-judges-rule.html"}
