{"authors":[],"date_download":"2018-10-23 05:17:26","date_modify":"2018-10-23 05:17:26","date_publish":"2016-02-29 00:00:00","description":"An NPR poll finds that many people have a low opinion of the health care system, yet they like their doctors. The perception of quality of care varies according to income.","filename":"data/vaneerConsumption/ManyDislikeHealthCareSystemButArePleasedWithTheirOwnCare.json","image_url":"https://media.npr.org/assets/img/2016/02/26/hannbarczyk_npr_medical_finalart_wide-a94bf2714b29bf01cfe25f39dbbfae73b4de7a82.jpeg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=468244777_1540271846.html","title":"Many Dislike Health Care System But Are Pleased With Their Own Care","title_page":"Many Dislike Health Care System But Are Pleased With Their Own Care : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nLet me ask you a question or two. What do you think of your doctor? And what do you think of America's health care system? NPR has been posing those questions in a survey that was conducted with the Robert Wood Johnson Foundation and the Harvard T.H. Chan School of Public Health. We have the results this morning. They'll be presented by NPR health policy correspondent Alison Kodjak, who's in studios. Good morning.\nALISON KODJAK, BYLINE: Good morning, Steve.\nINSKEEP: OK. So what do we think of the health care we're receiving?\nKODJAK: Well, most people actually are pretty happy with their own health care. They like their doctors. They think the care they're getting is pretty good. But there are a couple of really big gaps. If you are lower income, you are much more likely to think your care is not good.\nINSKEEP: Oh, so if you have money, you're getting good care. You think so, anyway. If you don't have money, it doesn't feel so good.\nKODJAK: That's right.\nINSKEEP: OK. So with the exception of many lower-income people who are disappointed, people broadly approve of the health care they individually are getting. What happened though when you asked the same people about the health care system as a whole?\nKODJAK: Well, that was a pretty different picture. Almost half of those people said that they didn't like the health care system in their state. They like their own doctor, but they didn't like the way the whole system worked. It's a little like people's attitudes toward Congress. You know, they like their own congressman. They keep re-electing him. But they say they hate the institution of Congress. So we were trying to figure out what's going on there. And so we talked to Georges Benjamin. He's the head of the American Public Health Association. And here's what he said.\nGEORGES BENJAMIN: When you're talking about health care, we have this amazing kind of schizophrenia about our system. You know, we deliver the best medicine and nursing on the planet. No question about that. But it requires a lot of things.\nKODJAK: Things like insurance, piles of forms, copayments and deductibles and often running from place to place for tests. It's hard to navigate and pretty frustrating. And Benjamin says that's what people hate, trying to navigate the system and trying to figure out how to make clear to your doctors what you need.\nWILLIAM DALE COGER: My name is William Dale Coger. I'm 52 years old. I live in Oak Hill, W.Va.\nKODJAK: In our poll, Coger rated the health care system poor. He injured his back about 15 years ago hauling pipe out of a water well on his property. It didn't seem too bad at first.\nCOGER: It's gotten worse and worse and worse. And now whenever I get up in the mornings, I have to push myself up to sit down on the bed. And then, whenever I get up, I've got to push myself up and sort of limp and lose my balance everywhere until finally my left side starts working properly.\nKODJAK: Coger's a carpenter by trade, but now he's on disability and Medicaid. Our new poll shows that lower-income people like Coger are more likely to be dissatisfied with their health care. He sees doctors at a local clinic but says they don't take his back trouble seriously. They recommend exercise and offer ibuprofen but refuse to offer an MRI. He thinks surgery could help him. But they won't talk about it.\nCOGER: But yet, they're still making this money every time I see them. And, you know, I'm going on with the same thing that I had 10 years ago.\nKODJAK: Georges Benjamin of the Public Health Association says Coger and his doctors don't seem to have the same goal. They're managing his pain. He wants to get back to work.\nBENJAMIN: It sounds to me that there's a communication lack there, where either he doesn't understand his course of care or they've not explained a course of care for him. Yeah, it can be very frustrating if you don't really understand what the end goal is for your care.\nKODJAK: It's not an uncommon problem. Cheryl Vaun lives in Albany, Ore. and also responded to our poll. She has a low opinion of her health care and the health care in her state. Vaun spent years trying to figure out what was wrong with her daughter. who suddenly fell ill as a teenager. The 16-year-old gained weight, had migraines, and her muscles would seize up. They went from doctor to doctor, lab to lab, repeating the same tests and procedures over and over.\nCHERYL VAUN: Certainly over the three-year period, it was draining. And at the end of the three-year period, where you still had no answers, you know, it's just such a terrible feeling of powerlessness, of what do you do now?\nKODJAK: Vaun's daughter was finally diagnosed with acute anemia after her heart nearly failed. If the anemia had been caught earlier, Vaun believes it would have been a minor nuisance. Instead, it's become a chronic condition that leaves her daughter tired and weak. Sarah Dash is vice president for policy at the Alliance for Health Reform in Washington. She says repeat tests, multiple doctor visits and lack of results erode people's faith in their care.\nSARAH DASH: Health care hasn't always been designed with the needs and the efficiency of the patient in mind. It's designed for the various doctors in the health care system.\nKODJAK: And so that's the source of frustration. It's not the effectiveness of the medicine. It's not the MRIs or whether the antibiotic works or whether the surgeons are skillful enough. It's just the system is so complicated and so hard to get around, people get sick of trying to navigate it.\nINSKEEP: And just that basic question, is your doctor listening to you? Is your doctor talking to you in a way that you understand? Really, really important.\nKODJAK: Yeah, and we had a lot of people say they're really frustrated that doctors are in and out in 15 minutes. They don't really hear what the problem is.\nINSKEEP: OK. Now, let's talk about that because that in and out in 15 minutes, that's about the efficiency of the system. That's about doctors being pressed to see a lot of people very, very quickly. We're in the midst of implementing Obamacare, which is about insuring people but also about cutting down costs in the system. Has Obamacare made people's experiences any better or worse the last couple of years?\nKODJAK: Well, our poll shows that people think their care hasn't much changed in the last few years. The majority of them say that the law hasn't really affected them directly. They believe that it helps a lot of people. They hear that more people have insurance, but they say that it doesn't really help them specifically.\nINSKEEP: Isn't that the political challenge that Obamacare has faced all along? It's designed to insure millions more people, which is very important. But there are many, many millions of others who don't necessarily experience a direct change?\nKODJAK: Yeah, it is. And it - one of the problems is that there actually are a lot of additional benefits from Obamacare and people's insurance, but they don't see that directly. You get free mammograms. You get free colonoscopies. You get free birth control. If you had an illness, you can still buy insurance because they can't exclude you for a pre-existing condition. Those aren't apparent to most of the people that we surveyed.\nINSKEEP: Each one of those is for a minority of people, in other words.\nKODJAK: Exactly.\nINSKEEP: Alison, thanks very much.\nKODJAK: Thank you, Steve.\nINSKEEP: Good to talk with you. She is NPR's health policy correspondent. And there's going to be more about this poll online at npr.org. The series continues today on All Things Considered.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=468244777"}
