{"authors":[],"date_download":"2018-10-22 22:45:56","date_modify":"2018-10-22 22:45:56","date_publish":"2014-05-12 17:42:58","description":"The government has failed to inspect oil and gas wells considered high risks for water contamination and other environmental damage, a report says.","filename":"data/vaneerConsumption/ManyOilGasWellsUntestedforEnvironmentalDamageReportSays.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/436816/140512-140512-fracking-1345_d3b19d33d00fbdc55393a622ed04b31b.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_energy_many-oil-gas-wells-untested-environmental-damage-report-says-n103376_1540248356.html","title":"Many Oil, Gas Wells Untested for Environmental Damage, Report Says","title_page":"Many Oil, Gas Wells Untested for Environmental Damage, Report Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"The findings from the Government Accountability Office come amid an energy boom and increasing use of hydraulic fracturing, or fracking. That process involves pumping huge volumes of water, sand and chemicals underground to split open rocks to allow oil and gas to flow. It has produced major economic benefits, but also raised fears that the chemicals could spread to water supplies.\nThe audit also said the BLM did not coordinate effectively with state regulators in New Mexico, North Dakota, Oklahoma and Utah. The bureau has become a symbol of federal overreach to industry groups opposed to government regulations related to oil and gas drilling.\nThe report said the agency \"cannot accurately and efficiently identify whether federal and Indian resources are properly protected or that federal and Indian resources are at risk of being extracted without agency approval.\"\nBLM officials said they were in the process of updating several policies. Investigators reviewed 14 states in full or part: Arkansas, California, Colorado, Louisiana, New Mexico, North Dakota, Ohio, Oklahoma, Pennsylvania, South Dakota, Texas, Utah, West Virginia and Wyoming. In Ohio, Pennsylvania and elsewhere, fracking has become increasingly prevalent.\nThe report said the BLM had failed to conduct inspections on more than 2,100 of the 3,702 wells that it had specified as \"high priority\" and drilled from 2009 through 2012. The agency considers a well \"high priority\" based on a greater need to protect against possible water contamination and other environmental safety issues. The agency had yet to indicate whether another 1,784 wells were high priority or not.\n- The Associated Press","url":"https://www.nbcnews.com/business/energy/many-oil-gas-wells-untested-environmental-damage-report-says-n103376"}
