{"authors":["Lucy Crossley For Mailonline"],"date_download":"2018-10-23 01:14:59","date_modify":"2018-10-23 01:14:59","date_publish":"2016-01-29 15:04:02","description":"Aravindan Balakrishnan, 75, from Enfield, north London, groomed and brainwashed two of his followers by convincing them he was a 'God', while subjecting them to horrific sexual assaults.","filename":"data/vaneerConsumption/MaoistcultleaderAravindanBalakrishnantodieinjailforkeepingdaughterprisoner.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/15/30B3EB1600000578-0-image-a-27_1454081489774.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422857_Maoist-cult-leader-Comrade-Bala-die-jail-s-jailed-23-YEARS-sexually-assaulting-followers-keeping-daughter-prisoner-30-years_1540257299.html","title":"Maoist cult leader Aravindan Balakrishnan to die in jail for keeping daughter prisoner","title_page":"Maoist cult leader Aravindan Balakrishnan to die in jail for keeping daughter prisoner | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The daughter of Maoist cult leader Comrade Bala who spent 30 years as a prisoner has broken her silence as her 'narcissist pyschopath' father was sentenced to die behind bars today.\nAravindan Balakrishnan, 75, known to his 'disciples' as Comrade Bala, was jailed for 23 years after being found guilty at Southwark Crown Court of raping two of his followers and keeping daughter Katy Morgan-Davies prisoner.\nBalakrishnan, who will be 87 if he is released halfway through his sentence, brainwashed cult members into thinking he had God-like powers and could read their minds, and subjected them to decades of abuse, running the commune with an iron fist.\nBut today Miss Morgan-Davies, now 33, said that although her father had deprived her of her family, childhood and love, she can still find it in her heart to forgive him.\nScroll down for video\nKaty Morgan-Davies (left), the daughter of cult leader Comrade Bala (right) who spent 30 years as a prisoner has broken her silence as her 'narcissist pyschopath' father was sentenced to die behind bars today\n'He took my freedom and deprived me of family, childhood, friends, love, affection, a sense of belonging, a sense of home,' she told ITN. 'I forgive him for what happened.\n'Life is a journey isn't it? There is good and bad in everything and besides, Nelson Mandela said \"if you leave the prison with hatred and anger and bitterness then you are still in prison\".'\nMiss Morgan-Davies, formerly known as Rosie Davies, was kept hidden away in the extreme Left-wing commune for three decades, beaten and psychologically abused.\nShe was left so far removed from the world that she did not know how to cross the road or use keys when she finally escaped.\nAs her father was jailed, Miss Morgan-Davies, bravely decided to waive her right to anonymity and reveal her true identity - as she revealed the torment of living 'like a caged bird' in the sect.\nMiss Morgan-Davies, who was known during the trial as Fran, said she hopes that by coming forward she will encourage others who have been oppressed to speak out and seek help.\nShe said Balakrishnan looked up to the Communist dictators 'as Gods' and wanted to emulate them.\nShe branded him a 'narcissist and a psychopath' who was 'obsessed about control' and plotted world domination.\n'The people he looked up to were people like Stalin, Mao and Pol Pot and Saddam Hussein - you couldn't criticise them either in the house,' she said.\n'They were his Gods and his heroes. These were the sort of people he wanted to emulate.'\nWhile Balakrishnan idolised these tyrants - who together are responsible for the deaths of up to 100 million people - he also wanted to be superior to them.\nHis daughter said: 'Sometimes he would say he didn't like Mao, because he saw Mao as a rival to him as well.\n'So he sort of followed them and wanted to be like them, but at the same time he didn't want them to be worshipped, except as secondary to him.\n'(He wanted to be) bigger than all of them.'\nThis picture shows the bedroom where Balakrishnan's daughter was imprisoned when she was rescued by police in 2013, aged 28\nMiss Morgan-Davies spent years confined in her bedroom, only allowed to leave on a number of occasions. While trapped in her room, she found solace in reading books such as Lord of the Rings\nBalakrishnan ran his tiny cult, known as the Workers' Institute of Marxism-Leninism-Mao Zedong Thought and based in south London, like the tyrants he so admired.\nThe married Maoist, of Enfield, north London, was found guilty of 14 charges, including rape, sexual assault and false imprisonment, against three victims last month following six hours of deliberation by the jury. He was cleared of a charge of indecent assault and a charge of causing actual bodily harm.\nJailing him at London's Southwark Crown Court today, Judge Deborah Taylor said: 'You were ruthless in your exploitation of them.\n'You engendered a climate of fear, jealousy and competition for your approval.'\nShe added: 'These are grave and serious crimes conducted over a long period of time and you have shown no remorse whatsoever.'\nAddressing Balakrishnan, the judge said: 'Your two adult females were abused by you psychologically, physically and sexually - it's a measure of the psychological control you had over them that they went out to work every day but returned in the evenings to your abuse.'\n'Your daughter was an experiment, deprived of love and affection - you lied to her that she was an orphan, you never formally acknowledged that she was your daughter until the trial.'\nMiss Morgan-Davies, 33, bravely decided to waive her right to anonymity and reveal her true identity - as she revealed the torment of living 'like a caged bird' in the sect\nShe added: 'Your treatment of her from her birth to the age of 26 was a catalogue of mental and physical abuse.\n'She was slapped with slippers or a stick from a McDonald's balloon you kept for the purpose.'\nThe judge said Balakrishnan had waged a campaign of physical and psychological abuse against his victims.\nCommenting on his treatment of his daughter, she said: 'You decided to treat her as a project, not a person.\n'You claimed to do it for her to protect her from the outside world, but you created a cruel environment.'\nBalakrishnan was assessed by a doctor and has a 'narcissistic personality disorder' and has a 'grandiose' sense of his own self importance, the court heard.\n'You subjected [your followers] to excoriate criticism,' Judge Taylor said. 'You made them go down on their knees while you berated them for their bourgeois views.\n'No one was permitted to criticise you, you took all of their savings and earnings while doing nothing yourself and making no contribution to the household, you isolated them from their families so they could show their commitment to you.\n'There was a code of reporting within the collective for any apparent disloyalty, you were relentless in your exploitation of them.'\nThe trial heard that Balakrishnan fathered Miss Morgan-Davies with one of his devotees, Sian Davies (pictured), a former pupil at Cheltenham Ladies' College\nMs Davies died in 1997 after falling from a window at this commune property in Herne Hill, London\nShe continued: 'It's a remarkable indication of the control you had over them that the pregnancy wasn't acknowledged despite the relationship you had with Sian Davies.\n'You made it clear you had no sexual desire or affection for these women, you ignored those in the collective who wanted to have sex with you and forced yourself on those who didn't.'\n'You treated them with arrogance and contempt. Your abuse has had a profound effect on the lives of both of these victims and their statements attest to the psychological trauma caused by your offending.\n'They both have tried to put their experience behind them, they've both shown great courage in the face of giving evidence.'\nShe continued: 'You kept Katherine Davies under your control, she had been born into the regime and had been unable to escape from it, she was unable to leave the house on her own.'\n'You have shown no remorse whatsoever.'\nBalakrishnan did not react as his sentence was read out, but one of his most devoted followers, former cult member Josie Herivale shouted from the public gallery: 'This is political persecution.'\nAfter Balakrishnan was lead to the cells, Judge Taylor commended the three police officers who lead the investigation and Gerard and Yvonne Stocks, who acted as foster parents to Katherine after her escape.\nThe couple worked with the charity Freedom and cult member Ms Herivale to help her leave the collective. Ms Herivale has since returned to live with Balakrishnan's wife Chandra.\nDuring his three-week trial bizarre and harrowing details of life inside the south London communist household were exposed - mainly through the meticulously-kept diaries which Balakrishnan forced his followers to write on a daily basis.\nBalakrishnan in the 1970s, around the time when he set up the cult, (left), and in his police mugshot (right)\nComrade Bala pictured with some of his collective at the Brixton home in 2012. Their faces have been obscured to protect their identity\nSet up in the 1970s, he spent the following four decades manipulating and terrorising his small band of female followers into thinking he was God-like and could read their minds.\nHe invented an invisible war machine called Jackie which he said could kill and trigger natural disasters if his will was flouted.\nHe also sexually abused cult members 'by appointment' when his wife left the house, telling one he was giving her the 'elixir of life', and encouraged his 'comrades' to denounce one another if they fell foul of his strict rules.\nShown no affection and relentlessly bullied and beaten, Miss Morgan-Davies was banned from going to school, making friends, and even leaving the cult's home unaccompanied.\nBalakrishnan's wife, Chanda Pattni, arriving at Southwark Crown Court today\nShe was repeatedly beaten daughter for minor transgressions, such as singing Twinkle Twinkle Little Star, and was so lonely that she made friends with taps and did not understand the concept of children.\nBut the court heard that she was given the strength to rebel against her father by reading fantasy novels such as Lord of the Rings and Harry Potter.\nSpeaking today, she said the sect was seen as a 'pilot unit' where Balakrishnan learnt how to control people before taking over the world.\nShe said: 'I used to think 'God, if the whole world is going to be like this, what way out is there? How am I going to live? I cannot live in this.\n'So I used to think that the best way would be to die.'\nMiss Morgan-Davies says she spent 30 years effectively as a 'slave' in her own home.\nBanned from going to school, mixing with other children, or leaving the house unaccompanied, she instead spent her days being taught about Balakrishnan's world importance and singing songs eulogising him.\nRecalling life in the cult, she said: 'It was horrible, so dehumanising and degrading. I felt like a caged bird with clipped wings.'\nShe was even robbed of her own family. Growing up she was not told Balakrishnan was her father, or that her mother was Sian Davies - one of the women in the cult and a former pupil at Cheltenham Ladies' College. Instead she knew them simply as 'comrade'.\nOn Christmas Eve in 1996, Ms Davies, 44, plunged from the bathroom window of the commune's house. She died of her injuries several months later in hospital.\nThat night her daughter heard screaming and shouting and saw her mother lying in a pool of blood below the bathroom window pleading with Balakrishnan to 'kill me'.\nWhen Ms Morgan-Davies learnt the truth about their relationship, she was haunted by dreams of her mother.\n'I remember I used to dream about her a lot, and I used to wake up crying', she said. 'I used to dream that I said 'I know you are my mum'.'\nAfter years of abuse she managed to escape the cult in 2013 and is now carving out a new, free, life for herself in Leeds.\nShe has joined the Labour Party and is studying maths and English in college - the first formal education she has ever received, despite having a very high IQ.\nAnd she is reclaiming her identity, saying: 'I've been a non-person all my life and now is my chance to be myself.'\nMiss Morgan-Davies is studying maths and English in college - the first formal education she has ever received, despite having a very high IQ\nShe has chosen the name Katy Morgan-Davies for herself partly because they are all family names on her mother's side - relatives she is getting to know for the first time.\nBut her first name is also inspired by the pop star Katy Perry, whose hit song Roar talks about the importance of finding your voice and being counted.\nDespite all she has endured, she says she forgives her father and would one day like to reconcile with him - if he faces up to his crimes.\n'I can't make him do that if that's not what he wants to do', she said. 'But the door is always open.'\nComrade Bala's wife Chanda still insists her husband is innocent, and said his jailing is a 'miscarriage of justice'.\nSpeaking outside the court after he was taken to the cells, she said: 'It is a political prosecution and a miscarriage of justice.\n'I've seen him twice in prison, he is bearing up - what can he do? It's a frame-up.'\nHer words were echoed by Ms Herivel, who said he had been 'persecuted because he exposed the British state'.\nShe added: 'How can they (the authorities) forgive him? The police have their revenge.'\nComrade Bala's wife Chanda (right) still insists her husband is innocent, and said his jailing is a 'miscarriage of justice', while follower Josie Herivel (left) said he had been 'persecuted because he exposed the British state'\nOne of Miss Morgan-Davies's relatives, her mother's cousin Eleri Morgan, 66, welcomed the 23 year sentence given to Balakrishnan.\n'For him at his age, that sentence is fine,' she said. 'Let him be locked up for a change.'\nShe added: 'I'm just looking forward to getting on with the rest of my life, and of Katy's, and getting to know her better.\n'I'm going to take her over to Wales, she wants to go and see where her grandmother and mother lived.'\nMs Morgan said she was shocked when she learned she had a long lost relative who had been kept a prisoner in the commune for 30 years in 2013, after reading about the case in a newspaper.\nShe said she has spoken to Miss Morgan-Davies about the nice side of her mother - the side she never got to see.\n'I know that Sian was nasty to Katy, and I say that's not the Sian I know,' she said. 'She was a nice, kind person which is what Balakrishnan focused in on.'\nMs Morgan was 'distressed' hearing how her cousin suffered in the commune.\n'I was very distressed to hear how Sian had been treated,' she added. 'She was so desperate, as Katy said, and she kept asking to phone her mother and he denied her this.\n'And stamping on her and gagging her with clothes. She must have been so distressed. It must have been a black hole she was living in.\n'That was just absolutely horrible, that she went through that.\n'If he had given her support then she could be alive today.'\nAsked if she wants a new inquest to be held into her cousin's death, Ms Morgan said: 'I would like there to be acknowledgement that had she been given help perhaps she could have been alive today.\n'It won't bring her back, I know, but perhaps it will bring a bit of justice and make people realise that she was very desperate.\n'Did she fall or did she jump? We don't know and we'll never know.'","url":"https://www.dailymail.co.uk/news/article-3422857/Maoist-cult-leader-Comrade-Bala-die-jail-s-jailed-23-YEARS-sexually-assaulting-followers-keeping-daughter-prisoner-30-years.html"}
