{"authors":["Jeff Desjardins","Visual Capitalist"],"date_download":"2018-10-30 23:05:28","date_modify":"2018-10-30 23:05:28","date_publish":"2018-07-23 00:00:00","description":"Although rents are rising everywhere, some cities are seeing clear separation from the rest of the pack. Almost half of the surveyed cities have rents below $1,000 per month. But two cities in North America have average rental prices of over $3,000 per month.","filename":"data/vaneerConsumption/MAPPEDThecostofrentinmorethan140NorthAmericancities.json","image_url":"https://amp.businessinsider.com/images/5b5615cb88be231b008b45bc-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mapped-the-cost-of-rent-in-more-than-140-north-american-cities-2018-7_1540940728.html","title":"MAPPED: The cost of rent in more than 140 North American cities","title_page":"    MAPPED: The cost of rent in more than 140 North American cities - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Richard Heyes/Flickr\nLocation, location, location.\nRental markets are heating up all over the continent, but there are specific cities that are feeling the brunt of this phenomenon.\nIn places like San Francisco, Brooklyn, San Jose, Seattle, Vancouver, and Denver, city councils are starting to move into panic mode as regular citizens like teachers and nurses are voicing concerns about not being able to afford housing.\nSimultaneously, many communities are rightfully concerned about the \"brain drain\" of their young people, who are moving for greener pastures (i.e. where rent or property is affordable) to start their families.\nMAPPING RENT PRICES\nThe situation of skyrocketing rents is a tricky one with no silver bullets.\nGiven the circumstances, our contribution in today's post is to provide some context and perspective on the situation. In the above chart, we mapped 148 cities in the U.S. and Canada and color-coded these cities based on average rent price.\nThe size of each circle corresponds to city size as reported by U.S. Census and Statistics Canada data, and they represent the populations of the cities themselves - not the surrounding metro population. This means that Long Beach, CA is not lumped into Los Angeles, CA, for example.\nThe chart was inspired by a compilation of data from WalletWyse, who used Numbeo estimates of the cost of living across these cities. Numbeo bases its rent estimates based on user-generated data for each city.\nAs a final note, we omitted cities from the original list with fewer than 100,000 residents, and we kept NYC split up into boroughs.\nMASSIVE DISPARITY\nAlthough rents are rising everywhere, some cities are seeing clear separation from the rest of the pack.\nVisual Capitalist\nThere are 26 cities with rents higher than $1,500, and only two cities with rent over $3,000 (Manhattan and San Francisco).\nMeanwhile, there is a significant chunk (46%) of the cities on the list with average rents below $1,000, including several cities that have rent for as inexpensive as $500-$650 (Springfield, MO, Quebec City, QC, or Fort Wayne, IN).\nDid anything surprise you about the map and data?","url":"https://www.businessinsider.com/mapped-the-cost-of-rent-in-more-than-140-north-american-cities-2018-7"}
