{"authors":["Jeff Desjardins","Visual Capitalist"],"date_download":"2018-10-31 00:10:32","date_modify":"2018-10-31 00:10:32","date_publish":"2018-07-12 00:00:00","description":"The US, China, and Germany are the world's largest importers.","filename":"data/vaneerConsumption/MAPPEDTheworldsbiggestimporters.json","image_url":"https://amp.businessinsider.com/images/5540ba186da811e2679128d2-2732-1365.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mapped-the-worlds-biggest-importers-2018-7_1540944632.html","title":"MAPPED: The world's biggest importers","title_page":"    MAPPED: The world's biggest importers - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The MV Maersk Mc-Kinney Moller, the world's biggest container ship, arrives at the harbour of Rotterdam August 16, 2013. Reuters\nVisualizing the World's Largest Importers in 2017\nFor most world leaders and corporate executives, the swing of the global pendulum to more protectionist policies has been an unpleasant surprise.\nThat's because the consensus view from both economists and economic historians has been that measures like the Smoot-Hawley Tariff Act of 1930, which triggered a trade war during the Great Depression, greatly exacerbated circumstances that were already quite dire.\nIt's common for tariff increases to be countered by retaliatory measures, and this can often translate to lower levels of international trade and decreased economic growth across the board. During the period of 1929 to 1934, according to the U.S. State Department, world trade decreased by 66% - largely a result of subsequent trade wars after the passing of Smoot-Hawley.\nFor the above reasons, international barriers to trade have been falling for decades - until now, of course.\nLARGEST IMPORTERS\nWhich countries can throw their weight around the most with tariffs and retaliatory measures?\nIt's those that import the most goods - and today's infographic from HowMuch.net shows the world's largest importers in 2017, according to recently released data from the World Trade Organization.\nHere are the top 15 largest importers, globally:\nUnknown\nThe United States takes home the number one spot with $2,409 billion of imports in 2017, about 13.4% of the global total. It's worth mentioning that this is $860 billion higher than the country's exports in 2017, and that the difference between the two numbers is the hotly-debated trade deficit.\nChina and Germany come in the #2 and #3 spots respectively, with $1,842 billion (10.2% of global total) of imports for China and $1,167 billion (6.5% of total) for Europe's largest economy.\nAfter the big three, no other country has a number exceeding 5% of global imports, but Japan, the United Kingdom, France, Hong Kong (China), and the Netherlands all surpass the 3% mark.","url":"https://www.businessinsider.com/mapped-the-worlds-biggest-importers-2018-7"}
