{"authors":[],"date_download":"2018-10-22 22:49:41","date_modify":"2018-10-22 22:49:41","date_publish":"2014-05-12 21:26:59","description":"Scientists using the European Space Agency's Planck space observatory have created the best map yet of our Milky Way galaxy's magnetic field.","filename":"data/vaneerConsumption/MapRevealsMilkyWayGalaxysMagneticFingerprints.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/437431/140512-space-planck2_6dcec9832c4687c59f533d96a43e6c07.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_map-reveals-milky-way-galaxys-magnetic-fingerprints-n103586_1540248581.html","title":"Map Reveals Milky Way Galaxy's Magnetic 'Fingerprints'","title_page":"Map Reveals Milky Way Galaxy's Magnetic 'Fingerprints'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Traveling as waves in electric and magnetic fields, light vibrates in directions at right angles to the direction it travels. In most cases, the fields vibrate in all directions. However, if something affects the light and causes it to vibrate preferentially in certain directions, it becomes polarized.\nIn space, light emitted by gas, dust, and stars can be polarized. Spinning dust particles in clouds can become aligned with magnetic fields, creating polarization that can be measured.\nThe new image from Planck reveals the large-scale organization of the polarization of the galaxy. Swirls, loops, and arcs, like giant fingerprints, trace the structure of the magnetic fields in the Milky Way, which results from the field lines running predominantly parallel to the galactic plane. Darker regions correspond to stronger polarization, with striations indicating the direction of the magnetic field on the plane of the sky.\nThe image also reveals variations in polarization by nearby objects, such as clouds of gas and dust.\nPlanck's study of the galactic polarization is analyzed in four papers recently submitted to the journal Astronomy & Astrophysics.\n— Nola Taylor Redd, Space.com\nThis is a condensed version of a report from Space.com. Read the full report. Follow Space.com on Twitter, Facebook and Google+.","url":"https://www.nbcnews.com/science/space/map-reveals-milky-way-galaxys-magnetic-fingerprints-n103586"}
