{"authors":["Quoctrung Bui"],"date_download":"2018-10-23 05:24:56","date_modify":"2018-10-23 05:24:56","date_publish":"2015-02-05 00:00:00","description":"The jobs picture has changed profoundly since the 1970s. This map shows how those changes played out across the country.","filename":"data/vaneerConsumption/MapTheMostCommonJobInEveryState.json","image_url":"https://media.npr.org/assets/img/2015/02/05/screen-shot-2015-02-05-at-3.31.37-pm_wide-4d717d2b8b195d2a98b70cd42ed16ee61fb4d365.png?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_money_2015_02_05_382664837_map-the-most-common-job-in-every-state_1540272296.html","title":"Map: The Most Common* Job In Every State","title_page":"Map: The Most Common* Job In Every State : Planet Money : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Map: The Most Common* Job In Every State\n*We used data from the Census Bureau, which has two catch-all categories: \"managers not elsewhere classified\" and \"salespersons not elsewhere classified.\" Because those categories are broad and vague to the point of meaninglessness, we excluded them from our map.\nWhat's with all the truck drivers? Truck drivers dominate the map for a few reasons.\nDriving a truck has been immune to two of the biggest trends affecting U.S. jobs: globalization and automation. A worker in China can't drive a truck in Ohio, and machines can't drive cars (yet).\nRegional specialization has declined. So jobs that are needed everywhere — like truck drivers and schoolteachers — have moved up the list of most-common jobs.\nThe prominence of truck drivers is partly due to the way the government categorizes jobs. It lumps together all truck drivers and delivery people, creating a very large category. Other jobs are split more finely; for example, primary school teachers and secondary school teachers are in separate categories.\nThe rise and fall of secretaries: Through much of the '80s, as the U.S. economy shifted away from factories that make goods and toward offices that provide services, secretary became the most common job in more and more states. But a second shift — the rise of the personal computer — reversed this trend, as machines did more and more secretarial work.\nManufacturing jobs disappeared: This story we knew already. Machine operators and factory workers had a dominant presence in the Midwest and parts of the South through the late '70s. Then a combination of globalization and technological change made many of those jobs disappear.\nFewer and fewer farmers: Our map shows the tail end of a century-long trend. Farming technology (everything from tiny seeds to giant harvesters) keeps getting better, which means fewer and fewer people can grow more and more food.\nGovernment: The most common job in D.C. is lawyer. Heh. On a related note, Northern Virginia is full of federal contractors — many of whom work as software developers.\nWho knew Utah was a tech hub? Over the past few years, tech companies have rejuvenated Utah's labor market. It's home to an NSA supercomputing facility and a growing number of tech firms.","url":"https://www.npr.org/sections/money/2015/02/05/382664837/map-the-most-common-job-in-every-state"}
