{"authors":["Neil Munro"],"date_download":"2018-10-30 19:20:59","date_modify":"2018-10-30 19:20:59","date_publish":"2015-12-05 05:55:16","description":"Marco Rubio was an ally and a patsy for Dem leaders during the secret 2013 amnesty talks, according to an article from Mother Jones magazine.","filename":"data/vaneerConsumption/MarcoRubioWasDemocratAllyDupeinAmnestyDeal.json","image_url":"https://media.breitbart.com/media/2015/12/GettyImages-497429264-downcast.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_04__1540927259.html","title":"Marco Rubio Was Democrat Ally, Dupe in Amnesty Deal","title_page":"Report: Marco Rubio Was Democrat Ally, Dupe in Amnesty Deal","title_rss":"NULL","source_domain":"breitbart.com","text":"Sen. Marco Rubio posed as a public champion for Americans during the secret 2013 talks over amnesty and cheap imported workers, but behind closed doors, he was was an ally and a patsy for Democratic leaders, according to a new article from the left-wing Mother Jones magazine.\nThroughout the negotiations, “Rubio had plenty of leverage. If he walked away at any point, the bill would be doomed,” the article reports.\nBut when the four Democratic and four Republican Senators debated amnesty for the 11 million or more migrants living illegally in the United States, “Rubio blinked, agreeing to a compromise closer to the Democrats’ proposal,” says the article, which is based on comments from Democratic staff members who were part of the closed-door negotiations.\nOn amnesty, Rubio “made an additional and unexpected concession: The bill would allow immigrants who had already been deported to return to the United States and get on the road to citizenship.” He “gave up a lot, probably for something he should have still held firm,” said one Democratic aide. “And it’s not clear if that was because he was a bad negotiator or he had a good heart.”\nDemocrats were amazed when Rubio agreed that already-deported illegals should be allowed to return.\n“We were shocked, frankly, that they—the Republicans—were willing to accept that provision,” another Democratic aide said\nEventually, Democrats concluded that Rubio’s public posturing as a defender of Americans’ jobs, wages, and safety was chiefly intended to deceive his own supporters.\nBy the end of the negotiations, it became clear to Democrats that Rubio had never been a hardliner when it came to the pathway to citizenship [amnesty] —his concern was more with how it looked to other conservatives.\nRubio’s main concern was to hide his sellout of Americans under a big pile of legalese, jargon, and complexity, so he could talk his way out of the inevitable public hostility, the Democratic aides said.\nWhen it came to undocumented immigrants, he was “all in” on the path to citizenship, as one staffer put it. In dozens of meetings between the eight members over six months, Rubio never “took anything approaching a hardline on the path to citizenship,” says the aide. “It was always, for him, about ‘how do I sell this?’… It was much more about the marketing perspective, and he was very open in saying that.” Rubio was insistent that it not appear that undocumented immigrants were receiving special treatment. So the pathway to citizenship—which the bill ultimately laid out as a 13-year process from receiving legal status to obtaining a green card to applying for citizenship—was tailored so that it was also open to people who immigrated legally and applied for visas through other channels. Whether the undocumented got their own visas or visas also available to other immigrants would yield the same outcome, but this allowed Rubio to claim that no special treatment was being granted.\nThe other members of the Gang of Eight were happy to help Rubio because he was willing to put the lipstick on the gigantic, poverty-expanding, productivity-reducing, refugee-increasing pig of a bill until the Democrats could push it past growing, bipartisan public hostility.\nThe other Gang of Eight senators—Republicans John McCain and Jeff Flake of Arizona and Lindsey Graham of South Carolina, and Democrats Dick Durbin of Illinois, Chuck Schumer of New York, Michael Bennet of Colorado, and Robert Menendez of New Jersey—and their aides worked hard to make the bill’s provisions palatable to conservatives, even if the changes were largely cosmetic.\nIf Rubio’s bill had become law, it would have given amnesty and huge amounts of welfare to at least 11 million illegal immigrants. It would have tripled the rate of legal immigration up to 33 million in the following decade—that’s roughly three new foreigners for every four Americans who turn 18.\nRubio would have helped give the president authority to designate large groups of foreigners as refugees—such as all Syrians—making it easy for President Barack Obama to import large blocs of poor Muslim future-voters into the country. “The President, in consultation with the Secretary of State and DHS, may designate certain persecuted groups with common characteristics whose resettlement in the United States is justified by humanitarian concerns or is otherwise in the national interest as meeting the requirements of refugee status,” according a friendly summary to Rubio’s bill.\nRubio’s bill would have dramatically increased the inflow of temporary workers who are used by companies to cut salaries and wages paid to American white-collar and blue-collar workers. The bill “expands permanent visas for many foreign graduates from U.S. universities in the sciences and related fields, increases over time the number of temporary high-skilled visas based on demand, and expands opportunities for entrepreneurs and investors to come to the U.S.,” said advocates for the bill. The endless inflow would cut American wages but also give the federal government much authority to decide which executives would get those workers. That power would also have been used by government elites to make deals with business elites, regardless of what Americans wanted.\nRubio’s crony-government deal included many side-deals for major donors, such as the slaughterhouse operators and crop growers in Sen. Lindsey Graham’s South Carolina. One deal that Rubio cut for himself allowed Florida-based cruise lines to bring in cheap foreign workers to clean their ships between voyages.\nThe attitude behind Rubio’s deal was revealed in a New Yorker article about the secret negotiations. As one Rubio aide told the author:\nThere are American workers who, for lack of a better term, can’t cut it. There shouldn’t be a presumption that every American worker is a star performer. There are people who just can’t get it, can’t do it, don’t want to do it. And so you can’t obviously discuss that publicly because–.” At which point another Rubio aide jumped in asserting, “But the same is true for the high-skilled worker.” To which, the first Rubio aide replied, “Yes, and the same is true across every sector, in government, in everything.”\nRubio’s immigration bill would have hired more guards for the border—but it also allowed more lawyers to tie up the guards in red tape. It initially and sneakily killed the computer system that companies use to detect illegal immigrant job applicants. It also would have allowed Obama’s deputies to invite already deported people back into the United States.\nRubio’s bill would have dramatically increased the number of migrants seeking U.S. jobs, and it would have flatlined wages and also reduced the financial incentive for companies to develop labor-saving, wealth-generating technology.\nOverall, Rubio’s bill would have pushed his 300 million countrymen into a future society where bipartisan, economic, and political elites would have lorded over a Brazil-like society—impoverished, diverse, divided, and angry.\nRubio persuaded enough Republicans to get his bill through the Senate.\nBut then, the very unpopular bill was delayed repeatedly by a cautious House Speaker John Boehner, until it was killed in June 2014 when GOP voters in Virginia’s 7th district ejected the GOP’s Majority Leader Eric Cantor in a shocking primary. That fall, the GOP scored a huge victory and grabbed the majority in the Senate.\nSubsequently, Rubio’s closed-door Democratic allies betrayed him, for example, by contributing their telltale quotes to Mother Jones.\nBut Rubio’s bill lives on, in President Obama’s policies. In 2013, Obama engineered the existing laws to bringing in roughly 2.1 million extra new foreign workers into the nation, at a time when 4.4 million Americans turned 18 and began looking for work. The result was obvious—wages flatlined, the number of Americans with jobs dropped, company profits boomed, and wealthy people who own stocks gained $4 trillion.\nPresumably, eventually, somehow, Rubio would have gotten something better than his 24-foot motorboat out his nation-changing, 2013 amnesty deal. It looks like he hoped to become president—but he’s now far behind Donald Trump, whose primary fuel is the GOP voters’ hatred of Rubio’s own deal.\nRead the full article Mother Jones article here.","url":"https://www.breitbart.com/politics/2015/12/04/report-marco-rubio-democrat-ally-dupe-amnesty-deal-say-dem-aides/"}
