{"authors":[],"date_download":"2018-10-23 03:21:00","date_modify":"2018-10-23 03:21:00","date_publish":"2017-04-26 14:46:28","description":"American star Marcus Miller has made soulful amends to the Senegalese jazz festival he skipped a year ago, stirring emotion with a musical tribute to west...","filename":"data/vaneerConsumption/MarcusMillerpaystributetoSenegalspastatjazzfest.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/14/wire-465525-1493214390-429_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4447894_Marcus-Miller-pays-tribute-Senegals-past-jazz-fest_1540264860.html","title":"Marcus Miller pays tribute to Senegal's past at jazz fest","title_page":"Marcus Miller pays tribute to Senegal's past at jazz fest | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Marcus Miller playing the Saint Louis Jazz Festival in Senegal, after skipping last year's edition over security fears\nAmerican star Marcus Miller has made soulful amends to the Senegalese jazz festival he skipped a year ago, stirring emotion with a musical tribute to west Africa's historic links with his homeland.\nMiller, 57, was the headline act Tuesday during the weeklong Saint Louis Jazz Festival, Africa's largest event dedicated to the genre, and was eagerly awaited after sitting out his performance in 2016 amid heightened security fears.\n\"Goree\", a sombre, reflective piece dedicated to the Senegalese island where slaves were held in harrowing conditions before they were shipped to the New World, touched the audience at Place Faidherbe in the heart of the city.\n\"It was really tough, visiting Goree,\" he told the crowd, recounting how he composed the song on his first visit to Senegal seven years ago. The song shows that \"the soul can transcend terrible things,\" he added, speaking in French.\nMiller composed the track after visiting the \"Door of No Return\" -- the last point before slaves boarded ships for the New World -- a door that \"also represented the beginning of our African-American experience too,\" he wrote in 2015.\nThe performance was not all downbeat: Miller danced, sang and smiled his way through a tour-de-force set, with the bass guitar specialist also at ease with a range of instruments.\n\"Tutu\", which he composed for trumpet virtuoso Miles Davis, brought rounds of applause and admiration from the crowd.\nSecurity was tight for the 25th edition of the festival, with armed police conducting searches at entrance points Tuesday.\nSenegal has so far escaped the jihadist attacks that regularly hit Mali and to a lesser extent Burkina Faso and Ivory Coast in recent years, but it remains on high alert.\n- Senegal showcase -\nThe other standout performance was Lokua Kanza, the Congolese acoustic guitarist and singer, ahead of expected sets this week from bluesman Lucky Peterson and Lisa Simone, daughter of the legendary Nina Simone.\nLokua Kanza, the Congolese guitarist and singer, gave a standout performance at Senegal's Saint Louis Jazz Festival\nSenegal is also showcasing its own stars, including Cheik Lo, known for his hybrid Senegalese \"Mbalax\" and reggae sound, and Baaba Maal.\nOne spectator, Alpha Abdoulaye Sow, called the festival a \"showcase for Saint Louis culture\", adding that \"thanks to the festival we can discover big names with international reputations like Marcus Miller.\"\nThe festival also paid tribute with a minute of silence to Issa Samb, better known as Joe Ouakam, a polymath Senegalese painter-sculptor-actor seen as an anti-conformist icon with the Agit-Art movement of the 1970s.\n\"Joe Ouakam guided the festival with advice. A giant has left us,\" said Mamadou Diop, president of the Saint Louis Jazz association.","url":"https://www.dailymail.co.uk/wires/afp/article-4447894/Marcus-Miller-pays-tribute-Senegals-past-jazz-fest.html"}
