{"authors":["Scott Horsley"],"date_download":"2018-10-23 01:07:06","date_modify":"2018-10-23 01:07:06","date_publish":"2016-10-19 00:00:00","description":"The Florida senator, up for re-election, says he won't discuss leaked emails from political opponents, citing an effort by a foreign government to sway the U.S. election.","filename":"data/vaneerConsumption/MarcoRubioWarnsGOPOnWikiLeaksTomorrowItCouldBeUs.json","image_url":"https://media.npr.org/assets/img/2016/10/19/ap_16274573898949_wide-8bc50121139304ba3a5ec001c3c58aa743a70f55.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_10_19_498529403_marco-rubio-warns-gop-on-wikileaks-tomorrow-it-could-be-us_1540256826.html","title":"Marco Rubio Warns GOP On WikiLeaks: 'Tomorrow, It Could Be Us'","title_page":"Marco Rubio Warns Donald Trump, Republicans On Using WikiLeaks Because 'Tomorrow, It Could Be Us' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Marco Rubio Warns GOP On WikiLeaks: 'Tomorrow, It Could Be Us'\nEnlarge this image toggle caption John Raoux/AP John Raoux/AP\nLive by the leak, and you may die by the leak.\nThat's the message Sen. Marco Rubio, R-Fla., is sending to his fellow Republicans, as he swears off using campaign material that originates with WikiLeaks.\n\"Today it is the Democrats. Tomorrow, it could be us,\" Rubio said in a statement.\n\"I will not discuss any issue that has become public solely on the basis of WikiLeaks,\" added Rubio, who is up for re-election. \"As our intelligence agencies have said, these leaks are an effort by a foreign government to interfere with our electoral process, and I will not indulge in it.\"\nThe warning from the erstwhile presidential candidate comes as Donald Trump and Hillary Clinton are preparing for their final debate Wednesday night in Las Vegas.\nWikiLeaks has published a cache of emails stolen from the personal Gmail account of Clinton's campaign chairman, John Podesta. Some of the emails have proved embarrassing to the Clinton campaign, and Trump has not been shy about using this ammunition.\nAfter Bloomberg reported on an exchange among campaign staffers discussing Clinton's reliance on a private email server while she was secretary of state, Trump took to Twitter:\nThe Clinton campaign has refused to confirm the authenticity of the emails published by WikiLeaks. The FBI is investigating the hack on Podesta's account.\nThe director of national intelligence and the Homeland Security secretary have blamed earlier hacks of the Democratic National Committee and other political organizations on the Russian government, calling it an attempt to influence the U.S. election.","url":"https://www.npr.org/2016/10/19/498529403/marco-rubio-warns-gop-on-wikileaks-tomorrow-it-could-be-us"}
