{"authors":["Charlie Spiering"],"date_download":"2018-10-30 17:56:44","date_modify":"2018-10-30 17:56:44","date_publish":"2016-03-02 04:12:09","description":"MIAMI, Florida -- The night moved quickly for Rubio supporters who showed up at the open air Tropicana Equestrian Center for what had been described as a “Florida Kick Off Rally” by the campaign. |","filename":"data/vaneerConsumption/MarcoRubioClingstoHopeinFloridaAfterCrushingSuperTuesdayDefeat.json","image_url":"https://media.breitbart.com/media/2016/03/Rubio-Florida-Rally-Alex-Wong-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_01__1540922204.html","title":"Marco Rubio Clings to Hope in Florida After Crushing Super Tuesday Defeat","title_page":"Marco Rubio Clings to Hope in Florida After Crushing Super Tuesday Defeat | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"MIAMI, Florida — The night moved quickly for Rubio supporters who showed up at the open air Tropicana Equestrian Center for what had been described as a “Florida Kick Off Rally” by the campaign.\nThere was little to cheer for on the giant screens that were tuned into Fox News. Every time a pundit mentioned that Virginia was too close to call the audience roared with approval. When the pundits announced a state that had gone to Hillary Clinton or Donald Trump, they booed.\nBut once the pundits called Virginia for Trump the moment for cheering had passed — until Rubio immediately took the stage to inspire his supporters.\n“It is great to be home,” he said as his home crowd cheered him on.\nBut there wasn’t much for Rubio to celebrate, as he insisted that his five day campaign to take on Trump was working after the billionaire took the majority of the states that were up for grabs.\n“We are seeing in state after state, he loves to talk about polls … his numbers are coming down and our numbers are going up!” he said, referring to the “con artist” whom he had attacked with gusto in recent days.\nStill hoarse from about 10 rallies in 36 hours, Rubio reflected the frustration shared by his supporters that Trump was still dominating the race.\n“We are going to send a message that the party of Lincoln and Reagan and the presidency of the United States will never be held by a con artist,” he said.\nIt all came down to Florida, he argued, where he would make a dramatic comeback.\n“Of all the places in America, and I have traveled this country now, and I am so proud to be back, because there’s no place in America that understands the American dream better than this community and this great State of Florida,” he said.\nRubio willingly spoke a few lines in Spanish to the audience, prompting the loudest cheers of the night. But in the background, isolated pro-amnesty protesters shouted at the Florida Senator for betraying immigrant families.\nAfter he was finished speaking, the arena quickly emptied while a few campaign volunteers and die hard supporters clustered in small groups to discuss the future of the race.\nFlorida was essential, they discussed, for Rubio to have a chance for victory. With the results not completely in, they hadn’t seen the delegate math but were confident that Rubio had done well enough to continue.\nLocal supporters appreciated the specific appeal he made to Florida in his speech and were confident that he could win in his home state.\nRubio earnestly vowed to fight on, despite the looming possibility that he would end up in Florida without a single victory.\n“Florida, I know you’re ready.” he said. “The pundits say we’re underdogs. I’ll accept that. We’ve all been underdogs. This is a community of underdogs, this is a state of underdogs, this is a country of underdogs, but we will win.”\nBut as the Senator exited the stage, New Jersey Governor Chris Christie and Donald Trump took over the airwaves.\n“I know it was a very tough night for Marco Rubio, he had a tough night,” Trump said, as the audience laughed.","url":"https://www.breitbart.com/politics/2016/03/01/marco-rubio-clings-to-hope-in-florida-after-crushing-super-tuesday-defeat/"}
