{"authors":["Charlie Spiering"],"date_download":"2018-10-30 19:10:25","date_modify":"2018-10-30 19:10:25","date_publish":"2016-01-17 18:19:55","description":"Illegal immigrants should be allowed to stay in the United States, as long as they have been in the country for a long time and are not criminals, Sen. Marco Rubio said on NBC's \"Meet the Press\" Sunday TV show. |","filename":"data/vaneerConsumption/MarcoRubioIllegalMigrantsCanStayInAmerica.json","image_url":"https://media.breitbart.com/media/2016/01/AP_425347076589.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_01_17__1540926625.html","title":"Marco Rubio: Illegal Migrants Can Stay In America","title_page":"Marco Rubio: Illegal Migrants Can Stay In America | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Illegal immigrants should be allowed to stay in the United States, providing they have been in the country for a long time and are not criminals, Sen. Marco Rubio said on NBC’s “Meet the Press” Sunday TV show.\nFrom the transcript:\nCHUCK TODD: Let me ask you by the way quickly on the 11 million, are you still for finding a way for them to legally stay in the United States?\nMARCO RUBIO: Yeah, look. If you’re a criminal alien, no, you can’t stay. If you’re someone that hasn’t been here for a very long time, you can’t stay.\nHe described a “criminal alien” as a migrant who has committed a felony other than breaking the nation’s immigration laws.\nMARCO RUBIO: I’ve said that before, Todd. That’s been convinced. I mean, a felon, someone who’s committed a crime, a non-immigration-related– and that’s what I’ve talked about in the past. So I do believe– I don’t think you’re gonna round up and deport 12 million people.\nHere’s what I’ve said, though. It is very clear now more than ever that we are not going to be able to do anything on people that are [here] illegally until we first prove to people that illegal immigration is under control and America is safe. And ISIS poses a very unique threat unlike anything we have faced in the past.\nRubio’s ultimate solution to the problem with illegal immigration hasn’t changed since he first pursued the “Gang of Eight” immigration reform bill in the Senate.\nAlthough he doesn’t campaign on the idea, the Florida senator still believes that someday, if the border is secure, illegal immigrants who have been in the country for a long period of time could earn conditional residency once the border was finally secured.\nRubio insists that he learned after the failed effort to pass immigration reform with the help of Democrats, and now argues that a comprehensive approach to immigration reform would never work.\nEarlier this month, Rubio argued that he was the best candidate in the presidential race to solve the problem of illegal immigration.\n“No one who has ever run for president understands this issue personally better than I do and that’s why I can tell you and you should tell your friends that no one running for president is better prepared to fix it than me,” he said during a town hall in New Hampshire. “I understand this issue personally, I understand the good, the bad, and the ugly, and every aspect of it.”","url":"https://www.breitbart.com/politics/2016/01/17/marco-rubio-some-illegal-immigrants-can-stay-in-america/"}
