{"authors":["Amy Sciarretto"],"date_download":"2018-10-31 01:48:06","date_modify":"2018-10-31 01:48:06","date_publish":"2018-09-11 14:17:10","description":"Fashion week just scored a major and glorious victory for inclusivity this year. L.A.-based underwear designer and brand Marco Marco sent all transgender models down the runway during its Style Fashion Week New York on Sept. 8, giving a platform to…","filename":"data/vaneerConsumption/MarcoMarcosFashionWeekShowSolelyCastedTransgenderModelsToMakeAMassiveStatementAboutInclusion.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/11/1739c73d-b13b-49ad-9335-0bf0d4d32dee-screen-shot-2018-09-11-at-74454-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_marco-marcos-fashion-week-show-solely-casted-transgender-models-to-make-a-massive-statement-about-inclusion-11867004_1540950486.html","title":"Marco Marco's Fashion Week Show Solely Casted Transgender Models To Make A Massive Statement About Inclusion","title_page":"Marco Marco's Fashion Week Show Solely Casted Transgender Models To Make A Massive Statement About Inclusion","title_rss":"NULL","source_domain":"bustle.com","text":"Fashion week just scored a major and glorious victory for inclusivity this year. L.A.-based underwear designer and brand Marco Marco sent all transgender models down the runway during its Style Fashion Week New York on Sept. 8, giving a platform to models often overlooked in the industry. While designer Marco Morante has featured trans and non-binary people in past season shows, he made a concerted effort this season to celebrate trans models solely. The show featured 34 transgender models with no cisgender models.\nUltimately, it was absolutely thrilling and refreshing to see a wide variety of identities and backgrounds represented and strutting their stuff in the fashion realm.\n\"Although I have always had trans and non-binary people in my shows, it became apparent to me that their presence was often overshadowed by cis gay men or cis gay men in drag,\" Morante explained to Mic regarding the all-trans casting decision.\nHe furthered, \"I wanted to create a space to celebrate trans bodies. This was an opportunity for their presence to be undeniable and reinforce that trans is beautiful.\"\nMission accomplished. The participants, which included Transparent star Trace Lysette and YouTube personality Gigi Gorgeous, along with models Laith Ashley and Geena Rocero, among others.\nThe Underwear Expert on YouTube\nYou can watch the full, 18-minute runway show above. The fashions and the people wearing them are totally fabulous.\nLysette posted this inspirational and empowering tweet about her participation in the Marco Marco show. She called out the fact that most people and their bodies do not adhere to and have never adhered to previous fashion industry standards — nor should they.\nThe Marco Marco SS19 show is another historical moment in the fashion industry. It's further proof that diversity, inclusivity, and acceptance of all identities is not a trend in fashion. It's becoming the standard. That's always a beautiful thing.\nTwitter was certainly all about all-trans roster of models at the show.\nTruth!\nThis user's response is heartbreaking and hopeful at once. While she endured the utterly awful side of the industry, she points to the fact that this sort of show changes outmoded industry concepts.\nThis tweet says it all. The industry is certainly playing catch up and the Marco Marco show served as a watershed moment for inclusivity and identity.\nIn another amazing display of inclusivity, designer Claudia Li cast all Asian models in her NYFW show.\nFrazer Harrison/Getty Images Entertainment/Getty Images\nShe told Teen Vogue, \"This collection is very personal to me and it speaks volumes when it's a runway with 35 Asian girls.\" It surely does.\nShe opted to not go with a uniform presentation with her cast of models, as well, saying, \"I want them to have their own personalities. I feel like this collection is really connecting that with who I am, who they are, and who Asian women are. We have so many differences to show.\"\nFrazer Harrison/Getty Images Entertainment/Getty Images\nAmen to that. The major injection of inclusivity is making fashion week exciting. The fashion future looks so bright and so diverse because of it.\nUPDATE: A previous version of this article stated that Marco Marco was the first brand to feature all trans models in a runway show. However, since 2015, designer Gogo Graham, who is a trans woman herself, has had shows with an all-trans cast of models. An earlier version of this piece also incorrectly stated the location of the Marco Marco Seven collection debut. It has been updated to say that the debut took place at Style Fashion Week New York.","url":"https://www.bustle.com/p/marco-marcos-fashion-week-show-solely-casted-transgender-models-to-make-a-massive-statement-about-inclusion-11867004"}
