{"authors":["Associated Press"],"date_download":"2018-10-23 03:33:15","date_modify":"2018-10-23 03:33:15","date_publish":"2016-01-29 18:27:21","description":"NEW ORLEANS (AP) — The ladders where children will sit and catch beads are out. The fences are up to protect lawns and houses. The grandstands are assembled....","filename":"data/vaneerConsumption/MardiGrasseasonkicksintohighgearwithparades.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423020_Mardi-Gras-season-kicks-high-gear-parades_1540265595.html","title":"Mardi Gras season kicks into high gear with parades","title_page":"Mardi Gras season kicks into high gear with parades | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mardi Gras season kicks into high gear with parades\nNEW ORLEANS (AP) — The ladders where children will sit and catch beads are out. The fences are up to protect lawns and houses. The grandstands are assembled.\nMardi Gras season is kicking into high gear in New Orleans with the first of the city's major parades rolling this weekend down the city's famed St. Charles Ave.\nThe Krewes of Oshun and Cleopatra — an all-female group — were set to parade down the avenue Friday evening, throwing beads to lucky onlookers. Parades for the annual pre-Lenten celebration are scheduled through the weekend across the city, and in towns around the area. They continue near-daily until Fat Tuesday on Feb. 9.\nSome local New Orleans residents have already begun to put up ladders for children to sit and catch beads along the oak tree-lined St. Charles Ave. Businesses and residents have put up fences to protect lawns and bushes in some areas along the street in anticipation of the huge crowds.\nMardi Gras is the city's biggest tourist attraction, where hundreds of thousands of people gather along the streets to watch parades and floats that organizations known as krewes have spent months planning and decorating. The float riders — who are required to wear masks — throw beads, trinkets designed with the krewe's logo or other custom \"throws,\" some of them hand-decorated by members of the krewe.\nIn between the floats are often walking groups or dance teams — such as \"Gris Gris Strut\" or the all-male \"610 Stompers.\" High school marching bands also take part in the parades and can be seen — and heard — in the weeks ahead of the parades, practicing on neighborhood streets.\nWhile the major parades with huge, tractor-drawn floats stick to bigger avenues like Canal St. or St. Charles Ave., there are smaller parades on foot that go through the French Quarter and other neighborhoods like the Marigny.\nThe Intergalactic Krewe of Chewbacchus, which pays homage to things like sci-fi, fantasy and horror, will parade on Saturday night and people who like to dress up their dogs in costume will have the opportunity when the Mystic Krewe of Barkus parades Sunday.\nLaw enforcement authorities have promised unprecedented security, although they have said that they have not received any credible threats to the celebration.\n__","url":"https://www.dailymail.co.uk/wires/ap/article-3423020/Mardi-Gras-season-kicks-high-gear-parades.html"}
