{"authors":["Alicia Vrajlal For Daily Mail Australia"],"date_download":"2018-10-22 22:09:23","date_modify":"2018-10-22 22:09:23","date_publish":"2016-01-11 02:40:48","description":"She set hearts racing during steamy love scenes with Leonardo DiCaprio in The Wolf Of Wall Street.","filename":"data/vaneerConsumption/MargotRobbierevealsPatriciaArquetteandChristianSlaterssteamyonscreendallianceinTrueRomancegetsherhotunderthecollar.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/300179D600000578-0-image-a-32_1452475004037.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393164_Margot-Robbie-reveals-Patricia-Arquette-Christian-Slater-s-steamy-onscreen-dalliance-True-Romance-gets-hot-collar_1540246163.html","title":"Margot Robbie reveals Patricia Arquette and Christian Slater's steamy onscreen dalliance in True Romance gets her hot under the collar","title_page":"Margot Robbie reveals Patricia Arquette and Christian Slater's steamy onscreen dalliance in True Romance gets her hot under the collar  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She set hearts racing during steamy love scenes with Leonardo DiCaprio in The Wolf Of Wall Street.\nBut despite getting hot and heavy with the Hollywood hunk in the 2014 blockbuster, Margot Robbie's favourite sex scene of all time is not one of hers.\nIn an interview with W magazine, the 25-year-old Australian actress revealed it is the racy dalliance between Patricia Arquette and Christian Slater's characters in 1993 flick True Romance that does the trick for her.\nScroll down for video\nRevealing all: Margot Robbie says her favourite sex scene of all time is not one of her own\n'Best sex scene in a movie in my opinion, and I was just watching this last night... True Romance,' the former Neighbours star said.\nShe continued: 'Which is one of my favourite, favourite movies of all time and it's when Alabama and Clarence are in the phone box next to the road'.\n'The best sex scene ever,' she giggled.\nThis is it! In an interview with W magazine , the 25-year-old Australian actress revealed she loves the hot and heavy dalliance between Patricia Arquette and Christian Slater's characters in 1993 flick True Romance\nSteamy: She explained it 'is one of my favourite, favourite movies of all time and it's when Alabama and Clarence are in the phone box next to the road'\nBack in 2014, the Australian actress played blonde beauty Noami Lapaglia in The Wolf Of Wall Street, who gets caught up in a steamy moment with 41-year-old Leonardo DiCaprio's Jordan Belfort.\n'We were positioned while they lit around us in one scene, and I kind of pushed Leo's head to one side and told him he was in my light and he moved out of [it],' she said of the sex scene when speaking to Manhattan magazine back in 2014.\n'He was so incredulous that I had told him to get out of my light, and physically moved him out of the way, he was like, \"Did you really just do that?\"\nHot and heavy: In 2014 the Australian actress played blonde beauty Noami Lapaglia in The Wolf Of Wall Street, who gets caught up in a steamy moment with 41-year-old Leonardo DiCaprio's alter-ego, Jordan Belfort\nRacy scenes: The film helped the former Neighbours star establish a name for herself in Hollywood\n'I don't think anyone has told him to get out of their light in quite some time,' she added. 'He seemed extremely [shocked], but it was kind of funny.'\nIn real life, Margot is dating assistant film director Tom Ackerley.\nThey are said to have met in 2013 working on the set of Suite Francaise, which also stars Michelle Williams.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393164/Margot-Robbie-reveals-Patricia-Arquette-Christian-Slater-s-steamy-onscreen-dalliance-True-Romance-gets-hot-collar.html"}
