{"authors":["Press Association"],"date_download":"2018-10-23 01:03:43","date_modify":"2018-10-23 01:03:43","date_publish":"2017-04-26 11:06:15","description":"Maria Sharapova will find out next month if she can compete at the French Open. French tennis federation president Bernard Giudicelli said the announcement will be made on May 16 at 7pm.","filename":"data/vaneerConsumption/MariaSharapovaFrenchOpenwildcardtobesettledinMay.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9F206000000578-0-image-a-24_1493203926204.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-4447062_Maria-Sharapova-French-Open-wildcard-settled-May_1540256623.html","title":"Maria Sharapova French Open wildcard to be settled in May","title_page":"Maria Sharapova French Open wildcard to be settled in May | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Maria Sharapova has returned to the court in Stuttgart ahead of her long-awaited tennis comeback following a 15-month drugs suspension.\nThe former world No 1 took to centre court to put in the practice hours prior to her return to action in the Porsche Tennis Grand Prix. She had been banned from entering the premises until her ban expired at midnight on Wednesday morning.\nSharapova will face Italy's Roberta Vinci in the first round on Wednesday and will play her fellow Russian Ekaterina Makarova should she progress upon her return.\nMaria Sharapova has returned to the court ahead of her tennis comeback in Stuttgart\nThe Russian exerted herself on centre court as she put in a high-intensity practice session\nSharapova talks tactics with her coach Sven Groeneveld during the session\nSharapova will also find out next month if she can compete at the French Open, with all wildcard picks set to be announced at the same time.\nFrench tennis federation president Bernard Giudicelli said Tuesday that the announcement will be made on Facebook on May 16 at 6pm UK time.\n'The only guarantee I gave her is to call her beforehand,' Guidicelli said without giving any indication on whether Sharapova will get a positive answer.\n'There is no reason why we should make an exception for Maria Sharapova, there is no reason why we should announce a wild card before the others.'\nThe five-time Grand Slam champion and former No 1 is returning to action following her ban\nSharapova tested positive for the banned substance meldonium at the 2016 Australian Open\nThe 30-year-old was all smiles as she returned to the court after a period of long absence\nThe five-time grand slam champion and former world No 1 is returning to competition this week as a wild-card entry.\nSharapova was suspended after testing positive for the banned substance meldonium at the 2016 Australian Open.\nThe ban was reduced from two years to 15 months last October by the Court of Arbitration for Sport. Meldonium, which was previously legal, was banned by the World Anti-Doping Agency earlier that year, but Sharapova claims she missed the memo instructing her to stop using it.\nItalian Roberta Vinci will provide the opposition for Sharapova as she makes her comeback\nAngelique Kerber has questioned whether Sharapova should resume her career in main draws\nSharapova, who has won all four majors, claimed the title at Roland Garros in 2012 and 2014.\nTop-ranked players Angelique Kerber and Andy Murray are among those who have questioned whether Sharapova should be allowed to resume her career in main draws without playing her way back through qualifiers.\nSharapova has also been handed a wild-card entry into the Italian Open in Rome next month.","url":"https://www.dailymail.co.uk/sport/tennis/article-4447062/Maria-Sharapova-French-Open-wildcard-settled-May.html"}
