{"authors":["Alexis Rhiannon"],"date_download":"2018-10-31 01:42:29","date_modify":"2018-10-31 01:42:29","date_publish":"2018-09-14 17:02:20","description":"Like most fans, you've probably been waiting with bated breath for the icon to release new music. But if there's one thing that Mariah Carey's new single \"GTFO\" proves, it's that the singer isn't mincing any words with her return. Carey's first song…","filename":"data/vaneerConsumption/MariahCareysGTFOIsHerFirstSingleIn3YearsTheSingerIsntMincingWordsOnThisBreakupTrackVIDEO.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/6f1e8c37-8c54-4458-becb-f644ab1ac768-mariah-snip.PNG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_mariah-careys-gtfo-is-her-first-single-in-3-years-the-singer-isnt-mincing-words-on-this-breakup-track-video-11917896_1540950149.html","title":"Mariah Carey's \"GTFO\" Is Her First Single In 3 Years & The Singer Isn't Mincing Words On This Breakup Track - VIDEO","title_page":"Mariah Carey's \"GTFO\" Is Her First Single In 3 Years & The Singer Isn't Mincing Words On This Breakup Track — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Like most fans, you've probably been waiting with bated breath for the icon to release new music. But if there's one thing that Mariah Carey's new single \"GTFO\" proves, it's that the singer isn't mincing any words with her return. Carey's first song in four years dropped this week, with the video following a day later. And both the lyrics and the imagery contain a strong message for the performer's haters, inviting them to — ahem — show themselves right on out of her life.\nThere was a time when you could expect new music from Carey every year or two. The 48-year-old churned out an impressive 13 albums in the 20 years, starting with her debut album Mariah Carey in 1990 and her latest Christmas album Merry Christmas II You in 2010. It was an embarrassment of riches, but in the past 8 years or so, the singer has been keeping her fans on the edge of their seats for longer and longer in between new music releases. \"GTFO\" is her first release since 2014's album Me. I Am Mariah... The Elusive Chanteuse, which was her first offering since 2010.\nBut if you thought her back-to-back four-year absences meant she'd be shy about dipping her foot back into the music-making pool, think again.\nMariahCareyVEVO on YouTube\nThis new single \"GTFO\" was released Thursday, Sep. 13, with the video dropping on Friday, Sep. 14, and both get straight to the point. Well, not straight to the point. First, Carey tricks you into thinking that the single is just another will-they-won't-they pop ballad with lyrics like:\n\"You took my love for granted / You left me lost and disenchanted / Bulldozed my heart as if you planned it / My prince was so unjustly handsome.\"\nSure, the singer is scolding an inconsiderate lover, but the soft, breathy melody and longing lyrics suggest that the pair will find their way back to each other in the end, as happens in so many songs.\n\"Who was a knight in shining armor? / (You you you) / I got a story, you loved me harder / (You you you) / Might as well down this Caymus bottle / (You you you) / I ain't the type to play the martyr.\"\nAnd then just when Carey has you exactly where she wants you, expecting the make-up in the chorus, she flips the script. The song's pace increases, the lyrics become clipped, and the song's title becomes clear. \"Why don't you get the f*ck out,\" she silkily spits out in the chorus, adding:\n\"(How 'bout you) take your things and be on your merry way / (How 'bout you) fly off with a wink, bye bye, baby / (How 'bout you) scusami, Mimi called you a valet\"\nThere's absolutely no room for interpretation in these lyrics or the ones that follow. She's not begging, she's not pleading — Carey is putting her foot down and enforcing her boundaries. She tells her partner to clear his stuff out and go stay at a friend's house, and reminds him he's lucky this didn't happen sooner.\nAnd even better, she does it all without shedding a single tear. The girl is over it, and that same attitude is present in the video, as well. The only person who ever appears on camera is Carey herself, writhing on the kitchen counter, relaxing in bed in full lingerie, or on the couch, with a glass of red wine and her heels kicked off and to the side. She's a housewife, but she's not waiting on anyone to come home to her — she's pretty good all by herself.\nThis is Carey at her most real-seeming, and the way she manages to weave the \"over it\" perspective into a sultry, dreamy pop song bodes very well for her future album. And while details are still scarce on when fans might see an actual record, the first official single \"With You\" is due out on Oct. 5, so hopefully there's more where \"GTFO\" came from.","url":"https://www.bustle.com/p/mariah-careys-gtfo-is-her-first-single-in-3-years-the-singer-isnt-mincing-words-on-this-breakup-track-video-11917896"}
