{"authors":["Tom Farmery For Mailonline"],"date_download":"2018-10-23 00:54:25","date_modify":"2018-10-23 00:54:25","date_publish":"2016-01-11 10:56:56","description":"The somewhat bizarre account of Balotelli's behaviour in the dressing room at Inter was revealed by Kerlon in an interview in which he said he'd never met someone so 'extraordinary'.","filename":"data/vaneerConsumption/MarioBalotelliusedtourinateonthebootsofhisteammatesaccordingtoformerInterMilanmidfielderandfriendKerlon.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/10/2B96CA4800000578-0-image-a-12_1452509763685.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393636_Mario-Balotelli-used-urinate-boots-players-according-former-Inter-midfielder-team-mate-Kerlon_1540256065.html","title":"Mario Balotelli used to urinate on the boots of his team-mates, according to former Inter Milan midfielder and friend Kerlon","title_page":"Mario Balotelli used to urinate on the boots of his team-mates, according to former Inter Milan midfielder and friend Kerlon  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Urinating on players' items just one of the many pranks Balotelli's played\nFormer Inter Milan midfielder Kerlon has revealed that team-mate Mario Balotelli used to urinate on his fellow players' boots.\nThe somewhat bizarre account of Balotelli's behaviour in the dressing room at Inter was revealed by Kerlon in an interview in which he said he'd never met someone so 'extraordinary' and who didn't feel sorry for pulling such a prank.\nThe two were with each other at Inter for two years from 2008 to 2010.\nKerlon says Mario Balotelli was 'extraordinary' and would never feel sorry for pranking his team-mates\n'Balotelli is a very nice guy and an extraordinary person, but he did some unbelievable things off the pitch,' Kerlon told ESPN Brazil.\n'He had a habit of arriving at training before anyone else and peeing on all the players' boots … it was very funny.\n'I've never seen a kid of 18 years do it, and no feel sorry for any of it, even to Julio Cesar and Maicon.'\nThis is not the first time Balotelli's antics have made the headlines.\nIn 2011 when he was at Manchester City the striker set off fireworks in his £3million-valued house in Chesire causing £400,000 worth of damage.\nTen firefighters were required to put out the blaze, which was described as a 'substantial fire'.\nIn April 2011, it was reported Balotelli had spent £10,000 in parking fines and had his sports car impounded 27 times.\nThe Italian striker was best known for his pranks at Inter Milan where he stayed for four years\nHe once crashed his sports car soon after arriving at City in 2010 and it was reported that police found £5,000 in cash in his back pocket.\nThe striker was also reprimanded for throwing darts at the training ground.\nIn 2014, Balotelli found himself in more difficulty when he was unable to import his pet pig Super to the UK because of British restrictions on the movement of animals.\nKerlon isn't the first of Balotelli's former team-mates to speak about Balotelli's behaviour.\nBalotelli is sent off during Arsenal's 1-0 Premier League victory against Manchester City in 2012\nLast year, author Luca Caioli wrote a book called 'Balotelli: The Remarkable Story Behind the Sensational Headlines' for which he interviewed the Italian's former coaches and team-mates.\nMarco Pedretti, who played alongside Balotelli when the pair were growing up, told Caioli: 'He liked to mess about like he does now, but he was a child back then. He was constantly a real pain in the neck and would pull pranks all the time. Bad ones, sometimes.\n'It's true that he would pee on our bags containing our clean clothes and he would pee on people too.'","url":"https://www.dailymail.co.uk/sport/football/article-3393636/Mario-Balotelli-used-urinate-boots-players-according-former-Inter-midfielder-team-mate-Kerlon.html"}
