{"authors":[],"date_download":"2018-10-30 20:13:42","date_modify":"2018-10-30 20:13:42","date_publish":"2017-04-05 20:20:00","description":"The 51-year-old was bitten on the thigh while in waist to chest-deep water at New Smyrna Beach in Florida.","filename":"data/vaneerConsumption/MariettawomanbittenbysharkinFlorida.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/CmgSharedContent/2017/02/20/Images/photos.medleyphoto.13279567.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_marietta-woman-bitten-shark-florida__1540930422.html","title":"Marietta woman bitten by shark in Florida","title_page":"Marietta woman bitten by shark in Florida","title_rss":"NULL","source_domain":"ajc.com","text":"A Marietta woman is the second victim of a shark bite in Volusia County, Fla., this year, officials said.\nThe 51-year-old woman was bitten on the thigh while in waist to chest-deep water at New Smyrna Beach about 1 p.m. Wednesday, Volusia beach safety spokesman Deputy Chief Aaron Jenkins told The Atlanta Journal-Constitution.\nThough the bite only broke the skin and was considered not life-threatening, the victim was taken to a local hospital, Jenkins said.\nThe Associated Press and Orlando television station WESH identified the woman as Melanie Lawson.\nOfficials were not able to confirm what kind of shark bit the woman, but Jenkins said shovelhead, bull and blacktip sharks are common in the area.\nBlacktip sharks are one of the most common shark species found inshore off the coast of Florida, but no attacks by this species have caused a fatality, according to the National Oceanic and Atmospheric Administration fact sheet.\nLifeguards on the beaches in Volusia watch for signs of sharks near the coast, such as bait fish pods or pelican diving, Jenkins said.\n“We call people out of the water all the time,” Jenkins said.\nIn other news:","url":"https://www.ajc.com/news/local/marietta-woman-bitten-shark-florida/5BOfpLa4KCg2vVeqU5yKMJ/"}
