{"authors":["Philip Duncan","Press Association"],"date_download":"2018-10-23 01:13:13","date_modify":"2018-10-23 01:13:13","date_publish":"2016-01-28 15:26:46","description":"Fiorentina midfielder Mario Suarez is closing in on a deal to sign for Watford, manager Quique Sanchez Flores has confirmed. Suarez is believed to be having a medical ahead of a £4million move.","filename":"data/vaneerConsumption/MarioSuarezdealclosebutnotfinishedsaysWatfordbossQuiqueSanchezFlores.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AAA35200000578-0-image-a-28_1453994801910.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3421154_Mario-Suarez-deal-close-no-finished-says-Watford-boss-Quique-Sanchez-Flores_1540257193.html","title":"Mario Suarez deal 'close but not finished', says Watford boss Quique Sanchez Flores","title_page":"Mario Suarez deal 'close but not finished', says Watford boss Quique Sanchez Flores  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fiorentina midfielder Mario Suarez is closing in on a deal to sign for Watford, manager Quique Sanchez Flores has confirmed.\nSuarez is believed to be having a medical with the Barclays Premier League club and the move - which is reported to be in the region of £4million - could be finalised later on Thursday.\nSuarez, capped three times by Spain, moved from Atletico Madrid to Fiorentina last summer, but the highly rated 28-year-old has struggled to make an impact in Italy, starting only five league matches for the Serie A side.\nFiorentina midfielder Mario Suarez is closing in on a deal to sign for Watford\nQuique Sanchez Flores has confirmed the £4million move for Suarez is close\n'Mario Suarez is close but it is not finished,' Flores said. 'At the moment I don't have official notice of the club that it is done.\n'So, when Mario Suarez is done I will have the possibility to talk about this player, but it is the kind of quality we are looking for.'\nFlores, who has already signed Nordin Amrabat from Malaga for £6million and Sunderland goalkeeper Costel Pantilimon this month, worked with Suarez during their respective spells at Atletico Madrid.\nAnd the Spaniard, whose side travel to Nottingham Forest in the fourth round of the Emirates FA Cup on Saturday, is hopeful he can bring the best out of the midfielder after a difficult stint in Italy.\n'He is experienced and he plays very well,' Flores added of Suarez, a product of the Atletico youth system.\n'In the last year he has been unlucky a little bit as he hasn't been able to keep up the level of the first eight years of his career, but now it is very important for him to recuperate .\n'We have the tools to recuperate this player and when Mario Suarez recuperates his level he will be amazing for Watford.'\nFlores refused to rule out bringing in a fourth new face during the window, with 19-year-old Liverpool forward Jerome Sinclair also on his radar.\nWatford, 10th in the league after ending their losing streak with a 2-1 victory over Newcastle last Saturday, also expressed an interest in signing Emmanuel Adebayor.\nWatford remain interested in Liverpool's 19-year-old striker Jerome Sinclair (right)\nWatford also targeted Emmanuel Adebayor before he chose to sign for Crystal Palace\nBut the former Arsenal and Tottenham forward, who has not started a competitive match in over a year, opted to join Crystal Palace earlier this week.\n'We had our turn with the player but he didn't find enough reasons to come here so we can't do anything,' Flores added.","url":"https://www.dailymail.co.uk/sport/football/article-3421154/Mario-Suarez-deal-close-no-finished-says-Watford-boss-Quique-Sanchez-Flores.html"}
