{"authors":["Jennifer Smith For Daily Mail Australia"],"date_download":"2018-10-22 23:38:22","date_modify":"2018-10-22 23:38:22","date_publish":"2016-01-11 06:39:41","description":"It's been a whirlwind courtship for Mariah Carey and James Packer, with the pair enjoying no fewer than 12 foreign trips in six months.","filename":"data/vaneerConsumption/MariahCareyandJamesPackerhavespent56DAYSonholidayoversixmonths.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/22/3005C98B00000578-0-image-a-2_1452550010876.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393389_James-Mariah-s-gap-year-Loved-singer-Mariah-Carey-billionaire-beau-James-Packer-spent-56-DAYS-holiday-hooking-six-months-ago-time-work-again_1540251502.html","title":"Mariah Carey and James Packer have spent 56 DAYS on holiday over six months","title_page":"Mariah Carey and James Packer have spent 56 DAYS on holiday over six months | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They made their debut on board a private yacht in Capri last year.\nAnd power couple Mariah Carey and James Packer have spent much of their six month romance overseas.\nFrom Mediterranean cruises to activity-filled trips to the mountains, the pair certainly know how to enjoy themselves, spending 56 days of their courtship abroad.\nWith billionaire Packer in charge of a global casino empire and Mariah one of the world's most successful musicians, it's a wonder the pair ever manage to get any work done.\nScroll down for video\nDebut: Mariah Carey and James Packer made their debut as a couple in Italy last June while they sailed around Portofino and Capri on board his yacht\nIn June last year Mariah and Packer were first spotted holding hands on the Italian island of Capri in what was their first public outing as a couple.\nDraping their arms around one another, the pair seemed relaxed in one another's company, prompting speculation they had been dating for some months before taking the trip.\nThey were joined by Mariah's four-year-old twins, Moroccan and Monroe, with the gang venturing on to Portofino from Capri.\nAfter hitting it off in Capri and Portofino, Packer sailed Mariah and her children on to the South of France.\nLoved-up: The pair enjoyed time in Italy before sailing on to Antibes in the South of France (above)\nJet set: From Antibes the pair moved onto the popular celebrity resort Cannes with Mariah opting for some eye-catching dresses\nParty time: The pair were later seen in Ibiza, with Mariah flaunting her figure in an array of colourful swimsuits\nThe group spent time in Antibes, where the casino mogul married his second wife Erica in 2007, before moving on to Cannes.\nOnce there they were seen flitting between glamorous boutiques and enjoying time on board Packer's yacht, Arctic P.\nAfter making their debut as a couple in spectacular style in Italy, Packer and his latest squeeze journeyed to Israel.\nStill going... After making their debut as a couple in spectacular style in Italy, Packer and his latest squeeze journeyed to Israel. Mariah is seen receiving a kiss from one of her twins after touching down\nAt the time it was claimed the pair planned to meet a spiritual leader in a 'pre-engagement' meeting.\nIt's not known whether such an encounter took place, but there's little doubt over whether the pair enjoyed themselves during the jaunt.\nSpoiled: The pair do most of their travelling, if not all, on board Packer's private jet and luxury yacht\nJobs to do: After sailing around Europe in summer, the pair flew to New York to attend the premiere of The Intern. In October it was on to Macau (right) for the launch of Packer's newest casino\nEnlisting the talent: In October Packer brought Mariah to Macau for the opening of his newest casino\nSharing photographs with her children online, Mariah, 45, gushed over the trip as 'amazing'.\nShe refrained from sharing snaps with her new beau, with sources at the time claiming she hadn't quite let her guard down entirely.\nIn August, after she had wrapped up a residency in Las Vegas, it was clear Mariah and Packer were keen to let their hair down.\nThe natural choice was Ibiza where they were seen looking happy and relaxed in one another's company in their third month of public dating.\nUnlike other party goers the pair were again joined by Mariah's twins and James's children from his marriage to his second wife Erica.\nThey returned to the holiday destination the following month. In September the loved-up duo returned to Italy to enjoy more fun in the sun on board Arctic P.\nTis the season: In December the pair met up in New York after Mariah wrapped up her run of festive shows\nMariah was spotted indulging in pizza and slipping into a wetsuit to enjoy water activities with twins Moroccan and Monroe, clearly relaxed in his company.\nLater that month Packer joined Mariah on the red carpet at what was their first official appearance together.\nThe pair were among guests at the premiere of Robert De Niro's film, The Intern, with Packer putting on an uncomfortable display as he walked the red carpet with his superstar girlfriend.\nOnce inside the Ziegfeld Theatre the pair looked even more tense, with the 48-year-old appearing to raise his hands in the direction of a woman standing near them.\nMariah had already gushed over James after receiving a $500,000 heart-shaped diamond pendant from the businessman which she wore at a concert in Las Vegas.\nLoved-up: The couple spent Christmas in Aspen with her children, sharing snaps of their trip on social media\n'I can't ski': Despite being flown to the exclusive resort to enjoy the holidays, Mariah confessed she would not be taking to the slopes\nIn October the pair were on the road again, this time travelling to Macau for the launch of Packer's casino, Studio City.\nMariah sang at the official launch of the complex which also drew stars De Niro and Leonardo Di Caprio for its opening.\nWhile not technically a leisurely holiday, it was the couple's eighth trip together after just over three months of dating.\nHaving enjoyed a whirlwind romance and clearly eager to spend more time than ever together, Mariah and Packer embarked on an extraordinary marathon holiday together in December.\nTravelling in style: The family flocked to Australia to ring in the new year with Mariah sharing this image on Instagram\nMusic to his ears: Packer planted a kiss on Mariah's head as they enjoyed a day out in Sydney after flying to Australia for new year\nThe fun never ends: The pair are now in St Barts with Mariah's children, enjoying water sports in the Caribbean climes\nMeeting up in New York, the pair spent a short amount of time together there before jetting to Aspen to celebrate Christmas in the snow.\nHOW THEY DIVVIED UP THEIR TIME Mediterranean Cruise and Israel: 18 days Ibiza and Italy: 15 days New York: Seven days Macau: Three days Aspen, Australia, Caribbean: 21 days and counting\nThey were joined as always by her children and her former husband Nick Cannon, with the group playing happy families over the festive period.\nFrom Aspen, where Packer spent time with TV host Karl Stefanovic, they flew to Australia on his private jet to ring in the New Year.\nDecember 31st was spent at Packer's Crown casino in Melbourne before the group jetted to New South Wales to enjoy time in Sydney and at his estate in the Hunter Valley.\nAfter their time in Australia Mariah and Packer flew to Antigua with her children to enjoy the Caribbean tropics.\nThey are now in St Barts where they enjoyed a romantic fireworks display on the beach on Sunday, with Mariah sharing photographs of the occasion on social media.\nWhen will it end? Mariah shared this loved-up snap from their trip to the Caribbean hot spot on Sunday\nNot packing much weight: The casino billionaire looked decidedly slimmer displaying a taut torso while holidaying with Mariah (right, in white) in St Barts on Sunday","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393389/James-Mariah-s-gap-year-Loved-singer-Mariah-Carey-billionaire-beau-James-Packer-spent-56-DAYS-holiday-hooking-six-months-ago-time-work-again.html"}
