{"authors":[],"date_download":"2018-10-30 19:43:38","date_modify":"2018-10-30 19:43:38","date_publish":"2018-07-06 15:12:37","description":"Marietta City Council voted Thursday night to put the Sunday alcohol sales effort (dubbed Georgia's \"brunch bill\") on its Nov. 6 ballot, said city spokeswoman Lindsey Wiles. The council OKed it 6 to 1, with Councilman Reggie Copeland dissenting.","filename":"data/vaneerConsumption/MariettaresidentswillgettovoteonSundaybrunchbill.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/04/05/Images/newsEngin.21692030_Brunch-Drinks-AJC.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_marietta-residen_555395d7d230038148249178346a1c4a__1540928618.html","title":"Marietta residents will get to vote on Sunday ‘brunch bill’","title_page":"Marietta residents get to vote on Sunday Georgia 'brunch bill' booze","title_rss":"NULL","source_domain":"ajc.com","text":"Imagine, if you will: It’s 11 a.m. the Sunday before Thanksgiving. You’re at brunch with friends. Y’all are swapping horror stories ahead of your familial feasts. The conversation makes you want to drink. And, for the first time, you can.\nThis could now be the reality because the Marietta City Council voted Thursday night to put it on the Nov. 6 ballot, said city spokeswoman Lindsey Wiles. The council OKed it 6 to 1, with Councilman Reggie Copeland dissenting.\nIf a majority of voters approve, Nov. 18 — the Sunday before Thanksgiving — is the first day you can get boozy earlier.\nREAD | Marietta wants to get more from property and school taxes\nREAD | With new alcohol bill set to become Ga. law, old prophecies prove iffy\nThis is happening now because of Senate Bill 17, which lets restaurants and wineries sell alcohol starting at 11 a.m. on Sundays instead of 12:30 p.m.\nGov. Nathan Deal signed the “brunch bill” into law on May 8, giving municipalities the final say of whether or not they want to put it on their ballots.\nThe “brunch bill” is a regular under the Gold Dome.\nREAD | 5 best bottomless brunch drink deals in metro Atlanta\nOther versions have made it through the House in past years but died in the Senate.\nAlcohol stores were only allowed to start selling booze on Sundays during Gov. Deal’s first year in office “after five years of heated lobbying that pitted grocery and convenience stores against preachers,” as reported by The Atlanta Journal-Constitution in 2011.\nLike Cobb County News Now on Facebook | Follow us on Twitter","url":"https://www.ajc.com/news/local/marietta-residents-will-get-vote-sunday-brunch-bill/5Sw1pbt0z0umWTPgOv6hBI/"}
