{"authors":[],"date_download":"2018-10-30 19:44:59","date_modify":"2018-10-30 19:44:59","date_publish":"2018-07-05 21:22:45","description":"The city of Marietta and Marietta City schools announced Tuesday that they want to increase taxes. Marietta estimates that the increase will bring in $631,009 more in property taxes than last year. Marietta City Schools is asking for $4,499,330 more.","filename":"data/vaneerConsumption/MariettaMariettaCitySchoolswanttoincreasetaxes.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/AJC/2014/05/04/Images/photos.medleyphoto.5204984.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_marietta-wants-g_e814637a214b22d8c7792e7a785c6d8b__1540928699.html","title":"Marietta, Marietta City Schools want to increase taxes","title_page":"Marietta, Marietta City Schools want to increase taxes","title_rss":"NULL","source_domain":"ajc.com","text":"The city of Marietta and its school system announced Tuesday that they intend to increase taxes.\nMarietta said the increase will bring in $631,009 more in property taxes than what the city collected last year. Marietta City Schools is asking for $4.5 million more to run the school system.\nFor the city’s property tax increase, homeowners with a $250,000 home can expect an increase of $19.50 on their bill, said Marietta spokeswoman Lindsey Wiles.\nWiles said the money will go into the city’s general fund.\nREAD | Cobb chairman’s $453M budget wants tax hike to save parks, libraries\nMarietta received $8.3 million from taxes in 2017, according to its own data provided to The AJC.\nThe city’s millage rate of 2.788 dates back to 2002 and will remain the same this year, Wiles said.\nA mill is one tenth of a penny, so 10 mills equals one percent of a property’s assessed value. Millage rates are calculated on 40 percent of that assessed value.\nAs mandated by law when there’s an increase in the millage rate, there will be public hearings in the council chamber at Marietta City Hall, 205 Lawrence St., on July 10 from 9 a.m. and 6 p.m.., and another July 17 at 9 a.m.\nThe Marietta City Schools millage rate has been 17.97 since 2014 and is also slated to stay the same this year.\nActual Factual Cobb | Where were Cobb’s old gold mines located?\nBecause the school system plans to take more money in taxes it must also hold public hearings to get input.\nIn its announcement, MCS said the budget adopted by Marietta’s board of education “requires” this $4.5 million increase.\nErin Franklin, chief financial officer, said the increase is needed for “salary increases for our employees, increased employee benefit costs, and additional staffing, materials and custodial support at the schools.”\nThe school system received just under $50 million in taxes in 2017, its data shows.\nThe hearings on that tax increase will be held at the Central Office Building, 250 Howard St., on July 10 at 6:00 p.m., and on July 17 at 8:30 a.m. and 5:30 p.m.\nLike Cobb County News Now on Facebook | Follow us on Twitter\nIn other news...","url":"https://www.ajc.com/news/local/marietta-wants-get-more-from-property-and-school-taxes/3TdtWL5WVKBLTHxqO4KspN/"}
