{"authors":["Chriss W. Street"],"date_download":"2018-10-30 19:21:33","date_modify":"2018-10-30 19:21:33","date_publish":"2017-03-23 12:26:57","description":"The U.S. Marines have started blowing up 10 dams in Orange County, in the midst of an ongoing rainy season.","filename":"data/vaneerConsumption/MarinesBlowingUpDamstoReWildOrangeCounty.json","image_url":"https://media.breitbart.com/media/2017/03/Screen-Shot-2017-03-23-at-5.24.12-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2017_03_23__1540927293.html","title":"Marines Blowing Up Dams to 'Re-Wild' Orange County","title_page":"Marines Blowing Up Dams to 'Re-Wild' Orange County | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The U.S. Marines have started blowing up 10 dams in Orange County, in the midst of an ongoing rainy season, and despite President Trump’s executive order to curtail the Obama administration’s controversial “Waters of the U.S.” (WOTUS) regulation.\nLocal Orange County environmentalists howled on March 22 when the Orange County Register reported that U.S. Marines would use huge containers of C4-military explosive to blow up one dam along the Holy Jim Falls trail on March 21, and then two more on March 22.\nPresident Trump on February 28 had ordered a start to the 90-day required review period before eliminating the Obama Administration’s 2015 “Waters of the United States” (WOTUS) executive order that extended the 1972 Clean Water Act to give the U.S. Environmental Protection Agency to re-wilding” authority over America’s smaller streams and marshes.\nAlthough farmers, ranchers, builders and other private interests had successfully challenged the Obama administration WOTUS rules, the administration has had free reign to implement re-wilding on federal lands.\nOrange County environmentalists supported the goals of WOTUS to restore riparian water flows to all U.S. rivers and creeks. But many went ballistic when they learned WOTUS would be used to obliterate 3 rock dams that created idyllic ponds that led the Holy Jim Falls trail to be named the “Best of the OC 2012” by the Register.\nThe 2.8-mile round-trip hike in the Cleveland Forest to the Holy Jim Falls only takes about two hours to walk. But the journey usually crosses a dozen little streams, and people enjoy swimming and fishing in the three ponds created by the man-made dams.\nThe “Save Holy Jim Dams” Facebook page reads like a horror story about the Obama administration’s environmental policies running amok. The U.S. Forest Service first mentioned that it was moving forward to remove the Holy Jim Falls trail’s hand-built rock ponds on March 7. But there was no mention of explosives being used or that the dams that provide flood control would be removed before the end of this year’s rainy season.\nNo one expected that the three “fishing holes” along the Holy Jim Falls trail would qualify to be part of the local Steelhead Recovery Plan to protect endangered fish, because it was documented that the only fish in area creeks were due to the U.S. Forest Service having stocked the Trabuco streams and ponds for decades.\nThe Save Holy Jim Dams page claims that as a result of the environmental studies, “Trabuco and Holy Jim were removed from there critical habitat map,” because it would have been an “absurdity” that fish could travel 20 miles up steep streams and waterfalls to spawn.\nLocal environmentalists are also baffled that the EPA decided to blow up the dams and release decades of silt that will wipeout significant amounts of newts, frogs and other “aquatic species breeding and residing in and near the water.”\nThe Register reported that the County of Orange has contracted with the U.S. Marines to soon start blowing up 7 other man-made dams along Silverado Creek.\nAn earlier version of this story stated, incorrectly, that the Marines had been paid $70,000 to destroy the dams. Olivia Walker, Public Affairs Officer for the Cleveland National Forest, wrote to Breitbart News: “The County of Orange gave us $70,000 in grant money to remove 81 dams, the Marines actually get paid nothing. They are doing this in partnership with us free of cost to save money.” We regret the error.","url":"https://www.breitbart.com/local/2017/03/23/marines-dams-orange-county-wotus-holy-jim/"}
