{"authors":["Karishma Sarkari","Bianca Soldani For Daily Mail Australia"],"date_download":"2018-10-23 01:58:45","date_modify":"2018-10-23 01:58:45","date_publish":"2016-01-29 16:12:15","description":"Mariah Carey and James Packer have now moved into a hilltop perched mansion, inside the ultra exclusive gated community The Oaks in Calabasas, Los Angeles.","filename":"data/vaneerConsumption/MariahCareyandJamesPackersnewsprawlingLAmansionrevealed.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/22/30B5948300000578-0-image-a-17_1454106105906.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422970_Mariah-Carey-James-Packer-s-new-sprawling-LA-mansion_1540259925.html","title":"Mariah Carey and James Packer's new sprawling LA mansion revealed","title_page":"Mariah Carey and James Packer's new sprawling LA mansion revealed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mariah Carey and James Packer are living the high life.\nStill on cloud nine following their whirlwind romance and recent engagement, the power couple have now moved into a cliff-top perched mansion, inside the ultra exclusive gated community The Oaks in Calabasas, Los Angeles.\nThe plush rental property features a sprawling 18,000 sq ft mansion on a one hectare property, that is rumoured to be two houses away from Kourtney Kardashian's, among other celebrity neighbours.\nScroll down for video\nLiving the high life: Mariah Carey and James Packer have moved into a cliff-top perched mansion, inside the ultra exclusive gated community The Oaks in Calabasas, Los Angeles\nHeart of the home: Their expansive kitchen is a home chef's dream with plenty of bench space, double ovens and a large island table\nSplashing the cash! The power couple are reportedly spending AU$$350,000 a month to rent the sprawling 18,000 sq ft mansion\nThe Australian billionaire businessman and the pop star are reportedly spending US$250,000 (AU$$350,000) a month to rent the house in the 'family friendly area'.\nIt's understood the 45-year-old diva's twins Moroccan and Monroe, four, will also stay with the couple in the mansion, which also boasts plenty of room for the kids to play in the backyard - with lots of grassy areas as well as plenty of palm trees for shade on the hot LA days.\nEmil Hartoonian from The Agency told Daily Mail Australia that the pad has never previously be rented out. 'The original owners built the home ground up over the course of 5 years and customized every inch of it,' he said.\nIt features a total of eight bedrooms 'including a detached guest house with living quarters and kitchenette', and also sports a private movie theatre, elevator, wine cellar and tasting room, personal gym and dry sauna.\nIt also comes fitted out with 'millions of dollars worth of technology and components making it a very state of the art property'.\nHeight of luxury: One bedroom features a four-poster bed and private lounge area in front of a fireplace\nWhat a view: A formal dining room sits eight and faces out over the family pool\nFine touches: The open spaces is lit by crystal chandeliers that hang from the ceiling\nFeeling lazy: One lounge area features a plush orange coloured leather trim couch decorated with plenty of colour\nLabour of love: The house has taken five years to build and has never been on the market\nWant to keep it? It's understood the couple have the option to buy the property at the end of their lease if they'd like to stay\nNew home: It's expected Mariah's twins, with ex-husband Nick Cannon, will live with her in the new home\nHaving lots of Hollywood heavyweights as friends, like Robert Di Niro and Leonardo Di Caprio, the couple have opted for a house with multiple entertainment areas both inside and out, to be able to invite everyone over.\nThere is one undercover outdoor setting position that leads out from the main kitchen and living spaces, while there is another semi-circle table setting closer to the pool, for when they would like to soak up the sunshine.\nJust off the generously sized back patio there is a large in-ground pool and off to the side of the single story home is a basketball court with two large basketballs painted onto the centre of the black and orange themed courts.\nThe 48-year-old casino mogul is not known to shoot hoops but might perhaps take up the pursuit with the close by court.\nThe back of the house has multiple bay windows, bringing in plenty of natural light into the home.\nHome cinema: A private movie theatre can comfortably sit 10\nUnique: There is also a tasting room complete with wine-barrel shaped chairs and custom painted walls\nCustom built: It leads on from the large cellar\nWorkout session: The sprawling property, that was custom built by the original owners five years ago, also features a well fitted-out gym\nMan cave: A games room features a large billiards table, pinball machine and cards table\nMemorabilia: Basketball jerseys line the walls of a smaller entertaining space\nAll in the details: A curved hallway is decorated with ornate mirrors, paintings and wall lamps\nWhile the front of the house looks equally as glamorous, with a small semi-circle driveway for guest drop-offs, with what appears to be a four-car garage off to the side, with its own driveway entrance.\nThere are also manicured lawn but minimal gardens across the front of the house, which features multiple angles.\nThe couple are believed to have moved into the rental property, shortly after their New York engagement earlier this month.\nThe leasing agent added that the rich and incredibly famous pair were looking for privacy when they honed in on the one-acre estate.\n'It's a beautiful place to live and raise a family,' Hartoonian said. 'It's one of the very, very few homes to meet their criteria.'\n'It's in a double-gated community and they are behind the second set of gates so there's a double layer of security,' he said.\nFamous neighbours: The celebrity filled neighbourhood includes Kourtney Kardashian, who is believed to live just a few doors down from James and Mariah's place\nCrystal clear: A resort type pool looks extremely inviting and comes complete with a rock based waterfall\nOpen spaces: The pool in lined with green and faces the back of the house\nHideaway: The waterfall hides a small alcove that contains a rock-like seat\nPeace and quiet: An outdoor seating area is situated in a shady area\nDramatic flare: A fire pit out back adds a hint of drama\nFront view! The front of the house features two driveways and manicured lawns but not too much of a garden\nIn addition to the mega movie theatre, gym and spa, the home offers incredible city views, as well as being close to the Pacific Ocean.\nIt's understood the couple will have the option to buy the house should they want to stay there at the end of their lease.\nTwice-married James got down on bended knee and proposed to mother-of-two Mariah last week with a giant 35-carat diamond ring.\nThe pair have been dating for just under a year and first went public with their romance in June 2015 when they were seen walking hand-in-hand through the streets of Capri, Italy.\nCourtside! The one hectare property features a full-sized basketball court off to the side, although James is not known to shoot hoops\nFront view! The front of the house features two driveways and manicured lawns but not too much of a garden\nGreen: The front entrances is littered with beautifully kept flowers and palms\nHill-top perch:The mansion has a commanding view over the edge of the hill\nLots of fun for the kids: Morroccan and Monroe, four, will have lots of room to run about, an in-ground swimming pool to splash about in and a full-size basketball court to play on\nPlenty of space to entertain! With plenty of Hollywood friends to have over, the couple chose a home with multiple entertainment areas","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422970/Mariah-Carey-James-Packer-s-new-sprawling-LA-mansion.html"}
