{"authors":["Alex Martin For Mailonline"],"date_download":"2018-10-23 02:34:13","date_modify":"2018-10-23 02:34:13","date_publish":"2017-03-16 13:09:15","description":"Mario Balotelli refused to speak about his nightmare Liverpool career but had no qualms about criticisng Nice's Ligue 1 title rivals Paris Saint-Germain, calling them a team of individuals.","filename":"data/vaneerConsumption/MarioBalotellirefusestotalkaboutLiverpoolcareer.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E24DF5000000578-0-image-a-96_1489669721228.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4320080_Mario-Balotelli-refuses-talk-Liverpool-career_1540262053.html","title":"Mario Balotelli refuses to talk about Liverpool career","title_page":"Mario Balotelli refuses to talk about Liverpool career | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mario Balotelli refused to speak about his nightmare Liverpool career but had no qualms about criticisng Nice's Ligue 1 title rivals Paris Saint-Germain, calling them a team of individuals.\nThe Italian, who is attempting to revive a stalling career in the south of France this season, asked an interviewer not to speak about his ill-fated spell at Anfield.\nLiverpool agreed to release him from his contract just two years and one Premier League goal after a £16million move from AC MIlan, a deal that went a long way to sealing Brendan Rodgers' fate.\nMario Balotelli is attempting to revive his stalling football career with Ligue 1 outfit Nice\nThe Italian striker suffered a turbulent spell at Liverpool, scoring just one Premier League goal\nAnd it appears the scars left by that turbulent spell in his career are still too sore to discuss, but he was more than happy to talk about his new club Nice, claiming he would happily stay with the team 'for life' if they can get to a European level.\n'Don't speak to me about Liverpool please,' Balotelli told RMC when quizzed about the Anfield club.\n'Yes, I hope so yes [that Nice can become a European powerhouse]. As you say, I would sign for life here. If the football was at a European level, to live here, to have a new training centre, I cannot think of anywhere better.'\nBalotelli says he would happily stay with Nice for life if they can get to a 'European level'\nWhile Balotelli appears unwilling to criticise the Anfield club, he had no such problem when discussing PSG, saying they have not been nearly as impressive as their title rivals Monaco.\nThe 26-year-old said that PSG have been playing like a group of individuals this season and points to the loss of Zlatan Ibrahimovic, who joined Manchester United last summer, as the reason for their apparent decline.\n'Monaco impress me more than PSG, much more. PSG have good players but they don't play as a team.\nBalotelli has been more impressed with the performances of Monaco than Paris Saint-Germain\nThe loss of Zlatan Ibrahimovic left PSG with a group of talented individuals, not a team, he says\n'I have not played against PSG much, I am not saying that they are not a good team. They are in the top places, like us.\n'But without Zlatan they do not play like a team. They can win against anyone, they can lose to anyone,' Balotelli added.\n'Zlatan was the boss, without him it is not the same. Paris is not a team, unlike Monaco. On the contrary, PSG have phenomenons in their team, like Thiago Silva, [Angel] Di Maria. [Edinson] Cavani is a great player but not a phenomenon.'","url":"https://www.dailymail.co.uk/sport/football/article-4320080/Mario-Balotelli-refuses-talk-Liverpool-career.html"}
