{"authors":[],"date_download":"2018-10-30 20:35:05","date_modify":"2018-10-30 20:35:05","date_publish":"2015-10-23 00:03:01","description":"Maris, a beluga whale housed at the Georgia Aquarium since November 2005, died Thursday afternoon. The whale showed no signs of illness in a recent weekly exam, chief veterinary officer Gregory Bossart said, and had been eating normally and interacting with the aquarium’s two other belugas, Grayson and Qinu.","filename":"data/vaneerConsumption/MarismuchlovedbelugawhaleatGeorgiaAquariumdies.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/10/23/Images/photos.medleyphoto.8303169.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_maris-much-loved_223a0771dbd2351a3f5256b36ef7dd0e__1540931705.html","title":"Maris, much-loved beluga whale at Georgia Aquarium, dies","title_page":"Maris, much-loved beluga whale at Georgia Aquarium, dies","title_rss":"NULL","source_domain":"ajc.com","text":"Maris, a beluga whale housed at the Georgia Aquarium since November 2005, died Thursday afternoon.\nThe whale showed no signs of illness in a recent weekly exam, chief veterinary officer Gregory Bossart said, and had been eating normally and interacting with the aquarium’s two other belugas, Grayson and Qinu.\n“This is a case of sudden, acute animal death,” Bossart said.\nMaris, who was born in 1994 at the New York Aquarium, was one of the first beluga whales at the Georgia facility.\nA necropsy, or animal autopsy, is being conducted by University of Georgia pathologists and aquarium vets to determine the cause of death. The results are expected in the next several weeks.\nA Georgia Aquarium blog said, however, that “an exact cause of death may never be known for sure.”\nThe aquarium said in a statement that the beluga whale habitat will remain open to the public with Qinu and Grayson.\nA baby beluga whale born to Maris and Beethoven at the Georgia Aquarium in May died in June after not gaining significant weight after the birth.\nThe pregnancy was the second for Maris. A female whale calf born to Maris and Beethoven at the aquarium in May 2012 died after less than a week.","url":"https://www.ajc.com/news/local/maris-much-loved-beluga-whale-georgia-aquarium-dies/SSLoik1xPS4unDpPjDUcBO/"}
