{"authors":[],"date_download":"2018-10-30 21:35:12","date_modify":"2018-10-30 21:35:12","date_publish":"2017-03-15 14:57:00","description":"An employee at a Marietta Chick-fil-A, 2105 Roswell Road, got creative asking his date to the Wheeler High School prom.","filename":"data/vaneerConsumption/MariettaChickfilAemployeeusesrestaurantssignforpromposal.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/16/Videos/5362294831001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_high-schooler-us_ea8ba828b0266a757817a3ac08e4a004__1540935312.html","title":"Marietta Chick-fil-A employee uses restaurant's sign for promposal","title_page":"Marietta Chick-fil-A employee uses restaurant's sign for promposal","title_rss":"NULL","source_domain":"ajc.com","text":"If you drove past the Chick-fil-A on Roswell Road this past Friday, you might have noticed something unusual.\nWhat you would have seen was the culmination of a teenage drive-thru window romance with an eight-piece order of chicken nuggets on the side.\nDavon Lee’s public “promposal” — an elaborate way of asking someone to prom — to Tatum Hoof using the roadside sign outside the store and the cow mascot was memorialized by the store’s Facebook page.\nHere’s how it went down.\nThe 17-year-old Wheeler High School junior works at the 2105 Roswell Road location and figured he should use his workplace to his advantage.\nYou see, Lee first became acquainted with 18-year-old Hoof, a senior at Walton High School, while working the drive-thru because she’s been ordering food (the same eight-count order of nuggets) every Thursday since January.\n“I had my eye on her because I’d seen her around,” he said Tuesday.\nLee and Hoof have been dating a month, but even before then they’d had an agreement to go to their proms together. The surprise was gone, so he knew it had to be a stunt to make it special.\nThis store is known for its creativity, including a musical light show for those in the drive-thru this past holiday season.\nHe was perusing Pinterest and stumbled upon prom proposal ideas. He saw that someone had popped the question using a Chick-fil-A sign. He had his stunt.\nSo he told Hoof to meet him at the store for some food Friday.\nDavon had set up the sign outside the store to read:\nTATUM WILL\nYOU BE MY\nCHICK AT PROM?\nAs for the execution, she may have seen the sign on the way in and gotten there a bit earlier than expected, but Lee grabbed the red roses he’d gotten her, marched into the lobby with the cow mascot at his side and asked her to be his prom date.\nShe said yes.\nThe staff, which store manager Emily Marchant described as a family, was ecstatic and excitedly snapped photos throughout.\n“He wanted to do it in his own personal way,” she said.\nThe manager did warn that the only reason all this happened is because Lee works there, so other Romeos shouldn’t get any ideas.\nLee was happy he got to ask Hoof to prom where he’d first been swept up by her.\nBefore he got the idea, he remembers thinking, “I should make the most of my job and try to incorporate it into that.”","url":"https://www.ajc.com/news/local/high-schooler-uses-marietta-chick-fil-sign-very-public-promposal/clR2mmbNsXwmPGxbtQP7eN/"}
