{"authors":["Chris Pleasance For Mailonline"],"date_download":"2018-10-23 03:13:40","date_modify":"2018-10-23 03:13:40","date_publish":"2017-04-26 14:36:06","description":"Emmanuel Macron was forced to admit he cannot save workers in northern France from redundancy when their factory moves to Poland as he paid them an unscheduled visit on Wednesday.","filename":"data/vaneerConsumption/MarineLePenupstagesrivalMacronwithfactoryvisit.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/17/3FA0BEED00000578-0-image-a-147_1493223281684.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447882_Le-Pen-upstages-French-rival-Macron-factory-visit_1540264420.html","title":"Marine Le Pen upstages rival Macron with factory visit","title_page":"Marine Le Pen upstages rival Macron with factory visit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Emmanuel Macron told striking factory workers that he can do nothing to save their jobs from cheap foreign labour when he paid them a last-minute visit on Wednesday.\nMacron, who is pro-globalisation, had not been scheduled to speak with Whirlpool staff in his hometown of Amiens, but was forced to make a detour after Marine Le Pen went to see them earlier in the day.\nConfronted by mechanics angry that their factory will be closed next year as production moves to Poland, Macron said: 'I'm not telling you that I'm going to save your jobs, because nobody can do it.\n'Stopping globalisation and closing our borders isn't the solution. Those who are telling you to that are lying to you.'\nEmmanuel Macron admitted he could do nothing to save jobs at a factory in his hometown of Amiens on Wednesday as he paid striking workers an unscheduled visit\nThe pro-globalisation candidate had not been due to visit workers, who are angry that their factory will be moved to Poland next year, until Marine Le Pen spoke to them earlier in the day\nMacron insisted that Le Pen was 'lying' to workers when she said that closing France's borders and stopping globalisation would help them\nThe EU supporter said earlier in the day that the factory will end up closing under Le Pen's government because she would wreck the economy\nLe Pen hoodwinked Macron out of his own press opportunity when she paid a surprise visit to workers earlier in the day as he met miles away with union leaders\nLe Pen painted Macron as out-of-touch and a man of big business as she took pictures with Whirlpool staff, insisting:' I am with French workers'\nMacron was initially heckled as he climbed out of his car as furious workers yelled questions at him, with one saying: 'There is no work!'\nBut he managed to calm the crowd down before taking questions from them, eventually swapping handshakes with some.\nSpeaking in a Facebook live stream, he added: 'France's recovery will take time, it will be difficult. I will come back to see you.\n'There will always be companies that behave badly ... We have to be tough with them, which is why I will take all my responsibilities on the social level'\nMacron did have a scheduled meeting with union bosses from the factory earlier in the day, but was hoodwinked out of a his own press opportunity when Le Pen made her way directly to the picket lines.\nPushing her anti-globalisation agenda, she said: 'Emmanuel Macron is with the oligarchs, with [the employers' association] ... I am with the French workers.'\n'When I heard that Emmanuel Macron was coming here and did not plan to meet the workers, did not plan to come to the picket line but would shelter himself who knows where in the chamber of commerce ... I considered it was such a sign of contempt for the Whirlpool workers that I decided to ... come here and see you,' she said.\nShe later tweeted that the factory would not be closed under her government.\nMeanwhile Macron was being shown on TV sitting around a table speaking with men wearing high-visibility vests in a grey meeting room.\nMacron hit back, accusing Le Pen of using the industrial trouble at Whirlpool for her own political ends.\nHe told reporters he had been trying to find a practical solution to the issue in his discussions with the unions.\n'Mrs Le Pen is using the situation for political ends, stirring up crowds on a parking lot,' he said. 'If she's elected, this company will close.'\nLe Pen's approach was in stark contrast to Macron's own meeting with union bosses earlier in the day in his hometown of Amiens\nMacron accused Le Pen of grandstanding, and said he would also be visiting the factory - a stop that was not listed on his official schedule\nImages of Macron sat behind a table in a suit and tie were in stark contrast to the images of Le Pen posing on the picket lines\nLe Pen pulled off the surprise visit while rival Macron was a few miles away in Amiens, visiting union representative from the same factory\nLe Pen used the occasion to push her anti-globalisation agenda, saying that Macron was on the side of 'oligarchs' and did not care about workers\nAsked about the Whirpool site closure on a TV show this month, Macron said: 'A presidential campaign is not about grand-standing slogans and promises that can't be kept.'\nLe Pen, 48, was first out of the blocks in campaigning for the run-off, hitting the trail and accusing the pro-EU centrist Macron of representing 'runaway globalisation' and lacking love for his country.\nA Harris Interactive poll showed 52 per cent of the French believe Macron, a pro-EU candidate, botched the start of campaigning for the May 7 run-off in France's presidential vote.\nAfter winning Sunday's contest with 24.1 percent to Le Pen's 21.3 percent, he gave an exuberant victory speech followed by a high-profile celebration at Paris bistro La Rotonde bistro, drawing criticism from some quarters.\nSocialist Party boss Jean-Christophe Cambadelis told French radio: 'He was smug. He wrongly thought that it was a done deal. It's not a done deal.'\nPresident Francois Hollande appeared on Tuesday to admonish his former economy minister for not taking the fight to Le Pen immediately after the first round.\nMacron shot back Tuesday, saying: 'I will continue to fight for two weeks... I will defend the progressive camp to the end.'\nHollande has endorsed Macron, saying Le Pen would wreck the economy and endanger French Liberty, while former President Nicholas Sarkozy has also begrudgingly thrown his support behind the centrist.\nShe told the strikers: 'When I heard that Emmanuel Macron was coming here and did not plan to meet the workers I considered it such a sign of contempt that I came to visit you'\nLe Pen has been campaigning hard after initial polls predicted that she will lose the May 7 election to Macron by 61 per cent to 39 per cent\nLe Pen's voter base consists largely of young people, so the visit on Wednesday will also be an attempt to woo over middle-aged voters\nThe former National Front leader stepped down as head of the party earlier this week in an attempt to increase her election appeal\nSince securing her berth in the run-off, Le Pen has turbo-charged her campaign with a string of appearances and statements, leaving her opponent on the back foot.\nAt the crack of dawn on Tuesday she was at the sprawling Rungis food market outside Paris, taking aim at what she said was Macron's desire for 'total deregulation, total opening up, total free trade'.\nIn contrast, her opponent has huddled in strategy meetings over June legislative elections that would determine the shape of a future Macron government.\nLe Pen will hold a rally in the Riviera city of Nice on Thursday, a bastion of France's right that was targeted by a jihadist-inspired truck attack that killed 86 people in July.\nLe Pen has called for France to take back control of its borders from the European Union and deport all foreigners on a terror watchlist, accusing Macron of being soft on terrorism.\nStill, polls suggest that Macron will trounce Le Pen in the run-off with a margin of some 20 points.\nBut after the political shocks of Britain's vote to leave the European Union and Donald Trump's unlikely ascent to the White House, analysts say a late surge by Le Pen is still possible.\nA key factor in the race is which candidate the supporters of Communist-backed Jean-Luc Melenchon, who finished in fourth place with 19.58 percent on Sunday, will back in the run-off.\nMelenchon faced criticism after he failed to urge people who voted for him to get behind Macron in the run-off as part of the so-called 'republican front', the decades-old French tactic of closing ranks to block the far-right.\nMelenchon's France Insoumise (Unbowed France) movement is holding a consultation on which candidate to back in the second round, but his spokesman Alexis Corbiere said the eliminated candidate would not express his own preference.\nCorbiere however told French TV channel LCI earlier Wednesday that 'for us the National Front is a danger' and urged viewers to not give 'a single vote to the National Front.'\nLe Pen said Monday she was quitting temporarily as head of her National Front (FN) in order to concentrate on the campaign.\nThe move was seen as largely symbolic but one that would loosen her association with the FN, the party founded by Le Pen's father, Jean-Marie, notorious for anti-Semitic and xenophobic remarks.","url":"https://www.dailymail.co.uk/news/article-4447882/Le-Pen-upstages-French-rival-Macron-factory-visit.html"}
