{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 21:30:01","date_modify":"2018-10-30 21:30:01","date_publish":"2016-07-29 09:59:29","description":"A new spot for seafood is set to open in Atlanta next month.","filename":"data/vaneerConsumption/MariscoselMalecontoopenonBufordHighwayinmidAugust.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/07/29/Images/WPIMAGE_cmgajcfoodandmore_9844.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_ma_2d68fa7a4ae2378cfe201379a77d4b3b__1540935001.html","title":"Mariscos el Malecon to open on Buford Highway in mid-August","title_page":"Mariscos el Malecon to open on Buford Highway in mid-August","title_rss":"NULL","source_domain":"ajc.com","text":"A new spot for seafood is set to open in Atlanta next month.\nMariscos el Malecon is set to open its doors at 3979 Buford Highway by mid-August, according to co-owner Carlos Zambrano, who calls his venture \"the first authentic Mexican seafood restaurant in Atlanta.\"\nThe menu will feature specialties including huachinango, a red snapper dish; mojarra, a deep-fried tilapia; several different kinds of ceviche; lobster; and other Mexican seafood dishes.\n\"When people think about Mexican food, they think tacos and burritos, but Mexico has one of largest ocean ports in the world,\" Zambrano said.\nThe spot will also feature a family area complete with a playground and arcade games.\nZambrano, along with business partner and chef Jaime Ponce, also own La Costilla Grill in the same complex on Buford Highway, and about 70 percent of the food stalls at Plaza Fiesta.\nClick here to read the AJC’s Ultimate Guide to Brunch in Atlanta.\nClick here to read about dining in Atlanta around the clock.\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following @ATLDiningNews on Twitter. Find us on Instagram @AJC.","url":"https://www.ajc.com/blog/atlanta-restaurants/mariscos-malecon-open-buford-highway-mid-august/G3N3UoidrYKUrHgYtWJxtO/"}
