{"authors":[],"date_download":"2018-10-30 18:22:31","date_modify":"2018-10-30 18:22:31","date_publish":"2016-12-23 21:25:00","description":"Emily Lembeck has been superintendent of Marietta City Schools for nearly 12 years, but she retires Dec. 31. Cobb Schools' Grant Rivera takes over Jan. 1","filename":"data/vaneerConsumption/MariettaSchoolschiefretiresafternearly40yearsineducation.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/16/Images/122516%20EV%20Emily%20Lembeck6.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_marietta-schools_1375d8971260ced3009e258cd226fb10__1540923751.html","title":"Marietta Schools chief retires after nearly 40 years in education","title_page":"Marietta Schools chief retires after nearly 40 years in education","title_rss":"NULL","source_domain":"ajc.com","text":"A group of Marietta first-graders sit at a mishmash of desks coloring in books filled with different nouns.\nThe students look up as a lady with bright red nails walks in. They have no idea, but she is a very specific noun: Superintendent of Marietta City Schools Emily Lembeck.\nOnce she’s done talking with the other teachers, she zips over to a group of students, kneels beside them like countless times before and cracks a huge smile.\n“Yes, but what is a noun?” she asks.\nLembeck has been doing this for more than 37 years, but on Dec. 31 she becomes a different noun — retiree. She’ll hand the title of superintendent over to Grant Rivera from the Cobb County School District.\nIn her almost 12 years as Marietta’s first female superintendent, Lembeck created Georgia's fourth charter district, grew the school system to 9,200 students and dealt with large-scale demographic changes inside the district.\nWhen asked about her lifelong passion, she often says: “We’re in the opportunities business. There can not be any losers in public education.”\nLoretta\nLembeck trudged her way through school as a child in the east Flatbush area of Brooklyn. She didn’t have the supplies she needed. She taught herself to read in third grade.\nWhen she got to Brooklyn College, at $52 a semester, she wanted to be a fashion designer.\nBut there’d be no fashion designing. Women weren’t allowed to think much past social work, nursing or education.\n“The opportunities for women of that time were limited,” she said.\nSo, “through the narrow lens” she had, she chose teaching and started in rough Coney Island.\nMarietta City Schools Superintendent Dr. Emily Lembeck walks the hallways at West Side Elementary, Wednesday, Nov. 30, 2016, in Marietta, Ga. BRANDEN CAMP/SPECIAL\nIn her program, sophomore education students were sent into all types of New York City classrooms to start getting experience.\nLembeck remembers her first time in a classroom as a 19-year-old student-teacher. The wooden floors were filthy. The windows were cracked. The desks were tossed about.\nShe was tasked with improving the reading skills of a first-grade girl — Loretta.\nLembeck remembers helping the young girl with matted hair and smelling of urine.\nThe rookie teacher did her best to help the girl, but she was just so behind where she needed to be.\n“It was at that moment I knew that was it,” Lembeck said through tears.\nIt was that connection she felt to Loretta, another poor girl having trouble reading, that made her want to help children who’d grown up like her.\n“I know what it felt like to be a struggling student who may not have had that piece of posterboard or magazines to do the project,” she said.\nIt was only a few minutes in 1972, but the impression was indelible. Lembeck brought up Loretta in her initial interview as superintendent with The Atlanta Journal-Constitution in September 2004.\nLoretta was the drive for her to help all those children over the years.\nLembeck became the first woman in her family to graduate college, she taught at schools in Florida until work brought her and her husband Harry to Georgia in the late 80s.\nShe’s been here since, worked her way up and became the district’s first female superintendent.\n“I always wanted to be one of the guys,” she said.\nIn her nearly four decades of public education, she’s learned that so much of what happens at school starts at home.\n“All parents, regardless of how they may express themselves, care about their kids,” she said. “No matter how they communicate their frustrations differently from each other potentially, they still care about their kids.”\nAs schools have become less homogeneous, Lembeck has adapted. Out of 4,800 total students, the number of non-English-speaking children in the district in 1994 was 96. When Lembeck took over the school system a dozen years ago, that number was 973.\nSince then, the district has grown to 8,900 students, more of whom are Hispanic and black. There’s also been an increase over the years in the number of poor students in the district.\nOriginal caption: \"June 2, 2000, was the final day of school for many metro area schools, including the City of Marietta school system. Dunleith Elementary School Principal Emily Lembeck was getting a lot of hugs, maybe more than usual, because next school year Lembeck moves up in rank to become the principal at Marietta Middle School. Here Lembeck, left, gets a nice hug from Tabitha Cochran, 10, just before the end of school.\" (ANDY SHARP/AJC file photo)\nLembeck instituted a policy in which those students who can’t speak English take 21 days off during the school year in exchange for 21 days of English instruction during the summer to make sure they don’t lose the language.\nBecause of a federal grant, parents can learn English sitting right next to their children with transportation, lunch and daycare provided.\n\"It’s about looking at your resources,” she said. “It really is going to take more than the schools. It’s got to be bigger than that.”\nThe biggest problem her successor will face, Lembeck said, is student mobility, or churn. That’s students transferring from one school to another during the school year. It makes teaching tough, and it’s been a problem in Georgia for years.\nSome students, she said, spend two weeks in a Marietta school before having to go to another home or parent.\nIf that’s the case, “it’s going to be the best two weeks of education they’re ever going to get,” Lembeck said.\nIt’ll take a bit for her not to worry about thousands of kids and 1,200 staff at 11 schools every day.\n“They have really tapped someone with skills and experience to move the district forward,” she said of Rivera. “When you invest so much of yourself into something, you want to see it flourish.”\nGrant\nGrant Rivera is an outsider to the Marietta school system, but he’s as close as you can be.\nHe is currently chief of staff at Cobb County School District where he’s been for 14 years.\n“I have watched from a close distance her leadership,” he said.\nRivera is husband to Jenn Hobby of the Star 94.1's Jeff & Jenn Show. They’ll be moving from Virginia Highlands to Marietta for the position.\nAnd when he gets to Marietta, he wants to partner with the faith communities, law enforcement, business leaders along with anyone else he thinks can help improve the district and its families.\nHonored to serve, proud to lead, and ready to dream with every educator, every family, and every child. #MariettaCitySchools — Grant Rivera (@grantrivera) November 10, 2016\n“When people talk about relocating to Marietta … I want the first words out of their mouth to be how great the school district is,” he said.\nHe knows he’ll need Lembeck’s help.\n“Part of that is me spending time with her and understanding things she put in motion 10, 12 years ago,” he said. “One of the most important things to me is honoring the legacy and trajection of this district.”\nCarrie\nBack in that first-grade classroom, Lembeck peers around looking for the students who need the most help as if she were administering educational triage.\nCarrie Reeser, the teacher assigned to that classroom at West Side Elementary, mirrors Lembeck’s movements.\nReeser, 34, has been with Marietta City Schools for 12 years teaching kindergarten, so this is her first year teaching in this first-grade classroom.\n“People know who you are,” she said of the district. “It’s a family kind of feel.”\nThe superintendent had been her first-grade teacher, but it wasn’t until she was partially unpacked that she realized she’ll be teaching in the same classroom she’d been taught in as a six-year-old girl back in 1988.\n1st grade teacher Carrie Reeser, left, and Marietta City Schools Superintendent Dr. Emily Lembeck, who taught Reeser in 1st grade, talk with students at West Side Elementary, Wed. Nov. 30, 2016, in Marietta, Ga. BRANDEN CAMP/SPECIAL\nIt was actually Lembeck’s first classroom in Marietta.\nReeser remembers only a few things about Lembeck as a teacher. She had trail mix she’d hand out to students. She never raised her voice. She made learning comfortable.\nAnd she remembers Lembeck’s red nails tapping on the desk as children read.\n“To a little girl, that was cool,” Reeser said.\nNow, Reeser’s daughter is a first-grader at the school.\nThe blackboard has been replaced with one of the digital variety, but the cabinets, bookcases and feel is the same, Lembeck said.\n“It feels like my classroom,” she said. “It’s always home when I come back here.”","url":"https://www.ajc.com/news/local/marietta-schools-chief-retires-after-nearly-years-education/YgfRZsp1dESK2MzX3AlU6K/"}
