{"authors":[],"date_download":"2018-10-22 21:23:09","date_modify":"2018-10-22 21:23:09","date_publish":"2014-06-05 01:31:17","description":"The crash happened in Imperial Valley, Calif., about two hours from San Diego County.","filename":"data/vaneerConsumption/MarineJetCrashesIntoSoCalNeighborhoodPilotEjected.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/488571/140604-plane-crash-house-jms-2148_b56cdc12c6cfa2f5e2e0d8b6f4ce23bc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_marine-jet-crashes-socal-neighborhood-pilot-ejected-n123111_1540243389.html","title":"Marine Jet Crashes Into SoCal Neighborhood; Pilot Ejected","title_page":"Marine Jet Crashes Into SoCal Neighborhood; Pilot Ejected","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFROM NBC SAN DIEGO\nA military plane crashed into homes in an Imperial Valley neighborhood about two hours southeast of San Diego County Wednesday afternoon, officials confirmed.\nThe pilot safetly ejected from the plane before it crashed, officials said, and no civilians on the ground were injured.\nAccording to California Highway Patrol El Centro, the plane crashed in a residential area at Cross Road and Fonzie Avenue in Imperial, Calif., near the U.S.-Mexico border, about 115 miles from San Diego.\nOne house caught fire as a result of the crash, and two to three additional homes were also impacted, CHP officials said.\nImmediately after the crash, Marine Corps Air Station (MCAS) Miramar also confirmed via Twitter that the Harrier jet crash impacted civilian structures.\nEight homes near the crash site were evacuated, according to Imperial County officials, MCAS Miramar tweeted.\nMCAS Miramar officials said the Third Marine Aircraft Wing AV-8B Harrier was stationed at MCAS Yuma and crashed around 4:20 p.m. The pilot was transported to a local hospital for evaluation, base officials said. The pilot's current condition is unknown.\nMCAS Miramar 1st Lt. Jose Negrete said authorities are on scene collecting evidence, and the damage is being assessed. An investigation has been launched to determine the cause of the crash.\nAs of 8 p.m., Negrete said no further details were being released.\nPatricia and Nestr Roblas live a few house down from the crash site and said the impact of the plane striking the area caused an explosion.\n“I heard a large explosion, and it felt like an earthquake. My dad thought a car hit our house. It was just a loud explosion and I felt a jolt,” Patricia told NBC 7 San Diego. “It smelled really bad, like toxic fumes.”\nPatricia said authorities came to their front door after the crash and told them to turn off their air conditioning unit so as not to let the fumes in.\nPatricia said the ordeal was extremely frightening, to say the least.\n“It was really scary. After they put the fires out, a few minutes later, we saw another huge fire so we didn’t know if there was an explosion because of gas or what,” she explained. “I was scared there would be more explosions and the fires would reach our house.”\nNestr said he was watching television when he heard an explosion. As he walked outside, he saw a \"big, black wall of smoke\" stemming from the crash site.\nHe said it felt as if he was watching a movie up close.\n“If you’re watching a movie, [something like this] doesn’t look that scary but in real life you get freaked out,\" he said.\nImperial resident Cathie Blackburn lives about one mile from the site of the crash and told NBC 7 she heard a \"loud boom\" when the aircraft went down. The impact was so strong, Blackburn thought it may have been an earthquake.\nBlackburn said some friends who live in the neighborhood saw the pilot eject.\nShe said the fire was put out quickly. As of 6:45 p.m., Blackburn said authorities were telling residents that streets in the surrounding area would be closed for the rest of the night as officials begin their investigation.\nCheck back for updates on this breaking news story.","url":"https://www.nbcnews.com/news/us-news/marine-jet-crashes-socal-neighborhood-pilot-ejected-n123111"}
