{"authors":["Alicia Vrajlal For Daily Mail Australia"],"date_download":"2018-10-23 00:00:43","date_modify":"2018-10-23 00:00:43","date_publish":"2016-01-11 08:14:35","description":"He is set to compete in the World Tennis Challenge in Adelaide from Tuesday.","filename":"data/vaneerConsumption/MarkPhilippoussistouchesdowninAdelaidewifeSilvanaandsonNicholas.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/05/30054A3100000578-0-image-a-68_1452491656529.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393421_Mark-Philippoussis-touches-Adelaide-wife-Silvana-son-Nicholas-ahead-tennis-challenge_1540252843.html","title":"Mark Philippoussis touches down in Adelaide wife Silvana and son Nicholas","title_page":"Mark Philippoussis touches down in Adelaide wife Silvana and son Nicholas | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He is set to compete in the World Tennis Challenge in Adelaide later this week.\nAnd Mark Philippoussis has made sure he has his own personal cheer squad on hand to support him courtside.\nThe 39-year-old Australian tennis player was spotted touching down in Adelaide on Monday with his model wife Silvana and one-year-old son, Nicholas.\nScroll down for video\nFamily first: Tennis ace Mark Philippoussis was spotted touching down in Adelaide on Monday alongside wife Silvana and one-year-old son Nicholas\nOf course saving his tennis whites until it is match time, the dark-haired sportsman wore a black T-shirt as he strolled through the South Victorian airport terminal.\nThe tennis ace teamed his top with a pair of charcoal shorts, while his look was rounded off with a pair of black trainers.\nA backpack no doubt contained his storage essentials, while his mobile phone was firmly held in his left hand.\nMother and son: Silvana was seen carrying little Nicholas the family made their way through the terminal\nLook there: The pair's tiny tot was no doubt amused by the sights at the airport\nCool and casual: Mark saved his tennis whites for the court and wore a black T-shirt for his travels\nMeanwhile, long-haired Silvana also opted for a relaxed look.\nThe 29-year-old actress was seen wearing a sleek black top teamed with a pair of ripped jeans.\nShe wrapped a blue denim jacket around her waist and added a few accessories to complete the casual chic look.\nLuggage alert: Mark was in charge of pushing the trolley with the several suitcases\nCasual chic: Silvana was seen wearing a sleek black top teamed with a pair of ripped jeans\nA Louis Vuitton bag was slung over her left shoulder, while she made her way through the airport in a pair of tan coloured sandals.\nIn her arms was little Nicholas, looking very much like his father in a blue and white ensemble.\nThe tiny tot, who is set to turn two next month, wore a white T-shirt, blue jacket and a pair of baby blue shorts.\nMixing it up: A blue denim jacket was wrapped around her waist, and she added a few accessories to complete the casual chic look\nStrutting: She made her way through the airport in a pair of tan coloured strappy sandals\nLike father like son: Nicholas was a mini-me version of his father in a blue and white ensemble\nMark and Silvana tied the knot in September 2013.\nThey then went on to welcome Nicholas into the world in February the following year.\nThe family's arrival in Adelaide comes ahead of the World Tennis Challenge being held in the South Victorian capital city from January 12 to 14.\nMark is said to be taking on Sweden's Mats Wilander and Crotia's Goran Ivanisevic.\nBlue and white colour scheme: The tiny tot, who is set to turn two next month, wore a white T-shirt, blue jacket and a pair of baby blue shorts","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393421/Mark-Philippoussis-touches-Adelaide-wife-Silvana-son-Nicholas-ahead-tennis-challenge.html"}
