{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:53:58","date_modify":"2018-10-30 19:53:58","date_publish":"2015-06-25 00:22:49","description":"On June 24 on CNN, gun control proponent Mark Kelly said Obama was right for politicizing the Charleston shooting one day after it happened.","filename":"data/vaneerConsumption/MarkKellyObamaWasRighttoPoliticizeCharlestonAttack.json","image_url":"https://media.breitbart.com/media/2015/04/mark-kelly-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_06_24__1540929238.html","title":"Mark Kelly: Obama Was Right to Politicize Charleston Attack","title_page":"Mark Kelly: Obama Was Right to Politicize Charleston Attack | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During a June 24 appearance on CNN, gun control proponent Mark Kelly said he thinks Obama was right for politicizing the Charleston attack one day after it happened.\nKelly said he personally learned from the Sandy Hook Elementary shooting that the quicker the push for gun control begins the better.\nCNN host Carol Costello said:\nPresident Obama brought up gun control right after the Charleston shootings went down, and a lot of people said it was just insensitive and it’s not the time and why do these issues always come up when tragedy happens. Can you respond to that?\nKelly responded:\nI used to say that same thing, too. After Aurora, I said on CNN–on Anderson Cooper–one day, “Now is not the time, the community needs to heal.” Well, after Sandy Hook, I changed my mind. If, when 20 kids—20 first graders and kindergartners—die in their classroom, if that’s not the time, when is? Or in this case, the shooting in the Charleston church, when is the time? I’ve completely done a 180 on that. When these things happen, it is the time to start talking about them.\nOn the same day on which Kelly said these things, The Hill reported that Chris Murphy (D-CT) said: “[If] you can’t talk about anti-gun violence policy the day after a large number of Americans are shot, then you will never talk about anti-gun violence policy.”\nLess than 24 hours after the heinous attack on the Charleston church occurred, Breitbart News reported that Obama said: “We don’t have all the facts, but we do know that, once again, innocent people were killed in part because someone who wanted to inflict harm had no trouble getting their hands on a gun.”\nDays later, now that we do have more of “the facts,” CNN and NBC are both reporting that the Charleston shooter got his gun legally at gun store—which means he passed a background check. Waiting just a few days would have given law enforcement time to clarify this before calls for more gun control were issued.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/06/24/mark-kelly-obama-was-right-to-politicize-charleston-attack/"}
