{"authors":["Associated Press"],"date_download":"2018-10-23 03:21:07","date_modify":"2018-10-23 03:21:07","date_publish":"2017-04-26 14:45:52","description":"The latest on developments in financial markets (All times local):4:15 p.m.Stocks closed nearly unchanged as early gains evaporated following the White...","filename":"data/vaneerConsumption/MarketsRightNowUSindexesclosenearlyunchanged.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447870_Markets-Right-Now-US-indexes-higher-early-trade_1540264867.html","title":"Markets Right Now: US indexes close nearly unchanged","title_page":"Markets Right Now: US indexes close nearly unchanged | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The latest on developments in financial markets (All times local):\n4:15 p.m.\nStocks closed nearly unchanged as early gains evaporated following the White House's announcement about its tax policy proposals.\nCorporate earnings were also in focus Wednesday. Overall more stocks rose than fell.\nHealth care companies gained more than the rest of the market. Health insurer Anthem gained 3.7 percent after reporting earnings that beat analysts' expectations.\nThe Standard & Poor's 500 fell 1 point, or 0.1 percent, to 2,387.\nThe Dow Jones industrials fell 21 points, or 0.1 percent, to 20,975. The Nasdaq composite was little changed at 6,025.\nThe Russell 2000 index of smaller-company stocks rose 8 points, or 0.6 percent, to close at a record high of 1,419.\n___\n11:45 a.m.\nStocks are making modest gains in midday trading as investors wait for the White House to announce its tax policy proposals.\nCorporate earnings were also in focus Wednesday, and health care companies were rising more than the rest of the market.\nHealth insurer Anthem gained 3.7 percent after reporting earnings that beat analysts' expectations. Baxter International was up 1.8 percent after its own results beat forecasts.\nThe Standard & Poor's 500 rose 3 points, or 0.1 percent, to 2,391.\nThe Dow Jones industrials gained 37 points, or 0.2 percent, to 21,034. The Nasdaq composite was little changed at 6,024.\n___\n9:35 a.m.\nStock indexes are mostly higher in early trading on Wall Street as investors focus on the latest batch of corporate earnings.\nHealth care stocks rose more than the rest of the market in early trading Wednesday. Health insurer Anthem gained 2.4 percent after reporting earnings that beat analysts' expectations.\nBaxter International was up 2.7 percent after its own results beat forecasts.\nThe Standard & Poor's 500 rose 1 points, or 0.1 percent, to 2,389.\nThe Dow Jones industrials gained 19 points, or 0.1 percent, to 21,015. The Nasdaq composite increased 4 points, or 0.1 percent, to 6,029.","url":"https://www.dailymail.co.uk/wires/ap/article-4447870/Markets-Right-Now-US-indexes-higher-early-trade.html"}
