{"authors":["Australian Associated Press","Daniel Peters For Daily Mail Australia"],"date_download":"2018-10-22 20:13:31","date_modify":"2018-10-22 20:13:31","date_publish":"2016-01-28 00:31:25","description":"Former NRL bad boy Mark Geyer has called for Mitchell Pearce to be suspended from the NRL for a year after he was filmed simulating a lewd act with a dog during drunken Australia Day celebrations.","filename":"data/vaneerConsumption/MarkGeyersaysMitchellPearceshouldbebannedforsimulateddogsex.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/30A5E26A00000578-0-image-a-59_1453941304767.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420151_Mark-Geyer-says-Mitchell-Pearce-banned-12-months-simulated-dog-sex_1540239211.html","title":"Mark Geyer says Mitchell Pearce should be banned for simulated dog sex","title_page":"Mark Geyer says Mitchell Pearce should be banned for simulated dog sex | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Former NRL bad boy Mark Geyer has called for Mitchell Pearce to be suspended from the NRL for a year after he was filmed simulating a lewd act with a dog during drunken Australia Day celebrations.\nAn intoxicated Pearce, 26, can be seen in a video forcing an unwanted kiss on a woman before grabbing a small dog and simulating a sex act.\n'He needs to be suspended for 12 months, get a real job away from football and undergo both counselling and rehab,' Geyer told Triple M on Thursday.\nScroll down for audio\nFormer NRL bad boy Mark Geyer has called for Mitchell Pearce to be suspended from the NRL for a year\nRugby league star Mitchell Pearce has been filmed allegedly simulating a sexual act with a small dog while yelling 'I wanna f*** your dog'\n'He needs to be taken out of the system that he joined as a kid to appreciate what he's got.\n'He is obviously powerless when affected by alcohol and cannot control his behaviour.\n'Pearce needs help and needs to be as far away from footy as possible.'\nFormer Newcastle and Cronulla star Matthew Johns, who was embroiled in a 2002 group sex scandal in New Zealand, agreed with Geyer and said Pearce's on-field achievements would now be overshadowed.\n'The most difficult thing for Mitchell is the fact that what it does to your loved ones, the embarrassment it causes your loved ones,' Johns said.\nThe Roosters premiership captain, 26, was captured miming the lewd act in front of his teammates\nPearce was also filmed in the video attempted to kiss a woman, who rejected him and said: 'no I'm a lesbian'\nFormer Roosters forward Jimmy Smith said he believed the club was left with no choice but to sack Pearce.\n'To be honest it's not the crime of the century. In saying that, as a captain of an NRL club it is completely unacceptable,' he told Fox Sports News.\n'As a result of that I think the Roosters are left with very little option.'\nSmith said Pearce's chances of being picked up by an English Super League club or a European or Japanese rugby union outfit could be limited.\n'Something like what Mitchell has done would be considered by them to be quite unsavoury,' Smith said.\n'It really limits what he can do in the future.'\nRugby league commentator Andrew Voss weighed in on the controversial footage\nFormer league star Matthew Johns said Pearce's on-field achievements would now be shadowed\nSports journalist and reporter Jim Wilson described the incident as 'sordid, sickening and disgraceful'\nAustralian professional boxer and former league great Anthony Mundine said it was a 'simple stupid mishap by being a drunk' and said it had been blown out of proportion\nRadio personality and former Australian Football player Ryan Fitzgerald made light of the incident\nParramatta legend Phil Sterling said Pearce would pay for his transgressions.\n'This will be deemed to have brought the game into disrepute,' Sterling said on Wednesday.\n'You have to ask yourself how many times is that going to be abided and, when you get to this stage, how heavy do the NRL and the Roosters come down on him?'\nFormer league stars Mark Geyer (left) and Matthew Johns (middle) have spoken out about the Pearce footage","url":"https://www.dailymail.co.uk/news/article-3420151/Mark-Geyer-says-Mitchell-Pearce-banned-12-months-simulated-dog-sex.html"}
