{"authors":["Compiled Democrat-Gazette Staff Wire Reports"],"date_download":"2018-10-30 14:10:44","date_modify":"2018-10-30 14:10:44","date_publish":"2018-10-30 00:00:00","description":"Stocks sank again Monday on fears that President Donald Trump's administration will escalate its trade dispute with China by imposing tariffs on all remaining imports from China to the U.S.","filename":"data/vaneerConsumption/Marketsdipovertradeillsstockstakeahitaftertariffsreport.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/30/190184277_190182598-04b27403f60a4b939d5ac934408ac59b_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30__1540908644.html","title":"Markets dip over trade ills; stocks take a hit after tariffs report","title_page":"Markets dip over trade ills; stocks take a hit after tariffs report","title_rss":"NULL","source_domain":"arkansasonline.com","text":"FILE- In this Oct. 23, 2018, file photo specialist James Denaro works on the floor of the New York Stock Exchange. The U.S. stock market opens at 9:30 a.m. EDT on Monday, Oct. 29. (AP Photo/Richard Drew)\nNEW YORK -- Stocks sank again Monday on fears that President Donald Trump's administration will escalate its trade dispute with China by imposing tariffs on all remaining imports from China to the U.S.\nThe declines came during another dizzying day of trading. The Dow Jones industrial average swung between a gain of 352 points and a loss of 566 before closing down 245.39 points, or 1 percent, to 24,442.92.\nThe S&P 500 index fell 17.44 points, or 0.7 percent, to 2,641.25.\nThe Nasdaq composite, which is heavily weighted with technology stocks, lost 116.92 points, or 1.6 percent, to 7,050.29. The Russell 2000 index of smaller-company stocks gave up 6.51 points, or 0.4 percent, to 1,447.31.\nBloomberg News reported in the afternoon that the Trump administration will put tariffs on the rest of the country's imports from China, $257 billion worth, if Trump and Chinese President Xi Jinping don't make substantial progress in easing the trade dispute next month.\nScott Wren, global equity strategist at the Wells Fargo Investment Institute, said the market drop coincided with word that Trump and Xi may not meet personally to discuss trade differences when the Group of 20 meets next month in Buenos Aires.\n\"If you had even a whiff of good news coming out of the G-20,\" Wren said, \"the market would like that.\"\nThe month comes in the midst of a corporate earnings season where a number of big companies have warned that tariffs already in place have raised their costs.\nTechnology and Internet companies, industrials and retailers took steep losses after the Bloomberg report as Wall Street's recent bout of volatility continued. The S&P 500 index has dropped 9.4 percent in October and is on track for its worst monthly loss since February 2009. That was right before the market hit its lowest point during the 2008-09 financial crisis.\nStocks have plunged since early October, breaking a long period of relative calm over the summer, and trading has been especially volatile the last few days.\nAmong industrials, Boeing sank 6.6 percent to $335.59. Some early gains for tech and Internet stocks also faded. Microsoft shed 2.9 percent to $103.85. Alphabet, Google's parent company, lost 4.5 percent to $1,034.73.\nAmazon.com dropped another 6.3 percent to $1,538.88. The online retailer tumbled Friday after it reported weak sales and gave a lower-than-expected revenue estimate for the quarter that includes the holiday shopping season. Its stock traded above $2,000 a share in early September and has fallen 24.5 percent since then.\nThe S&P 500, the main benchmark for the U.S. stock market, has fallen 9.9 percent from its latest record high on Sept. 20. The Nasdaq has plunged 13 percent from its record high reached Aug. 29.\n\"There's this pessimism that has been hanging on this market the whole month,\" Chris Zaccarelli, chief investment officer at the Independent Advisor Alliance, said by phone. \"A trade war with China was one of the bigger overhangs. Any reminders of that just leads to more pessimism. Out of all the fears out there, that's the one sticking most in peoples' minds in terms of a reluctance to believe the economy is going to continue to be strong.\"\nFor most of this year investors have remained hopeful that the U.S. and China would work out their disagreements on trade policy and that many of the tariffs would be reduced or eliminated. But in recent weeks they've lost some of their confidence, and their fear that the dispute will last longer and have bigger effects has contributed to the market's tumble.\nThe effects of higher tariffs could be especially severe for technology companies, which make many of their products in China, and for industrial companies, which are already paying higher prices for metals. The U.S. and China are the world's largest economies and their trade relationship is the world's largest, so the higher taxes on imports could also slow global economic growth and increase inflation.\nCar companies rose after Bloomberg News reported that regulators in China intend to propose cutting the tax on imported cars to 5 percent from 10 percent. The trade fight between the U.S. and China has hurt sales, and that slowdown is one of several factors that have damaged car company stocks this year.\nFord climbed 3.3 percent to $9.28 and auto parts retailer BorgWarner advanced 4 percent to $39.56. After Cooper Tire & Rubber reported a bigger third-quarter profit than analysts expected, its stock surged 21.4 percent to $30.89\nAmerican investors will now turn to earnings this week from tech giants Facebook Inc. and Apple Inc., along with the October jobs report on Friday. Earnings have not been able to save other megacap tech names.\nGermany's DAX rose 1.2 percent as Volkswagen, Daimler and BMW made big gains. Italy's FTSE MIB index rose 1.9 percent after Standard & Poor's did not downgrade the company's credit rating. Italy's new government plans to ramp up spending and European Union leaders have demanded it change its plans.\nThe CAC 40 in France added 0.4 percent and the British FTSE 100 rose 1.3 percent.\nMexico's stock index shed 4.2 percent after President-elect Andres Manuel Lopez Obrador said he will respect the result of a referendum that rejected a partly-built new airport for Mexico City. He said 70 percent of voters opposed the $13 billion project.\nBrazil's Bovespa rose in morning trading after far-right politician Jair Bolsonaro was elected president, but it later turned lower and lost 2.2 percent. Stocks climbed earlier this month after Bolsonaro led the previous round of voting, as investors preferred him to leftist parties.\nBond prices dipped. The yield on the 10-year Treasury note rose to 3.08 percent from 3.07 percent.\nThe price of U.S. crude oil dropped 0.8 percent to $67.04 per barrel in New York while Brent crude, used to price international oils, lost 0.4 percent to $77.34 per barrel in London.\nWholesale gasoline added 0.5 percent to $1.82 a gallon and heating oil slid 0.8 percent to $2.28 a gallon. Natural gas was unchanged at $3.19 per 1,000 cubic feet.\nGold lost 0.7 percent to $1,227.60 an ounce. Silver fell 1.8 percent to $14.44 an ounce. Copper was little changed at $2.74 a pound.\nThe dollar rose to 112.35 yen from 111.85 yen. The euro fell to $1.1390 from $1.1412.\nTokyo's Nikkei 225 sank 0.2 percent and Seoul's Kospi lost 1.5 percent. Hong Kong's Hang Seng advanced 0.4 percent.\nInformation for this article was contributed by Marley Jay of The Associated Press, by Thomas Heath of The Washington Post, and by Jeremy Herron and Sarah Ponczek of Bloomberg News.\nA Section on 10/30/2018","url":"https://www.arkansasonline.com/news/2018/oct/30/markets-dip-over-trade-ills-20181030/"}
