{"authors":["Rachael Levy"],"date_download":"2018-10-30 21:44:23","date_modify":"2018-10-30 21:44:23","date_publish":"2016-12-19 00:00:00","description":"Platinum Partners' Mark Nordlicht, Uri Landesman, and another coconspirator allegedly sent emails about fleeing the US, according to a government indictment.","filename":"data/vaneerConsumption/MarkNordlichtUriLandesmanPlatinumemployeeemailstofleeUS.json","image_url":"https://amp.businessinsider.com/images/56e9903191058426008b6b5f-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mark-nordlicht-uri-landesman-platinum-employee-emails-to-flee-us-2016-12_1540935863.html","title":"Mark Nordlicht, Uri Landesman, Platinum employee emails to flee US","title_page":"    Mark Nordlicht, Uri Landesman, Platinum employee emails to flee US - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Platinum Partners' Mark Nordlicht, left, and Uri Landesman pose in their New York offices in this undated photograph provided on April 11, 2016. REUTERS/Mark Hartman\nEmployees of a troubled New York hedge fund, Platinum Partners, were arrested Monday on charges of participating in a $1 billion fraud.\nMark Nordlicht, Platinum's chief investment officer, Uri Landesman, a Platinum marketer, and another coconspirator sent emails about fleeing the US, according to a government indictment out Monday.\nThis is how it went down, according to the charges. On or about December 13, 2015, Nordlicht, Landesman, and an unnamed coconspirator sent emails \"that contemplated Nordlicht and Co-Conspirator 1 fleeing from the United States and illustrated their knowledge and awareness of the fraudulent scheme perpetrated on Platinum's investors and prospective investors.\"\nThe unnamed coconspirator sent the following email to Nordlicht, the indictment said:\n\"Don't forget books. Assume we are not coming back to ny[.] Just to be safe. Depends on Miami[.] We can fly straiggt [sic] to europe from miami on Tuesday[.] Take passport.\"\nIn response, Nordlicht asked for $2.5 million to pay off the firm's brokers and said he was ready to take $7.5 million from a second mortgage on his house to deal with the hedge fund's liquidity crisis, the indictment added.\nLater, he sent another email to the unnamed conspirator.\n\"Am on my way to jfk with kids for their 6 pm flight to Israel,\" Nordlicht's email read, according to the indictment. \"[My wife] is literally making me get on Israel flight if we don't connect and agree what we are doing.\"\nNordlicht then forwarded the email exchange to Landesman, according to the indictment. Landesman responded: \"You should get on the flight if there is no bridge [loan], probably even if there is...We need to go through the mehalech of how we are going to share this with clients and employees, going to be very rough, big shame.\"\nThe Hebrew word \"mehalech,\" roughly translated, means \"overview\" or \"process.\"\nAbout two months later, Landesman told an investor by email that Platinum was \"sound\" and that he \"hope[d] to be beyond liquidity concerns forever by end of May, we welcome your further investment.\"\nA representative for Platinum declined to comment. Lawyers for Landesman and Nordlicht could not immediately be reached.\nPlatinum managed about $1.7 billion firm-wide as of March 2016, according to the indictment.\nYou can read the relevant excerpt from the indictment below.","url":"https://www.businessinsider.com/mark-nordlicht-uri-landesman-platinum-employee-emails-to-flee-us-2016-12"}
