{"authors":["Euan Mclelland","Sam Tonkin For Mailonline"],"date_download":"2018-10-23 04:37:08","date_modify":"2018-10-23 04:37:08","date_publish":"2016-01-28 20:44:43","description":"Mark Loveridge, 37, from Mitcham, is charged with the murder of 30-year-old university lecturer Daniel Young (pictured) near Morden Tube station, South London, on January 19.","filename":"data/vaneerConsumption/MarkLoveridgechargedwithmurderoverdeathofDanielYounginMorden.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/21/3062332500000578-0-image-a-99_1454015902890.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421667_Man-charged-murder-death-university-lecturer-stabbed-death-random-attack-walked-work_1540269428.html","title":"Mark Loveridge charged with murder over death of Daniel Young in Morden","title_page":"Mark Loveridge charged with murder over death of Daniel Young in Morden | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 37-year-old man charged with the murder of a university lecturer will appear at the Old Bailey on Monday, a court heard today.\nDaniel Young, 30, was stabbed to death as he walked to work on January 19.\nMr Young was on his way to the second day of his job as a university lecturer at when he was set upon in Morden, south west London.\nCharge: Mark Loveridge, 37, has been charged with the murder of university lecturer Daniel Young, who was stabbed to death in a park. Mr Young's 22-year-old partner Ellen Ball (pictured with Mr Young on holiday) has been too upset to speak\nToday, Mark Loveridge refused to appear at Bromley Magistrates' Court in south east London via video link from Lewisham Police station.\nThe court was told he had refused to leave his cell at the police station.\nHe is charged with one count of murder and one count of causing grievous bodily harm to a 23-year-old man stabbed in the buttocks earlier on the same morning.\nA post-mortem, which took place last week, established that the cause of death was a single stab wound\nFlowers have been left at the scene of the stabbing near Morden Underground station in South London\nSusan Bryant, defending, told the court she accepted the charges against him on his behalf.\nMr Young, from Mitcham, south west London, was knifed in Kendor Gardens as he walked towards Morden Tube station shortly after 8am.\nAmbulance crews pronounced him dead at the scene and a post mortem examination gave the cause of death as a stab wound.\nHe had been just two days into a new job at the London campus of Coventry University when he was killed.\nAt the time of the killing, police said Mr Young was just a 'young man going about his business' when he was stabbed in what they believe was an entirely random attack.\nPolice released CCTV of Mr Young's last moments earlier this week.\nIn the short clip, the university lecturer - who was wearing a suit and carrying his laptop and a bag over his shoulder - can be seen walking towards the park where he was killed.\nThe clip was filmed shortly before 8am, and the first 999 call was made at 8.07am.","url":"https://www.dailymail.co.uk/news/article-3421667/Man-charged-murder-death-university-lecturer-stabbed-death-random-attack-walked-work.html"}
