{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 22:15:33","date_modify":"2018-10-30 22:15:33","date_publish":"2015-09-02 15:34:29","description":"“When the left stands up and they say they’re standing up on some moral principle, they’re not told ‘Do your job or quit,’” Levin said","filename":"data/vaneerConsumption/MarkLevinFiorinaShouldCondemnSupremeCourtSameSexMarriageRuling.json","image_url":"https://media.breitbart.com/media/2015/08/Levin-83-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_09_02__1540937733.html","title":"Mark Levin: Fiorina Should Condemn Supreme Court Same-Sex Marriage Ruling","title_page":"Mark Levin: Fiorina Should Condemn Supreme Court Same-Sex Marriage Ruling | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Conservative radio host and author Mark Levin says GOP 2016 contender Carly Fiorina should denounce the activist Supreme Court for its legalization of same-sex marriage nationwide, rather than advise a Christian county clerk refusing to issue same-sex licenses to either perform her government job or quit.\n“You know it’s amazing to me when the left stands up and they say they’re standing up on some moral principle, they’re not told ‘Do your job or quit,’” Levin said. “People rally around them. People stand up for them.”\n“The Supreme Court has become a joke on these social issues,” he continued. “The Supreme Court has taken over…so-called social issues – what I call cultural issues in this country…”\nLevin said activist courts and justices like Justice Anthony Kennedy should be condemned, not a county clerk standing up for her religious beliefs.\nThe conservative host was responding to Fiorina’s conversation Tuesday on Hugh Hewitt’s radio show, during which she said that Kentucky county clerk Kim Davis should either do her government job or quit and take a job that allows her to place her faith above her job.\nFiorina said that while she disagrees with the Supreme Court’s decision to legalize same-sex marriage and realizes religious liberty must be defended, the fact that Davis is a government employee makes a difference:\n[W]hen you are a government employee, I think you take on a different role. When you are a government employee as opposed to say, an employee of another kind of organization, then in essence, you are agreeing to act as an arm of the government. And, while I disagree with this court’s decision, their actions are clear. And so I think in this particular case. This woman now needs to make a decision that’s conscious – is she prepared to continue to work for the government, be paid for by the government in which case she needs to execute the government’s will, or does she feel so strongly about this that she wants to sever her employment with the government and go seek employment elsewhere where her religious liberties would be paramount over her duties as – as government employee.\nAsked by Hewitt whether Davis should continue her civil disobedience, Fiorina said, “Given the role that she’s playing, given the fact that the government is paying her salary, I think that is not appropriate.”\n“Others may disagree with that, but I think it’s a very different situation for her than someone in a hospital who’s asked to perform an abortion or someone at a florist who’s asked to serve a gay wedding,” Fiorina said. “I think when you’re a government employee, you are put into a different position honestly.”\nAs the Associated Press reports, Rowan County, Kentucky clerk Kim Davis, an Apostolic Christian who was elected to her position as a Democrat, has continued to refuse to issue same-sex marriage licenses following the Supreme Court’s decision. Lawsuits were filed, arguing that Davis should fulfill her role as a government official.\nDavis could now face a charge of misconduct and fines, or even jail time.\nLevin said Fiorina should be challenged on her opinion of Davis’ situation.\n“I don’t think this lady’s religious beliefs are being protected,” he added. “Issue the licenses or quit. No – why shouldn’t you be able to hold a government job if those are your religious views, when there are other places that can issue marriage certificates or licenses? Why? I think this is a fundamental issue.”","url":"https://www.breitbart.com/politics/2015/09/02/mark-levin-fiorina-should-condemn-supreme-court-same-sex-marriage-ruling/"}
