{"authors":["John Skilbeck","Press Association"],"date_download":"2018-10-23 03:35:40","date_modify":"2018-10-23 03:35:40","date_publish":"2017-04-26 15:02:33","description":"Selby fired a 143 total clearance in the penultimate frame of his 13-3 victory over Marco Fu, which could earn him £10,000 which comes as a prize to the person with the highest break.","filename":"data/vaneerConsumption/MarkSelbydelightedwithfreaky143breakagainstFu.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/15/3F9FE2D700000578-0-image-a-64_1493215298547.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_othersports_article-4447914_Mark-Selby-delighted-freaky-143-break-against-Fu_1540265740.html","title":"Mark Selby delighted with 'freaky' 143 break against Fu","title_page":"Mark Selby delighted with 'freaky' 143 break against Fu | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mark Selby produced a 'freaky break' that could bring him a £10,000 bonus on his way to reaching the Betfred World Championship semi-finals.\nThe Leicester cueman fired a 143 total clearance in the penultimate frame of his 13-3 victory over Marco Fu.\nSelby frequently ran out of ideal position but produced a host of cavalier pots, including terrific blacks to the left middle and green pockets and a run of exhibition shots late in the break.\nMark Selby fired a 'freaky break' of 143 against Marco Fu in the World Championships\nThe Leicester cueman sailed through to the semi-finals at the crucible after the 13-3 win\nThe highest break of the tournament carries the five-figure prize, and Selby moved into pole position with what was his third century in a four-frame purple patch, after runs of 132 and 139.\nSelby said: 'I think it was a good break because I was never in position.\n'I just kept potting silly balls from nowhere. I got to about 80 and thought it was the end of the break, and I potted a black into the middle, potted a red down the rail, but when I got down to the black I was more nervous than in any part of the match.\n'I was really, really happy to knock that final black in as well. It was a freaky break.'\nThe player who achieves the highest braek gets a five-figure prize and Selby is in pole position\nFu was full of admiration for the 33-year-old reigning world champion, who is firmly in the hunt for the £375,000 top prize.\n'He's unplayable at times. You've got to make him the favourite now after that performance,' Fu said.\nThe 39-year-old Hong Kong cueman said he just had to admire Selby's masterclass.\n'A lot of players have felt like that,' Fu said. 'I've done it many times, sitting in the chair and looking at the other player knocking in break after break. I've done it with Ronnie (O'Sullivan), John Higgins and Stephen Hendry before so it's not something that's new to me.\n'Now it depends on what kind of performance Mark produces in the semi-finals. If he reproduces this sort of standard he's in the final, but whether he can produce it is a different story.'","url":"https://www.dailymail.co.uk/sport/othersports/article-4447914/Mark-Selby-delighted-freaky-143-break-against-Fu.html"}
