{"authors":["Akin Oyedele"],"date_download":"2018-10-30 23:11:29","date_modify":"2018-10-30 23:11:29","date_publish":"2018-07-22 00:00:00","description":"BI PRIME: Rick Rieder, the chief investment officer of global fixed income at BlackRock, warns that central banks and a stronger dollar could lead to more stress in financial markets.","filename":"data/vaneerConsumption/MarketshavecanariesincoalmineandriskmorevolatilityRiedersays.json","image_url":"https://amp.businessinsider.com/images/56df1737910584145c8b4be9-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_global-markets-liquidity-volatility-rick-rieder-2018-7_1540941089.html","title":"Markets have canaries in coal mine and risk more volatility, Rieder says","title_page":"    Markets have canaries in coal mine and risk more volatility, Rieder says - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Rick Rieder is worried about liquidity. Bloomberg TV\nRick Rieder is worried about liquidity.\nAccording to the chief investment officer of global fixed income at BlackRock, the retreat of central banks from credit markets could worsen liquidity or complicate how smoothly other investors are able to do the same.\nRieder, who oversees $1.9 trillion in assets, has been voicing this concern for several months as central banks reduced their bond purchases.\nIn January, the Bank of Japan said its balance sheet shrank month-on-month for the first time since it started buying government bonds, equity exchange-traded funds, and other assets in late 2012. In June, the European Central Bank said it was set to end the €2.5 trillion ($3 trillion) bond-buying program known as quantitative easing that it initiated after the eurozone debt crisis. And the Federal Reserve continues to slowly unwind its $4 trillion-plus portfolio of bonds.\nAs central banks work quietly and slowly, more powerful forces are brewing in the foreground, Rieder said in a recent note.\nOf the US economy, he said: \"We think that at some point over the next year, or so, eventual higher wages, and other higher input costs for companies (particularly if accompanied by sustained tariffs), as well as a pull-forward of capital expenditures by companies, may lead to an economic slowdown from the second quarter's buoyant pace.\"\nHe continued: \"We've also been quite vocal regarding our concern over the deceleration in the pace of growth of global liquidity and think that financial markets are already displaying ample 'canaries in the coal mine' that suggest we may be in store for higher volatility, or financial market shocks, which hold the potential to diminish business or consumer confidence.\"\nBlackRock; Business Insider\nSome of these canaries, or warning signs, can be found in emerging markets.\nOn a total-return basis, the MSCI Emerging Markets Index is down 11% this year and was the worst performer besides gold on a Bank of America Merrill Lynch ranking of major assets.\nRieder flagged the potential for a stronger dollar as a potential setback for liquidity and calm in emerging markets because it's the world's reserve currency and the primary way debt is funded.\nThe dollar's rise this year, following its worst year since 2003, is already weighing on emerging-market assets, according to Erin Browne, the head of asset allocation at UBS Asset Management.\n\"What's interesting about that is if you look at the correlation of EM equities relative to the US dollar, it's very highly correlated, which is telling you that the move that we see in EM assets right now is largely being driven by the dollar,\" Browne said at a media roundtable on Friday.\nEM equities in late June fell 17.7% from their peak in early February, worse than the 14% drop during the \"taper tantrum\" of 2013, Browne said.\nMeanwhile, the US economy remains on a firm footing — at least, that's the opinion of Fed Chairman Jerome Powell, who faced lawmakers in Congress last week.\nThe Fed is forging ahead with gradually raising its benchmark rate as long as economic conditions allow. With the unemployment rate near its lowest since 2000 and inflation under control, the Fed has much of the clearance it needs.\n\"The main question becomes: What is the next phase for the economy?\" Rieder said after Powell's testimony.\nPowell's remarks showed he was fairly untroubled about the rising risks of a trade war, a big tail risk for fund managers.\nMeanwhile, investors are grappling with the implications of the shrinking spread between the two- and 10-year note yields, which Morgan Stanley has forecast will go negative — implying a yield-curve inversion — by 2019. An inverted yield curve has preceded every recession since the 1960s, though with a time lag of nearly two years on average, according to LPL Financial.","url":"https://www.businessinsider.com/global-markets-liquidity-volatility-rick-rieder-2018-7"}
