{"authors":["Associated Press"],"date_download":"2018-10-23 04:17:16","date_modify":"2018-10-23 04:17:16","date_publish":"2016-01-11 17:23:24","description":"NEW YORK (AP) — Tumult in China triggered the worst opening week for U.S. stocks in history, and this week investors could get plenty more to worry about. Pr...","filename":"data/vaneerConsumption/MarketstofaceslowingcompanyprofitsafterChinatumult.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:78f68ffc55d44b9f8c7541650650a317-3WAQP5SaQH704788ebcf7e13f09d-55_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393375_Markets-face-slowing-company-profits-China-tumult_1540268236.html","title":"Markets to face slowing company profits after China tumult","title_page":"Markets to face slowing company profits after China tumult | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Markets to face slowing company profits after China tumult\nNEW YORK (AP) — Tumult in China triggered the worst opening week for U.S. stocks in history, and this week investors could get plenty more to worry about.\nProfits are expected to drop at U.S. companies.\nAgain.\nFILE - In this Thursday, Jan. 7, 2016, file photo, a woman reacts near a display board showing the plunge in the Shanghai Composite Index at a brokerage in Beijing. Tumult in China triggered the worst opening week for U.S. stocks in history, and investors could get plenty more to worry about in the following week. (AP Photo/Ng Han Guan, File)\nEarnings for companies in the Standard and Poor's 500 index are forecast to drop for the second straight quarter, a rare occurrence outside a recession. Despite a rebounding jobs market, the U.S. did not grow fast enough to boost profits, and once surging developing economies that helped lift foreign sales slowed dramatically.\nAll this would be worrisome enough at any time, but investors are particularly jittery now. U.S. stocks are expensive by some measures, even after slipping in 2015 and falling sharply in the first week of the year. That leaves little room for more disappointing news.\nOne widely respected gauge, the so-called Shiller earnings ratio, is flashing warning signs. Named after Nobel Prize winner Robert Shiller of Yale, the ratio compares the price of stocks to annual earnings averaged over 10 years. The measure is now 25, much higher — meaning more expensive — than the long term average of 18.\n\"When expectations are as high as they are, that's a problem,\" says Jack Ablin, chief investment officer of BMO Private Bank.\nCompanies begin reporting their results for the October-December quarter on Monday. Earnings per share for the companies in S&P 500 is expected to have dropped 5.5 percent compared to a year earlier, according to S&P Capital IQ, a research firm. That follows a 1.4 percent drop in the July-September quarter. Revenue is forecast to fall for a fourth quarter in row.\nThis wasn't supposed to happen.\nA year ago the average view of financial analysts who follow the stock market said earnings for the October-December quarter would jump 12 percent, and urged investors to buy accordingly.\nAnalysts on Wall Street are a notoriously bullish bunch, but you can almost understand their enthusiasm. Since the financial crisis, U.S. companies have managed to squeeze profits out of a slow-growing domestic economy. They slashed costs, often through massive layoffs, and restructured their businesses to operate faster and smarter.\nThey were also helped by surging sales abroad, super-low borrowing rates thanks to Federal Reserve policy, and a controversial maneuver: Companies bought trillions of dollars of their own shares to take them off the market. Investors love the maneuver, because it spreads earnings over fewer shares and boosts earnings per share. But critics point out that the purchases can make companies seem more successful running their businesses than they actually are.\nThe result of all this corporate scrambling, shrewd or short-sighted, was a booming stock market. The S&P 500 more than tripled from its 12-year low in 2009 through its peak in May. Even after last week's drop, its biggest since September 2011, the index is just 6.5 percent below that level.\nThe problem now is that it is difficult for Corporate America to cut costs any more, and the rest of the world is slowing and can't help out. Japan, the world's third largest economy, barely grew last year, Canada briefly dipped into recession and Brazil and Russia are struggling to escape ones. On Wednesday, the World Bank lowered its forecast for global economic growth this year to a feeble 2.9 percent.\nThe good news is that some parts of the U.S. economy are doing well. U.S. households have cut debt and saved more since the financial crisis. The housing market is solid. And there are more jobs. On Friday, the Labor Department reported that employers added 292,000 workers in December, capping a robust year of hiring.\nBut after years of sub-par economic growth, many economists are skeptical the U.S. economy, and corporate results, are about to take off.\n\"It's going to be harder and harder to produce solid earnings, unless the global economy picks up,\" says Peter Cardillo, chief market economist at First Standard Financial.\nMost worrisome is that China is slowing dramatically, though no one is sure how much because the data is so unreliable. The official statistics put the rate at nearly 7 percent, a third slower than five years ago. But experts tracking electricity usage and other measures say the rate may much worse, perhaps 4 percent or even lower.\n\"Mystery meat,\" is how famed bond investor Bill Gross characterized China on CNBC on Thursday after the country's main stock index plunged seven percent.\nChina matters because it is the world's second largest economy after the U.S. It accounts for a just a fraction of U.S. exports, but it's impact on the economy is big because it is major buyer of goods from Japan, Europe, and other big U.S. trading partners. About half the sales in the S&P 500 come from abroad.\nJames A. Abate, chief investment officer at Centre Asset Management, is impressed with how the biggest U.S. companies restructured their operations in the face of slow economic growth in the past few years. But when it comes to increasing profits, even he thinks they have run out of tricks.\n\"The vast majority of companies depend on an accelerating economy,\" he says. \"The downside to profits still has a long way to run.\"\n____\nBernard Condon can be reached at http://twitter.com/BernardFCondon . His work can be found at: http://www.bigstory.ap.org/content/bernard-condon .","url":"https://www.dailymail.co.uk/wires/ap/article-3393375/Markets-face-slowing-company-profits-China-tumult.html"}
