{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 01:26:56","date_modify":"2018-10-23 01:26:56","date_publish":"2017-03-16 11:19:18","description":"Marnie Simpson proved that there's life in the old cast yet, as she stole the show at the Series 14 press day for Geordie Shore after admitting that she may have 'embarrassed' her ex.","filename":"data/vaneerConsumption/MarnieSimpsonwearsnudebodysuitatGeordieShorelaunch.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E53834600000578-0-image-a-35_1489660866329.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319656_Newly-single-Marnie-Simpsonwears-clingy-nude-bodysuit_1540258016.html","title":"Marnie Simpson wears nude bodysuit at Geordie Shore launch","title_page":"Marnie Simpson wears nude bodysuit at Geordie Shore launch | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There's set to be five new girls joining the line-up in this series.\nBut Marnie Simpson proved that there's life in the old cast yet, as she stole the show at the Series 14 press day for Geordie Shore after admitting that she may have 'embarrassed' ex-boyfriend Lewis Bloor during filming for the new episodes.\nNewly-single Marnie turned heads in a completely nude bodysuit, which clinged to every inch of her fabulous figure.\nScroll down for video\nCheeky: Marnie Simpson drew attention to her enviable curves in a nude bodysuit on Thursday, as she turned out for the Geordie Shore series 14 photocall in London\nWhile new girls Sarah Goodhart, Eve Shannon, Abbie Holborn, Chelsea Barber and Zahida Allen were overtly playful for the photocall in fancy dress school girl outfits, Marnie opted to tease her figure.\nShe hinted at her hourglass shape in a one-piece outfit that drew special attention to her pert behind and ample bust in something of an eye-popping display.\nFrom the front, the bodysuit skimped over her flat stomach and protruding hip bones to accentuate her curves.\nLeaving nothing to the imagination: Marnie's outfit skimmed closely over her flat stomach\nAll in together: While new girls Chelsea Barber, Eve Shannon, Sarah Goodhart, Abbie Holborn,and Zahida Allen (left-right) were overtly playful for the photocall in fancy dress school girl outfits, Marnie opted to tease her figure.\nMarnie helped unveil the most outrageous season, dubbed New Radgie Rampage, to date on Thursday.\nRadge is among one of the cast's favourite Geordie slang terms, used to mean 'out of control'.\nAs such, the brunette recently hinted that she may have been unfaithful to ex Lewis during Series 14.\n'I didn't behave like a lady or an appropriate girlfriend when I was filming Geordie Shore, and that embarrasses him,' Marnie told Star magazine this week.\nShe's done this before: Marnie knew all of her best angles as she rotated for the cameras\nOn the show, Marnie is often seen writhing around on the dancefloor and snogging best friend Chloe Ferry, which has caused drama with her ex-boyfriend Aaron Chalmers in the past.\nTattooed hunk Aaron, who previously dumped the bruntte for 'embarrassing' him by wearing no knickers on a night out, insisted her behaviour wasn't girlfriend appropriate - and it seems Lewis might have felt the same way.\nTo make matters worse, Marnie's ex Aaron was also taking part in filming for the new series.\nAll nude everything: The brunette even topped off the look with nude boots\nThat's not to say that Marnie deserved the treatment that love rat Lewis confessed to last week.\nShock claims that Lewis cheated on Marnie while she slept in their hotel room were confirmed in an interview with The Sun.\nLewis said: 'We'd been out in Barcelona and I couldn't sleep, Marnie was asleep in the hotel, and I'm thinking, 'F*** this, I don't wanna be in this relationship.'\n'So I went down to the beach and at 5am as the sun was coming up there were a couple of girls down there who I got talking to and I ended up kissing one of them.\nConfident: She didn't look a bit bothered to be turning heads with her figure\n'We went back to their room to have a little party, we ended up kissing in bed but that was it, anything about us \"almost having sex'\" is rubbish.'\nIn the aftermath, Marnie defended her own actions, in which she was accused on getting flirtatious with an ex, insisting that she would never cheat, herself.\nMarnie revealed in a statement to MailOnline: 'I bumped into someone I had kissed prior to meeting Lewis and I was a little tipsy by no means all over him.\n'Maybe over friendly perhaps but certainly not all over over him. I have never cheated, wouldn't cheat and didn't deserve to be cheated on for this.'\nGlam: The glossy look was even complete with a brown lipstick\nWelcome to the new series: Marnie was introducing the New Radgie Rampage series\nTough stuff: Her cousin Sophie Kasaei, who was recently reinstated into the cast after being booted off the show for making an alleged racist slur in 2013, opted to tough up the ensemble with leather trousers and a slinky striped shirt\nCheeky! Chloe Ferry went for a similarly edgy look as she slipped into a white crop top paired with high-waisted black leggings and a staggering pair of nude heels","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319656/Newly-single-Marnie-Simpsonwears-clingy-nude-bodysuit.html"}
