{"authors":["Jacques Peterson","Karishma Sarkari For Daily Mail Australia"],"date_download":"2018-10-22 23:50:45","date_modify":"2018-10-22 23:50:45","date_publish":"2016-01-11 07:41:59","description":"She failed to find lasting love on Nine's controversial reality series, Married At First Sight, but Clare Tamas has managed to pick up the pieces to start a new romance.","filename":"data/vaneerConsumption/MarriedAtFirstSightsClareTamasconfirmsnewromance.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/06/30055B7300000578-0-image-a-9_1452492036445.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393427_Married-Sight-s-Clare-Tamas-confirms-new-romance-ex-Lachlan-McAleer-joins-Farmer-Wants-Wife_1540252245.html","title":"Married At First Sight's Clare Tamas confirms new romance","title_page":"Married At First Sight's Clare Tamas confirms new romance | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She somehow failed to find everlasting love on Channel Nine's controversial reality series, Married At First Sight.\nBut Clare Tamas has managed to pick up the pieces to start a new romance with a mystery man.\n'Yes, I am seeing someone,' the 36-year-old told Popsugar on Saturday.\n'We met out and about one night out when our respective groups of friends collided,' she continued.\n'It was instant!' Married At First Sight star Clare Tamas has found love again with a new man (pictured above with her TV husband Lachlan McAleer)\n'It's nice to know you can still meet people in person in this day of online dating. As soon as I arrived to our actual first date, it was instant.'\nThe aspiring actress then took a sly dig at her Married At First Sight ex 'husband', Lachlan McAleer.\n'Way more fireworks and things in common than I ever had with my MAFS 'perfect match.' When it's the right person, everything just works.'\n'Way more fireworks and things in common than I ever had with my MAFS 'perfect match': The 37-year-old took a dig at her former co-star\nThis isn't the first time that the brunette has made shady comments about Lachlan, with the reality star slamming the 37-year-old in an interview with New Idea last year.\n'He turned it on when the cameras were on us, then was either cold or rude or distant,' she said.\nThe brunette TV bride told of the rugged farmer's 'nice guy' persona being one that was hammed up for the cameras, and as the series progressed, he became more distant and self obsessed.\n'He turned it on when the cameras were on us, then was either cold or rude or distant,' the aspiring actress told New Idea magazine last year\nTwo faced: The brunette TV bride told of the rugged farmer's 'nice guy' persona being one that was hammed up for the cameras, and as the series progressed, he became more distant and self obsessed\nShe alleges the workaholic farmer she got to know became more concerned about his looks, working out loads and even getting a nose job.\nLachlan has admitted to having surgery but says the rhinoplasty was for medical sinus issues.\nThe glamorous marketing manager says there was no official break-up after the series ended, claiming Lachlan just ignored her when she tried to make contact.\nFirst reality TV appearance: The cowboy hat wearing farmer appeared briefly on MasterChef Australia in 2010\nWhat a difference a few years makes! Lachlan sported longer and darker hair then fans are used to seeing him with (right), when he appeared in a Landline report in 2012\nCamera friendly: In 2013, Lachlan appeared in a promotion video for AGL, looking a little more like fans are used to seeing him these days\n'He told me that I was his dream girl and he'd never had a connection like that before, and yet quickly departed after the last cameras, with no word,' she revealed. 'Interesting timing isn't it?'\nLachlan is set to return to screens this year on the next season of Nine's Farmer Wants a Wife.\nHe previously appeared on MasterChef in 2010, then ABC's Landline two years later, and then an AGL promotional the following year.\nThe reality TV star is also friends with The Bachelorette's Sasha Mielczarek.\nWho knew they were friends! The Bachelorette winner Sasha Mielczarek and Lachlan are old friends according to a Daily Mail Australia source, having both grown up around the Southern Highlands","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393427/Married-Sight-s-Clare-Tamas-confirms-new-romance-ex-Lachlan-McAleer-joins-Farmer-Wants-Wife.html"}
