{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-23 03:43:31","date_modify":"2018-10-23 03:43:31","date_publish":"2017-03-16 14:46:12","description":"Tony and Julie Wadsworth, who have both worked for BBC Radio Leicester and Birmingham-based BBC WM, pleaded not guilty to indecent assault and outraging public decency at Warwick Crown Court.","filename":"data/vaneerConsumption/MarriedBBCDJsdenyhavingsexagainstatree.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54F01500000578-0-image-a-106_1489676056038.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320534_Married-BBC-DJs-deny-having-sex-against-tree_1540266211.html","title":"Married BBC DJs deny having sex against a tree","title_page":"Married BBC DJs deny having sex against a tree | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Two married BBC stars nicknamed the 'Richard and Judy of local radio' today denied having sex against a tree in full view of young children and pleasuring themselves in public.\nJulie Wadsworth, 59, also pleaded not guilty to indecently assaulting seven boys including when her husband Tony, 69, 'kept watch' while carrying a camera, Warwick Crown Court heard.\nThe married couple have both worked for BBC Radio Leicester and Birmingham-based BBC WM, but the corporation said last year the charges do not relate to their time there.\nIn the dock: Tony and Julie Wadsworth (pictured today) have pleaded not guilty to indecent assault and outraging public decency at Warwick Crown Court\nWork life: The couple (left today) have both worked for BBC Radio Leicester (right) and Birmingham-based BBC WM\nThe couple allegedly had 'sexual intercourse against a tree in a wooded parkland area in full view of a group of young boys' on five different occasions during the 1990s, Warwick Crown Court heard.\nThe court was also told the pair, who worked for BBC Radio Leicester, also pleasured themselves in front of a group of under-18s.\nToday they denied five counts of outraging public decency between July 1992 and June 1996 at Warwick Crown Court.\nMr Wadsworth also pleaded not guilty to ten charges of indecent assault against seven boys aged under 18 between September 1992 and August 1999.\nIt was alleged that he watched as his wife, who denies 12 charges of the same offence, sexually touched the youngsters.\nThe court heard Mr Wadsworth 'kept watch having in possession a camera' and on another occasion he performed a sex act.\nMr Wadsworth, dressed in a dark blue suit with a purple tie and his wife, who wore a black suit and red high-heels, spoke only to deny the charges.\nThe BBC confirmed in April that the charges do not relate to the presenters' positions with the corporation\nA three week trial was listed for May 15 at the same court - the date of Mrs Wadsworth's 60th birthday.\nBoth defendants were granted bail on the condition that they did not have unsupervised contact with any children under the age of 18, apart from family members, and they stand down from any charity work which may involve under-18s.\nAddressing the pair, Judge Andrew Lockhart QC said: 'You will face trial before this court on the May 15.\n'You must serve your defence case statements by April 10.\n'You must attend the trial. If you do not then the trial may take place in your absence, which would be most unfortunate.'\nThe couple, who also previously worked for BBC Radio WM in Birmingham, were charged with the offences in April last year after being off-air for four months.\nA BBC spokesman said the couple no longer work for the broadcaster.","url":"https://www.dailymail.co.uk/news/article-4320534/Married-BBC-DJs-deny-having-sex-against-tree.html"}
