{"authors":["Wills Robinson For Dailymail.Com"],"date_download":"2018-10-23 00:45:21","date_modify":"2018-10-23 00:45:21","date_publish":"2016-01-29 14:08:45","description":"Jessica Mishali, 35, was barred from five prisons in Broward County, Florida, after the guard saw her in an apparent tryst with convicted felon Ysreal Granda, 26, in the main jail.","filename":"data/vaneerConsumption/MarrieddefenselawyerJessicaMishalicaughthavingsexwithaninmate.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2C1C100000578-0-image-a-16_1454076307861.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422843_Married-defense-lawyer-banned-jails-caught-bent-table-having-sex-inmate_1540255521.html","title":"Married defense lawyer Jessica Mishali 'caught having sex with an inmate'","title_page":"Married defense lawyer Jessica Mishali 'caught having sex with an inmate' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A married defense lawyer has been banned from all of the jails in her area after a deputy allegedly caught her bent over a table and having sex with an inmate.\nJessica Mishali was barred from five prisons in Broward County, Florida, after the guard saw her in an apparent tryst with convicted felon Ysreal Granda, 26, in the main jail on Wednesday.\nThe 35-year-old mother's client is being held behind bars and is facing four counts of attempted murder - four years after serving the majority of a four-year sentence for trying to kill two people.\nJessica Mishali, 35, (left) has been banned from five jails in Broward County, Florida, after a deputy allegedly saw her bent over a table having sex with convicted felon Ysreal Granda, 26, (right)\nWhen the deputy walked in, Mishali was apparently spotted quickly jumping back into her seat and readjusting her skirt.\nMishali, whose married name is David, will not face criminal charges, but she is now being investigated by the Florida Bar, the Sun-Sentinel reported.\nHer attorney Fred Haddad told the newspaper: 'What crime could there be?'\nTarlika Navarro, who is also working on her case, told Daily Mail Online they do not believe their client did anything wrong and investigating the 'false allegations' against her.\nThey suspected there was an 'ulterior motive' behind the claims, but they could not reveal what they might be.\nVeda Coleman-Wright, a spokeswoman for the Broward Sheriff's Office, which runs the jails, added: 'It's two consenting adults. Detention deputies, they're in a position of authority and supervision, so the case would be very different if the inmate was having intimate relations with a detention deputy.'\nA memo with Mishali's photo has been posted at all jail scanners and master controls, stating: 'Jessica Mishali David is prohibited from entering any Broward Sheriff's Office facility or onto any BSO property for any reason either personal or professional until further notice.'\nMishali is in a private practice.\nMishali, whose married name is David, had the supposed tryst during an interview in the main jail (pictured). When the deputy walked in she allegedly jumped back into her seat and readjusted her shirt\nAccording to reports, worked as a Broward assistant public defender and up until this month was employed by the Office of Criminal Conflict and Civil Regional Counsel.\nShe represented clients that the public defender could not because of conflicts of interest.\nHowever she was fired on January 4 for 'misconduct in the performance of her duties'.\nMishali earned her law degree at Touro College in Long Island, N.Y. and was admitted to the Florida Bar in September 2007. She has had no disciplinary issues to date.\nThe Florida Bar will begin an investigation. If it is found that Mishali violated a rule of conduct, punishment ranges from a reprimand to loss of her law license.\nMishali’s former boss, Broward Public Defender Howard Finkelstein told the Sun-Sentinel she did a very good job and was shocked by the revelations..\n'I can’t really wrap my mind around it. Love can make people do crazy things. And this is a crazy thing.'","url":"https://www.dailymail.co.uk/news/article-3422843/Married-defense-lawyer-banned-jails-caught-bent-table-having-sex-inmate.html"}
