{"authors":["James Tapsfield","Political Editor For Mailonline"],"date_download":"2018-10-23 02:08:07","date_modify":"2018-10-23 02:08:07","date_publish":"2017-03-10 11:07:40","description":"In a speech, Fiona Dawson said the cost of higher tariffs would need to be passed on to consumers and threaten the supply chain across the continent.","filename":"data/vaneerConsumption/MarswarnschocolatepriceswillgoupafterhardBrexit.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/317B592100000578-0-image-a-19_1489143738764.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300856_Mars-warns-chocolate-prices-hard-Brexit_1540260487.html","title":"Mars warns chocolate prices will go up after 'hard' Brexit","title_page":"Mars warns chocolate prices will go up after 'hard' Brexit | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Prices of much-loved chocolate bars such as Galaxy, Snickers, Bounty and Twix will increase if the EU 'punishes' the UK in Brexit negotiations, global good giant Mars has warned.\nFiona Dawson, president of the US firm, said failure to strike a new trade deal with the Brussels club would be damaging to both sides.\nIn a speech to the American Chamber of Commerce to the EU, she said the cost of higher tariffs would need to be passed on to consumers and threaten the supply chain across the continent.\nAlongside chocolate, that could potentially also hit products such as Wrigley's chewing gum, Dolmio, Uncle Ben's rice, and even Whiskas cat food.\nMars president Fiona Dawson is warning that prices of popular chocolate bars could go up if the EU chooses to 'punish' Britain in negotiations\nTheresa May is set to trigger Article 50 and formally begin Brexit negotiations as early as next week.\nThe food industry is keen to make its voice heard ahead of the talks, after debate so far largely focused on the risks to the City and car manufacturing.\nMs Dawson will point out that food and drink is the largest manufacturing sector in the UK, and is almost as big as the car and aerospace industries combined.\nMars employs some 3,800 in the UK and more than 18,000 people across Europe as a whole.\nBut Ms Dawson will say its manufacturing and supply network relies heavily on the absence of tariffs.\n'The return of those barriers would create higher costs which would threaten that supply chain and the jobs that come with it,' she said.\nShe will say that if there is 'hard Brexit' and the UK falls back on World Trade Organisation rules, tariffs would revert to 30 per cent for confectionery, 20 per cent for animal products, over 15 per cent for cereals and more than 10 per cent for fish and fruit.\n'Unfortunately there is no way that those costs could be absorbed without flowing through to consumers in the form of higher prices,' she will say.\nMs Dawson stressed that the UK and EU will still be 'critical markets' for each other's businesses after Brexit.\nTheresa May, pictured at a Brussels summit last night, could trigger Article 50 and begin the formal Brexit process as early as next week\nBounty is another one of the Mars brands that could become more expensive if the EU insists on a 'hard' Brexit\nIn a plea to Brussels powerbrokers, she said: 'There can be no economic advantage either side restricting trade with a large market situated on its doorstep.\n'In simple terms, if the UK and the EU fail to agree on a new preferential deal, it will be to the detriment of all...\n'Other member states should remember this is not about 'punishing' Britain for her decision to withdraw but rather about finding the best solution for European and UK workers and consumers. That consideration must come first as we build the future.'\nDespite the company opposing Brexit, Ms Dawson will say the company remains committed to the UK.\n'Our presence in Europe, including in the UK, is a proud legacy that we wish to maintain,' Ms Dawson is expected to say.\nLib Dem MP Tom Brake said: 'People with a sweet tooth risk being left with a sour taste in their mouths because of this Government's reckless plans to leave the Single Market.\n'There is already Brexit squeeze on living standards caused by the plunging pound and higher prices. Crashing out of the EU without a deal would mean more price hikes on some of Britain's favourite foods.'","url":"https://www.dailymail.co.uk/news/article-4300856/Mars-warns-chocolate-prices-hard-Brexit.html"}
