{"authors":["William Bigelow"],"date_download":"2018-10-30 21:30:28","date_modify":"2018-10-30 21:30:28","date_publish":"2015-02-22 19:00:34","description":"Seattle Seahawks running back Marshawn Lynch, 28, who was fined $100,000 last November for his continual refusal to speak to the media, had plenty to say |","filename":"data/vaneerConsumption/MarshawnLynchSpeaksoutonCrimeinVisitBacktoOakland.json","image_url":"https://media.breitbart.com/media/2015/02/Marshawn-Lynch.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_02_22__1540935028.html","title":"Marshawn Lynch Speaks out on Crime in Visit Back to Oakland","title_page":"Marshawn Lynch Speaks out on Crime in Visit Back to Oakland | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Seattle Seahawks running back Marshawn Lynch, 28, who was fined $100,000 last November for his continual refusal to speak to the media, had plenty to say at a hip-hop concert in his hometown of Oakland earlier this year, telling attendees they needed to care more for each other, according to the San Francisco Chronicle.\nTMZ Sports published the video of Lynch’s rather uncouth speech, which went like this, in part:\nWhen I’m doin’ my thing, representin’ y’all, I remember you mother******s, but I need to remember you mother******s, you understand me? You know what I’m talking about? I’ve been losing too many of y’all. I’ve been losing too many of you brown love representin’ where I’m from on the national mother******’ stage to be able to give ya’ll something to represent. But I need y’all mother******s here for me to represent … but let your young nig**** … doin what the f*** they doin’, let them know that, nig*** we need to be here for each other. So what we got somebody from here, reppin’ for this mother******, we still here for this mother******.\nLynch has spent much of his life in or near Oakland; he grew up there, he attended Oakland Technical High School, then went to the University of California at Berkeley. He and his cousin Joshua Johnson, who has been on the Browns, Bengals, and 49ers, founded the Fam 1st Family Foundation in 2006.\nAccording to Mercury News, Lynch returns to his high school regularly; Karega Hart, the boys basketball coach and a special education instructor, said, “He’s a regular here. The kids have even gotten over him being a superstar. He’s just Marshawn.”","url":"https://www.breitbart.com/local/2015/02/22/marshawn-lynch-speaks-out-on-crime-in-visit-back-to-oakland/"}
