{"authors":[],"date_download":"2018-10-30 20:14:01","date_modify":"2018-10-30 20:14:01","date_publish":"2017-03-08 20:55:33","description":"MARTA has found new private partners for the $51.","filename":"data/vaneerConsumption/MARTAfindsnewpartnerforKingMemorialStationdevelopment.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/08/Images/newsEngin.18021219_King-Memorial-conceptual-rendering.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_marta-finds-new-_da073888c32bc0a64fb52769485fae08__1540930441.html","title":"MARTA finds new partner for King Memorial Station development","title_page":"MARTA finds new partner for King Memorial Station development","title_rss":"NULL","source_domain":"ajc.com","text":"MARTA has found new private partners for the $51.3 million transit-oriented development at its King Memorial Station.\nThe agency announced Wednesday it will partner with Place Properties and H. J. Russell & Company to develop the project, which will include a mix of residential and retail space.\nMARTA originally awarded the project to Walton Communities in 2014. It’s unclear why MARTA replaced the company. MARTA deferred comment to a Walton official, who did not immediately respond to a request for comment.\nThe proposed development will include about 400 apartments – with 20 percent earmarked as affordable housing – and 10,000 square feet of retail space. Construction will begin late next year.\nPlace Properties Chairman and CEO Cecil Phillips promised the development “will be best in class, and home to an incredibly diverse roster of residents.”\nMARTA CEO Keith Parker said redevelopment of the Memorial Drive corridor has accelerated in recent years. He the development “reflects our commitment to the live/work/play experience and our customers who relish a car-free lifestyle.”\nThe agency hopes to create similar developments at many of its transit stations, including Avondale, Chamblee and Edgewood/Candler.\nNot all has gone smoothly. In February MARTA canceled plans for a $200 million development at its Brookhaven Station after months of disagreement between the city and the developers about its cost and appearance.","url":"https://www.ajc.com/news/local/marta-finds-new-partner-for-king-memorial-station-development/atPRf4Yk13pflDo5BjC8PM/"}
