{"authors":["Martin Samuel - Debate For The Daily Mail"],"date_download":"2018-10-22 21:55:10","date_modify":"2018-10-22 21:55:10","date_publish":"2016-01-28 09:28:57","description":"Half the Arsenal crowd think that second to Leicester represents a golden dawn, the other half think the manager should get the bullet. Enjoy THE DEBATE.","filename":"data/vaneerConsumption/MARTINSAMUELsaysArseneWengerwillbeahardacttofollowatArsenal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/09/308A47D700000578-0-image-a-33_1453972408655.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3420508_MARTIN-SAMUEL-Arsene-Wenger-hard-act-follow-Arsenal-fans-like-statue-want-sacked-now_1540245310.html","title":"MARTIN SAMUEL says Arsene Wenger will be a hard act to follow at Arsenal","title_page":"MARTIN SAMUEL says Arsene Wenger will be a hard act to follow at Arsenal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Arsenal have managed their finances astutely, built a new stadium and continue to administer the club efficiently. There is no reason to believe that when the time comes for Arsene Wenger to go it will be managed by the board equally adeptly. Michael, Bouvet Island.\nI agree. I don’t think it matters how well the company has been run until now. Manchester United are a phenomenally successful business, on the way to being the world’s richest club again, despite several years in the doldrums on the pitch. That doesn’t mean they have found it easy to replace Sir Alex Ferguson, though. And it’s not as if they went about it in a haphazard or foolish way. The appointment of David Moyes made sense; so did bringing in Louis van Gaal. They were not outlandish or maverick decisions. Moyes was regarded as a manager cut from the same cloth as Sir Alex Ferguson, Van Gaal the marquee name they thought was required to handle an elite group of players, when Moyes unexpectedly failed. All that we know from this really, is that empire builders are tough acts to follow – and Wenger is an empire builder. This was the subject of Wednesday’s column – the inevitable succession issues at Arsenal, and why nobody at the club should feel smug about the turmoil at Manchester United. You can read it here. Thank you to Michael, who claims to be from a sub-Antarctic volcanic island and dependency of Norway. And just in case he is, this should make him feel right at home. (The chilled Norwegian music, not the video. I don’t see Bouvet Island being that wild; or sunny.)\nWenger has done an incredible job with us. Getting Arsenal into the Champions League for 18 consecutive seasons is no easy feat, especially during the period covering the move to the Emirates. During the same time span, we have seen Liverpool crumble and fall out of the top four and Manchester United undergo a transition after the retirement of Ferguson. Chelsea are also struggling this season. Wenger is without a doubt one of the best managers to grace the game. He has laid the groundwork for his successor to take over a squad with a mix of youth and players in their prime. He deserves a statue, trams named after him and I will be forever grateful to him. However, he has to go this season if we fail to win the league. There is an apparent figure of £200m in the bank, but he has spent a mere £10m on Petr Cech. The goal at the start of the season was to win the league, and if we fail, we need a new man at the helm. El Chapo Jr, Mexico.\nWhat is it about you and transportation tracks, El Chapo? Trams named after him? What trams? North London doesn’t have trams, and I wouldn’t have thought anyone is considering introducing the Arsene Wenger Expressway in Manchester anytime soon. Even so, I could tell there was a big ‘but’ coming midway through that post? He’s a genius, build a statue, yada yada – but if he comes second this season he’s sacked. It sums up the relationship between so many Arsenal fans and their manager: either on honeymoon, or in the divorce courts.\nManchester United were serial winners up to the point Ferguson left. Wenger, on the other hand, is making sure he makes his position easier to fill by not winning any major trophies for over 10 years, bar a couple of FA Cups.Ivor Gripe, Kent.\nThe FA Cup is a major trophy. Manchester United would certainly have liked one in the years since Ferguson left. And I was referring to the philosophy of the club that Wenger has built, not simply a list of achievements. Dario Gradi will leave a giant hole at Crewe Alexandra one day. Not because Crewe have won much, but because for 30 years the club has been run to his specification as manager, technical director and currently the head of youth development.\nCan't go along with this – there is no comparison between the two. Ferguson was the greatest manager in the English league, while Wenger has had some successes but not at the same level and is constantly criticised for being indecisive, making poor decisions and generally being unable to go the extra mile. If Wenger were to leave tomorrow it would be a blessing in disguise, depending on his successor. Frankie1, Carlisle.\nIt’s all there in that last clause, Frankie. Even though, to read your faint praise, Wenger would appear to be useless, there is the capacity for what follows to be worse. Meaning he’s not so easy to replace after all.\nI feel Steve Bould is being prepared for the big job. It seems like the Arsenal way to make your own stars rather than take a high risk gamble. There is no guarantee that Bould will be successful as Diego Simeone or Pep Guardiola at managing their former clubs, but I think that’s the eventual plan. Sidd7689, Bangalore.\nI would be very surprised if Bould was Wenger’s successor. And I don’t know where you get that homegrown is the Arsenal way. There was not a single homegrown player in Arsenal’s starting line-up on Sunday, unless you count nicking Hector Bellerin from Barcelona before he had the chance to play a game, and only Kieran Gibbs on the substitutes' bench. With John Terry in the starting line-up and Ruben Loftus-Cheek among the subs – plus Bertrand Traore, who was taken from Auxerre as a teenager, without playing a game – Chelsea had more of a claim to promoting homegrown talent than Arsenal. And that’s saying something.\nLike it or not, Chelsea have shown that no manager, no matter how good his record, is bigger than the club. Paolo, London.\nNo, Chelsea have shown that their dressing room is made up largely of snides who are not to be trusted.\nAll realistic Manchester United fans should read this article. I have had probably the worst campaign as a United fan, but I know for sure that all we need is patience. D. Mitalia, Rwanda.\nEasy to be patient when your great investment is turning the television on, and off. Have a little more respect for those that pay to go.\nManchester United had the opportunity to get Jose Mourinho or Carlo Ancelotti, but went for Moyes instead who has never won anything as a manager and played poor football at Everton. Then they went for Van Gaal who was run out of town for playing poor football at Barcelona and Bayern Munich. Now they are thinking about Ryan Giggs who has never managed a club, apart from four meaningless games, when Mourinho is available again. They don't have a clue. I'd like to think Arsenal would not be equally stupid with their choices. If United had gone for Mourinho in the first place they would have won the league again by now. Star Lord, London.\nI think if they end up bringing Mourinho in at the end, it was madness that they did not do it sooner, particularly if they fail to reach the Champions League. However, I understand why they saw Moyes as more of a like for like replacement for Ferguson. As for Moyes playing rotten or dull football at Everton, I don’t think that was the case. I thought Everton’s style became more expansive as the club grew stronger. You’ve got to remember his first job when he took over was to keep them up.\nIt's really not that big a deal - Chelsea are in a far worse position. Carlovonsexron, Fife.\nYes, but because Chelsea managers have such a short lifespan, succession is never an issue. This is about Arsenal’s long-term plan, not one season of superiority over Chelsea.\nWe used to be this far behind... Arsene Wenger has Arsenal challenging for the title with 15 games to go\nThere hasn't been too many head-in-hands moments but three games without a win has dented the title charge\nMoyes wasn't given the time or the transfers input to succeed. Bringing in Juan Mata in the January transfer window and the last gasp Marouane Fellaini transfer from his first season wasn't enough. Pie Face, Leicester.\nAgreed, although he must shoulder some of the blame for that. He should have been stronger from the start. There was a lot of dithering the summer after Ferguson went.\nWenger will leave quality players behind, unlike Ferguson. Asl Prime, London.\nFerguson left a team that had won the title. Will Wenger do that?\nAs long as Arsenal don't let Wenger choose his successor things will be fine. Look at Barcelona and Bayern Munich, for example. You can't let fear make you stay with the devil you know. Arsenal need change at the top and Wenger needs to go soon. There are good managers around and if we don't have ex-players using their punditry to criticise the new boss and the media don't get on his, or her, back then things will be OK. Wenger was given a chance once. Why shouldn't someone else come in and do well? Don't be so blind, there is life after Wenger. Sakafaite, Hampshire.\nDon’t bite, don’t bite, don’t bite, ah stuff it… So you are saying that you wouldn’t let Wenger, whose ethos has built the entire club, anywhere near the succession process – but you would be perfectly happy if Arsenal appointed the first female manager to work in men’s professional football in this country? A manager who would never have competed in the Champions League, or indeed any of the competitions she was now entering? Who had never managed a dressing-room of male footballers of elite standard, from a variety of nations and cultures? Who had never dealt in an international transfer market measured in tens of millions, organised a pre-season regime for elite footballers or coached in front of a demanding crowd of 60,000? I don’t want to come across like Sid the Sexist here, and there may well be female coaches in the Premier League one day and amen to that, but this evolution will be gradual. It will start at the lower end, away from the intense pressure experienced by coaches at Wenger’s level. And I can’t help noticing that at the moment, even England’s women have a male coach, Mark Sampson. He’s done well, but I still think the principle is wrong. There are scant opportunities for women in football as it is, without giving the main job in their field to a man. I am always dismayed by the amount of white Europeans in charge of countries at the Africa Cup of Nations for the same reason. We need more avenues for women to be involved in sport, but the leap to managing Arsenal is enormous. You wouldn’t give the job to the coach of Leyton Orient, because he hasn’t got the necessary experience, and the same would apply to any female applicant. I’m all for original thought but Arsenal are better off embracing convention, for now. And better off asking Wenger, rather than the nearest wild imagination.\nIncredible. A complete non-story about how one club's inability to replace a long-standing manager must mean Arsenal will do likewise. Who says Arsenal are scoffing at United's demise? No-one except the author. Please show me Wenger's quotes mocking United's handling of their managerial situation since Ferguson retired. There aren't any. So in reality this is just another article that is borne out of the imagination of the author with absolutely no basis in truth, and even less knowledge of how Arsenal are planning for the future after Wenger. Yet the author seems quite sure enough to go to print and run Arsenal down at what he thinks they could or might do. Wow. Thanks. If you have the gift of foresight I suggest you put it to better use in the wider world and stop wasting it on spurious football theories. Charliegeorge, Pembroke.\nI do have the gift of foresight, Charlie. I told people before this debate began that, as usual, there would be some complete clowns who didn’t understand the original article but saw fit to pontificate about it anyway, usually while hiding behind a stupid alias. And here you are! This is why I’m banned from all of Derren Brown’s shows, you know. I’d ruin it for everybody. Anyhoo, here’s a person who did understand.\nWhere does the ‘author’ say it's Wenger who is scoffing? The Voice of Reasons, United Kingdom.\nIndeed, where does the ‘author’ – I’m a writer, Charlie, an author does books – use the word scoffing? It’s in the headline, not the column. I said Arsenal will be happy that Manchester United are struggling, and I’m reasonably sure that is an accurate appraisal. I doubt very much if, in the board room, the directors are wringing their hands at the present crisis at Old Trafford. “Oh Stan, I do hope Manchester United get it together again. Not content with them being considerably richer than us and able to spend more money on players, I do miss the days when they won 13 Premier League titles to our three. More competition, that’s what we need.” They were probably delighted to be beaten by Chelsea at the weekend, too. “Oh Stan, wouldn’t it be marvellous if Chelsea get right back in the mix next season. I did so enjoy finishing behind them in 10 of the last 11 seasons.” And I didn’t say that Arsenal would fail to replace Wenger. I said the problems that Manchester United have faced show how difficult it is. There isn’t a single word in the column that criticises Arsenal. It merely flags up the potential for trials ahead.\nWenger should take Glenn Hoddle on as his assistant. Egg Sandwich, London.\nYes, that will go down well with locals. Why not have this lot play on the pitch before matches while they’re at it?\nCounter intuitively, Chelsea have the most stable system. The continental approach of Real Madrid or Barcelona, where the first-team ‘manager’ is no more than a coach. When the coach is replaced the club sails on. Hotairmail, London.\nNot sure Chelsea have always sailed on, but it’s a fair point. Real Madrid had a ludicrous number of managers in the time Ferguson was at Manchester United, but their level of success was more or less the same. There are other ways to do it, beyond giving one man the keys to the castle.\nNo, we won't be like Manchester United because we have young, emerging talents like Hector Bellerin. Ferguson left behind an old squad. Furthermore, Arsenal won't be in a mess like United because Wenger has always said that he will only leave when he knows the club is in a good state and able to flourish. Wenger knows what is good for Arsenal and puts it first. Ferguson placed his legacy before United. Adjtag, London.\nFerguson left the champions of England. They finished 16 points ahead of Arsenal that season so I’m sure he thought they were in reasonable shape. As for Wenger, the last time he talked of retirement he spoke of an “impulsive, instinctive” decision, somewhat different to tucking everybody into bed safely before saying night, night. And while I like Bellerin, ‘we’ve got a decent, young right-back’ is a little different to ‘we’re set fair for the future, what could possibly go wrong?’\nArsenal's board is incompetent and there is no doubt that they are going to make a mess of finding a replacement for Wenger. The United Empire, Kansas.\nI don’t think that is true. What I would say, though, is that like the board at Manchester United they have never had to replace an elite Premier League manager. We don’t know what they value, or what they want. There is a world of difference between having complete faith in Wenger and letting the club be run according to his ethos, and being out in the big, wide world, alone.\nI firmly believe that Wenger’s replacement has already been confirmed and it will be Thierry Henry. My fear is that he won't be up to the job. It’s a safe bet from the board because he can do no wrong with the fans and his honeymoon period will be longer than most, but I don't see him as an Arsenal manager. Remember that Wenger is Arsenal. He sits on the board and will be tasked with finding his own successor. Wenger will mentor Henry and in doing so will retain his influence over the club. More importantly, Stan Kroenke will ensure his purse strings remain tight enough to deliver Champions League revenue without showing enough ambition to win the League. Sick of it. Roland Browning, Brixham.\nYes, but surely if Wenger was mentoring Henry he would be sat where Giggs is now, not in a television studio?\nWhat has happened at Manchester United will never, ever, happen at Arsenal. Only certain managers will be fit for Arsenal, men like Guardiola or Ancelotti – attack-minded managers, not Van Gaal. Gunners JA, Montego Bay.\nYes, but Guardiola is going to City and Ancelotti to Bayern Munich. They won’t be available short-term, and they won’t leave those clubs for Arsenal – so you’ve got to hope Wenger stays, maybe three years at least. And next, a real meeting of minds.\nSamuel is just an Arsenal hater from way back and now his precious Manchester United are in the wilderness he has to lash out at somebody, so it might as well be us. Either way, it's very poor journalism. Philpo, Perth.\nI really hope Manchester United fight their way out of this mediocrity. Not just because I am a United fan, but because it will wipe the smug smile from Samuel’s face. If anyone is enjoying United’s current plight it’s him. A self-styled Alan Green. Famous for being infamous. United-1958 Heroes, Manchester.\nNext week, the Chelsea fans will think I support Manchester City, and the Manchester City fans will think I support Chelsea. Everyone thinks they have the prettiest wife at home, as Wenger said, and everyone thinks the media hates their football club. I was coming away from Anfield on Tuesday night and Peter Coates, chairman of Stoke, came walking towards me. We said hello and he started going on about how happy the media were that Liverpool had won the penalty shoot-out, how everybody was smiling in the press box. I don’t always sit in the press box at Anfield, I sit with the TV and radio people if there is room because I prefer the working conditions up there, but I thought maybe the reason people were smiling was that it had been an exciting finish and they enjoyed that, as any football lover would. Anyway, it was a live one, so I responded rather robustly that I didn’t think his view was correct at all, that just about every writer I knew wanted Leicester to win the league, and that, frankly, I didn’t give a monkey’s who won out of Liverpool and Stoke. I didn’t have a dog in that fight. He’s a chairman whose team has just lost a semi-final on penalties. He is going to be disappointed. I get that. And I like Peter Coates, but I think it really is easy to bang on about media bias, without considering the reality. His point was that it is better for the media if Liverpool win. And yes, commercially, it probably is. Liverpool sell more papers, and garner more clicks, than Stoke. Yet, by that token, I’d want Manchester United to win every cup, every year. But anyone who knows me will confirm that I would hate that. I’d hate it if any team wholly dominated. So if Stoke had won, on the grounds that it would be a different team at Wembley, I’d have liked that too. And now it’s Liverpool in the final? Well, Jurgen Klopp is box office in his first season in English football. He seems a good bloke, and a good manager too. He has made English football a livelier place to be, so I won’t be complaining. And that’s the thing when you are a neutral at matches, as I am – you are far more tuned in to what you like, than what you hate. I even see the good in Milton Keynes Dons these days. The academy system that produced Dele Alli? What’s not to admire? I’d like if it Leicester won the league because I think it would be the greatest achievement in club football in my lifetime; but does that mean I hate Arsenal? No. I’d like it if Arsenal won the league, too, because they play good football and Wenger is a giant in our game. Manchester City? Lovely people. Friendly club. Nothing against Manchester City at all. The only thing I hate, actually, is this idea, the one that Peter Coates had, that we all sit around in press boxes willing teams to lose. Want to know a secret? Usually, we’re just willing the wi-fi to work.\nThese scenes of celebration were on the pitch, not in the press box, after Liverpool beat Stoke on penalties\nThe big difference is that Arsenal fans would give the new manager their support unlike the Manchester United fans who hounded Moyes out. Blue-2, Manchester.\nOh, what nonsense. The United fans were very supportive of Moyes, but expectations are high at that club, and not unreasonably. Are you telling me that if the successor to Arsene Wenger comes seventh in his first season and the football takes a dive, there won’t be a negative reaction – because, in recent years, the Emirates crowd has turned quicker than any I know. You only have to look at some of the posts on here to see opinion remains divided on Wenger, even now. See below.\nIf Wenger does not win the Premier League this year he needs to go. I think any half decent manager should be able to finish better than fourth. Somebody also needs to get rid of the dross in the team. Kerry Livermore, London.\nHear that? ‘Any half decent manager should do better than fourth.’ Kerry doesn’t seem like the type who is going to be happy with seventh then.\nI'm pretty sure Arsenal will be fine. They have a smashing squad and great youth coming through. Manchester United have an average squad that doesn't compete with Arsenal’s in the slightest. Cmac86, Belfast.\nOn paper, I’m not sure that is true. On paper, United look to have a very strong squad. In practice, it is underperforming. That is the problem. It is not just a case of picking 11 good players and sending them out there. Clearly, Arsenal have a better group than Manchester United right now but, man for man, on reputation alone they are not so far ahead. If I had to pick a composite team, based not on form this season, but on paper with everyone fit and operating to the best of their ability, it would be fairly evenly split. Here goes: De Gea; Bellerin, Smalling, Koscielny, Shaw; Schweinsteiger, Ramsey, Ozil; Sanchez, Giroud, Rooney. And now, the essence of Saturday afternoon.\nWhat is the purpose of good football if only two trophies have been won since 2005? Arsenal make £100m a year from gate revenue and £160m from TV money, the highest television revenue in Europe. We should be winning major trophies regularly; anything less is conning the fans. Elmi12345, Glasgow.\nThe entire point of watching football is for entertainment, enjoying matches as they happen minute by minute. If results are all, Elmi, then just check the score after the game. IF, London.\nIsn’t the reality in between? Yes, I agree, if it’s all about the result, you could follow your team in one text message, but it can’t just be about aesthetics, either. The easiest thing is to be judged on unquantifiable factors – preparation, or improvement. There is a lot of that about with the England team now, as if putting on a good training camp is the same as winning a trophy. In the end, if the result isn’t important why bother keeping count?\nWhen you sit back and look at it, should it really surprise us that two and half years later Manchester United are still struggling to replace a man like Ferguson? Van Gaal has always been a means to an end, steady and sure, to hand over to Giggs, maybe. The problem with Moyes is he didn't make his mind up about his playing staff quickly enough and Van Gaal is the polar opposite. He should have never let certain players leave without replacements. I still don't think Van Gaal has made a particularly bad signing, but if he were baking a Victoria sponge, he'd have got two good sponges made, then slapp one on top of the other with no filling or decoration. Any icing he did buy will take a couple of years to roll out, by which time he'll be gone. Lewis, Manchester.\nDo you roll icing? Isn’t it pastry that is rolled? And that cake sounds terrible, Lewis. What are the sandwiches like at this party? I’m not sure I’m coming.\nIt's January in Manchester but Louis van Gaal is feeling the heat after United lost to Southampton\nIt seems strange that someone like Wenger, who has redeveloped the modern Arsenal from the ground up, has never put a succession plan in place, grooming a second in command to eventually take over. Maybe he thought having a readymade replacement in the wings would weaken his position and make it easier to get rid of him during the lean years. He only has to look across at Giggs to recognise the danger. By protecting his own interests he has possibly put the future of the club in doubt. Not his problem I know but you would have thought someone at the club would have taken a longer view. Nick, Aylesbury.\nI don’t think Arsenal’s future is in doubt, Nick, I just think there could be testing times ahead. I know some people think Wenger surrounds himself with people who are no threat, but he can’t be that insecure, surely. I just think he feels about his staff as he does his players – that nobody out there is better and while they might not be marquee names, he has complete faith in them. I find it hard to believe he is selfishly overlooking good coaches and prospective successors.\nNo problem: Brendan Rodgers is eagerly seeking employment. Mom of three pixies, Donegal.\nI know you are being facetious, Mommy, but it was actually Rodgers I had in mind when I wrote the line about Arsenal taking a coach “who embodies Wenger’s ethos, even if his track record is not immediately impressive”. Rodgers' thoughts on football would have far more in common with Wenger’s Arsenal than more famous, and successful, rivals. A lot of the best managers, from Simeone to Mourinho, are pragmatic in approach. Rodgers, like Wenger, is an idealist. Yes, he was sacked by Liverpool, but he didn’t do a bad job there. He just fell short of winning the league, when to do so would have represented the greatest improvement of any title-winning team in the Premier League era. Put it like this, if Klopp came second next season he would be hailed as a genius. Rodgers lost a lot of good players, and his bosses imposed a recruitment policy that made a difficult job even harder. With better resources, he could make a very good Arsenal manager and he would certainly play football in the spirit of Wenger. Cue howls of outrage as Arsenal fans demand a more sophisticated coach. And we know what that often means: foreign. Now Klopp is a an excellent coach, but it remains to be seen whether he can get Liverpool as close to the title as Rodgers did. (And the argument that it was all down to Luis Suarez and Rodgers just got lucky is only permissible, if it is then agreed that Rodgers’ failure without Suarez was equally out of his hands.) Anyway, Mom of three pixies, here’s four Pixies.\nManchester United and Arsenal are very similar. Both are merely departments of a much larger conglomerate and have morphed from football clubs to for-profit franchises. Football people, like David Dein, have been replaced with business people, like Ed Woodward. Arsenal are actually in a better position because Wenger is the perfect for-profit manager, and is excellent at it. His replacement for Wenger won't be a Guardiola, Mourinho or Ferguson, but another business or economics manager, Wenger having already done the hard work in converting from football club to for-profit franchise. This conversion work has not been completed at United, who are still to find their Wenger. Chelskikovites, Hampshire.\nSome interesting points made here. I still see Dein as a business person every bit as much as a football man, but I agree he is a very different animal to Woodward. And you are right, Wenger the economist is just as much a part of Arsenal as Wenger the aesthete – and it could be this aspect of his personality that the club chooses to follow when he steps down.\nSamuel makes the well-trodden journalistic error of assuming that things that appear similar are in some way related so will have similar outcomes. Arsenal as a football club are run in a fundamentally different way to United both before and after Ferguson was still in charge although the club models were much more aligned in the middle part of the Ferguson era in the mid-1990s. United have become a brand, leveraging as much revenue from that brand as they can in just about any way they can. In short, United have forgotten what their core purpose is – that they are first and foremost a football club. Academy prospects became less local, less British and then less wanted. Arsenal have never forgotten their core purpose: the revenue always drives the football and should never be a means to a different end. IWWT, London.\nThis is the club that pays its main shareholder, Stan Kroenke, £3m annually for his advice. Advice on running his own business? How lovely. In what way does that expenditure drive the football? When Sir Chips Keswick was asked if this consultancy work was put out to tender, before being awarded to the owner, he threatened to close down the AGM. Equally, if Arsenal’s core purpose is football it is coming up to 12 years and counting since they won the league. The business side of it seems to be going rather well, though. Arsenal now go on long-haul tours, buy the odd marquee name like Mesut Ozil or Alexis Sanchez and the stream of local talent has slowed to a trickle with the entire current starting XI bought in. Arsenal are trying just as hard commercially as Manchester United; they’re simply not as good at it.\nThis article is nothing but conjecture. Ferguson left United in a precarious position. Yes, they won the league, but many analysts agree that they did so in a very unconvincing manner. Ferguson made an average team win trophies and as soon as Moyes took over he was desperate to find quality replacements. Wenger, on the other hand, always prioritises Arsenal’s stability even at the expense of short-term success. The books are balanced, the club has WC infrastructure and the squad has a good mix of experienced and young talent. If Wenger decided to retire at the end of this season, the club would be in better stead in comparison to United. Joseph, London.\n‘Yes, they won the league…’ – don’t you love that? Winning the title dismissed as if it were nothing, by a supporter of a club that hasn’t got near one since 2004. The United team that you rubbish so expertly finished 16 points ahead of Arsenal in Ferguson’s last season. I’ll repeat: 16 points. Meanwhile, the current Arsenal squad – that fine mix of experience and young talent that Wenger could bequeath to his successor confident in the knowledge that nothing could go wrong – is blowing out of its backside trying to catch Leicester. Get real. Still, good to know the toilets are shaping up.\nThis article lacks factual base and is completely born of assumption. The transition will be smooth because Wenger has laid a solid foundation. Ferguson left an ageing squad and the majority of them had won trophies so there was no drive to achieve more under Moyes. Anikla, Accra.\nAh, I see. So this is Wenger’s cunning plan. Fail to win a title for 11 years and keep the players hungry as a favour to his successor. Why, professor, that’s brilliant!\nDo you honestly think Arsenal supporters haven't been thinking this for years? Not exactly cutting edge journalism. Paul1973, Chelmsford.\nOn the contrary, Paul, judging by some of the responses on here, I’d say your supporters think the board is populated by geniuses, the future is hunky-dory and if it got any brighter we’d all have to get out the factor 50. You would appear to be alone in your pessimism, or maybe the happy pills haven’t kicked in yet. Ask to borrow some from this chap.\nWhen Wenger goes he will leave behind a squad in its prime, who are all very talented and understand how the club wants football to be played. There will be lots of money for the minor adjustments the new manager deems necessary. I am very happy with the condition the club will be in. Ob1977, Kent.\nAnd free money for all! How marvellous, because if my team had taken eight points out of 18 against six clubs no higher than seventh in the league (Southampton, Bournemouth, Newcastle, Liverpool, Stoke and Chelsea), I wouldn’t be entirely confident of golden days ahead, or even the expected procession to the title.\nWhen Wenger walks away Arsenal will have a giant hole to fill like the one Sir Alex Ferguson left at United\nManchester United made two shocking decisions following Ferguson. No chance any of Arsenal, Chelsea, Manchester City, Tottenham or Liverpool would have ever been interested in Moyes or Van Gaal. See if they can get it right third time around. Nacho Libre, Mexico.\nVan Gaal was perhaps off the radar of many English clubs, as manager of Holland, although Tottenham were definitely tempted – but I definitely think you are being a little harsh on Moyes. To take these options in turn – he could never move from Everton to Liverpool, and throughout his career Arsenal have had no intention of sacking Wenger, so he was never going to work there. Roman Abramovich has refused to appoint a British coach, while Manchester City are still riled by Moyes’ comments during the Joleon Lescott transfer saga. That leaves Tottenham, who did consider him as a coach in 2012 after Harry Redknapp and again in 2014 before employing Mauricio Pochettino but, as I understand it, felt his style a little too cautious. I repeat: these were not off-the-wall appointments by United.\nWenger will hand over the reins of a very well-run club, extremely secure financially, with players still very much in their prime and room to improve still further. So long as we get a decent manager in, we should do fine. Part of me almost wonders if Wenger has held the purse strings so tightly simply as a means of ensuring his successor has all the ammunition he will need to take the club forward. TyOdi, Weston-Super-Mare.\nAre you at all aware of Oxfordian theory? It’s the idea that Shakespeare’s plays were not written by Shakespeare, but by the Earl of Oxford, Edward de Vere. He must have been a darn clever chap, though, because he was dead in 1604, before 12 of them came out. That means he departed before the Gunpowder Plot, referenced in Macbeth, and before the sinking of the Sea Venture in 1609, which was the inspiration for The Tempest. But the real reason I don’t think the Earl of Oxford was writing under an alias as Shakespeare is that he also wrote plays and poems under his own name, all of which are either forgotten or rubbish. So, for us to believe in Oxfordian theory, we have to buy into the notion that Edward de Vere produced the finest body of literary work in the history of this, or any other, language and let another man take credit for it; while putting the poetry of a complete bozo out under his own name. It would be like finding out that The Beatles never existed and their entire recorded output was composed and recorded anonymously by Black Lace – while breaking cover only for the release of Agadoo. Equally, it would be like learning Wenger had endured close to 12 years of howling fury and insults, his reputation savaged, in order to make sure his successor would look like a genius. By the way, you know the cleverest thing about the seventeenth Earl of Oxford? It was the way he left behind just the right amount of plays to last under the year this bloke called Will Shakespeare died: when they suddenly stopped.\nI’m pretty sure that when Wenger steps down at Arsenal he will not be doing so with Robert Pires, Thierry Henry and Sol Campbell as his best players. Ferguson effectively handed over a team that was in desperate need of an overhaul and even called Paul Scholes back from retirement for his final season in charge. Whoever succeeds Wenger at Arsenal will not inherit a squad that has been declining for years, but a team at the apex of its power. A lot of people look at the fact that Ferguson won the league in his final season, but if Manchester City had convinced Robin van Persie to join them, he would have won nothing. To assume Wenger will hand over Arsenal in anything but upward momentum shows a particularly poor understanding of the man. Arsenal fans, mostly, get him. Nick, London.\nAnd if Arsenal do not win the league? If they can’t get in front of Leicester, for instance, will they still be judged to be on upward momentum? If Manchester City, who did not win away between September and December, get over the line by default, what will it say about this brilliant Arsenal squad? Is Jack Wilshere on the rise, Per Mertesacker, Mathieu Flamini? I think Arsenal have a good group, I still think they have a fair chance of winning the league – but at the apex of their powers? There are a lot of optimists on here today. Arsenal were unbeaten in season 2003-04, one of the great feats of the modern era. Did anyone predict that they would still be waiting for their next title almost 12 years later? Football can be very volatile.\nManchester United panicked when they sacked Moyes. If they were looking for the next Ferguson should they not have seen that it took the great man a few years to sort everything out and win trophies? Moyes only got two windows and brought two players in. Had Ferguson taken over when Moyes did he would have been out of a job the next summer and the glory years would have been lost. Steviejay99, Colchester.\nUnited were a very different club when Ferguson arrived, with very different expectations, but I take your point Steve. Looking at events since, the decision to jettison him seems hasty – if understandable at the time, when the fix seemed to be the simple process of getting in a stellar coach.\nReplacing Wenger is a completely different task to replacing Ferguson. For one thing, most Arsenal fans now agree that Wenger has had his time. I very much doubt Manchester United fans felt the same. Replacing Wenger is easier than replacing Ferguson as we need to change. Sammas, London.\nYes but people will be expecting the change itself to be the panacea, whereas it may not be as easy as that.\nThis has to be one of the most ridiculous articles I have ever read. Arsenal were successful before Wenger came, indeed you could say that George Graham was even more successful. Arsenal will always be a big club because of where they are based. Manchester United had gone without success for almost 20 years before Ferguson, he created the modern super club and there was always going to be a chance that without him, that status could be imperilled. United will always be a huge name because of their history, but their location leaves them more vulnerable to retaining elite status than a big London club. Harry, The Barbican.\nI don’t wish this to descend into futile name-calling, Harry, but the idea that nothing bad could befall Arsenal simply by virtue of being a big London club is rather preposterous. It is only because we have redefined the concept of success to include just qualifying for the biggest European competition, rather than winning it, and that fourth place is now treated like a trophy that more is not made of Arsenal’s decline since 2004. This is a club that went a season unbeaten, and has barely contended the title since. Yes, the capital has a certain cache when attracting players, but as new stadiums spring up around Arsenal and some of the traditionally smaller clubs grow in prestige and ambition, surely their commercial revenues grow more vulnerable, not less? Arsenal have already finished behind Chelsea in 10 of 11 seasons. What if a difficult transition period saw Tottenham outstrip them, too; or even West Ham in the Olympic Stadium? I have always regarded Arsenal as London’s number one club, but nobody is guaranteed membership of the elite. Have a look at AC Milan now.\nOlivier Giroud has his critics but, with 12 PL goals this term, hasn't Wenger turned him into a top-class striker?\nStability – defined as a long-serving manager – seems vastly overrated. Excluding the unique entity that was Ferguson where is the evidence it works? Wenger has won two FA Cups in a decade, I've lost count of the seasons when he has said it is a young team, and we should wait for it to mature. Chelsea's instability has produced trophies Arsenal fans can only dream about. Regular change can bring fresh impetus, new initiatives, more endeavour, greater drive and ambition. Maybe it’s worth the risk. Matthew London, London.\nIn the time that Arsenal have won three FA Cups, Chelsea have won four league titles, four FA Cups, three League Cups, the Champions League and Europa League. I don’t think that load comes because they have constantly changed managers – maybe they would have won even more by showing patience with Ancelotti or Mourinho, the first time – but Chelsea do seem to have benefitted occasionally from what might be termed creative tension. And heavy investment on players, obviously.\nIf, upon retirement, Wenger moves upstairs his experience would always be available; but Manchester United still have Ferguson and so far it appears his knowledge and experience have not been an asset, more a shadow looming over the man in charge. Whoever takes up the Arsenal job does not necessarily need Wenger peering over his shoulder. Ted Wallis, Lincolnshire.\nI don’t think he would do that, just as Ferguson has very much stayed in the background at United. He is allowed to go to Old Trafford, for heaven’s sake. After all, he built the place.\nAs an Arsenal supporter the only thing that terrifies me is this bank manager, masquerading as a football manager, signing yet another extended contract. This is a man who has been given total control of everything at the club by ‘Silent’ Stan Kroenka. His remit? Get Champions League football by spending as little money as possible and I will reward you handsomely. This is a football manager who is totally inept, completely bereft of any tactical nous, with misguided loyalty to sub-standard, insanely overpaid players with zero accountability. We need a strong defensive midfielder, a world-class striker and a proper centre-half. Instead he persists with the headless Flamini, the lampost Giroud and the slow as molasses Mertesacker. I believe he is afraid to spend £60 or £70m in case he still doesn't win the Premier League, then people will finally see just how clueless he actually is. Chris Butler, Devon.\nI do find it strange, these extremes around Arsenal. Half the crowd think that second to Leicester represents a golden dawn, the other half think the manager is hopeless and should get the bullet this morning. What happened to the middle ground? Yes, there are better strikers out there, but hasn’t Wenger turned Giroud into a top-class goalscorer? Yes, Arsenal could have spent bigger, but close to two decades in the top four suggests Wenger is far from inept. The thing is, I really don’t agree with Chris about this, but I’m finding it hard to be too harsh because he shares his name with a favourite of mine. Chris Butler was the songwriter for The Waitresses. You’ll know Christmas Wrapping. Have a listen to this. A feminist ska masterpiece.\nManchester United’s problem is the incompetence of Woodward and the 70 per cent of the board that are Glazer family and relatives. Losing Ferguson was a huge blow, but losing David Gill was the knockout punch. Piratepetecy, London.\nI’m not sure David Gill was the genius he was made out to be. How clever do you have to be to put on a tape loop that repeats, ‘Whatever the Scottish gentleman wants, say yes’ at board meetings?\nWatching Manchester United now is like seeing the schoolyard bully get flogged by a girl. A real pleasure and enjoyed by millions. Eckythump, Sydney.","url":"https://www.dailymail.co.uk/sport/football/article-3420508/MARTIN-SAMUEL-Arsene-Wenger-hard-act-follow-Arsenal-fans-like-statue-want-sacked-now.html"}
