{"authors":[],"date_download":"2018-10-30 20:11:33","date_modify":"2018-10-30 20:11:33","date_publish":"2017-03-29 19:17:00","description":"MARTA officials on Wednesday made a case for the safety of the transit system, touting an overall decrease in crime even after a rare spate of homicides.","filename":"data/vaneerConsumption/MARTACrimeisdownbecauseofcameras10000ridersuspensions.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/03/22/Images/photos.medleyphoto.9119522.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_marta-crime-down_3e9215ef1128a564969398703593c913__1540930293.html","title":"MARTA: Crime is down because of cameras, 10,000 rider suspensions","title_page":"MARTA: Crime is down because of cameras, 10,000 rider suspensions","title_rss":"NULL","source_domain":"ajc.com","text":"MARTA officials on Wednesday made a case for the safety of the transit system, touting an overall decrease in crime even after an unusual spate of homicides.\nCEO Keith Parker sang the praises of MARTA’s police department, which has overseen the installation of some 10,000 cameras and the suspension of as many riders.\nHe said it’s all part of sending a message: “If you commit a crime on MARTA, you’re going to be caught.”\nParker and other officials presented media with crime statistics at MARTA headquarters Wednesday in hopes of clarifying the safety of the system. Questions had naturally come up earlier this year after it came to light that MARTA police had worked four homicides this fiscal year, after at least four years without one.\n“Any crime on MARTA is too much crime,” the system’s board chair, Robbie Ashe, said. “But it is our hope today that we put some of the incidents that have happened in the proper perspective.”\nMARTA police chief Wanda Dunham pointed out that arrests had been made in all four of the recent homicides, and that other violent crime is down.\nOverall, she said, MARTA has seen a 27 percent decline in Part 1 crimes (a class that includes high-level crimes such as murders, rapes and assaults) in the past five years.\n“We do think that MARTA is a safe system,” Dunham said, calling it among the safest in the country.\nAmong a slew of other initiatives to bolster safety, the longtime chief credited the “Ride With Respect” program with driving down crime and making riders feel safer.\nThe program, whose champions include rapper Ludacris and comedian Jeff Foxworthy, has led to the suspension of more than 10,000 riders since late 2013.\nThe most prevalent offense leading to suspensions is fare evasion, with nearly 5,000 people getting booted for 60 days for that, officials said.\nThe program came about after meetings with community leaders and residents and hearing complaints about people not feeling safe on-board.\nOfficials are also hopeful that community outreach programs and a $22 million project to put cameras on buses, trains and at stations will drive crime even lower.\nThe program, with half the bill funded by the U.S. Department of Homeland Security, started in 2014. It took until last year for all of the roughly 10,000 cameras to be installed.\nThe chief said they’ve already been a deterrent and invaluable in solving crimes.\nShe recalled a young man who refused an officer’s request to turn his music down on a bus. He declined and declined until he turned and realized he was on camera.\nSlowly, sneakily, the headphones slid off.\nThe cameras were also used by detectives investigating the January homicide of a panhandler who police say was stabbed by a rider.\nThe entire encounter, reportedly sparked by the suspect’s anger at a request for cash, was on video and audio.\nSo were the suspect’s other movements. Officers tracked him with video from one stop to another and found the area where he lived. He was quickly arrested.\nFor the CEO, the police department’s efforts are part of a goal to make MARTA property “one of the worst places in this entire region in which to commit a crime.”\nRelated video:","url":"https://www.ajc.com/news/local/marta-crime-down-because-cameras-000-rider-suspensions/Vbc47RaXTN0r890QgwbapO/"}
