{"authors":[],"date_download":"2018-10-30 21:05:21","date_modify":"2018-10-30 21:05:21","date_publish":"2016-12-29 12:11:00","description":"A MARTA bus late Wednesday got caught in the crossfire of a shootout near a southwest Atlanta gas st...","filename":"data/vaneerConsumption/MARTAbuscaughtingasstationgunbattle.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/29/Images/campbellton_20161229091241198_6921323_ver1.0_640_360.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_marta-bus-caught-crossfire-gas-station-gun-battle__1540933521.html","title":"MARTA bus caught in gas station gun battle","title_page":"MARTA bus caught in gas station gun battle","title_rss":"NULL","source_domain":"ajc.com","text":"A MARTA bus late Wednesday got caught in the crossfire of a shootout near a southwest Atlanta gas station.\nA stray bullet shattered a bus window, and a 17-year-old passenger was slightly injured as a result of the shattered glass, Atlanta police spokesman Officer Donald Hannah said.\nPolice said the gunfight started just before 11 p.m. when a black BMW approached a man and a woman in a green Dodge Magnum at the RaceWay in the 3500 block of Campbellton Road.\nA passenger in the BMW pulled out a gun. The 31-year-old man in the Dodge Magnum retrieved a gun as well.\n“Multiple gunshots were exchanged,” Hannah said. “The female victim was unharmed, but the male victim [in the Dodge Magnum] was shot in the back.”\nHe was taken to a local hospital in stable condition, according to Channel 2 Action News.\nShots were fired late Wednesday outside a local gas station that left one person injured.\nThe woman’s purse was stolen at some point in the incident, Hannah said.\nThe BMW took off eastbound on Campbellton Road and stopped in the roadway to fire “multiple more rounds,” Hannah said.\nTwo cars, a church van and the MARTA bus were hit with bullets.\nIt was not clear if anyone in the BMW or the other cars was hit. No one was in the church van, police said.\nThe MARTA bus passenger, who suffered facial injuries, only required a Band-Aid, police said.\n“The bus was on Route 183 Barge Road Kiss/Ride,” MARTA spokeswoman Alisa Jackson said.\nEven though the BMW leaked an oil track to McDonough Boulevard and Grant Street, police have not found the car.\nThe RaceWay gas station gun battle was one of two overnight shootings in Atlanta.\nThree people are recovering from gunshot wounds after a shooting outside a liquor store on the city’s northwest side.\nPolice said a white SUV pulled up outside Henry's Pack-a-Sack on Joseph E. Boone Boulevard just before 11:40 p.m. Wednesday.\nOfficers said up to four people in the SUV started shooting, and a 31-year-old woman and two men, ages 43 and 50, were wounded.\nAll were taken to a local hospital. They are expected to survive.\n“Several .223 casing were recovered in the roadway,” Hannah said. “One of the victim’s vehicles was also struck.”\nPolice later impounded the vehicle for processing.\nNo one has been arrested.\nIt is unclear what caused the shootings outside the liquor store and the gas station.","url":"https://www.ajc.com/news/marta-bus-caught-crossfire-gas-station-gun-battle/JVepWwVR8AJCasiaup4TAP/"}
