{"authors":[],"date_download":"2018-10-30 20:30:57","date_modify":"2018-10-30 20:30:57","date_publish":"2015-03-05 22:54:22","description":"In a concession to neighborhood opposition, MARTA has chosen an alternate route for a planned expansion of service northward along Ga.","filename":"data/vaneerConsumption/MARTAaltersplannedexpansionroute.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_transportation_marta-maps-route-extension-alpharetta__1540931457.html","title":"MARTA alters planned expansion route","title_page":"MARTA alters planned expansion route","title_rss":"NULL","source_domain":"ajc.com","text":"In a concession to neighborhood opposition, MARTA has chosen an alternate route for a planned expansion of service northward along Ga. 400.\nThe MARTA board approved the preferred route, which crosses Ga. 400 not once but twice, at a meeting Thursday afternoon. MARTA studied several potential paths for a rail line or bus rapid transit route, including one that went up the west side and another that went up the east side, with no crossovers.\nThe route that planners settled on would bridge Ga. 400 at a spot north of North Springs Station and south of Spalding Drive. A second crossover back to the east side of the highway would occur north of the Chattahoochee River, with the exact spot still to be determined.\nAny extension, if one happens, would lie years in the future.\nResidents of communities along Ga. 400 in North Fulton had lobbied for putting a new rail line or bus rapid transit route on the west side of the highway, rather than on the east side.\nDavid Centofanti, a Sandy Springs resident and president of the Northridge Community Association, said he was pleased that MARTA took to heart residents’ recommendations after gathering feedback about potential routes at a series of public meetings.\n“They really took the feedback they got from the community and they are trying to make it happen,” Centofanti said.\nSandy Springs Council member John Paulson, who has followed the planning efforts, told board members Thursday that “the extension of MARTA is, I think, a great and positive activity.”\n“I’m looking forward to moving onto the next step and hopefully eventually get to fruition,” Paulson said.\nMARTA is laying the groundwork for three potential expansions in metro Atlanta, including the Ga. 400 one that would extend its heavy rail line from the current North Springs terminus all the way to Alpharetta. The other two are a heavy rail line along I-20 East and a light rail line from Lindbergh station to Avondale.\nThe transit agency doesn’t have the money to build any of them.\nMARTA CEO Keith Parker has said that none of the projects are favored above the others. The priority will go to whichever one secures funding first.\n“They are all very, very good and you can make strong arguments for any one of them,” Parker said at a meeting with The Atlanta Journal-Constitution’s editorial board in February. “But I think we will have at least one of those underway in a 10-year period.”\nMARTA is also studying a lower-cost alternative for the Ga. 400 expansion that would involve running bus rapid transit along the same route, or along a future express toll lane that the Georgia Department of Transportation wants to build beside Ga. 400. Last year, MARTA estimated the heavy rail option would cost $1.6 billion and the bus rapid transit option would cost about a third of that, or $473 million.\nThe estimates have since been revised upward, to about $2 billion for the heavy rail or between $800 million and $1 billion for bus rapid transit, said Mark Eatman, a project planner for MARTA.","url":"https://www.ajc.com/news/transportation/marta-maps-route-extension-alpharetta/eA51Gd6DeSkxsE6RrssMEJ/"}
