{"authors":[],"date_download":"2018-10-30 20:29:25","date_modify":"2018-10-30 20:29:25","date_publish":"2015-11-06 00:31:49","description":"MARTA patrons with disabilities and the MARTA drivers they depend on face an uncertain future after the transit agency board voted Thursday to privatize the operation and maintenance of its paratransit fleet.","filename":"data/vaneerConsumption/MARTAtoprivatizeparatransitservice.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/MyAJC/2015/11/06/Images/photos.medleyphoto.8357216.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_marta-privatize-paratransit-service__1540931365.html","title":"MARTA to privatize paratransit service","title_page":"Atlanta transit agency MARTA to privatize paratransit service","title_rss":"NULL","source_domain":"ajc.com","text":"MARTA patrons with disabilities and the MARTA drivers they depend on face an uncertain future after the transit agency board voted Thursday to privatize the operation and maintenance of its paratransit fleet.\nRiders and MARTA Mobility vehicle drivers voiced their concerns at the packed meeting held at MARTA’s headquarters at Lindbergh Center in Atlanta. More than 80 people attended, forcing the MARTA board to open an overflow room.\nDrivers, who fear losing their jobs, are vehemently opposed to the privatization plan and sought to keep operations in-house.\nThe aim of outsourcing is to save money, increase efficiency and improve on-time performance rates, MARTA officials said. MARTA Mobility’s on-time performance had dipped to 81 percent in fiscal year 2015, prompting numerous complaints from riders and putting the transit agency in jeopardy of violating a federal law that protects access to services for persons with disabilities.\nYet even MARTA’s board chairman Robbie Ashe announced he was “skeptical” of the arrangement, which will result in MARTA paying MV Transportation $69.4 million over three years. The agreement is projected to save MARTA $1 million to $2 million a year, or up to $18 million if extended out to five years.\nTransit officials said MARTA would maintain ownership of all Mobility vehicles and facilities. Management of the trip reservation system and customer service will also remain in-house.\nMV Transportation’s responsibility will be to operate and maintain the fleet. The contract requires the company to keep its on-time performance rate at 90 percent or higher, while at the same time reducing the number of customer complaints and trip requests that are denied.\nPlan will hit pensions\nMV Transportation has assured MARTA that it will hire displaced employees at their existing wages and offer them benefits. Those employees would not, however, be eligible to continue earning a pension from MARTA, and details of the benefit plans were not immediately available.\n“Our approach is always to bring on as many employees that want to come forward because they understand the traffic, they understand the customers and they flatten out the learning curve,” said Gary Coles, senior vice president of business development for MV Transportation.\nThe contract will take effect March 19.\nAshe, MARTA’s board chairman, requested that MV Transportation provide monthly briefings on service, as well as the cost and status of the transition. If service does not improve, Ashe said he would want the MARTA board to pursue another option.\nAlso skeptical was attorney Georgia Lord, who represented patrons with disabilities in a 2001 lawsuit against MARTA that prompted a U.S. District Court judge to order various reforms. Lord told the board she is still a court monitor tasked with ensuring that MARTA complies with the consent decree.\nWarning for MARTA board\nIn September, Lord filed a motion seeking to hold MARTA in contempt for failing to provide timely service to disabled riders.\n“We want to help you bring the system into compliance,” Lord told the board prior to the vote. “I urge you to tackle the responsibility of genuinely improving compliance rather than hand off this obligation to a for-profit vendor.”\nHeather Stubbs, a visually impaired MARTA customer, attended the meeting with a Golden Retriever service dog at her side. She said that paratransit service has declined from year to year and that MARTA seems indifferent.\n“MARTA is not interested in listening to the operators and the riders, and I think it’s about time MARTA did because you are in contempt otherwise,” Stubbs warned the board.\nMARTA paratransit driver Adrienne McCauley said the board’s actions will strip away workers’ pensions and their seniority, which is taken into consideration when scheduling routes. She said there are more than 360 drivers affected by the vote.\n“A lot of us now don’t know if we need to find another job or what we’re going to do,” McCauley said.","url":"https://www.ajc.com/news/local/marta-privatize-paratransit-service/ICe06wOsoAy0s9e44oKH2I/"}
