{"authors":["Stuart Fraser For Mailonline"],"date_download":"2018-10-22 23:40:33","date_modify":"2018-10-22 23:40:33","date_publish":"2016-01-29 12:02:09","description":"STUART FRASER IN MELBOURNE: Martina Hingis won her 21st Grand Slam title as the 35-year-old Swiss claimed the Australian Open women’s doubles with Indian partner Sania Mirza.","filename":"data/vaneerConsumption/MartinaHingiswinsher21stGrandSlamtitleassheclaimsAustralianOpendoubleswithSaniaMirza.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B11F6700000578-0-image-a-5_1454067738609.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-3422626_Martina-Hingis-wins-21st-Grand-Slam-title-claims-Australian-Open-doubles-Sania-Mirza_1540251633.html","title":"Martina Hingis wins her 21st Grand Slam title as she claims Australian Open doubles with Sania Mirza","title_page":"Martina Hingis wins her 21st Grand Slam title as she claims Australian Open doubles with Sania Mirza | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Martina Hingis won her 21st Grand Slam title as the 35-year-old Swiss claimed the Australian Open women’s doubles with Indian partner Sania Mirza.\nTop seeds Hingis and Mirza claimed a remarkable 36th win in a row, beating Czech seventh seeds Andrea Hlavackova and Lucie Hradecka 7-6(1), 6-3 in one hour and 47 minutes under the roof on Rod Laver Arena.\nSince establishing a partnership in Indian Wells in March 2014, Hingis and 29-year-old Mirza have become the best team in the world with their current unbeaten run stretching back to last year’s US Open.\nMartina Hingis and Sania Mirza celebrate after their win in the women's doubles at the Australian Open\nThe women's doubles title was the 21st Grand Slam win of Hingis' career and comes 20 years after her first\nHingis said: 'It's amazing. Our fairytale continues. It's amazing since winning Wimbledon [last year]. After that we only lost two more matches. It keeps going.\n'When I saw that ball [on match point] floating, going out, I was very relieved. We kind of feel like we can dig it out. Even [if] we don't always play the best tennis, we find a way, especially in the tiebreaker. That's when it really counted.'\nFor Hingis, her latest Grand Slam title in Melbourne comes almost 20 years after her first when the then-15-year-old won the women’s doubles at Wimbledon with Czech Helena Sukova in 1996.\nHingis was suspended for two years in 2007 and quit the sport after being found to have tested positive for cocaine while competing at Wimbledon.\nHingis and Mirza celebrate after their straight sets win over Andrea Hlavackova and Lucie Hradecka\nHingis and Mirza are congratulated by Hradecka and Hlavackova after their win\nBut she returned in 2013 to play doubles and is now just a French Open away from holding all four Grand Slam women’s doubles titles at once after she and Mirza also won at Wimbledon and the US Open last year.\nHingis said: 'We're really focused. That's our strength, that we can practice together, and we make each other better, even from the start when we played our first tournaments in Indian Wells and Miami.\nMirza serves as her and Hingis waits for a return as the pair go on to win the title\nHingis and Mirza talk tactics during the final - which they went on to win in straight sets\n'I think we still have room for improvement. Our relationship also got stronger.'\nHingis has focused solely on doubles since her comeback, although she did play two singles matches last year for Switzerland in the Fed Cup tie against Poland due to an injury crisis but lost both.","url":"https://www.dailymail.co.uk/sport/tennis/article-3422626/Martina-Hingis-wins-21st-Grand-Slam-title-claims-Australian-Open-doubles-Sania-Mirza.html"}
