{"authors":[],"date_download":"2018-10-30 20:30:55","date_modify":"2018-10-30 20:30:55","date_publish":"2015-03-05 23:08:46","description":"MARTA is proceeding with a controversial plan to outsource service for disabled patrons, over the objections of the transit workers union.","filename":"data/vaneerConsumption/MARTAweighsparatransitoutsourcing.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_transportation_marta-weighs-paratransit-outsourcing__1540931455.html","title":"MARTA weighs paratransit outsourcing","title_page":"MARTA weighs paratransit outsourcing","title_rss":"NULL","source_domain":"ajc.com","text":"MARTA is proceeding with a controversial plan to outsource service for disabled patrons, over the objections of the transit workers union.\nThe MARTA board on Thursday voted to issue a request for proposals from private companies that could provide all or some of the service.\nThe transit agency provides between 1,800 to 2,300 paratransit trips per day on its MARTA Mobility service. The per-trip costs, however, are extremely high and out of line with other transit agencies, said Joe Erves, senior director of operations for MARTA.\nThe move to outsource could cost up to 300 MARTA jobs.\nMARTA officials say they aren’t providing an adequate level of service to a vulnerable population and they need to find a better way. A federal consent decree resulting from a 2001 lawsuit mandated that MARTA couldn’t have so many late or denied paratransit trips. In February, on-time performance was at just 77 percent. The agency target is 85 percent.\nMARTA admits it is failing to comply with the decree and needs to do a better job or risk winding up back in court, said Lyle Harris, spokesman for the agency.\n“We of course want to make sure that people who are doing a good job remain employed, but at this point we have to keep every option on the table,” Harris said.\nStanley Smalls, a paratransit operator and executive board member for the Amalgamated Transit Unit Local No. 732, said that the weakness of the current system is not the employees. It is buses that are too old with too many miles on them, causing breakdowns that delay trips, and eight-year-old, outdated software for the scheduling system.\n“Bringing in another company to make the service better is a slap in the face to us when we know we could do it if given the tools,” Smalls said.\nJim Callaghan, who represents the Amalgamated Transit Union national office, said the union had been in talks with MARTA since September to keep paratransit service in-house. But he called the entire process “a charade” and accused MARTA officials of having made their minds up long ago to embrace privatization.\nA previous effort to outsource paratransit services failed in the 1990s because of poor management, and the transit agency had to retake control of it.\nBetween now and the time that the request for proposals is issued, MARTA will continue to talk with the union about options for improving service, said Erves.\nMARTA officials also said that if private company proposals do not meet expectations, the transit agency may opt to keep Mobility services in-house. The board voted Thursday to keep human resources and payroll processing services in-house after a request for proposals for those services did not yield any promising bids.","url":"https://www.ajc.com/news/transportation/marta-weighs-paratransit-outsourcing/VNpOOqtZpQRJDLjcM0R38N/"}
