{"authors":[],"date_download":"2018-10-30 20:52:06","date_modify":"2018-10-30 20:52:06","date_publish":"2018-09-06 18:30:00","description":"The contract between Gwinnett County and MARTA will be contingent upon the success of a March referendum where Gwinnettians will vote on the contract and a transit-funding sales tax.","filename":"data/vaneerConsumption/MARTAapprovesGwinnettcontract.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/09/06/Videos/4477619.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_b_6ecded6c9e09bd33d0c22211544a328c__1540932726.html","title":"MARTA approves Gwinnett contract","title_page":"MARTA approves Gwinnett contract","title_rss":"NULL","source_domain":"ajc.com","text":"MARTA’s Board of Directors unanimously approved Thursday an historic contract to take over and greatly expand transit service — including the likely introduction of heavy rail — in Gwinnett County.\nThe next hurdle will be a public referendum on the matter.\n“I will just say again how excited I am … at the opportunity to help transform the region, the lives of the million-plus people who will be living in Gwinnett County over the next several decades, the opportunity to work together to come one step closer to fulfilling the dream of a truly regional system,” MARTA board chairman Robbie Ashe said just before Thursday afternoon’s vote.\nIN-DEPTH: Unique contract could be key to success of Gwinnett’s MARTA referendum\nGwinnett County’s Board of Commissioners already approved the contract with MARTA, which would go into effect only if a public vote scheduled for March succeeds. The agreement calls for a new penny sales tax that would be collected in Gwinnett until 2057, creating the potential for billions of dollars in revenue. It identifies the county’s existing transit development plan as the source of future projects.\nThe development plan recommends building a rail line from the existing Doraville MARTA station to a new hub in the Norcross area and, perhaps, later extending it all the way to the Gwinnett Place Mall area. It also recommends bus rapid transit and greatly expanded local bus service.\nGwinnett leaders delayed a vote on a referendum until next year\nThe potential contract between MARTA and Gwinnett allocates 29 percent of the penny sales tax collected in the county over the first six years toward the takeover and expansion of Gwinnett’s existing bus system. Part of those funds will also go toward maintenance and operations of the larger MARTA system.\nIt also contains a number of provisions that Gwinnett officials touted as giving them unprecedented control over how the tax money collected in the county is spent.\nFor one, it calls for returning transit tax money collected by the state directly to Gwinnett County, which can then make payments to MARTA as needed. The contract also says money collected in Gwinnett must be used “for the benefit of Gwinnett” and includes a clause preventing MARTA from borrowing money for Gwinnett projects without approval from the county commission.\n“Fixed asset capital projects” will have to be approved by the county too.\nGwinnett Commission Chairman Charlotte Nash said she was “very pleased” with the contract’s approval.\n“I am excited about what expanded transit services in Gwinnett will do for both Gwinnett and the entire region,” she said. “I very much appreciate the spirit and diligence that Chairman Ashe and MARTA staff brought to the negotiation process that led to today’s vote.”\nEverything is contingent, of course, upon Gwinnett voters approving a referendum, which is scheduled for a standalone election in March. Recent polls and surveys have shown a majority of Gwinnettians would support more transit (and paying for it), though advocates have raised concerns about the effect a standalone election could have on turnout.\nRead more in-depth coverage here.","url":"https://www.ajc.com/news/local-govt--politics/breaking-marta-board-approves-historic-gwinnett-contract/MNrrRvZCOfI16On3YTmORO/"}
