{"authors":["Kipp Jones"],"date_download":"2018-10-30 19:37:45","date_modify":"2018-10-30 19:37:45","date_publish":"2015-06-21 13:02:58","description":"The times are a-changin', even in the fictional world of superheroes. |","filename":"data/vaneerConsumption/MarvelSpiderManMustRemainWhiteandStraight.json","image_url":"https://media.breitbart.com/media/2015/06/spiderman-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_06_21__1540928265.html","title":"Marvel: Spider-Man Must Remain White and Straight","title_page":"Marvel: Spider-Man Must Remain White and Straight | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The times are a-changin’, even in the fictional world of superheroes.\nBut as our favorite comic book characters have been made over in step with the entertainment industry’s push for more diversity in film and TV, Marvel wanted to make one thing clear: don’t mess with Spider-Man.\nLeaked documents obtained during last year’s Sony hack, shared between Marvel and Sony, reveal the latter was given a strict set of guidelines regarding exactly what traits make up the iconic mutant superhero, and instructions found in a contract include a description for both race and sexual orientation.\nIn addition to ensuring Peter Parker gains his powers in his youth, Marvel guidelines stipulate he and Spider-Man are both to remain heterosexual and white.\nAccording to the Hollywood Reporter, mandatory “character traits” for both Spider-Man and Peter Parker demonstrate the more than 50-year-old Marvel Comics character is to remain a morally uncorrupted individual, who is “not a homosexual.”\nSpider-Man, Parker’s alter ego, does not torture or kill “unless in defense of self or others,” and doesn’t smoke or abuse alcohol, sell drugs, or have sex before the age of 16 or with anyone below that age, in addition to being heterosexual.\nMeanwhile, Parker’s full name, race and sexual orientation are defined to be Peter Benjamin Parker, who is Caucasian and straight.\nPer the Hollywood Reporter, the focus of the guidelines were help plan 2012’s The Amazing Spider-Man reboot, and were set in 2011 as an attempt to secure the idea of Spider-Man as a superhero, and were not created through any social agenda.\nE! News reports a contract between the two companies went into effect shortly after a black-latino Spider-Man was introduced in the comic book world.\nMarvel has generally kept its film characters as close to their comic inspiration as possible, but the company was criticized in May for announcing it might cast white actress Tilda Swinton as the 500-year-old Tibetan sorcerer the Ancient One for the upcoming film Doctor Strange.\nIn traditional Marvel story-lines, the Ancient One is a male farmer of Asian descent.","url":"https://www.breitbart.com/entertainment/2015/06/21/marvel-spider-man-cant-be-gay-or-a-minority/"}
