{"authors":["Associated Press"],"date_download":"2018-10-22 23:07:33","date_modify":"2018-10-22 23:07:33","date_publish":"2017-03-16 05:44:15","description":"The President's revised travel ban was dealt another legal setback Thursday when federal judge Theodore Chuang in Maryland rejected the the prohibition against six Muslim majority countries.","filename":"data/vaneerConsumption/MarylandfederaljudgerulesagainsttheTrumptravelban.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E5574CF00000578-0-image-a-22_1489680244619.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318970_Trump-suffers-second-defeat-revised-travel-ban-hold_1540249653.html","title":"Maryland federal judge rules against the Trump travel ban","title_page":"Maryland federal judge rules against the Trump travel ban | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"President Donald Trump's revised travel ban was dealt another legal setback Thursday when a federal judge in Maryland rejected the prohibition against six predominantly Muslim countries.\nThe ruling near the nation's capital was the latest blow to Trump's ban, with a federal judge in Hawaii rejecting the measure on Wednesday. Both judges cited Trump's own words as evidence of his intent in issuing the new plan.\nU.S. Judge Theodore Chuang ruled Thursday in Greenbelt, Maryland, in a case brought by the American Civil Liberties Union and other groups representing immigrants, refugees and their families.\nThe groups argued that the underlying rationale of the ban was to discriminate against Muslims, making it unconstitutional.\nSCROLL DOWN FOR VIDEO\nAnti-Trump rulings: US District Court Judge Theodore Chuang (left) became the second to rule against the ban on Thursday morning in Maryland - following US District Court Judge Derrick Watson (right) in Honolulu on Wednesday\nFury: President Trump told the rally in Nashville, Tennessee that he would not accept the 'unprecedented overreach' of US District Jude Derrick K. Watson in Hawaii\nChuang, who was appointed by then-President Barack Obama, called Trump's own statements about intentions to impose a Muslim ban 'highly relevant.'\nTrump's second executive order does include changes from the first order, Chuang noted, such as the removal of a preference for religious minorities in the refugee process.\n'Despite these changes, the history of public statements continues to provide a convincing case that the purpose of the Second Executive Order remains the realization of the long-envisioned Muslim ban,' he said.\nOn Wednesday, U.S. District Judge Derrick Watson in Honolulu criticized what he called the 'illogic' of the government's arguments and cited 'significant and unrebutted evidence of religious animus' behind the travel ban.\nHe also noted that while courts should not examine the 'veiled psyche' and 'secret motives' of government decision-makers, 'the remarkable facts at issue here require no such impermissible inquiry.'\nWatson also wrote, referring to a statement Trump issued as a candidate, 'For instance, there is nothing 'veiled' about this press release: 'Donald J. Trump is calling for a total and complete shutdown of Muslims entering the United States.''\nChuang granted a preliminary injunction on a nationwide basis.\nHe declined to issue an injunction blocking the entire executive order, saying that the plaintiffs didn't sufficiently develop their argument that the temporary ban on refugees offends the establishment clause and didn't provide sufficient basis to establish the invalidity of the rest of the order.\nDetails of the implementation of the orders also indicate that national security isn't the primary purpose of the ban, Chuang said.\n'The fact that the White House took the highly irregular step of first introducing the travel ban without receiving the input and judgment of the relevant national security agencies strongly suggests that the religious purpose was primary and the national security purpose, even if legitimate, is a secondary, post hoc rationale,' he said.\n'The Maryland court saw through the government's legal maneuvering and recognized the new order for what it was: a Muslim ban,' said Lee Gelernt, deputy director of the ACLU's national Immigrants' Rights Project and one of the attorneys on the case.\n'And importantly, he issued a preliminary injunction, not just a [temporary restraining order], so the injunction will remain in place through trial, and not just for a couple of weeks.'\nTrump called the ruling in Hawaii an example of 'unprecedented judicial overreach' and said his administration would appeal it to the U.S. Supreme Court.\nHe also called his new travel ban a watered-down version of the first one, which he said he wished he could implement.\n'We're going to win. We're going to keep our citizens safe,' the president said at a rally in Nashville, Tennessee, on Wednesday. 'The danger is clear. The law is clear. The need for my executive order is clear.'\nInitially banned: In its first iteration all Iraqi refugees were not allowed in - includin g Nadia Hanan Madalo, center her mother, Alyshooa Kannah, second from right, and other family members. They fled Batnaya, Iraq, after ISIS invaded and reached El Cajon, California, on Thursday\nGovernment lawyers argued that the ban was substantially revised from an earlier version signed in January that was later blocked by a federal judge in Washington state. They said the ban was ordered in the interest of national security to protect the U.S. from 'radical Islamic terrorism.'\n'Unless and until the president realizes that this is a battle in which he's going to keep losing and decides to do the right thing and abandon this course, for as long as he's on it we'll keep litigating it and I think we're going to keep winning,' said Omar Jadwat, who argued the case for the ACLU in Maryland.\nThe Justice Department public-affairs office did not immediately return a message. The case was argued Wednesday by acting U.S. Solicitor General Jeffrey Wall.\nIf the administration seeks an emergency stay of Watson's decision at the 9th U.S. Circuit Court of Appeals Circuit, the matter would be heard by different judges from the three who ruled on the case last month. That's because the panel of judges assigned to such cases rotates every month, said court spokesman David Madden.\nThe 9th Circuit on Wednesday declined to reconsider the 3-0 decision not to reinstate the original ban. In a dissent, five judges said they considered that decision incorrect and wanted it vacated.\n'Whatever we, as individuals, may feel about the president or the executive order, the president's decision was well within the powers of the presidency,' Judge Jay Bybee wrote for the five.\nWatson issued his 43-page ruling less than two hours after hearing Hawaii's request for a temporary restraining order to stop the ban from being put into practice.\nThe hearings in Maryland and Hawaitt were two of three held Wednesday in federal courts around the country. U.S. District Judge James Robart in Seattle, who blocked the initial travel ban last month, did not immediately rule on a request from an immigrant-rights group to block the revised version.\nIn all, more than half a dozen states are trying to stop the ban.","url":"https://www.dailymail.co.uk/news/article-4318970/Trump-suffers-second-defeat-revised-travel-ban-hold.html"}
