{"authors":["Stephanie Downs"],"date_download":"2018-10-31 01:47:46","date_modify":"2018-10-31 01:47:46","date_publish":"2018-08-27 17:42:06","description":"You know what they say, it really does take two. And no one knows that fact better than Mary-Kate and Ashley Olsen. In a rare joint interview featuring the former actors, Mary-Kate and Ashley Olsen discussed their close relationship and how they do…","filename":"data/vaneerConsumption/MaryKateAshleyOlsenTalkedAboutTheirCloseBondInARareNewInterview.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/8/27/9d57197c-b7f5-4339-a5b1-206ebddb3773-getty-967453348.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_mary-kate-ashley-olsen-talked-about-their-close-bond-in-a-rare-new-interview-10246805_1540950466.html","title":"Mary-Kate & Ashley Olsen Talked About Their Close Bond In A Rare, New Interview","title_page":"Mary-Kate & Ashley Olsen Talked About Their Close Bond In A Rare, New Interview","title_rss":"NULL","source_domain":"bustle.com","text":"You know what they say, it really does take two. And no one knows that fact better than Mary-Kate and Ashley Olsen. In a rare joint interview featuring the former actors, Mary-Kate and Ashley Olsen discussed their close relationship and how they do \"everything together,\" as People reported. Basically, the sisters' bond is as close as ever.\nThe Olsens sat down with WSJ Magazine to discuss the launch of a menswear line for their fashion brand, The Row. But fashion wasn't the only hot topic they discussed. In the interview, which was published on Aug. 27, the Olsen twins conveyed just how close they are. \"We do everything together,\" Ashley said, with Mary-Kate also offering, \"We came out of the womb doing that.\"\nThe fashionistas also offered up an interesting description of their relationship, as they said it was akin to \"a marriage and a partnership.\" Of course, they've had their fair share of sisterly disagreements, but they've managed to figure out how to best communicate with one another. Ashley revealed, \"It’s been 32 years of learning how to communicate.” It shouldn't exactly surprise anyone to see that the child stars are closer than ever. After all, they really have been working together for basically their entire lives.\nDimitrios Kambouris/Getty Images Entertainment/Getty Images\nBefore they launched their successful fashion business, Mary-Kate and Ashley got their start on a pretty well-known TV series, and you know, starred in every popular movie from your childhood. The twins first appeared on Full House way back in 1987 (where they both portrayed Michelle Tanner), when they were only around 1 year old. The show helped jumpstart their careers, as they went on to star in a slew of fun movies, from New York Minute to Passport to Paris.\nDespite leaving their acting careers behind, the twins have still maintained a close working relationship. They did say that they do everything together, after all. As previously mentioned, the Olsens have since transitioned into the fashion realm, with their brands, The Row and Elizabeth and James.\nWhile the the former actors have shied away from the spotlight recently, their joint interview with WSJ Magazine was a rare case of them opening up, they have discussed their bond in the past. They've particularly discussed their relationship as it pertains to their growing fashion businesses. In an interview with Women's Wear Daily from February 2016, they described their Elizabeth and James line, which had recently launched themselves.\nMichael Loccisano/Getty Images Entertainment/Getty Images\nNaturally, they also discussed just how hard they work as it concerns their businesses. Mary-Kate told the publication, \"We’ve always worked around the clock. We’ve been working since we were nine months old.\" They also told WWD that they work in \"tandem\" and that they discuss every major decision together, which, isn't exactly shocking considering how close their bond is, inside and outside the office.\nSo just in case you were wondering what everyone's childhood idols, Mary-Kate and Ashley, were up to, wonder no longer. The famous twins are busy with their successful fashion business, where they're doing everything together.","url":"https://www.bustle.com/p/mary-kate-ashley-olsen-talked-about-their-close-bond-in-a-rare-new-interview-10246805"}
