{"authors":[],"date_download":"2018-10-22 21:16:40","date_modify":"2018-10-22 21:16:40","date_publish":"2014-05-06 17:14:07","description":"The second winner of the $414 million Mega Millions jackpot from March has come forward, Maryland Lottery officials announced on Tuesday.","filename":"data/vaneerConsumption/MarylandMegaMillionsWinnerClaimsPrize.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_maryland-mega-millions-winner-claims-prize-n98351_1540243000.html","title":"Maryland Mega Millions Winner Claims Prize","title_page":"Maryland Mega Millions Winner Claims Prize","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThat’s enough money to start your own D.C. lobbying firm.\nThe second winner of the $414 million Mega Millions jackpot from March has come forward to collect the money, Maryland Lottery officials announced on Tuesday.\nUnlike some other states, in Maryland a lottery winner can choose to remain anonymous. The winner quietly claimed the prize last week, the officials said. A Florida couple came forward to claim their half of the same March 18 jackpot last week, as well.\nThe Maryland winner chose the cash option and will receive $76.4 million after taxes, state lottery officials said.\n“You have to play to win,” the Marylander said, according to lottery officials. “You have to play your lucky numbers.”\nThe state will receive more than $10.1 million in tax revenue, and Lady's Liquors in La Plata, the store where the winning ticket was sold, will receive a $100,000 agent bonus.\n“We are pleased that Maryland, once again, was home to a Mega Millions jackpot winner,” said Stephen Martino, director of the Maryland Lottery and Gaming Control Agency. “Everyone benefits when a winning jackpot ticket is sold in Maryland. This jackpot win gave the state of Maryland some welcome and unanticipated tax revenue.\"\nLady’s Liquors store owner Jay Jhala previously told NBC Washington that he didn’t know the winner, but was excited.\n\"This is a first ever,'' he said. The store has sold winning tickets before, \"but never this big.''\n— Hasani Gittens","url":"https://www.nbcnews.com/news/us-news/maryland-mega-millions-winner-claims-prize-n98351"}
