{"authors":["Julie Alvin"],"date_download":"2018-10-30 23:54:57","date_modify":"2018-10-30 23:54:57","date_publish":"2014-08-12 21:51:45","description":"If your mathematical skills extend to figuring out how much your equity stake in your startup could net you or which mode of transportation is the most cost-efficient for getting you to the nearest beach, you might not know or care to know much…","filename":"data/vaneerConsumption/MaryamMirzakhaniWinstheFieldsMedalandIstheFirstWomanToDoSoBooya.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/8/0ac03e25-3628-4d72-8fda-8f24b505c6e5-getty-524061462.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35519-maryam-mirzakhani-wins-the-fields-medal-and-is-the-first-woman-to-do-so-booya_1540943697.html","title":"Maryam Mirzakhani Wins the Fields Medal and Is the First Woman To Do So, Booya","title_page":"Maryam Mirzakhani Wins the Fields Medal and Is the First Woman To Do So, Booya","title_rss":"NULL","source_domain":"bustle.com","text":"If your mathematical skills extend to figuring out how much your equity stake in your startup could net you or which mode of transportation is the most cost-efficient for getting you to the nearest beach, you might not know or care to know much about the 2014 Fields Medal winners. The \"mathematician's Nobel Prize\" is granted once every four years to between two and four individuals under the age of 40, and it recognizes \"outstanding mathematical achievement for existing work and for the promise of future achievement.\" Of the 56 people who have been deemed worthy by the International Mathematical Union (IMU) since the award was first handed out in 1936, none of them have been women...until now. Can I get a booya?\nLike a boss, Stanford Professor Maryam Mirzakhani was honored alongside three (male) peers at Tuesday's IMU congress in Seoul.\nWhile I would love to paraphrase for you what strides the Iranian-born Mirzakhani has made in her field, I have no idea what these words actually mean (shut up, I took college-level calculus at 16, this is not a \"women are scared of math\" thing) so I will rely on Business Insider's words here:\nMaryam Mirzakhani's work focuses on the geometry of Riemann surfaces. Riemann surfaces are a classic type of non-Euclidean geometry: while a Riemann surface still has two dimensions like a plane, and we can still define lines, angles, and curves on the surface, the way that the measurement of angles and distances will come out can be very different from what happens on a normal Euclidean plane.\nOh! Now I see. For those of us who aren't well-versed in non-Euclidean geometry (amateurs!) the feature that Quanta magazine published on Mirzakhani today quotes the mathematician as describing her pursuits in a more accessible way, saying math research feels like writing a novel. “There are different characters, and you are getting to know them better,” she said in the piece. “Things evolve, and then you look back at a character, and it’s completely different from your first impression.”\nWhile we can celebrate Mirzakhani's win, I can't help but wonder why it took so freaking long to get here. The number of women in STEM fields is still pitifully low, and, while efforts are being made to encourage our interest in science, math, technology, and engineering, female interest in typically male-dominated pursuits is often discouraged by society. This Verizon campaign (I know, I'm a sucker) dramatizes the pernicious influence subtle gender norms can have on the things we find interest in and gravitate towards, academically and then professionally.\nVerizon Wireless on YouTube\n66 percent of fourth grade girls say they like science and math, but only 18 percent of all college engineering majors are female. I wonder if anyone ever told Mirzakhani not to get her dress dirty when she was out pursuing her passions.\nIf you're looking to gain some more Fields Medal fluency, here's Scientific American's guide to talking about the award at a cocktail party. If you are looking for a playful video to get you through the last few minutes of the work day, here's a video of Mirzakhani instructing on dynamics on the moduli spaces of curves (wut).","url":"https://www.bustle.com/articles/35519-maryam-mirzakhani-wins-the-fields-medal-and-is-the-first-woman-to-do-so-booya"}
