{"authors":[],"date_download":"2018-10-30 14:21:34","date_modify":"2018-10-30 14:21:34","date_publish":"2017-01-26 00:00:00","description":null,"filename":"data/vaneerConsumption/MaryTylerMooreRIP.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_01_mary_tyler_moore_rip_1540909294.html","title":"Mary Tyler Moore: RIP","title_page":"Mary Tyler Moore: RIP","title_rss":"NULL","source_domain":"americanthinker.com","text":"Mary Tyler Moore: RIP\nMary Tyler Moore died yesterday, reminding me that time passes far too quickly. Regardless of her politics (she was an old-school Hollywood liberal), I have always admired those who strove for excellence in their work, and Moore certainly qualified. She was arguably the greatest comedic straight lady in the history of television. Moore got her start in the medium dancing in commercials. (Dance was her first love, and she was quite good at it.) She appeared as Sam, private eye Richard Diamond's receptionist/secretary, although all that you saw of her onscreen were her terrific legs. She became a household name after Carl Reiner cast her to star as comedy writer Rob Petrie's wife on The Dick Van Dyke Show.\nThe role of Laura Petrie showcased Moore's skill as an actress. She was eleven years younger than her leading man, but she brought a maturity to the role that made her believable and enhanced her youthful sexiness (she was 24 when the show debuted). She made Laura an interesting, multi-dimensional character: guileless but smart and capable; talented in her own right, yet content with her role as stay-at-home wife and mother. Sociable, witty, and self-assured, Laura was as comfortable at a Manhattan cocktail party as she was at a New Rochelle PTA meeting. In his memoir, Van Dyke paid his own tribute to Moore's acting ability. He noted that while she was not a natural comedian, she was intelligent and hardworking, and she learned quickly how to be funny. High praise indeed. After The Dick Van Dyke Show went off the air, Moore appeared in a few forgettable movies. Then, in 1969, she and Van Dyke teamed for a TV comedy special that drew high ratings and rave reviews. Impressed, CBS executives offered her a sitcom of her own. The new show (titled simply Mary Tyler Moore) was groundbreaking for two reasons: one, the vulnerability of its characters (which would influence the writers and actors on M*A*S*H soon afterward), and two, it featured television's first feminist lead character. (That Girl's Marlo Thomas may have been an ardent feminist off-camera, but her character was much more dependent on the men in her life.) Moore's Mary Richards had ended her engagement and left her hometown to seek fulfillment in the Twin Cities. Mary was no misandrist; she had boyfriends, and the show dropped some subtle hints that she was sexually active. But she was happy being single with a life centered on her career and her friends. Most important, the show was genuinely funny. It became the most beloved sitcom of its time; even today, it is among the best ever. After the tour de force of her eponymous show, Moore turned her attention to dramatic roles. She secured an Emmy nomination as breast cancer survivor Betty Rollin in First You Cry. She then tackled the role of the mother in Robert Redford's film Ordinary People. Many may have been surprised at the sight of sweet Laura Petrie/Mary Richards as the cold, angry Beth Jarrett, but Moore pulled it off, earning an Academy Award nomination for Best Actress. She also appeared on Broadway as the bitter quadriplegic in Whose Life Is It, Anyway? Moore endured her share of tragedies in her personal life, including battling diabetes throughout her adulthood and the death of her only child from a self-inflicted gunshot wound. Whatever heartache she endured, she is now at peace, and she deserves one last round of applause.","url":"https://www.americanthinker.com/blog/2017/01/mary_tyler_moore_rip.html"}
