{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:57:05","date_modify":"2018-10-30 19:57:05","date_publish":"2016-02-13 17:52:23","description":"A Harford County deputy was shot and killed inside a Maryland Panera Bread on February 10, despite the fact that the eatery is a gun-free zone.","filename":"data/vaneerConsumption/MarylandDeputyShotandKilledinGunFreePaneraBread.json","image_url":"https://media.breitbart.com/media/2016/02/Panera-Bread-and-high-rises-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_13__1540929425.html","title":"Maryland Deputy Shot and Killed in Gun-Free Panera Bread","title_page":"Maryland Deputy Shot and Killed in Gun-Free Panera Bread | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Harford County sheriff’s deputy was shot and killed inside an Abingdon, Maryland, Panera Bread restaurant on February 10, despite the fact that the Panera Bread is a gun-free zone.\nBreitbart News reported in September that Panera Bread joined Sonic, Chipotle, and Jack in the Box in asking that law-abiding citizens disarm themselves before entering the business. That same day, The Huffington Post published a statement from Panera, clearly instituting the ban:\nWithin our company, we strive to create Panera Warmth. This warmth means bakery-cafes where customers and associates feel comfortable and welcome. To this end, we ask that guns not be brought into this environment unless carried by an authorized law enforcement officer. Panera respects the rights of gun owners, but asks our customers to help preserve the environment we are working to create for our guests and associates.\nMichael Bloomberg-funded Everytown for Gun Safety tweeted in celebration of the gun ban, exclaiming, “Panera Bread asks customers not to bring guns into its restaurants!”\nIt was in this gun-free zone that a Harford County deputy was shot and killed on Wednesday. A second deputy was then shot and killed in a related shootout at a secondary location.\nJust as in the cases of the gun-free zones at Virginia Tech University, Fort Hood, the Aurora movie theater, Sandy Hook Elementary School, the DC Navy Yard, the Lafayette Grand Theatre, the Chattanooga military offices, Umpqua Community College, and many other locations where tragedies occurred, the gun-free zone at Panera Bread only disarms law-abiding citizens.\nAWR Hawkins is the Second Amendment columnist for Breitbart News and political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2016/02/13/business-in-which-maryland-deputy-was-shot-killed-is-gun-free-zone/"}
