{"authors":["Abc News"],"date_download":"2018-10-30 00:55:21","date_modify":"2018-10-30 00:55:21","date_publish":"2018-10-29 08:06:24","description":"Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.","filename":"data/vaneerConsumption/MarylandregentsmeetwithDJDurkinWallaceLohDamonEvans.json","image_url":"http://media.video-cdn.espn.com/motion/2018/1029/dm_181029_kershaw_machado_future/dm_181029_kershaw_machado_future_default.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/Sports_maryland-regents-meet-dj-durkin-wallace-loh-damon_story_id=58823632_1540860921.html","title":"Maryland regents meet with DJ Durkin, Wallace Loh, Damon Evans","title_page":"Maryland regents meet with DJ Durkin, Wallace Loh, Damon Evans - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"BALTIMORE, Md. -- The University System of Maryland Board of Regents met Friday at its headquarters to again discuss the investigation into Maryland's program, and the closed session gave three embattled leaders from the College Park campus an opportunity to face 13 of the 17 board members in person before personnel decisions are made about their futures.\nUniversity of Maryland president Wallace D. Loh, athletic director Damon Evans and coach DJ Durkin each met separately with the USM board of regents, but no decisions about their job status were announced after the five-hour meeting.\nThe regents have been deliberating the findings of two separate investigations into the program. The first focused on the circumstances surrounding the June 13 death of 19-year-old offensive lineman Jordan McNair from heatstroke. The second was a two-month-long investigation into the overall culture of the program under Durkin, who was placed on administrative leave Aug. 11, a day after an ESPN report detailed allegations of a culture based on fear and intimidation within Maryland football.\nOn Sept. 21, the board released the Walters report, which found Maryland athletic trainers failed to properly diagnose and treat the heatstroke symptoms McNair suffered at a May 29 team workout that eventually led to his death. On Oct. 19, the board received a 192-page report that still hasn't been released to the public, but details \"a culture where problems festered because too many players feared speaking out,\" according to a copy obtained by ESPN on Thursday.\nDurkin, who met with the board of regents for an hour, walked briskly out of the downtown building without responding to a reporter's question about his job status. Evans, when asked by ESPN about his job status, said, \"We just have to wait to see what happens.\" Evans, who met with the regents right before Durkin, declined further comment. A USM spokesperson confirmed Loh also met with the board on Friday, but he was unavailable for comment.\nIn an Oct. 17 letter to the USM board of regents, eight Maryland state legislators voiced their support for Loh to continue as president.\n\"We're concerned that some in the media who care more about athletics than academics are suggesting that the University's academic leader, Dr. Wallace Loh, should be made the scapegoat,\" the letter stated. \"Few mistakes could do more damage to our state's future. Dr. Loh has led the University to ever-higher academic achievement and contributions to the economic development of Maryland through creation and dissemination of knowledge. The University is a land grant school, so these are its core missions. We urge you to fix what's broken, not break what's working.\"\nBilly Murphy, an attorney for the parents of McNair, had a letter hand-delivered to board of regents chairman James T. Brady on Friday that stated the McNair family \"was shocked\" to read reports Thursday that the board wants Loh to step down in the spring of 2019.\n\"Dr. Loh has publicly accepted legal and moral responsibility for the events which led to Jordan's death, something you were unwilling to do in your Sept. 21 press conference releasing the Walters report,\" the letter read. \"Today, you and the Board of Regents continue to evade responsibility for the death of Jordan McNair, a clear abdication of moral responsibility and leadership. It is obvious that you are punishing Dr. Loh for taking legal and moral responsibility, and for other reasons completely unrelated to Jordan McNair.\"\nMurphy cited Brady's previous disagreement with Loh over the renaming of Byrd Stadium, writing that Brady \"fought publicly to retain the name of an ardent segregationist [Harry \"Curley\" Byrd] on a stadium where African American athletes play. But that is no reason to fire Dr. Loh.\"\nThe USM released a statement in response while the board was still meeting.\n\"The serious issues under discussion are solely related to those highlighted by both the Walters and commission reports,\" the statement said. \"Any suggestion or attempt to inject other, unrelated issues, is a disservice to the many talented and honest people involved in these investigations, including Chair Brady and every member of the Board of Regents. Every investigator, commission member and regent has been, and continues to be, determined to serve the university, the university system and the state of Maryland responsibly and transparently by uncovering and responding to issues related to Terps athletics and football.\"\nFriday marked the third time the regents have discussed the long-awaited report, which was initiated by Loh in August. The board also met on Tuesday, when it was joined in person by five members of the eight-person commission tasked with investigating the culture of the program. The three other commission members were on the phone that day. The board also had a teleconference Thursday to discuss the report.","url":"https://abcnews.go.com/Sports/maryland-regents-meet-dj-durkin-wallace-loh-damon/story?id=58823632"}
