{"authors":[],"date_download":"2018-10-22 20:43:55","date_modify":"2018-10-22 20:43:55","date_publish":"2016-01-29 03:15:25","description":"The New Zealand cricket team are to lose their third bowling coach in five years with Dimitri Mascarenhas announcing Friday he will step down following next ...","filename":"data/vaneerConsumption/MascarenhastoquitasNewZealandbowlingcoach.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h6ou-2vdWmEltwXfba0ce28e632f7ceda-649_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422138_Mascarenhas-quit-New-Zealand-bowling-coach_1540241035.html","title":"Mascarenhas to quit as New Zealand bowling coach","title_page":"Mascarenhas to quit as New Zealand bowling coach | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mascarenhas to quit as New Zealand bowling coach\nThe New Zealand cricket team are to lose their third bowling coach in five years with Dimitri Mascarenhas announcing Friday he will step down following next month's tour by Australia.\nThe former England international, who took over the coaching position less than a year ago, said he was stepping down to spend more time with his family.\nThe 38-year-old follows former Black Cap Shane Bond and South Africa's Allan Donald, who have also filled the role since early 2011.\nDimitri Mascarenhas, who took over the coaching position in New Zealand less than a year ago, said he was stepping down to spend more time with his family ©Prakash Singh (AFP/File)\nIn that time they have developed a bowling stable spearheaded by Trent Boult and Tim Southee, both top-10 Test bowlers, with Boult also the top-ranked ODI bowler.\n\"At first I thought I could balance the responsibilities but I no longer think that's feasible. I need to be closer to my family,\" Mascarenhas said when announcing his resignation.\n\"I had an amazing time with the team. It's probably been the best time I've had in cricket, either as a player or as a coach.\"\nHead coach Mike Hesson said he was sorry to be losing the Englishman.\n\"While obviously disappointed, we understand that family comes first and the demands of the international calendar are not always compatible with that,\" he said.\n\"We look forward to having Dimi with us through to the end of the Australian series and wish him well in the future.\"","url":"https://www.dailymail.co.uk/wires/afp/article-3422138/Mascarenhas-quit-New-Zealand-bowling-coach.html"}
