{"authors":["Matthew Debord"],"date_download":"2018-10-30 23:53:25","date_modify":"2018-10-30 23:53:25","date_publish":"2016-12-05 00:00:00","description":"It would be hard to overestimate the importance of the Levante SUV for Maserati.","filename":"data/vaneerConsumption/MaseratiLevanteSUVagainFIRSTDRIVE.json","image_url":"https://amp.businessinsider.com/images/57ffecdf52dd73a2088b4b7c-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_maserati-levante-suv-again-first-drive-2016-12_1540943605.html","title":"Maserati Levante SUV again: FIRST DRIVE","title_page":"    Maserati Levante SUV again: FIRST DRIVE - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Oooo, yes. Matthew DeBord/BI It would be hard to overestimate the importance of the Levante SUV for Maserati. The brand came back to the US over a decade and and half ago, but since the financial crisis and amid an SUV boom, it's been selling only stylish luxury sedans and sexy GT sports car.\nThat will all now change, and it couldn't happen at a more important time for the Italian automaker, part of the Fiat Chrysler Automobiles empire. It's down at the bottom of the luxury sales hierarchy in the US, with a puny 0.1% overall market share (Porsche sells five times as many vehicles annually).\nThe Quattroporte and Ghibli sedans have their fans (me, for example). But in the US and increasingly China, you really need a strong crossover offering. Porsche established the template for an automaker that had never built an SUV crossing that river in the early 2000s when it created the Cayenne, a hugely successful vehicle.\nNow Maserati has taken the same plunge.\nWe first saw the Levante when it was revealed at the 2016 Geneva Motor Show and later in the flesh at the New York auto show. Now we've actually spent some time behind the wheel. It was a relatively brief, two-hour run from a working farm and restaurant, Blue Hill at Stone Barns, about an hour north of New York to Bear Mountain, under pleasant Northeastern skies.\nThis wasn't enough time to fully evaluate the vehicle — we'll get a crack at that later — but we formed some early impressions. And those impressions were good.\nRead on:","url":"https://www.businessinsider.com/maserati-levante-suv-again-first-drive-2016-12"}
