{"authors":["Alex Matthews For Mailonline"],"date_download":"2018-10-23 01:52:07","date_modify":"2018-10-23 01:52:07","date_publish":"2016-01-28 16:18:22","description":"Samy Mohamed Hamzeh, 23, from Milwaukee, was charged with possession of two machine guns and a silencer after it was revealed that he wanted to kill 30 people at a temple in Wisconsin.","filename":"data/vaneerConsumption/MasonsstunnedatclaimMuslimaccusedofplottingtoshootupaMasoniccenter.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/30AC489600000578-0-image-a-57_1453997887592.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421114_We-hardly-plan-pancake-breakfast-Masons-stunned-claim-muslim-accused-plotting-shoot-Masonic-center-thought-group-playing-world-like-game_1540259527.html","title":"Masons stunned at claim Muslim accused of plotting to shoot up a Masonic center","title_page":"Masons stunned at claim Muslim accused of plotting to shoot up a Masonic center | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A group of Masons were left stunned after a Muslim man plotted a mass shooting at their center because he thought the fraternal network was 'playing the world like a game'.\nSamy Mohamed Hamzeh, 23, from Milwaukee, was charged with possession of two machine guns and a silencer after it was revealed that he wanted to kill 30 people at a temple in Wisconsin.\nA member of the organization, which is not a religion, said he was shocked at the terror plan and said the Masons were not at 'the root of some of the world's problems.'\nSamy Mohamed Hamzeh, 23, was arrested after buying machine guns and a silencer from two undercover FBI agents. He planned to carry out a mass shooting at a Masonic temple in Wisconsin, Milwaukee\nGavin DeGrave, who is a secretary for the Valley of Milwaukee, which includes four Masonic chapters, said: 'We can hardly plan a pancake breakfast.'\nHamzeh was arrested after he bought the weapons from undercover FBI agents and is being held in the Kenosha County jail.\nHe hasn't been asked to enter a plea, but during his court appearance on Tuesday, he told U.S. Magistrate Judge David Jones that he did not agree with the charged filed against him.\nIn the recording posted by the Journal Sentinel, when Hamzeh was asked whether he understood he was facing decades behind bars if convicted, he replied, 'Yes I understand, but this is not true, sir.'\nFriends and co-workers have since expressed their disbelief that he could ever pull off such a plan.\nRami Safi, 24, said he had never known his former friend to express extremist views and explained the pair used to enjoy going to bars, playing video games and smoking Hookah (similar to shisha) together.\nThey also worked at the same gas station and lived together for a few months in 2013.\nMr Safi, told Yahoo News: 'He was a fun guy, he never talked about anything like that.'\nHamzeh had also worked at a kick-boxing center in Milwaukee called 9Round, but was fired earlier this month.\nOwner Delia Luna said: 'He was on the intense side and did not interact well. It's crazy.'\nAnother ex-colleague called J.J said he could not believe Hamzeh had the motivation or focus to execute his plot.\nThe man, who would not give his second name, had been questioned by FBI agents about Hamzeh and described him as a 'non-religious young man'.\nHe said' That plan was way, way bigger than him.'\nHamzeh did not work alone and had joined forces with two others, who turned out to be FBI sources, to help execute his mission.\nHe went with them to a gun range where he practiced shooting and later they scouted a temple.\nDuring the shooting one of the group was going to be stationed at the entrance to the building while the other two swept through firing at the crowd, according to Fox News.\nFormer co-workers have expressed their disbelief that Hamzeh, pictured, could be capable of such a plan\nHamzeh told the sources that his attack would be 'known the world over'.\nAccording to transcripts published by the US Department of Justice, Hamzeh said: 'As long as the one on the door understands he has bigger responsibility than the others.\n'For your information, he has to take care of everyone around him, the comers and the one that wants to go, he has to annihilate everyone, there is no one left, I mean when we go into a room, we will be killing everyone, that's it, this is our duty, as for the one at the door, he must have 20/20 eye vision and always alert for all the traffic around him.'\n'We are Muslims, defending Muslim religion, we are on our own, my dear, we have organized our own group.\n'We have our own group, not with Hamas, not with my a*s, we are here defending Islam, young people together join to defend Islam, that's it, that is what our intention is.'\nHamzeh also said killing 30 people would be 'excellent'.\nHe said: 'If I got out, after killing thirty people, I will be happy 100 per cent. Because these 30 will terrify the world.\n'I am telling you, if this hit is executed, it will be known all over the world. Sure, all over the world, all the Mujahedeen will be talking and they will be proud of us.'","url":"https://www.dailymail.co.uk/news/article-3421114/We-hardly-plan-pancake-breakfast-Masons-stunned-claim-muslim-accused-plotting-shoot-Masonic-center-thought-group-playing-world-like-game.html"}
