{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:55:27","date_modify":"2018-10-30 20:55:27","date_publish":"2015-11-05 16:33:00","description":"Merced Couty Sheriff Vern Warnke has identified the University of California Merced attacker who wounded four in a mass stabbing spree as 18-year-old Faisal Mohammad.","filename":"data/vaneerConsumption/MassStabberatUCMercedwasFaisalMohammad.json","image_url":"https://media.breitbart.com/media/2015/11/ap_ap-photo304-wi.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_11_05__1540932927.html","title":"Mass Stabber at UC Merced was 'Faisal Mohammad'","title_page":"Mass Stabber at UC Merced was 'Faisal Mohammad' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Merced Couty Sheriff Vern Warnke has identified the University of California Merced attacker who wounded four in a mass stabbing spree as 18-year-old Faisal Mohammad.\nHe was a freshman from Santa Clara.\nBreitbart News previously reported the stabbings at UC Merced, which occurred around 8 a.m. on Wednesday. Police shot and killed Mohammad after the stabbings.\nAccording to the Merced Sun-Star, Warnke identified Mohammad as the attacker and said the motive for the attack was “still unclear.”\nThere is an ongoing spate of mass stabbing attacks in Israel, where Palestinian Muslims have been encouraged by political and religious leaders to stab civilians. It was not clear whether there was any connection between the UC Merced attack and those attacks. Police intend to release more details at a press conference later in the day.\nUC Mercred tweeted that five persons were wounded in the mass stabbing shortly after the attack took place, but Warnke indicated the actual number of wounded was four. And he explained that those four included “two students, a female student advisor and a construction worker who was on campus for a remodeling project.”\nWarnke says the FBI is involved in the investigation, particularly as it relates to ascertaining a motive.\nAt this point investigators believe “Mohammad entered a second-floor classroom as class was starting Wednesday and struggled with a male student, who was stabbed. The construction worker–31-year-old Byron Price–“heard the commotion and went to intervene.” Warnke stressed that apart from Price’s intervention, the first stabbing victim might be dead.\nMohammad turned his attention to Price, “[slashing] him around the waist during the confrontation.” Mohammad is believed to have fled the building thereafter, stabbing another male student and a female student advisor outside.\nMohammad was chased onto a bridge by two university police officers, where he was shot and killed. The identity of the officers has not been released, nor have the identities of any of the victims other than Price.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/local/2015/11/05/mass-stabber-uc-merced-faisal-mohammad/"}
