{"authors":["Associated Press"],"date_download":"2018-10-23 04:09:27","date_modify":"2018-10-23 04:09:27","date_publish":"2016-01-28 20:03:21","description":"STOCKHOLM (AP) — Dazzled by an unprecedented wave of migration, Sweden on Thursday put into words an uncomfortable reality for Europe: If the continent isn't...","filename":"data/vaneerConsumption/MassexpulsionsaheadforEuropeasmigrantcrisisgrows.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:73060331f264436ab06f346f08c56e21-2vdWmEltwXfba0ce28e632c5d892-298_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421581_Mass-expulsions-ahead-Europe-migrant-crisis-grows_1540267767.html","title":"Mass expulsions ahead for Europe as migrant crisis grows","title_page":"Mass expulsions ahead for Europe as migrant crisis grows | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mass expulsions ahead for Europe as migrant crisis grows\nSTOCKHOLM (AP) — Dazzled by an unprecedented wave of migration, Sweden on Thursday put into words an uncomfortable reality for Europe: If the continent isn't going to welcome more than 1 million people a year, it will have to deport large numbers of them to countries plagued by social unrest and abject poverty.\nInterior Minister Anders Ygeman said Sweden could send back 60,000-80,000 asylum seekers in the coming years. Even in a country with a long history of immigration, that would be a scale of expulsions unseen before.\n\"The first step is to ensure voluntary returns,\" Ygeman told Swedish newspaper Dagens Industri. \"But if we don't succeed, we need to have returns by coercion.\"\nFILE - In this Nov. 11, 2015 file photo, Sweden's Interior Minister Anders Ygeman, announcing that the government will impose temporary border controls as the Nordic country struggles to receive tens of thousands of refugees in Stockholm, Sweden. Ygeman says Sweden could deport between 60,000 and 80,000 asylum-seekers in coming years. (Henrik Montgomery/TT via AP) SWEDEN OUT .\nThe coercive part is where it gets uncomfortable. Packing unwilling migrants, even entire families, onto chartered airplanes bound for the Balkans, the Middle East or Africa evokes images that clash with Europe's humanitarian ideals.\nBut the sharp rise of people seeking asylum in Europe last year almost certainly will also lead to much higher numbers of rejections and deportations.\nEuropean Union officials have urged member countries to quickly send back those who don't qualify for asylum so that Europe's welcome can be focused on those who do, such as people fleeing the war in Syria.\n\"People who do not have a right to stay in the European Union need to be returned home,\" said Natasha Bertaud, a spokeswoman for the EU's executive Commission.\n\"This is a matter of credibility that we do return these people, because you don't want to give the impression of course that Europe is an open door,\" she said.\nEU statistics show most of those rejected come from the Balkans including Albania and Kosovo, some of Europe's poorest countries. Many applicants running away from poverty in West Africa, Pakistan and Bangladesh also are turned away. Even people from unstable countries like Iraq, Afghanistan and Somalia can't count on getting asylum unless they can prove they, personally, face grave risks at home.\nFrans Timmermans, the Commission's vice president, told Dutch TV station NOS this week that the majority of people seeking asylum in Europe are not refugees.\n\"More than half, 60 percent, should have to return much more quickly. If we start with doing that, it would already make a huge difference,\" he said.\nSending them back is easier said than done. In 2014, EU nations returned less than 40 percent of the people who were ordered to be deported.\nSometimes those seeking asylum go into hiding after receiving a negative decision. Sometimes their native country doesn't want them back.\nEU countries, including Sweden and Germany, have had some success sending people back to the Balkans on chartered flights. Of the 37,000 who returned from Germany on their own accord last year, all but about 5,000 were from the Balkans.\n\"It's been more difficult with Iraq and Afghanistan,\" said Mikael Ribbenvik, director of operations at the Swedish Migration Agency. \"The returns have worked during some periods, and not so well during others.\"\nOne of the biggest obstacles to sending people back is to obtain travel documents from their home countries. People routinely lose or even destroy their travel papers coming to Europe, creating confusion about where they are from.\n\"Most countries in the world don't accept someone if cannot be proved that it's one of their citizens,\" Ribbenvik said.\nSweden has urged the EU and its Frontex border agency to help establish return agreements with the countries of origin.\nFrontex's budget for deporting people was significantly increased this year, allowing it to coordinate more flights and help countries prepare their own.\nUnder U.N. rules, countries are supposed to offer protection to refugees fleeing war and persecution. But some European countries also offer protection to people deemed at risk of torture or the death penalty or who are suffering from an exceptionally serious disease.\n\"Obviously, there is currently a very heated debate in Europe on this issue,\" said Stephane Dujarric, a spokesman for the U.N. secretary-general. \"Our message continues to be the same — that refugees and migrants need to be treated with compassion, dignity and with full respect of their rights for those who are refugees.\"\nEven for those who get a negative decision within months, it can take years before all appeals are exhausted and they are ordered to leave.\nJawad Aref Hashemi, a 43-year-old Afghan who lived in Iran before traveling to Denmark to seek asylum, suggested he won't accept no for an answer.\n\"If people are sent home, they will protest. How will they send us home? In big cars? We are not animals,\" he said.\nAbdi Xuseen, a 28-year-old Somali who also sought asylum in Denmark, said \"people will hide\" or go on hunger strikes if they are forced to leave Europe.\nStatistics from the Swedish Migration Agency show 127,000 people have been ordered to leave the country since 2010. About 60,000 did so voluntarily, while 26,000 were deported with coercion and 40,000 absconded.\nAuthorities have little information on the latter group. Some are believed to have left the country, while others remain in Sweden illegally, at risk of being exploited in a black market economy.\n\"There has to be noticeable consequences for companies that use illegal labor,\" Ygeman told Dagens Industri. \"If there's a decent illegal labor market the incentive to stay in Sweden will be strong.\"\nMore than 160,000 people applied for asylum in Sweden last year, the highest number in Europe relative to population size. Ygeman's estimate that 60,000-80,000 of them will have to leave was based on the current rejection rate of about 45 percent.\nMeanwhile, the stream of migrants making the perilous journey across the Mediterranean to Europe continues.\nGreece's coast guard said 25 people died, including 10 children, when a migrant boat sank Thursday off Samos, an island near the Turkish coast.\nRomanian rescuers dropped off 119 African migrants in Italy after recusing them from an inflatable dingy. The migrants were dehydrated and showed signs of hypothermia, the Romanian border police said.\n___\nAssociated Press writers Jan M. Olsen in Copenhagen, Denmark, David Rising in Berlin, Lorne Cooke in Brussels and Cara Anna in New York contributed to this report.\nIn this Friday, Jan. 15, 2016 photo, refugees wait their turn at the Tabakika registration center, Chios island, Greece. Despite the bitter winter cold and rough seas, tens of thousands of men, women and children fleeing violence and poverty in their homelands continue to risk their lives to make the relatively short but dangerous journey from the Turkish coast to nearby Greek islands, seeking a better future in Europe. (AP Photo/Petros Giannakouris)","url":"https://www.dailymail.co.uk/wires/ap/article-3421581/Mass-expulsions-ahead-Europe-migrant-crisis-grows.html"}
