{"authors":["Erica Tempesta For Dailymail.Com"],"date_download":"2018-10-23 05:53:35","date_modify":"2018-10-23 05:53:35","date_publish":"2017-03-10 15:29:08","description":"Online fitness sensation Massy Arias welcomed her daughter Indira Sarai into the world on February 28, and in little over a week the Los Angeles-based mom is already back in fighting shape.","filename":"data/vaneerConsumption/MassyAriasshowsoffasixpack9DAYSaftergivingbith.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/15/3E237EDC00000578-0-image-a-38_1489158375377.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4301336_Massy-Arias-shows-six-pack-9-DAYS-giving-bith_1540274015.html","title":"Massy Arias shows off a six pack 9 DAYS after giving bith","title_page":"Massy Arias shows off a six pack 9 DAYS after giving bith | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's not unusual to see fitness trainers flaunting their rock hard abs on social media, but one new mom is making waves with snapshot of her toned tummy just nine days after she gave birth to her baby girl.\nOnline fitness sensation Massy Arias, 28, welcomed her daughter Indira Sarai into the world on February 28, and in little over a week the Los Angeles-based mom is already back in fighting shape — even though she has yet to return to exercising. Instead, she credits her healthy diet for the return of her six pack.\nMassy took to Instagram on Thursday to share a photo of herself heavily pregnant alongside another snapshot of her showing off her trim frame with her baby resting on her chest just nine days postpartum.\nAbs of steel: Massy Arias took to Instagram to share a photo of herself heavily pregnant alongside another snapshot of her showing off her trim frame just nine days postpartum\nHappy as can be: The online fitness sensation shared this photo of her and her husband the day before she gave birth to her daughter Indira Sarai on February 28\nThe trainer, who has more than 2.2 million Instagram followers, explained that she 'recovering and eating' the best she can while adding 600 to 800 extra of calories to her diet to support her milk supply.\nMassy added that she is using her own eight-week fitness program and counting her 'macros' — meaning she is tracking the number of grams of protein, carbohydrates, and fats she is consuming on a particular day.\n'You saw how active I was during my pregnancy and how well I ate. I had a natural labor with no complications (thank God and to this lifestyle),' she wrote.\n'I am still practicing what I believe in : food is medicine and I don't deprive myself from any food groups. I just EAT WHOLE AND EAT WELL.'\nChanging body: Massy documented her entire pregnancy with her 2.2 million Instagram followers. She is pictured before her pregnancy and while she was nine-months pregnant\nBundle of joy: Massy, who has been breastfeeding her daughter, said she was able to have a natural water birth thanks to her healthy lifestyle\nAccording to Massy, she keeps her protein intake high to support her muscle and she drinks about a gallon of fluids, mostly water.\nUsing the macro calculator on her program, Massy said she is able to 'maintain' her figure without any exercise.\n'It's amazing what you can do when you know specifically what to eat,' she wrote. 'I do miss movement but first, I have to heal properly.'\nMassy ended her post by reminding her fans that her photo 'isn't intended to set any expectations or to be negative.'\nShe added: 'We all have different journeys. I love you guys.'\nGrowing belly: The fitness trainer snapped this selfie while she was 30-weeks pregnant\nMassy turned heads back in October when she shared a photo of her six-pack abs when she was over four-months pregnant\nThousands of people commented on the post, and many praised Massy for her stunning recovery.\n'Looks like consistent hard work pays off. You look amazing!' Emma Hutchinson wrote, and a woman named Mamorena called her transformation 'witchcraft'.\n'This is very impressive,' she added. 'The results of hard work and looking after yourself.'\nThe fitness guru turned heads throughout her pregnancy, and last October she shared jaw-dropping photos of her six pack when she was nearly five-months pregnant.\nMassy, who was born in the Dominican Republic, has lived in the United States since she was 14 years old, and she said that she adopted an active and healthy lifestyle after experiencing depression.\nDiet of champions: Massy eats plenty of protein, fruits, and vegetables to stay healthy\nDo you see it? Massy gushed that she could finally see her baby bump in August\nTrimmed and toned: Massy shared this throwback photo of herself at the start of her pregnancy\nHer training techniques include resistance training, sprinting, high intensity interval training, yoga and calisthenics.\nArias announced her pregnancy online in August, and she opened up about having morning sickness and feeling fatigued while pregnant with her first child.\nHowever, she continued sharing her workouts as well as her favorite meals throughout her pregnancy.\n'I have made the choice to stay away from harmful and artificial ingredients, as well as processed foods because I have a princess to nurture and I love her so much, I am putting her 1st,' Arias wrote back in September.\n'What I eat, she's also eating. All expecting moms (including you guys too) have the right to make your own choices without judgement from anyone.'","url":"https://www.dailymail.co.uk/femail/article-4301336/Massy-Arias-shows-six-pack-9-DAYS-giving-bith.html"}
