{"authors":["Tim Collins For Mailonline"],"date_download":"2018-10-23 01:03:49","date_modify":"2018-10-23 01:03:49","date_publish":"2017-04-26 11:06:19","description":"Scientists at the University of Lincoln have received funding to mass produce a fully autonomous farm robot that could one day replace the need for human workers altogether.","filename":"data/vaneerConsumption/Massproducedfarmrobotscouldreplacehumanworkers.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9EA7EA00000578-0-image-a-15_1493198699219.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4446778_Mass-produced-farm-robots-replace-human-workers_1540256629.html","title":"Mass produced farm robots could replace human workers","title_page":"Mass produced farm robots could replace human workers | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Picking fruit and vegetables by hand is back breaking work, often at low pay.\nBut a robot designed by an international team of scientists could make this a thing of the past within a decade.\nThe device, dubbed Thorvald, is able to provide farmers with invaluable information about their land and produce.\nScroll down for video\nA nimble farming machine called Thorvald (pictured) could soon become a common sight on working farms. One of the UK's largest produce companies is reported to have invested funding to allow the robot to be mass produced\nTHORVALD Thorvald was built to to perform a wide variety of agricultural tasks. Its lightweight design makes manoeuvring over uneven ground no problem and it is agile enough to navigate between rows of crops without touching plants. The robot's sturdy frame make it suitable for carrying loads, which could save farm workers hours of traipsing across fields. But it also capable of carrying out more delicate work, like using its on-board sensors to monitor the condition of crops and soil, as well as weeding out any unwanted plants and using UV light to stop mildew from damaging plants.\nThorvald was created by scientists from the University of Lincoln, in partnership with the Norwegian University of Life Sciences.\nIts creators originally envisaged the robot as a mobile lab assistant, allowing them to conduct experiments designed to improve efficiency, sustainability and reduce waste throughout the food supply chain.\nBut with new funding and mass production, Thorvald could become the next generation of inexpensive farm labour.\nNow one of the UK's largest produce companies has invested funding to help pay a team of more than 30 scientists to realise this ambition.\nAnd the mystery firm hopes to plug a gap in the labour force that they fear the UK's exit from the European Union will bring, according to reports in the Financial Times.\nSpeaking to the paper, robotics professor Pål Johan From said: 'That's the main motivation for this — it's a huge concern.\n'They are more or less desperate because they don't know what the situation will be in two or three years.\nThorvald was built to to perform a wide variety of agricultural tasks.\nIts lightweight design makes manoeuvring over uneven ground easy and it is agile enough to navigate between rows of crops without touching plants.\nThe robot's sturdy frame make it suitable for carrying loads, which could save farm workers hours of traipsing across fields.\nThorvald can be steered manually, using a games console controller (pictured) but its creators are working to make the system fully autonomous\nIt is also capable of carrying out more delicate work, like using its on-board sensors to monitor the condition of crops and soil, as well as weeding out any unwanted plants and using UV light to stop mildew from damaging plants.\nIt can be steered manually, using a games console controller, and its creators are working to make the system fully autonomous.\nBut they believe it will take be at least another decade before the robots are able to operate with the same skill as a human worker.\nSpeaking to the FT, Mr From added: 'They have the potential, really, to do any task in agriculture.\n'I would say it’s 10 to 20 years before we can make a robot that can pick [a strawberry] at the same speed as a human. Raspberries are even harder.'","url":"https://www.dailymail.co.uk/sciencetech/article-4446778/Mass-produced-farm-robots-replace-human-workers.html"}
