{"authors":[],"date_download":"2018-10-22 21:45:25","date_modify":"2018-10-22 21:45:25","date_publish":"2016-01-29 08:05:39","description":"Mumbai's coastline is more used to rubbish washing ashore than dead mammals, but on Friday residents woke to the sight of a nearly 40-foot-long whale on one ...","filename":"data/vaneerConsumption/MassivewhalewashesashoreinIndiasMumbai.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h7o1-4PuZeKVXE7cd9005b2c8766d3621-648_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422294_Massive-whale-washes-ashore-Indias-Mumbai_1540244725.html","title":"Massive whale washes ashore in India's Mumbai","title_page":"Massive whale washes ashore in India's Mumbai | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Massive whale washes ashore in India's Mumbai\nMumbai's coastline is more used to rubbish washing ashore than dead mammals, but on Friday residents woke to the sight of a nearly 40-foot-long whale on one of its most popular beaches.\nHundreds of people descended on Juhu beach in the north of the teeming western Indian city to catch a glimpse of the Bryde's whale after it washed ashore late Thursday.\n\"It's 11.3 metres (37 feet) long and weighs around 20 tonnes,\" said Makrand Ghodke, an official at the Maharashtra Forest Department who identified the type of whale.\nOnlookers gather around a nearly 40-foot-long dead whale washed ashore at the Juhu Chowpatty in Mumbai on January 29, 2016 ©Punit Paranjpe (AFP/File)\n\"There is no sign of any wounds. We think it died three or four days back and we will conduct an autopsy to determine the cause of death,\" he told AFP.\nGhodke said joggers had first spotted the dead mammal on Thursday night and called his department.\nHe added that a crane was being readied to help move the massive whale from the beach, which rests against the Arabian Sea.\nThis month 45 whales died after stranding themselves on a beach in Tamil Nadu in southern India.\nIn June, a 42-foot-long blue whale washed ashore near Alibaug, a coastal town lying around 100 kilometres (60 miles) south of Mumbai in the state of Maharashtra.","url":"https://www.dailymail.co.uk/wires/afp/article-3422294/Massive-whale-washes-ashore-Indias-Mumbai.html"}
