{"authors":["Wills Robinson For Dailymail.Com"],"date_download":"2018-10-23 05:40:49","date_modify":"2018-10-23 05:40:49","date_publish":"2016-01-11 18:40:02","description":"A clean-shaven Michael McCarthy, 35, was held without bail after denying he killed Bella Bond and hid her body in a fridge during an appearance at a Suffolk County, Massachusetts, court","filename":"data/vaneerConsumption/MassachusettsmanpleadsnotguiltytokillingtwoyearoldBabyDoe.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/20/300E538A00000578-0-image-a-64_1452545975936.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394389_Man-pleads-not-guilty-killing-two-year-old-Baby-Doe-lawyer-claims-toddler-s-mother-unbelievable-accusations-beat-death-blamed-insatiable-drug-addiction_1540273249.html","title":"Massachusetts man pleads not guilty to killing two-year-old 'Baby Doe'","title_page":"Massachusetts man pleads not guilty to killing two-year-old 'Baby Doe' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The man accused of killing two-year-old 'Baby Doe' has pleaded not guilty while his lawyer said the toddler's mother was behind the brutal murder.\nA clean-shaven Michael McCarthy, 35, was held without bail after denying he killed little Bella Bond and hid her body in a refrigerator last year.\nThe garbage bag containing Bella's body was discovered on the shores of Deer Island in Massachusetts on June 25.\nScroll down for video\nA clean-shaven Michael McCarthy, 35, was held without bail after denying he killed little Bella Bond and hid her body in a refrigerator last year\nMcCarthy's attorney Jonathan Shapiro (pictured front) told a Suffolk County Court that Bond has made 'unbelievable' claims about his client and slammed her 'insatiable drug addiction'\nHowever her remains were not identified until September following a huge campaign to find out the name of the slain child.\nHer mother Rachelle Bond, who is also McCarthy's boyfriend, accused him of repeatedly punching the girl in the stomach until she died because he believed she was 'possessed by demons'.\nBut McCarthy's attorney Jonathan Shapiro told a Suffolk County Court that Bond has made 'unbelievable' claims about his client and slammed her 'insatiable drug addiction'.\nHe added that she had a history of child neglect while McCarthy was more mild-mannered.\nShapiro also said the prosecution's case against McCarthy is 'incredibly weak' and insisted there is no DNA or forensic evidence tying him to the crime.\nAt McCarthy's arraignment Monday, prosecutor David Deakin described what Rachelle Bond claims she saw after McCarthy allegedly punched the girl to death.\nHer mother Rachelle Bond (left pictured in court last week), who is also McCarthy's boyfriend, accused him of repeatedly punching the girl (right) in the stomach until she died because he believed she was 'possessed by demons'\n'She saw the defendant sort of half-standing, half-kneeling over the prone girl who was on either the ground or a mattress on the ground and he was moving his arms rapidly around the area of her mid-section,' Deakin said.\nThe prosecution said the couple stole weights from McCarthy's father's plumbing business and used them to weigh down the baby's body when they threw her in Boston Harbor.\nDeakin also claimed McCarthy sent Bond a text when she was in housing court after Bella's death, saying: 'Whatever you do, don't tell them about Bella.'\nMcCarthy's next court appearance is scheduled for February 16. His lawyer also told the court he is receiving treatment for his heroin addiction in jail.\nMcCarthy was charged with first-degree murder before Christmas, while Bond was charged with being an accessory after the fact to her daughter's killing.\nA larceny charge was added against Bond for allegedly continuing to accept public assistance after she knew her daughter had been killed.\nLast week she pleaded not guilty to being involved in her daughter's death.\nMcCarthy (left) and Bond (right) were charged in connection with the girl's death in December. Her remains took months to identify","url":"https://www.dailymail.co.uk/news/article-3394389/Man-pleads-not-guilty-killing-two-year-old-Baby-Doe-lawyer-claims-toddler-s-mother-unbelievable-accusations-beat-death-blamed-insatiable-drug-addiction.html"}
