{"authors":[],"date_download":"2018-10-22 21:45:49","date_modify":"2018-10-22 21:45:49","date_publish":"2014-06-06 14:36:14","description":"The study by researchers at Boston College found that $59 trillion will be passed down to heirs, charities, taxes and estate closing costs.","filename":"data/vaneerConsumption/MassiveWealthTransferCouldBeaWindfallforCharities.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/better_money_massive-wealth-transfer-could-be-windfall-charities-n124496_1540244749.html","title":"Massive Wealth Transfer Could Be a Windfall for Charities","title_page":"Massive Wealth Transfer Could Be a Windfall for Charities","title_rss":"NULL","source_domain":"nbcnews.com","text":"Get the Better newsletter.\nWhat do you do when a windfall is dangled in front of you, just out of reach?\nThat's the challenge for charities in the wake of a new study that shows the United States will experience the greatest wealth transfer in its history.\nThe study by researchers at Boston College's Center on Wealth and Philanthropy found that $59 trillion will be passed down to heirs, charities, taxes and estate closing costs. This is $7 trillion higher, in 2007 dollars, than a 1999 study by the center.\nWith this transfer, charitable giving could approach $27 trillion if growth runs at 2 percent, and exceed $40 trillion with a 3 percent growth rate.\n\"These estimates present an extraordinary opportunity for nonprofits today and in coming years,\" said center director Paul Schervish.\nThe question for charities is how best to get their share.\nExperts point to a few aspects of the wealth-transfer forecast that provide clues. For one thing, tax laws now allow people to pass $5.34 million to heirs without estate taxes, reducing the incentive for bequests to charities. At the same time, the generation now inheriting wealth is more interested in making gifts before death in order to see the results of the largess.\nAlan Cantor, a nonprofit consultant based in Concord, New Hampshire, said those factors are promising for organizations focused on impact investing—investing with the dual purpose of generating returns and creating social good.\nMany of the people who will inherit wealth in the coming years grew up in the 1960s and 1970s, he said, and they may have a different mindset about charitable giving than their parents' generation.\n\"I see them doing a few things: looking more into mission investing and impact investing, trying to invest their money in more creative, progressive ways, so it's not all sitting in their parents' traditional corporate securities,\" he said.\nSure enough, studies of so-called impact investing, or investing with the twin purposes of generating a return and performing some social good, indicate that interest in the field is growing rapidly. A group of 125 institutional impact investors surveyed by JPMorgan and the Global Impact Investing Network reported that they committed $10.6 billion to impact investments in 2013, and intend to commit $12.7 billion in 2014.\nThe inheriting generation's thinking may also present a special opportunity for charities dealing with current social problems. The Center on Wealth and Philanthropy found that a disproportionate amount of charitable giving is likely to come from the wealthiest families, and Cantor said families' attitudes toward wealth transfer are different.\nUltra-high net worth people \"are really saying how much do the kids really need,\" he said. They are concluding that \"$5 million really might be enough, and now let's give away the rest.\"\nWhen it comes to the actual giving, he said, immediacy of impact is increasingly important. \"I see more and more people say 'Why should we create an endowment when there are 49 million hungry Americans, and global warming [is] changing the world?'\"\nDonors \"are more and more concerned about doing the job properly,\" said Schervish. This has always been true of major donors, back to the days of Carnegie and Mellon, he added, but \"what's new is the intensity of it.\"\nStill, some fundraising tactics for charities will remain the same. For example, a personal touch with donors is as important as it has ever been. Charities can't know which of their small donors may someday become wealthy, so it behooves them to provide as much personal care as is practical to their loyal beneficiaries.\n\"Nonprofits in a sense need to treat every baby boomer as a potential heir,\" Cantor said. Even a donor who gives $100 every year is demonstrating incredible loyalty, he added. \"One of the clearest indicators that somebody will leave a significant bequest is that they were a long time donor, even at a modest level.\"\nOne option for small charities is to enlist directors to make personal calls to everyone who donates at a level that the charity considers significant, Cantor said. \"Be careful about cutting corners.\"\nSchervish points out that motivations for giving are also relatively constant. People with means often identify with the group in need, or feel glad to be able to help, or are simply grateful for their good fortune.\nIn the end, though, they want to feel that they are doing good works.\n\"Here's where charities fail,\" Schervish said. \"They make the donor an instrument for the charity to do good, rather than showing how the charity is an instrument for the donor to do good.\"\nCharities will be successful, he said, if they can turn that around.\n\"That is what they need to tell the donor: This is the job you are getting done in the world.\"","url":"https://www.nbcnews.com/better/money/massive-wealth-transfer-could-be-windfall-charities-n124496"}
