{"authors":["Business Insider Intelligence"],"date_download":"2018-10-31 00:16:32","date_modify":"2018-10-31 00:16:32","date_publish":"2016-12-02 00:00:00","description":null,"filename":"data/vaneerConsumption/MasterCardandVeriFoneteamuptoofferinstantfinance.json","image_url":"https://amp.businessinsider.com/images/5841908bba6eb620008b72b3-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mastercard-and-verifone-team-up-to-offer-instant-finance-2016-12_1540944992.html","title":"MasterCard and VeriFone team up to offer instant finance","title_page":"    MasterCard and Verifone team up to offer instant finance - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nMasterCard partnered with terminal manufacturer VeriFone to bring UK consumers instant access to financing options at the in-store point-of-sale (POS) via the MasterCard Installments app, according to Reuters.\nFor context, MasterCard Installments is MasterCard's POS financing option that allows eligible cardholders to finance transactions over several monthly payments using their MasterCard at the time of purchase. With this new partnership, UK customers will be able to use the tool at select merchants with VeriFone terminals beginning in January, with a national launch to follow later in year.\nConsumer interest could help MasterCard drum up interest in Installments. In the US, 37% of consumers have used point-of-sale (POS) financing, and 25% expect retailers to offer it. If similar trends follow in the UK, it's likely that consumers will start using the service on their MasterCard products, especially if it's offered at retailers with expensive goods and high average order values. That benefits MasterCard, because if consumers want such a program, they might be more likely to pay with their MasterCard for these purchases in order to access it.\nAnd VeriFone, which is the second-largest POS terminal provider globally, could give MasterCard Installments the reach it needs to gain traction after launch.Until now, MasterCard Installments had only launched in Romania, in a partnership with a local bank. By partnering with VeriFone in a major market, the card network will expand the service to thousands of locations in the UK, giving MasterCard's wide customer base a number of locations that they can use the service.\nThat's key, because if customers are expecting retailers to offer it, a broad-based partnership allows that access. In addition, the partnership could also lay the groundwork for the companies to further expand their relationship throughout Europe, where MasterCard was responsible for 29% of the region's total payment volume in 2015.\nFurthermore, the rapid expansion of the Internet of Things (IoT) offers payments companies an opportunity to expand beyond mobile phones, cards, and point-of-sale devices, to a broad and diverse ecosystem of internet-connected devices.\nWe forecast that there will be 24 billion connected devices installed globally by 2020, up from nearly 7 billion today. And over 5 billion will be consumer connected devices by 2020, representing a massive expansion of touchpoints that could eventually offer payments functionality.\nBI Intelligence, Business Insider's premium research service, has compiled a detailed report that dives into the budding industry of connected device payments, providing a rundown of the stakeholders driving innovation in wearables, connected cars, and connected home devices. It also gauges the impact of new payment devices on different payments companies, along with how these devices could shift consumer purchasing behavior.\nHere are some of the key takeaways from the report:\nThe Internet of Things is ushering in a new era for payments companies and manufacturers.The rapid expansion of the Internet of Things (IoT) offers an opportunity to facilitate payments beyond mobile phones, cards, and point-of-sale terminals, on a broad and diverse ecosystem of internet-connected devices.\nMore transactions could eventually pass through connected devices than smartphones. We estimate there will be 24 billion of these devices by 2020, with 5 billion of them being consumer-facing. This represents a massive expansion of touchpoints where payments could be enabled.\nCard networks have developed a basic framework to enable commerce in everyday devices. Visa and MasterCard are creating the underlying infrastructure to support the standardization of payments integration and stake themselves out as the key connected payments gatekeepers. Their payment platforms are universal, allowing digital payments to grow without being tied to the success of a particular manufacturer.\nConsumer-facing IoT companies have much to gain from enabling payments in their devices, including improving the value of the device, being able to cross-sell products through the device, and laying the groundwork for future opportunities to earn incremental revenue. For payments companies, connected payments offer a new revenue stream and an opportunity to gain market share ahead of competitors.\nWearables, connected cars, and smart home devices will be the top connected payments product categories.","url":"https://www.businessinsider.com/mastercard-and-verifone-team-up-to-offer-instant-finance-2016-12"}
