{"authors":["Associated Press"],"date_download":"2018-10-23 00:53:54","date_modify":"2018-10-23 00:53:54","date_publish":"2017-03-10 08:09:08","description":"WASHINGTON (AP) - After a meticulous restoration that took more than a year, a Stradivarius violin that was stolen from violinist Roman Totenberg and missing...","filename":"data/vaneerConsumption/MasterpiecerestoredStolenStradivariuswillsingagain.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/08/wire-194785-1489133352-412_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300278_Masterpiece-restored-Stolen-Stradivarius-sing-again_1540256034.html","title":"Masterpiece restored: Stolen Stradivarius will sing again","title_page":"Masterpiece restored: Stolen Stradivarius will sing again | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"WASHINGTON (AP) - After a meticulous restoration that took more than a year, a Stradivarius violin that was stolen from violinist Roman Totenberg and missing for decades is about to return to the stage.\nMira Wang, a violinist who immigrated to the United States from China 30 years ago to study under Totenberg, will play the instrument at a private concert in New York on March 13, and more performances after that are possible.\nThe violin known as the Ames Stradivarius is one of roughly 550 surviving instruments made by Antonio Stradivari, history's most renowned violin maker. Built in 1734, it's likely worth millions of dollars, although it hasn't been appraised since it was recovered.\nIn this Wednesday, March 8, 2017 photo, the Ames Stradivarius violin is seen in New York. After a meticulous restoration that took more than a year, the Ames Stradivarius violin that was stolen from violinist Roman Totenberg is about to return to the stage. Violinist Mira Wang, a former student of Totenberg's, will play the instrument at a private concert in New York on March 13. (AP Photo/Seth Wenig)\nIt was stolen in 1980 while Totenberg was greeting well-wishers after a performance in Boston, and wasn't recovered until 2015, three years after Totenberg died at age 102.\nThe presumed thief, journeyman violinist Philip Johnson, was himself dying of pancreatic cancer when he showed his ex-wife a locked violin case in his basement. Nearly four years after his death, she took the violin inside the case for an appraisal and learned it was the stolen Stradivarius. It was soon returned to Totenberg's family.\nIt's not clear how often Johnson played the instrument, but The Washington Post reported that he played it in public as recently as 2011, the year he died.\nFor Totenberg's three daughters, who like their father had given up hope that they'd ever see the violin again, its recovery has been a series of joys. Jill Totenberg compared it to \"Christmas, even though we're Jewish.\"\nThey'll hear it again at Wang's performance for the first time since it disappeared.\n\"I'm sure we'll all cry. I'm absolutely sure of it. Whether we cry at the same time is something else, but we definitely will cry,\" she said. \"When that violin was returned to us, we really felt like our father was back in the room with us that day.\"\nAnother happy surprise: 35 years after it disappeared, the violin wasn't in bad shape. Johnson couldn't take it to a repair shop without being discovered, and he used Super Glue and Elmer's to patch a few spots. It was unplayable because it had no strings and the sound post inside was broken. But when Bruno Price of Rare Violins of New York first laid eyes on the instrument, he was pleased it was so well-preserved. He and the Totenbergs believe Johnson couldn't have played it all that often.\n\"For us, in the restoration of the violin, it was purely conservation rather than any serious repairs of any kind,\" Price said. \"So, in a way, the violin is probably in better shape for having been stolen - a horrible thing to say.\"\nPrice and his staff took their time with the restoration, trying to make as few major repairs as possible. They sealed some cracks, fixed the broken sound post and replaced the neck, which must be done periodically anyway.\nFor Totenberg's three daughters - Jill, a public-relations executive; Nina, the legal-affairs correspondent for National Public Radio; and Amy, a federal judge - there was no question that Wang would play the violin first.\n\"I'm not sure she assumed it, but all three of us assumed it,\" Nina Totenberg said. \"She really is like the fourth Totenberg sister.\"\nFor Wang, the instrument presents its own challenges, even though she's been playing her own Stradivarius for two decades. She had about a month to practice before the concert, a timetable she compares to a jockey hopping on an unfamiliar racehorse just before a race.\n\"To be able to really know a violin of that caliber, you need years. You need years to really know the nuances and to bring out the certain colors and bring out the different varieties of sound,\" Wang said. \"But we'll make the best out of it.\"\nWang will perform two chamber pieces: a string quintet by Felix Mendelssohn and a piano quintet by Antonin Dvorak.\nNo additional concerts are scheduled, but it's possible that Wang will get more opportunities to play the violin. The family plans to sell it eventually, either to a musician or to a person or organization that ensures it will continue to be played and maintained.\n\"In the end, there's going to be one person (for whom) it's going to suit their type of playing even more perfectly than with Mira,\" Price said. \"There's a very personal connection that comes with these great instruments, but it sounds fantastic.\"\n___\nFollow Ben Nuckols on Twitter at https://twitter.com/APBenNuckols .\nIn this Wednesday, March 8, 2017 photo, violinist Mira Wang plays the Ames Stradivarius violin in New York. After a meticulous restoration that took more than a year, the Stradivarius violin that was stolen from violinist Roman Totenberg is about to return to the stage. Wang, a former student of Totenberg's, will play the instrument at a private concert in New York on March 13. (AP Photo/Seth Wenig)\nIn this Wednesday, March 8, 2017 photo, Tatsuo Imaishi makes an adjustment on the Ames Stradivarius violin in New York. After a meticulous restoration that took more than a year, the Stradivarius violin that was stolen from violinist Roman Totenberg is about to return to the stage. Violinist Mira Wang, a former student of Totenberg's, will play the instrument at a private concert in New York on March 13. (AP Photo/Seth Wenig)","url":"https://www.dailymail.co.uk/wires/ap/article-4300278/Masterpiece-restored-Stolen-Stradivarius-sing-again.html"}
