{"authors":["Associated Press"],"date_download":"2018-10-22 21:01:42","date_modify":"2018-10-22 21:01:42","date_publish":"2016-01-29 05:34:33","description":"SANTA ANA, Calif. (AP) — The alleged mastermind of a brazen California jail break was a small-town paint store manager fresh out of the Marines when his life...","filename":"data/vaneerConsumption/MastermindofCaliforniajailescapehaslongpast.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:06dcb254537945f3baf5a0b99a402ca9-4PuZeKVXE7cd9005b2c876535b83-502_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421863_Mastermind-California-jail-escape-long-past_1540242102.html","title":"'Mastermind' of California jail escape has long past","title_page":"'Mastermind' of California jail escape has long  past | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'Mastermind' of California jail escape has long past\nSANTA ANA, Calif. (AP) — The alleged mastermind of a brazen California jail break was a small-town paint store manager fresh out of the Marines when his life changed with a car accident. That accident killed his friend and sent him into a spiral culminating with his arrest on charges he tortured and mutilated a man, then left him to die in the desert.\nThe prosecutor in the kidnapping and torture case against Hossein Nayeri was so alarmed by his escape from the Orange County jail last week that she called defense attorneys in a panic at 2 a.m. In an interview with a reporter, she described him as a Hannibal Lecter, the sadistic killer in \"The Silence of the Lambs.\"\nNayeri, 37, and two other inmates, 43-year-old Bac Duong and 20-year-old Jonathan Tieu, sawed through a metal grate over a plumbing tunnel and sliced through more metal and rebar to reach an unguarded section of roof. From there, they rappelled down four stories using a rope made of bed linens to reach freedom — the first jail break at the facility in nearly three decades, authorities said.\nThis undated photo provided by the Orange County Sheriff's Department shows Hossein Nayeri. Sheriff Sandra Hutchens earlier this week cited Nayeri's troubled and conniving past when she labeled him as \"most probably the mastermind\" of a stunning jail break that blindsided authorities and has put three inmates on the loose. Nayeri racked up a stunning list of criminal exploits in the decade leading up to his breakout, including a high-speed police chase, a sordid torture case and a flight overseas to avoid capture. (Orange County Sheriff's Department via AP)\nNayeri was born in Iran and as a child emigrated to the U.S. with his family. He attended high school in Fresno and then joined the Marines.\nOrange County Sheriff Sandra Hutchens said investigators believe he was the leader of the jail break partly because of his military background. On Thursday, authorities announced they had arrested a woman of Iranian descent who taught English at the jail and is suspected of providing help for the escape. Nayeri attended her classes.\nHis attorney, Salvatore Ciulla, did not return a request for comment.\nNayeri had no felony record in 2005 when he was charged in a drunken-driving accident that killed his high school friend, Ehsan Tousi, and left Nayeri hospitalized with burns and struggling with depression, according to friends and family.\nWhile free on bail, Nayeri fled but eventually was arrested in Washington and extradited to California in 2009. At his sentencing, friends and family wrote letters to the judge on his behalf, saying that the accident had turned him into a shell of his former self.\nHe hung a photo of Tousi on the wall of his hospital room and cried daily, one friend wrote. A sibling wrote that he stopped calling and spent hours at his friend's gravesite.\n\"It was a horrible feeling to watch my little brother drift away, but there was nothing I could do,\" Sheri Nayeri wrote the judge.\nNayeri told the judge he remembered the smell of burning flesh and was screaming his friend's name before he blacked out.\n\"To this day I wish I wouldn't have gained consciousness to see the look on their faces,\" Nayeri wrote.\nHe was sentenced to less than a year in county jail and four years of probation, in part because of his lack of felony history.\n\"I'm not sticking up for the guy by any means,\" said Roger Bonakdar, an attorney for Tousi's family. \"But whatever the hell was going on with him, it really got out of control pretty quick.\"\nNayeri moved from Madera County to Orange County and violated probation several times, court records show.\nA probation officer wrote in his court file that he struggled with substance abuse, depression and feelings of guilt. A psychologist indicated that he had been diagnosed with bipolar disorder with episodes of mania and depression and was taking medication for it, according to court files.\nIn 2011, he was charged with domestic battery, false imprisonment and making criminal threats but the case was dismissed after he pleaded guilty to a lesser misdemeanor. That same year, a woman — one of the friends who wrote the judge on his behalf in 2005 — filed a request for a protective order against him, according to court records.\nHe was still on probation in 2012 when, prosecutors say, he fled during a traffic stop in Orange County and led police on a high-speed chase. Nayeri managed to get away on foot after ditching the car, which had surveillance devices, video footage and GPS trackers inside.\nAbout a week later, prosecutors say, Nayeri and three others kidnapped a medical marijuana distributor, bound him with zip ties and drove him to desert where they believed he had buried a large sum of cash.\nThere, the man was tortured with a blow torch and his penis severed, according to court files.\nPolice soon matched the ditched car to Nayeri and believe the surveillance gear was being used to monitor the victim, said Robert K. Weinberg, a defense attorney who is representing one of Nayeri's co-defendants in that case.\nAs authorities closed in, Nayeri fled to Iran. He was arrested in 2013 in Prague as he tried to travel to Spain to meet his family.","url":"https://www.dailymail.co.uk/wires/ap/article-3421863/Mastermind-California-jail-escape-long-past.html"}
