{"authors":["Nkayla Afshariyan For Daily Mail Australia"],"date_download":"2018-10-22 21:39:16","date_modify":"2018-10-22 21:39:16","date_publish":"2017-04-26 02:19:00","description":"Age and obesity have been linked to the rate of recurring miscarriages. Australian fertility experts Dr Dee McCormack and Louise Hull will discuss the new findings.","filename":"data/vaneerConsumption/Maternalageobesitykeyfactorsinrecurringmiscarriage.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B657500000578-0-image-a-4_1493166429473.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4445940_Maternal-age-obesity-key-factors-recurring-miscarriage_1540244356.html","title":"Maternal age, obesity key factors in recurring miscarriage","title_page":"Maternal age, obesity key factors in recurring miscarriage | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It is widely understood that pregnancy during the later stages of life increases the health risks for the child and for the mother.\nAnd now, maternal age and obesity have been linked to recurring miscarriages in new research.\nAustralian obstetricians and fertility experts at Fertility SA, Dr Dee McCormack and Associate Professor Louise Hull, spoke to the Adelaide Advertiser about the findings.\n'Maternal age is a huge issue,' Dr McCormack told the publication.\nMaternal age and obesity have been linked to recurring miscarriages in new global research (stock image)\n'From the age of 35, fertility goes down and the rate of spontaneous miscarriage goes up.'\nMiscarriages facts Miscarriage is very common in the first few weeks of pregnancy. Studies show that up to one in five women, who know they are pregnant, will have a miscarriage before 20 weeks. Most of these happen in the first 12 weeks. If a woman miscarries it is unlikely that she will miscarry again, and very unusual for her to miscarry a third time. When women do miscarry three or more times, tests can be done to look for a cause. Source: Royal Women's Hospital\nHaving recently returned from the Second World Congress on Recurrent Pregnancy Loss in France, both doctors will address the links between obesity and maternal age and miscarriage at a seminar on Wednesday night.\nThey said many women feel as though they can get pregnant at any age as they see celebrities falling pregnant in their late 40s and 50s, such as Janet Jackson.\n'That gives people ideas they can keep getting pregnant at 50 ... but truth is that the risk of miscarriage by the age of 45 is in the region of 90 per cent; not even IVF can change that,' Dr McCormack said.\nDr McCormack said that of the women she helps at her fertility clinic, almost half suffered from some form of insulin dysfunction.\n'There is no question that obesity contributes, not exercising, poor diet ... but we need to be doing proper research,' she said.\n'Truth is that the risk of miscarriage by the age of 45 is in the region of 90 per cent; not even IVF can change that,' Dr McCormack said (stock image)\nObesity has been linked with the rates recurring miscarriages, a usually uncommon event during pregnancies (stock image)\nTam Fry, patron of the Child Growth Foundation, previously told the Daily Mail that the challenges of obesity must be taught in schools.\n'A fifth of (UK) women are obese when they become pregnant and half are overweight, and no one is flagging this up,' he said.\n'It is a fact that most women end up wanting to have a baby and they must be taught from childbearing age when they are still in school about the importance of staying in shape not just for themselves but for any future, desired children.'\n'This should start at 12 or 13, even though they may not have a child for another fifteen years or more, if we are to raise awareness.'\nAccording to the Royal Women's Hospital in Victoria, it is 'very unusual' for a woman to miscarry twice and even more so a third time.","url":"https://www.dailymail.co.uk/femail/article-4445940/Maternal-age-obesity-key-factors-recurring-miscarriage.html"}
