{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 18:49:34","date_modify":"2018-10-30 18:49:34","date_publish":"2018-09-10 19:55:09","description":"A former professor at the University of Georgia claims that a math journal deleted a statistic study he did on the achievement gap between men and women at similar levels of intelligence after a backlash from board members who found the study too controversial for their politically correct values.","filename":"data/vaneerConsumption/MathJournalKillsResearchStudyAfterPCBacklash.json","image_url":"https://media.breitbart.com/media/2018/09/shredded-paper.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/education_2018_09_10__1540925374.html","title":"Math Journal Kills Research Study After PC Backlash","title_page":"Math Journal Kills Research Study After PC Backlash | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A former professor at the University of Georgia claims that a math journal deleted a statistic study he did on the achievement gap between men and women at similar levels of intelligence after a backlash from board members who found the study too controversial for their politically correct values.\nThe results of Professor Theodore Hill’s research is not exactly a positive one for men. According to his research, there are more men at the top and the bottom of the intelligence distribution. This phenomenon was first studied by Charles Darwin, who called it the Great Male Variability Hypothesis. While there are more men than women that win the Nobel Peace Prize, there are also more men living on the streets, in prison, and addicted to drugs. Professor Hill’s research aimed to create a theoretical model that explained this trend.\nAfter the research was accepted by the Mathematical Intelligencer, Professor Hill’s co-author, Sergei Tabachnikov, a math professor at Penn State, began to face a backlash from his colleagues. Shortly thereafter, the Mathematical Intelligencer rescinded their acceptance of the research.\nOn September 4, Sergei sent me a weary email. “The scandal at our department,” he wrote, “shows no signs of receding.” At a faculty meeting the week before, the Department Head had explained that sometimes values such as academic freedom and free speech come into conflict with other values to which Penn State was committed. A female colleague had then instructed Sergei that he needed to admit and fight bias, adding that the belief that “women have a lesser chance to succeed in mathematics at the very top end is bias.” Sergei said he had spent “endless hours” talking to people who explained that the paper was “bad and harmful” and tried to convince him to “withdraw my name to restore peace at the department and to avoid losing whatever political capital I may still have.” Ominously, “analogies with scientific racism were made by some; I am afraid, we are likely to hear more of it in the future.”\nA similar situation played out with the New York Journal of Mathematics. After the research was accepted and published, a public outcry led to its removal. And to make matters worse, the researchers had signed a copyright agreement with the journal, meaning that now it could not be published elsewhere.\nUnaware of any of this, I wrote to Steinberger on November 14, to find out what had happened. I pointed out that if the deletion were permanent, it would leave me in an impossible position. I would not be able to republish anywhere else because I would be unable to sign a copyright form declaring that it had not already been published elsewhere. Steinberger replied later that day. Half his board, he explained unhappily, had told him that unless he pulled the article, they would all resign and “harass the journal” he had founded 25 years earlier “until it died.” Faced with the loss of his own scientific legacy, he had capitulated. “A publication in a dead journal,” he offered, “wouldn’t help you.”\nWriting for Quillette, Hill argued that educators must embrace controversial research. “Educators must practice what we preach and lead by example,” Hill wrote. “In this way, we can help to foster intellectual curiosity and the discovery of fresh reasoning so compelling that it causes even the most skeptical to change their minds. But this necessarily requires us to reject censorship and open ourselves to the civil discussion of sensitive topics such as gender differences, and the variability hypothesis in particular.”","url":"https://www.breitbart.com/education/2018/09/10/math-journal-kills-research-study-after-pc-backlash/"}
