{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-22 20:46:04","date_modify":"2018-10-22 20:46:04","date_publish":"2016-01-29 03:34:31","description":"He's famous for asking celebs some hard hitting questions. And Matt Lauer has admitted he asks himself what celebs he can hit hard too. He spoke to Andy Cohen on Watch What Happens Live","filename":"data/vaneerConsumption/MattLauerrevealshisthoughtsduringTomCruiseinterviewin2005.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/01/30AE26A300000578-0-image-a-10_1454030578811.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422058_Matt-Lauer-reveals-going-mind-interview-Tom-Cruise-2005_1540241164.html","title":"Matt Lauer reveals his thoughts during Tom Cruise interview in 2005","title_page":"Matt Lauer reveals his thoughts during Tom Cruise interview in 2005 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He's famous for asking celebs some hard hitting questions.\nAnd Matt Lauer has admitted he asks himself what celebs he can hit hard too.\nThe veteran interviewer has revealed exactly what was going through his mind during his now infamous exchange with Tom Cruise in 2005.\nLay him on the Matt: Matt Lauer revealed what was going through his mind during THAT 2005 interview with Tom Cruise on Wednesday night's Watch What Happens Live\n'I was thinking, \"Can I take him in a wrestling match? Could I tackle him on the set?\"' the 58 year old told Andy Cohen on Wednesday night's Watch What Happens Live.\nWhile promoting War Of The Worlds, a cheery Cruise sat with Lauer and chatted about how happy and content he was, having just gotten engaged to Katie Holmes, who was sitting nearby in the Today studio.\nBut things took a turn for the awkward when Matt brought up Tom's much-publicized attack on Brooke Shields and her use of anti-depressants while suffering from postpartum depression.\nUh-oh: The interview took a turn for the awkward when Matt brought up Tom's much-publicized attack on Brooke Shields and her use of anti-depressants\n'Psychiatry is a pseudo science,' a suddenly angered Cruise admonished. 'You don't know the history of psychiatry; I do.'\nThe actor also told the anchor he should 'be a little bit more responsible' and do research before 'advocating' drugs, before calling him 'glib'.\n'Just kind of filled with words, just saying anything that comes to your mind and not really thinking about it,' Lauer explained the definition to Cohen on Wednesday's show.\nMatt Hardy: 'I was thinking, \"Can I take him in a wrestling match? Could I tackle him on the set?\"' the 58 year old told revealed\nLook it up: His Today co-star Savannah Guthrie, who was also a guest,jibed that he didn't know what 'glib' meant when cruise insulted him with it\nHis Today co-star Savannah Guthrie, who was also a guest, suggested that he wasn't thinking about whether he could take Cruise in a wrestling match when faced with the insult.\n'No, you were thinking \"look up glib\",' she jibed.\nLauer previously revealed in subsequent interviews that he and Tom made up after the incident; indeed he interviewed him on Today three years later as he was promoting Valkyrie.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422058/Matt-Lauer-reveals-going-mind-interview-Tom-Cruise-2005.html"}
