{"authors":["Sean Moran"],"date_download":"2018-10-30 19:58:23","date_modify":"2018-10-30 19:58:23","date_publish":"2018-07-25 02:55:25","description":"Matt Rosendale slammed Sen. Jon Tester (D-MT) in a TV ad on Monday for purchasing a million-dollar “cosmopolitan castle\" on Capitol Hill.","filename":"data/vaneerConsumption/MattRosendaleSlamsJonTestersCosmopolitanCastleinTVAd.json","image_url":"https://media.breitbart.com/media/2018/07/matt-rosendale-us-senate-ad-slams-jon-tester-dc-castle-youtube.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_24__1540929503.html","title":"Matt Rosendale Slams Jon Tester’s ‘Cosmopolitan Castle’ in TV Ad","title_page":"Matt Rosendale Slams Jon Tester’s ‘Cosmopolitan Castle’ in TV Ad | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Montana state auditor Matt Rosendale slammed Sen. Jon Tester (D-MT) in a new television ad on Monday for purchasing a million-dollar “cosmopolitan castle” on Capitol Hill.\nRosendale, who hopes to unseat Sen. Tester, released his second campaign ad that details how the Montana Democrat has become rich enough to purchase a $1 million house in Washington, DC.\nRosendale said in his campaign ad:\nWith 30 years in politics and 12 in the Senate, Tester’s learned to make Washington work – for him. Jon Tester became a multi-millionaire in the Senate, even bought a Cosmopolitan Castle on Capitol Hill. I don’t want a castle in Washington and I don’t think becoming a Senator should make you rich enough to buy one.\nDuring his two terms in office, Sen. Tester’s net worth increased to almost $4 million, and his “castle” on Capitol Hill is appraised at over $1 million.\nTester dodged questions last month from Montana This Morning over his expensive D.C. home and admitted he only spends half of his time in Montana.\nOn Monday, when asked whether he would like to comment on his million-dollar D.C. house, Sen. Tester replied, “Cut me a check and it’s yours.”\nNational Republican Senatorial Committee (NRSC) spokesman Calvin Moore said on Tuesday, “We’re glad Senator Tester’s already started looking at buyers for his million dollar home in Washington seeing as he won’t be needing it after he’s voted out this November.”\nMoore added, “Tester has spent the last 20 years in office trying to cover up that he’s one of the swampiest politicians in Washington, but Montanans can see through his shameful con.”\nA recent poll found that Tester and Rosendale are in a dead heat for the Montana Senate seat.\nRosendale’s campaign also attacked Tester for supporting 99 percent of Barack Obama’s judicial nominees, while opposing Supreme Court Justice nominee Neil Gorsuch and refusing to meet with Supreme Court Justice nominee Judge Brett Kavanaugh.\n“Look at the Supreme Court. Tester voted for President Obama’s nominations of Sonia Sotomayor and Elena Kagan but opposed President Trump’s nomination of Neil Gorsuch. That’s not representing our Montana values,” Rosendale charged.","url":"https://www.breitbart.com/politics/2018/07/24/matt-rosendale-slams-jon-testers-cosmopolitan-castle-tv-ad/"}
