{"authors":["Joshua Caplan"],"date_download":"2018-10-30 21:46:09","date_modify":"2018-10-30 21:46:09","date_publish":"2018-07-27 19:27:28","description":"Rep. Matt Gaetz suspects the DOJ paid people to gather information on the inner workings of Donald Trump's presidential campaign.","filename":"data/vaneerConsumption/MattGaetzSaysDOJCoveringUpPaymentstoSurveilTrumpCampaign.json","image_url":"https://media.breitbart.com/media/2018/07/Rod-Rosenstein.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_27__1540935969.html","title":"Matt Gaetz Says DOJ Covering Up Payments to Surveil Trump Campaign","title_page":"Matt Gaetz Says DOJ Covering Up Payments to Surveil Trump Campaign","title_rss":"NULL","source_domain":"breitbart.com","text":"Rep. Matt Gaetz (R-FL) suggested Friday on Fox News that the Justice Department is covering up payments it made to individuals to gather information on Donald Trump’s presidential campaign.\n“I believe money was paid to people to collect intelligence on the Trump campaign,” the Florida Republican told Bill Hemmer of America’s Newsroom. “That crosses a line in this country,” he said, “when you’ve got folks that are collecting intelligence not as a consequence of a true investigative basis, but based on, instead, this dirty dossier, this DNC information, and then going and spying on a rival political campaign.”\nGaetz predicted the outstanding documents regarding the Justice Department’s Russia probe will show proof that such payments were made. “I think that the records we’re asking [for] will evidence that, and I would love to be proven wrong. I would love to know that that didn’t happen in this country. But I’ve got suspicion that it did.”\nGaetz’s comments came after Rep. Mark Meadows (R-NC) postponed plans to impeach Deputy Attorney General Rod Rosenstein as conservative lawmakers weigh holding the embattled Justice Department official in contempt unless outstanding Russia-probe related documents are given to House investigators.\nThe Freedom Caucus leader said the decision to suspend impeachment proceedings against Rosenstein came after “very good good” discussions with Republican leaders, including House Judiciary Committee chairman Rep. Bob Goodlatte on how to chart “a path forward.”\n“I think it is our desire to have more of a contempt process, which obviously has to have a partner with the Speaker, and I think hopefully they will at least acknowledge we’ve made some reasonable concessions to give DOJ and FBI,” the North Carolina lawmaker told reporters.\nMeadows said, “The very first order of business would be moving the House to a contempt vote” unless the outstanding documents were turned over to the House by the time Congress returns from recess in August.","url":"https://www.breitbart.com/politics/2018/07/27/gaetz-suggests-doj-covering-payments-surveil-trump-campaign/"}
