{"authors":["Kayla Caldwell For Dailymail.Com"],"date_download":"2018-10-23 05:55:08","date_modify":"2018-10-23 05:55:08","date_publish":"2016-01-11 18:41:35","description":"The Golden Globes winner joked that his three daughters were much more interested in his wife's ensemble, as her dress looked like something the Frozen character would wear.","filename":"data/vaneerConsumption/MattDamonswifeLucianaBarrosoturnsDisneyprincessattheGoldenGlobes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/18/300DA25000000578-0-image-a-69_1452536364947.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394304_Matt-Damon-s-wife-Luciana-Barroso-turns-Disney-princess-models-Elsa-inspired-Frozen-dress-Golden-Globes_1540274108.html","title":"Matt Damon's wife Luciana Barroso turns Disney princess at the Golden Globes","title_page":"Matt Damon's wife Luciana Barroso turns Disney princess at the Golden Globes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Though the Hollywood Foreign Press Association honored Matt Damon on Sunday for his work in The Martian, at home his three daughters were more interested in celebrating his wife Luciana Barroso.\nIsabella, aged nine, Gia, aged seven, and Stella, aged five, were mesmerized by Luciana's purple Versace gown, which resembled the shimmery dress worn by Elsa in Disney's smash hit animated film Frozen.\nThe 45-year-old Golden Globe winner joked with reporters in the press room at the Beverly Hills Hilton - as reported by People - that as his girls were fawning over his wife 'I was on my own in the corner putting on my tuxedo.'\nScroll down for video\nCenter of attention: Matt Damon shared with reporters in the press room on Sunday that his three daughters were much more interested in his wife's sparkly dress than the Golden Globes nominee\nJust like Elsa! Isabella, nine, Gia, seven, and Stella, five, thought Luciana Barroso's shimmery, purple Versace gown looked like something Elsa - from Disney's animated film Frozen - would wear\n'They’re more interested in what Lucy’s wearing, with this Frozen stuff,' Matt shared, of his wife's one-shoulder, form-fitting gown.\nHe added: 'She’s wearing this lilac thing tonight, and it does look a little bit like something Elsa would wear. So they were really into that.'\nThe figure-hugging gown highlighted the brunette beauty's trim frame and featured shimmery, silver embellishments, which she coordinated with dangling, silver earrings.\nSee more of the latest red carpet pictures and videos from the 2016 Golden Globes\nCoordinating: Luciana paired her gown - which featured shimmery, silver embellishments - with dramatic, dangling silver earrings\nShe wore her long, brunette locks in a chic updo, and sported bold eyeliner as well as a soft, pink lipstick.\nMatt looked equally dapper, sporting a black tux with a crisp, white button down, black tie, and coordinating black oxfords.\nHe took home the trophy - against Al Pacino, Mark Ruffalo, Christian Bale, and Steve Carell - for Best Performance by an Actor in a Motion Picture - Musical or Comedy for The Martian.\nPretty in purple: The mother-of-three showed off her trim figure in the sleeveless, form-fitting dress, with a one-shoulder design and cut-out along the front\nAnd the award winner later joked about what he plans to do with his newly won prize once he returns home.\n'Well Ricky Gervais had some good ideas!' Matt joked, referring to a moment from the host's crude monologue in which he had discussed how he uses his trophies.\nBut then he explained: 'I’m actually flying out to Las Vegas because I’m shooting tomorrow morning for the new Jason Bourne movie, so I’ll be handing it to my wife to take it home, because I’m going to be in a hotel.'\nShe's got it! Matt shared that Luciana would be handling where the Golden Globe would be placed in their home, as he was flying out to Las Vegas to film the new Jason Bourne movie the following day\nEarlier that night, while discussing his wins, Ricky shocked audiences by saying: 'I won three Golden Globes myself … one I keep by the bed to — it doesn't matter why, it's mine. I won it fair and square.'\n'It's just the right shape and size, it's nothing… yeah. To be clear: That was a joke about me shoving Golden Globes that I've won up my a**.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394304/Matt-Damon-s-wife-Luciana-Barroso-turns-Disney-princess-models-Elsa-inspired-Frozen-dress-Golden-Globes.html"}
