{"authors":["Kelly Mclaughlin For Mailonline"],"date_download":"2018-10-23 05:52:19","date_modify":"2018-10-23 05:52:19","date_publish":"2017-03-16 16:31:22","description":"American-born, Ottawa-raised Matthew Perry said that when he was in the fifth grade, he and a friend beat up Trudeau, who was two years younger, out of 'pure jealousy' of his athletic abilities.","filename":"data/vaneerConsumption/MatthewPerrysayshebeatupJustinTrudeauinCanada.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E55A70200000578-0-image-a-75_1489682252165.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320912_Matthew-Perry-says-beat-Justin-Trudeau_1540273939.html","title":"Matthew Perry says he beat up Justin Trudeau in Canada","title_page":"Matthew Perry says he beat up Justin Trudeau in Canada | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Friends star Matthew Perry has revealed that he once beat up Canadian Prime Minister Justin Trudeau when they were kids.\nPerry - who was born in the US but raise in Ottawa - said that when he was in the fifth grade, he and a friend beat up Trudeau, who was two years younger, out of 'pure jealousy' of his athletic abilities.\n'I think he was excelling at a sport that we weren't, so it was pure jealousy. And, you know, we beat him up,' the actor, now 47, revealed on Jimmy Kimmel Live last night.\nAmerican-born, Ottawa-raised Matthew Perry said that when he was in the fifth grade, he and a friend beat up Trudeau, who was two years younger, out of 'pure jealousy' of his athletic abilities\nHe said he was reminded of the incident by a friend who went to school with both men.\nKimmel asked if Trudeau, now 45, had Secret Service following him around, suggesting that if Barron Trump was beaten up 'you'd be in a stockade right now; you'd be in Russia somewhere'.\n'His dad was Prime Minister, but I don't think that's the reason we beat him up,' Perry said. 'I think he was the only kid in school we could beat up ... I'm not bragging about this. This is terrible. I was a stupid kid.'\nThe actor's Canadian mother, Suzanne Perry, served as the press secretary for Trudeau's father, Pierre Trudeau, when he was Prime Minister.\nThe Friends star, who is two years older than Canadian Prime Minister Trudeau (pictured), said that it was a 'terrible' incident and that he was a 'stupid kid'.\nPerry moved to Canada with his mother after his parents split when he was a baby.\nHe attended Rockcliffe Park Public School, and Ottawa primary school where many politicians and world leaders send their children.\nBut Perry joked that the incident sparked Trudeau's rise in politics.\n'I think it was rather instrumental in him going to such big heights and becoming the Prime Minister,' he said.\nWhen asked in the pair stayed in contact, Perry said no, adding: 'I feel shame. I don't want to think about it.'","url":"https://www.dailymail.co.uk/news/article-4320912/Matthew-Perry-says-beat-Justin-Trudeau.html"}
