{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 23:25:23","date_modify":"2018-10-22 23:25:23","date_publish":"2017-03-16 06:40:32","description":"Matt Damon posed for photos with students at Tufts University’s Medford/Somerville campus in his native Massachusetts on Wednesday as he worked out with a friend.","filename":"data/vaneerConsumption/MattDamongreetedbystudentsamidworkoutatcollege.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E51E01F00000578-0-image-a-103_1489640452030.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318898_Matt-Damon-greeted-students-amid-workout-college_1540250723.html","title":"Matt Damon greeted by students amid workout at college","title_page":"Matt Damon greeted by students amid workout at college | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Oscar-winner, A-lister ... and man of the people.\nMatt Damon posed for photos with students at Tufts University’s Medford/Somerville campus in his native Massachusetts on Wednesday as he worked out at the Steve Tisch Sports and Fitness Center with a friend.\nThe 46-year-old star of films such as The Departed, The Bourne Identity and The Great Wall was snapped in a navy blue Patriots cap, grey Boston Red Sox T-shirt with black warm-up pants and maroon trainers as he used the facility, with students telling People he got a warm-up on a StairMaster before hitting the weights.\nNice to see you: Matt Damon, 46, was snapped at Tufts University’s Medford/Somerville campus in the Boston area on Wednesday\nBrush with fame: Three student athletes beamed as they posed with the Hollywood leading man\nRed carpet king: The perennial A-lister looked every bit the Hollywood star when he was snapped at the Oscars last month\nHappy times: Damon and his beautiful wife Luciana Barroso were snapped earlier this month at the LA premiere of Beauty and the Beast\n'I seemed to be the only person who noticed him, and couldn’t pass up the opportunity to say hi, Tufts senior Josh Morris told People of his run-in with the famous Boston native. 'He was with an older gentleman who appeared to be a friend or trainer.'\nThe workouts seem to be a regular routine with the Ocean's Eleven star, who looked like 'he was definitely ripped,' according to the student, who snapped a selfie with the gregarious screen star.\nMorris said that the actor - famously, a longtime whipping boy of late night host Jimmy Kimmel - eventually began attracting attention from others amid his session in the gym, and he was courteous to them as well.\nFriends and frenemies: While Damon can certainly headline a movie on his own, he's closely associated with best friend Ben Affleck (left) and show biz 'rival' Jimmy Kimmel\nSharing the stage: Damon and Kimmel had a planned bit to end the Academy Awards last month, but the late night host said that the envelope fiasco involving Moonlight and La La Land preempted their plans\n'Many students were saying hi and he seemed very friendly,' Morris said. 'I assume he knew what he was getting into working out at a university gym.'\nDamon, who's originally from Cambridge, is slated to provide narration for Jon Dunham's Boston: The Documentary, an upcoming documentary about the Boston Marathon.\nThe actor said in a news release that some of his 'most vivid childhood sports memories' came in watching his father Kent run in it.\nClose to home: Damon played a corrupt Boston lawman in the Oscar-winning 2006 film, The Departed, alongside Tinseltown legend Jack Nicholson\nBeantown boy: Damon's breakout came nine years earlier in the Boston-based Good Will Hunting, the 1997 movie that resulted in Oscar gold for both he and Affleck; as well as the late Robin Williams\n'I’ll never forget standing there in the crowd with my brother, Kyle, as we looked first for Bill Rodgers, and then, in the very same race as some of the most talented runners on earth, our smiling (and grimacing) 40-year-old dad,' he said.\nBoston: The Documentary will have a one-night theatrical run on April 19 at theaters nationwide.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318898/Matt-Damon-greeted-students-amid-workout-college.html"}
