{"authors":["Valerie Siebert For Dailymail.Com"],"date_download":"2018-10-23 01:29:02","date_modify":"2018-10-23 01:29:02","date_publish":"2016-01-28 15:48:10","description":"The 57-year-old doll has long been criticized for its unrealistic proportions and for setting unattainable beauty standards, which is likely the inspiration behind the brand's new Fashionistas line.","filename":"data/vaneerConsumption/MattelsBarbiedollstocomeintallcurvyandpetitebodytypes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/18/30ACD3E000000578-0-image-a-18_1454005459484.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3420994_Barbie-curvy-tall-petite_1540258142.html","title":"Mattel's Barbie dolls to come in tall, curvy and petite body types","title_page":"Mattel's Barbie dolls to come in tall, curvy and petite body types | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Barbie is about to get a serious makeover.\nThe makers of the famous plastic dolls, Mattel Inc., have revealed that they are changing their famously unreal shape to embrace tall, curvy and petite body types.\nIn addition to that, the dolls will also be made in no less than seven different skin tones, a whopping 22 different eye colors and 24 separate hairstyles.\nA big change: Barbie dolls will soon be available in curvy, tall and petite body types as well as seven different skin tones\nA long time coming: The new line, dubbed the Fashionistas, will also include dolls of a whopping 22 different colors of eyes\nMoving on: Barbie has taken on many guises over the years, since the original model was released in 1959 (right), but she has always maintained the same slim physique - until now\nThe Fashionistas line will also boast dozens of widely-varying outfits for the dolls.\nThe news doesn't mean the end of the original Barbie, however, which has been sold now for 57 years and will continue to be available in stores.\nThe El Segundo, California-based company is making the move after many years of having their big-selling doll be branded controversial for her ludicrously proportioned shape, which many critics claimed was an unrealistic representation of beauty projected on little girls.\nEvelyn Mazzocco, Senior Vice President and Global General Manager Barbie said: 'We are excited to literally be changing the face of the brand - these new dolls represent a line that is more reflective of the world girls see around them - the variety in body type, skin tones and style allows girls to find a doll that speaks to them.'\nGirls of the world: The differing shapes, colors and 24 separate hairstyles available aim to bring the 57-year-old Barbie doll into the modern age\nChanging faces: The news comes after years of controversy surrounding the unrealistic proportions of the classic Barbie doll\nMoving ahead: The line is the latest development in an evolution of the original doll, which last year began featuring a dropped heel for wearing flats for the first time\nThe brand made the announcement on Thursday on Twitter with the hashtag #TheDollEvolves and writing: 'We proudly add three new body types to our line. Meet the new dolls.'\nThe hopes for the company are that the new dolls will help the brand prosper in an era where children are becoming more and more enthralled with technology such as tablets over static plastic toys.\nThe line will be the latest in a series of big changes to the classic form of Barbie, with 2015 seeing the design include flats-wearing dolls, dropping the heels for the first time.\nNovember also so the release of Hello Barbie, a high-tech version of the classic doll that is prepared with answers to complex questions and can hold an entire conversation with a child on topics from self-esteem to dealing with grief.\nA new take: The new line doesn't mean that the original Barbie in its original form will stop being sold\nMaking plans: The project to revamp the original Barbie design was so secretive that Mattel executives dubbed it 'Project Dawn'\nHitting the shelves: The new line of dolls will be available online from January 28 and will later be sold in stores\nAnd it seems that the announcement has been a long time coming, with the plans for the line being so secret that executives at the company dubbed the plan 'Project Dawn' to emphasize the marking of a new era in the company's history.\nThe new dolls will be available online from January 28 on Shop.Mattel.com and will subsequently be available in stores.\n'For more than 55 years, Barbie has been a global, cultural icon and a source of inspiration and imagination to millions of girls around the world,' said Richard Dickson, President and Chief Operating Officer of Mattel.\n'Barbie reflects the world girls see around them. Her ability to evolve and grow with the times, while staying true to her spirit, is central to why Barbie is the number one fashion doll in the world.'","url":"https://www.dailymail.co.uk/femail/article-3420994/Barbie-curvy-tall-petite.html"}
