{"authors":["Associated Press"],"date_download":"2018-10-22 23:15:50","date_modify":"2018-10-22 23:15:50","date_publish":"2016-01-11 05:17:32","description":"BEVERLY HILLS, Calif. (AP) — Matt Damon made a winning return to the Golden Globe awards on Sunday night, accepting the trophy for best actor in a motion pic...","filename":"data/vaneerConsumption/MattDamonofTheMartianwinsGlobeforcomedyactor.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:c77fe1611e104f2ea986a296e14c6952-56CX32zFKLb7123928b84caa9469-593_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3393281_Matt-Damon-The-Martian-wins-Globe-comedy-actor_1540250150.html","title":"Matt Damon of 'The Martian' wins Globe for comedy actor","title_page":"Matt Damon of 'The Martian' wins Globe for comedy actor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Matt Damon of 'The Martian' wins Globe for comedy actor\nBEVERLY HILLS, Calif. (AP) — Matt Damon made a winning return to the Golden Globe awards on Sunday night, accepting the trophy for best actor in a motion picture comedy or musical for \"The Martian.\"\nIt came 18 years after his first and only other Globe win for co-writing the screenplay of \"Good Will Hunting\" with friend Ben Affleck.\nIn \"The Martian,\" Damon played an astronaut accidently left behind on Mars by his crew.\nMatt Damon poses in the press room with the award for best performance by an actor in a motion picture - musical or comedy for ¿The Martian¿ at the 73rd annual Golden Globe Awards on Sunday, Jan. 10, 2016, at the Beverly Hilton Hotel in Beverly Hills, Calif. (Photo by Jordan Strauss/Invision/AP)\n\"The 18-year gap was me working on my singing, which brought me here tonight,\" Damon joked backstage in a nod to the odd pairing of the category.\nIn his acceptance speech, Damon noted that he's made \"a lot of movies that people just didn't go see.\"\n\"This is pretty rarefied air,\" he said backstage. \"I'm going to smell the roses.\"\nDamon is headed to Las Vegas on Monday to begin filming the latest installment of the Bourne saga. He said wife Lucy would take his statue home with her.\nOn camera, the 45-year-old actor thanked his wife and three daughters, telling them to get ready for bed.\nDamon has been nominated five other times over the years but had not won until this year.\nLooking back, he was asked backstage what advice he would have for his 20-year-old self.\n\"I was the most lucky for having great grown-ups in my life who were very wise, who encouraged me to focus on work and not superfluous stuff,\" he said.\nDamon beat out Christian Bale and Steve Carell of \"The Big Short,\" Al Pacino of \"Danny Collins,\" and Mark Ruffalo of \"Infinitely Polar Bear.\"\nMatt Damon, left, and Luciana Barroso arrive at the 73rd annual Golden Globe Awards on Sunday, Jan. 10, 2016, at the Beverly Hilton Hotel in Beverly Hills, Calif. (Photo by Jordan Strauss/Invision/AP)","url":"https://www.dailymail.co.uk/wires/ap/article-3393281/Matt-Damon-The-Martian-wins-Globe-comedy-actor.html"}
