{"authors":["John Hayward"],"date_download":"2018-10-30 20:40:22","date_modify":"2018-10-30 20:40:22","date_publish":"2018-06-29 18:18:00","description":"Secretary of Defense Jim Mattis became the highest-ranking Trump administration official to visit Japan on Friday, offering reassurances that America’s commitment to regional security remains firm and promising that Japanese kidnapping victims will not be forgotten during negotiations with North Korea.","filename":"data/vaneerConsumption/MattisinTokyoLongstandingAllianceBetweenJapanandUSStandsFirm.json","image_url":"https://media.breitbart.com/media/2018/06/wi/ap/28/199662_japan-us-mattis-95892-jim-mattis-itsunori-onodera-defense-secretary-jim-e1530295498810.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2018_06_29__1540932022.html","title":"Mattis in Tokyo: ‘Longstanding Alliance Between Japan and U.S. Stands Firm’","title_page":"Mattis in Tokyo: ‘Longstanding Alliance Between Japan and U.S. Stands Firm’","title_rss":"NULL","source_domain":"breitbart.com","text":"Secretary of Defense Jim Mattis became the highest-ranking Trump administration official to visit Japan on Friday, offering reassurances that America’s commitment to regional security remains firm and promising that Japanese kidnapping victims will not be forgotten during negotiations with North Korea.\n“We’re in the midst of very unprecedented negotiations right now with North Korea. But in this dynamic time, the longstanding alliance between Japan and the United States stands firm,” Mattis said at an appearance with Japanese Defense Minister Itsunori Onodera.\nMattis described the U.S.-Japan alliance as a “cornerstone of Indo-Pacific stability” and said America’s commitment to the alliance “remains ironclad.”\nJapanese Foreign Minister Taro Kono told Mattis it was important for America and Japan to “keep our relations tight” and maintain full sanctions pressure on North Korea until it has completely eliminated its nuclear and ballistic missile programs.\nEven without nuclear warheads, North Korea’s missiles have repeatedly violated Japanese airspace, prompting Japan to implement an unprecedented program of civilian missile defense drills. Japanese defense planners have noted North Korean missiles with relatively short maximum ranges could hit Japanese cities with chemical or biological payloads that would cause enormous loss of life in densely populated urban areas.\nMattis paid his visit to Tokyo amid Japanese concerns that America’s suspension of joint military exercises with South Korea to placate North Korea will jeopardize regional security, and that North Korea may demand the suspension of exercises with Japan as well. Japan is also worried that closing the North Korean denuclearization deal will involve dangerous concessions to the aspiring regional hegemon, China.\nMattis specifically addressed Japan’s concerns about military exercises. He said the decision to suspend drills with South Korea was made “to create space for our diplomats to negotiate strongly and increase the prospect for a peaceful solution on the peninsula.”\n“At the same time, we maintain a strong collaborative defensive stance to ensure our diplomats continue to negotiate from a position of unquestioned strength,” he added. “Our objective remains the complete, irreversible and verifiable dismantling of North Korean nuclear ballistic missile programs.”\nMattis and Onodera also discussed China’s aggressive actions in areas where Japan has territorial claims.\n“We shared our understanding of the situation in the East and South China seas and once again we affirmed that Article 5 of the Japan-U.S. security treaty applies to the Senkaku Islands. We reaffirm the importance of our commitment to the South China Sea,” Onodera said after the meeting.\nDuring his appearance with Onodera, Mattis highlighted a pin worn by the Japanese defense minister to commemorate the Japanese citizens abducted by North Korea during the 1970s and 1980s. Japan wants North Korea to disclose the fate of at least a dozen victims who are still unaccounted for and repatriate their remains if they are deceased.\n“I noted with respect the blue lapel pin you wear, and we’re with you,” said Mattis.","url":"https://www.breitbart.com/national-security/2018/06/29/mattis-tokyo-longstanding-alliance-between-japan-u-s-stands-firm/"}
