{"authors":["Sabienna Bowman"],"date_download":"2018-10-31 01:48:41","date_modify":"2018-10-31 01:48:41","date_publish":"2018-09-13 22:46:19","description":"Remember that thrill you got when you heard the Gilmore Girls reboot was actually happening? Well, it turns out that Matt Czuchry found out about the Gilmore Girls reboot via the internet too. While that's cool for the fans, it's got to be…","filename":"data/vaneerConsumption/MattCzuchryRealizedTheGilmoreGirlsRevivalWasHappeningJustLikeEveryoneElseVIDEO.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/13/7032661f-8315-4bf7-b82e-636de6921541-getty-958610314.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_matt-czuchry-realized-the-gilmore-girls-revival-was-happening-just-like-everyone-else-video-11913961_1540950521.html","title":"Matt Czuchry Realized The 'Gilmore Girls' Revival Was Happening Just Like Everyone Else - VIDEO","title_page":"Matt Czuchry Realized The 'Gilmore Girls' Revival Was Happening Just Like Everyone Else — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Remember that thrill you got when you heard the Gilmore Girls reboot was actually happening? Well, it turns out that Matt Czuchry found out about the Gilmore Girls reboot via the internet too. While that's cool for the fans, it's got to be surprising for an actor who went on to play such a pivotal role in the Netflix series.\nDuring a new interview with Jimmy Fallon, Czuchry discussed the day he found out that Gilmore Girls was coming back. He told Fallon,\n\"You know, I found out the reboot was happening online like everybody else. I swear, I had no idea, and I was doing 'The Good Wife' at the time, and I came downstairs, and people had seen it online. And everyone was like, 'Are you doing this? Are you doing this?' And I was like, 'I just found out. I don't know!'\"\nCzuchry not only went on to be asked back for the Gilmore Girls revival, he also played a major role in the story. Logan and Rory's romance formed one of the four-part series' most pivotal plot-lines and (probably) led to that major Rory cliffhanger. Given how important his character was to the plot, it sounds like series creator Amy Sherman-Palladino must have been optimistic about getting Czuchry back — even though he did hear about the reboot at the same time as the rest of the world.\nThe Tonight Show Starring Jimmy Fallon on YouTube\nFor his part, Czuchry still sounds like a passionate supporter of the series, and he's still Team Logan. He even teased Fallon about being Team Jess at the start of the interview. Way back in 2016, the late night host pledged his fealty to Team Jess during a monologue about his Gilmore Girls marathon. And Czuchry didn't let him forget about the fact that he's on another shipping team. At the start of the interview, The Resident actor says, \"I figured I had to make a good entrance, because I hear you're Team Jess. So thank you for having me on anyway, man.\"\nFallon was quick to assure Czuchry that he loves him and Logan too, but as any Gilmore Girls fan knows, the fandom takes its ships very seriously. That only makes the fact that Czuchry still supports Logan and Rory all the more adorable. Sure, he starred in the show, but he sounds like he's still a fan too.\nNot only did Czuchry immediately know the name of the episode Fallon had a still of — \"You Jump, I Jump, Jack\" — he also spoke fondly about his experience filming the reboot. He explained, \"The reboot that was really cool because it was kind of like going to college again.\"\nDespite the unconventional way that he found out Gilmore Girls was returning, it sounds like Czuchry had a blast returning to the world of Stars Hollow. While Fallon didn't ask him if he would be open to return for a second reboot, it sounds like the actor wouldn't be opposed to the idea if the opportunity ever presents itself. Of course, he'd probably find out about a second revival the same way he found out about the first — on the internet with the rest of the fans.","url":"https://www.bustle.com/p/matt-czuchry-realized-the-gilmore-girls-revival-was-happening-just-like-everyone-else-video-11913961"}
