{"authors":["Riath Al-Samarrai For Mailonline"],"date_download":"2018-10-23 01:53:47","date_modify":"2018-10-23 01:53:47","date_publish":"2016-01-29 16:05:24","description":"Roman Abramovich has added the increasingly impressive Spurs manager to his shortlist of candidates to take over from Guus Hiddink in the summer.","filename":"data/vaneerConsumption/MauricioPochettinowillnotreplaceGuusHiddinkatChelseaasTottenhambossinsistsImveryhappyhere.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30A1D06000000578-0-image-a-105_1454083489575.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423065_Mauricio-Pochettino-not-replace-Guus-Hiddink-Chelsea-Tottenham-boss-insists-m-happy-here_1540259627.html","title":"Mauricio Pochettino will not replace Guus Hiddink at Chelsea as Tottenham boss insists 'I'm very happy here'","title_page":"Mauricio Pochettino will not replace Guus Hiddink at Chelsea as Tottenham boss insists 'I'm very happy here' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mauricio Pochettino has declared he has no interest in leaving Tottenham amid interest from Chelsea.\nRoman Abramovich has added the increasingly impressive Spurs manager to his shortlist of candidates to take over from Guus Hiddink in the summer.\nTottenham chairman Daniel Levy will block any approach at all costs and Pochettino was adamant on Friday that he is happy at White Hart Lane, where he has three and a half years to run on his five-year deal. Whether that stance changes in the face of a firm offer remains to be seen.\nMauricio Pochettino watches his Spurs players in training during a mid-season trip away for the squad\nPochettino has been touted as a possible replacement for Guus Hiddink when he leaves Chelsea this summer\nWhen asked about Chelsea’s interest, he said: ‘We are supposed to receive the rumours. But I don't care about that.\n‘I always work for the present and the future. I'm very happy here. We've created after 18 months a very good group, with a strong basis for success in the future and I'm very happy.\n‘My job is to be focused, not to hear rumours. The most important thing is that I'm focused on my job.\n‘My focus is here, to try for success at Tottenham and to work hard.’\nPochettino’s side travel to League One club Colchester on Saturday for their FA Cup fourth-round clash. Tottenham are likely to rest several key players for the tie, though Pochettino insists the competition is ‘important’ among his priorities this season.\nPochettino says he is happy at the club and his job is to ignore the rumours about his future\nPochettino believes he has a 'strong squad' and is building towards the future at Tottenham\nHe said: ‘It's a competition that's exciting to play in - I am excited to play at Colchester.\n‘You can see the reality of football there - the smell, everything is different. It is real football.\n‘For me, the 23, 24 players that we have all deserve to play and I need to decide which players to pick in different games.\n‘Always we want to speak about the squad, and I think that we have a strong squad.\n‘It's true that maybe tomorrow you need to share the minutes because we have a lot of games ahead, and we're coming in from a very busy period too.\n‘But it's not a distraction, it's an important competition for us.’","url":"https://www.dailymail.co.uk/sport/football/article-3423065/Mauricio-Pochettino-not-replace-Guus-Hiddink-Chelsea-Tottenham-boss-insists-m-happy-here.html"}
