{"authors":[],"date_download":"2018-10-30 14:11:59","date_modify":"2018-10-30 14:11:59","date_publish":"2018-10-30 00:00:00","description":"Maureen Downey is a longtime reporter for the AJC where she has written editorials and opinion pieces about local, state and federal education policy for 12 years. She’s also taught college classes in mass communications and journalism.However, she’s learned more about schools from having four children in them. Her children range in age from 24 to 14, so she’s now dealing with elementary school and college. Her own education includes an undergraduate degree from the University of Delaware and a master’s degree from Columbia University. She has worked for newspapers in New Jersey and Florida and has covered many school boards. She has won many editorial writing awards, including a National Headliner award. She was a finalist for the Pulitzer Prize for her AJC editorials on the Genarlow Wilson case.Read Maureen Downey's Get Schooled blog","filename":"data/vaneerConsumption/MaureenDowney.json","image_url":"https://www.ajc.com/rf/image_large/Pub/Web/AJC/Special%20Contents/StaffMembers/Images/downeymaureen.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/online_contacts_maureen-downey__1540908719.html","title":"Maureen Downey","title_page":"Maureen Downey","title_rss":"NULL","source_domain":"ajc.com","text":"Maureen Downey is a longtime reporter for the AJC where she has written editorials and opinion pieces about local, state and federal education policy for more than 20 years. She’s also taught college classes in mass communications and journalism.However, she’s learned more about schools from having four children in them. Her own education includes an undergraduate degree from the University of Delaware and a master’s degree from Columbia University. She has worked for newspapers in New Jersey and Florida and has covered many school boards. She has won many editorial writing awards, including a National Headliner award. She was a finalist for the Pulitzer Prize for her AJC editorials on the Genarlow Wilson case. In June, the Education Writers Association named her Opinion Writer of the Year.","url":"https://www.ajc.com/online/contacts/maureen-downey/rey5QCsi9PV95VxcbaEmKJ/"}
