{"authors":["Pete Jenson For Mailonline"],"date_download":"2018-10-23 02:11:28","date_modify":"2018-10-23 02:11:28","date_publish":"2017-04-26 13:08:47","description":"PETE JENSON: Mauricio Pochettino didn't need much encouragement reigniting his feud with Xavi and Pep Guardiola this week; it was a knee-jerk reaction to a rivalry that has a long history.","filename":"data/vaneerConsumption/MauricioPochettinosbadbloodwithXavi.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F8183E800000578-0-image-a-63_1493208498130.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447572_Mauricio-Pochettino-s-bad-blood-Xavi_1540260688.html","title":"Mauricio Pochettino's bad blood with Xavi","title_page":"Mauricio Pochettino's bad blood with Xavi | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tottenham boss Mauricio Pochettino didn't need much encouragement reigniting his feud with Xavi and Pep Guardiola this week; it was a knee-jerk reaction to a rivalry that has a history going back to a time when all three were players.\nSportsmail has been told by sources close to Xavi that the quotes attributed to him regarding Dele Alli are fabricated. Spokesman Fernando Solanas said: 'Xavi didn't give any interview about Dele Alli. He thinks he is a great player but he has not spoken to Guardiola about him and even if he had would not have made their conversation public.'\nPochettino was not giving his former La Liga rival any benefit of the doubt on Tuesday, however, and his clear memories of specific run-ins belied enduring ill-feeling built up over the years.\nTottenham manager Mauricio Pochettino was unhappy with quotes attributed to Xavi\nSportsmail understands that Xavi did not speak about Dele Alli joining Manchester City\nTo understand why there is no love lost, the 2009-10 season is a good starting point with the two men at the heart of the rivalry between Barcelona and Espanyol at the time.\nPochettino, a much-loved former Espanyol player, had taken the reigns as first team coach at the start of the year and saved them from relegation.\nIn his first full season in charge - the 2009-10 campaign - he was already showing signs of the top coach he would become and he seemed to have the measure of Pep Guardiola's Barcelona.\nIt was tough to beat them with a massively inferior group of players but he sent out Espanyol teams that more than held their own against the best side in Europe at the time.\nPep Guardiola and Pochettino have a long-standing rivalry from their playing days in Spain\nPochettino is determined to keep hold of Alli, who was named PFA Young Player of the Year\nNo one had the measure of Barca back in 2009. Sir Alex Ferguson's Manchester United had just lost to them in the European Cup final but Pochettino fared better than many.\nWhen the two teams met in December at the Nou Camp, Barcelona were still reflecting in the glory of the treble they had won the previous season and Lionel Messi paraded his Ballon d'Or before supporters before the game.\nYet little Espanyol were intent on wrecking the party and should have left with a point but Xavi won a highly dubious penalty and Barca won the game. 'We have not seen very much difference between the team that is champion of everything and Barca today,' Pochettino said after the match.\nIf he was upset by the way his team had been beaten then he was even more incensed by the way they refused to admit their good fortune with the game's turning point decision. Guardiola said: 'The player [Raul Baena] has admitted to Xavi that it was a penalty.'\nZlatan Ibrahimovic scores a penalty for Barcelona against Espanyol at the Nou Camp in 2009\nGuardiola and Pochettino pose with Barcelona and Espanyol shirts back in February 2009\nBut that certainly didn't seem to be Baena's feeling when he confronted the referee after the game about the decision. Match official Eduardo Iturralde Gonzalez gave the player a second booking in the tunnel and wrote in his referee's report that Baena had said to him: 'You'll see it on the television! You'll see it on the television!'\nPost-match inquests over the spot-kick moment showed Baena was right. While Zlatan Ibrahimovic's penalty into the top corner was emphatic, the foul given on Xavi was doubtful to say the least. Baena might have put a hand on the Spain midfielder but the contact was never enough to have sent Xavi staggering backwards and toppling over. It was not a penalty.\nIt would not be the only run-in between Pochettino the coach and Barca. With Xavi as captain and Guardiola as manager they ruled the world for the next three seasons while Pochettino struggled on the limited resources of the city's second team.\n'It's an enmity, resulting not just from one incident but an accumulation of games. Pochettino will have played against Xavi so many times,' one Catalan journalist told me.\nXavi, pictured in action against Espanyol in 2013, faced Pochettino many times on the pitch\nThat same 'not you again' feeling surfaces every time he faces Guardiola now. No player has been sent off more in the history of Espanyol than Pochettino and Guardiola holds the same record for Barcelona.\nThat also helps explain why Pochettino has vowed never to take the Barcelona manager's job should it be offered.\nAlthough, again reflecting the bad feeling between the two clubs, journalists close to Barcelona say the reality is that Pochettino would never be offered the job anyway. They feel he plays the Espanyol loyalty card knowing full well his pledge will never be tested.\nHe is also well aware that it makes him look good to Real Madrid, who may well one day offer him the big job at the Bernabeu.","url":"https://www.dailymail.co.uk/sport/football/article-4447572/Mauricio-Pochettino-s-bad-blood-Xavi.html"}
