{"authors":[],"date_download":"2018-10-23 01:41:39","date_modify":"2018-10-23 01:41:39","date_publish":"2014-10-26 00:00:00","description":"Beiser gives some of her favorite rock and blues numbers a modern cello workover on her new album, Uncovered.","filename":"data/vaneerConsumption/MayaBeiserShredsTheCello.json","image_url":"https://media.npr.org/assets/img/2014/09/11/mayabeiser4_byioulex_wide-8b30c1ca97427f0f8e1f7f2cb03fd9edd85f63a3.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=347724682_1540258899.html","title":"Maya Beiser Shreds The Cello","title_page":"Maya Beiser Shreds The Cello : NPR","title_rss":"NULL","source_domain":"npr.org","text":"ARUN RATH, HOST:\nThrough the decades, classical cellists have studied the masters - Casals, Rostropovich, Jacqueline du Pre, Angus Young.\n(SOUNDBITE OF SONG, \"BACK IN BLACK\")\nRATH: All right, so maybe Angus Young doesn't usually make that list. But cellist Maya Beiser loves playing his music. She's giving some of her favorite rock and blues tunes a modern cello work-over on her new album, \"Uncovered.\" Maya Beiser is here with me in the studio. Welcome.\nMAYA BEISER: Thank you so much.\nRATH: So the first thing what I want to ask you while I'm hearing this music in my ear is how did you get that awesome electric guitar sound out of the cello for \"Back In Black\"?\nBEISER: (Laughter) Well, I'm lucky to have great sound engineer. (Laughter) But, you know, it's really my acoustic cello processed through an electric guitar fuzz box and re-amped.\n(SOUNDBITE OF SONG, \"BACK IN BLACK\")\nRATH: We should say, though, that this is - you are an established - people would call you a classical cellist. I mean, you play a lot of nontraditional repertoire, and you use that kind of processing that we talked about. But this is still a departure for you.\nBEISER: Yeah, I guess it is, although, you know, if you look at the trajectory of all the things I've done, this is very much within line because my whole kind of career mission has been to re-introduce new ideas and new sounds for the cello.\nRATH: You know, I have this feeling - it's something I complain about - is that I feel like classical music in America feels very conservative - that it - sometimes it's hard to hear music that's been written in modern times.\nBEISER: Oh, it does. It does, Arun. It's a big problem.\nRATH: So have you had resistance in playing the music you play and now playing rock 'n' roll?\nBEISER: Yeah. Initially, there was this sense of, oh, you know, contemporary music - nobody wants to hear it. But the truth is that it's kind of the reverse these days. You know, we need to make concert music part of the cultural landscape. And its great to play the great old masters from the past. But in order to really make it a relevant art form, the only way is really to play music that is relevant to our culture.\n(SOUNDBITE OF SONG, \"BACK IN BLACK\")\nRATH: One of your teachers was the great violinist Isaac Stern. And I understand you had a conversation with him about rock 'n' roll.\nBEISER: I did. You know, he was my first big mentor. I grew up in Israel. And I was discovered by Stern when I was 12. And around - a little after that time, I started to listen to rock 'n' roll. And I fell in love with Janis Joplin and with, you know, Brian Eno.\nAnd so I did go to Stern and told him about this music. And I was kind of a naive little girl, you know, and I said, you know, this music is so great. I would like to try to do it on the cello. And he looked at me very upset (laughter) and said, you know, this is really not serious music. (Laughter).\nRATH: Tell us about your first experience hearing Janis Joplin. I understand that had a big impact on you.\nBEISER: It did. Well, you know, the first time I heard Janis Joplin, it shook me to the core.\n(SOUNDBITE OF SONG, \"SUMMERTIME\")\nJANIS JOPLIN: (Singing) Summertime, time, time - child, the living is easy.\nBEISER: You know, you have to imagine a young accolade of any dogma experiencing her first transgression.\nRATH: (Laughter).\nBEISER: And I was, you know, very much, you know, classical music geek. And she just made her way into my inner shrine.\n(LAUGHTER)\nBEISER: And I just vowed right there and then that I would play - I wanted to play the cello the way that she sang.\n(SOUNDBITE OF SONG, \"SUMMERTIME\")\nRATH: I'm speaking with cellist Maya Beiser. Her new album is a collection of her versions of some classic rock and blues tunes. It's called \"Uncovered.\" You know, something we associate with classical music is a certain perfection - like, a purity of tone and that kind of thing. And one of the things you seem to embrace in this - I'm thinking of your cover of \"Lithium\"...\n(SOUNDBITE OF SONG, \"LITHIUM\")\nRATH: ...Of, you know, Kurt Cobain - that you kind of embrace the imperfections a little bit.\nBEISER: Yeah. I - actually, I love that.\n(LAUGHTER)\nBEISER: I mean, the idea of embracing the imperfection because one of the most problematic thing in the whole sort of, you know, Western classical approach is this incredible strive for - you know, you learn for years and years, just doing everything in the most perfect way. And I think it takes away from the personality of the performer. And, you know, for me, the performers that I've always loved the most were the ones who were kind of imperfect in a way. Pablo Casals is one good example of that. You know, there's...\nRATH: Great cellist.\nBEISER: Yeah, great cellist. Glenn Gould - there was always this really strong sense of personal voice. And when you talk about personal voice, then it's never about perfection. It's about something else. It's about expression. It's about imperfection in some way. You know, and so I think one of the things that I've learned to do is just kind of, like, to embrace that.\n(SOUNDBITE OF SONG, \"LITHIUM\")\nRATH: That's Maya Beiser. Her new album is a reimagining of a bunch of great rock and roll and blues songs. It's called \"Uncovered.\" Maya Beiser, it's been a blast speaking with you. Thank you so much.\nBEISER: Thank you so much, Arun.\n(SOUNDBITE OF SONG, \"LITHIUM\")\nCopyright © 2014 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=347724682"}
