{"authors":[],"date_download":"2018-10-30 01:26:26","date_modify":"2018-10-30 01:26:26","date_publish":"2015-08-27 00:00:00","description":null,"filename":"data/vaneerConsumption/Maybeweneedanewlaw.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_08_maybe_we_need_a_new_law_1540862786.html","title":"Maybe we need a new law...","title_page":"Maybe we need a new law...","title_rss":"NULL","source_domain":"americanthinker.com","text":"Maybe we need a new law...\nMaybe we need a new law banning mixed-race, homosexual ex-reporters from owning guns. Hey, a guy who’s pretty obviously mixed-race and openly homosexual, as well as a documented ex-reporter, killed two people in Virginia yesterday, and all the usual left-wing gun-grabbers are focusing on only one aspect of the crime: the inanimate handgun used by the mixed-race, homosexual ex-reporter who committed the despicable act. These lefties use every sensational killing as an excuse to call for more gun restrictions, almost like your neighborhood dogs that start howling when they hear a siren go off somewhere across town. My reasoning is that if it weren’t for the actions of the mixed-race homosexual ex-reporter, we wouldn’t be having this discussion at all. So obviously it is those three elements of the crime, every bit as much as the fact that a handgun was used, that we should be looking at to prevent future reoccurrences, right?\nRight? Of course, you readers see the preposterousness of the above argument. The fact that the perp was a mixed-race homosexual ex-reporter has no bearing on the events that transpired except the last element: his being fired most likely was a triggering event for this tragedy. And had we possessed laws that forbade mixed-race homosexuals from buying guns, these killings took place at such close proximity that a machete or an ax would have served as effectively as the handgun. Once again, the siren of tragedy has gone off, and every liberal gun-grabbing mutt who hears it begins to howl for more gun control and more restrictions on the rights of non-criminal free citizens. Amidst their liberal caterwauling, one good idea has come to me as a result of this latest tragedy. While I obviously hold no animosity against persons of mixed race or homosexuals, the same can’t be said for ex-reporters, or more precisely, all reporters, who should, to my way of thinking, all be made ex-reporters. Even without banning them from owning guns, we’d all be better off for it. Maybe we could ban them from owning computers and smartphones. Maybe we need a new law...","url":"https://www.americanthinker.com/blog/2015/08/maybe_we_need_a_new_law.html"}
