{"authors":["Daniel Sandford For Mailonline"],"date_download":"2018-10-23 01:51:51","date_modify":"2018-10-23 01:51:51","date_publish":"2016-01-11 13:14:11","description":"The Saints have only won one of their last 11 games in all competitions - a 4-0 drubbing of Arsenal on Boxing day and were knocked out of the FA Cup by Crystal Palace on Saturday.","filename":"data/vaneerConsumption/MaybeLionelMessicouldturnourseasonaroundSouthamptonsRonaldKoemanjokes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/2FDAF29B00000578-0-image-a-51_1452517973895.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3393852_Ronald-Koeman-admits-things-positive-Southampton-signed-Barcelona-star-Lionel-Messi_1540259511.html","title":"Maybe Lionel Messi could turn our season around, Southampton's Ronald Koeman jokes","title_page":"Maybe Lionel Messi could turn our season around, Southampton's Ronald Koeman jokes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Graziano Pelle could return for the visit of Watford on Wednesday\nSouthampton manager Ronald Koeman has said finding a January transfer window solution to help halt his sides slump in form, will be difficult.\nThe Saints have only won one of their last 11 games in all competitions - a 4-0 drubbing of Arsenal on Boxing day and were knocked out of the FA Cup by Crystal Palace on Saturday.\nHaving finished Seventh last season, their highest ever in the Premier League, Southampton have now dropped down to 13th and are desperately struggling for form and in particular goals.\nBarcelona superstar Lionel Messi is unlikely to join Southampton down on the South Coast\nRonald Koeman has admitted finding a January transfer target to help halt his sides slump will be difficult\n'First of all you need more players scoring goals.\n'It's not always about one player and it's difficult at this stage of the season to bring in one player who will change everything around .'\n'Of course we are trying to turn around several things in the club but we know that at the moment we miss some good attack players and scoring players, but we have a good squad to turn around it, Koeman told the media.'\nThe Southampton manager was highly optimistic, when suggesting the player that he would welcome aboard to help galvanize his struggling side.\n'Maybe if we sign (Barcelona forward Lionel) Messi then it looks very positive but that's not at this moment in the season,' he joked.\nTop-scorer Graziano Pelle could return to the side after four games out for the visit of Watford on Wednesday","url":"https://www.dailymail.co.uk/sport/football/article-3393852/Ronald-Koeman-admits-things-positive-Southampton-signed-Barcelona-star-Lionel-Messi.html"}
