{"authors":[],"date_download":"2018-10-30 01:02:59","date_modify":"2018-10-30 01:02:59","date_publish":"2014-10-31 00:00:00","description":null,"filename":"data/vaneerConsumption/MAYDAYusvideocontestsunexpectedwinner.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_10_maydayus_video_contests_unexpected_winner_1540861379.html","title":"MAYDAY.us video contest's unexpected winner","title_page":"MAYDAY.us video contest's unexpected winner","title_rss":"NULL","source_domain":"americanthinker.com","text":"I had been waiting to find out because I voted for my favorite a couple weeks ago, and I was curious how it fared.\nThe results are in. I received my e-mail today: “Thanks for voting in the #MAYDAYin30 video contest.”\nMayday.us is a liberal group, proudly supported by MoveOn.org and other left-wing organizations. They had an online video contest that they expected would attract all the liberals of the world, with the common goal of bashing Republicans and conservatives.\nThe rules were simple: one, post your video explaining why money in politics is bad (à la Citizens United), and two, whoever gets the most votes over a 30-day period wins. The winner’s video and the runner-up would be featured on the Mayday.us website.\nThey thought they were going to get videos like these “Bush in 30 Seconds” contest winners. (I encourage you to click on the link and view the two winners. Substitute Obama for Bush, and they are surprisingly ironic, although a liberal would never pick up on it.)\nThis sounds easy...but then the unexpected happened. The video titled “America’s Biggest Hypocrite,” starring Tom Steyer, starts getting all the votes.\nIn the end, the Tom Steyer video received 7,590 votes – four times more than all the other videos combined. Thirty-five times more than the next closest. The people have spoken. We have a winner. Right?\nMAYDAY! MAYDAY! What do we do?\nLike all good liberals, the contest organizers change the rules just days before the deadline.\nNow, at the end of thirty days, they throw out all those votes and open up a 24-hour voting period. The top ten in two categories will be viewed and voted on by an impartial panel, including the likes of George Takei and Jason Alexander.\nLet’s call them the Politburo.\nGuess what: “America’s Biggest Hypocrite” didn’t win. It was just one of 18 runners-up. Two videos that, combined, had less than two hundred votes won.\nYet another left-wing liberal lesson in democracy has failed. The majority matters only if it supports liberals' previously determined outcome. In the end, Mayday employed the same process that gives the democratically elected Kim Jong-un a 100%-of-the-vote victory in North Korea or makes Obama’s executive actions acceptable. It’s for the greater good.\nLong live democracy, comrade.","url":"https://www.americanthinker.com/blog/2014/10/maydayus_video_contests_unexpected_winner.html"}
