{"authors":["Matthew Debord"],"date_download":"2018-10-31 00:09:14","date_modify":"2018-10-31 00:09:14","date_publish":"2016-12-03 00:00:00","description":"Here's the verdict on the Mazda CX-9 crossover, the automaker's largest car with room for seven passengers in its three rows.","filename":"data/vaneerConsumption/MazdaCX9crossoverREVIEW.json","image_url":"https://amp.businessinsider.com/images/5841e27fba6eb620008b7513-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mazda-cx-9-crossover-review-2016-12_1540944554.html","title":"Mazda CX-9 crossover: REVIEW","title_page":"    Mazda CX-9 crossover: REVIEW - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"An excellent three-row crossover — with style! Matthew DeBord/BI Here's the verdict on the Mazda CX-9 crossover, the automaker's largest car with room for seven passengers in its three rows: It's terrific!\nNow the bad, and there's only one small complaint: the Skyactiv-G 2.5-liter, four-cylinder turbocharged engine cranks out only 250 horsepower, less than what you'd get in a competing vehicle with a V6 (think GMC Acadia, Ford Explorer, Honda Pilot). You just don't have that oomph you might expect from a people-and-stuff-hauler.\nFor what it's worth, CX-9 owners will be perfectly happy with the 23mpg-combined fuel economy they get from their crossover and not entirely miss the additional power. But then again, we've had this genre of three-row SUV for a while now and with the bigger ride comes the expectation of power.\nLooks as good as a BMW. Matthew DeBord/BI\nWith the CX-3, CX-5, and CX-9 making up its crossover lineup, Mazda has its bases well covered in the red-hot segment. The CX-9 lives more or less at the middle of this highly competitive realm, price-wise: there are several vehicles that, when optioned up, can cost quite a bit more than our well-equipped, Machine Gray, all-wheel-drive \"Signature\" test car, which came in at $45,215 (the no-frills trim level, front-wheel-drive, is about $32,000).\nMazda is easy to understand. It sells three sedans/wagons and three crossovers, in ascending scale. The Mazda 3 comes in four-door and five-door trim; and the Mazda 6 provides full-size roominess. The CX-9 is the Big Mazda, a step up from the CX-5 and much larger than the CX-3, which is really an entry level compact car. Then there's the wonderful Miata MX-5 roadster. And that's it.\nA well-composed interior. Matthew DeBord/BI\nWith SUV sales booming in the US, the CX-9's task is considerable: it has to be the vehicle of choice for suburban families. I have a family and I live in the suburbs — and I'm a previous owners of a Honda Odyssey minivan, which means I'm ideally suited to discern whether the CX-9 meets my needs.\nIt met them very nicely for the week I had it in my driveway.\nFirst off, the CX-9 looks sharp. I think Mazda has the best-designed non-luxury vehicles in the market. As a very big plus, it's in Mazda DNA to build cars that are fun to drive. The Miata is the obviously smile-creator in this respect, but the the only other auto brand that has organized its entire portfolio around the concept of driving pleasure is BMW. And I often think of Mazda as being the mass-market bimmer.\nFun to drive! Matthew DeBord/BI\nThe CX-9 isn't as much fun to slip into as, say, the CX-3, which is a peppy little thing. But apart from the issues with the poweplant, it does negotiate both standard suburban streets and winding roads with aplomb. It feels crisp and sharp and responsive, hiding its size and making good use of its six-speed transmission. The 0-60 time is just over 7 seconds, which is neither blisteringly fast nor sluggishly slow. The bottom line is that it feels as quick as it looks, with its shapely curves and neat angles.\nOn the highway, it's an effective cruising vessel, with adaptive cruise control, comfortable (in our case) heated leather seats, a third row that's sort of cramped and hard to get in and out of, but that gets that job done, and a perfectly adequate cargo hold under the hatch.\nThe infotainment system is fine, but a big dated-feeling. Matthew DeBord/BI\nThrow in a contemporary infotainment system running off a central screen and a 12-speaker Bose audio system and you're in fine shape for a road trip. (Another small complaint: Mazda's navigation system struck me as a bit harder to use than it should be. This was more of a feel reaction, however. It performed fine. But it came off as a tad dated — a reaction that could have more to do with my extensive exposure to state-of-the-art luxury infotainment and nav than it does with any problems the CX-9's system might have.)\nThere's a suite of driver-assist features, ranging from blind sport alerts to lane-departure warnings to \"smart\" emergency braking. All function as advertised.\nPlenty of room for stuff. Matthew DeBord/BI\nI actually know a few family types who own and adore the CX-9, so the word is obviously out regarding its allure. Mazda isn't as big of a player in this segment as Honda or Toyota, but Mazda has engineered and designed an excellent offering that worth a close look and a test-drive.\nAs with all these three-passenger minivan alternatives, I think it's a good idea to bring the family to the dealership to see what they think — your kids will be spending as muh time in the car as you will, and their opinions matter.\nSo there you have it. The Mazda CX-9 is everything you could want in a sub-$50,000 three-row crossover, plus a little bit extra in the form of some nice Mazda driving dynamics.","url":"https://www.businessinsider.com/mazda-cx-9-crossover-review-2016-12"}
