{"authors":["Matthew Debord"],"date_download":"2018-10-30 21:49:09","date_modify":"2018-10-30 21:49:09","date_publish":"2016-12-17 00:00:00","description":"The MX-5 was a car that made a deep and lasting impression on me in 2016.","filename":"data/vaneerConsumption/MazdaMX5Miata2016COTYREVIEWAGAIN.json","image_url":"https://amp.businessinsider.com/images/5835fe2ee02ba735318b5ca0-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mazda-mx-5-miata-2016-coty-review-again-2016-12_1540936149.html","title":"Mazda MX-5 Miata 2016 COTY: REVIEW AGAIN","title_page":"    Mazda MX-5 Miata 2016 COTY: REVIEW AGAIN - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Top down, autumn glory. Matthew DeBord/BI Editorial note: Business Insider just named its 2016 Car of the Year, the Acura NSX. In total there were 15 contenders for the award, narrowed down to six. We named five runners-up, but we also tested dozens of vehicles this year, not all of which we could consider for COTY. But some of them certainly made a lasting impression. So each member of the BI Transportation team is revisiting the car that they couldn't get out their head. For Senior Correspondent Matt DeBord, it was the latest generation of the Mazda Miata, a car he's loved for a very long time. Here's his second review of the MX-5!\nI'm an unapologetic Mazda MX-5 Miata fanboy.\nWhen I lived in Los Angeles, I owned one — a first-generation classic, with flip-up headlights — and I loved taking it out for jaunts up the Pacific Coast Highway and runs through the canyons.\nAs Mazda developed the car through subsequent generations, I thought it lost much of its essential roadster character and became more of sports car. But that all changed with the latest version of the peppy two-seater, the fourth iteration, which was unveiled in 2014.\nWe got a crack at the car over the winter, which wasn't ideal. But even after a snowstorm and on winter tires, the new Miata was still a blast: I put the top down and cranked up the heater and the seat-heaters. The car has lost 220 lbs. and now feels more like my old Miata.\nThe new Miata returned to my driveway recently and I got to take it on a proper autumn outing, in what for me is real roadster weather: when it's crisp and slightly chilly and a driving cap and maybe even some driving gloves make sense.\nYou already know that I adore the new MX-5. Here's a closer look at why, this time with more pictures:","url":"https://www.businessinsider.com/mazda-mx-5-miata-2016-coty-review-again-2016-12"}
