{"authors":["John Hutchinson For Mailonline"],"date_download":"2018-10-23 00:50:37","date_modify":"2018-10-23 00:50:37","date_publish":"2016-01-29 14:13:40","description":"Located on Kish Island, in the Persian gulf, a stone doorway opens up into a maze of walled passages and clear openings that is now partly open for tourists.","filename":"data/vaneerConsumption/MazetunnelsonKishIslandinthePersianGulfthatleavetouristsmesmerised.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/13/30B2C0C800000578-0-image-a-2_1454075546833.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3422715_Inside-underground-city-no-maze-tunnels-built-1-000-years-ago-Kish-Island-Persian-Gulf-leave-tourists-mesmerised_1540255837.html","title":"Maze tunnels on Kish Island in the Persian Gulf that leave tourists mesmerised","title_page":"Maze tunnels on Kish Island in the Persian Gulf that leave tourists mesmerised | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This underground city is so secret it doesn't even have a name.\nLocated on Kish Island, in the Persian gulf, a stone doorway opens up into a maze of walled passages and clear openings that is now partly open for tourists. Judging by the sheer numbers who visit - thousands a year - it's a mesmerising experience.\nIt is actually an ancient underground aqueduct built about 1,000 years ago for the distribution of goods and water to different parts of the island.\nThe city without a name, built underground on Kish Island in The Persian Gulf, attracts a million a year\nThe underground city is actually an ancient underground aqueduct built about 1,000 years ago\nThe tunnels, which have been reinforced over time for safety, snake through the island for over five miles.\nThe city, although without an official name, is known as the Kariz-e-Kish or Kish Qanat by locals.\nThose who inhabited the island tens of centuries ago built the aqueducts to channel fresh water that they'd discovered to their homes and farms.\nIt was moved around with the help of a series of wells - or channels - known as qanats.\nSnaking through the hills: The present length of the underground complex is about 3000 metres\nThe island has an estimated population of 26,000 residents and about one million people visit the island annually\nKish is a 91.5-square-kilometre (35.3 sq mi) resort island in the Persian Gulf\nThe ancient canals were expanded, and an underground city, with museum, art galleries, handicraft workshops, traditional and modern tea/coffee shops sprung up in modern times for tourists to enjoy.\nDue to its free trade zone status Kish Island is touted as a consumer's paradise, with numerous malls, shopping centres, tourist attractions, and resort hotels.\nIt has an estimated population of 26,000 residents and about one million people visit the island annually.\nThe city, although without an official name, is known as the Kariz-e-Kish or Kish Qanat by locals\nAn ancient portrait engraved on one of the many snaking walls in the underground city\nStep to it: This picture shows one of the tunnels leading to daylight above\nKish Island was ranked among the world's 10 most beautiful islands by The New York Times in 2010.\nAnd it's the fourth most-visited vacation destination in Southwest Asia after Dubai, United Arab Emirates and Sharm el-Sheikh.\nAnother tourist attraction on Kish Island is the Greek wreck of a 1943 cargo steamship, the Koula F, on a beach on Kish's south-west coast.\nThose who lived on Kish Island tens of centuries ago stroked the coralline layers of the island in search of water\nThe ancient canals were expanded, and an underground city was the stunning result\nThis will have been used as a water cooling storage building, or an Abanbar, in ancient times\nShe was originally a British ship, Empire Trumpet, and was built in Scotland.\nShe ran aground in 1966 and all attempts to salvage her failed.\nWhen Koula F's crew abandoned her they set her on fire, and all that remains is her steel hulk.\nKish Island is the fourth most visited vacation destination in southwest Asia after Dubai, United Arab Emirates, and Sharm el-Sheikh\nNow there are museums, art galleries, handicraft workshops, traditional and modern tea and coffee shops for tourists to enjoy at the underground city","url":"https://www.dailymail.co.uk/travel/travel_news/article-3422715/Inside-underground-city-no-maze-tunnels-built-1-000-years-ago-Kish-Island-Persian-Gulf-leave-tourists-mesmerised.html"}
