{"authors":["Nikki Schwab","U.S. Political Reporter For Dailymail.Com"],"date_download":"2018-10-22 21:39:50","date_modify":"2018-10-22 21:39:50","date_publish":"2017-03-16 01:48:50","description":"Sen. John McCain, R-Ariz., lost it on Sen. Rand Paul on the Senate floor today after the Kentucky Republican expressed that he was against Montenegro joining NATO.","filename":"data/vaneerConsumption/McCainsuggestsRandPaulisworkingforVladimirPutin.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/01/3E5035FE00000578-0-image-a-8_1489628696188.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318568_McCain-charges-Rand-Paul-working-Vladimir-Putin_1540244390.html","title":"McCain suggests Rand Paul is 'working for Vladimir Putin'","title_page":"McCain suggests Rand Paul is 'working for Vladimir Putin' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Sen. John McCain, R-Ariz., lost it on Sen. Rand Paul on the Senate floor today after the Kentucky Republican expressed that he was against Montenegro joining NATO.\n'The senator from Kentucky is now working for Vladimir Putin,' McCain loudly charged after berating his GOP peer for several minutes.\nPaul issued a statement later that explained he was against Montenegro joining the North Atlantic Treaty Organization because the U.S.'s military commitments are already stretched and the country has already pledged to defend the 28 countries in NATO.\nScroll down for video\nSen. John McCain accused Sen. Rand Paul of 'working for Vladimir Putin' by objecting to Montenegro's joining of NATO\nSen. Rand Paul uttered 'I object' when Sen. John McCain called for unanimous consent to move the bill forward and then slunk off the Senate floor - which enraged McCain further\n'Is it unwise to expand the monetary and military obligations of the United States given the burden of our $20 trillion debt,' Paul said.\nMcCain did not see it this way and suggested that not letting Montenegro join in would mainly benefit Russian President Vladimir Putin.\n'You are achieving the objectives of Vladimir Putin,' the Arizona Republican said of Paul, accusing the Russian leader of 'trying to dismember this small country, which has already been the subject of an attempted coup.'\nAiming the comments again at Paul, McCain said, 'If they object, they are now carrying out the desires and ambitions of Vladimir Putin and I do not say that lightly.'\nMcCain then asked for unanimous consent to move the bill forward.\nPaul countered by moving toward a microphone, uttering 'I object,' and hightailing it off the Senate floor.\nThis move really annoyed the more senior senator.\n'I note the senator from Kentucky leaving the floor without justification or any rationale for the action he has just taken,' McCain said.\n'That is really remarkable, that a senator blocking a treaty that is supported by the overwhelming number – perhaps 98, at least, of his colleagues – would come to the floor and object and walk away,' he stated, visibly angered.\nThen McCain took it a step further.\n'The only conclusion you can draw when he walks away is he has no justification for his objection to having a small nation be part of NATO that is under assault from the Russians,' McCain said.\n'So, I repeat again, the senator from Kentucky is now working for Vladimir Putin,' McCain said.\nLater, McCain's communications director Julia Tarallo tried to explain what got McCain so steamed.\n'The overwhelming majority of senators who support this treaty, and certainly the people of Montenegro, deserved an explanation from Senator Paul on the Senate floor as to why he sought to prevent this small, brave country from joining in the defense of the free world,' she explained.","url":"https://www.dailymail.co.uk/news/article-4318568/McCain-charges-Rand-Paul-working-Vladimir-Putin.html"}
