{"authors":[],"date_download":"2018-10-22 22:19:54","date_modify":"2018-10-22 22:19:54","date_publish":"2014-05-09 19:25:18","description":"The senator stopped short of calling for the resignation of the veterans secretary, who will answer questions from the House and Senate.","filename":"data/vaneerConsumption/McCainSaysVAScandalUnacceptableExpectsIttoGetaLotBigger.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/433381/140509-john-mccain-va-1848_9decf373b1ce4a65d7cb34fffa54872c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_va-hospital-scandal_mccain-says-va-scandal-unacceptable-expects-it-get-lot-bigger-n101706_1540246794.html","title":"McCain Says VA Scandal 'Unacceptable,' Expects It to 'Get a Lot Bigger'","title_page":"McCain Says VA Scandal 'Unacceptable,' Expects It to 'Get a Lot Bigger'","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSen. John McCain said Friday it is “unacceptable” that at least 40 patients may have died waiting for appointments at a Veterans Administration hospital in Phoenix, and suggested that additional evidence of neglect in the VA system will be uncovered.\n“Now we are hearing about similar situations in major VA facilities throughout the country,” the senator, a Vietnam veteran, told NBC News. “I think this is going to get a lot bigger before it’s over.”\nMcCain stopped short of calling for the resignation of Eric Shinseki, the secretary of veterans affairs, but he said that Shinseki is ultimately responsible for the VA. At least five Republican members of Congress and the American Legion have said that he should resign.\n“If this is as big and widespread as it appears to be, he should have known,” McCain said.\nSpeaking more broadly, he told a town hall meeting later in Arizona: “If these allegations are true, there is a violation of law, and it’s not a matter of resignation — it’s a matter of whether somebody goes to jail.”\nHospital whistleblowers have said that administrators at the Phoenix facility, trying to improve their performance record, ordered that thousands of appointment requests be diverted to a secret, unofficial list of veterans awaiting appointments.\nIf the patients died, their names would simply disappear, the whistleblower said.\nShinseki has ordered a nationwide audit of access to health care through the VA. Administrators at the Phoenix hospital have not publicly answered the allegations.\nMcCain said, however, that the Phoenix administrators “denied everything” when he and Arizona's other Republican senator, Jeff Flake, questioned them directly.\nLong before the Phoenix scandal broke last week, internal government reports showed significant delays in patient care at 10 VA facilities in eight states and the District of Columbia, including some that may have resulted in deaths.\nFor instance, at a VA facility in South Carolina, a “disturbing set of events” led to thousands of delayed consultations for colon cancer screening, according to a 2013 internal VA report.\nMore than 50 veterans had a delayed diagnosis of colon cancer, and some of them died from the disease, the assistant VA inspector general told a House committee last month.\nAt his office, McCain said, the number of calls from veterans reporting delayed or denied VA care has “skyrocketed” since the Phoenix story broke.\nBesides the 40 patients in Phoenix, “How many got sicker and sicker, and more and more serious problems with illness, or that needed medical care that they didn’t receive?” the senator said. “We have no idea how many that is.”\nA House committee has ordered Shinseki to turn over emails and other correspondence with VA leaders dating to April 9. Shinseki is also scheduled to appear before a Senate committee next week.\nJay Carney, the White House press secretary, told MSNBC on Friday that President Barack Obama has confidence in Shinseki.\n— Kelly O’Donnell and Erin McClam","url":"https://www.nbcnews.com/storyline/va-hospital-scandal/mccain-says-va-scandal-unacceptable-expects-it-get-lot-bigger-n101706"}
