{"authors":["D. Orlando Ledbetter"],"date_download":"2018-10-30 17:50:16","date_modify":"2018-10-30 17:50:16","date_publish":"2018-10-30 16:25:00","description":"Former NFL receiver Ed McCaffrey and Alex Marvez discussed the Washington Redskins on SiriusXM NFL r...","filename":"data/vaneerConsumption/McCaffreyRedskinsaretherealdeal.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/WashingtonPost/2018/10/29/Images/fbn-redskins-a3043aee-dbe1-11e8-b3f0-62607289efee.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-falcons_mccaffrey-redskins-are-the-real-deal__1540921816.html","title":"McCaffrey: ‘(Redskins) are the real deal’","title_page":"McCaffrey: ‘(Redskins) are the real deal’ ","title_rss":"NULL","source_domain":"ajc.com","text":"Former NFL receiver Ed McCaffrey and Alex Marvez discussed the Washington Redskins on SiriusXM NFL radio on Tuesday.\nThe Falcons (3-4) play the Redskins (5-2) at 1 p.m. Sunday at FedEx Field in Landover, Md.\nThe re-tooled Redskins traded for quarterback Alex Smith over the offseason and took a flyer on veteran running back Adrian Peterson. Their last few drafts have been defense-heavy.\nThey are winning with a running game and stout defense that is second in the league against the run.\n“I think they are the real deal,” McCaffrey said. “I think they are the favorite to win the division. I think they can put up points and play great defense. On any given day, this is a team that can beat anybody. I’m definitely buying the Washington Redskins and what they have going.”\nSmith has completed 144 of 228 passes (63.2 percent) for 1,561 yards, eight touchdowns and two interceptions. He has a passer rating of 91.3.\n“They brought in a quarterback to be a team leader,” McCaffrey said. “That was a good decision. He can make throws. Maybe he’s a little too conservative for some people’s liking, but he doesn’t turn the ball over.”\nPeterson, 33, has rushed 127 times for 587 yards (4.6 yards per carry) and four touchdowns.\n“They have a strong run game,” McCaffrey said. “Peterson has turned out to be great (addition). They are running the football. They are controlling the lines of scrimmage. They have some play makers.”\nTight end Jordan Reed is the Redskins top receiver. He has 29 catches for 306 yards and one touchdown.\nOther weapons include running back Chris Thompson, wide receiver Paul Richardson and wide receiver Josh Doctson, Jamison Crowder and tight end Vernon Davis\n“Even though they don’t have someone who just blows up the stat sheet they spread the ball out to a lot of different players,” McCaffrey said. “When healthy, they do have a receiving corps and guys who can make plays at the skill positions. They are doing well up front with the (offensive) line.”\nThe defense is built around young tackles Da’Ron Payne and Jonathan Allen, who both played at Alabama.\n“They play pretty stout defense,” McCaffrey said. “That’s a physical brand of football.”","url":"https://www.ajc.com/blog/atlanta-falcons/mccaffrey-redskins-are-the-real-deal/NNosPcf7RsOpu0UqLZNNzI/"}
