{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:39:22","date_modify":"2018-10-30 21:39:22","date_publish":"2015-04-08 12:36:53","description":"Topping off the day of his Senate re-election bid announcement, Senator John McCain joined Fox’s Greta Van Susteren, taking the opportunity to emphasize national security issues and express his support of Senator Lindsey Graham for president.","filename":"data/vaneerConsumption/McCainPromotesSenateReelectionLindseyGrahamforPresident.json","image_url":"https://media.breitbart.com/media/2015/04/ap_john-mccain_ap-photo-e1428453592673.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_08__1540935562.html","title":"McCain Promotes Senate Re-election, Lindsey Graham for President","title_page":"McCain Promotes Senate Re-election, Lindsey Graham for President | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Topping off the day of his Senate re-election bid announcement, Senator John McCain joined Fox’s Greta Van Susteren, taking the opportunity to emphasize national security issues and express his support of Senator Lindsey Graham for president.\nMcCain has recently expressed that he expects to face a primary challenger for the Senate seat in the 2016 primary.\n“It wasn’t too difficult” to make a decision to run again, McCain told Van Susteren, stating, “the country and the world is in more turmoil than ever before.” McCain focused in on the popular topic of Obama’s “failed presidency” and foreign policy, while also mentioning there is much to be done in Arizona as well.\nThe interview focused on foreign policy, with Van Susteren asking McCain for his thoughts on Secretary of State John Kerry’s work on nuclear negotiations with Iran. McCain responded, “John Kerry’s had a series of failures,” saying Kerry was “obvious to all of us who know him that he was desperate for some kind of an agreement” in light of previous failures.\nClarifying to Van Susteren, McCain said Kerry was “willing to make concessions that are obviously now a very flawed treaty or certainly very questionable. Certainly there is two different versions of this ‘agreement’ between the Iranians and the U.S.” He pointed out the deal included “no restraint on Iranian behavior.”\nWhen asked about recently declared Republican presidential candidates and fellow Senators Ted Cruz and Rand Paul, McCain called both “very bright, new members of the Senate.” Cruz was elected in 2012 and Paul in 2010. McCain has held on to his seat for over three decades.\nMcCain, with clear bias toward his pick for 2016, continued, “Senator Cruz is a valuable member of the Armed Services Committee. Rand Paul obviously has a strong base, some of it inherited from his father. I’m very interested in Rand Paul’s past views as well as evolving views on national security. Obviously it seems to me some of those have changed somewhat as the situation in the Middle East has deteriorated, but look I’ve been through it. It’s a tough grind. I wish them both well and I’ll be supporting Lindsey Graham whose the person who really knows how to handle these national security challenges.”\nMcCain continued to hone in on Obama’s foreign policy, calling it immoral and failed, pointing out Somalia and Yemen as examples.\nConsidered the establishment Washington candidate, McCain is expected to face a potentially strong challenge. Within hours of McCain’s announcement, at least two major conservative groups were detailing their disapproval of McCain’s record, one adding in a push for support of a McCain primary challenge.\nArizona State Sentor Kelli Ward has been called a “rising star” in Arizona and has been strongly encouraged to challenge McCain in 2016. The practicing medical doctor and military wife noted in an interview with Breitbart News that McCain has failed to follow through on a 2010 campaign promise to “build the danged fence.”\nU.S. Representative Matt Salmon’s name has also been thrown around as a potential McCain challenger, but he has remained quiet on his level of consideration. A source close to Salmon told Breitbart News in March that Salmon has received a push from supporters to run for Senate and as a result he is considering the seat.\nLeading up to his announcement, McCain and wife Cindy released strong fundraising pleas, emphasizing concern over being targeted by “a wide array of powerful groups” and facing a “unique set of challenges.”\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2015/04/08/mccain-promotes-senate-re-election-lindsey-graham-for-president/"}
