{"authors":[],"date_download":"2018-10-22 21:29:25","date_modify":"2018-10-22 21:29:25","date_publish":"2014-05-07 14:41:01","description":"\"They have something that suggests it’s worth looking for a body,” said former Detective Chief Inspector Peter Kirkham.","filename":"data/vaneerConsumption/McCannCopsAreProbablyLookingForaBodyExDetectiveChief.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_12/262826/140319-mccann-jhc-0952_ea0625a8b55285877ecec1b8aa62b3b5.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_mccann-cops-are-probably-looking-body-ex-detective-chief-n99261_1540243765.html","title":"McCann Cops Are Probably Looking For a Body: Ex-Detective Chief","title_page":"McCann Cops Are Probably Looking For a Body: Ex-Detective Chief","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA police dig in the Portuguese vacation resort where Madeleine McCann went missing is likely to be looking for a body, a former Detective Chief Inspector with London’s Metropolitan Police said Wednesday.\n“They could be looking for clothing, it could be weapons or some sort of other evidence, but in the case of the disappearance of a child the most obvious explanation would be that they have something that suggests it’s worth looking for a body,” said Peter Kirkham, who worked on numerous homicide investigations during his 21-year police career.\n“Clothes last quite a significant amount of time in some form and things like buttons and zips last indefinitely. Weapons last pretty much for centuries,” he added. “But if you said to me the police were digging a large open space, then 99 times out of 100 I would say to you they will be looking for a body.”\nBritish police would not comment on the investigation but two independent sources have told NBC News that the dig will likely take place in or near Portugal’s Praia da Luz resort where the 3-year-old went missing seven years ago.\n\"Activity will occur in forthcoming weeks,\" Mark Rowley, an Assistant Commissioner with London's Metropolitan Police said in a letter on Tuesday.\nInvestigators will likely scan the ground with radar technology similar to the type used on archaeological digs, said Kirkham, who now works as a policing consultant.\n“It gives you an idea of any anomalies in the ground which might be from natural geology or disturbed ground, or items in the ground,” he said. “It’s a precise technology so if the ground is good enough it will give you a three dimensional scan of the ground under your feet, giving you a good idea of how deep any anomalies are.”\nIf investigators find something they feel is worth is looking at, a digger removes much of the ground before specialist non-police officer experts move in, he added. These are often forensic scientists from universities or private companies, he said.\n“From then on it is hands and knees with a small trowel, keeping all the soil you remove, knowing where it came from, which level, which area, bagging it and sieving through it, making sure you’re not missing the thing you are looking for,” said Kirkham. “This is not unusual in murder cases where bodies or items have been buried.”\nMadeleine's disappearance from an apartment in a Portuguese vacation complex on the night of May 3, 2007, garnered international attention. Since then, her parents Kate and Gerry McCann have worked to keep the case in the spotlight.\nKate McCann said on Thursday that great progress has been made with the investigation since London’s Metropolitan Police reopened the case in July after two years of reviewing case documents.","url":"https://www.nbcnews.com/news/world/mccann-cops-are-probably-looking-body-ex-detective-chief-n99261"}
