{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:39:28","date_modify":"2018-10-30 21:39:28","date_publish":"2015-03-25 20:53:51","description":"John McCain hasn't announced a reelection bid yet, but he's already asking his friends to pony up to support him. |","filename":"data/vaneerConsumption/McCainEmailsSupportersImWorriedIMayNotWinReelectionEasily.json","image_url":"https://media.breitbart.com/media/2015/03/McCain-319-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_25__1540935568.html","title":"McCain Emails Supporters: I'm Worried I May Not Win Reelection Easily","title_page":"McCain Emails Supporters: I'm Worried I May Not Win Reelection Easily | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"U.S. Senator John McCain is asking for funds as the strong threat of a Republican primary challenger looms heading into 2016. Tuesday afternoon he made a hard push for contributor cash to Friends of John McCain email subscribers.\nMcCain’s appeal letter opens by thanking supporters, and acknowledges his 2016 campaign would face a “unique set of challenges.”\nMcCain writes, “I’m going to be the target of a wide array of powerful groups,” meaning conservative critics. The letter invites the reader to “help to build a formidable campaign organization.” He adds, “There are few certainties in life,” then tries to encourage backers: “I am certain I will not be able to run for re-election unless I have your support.”\nThe McCain team is clearly reaching out to his base. The letter targets Obama’s foreign policy and cites America’s vulnerability because of a weak strategy that’s emboldened our enemies. “The result is that our nation is now in greater danger than at any time in our lives,” the letter adds.\nThe letter asks the reader to “stand with” McCain “at this pivotal time,” calling contributions to his campaign “much needed.”\nAt the close of the email McCain indicates his decision whether to run will “come soon” while suggesting a donation will help that decision along. “I need to know where you stand.”\nThe letter contained no fewer than six links to donate to the campaign.\nPotential challengers have begun voicing their intentions to enter a 2016 primary. Arizona State Senator Kelli Ward told Breitbart News that she is mulling a challenge to McCain. This week she joined Mark Levin on his radio program to discuss that possibility.\nU.S. Representative Matt Salmon is also seen as a potential contender, with early polling results between himself and McCain showing McCain’s vulnerability to a challenge according to a local Republican leader.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2015/03/25/mccain-emails-supporters-im-worried-i-may-not-win-reelection-easily/"}
