{"authors":[],"date_download":"2018-10-30 01:07:41","date_modify":"2018-10-30 01:07:41","date_publish":"2018-09-02 16:04:04","description":null,"filename":"data/vaneerConsumption/McCainandAFewWordsAboutCivility.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/09/8492350245_183441a8eb_k.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861661.html","title":"McCain and A Few Words About Civility","title_page":"McCain and A Few Words About CivilityThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Is it civil to settle scores at John McCain’s funeral?\nAs with so many things #Resistance, the opponents to President Trump answer incivility with worse incivility. This from Ana Navarro, for example, is disgusting:\nDamn! We’re only two eulogies into the #McCainfuneral, and I keep wondering how Jarvanka haven’t yet slinked out of their seats and crawled on their hands and knees out of that church. — Ana Navarro (@ananavarro) September 1, 2018\nIt’s so strange to make Donald Trump the center of one’s orbit when you hate him. Why? Why give him that power? But the resist crowd continues to do it even at the funeral of Trump’s nemesis, John McCain.\nThe whole thing is insulting – to Senator McCain’s memory, to the people who support Trump, to the people who grieve John McCain’s loss. This might be shocking, but there is a Venn diagram that overlaps, there. It is possible to vote for Donald Trump and appreciate John McCain’s service. Both John McCain and Donald Trump won a majority of Republican voters to their vision. This behavior forces polarization and division. It’s small, petty, and a spiteful way to end the memory of John McCain.\nBut okay. This is the nasty, venal world we live in now.\nDon’t blame Donald Trump for this behavior. Don’t. This is on the editors of newspapers, the commentators, the attendees, the speakers.\nHow difficult is it to be a decent human being? In this modern era, it seems to be too much to ask even of those who decry the incivility of the President.","url":"https://spectator.org/mccain-and-a-few-words-about-civility/"}
