{"authors":["Michelle Moons"],"date_download":"2018-10-30 21:39:33","date_modify":"2018-10-30 21:39:33","date_publish":"2015-03-23 16:05:12","description":"Friends of John McCain are trying to save him from a primary challenge in Arizona next year. |","filename":"data/vaneerConsumption/McCainAlliesAttempttoDissuadeChallengerWard.json","image_url":"https://media.breitbart.com/media/2015/01/McCain-129-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_23__1540935573.html","title":"McCain Allies Attempt to Dissuade Challenger Ward","title_page":"McCain Allies Attempt to Dissuade Challenger Ward | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Should U.S. Senator John McCain run for re-election, he knows he will likely face a primary challenger. So McCain advocates are already projecting the idea that the incumbent is “too big to fail” in 2016 as rising potential contenders like Arizona State Senator Kelli Ward consider taking on the challenge.\nLake Havasu City Republican Senator Ward describes herself on Twitter as a “mom, military wife, family doctor” with a focus on “liberty, freedom, personal responsibility” and small government. She wants to, “lead by following US Constitution.” Ward projected a similar description when speaking with The Arizona Republic on a potential McCain challenge while responding to potential critics and naysayers.\n“I definitely wouldn’t call myself middle-of-the-road, but I think that people who are in the middle of the road get run over by cars,” Ward told the Republic. “You have to take strong stances so that people know where you are coming from and know what they are going to get. People are tired of wishy-washy, back-and-forth politicians.”\nLast year the Arizona Republican Party formally censured McCain for stances determined too liberal, the Republic explains.\nLongtime Arizona pollster Bruce Merrill says, “After two presidential runs, the guy has 100 percent name ID: you either like him or you don’t like him,” the Republic reports. Merrill, who according to the New York Times worked on McCain’s 1982 House campaign, continued, “My experience is not betting against McCain, frankly, even if he may have a pretty tough race.”\nIn response to criticism over a public forum Ward held, at which the issue of chemtrails was brought up by audience members, Ward responded, “I don’t really have any opinions about ‘chemtrails’ one way or the other,” the Republic reports. Ward continued, “I think that environmental quality, though, is very important.”\nOthers have attempted to malign Ward over a trip to Nevada during a volatile standoff between rancher Cliven Bundy and the U.S. Bureau of Land Management. Ward says she took the trip when her constituents expressed concerns over the suppression of First Amendment free speech rights. The Republic noted Ward’s response to critics: “I wanted to see for myself what was happening there. … I was able to speak to a lot of people up there about the importance of peaceful, civil disobedience in order to get the attention of our government when it oversteps its bounds.”\nMcCain backer and longtime political consultant Sean Noble was referenced in the Republic, not surprisingly saying he has doubts that influential heavy-funding political groups such as the Club for Growth, FreedomWorks and the Senate Conservatives Fund would support Ward. He made the claim to the Republic that those heavy-hitter political funders wouldn’t “waste their money” on Ward.\nNoble disparaged the potential for the Arizona State Senator to overcome the McCain machine citing the 2010 Tea Party revolution during which the then fledgling grassroots group did not manage to unseat the U.S. Senator.\nWard does not seem put off about the idea of challenging the five-term incumbent Senator, saying “There are political insiders who think that I am out of my league or don’t know what I’m doing, but I think that I could be a viable candidate in this race.” Her comments to the Republic continued, “I’m a well-educated, conservative, down-to-earth, Constitution-loving woman who has proven herself in the Arizona State Senate to be exactly who I sold myself as during my first election.”\nRepresentative Paul Gosar, once considered a possible McCain challenger, says instead that he will pursue re-election to his own seat in the U.S. House of Representatives.\nNational political analyst and Rothenberg & Gonzales Political Report publisher Nathan Gonzales says, “Based on the past, John McCain has conservatives who don’t like him, but I think there’s still a big leap between not liking Senator McCain and defeating him in a primary.” Gonzales’ comments noted in the Republic continued, “He was prepared for his primary last time and defeated a credible opponent and I think he’s going to be ready for a primary again, if it happens. It’s going to be up to the challenger to prove it’s going to be a serious race.”\nRepresentative Matt Salmon’s name is also being floated as a potential contender for a McCain primary challenge, but has not made any official declaration at this point.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2015/03/23/mccain-allies-attempt-to-dissuade-challenger-ward/"}
