{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:15:59","date_modify":"2018-10-30 20:15:59","date_publish":"2015-07-28 23:51:49","description":"McConnell: Senate Will Vote to Defund Planned Parenthood","filename":"data/vaneerConsumption/McConnellSenateWillVotetoDefundPlannedParenthood.json","image_url":"https://media.breitbart.com/media/2015/06/ap_mitch-mcconnell_ap-photo3-e1509676675621.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_28__1540930559.html","title":"McConnell: Senate Will Vote to Defund Planned Parenthood","title_page":"McConnell: Senate Will Vote to Defund Planned Parenthood","title_rss":"NULL","source_domain":"breitbart.com","text":"Senate Majority Leader Mitch McConnell has assigned three Republican senators to develop a plan to defund Planned Parenthood.\nSen. Rand Paul, Sen. James Lankford, and Sen. Joni Ernst will work together to create a plan, according to Politico. The media organization adds that “The vote is all but certain to fail, given strong Democratic support for the organization.”\n“We’re going to see if we can have a meeting of the minds on what’s the best way to deal with these horrendous videos that we’ve all been viewing,” McConnell said on Tuesday.\nThe Senate will vote next week on a bill that would eliminate all $540 million in taxpayer funding the abortion industry giant receives.\nSenate Minority Leader Harry Reid and other top Democrats in the chamber have already rejected the idea of a moratorium on Planned Parenthood funding pending an investigation into the baby organ-harvesting practices described by the organization’s senior medical staff in undercover investigative videos. These leaders reportedly said they have the votes to defeat a GOP effort to defund Planned Parenthood.\n“I am furious that Republicans are once again trying to take away basic health care services for 2.7 million women,” said Sen. Patty Murray (D-Wash.). “We have stood strong before that we are going to make sure that women in this country have health care available, Planned Parenthood provides it. For Republicans to take it away is wrong.”\nThousands of Americans participated in rallies across the nation Tuesday to urge their state and federal lawmakers to investigate and defund Planned Parenthood in the wake of the revelations in the videos.","url":"https://www.breitbart.com/politics/2015/07/28/mcconnell-senate-will-vote-to-defund-planned-parenthood/"}
