{"authors":["The Associated Press"],"date_download":"2018-10-30 19:21:48","date_modify":"2018-10-30 19:21:48","date_publish":"2016-02-23 05:42:00","description":"WASHINGTON — Majority Leader Mitch McConnell ruled out any Senate action on whoever President Barack Obama nominates to fill the Supreme Court vacancy, a step that escalated the partisan election-year struggle over replacing the late Antonin Scalia.","filename":"data/vaneerConsumption/McConnellshutsdooronSenateactiononObamacourtpick.json","image_url":"https://media.arkansasonline.com/static/ao_redesign/graphics/adgog.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_feb_23_mcconnell-_67ed075bf95e57d39f2fe64940551e5d__page=2_1540927308.html","title":"McConnell shuts door on Senate action on Obama court pick","title_page":"McConnell shuts door on Senate action on Obama court pick ","title_rss":"NULL","source_domain":"arkansasonline.com","text":"WASHINGTON — Majority Leader Mitch McConnell ruled out any Senate action on whoever President Barack Obama nominates to fill the Supreme Court vacancy, a step that escalated the partisan election-year struggle over replacing the late Antonin Scalia.\nDemocrats promised unremitting pressure on Republicans to back down or face the consequences in November's voting.\nAfter winning unanimous public backing from the 11 Republicans on the Senate Judiciary Committee, McConnell told reporters that panel would hold no hearings and ruled out a full Senate vote until the next president offers a nomination.\n\"In short, there will not be action taken,\" McConnell told reporters.\nThe Kentucky Republican said he wouldn't even meet with an Obama selection should the White House follow tradition and send the nominee to Capitol Hill to visit senators.\n\"I don't know the purpose of such a visit,\" McConnell said. \"I would not be inclined to take one myself.\"\nObama is expected to announce a nomination in the next few weeks. Since the Senate started routinely referring presidential nominations to committees for action in 1955, every Supreme Court nominee not later withdrawn has received a Judiciary Committee hearing, according to the Senate Historical Office.\nRead Wednesday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2016/feb/23/mcconnell-shuts-door-senate-action-obama-court-pic/?page=2"}
