{"authors":[],"date_download":"2018-10-22 21:02:18","date_modify":"2018-10-22 21:02:18","date_publish":"2014-06-03 23:12:49","description":"Longtime Mississippi Sen. Thad Cochran and Tea Party challenger Chris McDaniel appeared to be headed to a runoff election.","filename":"data/vaneerConsumption/McDanielCochranAppearHeadedforRunoffinMississippi.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/485651/140603-cochran_mississippi_results-1910_3ebd96951a266798d5eb6b11c09d1113.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_mcdaniel-cochran-appear-headed-runoff-mississippi-n121851_1540242138.html","title":"McDaniel, Cochran Appear Headed for Runoff in Mississippi","title_page":"McDaniel, Cochran Appear Headed for Runoff in Mississippi ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nLongtime Mississippi Sen. Thad Cochran and Tea Party challenger Chris McDaniel appeared to be headed to a runoff election after neither candidate was able to garner a majority of the vote to become the state's Republican Senate nominee.\nWith nearly 98 percent of the votes in early Wednesday, McDaniel holds a slim lead over the incumbent, 49.6 percent to 48.8 percent, according to the Associated Press.\nIf neither candidate reaches 50 percent, the already bitterly fought campaign will last until the June 23 runoff in what has become the latest battle between an establishment Republican and Tea Party challenger.\n\"One way or the other I promise you this. Whether it's tomorrow or whether it's three weeks from tonight, we will stand victorious in this race,\" McDaniel told supporters early Wednesday morning.\nState Sen. McDaniel painted Cochran as a long-time Washington insider no longer conservative enough to represent the deep red state. But his campaign stumbled in recent weeks after a McDaniel supporter was arrested for allegedly photographing Cochran’s bedridden wife in a nursing home, making the close race even more heated.\nCochran then came out with an ad tying McDaniel to the incident, which his opponent called “shameful.”\nA McDaniel's victory would be a shot of life for the Tea Party, which has so far struggled to earn significant victories in 2014.\nAnti-establishment Republican candidates in Kentucky, North Carolina and Georgia faltered in primaries earlier this year and Mississippi was likely the last opportunity for the group to show its influence this political cycle.","url":"https://www.nbcnews.com/politics/first-read/mcdaniel-cochran-appear-headed-runoff-mississippi-n121851"}
