{"authors":["Press Association"],"date_download":"2018-10-23 02:39:09","date_modify":"2018-10-23 02:39:09","date_publish":"2017-04-26 13:49:09","description":"The fast food giant is looking to launch a \"small\" delivery pilot in the summer.","filename":"data/vaneerConsumption/McDonaldstotrialhomedeliveryserviceintheUK.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/13/wire-465221-1493210958-5_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4447708_McDonald-s-trial-home-delivery-service-UK_1540262349.html","title":"McDonald´s to trial home delivery service in the UK","title_page":"McDonald´s to trial home delivery service in the UK | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"McDonald’s is to roll out a long-awaited home delivery trial as UK consumers continue to embrace the rapidly expanding market.\nThe fast food giant said it was looking to launch a “small” delivery pilot this summer, with specific locations yet to be decided.\nA McDonald’s spokeswoman said: “It is no secret we have been looking at the potential of delivery in recent months.\nMcDonald's signage\n“This service is offered in other markets around the world and its growth within the UK continues to gather pace.\n“Listening to our customers, we know that this is a route they would like us to explore, and I can confirm that we are looking to launch a small delivery pilot this summer.\n“Specific locations to be included within this pilot are yet to be decided.”\nMcDonalds French fries\nThe announcement comes a week after KFC launched home deliveries across 30 restaurants in Greater London via the Just Eat platform.\nRecent figures show home deliveries of ready-to-eat food grew 10 times faster than the eating out market last year.\nThe delivery sector jumped almost 10% to 599 million visits in Britain last year, while total visits out to restaurants and other dining venues rose by just 1%, according to analysts NPD Group.\nThe delivery channel was worth £3.6 billion last year, a 6% increase on 2015 and 50% more than in 2008.\nMcDonald's signage\nThe study found the average bill for delivered food is nearly £1 lower than for a meal eaten on the premises.\nCyril Lavenant, foodservice director for the UK at the NPD Group, said ordering ready-to-eat food for delivery via an app or by phone “is growing so fast that ‘eating in’ is becoming the new ‘eating out'”.\nMcDonald’s UK chief executive Paul Pomroy said he expected to have the trial up and running in just over a month’s time.\n(Rui Vieira/PA)\nHe said: “We will start with a delivery service from the right number of sites that gives us scale.\n“I expect we will take a similar approach to the way we rolled out our app, starting small, learning quickly and scaling up very quickly.”\nMr Pomroy said the deliveries would be carried out by an external company but did not provide any specific or potential partner names.","url":"https://www.dailymail.co.uk/wires/pa/article-4447708/McDonald-s-trial-home-delivery-service-UK.html"}
