{"authors":["Associated Press"],"date_download":"2018-10-23 05:01:30","date_modify":"2018-10-23 05:01:30","date_publish":"2016-01-28 21:06:31","description":"The McGriddle, as well as biscuit sandwiches, will be available on February 1 in 72 restaurants in Tulsa. McDonald's will test the menu for two months before deciding whether to expand.","filename":"data/vaneerConsumption/McDonaldstoaddMcGriddletothealldaybreakfastmenu.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:42e02be767a447baa4f4583fbc1a5626-2vdWmEltwXfba0ce28e632ca6c59-344_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421695_McDonald-s-test-expanded-day-breakfast-McGriddle_1540270890.html","title":"McDonald's to add McGriddle to the all-day breakfast menu","title_page":"McDonald's to add McGriddle to the all-day breakfast menu | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"After the surprising success of its all-day breakfast menu, McDonald's has announced it will be testing the addition of another fan favorite to the lineup\nThe McGriddle, as well as biscuit sandwiches, can soon be found no matter the hour at 72 restaurants in Tulsa, Oklahoma starting on February 1.\nThey will join the pancakes, hashbrowns, oatmeal, sausage burrito, fruit and yogurt parfait and the various McMuffin varieties currently on the menu.\nAfter the surprising success of its all-day breakfast menu, McDonald's has announced it will be testing the addition of another fan favorite to the lineup - The McGriddle sandwich (pictured)\nThe McGriddle, as well as biscuit sandwiches, can soon be found no matter the hour at 72 restaurants in Tulsa, Oklahoma starting on February 1\nThe test, which is expected to last two to three months, comes after customers complained about the absence of the McGriddle when McDonald's launched a limited all-day breakfast menu in October.\nMcDonald's is riding high from its biggest quarterly US sales jump in nearly four years.\nThe Oak Brook, Illinois company said this week that sales rose 5.7 percent in the last three months of year, boosted by the all-day breakfast menu and unseasonably warm weather.\nNow, McDonald's restaurants in Tulsa will try offering the more expansive breakfast menu around the clock.\nCurrently, restaurants offer breakfast sandwiches made with either biscuits or English muffins, depending on regional preferences.\nAbout 80 percent offer 'McMuffin' sandwiches, with some areas in the South offering biscuits.\nThe addition of McGriddles and biscuits in the afternoon could prove to be too much of a strain, especially at a time when McDonald's has said it's trying to simplify operations to improve order accuracy and speed.\nThe McGriddle, which is served on a small pancake flavored with maple, was introduced in 2003 (file photo)\nThe McGriddle will join the pancakes, hashbrowns, oatmeal, sausage burrito, fruit and yogurt parfait and the various McMuffin varieties currently on the menu\nThe syrupy pancake buns for McGriddles and biscuits would need to be warmed up in ovens, which are also used to heat up apple pies, cookies and mozzarella sticks during lunch hours, said LeAnn Richards, a McDonald's franchisee who led a task force on all-day breakfast.\nMcGriddles and biscuit sandwiches are also made with a frozen egg patty, instead of the cracked egg used in McMuffins.\nThat means franchisees — who already had to buy new equipment to offer all-day breakfast — would need to further juggle grill and oven space for an expanded menu.\n'It's too premature to talk about next steps,' said Deborah Wahl, chief marketing officer for McDonald's US.\nMcDonald's says franchisees in Kansas City also started offering a Sausage McGriddle last month in response to demand.\nBut those restaurants aren't offering the sandwich with eggs, or biscuit sandwiches.\nDespite McDonald's recent sales jump, it's still not clear exactly how all-day breakfast is benefiting the chain and whether the effects will last.\nThe company did not say how much of the increase was from an uptick in customer visits, versus factors likes price hikes or people adding extras onto their orders.\nMcDonald's turnaround push is far from over. The company's U.S. customer visits fell 3 percent last year, following a 4.1 percent drop in 2014.\nEarlier this month the franchise rolled out its 'McPick 2', a narrow variation on the franchise's now-defunct dollar menu.\nThe new value menu includes four items, a McDouble, McChicken, mozzarella sticks, and small fries, and customers can pick two for $2.","url":"https://www.dailymail.co.uk/news/article-3421695/McDonald-s-test-expanded-day-breakfast-McGriddle.html"}
