{"authors":["Seth Millstein"],"date_download":"2018-10-31 01:45:14","date_modify":"2018-10-31 01:45:14","date_publish":"2018-09-14 14:27:49","description":"In cities across the country on Sept. 18, McDonald's workers will stage a strike at the company's restaurants in an effort to pressure management to address sexual harassment issues, the Associated Press reports. Organizers say that women at the…","filename":"data/vaneerConsumption/McDonaldsWorkersWillStrikeAcrossTheCountryToProtestSexualHarassmentInTheWorkplace.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/bf5fa907-1865-40d3-99dc-53046ec1b71f-getty-612952928.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_mcdonalds-workers-will-strike-across-the-country-to-protest-sexual-harassment-in-the-workplace-11915611_1540950314.html","title":"McDonald's Workers Will Strike Across The Country To Protest Sexual Harassment In The Workplace","title_page":"McDonald's Workers Will Strike Across The Country To Protest Sexual Harassment In The Workplace","title_rss":"NULL","source_domain":"bustle.com","text":"In cities across the country on Sept. 18, McDonald's workers will stage a strike at the company's restaurants in an effort to pressure management to address sexual harassment issues, the Associated Press reports. Organizers say that women at the restaurants are frequently the victim of sexual misconduct by their co-workers, and that the restaurant hasn't taken sufficient action to stop the behavior.\nIn a statement to Bustle, McDonald's defended its policies on sexual harassment, but also said that is \"engaging third party experts\" to help develop those policies further.\n\"We have policies, procedures and training in place that are specifically designed to prevent sexual harassment at our company and company-owned restaurants, and we firmly believe that our franchisees share this commitment,\" the company tells Bustle. \"Today, in addition to our existing initiatives, we are engaging third party experts known for their expertise in the areas of prevention and response including, RAINN and Seyfarth Shaw at Work, to evolve our policies, procedures and .”\nIn a 2014 survey by the Restaurants Opportunities Center United, two out of three women who work in the fast food industry said that they were sexually harassed by their management on at least a monthly basis, while nearly 80 percent of women said that they'd experienced some form of sexual harassment from their co-workers.\nAlthough it's unclear how many employees will participate in the strike, organizers say that workers at McDonald's locations in 10 cities plan to walk out of their respective restaurants around lunchtime. Those cities are Chicago, Durham, Los Angeles, Miami, Milwaukee, New Orleans, Orlando, San Francisco, St. Louis, and Kansas City, Missouri; according to the Associated Press, not every McDonald's location in each of those cities will be participating.\nThe strike was organized by female employees at dozens of McDonald's locations, who have formed several \"women's committees\" recently to address what they say is a pervasive culture of sexual misconduct at the chain restaurant. Organizers told the Associated Press that hundreds of McDonald's employees across the country have participated in women's committee meetings.\nThis isn't the first time women who work at McDonald's have taken action against alleged sexual harassment by their higher-ups. In May, a group of female employees filed a sexual harassment complaint against the restaurant with the U.S. Equal Employment Opportunity Commission, alleging that their their superiors groped them, propositioned them for sex, made lewd comments and exposed themselves on the job. They also claimed that their concerns were dismissed by the management, and in some cases, resulted in retaliation against them.\nOne of the women who filed that complaint, Tanya Harrell, is also one of the organizers behind the upcoming strike. In an interview with the Associated Press, she said that organizing the strike has empowered her.\n“I feel like I have a voice now,” Harrell said. “It gives me a bit of motivation and a bit of courage.”\nIn 2008, a McDonald's franchise in Colorado agreed to pay $505,000 to female employees at the restaurant, many of whom were between 15 and 17 years old, who accused their superiors of sexually assaulting and harassing them on the job. Three years later, the owner of 25 McDonald's franchises agreed to pay $1 million in damages after similar sexual misconduct allegations were made against male employees at one of his restaurants.","url":"https://www.bustle.com/p/mcdonalds-workers-will-strike-across-the-country-to-protest-sexual-harassment-in-the-workplace-11915611"}
