{"authors":["Chris Spargo For Dailymail.Com"],"date_download":"2018-10-23 03:29:11","date_modify":"2018-10-23 03:29:11","date_publish":"2017-03-16 14:20:32","description":"McDonald's wrote on Thursday morning: '@realDonaldTrump You are actually a disgusting excuse of a president and we would love to have @BarackObama back, also you have tony hands.'","filename":"data/vaneerConsumption/McDonaldsfiresoffinsultsatDonaldTrumponTwitter.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54BC6500000578-0-image-a-36_1489673887556.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320398_McDonald-s-fires-insults-Donald-Trump-Twitter_1540265351.html","title":"McDonald's fires off insults at Donald Trump on Twitter","title_page":"McDonald's fires off insults at Donald Trump on Twitter | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"President Donald Trump was attacked on Twitter early Thursday by the world's second largest fast food chain.\nMcDonald's, who has over 2billion served and 150,000 Twitter followers, posted a message on their account that read: '@realDonaldTrump You are actually a disgusting excuse of a president and we would love to have @BarackObama back, also you have tony hands.'\nThe posting was removed an hour after it went up on the account, and the company later addressed the offensive tweet in a tweet.\n'Twitter notified us that our account was compromised. We deleted the tweet, secured our account and are now investigating this,' read a message posted to the McDonald's Twitter page 86 minutes after the attack tweet was posted to the account.\nMcDonald's has not however offered any sort of public apology to President Trump, who is a big fan of the fast food chain and just last year provided the company with one of the best pieces of free press they have received in their history.\nOn June 7, when President Trump achieved the 1237 delegates necessary to win the Republican primary, he celebrated his victory by posting a photo of himself on his private plane eating a McDonald's Big Mac and fries, with the golden arches of the company's logo clearly visible on the packaging.\nThat photo was viewed by millions around the world in the days that followed and included in most stories about President Trump's once unimaginable win over the 16 other men and women who entered the primary.\nScroll down for video\nStrong words: The McDonald's Twitter account posted a message early Thursday morning attacking President Donald Trump (above)\nThe taste of victory: President Trump is a vocal fan of McDonald's, and in June posted a photo with a Big Mac and fries to celebrate his Republican primary win (above)\nBack in the day: President Trump (left) starred alongside Grimace (right) in a 2002 McDonald's commercial\nNew tweet: The attack message was quickly removed and the company said that their account was compromised (above) two hours after the offensive tweet went live\nPresident Trump also starred in one of the company's 2002 commercials, in which he enjoyed a burger in his Trump Tower office while chatting with Grimace, a large, purple, triangle-shaped anthropomorphic being of indeterminate species who resides in McDonaldland.\nIn the spot President Trump praises Grimace for the company's new $1 Big & Tasty burger deal, to which the short-armed dimwit responds by twice blinking his eyes.\nThe tweet was also pinned by the alleged hacker, meaning that it sat on the top of McDonald's social media page before it was taken down.\nIn the brief time that it was up, the message was retweeted by over 1500 users of the social media site and liked by over 1600, with 137 people commenting on the attack.\nThe tweet also managed to stay live on some iOS platforms well after it was removed from the account, and still appeared close to two hours after it went up on the page.\nMany were also quick to comment on McDonald's explanation for the anti-Trump tweet, questioning if they were really hacked or if it may have been the work of a disgruntled employee.\n'Did Carlos Danger hack your account,' posted one individual, referring to the pseudonym adopted by disgraced politician Anthony Weiner while he was exchanging graphic photos and messages with women over Twitter.\n'Be sure to take a look at that cuck Mayor McCheese,' read one comment from a person eager to point a finger at the hamburger-headed gentleman who is the most famous politician in McDonaldland.\nIn a tweet that aimed to be both offensive and reassuring, one individual wrote: 'Don't worry. Trump supporters arent going to boycott McDonald's.'\nAnd another simply wrote: 'McBulls***.'\nThere was also a good number of GIF and photo responses, a majority of which featured the Hamburgler.\nThe very first response though was an GIF of Marsha Brady delivering on of her most famous Brady Bunch lines: 'Sure Jan.'\nThere was also a movement to get McDonald's to put the tweet back on their page, with a number of people starting a GoFundMe of sorts, but with Chicken McNuggets instead of money.\n'I'll buy 100 McNuggets right now if you put the tweet back up,' was the first reponse, which was then followed by more people pledging to by 100 as well, ore even 200 McNuggets.\n'I will buy 500 McNuggets and donate them to the homeless,' wrote one man eventually, doubling the previous offer.\nThirty minutes after McDonald's posted their explanation, the bidding had reached '1,000,000 nuggets and 2,000 big Mac's' for the company to again post the tweet.\nMeanwhile, a number of individuals made sure that those who did not see the original tweet could get a good look by responding to McDonald's with a screengrab of the post.","url":"https://www.dailymail.co.uk/news/article-4320398/McDonald-s-fires-insults-Donald-Trump-Twitter.html"}
