{"authors":["Breitbart News"],"date_download":"2018-10-30 20:17:03","date_modify":"2018-10-30 20:17:03","date_publish":"2016-03-25 15:43:56","description":"On Breitbart News Daily Friday morning, with Breitbart News executive chairman and host Stephen K. Bannon, reporter Katie McHugh warned that Christian |","filename":"data/vaneerConsumption/McHughCatholicChurchProstratingThemselvesBeforeaReligionThatsBeenAtWarWithThemfor1400Years.json","image_url":"https://media.breitbart.com/media/2016/03/wi/ap_ap-photo-431-e1458919832368.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_25__1540930623.html","title":"McHugh: Catholic Church 'Prostrating Themselves Before a Religion That's Been At War With Them for 1400 Years'","title_page":"McHugh: Catholic Church 'Prostrating Themselves Before a Religion That's Been At War With Them for 1400 Years' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Breitbart News Daily Friday morning, with Breitbart News executive chairman and host Stephen K. Bannon, reporter Katie McHugh warned that Christian charities may be bringing jihad to America by taking taxpayer dollars in exchange for importing U.N.-selected Muslim refugees into American neighborhoods.\n“There’s a federal refugee program that hands out $1 billion per year to non-profit charities… Five of the top nine are Christian charities, one of which is Catholic Charities. And they get a $70 million per year refugee resettlement budget. Ninety-eight percent of that comes from the federal government,” McHugh said.\n“Who decides who these refugees are? Well, the U.N. does,” she continued. “And as we’ve seen and Breitbart News has broken, along with Refugee Resettlement Watch headed by Ann Corcoran, that of the 100,000 refugees resettled in the United States in 2014, an estimated 40 percent of them are Muslims.”\n“And the Catholic charities — they’re paid by the head for each of these refugees, many of whom are Muslim. They bring them in. They’re paid handsomely. And after four months, they’re not required to learn anything about these refugees: Where they go, where they live, what they’re up to. They’ve got their cash and they wipe their hands of it, and they go on to import more.”\nBannon asked if it was a cash-flow business plan or ideology that motivated Christian institutions to welcome the religion of the sword into the United States.\n“I think right now the Catholic Church and Christianity at large is in the grips of an ideology of globalism. You just had yesterday on Maunday Thursday, Pope Francis wash and kiss the feet of Muslim refugees — who actually look quite uncomfortable in the video of it,” McHugh said. “They’re prostrating themselves before a religion that’s been at war with them and everything that’s not Islam for 1400 years.”\nPope Francis kissed Muslim so-called refugees’ feet only days after Muslim terrorists denoted suicide bombs in Brussels, killing 34 and wounded hundreds more, along with Catholic, Hindu and Orthodox individuals.\nBreitbart News Daily airs weekdays from 6 am to 9 am EST weekdays on SiriusXM Patriot 125.\nLISTEN:","url":"https://www.breitbart.com/politics/2016/03/25/mchugh-catholic-church-prostrating-themselves-before-a-religion-thats-been-at-war-with-them-for-1400-years/"}
