{"authors":[],"date_download":"2018-10-30 21:01:00","date_modify":"2018-10-30 21:01:00","date_publish":"2016-12-31 22:44:00","description":"Prominent attorney Claud “Tex” McIver had borrowed $350,000 from his wife, who he shot a...","filename":"data/vaneerConsumption/McIverborrowed350000fromwife.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/31/Images/newsEngin.17304341_122316-McIver-HS05.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_breaking-news_mciver-borrowed-350-000-from-wife__1540933260.html","title":"McIver borrowed $350,000 from wife","title_page":"Tex McIver owed money to his wife at time of her death","title_rss":"NULL","source_domain":"ajc.com","text":"Prominent attorney Claud “Tex” McIver had borrowed $350,000 from his wife, who he shot and killed in September.\nMcIver borrowed the money in 2012 from a business owned by his wife, Diane McIver, called Clay Management Co., according to court documents. He was supposed to pay back the loan with interest by 2014, but when that didn’t happen he received an extension to 2017.\nThe transaction was highlighted in a local televsion news report Friday, but McIver’s attorney declined to discuss the specifics about the loan with CBS 46. McIver had discussed the loan during an exclusive interview recently with The Atlanta Journal-Constitution, saying the money went to build a barn with guest quarters on the couple’s farm in Putnam County.\nMcIver was arrested shortly before Christmas and charged with involuntary manslaughter, a felony, and reckless conduct, a misdemeanor, in the death of his wife, a successful businesswoman. McIver has said the death was an accident, and the charges indicate authorities do not believe he killed her on purpose, but rather due to recklessness.\nHis attorney, Stephen Maples, has said his client is innocent of the charges.\nThree months have passed since McIver shot and killed his wife while they were driving to their Buckhead condo from their Putnam County ranch. McIver said the couple pulled their .38 caliber pistol from the SUV’s center console when they happened upon what they thought was a dicey part of Atlanta. Shortly thereafter, he said he nodded off in the back seat, awoke suddenly and inadvertently pulled the trigger.\nAs for the loan, McIver told the AJC that the couple had decided to build a barn, and the cost came in at $1.3 million. The three-story barn had stables, an entertainment/saloon area and guest quarters.\nHis wife, he said, had told him that making her contribution of $350,000 a loan would help them with their taxes. Tex would be able to write off the payments on his taxes, and she could declare them as income.\nThe money, he said, “went straight into the project.”\nThe couple largely kept their finances separate, he said.\n“I never asked what she earned, ” McIver said. “It didn’t make any difference. I loved her for what she was, and she didn’t ask me.”\nHe added that he planned to pay off the loan by the end of 2016.\nMcIver is due back in court Thursday for a routine calendar call.","url":"https://www.ajc.com/news/breaking-news/mciver-borrowed-350-000-from-wife/4Pw2UlQyT7gwLSyKnE4KUI/"}
