{"authors":["Matt Turner"],"date_download":"2018-10-30 23:23:55","date_modify":"2018-10-30 23:23:55","date_publish":"2016-12-07 00:00:00","description":"The industry's return on equity in 2015 hit 9.6%, according to McKinsey, roughly returning the cost of capital.","filename":"data/vaneerConsumption/McKinseytableonreturnonequityshowshowmiserablebankingis.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_one-brutal-table-from-mckinsey-shows-how-miserable-banking-is-right-now-2016-12_1540941835.html","title":"McKinsey table on return on equity shows how miserable banking is","title_page":"    McKinsey table on return on equity shows how miserable banking is - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"McKinsey is out with its annual global banking survey, and it makes for pretty miserable reading.\nThe report is focused primarily on the challenges posed by low economic growth, the low-interest-rate policies that tend to go with it, and the digitization of banking.\n\"To counter the headwinds now gathering force, most banks will need to embark on a fundamental transformation that exceeds previous efforts,\" the management consultant said.\nThe following table caught our eye as we read through the report. It shows the industry's return on equity in 2015 hit 9.6%, roughly returning the cost of capital.\nThat means the industry at large is walking a fine line between destroying value and creating it.\n\"To be sure, some banks earn well above this mark, but many do not,\" the report said.\nMcKinsey\nIt also shows the component parts that help determine a bank's return, including margins, costs, fines, and capital.\nIn simple terms, the more boxes that are highlighted green, the better. That would suggest improving conditions. Red boxes show deteriorating conditions. There are 30 green boxes and 30 red.\n\"Global banking is delicately perched between profit and loss, and the next move seems likely to be downward with the main questions being around timing and how quickly the industry can adjust,\" the report said.","url":"https://www.businessinsider.com/one-brutal-table-from-mckinsey-shows-how-miserable-banking-is-right-now-2016-12"}
