{"authors":["Casey Rackham"],"date_download":"2018-10-30 23:52:09","date_modify":"2018-10-30 23:52:09","date_publish":"2014-08-12 22:36:38","description":"Ms. Norbury and Mr. Duvall. Gretchen and Karen. Shane and Regina. Kevin Gnapoor and Tim Pak. Jessica Lopez and Bethany Byrd. It would be normal to see all of those sets of Mean Girls characters socializing together. But what's the deal with Janis…","filename":"data/vaneerConsumption/MeanGirlsReunionWithAmyPoehlerFellowCastmatesMakesUsNostalgicforNorthShoreHighPHOTO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/5a27f5da-3ef9-46ea-b1be-9b9f25933e81.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35514-mean-girls-reunion-with-amy-poehler-fellow-castmates-makes-us-nostalgic-for-north-shore-high_1540943529.html","title":"'Mean Girls' Reunion With Amy Poehler & Fellow Castmates Makes Us Nostalgic for North Shore High - PHOTO","title_page":"'Mean Girls' Reunion With Amy Poehler & Fellow Castmates Makes Us Nostalgic for North Shore High — PHOTO","title_rss":"NULL","source_domain":"bustle.com","text":"Ms. Norbury and Mr. Duvall. Gretchen and Karen. Shane and Regina. Kevin Gnapoor and Tim Pak. Jessica Lopez and Bethany Byrd. It would be normal to see all of those sets of Mean Girls characters socializing together. But what's the deal with Janis Ian, Damian, and Mrs. George hanging out 10 years after they bared their souls to the classic rom-com? Well, in reality, their real-person counterparts — Lizzy Caplan, Daniel Franzese, and Amy Poehler — were gathered at the Chateau Marmont on August 10 to celebrate Caplan's recent birthday and Emmy nod. Franzese took a snap or two to document the Mean Girls reunion for #damiansyearbook.\nBut what if that picture was actually for Damian's yearbook? What if that picture was taken 10 years after we last saw the North Shore High School gang together, and, somehow, Damian and Janis became besties with Mrs. George? Let's take a look at their hypothetical present-day lives.\nAugust 10, 2014 in Evanston, Illinois:\nOn that fateful night, Janis, Damian, and Mrs. George all found themselves at the same Paint Night in the town that none of them ever left. (You know what I'm talking about — one of those workshops that move around from bar to bar where you get to paint your own \"masterpieces\" while drinking wine.) Of course, all three of them found themselves there for very different reasons.\nMrs. George\nWith both of her girls out of the house and an absent husband that she maybe sees once a month, Mrs. George has had to get creative when it comes to her social activities. Suffering from empty-nest syndrome, Mrs. George has made it a habit to take paint night classes so she can get drunk in a socially acceptable away (kind of) and interact with other human beings. However, she has had to switch from paint night to paint night all around town because people inevitably start to complain about the \"loud, blonde lady in the back of the class who keeps on crying into the martini that she brought from home.\"\nDamian\nAh, the life of a high school guidance counselor. That's right, Damian eventually took over as the guidance counselor at North Shore High School. Sure, he's almost always too brutally honest with the students — if you wear that shirt to school, duh, you're going to be made fun of — but the school didn't have any other options. And when he's not dealing with high school-related drama? Well, he's an instructor at a local paint night. He likes to let his creative juices flow. Plus, all of the patrons are tipsy enough to laugh at his jokes, and he likes that.\nJanice\nYeah, so Janice never grew out of her anger issues. For some reason, the local elementary school hired her as the art teacher, and, as you can imagine, she did not handle the children as well as a non-Janis person would. What resulted was a mandatory sabbatical and a weekly meeting with a therapist. Said therapist suggested that she should go to one of those paint nights to get back to enjoying art while getting a chance to blow off some steam. She knew that Damian, who she still hung out with from time to time, was teaching a local painting class, so she decided to stop by and check it out.\nA friendship that absolutely no one saw coming.\nOf course, that one night created an unlikely friendship that is sure to last a lifetime. Janis found that she underestimated Mrs. George based on the fact that she created Regina, and realized that her complete lack of understanding about the real world was oddly refreshing. As for Damian, he enjoyed Mrs. George after a glass or two of wine — which, honestly, is how she always is. And what did Mrs. George see in Janis and Damian? Well, she saw friends, and she desperately needed someone to talk to besides her dog.\nImages: Paramount Pictures; whatsupdanny/Instagram (2); giphy","url":"https://www.bustle.com/articles/35514-mean-girls-reunion-with-amy-poehler-fellow-castmates-makes-us-nostalgic-for-north-shore-high"}
