{"authors":[],"date_download":"2018-10-30 14:20:57","date_modify":"2018-10-30 14:20:57","date_publish":"2016-03-25 00:00:00","description":null,"filename":"data/vaneerConsumption/MediahysteriamatchesObamasonclimateandIslamicterror.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_03_media_hysteria_matches_obamas_on_climate_and_islamic_terror_comments_1540909257.html","title":"Media hysteria matches Obama’s on climate and Islamic terror","title_page":"Blog: Media hysteria matches Obama’s on climate and Islamic terror","title_rss":"NULL","source_domain":"americanthinker.com","text":"The president said on March 23 that terrorism is not an existential threat to the U.S. But he did say that climate change is an existential threat. In this poll, 69% of independents, 80% of Republicans, and 67% of Democrats believe that terrorist groups like al-Qaeda are a major threat to the U.S., while 25% of Republicans, 44% of independents, and 68% of Democrats believe that climate change is a major threat. The majority of the American people agree that terrorism is a bigger threat than terrorism, so is the president the extremist, or is Ted Cruz? How many of the deaths on 9-11, in Syria, in Paris, in San Bernardino, and in Brussels were caused by terrorists and how many were caused by a 1.5-degree temperature rise the past 150 years? Are the refugees from the Middle East escaping to Europe because of climate change or because they are scared they will be killed by terrorists or tyrants like Assad? Hamas, Hezb’allah, al-Qaeda, ISIS, Boko Haram, and... (Read Full Post)","url":"https://www.americanthinker.com/blog/2016/03/media_hysteria_matches_obamas_on_climate_and_islamic_terror_comments.html"}
 that most of the current terrorism is done by Islam-led groups is not extreme, nor is it Islamophobia. It is factual. I have not heard Ted Cruz or anyone say that all Muslims are terrorists. That would not be factual. It is more extreme for the president not to identify the terrorists than it is for anyone else to identify them.\nIf Protestants, Catholics, Jews, Mormons, or members of any other religion were responsible for the current terrorism, I would hope they would be identified.\nTed Cruz recently proposed expanding police patrols in some Muslim neighborhoods and at mosques (he did not propose monitoring all Muslims). The reporting and comments by Democrats said how extreme and dangerous he is. Some of the reports would make him look like Hitler. From all the reports, the public would never know that a similar program existed in New York City from 1994 to 2012. Mayor Michael Bloomberg continued the program started by Rudy Giuliani. It was expanded after 9-11. I have not been able to locate wall-to-wall coverage where they called Bloomberg a right-wing extremist.\nThe program Cruz suggested would be similar to stepping up surveillance in areas where white or black gangs roam. That is sensible.\nIt is not racist or extreme to say that white persons are more likely to be responsible for multiple shootings. It is not racist or extreme to say that black persons are most responsible for black shootings in Chicago, and it is not racist or extreme to point out that Muslims are responsible for most of the current terrorism around the world. All those statements are factual.\nIt would be good for young blacks, young whites, and young Muslims if they were discouraged from joining gangs and terrorist organizations. They will live to a much older age. It is unwise to stick our heads in the sand.\nIt is also not racist to oppose a black president’s policy or to vote against him in the first place. I do not care what color or religion he is. I vehemently oppose his policies because I believe they greatly harm Americans, especially the poor and middle-class. It is also not sexist to oppose Hillary. I would be glad to support any woman who is honest, who actually cares about the nation’s security, and who has sensible policies that help people move up the economic ladder.\nNo matter how sensible Cruz’s proposals are, he will be labeled a far-right extremist. For example, he understands that the climate has always changed (he is not a climate change denier), and he believes in smaller government, in lower taxes, in moving toward a balanced budget and enforcing current immigration policies. All of those policies are in agreement with the majority of the American public, so why is he considered extreme?\nI think the American people should be polled with the following question: should we spend trillions of dollars based on manipulated, inaccurate computer models to pretend that we can control temperatures within one degree while destroying industries and raising costs to consumers, or should we spend billions securing the border and trying to destroy terrorism? Which should be the greater priority?","url":"https://www.americanthinker.com/blog/2016/03/media_hysteria_matches_obamas_on_climate_and_islamic_terror.html"}
