{"authors":[],"date_download":"2018-10-22 22:58:31","date_modify":"2018-10-22 22:58:31","date_publish":"2017-04-26 06:21:20","description":"Press freedom has never been as threatened as it is now, in the \"new post-truth era of fake news\" after the election of US President Donald Trump, Reporters...","filename":"data/vaneerConsumption/Medianeverundersomuchthreatsayswatchdog.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/06/wire-463445-1493184082-671_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4446394_Media-never-threat-says-watchdog_1540249111.html","title":"Media 'never under so much threat', says watchdog","title_page":"Media 'never under so much threat', says watchdog | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Front pages from New York City newspapers feature President-elect Donald Trump, on November 9, 2016\nPress freedom has never been as threatened as it is now, in the \"new post-truth era of fake news\" after the election of US President Donald Trump, Reporters Without Borders warned Wednesday.\nIts annual World Press Freedom Index warned of the \"highly toxic\" media-bashing of Trump's election campaign and Britain's Brexit referendum.\nThe situation is at \"a tipping point,\" it said bluntly.\nMedia freedom is being undermined by the rise in surveillance and of authoritarian strongmen across the globe, the watchdog said.\nThe US and Britain both slipped two places in the index to 43rd and 40th, according to the Paris-based monitoring group, known by its French initials RSF.\n\"Nothing seems to be checking\" the erosion of liberty of the press in leading democracies, it said.\n\"Media freedom has never been so threatened.\"\nPress Freedom rankings, Reporters Without Borders, 2017\nLiberty of the press is in peril or in a \"very serious situation\" in 72 countries including Russia, India and China, it found.\n\"Attacks on the media have become commonplace and strongmen are on the rise. We have reached the age of post-truth, propaganda, and suppression of freedoms -- especially in democracies,\" the report said.\n\"Donald Trump's rise to power... and the Brexit campaign were marked by high-profile media-bashing, a highly toxic anti-media discourse that drove the world into a new era of post-truth, disinformation and fake news,\" it added.\nPoland and Hungary came in for withering criticism in the report.\nThe nationalist government in Warsaw was accused of \"turning public radio and TV stations into propaganda tools\" and of trying to throttle independent newspapers.\n- Turkish jails -\nNorth Korea took bottom place in the latest World Press Freedom Index\n\"Media freedom has retreated wherever the authoritarian strongman model has triumphed,\" it warned.\nTurkey \"swung over into the authoritarian regime camp\" after the failed coup against President Recep Tayyip Erdogan in July, it said, adding bitterly that it \"now distinguishes itself as the world's biggest prison for media professionals.\"\nSeven places ahead of Turkey, \"Vladimir Putin's Russia remains firmly entrenched in the bottom fifth of the index,\" in 148th place, it added.\n\"The rate at which democracies are approaching the tipping point is alarming for all those who understand that, if media freedom is not secure, then none of the other freedoms can be guaranteed,\" RSF Secretary-general Christophe Deloire said.\n\"Where will this downward spiral take us?\" he asked.\nThe RSF index found that in the past year nearly two thirds of the countries had registered a deterioration in their situation, while the number of countries where the media freedom situation was \"good\" or \"fairly good\" fell by more than two percent.\n- North Korea 'least free' -\nNorway came out top of the index with the world's freest media.\nIt took over from neighbouring Finland which had held the title for six years.\nAt the other end of the scale, North Korea took bottom place from another repressive closed state, Eritrea, which has propped up the table for a decade.\nNorth Korea continues to keep \"its population in ignorance and terror,\" RSF said.\n\"Even listening to a foreign radio broadcast can lead to a spell in a concentration camp.\"\nChina, war-torn Syria -- the deadliest country for journalists -- and Turkmenistan complete the bottom five.\nItaly showed the biggest improvement, rising 25 places to 52nd place thanks to the acquittal of journalists tried in the Vatileaks II case, which exposed scandal at the top of the Catholic Church.\nNicaragua registered the biggest fall of 17 places with the controversial re-election of President Daniel Ortega \"marked by many cases of censorship, intimidation, harassment and arbitrary arrest,\" the RSF said.\nTanzania also saw a sharp decline. President John Magufuli \"keeps tightening his grip on the media,\" RSF said.","url":"https://www.dailymail.co.uk/wires/afp/article-4446394/Media-never-threat-says-watchdog.html"}
