{"authors":[],"date_download":"2018-10-22 23:16:58","date_modify":"2018-10-22 23:16:58","date_publish":"2016-08-08 00:00:00","description":"Women encounter a dilemma when they get pregnant: Should they continue taking medications that keep them healthy? That question can be scary, because drugs are rarely tested for safety in pregnancy.","filename":"data/vaneerConsumption/MedicationsAreSeldomTestedForSafetyInPregnancyShots.json","image_url":"https://media.npr.org/assets/img/2016/08/01/npr_pregnant_rx_wide-4c3a3b48c64c7c0b47dc4ef29b08a1345e7b67ec.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=486907088_1540250218.html","title":"Medications Are Seldom Tested For Safety In Pregnancy : Shots","title_page":"Medications Are Seldom Tested For Safety In Pregnancy : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"STEVE INSKEEP, HOST:\nSome pregnant women face an excruciating choice. It's whether to keep taking medications or whether to stop taking them, risking their own health to avoid any possible risk to the baby.\nDAVID GREENE, HOST:\nThey have to decide without much good information. Drugs are rarely researched in pregnant women. Some bioethicists now want to change that. NPR's Rae Ellen Bichell has our report today in Your Health.\nRAE ELLEN BICHELL, BYLINE: A few years ago, almost every aspect of Rosanne Mottola’s life was governed by the feeling in her gut - literally.\nROSANNE MOTTOLA: I experienced extreme urgency to have to use bathroom, pain, bleeding. And a lot of times, I would go the whole day without eating.\nBICHELL: So that she wouldn't have to rush to the bathroom so often. Mottola has ulcerative colitis. When her disease acted up, it was painful and exhausting. The steroid treatment made it hard to sleep, and she put on so much weight that she'd get what she calls chipmunk cheeks.\nMOTTOLA: So it was not easy.\nBICHELL: Luckily, she and her doctor decided to try a combination of medicines.\nMOTTOLA: And it did the trick. It gave me back a quality of life.\nBICHELL: The 26-year-old could get on with her life. So for a while, no stress - until she got pregnant. One of the drugs Mottola was taking had shown some signs it could cause problems for a fetus. And the other hadn't been studied enough in humans to know what would happen.\nMOTTOLA: It made me extremely nervous. I must have had four conversations with my doctor. I kept calling him. I said, are you sure that I could do this? Are you sure this is safe? Are you sure that the baby won't be affected?\nBICHELL: Her obstetrician wanted more information. A pediatrician said, no way. You cannot breast-feed on those drugs. And Mottola worried that the fetus might absorb some of the drugs, potentially making it harder to fight off infections. But her gastroenterologist, who'd worked with patients like Mottola and was up to date on the latest research, reassured her time and time again that it would be fine. So in the end, she decided to stick with it.\nMOTTOLA: At the end of the day, I had a very healthy pregnancy. I probably felt the best I've ever felt (laughter) since my diagnosis.\nBICHELL: And these days, her one-and-a-half-year-old is up to all sorts of things.\nMOTTOLA: Oh my gosh, climbing, talking - he's very inquisitive. He loves reading books. He's healthy. He's thriving. And it was the right call.\nBICHELL: Even though things worked out for Mottola and her family, the doubt that she and her husband experienced during the pregnancy was not a happy place for expecting parents.\nMOTTOLA: No. No, it's a scary place.\nBICHELL: And unfortunately, Mottola is not alone. The CDC estimates that 70 percent of pregnant women in the U.S. will take at least one prescription drug, whether it's for something like colitis or diabetes or allergies. And Margaret Little says a lot of them are stuck in the same spot as Mottola, wondering if the drugs they need might do harm.\nMARGARET LITTLE: Because there's actually shockingly little that we know about how to treat illness during pregnancy.\nBICHELL: Little is a bioethicist at Georgetown University. She says there are only a dozen medications in the U.S. that are approved to be safe during pregnancy. A lot of the others go to market without any information on how they act in pregnant women.\nLITTLE: Pregnant women get ill, and ill women get pregnant. The point is we need to get more information on how to use those drugs during pregnancy to make sure they're the most effective and the safest.\nBICHELL: That's why she's working with a group of researchers to figure out how to get more information in a responsible way.\nLITTLE: We are looking at finding ethical pathways to doing the needed research with pregnant women.\nBICHELL: There's an understandable squeamishness toward the idea of testing medications on pregnant women. For one, there's no way for a fetus to consent to a drug trial. Secondly, researchers, academic institutions and pharmaceutical companies are really afraid of what could go wrong.\nLITTLE: They don't want to be the next thalidomide.\nBICHELL: Decades ago, after women took thalidomide to relieve their nausea, thousands of babies were born with birth defects, including arms and legs that looked like flippers. It jolted people into a fear of mixing medication and pregnancy and for a good reason. Now, drug companies and universities are really wary that their research could end up causing birth defects. But Little and her colleagues argue that the thalidomide tragedy is exactly why drugs need to be tested in pregnant women.\nLITTLE: If we had done early and safe studies on thalidomide, we would have found out before it got to market that pregnant women shouldn't take it. So the lesson of thalidomide is actually do safe and early studies on drugs around pregnancy, and we'll avoid those tragedies.\nBICHELL: Instead, she says, people in the scientific community tend to run in the other direction, an attitude that can have bad repercussions. In 2006, for example, researchers found that women who took a certain blood pressure medicine were more likely to have babies with heart and nervous system problems. The medication had been on the market for decades. Others found that diabetes medication just didn't work in pregnant women because their bodies process things differently, and that's not good for the woman or for the fetus.\nLITTLE: There can almost be a Catch-22. Until we do the research, we don't know what the risk to the fetus is. And if we don't know what the risk to the fetus is, how can we ethically do the research?\nBICHELL: The U.S. surmounted the same issue when it came to testing children because their bodies work differently than those of adults. Legislators gave incentives to pharmaceutical companies that tested drugs in children. But there hasn't been the same move when it comes to pregnancy, though there is a bill floating around Congress that would take a step toward addressing the knowledge gap. So in the meantime, it's up to enterprising researchers to slowly fill the void of information, people like Dr. Uma Mahadevan.\nUMA MAHADEVAN: What mom wants to be on medication that hasn't been studied in pregnancy?\nBICHELL: Mahadevan is a gastroenterologist at the University of California, San Francisco. A lot of her patients have health issues like Rosanne Mottola's. Sometimes, after consulting with another doctor, they'd quit their medications entirely, thinking it would be better for the pregnancy. But if their disease acted up, their options at that point were pretty ugly, like taking steroids or even having surgery while pregnant.\nMAHADEVAN: These are all, you know, much more high-risk things than the medication that they were on before.\nBICHELL: So she and her colleagues tracked 1,500 women with inflammatory bowel disease to find out if two classes of common medications were safe. Here's what they found.\nMAHADEVAN: There is no increase in birth defects. And that's very clear, and everyone agrees on that.\nBICHELL: And that may turn out to be true in many cases, that a healthy mom is better for the fetus. But until there's more thorough research on medication taken during pregnancy, there will always be an element of uncertainty. And for many women, says Little, an agonizing one. Rae Ellen Bichell, NPR News.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=486907088"}
