{"authors":[],"date_download":"2018-10-22 21:25:26","date_modify":"2018-10-22 21:25:26","date_publish":"2016-06-09 00:00:00","description":"First-year medical students are usually busy studying lots of basic science and medicine. One medical school is making a point of schooling them on how health care delivery affects their patients.","filename":"data/vaneerConsumption/MedicalStudentsStriveToSolvePublicHealthProblemsShots.json","image_url":"https://media.npr.org/assets/img/2016/06/08/gw_1_wide-2531e762728e970020895eb31d6364d82bb929e4.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=481206602_1540243526.html","title":"Medical Students Strive To Solve Public Health Problems : Shots","title_page":"Medical Students Strive To Solve Public Health Problems : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"DAVID GREENE, HOST:\nMedical students learn a lot about science during medical school, but not so much about other aspects of patient care. But now, George Washington University is trying to improve that link between medicine and health policy and also produce more well-rounded doctors. Julie Rovner has more.\nJULIE ROVNER, BYLINE: The idea behind the new curriculum is to more closely link medicine and policy. So after learning about the lungs and pulmonary system, for example, the students do a project on controlling childhood asthma. Lawrence Deyton, the associate dean who's running the program, says doctors in the future will need to know much more than just how to diagnose and treat diseases like asthma. They'll also need to be able to understand everything that influences a patient's health.\nLAWRENCE DEYTON: The medical students should recognize that the child maybe been exposed to smoke in the home environment or toxic fumes or cockroaches that they're allergic to.\nROVNER: Deyton says it's important to put those policy issues right alongside the clinical medical training.\nDEYTON: So as they're learning about diseases and conditions, they're recognizing those public health and population health and social determinants of health factors.\nROVNER: That's why, on this rainy Wednesday in May, GW's entire first-year med school class is gathered in an auditorium. One by one, small groups of students are presenting their proposals for how to help control asthma in Washington, D.C. - in particular, how to help control asthma in some of the city's lower-income areas.\nERIN GOOD: The app gives the mother the chance to be able to really manage the disease.\nROVNER: That's med student Erin Good. She's describing the concept her group came up with, called Asthsmama. It's a bracelet that would be worn by a child with asthma that transmits information to an app on a parent's smart phone.\nGOOD: The idea being that either the child or the bracelet itself can detect problems, or maybe the child pushes it because they feel that they're having an asthma attack.\nROVNER: And the parent or the school nurse or both would automatically be notified. Good's group suggested to the panel of experts that the project could be paid for by grants and, if it works, covered by the Medicaid program.\nGOOD: We're hoping that it would be an approved medical device.\nROVNER: That emphasis on the not-strictly-medical part of medical school appeals to students like Jeffrey Roberson, who was a social worker before coming to GW. He says he often texts with his friends at other medical schools.\nJEFFREY ROBERSON: They think it's fascinating that we - we sit and we learn about how our healthcare system is paid. Other schools don't do that, so you'll have physicians that have no idea how insurance works.\nROVNER: GW has some built-in advantages when it comes to teaching policy, among them its location in downtown Washington. At the end of their first semester, the students did a three-day deep dive into AIDS and HIV policy. And they presented their proposals at the White House.\nROBERSON: It was really just a powerful day to see all of our colleagues, just one semester into medical school, with really innovative ideas, at the White House and getting feedback from the AIDS czar, from all these major directors of health policy for individual states.\nROVNER: Teaching health policy in medical school isn't exactly new. Many schools have been doing it for years. But Neel Shah, a physician and policy researcher at Harvard, says what is new is integrating policy and practice.\nNEEL SHAH: For example, I remember, when I was learning about health care costs for the first time, the whole conversation was about the GDP.\nROVNER: Meaning how much of the nation's gross domestic product goes towards healthcare.\nSHAH: And nobody goes to medical school to treat the GDP. There's, like, a huge gap between the macro-level understanding of health care economics and what matters to patients and clinicians at the bedside.\nROVNER: And that's what today's medical educators are trying to remedy, one class at a time. I'm Julie Rovner.\nGREENE: Julie Rovner is with Kaiser Health News.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=481206602"}
