{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:31:00","date_modify":"2018-10-30 21:31:00","date_publish":"2018-07-15 16:13:45","description":"They want President Donald Trump to cancel his meeting with Russian President Vladimir Putin in Helsinki on Monday, or add more participants.","filename":"data/vaneerConsumption/MediaDemocratsWantTrumptoCancelPutinMeetingorIncludeOthers.json","image_url":"https://media.breitbart.com/media/2018/07/wi/ap/14/fea2d9_trump-russia-05130-in-nov-11-2017-file-photo-president-donald-trump-russia-e1531578909334.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_07_15__1540935060.html","title":"Media, Democrats Want Trump to Cancel Putin Meeting, or Include Others","title_page":"Media, Democrats Want Trump to Cancel Putin Meeting, or Include Others | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The consistent theme on Sunday morning’s news shows was that the Democrats — and many of the journalists interviewing them — want President Donald Trump to cancel his meeting with Russian President Vladimir Putin in Helsinki on Monday.\nFailing that, they want to prevent President Trump from speaking one-on-one with Putin, ostensibly for fear that the latter, a former KGB agent, would take advantage of the American leader — though no one seemed to have a clear idea of exactly what that would mean.\nThe context for these demands was the indictment Friday of 12 Russian military intelligence officials for the hacking of several Democratic email systems during the 2016 presidential election, and the leaking of the stolen emails.\nSome of the president’s critics have said that Trump, if he meets with Putin, should demand the extradition of the Russian officials responsible.\nHowever, as National Security Advisor John Bolton pointed out on Fox News Sunday, Russia does not have an extradition treaty with the U.S. and has refused to hand over its citizens to European nations in past legal cases. He argued that if Trump were to make such a demand, it would not only have no chance of being fulfilled, but it would weaken his negotiating position.\nFar from prompting Trump to cancel, Bolton argued, the indictments strengthened Trump’s hand in talks with Russia.\nThe president has not set out publicly what his goals in the meeting would be, causing further consternation to journalists and the opposition — though he said last week at a joint press conference with British Prime Minister Theresa May that he would bring up Russia’s election meddling.\nMay backed up Trump, noting that he had responded strongly to Russia’s alleged nerve agent attack against against a former spy and his daughter in Britain earlier this year.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/the-media/2018/07/15/media-democrats-want-trump-to-cancel-putin-meeting-or-include-others/"}
