{"authors":["Yvonne Zusel"],"date_download":"2018-10-30 19:59:37","date_modify":"2018-10-30 19:59:37","date_publish":"2017-01-12 14:31:50","description":"A new restaurant and bakery with a Mediterranean flair is set to open its doors this month in Grant...","filename":"data/vaneerConsumption/MediterraneasettoopenthismonthinGrantPark.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/12/Images/WPIMAGE_cmgajcfoodandmore_13063.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_me_fec6c73a9b3bddd44214554a1e8d46e5__1540929577.html","title":"Mediterranea set to open this month in Grant Park","title_page":"Mediterranea set to open this month in Grant Park","title_rss":"NULL","source_domain":"ajc.com","text":"A new restaurant and bakery with a Mediterranean flair is set to open its doors this month in Grant Park.\nMediterranea, which will be located in a historic 1920 trolley stop building 332 Ormond St. SE Ste. 101 in Atlanta, will open a bakery and coffee counter first, followed by the restaurant in the later part of the month.\nThe bakery will sell muffins, cookies, breads, and desserts, while the restaurant will offer a menu inspired by \"the traditional way of eating in the Mediterranean region — a vernacular diet of locally sourced vegetables, fruits, whole grains, seafood, and poultry,\" according to co-owner Gerard Nudo. \"With its emphasis on simply prepared foods, especially vegetables, the Mediterranean way of eating is delicious, sustainable and healthy.\"\nThe winter menu will feature dishes including an eggplant involtini with haloumi, roasted red pepper tomato sauce and yellow pepper tomato sauce and pan roasted French cut chicken breast with root vegetable hash, thyme and gravy.\nBoth the bakery and restaurant will be gluten-free and vegetarian and vegan friendly.\nThe bar program will include wines and craft beers (including a selection of gluten-free beers), as well as cocktails using Mediterranean and Italian liquors \"with a twist\" according to Nudo, such as vintage Negronis and red mimosas made with Lambrusco.\nThe space, which Nudo said will have a \"rustic elegant\" vibe, will seat 46 in the dining room and 14 at the bar, with another 46 seats on the rooftop deck.\n332 Ormond St. SE, Ste. 101, Atlanta. 404-748-4219, facebook.com/Mediterranea-719034664911296/\nMore restaurants we can't wait to see open in 2017\nRead The A List: The faces, places, dishes and drinks defining the Atlanta dining scene right now\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook , following @ATLDiningNews on Twitter and @ajcdining on Instagram .","url":"https://www.ajc.com/blog/atlanta-restaurants/mediterranea-set-open-this-month-grant-park/GvNTbz1F676qckHGrL1x3K/"}
