{"authors":["Mark Duell For Mailonline"],"date_download":"2018-10-22 20:07:43","date_modify":"2018-10-22 20:07:43","date_publish":"2016-01-28 00:15:54","description":"Brazilian researchers have been probing 4,180 suspected microcephaly cases reported since October - and doing intense analysis on 732 of those cases which has confirmed 270.","filename":"data/vaneerConsumption/MedicsprobingZikavirusconfirmSIXcasesfrom700childrenexamined.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:25bba65de82b437080bedd4f9e229280-4vVdYopwYQ7f641721b07a6adde3-101_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3419738_Brazil-270-4-120-suspected-microcephaly-cases-confirmed_1540238863.html","title":"Medics probing Zika virus confirm SIX cases from 700 children examined","title_page":"Medics probing Zika virus confirm SIX cases from 700 children examined | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Medics in Brazil investigating head-shrinking birth defects linked to the Zika virus revealed last night there were just six cases from more than 700 children examined.\nResearchers have been probing 4,180 suspected microcephaly cases reported since October - and doing intense analysis on 732 of those cases which has confirmed 270 and ruled out the other 462.\nHowever Brazil's Health Ministry said only six of the 270 confirmed cases were found to have the Zika virus - with two being stillborn and four live births, three of whom later died.\nConcern: Gleyse Kelly da Silva, 27, holds her daughter Maria Giovanna, who was born with microcephaly, outside their house yesterday in Recife, Pernambuco state, Brazil\nCombating the problem: Municipal workers spray insecticide to combat the Aedes aegypti mosquitoes that transmit the Zika virus at the Imbiribeira neighbourhood in Recife\nOperation: Municipal workers refill the insecticide sprayer during an operation to combat the mosquitoes\nExperts say it is hard to say what the figures mean, because they do not answer whether the tropical Zika virus is causing the babies to have unusually small heads - or explain the size of the problem.\nPaul Roepe, director of the Center for Infectious Disease at Georgetown University in Washington DC, said: ‘I don't think we should lower our alarm over the Zika outbreak.’\nBrazilian officials still say they believe there's a sharp increase in cases of microcephaly and strongly suspect the Zika virus, which first appeared in the country last year, is to blame.\nThe concern is strong enough that the United States Centers for Disease Control and Prevention this month warned pregnant women to reconsider visits to areas where Zika is present.\nMeanwhile officials in El Salvador, Colombia and Brazil have even suggested women stop getting pregnant until the crisis has passed.\nBut the World Health Organization and others have stressed that any link between Zika and the defect remains circumstantial and is not yet proven scientifically.\nWorking: A municipal worker in Brazil gestures during an operation to combat the Aedes aegypti mosquitoes\nProbing: A health worker shows larvae of the Aedes aegypti mosquitoes found inside a warehouse in Recife\nAnd the new figures were a reminder of just how little is known about the disease and its effects.\nThe arrival of the mosquito-borne illness in Brazil initially caused little alarm as the virus' symptoms are generally much milder than those of dengue.\nI don't think we should lower our alarm over the Zika outbreak Paul Roepe, Georgetown University\nThen late last year, after noting what they said was a spike in the birth defect, Brazilian authorities for the first time asked doctors to report cases of patients in their care. So there are no solid numbers to compare with the new tally.\nIn 2014, only about 150 cases were reported in Brazil in a year - a surprisingly small amount for a largest country with nearly 3 million births a year.\nThe United States, with about 4 million births a year, has an estimated 2,500 cases of microcephaly a year, said Margaret Honein, a CDC epidemiologist.\nBrazilian health officials have dismissed the idea there might have been a large number of unreported cases previously.\nInsect problem: Aedes aegypti mosquitoes sit in a petri dish at the Fiocruz Institute in Recife yesterday\nProtection: Residents run away and others cover their faces as municipal workers spray insecticide in Recife\nBut the rate of recorded microcephaly cases was only a fraction of what some experts thought it ought to be.\nIn establishing a registry, the Health Ministry cast a wide net, including live births, stillborn and miscarried babies, and foetuses shown to have unusually small heads by ultrasound or other diagnostic tests, the ministry said.\nIn subsequent investigation, tests were done to see if the brain has been affected. The condition can cause lasting developmental problems.\nBrazilian health official did not detail what they found in the 462 reports that were ruled out, but many of them were just premature and under-sized, a health ministry spokesman said.\nThe birth defect can be caused by factors such as genetics, malnutrition or drugs. Infections are also a cause - in the US, one of the leading causes is cytomegalovirus - although Zika-like viruses have not previously been linked to microcephaly.\nThe CDC's Ms Honein said shifts in the numbers reported out of Brazil were not surprising, and much more investigation is needed.\nBig effort: Brazil's health minister said that nearly 220,000 members of Brazil's Armed Forces would go door-to-door to help in mosquito eradication efforts ahead of the country's Carnival celebrations\nArmed forces: A Brazilian Army soldier inspects a house during an operation to combat the mosquitoes\nShe was echoed by Dr Ganeshwaran Mochida, a paediatric neurologist at Boston Children's Hospital who specializes in microcephaly.\nHe said 270 confirmed cases ‘is still quite a substantial number’ in a country that has been reporting far lower counts.\nHe also said that health official will have to watch for other problems, including far less obvious issues that can be caused by congenital infections - for example, deafness.\nBrazilian officials said the babies with the defect and their mothers are being tested to see if they had been infected.\nOn Tuesday, Brazil's health minister, Marcelo Castro, announced that 220,000 military personnel were being deployed to bolster efforts to eradicate the Aedes aegypti mosquito that transmits Zika, dengue, chikungunya and yellow fever.\nMr Castro said the government also would distribute mosquito repellent to some 400,000 pregnant women.","url":"https://www.dailymail.co.uk/news/article-3419738/Brazil-270-4-120-suspected-microcephaly-cases-confirmed.html"}
