{"authors":["Ben Shapiro"],"date_download":"2018-10-30 20:59:15","date_modify":"2018-10-30 20:59:15","date_publish":"2016-02-06 03:46:08","description":"On Friday, Trayvon Martin’s name began trending again on Twitter. It’s been four years since Martin was killed by neighborhood watchman George Zimmerman in Sanford, Florida – and today was Martin’s birthday. That meant that the media took the opportunity to reinforce the myth of St. Trayvon of the Blessed Hoodie, victim of brutal white racism. So, here’s the real Trayvon Martin story.","filename":"data/vaneerConsumption/MediaPayHomagetoTrayvonMartinon21stBirthdayHerestheRealStory.json","image_url":"https://media.breitbart.com/media/2015/10/Trayvon-martin-poster-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2016_02_05__1540933155.html","title":"Media Pay Homage to Trayvon Martin on 21st Birthday. Here's the Real Story.","title_page":"Media Pay Homage to Trayvon Martin on 21st Birthday. Here's the Real Story. | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Friday, Trayvon Martin’s name began trending again on Twitter. It’s been four years since Martin was killed by neighborhood watchman George Zimmerman in Sanford, Florida – and today was Martin’s birthday. That meant that the media took the opportunity to reinforce the myth of St. Trayvon of the Blessed Hoodie, victim of brutal white racism.\nWhite activist masquerading as black activist Shaun King wrote that Martin “should be celebrating his 21st birthday… A real part of being black in America, though, is being constantly aware of what should’ve been but never was.”\nJoy Reid of MSNBC tweeted:\nThe killing of Trayvon Martin sparked the #BlackLivesMatter movement. He would have been 21 years old today. pic.twitter.com/W3SmveEDMc — Joy Reid (@JoyAnnReid) February 5, 2016\nThinkProgress tweeted:\nBET tweeted:\nHappy Birthday Trayvon Martin! Your story sparked a movement and for that your name will live on! #BlackLivesMatter pic.twitter.com/KUAdZmoiOZ — BET (@BET) February 5, 2016\nShockingly, on the day of this spontaneous grassroots tribute to Martin, Benjamin Crump, the lawyer who represented the Martin family as well as the family of Michael Brown, announced his support for Hillary Clinton.\nWell, then.\nThe rewritten story of Trayvon Martin, as told by the media, goes something like this: Trayvon was a gentle young man walking home from the convenience store after buying Skittles and iced tea when he was racially profiled and stalked by vicious white man George Zimmerman. Zimmerman either attacked him or provoked Martin into fighting with him, at which point Zimmerman shot him. Here, for example, is Roland Martin’s explanation fo the events today on Twitter:\nIn @benshapiro‘s world, nothing wrong with a non-cop profiling a Black kid walking home, following him, demanding ID, killing him. #Trayvon — rolandsmartin (@rolandsmartin) February 5, 2016\nVirtually none of this is shown by the evidence, and it leaves out virtually all of the relevant facts. But the narrative must overcome the facts.\nBecause the media decided to canonize Martin, and because I disapprove of lying narratives built around false incidents, I tweeted thusly:\nTrayvon Martin would have turned 21 today if he hadn’t taken a man’s head and beaten it on the pavement before being shot. — Ben Shapiro (@benshapiro) February 5, 2016\nDemonstrating their support for the nonviolence of Martin’s legacy, I then received dozens of death threats and prayers for me to experience physical harm.\nSo, here’s the real Trayvon Martin story.\nIn reality, Trayvon Martin was a full-grown young man with a history of violence, who got into a fight with Hispanic man George Zimmerman under disputed circumstances, and then was shot in the chest while beating Zimmerman’s head against the pavement.\nMartin was only in Sanford in the first place because he had been suspended from school for ten days for carrying around a baggie with pot residue; he also apparently liked a concoction called “lean,” a mix of candy like Skittles, a drink like Arizona Iced Tea, and codeine. He’d been suspended twice from school before, once for missing school, and a second time after a security guard found a “burglary tool” in his backpack. He tweeted under the handle @NO_LIMIT_NIGGA, where he frequently unleashed sexist comments, and where his friends tweeted him about whether he had assaulted a bus driver. Martin’s text messages revealed that he had been suspended for being in a fistfight, and engaged in such fights after school as well. Days before his death, he texted his friend about obtaining a gun.\nNone of this would be relevant, except for the portrayal of Martin personally as a pacifistic angel – and because the credibility of the left’s rewritten narrative rests on their portrayal of Martin’s character, as opposed to Zimmerman’s supposed racism.\nNow, Zimmerman had issues with violence before the Martin incident. He had two prior arrests, one for assaulting a police officer, another for domestic abuse. But there’s no evidence of Zimmerman’s racism, a fact that even Eric Holder of the racist Obama Justice Department had to acknowledge in failing to press charges against Zimmerman. Zimmerman isn’t white — he’s Hispanic. As Reuters reported, “He was raised in a racially integrated household and himself has black roots through an Afro-Peruvian great-grandfather–the father of the maternal grandmother who helped raise him.” Actually, there’s far more evidence that Martin was a racist than Zimmerman – Martin, after all, called Zimmerman a “creepy ass cracker” while talking to his sometimes-girlfriend Rachel Jeantel, and his tweets evidence some rather disquieting thoughts about white people.\nNow, to the incident.\nThe Retreat at Twin Lakes, where Zimmerman and Trayvon’s father lived, was 20 percent black. From November 2010 to February 2012, there were at least eight burglaries in the neighborhood, and dozens more reports of attempted burglaries. Many of the suspects were describe as young black men. On February 2, 2012, Zimmerman called 911 after he saw a young black man possibly scouting out a robbery location at an empty home. The cops didn’t arrive in time. Four days later, two young black men burglarized another home in the Retreat.\nOn February 26, 2012, Zimmerman was driving to the grocery store when he saw a young black man walking around the neighborhood – Martin. He told the dispatcher, “Hey, we’ve had some break-ins in my neighborhood, and there’s a real suspicious guy, uh, it’s Retreat View Circle, um, the best address I can give you is 111 Retreat View Circle. This guy looks like he’s up to no good, or he’s on drugs or something. It’s raining and he’s just walking around, looking about.” In fact, Martin’s autopsy showed that he had THC in his system.\nWhen asked the race of the suspect, he said, “He looks black.” He described Martin’s “dark hoodie, like a gray hoodie, and either jeans or sweatpants and white tennis shoes.” He added, “He’s here now, just staring…looking at all the houses…Now he’s just staring at me…Yeah, now he’s coming towards me….Something’s wrong with him, Yup, he’s coming to check me out, he’s got something in his hands, I don’t know what his deal is….See if you can get an officer over here….These assholes, they always get away.”\nThis, obviously, was a reference to the multiple burglaries in his neighborhood and the fact that the police didn’t catch most of the suspects.\nZimmerman told the dispatcher that Martin was running. Zimmerman then got out of his car. He told the dispatcher he was following the suspect. The dispatcher said, “Okay, we don’t need you to do that.” At some point while on the call, Zimmerman lost track of the suspect. The conversation continued until Zimmerman said he would meet law enforcement; he hung up at 7:13 p.m.\nWe don’t know what happened next – Zimmerman’s story was that Martin confronted him, demanded to know why he was following, and then punched him in the face. Martin’s defenders say Zimmerman provoked a physical confrontation and then shot Martin in cold blood. Suffice it to say that the latter story is far less credible than the former, given that Zimmerman knew the police were coming, that Zimmerman had a gun he could have pulled at any time, that Martin’s father’s house was 70 yards away, and that Zimmerman had real injuries he need not have incurred if he simply wanted to shoot Martin.\nWhatever happened, witnesses say that Trayvon ended up on top of Zimmerman and began beating him and pounding his head into the ground. Zimmerman reached into his waistband, pulled out his handgun, and shot Trayvon in the chest, killing him. Zimmerman’s story was corroborated by all available evidence, including physical evidence: Martin’s body was undamaged but for the gunshot wound and abrasions on his knuckles from hitting Zimmerman, while Zimmerman’s head had lacerations, two black eyes, and a broken nose.\nZimmerman claimed self-defense. Eventually, prosecutors charged him with second-degree murder, and a jury acquitted him.\nThat is not the story you will hear from the media. You will hear that Zimmerman targeted Martin and then killed him in cold blood. That’s a lie. You will hear that the racist justice system let Zimmerman off for no reason. That’s a lie, too.\nMy tweet remains true: if Martin had not pounded Zimmerman’s head into the ground and been shot for it, he would still be alive.\nBut narrative trumps facts. Which is why it’s imperative to keep repeating facts, even if those facts are unpopular.\nBen Shapiro is Senior Editor-At-Large of Breitbart News, Editor-in-Chief of DailyWire.com, and The New York Times bestselling author, most recently, of the book, The People vs. Barack Obama: The Criminal Case Against The Obama Administration (Threshold Editions, June 10, 2014). Follow Ben Shapiro on Twitter @benshapiro.","url":"https://www.breitbart.com/the-media/2016/02/05/media-pay-homage-to-trayvon-on-21st-birthday-heres-the-real-story/"}
