{"authors":["Associated Press"],"date_download":"2018-10-23 01:11:51","date_modify":"2018-10-23 01:11:51","date_publish":"2017-03-10 08:54:12","description":"NEW YORK (AP) - Before most people are out of bed, Donald Trump is watching cable news.With Twitter app at the ready, the man who condemns the media as \"the...","filename":"data/vaneerConsumption/MediatheenemyTrumpsureisaninsatiableconsumer.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/08/wire-194957-1489136058-878_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300400_Media-enemy-Trump-sure-insatiable-consumer_1540257111.html","title":"Media the enemy? Trump sure is an insatiable consumer","title_page":"Media the enemy? Trump sure is an insatiable consumer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - Before most people are out of bed, Donald Trump is watching cable news.\nWith Twitter app at the ready, the man who condemns the media as \"the enemy of the people\" may be the most voracious consumer of news in modern presidential history.\nTrump usually rises before 6 a.m. and first watches TV in the residence before later moving to a small dining room in the West Wing. A short time later, he's given a stack of newspapers - including The New York Times, The Wall Street Journal, The Financial Times, The Washington Post and, long his favorite, The New York Post - as well as pile of printed articles from other sources including conservative online outlets like Breitbart News.\nPresident Donald Trump listens during a meeting in the Roosevelt Room of the White House in Washington, Thursday, March 9, 2017. Before most people are out of bed, Trump is watching cable news. Indeed, with Twitter app at the ready, the man who condemns the media as \"the enemy of the people\" may be the most voracious consumer of news in modern presidential history. (AP Photo/Evan Vucci)\nThe TVs stay on all day. The president often checks in at lunch and again in the evening, when he retires to the residence, cellphone in hand.\nIt is a central paradox of the Trump presidency. Despite his fervent media criticism, Trump is a faithful newspaper reader who enjoys jousting with reporters, an avid cable TV news viewer who frequently live-tweets what he's watching, and a reader of websites that have been illuminated by his presidential spotlight, showcasing the at-times conspiratorial corners of the internet.\nNo recent president has been so public about his interest in his media coverage, nor seemed so willing to mobilize the powers of the federal government based on a media report that he has just read, heard or watched.\nIn fact, the power of Trump's media diet is so potent that White House staffers have, to varying degrees of success, tried to limit his television watching and control some of what he reads.\nThe president's cable TV menu fluctuates. Fox News is a constant, and he also frequently watches CNN despite deriding it as \"fake news.\" Though he used to watch \"Morning Joe,\" a Trump aide said the president has grown frustrated with his coverage on the MSNBC program and has largely stopped.\nFor Trump, watching cable is often an interactive experience. More than dozen of times since his election, he has tweeted about what he saw on TV just minutes before.\nOn Nov. 29, he posted about instituting potentially unconstitutional penalties for burning the American flag 30 minutes after Fox ran a segment on the subject. On Jan. 24, he threatened to \"send in the Feds!\" to Chicago a short time after watching a CNN segment on violence in the city. On Feb. 6, after CNN reported about a \"Saturday Night Live\" skit on the increasing power of the president's advisers, Trump just 11 minutes later tweeted, \"I call my own shots, largely based on an accumulation of data, and everyone knows it!\"\nOn Tuesday, Trump tweeted five different times about the news of the day being discussed on his preferred morning show, \"Fox & Friends.\"\nMSNBC's Rachel Maddow, a frequent Trump critic, told The Associated Press that she finds it \"unsettling\" that Trump \"may be getting most of his understanding of the world based on whatever he stumbles upon on cable.\"\nWhile pleased that Trump is following the media, Maddow noted that \"the White House is designed as an instrument to feed the president of the United States expertly curated and highly selective, well-vetted information from every corner of the world.\"\nOthers note there may be some smart politics behind Trump's media diet.\nHe \"advertised getting his news the same way his supporters do, which helps make a connection,\" said Tobe Berkovitz, a communications professor at Boston University.\nThe president's advisers try to curb his cable consumption during the workday. But there are no limits when he returns to the residence.\nHe also avidly watches his own staff's TV performances, including White House Press Secretary Sean Spicer's daily briefing. Aides have been known to shape their public comments to please the president or try to influence him.\nTrump's consumption of cable news differs considerably from previous commanders in chief, who have at least claimed to be disconnected from the cable chatter. Jay Carney, White House press secretary under Barack Obama, has claimed that Obama \"doesn't watch cable news,\" though that did not keep the former president from criticizing the medium.\nWhere Trump differs most from his presidential predecessors is his reliance on getting news online - even though he rarely uses a computer and prefers aides to print out articles for him to read.\nWhat he was seeing on Twitter and conservative websites like the Drudge Report and the conspiracy-laden Infowars helped forge his political persona - and his public misinformation campaign questioning whether Obama was born in the United States.\nAnd social media has become a way for some news sources to gain an audience with the president.\nLast Thursday, as questions swirled around contacts between Attorney General Jeff Sessions and the Russian ambassador, a Reddit user posted a picture of Russian President Vladimir Putin and New York Sen. Charles Schumer from a 2003 photo op. Two hours later, the blog The Gateway Pundit reprinted the photo with the headline \"Where's the Outrage?\"\nThe image careened across the internet from an Infowars editor's post to the Drudge Report to Trump's own Twitter account as he delivered that outrage, demanding an investigation into Schumer's alleged ties to Putin.\nThat wasn't the only time last week when Trump put the White House stamp on a theory that originated on the edges of the conservative movement. Radio host Mark Levin voiced without evidence the idea that Obama had wiretapped Trump Tower. That accusation was picked up the next day by Breitbart News, the site formerly run by Trump's current chief strategist Steve Bannon.\nAn aide placed that piece in Trump's daily reading pile, said a White House official, who like other aides would not be named discussing the president's private routine. Fueled by that report on Saturday, Trump unleashed a series of jaw-dropping tweets that accused his predecessor of spying on him.\n\"It's not the normal Beltway echo chamber. This is a very different echo chamber: Something will bounce from cable to the internet to Trump,\" said Berkovitz, the communications professor.\nThe president's clip file is assembled by junior aides, though senior staffers occasionally slip in an article they want him to see. Often he'll sit with staff and use a Sharpie marker to scrawl instructions - or complaints to push back on - on the pages.\n___\nAdditional reporting by David Bauder in New York and Julie Pace in Washington.\n___\nFollow Lemire on Twitter at http://twitter.com/@JonLemire","url":"https://www.dailymail.co.uk/wires/ap/article-4300400/Media-enemy-Trump-sure-insatiable-consumer.html"}
