{"authors":[],"date_download":"2018-10-22 21:07:33","date_modify":"2018-10-22 21:07:33","date_publish":"2014-06-02 18:04:15","description":"A program created to hold down health-care costs may have raised them by billions instead, according to a Center for Public Integrity investigation.","filename":"data/vaneerConsumption/MedicareAdvantageBillingErrorsCostTaxpayersBillions.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/485526/140603-medicare-cpi-jms-1746_0e2f76460a4aa5da934803f10743775a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_investigations_medicare-advantage-billing-errors-cost-taxpayers-billions-n120446_1540242453.html","title":"Medicare Advantage Billing Errors Cost Taxpayers Billions","title_page":"Medicare Advantage Billing Errors Cost Taxpayers Billions","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThis story was published by The Center for Public Integrity, a nonprofit, nonpartisan investigative news organization in Washington, D.C.\nIn South Florida, one of the nation’s top privately-run Medicare insurance plans faces a federal investigation into allegations that it overbilled the government by exaggerating how sick some of its patients were.\nIn the Las Vegas area, private health plans for seniors ran up more than $100 million in added Medicare charges after asserting patients they signed up also were much sicker than normal -- a claim many experts have challenged.\nIn Rochester, New York, a Medicare plan was paid $41 million to treat people with serious diseases -- even though the plan couldn’t always prove the patients in fact had those diseases.\nINSURANCE COMPANY CHEATED MEDICARE OUT OF $1 BILLION, SAYS LAWSUIT\nThese health plans and hundreds of others are part of Medicare Advantage, a program created by Congress in 2003 to help stabilize health care spending on the elderly. But the plans, which accounted for 23 percent of Medicare's $536 billion budget in 2012, have sharply driven up costs in many parts of the United States -- larding on tens of billions of dollars in overcharges and other suspect billings based in part on inflated assessments of how sick patients are, an investigation by the Center for Public Integrity has found.\nRead the Center for Public Integrity's version of this article.\nDominated by private insurers, Medicare Advantage now covers nearly 16 million Americans at a cost expected to top $150 billion this year. Many seniors choose the managed-care Medicare Advantage option instead of the traditional government-run Medicare program because it fills gaps in coverage, can cost less in out-of-pocket expenses and offers extra benefits, such as dental and eye care.\nBut billions of tax dollars are misspent every year through billing errors linked to a payment tool called a “risk score,” which is supposed to pay Medicare Advantage plans higher rates for sicker patients and less for those in good health.\nClick here to read a glossary of Medicare and Medicare Advantage terms.\nCenter for Public Integrity\nClick here to see the Center for Public Integrity's Medicare Advantage explainer.\nGovernment officials have struggled for years to halt health plans from running up patient risk scores and, in many cases, wresting higher Medicare payments than they deserve, records show.\nThe Center’s findings are based on an analysis of Medicare Advantage enrollment data from 2007 through 2011, as well as thousands of pages of government audits, research papers and other documents.\nA note on the Center's methodology.\nFederal officials who run the Medicare program repeatedly declined to be interviewed or answer written questions.\nAmong the findings:\n∎ Risk score errors triggered nearly $70 billion in “improper” payments to Medicare Advantage plans from 2008 through 2013 -- mostly overbillings, according to government estimates. Federal officials declined to identify health plans suspected of overcharging Medicare, citing agency policy that keeps many business records confidential. The Center is suing to make these records public.\n∎ Risk scores of Medicare Advantage patients rose sharply in plans in at least 1,000 counties nationwide between 2007 and 2011, boosting taxpayer costs by more than $36 billion over estimated costs for caring for patients in standard Medicare.\n∎ In more than 200 of those counties, the cost of some Medicare Advantage plans was at least 25 percent higher than the cost of providing standard Medicare coverage. The wide swing in costs was most evident in five states: South Dakota, New Mexico, Colorado, Texas and Alabama.\nCenter for Public Integrity\nClick here to see how risk scores changed.\nSome academic experts and researchers believe the increase in risk scores is more likely to reflect aggressive billing than a rapid deterioration in patients’ health.\nIndustry executives don’t dispute that billing errors occur. But they deny that they charge too much, arguing they only want to be paid fairly for their services.\nClare Krusing, director of communications for America’s Health Insurance Plans, said that the industry trade group is “working together” with federal health officials to improve reporting of risk score data.\nIn the South Florida case, government lawyers have been investigating Humana, Inc. for several years as they try to determine if the company and some of its medical clinics manipulated the complex Medicare Advantage billing system. Humana says it is cooperating with the investigation.\n\"We continue to investigate these matters ourselves and to cooperate with the Department of Justice, as we have all along,\" said the company in a statement.\nIn a separate civil case, a former Bush administration health official alleges in a whistleblower lawsuit unsealed earlier this year that two Puerto Rico health plans cheated Medicare out of as much as $1 billion by inflating patient risk scores. The plans, which at the time were owned by a subsidiary of New-Jersey based Aveta, Inc., denied the allegations.\nClick here to read about the lawsuit.\n∎ Government audits and research reports have warned for years that Medicare’s risk scoring formula breeds overbilling, but efforts to hold the industry accountable have met with little success. Federal officials have yet to recoup hundreds of millions of dollars in suspected overpayments to health plans that date back as far as 2007.\nExcellus Health Plan, the Rochester, New York, health plan that federal auditors said may have overbilled by as much as $41 million in 2007 for treating patients with serious diseases, paid but a fraction of that amount back years later. A company spokesman said the plan settled the matter by paying the government $157,777 in December 2013.\nSome critics expect little to change unless federal officials disclose Medicare Advantage plans’ full service and billing histories -- as they have recently done with Medicare fees paid to more than 880,000 individual doctors and others.\n“The [Medicare Advantage] plans don’t want the data out,” said Dr. Brian Biles, a professor in the Department of Health Policy at George Washington University, whose Freedom of Information Act lawsuits shook loose limited enrollment records used in this project. (Biles assisted Center for Public Integrity reporters with the analysis.)\nDr. David Wennberg, a Dartmouth Institute researcher who has studied the payment issue, said that with billions of tax dollars at stake federal officials need to hit the “reset button” on risk scoring.\nWennberg said Medicare Advantage “is a very large program with lots of money flowing through it. There are always vested interests in protecting the status quo.”\nRead why Medicare Advantage matters to you.\nHealth care politics\nThe Affordable Care Act, or Obamacare, orders deep rate cuts in Medicare Advantage, partly to cover millions of uninsured people. That’s consistent with an early Obama administration promise to reduce payments to the health insurers.\nBut support for Medicare Advantage in Congress has snowballed as it has attracted more and more seniors who are happy with their care and the price they pay for it. Earlier this year, the insurance industry mounted a fierce media campaign to block the rate cuts, enlisting support from more than 200 members of Congress and forcing the administration to partially back off.\nThe debate over how best to pay Medicare Advantage health plans -- and how to curb overcharging -- has been contentious for years.\nAs far back as the 1980s, Congress hoped that carving a bigger role for managed care plans like Medicare Advantage would help curtail overall Medicare spending and ward off waste and fraud that can pop up when doctors and hospitals are paid for each and every service they perform.\nTo that end, Medicare decided to pay health plans a set monthly rate for patients regardless of how much care they needed. But some health plans stacked the deck by signing up people who were healthier than average, a marketing ploy known in insurance circles as “cherry picking.”\nThat led to a “lot of game playing” and “dumping patients who were ill,” said Laurence Bishoff, a Boston health care consultant.\nCongress thought it saw a remedy in the Medicare Modernization Act of 2003. The law created Medicare Advantage and phased in “risk adjusted” payments starting a year later.\nThomas Scully, who helped get the program running under President George W. Bush, said rates were generous in hopes of enticing insurers to expand their Medicare business and not shy away from people in poor health.\n“We very intentionally tried to overpay them a little bit,” said Scully, now a Washington lobbyist with numerous health care industry clients.\nHealth status was added to other factors such as sex, race and age in setting rates. Plans that took on the greatest risk by accepting the sickest patients were paid the most.\nBut turning to risk scores as the way to adjust payments ushered in a new form of Medicare billing abuse: Some health plans misstated how sick their patients were or failed to document they had treated illnesses Medicare paid them to treat, the Center’s investigation found.\nBy 2009, government officials were estimating that just over 15 percent of total Medicare Advantage payments were inaccurate, about $12 billion that year.\nBy the end of 2013, officials reported the error rate had dropped to nine percent, which still added up to $11.8 billion for the year. Nearly 80 per cent of that -- $9.3 billion -- was overcharges, records show.\nThe Medicare Advantage billing error rate has averaged 12 percent over the past six years, according to government officials. The average error rate for standard government-run Medicare, which federal officials assert is highly vulnerable to billing fraud and abuse, was about 8 percent.\nMedicare Advantage has faced much less scrutiny. The federal Centers for Medicare and Medicaid Services (CMS) didn’t try to recoup overpayments until 2012, eight years after phasing in risk scoring. And when it did, it won back only $3.4 million — a tiny fraction of the estimated losses, according to government records. Though the agency is beefing up collection efforts starting this year, most health plans won’t see federal auditors for years.\nMalcolm Sparrow, a professor at Harvard University’s John F. Kennedy School of Government and health fraud expert, said officials are “asking for trouble” by allowing health plans to generate the data on which risk scores and their revenues are based.\n“You want to make sure this is audited rigorously,” Sparrow said. “It’s much more expensive [to taxpayers] not to.”\nFederal Probe\nFour of the ten major Medicare Advantage plans with the highest average risk scores nationally are in Puerto Rico.\nMedicare Advantage plans, which control 70 percent of the island market, say their patients are poorer and sicker than average. They also say that cuts required under the Affordable Care Act have hit them hard, prompting cuts in benefits and higher premiums for patients who can ill afford to pay more.\nRisk scores at the two Aveta-related health plans, MMM Healthcare and Preferred Medical Choice, shot up by an average of 11 percent from 2007 through 2011. Nationwide, the growth rate averaged three percent over the same period. The company had no comment.\nSan Juan-based Medical Card System, known by the initials MCS, reported a 5 percent rise in the scores over the same time — nearly twice the national average.\nThe billing practices also have attracted legal scrutiny. The whistleblower lawsuit filed against Aveta by former executive Jose R. “Josh” Valdez alleges that the company overbilled Medicare by as much as $1 billion by inflating risk scores.\nValdez alleges that Aveta paid its stockholders a $100 million dividend during the time that it was overcharging Medicare.\nMCS has faced questions over risk scores, too.\nFederal agents searched the MCS tower headquarters on Oct. 13, 2011. MCS said in a 2012 financial statement that it had received four grand jury subpoenas as part of a U.S. Attorney’s Office investigation of its “risk adjustment data reporting.”\nMCS said the company conducted an “internal review” that found no wrongdoing, but prompted it to return an “immaterial” amount of money to Medicare.\nIn an April interview inside the MCS tower in San Juan’s Hato Rey financial district, Chief Executive Officer Jim O’Drobinak said the federal probe has ended and MCS has been cleared.\n“Nothing came of it,” he said, blaming the investigation on a “disgruntled former employee.” Law enforcement sources confirmed that the investigation has been closed.\nDr. Inés Hernández, MCS chief medical officer, said that the health plan has moved aggressively to treat patients in their homes and identify diseases so they can be treated in the early stages.\n“We’re not just getting information for risk scores,” she said.\nBut CMS officials have been concerned that home visits and other health assessments by health plans can contribute to higher risk scores -- and drive up costs without benefiting patients by providing them with more care.\nOver/Under\nCongressional auditors and some lawmakers have asserted for years that overpayments to Medicare Advantage plans may be much higher than federal officials have acknowledged.\nAmong the most steadfast critics is Rep. Henry Waxman, D-California. In a March 6, 2009, letter to an agency official, he argued that Medicare Advantage plans were a bad deal for taxpayers because each illness they discover, “whether it is treated or not can increase the payment the plan receives from CMS.”\nWaxman, who then chaired the House Energy and Commerce Committee, criticized health plans for figuring out how to “manipulate” risk scores to wrest money they didn’t deserve from Medicare.\nCMS officials have conceded that risk scores rose much faster for Medicare Advantage patients than for those in standard Medicare and that the rise couldn’t be explained away by saying that the health plan members were sicker.\nStarting in 2010, they stepped in and cut payments to Medicare Advantage plans to offset rising risk scores.\nYet in January 2012 the Government Accountability Office, the watchdog arm of Congress, said that the cuts weren’t deep enough and opined that Medicare could have saved as much as $3 billion a year by reducing risk scores further.\nA year later, the GAO went a step further. A January 2013 report said CMS made “excess payments” to Medicare Advantage plans of between $3.2 billion and $5.1 billion between 2010 and the end of 2012 because risk scores were higher than justified.\nThe Center for Public Integrity data analysis found that Medicare Advantage can cost the government as much as 25 percent more than standard Medicare in some areas.\nThe data analysis also found that seemingly tiny variations in risk scores can boost taxpayer costs enormously — especially in health plans that are growing fast.\nIndustry officials have a different take.\nThey say that their members tend to have lower incomes than the elderly population as a whole and have a higher risk of needing expensive medical care.\n“They have looked healthier because of incompleteness of this data,” said John Gorman, a former federal health official who is now a prominent Medicare Advantage consultant.\nOthers blame the sheer complexity of risk-scoring for causing confusion about billing.\nJim Redmond, a vice president at Excellus Health Plan, which federal auditors in 2012 said couldn’t always document illnesses it was paid to treat, denied any impropriety. He said the billing system was “established with good intentions” but “didn’t fully recognize” how difficult it would be for health plans to oversee.\n“We have more than 18,000 physicians submitting claims to us every day. We audit a portion of the claims and medical records for accuracy, completeness and consistency,” Redmond wrote in an email.\n“However, the medical delivery system would grind to a halt if we made every provider submit all of the documentation for each and every claim they file on behalf of members.”\nCourt records show that the billing system’s complexity has stymied government investigators reviewing a whistleblower lawsuit filed in 2010 by physician Olivia Graves against Humana.\nGraves, who has practiced in South Florida for more than three decades, alleges that a Humana-owned clinic diagnosed patients with conditions such as diabetes with complications, which boosted Medicare payments. She alleged that those diagnoses were “not supported by the medical records.” Her suit alleges that Humana knew about the alleged overcharging and did nothing to stop it.\nThe U.S. Attorney’s Office declined to join the South Florida case even though a federal judge granted it 11 requests for more time to investigate. They argued lawyers and other government personnel “had little or no experience in the applicable regulations and operations of the [Medicare Advantage] program” However, government lawyers said their investigation is continuing.\nThe case was unsealed in May and is pending.\nHumana also faces other investigations into allegations that it overbilled the government, including a criminal investigation by the Department of Justice in Washington and a criminal case involving the U.S. Attorney’s branch office in West Palm Beach, Florida, according to court records. Humana spokesman Tom Noland said, \"Our original self-disclosure several years ago was made to the criminal division of the Department of Justice, but Humana to our knowledge is not the subject of a criminal investigation.”\n‘Black Box’\nMany researchers are hoping that CMS will make public detailed Medicare Advantage billing and service data that might allow them to assess how well risk scoring is doing in predicting costs. They also want to study industry claims that they are treating lower income and sicker patients.\nBut that’s not yet possible because CMS has shown little interest in making Medicare Advantage data public.\nThat’s quite a different stance than the agency took in April, when it released detailed information about how much individual doctors were paid by Medicare. The decision drew criticism from the American Medical Association, which has argued that it violated the privacy of doctors. CMS principal deputy administrator Jonathan Blum, who left the agency in May, previously announced on his blog that data “can shine a light on how care is delivered in the Medicare program.”\nSparrow, the fraud expert from Harvard, said that it should be easier for the government to cough up information about huge health care corporations than about individual physicians. The doctor billing data covers about $77 billion in taxpayer spending for 2012, about half the Medicare Advantage price tag.\n“Anything that starts with a ‘b’ seems like a lot of money to me,” Sparrow said, adding that Medicare Advantage financial data and other records “ought to be a matter of ordinary public record.”\nMedicare Advantage is a “black box,” added James Cosgrove, who heads health investigations for the GAO, the audit arm of Congress.\n“We know what services they say they will provide … but we never know exactly what services are being provided,” Cosgrove said.\nThe Center for Public Integrity is a nonprofit, nonpartisan investigative news organization in Washington, D.C.","url":"https://www.nbcnews.com/news/investigations/medicare-advantage-billing-errors-cost-taxpayers-billions-n120446"}
