{"authors":["Aaron Klein"],"date_download":"2018-10-30 21:30:11","date_modify":"2018-10-30 21:30:11","date_publish":"2015-12-02 16:26:44","description":"Lost in much of the media coverage of new domestic cases of chikungunya, a painful and sometimes debilitating mosquito-borne virus, is that Mexico has been experiencing an alarming rise in infections that could potentially spread across the porous border--and there is already evidence of at last one case arriving from Mexico. |","filename":"data/vaneerConsumption/MediaMinimizeMexicosRoleinSpreadofDebilitatingVirusHittingUS.json","image_url":"https://media.breitbart.com/media/2015/12/Hunduras-Health-Clinic-Patients-with-Chikungunya.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_02__1540935011.html","title":"Media Minimize Mexico's Role in Spread of Debilitating Virus Hitting U.S.","title_page":"EXCLUSIVE: Media Minimize Mexico's Role in Spread of Debilitating Virus Hitting U.S.","title_rss":"NULL","source_domain":"breitbart.com","text":"Lost in much of the media coverage of new domestic cases of chikungunya, a painful and sometimes debilitating mosquito-borne virus, is that Mexico has been experiencing an alarming rise in infections that could potentially spread across the porous border. And there is already evidence of at least one case arriving from Mexico.\nIn May, the Centers for Disease Control and Prevention added Mexico to the “Watch Level 1” category for the disease. Last week, the CDC updated their “Level 1” warning, advising travelers to Mexico to “protect themselves from chikungunya by preventing mosquito bites.”\nLocal transmission began in Mexico in October 2014, with 155 cases confirmed before the end of the year. The numbers skyrocketed this year, with 9,952 cases reported in Mexico as of November 8.\nAccording to CDC data, the U.S. this year has seen 571 chikungunya cases in 42 states as of November 17, with all reported cases coming from “travelers returning from affected areas.”\nThere is immediate cause for concern about the spread of the disease domestically, due to the increased detection of yellow fever mosquitoes–also known by their scientific name, Aedes aegypti–in California over the past year. The aggressive mosquito is one of the insects capable of transmitting chikungunya, as well as the deadly dengue hemorrhagic fever and other serious diseases.\nThe news media has spotlighted chikungunya in recent days after a study released last week found the disease can cause severe and potentially fatal brain infection, especially in infants and seniors. The report, published in the journal Neurology, examined a 2005-2006 chikungunya outbreak on Reunion Island in the Indian Ocean. Scientists found that the rate of encephalitis among those infected with the chikungunya virus outpaced the rate for all encephalitis reported in the U.S. from 1998 to 2010.\nThe most common symptoms of chikungunya are fever and joint pain. Other symptoms include headache, muscle pain, joint swelling, or rash.\nMuch of the news media reported the disease largely originates in the Caribbean as well as Central and South America, failing to document the outbreak across the southern U.S. border.\nNBC News reported on chikungunya last week:\nThe virus only arrived in the Western Hemisphere in December 2013, on St. Martin. But it spread fast and has been found as far north as Florida and across Central and South America.\nMore than 600,000 cases have been reported so far this year, with 76 deaths, according to the Pan American Health Organization. In 2013 and 2014 more than 1.1 million cases were reported and it killed 194 people.\nU.S. News and World Report noted:\nAmericans who contract chikungunya usually acquire the virus while traveling. The first locally transmitted case occurred in Florida in 2014, according to the U.S. Centers for Disease Control and Prevention.\nChikungunya, described in medical literature as debilitating, causes fever, headache, and severe joint pain that can last months.\nUPI documented:\nChikungunya, which originated in Africa, was first seen in the Western Hemisphere in the Caribbean island of St. Martin. It has since spread to other islands in the region, as well as Central and South America, and been seen as far north as Florida, Georgia and North Carolina.\nUnlike most news coverage, CBS News did mention Mexico in its most recent article on the virus. In a piece published Friday titled, “Mosquito-borne virus may cause brain swelling, death,” CBSNews.com noted in one sentence at the end of the seventh paragraph that “as of September 2015, more than 7,000 cases had been reported in Mexico, according to the CDC.”\nThe main CDC information page for chikungunya does not mention Mexico when discussing the spread of the disease. Instead, the health agency points to the prevalence of the virus in the Caribbean and South America.\nThe CDC states:\nMore chikungunya-infected travelers will come into the U.S. from the Americas, increasing the likelihood that limited local chikungunya virus transmission could occur. Since the Caribbean outbreak began in December 2013, over 750 travelers have returned to the U.S. infected with chikungunya virus. And as of August 2013, a handful of locally acquired cases had been reported in the continental U.S.\nMigrants, chikungunya and Texas\nMissing from the discussion is the potential for illegal aliens to bring in Chikungunya from Mexico. One area to watch is clearly the Texas-Mexico border, where dengue is already endemic.\nIndeed, there is at least one case of transmission from Mexico to Texas.\nOn August 11, 2015, the city of Garland issued the following press release:\nOn August 11, 2015 the Garland Health Department (GHD) confirmed the first case of imported Chikungunya virus (CHIKV) in Garland in 2015. The individual was infected with the virus during recent travel to Mexico and is no longer contagious.\nAnd Breitbart unearthed a June 2014 dispatch from the Public Health and Environmental Services for Harris County, the most populous county in Texas. The pamphlet on Chikungunya stated, “Global travel, urbanization, immigration, climate, and presence of the mosquito species known to transmit these diseases in Harris County are all factors that contribute to the possibility of these diseases emerging in our area.”\nOn July 7, 2014, the Texas Department of State Health Services confirmed the first human case of the disease, reportedly an individual who had traveled to the Caribbean. Two days later, a second case was confirmed, this time in an 18-year old woman who had returned from a trip to Haiti. By July 23, 2014 a “handful of Texas residents” were identified as being infected with the chikungunya in five Texas counties. The next month, Texas was home to at least 14 cases. Nationwide that month, cases in New Jersey more than doubled to 25; New York confirmed 44 cases, and Florida saw a marked increase.\nThese cases came before the Mexico outbreak reached a “Level 1” CDC threat.\nThe World Health Organization documented a previous case in which infected migrants introduced chikungunya in 2007 in a coastal village in Italy, sparking an outbreak of 197 cases.\nIn June 2012, Scientific American discussed the disease as well as other illnesses such as Chagas and dengue fever in the context of possible transmission via illegal aliens crossing the border. “Since undocumented immigrants are difficult to track, officials have a hard time measuring and treating infected individuals,” the magazine reported.\nMosquito arrives\nThe chikungunya-spreading Aedes aegypti mosquito, meanwhile, is spreading across California and threatens to spill into other states.\nIn September 2015, it was detected for the first time in San Bernardino and Riverside Counties.\nIn 2014 the insects were found in offices at San Diego’s 32nd Street Naval Station, the Los Angeles Times reported. The same kind of mosquitoes were found on Oct. 7 and Oct. 8, 2014 in the Los Angeles-area counties of Commerce and Pico Rivera.\nThey have since been detected in Tulare, Kern, Imperial, Orange, and Alameda counties.\nAnother transmitter of the disease, the mosquito Aedes albopictus, was detected in Kern and San Diego counties as well as regions of Los Angeles County.\nThe mosquitoes can also spread yellow fever. The World Health Organization’s global alert on yellow fever says the disease is “endemic in 10 South and Central American countries and in several Caribbean islands.”\n“The disease was originally imported into the Americas from Africa, but became widely established there,” the alert adds.\nLast year, the Obama administration announced plans to facilitate the immigration of up to 100,000 Haitians to the U.S. to be “reunited with their families.”\nThe Caribbean country is currently in the midst of outbreaks of chikungunya and the worst cholera epidemic in recent history.\nWith research by Brenda J. Elliott.","url":"https://www.breitbart.com/politics/2015/12/02/exclusive-media-minimize-mexicos-role-in-spread-of-debilitating-virus-hitting-u-s/"}
