{"authors":[],"date_download":"2018-10-30 14:34:12","date_modify":"2018-10-30 14:34:12","date_publish":"2015-05-08 00:00:00","description":null,"filename":"data/vaneerConsumption/MediacantbelieveconservativeswoninBritishelection.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_05_media_cant_believe_conservatives_won_in_british_election_1540910052.html","title":"Media can't believe conservatives won in British election","title_page":"Media can't believe conservatives won in British election","title_rss":"NULL","source_domain":"americanthinker.com","text":"Prior to the May 7 vote, every major poll and pundit said the race between David Cameron's Conservative Party and Ed Miliband's Labor Party was too close to call, and that neither man would receive a majority in the 650 seat British parliament.\nThe media at home and abroad is having a hard time accepting the election results in Great Britain.\nBritish voters awoke this morning to the news that their pundits are putzes and their polls are useless. Cameron's Conservative Party swept to a massive victory that will almost certainly give him an outright majority in parliament.\nCNN:\nPundits had predicted the UK election would be a close one and suggested there would be days of post-vote, backroom talk to thrash out a power-sharing deal. Instead, it's turning into a thumpin'. With almost all the results in, British Prime Minister David Cameron stays in power, with his party, the Conservatives, stronger than at the last election in 2010. Reuters has reported that the center-right Conservative Party has won an \"effective majority in Parliament with 324 seats.\" That's two seats short of an absolute majority. As the dust settled Friday, three party leaders resigned, including opposition Labour Party leader Ed Miliband and Liberal Democrat leader Nick Clegg. What this means for the UK is that the Conservatives get to govern alone after five years in a coalition. What this means for the rest of the world is what we should be paying attention to, even if we were not one of the millions who cast a ballot. The outcome of this vote could reshape the country's global role for years: Britain's relationships with the European Union, NATO and the United States could all be affected.\nUKIP, the independence party so villified in British and American media, actually got the third most votes behind Labor and the Conservatives. But those votes will translate into few seats in parliament because they were so spread out.\nThe big winner of the night was the Scottish National Party. They kicked Labor's butt all over the country, leaving the Scottish Labor party in tatters.\nWith almost all of Scotland's 59 parliamentary seats counted, the Scottish National Party (SNP) had won 56 of them, up from just six five years ago, all but obliterating Labour in one of its historic strongholds. \"We're seeing an electoral tsunami on a gigantic scale,\" said Alex Salmond, the party's former leader, now elected to represent it in parliament in London. \"The SNP are going to be impossible to ignore and very difficult to stop.\" The United Kingdom includes England, Scotland, Northern Ireland and Wales. England accounts for 85 percent of the UK population but Scottish politicians elected to parliament in London have historically held important government posts. That will now be impossible with the SNP holding nearly all Scottish seats. In a body blow to Labour that set the patter for the night, Douglas Alexander, the party's campaign chief and foreign policy spokesman, lost his seat to a 20-year-old Scottish nationalist student, the youngest member of the House of Commons since 1667.\nScotland is probably going to be Cameron's first big post-election challenge, as the momentum for independence now appears unstoppable.\nMilibrand and Nick Clegg, the Liberal Democratic party leaders, have both resigned already. Clegg's LDP saw their share of seats drop from 57 in 2010 to just 8 today.\nThe polls were massively wrong. What excuse are they giving? We was lied to!\nThe final result, with the Conservatives projected to win as many as 329 seats and an outright majority, only added to an intensifying debate in the United States, Britain and elsewhere about the accuracy of polling, the problems of getting accurate samples in an era when voters can no longer be reached as easily by traditional means like landline phones and the fracturing of politics making it harder to predict voter behavior. In Britain’s case, weeks of assumptions built around the consistency of pre-election polling gave way to a sense of shock when broadcasters unveiled the results of their exit poll right after the polls closed on Thursday night. The exit poll accurately predicted, within a few seats, the final outcome, but it was initially greeted with deep skepticism by party leaders and some voters. Paddy Ashdown, a former leader of the Liberal Democrats, pledged to “publicly eat my hat” after the first exit polls suggested that his party would see its parliamentary ranks slashed by 10 members. “I have been offered 10 hats on Twitter tonight,’’ he told Andrew Neil of the BBC, “not all of them politely, I have to say.” As the poor performance of the Liberal Democrats became more clear, Mr. Ashdown’s hat went viral on Twitter, with a fake account, and manipulated images of Lord Ashdown eating a hat proliferating on social media. The failure to accurately predict the result was reminiscent of recent elections in Israel, where when Prime Minister Benjamin Netanyahu won a clear victory after pre-election polls showing the rival Zionist Union in the lead. Analysts attributed Mr. Netanyahu’s surprise comeback to an 11th-hour political offensive, including a pledge that there would be no Palestinian state. [...] Writing in The Guardian, Alberto Nardelli, the news organization’s data editor, said there was no simple explanation to what went wrong with the polling. “It could be simply that people lied to the pollsters, that they were shy or that they genuinely had a change of heart on polling day,” he said. “Or there could be more complicated underlying challenges within the polling industry, due for example to the fact that a diminishing number of people use landlines or that Internet polls are ultimately based on a self-selected sample.”\nSo many people are refusing to talk to pollsters that their actual sample sizes continue to fall, causing them to weight the responses inappropriately, resulting in what is apparently a useless survey. It is also possible that people don't express their true political feelings to pollsters because some positions are considered politically incorrect, or belonging to a certain group or political party is frowned upon.\nOf course, the inherent media bias against conservatives in any country was on display this morning with headlines in Europe and the US like CNN's \"UK Election Shock\" and Reuters \"Unexpected Triumph.\" What do you think those headlines would be if Labor had won?","url":"https://www.americanthinker.com/blog/2015/05/media_cant_believe_conservatives_won_in_british_election.html"}
