{"authors":[],"date_download":"2018-10-22 23:01:30","date_modify":"2018-10-22 23:01:30","date_publish":"2014-05-13 14:30:32","description":"It's a flying computer and it's costing U.S. taxpayers about $1 billion ... a month.","filename":"data/vaneerConsumption/MeettheUSJetFighterThatCanDoItAllMaybe.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/438826/140513-f-35_1025_d47becb8b687bf5118950a1e92acd607.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_economy_meet-u-s-jet-fighter-can-do-it-all-maybe-n104146_1540249290.html","title":"Meet the U.S. Jet Fighter That Can Do It All ... Maybe","title_page":"Meet the U.S. Jet Fighter That Can Do It All ... Maybe","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nOn a mile-long assembly line in Ft. Worth, Texas, Lockheed Martin is putting together a jet fighter that no one can match. The F-35 Joint Strike Fighter will be stealthier, smarter, more capable, and more flexible than any aircraft ever built.\nIt better be. It's costing American taxpayers close to $1 billion. A month.\n\"It is a flying computer,\" said Steve O'Bryan, vice president of the F-35's integration and business development at Lockheed Martin. \"Where technology goes, where software goes, the F-35 will be flexible with it.\"\nThat's important for an aircraft that the U.S. military and its allies are counting on to be the backbone of air defenses for the next half-century.\n\"It is a flying computer.\"\nFor example, the F-35 currently isn't configured to control another aircraft, such as an unmanned plane that may fly in formation with it, since no UAV—unmanned aerial vehicle—has yet been created that can keep pace with the F-35. That will probably change over the next quarter century, and, conceivably, the software could be easily added.\n\"The future would bring you an F-35 operating UAVs,\" said O'Bryan.\nAmerica's only fighter in production\nA lot is riding on the Joint Strike Fighter's success. A hundred jets have been built so far, and they are being tested by the military. The first combat-ready airplane is slated to be delivered next year. Eventually there will be more than 2,400 flying for the U.S. military, with allies buying hundreds more.\nHowever, the non-partisan Government Accountability Office found that issues remain with some of the jet's software, a problem that could again delay the rollout of an aircraft that has already dealt with an array of problems and seen its original price tag double. Developing, buying and maintaining the F-35 program over the next half century will cost about $1 trillion, with a \"T\".\nStill, the military remains committed to the plane. \"They're still working on the software,\" said Lt. Col. Matt Renbarger, who is test-flying the aircraft at Eglin Air Force Base in Florida.\n\"Apple and IBM, when they build new computers, have to work through software things when they start things up—we're working through the same issues on our end, too,\" he said. \"I'm confident the entire team is going to be able to put together a very good airplane.\"\nThere are many firsts with the F-35. It will be the first fighter jet made of composite material. It consolidates a seemingly endless amount of information onto a couple of screens inside the cockpit...or onto the pilot's visor inside a custom-fitted helmet. In addition, external cameras around the jet can transmit pictures onto the visor so that when a pilot looks down, it will be as if he or she is looking right through the bottom of the plane.\n\"If the radar sees something, the electronic warfare system sees something, your wingman sees something in his airplane, all of that stuff gets poured in, and you look on your display, and you just have one picture of the battlespace,\" said former F-35 test pilot Art Tomassetti, who now helps manage the program at Lockheed.\nThat's a lot of information for one pilot to process, and as much as the aircraft of the future is changing, so are the skills needed in pilots.\n\"The stick and rudder skills that used to be so important, we've minimized, because we've made the airplane easy to fly,\" said Tomassetti. \"What if we could teach anybody to fly the airplane? Think about the spectrum (of pilots) that might open up for us.\" The best pilots in 25 years, he said, will be the best tacticians.\n\"We've trained 50 pilots here over the last year, and everyone has said it's the easiest airplane they've ever flown,\" said Renbarger, who used to fly F-16s.\nWith so much data streaming in from so many sources, what's the risk of information overload?\n\"We did have some concerns about that when we first started flying the jet, but once we got into it and saw how much human factors engineering had been put into the airplane, those concerns have been allayed.\" He added, \"All I have to worry about is putting the cursors on something I want to shoot a missile at or drop a bomb on...and it works.\"\nPerhaps that's why the biggest threat to the best jet fighter ever conceived isn't a Chinese warplane or a Russian missile—the biggest threat could be far more potent: the budget ax.\nThe Pentagon is insisting Lockheed bring down the F-35's costs. and there has been some progress on that front. For example, all three variations of the jet are being built along the same assembly line in Ft. Worth, which saves money.\n\"We also shrink the amount of time it takes to build an F-35,\" said Lockheed Martin's O'Bryan. \"We only use about 15 percent of the labor force it took to build that same number of F-16s.\"\nThe F-35 has also created another trend we may see more of in 25 years: Bringing in international partners from the beginning to help share the costs. Ten countries have invested in and/or plan to buy the fighter.\nInformation is life\nOther trends include the ability of planes like the F-35 to carry more bombs, but smaller, lighter bombs, which allow planes to fly farther and hit more targets. The entire military is also pushing defense companies to build products that can operate on a single software platform.\nO'Bryan said the air defense system of the future will include fewer single-mission aircraft—planes that really only have one job—in favor of aircraft with multiple roles. \"Ninety percent of every aircraft's lifetime is peacetime, and it also has to contribute in that time as well, whether it be intelligence-gathering or surveillance.\"\nIt's a big shift from when he started flying F-18s a quarter century ago.\n\"When I flew, it was 'speed is life,'\" said O'Bryan. \"In today's fifth generation (aircraft), it's 'information is life.'\"\nHe said the old days of aerial dogfighting are over. If an F-35 pilot is ever actually seen by an enemy, he or she has done something wrong. There's no need to ever get that close.\n\"It's probably less romantic,\" O'Bryan said, \"but I never met a fighter pilot who wanted a fair fight.\"\nCorrection: An earlier version of this story incorrectly stated that the F-35 is the only active fighter line in production in the United States. Boeing still produces F/A-18s and F-15 fighters in St. Louis, Missouri.","url":"https://www.nbcnews.com/business/economy/meet-u-s-jet-fighter-can-do-it-all-maybe-n104146"}
