{"authors":["Natalie Corner For Mailonline"],"date_download":"2018-10-23 02:40:36","date_modify":"2018-10-23 02:40:36","date_publish":"2017-03-10 11:53:06","description":"Charlie Mullins, 64, started Pimlico Plumbers nearly 40 years ago after dropping out of school. Now a multi-millionaire, Charlie flits between properties in Marbella and London by private jet.","filename":"data/vaneerConsumption/MeetCharlieMullinsBritainsrichestPLUMBER.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/11/3E22763D00000578-0-image-a-31_1489145203582.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4297908_Meet-Britain-s-richest-PLUMBER_1540262436.html","title":"Meet Charlie Mullins, Britain’s richest PLUMBER","title_page":"Meet Charlie Mullins, Britain’s richest PLUMBER | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A tradesman who left school at 15 and went on to become Britain's richest plumber flies between luxury homes on a private jet and splurges on luxury cars and champagne.\nCharlie Mullins, now 64, flits between an £8million London penthouse and palatial villas in Marbella, Spain, and drives not one but two £350,000 Bentleys.\nThe plumber turned entrepreneur founded Pimlico Plumbers in 1979, which now employs 300 people, counts David Cameron, Richard Branson and Simon Cowell as clients, and is worth around £70million.\nThe Rod Stewart fan reveals a glimpse at his lavish lifestyle on Channel 4's How'd You Get So Rich, in which he's seen twerking on the balcony of a Spanish mansion, and attributing the success of his firm to the fact 'we're all good looking guys'.\nHost Katherine clinks champagne glasses with the charismatic entrepreneur on board his private jet\nAccording to Charlie, part of Pimlico Plumbers' success is down to the fact 'we're all good-looking guys'\nThe pair chat about his lavish lifestyle at his plush London penthouse, worth £8million\nThe series is presented by the comedian Katherine Ryan, who enjoys a spin in Charlie's Bentley, visits his luxury London home, and pops champagne on board his private jet.\nAs she digs deep into his psyche - discovering he began tinkering with plumbing at nine years old and that he's a huge fan of Rod Stewart - she can't resist mocking his accent.\nAs the pair lounge in his luxury pad, Katherine deliberately misunderstands Charlie's Cockney pronunciation as he tells her about working at Rod's house: 'I think we do his plumbing,' he says.\nThe plumbing mogul takes Katherine round a villa in Marbella that he plans to buy, to add to his two other properties on the Costa del Sol\nIn London Charlie drives a blue Bentley with a personalised licence plate worth £350,000\nAfter viewing this eight million Euro property in Spain, Charlie and Katherine end up enjoying a spot of twerking on the balcony\n'We do a lot of famous people's plumbing, you need to trust anybody that comes in your house, especially a plumber.'\nKatherine jokes: 'I don’t trust anyone that comes in my a***. And you've been in a lot of famous a****.'\nThe producers can be heard laughing in the background as a puzzled Charlie tries to explain he said 'house' - but to no avail.\nThe pair go for a cruise in one of Charlie's £350,000 Bentleys on the Channel 4 show\nA glimpse at the plumbing boss' lavish London penthouse on the Channel 4 show\nOn the show Charlie offers to take Katherine on his private jet to go villa shopping in Marbella - where he already owns two properties.\nAs they pop champagne on the flight, the mogul explains the reasons behind his success, saying: 'What makes us different is we're a top company, we provide the best plumbing services out there.\n'We turn up there the time you want us, we are very transparent, we’re all good looking guys, if we provide something that they want and a good quality service then why won’t you be successful?'\nCharlie turns his nose up at an eight million Euro villa that doesn't quite suit his taste - but the pair make their own entertainment by twerking on the balcony as Katherine raps.\nHe is sold on a 15.9 million Euro (£13.8m) villa and reassures Katherine that he won't have to cut back on any of his excesses as a result of the splurge.\n'No we'll take on more plumbers and do more work out here. I think we can afford it,' he adds.\nDelighted at being in his company Katherine tells Charlie: 'I think you are the best plumber I have ever met. Charlie is a multi-millionaire everyman.'\nHow'd You Get So Rich? airs Monday March 13 on Channel 4 at 10pm","url":"https://www.dailymail.co.uk/femail/article-4297908/Meet-Britain-s-richest-PLUMBER.html"}
