{"authors":["John Hayward"],"date_download":"2018-10-30 20:50:15","date_modify":"2018-10-30 20:50:15","date_publish":"2015-11-08 19:35:12","description":"Zoltan Istvan is running for President in 2016, and hoping he might be one of the last humans to hold the job.","filename":"data/vaneerConsumption/MeetTheTransHumanistPresidentialCandidate.json","image_url":"https://media.breitbart.com/media/2015/11/zoltan-istvan-flag-edited.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2015_11_08__1540932615.html","title":"Meet The 'Trans-Humanist' Presidential Candidate","title_page":"Meet The 'Trans-Humanist' Presidential Candidate","title_rss":"NULL","source_domain":"breitbart.com","text":"He doesn’t seem to be polling terribly well at the moment, but “transhumanist atheist” Zoltan Istvan is running for President in 2016, and hoping he might be one of the last humans to hold the job. Scott Beauchamp of the Pacific Standard chatted with Istvan about the coming age of benevolent robot overlords:\nWhen I asked Istvan, currently touring America in his Immortality Bus, what American politics would look like in 100 years, he answered that “There won’t be an America in 100 years. I’m sure of that fact. That’s why I formed the World Transhumanist Party, whose mandate is to become the first democratically [elected] political party to run a world government.” When I asked him if he would want to be replaced by an AI politician, Istvan’s response was upbeat and matter-of-fact. “Yes, absolutely,” he said. “I would love to see a truly altruistic entity running our government. Right now, all politicians, including myself, are motivated by self-interest. This is just how humans are. So wouldn’t it be nice to have something like a super-intelligent AI running things and it be entirely after our best interest?”\nAs Beauchamp wryly notes, Istvan “might be the only politician in America running on a platform of eradicating not only national boundaries, but his own job as well.”\nThis notion of efficient, incorruptible rule by machines is a futurist daydream with a very long pedigree, as Beauchamp demonstrates by citing decades-old sci-fi ruminations on the subject. The idea is that A.I. politicians would be immune to temptations of both flesh and money, utterly selfless and dedicated to their goal, making logical decisions for the good of all without emotional distortions or foolish human prejudice.\nTold what the ideal society should look like, a ruling A.I. would set about constructing it with tireless energy and perfect efficiency.\nSuch ideas are not purely the realm of science fiction. They’re a sci-fi ideal of what collectivists think politics already is. The modern socialist already believes his absolute rulers are paragons of intelligence, compassion, and selflessness. The “progressive” sees himself as better than other men and women, so his rulers must, in turn, be titans.\nSocialism is a religion, as much as a political ideology, and it worships the idea of the State as precisely the sort of incorruptible benevolent intelligence that transhumanists dream of encoding in computer algorithms. The Left is firmly wedded to a mythology of free enterprise as cruel, selfish, short-sighted, and foolish… while government is compassionate, selfless, forward-looking, and far more intelligent than any private-sector organism could ever be.\nAbsolute rule by a super-human electronic mind is a satisfying dream because it envisions a society where everyone accepts that the master of the socialist super-state is incorruptible and infallible. To those who fantasize about perfect societies deftly managed by the best and brightest, this post-human future would represent the final refutation of classical liberalism’s most effective arguments: namely, that power corrupts; politicians are not, in fact, selfless shepherds who only want the best for everyone; and Big Government does insanely stupid things, because it can’t process information as well as the distributed intellect of the private sector.\nLet’s take the notion of A.I. governance seriously for a moment, assume the coming decades will remove all the technical obstacles, and ask: why does anyone believe a singular super-mind would be any better at determining what human beings really need, or judging what they want?\nThat’s where all collectivist schemes fall apart, even if a tireless intellect that can manage vast amounts of information with lightning speed is assumed to be in charge. Using coercive force to thwart the ambitions of law-abiding people is morally wrong, whether that force is wielded by corrupt humans or an electronic deity. It’s always wasteful and inefficient, because the loss of wealth and intellectual energy due to coercion is unacceptably high. The data fed into any centralized system will inevitably be suspect, when that data flows from a nation of millions.\nAlso, these transhumanists should not be so sanguine about A.I. politicians lacking what Beauchamp refers to as the “negative personality traits of ‘meat-bag’ politicians,” including “vanity, rage/revenge, and sex addiction.” Who says artificial intelligences won’t generate personalities for themselves, implying the distinct possibility of negative traits?\nWe still don’t know all that much about how human personalities form, never mind how an entirely new form of consciousness would mature. It might even be rash to assume artificial intelligence won’t be interested in sex. What if consciousness tends to bring a desire for reproduction, and artificial minds aren’t content with merely copying themselves, but rather long for uniting with other A.I.s to create new and different minds, without human intervention?\nThere probably will be artificial intelligence politicians eventually, but not because humans create them as idealized overlords for perfectly-managed collectivist societies. Instead, if true machine consciousness evolves, it will most likely acquire legal rights – you will not, for example, be allowed to murder a living electronic mind by erasing it on a whim – and that would lead to both political rights and representation.\nOur society is already hung up on the idea that people can only be fairly represented by other people who look like them. It’s easy to imagine a future in which intelligent, self-aware machines demand their own representatives. The trick will be reaching beyond their own narrow demographic to win elections. That’s where the A.I. political consultant will come in, and it might be the most terrifying life-form ever conceived…\nBreitbart Tech is a new vertical from Breitbart News covering tech, gaming and internet culture. Bookmark breitbart.com/tech and follow @BreitbartTech on Twitter and Facebook.","url":"https://www.breitbart.com/tech/2015/11/08/trans-humanist-presidential-candidate-welcomes-robot-overlords/"}
