{"authors":["Michelle Moons"],"date_download":"2018-10-30 20:27:35","date_modify":"2018-10-30 20:27:35","date_publish":"2016-12-11 21:18:39","description":"ExxonMobil executive Rex Tillerson is rumored to be President-elect Donald Trump’s Secretary of State, but who is the man who could be the United States’ representative around the world?","filename":"data/vaneerConsumption/MeetRexTillersontheManDonaldTrumpCalledAWorldClassPlayer.json","image_url":"https://media.breitbart.com/media/2016/12/AP_16312282613593.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_12_11__1540931255.html","title":"Meet Rex Tillerson, the Man Donald Trump Called ‘A World Class Player’","title_page":"Meet Rex Tillerson, the Man Donald Trump Called ‘A World Class Player’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"ExxonMobil executive Rex Tillerson is rumored to be President-elect Donald Trump’s Secretary of State, but who is the man who could be the United States’ representative around the world?\nIn a Fox News Sunday interview with Chris Wallace, Trump said of Tillerson, “He’s a world class player.”\nTillerson joined Exxon in 1975 as a production engineer, his first job out of school according to the Washington Post. As of this April, he held $218 million in Exxon stock and a $69.5 million pension plan.\nIn 1995, Tillerson was elevated to the position of President of Exxon Yemen Inc. ExxonMobil stated that in his roles with the company from 1992 to 1999, “he was responsible for Exxon’s holdings in Russia and the Caspian Sea as well as the Sakhalin I consortium operations offshore Sakhalin Island, Russia.”\nHe ascended to his current position of Chairman and Chief Executive Officer of ExxonMobil on January 1, 2006. The Wall Street Journal reported that Tillerson shifted the company’s stance on climate change, “He embraced a carbon tax as the best potential policy solution and has said climate change is a global problem that warrants action.”\nIn 2011, the ExxonMobil CEO was involved in a deal on behalf of the company to develop oil fields in Iraqi Kurdistan according to Reuters. The deal was made in spite of conflicts with Iraqi law. Then, in 2013, Tillerson made his initial trip to Iraq. The report stated that the trip was made to “mend fences with the central government.”\nThat same year, Tillerson received the Order of Friendship from Russian President Vladimir Putin.\nTillerson spoke disapprovingly of sanctions against Russia at a 2014 ExxonMobil shareholders meeting. NBC News reported that a deal between ExxonMobil and Russia, reportedly worth $500 billion, was defeated because of Obama Administration sanctions that came in response to Russia’s 2014 invasion of Crimea.\nAs the company suffered dropping profits, stagnate stock prices, and a downgraded credit rating, it tightened its belt and borrowed money earlier this year. Tillerson even “took a well-publicized 18 percent pay cut – to $27.3 million,” according to the Post.\nTillerson, 64, was already scheduled to retire in just a few short months: March 2017.\nFormer Secretary of State Condoleezza Rice and former Secretary of Defense Robert Gates recommended Tillerson for the Secretary of State position according to sources cited by Politico. The report stated that Exxon is a client of both Rice and Gates. It was on their recommendation that Tillerson was brought in for an interview with Trump at Trump Tower.\nTillerson is a native of Wichita Falls, Texas. He attended University of Texas at Austin where he completed a bachelor of science degree in civil engineering just before joining Exxon Company, U.S.A.\nWhen Sarah Palin took office as governor of Alaska she took a hard stance with oil companies. Palin had beat out prior governor Frank Murkowski after news broke of sweetheart deals for oil companies under his leadership and several of his negotiators were indicted. Fortune reported that Palin’s decision to not show up when Tillerson came to Juneau to meet with her early in her term shocked oil lobbyists.\nIn the book Going Rogue, Palin wrote that Alaskans called Tillerson “T-Rex” as she described a particular hostility from ExxonMobil to moving away from relationships with the state’s previous administration.\nAs for his campaign involvement, Tillerson made political campaign contributions of nearly $43,000 in 2011. Presidential candidate Mitt Romney and Kentucky Senator Mitch McConnell were among those who received some of that money according to Fortune. In September 2012, Tillerson gave $50,000 to Romney Victory INC. In early 2015, he gave $5,000 to Jeb Bush’s super PAC Right to Rise USA.\nHe has also been greatly involved with the Boy Scouts of America according to WSJ. His father was a local Boy Scouts administrator and Former Clinton Administration Deputy Defense Secretary John Hamre, president of a Washington think tank on whose board Tillerson serves, said Tillerson was instrumental in changing the Boy Scouts policy in 2013 to allow gay youth to participate.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2016/12/11/who-is-rex-tillerson-the-man-donald-trump-called-a-world-class-player/"}
