{"authors":["Jo Scrimshire For Daily Mail Australia"],"date_download":"2018-10-22 20:02:56","date_modify":"2018-10-22 20:02:56","date_publish":"2016-01-29 00:06:25","description":"This week, fans were offered a glimpse of awkward oyster farmer Jedd, from South Australia, who is looking for love on the upcoming series of reality show Farmer Wants A Wife","filename":"data/vaneerConsumption/MeettheoysterfarmerJeddlookingforloveonFarmerWantsAWife.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/22/30ADA1D400000578-0-image-a-13_1454018765862.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421880_Meet-adorably-shy-anxious-oyster-farmer-looking-love-Farmer-Wants-Wife_1540238576.html","title":"Meet the oyster farmer Jedd looking for love on Farmer Wants A Wife","title_page":"Meet the oyster farmer Jedd looking for love on Farmer Wants A Wife | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's one of the most hyped reality TV shows of 2016.\nAnd this week fans were offered a glimpse of the latest Aussie bloke taking part in the new series of Farmer Wants a Wife.\nChannel Nine released a teaser trailer on Friday highlighting 'Farmer Jedd', a sweetly awkward oyster farmer from Coffin Bay, South Australia.\nScroll down for video\nLooking for love: Oyster farmer Jedd (right) looks sweetly awkward during a rural date with a pretty blonde in a teaser trailer for reality show Farmer Wants A Wife, which starts February 1st on Channel Nine\nThe 30-second clip simply introduces him: 'Farmer Jedd is looking for love'\nBut it soon becomes apparent that Jedd isn't the typical, cocky dating show contestant as he looks endearingly awkward during a series of outdoor dates.\nAt the start of the video, he confesses to the camera: 'I've been nervous as all hell.'\nAnd later he seems to tense up slightly when a pretty blonde gently places her hand on his knee.\nNervous: Jedd cuts a shaky figure in the 30-second introductory clip released this week, in which he admits he's 'nervous as all hell'\nHe then seems to explain he finds it difficult meeting women for the first time because of his nerves.\nJedd continues: 'I have anxious exhilaration, for want of a better word'.\nThe promo video then shows several of his dates with women, where he stumbles over his words and struggles to find the right thing to say.\n'With your family... are they just family?' Jedd asks a woman (left) a bizarre question during their date\nDuring one intimate chat, against the backdrop of a rural lake, Jedd rather oddly asks a lady: 'With your family... are they just family?'\nIt is unclear exactly what Jedd was trying to say, and his date looked suitably puzzled.\nDuring another date with a younger blonde woman, the environmentally-friendly oyster farmer appears thoroughly tongue tied.\nExcuse me? Slightly lost for words, Jedd asks his pretty blonde date if she likes HBO series Game of Thrones\nThey are sat together on haystacks outside, and Jedd is wearing a stylish, slim-fit blue shirt and tan trousers.\nHe closes his eyes, searching for the right words as his attractive date looks at him hopefully.\nThen eventually, he blurts out: 'Um... I'm still... I... I mean, do you like Game of Thrones?'\nWhoops! Jedd gets rather tongue-tied during his date, against the backdrop of a rural lake\nThe video cuts away before viewers get a chance to see his date's baffled response to this non sequitur.\nIn a video posted on Farmer Wants a Wife's Facebook page last June, Jedd revealed that he has been working for his family business, Natural Oysters, for 14 years.\nThe coastal town, located at the southern extremity of the Eyre Peninsula, had a population of 584 in the 2006 census.\nIn the clip, he introduces himself: 'My name is Jedd. I'm an oyster farmer, and I'm looking for a wife.'\nHe then explains his town has a low population which presumably makes meeting women difficult, adding: 'Apart from Greg, my little faithful four-legged friend, it can be pretty lonely at times.'\nJedd goes on to say that his ideal wife would have to share his passion for oysters: 'Does she have to eat oysters? Yeah, of course she does!' he laughs.\nSpeaking of his ideal partner, Jedd concludes: 'She would be intelligent but most importantly she would know herself, she would be comfortable with herself.'\nFarmer Wants A Wife starts February 1st on Channel Nine.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421880/Meet-adorably-shy-anxious-oyster-farmer-looking-love-Farmer-Wants-Wife.html"}
