{"authors":[],"date_download":"2018-10-22 21:44:33","date_modify":"2018-10-22 21:44:33","date_publish":"2014-05-08 07:55:36","description":"\"Higher oil and gas prices are always good for Russia, but Putin thinks far more strategically than that,\" analyst says.","filename":"data/vaneerConsumption/MeettheBeneficiariesofUkrainesBloodyCrisis.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/428171/140508-putin-cnbc-4a_d4d6f16e6c35b4fdddec6ff2c1041ecc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_ukraine-crisis_meet-beneficiaries-ukraines-bloody-crisis-n100056_1540244673.html","title":"Meet the Beneficiaries of Ukraine's Bloody Crisis","title_page":"Meet the Beneficiaries of Ukraine's Bloody Crisis","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe last few days have brought the worst violence yet since the ongoing struggle between the governments of Ukraine, Russia and their respective civilian supporters began, and power players on both sides are using the conflict to their advantage.\nRussians agitate, oil rises\nRussian President Vladimir Putin's spokesman, Dmitri Peskov, recently told reporters that thousands of people in Ukraine are calling for Russia's help, and claimed that human rights violations are becoming more widespread in Ukraine.\nThat rhetoric is similar to the language used by Russia before its invasion and subsequent annexation of Crimea, but sources who spoke with CNBC said they don't expect an outright Russian invasion. What's more likely, they said, is continued agitation and violence.\nThe sources spoke on condition of anonymity because of fears about their personal safety and/or concern about their financial interests.\nOil and gas are the lifeblood of the Russian economy, and in the midst of geopolitical unrest, oil prices usually rise.\"Higher oil and gas prices are always good for Russia, but Putin thinks far more strategically than that,\" said Ian Brzezinski, a senior fellow at the Atlantic Council who focuses on trans-Atlantic security. \"I would also note that he is not just benefiting from the unrest in Ukraine, he is driving it. This is because he wants to destabilize Ukraine so that he can seize more of it, if not all of it.\"\n\"People are genuinely nervous about what will happen. It's a house of cards\"\nPutin seeks to maintain some level of control over Ukraine as a crucial gas transit hub for Russian natural gas. Sources close to the Russian government said that Putin currently does not have plans to invade, but one of the sources said \"he will not allow Ukraine to become Estonia\"—that is, he's highly unlikely to stand by and idly watch Ukraine integrate itself with the European Union or NATO.\"Ukraine's economic crisis had been transformed into geo-economic warfare caused by Russia's control of supply to Europe and Ukraine's failure to develop its own internal energy resources,\" Robert Bensh, managing director of Pelicourt, a private equity fund that owns assets in Ukraine, told CNBC.\n\"And it cannot be coincidental that Russian troops are building up close to Ukraine's gas pipelines,\" he added.\nAccording to journalist Alexei Matsuka of eastern Ukraine's Donetsk and alternative Russian news channel TV Rain, \"the activity of separatists is mainly in the north of the region, where there is a lot of shale gas.\"\nStill, others say that the shale play is minimal here and that Russia is looking solely to retain control to make sure it has a firm hold on alternate routes of its own gas supplies.\nMore than one observer who spoke with CNBC predicted that only when there is an integrated government in Ukraine, with a substantial amount of Russian influence, will Russia finally back off.\nHow Ukraine's leaders benefit\nThe Ukrainian government, which has warned repeatedly that the most dangerous days of the crisis still lie ahead, has used the unrest to its advantage as well. The conflict allows acting Ukraine President Oleksandr Turchynov and Prime Minister Arseniy Yatsenyuk to appeal directly for assistance from the United States and the European Union.\nA source close to the situation told CNBC that in the earliest days of the crisis, Kiev refused to speak with the Russians, allegedly telling high-level Moscow officials that Ukraine no longer needed Russia because it had the EU and United States on its side.","url":"https://www.nbcnews.com/storyline/ukraine-crisis/meet-beneficiaries-ukraines-bloody-crisis-n100056"}
