{"authors":[],"date_download":"2018-10-22 22:02:27","date_modify":"2018-10-22 22:02:27","date_publish":"2014-05-08 20:10:21","description":null,"filename":"data/vaneerConsumption/MeetthePressTranscriptMay42014.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/meet-the-press_meet-press-transcript-may-4-2014-n100726_1540245747.html","title":"Meet the Press Transcript - May 4, 2014","title_page":"Meet the Press Transcript - May 4, 2014","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nDAVID GREGORY:\nSome hidden messages, maybe some political insight about 2016 from President Obama on Washington's big night of the year, the White House Correspondents' Dinner, a night for the president to poke fun at the press and himself.\nPRESIDENT OBAMA (ON TAPE):\nWhat a year, huh? As we start these dinners with a few self-deprecating jokes, after my stellar 2013, what could I possibly talk about? (LAUGHTER)\nDAVID GREGORY:\nWe'll have some political talk and comic review this morning. And a surprise guest will join our roundtable, Grammy Award winner, innovator, and social activist Will.i.am will be here. Plus the conversation continues about racism and sports after the controversy surrounding L.A. Clippers owner Donald Sterling.\nI'll speak exclusively this morning with a former NBA all-star who played a big role in the punishment of Sterling, Sacramento Mayor Kevin Johnson. And the president has ordered a review of the death penalty in the aftermath of the Oklahoma execution gone terribly wrong. Rick Perry, governor of Texas, the state that executes the most prisoners with me here. I'll go one on one with him this morning.\nANNOUNCER:\nFrom NBC News in Washington, the world’s longest running television program. This is Meet the Press with David Gregory.\nDAVID GREGORY:\nAnd good Sunday morning. The White House Correspondent's Dinner and a weekend of socializing it has spawned has become a highly charged, pretty heavily-scrutinized mix of Washington and Hollywood. It is a night when the capital comes together in bipartisan good humor, for the most part. But with sarcasm, the tension's pretty easy to spot.\nAnd so are some of the big political themes to come in the presidential race. So what did we learn from President Obama about how he sees the 2016 race for his job among Democrats? Here are a couple of key moments.\nPRESIDENT OBAMA (ON TAPE):\nLet's face it, Fox, you'll miss me when I'm gone. (LAUGHTER) It'll be harder to convince the American people that Hillary was born in Kenya. (LAUGHTER)\nDAVID GREGORY:\nLater the president joked about a recent encounter Hillary Clinton had in Las Vegas.\nPRESIDENT OBAMA (ON TAPE):\nIt's a long time between now and 2016 and anything can happen. You may have heard the other day Hillary had to dodge a flying shoe at a press conference.\nDAVID GREGORY:\nThat of course, the vice president doing some joking around. So it was Obama tipping his hand about 2016. I've got my political roundtable here. Joining us for the first time, will.i.am., as I said from the Black Eyed Peas, obviously the founder, president of i.am.angel Foundation that helps to transform young people's lives through education and opportunity, an innovator, also a supporter of the president, Will, it's good to have you here.\nWashington Post syndicated columnist, Kathleen Parker here as well, our political director, chief White House correspondent Chuck Todd, former communications director for the Obama administration Anita Dunn, and congressman from Utah, Jason Chaffetz. Welcome to all of you. All right, Chuck Todd, you got the humor there. You also maybe had some clues about 2016--\n(OVERTALK)\nCHUCK TODD:\nThere's even a third joke you didn't do there about, you know, showing, you know, him moving out of the Oval Office and everything said, \"Hold for Hillary, hold for Hillary.\"\nDAVID GREGORY:\nYeah, right.\nCHUCK TODD:\nIt sort of-- You know, and you know, people said, \"Oh, it's just joking. It's just humor,\" and all that. There are people that are supporters of Biden that get a little cranky about how easily the president talks about Hillary Clinton as his successor now. And it is sort of this fait accompli among a lot of Democratic donors and of a lot of Democratic elites, that that's just what it is.\nThe baton's about to be handed to her and, you know, it's now up to Hillary Clinton, does she want to run for Bill Clinton's third term or Barack Obama's third term, she gets the choice. But the president certainly sees in her as the heir apparent.\nDAVID GREGORY:\nAnd almost was making fun, Kathleen, of Joe Biden as a guy who gets a lot of laughs, but is not seen seriously stepping up to this role.\nKATHLEEN PARKER:\nWell, it's hard to take him seriously sometimes, not only because he is famous for putting his foot in his mouth and smiling brilliantly, but he himself said as the other comedian last night said, Joe Biden said, \"Well, why not run for president?\" As though he's talking about, like, \"Maybe I'll eat a hoagie.\" You know, \"If it's just there, why not?\"\nCHUCK TODD:\nI know. What was funny though was Julia Louis-Dreyfus. Come on.\nDAVID GREGORY:\nYou did do the little sketch about Veep and that they were also taking each other on. Will, how did you look at the evening, but specifically this moment of looking at here's the president, and frankly even now, they're waning. You know, you hear that his second term, and everybody's so focused on are we making this big step towards first female president as the nominee for the Democrats or a different generational choice.\nWILL.I.AM.:\nBeing there, it was my third time there, it was, from the first time I was there in 2008, we didn't really have a Twitter, Instagram society. So being there this year--\nDAVID GREGORY:\nLet's take a look at that.\nWILL.I.AM.:\n--you know, to see everyone's face glowing, looking at their phone.\nKATHLEEN PARKER:\nThat's true.\nWILL.I.AM.:\nYou know, it's true and sad and scary, it's cool, it's A.D.D. society. We really don't pay attention to, you know, I too was looking at my phone. You know, but that's a different actually between 2008 and now.\nDAVID GREGORY:\nI've just got to get you to tweet that you're going to be on in the morning, which you did. Which I--\nWILL.I.AM.:\nYeah, I hooked it up. Yeah.\nDAVID GREGORY:\nYeah, you hooked it up. Well, there's also, where people, where they did pay attention is some self-deprecating humor. Here's the president knocking himself.\nPRESIDENT OBAMA (ON TAPE):\nLast year was rough. Sheesh. At one point, things got so bad, the 47% called Mitt Romney to apologize.\nDAVID GREGORY:\nJason Chaffetz, Congressman, always works. For any president, Republican or Democrat to take on themselves.\nJASON CHAFFETZ:\nWell, I wasn't there. I was sleeping on my cot in my office, looking up at the screen. But the president was very funny. I mean, he's brilliant when he gets to the self-deprecating humor. It was fun. But I think a few years from now, it might be a little bit different with the Republican president there. And we'll laugh and joke about Hillary Clinton and Joe Biden.\nDAVID GREGORY:\nAnita, how about the president weighing in on the fait accompli that it's Hillary Clinton. Is that the view among Democrats?\nANITA DUNN:\nI think amongst many Democrats and Chuck would probably agree, it is the view. However, I think history tells us that nobody actually wins nominations without having to go out and win them, David. And so but I think that's--\nCHUCK TODD:\nYou don’t win them at the correspondents’ dinner?\nANITA DUNN:\nYou don’t win them at the correspondents’’ dinner.\nDAVID GREGORY:\nYou're sure about that?\nANITA DUNN:\nOr even the gridiron. So I have to tell you that I think nobody is more aware of that than Hillary Clinton, to be perfectly honest, and the team around her. And they understand that if she chooses to run, she's going to have to go win this thing. But in the Democratic party right now, it is as close to a fait accompli as anything that could exist.\nDAVID GREGORY:\nAll right, we're going to have more on this, a little bit more comment review coming in just a bit when we hear more from the roundtable.\nADAM SILVER (ON TAPE):\nEffective immediately, I am banning Mr. Sterling for life from any association with the Clippers organization or the NBA. Mr. Sterling may not attend any NBA games or practices. He may not be present at any Clippers facility, and he may not participate in any business or player personnel decision involving the team.\nDAVID GREGORY:\nWe move to the other big issue this week. That of course NBA Commissioner Adam Silver revealing the harsh punishment against Los Angeles Clippers owner Donald Sterling after his racist comments caught on audio tape. I'm joined now by Kevin Johnson. He's the Mayor of Sacramento, California, a former NBA all-star. He now heads up the Players' Association Selection Committee, Mayor Johnson, welcome to Meet the Press.\nMAYOR KEVIN JOHNSON:\nThanks, David.\nDAVID GREGORY:\nGood to have you here after a tumultuous week. So let's look at where this is headed now. All the emphasis is on whether Donald Sterling is going to sell this team and sell it fast. He appears to be dug in. What's going to happen?\nMAYOR KEVIN JOHNSON:\nWell, I think first of all, I'm really proud of the players because the players came out very strong, from LeBron James to Kobe Bryant, they articulated their position, did it very effectively, and the players wanted to speak in one voice. So that was very important.\nAnd then secondly, Commissioner Silver unequivocal sanctions I think sent a really strong message around this league. So in terms of where I think we're going forward, I think the owners had a phone call on Thursday, that's two days after the decision, they're meeting next week. I think they're in a position where we'd like to see a unanimous or near-unanimous vote to force commi--\nDAVID GREGORY:\nBut do you expect a legal fight that would keep it in his hands for a bit?\nMAYOR KEVIN JOHNSON:\nI think that everyone is anticipating there will probably be a legal fight. However, I'd like him to rethink that decision. I think if Mr. Sterling was going to approach it the right way, he would apologize, he would embrace the sanctions, and spend the rest of his life proving that he was not a racist.\nDAVID GREGORY:\nWhere are the players on this? Jarrett Jack, a player, was on the radio on Thursday. And he made very clear that there's the question of whether Sterling still has the team should be a real issue for players and whether they move on even in the playoffs. Here's what he said.\nJARRETT JACK (ON TAPE):\nIt's a league issue. And we all should take a stance on it. Like, I think all of us, white, black, Hispanic, we have a tremendous European influence in this league, like, everybody should've felt a way about those comments because he said \"blacks\" at a lot of points, but he said \"them\" and \"they.\"\nDAVID GREGORY:\nAnd what he was saying in this is that they should not play another game as long as Sterling still has the team. Is that a real danger, that players will refuse to play?\nMAYOR KEVIN JOHNSON:\nHere was the important point, David. So the players sent me and talked to Commissioner Silver. And the players wanted an immediate investigation. They wanted to have a voice. They wanted to make sure that they weren't passive participants. And thirdly, they wanted the most maximum, most severe sanction possible.\nCommissioner Silver exceeded those expectations in 72 hours. There's no way, look at Washington. No one decides things that quickly. And he did it in a very strong way. Had he not come out as strong, I think the players were trying to determine what next steps would be. But he exceeded everybody's expectation and he did it for the right reason.\nDAVID GREGORY:\nThat Sterling selling the team, does that have to happen almost immediately for players to continue to play the game?\nMAYOR KEVIN JOHNSON:\nI think players feel very strongly that they have confidence in the owners to make the right decision, not just for owners, but for owners, players, and the fans. And I think that the owners are going to put the Clippers in a position where this owner, Mr. Sterling, is going to have to sell the team. And when it happens, this week or next week, it's going to have to run that process.\nDAVID GREGORY:\nYou were a player, you're now a political figure. There's a lot of attention on this now. What was it like as a player being in the NBA, the specter of racism, mostly white owners, a mostly African American league of players. What did you experience?\nMAYOR KEVIN JOHNSON:\nI think this country has a history of allowing sports to advance civil rights. And if you think about, you know, John Carlos and Tommie Smith in the '68 Olympics and you think about some of our great leaders and Jackie Robinson and Arthur Ashe, we have a history of letting sports transcend. And I think--\nDAVID GREGORY:\nSports figures had to go through a lot.\nMAYOR KEVIN JOHNSON:\nThey had to go through a lot, but I think those examples are shoulders that we're standing on.\nDAVID GREGORY:\nWell, what did you experience? I mean, it seems like a lot of players are saying they weren't surprised. People in the L.A. community saying they weren't surprised. It was the settlement on the fair housing issue, that he had a record here, an unfortunate record of racism that people knew about, but tolerated.\nMAYOR KEVIN JOHNSON:\nIn 1988, I get traded to Phoenix, for the Phoenix Suns. And on that particular week, month, period of time, the Martin Luther King holiday got rescinded in Arizona. I'm thinking, \"Where in heck did I land that you're, who takes a holiday away from Martin Luther King?\"\nDAVID GREGORY:\nFor crying out loud.\nMAYOR KEVIN JOHNSON:\nBut the owner of the team, Jerry Colangelo stepped up. And this is an example of owners doing the right thing, no different than our owners in Sacramento. The Sacramento Kings, Vivek Ranadivé, immediately, immediately said, \"Zero tolerance. There's no place for institutional racism in our league.\"\nAnd I think that's what Commissioner Silver did, and I think the players spoke out very strongly. So it's real, it's prevalent, it's a stark reality that we have a long way to go. And this is a very important conversation that is now taking place.\nDAVID GREGORY:\nIs there a path of redemption for Donald Sterling? How does he do that?\nMAYOR KEVIN JOHNSON:\nIf I was him, if I was counseling Mr. Sterling, I'd apologize unequivocally, number two, I would accept and embrace the sanctions. Say, \"You know what? I did do some things that aren't right. I'm not fit to be an owner.\" I'd embrace those sanctions. And then thirdly, again, I'd spend the rest of my life proving I wasn't a racist. I'd do all that I could to give back to society. And right now, it would not do anybody any good if he tried to fight this and maintain a hold of that team. It's just not good for the league.\nDAVID GREGORY:\nWhat about some of the broader debates about this? This was a private conversation that was recorded and released by a third party. You know, some of the details here are frankly a little bit sleazy about how all of this happened. Kareem Abdul-Jabbar, the Lakers great, of course, wrote in TimeMagazine the following, I'm going to put a portion of it on the screen.\n\"Shouldn't we be equally angered by the fact that this private, intimate conversation was taped and then leaked to the media? Didn’t we just call to task the NSA for intruding into American citizen’s privacy in such an un-American way?\" Goes on, \"The making and release of this tape is so sleazy that just listening to it makes me feel like an accomplice to the crime. We didn't steal the cake, but we're all gorging ourselves on it.\" How do you react to that?\nMAYOR KEVIN JOHNSON:\nI think that's fair. But I think the moment his comments became public, I think that twisted view is not good for our country. And I think that's the reality of the day. So I think that'll run its course in terms of how those, you know, for me important point is when Commissioner Silver said, \"This investigation is complete, I am here to say that that was Mr. Sterling's voice on the audio tape, and there's a lifetime ban.\" Once that happened, I think the NBA did the right thing. And I think those recordings, on how they were obtained, you know, that'll run its course.\nDAVID GREGORY:\nThe sports world is big. There's another controversy. This is Washington D.C. with the Washington Redskins. And you even have the majority leader of the Senate taking an opportunity in the Sterling controversy to speak out about what the NFL ought to do. Here was Harry Reid speaking this week.\nHARRY REID (ON TAPE):\nSnyder fails to show any leadership, the National Football League should take an assist from the NBA and pick up the slack. It would be a slam dunk, Madam President. For far too long, the NFL has been sitting on its hands doing nothing while an entire population of Americans has been denigrated.\nDAVID GREGORY:\nIs it time to change the name from the Redskins?\nMAYOR KEVIN JOHNSON:\nI think it should strongly be considered. I think the Native American community and many others feel that that is not the right name going forward. I think the NBA set a great example that you can act swiftly and decisively.\nDAVID GREGORY:\nI'm going to be speaking to Governor Rick Perry of Texas in just a minute. I'm sure you're well aware, as a California political figure, that there are jobs moving out of U.S. State, going to Texas.\nMAYOR KEVIN JOHNSON:\nYeah, I harassed him.\nDAVID GREGORY:\nYou harassed him back in the green room. What worries you about it? What does California do about it?\nMAYOR KEVIN JOHNSON:\nWe have to be competitive. There's too many companies leaving California and we have a governor who's very effective at recruiting.\nDAVID GREGORY:\nSo what's stopping California from being more competitive?\nMAYOR KEVIN JOHNSON:\nI think we just need a change in environment. I think that the governor needs to come out strong. We need economic policies in place that we're retaining our best businesses. Unfortunately, the regulatory challenges, it's very expensive to do business with California. And my goal, quite frankly for mayor, is I want Sacramento to be the easiest place to do business in California. That way, whether the company's leaving, then move up to Sacramento. We're happy to have them.\nDAVID GREGORY:\nYou think Governor Brown is doing a good enough job to keep businesses in California?\nMAYOR KEVIN JOHNSON:\nYeah, I think he's committed this term to even up the ante to make sure that we're competitive.\nDAVID GREGORY:\nAll right, Kevin Johnson, mayor of Sacramento, great to see you. Thanks for being here.\nMAYOR KEVIN JOHNSON:\nThank you.\nDAVID GREGORY:\nI appreciate it very much. I want to turn now to the fallout from this week's botched execution in Oklahoma.\nPRESIDENT OBAMA (ON TAPE):\nWhat happened in Oklahoma is deeply troubling. So I'll be discussing with Eric Holder and others, you know, to get me an analysis of what steps have been taken not just in this particular instance, but more broadly in this area. I think we do have to, as a society, ask ourselves some difficult and profound questions around these issues.\nDAVID GREGORY:\nOf course, President Obama Friday raising questions about the execution of convicted murderer Clayton V. Lockett. He died of a heart attack after attempts to kill him through lethal injections failed. Since the Supreme Court reinstated the death penalty in 1976, Texas has executed more than 500 people, the most in the country. I'm just exclusively now in studio here by Republican governor of Texas, Rick Perry. Governor, welcome. Good to have you here.\n(OVERTALK)\nGOVERNOR RICK PERRY:\nThank you, sir.\nDAVID GREGORY:\nI wanted to start here because of all the controversy around the death penalty again. You've got 273 people on death row in Texas. After what happened in Oklahoma, do you expect more challenges?\nGOVERNOR RICK PERRY:\nWell, state by state those decisions are made about how you're going to punish those who commit the most heinous crimes against your citizens. And in Texas, for a substantially long period of time, our citizens have decided that if you kill our children, if you kill our police officers, for those very heinous crimes, that the appropriate punishment is the death penalty.\nI think we have an appropriate process in place, from the standpoint of the appeals process, to make sure that due process is addressed. And the process of the actual execution I would suggest to you is very different from Oklahoma. We only use one drug. But I'm confident that the way that the executions are taken care of in the state of Texas are appropriate.\nDAVID GREGORY:\nAnd humane?\nGOVERNOR RICK PERRY:\nAnd humane.\nDAVID GREGORY:\nWas this inhumane?\nGOVERNOR RICK PERRY:\nI don't know whether it was inhumane or not, but it was botched. And I hope that not only the governor, the legislators will look at the process in Oklahoma.\nDAVID GREGORY:\nBut you don't even want, even somebody convicted of a heinous crime, you don't want to see the government responsible for forcing a heart attack because they couldn't inject the proper lethal drugs.\nGOVERNOR RICK PERRY:\nThere is an appropriate way to deal with this. And obviously, something went terribly wrong.\nDAVID GREGORY:\nIs it appropriate for a pause in our national discussion and application of the death penalty, the president talking about bias, uneven application, soul-searching questions that he'd like the country to take. Do you agree with that?\nGOVERNOR RICK PERRY:\nIt may be appropriate for a pause in Oklahoma. But here's where the president and I disagree. He all too often, whether it's on health care or whether it's on education or whether it's on this issue of how states deal with the death penalty, he looks for a one-size-fits-all solution centric to Washington D.C.\nAnd I will suggest to you, that's one of the problems we have in this country. We're a very diverse country. And a lot of the states on these issues that aren't addressed directly by the constitution to come up with the solutions. I think the country would be happier, for one thing, I know the country would be more economically viable.\nDAVID GREGORY:\nLet me ask you about the economy. A lot of discussion about the Obama recovery this week. People will look in that in different ways. He has a couple of different steps. And I want to get your take on it. The latest jobs report has the creation of 288,000 jobs in April.\nThat's the most in more than two years. But here's another stat, which is the labor force shrinking but 806,000 in April. People getting out of the business of looking for a job. Of those two stats, what best represents the Obama recovery, the Obama economy?\nGOVERNOR RICK PERRY:\nWell, let me say this, job creation is good. And if the president and Washington would focus on policies that help create jobs, then this country would be substantially better off.\nDAVID GREGORY:\nAnd so do you give this president credit for more robust growth that we've started to see after the winter months?\nGOVERNOR RICK PERRY:\nI mean, that might be a bit of a stretch. I think the bigger issue is the people who have lost hope. I mean, those 800,000 plus people who have just quit looking. I mean, they know they're not going to get a job. It's the people who are underemployed in this country that we need to be focused on.\nThe policies that allow for job creation are really pretty simple. It's tax policy, it's regulatory policy, it's a legal system that doesn't allow for over-suing. And it is putting policies into place into public schools in particular that make them more accountable, so you have a skilled workforce.\nThose four things, if you will put those into place, then allow the private sector to respond with the confidence that they know they're going to be able to keep more of what they work for, I think that's the real dilemma today. Because of a national healthcare program that people really don't know how it's going to affect them other than it's going to cost them more money at least. There's a real dampening down of hope if you will, in the business.\nDAVID GREGORY:\nAll right, but you talk about a rock of hope. In your state of Texas, you look at poverty. People who are suffering, who may be without hope. In the United States, that rate is 15.9%. it's higher in Texas, it's 17.9%.\nGOVERNOR RICK PERRY:\nHigher, I might add, even and California.\nDAVID GREGORY:\nUh-huh (AFFIRM). And we'll get that in just a minute. And yet there's a debate about what you do to help people who are struggling around wages, around the minimum wage. Tim Pawlenty, who you ran against in 2012 was part of that presidential ticket there before he dropped out, he was on MSNBC this week. He said this about how Republicans ought to live with this minimum wage fight. Have a look.\nTIM PAWLENTY (ON TAPE):\nI also think, by the way, the Republicans should support reasonably increasing the minimum wage. And if you're going to talk the talk about being for the middle class and the working person, if we have the minimum wage, it should be reasonably adjusted from time to time.\nDAVID GREGORY:\nAre the politics shifting in your party on that?\nGOVERNOR RICK PERRY:\nWell, we focus on the maximum wage rather than the minimum wage. 95% of all the jobs that are created in my home state were above the minimum wage. So the idea that you should be focused on the minimum wage when in fact you ought to be focused on policies that create this environment where jobs can be created.\nYou know, this discussion about minimum wage, when there are no jobs available. Most of us didn't start in the corner office, David. I mean, you worked your way up. And most people understand that concept. I think it's an easy political line to pitch out to say, \"I'm for raising the minimum wage,\" when we're looking past that in Texas from the standpoint of how do we create the maximum wage available?\nHow do we put more people into the workforce? And almost a third of all jobs created in America in the last decade were created in the state of Texas. And that's where the focus should be. What are the policies that send the message to the job creators that you know that you can risk your capital, have a chance to have return on investment, hire those people out there. That's the real issue. And I'll suggest to you one-size-fits-all policies out of Washington D.C. tampen down that reasonable expectation of being able to create wealth.\nDAVID GREGORY:\nA lot of talk about you running in 2016. You ran in 2012. A lot of people thought that was a botched effort on your part. How do you get a second look now?\nGOVERNOR RICK PERRY:\nI would tend to agree with them on the botched efforts side of it.\nDAVID GREGORY:\nSo what went wrong?\nGOVERNOR RICK PERRY:\nListen, I think America is a place that believes in second chances. I think that we see more character out of an individual by how do you perform after you fail and you go forward. So I'm really focused on the next nine months of being governor of the state of Texas. I'm going to be in Kansas City recruiting businesses.\nI'm going to be across the country talking about red state versus blue-state policies. Hopefully engaged in a good, thoughtful, winsome conversation about how do we make America more competitive, not only domestically, but internationally as well.\nDAVID GREGORY:\nAnd but you also have to think about your party, about how to get a nomination. So when I ask you how to get a second look, what do you want to say to your party to say, \"Look, here's the path to getting the White House back. And here's what Rick Perry can do to get us there\"?\nGOVERNOR RICK PERRY:\nI think it's important for us to really listen to the American people. And I think Americans are really concerned about how am I going to be able to take care of my family. I'm really worried about those nine million people that are out of work. And the idea that are more women out of the workforce now than in any time in our history, that's just not right.\nAnd there is a blueprint. There are blueprints in states like Florida and Louisiana and what Nikki Haley is doing in South Carolina. And you look up at Ohio and what Kasich's doing. I mean, there's clear blueprint about how you get Americans back to work. And I hope that over the next six to eight months, as we go into those November elections, that there's a big focus on that type of an approach. The Republican leadership on job creation is pretty good in this country.\nDAVID GREGORY:\nIn Texas, big state, there's a lot of political figures. You've got Ted Cruz making waves, looking like he's going to run in 2016. And when the former President Bush who said this week he'd like for his brother Jeb to run for president, you know George W. Bush, the president, very well, having then succeeded him as governor. Is there room in Texas for all of you in the presidential race?\nGOVERNOR RICK PERRY:\nLike you said, it's a big state.\nDAVID GREGORY:\nSo there is?\nGOVERNOR RICK PERRY:\nIt's a big state.\nDAVID GREGORY:\nGovernor Perry, thank you so much.\nGOVERNOR RICK PERRY:\nYou're welcome.\n(OVERTALK)\nDAVID GREGORY:\nGood to have you back.\nGOVERNOR RICK PERRY:\nYes, sir.\nDAVID GREGORY:\nOkay. Coming up here on our roundtable, we'll talk about these newly-released documents about Benghazi. And they've reignited the debate, the big political debate over the attack. Now Secretary of State John Kerry's been subpoenaed by Congress, critics calling these new documents a \"smoking gun.\" Are they? Our roundtable back with us in just a minute when we come back.\n***Commercial Break***\nDAVID GREGORY:\nWe're back now with our roundtable, Will.i.am., Kathleen Parker, Chuck Todd, Anita Dunn, and Congressman Jason Chaffetz. Welcome back everybody. One of the big stories that we're going to be following in the weeks and perhaps months again is the fact that Benghazi is back as a huge political issue. Congressman Jason Chaffetz, you're on the House Oversight Committee. You've been one of the drivers, big critics of the president on this issue.\nHere was what you and others on the right called a \"smoking-gun\" email that was released by the White House, Ben Rhodes, who is an advisor to the president. We'll put it up on the screen. These were talking points about Susan Rice's appearance on the Sunday programs after the attack. And the goal to underscore that these protests are rooted in an internet video and not a broader failure of policy. What have we suddenly learned, do you believe? And what is it helping us get to the bottom of?\nJASON CHAFFETZ:\nWell, with want the truth, the whole truth, and nothing but the truth. And the White House has long denied any personal involvement and manipulation of those talking points. The reality is we have the C.I.A., we've got the military, you have the state department themselves that said that it was not a video. It was not a video.\nDAVID GREGORY:\nThey did say it was a spontaneous event, and it was a logical conclusion to go to the video, right? But the video was never known.\nJASON CHAFFETZ:\nNo, I totally disagree with that. I think that was a false narrative from the beginning. It was perpetuated over the course of the time. In my mind, that became a lie. It was never true in Libya. Look at what was happening in real time. And there was nobody, nobody that thought there was a video that was causing a protest in Benghazi. Nobody.\nDAVID GREGORY:\nThen again, what I was referring to is that the intelligence committee does refer to a spontaneous event at the embassy in Cairo that evolved into a direct attack on Benghazi. And the argument by critics is, \"This is a conflation of issues and the White House trying to obscure and certainly trying to make the president look good,” Anita Dunn. And that was the subject of that email.\nANITA DUNN:\nYou know, David, that is unprecedented in the history of White Houses, okay? So--\nDAVID GREGORY:\nTrying to make the president look good?\nANITA DUNN:\nWell, or at least trying--\nDAVID GREGORY:\nOr politicizing national security?\nANITA DUNN:\nNo, no. Trying to get a coherent message out there on shows like yours. Let's take a step back here. It's been called a \"smoking gun.\" If you look at this email, it's a lot more like a leaky water pistol when it comes to it. There's not a lot that's new in here. And frankly, it's a broader kind of email that gets sent around probably every Friday.\nAnd then agencies fill in other things. There's nothing in there that's inconsistent with the emails that have been released before, and there's nothing in there that's inconsistent with what the C.I.A. had written. And I think that, you know, this is a committee, with all due respect to the congressman, that has been looking for a scandal and conspiracy theories for the last four years. And there's a lot more theory here than there is conspiracy.\nDAVID GREGORY:\nLet me get Kathleen on this point in terms of what you see in the overall here.\nKATHLEEN PARKER:\nWell, I think the important point is whether the White House tried to, look, in the beginning, the White House said, \"We really had nothing to do with these talking points. These were from other agencies.\" And it's clear that there was some communication within the White House about how to handle the narrative. And the congressman was showing me a little bit earlier in the green room that there was, you know, the date of the document, well I should let you say it because you're the one with the documents. But it's pretty clear--\nDAVID GREGORY:\nWell, I'm trying to get the overall point. Let me bring in Chuck here because the argument, I'll get back to you, Congressman, it's the central charge by critics is, that the White House failed to call this what this was from the get-go, which was a terrorist attack.\nAnd the criticism is that they relied on a narrative about a video that would've been a lot more convenient for the White House to advance because it would help them say, look, we were just trying to deal with a spontaneous situation rather than being caught unawares by a terror attack. And they of course have said, \"Look, we had an intelligence community telling us that these were the factors at play. A spontaneous event.\" David Petraeus initially saying on the Hill, \"It was not terrorism related.\" So I giving some of that backdrop to kind of pull back and say, \"What are we trying to get to the bottom of here?\"\nCHUCK TODD:\nWell, and that's what sort of, is it talking points of the scandal, or is it the fact that four people died in Benghazi that we didn't necessarily have good intelligence on the ground. Was this the case of inter-agency C.I.A. that was going on, that if you logically look at this, it clearly is between state and C.I.A.\nWhether it's because state is uncomfortable letting the world know that the C.I.A. really does use a lot of state department outposts for their own operations. Was it the fact that the C.I.A. didn't want to admit that it didn't know what was going on on the ground. I think what makes it hard and why there's such a disconnect between the two parties on whether Republicans truly believe this is the scandal and Democrats are left going, \"I don't understand.\" Because two days later, you had somebody going on Capitol Hill going, \"This is a terrorist attack.\"\nDAVID GREGORY:\nSo the question is, do you believe that Saturday and Sunday right before, do you believe that the White House somehow knew it was a terrorist attack and wasn't ready to admit it and falsely went out there and decided to push it onto the video?\nOr do you believe at that moment in time, they were still sort of shaken by what was going on in Yemen, what was going on in Egypt and all of this stuff at that time. And then so I think that that seems to be the central sort of disagreement here. I believe that they were intentionally misleading that weekend, and then Tuesday they come back and say, \"Yes, terrorist attack.\"\nJASON CHAFFETZ:\nHere's one of the fundamental problems I have. I have a document in my hand, an internal State Department document that goes to Cheryl Mills, Hillary Clinton's chief of staff, this is on September 12th. The State Department had told the president of the Libyan Congress that it was Ansar al-Sharia, a terrorist organization that had committed these attacks.\nSo why is it that we told the Libyans the truth and told the American people a lie? That's right at the heart of that. What happened, for instance, as journalists, you do not know the answer as to why was the ambassador there. Well, what happened, for instance, on April 6th, 2012, when our facility was bombed?\nIt was bombed again on June 6th of 2012. The British ambassador had assassination attempt. What did Secretary Clinton do to secure that facility? Because when you have the regional security officer, this is our lead security person, come and testify before Congress and say he felt like the Taliban was in the inside of the State Department, are we just supposed to sit back and--\nDAVID GREGORY:\nAnd we do know that security, been well-established, was a huge issue, Kathleen. And an issue frankly that whether people being that it's there or not, that it's Secretary Clinton as a nominee, she's going to face these questions.\nKATHLEEN PARKER:\nThat, I mean, yeah, she's going to definitely have to face them. And the defense from the administration all along has been, \"Look, we wouldn't have been able to do anything, we couldn't have gotten there in time.\" But of course, at the time, you didn't know how much time. It's not like the terrorists dropped by and said, \"Look, we're just going to take 20 minutes, don't bother.\"\nThe other thing we have to remember is that this was in the days leading up to the 2012 election. And this could've been a tipping point. And so there is question, I mean, I think it's fair to question, was there delay in acknowledging this is a terrorist attack before--\nDAVID GREGORY:\nAnita and--\n(OVERTALK)\nANITA DUNN:\nI do want to jump in here though because first of all, the oversight committee on Thursday had a hearing in which the chairman of the House Armed Services Committee, a committee that has looked very carefully into this question of, you know, whether the supporting military forces could've gotten there in time. Actually, this is a very rare thing of disagreeing with a fellow Republican chairman with Chairman Issa over the committee they had on Thursday and I'm hearing they had.\nDavid, when something like this happens, which unfortunately happens when you have people stationed in unstable and dangerous parts of the world. In retrospect, it is always easy to say, \"Should've known this, should've known this.\" And we learned after in the Bush administration and unfortunately we learned that during this one with a bipartisan investigation of this. The reality of this is when something like this happens in the first 48 to 72 hours, you don't know and you have to go with what an intelligence agency tells you.\nDAVID GREGORY:\nLet me ask you a political question. How big of an issue will this be for Hillary Clinton as a candidate?\nANITA DUNN:\nI think it's impossible for any of us to say how big of an issue it will be. I can tell you that I think should Hillary Clinton decide to be a candidate for the nomination, she'll be prepared to deal with it. And she'll be prepared to deal with it as she did on Capitol Hill. And that the administration has dealt with it transparently and telling the truth.\nDAVID GREGORY:\nLitmus test for her, Jason Chaffetz?\nJASON CHAFFETZ:\nWell, it's key. I mean, what did she do? Our facility was bombed two times. What did the secretary do? The reality is, we had 30 security personnel. And by the time we got down to the end of August, that number had dwindled down to nine.\nDAVID GREGORY:\nSo here's what I think is one of the bigger issues out of this. There's a lot of the back and forth on this that is not necessarily going to be resolved. It's highly charged and you want more answers. Democrats have a view about this. There's no question that the issue of debating a country and having a light footprint to getting out quickly created a huge security vacuum.\nThat has been acknowledged. I want to bring Will.i.am. in on this point. Here's The Economist cover this week, because it goes about what as Americans we want to do in the rest of the world. Here is the cover. \"What would America fight for?\" And Will, some of the young people kind of came of age post 9/11, the Iraq War.\nChuck our political team doing some polling. U.S. involvement in world affairs should be, look at these numbers, less active, say 47% versus 19% as more active. All of this says something about the fact that a lot of people do not want America involved overseas.\nWILL.I.AM.:\nAs a world traveler, I have the same viewpoint. When you go to Germany and Australia and Brazil, especially Brazil, and in India, you see these developing countries, and they're developing in one particular area, in education and technology. And then when you come to America, you see this, like, we grow, but the citizens aren't growing.\nLike, our colleges are still the best colleges, but the people in the neighborhood that I come from aren't trying to go to MIT. They're not thinking of Stanford. They're not thinking Harvard. People from India come to attend these colleges. And then they get educated and they go to their country and create jobs in their developing country. So when you travel the world you get to see, like, the country you are from and how we are developing or not.\nDAVID GREGORY:\nAnd also embroiled in these kinds of debates as opposed to addressing those things you're talking about.\nWILL.I.AM.:\nYeah. And then you look at, like, this industrial prison complex where half of, actually the majority of people in prison are African and Latino, African American and Latino. It's like, that breaks my heart, right? So why?\nKATHLEEN PARKER:\nWell, I think to your point about, you know, being a world traveler and seeing other cultures and other countries, you begin to identify these other places, these foreign countries as places where human beings just like us live. And the idea that we would somehow militarily involve ourselves is a little less, you know, you step back a little bit more. But on the other hand, when they're being slaughtered by their government, you know, you go like, \"We've got to do something.\"\nCHUCK TODD:\nBut it's interesting, you know, that economic is an economic number. What I've been telling people, that 47% being less active in world affairs. That is not saying, \"Hey, I don't, I'm ti--.\" Yes, some of it's world wariness, a lot of it, it goes to what I think Will was just addressing, which is this feeling like, \"Well, you know what,\" and it's something Governor Perry said.\nYou know, this feeling that the economy is under, there may be jobs out there, but people feel under employed. Or they feel as if there isn't in their country and it's harder, it's harder to advance, it's harder to get up the ladder. And I think that frustration, what do we make, right? What do we--\n(OVERTALK)\nDAVID GREGORY:\nJason, isn’t this a big part of our foreign policy, right, is getting-- to what will is saying, getting our economy right, building something. Even in your party, there may be a lot of conservative critics of the president on foreign policy and drawing red lines in American leadership, but there's still a wariness about projecting American power to try to somehow be, to transform parts of the world.\nJASON CHAFFETZ:\nI believe in American exceptionalism. I believe we have a leading role. I believe in peace through strength. Unfortunately, we have a president who is not believed around the world. He's lost the credibility. I think he had that credibility and had the military strength to back it up, there would be a lot more peace out there.\nAnd in terms of trade and opening up markets, oh, there's so much more that we could do. But our nation is so heavily regulated. You have so much uncertainty in our nation about taxes and ObamaCare and it's forcing these jobs overseas when we should be growing those right here in the United States.\nWILL.I.AM.:\nCan I ask a question? When it comes to, like, education, like, America, we fought a war on drugs and lost. And all it did was put young people in jail for petty drug crime. And our prisons are overpopulated and prison guards get paid more than teachers.\nWhy can't we all agree that we should fight a war on education, starting from eight years old to 19 year old. Getting kids, why can't STEM be, like, project-based learning, mandatory? Why can't we as a country keep all the jobs that are around technology in America? Like, I don't get it. It doesn't make any sense at all.\nJASON CHAFFETZ:\nI really do like what you're doing in terms of not just having STEM, but making it STEAM. I do believe that arts is one of the keys. Because if you can take those people in science and technology and math, one of the beauties of the United States of America, we're creative. We create things. And having those arts engaged in that, I believe that the best way to do that is at the state level.\nWhat we're frustrated with is we don't want the federal bureaucracy. There shouldn't even be a federal Department of Education because I want to drag that down to the states. Let them innovate. Let us and you figure out how to educate our kids.\nWILL.I.AM.:\nHowever you do it, why aren't we doing it?\nDAVID GREGORY:\nWell, we're going to continue this. Let me take a break here. We're going to have more on this and some of the challenges that maybe Washington is missing. And a little bit later on, we'll have a little bit of comment review from where we started at the White House Correspondents' Weekend from President Obama and also comedian Joel McHale last night at the Correspondents' Dinner, coming up after this.\nJOEL MCHALE (ON TAPE):\nHillary Clinton has a lot going for her as a candidate. As our first female president, we could pay her 30% less.\n***Commercial Break***\nDAVID GREGORY:\nWe're back with our roundtable, will.i.am. as a guest, and one of the reasons for having Will here and having kind of a surprise voice is to talk about what is it that Washington is not taking on? What is the Washington debate somehow missing, especially for young people who are connecting to each other in a much different way, who are looking at Washington in a much different way.\nChuck, you looked at this in some of our polling. I'll put them on the screen and interpret their importance to this overall discussion about priorities in the country, about America and the rest of the world, about the American economy. The millennials poll, President Obama's approval among ages 18 to 34, he's at 53% to 40%. Significant disapproval among young people. Here's also party identification, congressional preference in that 18 to 34, 53% for Democrats, 36% for Republicans. What do you take away from this?\nCHUCK TODD:\nWell, these are the these fall-off voters. These are people we identified that voted in 2012, did not vote in 2010. And so this is the math problem for the Democratic party in 2014. The president now talks about it publicly all the time. Which is how does he get his coalition, and the people that he uniquely got into politics, got people fired up, got people excited in 2008.\nHow do you turn them into habitual voters, and how do you turn them into supporting his agenda when he's not on the ballot. And this is going to be make or break for the Democrats, whether they hold the Senate or not. And that's what I find interesting is that his numbers are still pretty good with these folks. His numbers are still, so they're much stronger.\nDAVID GREGORY:\nBut isn't there some disappointment? I mean, isn't some of what you were talking about, Will, disappointment among people who maybe thought the federal government of President Obama could do more if you get to some of these things that are bigger priority?\nWILL.I.AM.:\nI don't know it's disappointment. It's frustration. And frustration leads to just, like, turn off, right? So it's just frustration of I don't understand the complex between Republican, Democrats, Congress. Like, that whole dance, it really turns me off.\nDAVID GREGORY:\nJason Chaffetz--\n(OVERTALK)\nDAVID GREGORY:\n--can you explain that?\nANITA DUNN:\nJoin the country.\nWILL.I.AM.:\nRight, so-- Like, when I went out there and said, \"Yes, we can,\" \"Yes, we can,\" means what are you going to do as well as when you support Obama, are you going to dedicate yourself to finding solutions? So I went out there and created this program in the ghetto that I came from, that I come from, and I can change that.\nRight, I go off and make money, I use my own money, stock up these kids, I get these kids, you know, amped up about science and technology. These kids are at risk, they could've been in a gang type kids. And now these kids, they want them at .74, now they've got a 3.8, 4.0. These kids have been to China to learn Mandarin. They've been to D.C. to take visits to the White House, MIT, these kids want to join MIT, I mean, wanna get the road to MIT, to not only look for a job but--\n(OVERTALK)\nJASON CHAFFETZ:\nYeah, and I love that he's doing that. It's the private sector that grows the economy that makes difference in people's lives. It's not big federal government. And the disconnect, the reasons that this apathy happens is because government's not going to come in and solve all their problems. Healthcare is a major issue now. And one of the big issues that I see as an--\n(OVERTALK)\nWILL.I.AM.:\nBut why is it always, why when you politicians say what private sector should do, the only thing you can use is healthcare as a thing that failed?\nJASON CHAFFETZ:\nWell, let me--\nWILL.I.AM.:\nWhat about, like, making a consumer electronic product? Why is it that if I went to Singapore and created jobs, I would get a grant, and it's hard for a person, an entrepreneur to come up with a product in America, where do you go?\nJASON CHAFFETZ:\nRegulation. The EPA. The overburdened federal government that makes it so difficult at every step. Now one thing that I do think is an opportunity for Republicans, right now, it's a jump-ball. But an opportunity for Republicans is on privacy and safety and security.\nWILL.I.AM.:\nThere's an opportunity for America to make sure a company like Apple are in Detroit and we're educating young kids at an early age to learn and be technical, digitally literate. Right, we need to educate kids at an early age.\nJASON CHAFFETZ:\nAbsolutely.\nWILL.I.AM.:\nWe can't just have basketball courts in every elementary school. They don't even have iOS, Android. They need to be running on Qualcomm technology, Intel technology.\nDAVID GREGORY:\nAnita, a comment here before I get to--\nANITA DUNN:\nWell, but I wanted to, I think listening to this conversation is a perfect example of your question, David, which is America versus Washington. Right, because Will's talking about looking for solutions without actually looking for a political party to provide those solutions and saying one side is right and one side is wrong.\nAnd it gets to Washington, it immediately devolves into the political party. I think what's interesting about education and education policy in this country is that increasingly, everybody is discovering it isn't one size fits all. And that there's room across the board for charters. There's room across the board for different styles within the public education system.\nAnd that this goes a little to what the congressman was saying, that the more flexibility you have in the system, the better off you're going to do. But rewarding entrepreneurs, whether they're in education, whether they're in manufacturing, whether they're in technology, it's something, I think this country's always done pretty well at. And so the question is, why aren't we doing a better job now, right?\nDAVID GREGORY:\nLet me get a break in here. We'll come back, and our final moments with our roundtable, including a buttoning up of the big White House Correspondents' Dinner, how the jokes played last night. Chuck Todd with his comment review as we debate that coming up after this.\n***Commercial Break***\nPRESIDENT OBAMA (ON TAPE):\nGridlock has gotten so bad in this town, you have to wonder, what did we do to piss off Chris Christie so bad?\nDAVID GREGORY:\nThere's President Obama at last night's White House Correspondents' Dinner with a dig introducing Governor Chris Christie. We're back with our roundtable, Kathleen Parker, Joel McHale also said a few things about Governor Christie. We're going to give you a little sample, and then I want your comic review.\nKATHLEEN PARKER:\nOkay, thank you.\nPRESIDENT OBAMA (ON TAPE):\nWashington seems more dysfunctional than ever. Gridlock has gotten so bad in this town, you have to wonder, what did we do to piss off Chris Christie so bad?\nJOEL MCHALE (ON TAPE):\nI promise that tonight will be both amusing and over quickly, just like Chris Christie's presidential bid. Chris Christie is here. He's actually here, tonight. Wow, so sir, you are a glutton for punishment.\nDAVID GREGORY:\nThe Obama thing was so funny, we felt we should play it twice. Kathleen, what did you--?\nKATHLEEN PARKER:\nWell, I laughed a lot, I always do. President Obama has immaculate timing, as everybody always says. And he's got the perfect delivery. I thought the comedian was probably, he took the most risks let's say of anyone else I've ever seen. He was over the top. But at least he was bipartisan in his over-the-topnesss. One of the jokes I thought was pretty funny was about the Healthcare.gov, which there's so bad, there's nothing to compare it to, in fact, that's become the term for something that's terrible. And you--\n(OVERTALK)\nKATHLEEN PARKER:\n--you go, \"Oh my gosh, did somebody Healthcare.gov on my new rug?\"\nDAVID GREGORY:\nAnd Chris Christie at least was pleased that they were making jokes about Bobby Jindal.\nCHUCK TODD:\nThey were. Well, it was funny to hear the chatter after and everybody saying, \"Wow, he had a lot of Chris Christie jokes.\" Like, talking about Joel McHale. But it was interesting, I mean, I thought he was edgy, I thought he pushed the envelope, and there was times that people were laughing very loudly, even if they were then looking around going, \"Well, am I allowed to laugh at that?\"\nKATHLEEN PARKER:\nI saw a lot of open mouths.\nCHUCK TODD:\nIt was, like, one of those things going--\nKATHLEEN PARKER:\n\"I can't believe he said that.\" Yeah.\nCHUCK TODD:\n\"Can't believe he said that.\" And then they laughed, and then they look, \"Uh-oh, did the camera catching me laughing?\"\nDAVID GREGORY:\nJust a few seconds left here, will.i.am., there's a lot of handwringing in Washington about whether this thing has gotten too big and too overwrought. What do you think of the spectacle as you sit back and look at it?\nWILL.I.AM.:\nLast night?\nDAVID GREGORY:\nYeah.\nWILL.I.AM.:\nIt was cool. I mean, I'm used to, like, the BRITS and the Grammys and I'm used to, you know, different environments. You had a lot of, like, you know, politician, “celebrititicians.”\n(OVERTALK)\nDAVID GREGORY:\nWe're not used to all those events. That's why we have these events. will.i.am., to the roundtable, everybody, thank you so much. We're going to leave it there this morning. Thank you for joining us. If it's Sunday, it's Meet the Press.\n* * *END OF TRANSCRIPT* * *","url":"https://www.nbcnews.com/meet-the-press/meet-press-transcript-may-4-2014-n100726"}
