{"authors":[],"date_download":"2018-10-22 21:23:29","date_modify":"2018-10-22 21:23:29","date_publish":"2018-07-25 00:00:00","description":"The Mexican capital's incoming leader, Claudia Sheinbaum, is an environmental engineer who worked on a U.N. climate panel that shared a Nobel Prize with Al Gore. Can she stabilize the city?","filename":"data/vaneerConsumption/MeetMexicoCitysFirstElectedFemaleMayor.json","image_url":"https://media.npr.org/assets/img/2018/07/23/gettyimages-989003778_wide-6b2f4c301d1326ad5ac8615283270dd3b162b962.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=631465464_1540243409.html","title":"Meet Mexico City's First Elected Female Mayor","title_page":"Meet Mexico City's First Elected Female Mayor : NPR","title_rss":"NULL","source_domain":"npr.org","text":"RACHEL MARTIN, HOST:\nMexico's surprising swing to the left in this month's national elections also swept in some other historic firsts. Women are now holding some of the most important positions in that country. Mexico's new Congress will be nearly 50 percent female. And the incoming mayor of Mexico City is a woman, the first female elected to that post. And she's not your typical politician, either. NPR's Carrie Kahn has this profile.\nCARRIE KAHN, BYLINE: Claudia Sheinbaum Pardo took an unusual route to this high political post considered a stepping stone to the country's presidency. She holds degrees in physics and energy engineering, did doctoral studies at Lawrence Berkeley National Laboratory in California and was part of a UN climate change panel that shared the Nobel Peace Prize with Al Gore. She doesn't want people to think she's just a science nerd. Looks can be deceiving, she'd like to frequently point out while on the campaign trail this summer.\nCLAUDIA SHEINBAUM PARDO: (Speaking Spanish).\nKAHN: \"Don't think because you see the skinny scientist up here that we won't be strong enough to take on the subject of crime fighting. With total responsibility, we will fight crime,\" she told a group of supporters at a Mexico City Park.\nUNIDENTIFIED CROWD: (Chanting) Claudia.\nKAHN: Sheinbaum is no political novice, either. She has long ties to leftist politics and to President-elect Andres Manuel Lopez Obrador. He appointed her as environment minister when he was mayor of the capital in 2000. Five years later, she took over one of Mexico City's largest districts, Tlalpan. However, there she ran into controversy, especially after a 7.1 earthquake struck the capital last September, hitting her district hard.\nUNIDENTIFIED SECURITY GUARD: (Speaking Spanish).\nKAHN: A lone security guard stands out front of an abandoned 12-unit apartment building. It's one of the more visible reminders of the destruction in Tlalpan. Twenty-two-year-old medical student Leonardo Sanchez walks by the crumbling complex every day. He's not happy Sheinbaum won for mayor.\nLEONARDO SANCHEZ: (Speaking Spanish).\nKAHN: \"She couldn't even take care of this one simple building. How's she going to deal with the district or an entire city?\" he says. More than 300 people were killed in the quake, including 19 children and seven adults who died when a school collapsed in Sheinbaum's district. Many blame her for the disaster. District officials approved shoddy construction permits allowing the owner to build an apartment on top of the school, destabilizing the structure. Sheinbaum denies any wrongdoing. Her press office declined repeated requests for an interview. Tackling the lingering problems in Tlalpan will need to be one of her first priorities as mayor says Jose Merino, a political scientist at the ITAM University and an adviser to Sheinbaum's campaign.\nJOSE MERINO: So she's a peculiar specimen. She's more of a problem solver. But she's really not a politician.\nKAHN: He says she's the right public servant for Mexico now, one with a calculating mind and not filled with political ambitions. Colleagues say Sheinbaum is a skilled team builder, too. Lynda Price, an energy scientist, worked with her during Sheinbaum's time at Lawrence Berkeley National Lab.\nLYNDA PRICE: I always think of her in that way as being, you know, confident, capable, skilled and persistent.\nKAHN: Both Sheinbaum's parents, also scientists, are children of Jewish immigrants. Sheinbaum says she celebrated holidays at her grandparents, but her home life was secular. She married a prominent leftist politician who later resigned from office after being caught on tape accepting large sums of cash. They divorced and have two children. Her Jewish heritage didn't come up much during the campaign despite Mexico's Catholic dominance. Marta Lamas, a leading feminist here, says the press was more focused on mayor elect's austere dressing style, always in a white blouse and pants, and her modest demeanor.\nMARTA LAMAS: Some people said that she was very serious in the campaign. And they said, oh, I wish she would smile a little bit more and laugh.\nKAHN: But that's her style, direct and to the point, say friends and supporters. Akin more to U.S. straightforwardness than Mexican political formalities says Merino, the campaign adviser.\nMERINO: In a country like Mexico and with our political protocols, some people are not very used to this.\nKAHN: But Merino says he finds it refreshing and needed at this time as Mexico City struggles with rising crime, pollution and water shortages. Sheinbaum begins her six-year term on December 1. Carrie Kahn, NPR News, Mexico City.\nCopyright © 2018 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=631465464"}
