{"authors":["Katy Parker-Shorthouse"],"date_download":"2018-10-31 01:45:23","date_modify":"2018-10-31 01:45:23","date_publish":"2018-09-14 13:44:44","description":"If the last few weeks have taught us anything, it is not to underestimate Megan Barton Hanson. She has spoken out about the vilification of women, condemned slut-shaming on prime time television, and now Megan Barton Hanson's Instagram post about…","filename":"data/vaneerConsumption/MeganBartonHansonsInstagramPostAboutDepressionProvesWhyWeShouldListenWhenSheSpeaks.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/a7f0aa0d-1da4-4e0b-8a48-3648679d6dee-getty-1014379086.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_megan-barton-hansons-instagram-post-about-depression-proves-why-we-should-listen-when-she-speaks-11917039_1540950323.html","title":"Megan Barton Hanson's Instagram Post About Depression Proves Why We Should Listen When She Speaks","title_page":"Megan Barton Hanson's Instagram Post About Depression Proves Why We Should Listen When She Speaks","title_rss":"NULL","source_domain":"bustle.com","text":"If the last few weeks have taught us anything, it is not to underestimate Megan Barton Hanson. She has spoken out about the vilification of women, condemned slut-shaming on prime time television, and now Megan Barton Hanson's Instagram post about depression is contributing to yet another important conversation.\nBarton Hanson was the most talked-about contestant of this year's competition, sparking debates and discussion pieces nationwide after the negative way the public reacted to both her previous career as an exotic dancer and the £25,000 that Hello! reported she had chosen to spend on surgery.\nIt wasn't just Barton Hanson's appearance that caused some sexist shockwaves. It was also her self-confident behaviour, in particular, when she stole current boyfriend (and her partner in the Love Island final) Wes Nelson right out from under the nose of his partner at the time, Laura Anderson. She went on to ruffle more feathers when she snogged new arrival Alex Miller when Nelson was in Casa Amor, where he remained loyal to Megan. In spite of all the drama, Barton Hanson finished third in this year's series, but her story doesn't stop there.\nOn the day of the Love Island Reunion hosted by Caroline Flack, she hinted at the impact all the commentary had had on her sense of wellbeing, writing that \"it’s time we stopped allowing the vilification of women in the media\". She went on to write: \"I won’t allow stories like these to stop me from be a free thinking, confident, independent young woman striving to make a better life for myself and my family.\"\nThe star then appeared on Good Morning Britain alongside Nelson, slamming those responsible for slut-shaming her with a T-shirt that read: \"Stop valuing women based on their sexual history\". As reported by the Daily Mail, Barton Hanson spoke to presenter Piers Morgan of the shocking double standard surrounding women and sexuality. \"I think it's really unfair and an old-fashioned way to look at it ... I slept with guys on TV and people think I should be ashamed of it. I'm not. If a guy done it... Adam [Collard] did it.\"\nThen two days ago, Barton Hanson posted her most revealing Instagram yet, captioning an image of her glammed up for the TV Choice awards with a lengthy reflection on the past year and how she has triumphed over her demons. Speaking for the first time about her struggles with depression and anxiety, the reality star wrote: \"this time last year I was in really a bad space. My anxiety was at an all time high and looking back now I can see I was actually depressed.\" Sporting a stunning bejewelled Julien Macdonald dress, which she writes was custom-made to fit her, the star looks happy and radiant in the pic, which she credits in part to her \"favourite human\" Wes.\nShe counsels fans to not give up hope and stay positive: \"If you’re feeling sh***y today just know that everything can change. Just because you aren’t where you want to be it doesn’t mean you aren’t going to get there.\"\nGood on you Meg.","url":"https://www.bustle.com/p/megan-barton-hansons-instagram-post-about-depression-proves-why-we-should-listen-when-she-speaks-11917039"}
