{"authors":["Ryan Smith For Mailonline"],"date_download":"2018-10-22 23:54:03","date_modify":"2018-10-22 23:54:03","date_publish":"2017-03-16 08:09:48","description":"She's one of Hollywood's most popular sex symbols, frequently topping lists of sexiest stars - and even being branded 'Earth's hottest girl' by Maxim.","filename":"data/vaneerConsumption/MeganFoxposesinFredericksofHollywoodlingeriepics.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/08/3E52826800000578-0-image-a-13_1489652445972.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319204_Megan-Fox-poses-range-sexy-lingerie-ad-campaign_1540252443.html","title":"Megan Fox poses in Frederick's of Hollywood lingerie pics","title_page":"Megan Fox poses in Frederick's of Hollywood lingerie pics | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's one of Hollywood's most popular sex symbols, frequently topping lists of sexiest stars - and even being branded 'Earth's hottest girl' by Maxim.\nAnd it isn't hard to see why Megan Fox has earned her pin-up reputation as she sizzles in the stunning new Frederick's of Hollywood lingerie spring 2017 campaign.\nThe 30-year-old actress looks simply sensational as she poses up a storm in an array of sexy ensembles, shot by esteemed photographer Ellen Von Unwerth in California's Hollywood Hills.\nScroll down for video\nFox! Megan Fox appears in a new ad campaign for Fredrick's of Hollywood's Spring 2017 range\nOne shot sees her dressed in a lacy black bra-and-panties set - with matching stockings and suspenders - as she lounges on a deckchair high above Los Angeles.\nWith towering black heels adoring her feet, she flashes a dazzling smile as her lustrous wavy brown locks cascade down her back.\nAnother snap sees her wearing a turquoise bra and a midnight blue satin bathrobe as she bites her thumb while staring seductively at the camera.\nTrue blue: The 30-year-old beauty poses in a turquoise bra with a midnight blue satin bathrobe\nBreathtaking: Her pert derriere is also given a moment in the spotlight in another sultry shot\nHer pert derriere is also given a moment in the spotlight as she relaxes on crispy white bed linen while wearing a purple underwear set.\nThe brunette beauty is co-owner, creative collaborator and global brand ambassador and features in her first campaign as the face of the brand.\n'I am so excited to reveal my first Frederick's of Hollywood campaign,' she said in a statement. 'Shooting in beautiful lingerie alongside Ellen von Unwerth was such a great opportunity. I cannot wait for fans to see the new collection.'\nSnapped: The campaign was shot in Hollywood by esteemed photographer Ellen von Unwerth\nSo excited: The screen star says she is 'so excited' to appear in her first campaign for the brand\nHer appearance in the photo campaign comes after her new 30-second commercial was unveiled, enttitled Fredrick's Gets Foxy.\nThe Hollywood beauty - who shot the campaign just a few months after welcoming her third child - wows in a black silk negligee complete with seductive stocking as she poses like a pro.\nMegan slips into sheer lace lingerie that highlights her ample assets, licking food off her fingers. The stunner slips into an array of rainbow-hued lingerie that makes the most of her killer curves.\nStunning: Actress Megan also sizzles in a 30-second commercial for the global lingerie brand\nNew ad: The clip, titled Fredrick's Gets Foxy, features the global underwear brand's new Spring 2017 collection in all its glory\nFeline fine: She poses in a black teddy and sheer cut-out bra, working her magic for the camera\nPin-up perfection: With her glossy brunette locks and bright red lips, Megan looks like the ultimate pin-up\nThe brunette bombshell also models a PVC bodysuit, exuding sex appeal as she gazes into the camera.\nLast September, the New Girl actress signed a deal with Frederick’s of Hollywood to be their brand ambassador, stakeholder, and creative partner.\nShe previously told WWD: 'I’ve been reluctant in the past to work with brands because there’s a lot of politics behind it and it’s a big deal to lend your name and image to something.\nPeekaboo: Screen beauty Megan doesn't take herself too seriously in the cheeky advertorial\nSmoking hot: Megan slips into a PVC one-piece with a zip running down the front\nLeggy lady: One quirky shot sees the New Girl actress kicking her stocking clad legs in the air\nBig deal: Last September, the New Girl actress signed a deal with Frederick’s of Hollywood to be their brand ambassador, stakeholder, and creative partner\n'But by offering me ownership in the company and some creative say, it gives me an opportunity to be passionate about what I’m promoting.'\nThe stunner has created a capsule collection for the company, as well as playing the part of model.\nMegan has previously fronted campaigns for the likes of Giorgio Armani Beauty, Armani Jeans and Avon.\nPassion for fashion: She previously told WWD, 'It gives me an opportunity to be passionate about what I’m promoting'\nHard to believe: The Hollywood beauty shot the campaign just a few months after welcoming her third child into the world\nSaucy: The stunner has created a capsule collection for the company, as well as playing the part of model","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319204/Megan-Fox-poses-range-sexy-lingerie-ad-campaign.html"}
