{"authors":["Simone Amelia For Daily Mail Australia"],"date_download":"2018-10-22 23:49:27","date_modify":"2018-10-22 23:49:27","date_publish":"2017-03-10 04:42:38","description":"She was one half of The Bachelor's first lesbian couple and since confirming her split from Tiffany Scanlon, Megan Marx is spreading her wings, heading solo to Denmark on Wednesday.","filename":"data/vaneerConsumption/MeganMarxtravelssolotoDenmarkafterbreakup.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/04/3E1FCDC600000578-0-image-a-53_1489119124122.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299824_Megan-Marx-travels-solo-Denmark-break-up_1540252167.html","title":"Megan Marx travels solo to Denmark after break-up","title_page":"Megan Marx travels solo to Denmark after break-up | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She was one half of The Bachelor Australia's first lesbian couple.\nAnd since confirming her split from Tiffany Scanlon on Wednesday in a response to a fan on social media, Megan Marx is ready to spread her wings.\nThe 27-year-old headed overseas on Wednesday, and through her Instagram live stories shared her first stop in Copenhagen.\nScroll down for video\nFlying solo: Newly single Megan Marx headed overseas on Wednesday and through her Instagram live stories, shared that her first stop was Copenhagen\nThe first update was a photo of the blonde beauty with a fresh face in a beanie, holding a coffee in front of the city's famous colourful row houses and waterways.\nShe captioned the shot 'Made it' and smiled as she posed in the 17th-century Nyhavn district.\nA closeup selfie showing half of her makeup-free face was her next upload, with the brightly coloured townhouses and canals in the background.\nHappy: A closeup selfie showing half of her makeup-free face was her next upload, with the brightly coloured townhouses and canals in the background\nThe reality star then shot a video of what appeared to be a military marching band in the city's historic streets.\nShe also captured footage from what looked like a chauffeured vehicle driving down the streets, passing popular restaurants and retailers.\nThe newly single stunner announced she would be indulging in a solo getaway to Europe in a post to Instagram one day after she revealed her break-up.\nMoments: The reality star then shot a video of what appeared to be a military marching band in the city's historic streets\nPictured at the International Departures area in Sydney Airport, she posed for a photo on the escalators dressed for travel in a striped T-shirt, pants and sneakers.\n'At International Departures on International Women's Day!' she wrote, paying tribute to Mexican artist Frida Kahlo as her inspiration for the day.\n'She showed me having a voice, even if that means showcasing a reality or a passion that is misunderstood or shocking to society, is not only cathartic to the individual soul, but important for the development of our society in achieving sense and equality,' she described.\nTaking flight: Pictured at the International Departures area in Sydney Airport, she posed for a photo on the escalators dressed for travel in a striped t-shirt, pants and sneakers\nMegan and Tiffany were both coy on social media in the weeks leading up to their break-up announcement and fans were shocked when Megan confirmed the split.\n'They put themselves in the public light .... the public is going to ask,' one follower observed of the situation. 'I think they're both regretting going so public so quickly.'\nWhile Megan has spoken on their separation, Tiffany has yet to officially comment.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299824/Megan-Marx-travels-solo-Denmark-break-up.html"}
