{"authors":["Rebecca Davison For Mailonline"],"date_download":"2018-10-23 05:14:25","date_modify":"2018-10-23 05:14:25","date_publish":"2016-01-28 21:14:16","description":"She's been relishing her freedom since leaving the Celebrity Big Brother house on Friday and it's fair to say that Megan McKenna has been fairly busy since.","filename":"data/vaneerConsumption/MeganMcKennaiscladincamoclothingasshepicksupachocolatebar.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/21/30AD7D1100000578-0-image-a-33_1454016640803.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421706_Megan-McKenna-clad-camo-clothing-picks-chocolate-bar_1540271665.html","title":"Megan McKenna is clad in camo clothing as she picks up a chocolate bar","title_page":"Megan McKenna is clad in camo clothing as she picks up a chocolate bar | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been relishing her freedom since leaving the Celebrity Big Brother house on Friday and it's fair to say that Megan McKenna has been fairly busy since.\nAnd heading to a business meeting in London on Thursday, the 23-year-old picked up a Snickers bar as she walked down the street, as she was clearly eating on the go.\nDressed to impress in casual yet trendy clothing, Megan wore a camouflage print jacket, but there was no mistaking her pretty features.\nScroll down for video\nFeeling peckish? Megan McKenna treated herself to a chocolate treat when she headed out to a business meeting in London on Thursday\nShe teamed it with a matching khaki polo neck jumper and wore leather leggings for her stroll around town.\nTopping off her look with a pair of heeled boots, the lovely lady attempted to go a little incognito with a simple black baseball cap.\nShe wore heavy make-up and had her brunette locks styled into very subtle curls as she smiled for the camera.\nLooking lovely: Dressed to impress in casual yet trendy clothing, Megan wore a camouflage print jacket, but there was no mistaking her pretty features\nNo doubt Megan will be busy watching the Channel 5 reality show on Thursday night as she keeps her eye on her love interest Scotty T, who remains in the house.\nWhile she said she's keen to see how things go romantically with the Geordie Shore lad when he comes out, she wasn't too happy when he locked lips with Tiffany Pollard after her departure.\nTalking to Rylan Clark on Big Brother's Bit On The Side, she pursed her lips as she talked about the tryst.\n'She's desperate': Megan wasn't too happy with her former Celebrity Big Brother Tiffany Pollard on BBBOTS earlier in the week, after she locked lips with her love interest Scotty T\n'She's just horny,' she said, while looking lovely in an orange off-the-shoulder number. 'She comes across as desperate.'\nAdding: 'I knew he would be like this. We've got a good summer planned.'\nWhile saying that people have encouraged her to meet up with Scotty as soon as he is out of the house, she said: As soon as I leave, this happens.'\nThe kiss! While saying that people have encouraged her to meet up with Scotty as soon as he is out of the house, she said: As soon as I leave, this happens'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421706/Megan-McKenna-clad-camo-clothing-picks-chocolate-bar.html"}
