{"authors":["Brad Witter"],"date_download":"2018-10-31 00:02:09","date_modify":"2018-10-31 00:02:09","date_publish":"2018-10-28 18:07:23","description":"The Duchess of Sussex has given her royal seal of approval to the people of New Zealand. During Meghan Markle's speech about women's right to vote on Sunday, Oct. 28 — in honor of the 125th anniversary of women's suffrage in New Zealand — the royal…","filename":"data/vaneerConsumption/MeghanMarklesSpeechAboutWomensSuffrageIsAStirringReminderOfWhyVotingMattersVIDEO.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/10/28/f4ad2a9d-f39b-4310-83fd-6e1dccfd57ea-getty-1054556566.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_meghan-markles-speech-about-womens-suffrage-is-a-stirring-reminder-of-why-voting-matters-video-13009564_1540944129.html","title":"Meghan Markle's Speech About Women's Suffrage Is A Stirring Reminder Of Why Voting Matters - VIDEO","title_page":"Meghan Markle's Speech About Women's Suffrage Is A Stirring Reminder Of Why Voting Matters — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"The Duchess of Sussex has given her royal seal of approval to the people of New Zealand. During Meghan Markle's speech about women's right to vote on Sunday, Oct. 28 — in honor of the 125th anniversary of women's suffrage in New Zealand — the royal said \"bravo\" and expressed her admiration and appreciation for \"the women who well deserve to have an active voice and acknowledged vote,\" as well as stressing the major impact the first nation to pass women's suffrage has had globally over the years.\nWhile in New Zealand as part of the final leg of her and Prince Harry's 16-day royal tour (which also included recent visits to Australia, Fiji, and Tonga), Markle stood in front of a portrait of Queen Elizabeth at the Government House in Wellington, and addressed the crowd of dignitaries:\n\"Yes, women's suffrage is about feminism, but feminism is about fairness. Suffrage is not simply about the right to vote but also about what that represents: the basic and fundamental human right of being able to participate in the choices for your future and that of your community, the involvement and voice that allows you to be a part of the very world that you are a part of.\"\nMarkle, who is expecting a baby in the spring with Prince Harry, also paid homage to New Zealanders by opening her speech with a formal Maori greeting, and she also accessorized her black Gabriela Hearst dress with a necklace that featured a traditional Maori design, according to People. Additionally, the Duchess closed her remarks by quoting Kate Sheppard, one of the New Zealand women's suffrage movement's key figures: \"All that separates — whether of race, class, creed or sex — is inhuman and must be overcome.\"\nPool/Getty Images Entertainment/Getty Images\nIn the audience for the speech (aside from Prince Harry, of course) were Governor Dame Patsy Reddy and Prime Minister Jacinda Ardern, who recently had a major feminist — and historical — moment when she brought her then-3-month-old daughter to the United Nations General Assembly for the Nelson Mandela Peace Summit in September. (Markle is also an United Nations ambassador for women.)\nPool/Getty Images Entertainment/Getty Images\nArdern was also on-hand to meet the Duke and Duchess at the Wellington airport upon their arrival in the country earlier in the day. Maori elders also greeted the royals with a traditional hongi greeting, which involved touching noses and foreheads. Prior to Markle's speech, she and Prince Harry also met with local schoolchildren and also laid a wreath at the Tomb of the Unknown Warrior.\nJust one day earlier, the royal couple also both gave speeches to close the 2018 Invictus Games in Sydney, Australia. In Markle's speech, she talked about how inspired she was by the competitors in the week-long event (founded by her husband in 2014) for wounded, injured, and sick servicemen and women. Prince Harry echoed those sentiments and also stressed the importance of mental health awareness.\nAs evidenced in Markle's latest women's suffrage speech in New Zealand — as well as her extensive past charity work — the importance of feminism and women's rights clearly remains paramount for the new royal.","url":"https://www.bustle.com/p/meghan-markles-speech-about-womens-suffrage-is-a-stirring-reminder-of-why-voting-matters-video-13009564"}
