{"authors":["Abc News","More Carolyn"],"date_download":"2018-10-30 00:53:39","date_modify":"2018-10-30 00:53:39","date_publish":"2018-10-28 15:32:08","description":"\"Women's suffrage is about feminism, but feminism is about fairness,\" she said.","filename":"data/vaneerConsumption/MeghanMarklemarksthe125thanniversaryofwomenssuffrageinNewZealandwithspeechlaudingfeminism.json","image_url":"https://s.abcnews.com/images/GMA/royals-gty-er-181028_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/GMA_Culture_meghan-markle-m_558d82828419b3c62b51d51be6057817_story_id=58810027_1540860819.html","title":"Meghan Markle marks the 125th anniversary of women's suffrage in New Zealand with speech lauding 'feminism'","title_page":"Meghan Markle marks the 125th anniversary of women's suffrage in New Zealand with speech lauding 'feminism' - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"At an event celebrating the 125th anniversary of women's suffrage in New Zealand, Meghan Markle lauded the nation for being the first to allow women to vote, noting the \"larger impact of what this symbolized.\"\nInterested in Royal Family? Add Royal Family as an interest to stay up to date on the latest Royal Family news, video, and analysis from ABC News. Add Interest\n\"The achievements of the women of New Zealand, who campaigned for their right to vote and were the first in the world to achieve it, are universally admired,\" the Duchess of Sussex said at an event in the nation's capital of Wellington, where she and Prince Harry visited during the 14th day of their royal Down Under tour.\nKirsty Wigglesworth/AP\nIn preparing to mark the historic anniversary of women's suffrage in the country, Meghan said she \"reflected on the importance of this achievement, but also the larger impact of what this symbolized.\"\n\"Because, yes, women's suffrage is about feminism,\" she added, \"but feminism is about fairness.\"\n\"Suffrage is not simply about the right to vote, but also about what that represents,\" Meghan said. \"The basic and fundamental human right of being able to participate in the choices for your future and that of your community.\"\nKirsty Wigglesworth/AP\nMeghan's speech was attended by New Zealand's prime minister Jacinda Ardern, who became only the second elected world leader in modern times to give birth while in office when she welcomed a baby girl earlier this year.\nThe Duke and Duchess of Sussex received a call from @JacindaArdern, Prime Minister of New Zealand. #RoyalVisitNZ pic.twitter.com/L5ziYKfnZQ — Kensington Palace (@KensingtonRoyal) October 28, 2018\nMeghan had been an outspoken supporter of women's rights and equality even before becoming a member of the British royal family, and many predict she will continue to focus her humanitarian work on women's issues.\nKirsty Wigglesworth/Pool/Getty Images\nThe royal couple landed in Wellington earlier in the day. Meghan, who is pregnant and expecting a baby next year, donned a $56 ASOS maternity wear dress paired with a Karen Walker trench coat.\nThey were greeted with a traditional Maori Haka performance, the Haka Powhiri, or welcoming dance, which imitated the hauling of a canoe ashore.\nHarry and Meghan were also welcomed by Maori elders with a traditional Hongi greeting ceremony.\nThe couple will spend four days in New Zealand as the final part of their visit to Australia and its neighboring countries.\nThe Maori Welcoming Party performs a Haka imitating the hauling of a canoe ashore, known as Haka Powhiri, the Dance of Welcome. #RoyalVisitNZ pic.twitter.com/9pRCnUU5D7 — Kensington Palace (@KensingtonRoyal) October 28, 2018\nThe couple started their second full day in New Zealand by meeting with young people at the Maranui Cafe to talk about mental health and mental health services in the region.\nThey met with Jazz Thornton and Gen Mora, the founders of Voices of Hope, an organization that aims to help those struggling with mental health issues in the region. They also met with Ezekiel Raui, the founder of Te Kotahi, a peer-support mental health program.\nLater in the day, the newlyweds will head to Abel Tasman National Park, which sits at the northern end of the South Island. Harry and Meghan will participate in a traditional welcome ceremony and enjoy a barbecue lunch with young children and some of the Park's young ambassadors.\nThe couple will also take part in a trail walk to showcase some of New Zealand's famed scenery.","url":"https://abcnews.go.com/GMA/Culture/meghan-markle-marks-125th-anniversary-womens-suffrage-zealand/story?id=58810027"}
