{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 02:53:51","date_modify":"2018-10-23 02:53:51","date_publish":"2017-03-10 12:06:36","description":"Meghan Markle flirted up a storm with Ashton Kutcher in her debut film role in A Lot Like Love in 2005, in which she played a 'hot girl' on a plane who tried to seduce his character.","filename":"data/vaneerConsumption/MeghanMarklealongsideAshtonKutcherinALotLikeLove.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22A8B000000578-0-image-a-41_1489147425129.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4301044_Meghan-Markle-alongside-Ashton-Kutcher-film-role_1540263231.html","title":"Meghan Markle alongside Ashton Kutcher in A Lot Like Love","title_page":"Meghan Markle alongside Ashton Kutcher in A Lot Like Love | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the star of a hit US TV drama and her romance with Prince Harry has naturally propelled her further into the spotlight.\nBut while she's now a huge star, Meghan Markle's very first film role was rather more underwhelming - and earned her only the title of 'hot girl' on the end credits.\nThe unknown actress who had been seen on TV just twice before the role - appeared alongside the Hollywood heartthrob in the 2005 film called A Lot Like Love.\nMeghan Markle in her very first film role alongside Asthon Kutcher in the 2005 romantic comedy, A Lot Like Love\nThe unknown actress had only appeared on television twice before when she landed the role of a passenger who flirts with Ashton Kutcher's character on a flight\nUnfortunately, Meghan's film debut sounded rather underwhelming in the credits\nOn-screen for less than two minutes, she attempted to flirt with Kutcher's internet entrepreneur character Oliver Martin on a flight.\nBut she was left stunned when Oliver showed no interest because of his complicated on-off relationship with photographer Emily Friehl, Alias actress Amanda Peet.\nAnd she ended up being chatted up by business partner Jetter played by actor Kal Penn - instead.\nAlthough she introduced herself as Natalie, she only appears in the credits as Hot Girl.\nDespite introducing herself as Natalie in the film, Meghan was relegated to 'hot girl' in the film's end credits\nMeghan's character ended up being chatted up by Ashton's business partner Jetter, played by actor Kal Penn\nLast weekend Harry demonstrated how serious he is about Meghan, by taking her along to the wedding of his close friend Tom ‘Skippy’ Inskip in Montego Bay, Jamaica.\nThe pastor who presided over the ceremony said the couple looked ‘so very much in love’. ‘\nThey sat next to each other and held hands as they walked out,’ he added.\nThe actress practices her best smouldering glance on Hollywood heartthrob Ashton\nShe didn't get the guy this time! Kutcher's character wasn't interested in Meghan due to a complicated on-off relationship\n‘I will never forget their radiant smiles and they looked so happy together.’\nHis final, prescient words to Harry were: ‘It’s your turn next, Sir.’\nIf Harry does propose soon, it's rumoured that chancellor Philip Hammond would prefer the wedding to be on a Saturday to avoid disrupting productivity.","url":"https://www.dailymail.co.uk/femail/article-4301044/Meghan-Markle-alongside-Ashton-Kutcher-film-role.html"}
