{"authors":["Lia Beck"],"date_download":"2018-10-31 01:41:15","date_modify":"2018-10-31 01:41:15","date_publish":"2018-09-14 19:40:57","description":"People of London, Meghan Markle is amongst you. When you are sweaty post-workout or cranky post-work and trying to pick up something for dinner, Duchess Meghan is in your midst, probably buying a whole raw chicken. Meghan Markle goes to Whole Foods…","filename":"data/vaneerConsumption/MeghanMarkleReportedlyGoesToWholeFoodsInABaseballCapWowRoyalsReallyAreJustLikeUs.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/14/a7cf9e85-938e-45a5-86b4-a63cad5dfb04-getty-996382086.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_meghan-markle-reportedly-goes-to-whole-foods-in-a-baseball-cap-wow-royals-really-are-just-like-us-11922366_1540950075.html","title":"Meghan Markle Reportedly Goes To Whole Foods In A Baseball Cap & Wow, Royals Really Are Just Like Us","title_page":"Meghan Markle Reportedly Goes To Whole Foods In A Baseball Cap & Wow, Royals Really Are Just Like Us","title_rss":"NULL","source_domain":"bustle.com","text":"People of London, Meghan Markle is amongst you. When you are sweaty post-workout or cranky post-work and trying to pick up something for dinner, Duchess Meghan is in your midst, probably buying a whole raw chicken. Meghan Markle goes to Whole Foods incognito, according to a source who spoke to People and who is probably not Priyanka Chopra this time. (Sorry, girl. I'm just kidding.)\nThe source told People, \"She spends most of her weekends in the Cotswolds with Harry. When she does venture out to Pilates or to get her hair done, she normally goes incognito under a baseball cap.\" Markle and Prince Harry have a country home in the Cotswolds, but when they're in London, they live in Nottingham Cottage at Kensington Palace. And it's when they're in the city that the Whole Foods trips reportedly occur. The source said that the only other place besides Pilates or the salon that Markle regularly goes is Whole Foods and that she can get in and out undetected.\nIt's no surprise that Markle would want to go to the grocery store herself, even though she could totally have someone do it for her, because she loves cooking. Markle used to have a blog called The Tig — named after her favorite wine — on which she shared a ton of recipes alongside other lifestyle topics. The Duchess of Sussex also talked about cooking in her post-engagement interview with Harry, when the couple explained that they were roasting a chicken when he proposed.\nChris Jackson/Getty Images Entertainment/Getty Images\nWhile Markle could just cook with ingredients that were gathered for her, there's something about actually shopping for the ingredients. And based on her blog, Markle seems like someone who wants to actually see, smell, and feel the produce herself. Plus, imagine planning on making poached pears and your royal shopper returns with some subpar pears and forgets the cardamon. That's annoying no matter who you are.\nBut while Markle goes to Whole Foods in her baseball cap \"like a normal person\", it's not really normal at all because she is constantly with her security detail. Simon Morgan, a security expert who has worked with the royal family, told CBS of Markle ahead of her wedding, \"She will no longer be able to just pop to the shops and buy a pint of milk or a newspaper. A protection officer will now go with her.\" While Markle might be popping out to go buy fancy cheese to pair with her glass of Tignanello, she is certainly not doing it alone.\nCharles McQuillan/Getty Images Entertainment/Getty Images\nIt should go without saying, but if you see Markle at Whole Foods, please leave her alone. (Same goes if you see someone who looks like Markle at Whole Foods — it might not be her, ya creep.) A security guard will get you, for one, but also she deserves to have some time to grocery shop in peace. Markle makes plenty of official appearances — including the tour she and Harry have scheduled for Oceania in October — that offer opportunities for fans to see her, so when she's not on the job, she should get to chill and avoid making eye contact with other shoppers like the rest of us.","url":"https://www.bustle.com/p/meghan-markle-reportedly-goes-to-whole-foods-in-a-baseball-cap-wow-royals-really-are-just-like-us-11922366"}
