{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:48:41","date_modify":"2018-10-30 21:48:41","date_publish":"2016-02-29 19:01:07","description":"Fox News anchor Megyn Kelly appeared at Vanity Fair's pre-Oscar dinner party Sunday evening, where she dined with some of the celebrities who later headed to the Dolby Theater for the main event. |","filename":"data/vaneerConsumption/MegynKellyDineswithHollywoodStarsonOscarNight.json","image_url":"https://media.breitbart.com/media/2016/02/Megyn-Kelly-Oscars-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2016_02_29__1540936121.html","title":"Megyn Kelly Dines with Hollywood Stars on Oscar Night","title_page":"Megyn Kelly Dines with Hollywood Stars on Oscar Night | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Fox News anchor Megyn Kelly appeared at Vanity Fair‘s pre-Oscar dinner party Sunday evening, where she dined with some of the celebrities who later headed to the Dolby Theater for the main event.\nAccording to the New York Post, Kelly — Vanity Fair‘s February cover model — and her husband Douglas Brunt dined alongside Judd Apatow, Larry David, Martin Short, designer-director Tom Ford, and Don Rickles at the star-studded bash.\nOther stars at the pre-Oscar dinner included James Corden, Anjelica Huston, Tory Burch, Joan Collins, Patricia Clarkson, CBS head Les Moonves, Julie Chen, Monica Lewinsky, Salman Rushdie and CAA super-agent Bryan Lourd.\nKelly also appeared at Vanity Fair‘s post-show party, where she mingled with superstars including The Revenant Oscar-winner Leonardo DiCaprio, show host Chris Rock, Jessica Alba, Amy Adams, and Jennifer Garner, according to the Daily Mail.\nOther stars at the glitzy post-Oscar bash included Louis C.K., Sarah Silverman, Jeremy Renner, Vince Vaughn, and The Revenant director Alejandro G. Inarritu.\nKelly is set to moderate Thursday night’s Republican debate in Detroit alongside fellow Fox News anchors Bret Baier and Chris Wallace.\nSunday’s 88th Academy Awards telecast stretched over three and a half hour long and featured some surprises and long hoped-for wins. DiCaprio earned his first Oscar with his sixth nomination for The Revenant, while Brie Larson also earned her first Oscar for her star-making performance in Room and Alejandro Inarritu won Best Director in back-to-back years for the first time since the 1950s. The ensemble drama Spotlight took home Best Picture.","url":"https://www.breitbart.com/entertainment/2016/02/29/megyn-kelly-dines-with-hollywood-stars-on-oscar-night/"}
