{"authors":[],"date_download":"2018-10-30 00:56:18","date_modify":"2018-10-30 00:56:18","date_publish":"2016-10-27 00:00:00","description":null,"filename":"data/vaneerConsumption/MegynKellydeservedNewtGingrichssmackdown.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_10_megyn_kelly_deserved_newt_gingrichs_smackdown_1540860978.html","title":"Megyn Kelly deserved Newt Gingrich's smackdown","title_page":"Megyn Kelly deserved Newt Gingrich's smackdown","title_rss":"NULL","source_domain":"americanthinker.com","text":"Gingrich rightly felt that Bill’s escapades are relevant, as well as Hillary’s handling of his “bimbo eruptions” as she looked the other way and rode his coattails to power. Hillary, along with Kelly, has attacked Trump’s attitudes toward women, even as Hillary, apart from being Bill’s serial enabler, once laughed about getting the accused rapist of a 12-year-old girl off , and as the Clinton Foundation accepted money from governments and private donors that support sharia law and its serial abuse of women. As far as we know, Trump has accepted not a single drachma from those who endorse marital rape, the stoning of women for adultery, and other barbarities. Trump versus Bill Clinton? Close, but no cigar.\nJuanita Broaddrick and Paula Jones, among the many victims of sexual predator William Jefferson Clinton and his serial enabler, Hillary Rodham Clinton, welcomed Newt Gingrich’s smackdown of the star of Fox News’s The Kelly File on Tuesday night. As Gingrich pointed out, Kelly, along with other mainstream media talking heads, was beating the Trump “Access Hollywood” tape into the ground while reciting the Clinton mantra that Bill’s sexual assaults while holding public office were “old news” and no longer relevant.\nThe exchange, as reported by the New York Times, went as follows, with Kelly arguing that Trump’s dirty talk in a trailer was worse than Bill Clinton’s turning of the Arkansas governor’s mansion and the Oval Office into a personal Playboy penthouse:\n“You are fascinated with sex and you don’t care about public policy,” he told Ms. Kelly. Ms. Kelly: “Me? Really?” Mr. Gingrich: “That’s what I get out of watching you tonight.” Ms. Kelly: “You know what Mr. Speaker, I’m not fascinated by sex, but I am fascinated by the protection of women and understanding what we’re getting in the Oval Office and I think the American voters would like to know …” Mr. Gingrich then began to talk about how Mrs. Clinton’s husband, former President Bill Clinton, would return to the White House “because you, after all, are worried about sexual predators,” an apparent allusion to Mr. Clinton’s affair with a White House intern, Monica Lewinsky. “Listen, it’s not about me. It’s about the women and men of America,” Ms. Kelly replied. She said polls showed that voters were concerned about the allegations against Mr. Trump and believed they were an issue. As the interview progressed, Mr. Gingrich turned to baiting Ms. Kelly. “Do you want to comment on whether the Clinton ticket has a relationship to a sexual predator?” Mr. Gingrich said, adding: “I just want to hear you use the words, ‘Bill Clinton, sexual predator.’ I dare you. Say, ‘Bill Clinton, sexual predator.’”\nKelly did not call and has not called Bill Clinton what he in fact was, a sexual predator, insisting instead that the Clinton assaults on women had been covered by her and others and wishing Gingrich well on attending to his “anger issues.”\nHer concerns about women appear to be limited to Trump’s actions and words as a private citizen, and not to a governor and president who abused both his office and the women he viewed as objects for his personal gratification. Trump’s alleged actions affected Trump. Bill Clinton’s actions arguably affected national security, subjecting both him and Hillary to possible blackmail.\nThe good folks at media watchdog Newsbusters have made Gingrich’s case, showing the lopsided coverage of the Trump tapes and subsequent allegations versus the revelations from WikiLeaks about the extent of Hillary Clinton’s lies and corruption and jeopardizing American national security with her private unsecured email server:\nMedia Research Center’s Research Director Rich Noyes made his latest Fox Business Network (FBN) appearance on Tuesday afternoon and expounded upon the massive, 15-to-1 disparity of major broadcast network coverage about Donald Trump’s lewd 2005 comments concerning women versus a Wikileaks document dump involving Hillary Clinton. “15 times more for Trump than for Hillary. The Trump story’s a big story, but the Hillary story should be her worst headache in the campaign since her health crisis and it's getting buried under this avalanche of the Trump mess,” Noyes explained as part of one set of comments to host Neil Cavuto. After Cavuto introduced Noyes, the MRC’s Research Director laid out the numbers since Friday night before making the analogy about the “avalanche of the Trump mess”: Well, Neil we're just looking at ABC, CBS and NBC and since Friday night, there’s been 198 minus of coverage on just these six broadcast shows about Donald Trump's tape and the things he said back in 2005. At the same time, the story broke almost the same hour, just 13 minutes on these Hillary Clinton Wikileaks expose showing that she had, you know, two opinions — public versus private positions when it came to trade. She wanted open borders throughout the hemisphere. She wanted open markets throughout the hemisphere which would have really had an effect on American workers.\nThe Clinton story is not old news and is as relevant as Trump’s dirty talk in a trailer, which has prompted a media obsession versus the comparative grand yawn about WikiLeaks. Kelly’s rant suggests she is among those more concerned about stopping Trump than protecting women from actual predators. Hillary’s is a compelling story of hypocrisy and double standards on a grand scale, and Gingrich is right to take Kelly to task for saying she’s already covered it and that it is old news.\nWhile touting her becoming the first female nominee for president of a major party, Hillary Rodham Clinton ignores the probability that without the “Clinton” at the end, Hillary Rodham might still be practicing law and investing in cattle futures in Arkansas. For all her feminists bravado, the woman who described herself as “my mother’s daughter and my daughter’s mother” rode to prominence as Mrs. Bill Clinton, squasher of bimbo eruptions and enabler of her husband’s philandering. It was a Faustian bargain in which she would send Bill’s pants to the dry cleaner, and he would put her on the road to the White House.\nEven in the early days, Hillary Rodham was riding Bill Clinton’s coattails, ignoring his abuse of women for political considerations. As Betsey McCaughey writes in the New York Sun:\nStrangely, feminists ignore the damning facts about how Hillary got where she is… She invoked her own supposed early struggles to become the first female partner at the Rose Law Firm in Arkansas while a new mother. Even then she was riding on Bill’s coattails. She got the law job in 1977 -- surprise, surprise -- just after he was sworn in as the state’s Attorney General. Then, two years later when he was inaugurated as governor --bingo -- she was vaulted to partner. Hardly the struggle she now recalls. Though Hillary was called a trial lawyer, her former colleagues told the New York Times they can’t remember her ever trying a case.\nMany forget, and those who hope she will forgive their student loans are too young to remember, but Hillary Clinton first gained national prominence, as columnist Debra J. Saunders writes at SFGate, doing just that:\nWhen Hillary Clinton first became a national figure in 1992, it was on “60 Minutes.” CBS correspondent Steve Kroft was asking the Clintons about Gennifer Flowers‘ claim that the Bubba and she had an affair. Bill denied the allegation. Hillary Clinton said, “I’m not sitting here, some little woman standing by my man like Tammy Wynette.” Actually, that’s exactly what she was doing. On “60 Minutes,” Bill Clinton denied having an affair with Flowers. Well, if you listen carefully, you notice that he denied a 12-year affair with Flowers. Kroft asked: Would he categorically deny the affair? Ever the parser, Clinton answered, “I’ve said that before.” In 1998, under oath during a deposition for the Paula Jones lawsuit, Clinton testified he had sex with Flowers in 1977. Once. Just like he didn’t inhale…. For every bad choice Bill Clinton made, he tried to evade any consequences, not by owning up, but lying. It is unthinkable to expect the former president to regulate himself. Hillary Clinton was his ever-ready enabler. Later, during the Monica Lewinsky scandal, the first lady famously blamed a “vast right-wing conspiracy.”\nGennifer Flowers, Monica Lewinsky, Paula Jones, and Kathleen Willey, as well as, some would suggest, a cast of thousands, have been groped, fondled, and used as sexual objects by one William Jefferson Clinton. And then there’s Juanita Broaddrick, who has credibly accused President Clinton of rape.\nHillary, champion of women’s rights, has said all claims of rape must be deemed credible and properly investigated. Not in the case of the 12-year-old girl, and not in the case of Juanita Broaddrick. Hillary Clinton was married to and enabled a serial sexual predator. She set a child rapist free. Feminist champion? Hillary didn’t crack the glass ceiling, although she may have polished the mirrors on Bill’s. Hillary Clinton sold women out and let bad things happen to them just so she could ride her husband’s coattails to power.\nGingrich was right to take Kelly on. We will await her calling Bill Clinton what he was, a sexual predator, and Hillary Clinton for what she is, his enabler and an exploiter of women for political gain.\nDaniel John Sobieski is a freelance writer whose pieces have appeared in Investor’s Business Daily, Human Events, Reason Magazine, and the Chicago Sun-Times among other publications.","url":"https://www.americanthinker.com/blog/2016/10/megyn_kelly_deserved_newt_gingrichs_smackdown.html"}
