{"authors":["Hannah Al-Othman","Chris Spargo For Dailymail.Com"],"date_download":"2018-10-23 01:33:20","date_modify":"2018-10-23 01:33:20","date_publish":"2017-03-10 09:52:20","description":"Megyn Kelly is hoping to rebrand herself as the queen of daytime television at NBC, fresh off her three-year reign as the queen bee of Fox News' primetime lineup on pundits.","filename":"data/vaneerConsumption/MegynKellyistryingtobenextOprahonhernewNBCshow.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E234C5000000578-0-image-a-4_1489155804919.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300480_Megyn-trying-Oprah-new-NBC-show_1540258400.html","title":"Megyn Kelly is trying to be next Oprah on her new NBC show","title_page":"Megyn Kelly is trying to be next Oprah on her new NBC show | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Megyn Kelly is hoping to rebrand herself as the queen of daytime television at NBC, fresh off her three-year reign as the queen bee of Fox News' primetime lineup.\nA source tells Page Six that after years of hard-hitting interviews and on-air confrontations with the likes of Newt Gingrich and President Donald Trump on her Fox News program The Kelly File, the 46-year-old mother of three is hoping to go in much a different direction at NBC.\n'Megyn feels she has more to offer. She wants to help people the way Oprah did, and do something more positive,' said the source, whose relationship to NBC and/or Kelly was not revealed in the story.\nThat individual then added: 'She’ll be focusing on issues and bringing in real people as well as celebrities. Plus, she has a sense of humor and she wants to use that.'\nScroll down for video\nNew look: Megyn Kelly (above in january 2016) is reportedly aiming to make her new NBC morning program similar to Oprah Winfrey's long-running daytime talk show\nLiving legend: 'Megyn feels she has more to offer. She wants to help people the way Oprah did, and do something more positive,' said a source\nWith that in mind, the hunt is now on for an executive producer to help develop and guide the show with Kelly.\nAnd while Kelly no doubt has some very strong opinions about who should be filling that post, she is not actually involved in the search at this time because she is still under contract with Fox News.\nAs a result, newly appointed NBC News President Noah Oppenheim is looking over the candidates ahead of Kelly's start date at the network, which may not come until July unless her former company agrees to release her from her contract.\nThe hiring of a new executive producer has also reportedly led to some fears at NBC about job security.\n'People who have been there for 30 years fear they’ll be let go, and there’s, of course, talk about how much money she’s getting,' said a source.\nThat is reportedly due to Kelly's desire to bring in someone from outside the NBC family to work alongside her on the show, one of two she will be launching later this year.\n'Megyn doesn’t want a [Matt] Lauer loyalist running her show. She wants a team who she can trust and that will have her back,' said a source.\nAs for Kelly's salary, it is still unclear how much NBC is paying the host, with initial estimates claiming she would be making $12million per year in her new role.\nIn the two months since she announced her decision to sign with NBC that amount has gone up in reports, with The New York Times claiming she could be making as much as $20million at the Peacock Network.\nWhat is known is that NBC is paying Kelly far less than the staggering $25million offer she received from her former employer.\nFox News was also ready to offer Kelly a four-year contract at that price, which would have made her the second-highest paid TV anchor behind Lauer, who takes home $28million a year for his 10-hour work week on Today.\nOh make me over: Kelly, 46, has already begun a physical transformation for her new role, debuting longer hair at the Vanity Fair Oscar party last week (above)\nMan of the hour: The hunt is currently underway for an executive producer who will develop and guide the series with Kelly, a search that is being led by NBC News President Noah Oppenheim, who managed to woo Kelly last year and write the screenplay for 'Jackie' (above with star Natalie Portman in November)\nIt was Oppenheim who managed to woo Kelly over to NBC in what was a huge, and surprising, get for the network.\nIt had been assumed prior to the announcement in early January that Kelly would likely stay at Fox News or perhaps take a job with their rival CNN.\nOf the major networks, ABC was the only one Kelly was thought to have had an interest in while making her decision.\nOppenheim did that by taking a unique approach when he met with Kelly, and asking her to present him with what she hoped to new in her new role rather than offering up potential slots and hosting positions at the network.\nHe was rewarded one month later with his promotion to head of NBC News after the exit of Deborah Turness.\nOppenheim will also be holding on to his former job as executive in charge of Today.\nKelly's morning show, which will reportedly be airing live at 9am or 10am and taped in front of a live studio audience, will not fall under the Today umbrella an NBC source told DailyMail.com last month.\nOppenheim is reportedly interviewing potential producers from CAA for the job on Kelly's program, with the agency also producing the show.\nHe is also trying to get Fox News let Kelly out of her contract.\nIt is a tall order for the new president of the network, who on top of all these accomplishments also penned the screenplay for last year's critically adored Jackie Kennedy biopic 'Jackie' starring Natalie Portman.\nKelly meanwhile is laying low and enjoying some time with her kids before she sets out to become Oprah.\nAnd while she is trying to be Oprah, she will also very likely be facing off against Oprah.\nIt was announced last month that Winfrey would be joining the team at '60 Minutes' later this year, the popular and long-running Sunday news magazine that Kelly will likely be up against with her Sunday night show on NBC.\nAnd a source said that Kelly's news magazine will not be anything like the feel good program she will be putting out on weekday morning.\n'Megyn will have the Sunday night show on NBC to scratch that itch. That’s where you’ll see the big interviews and stories,' explained the source.\nMeanwhile, Kelly has already begun a physical transformation of sorts, debuting fuller and longer hair at the Vanity Fair Oscar party last week.\nOprah would approve.","url":"https://www.dailymail.co.uk/news/article-4300480/Megyn-trying-Oprah-new-NBC-show.html"}
