{"authors":[],"date_download":"2018-10-30 01:22:03","date_modify":"2018-10-30 01:22:03","date_publish":"2016-10-18 13:55:51","description":"Days after a 2005 recording of Donald Trump making lewd comments about women surfaced, his wife defended him and characterized the comments as \"boy talk,\" in her first interviews since the presidential nominee faced allegations of sexual misconduct.","filename":"data/vaneerConsumption/MelaniaTrumpdefendshusbandslewdcommentsaboutwomenas.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/Y100FM/2016/02/24/Videos/4772764396001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national-govt--politic_3a22015ec0ae40854a010735f76ab3d1__1540862523.html","title":"Melania Trump defends husband's lewd comments about women as...","title_page":"Melania Trump defends husband's lewd comments about women as...","title_rss":"NULL","source_domain":"ajc.com","text":"Days after a 2005 recording of Donald Trump making lewd comments about women surfaced, his wife defended him and characterized the comments as \"boy talk,\" in her first interviews since the presidential nominee faced allegations of sexual misconduct.\n>> Read more trending stories\nMelania Trump sat down for interviews with CNN's Anderson Cooper and Fox News' Ainsley Earhardt this week. She addressed the 2005 \"Access Hollywood\" video published by The Washington Post Oct. 7 in which her husband can be heard speaking in a vulgar manner about women with the show's co-host, Billy Bush.\nSpeaking with Cooper, Melania Trump said her husband was egged on \"to say dirty and bad stuff.\"\nThe comments, she said, were typical of \"boys -- the way they talk when they grow up and they want to sometimes show each other, oh, this and that, and talking about girls.\"\n>> Related: Donald Trump sexual assault allegations: 5 things to know\nIn the 2005 audio, caught on a hot microphone, Donald Trump can be heard talking about kissing and touching women without their consent. Donald Trump has denied his comments describe sexual assault.\n\"I better use some Tic Tacs in case I start kissing her,\" he says in the recording, after spotting \"Days of Our Lives\" actresses Arianne Zucker. \"You know, I'm automatically attracted to beautiful women – I just start kissing them, it's like a magnet. Just kiss. I don't even wait. And when you're a star, they let you do it. You can do anything … grab them by the (expletive). You can do anything.\"\nMelania Trump told Earhardt her husband's words were offensive and inappropriate, but insisted they did not reflect Donald Trump's view of women.\n>> Related: Melania Trump sits for first interviews since husband accused of sexual misconduct\n\"My husband is kind. He's a gentleman. He cares about people. He cares about women,\" she said. \"We heard him on the tapes. He was pushed on.\"\nShe also defended her husband's comments to Howard Stern over the years in reference to a slew of recordings unearthed and republished by CNN this month.\n\"They hook him on,\" she told Earhardt. \"They try to get from him some inappropriate and dirty language.\"\n>> Related: Trump slams groping allegations as false, politically motivated\nSince the 2005 video surfaced, multiple women have come forward with claims of sexual assault against Donald Trump. The GOP nominee has denied any wrongdoing and characterized the reports as politically motivated attacks.\nHe promised to provide evidence of his innocence \"at an appropriate time.\"","url":"https://www.ajc.com/news/national-govt--politics/melania-trump-defends-husband-lewd-comments-about-women-boy-talk/vT5uODJzZLBUnHj3klTGnN/"}
