{"authors":["Madhuri Sathish"],"date_download":"2018-10-31 01:40:17","date_modify":"2018-10-31 01:40:17","date_publish":"2018-09-06 17:34:08","description":"An anonymous op-ed published in The New York Times prompted swift backlash from White House officials, including the president himself. The op-ed, which detailed the writer's \"resistance\" within the Trump administration, was reportedly written an…","filename":"data/vaneerConsumption/MelaniaTrumpRespondsToTheAnonymousNewYorkTimesOpEdWithABluntStatement.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/cc246142-a5e3-46c3-8a10-bcb4a6c269bc-getty-1019985922.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_melania-trump-responds-to-the-anonymous-new-york-times-op-ed-with-a-blunt-statement-11777735_1540950017.html","title":"Melania Trump Responds To The Anonymous 'New York Times' Op-Ed With A Blunt Statement","title_page":"Melania Trump Responds To The Anonymous 'New York Times' Op-Ed With A Blunt Statement","title_rss":"NULL","source_domain":"bustle.com","text":"An anonymous op-ed published in The New York Times prompted swift backlash from White House officials, including the president himself. The op-ed, which detailed the writer's \"resistance\" within the Trump administration, was reportedly written an administration official who was granted anonymity by the Times in case it jeopardized their job. The decision to grant the writer anonymity was not popular in the White House, however, and Melania Trump slammed the anonymous New York Times op-ed for \"sabotaging\" the United States.\nIn a statement issued on Thursday by her spokeswoman, Stephanie Grisham, the first lady criticized the Times for relying on an anonymous source to make an argument:\nUnidentified sources have become the majority of the voices people hear about in today's news. People with no names are writing our nation's history. Words are important, and accusations can lead to severe consequences. If a person is bold enough to accuse people of negative actions, they have a responsibility to publicly stand by their words and people have the right to be able to defend themselves.\nBustle has reached out to Grisham for further comment. In her statement, Melania also had a message for the anonymous official who penned the op-ed, in which they argued that the president's \"erratic behavior\" and \"amorality\" were \"detrimental to the health of our republic.\"\n\"To the writer of the op-ed — you are not protecting this country, you are sabotaging it with your cowardly actions,\" Melania stated.\nWhen the op-ed was first published on Wednesday, the Times indicated that it rarely publishes anonymous op-eds. However, the paper decided to make an exception in this case — knowing the identity of the author — because \"we believe publishing this essay anonymously is the only way to deliver an important perspective to our readers.\"\nIn Melania's view, however, this explanation was not sufficient. She typically does not respond to media coverage of the Trump administration, according to USA Today, but Grisham said she chose to issue the statement following a request for comment from CNN. In the statement, Melania suggested that the Times had been irresponsible to publish the op-ed.\n\"Freedom of speech is an important pillar of our nation's founding principles and a free press is important to our democracy,\" her statement read. \"The press should be fair, unbiased and responsible.\"\nMelania's statement echoed that of her husband, who dismissed the op-ed as \"gutless\" and called on the \"failing New York Times\" to reveal the writer's identity to the Trump administration for \"national security purposes.\" The president also suggested that the senior administration official who penned the op-ed didn't really exist, and that the Times was using \"another phony source.\"\nAfter the op-ed was published, a number of senior administration officials rushed to deny writing it, USA Today reported. Among them were Mike Pence, Homeland Security Secretary Kirstjen Nielsen, Defense Secretary James Mattis, and White House press secretary Sarah Huckabee Sanders. Sanders went one step further in a statement issued on Wednesday, in which she attacked the Times and called on the op-ed author to resign.\n\"We are disappointed, but not surprised, that the paper chose to publish this pathetic, reckless, and selfish op-ed,\" Sanders said.","url":"https://www.bustle.com/p/melania-trump-responds-to-the-anonymous-new-york-times-op-ed-with-a-blunt-statement-11777735"}
