{"authors":["The Associated Press"],"date_download":"2018-10-30 18:01:34","date_modify":"2018-10-30 18:01:34","date_publish":"2018-06-21 00:00:00","description":"WASHINGTON — Melania Trump went to Texas to show she cared about migrant children. Her fashion choice carried a baffling counter-message.","filename":"data/vaneerConsumption/MelaniaTrumpdonsIreallydontcaredoujacket.json","image_url":"https://media.arkansasonline.com/img/photos/2018/06/21/AP18172775929822_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_jun_21__1540922494.html","title":"Melania Trump dons 'I really don't care, do u?' jacket","title_page":"Melania Trump dons 'I really don't care, do u?' jacket","title_rss":"NULL","source_domain":"arkansasonline.com","text":"First lady Melania Trump arrives at Andrews Air Force Base, Md., on Thursday, June 21, 2018, after visiting the Upbring New Hope Children Center run by the Lutheran Social Services of the South in McAllen, Texas.\nWASHINGTON — Melania Trump went to Texas to show she cared about migrant children. Her fashion choice carried a baffling counter-message.\nThe first lady wore a green, hooded military jacket from Zara that read \"I really don't care, do u?\" both as she departed and returned to Washington. The words were printed in white, in graffiti-style, on the jacket's back.\nWhen asked what message the first lady's jacket intended to send, spokeswoman Stephanie Grisham said: \"It's a jacket. There was no hidden message. After today's important visit to Texas, I hope the media isn't going to choose to focus on her wardrobe. \"\nGrisham underscored that message in a tweet with the hashtags #SheCares and #ItsJustAJacket.\nBut President Donald Trump offered his own interpretation in a tweet, saying it \"refers to the Fake News Media. Melania has learned how dishonest they are, and she truly no longer cares!\"\nMrs. Trump changed into a pale yellow jacket before the plane landed in McAllen, Texas, for a visit to the Upbring New Hope Children's Center, which houses 55 migrant children. But even after questions arose about her attire, Mrs. Trump was back in the green jacket when she returned to Washington in 80-degree weather.\nLike it or not, Mrs. Trump's jacket had her trending on Twitter. One user borrowed an image of the back of the jacket to promote groups working on behalf of immigrant children.\nZara, a Spanish-based company with a large presence in the United States and around the world, had no comment. The jacket belongs to the company's spring-summer 2016 season.\nRead Friday's Arkansas Democrat-Gazette for full details.","url":"https://www.arkansasonline.com/news/2018/jun/21/melania-trump-dons-i-really-dont-care-do-u-jacket/"}
