{"authors":["Tom Flanagan For Daily Mail Australia"],"date_download":"2018-10-22 23:25:00","date_modify":"2018-10-22 23:25:00","date_publish":"2017-03-16 06:33:17","description":"A 71 year old man has been stabbed in the head with a pitchfork by three intruders in his South Melbourne home. The men left with nothing following the pensioners heroic resistance.","filename":"data/vaneerConsumption/Melbournemanattackedbypitchforkinhisownhome.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E51E10A00000578-0-image-a-15_1489643892202.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318938_three-men-melbourne-home-intrusion-pitchfork-attack_1540250700.html","title":"Melbourne man attacked by pitchfork in his own home","title_page":"Melbourne man attacked by pitchfork in his own home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An elderly man has been stabbed in the head with a pitchfork as he fought off three armed intruders in his Cranbourne North home.\nIt is understood that three men entered Rick Maaskant's home in South Melbourne around 11.20pm on Wednesday evening before he confronted the intruders.\nHe was then stabbed above his left eye with what is thought to be a pitchfork as the men fled the property, according to 9 News.\nGrandfather Rick Maaskant was attacked with a pitchfork by three men who invaded his home\nMr Maaskant's home where three armed men entered around 11.20pm\nPolice at the scene of the crime where three men fled the home of pensioner of Rick Maaskant, after attacking him with a pitchfork\nThe intruders, who are thought to have left with nothing, are described by police as caucasian, in their early twenties, and wearing dark-coloured clothing.\nNeighbour Mary Arul Ganesh said she heard the men outside the property before they entered Mr Maaskant's home.\n'We were watching people walking around on our [CCTV] camera, it's really scary' she said.\nThis latest incident has contributed to a growing number of crimes in Victoria, which has increased by more than 10% compared to last years figures according to the Crime Statistics Agency.\nMr Maarskant was taken to hospital with his injuries not deemed as life threatening.\nAnyone with any information on the three men is urged to call Crimestoppers 1800 333 000.","url":"https://www.dailymail.co.uk/news/article-4318938/three-men-melbourne-home-intrusion-pitchfork-attack.html"}
