{"authors":["Mailonline Reporter"],"date_download":"2018-10-23 00:38:56","date_modify":"2018-10-23 00:38:56","date_publish":"2017-04-26 10:27:33","description":"Lorraine Gilles was putting the drama behind her to step out with her husband Michael Bleau, taking their dog for a walk in Los Angeles on Tuesday.","filename":"data/vaneerConsumption/MelBsexnannyLorraineGillesstepsoutwithhusband.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9DB18F00000578-0-image-a-14_1493198846344.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446964_Mel-B-s-ex-nanny-Lorraine-Gilles-steps-husband_1540255136.html","title":"Mel B's ex nanny Lorraine Gilles steps out with husband","title_page":"Mel B's ex nanny Lorraine Gilles steps out with husband | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been in caught in the midst of Mel B and Stephen Belafonte's explosive divorce battle.\nAnd Lorraine Gilles was putting the drama behind her to step out with her husband Michael Bleau, taking their dog for a walk in Los Angeles on Tuesday.\nThe German born beauty sported a casual off-the-shoulder white top and grey leggings for her outing, going make-up free.\nScroll down for video\nMoving on: Lorraine Gilles was putting the drama behind her to step out with her husband Michael Bleau, taking their dog for a walk in Los Angeles on Tuesday\nLorraine went hand in hand with her events manager husband Michael, 32, putting on a display of solidarity.\nThe ex-nanny has been keeping a dignified silence in the midst of the ongoing divorce drama.\nSpice Girl Mel B instigated a seven-year sexual relationship with her children’s nanny when the woman was a ‘naive and a curious 18-year-old’, according to a new lawsuit.\nCourt battle: The ex-nanny has been keeping a dignified silence in the midst of the ongoing divorce drama with Mel B and Stephen Belafonte\nUnited front: Lorraine went hand in hand with her events manager husband Michael, 32, putting on a display of solidarity\nLorraine, now 26, claims that she had sex with Melanie Brown and threesomes with the star and her husband Stephen in the latest twist to the couple’s bitter divorce battle.\nThe nanny claims Mel B was her primary lover and her only encounters with Belafonte were when the singer invited him into bed for threesomes.\nMiss Gilles, a foreign exchange student when she met the couple in an LA restaurant in 2009, alleges Mel B would serve as ‘camera man’ and record the sexual encounters.\nDay out: The ex-nanny was brushing aside the legal battle to spend some quality time with her husband\nMel B and Belafonte’s divorce battle began last month when the singer claimed her husband had assaulted her at least three times during their marriage.\nThe lawsuit by Miss Gilles is a response to earlier claims made by Mel B in court documents.\nThe singer originally alleged that Belafonte hired Miss Gilles as their nanny in 2010, and was ‘paying her inordinate amounts of money’ after their relationship became sexual.\nLawsuit: Lorraine claims that she had sex with Melanie Brown and threesomes with the star and her husband, Stephen Belafonte, in the latest twist to the couple’s bitter divorce battle\nBrown, 41, claimed that her husband paid Miss Gilles ‘in excess of $300,000 (£234,000) for alleged nanny services’ over three years, and in 2014 Belafonte got their nanny pregnant before using Mel B’s money to pay for an abortion.\nMel B, who is reportedly worth £50million, won a restraining order against Miss Gilles earlier this month, claiming the nanny had copies of their sex tapes.\nIn her response to these claims, Miss Gilles says she was wrongly branded a ‘homewrecker, prostitute and extortionist’.\nShe also provides what she claims is a true account of her relationship with Mel B and Belafonte from when they first met. She claims the Spice Girl ‘seduced a naive and a curious 18-year-old foreign exchange student… with alcohol, fame, and casual sex’.\nTHREESOMES: Mel B, far right, with Belafonte and Miss Gilles\nMiss Gilles, who was fired in September 2016, admits having ‘consensual group sex’ with the couple within days of their meeting. But she insists she and Mel B soon ‘developed a friendship and sexual relationship’, according to the court papers.\nMiss Gilles, who now lives with her events manager husband Michael Bleau, 32, in Los Angeles, arrived in the US from Germany in 2007. She admits having an abortion but claims it was the result of a one-night stand, and that Mel B helped arrange the procedure.\nShe is suing for libel, invasion of privacy and intentional infliction of emotional distress, and is seeking unspecified damages.\nLawyers for Mel B and Belafonte did not respond to requests for comment.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446964/Mel-B-s-ex-nanny-Lorraine-Gilles-steps-husband.html"}
