{"authors":["Sinead Maclaughlin For Daily Mail Australia"],"date_download":"2018-10-22 23:19:27","date_modify":"2018-10-22 23:19:27","date_publish":"2017-03-16 06:14:07","description":"One person has been killed and another has been left with serious head injuries in a horror crash between five cars and a truck on Melbourne's Princes Freeway.","filename":"data/vaneerConsumption/MelbournesPrincesFreewaycrashkills1.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/06/3E522E0F00000578-0-image-a-36_1489644819105.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318930_One-dead-horror-crash-Melbourne-s-Princes-Freeway_1540250367.html","title":"Melbourne's Princes Freeway crash kills 1","title_page":"Melbourne's Princes Freeway crash kills 1 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A horror crash between five cars and a truck has killed one person and left another seriously injured.\nThe crash occurred about 2.45pm on Thursday, at Princes Freeway at Point Cook in Melbourne's west.\nA woman in her 30s, who was in the same car, was trapped for some time and has been flown to the Royal Melbourne Hospital with head injuries in a serious condition, Victoria Ambulance told Daily Mail Australia.\nA horror crash between in Melbourne five cars and a truck has killed one person and left another seriously injured\nA passenger was left trapped in the wreckage in the collision at Princes Freeway at Point Cook in Melbourne's west\nIt's understood 13 other people were assessed by paramedics, but did not require further treatment.\nIt's believed the person killed in the crash was a driver of one of the cars, according to Victoria police, they have yet to be formally identified.\nThe passenger from the same vehicle was left trapped in the wreckage and is believed to have sustained life-threatening injuries.\nThe exact circumstances surrounding the crash are yet to be determined and the investigation is ongoing.\nThe freeway is currently closed and diversions are in place, but extensive delays are expected.\nMotorists are advised to exit at Point Cook Road and use Sneydes Road if they want to get back in Princess Highway.\nA woman in her 30s has been flown to the Royal Melbourne Hospital with head injuries","url":"https://www.dailymail.co.uk/news/article-4318930/One-dead-horror-crash-Melbourne-s-Princes-Freeway.html"}
