{"authors":["Mike Larkin For Dailymail.Com"],"date_download":"2018-10-22 21:33:22","date_modify":"2018-10-22 21:33:22","date_publish":"2017-04-26 02:00:11","description":"The 41-year-old held hands with her America's Got Talent co-hosts in a new Instagram clip shared by Klum.","filename":"data/vaneerConsumption/MelBsfriendsHeidiKlumandTyraBanksshowsupport.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/00/3F9B3A8B00000578-0-image-a-12_1493163597450.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4445710_Mel-B-s-Heidi-Klum-Tyra-Banks-rally-sordid-marriage-split_1540244002.html","title":"Mel B’s friends Heidi Klum and Tyra Banks show support","title_page":"Mel B’s friends Heidi Klum and Tyra Banks show support | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She used to sing that if you want to be her lover, you 'gotta get with' her friends.\nAnd Spice Girl Mel B served up a healthy slice of girl power when she defiantly walked with sidekicks Heidi Klum and Tyra Banks amid the sordid claims swirling around following the breakup of her marriage.\nThe video was posted amid lurid tales surfacing of the singer indulging in a string of steamy sex sessions with blonde German nanny Lorraine Gilles, including threesomes with her estranged husband Stephen Belafonte.\nScroll down for video\nWannabes: Spice Girl Mel B held hands with America's Got Talent chums Heidi Klum and Tyra Banks on Instagram on Tuesday\nScary Spice, 41, was working it for all she was worth as she swung her hips while showcasing her figure in a red sparkling dress and strappy high heels.\nShe was holding hands wither her sidekicks as they walked, and German model Heidi, who posted the clip on her Instagram page, looked particularly stunning in a clinging black dress.\nMel was back to grinding, as the trio were getting to work on yet another season of hit show America's Got Talent, with Tyra replacing Nick Cannon as the show's host.\nThis was despite her estranged husband Stephen Belafonte just regaining visitation rights to their daughter Madison - but will only be allowed to see her with heavy supervision.\nSaucy Spice: The embattled popstrel could not resist giving a knowing look to the camera\nHer new favourite German: Mel was grinning as she clasped onto Heidi's hand\nSpicy girl: Mel seemed in high spirits despite the sordid claims swirling around her private life\nA judge ruled that the 41-year-old producer can see their five-year-old girl, but only in the confines of a counselling center with a court monitor present, on Monday.\nHis wife skipped the hearing in LA. She had obtaining a restraining order against him last month, and claimed he was 'dangerous' due to his connections with criminals and the porn industry.\nMel's defiant walk also follows claims she had been left disgruntled by the fact her 'three-way' relationship with Stephen and saucy German nanny Lorraine Gilles became a 'two-way' during their seven year tryst.\nIn a Snapchat video posted by the ladies' America's Got Talent co-star DJ Khaled, Mel was seen in high spirits backstage prepping to shoot the latest episode.\nBack to work: In a Snapchat video posted by the ladies' America's Got Talent co-star DJ Khaled, Mel was seen in high spirits backstage prepping to shoot the latest episode\nSexy: In the video, she was spotted in the green room wearing a sexy minidress with orange, beige and blue vertical colour blocks running down it\nAll smiles: The Spice Girl looked in great spirits as she prepped backstage and laughed and joked with Heidi, DJ Khaled and Simon Cowell\nIn the video, she was spotted in the green room wearing a sexy minidress with orange, beige and blue vertical colour blocks running down it.\nThe Spice Girl looked in great spirits as she prepped backstage and laughed and joked with Heidi, DJ Khaled and Simon Cowell.\nMarried to Stephen for 10 years until recently filing for divorce, the mother-of-three claims their ex-nanny would regularly have sex with her husband, sometimes without her knowledge.\nJoining in: Mel was her usual bubbly self as she bantered with her co-stars\nBackstage pass: The video gave fans a glimpse into life backstage at America's Got Talent\nBetter times: Mel giving her former nanny and lover Lorraine Gilles a peck on the cheek\nSources close to the former Spice Girl tell TMZ that Lorraine 'crossed a line' with Stephen, as the singer stands by claims she made in the divorce papers this month.\nBelafonte hired the 26-year-old and then convinced both her and Mel B to have three-ways, which they did over a period of 7 years,' the website reports.\nThis is in agreement with a dispute that the nanny has taken up in a brand new defamation case, made against Mel.\nNevertheless, the disgruntled warbler insists 'the deal was broken several years ago' when the duo had sex without her.\nMel's ex has a stunning swimsuit figure despite choosing to pursue a career as a nanny\nHappier times: The Spice Girls star with her threesome partner on a boat in Ibiza last year\nOut and about: Lorraine was seen on Tuesday with her husband Michael Bleau and their dog, Django, at a dog park in LA\nLeaving the past behind: The former nanny appears to be moving on with her life\nMoving forward: The couple have been seen going about their business before, having first been spotted out together on April 7\nWhile the three-ways continued - with other people as well as the nanny - so did secret trysts between Lorraine and Stephen without Mel knowing, sources close to Mel say.\nNevertheless, the nanny claims that Mel B was her primary lover and her only encounters with Belafonte were when the singer invited him into bed for threesomes.\nLorraine, a foreign exchange student when she met the couple in an LA restaurant in 2009, alleges Mel B would serve as 'camera man' and record the sexual encounters.\nMore happier times: Mel with her other threesome partner Stephen Belafonte, who she is now divorcing, in 2014","url":"https://www.dailymail.co.uk/tvshowbiz/article-4445710/Mel-B-s-Heidi-Klum-Tyra-Banks-rally-sordid-marriage-split.html"}
