{"authors":["Matt Ogilvie For Daily Mail Australia"],"date_download":"2018-10-22 22:24:55","date_modify":"2018-10-22 22:24:55","date_publish":"2016-01-11 03:07:02","description":"Fifty firefighters are scrambling to contain an aggressive blaze at a Melbourne truck tyre recycling yard.","filename":"data/vaneerConsumption/Melbournesskycoveredintoxicsmokeasfirefightersbattleatyrefire.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/03/3004566000000578-0-image-a-2_1452481894155.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393270_Toxic-smoke-billows-Melbourne-s-sky-firefighters-battle-tyre-fire_1540247095.html","title":"Melbourne's sky covered in toxic smoke as firefighters battle a tyre fire","title_page":"Melbourne's sky covered in toxic smoke as firefighters battle a tyre fire | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fifty firefighters are scrambling to contain an aggressive blaze in Melbourne as thousands of used tyres go up in smoke.\nThe fire started at a recycling plant in Maygar Blvd, Broadmeadows, just before 9am, when a large stock of truck tyres caught alight. Thick clouds of black smoke can be seen from across the city.\nA Metropolitan Fire Brigade (MFB) spokesman described the smoke as toxic and warned people who live in an easterly direction to the fire to take care.\nScroll down for video\nThe blaze started at a recycling plant in Melbourne's north just before 9am, when a large stock of truck tyres caught alight\nUp in smoke: Fifty firefighters try to contain the aggressive blaze in Melbourne\nToxic warning: 'Turn off air conditioners, close your windows and if you're feeling any affects from this fire, call 000,' said an emergency fire services spokesman\nTyre Fire: Thick clouds of black smog from the blaze have been sighted across the city\n'If you are indoors turn off your air conditioners, close your windows and if you're feeling any affects from this fire call nurse on call,' he said.\n'We will get a better handle on the situation in the next 30-45 minutes when we can start applying a heavy blanket of foam.'\nThe suburbs of Meadow Heights, Jacana, Glenroy, Fawkner, Dallas, Coolaroo, Campbellfield and Broadmeadows could be affected.\nThick clouds of black smog from the blaze have been sighted across the city, with one photo taken from inside a Qantas jet which is flying around the smoke.\nThe MFB said they expect the fire to burn for several more hours.\nClouds of smoke: The MFB said they expect the fire to burn for several more hours","url":"https://www.dailymail.co.uk/news/article-3393270/Toxic-smoke-billows-Melbourne-s-sky-firefighters-battle-tyre-fire.html"}
