{"authors":["Daily Mail Australia Reporter"],"date_download":"2018-10-23 02:07:28","date_modify":"2018-10-23 02:07:28","date_publish":"2017-03-16 12:32:55","description":"Mel Greig has thanked The Project's Carrie Bickmore for cancelling her 2012 interview about the Royal Prank scandal.","filename":"data/vaneerConsumption/MelGreigtalksaboutthe2012RoyalPrankscandal.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E54161200000578-0-image-a-46_1489667476735.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4320052_Mel-Greig-thanks-Carrie-Bickmore-concern_1540260448.html","title":"Mel Greig talks about the 2012 Royal Prank scandal","title_page":"Mel Greig talks about the 2012 Royal Prank scandal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mel Greig has publicly thanked The Project's Carrie Bickmore for cancelling her 2012 interview about the Royal Prank incident because of her concern for the former 2Day FM star's mental health.\nDuring an appearance on the Channel Ten show on Thursday, the 34-year-old expressed her gratitude to Logie-winner Carrie, while also speaking about her Troll Free Day campaign and online bullying.\nThe Project had been granted a sit-down interview with Mel after the scandal in December 2012, but it was cancelled on compassionate grounds, with a producer claiming the presenters were 'not comfortable' because she was 'too upset'.\nScroll down for video\n'Thank you': Mel Greig (pictured) has publicly thanked The Project's Carrie Bickmore for cancelling her 2012 interview about the Royal Prank incident because of her concern for the former 2Day FM star's mental health\n'I have to say Carrie, thank you to you,' began Mel in an emotional speech.\n'A couple of days after the prank call, The Project were offered an interview and you turned it down because you were worried about my mental health when not many people were.\n'I was broken, I was absolutely broken and shouldn't have been doing interviews. I shouldn't have been out of bed.'\nCarrie responded: 'We could see you were struggling. I was concerned for your mental health.\n'I was concerned for your mental health': The Project had been granted a sit-down interview with Mel after the scandal in December 2012, but it was cancelled on compassionate grounds, with a producer claiming the presenters were 'not comfortable' because she was 'too upset'\n'It's hard, the public persona, what you see across the media is not what's going home behind closed doors.'\nCarrie concluded: 'It's great to see you are back to feeling happy and confident and able to talk about it.'\nMel then spoke about her dramatic confrontation with an online troll who wished death upon her own mother over Twitter.\n'It's great to see you are back to feeling happy and confident and able to talk about it': Carrie was pleased to see Mel speaking about her experience with online trolls\n'He was quite shocked by the end of that, to realise that I was in fact a human being': Mel also spoke about confronting an online bully who wished death upon her mother\nThe emotional radio host said: 'One tweet said, \"Eye for an eye. I am going to kill you and then I'm going to kill your mum\". That made me think that's not an opinion, that's abuse. That's the difference with trolling.'\nShe then played an audio clip of herself confronting an internet troll.\n'He was quite shocked by the end of that, to realise that I was in fact a human being,' Mel said.\n'Through the whole Royal prank people forgot that I was human, too. I was going through a deep depression': Mel spoke candidly about the Royal Prank scandal that changed her life\nFlashback: Mel was in an emotional state after the infamous Royal Prank but still took part in several TV interviews, including A Current Affair (pictured), but The Project did not take part\n'In fact, through the whole Royal prank people forgot that I was human, too. I was going through a deep depression.'\nIn December 2012, Mel and fellow 2Day FM co-host Michael Christian posed as the Queen and Prince Charles as part of a prank to gain information about the Duchess of Cambridge during her stay at The Lindo Wing of St Mary's Hospital in Paddington, before the birth of Prince George.\nJacintha Saldana was the nurse who took the call at King Edward Hospital in London, taking her life two days later and mentioning the Australian radio hosts in a note she left behind.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4320052/Mel-Greig-thanks-Carrie-Bickmore-concern.html"}
