{"authors":["Cindy Tran","Rachel Eddie","Matt Ogilvie","Jenny Awford For Daily Mail Australia"],"date_download":"2018-10-23 02:25:18","date_modify":"2018-10-23 02:25:18","date_publish":"2016-01-11 14:40:06","description":"Melissa Anne Abdoo, 36, the duty manager of The Buffs Club in Mount Isa in Queensland's far north-west, was allegedly attacked by electrician Boy Allan Page, 28, on Saturday morning.","filename":"data/vaneerConsumption/MelissaAbdoowaspunchedintheheadbyaccusedBoyAllanPage.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300AD62000000578-0-image-a-4_1452522065321.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394022_Melissa-Abdoo-punched-head-accused-Boy-Allan-Page_1540261518.html","title":"Melissa Abdoo was punched in the head by accused Boy Allan Page","title_page":"Melissa Abdoo was punched in the head by accused Boy Allan Page | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ms Abdoo is now in a stable condition after the alleged 'coward punch'\nShe was rushed to Townsville Hospital early hours of Saturday morning\nThe Buffs Club manager had allegedy denied him entry to venue\nPage is accused of going to strike Ms Abdoo, whose head hit concrete\nHe is charged with grievous bodily harm on Melissa Anne Abdoo, 36\nMelissa Anne Abdoo (pictured) was allegedly attacked outside her work on Saturday morning\nThe partner of a mother-of-two, who was knocked to the ground in an alleged one-punch assault, has slammed a court decision after her accused attacker was granted bail.\nMelissa Anne Abdoo, 36, the duty manager of The Buffs Club in Mount Isa in Queensland's far north-west, was allegedly attacked by electrician Boy Allan Page, 28, in the early hours of Saturday morning.\nThe Parkside man appeared in the Mount Isa Magistrates Court on Monday charged with causing grievous bodily harm.\nMagistrate Stephen Guttridge released Page on bail on the condition he must not contact the alleged victim, attend licensed premises or drink alcohol.\nHowever, the victim's partner Jason Weckert has spoken out about his disappointment over the decision for Page to be released on conditional bail.\n'I'm sick in the gut, for them not to pull through and do what they said — it's one punch — that's what it should be classed as, it is just cowardly,' he told Nine News.\n'They're not doing the law, this ain't the law.'\nMr Weckert and their two children have been by her bedside, as she remains in a stable condition in Townsville Hospital.\nThe incident comes after Ms Abdoo was allegedly attacked when she refused to let Page into the pub because he appeared too drunk.\nHis alleged punched missed Ms Abdoo, police said, but the momentum flung his weight into the 36-year-old woman, causing her to fall and hit her head on concrete.\nScroll down for video\nBoy Allan Page (pictured) has been released on conditional bail after he allegedly attacked the mother-of-two\nMs Abdoo had been fighting for her life with critical conditions, but has improved and is now stable after the incident just after midnight on Saturday morning\nCCTV footage had emerged from outside the club, showing the moment Ms Abdoo was allegedly punched in the head over the weekend.\nThe video shows Ms Abdoo standing outside the club before she is approached by a man in a black t-shirt.\nThe man appears to have a conversation with the 36-year-old mother-of-two before he unexpectedly lunges forward, throwing a right-handed punch with such force that she falls to the ground.\nThe man then sprints away from the bar and is chased by two of the club's security guards.\nIt is believed Ms Abdoo had been called to the front of the pub after security refused the 28-year-old man, alleged to be Mr Page, entry for being too drunk.\nBoy Allen Page (centre), 28, has been granted bail at Mount Isa Magistrates Court on Monday on charges of grievous bodily harm. He had allegedly gone to strike mother-of-two Melissa Abdoo, 36, after the Buffs Club manager denied him entry in the early hours of Saturday morning\nBoy Allan Page, 28, had allegedly tried to punch the 36-year-old mother-of-two. He reportedly fled the scene (pictured running) but was caught by police within an hour. He was granted bail on Monday\nPolice allege that she was talking to the man's wife when he delivered the 'one-strike' attack.\n'The male person has struck her from behind to her face and chest which resulted in her head making contact with the ground,' the Queensland Police spokesman said.\nMs Abdoo, who has worked at the venue for more than a year, was rushed to hospital and placed in intensive care.\nDoctors believed there may be bleeding on her brain, however her condition has improved.\nShe was flown to Townsville Hospital in a stable condition on Saturday afternoon for further treatment.\nShe had been called to the front of pub after security refused a 28-year-old man entry for being too drunk\n'The male person has struck her from behind to her face and chest which resulted in her head making contact with ground,' a Queensland Police Service spokesman said\nMount Isa Police Sergeant Ross Kirkpatrick told the Brisbane Times: 'The gentleman was refused entry and she started a bit of a standoff where they've argued the point.\n'What will be alleged is he's then struck out at the manager with a single blow and that's knocked her to the ground and caused the head injury.'\nMr Page was arrested within an hour after he'd allegedly fled the scene.\nThe executive manager at Buffs Club, Karen Graham, said the mother-of-two's family was 'absolutely livid'.\n'It's been a long night. We're such a family oriented staff that we all band together and we'll give her all our support,' she said,\n'I guess we all feel a little hopeless at the moment, sitting and waiting and praying.'\nThe incident comes in the wake of public outrage over a one-punch attack in Brisbane's Fortitude Valley earlier this month that claimed the life of 18-year-old Cole Miller.\nIn a statement posted to their Facebook page on Sunday, Buffs Club said the man was a local member and patron of the venue.\n'Puffs Club Mount Isa wishes to advise that this or any cat of violence will not be tolerated.'\nThe statement said 'no further precautionary measures could have been taken to avoid this cowardly attack'.\nThe community came out to a rally in Brisbane's CBD to pay tribute to the promising water polo player later on Monday.\nMrs Abdoo was flown to Townsville Hospital in a stable condition on Saturday afternoon for further treatment\nMs Abdoo, who was originally left with life-threatening head injuries, has improved and is in a stable condition in Townsville Hospital (emergency services pictured at scene)\nA 28-year-old man, from Parkside, has been charged with grievous bodily harm following the attack at The Buffs Club in Mount Isa. He was released on bail on Monday","url":"https://www.dailymail.co.uk/news/article-3394022/Melissa-Abdoo-punched-head-accused-Boy-Allan-Page.html"}
