{"authors":["Kristy Johnson For Daily Mail Australia"],"date_download":"2018-10-23 04:24:08","date_modify":"2018-10-23 04:24:08","date_publish":"2017-03-10 14:41:51","description":"A lawyer for Melissa George, 40, claimed to News Corp, in a story published on Friday, that an altercation with her former lover, Jean-David Blanc, has put her acting career on hold.","filename":"data/vaneerConsumption/MelissaGeorgescareerreportedlyatacompromise.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E22FFD400000578-0-image-a-100_1489153839816.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301262_Melissa-George-s-career-reportedly-compromise_1540268648.html","title":"Melissa George's career reportedly at a compromise","title_page":"Melissa George's career reportedly at a compromise | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's kept a relatively low profile since an alleged domestic violence incident with French entrepreneur Jean-David Blanc, in September.\nAnd now Melissa George's lawyer, Christophe Ayela, has told News Corp, that her former lover's refusal to allow their two sons, Raphael, three, and Solal, one, to leave France, has prevented the actress from securing work.\n'It's terrible for her career, disastrous,' the 40-year-old's representative said, in relation to a Family Court order in France, that requires a written consent by the father.\n'It's terrible for her career, disastrous': Melissa George's lawyer, told News Corp, in a story published on Friday, that the 40-year-old actress can't get work, as ex Jean-David Blanc has refused to allow their two sons to leave France\n'The two children are forbidden to leave the country without the written consent of the father. And of course he refuses to allow this,' Christophe told News Corp, in direct relation to France's Family Court order.\n'It is scandalous that Australian kids (the children have triple nationalities - French, Australian and American) can't even go to visit their relatives in Australia.\nWith Melissa often required to film projects abroad, her lawyer stated that the joint parental control order, makes it near impossible for her to work.\n'How can she be back to France every second week if she works abroad? It's a ridiculous decision,' he continued.\nRepresentative: 'The two children are forbidden to leave the country without the written consent of the father. And of course he refuses to allow this,' lawyer Christophe Ayela told News Corp, in direct relation to France's Family Court order. Pictured with Jean-David Blanc\nDaily Mail Australia has reached out to Jean-David Blanc for comment.\nAnd it appears Jean-David Blanc, a very wealthy businessman who designed video games for Apple at only 13 years of age, is happy to put in a fight.\nJean-David reportedly accused Melissa of trying to flee France with their two sons on a private jet, just days after the alleged altercation in September, last year.\nHowever, in a statement to The Daily Telegraph from her lawyer, Christophe claimed that Melissa was unaware of any travel ban preventing children from leaving.\nConflict: And it appears Jean-David Blanc, a very wealthy businessman who designed video games for Apple at only 13 years of age, is happy to put in a fight. Jean-David reportedly accused Melissa of trying to flee France with their two sons on a private jet, just days after the alleged altercation in September, last year\n'Melissa George did not know there was a travel ban concerning the children.\n'She had the plane booked well before the September flight and we can prove it,' he continued.\nIn September, Melissa was admitted to Cochin Hospital after turning up to a local police station with bruises to her face and complaints of pain.\nThe Perth-born star was allegedly assaulted by her partner of four years - allegations Jean-David Blanc denies, according to a report in French newspaper Le Parisien.\nAlleged altercation: In September, Melissa was admitted to Cochin Hospital after turning up to a local police station with bruises to her face and complaints of pain\nThe pair were seen separately outside a Parisian court back in October, where Jean-David Blanc appeared on charges of domestic assault against her. He denied the charges.\nThe couple first met in 2011 at a BAFTA after-party and welcomed their first son Raphael in February 2014 and their second son Solal in November, 2015.\nJean-David is a businessman, writer and film producer, famed for founding cinema service organisation AlloCiné.\nWhen announcing Solal's birth on social media, Melissa publicly gushed over her longtime de facto.\nIn happier times: The couple first met in 2011 at a BAFTA after-party and welcomed their first son Raphael in February 2014 and their second son Solal in November, 2015\n'Thank you to my love, Jean-David, for giving me the best gift in my life. I love you,' she wrote at the time.\nMelissa was previously married to Chilean film director Claudio Dabed.\nThe actress rose to fame after appearing as Angel Parrish in Channel Seven soap Home And Away.\nRelocating overseas, she found work on the small screen in Friends, Grey's Anatomy and The Good Wife.\nMelissa has also featured in films, notably Mulholland Drive, Derailed, and The Betrayed.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301262/Melissa-George-s-career-reportedly-compromise.html"}
