{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-22 21:54:32","date_modify":"2018-10-22 21:54:32","date_publish":"2016-01-28 09:17:18","description":"University of Missouri assistant professor Melissa Click, 45, 'sicced' muscle on two student reporters covering a protest in November on how the college handled a racist incidents last fall.","filename":"data/vaneerConsumption/MelissaClickchargedoversiccingmuscleonstudentjournalistatMizzouprotest.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/25/20/30915BB000000578-0-image-a-94_1453753091169.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420574_Media-professor-charged-siccing-muscle-student-journalist-Mizzou-protests-gets-suspended-University-Missouri_1540245272.html","title":"Melissa Click charged over 'siccing' muscle on student journalist at Mizzou protest","title_page":"Melissa Click charged over 'siccing' muscle on student journalist at Mizzou protest | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A university media professor charged with assault after calling for 'muscle' to remove a student journalist from a college protest has now been suspended.\nUniversity of Missouri assistant professor Melissa Click, 45, 'sicced' muscle on two reporters covering a protest in November on how the college handled a series of racist incidents last fall.\nShe faces up to 15 days in jail after pleading guilty to the charge of third degree assault on Monday, and the college announced last night that she has been suspended, pending further investigation.\nScroll down for video\nMelissa Click (pictured) the University of Missouri communications professor was filmed calling for 'muscle' to remove a student journalist from covering a protest. She has been charged with misdemeanor assault\nPam Henrickson, chair of the board investigating the case, said in a statement that the board is investigating whether further action is 'appropriate'.\nThe action came hours after interim chancellor at the University of Missouri's Columbia campus Hank Foley admitted that the protests were a sign that they 'need to do more to be fully inclusive'.\nMr Foley took the help three months ago after former chancellor R. Bowen Loftin and president Tim Wolfe resigned after student hunger strikes and a boycott of football games until they left.\nClick, an assistant communications professor, had tried to block reporter Tim Tai from covering a protest about the university's handling of a series of racist incidents last fall.\nTai, who was covering the event for ESPN, refused to leave as the crowd chants for reporters to leave the public quad.\nStudent videographer Mark Schierbecker filmed the confrontation and continued recording as he went over and asked to speak to Click.\nStudent videographer Mark Schierbecker (left) recorded the confrontation with Click, an assistant communications professor, and it quickly went viral\nStudent videographer filed a complaint with university police after the incident and took to Twitter to express his feelings after Click was charged\nHe says: 'I'm media. Can I speak to you?' She replies 'no' and tells him to 'get out'.\nWhen he refused, insisting he had a right to be there, she is seen yelling at other people nearby: 'Hey, who wants to help me get this reporter out of here? I need some muscle over here.'\nSchierbecker's video of his run-in with Click went viral, amassing more than 2.7million views, and he filed a complaint with university police.\nSchierbecker released a statement in response to Click being formally charged on Monday.\nHe said: 'Although my video might seem to pin free speech issues on an individual, Click's actions reflect a broader problem that students and journalists are facing on college campuses.\n'I don't want anyone to assume that because the city is dealing with her criminal behavior, that this problem goes away. '\nClick's actions reflect a broader problem that students and journalists are facing on college campuses Mark Schierbecker\nHe urged the university to enact 'reasonable protections that ensure journalists can gather news without being strong-armed'.\nHe added: 'Missouri started working on this problem this summer with the passing of the Campus Free Expression Act, but there still remains much to be done to ensure that Mizzou can be a safe space for journalists.'\nClick did not respond to an email Monday seeking comment. Calls to her work-related phone were greeted by a message that said her voicemail box was full and not accepting messages. Her home phone number has been disconnected.\nLater on Monday, a member of the university system's governing board of curators called once more for Click to be fired.\nHe remains unsatisfied by the letter of admonishment he says the school placed in Click's employment file over the matter but has refused to supply to him.\n'I'm willing to listen to the possibility of other job actions involving her as long as they're serious,' the board member, David Steelman, said.\n'The whole situation surrounding this has been stonewalling and an attempt to run out the clock by the university' in hopes it fades away.\nReferring to Schierbecker, Click (above) was caught yelling: 'Hey, who wants to help me get this reporter out of here? I need some muscle over here'\nWhen the student had told her 'I'm media. Can I speak to you?', she replies no and tells him to 'get out'\nPUBLIC PROTESTS ARE A SIGN THE UNIVERSITY MUST 'BE MORE INCLUSIVE' Earlier in the day, the interim chancellor at the University of Missouri's Columbia campus spoke about the November protests during his 'State of the University' speech, calling that chapter painful, but declaring that the school's push toward more inclusivity is a priority. 'One way to regard student unrest is a sign that the institution has not kept pace with change, especially with students' and the public's expectations,' Hank Foley, who took the helm at the campus less than three months ago, said. 'The tension around race relations and the campus climate shows that we need to do more to be fully inclusive.' Foley said having the system's troubles draw national scrutiny was difficult but added, 'I'm asking our Mizzou family to come back together around a love for this great institution.' Hank Foley, who took the helm at the campus less than three months ago, said. 'The tension around race relations and the campus climate shows that we need to do more to be fully inclusive' Foley took over after R. Bowen Loftin resigned November 9, along with the system's president, Tim Wolfe, amid discord that included a student's hunger strike and members of the school's football team pledging to boycott the rest of their season until Wolfe was gone. Foley's speech did not mention Click. Amid calls by a system administrator and Republican lawmakers to fire the professor, Foley told reporters this week that the university 'must allow due process to play out.' He said he would not rush when it comes to determining her future at the school, including a decision on tenure. Foley's address and Click's suspension came the same day several newspapers reported that Wolfe, in an email to supporters and donors after his resignation, criticized most officials involved in the turmoil leading to his exodus. Wolfe insisted the university is 'under attack' by the Missouri Legislature, rendering the board of curators 'frozen' by the pressure, and asked the email recipients to press the board to sweeten a financial package for him that he's negotiating the university. Messages left Wednesday with the board and Concerned Student 1950, an activist group that led the November protests, were not immediately returned. Pam Henrickson, chair of the board investigating the case, said in a statement that the board is investigating whether further action is 'appropriate' John Fougiere, a spokesman for the university system, said the university is aware of Wolfe's email, adding that since Wolfe's resignation, the matter has been in mediation 'aimed at reaching an acceptable post-resignation agreement.' 'Our position has been that any agreement would have to be consistent with the legal constraints within which a public institution such as the university operates,' Fougiere said without addressing other elements of Wolfe's email. Also Wednesday, board of curators member Yvonne S. Sparks resigned. She did not mention the turmoil at the Columbia campus in a statement released by the board. 'After careful consideration of the demands of my professional obligations and those required to engage in the work of the Board at the level that I expect of myself, I have concluded that it is not possible to do both well,' said Sparks, who works in the banking industry and who was appointed to the board by Democratic Gov. Jay Nixon last year. 'This is an important and demanding time for the System, the role deserves a representative that is able to that devote.'\nWhile labeling Monday's charge as 'not surprising,' Steelman, a Rolla attorney, said: 'I am disappointed that the city police and prosecutor have acted faster than the university to take action protecting the rights and safety of students.'\n'Respecting students' rights, free speech and safety has to be the number one priority of any great university,' he said.\nAt a news conference on Monday afternoon, the university's interim chancellor Hank Foley said Click will not be fired but said a task force has been put together to determine what actions need to be taken.\nThat board officially announced her suspension after a special meeting last night.\nWe are confident that she does not present a danger to anyone but we have to protect our learning environment for our student Hank Foley, chancellor\nFoley stressed the importance of 'due process', adding that Click is currently working from home and is 'aggrieved' by the whole situation.\nHe said officials will consider whether Click should be removed from the classroom until her legal proceedings have been completed - but added that he believes she does not pose a risk to anyone.\n'We are confident that she does not present a danger to anyone but we have to protect our learning environment for our students,' he said.\n'She had a moment of heated anger that day. I just do not think the person is dangerous.'\nDescribing her as an otherwise 'model citizen', Foley added that her application for tenure would continue as normal as making a 'hasty decision' could lead to 'more turmoil'.\nThat day's demonstrations came after the president of the four-campus University of Missouri system and the Columbia campus' chancellor resigned amid protests over what some saw as indifference to racial issues.\nDays after the confrontations, Click publicly said that she regretted her actions, and that she apologized to Schierbecker and all journalists as well as the university community for detracting from the students' efforts to improve the racial climate on the Columbia campus.\nThat day's demonstrations came after the president of the University of Missouri system resigned amid protests over what some saw as indifference to racial issues. Pictured, Jesse Hall and the Columns on the campus in Columbia, Missouri\nShe also stepped down from a courtesy position at Missouri School of Journalism a day after the incident.\nBut she is still listed as a professor in the communications department, which is part of the College of Arts and Sciences.\nEarlier this month, it emerged that more than 100 Republican legislators in Missouri have signed a letter calling for Click to be fired and her tenure application rejected.\nThe letter from Republican Missouri House members and state senators said: 'As a professor in the School of Journalism, Click's role should have been to remind students that we must respect the First Amendment rights of all individuals and that the student reporters there were doing nothing more than their jobs; jobs which are soundly protected by our Constitution.'","url":"https://www.dailymail.co.uk/news/article-3420574/Media-professor-charged-siccing-muscle-student-journalist-Mizzou-protests-gets-suspended-University-Missouri.html"}
