{"authors":["Cameron Jenkins"],"date_download":"2018-10-22 23:22:03","date_modify":"2018-10-22 23:22:03","date_publish":"2018-08-22 00:00:00","description":"Two of the five men that were convicted of sexually abusing an 18-year-old girl at a 2016 festival in Pamplona were forced from a public pool by outraged community members.","filename":"data/vaneerConsumption/MembersOfSpainsWolfPackSparkOutrageAtPoolinSeville.json","image_url":"https://media.npr.org/assets/img/2018/08/21/gettyimages-981827418_wide-ae645601b7f3be37c15be91ddea7efe14448f065.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_22_640595705_members-of-spains-wolf-pack-spark-outrage-at-pool-in-seville_1540250523.html","title":"Members Of Spain's 'Wolf Pack' Spark Outrage At Pool in Seville","title_page":"Members Of Spain's 'Wolf Pack' Spark Outrage At Pool in Seville : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Members Of Spain's 'Wolf Pack' Spark Outrage At Pool in Seville\nEnlarge this image toggle caption SOPA Images/LightRocket via Getty Images SOPA Images/LightRocket via Getty Images\nThe presence of two members of Spain's infamous band of convicted sex offenders — known as the \"Wolf Pack\"— at a public pool in Palomares del Río incited public outcry that led to their ousting from the space, inflaming calls for greater accountability in cases of violence against women.\nThe Wolf Pack or \"La Manada\" has been at the center of public vitriol since the group — a total of five men — was convicted to nine years in prison for sexually abusing an 18-year-old girl during the 2016 San Fermin running of the bulls festival in Pamplona.\nThe men were convicted on a lesser sexual abuse charge — a verdict that became a national scandal and sparked protests across Spain because the men were acquitted of rape.\nSpanish law requires evidence of violence or intimidation for a harsher rape conviction, which results in longer sentencing. The defense in the case leveraged a video recording of the woman closing her eyes during the attack and cited the action as a form of consent, NPR reported in April.\nRecognizing the men, pool goers yelled furiously at the two until their group decided to relocate to another section of the sports complex, according to Spanish media outlet El Pais. The men were part of a larger party that was invited to a birthday celebration for a pool employee, according to the newspaper.\nLocal deputy mayor Juana Caballero responded to the incident in a statement denouncing the men's public presence, saying \"Our government is not going to allow people declared personas non grata by this City Hall to come to our municipality and use our public spaces to provoke social alarm,\" reports El Pais.\nThe group derived its name from their WhatsApp chat group, where they bragged and posted video recordings taken during the attack, according to the BBC.\nNPR reported in June that all five men — Jose Angel Prenda Martinez, Angel Boza Florido, Antonio Manuel Guerrero Escudero, Alfonso Jesus Cabezuelo Entrena and Jesus Escudero Dominguez — have been provisionally released on bail while the case is being appealed.\nThey have only served a few months of the nine-year sentence, according to the BBC.\nThe case has prompted the Spanish government to consider legal reforms of the nation's laws on sex crimes.","url":"https://www.npr.org/2018/08/22/640595705/members-of-spains-wolf-pack-spark-outrage-at-pool-in-seville"}
