{"authors":["Lauren Sharkey"],"date_download":"2018-10-31 01:43:15","date_modify":"2018-10-31 01:43:15","date_publish":"2018-09-14 15:56:05","description":"From a simply hilarious video to a T-shirt that every fashion fan can't wait to get their hands on, one woman has been behind several headlines in recent weeks. And the memes of Victoria Beckham's bag advert are the latest moment to dominate social…","filename":"data/vaneerConsumption/MemesOfVictoriaBeckhamsBagAdvertAreFillingSocialMedia.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/990e2903-d9ec-4c58-b539-fe02932f9978-screen-shot-2018-09-14-at-162253.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_memes-of-victoria-beckhams-bag-advert-are-filling-social-media-11919135_1540950195.html","title":"Memes Of Victoria Beckham's Bag Advert Are Filling Social Media","title_page":"Memes Of Victoria Beckham's Bag Advert Are Filling Social Media","title_rss":"NULL","source_domain":"bustle.com","text":"From a simply hilarious video to a T-shirt that every fashion fan can't wait to get their hands on, one woman has been behind several headlines in recent weeks. And the memes of Victoria Beckham's bag advert are the latest moment to dominate social media. To celebrate 10 years at the helm of her fashion brand, Beckham decided to recreate a 2008 Marc Jacobs campaign which saw her legs (and nothing else) sticking straight out of a humongous white branded bag. The Victoria Beckham ad was photographed by Juergen Teller; the same man behind the famous photos taken a decade ago.\nBeckham released a series of three photos earlier this week. One replicates the exact pose she performed all those years ago, another sees her head and body covered by the same bag, and the last features her hanging out the side of the bag with Teller holding a camera inside. If you can't tell, this bag is of otherworldly proportions.\nWith everyone finally realising that the 44-year-old has a decent sense of humour, Beckham must have known that the legs akimbo pose was going to be replicated by at least one person. Turns out several people (including some famous faces) have decided to have a go.\nCeleste Barber — a comedian who spends a great deal of time mocking the poses of models, actresses, singers, and the like — stuck on her best underwear and attempted to recreate Beckham's bag-over-head look. Albeit with a much smaller bag.\nLoose Women's Linda Robson swapped the pristine Victoria Beckham bag for a brown Primark one, taking to the floor to show off her copycat stance. And Nick Grimshaw enlisted the help of fierce performer Jonbenet Blonde.\nLuckily, Beckham hasn't taken offence. Instead, VB is so into this new Instagram trend that she regrammed some of the best ones, inviting others to get involved with the #VBBagChallenge. See, it's got its own hashtag now and everything.\nNaturally, a lot of people have got their pets involved. There are photos of dogs with bags on their heads, a rather scary-looking lizard coming out of a bag, and a cat peeking out of, you guessed it, a bag.\nSome people have gone the whole hog, taking off their clothes and perfecting that leg shot. Whether it's a clever camera angle or the help of a little Photoshop, everyone seems to be taking this challenge extremely seriously. The ones using the ultra fashionable Ikea bags are my personal favourite.\nBeckham will be further celebrating the 10th anniversary of her brand on Sunday in London. At 9:30 a.m., she will be showing her new collection as part of London Fashion Week. Unfortunately, it's invite only so, unless you're a member of the fashion industry or a personal friend, it's unlikely you'll be able to attend.\nHowever, the designer will be taking up residence behind the till of her Dover Street store from 3 p.m. on the same day. You never know, a surprise appearance from David, Brooklyn, Romeo, Cruz, and Harper could be on the cards.","url":"https://www.bustle.com/p/memes-of-victoria-beckhams-bag-advert-are-filling-social-media-11919135"}
