{"authors":["Sam Sanders"],"date_download":"2018-10-23 01:00:53","date_modify":"2018-10-23 01:00:53","date_publish":"2016-02-20 00:00:00","description":"It could have just been a picture of a gun engraved with Jeb Bush's name. But no. The Internet refused to leave it alone.","filename":"data/vaneerConsumption/MemeOfTheWeekJebAGunAndAmerica.json","image_url":"https://media.npr.org/assets/img/2016/02/19/ap_218134688094_wide-9586adf53f7612039662aeb138b0405ad912729f.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_02_20_467353193_-memeoftheweek-jeb-a-gun-and-america_1540256453.html","title":"#MemeOfTheWeek: Jeb!, A Gun And 'America.'","title_page":"#MemeOfTheWeek: Jeb!, A Gun And 'America.' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"#MemeOfTheWeek: Jeb!, A Gun And 'America.'\nEnlarge this image toggle caption Andrew Harnik/AP Andrew Harnik/AP\nHow many ways can The Internet mock Jeb Bush?\nSo many. So many ways. Here's the latest.\nSince the last Republican presidential primary in New Hampshire, Jeb Bush has been making a push to win in South Carolina, the next state to hold a GOP nominating contest. He's gained the endorsement of South Carolina Sen. Lindsey Graham. He's trotted out his brother, George W., and his mother Barbara, on the trail. And he's started to play up his support of the military and the Second Amendment, two issues that are very important to a large number of South Carolina Republican voters.\nBut, per usual, some of Jeb Bush's outreach backfired. The latest in a series of gaffes includes a gun, a tweet — and the word \"America.\"\nDuring a visit to a gun factory in Columbia, S.C., Bush received an engraved pistol. Seemingly eager to show it off, as well as his pro-gun bona fides, Bush's team tweeted out an image of the gun, inscription in clear sight, with the caption, \"America.\"\nSeems fine on first glance. Right?\nNo. It was not fine. Not fine at all. Within minutes, Twitter let Jeb have it, with several tweets mocking the gun, Jeb Bush, and a lot more.\nSome were serious, like a tweet from the Brady Campaign to Prevent Gun Violence, which, in response to the \"America.\" tweet, shared a supercut of newscasters announcing gun deaths throughout the country.\nOthers pointed out that \"America.\" in its most literal sense, is a land mass that's bigger than just the USA.\nA few replaced the inscription with the words, \"Please Clap,\" referencing another recent Bush misstep, in which the candidate asked an audience for applause after he delivered a key line in a speech. And several shared images of actress America Ferrera.\nOverall, the response was mostly hilarious, but it also raised a few larger questions. First among them, would this have happened to anyone other than Bush? If Donald Trump or Ted Cruz tweeted a picture of a gun, would they be mocked at all? Would it be seen as less forced, more natural? Does knowing that Bush tweeted the image of the gun make us want to mock the image just as much as the image itself does?\nAnd secondly, why is it so easy to make fun of Jeb Bush? And why do so many people seem to enjoy doing it?\nAs far as explanations go, for starters, Bush gave The Internet a perfect, meme-able canvas. A single word caption, open for so much interpretation. The photo of the inscribed gun: a single, easily photoshopped image. It was all ripe for parody — as is Bush, it seems, which may be the second big reason the tweet and its responses went viral.\nplease stop the meme i served my country i shouldn't have to mute 'america' — andy levy (@andylevy) February 16, 2016\nWe've written about his foibles before, and it seems for months now, The Internet has been mocking the candidate and his struggling campaign. Part of the reason \"America.\" took off online is because people have really gotten used to making fun of Bush, no matter what he does.\nBush's campaign hasn't responded to the tweet — or taken it down. And the initial wave of criticism over it seems to have blown over. But the week still seems to have been a tough one for him. Trump mocked him for switching to contacts from glasses. Popular South Carolina Gov. Nikki Haley endorsed his rival, Sen. Marco Rubio, this week, after Jeb Bush had previously said Haley's support was \"probably the most meaningful endorsement there is.\"\nOf course, a strong showing in South Carolina's Republican primary could give Bush's campaign at least one positive story line. Though if he does poorly, he must surely know what type of response he'll get from The Internet.","url":"https://www.npr.org/2016/02/20/467353193/-memeoftheweek-jeb-a-gun-and-america"}
