{"authors":["Sam Sanders"],"date_download":"2018-10-23 01:01:37","date_modify":"2018-10-23 01:01:37","date_publish":"2016-06-10 00:00:00","description":"We need to talk about #DeleteYourAccount, because everybody else is talking about it. And because 2016 is quickly becoming the year of the Twitter flame-war election.","filename":"data/vaneerConsumption/MemeOfTheWeekDeleteYourAccount.json","image_url":"https://media.npr.org/assets/img/2016/06/10/ap_16112684472285_wide-0e498ea27be7a6495c6bcfac11018d67142aaff1.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_06_10_481579212_-memeoftheweek-delete-your-account_1540256497.html","title":"#MemeOfTheWeek: Delete Your Account","title_page":"Hillary Clinton's Tweet Telling Donald Trump To 'Delete Your Account' Went Viral On Twitter : NPR","title_rss":"NULL","source_domain":"npr.org","text":"#MemeOfTheWeek: Delete Your Account\nWriting about the biggest thing on the Internet one day after it explodes is either great, or extremely difficult. Perhaps a day can give perspective, reveal some deeper point, allow for edification that couldn't have been found the day before.\nOr perhaps it can not. Perhaps this wild thing, this latest piece of the Political Twitter Industrial Complex, still makes no sense.\nEven so, here we are. We need to talk about #DeleteYourAccount, because everybody else is talking about it. And because 2016 is quickly becoming the year of the Twitter flame-war election.\nYou must have seen it by now. One of the most-tweeted political tweets of all political tweetage, Hillary Clinton's snarky response (or, more likely, one of her young social media staffer's snarky response) to a Donald Trump tweet mocking President Obama's recent endorsement of her presidential run.\n\"Obama just endorsed Crooked Hillary,\" Trump wrote. \"He wants four more years of Obama — but nobody else does.\"\nObama just endorsed Crooked Hillary. He wants four more years of Obama—but nobody else does! — Donald J. Trump (@realDonaldTrump) June 9, 2016\n\"Delete your account,\" Clinton responded. And then the Internet blew up.\nHow long did it take your staff of 823 people to think that up--and where are your 33,000 emails that you deleted? https://t.co/gECLNtQizQ — Donald J. Trump (@realDonaldTrump) June 9, 2016\nIf you've made it this far, you probably already kind of know what \"delete your account\" means. It's the ultimate snarky way to tell someone on the Internet that that thing they wrote, or did, or shared, is dumb, or offensive, or just a little off — or all three.\nKnowYourMeme.com, chronicler of foolishness such as this, defines \"delete your account\" this way:\nAn online slang expression commonly used as an insult by calling on an individual to voluntarily excommunicate him/herself from an online community or social networking site that requires membership registration. It can be seen as the online equivalent of other colloquial expressions like \"kill yourself\" and \"go home.\"\nSoon after the hundreds of thousands of retweets began, other politicos clamored to get in on the fun, like Republican National Committee Chair Reince Priebus, and disgraced former House member Anthony Weiner, because what else does he really have going on right now?\nToo late for some of us. https://t.co/NgyzWsP9tN — (((Anthony Weiner))) (@anthonyweiner) June 9, 2016\n.@HillaryClinton If anyone knows how to use a delete key, it's you. — Reince Priebus (@Reince) June 9, 2016\nAnd soon, Clinton-endorser Sen. Elizabeth Warren got in on the fun, too, also in response to a Trump tweet.\nNo, seriously -- Delete your account. https://t.co/O1u7oc0jAR — Elizabeth Warren (@elizabethforma) June 10, 2016\nThe media coverage of \"delete your account\" was swift as well, and perhaps, a bit suffocating. (We apologize now for adding to the deluge.)\ndelete the media pic.twitter.com/kP3JQbjSEm — Adam H. Johnson (@adamjohnsonNYC) June 9, 2016\nThere are a few takeaways from this sick Twitter burn and its ensuing eruption of media saturation:\n1. Clinton can be cool on the Internet, but it usually only happens when someone else is driving the social media train. We can assume she did not write this tweet herself (it would have been signed --H if she did). Remember when she achieved Internet coolness before, with that meme of her wearing sunglasses and kicking ass on a Blackberry (Texts From Hillary)? She didn't make that one either.\n2. As noted earlier, this will be the year of the Twitter flame-war election, with the tweets of presidential candidates and their surrogates reading like outtakes from the latest season of Real Basketball Wives of Rodeo Drive Keeping Up With Big Brother Season II.\n3. As soon as politicians use a thing that was cool, or snarky, or fun on the Internet, it loses its power. Like, how can anyone use \"Delete Your Account\" online anymore? It is the uncoolest of uncoolest things at this point, no? WHAT WILL THEY TAKE AWAY FROM US NEXT?\n4. We will never write about this again. It is over. It is done. Let us move on. Delete your account. Delete this meme. Delete it all.","url":"https://www.npr.org/2016/06/10/481579212/-memeoftheweek-delete-your-account"}
