{"authors":[],"date_download":"2018-10-23 00:58:57","date_modify":"2018-10-23 00:58:57","date_publish":"2015-11-23 00:00:00","description":"Tourists love California's Mendocino coast for its redwoods, surf and charm. But the battle to keep the area's only hospital afloat is pitting hospital administrators and doctors against each other.","filename":"data/vaneerConsumption/MendocinoCoastFightsToKeepItsLoneHospitalAfloat.json","image_url":"https://media.npr.org/assets/img/2015/11/19/mendocino_from_mendocino_headlands_sp-1180x694_wide-1b2e04891d660ab346d0626a203965a89cc1e7db.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=455518032_1540256337.html","title":"Mendocino Coast Fights To Keep Its Lone Hospital Afloat","title_page":"Mendocino Coast Fights To Keep Its Lone Hospital Afloat : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"KELLY MCEVERS, HOST:\nHere in California, people who live in the tiny city of Fort Bragg are worried that they are about to lose their only hospital. It went bankrupt a few years ago, and it's barely hanging on. Fifty-eight rural hospitals have closed down in the U.S. in the last five years. In Fort Bragg, there's a fight about how to keep the hospital open. April Dembosky of member station KQED reports.\nAPRIL DEMBOSKY, BYLINE: It's been a long time, but finally, Bill Rohr's report from the Mendocino Coast Hospital finance committee isn't terrible.\n(SOUNDBITE OF ARCHIVED RECORDING)\nBILL ROHR: This is the first black ink I've seen at the end of the month in quite some time.\n(APPLAUSE)\nDEMBOSKY: Things started going bad for the hospital in 2002 when the local lumber mill closed down. People lost their jobs and their private health insurance that paid good rates to the hospital. About 7,000 people are left in the blue-collar town along the rugged Mendocino coastline. Now the economy is propped up by tourists who come here to hike or fish. By 2012, the hospital fell into bankruptcy, and locals got scared it would close. Sue Gibson started hosting meetings in her living room. She tells me how people would spread out on the pink Victorian sofas to talk about how to save the hospital.\nSUE GIBSON: Nobody can live here without that hospital. I mean, the nearest hospital is an hour-and-a-half away on treacherous mountain roads.\nDEMBOSKY: Gibson also worries that the local economy would be wrecked. The hospital is the largest employer.\nGIBSON: Probably the best-paying jobs. And if they close that, all that income would go away.\nDEMBOSKY: That means less money for the local bait shops and seafood restaurants.\nGIBSON: Also, people's property values - they would be cut in half immediately.\nDEMBOSKY: Many people who live in remote areas like this are older or low-income. The government used to pay hospitals extra to account for that, but after the recession, the money was slashed. CFO Wade Sturgeon says Medicare basically tells the hospital what it will pay.\nWAYNE STURGEON: So it'd be like going into Safeway and saying, hey, there's a jug of milk; I'll give you $2. But the price is $3.50. You're only going to get $2.\nDEMBOSKY: Now leadership at the hospital is split over how to cope with the new economic reality. On one side are the hospital demonstrators, a new CEO and a brand-new CFO, Wayne Sturgeon.\nSTURGEON: Do the math.\nDEMBOSKY: The days the finance committee meets, Sturgeon wears a mint-green shirt and a tie with a $100 bill on it. He says the hospital should focus on increasing revenues, drum up more patients.\nSTURGEON: If you're not growing, you're dying.\nDEMBOSKY: And they should charge more for patients with private insurance.\nSTURGEON: Any time we don't raise prices, we're leaving money on the table.\nDEMBOSKY: Now, on the other side of the debate are two new members of the board of directors. They say new patients are not the answer. The hospital should focus on controlling costs.\nROHR: It's obviously an expense problem.\nDEMBOSKY: That's Bill Rohr, a steely orthopedist with gray hair tied back in a tight ponytail. He spent years in the corporate world and vowed to bring financial discipline to the tiny Fort Bragg hospital.\nROHR: This is not about being ruthless. It's about keeping this business alive, and it's only alive if it makes money, OK?\nDEMBOSKY: A lot of his sentences are punctuated like this, as if to make sure you don't miss his point, like when he's giving a finance presentation, staring daggers at the CEO.\n(SOUNDBITE OF ARCHIVED RECORDING)\nROHR: $870,000 loss - not acceptable, OK?\nDEMBOSKY: Or when he's explaining the difficult decisions the hospital will have to make to balance its budget.\nROHR: There's 20 people in the water about to drown, and there's a rowboat there. But the rowboat can only hold 10. If 11 people get in that rowboat, it sinks and all die, OK?\nDEMBOSKY: At the hospital, this means tough choices. They just closed the cafeteria, and they can't afford a full-time cardiologist. Walking into the hospital itself is like stepping into 1971 - painted cinderblock walls, drab brown carpets and the smell of Salisbury steak.\nROHR: This building is - its days are numbered.\nDEMBOSKY: Dr. Rohr says the flooring is layered with asbestos. The concrete isn't strong enough to hold the weight of modern-day MRI machines. And in 2030, new state requirements kick in for earthquake readiness.\nROHR: We're going to have to build a new hospital.\nDEMBOSKY: Where's the money going to come from for that? For once, hospital administrators and doctors are united around a possible solution - a new tax on homeowners. And people like Sue Gibson are reluctantly supporting it.\nGIBSON: The only way we're going to be able to save this place, really, is with a parcel tax. But they can't even think about that until they clean up their act.\nDEMBOSKY: After the Wall Street meltdown, banks were too big to fail. The feeling here is that the local hospital is too important to fail, and the residents will be tapped to fund the bailout. For NPR News, I'm April Dembosky in Fort Bragg, Calif.\nMCEVERS: This story is part of a reporting partnership between NPR, KQED and Kaiser Health News.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=455518032"}
't miss his point. Like when he's giving a presentation at a finance committee meeting, staring daggers at the CEO.\n\"We keep saying $870,000 loss,\" Rohr says. \"Not acceptable, OK.\"\nEdwards, the current CEO, has been on the job six months. He's the hospital's fourth chief executive in a year. His right-hand man is Sturgeon, the brand-new CFO, who started in September.\nOn days the financial committee meets, Sturgeon wears a mint-green shirt and a tie with a $100 bill on it. He says things like, \"Do the math.\"\nRight now, the hospital administrators and the doctors on the board are pitted against each other in a battle over how to keep the hospital doors open — a battle that is echoed at small hospitals across the nation.\nCut costs or raise prices? Board members disagree on best approach\nCFO Sturgeon and CEO Edwards say the hospital should focus on increasing revenues. It should find more patients to come to the hospital, maybe develop new services to attract then.\n\"If you're not growing, you're dying,\" Sturgeon says.\nHe says the hospital should also charge more money for services provided to patients who have private insurance — currently about 15 percent of the hospital's patients.\n\"Anytime we don't raise prices, we're leaving money on the table,\" he says.\nBut Rohr says that would put an unfair burden on the small-business owners in town, the ones who typically buy their own private insurance.\nHe and Glusker say the hospital should be focused on controlling costs.\n\"It's obviously an expense problem,\" Rohr says. \"And you can come to that conclusion very quickly, just by looking at the data.\"\nThe hospital is going to have to make some very difficult decisions to balance its budget, Rohr says. He offers this analogy: \"There's 20 people in the water about to drown. And there's a rowboat there, but the rowboat can only hold 10,\" he says. \"If 11 people get in that rowboat, it sinks and all die, OK.\"\nAt the hospital, this means choosing between a cardiologist and an ophthalmologist, a cafeteria and a new X-ray machine.\n\"It's horrible to make the decision that 10 are going to drown,\" he says. \"But I've got to pick the 10. OK.\"\nOne area Rohr thinks could be ripe for trimming? Administrative positions.\n\"I walk into the hospital to do rounds in the morning, and there are more people standing around with clipboards than with stethoscopes,\" he says, \"and that doesn't feel like the right formula to me.\"\nBut CFO Sturgeon says there's not enough management. \"Physicians always think there's too much management,\" he says. \"You have some people with 50 direct reports. Does that make sense?\"\nThere are some cuts both sides agree on. All say there needs to be some serious culling of the health benefits for hospital staff. Years ago, the nurses union negotiated to have the hospital pay full health benefits for any full-time or part-time nurse and their entire families. Nurses pay nothing toward their monthly premiums.\n\"Do the math. How many people are we paying for to have full family coverage?\" Sturgeon says. \"I've never worked in a hospital that provided the type of health insurance benefits that we have at this facility.\"\nMeanwhile, Need For New Hospital\nTo understand exactly how dire the financial situation is, one need only walk into the lobby of the hospital itself. It's like stepping back into 1971. The main patient floor is lined with drab brown carpets. The smell of Salisbury steak spills out of patient rooms.\n\"I've been in Third World countries. This is pretty basic, OK,\" Rohr says, walking by the operating suite.\nThrough the maternity ward and the emergency room, Rohr says the flooring is layered with asbestos. The concrete isn't strong enough to hold the weight of modern CT scanners and MRI machines. On top of all that, in 2030 new state requirements kick in for earthquake readiness.\nIt all points to one conclusion. \"We're going to have to build a new hospital,\" Rohr says.\nSo, not only is the hospital struggling to maintain a balanced budget through normal hospital operations but it also has to come up with tens of millions of dollars to replace itself in 15 years.\nIt's an especially tall order for a hospital that just posted its first monthly profit in a decade, then slipped into the red again right away.\nIf you ask the Washington policymakers in charge of payment reform, some will say it's just a harsh reality that some hospitals will have to close. Some previous local administrators have predicted that the Fort Bragg hospital will one day be replaced by a helicopter landing pad. People will be airlifted out for heart attacks and other emergencies. For other planned surgeries, like hip replacements, people will have to drive \"over the hill\" to another hospital.\nBut the people who live in Fort Bragg and Mendocino don't like that scenario. Gibson has been hosting community meetings in her living room, where people spread out on the pink Victorian sofas to talk about how to save the hospital.\nShe's rallying support for a possible solution, and it's one the administrators and doctors are united around: a new tax on homeowners. Local residents will very likely vote on that in November 2016.\n\"The only way we're going to be able to save this place, really, is with a parcel tax,\" she says. \"But they can't even think about that until they clean up their act.\"\nAfter the Wall Street meltdown, banks were too big to fail. The feeling here is that the local hospital is too important to fail. And the residents will be tapped to fund the bailout.\nThis story comes from a reporting partnership of NPR, KQED and Kaiser Health News.","url":"https://www.npr.org/sections/health-shots/2015/11/23/455518032/mendocino-coast-fights-to-keep-its-lone-hospital-afloat"}
