{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 19:22:13","date_modify":"2018-10-30 19:22:13","date_publish":"2015-05-13 19:59:11","description":"Lawyers for Senator Robert Menendez (D-NJ) filed a motion in a Newark federal courtroom this week asking for a change of venue in his public corruption trial. Menendez wants the trial to be held in Washington, D.C., not New Jersey, where the indictment was filed on April 1. Attorneys for his co-defendant, Florida opthalmologist Dr. Salomon Melgen, joined in the request. |","filename":"data/vaneerConsumption/MenendezAsksforChangeofVenueinPublicCorruptionTrial.json","image_url":"https://media.breitbart.com/media/2015/03/AP727977424048.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_05_13__1540927333.html","title":"Menendez Asks for Change of Venue in Public Corruption Trial","title_page":"Menendez Asks for Change of Venue in Public Corruption Trial | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Lawyers for Senator Robert Menendez (D-NJ) filed a motion in a Newark federal courtroom this week asking for a change of venue in his public corruption trial. Menendez wants the trial to be held in Washington, D.C., not New Jersey, where the indictment was filed on April 1. Attorneys for his co-defendant, Florida opthalmologist Dr. Salomon Melgen, joined in the request.\nMenendez’s attorney, Abbe Lowell, had indicated previously he would possibly request a change of venue, as NJ.com reported in April.\nAccording to the New York Times, Lowell has decided a change of venue is in the best interests of his client, and filed a motion in court on Monday asking for just that:\nMonday’s motion argues that Mr. Menendez is not charged with any acts that took place in New Jersey. The government began the investigation and grand jury presentation in Florida before moving the case to New Jersey, the brief says. The basis for trying the case in New Jersey “appears to be radio communications from the pilot of a plane in New Jersey airspace on which Senator Menendez was a passenger,” the brief states. “Needless to say, the pilot’s cabin and the airport control tower were not the ‘nerve center’ of the conspiracy alleged in the indictment.” The brief argues that the location of the defendants and possible witnesses, the expense to the parties and the location of lawyers and the fact that events at issue took place in Washington are compelling reasons to move the case.\nFederal prosecutors have until June 30 to file a brief responding to the change of venue request.\n“We’ll respond [to the change of venue request] at the appropriate time in court,” Department of Justice spokesperson Peter Carr told Breitbart News on Wednesday.\n“The court has scheduled a motion hearing for June 30, 2015. Trial is currently set for July 13, 2015. Further court hearings will be determined by the court,” Carr added.\nIt is not clear whether the Department of Justice will object to the change of venue request.\nTrying the case in Washington, D.C., however, could raise some difficult issues for federal prosecutors, related to the role played by Senator Harry Reid (D-NV) in setting up and attending a meeting between Menendez and then-Secretary of Health and Human Services Kathleen Sebelius at his Capitol Hill offices in August 2012 that is at the center of the Department of Justice’s case against Menendez.\nIf federal prosecutors concede that, as Lowell argued in his motion to change the venue “the pilot’s cabin and the airport control tower [in New Jersey] were not the ‘nerve center’ of the conspiracy alleged in the indictment,” they will be agreeing that Washington, D.C. was the nerve center of the conspiracy.\nOnce federal prosecutors concede that Washington, D.C. was the nerve center of the conspiracy, the next question will be where, specifically, in that city was the nerve center located.\nMenendez’s attorneys may well argue that nerve center was not located in Menendez’s office, but was, instead, located in Harry Reid’s office. After all, the meeting with Secretary Sebelius at the center of the Department of Justice’s case against Menendez was held in Reid’s office.\nReid has not been indicted, nor is there any indication that the Department of Justice has any intention of doing so. He was, however, mentioned as “Senator 3” in the Menendez indictment.\nIn their indictment of Mendendez, federal prosecutors allege that $600,000 of the $700,000 Melgen donated to the Senate Majority PAC in 2012 (which is closely tied to Reid) was used to aid Menendez’s re-election to the Senate that year. As such, that donation represented the “quid” provided to Menendez in return for his “quo” – arguing directly to Secretary Sebelius on Melgen’s behalf in an $8.9 million Medicare overbilling dispute in that Aug 2012 meeting arranged by Reid and held in his Capitol Hill office.\nBut in their indictment against Menendez and Melgen, federal prosecutors make no mention of the additional $100,000 Melgen contributed to the Senate Majority PAC, funds which Reid was free to direct to other races which successfully aided him in his retention of his powerful job as Senate Majority Leader in the subsequent session of Congress that convened in January 2013.\nThat donation by Melgen, it could be argued, represented the “quid” in return for a more easily demonstrated “quo” from Reid—his arrangement and attendance at the August 2012 meeting, the fact that the meeting was held in Reid’s Capitol Hill office in Washington, D.C.\nIndeed, the timing of Melgen’s donations to the Senate Majority PAC, as well as documentary evidence included in the Menendez indictment, suggest that he had an expectation of continued effort on his behalf by Reid himself. In fact, there appears to be more evidence tying Reid to acts that arguably provided illegal influence on Melgen’s behalf in return for his donations to the Senate Majority PAC than there is tying Menendez to such arguably illegal acts.\nAs Breitbart News reported previously, Melgen could tell federal prosecutors a great deal about Reid’s role in his efforts to get Secretary Sebelius to reverse the Department of Health and Human Services decision to charge him with overbilling Medicare in 2007 and 2008, a role that arguably began on June 18, 2012 when Melgen’s wholly owned company, Vitreo-Retinal Consultants, made its initial $300,000 donation to Reid’s Senate Majority PAC:\nMelgen could also tell federal prosecutors what he expected to receive from Reid in return for the additional $100,000 contribution his Vitreo-Retinal Consultants made to Reid’s Senate Majority PAC ten days later on June 28,2012. Melgen could further tell federal prosecutors what he expected to receive for the $300,000 his Vitreo-Retinal Consultants donated to Reid’s Senate Majority PAC on October 16, 2012. Melgen could also shed light on what his attorney expected when he forwarded a memo to Reid fundraiser Jake Perry on October 19, where he claimed, “it would be appropriate for the Secretary of the Department of Health and Human Services to intervene during the pendency of the Practice’s [Melgen’s $8.9 Million Medicare overbilling] appeal before the MAC [the HHS appeals board] to clarify that, as to the period prior to January 1, 2011, CMS policy permitted physicians physicians and providers to bill for overfill.” Another thing Melgen could tell federal prosecutors is the meaning of Perry’s subsequent email response sent directly to him, cited in the Menendez indictment: Dr. Sal,\nI’m going to see him [Harry Reid] on Tuesday. I will give him this directly. Is that ok?\nI am sure he will forward this to [the Senior Health Counsel for Senator 3] in his office. She was the staff person in the meeting before [probably the meeting with Sebelius on August 2, 2012]. I would suggest someone come in and brief her on the updated information. (emphasis added)\nMelgen, who was granted bail on the public corruption charges, was arrested on separate Medicare fraud charges in Florida on April 14, and has remained in jail there ever since. On Friday, a U.S. Federal Magistrate Judge denied him bond, stating that he was a flight risk to return to his native Dominican Republic.\nA trial date on the Medicare fraud charges has been set for February 22. With the public corruption trial date set for July 15, it appears that trial will be held prior to the Medicare fraud trial.\nMelgen’s attorneys had asked U.S. Magistrate Judge James Hopkins to try the Medicare fraud case prior to the public corruption case.\nMelgen’s attorneys have seemingly indicated no desire to have their client implicate either the indicted Menendez or the unindicted but at least tangentially connected Reid in acts of public corruption.\nMeanwhile, Melgen has remained behind bars in a Florida jail since his April 14 arrest and is unlikely to reside anywhere else for a very long time.","url":"https://www.breitbart.com/politics/2015/05/13/menendez-asks-for-change-of-venue-in-public-corruption-trial/"}
