{"authors":["Christine Cauthen"],"date_download":"2018-10-30 22:26:32","date_modify":"2018-10-30 22:26:32","date_publish":"2014-08-15 17:40:13","description":"Spanx. They're your best friend that helps you through hard times but also sort of makes you feel like crap. If it's the day before your buddy's wedding and you just realized that staying inside and binging on pizza and Orange is the New Black has…","filename":"data/vaneerConsumption/MenTryOnSpanxForTheFirstTimeAndKindaLikeIt.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/31b70c0e-6903-4faf-9929-fa036477cbd2.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35953-men-try-on-spanx-for-the-first-time-and-kinda-like-it_1540938392.html","title":"Men Try On Spanx For The First Time And... Kinda Like It?","title_page":"Men Try On Spanx For The First Time And... Kinda Like It?","title_rss":"NULL","source_domain":"bustle.com","text":"Spanx. They're your best friend that helps you through hard times but also sort of makes you feel like crap. If it's the day before your buddy's wedding and you just realized that staying inside and binging on pizza and Orange is the New Black has shot your dress size up a bit, Spanx can save you from being unable to squeeze into that little black bridesmaid's dress. However, those very same Spanx may inhibit your dance moves and ability to enjoy two pieces of wedding cake (Hey, it's your best friend's big day!). In my 22 years on this earth I've worn Spanx about five times total, and I honestly have no plans to do it again. Four men decided to take the plunge into squish-dom, on camera nonetheless, for a BuzzFeed video in which guys try on Spanx for the first time ever. It's great, obviously.\nWomen are taught to hide their lumps, curves and basically any small imperfections. Men definitely have to endure their fair share of body shaming, but I don't think they're subjected to being pressured to squeeze their bodies into too-tight fabrics. Although they present it in a hilarious manner, at the root of the video is still confrontation against the misogynistic ways of our society, which I'm so into. However, I don't think we'll see any sympathy from guys even after the video — most of the dudes featured were actually quite pleased with how the spandex devices made them look. See the men wriggle in-and-out of the super tight and constricting Spanx to \"smooth out their curves\" in the awesome video below.","url":"https://www.bustle.com/articles/35953-men-try-on-spanx-for-the-first-time-and-kinda-like-it"}
