{"authors":["Kelli Serio"],"date_download":"2018-10-30 21:16:32","date_modify":"2018-10-30 21:16:32","date_publish":"2015-11-07 19:21:28","description":"Screen legend Sophia Loren tells \"The Hollywood Reporter\" that men and women work equally hard in Hollywood and both make sacrifices.","filename":"data/vaneerConsumption/MenWorkAsHardAsWomeninHollywood.json","image_url":"https://media.breitbart.com/media/2015/11/Sophia-Loren-Cannes-Venance-AFP-GettyImages.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_11_07__1540934192.html","title":"Men Work As Hard As Women in Hollywood","title_page":"Sophia Loren: Men Work As Hard As Women in Hollywood","title_rss":"NULL","source_domain":"breitbart.com","text":"At a time when Hollywood’s female players advocate for more money and larger roles, both in front of and behind the camera, one of the industry’s classic stars quietly tells The Hollywood Reporter that the entertainment industry at large doesn’t really discriminate.\nItalian-born actress Sophia Loren, who became the first woman to win an Academy Award for a performance in a foreign-language film in 1962 for Two Women, opened up about her perception of gender bias and wage inequalities in the film industry, telling THR recently that she has made many sacrifices throughout her notable career.\n“You sacrifice yourself during the steps you have to make, to be able to arrive where you want to arrive,” she said at the Americans for the Arts’ National Arts Awards in New York City last month, where she was honored with a lifetime achievement award.\nWhen asked if she thinks women sacrifice more than their male counterparts in the entertainment industry, Loren shook her head no and quietly said, “I think you have to find the right people.”\nThe Hollywood legend also offered advice to young women trying to make a name for themselves in entertainment, saying they must choose “what they really want to do, they have to be careful about the people they meet, they have to be careful about what they’re proposed.”\n“It’s hard work, and you have to learn it,” she added.\nLast month, while discussing the culture of social media and its links to fame, the iconic actress told Page Six she’s not a fan of “selfies.”\n“My era of Hollywood was much better… you were known for your skill and talent,” she said. “I was very lucky to be a part of that time.”","url":"https://www.breitbart.com/entertainment/2015/11/07/screen-legend-sophia-loren-gender-inequality-men-work-just-hard-women-hollywood/"}
