{"authors":["Virginia Hale"],"date_download":"2018-10-30 19:04:05","date_modify":"2018-10-30 19:04:05","date_publish":"2016-11-25 09:27:03","description":"MEPs have voted to clamp down on “anti-EU propaganda”, which they say is part of a concerted “disinformation” campaign by the Kremlin.","filename":"data/vaneerConsumption/MEPsVotetoCrackDownonPopulism.json","image_url":"https://media.breitbart.com/media/2016/11/FRANCE-EU-PARLIAMENT-VOTE.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_11_25__1540926245.html","title":"MEPs Vote to Crack Down on Populism","title_page":"MEPs Vote to Crack Down on Populism — Calling it 'Russian Propaganda'","title_rss":"NULL","source_domain":"breitbart.com","text":"The parliament of the European Union (EU) has voted to clamp down on “anti-EU propaganda”, which MEPs claim is part of a concerted “disinformation” campaign by the Kremlin.\nMEPs supported the resolution to “counter Russian propaganda”, the report on which it was based claiming that Moscow funds Eurosceptic and populist parties in the EU with the aim of disintegrating the bloc.\nA unit which “finds and debunks” “Russian propaganda” online would be expanded and given a cash boost if the 304 MEPs who voted for the resolution have their way.\nThe European Parliament’s press release on the resolution, which was designed to “respond to information warfare from Russia”, asserts that Moscow is funding “anti-EU forces such as extreme right parties and populist forces”.\nPolish MEP Anna Fotyga said “hostile propaganda” backed by Russia seeks to “distort the truth, provoke doubt, divide the EU and its North American partners, paralyse the decision-making process, discredit the EU institutions and incite fear and uncertainty among EU citizens”.\nThe vote comes amid mounting attacks on “fake news” by the establishment, who fear citizens are abandoning the mainstream media as their sole source of information.\nOne EU official remarked: “There is an increasing trend of communicating in bubbles, in echo chambers, especially on Facebook.”\nThe European Commission is to open an investigation next year into how social media companies like Facebook use algorithms to display posts they think will interest users.\nA source from the Commission told EurActiv.com that the unelected body, which wields most of the power in the EU, is considering proposing new laws to “change how social media companies filter information”.\nWhile the two units that MEPs voted to boost focus on “Russian” and Islamic State propaganda, EU foreign policy chief Federica Mogherini said on Tuesday that it could be worth setting up more programmes, which would counter “fake news”.\nAn official working on the programme claimed Germany was targeted by “Russian propaganda”, most of which apparently took the form of “online posts [which] were personal attacks on [Chancellor Angela] Merkel”.\nThe group says they have seen an increase in “fake news” that “often aims to discredit the European Union”, according to EurActiv.com.\nRussian President Vladimir Putin said the resolution passed by MEPs is a sign of the “political degradation” of the “idea of democracy” in the West. “Everyone tries to lecture” Russia on democracy, yet European lawmakers are resorting to using restrictions “which is not the best way to handle issues”, he said.\nOn Wednesday following the vote, the press release of which singles out RT and Sputnik as particularly dangerous examples of “propaganda”, he said: “The best approach is an open discussion, in which bright and solid arguments to support one’s point of view should be presented.”","url":"https://www.breitbart.com/europe/2016/11/25/eu-vote-populism-russian-propaganda/"}
