{"authors":["Virginia Hale"],"date_download":"2018-10-30 20:05:45","date_modify":"2018-10-30 20:05:45","date_publish":"2017-03-03 16:23:37","description":"MEPs urged the EU suspend visa-free access to U.S. citizens, weeks after slamming President Trump's travel 'ban' applying to seven nations","filename":"data/vaneerConsumption/MEPsVotetoSuspendVisaFreeTravelforUSCitizens.json","image_url":"https://media.breitbart.com/media/2017/03/EU-executive-opposes-call-for-easier-suspension-of-visa-free-travel.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_03_03__1540929945.html","title":"MEPs Vote to Suspend Visa-Free Travel for U.S. Citizens","title_page":"MEPs Vote to Suspend Visa-Free Travel for U.S. Citizens | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"MEPs have demanded the bloc suspend visa-free access to U.S. citizens because Washington excludes citizens of five European Union (EU) countries from its no-visa policy.\nDespite warnings that such a move would damage Europe’s tourism industry, MEPs called for the reintroduction of visas for U.S. citizens in a vote that the Wall Street Journal said reflects “hostility among some European politicians to the Trump administration”.\nBy a show of hands on Thursday, European Parliament urged the Commission to adopt restrictive measures against U.S. citizens “within two months”, citing Washington’s’ policy of denying visa-free travel to citizens of Romania, Bulgaria, Croatia, Cyprus, and Poland.\nA regulation which entered into force at the end of 2013 requires countries in Europe “react in common” where foreign countries “subject [EU] citizens to differing treatment”.\nWhile the Commission was legally bound to propose by last April that visas be reintroduced, the bloc’s member states preferred to take no action.\nThe resolution to suspend the Visa Waiver Programme with the U.S. for a year would make it more complicated and costly for Americans to travel to Europe, when some 30 million American tourists visit Europe each year and spend more than £44 billion.\nThe European Travel Commission (ETC) warned a ‘visa war’ with the U.S. could inflict serious harm on the continent’s tourism industry.\n“Making it more difficult for US citizens to travel to Europe would certainly deprive the European travel and tourism sector of essential revenue, and put thousands of European jobs at stake in one of the few sectors which experiences a strong growth in employment,” wrote executive director of the ETC Eduardo Santander, in a joint letter with Michael de Blust, secretariat of the Network for the European Private Sector in Tourism, to MEPs.\nIstván Ujhelyi, MEP and chair of European Parliament’s Tourism Task Force, said it’s wrong to reintroduce visas at a time when terror attacks in Europe are already putting tourists off visiting the continent.\n“The effect of terrorism in Europe in recent years emphasised how fragile our appeal is as a destination in long-haul markets.\n“This is not a time to put unnecessary obstacles in the way of one of the sectors most capable of generating employment,” he said.\nTerror attacks and rising violence saw Paris and the surrounding area lose 1.5 million tourists in 2016, with the region losing €1.3 billion in revenue as visitors chose to stay away.\nAccording to Reuters, the European Commission has already contacted Washington, D.C. “to push for full visa reciprocity”, and the body says it will “report on further progress made before the end of June”.\nIn response to the EU vote, a State Department official told Telegraph Travel: “The objective of the U.S. Visa Waiver Program is to facilitate travel to the United States while maintaining the highest standards of screening to protect national security.\n“The program is open to countries that have very low non-immigrant visitor visa refusal rates and immigration violations, issue secure travel documents, and work closely with U.S. law enforcement and security authorities.”","url":"https://www.breitbart.com/europe/2017/03/03/meps-suspend-visa-free-travel-us/"}
