{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 21:28:28","date_modify":"2018-10-30 21:28:28","date_publish":"2015-11-15 20:26:19","description":"Nick Alexander, 36, the merchandise manager for the rock band Eagles of Death Metal, was among the scores killed in the Paris attacks.","filename":"data/vaneerConsumption/MerchManagerforEaglesofDeathMetalKilledinParisAttack.json","image_url":"https://media.breitbart.com/media/2015/11/Screen-Shot-2015-11-15-at-12.23.43-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_15__1540934908.html","title":"Merch Manager for Eagles of Death Metal Killed in Paris Attack","title_page":"Merch Manager for Eagles of Death Metal Killed in Paris Attack","title_rss":"NULL","source_domain":"breitbart.com","text":"Nick Alexander, the merchandise manager for the rock band Eagles of Death Metal, was among the scores killed at the Bataclan theater Friday night during the coordinated terrorist attacks in Paris, France. He was 36.\n“It is with huge sorrow that we can confirm that our beloved Nick lost his life at the Bataclan last night,” Alexander’s family said in a statement. “Nick was not just our brother, son and uncle; he was everyone’s best friend–generous, funny and fiercely loyal. Nick died doing the job he loved and we take great comfort in knowing how much he was cherished by his friends around the world. Thank you for your thoughts and respect for our family at this difficult time. Peace and light.”\nAlexander’s apparent girlfriend, Polina Buckley, posted a heart-rending tweet:\nAnd, later:\nAlexander was a veteran tour merchandise manager, having previously worked with high-profile bands like the Black Keys, Sum 41 and Panic! at the Disco, according to Rolling Stone. Helen Wilson, Alexander’s ex-girlfriend, was inside the theater with him when the shooting began. Wilson, who was shot in both thighs, described the scene to the Telegraph:\n“Nick was in front of me when we were lying on the ground and somebody moved and they just turned round and started shooting us. His back was to me and I couldn’t see what happened and I tried to keep him talking and then I tried to give him mouth-to-mouth resuscitation and they [the gunmen] were just sort of in the shadows and they would shoot if anyone said anything. Then he couldn’t breathe any more and I held him in my arms and told him I loved him. He was the love of my life.”\nTributes to the slain Briton poured out over the weekend from many of the musicians he worked with. “Just found out Nick Alexander was one of the people murdered last night in Paris,” Fall Out Boy guitarist Joe Trohman wrote in a Twitter post. “Great guy. I’m horrified.”\nJust found out Nick Alexander was one of the people murdered last night in Paris. Great guy. I’m horrified. #RIPNickAlexander — _ (@trohman) November 14, 2015\nBlack Keys drummer Patrick Carney described Alexander as a “really organized, super hard worker,” who was also “really funny.”\n“I spent a lot of time with Nick, but the thing about the touring merch job, it’s one of the more thankless jobs. You do it because you just want to travel and you’re interested in meeting new people and it’s really hard work. It’s not the job you take if you’re into partying, Carney told Rolling Stone. “I remember him always very content with being on tour. It was what seems to make him the happiest. After shows, when everyone would go wild or whatever, he would also be really reserved. He was just a sweetheart, that guy.”\nThe band Alice in Chains expressed its condolences in a Facebook post on Saturday, alongside an old photo of Alexander.\n“Nick was a great guy and a true professional. It was an honor and a pleasure to work with him,” the band wrote. “Please keep Nick and his family in your thoughts, along with all of the other victims of yesterday’s brutality. Life is short. Be good to each other.”\nA GoFundMe campaign to help Alexander’s family pay for memorial costs raised more than $50,000 in one day.","url":"https://www.breitbart.com/national-security/2015/11/15/merch-manager-eagles-death-metal-killed-paris-attack/"}
