{"authors":[],"date_download":"2018-10-30 17:56:22","date_modify":"2018-10-30 17:56:22","date_publish":"2015-08-27 19:18:21","description":"German luxury automaker Mercedes-Benz this week signed a multimillion-dollar deal that officials said is aimed at further cementing the company’s relationship with Atlanta, home of its new U.","filename":"data/vaneerConsumption/MercedesBenzontargetwithsuperlativeaboutAtlantastadium.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/08/27/Images/photos.medleyphoto.8034846.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_74a40aa5c1b5dbb5d620a71fb91094df__1540922182.html","title":"Mercedes-Benz on target with superlative about Atlanta stadium...","title_page":"Mercedes-Benz on target with superlative about Atlanta stadium...","title_rss":"NULL","source_domain":"ajc.com","text":"German luxury automaker Mercedes-Benz this week signed a multimillion-dollar deal that officials said is aimed at further cementing the company’s relationship with Atlanta, home of its new U.S. headquarters.\nMercedes-Benz bought the rights to have its name on the still-under construction $1.4 billion stadium that’s to be home to the National Football League’s Atlanta Falcons and Major League Soccer’s Atlanta United.\nMercedes-Benz CEO Steve Cannon told reporters Monday that buying the naming rights to the new Falcons stadium is the largest marketing deal in the company’s history.\nPolitiFact decided to dig deeper.\nIt’s common for teams not to disclose the financial numbers, and, at Monday’s press conference, officials were mum about the cost to Mercedes-Benz for the near-record 27 year naming rights. (The Atlanta Falcons keep all revenue from the naming rights under a stadium agreement they struck with the city of Atlanta and Georgia World Congress Center.)\nThe Falcons said the goal was to land a deal in the upper range of NFL naming-rights agreements. The largest such deals are a reported $17 million-plus per year for both the New York Giants/Jets’ MetLife Stadium and the Dallas Cowboys’ AT&T Stadium and $11 million a year for the San Francisco 49ers’ Levi’s Stadium.\nWe contacted Donna Boland, manager of corporate communications for Mercedes-Benz USA LLC. We asked for evidence supporting Cannon’s statement.\n“Since he’s been with the company for 24 years, more or less, you can take him at his word that this is the biggest marketing initiative we’ve undertaken,” she said.\nBoland went on to say: “Unfortunately, as a matter of policy, we don’t disclose marketing/sponsorship costs – for this or for the Saints….”\nPolitiFact reached out to three academics who focus on sports economy. Their estimates of the annual value of the naming rights ranged from a low of $8 million to a high of $20 million.\nDon Muret, who covers sports venues for Sports Business Journal, put the price of the naming rights in Atlanta at $12 million a year.\nAndrew Zimbalist, professor of economics at Smith College, valued the naming rights deal “in the neighborhood of $8 million to $10 million a year,” or minimally $216 million for 27 years.\nJoel Maxcy, associate professor in the Department of Sports Management at Drexel University in Philadelphia, had the highest projection: $20 million a year, on par with the Dallas and Giants/Jets deals.\nMaxcy said it is likely a very good deal for Mercedes-Benz, given the national and regional television exposure.\n“When you take the gross value — say $20 million over 27 years for naming rights, that’s why it expands into the biggest deal ever,” Maxcy said. “ But in 10 years or 12 years, when everybody’s paying double that [for naming rights] that looks really good.”\nVictor Matheson, professor of economics at College of Holy Cross in Worcester, Mass., said he expects the naming rights went for about $11 million, which is what Levi’s paid for the stadium in San Francisco and is about right “given the size of Atlanta.”\nThe naming rights deal in Atlanta is one of, but not the longest around, Matheson said. American Airlines has rights to the basketball/hockey area in Dallas for 30 years, he said.\nMercedes-Benz has had commercials in past SuperBowls, not a spare-change ticket item. Reports say its naming rights in New Orleans is costing $60 million. On the low end of the estimates we received, the Atlanta naming rights — 27 years at $8 million — would total $216 million. (On the high end, 27 years at $20 million, the number jumps to $540 million.)\nThe company also has its names on arenas in Shanghai China and Stuttgart Germany. Sports Business Journal has reported that Mercedes-Benz signed the Shanghi deal in 2009 for 10 years at $6 million a year, $60 million total.\nWe tried to find out about Mercedes-Benz marketing investments, but the closest we could come was figures on what it spends on advertising. The auto maker spends about $340 million a year in the U.S. on advertising across all media, according to the monitoring service Kantar Media.\nBradley Johnson, director of data analytics for the trade publication Advertising Age, said the Mercedes-Benz stadium deal in Atlanta will likely account for just a small part of the automaker’s annual marketing budget.\nParent company Daimler in 2014 had estimated U.S. ad spending of $561.9 million, primarily for its Mercedes-Benz business, Johnson said, noting that Daimler also markets trucks and buses under brands including Freightliner, Thomas Built Buses, Western Star and Fuso.\n“If Mercedes says this is its largest marketing deal ever, then it presumably is Mercedes’ largest marketing deal ever,” he said. “But most of Mercedes’ ongoing marketing spending doesn’t relate to a single deal. Over the period of this stadium deal, Mercedes is destined to spend billions of dollars on U.S. marketing.”\nOur ruling Steve Cannon, CEO of Mercedes-Benz, said at a press conference on Monday, that buying the naming rights to the new Falcons stadium is the largest marketing deal in Mercedes-Benz history.\nThe cost of those naming rights wasn’t disclosed. The company didn’t provide any evidence to back up his statement when we asked.\nExperts we talk to said the naming rights probably are costing the luxury car dealer between $8 million and $20 million a year, which over 27 years would be on the low end $216 million. Industry analysts say Mercedes-Benz may spend close to that top dollar figure in a single year, but not on a single marketing deal.\nWe rate the statement Mostly True.","url":"https://www.ajc.com/news/state--regional-govt--politics/mercedes-benz-target-with-superlative-about-atlanta-stadium-rights/7s8RIpzUrbrOwJu36yWrTI/"}
