{"authors":["Andrew Meola"],"date_download":"2018-10-30 21:13:14","date_modify":"2018-10-30 21:13:14","date_publish":"2016-12-21 00:00:00","description":"As the payment ecosystem grows, so does the merchant services industry. Discover the key companies, market trends, and emerging technologies for this goliath industry.","filename":"data/vaneerConsumption/MerchantServicesIndustryKeyPlayersTrendsMarketOutlookBusinessInsider.json","image_url":"https://amp.businessinsider.com/images/5823961c691e88014a8b51b5-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_merchant-services-industry-key-players-market-trends-2016-11_1540933994.html","title":"Merchant Services Industry - Key Players, Trends, & Market Outlook - Business Insider","title_page":"    Merchant Services Industry - Key Players, Trends, & Market Outlook - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence The payments ecosystem is becoming larger and more complex by the day, and the merchant services industry is growing along with it.\nMerchant services is a broad term that refers to financial services for businesses, but it most often refers to processing services that allows merchants to accept transactions through credit and debit cards, as well as mobile payments. Merchant services can also encompass payment gateways, gift cards, loyalty programs, online transaction processing, and more.\nMerchant service providers, or MSPs, are poised to thrive as the payments ecosystem becomes increasingly digital. Below, we've outlined some merchant services industry trends (including industry size), major providers, and key players in this market.\nThe Merchant Services Industry Explained\nMSPs sell payment processing services to merchants on behalf of acquirers and processors, but they are not actual banks. They can also sell and lease payment terminals, and typically do so regionally through boots-on-the-ground sales tactics. Major banks often don't have the time to sell their products to millions of merchants, so MSPs step in to make this happen.\nMSPs also offer customer service and operate as the main point of contact for the merchant once the payment terminal is operational.\nMerchant Services Market Stats, Trends, and Predictions\nAs stated at the top, the merchant services industry is growing as the payments ecosystem, particularly digital payments, grows. And yet, Independent Sales Organizations (ISOs) and MSPs are rarely at the forefront of financial services innovation.\nIt is \"very rare to see breakthrough strategies in acquiring,\" said Marc Abbey, principal at First Annapolis Consulting Inc., according to ISO & Agent. \"I've been doing this 25 years, and I have seen maybe a few during that time.\"\nIn lieu of true innovation or breakthroughs, ISOs and MSPs will face smaller struggles in the next few years; however, the framework is in place to bring about some changes, according to Abbey. The payment facilitators model, in particular, is pushing these changes through new technology, alternative pricing plans, and business models that didn't even exist a few years ago.\nThe facilitators in this space are contributing to the payments ecosystem as integrated software vendors and value-added resellers, and others are shifting their approaches through open networks and integrate payments.\n\"It's only the second inning for this part of the business, but it is a rising distribution model that has a whole lot of advantages, and you can see that phenomenon having the potential to really change the market,\" Abbey said.\nHe added that ISOs will find it much harder to stick to their old ways and to look at the payments and acquiring industry in broad and general terms. Instead, each company will need to develop a niche business model that caters to specific markets.\nTop Merchant Services Providers\nThe following are some of the major merchant services providers on the market today:\nMore to Learn\nGlobal Merchant Services Sage Payment Solutions North American Bancard Global Payments Direct Clearent National Discount Merchant Services National Merchant Center Heartland Payment Systems Costco Ignite Payments Star Data Payment Systems Sterling Payment Technologies Indigo Payments Strategic Payment Systems Allegiance Merchant Services Cybersource Alliance Bancard Systems Cynergy Data North American Credit Card Association Orion Payment Systems Tri Source Solutions TSYS Merchant Solutions U.S. Bankcard Services Powerpay Braintree Payment Solutions Vantiv Flagship Merchant Services Merchant Solutions Forte Payment Systems Volusion Moneris Solutions\nMerchant service providers are just one piece of the broader payments ecosystem, which now includes acquirers, processors, merchants, card networks, and more.\nThat's why BI Intelligence spent months compiling the greatest and most comprehensive guide on the world of payments entitled The Payments Ecosystem Report: Everything You Need to Know About The Next Era of Payment Processing.\nTo get your copy of this invaluable guide to the payments industry, choose one of these options:\nSubscribe to an ALL-ACCESS Membership with BI Intelligence and gain immediate access to this report AND over 100 other expertly researched deep-dive reports, subscriptions to all of our daily newsletters, and much more. >> START A MEMBERSHIP Purchase the report and download it immediately from our research store. >> BUY THE REPORT\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of the fast-moving world of the payments ecosystem.","url":"https://www.businessinsider.com/merchant-services-industry-key-players-market-trends-2016-11"}
