{"authors":[],"date_download":"2018-10-30 21:05:25","date_modify":"2018-10-30 21:05:25","date_publish":"2016-11-30 14:01:00","description":"Mercedes-Benz Stadium officials announced Wednesday the lineup of restaurant partners that will be f...","filename":"data/vaneerConsumption/MercedesBenzStadiumunveils15restaurantpartners.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/30/Images/falcons-inside.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_mercedes-be_6e23de92ac02aa3aaf4cdc2b49e4c65b__1540933525.html","title":"Mercedes-Benz Stadium unveils 15 restaurant partners","title_page":"New Atlanta Falcons stadium announces list of restaurants for 2017","title_rss":"NULL","source_domain":"ajc.com","text":"Mercedes-Benz Stadium officials announced Wednesday the lineup of restaurant partners that will be featured in the new Falcons stadium when it opens next year.\nThe partners, mostly Atlanta-based, will offer menu items “priced comparably or the same as what is found in their respective restaurants,” according to the announcement.\nHere’s the lineup provided by stadium officials:\n• Antico pizza\n• Bruster’s Real Ice Cream\n• Chick-fil-A\n• Golden Brown & Delicious, a Southern concept from Concentrics Restaurants\n• Delia’s Chicken Sausage\n• Farm Burger, locally-sourced grass-fed beef burgers\n• Fox Bros. Bar-B-Q\n• Iberian Pig, modern Spanish fare by Castellucci Hospitality Group\n• Jim ‘N Nicks barbeque\n• Kevin Gillespie’s Gamechanger, “big flavors with playful riffs on American indulgence”\n• King of Pops, popsicles\n• Miss D’s Popcorn (also pralines and sweets)\n• Snackology 101 Market, natural and organic foods\n• Sublime Doughnuts\n• The Varsity, “iconic hot dogs and part of Atlanta’s history since 1928”\nMercedes-Benz Stadium and concession partner Levy Restaurants polled some 4,000 Falcons and Atlanta United fans about the types of food and restaurants they want in the stadium, according to the announcement.\nEarlier this year, the stadium unveiled a plan to buck sports-industry tradition with sharply reduced prices on some popular concession-stand items, including $2 hot dogs, $2 soft drinks (with free refills) and $3 nachos.\nAtlanta Falcons reveal new food prices for new stadium\nMercedes-Benz Stadium, scheduled to open next summer, will be home to the Falcons and the Atlanta United soccer team. College football’s national championship game will be played there in January 2018, the Super Bowl in February 2019 and college basketball’s Final Four in April 2020.","url":"https://www.ajc.com/sports/football/mercedes-benz-stadium-unveils-restaurant-partners/Aay0h3P90GbFUiDHtl9VYL/"}
