{"authors":[],"date_download":"2018-10-30 19:29:24","date_modify":"2018-10-30 19:29:24","date_publish":"2017-04-07 19:07:00","description":"Falcons officials, who said March 29 they would update the construction schedule for Mercedes-Benz S...","filename":"data/vaneerConsumption/MercedesBenzStadiumconstructionupdatepushedback.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/07/Images/newsEngin.18337271_040417-atlanta-aerials-ba-012.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_mercedes-be_ceca17b6d5764d605236608376a6c0a1__1540927764.html","title":"Mercedes-Benz Stadium construction update pushed back","title_page":"Mercedes-Benz Stadium construction update pushed back","title_rss":"NULL","source_domain":"ajc.com","text":"Falcons officials, who said March 29 they would update the construction schedule for Mercedes-Benz Stadium within seven to 10 days, now say it will take a while longer to assess the timeline.\nThat leaves open the question of whether the downtown stadium will host its first event as scheduled July 30 or be delayed for the third time.\n“We don’t expect to have an update for at least a week,” Brett Jewkes, senior vice president and chief communications officer of Falcons parent company AMB Group, said Friday.\nThe construction teams “are going around the clock, and it’s going well, but they are still working through a lot of information and interdependent work schedules,” Jewkes said. “If and when we have anything to update, we will.”\nIssues associated with the stadium’s complex retractable roof already have delayed the stadium’s opening twice, first pushing the target from March 1 to June 1 and then pushing it further to July 30, and threaten another delay.\nQuestions also loom about whether games could be played in the stadium before the roof is completed and fully operable, if necessary.\nMercedes-Benz Stadium’s first scheduled event is an Atlanta United soccer match July 30, followed by two more soccer matches in August and two Chick-fil-A Kickoff college football games in early September: Alabama vs. Florida State on Sept. 2 and Georgia Tech vs. Tennessee on Sept. 4. Dates for Falcons home games are expected to be announced by the NFL the week after next, along with the rest of the league’s 2017 schedule.\nGary Stokan, who runs the Chick-fil-A Kickoff event as president and CEO of Peach Bowl Inc., said this week that his organization has “full assurances from the Falcons” that the Alabama-FSU and Tech-Tennessee games can be played in the new stadium.\nStokan said there hasn’t been any discussion about whether the games would be played with the roof open or closed.","url":"https://www.ajc.com/sports/football/mercedes-benz-stadium-construction-update-pushed-back/XBLRt6ALbcYOF68OKKUVfJ/"}
