{"authors":["Associated Press"],"date_download":"2018-10-23 02:06:07","date_modify":"2018-10-23 02:06:07","date_publish":"2017-04-26 13:01:00","description":"BERLIN (AP) - German Chancellor Angela Merkel's spokesman backed the country's foreign minister on Wednesday in a spat over his meeting with a rights group...","filename":"data/vaneerConsumption/MerkelspokesmanbacksGermanministerinIsraelvisitspat.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/15/wire-465833-1493217670-416_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447516_Merkel-spokesman-backs-German-FM-spat-Israel-visit_1540260367.html","title":"Merkel spokesman backs German minister in Israel visit spat","title_page":"Merkel spokesman backs German minister in Israel visit spat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BERLIN (AP) - German Chancellor Angela Merkel's spokesman backed the country's foreign minister on Wednesday in a spat over his meeting with a rights group in Israel, saying that it must be possible to meet critical organizations in a democracy.\nPrime Minister Benjamin Netanyahu abruptly canceled planned talks Tuesday with visiting Foreign Minister Sigmar Gabriel over his meeting with Breaking the Silence, a group critical of Israeli military actions in the West Bank.\nNetanyahu said he won't see visiting diplomats who meet groups \"that slander (Israeli) soldiers and seek to put our soldiers on trial as war criminals.\"\nGerman Foreign Minister, Sigmar Gabriel looks on during his meeting with Israel's President, Reuven Rivlin at the President's residence in Jerusalem, Tuesday, April 25, 2017. Gabriel said Tuesday it would be \"regrettable\" if Israeli Prime Minister Benjamin Netanyahu cancels their planned talks in Jerusalem because of his meeting with groups critical of Israel's actions in the West Bank, but downplayed the spat. (AP Photo/Sebastian Scheiner)\nMerkel spokesman Steffen Seibert said the chancellor considers it \"regrettable\" that the meeting with the Israeli premier didn't happen.\n\"In a democracy it should be possible for foreign visitors to speak without problems to critical representatives of civil society,\" Seibert told reporters in Berlin, noting that the chancellor herself regularly meets non-governmental organizations on foreign trips.\nHe said that Gabriel and Merkel, who belong to different political parties \"were in regular contact, as they always are.\"\nThe last-minute cancellation cast a cloud over a visit that had been meant to draw attention to years of friendship between the two countries and coincided with Israel's annual Holocaust memorial day. However, both sides were keen to stress that they didn't expect any long-term impact on relations.\n\"All this changes nothing about the paramount significance of our relations with Israel,\" Seibert said.\nGermany's largely ceremonial president, Frank-Walter Steinmeier, is due to visit Israel and the Palestinian territories May 6-9 on a previously arranged trip. The studiously diplomatic Steinmeier was Germany's foreign minister until January.\nAmnesty International said it was \"concerned\" by Netanyahu's decision to \"boycott officials who meet with organizations that are acting against his policy.\"\n\"This is yet another mean of delegitimizing human rights organizations,\" the group said in a statement.","url":"https://www.dailymail.co.uk/wires/ap/article-4447516/Merkel-spokesman-backs-German-FM-spat-Israel-visit.html"}
