{"authors":[],"date_download":"2018-10-30 21:55:21","date_modify":"2018-10-30 21:55:21","date_publish":"2015-10-19 09:39:13","description":"Mrs Merkel has hailed progress in helping Ankara deal with refugees and vowed to push forwards the long-stalled Turkish EU membership bid.","filename":"data/vaneerConsumption/MerkelHailsRefugeeProgressWithTurkeyVowsToPushTurkishEUMembershipBid.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_10_19__1540936521.html","title":"Merkel Hails Refugee Progress With Turkey, Vows To Push Turkish EU Membership Bid","title_page":"Merkel Hails Refugee Progress With Turkey, Vows To Push Turkish EU Membership Bid","title_rss":"NULL","source_domain":"breitbart.com","text":"German Chancellor Angela Merkel on Sunday hailed progress in helping Ankara deal with the refugee crisis and vowed to push forwards its long-stalled EU membership bid, as Slovenia warned it would have to slow a rising influx of migrants.\nMerkel held talks in Istanbul with Prime Minister Ahmet Davutoglu and President Recep Tayyip Erdogan on a critical one-day visit, which came as Germany was shaken by a bloody knife attack on a pro-refugee politician.\nThe European Union wants Turkey to do more to tighten its border security and help contain the historic influx of Syrians and others escaping conflict, persecution and poverty.\nIn return, Ankara wants greater recognition for its role in hosting over two million Syrian refugees, an increase in financial help and an acceleration of its stuttering drive for EU membership.\nMerkel and the Turkish leadership indicated that officials were making progress towards a deal on cooperation, although neither suggested a final agreement had been reached.\nThe German chancellor said that Berlin was prepared to support opening Chapter 17 of the accession process — which deals with economic and monetary affairs — and consider opening other chapters.\nSpeaking after her talks with Erdogan, Merkel said the EU and Turkey were in agreement to work closer “on dynamising the accession process” towards Turkey’s EU membership and also visa liberalisation for Turks wanting to travel to the EU’s Schengen zone.\n“The talks in that direction are very promising and will be continued,” said Merkel, sitting on a large golden chair alongside the Turkish strongman.\nErdogan, who for months has bitterly criticised the EU’s attitude towards Turkey, said he was also calling for more accession chapters to be opened.\nDavutoglu praised a “better approach” from the European Union on dealing with the over two million people who fled Syria’s civil war for Turkey.\n“Unfortunately Turkey was left alone by the international community in terms of burden sharing.”\n“We are very pleased there is a better approach now,” said Davutoglu.\nGermany has been Europe’s top destination for refugees, most of whom travel through Turkey and the Balkans, and is expecting to register up to a million asylum requests this year.\n– ‘Engage ourselves more’ –\nMerkel said that the fact Turkey had accomplished the immense task of looking after over two million Syrian refugees on relatively little funding had led to a “migration pressure” which resulted in the current unprecedented influx of migrants into Europe.\n“Turkey had little international help until now for the huge contribution it has made,” said Merkel.\nShe said it was in the interests of neither side that this resulted in illegal migration into the EU.\n“This cannot be the aim. We will engage ourselves more strongly financially as the European Union. Germany will play its part,” she promised.\nMore than 630,000 people fleeing war and misery have landed on Europe’s shores this year, many making risky sea crossings from Turkey to Greece.\nAnother 12 people drowned off the Turkish coast on Saturday, and on Sunday the Greek coastguard said five migrants including a baby and two boys had died trying to cross the Aegean Sea.\nWhile many Germans have welcomed the refugees, there has also been a backlash with her party losing support and the long-dormant anti-Islamic PEGIDA protest movement has again drawn thousands of followers.\nSimmering tensions ended in violence in the western city of Cologne on Saturday when a man with a knife attacked the independent mayoral hopeful Henriette Reker, 58, who is active in helping refugees, leaving her with serious neck wounds and injuring four others.\nThe attacker, a 44-year-old unemployed man arrested at the scene, had “a racist motivation” according to police, and was said to have been close to the extreme right in the 1990s.\nDespite the attack, voting was under way on Sunday for the mayorship of Cologne.\n– Slovenia bottleneck fears –\nAs the influx continued, Hungary closed its border with Croatia, forcing thousands of migrants to find a new route to northern Europe through Slovenia and into Austria.\nBut with numbers growing, Slovenia warned Sunday it would be forced to slow down the influx of migrants amid fears of a human bottleneck.\nThe government in Ljubljana said it had refused on Sunday to allow in a train carrying 1,800 migrants from Croatia, after more than 3,000 people surged into the tiny EU member state the day before.\nGerman police union chief Rainer Wendt told the Welt am Sonntag newspaper Germany should build a fence along its border with Austria.\n“If we close our borders this way, Austria will also close its border with Slovenia, and that’s exactly the effect we need,” he said.\nDavutoglu also warned that new fighting around the northern Syrian city of Aleppo risks creating “significant new waves of migration”.\nHe said that “some Iranian militia” and the Lebanese Shiite militant group Hezbollah had been putting pressure on Aleppo, leading to greater fighting coupled with the air strikes by Russia which Turkey has vehemently opposed.","url":"https://www.breitbart.com/europe/2015/10/19/merkel-hails-refugee-progress-turkey-vows-push-turkish-eu-membership-bid/"}
