{"authors":[],"date_download":"2018-10-22 20:49:10","date_modify":"2018-10-22 20:49:10","date_publish":"2014-05-04 14:34:00","description":"Saudi health officials reported 15 more people diagnosed with the deadly MERS virus on Sunday while the first US case was improving in Indiana.","filename":"data/vaneerConsumption/MERSSpreadsinSaudi1stUSCaseStableInHospital.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_21/419041/140504-mers-disease-micrograph-1050a_433d31561d068e2781644c033ba24b7f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_mers-mystery_mers-spreads-saudi-1st-us-case-stable-hospital-n96616_1540241350.html","title":"MERS Spreads in Saudi; 1st US Case Stable In Hospital","title_page":"MERS Spreads in Saudi; 1st US Case Stable In Hospital","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSaudi health officials reported 15 more people diagnosed with the deadly MERS virus on Sunday, while the first case seen in the United States, a health worker who had been in Saudi Arabia, was in good condition in an Indiana hospital.\nSaudi Arabia has seen a big jump in cases in the past few weeks and hospital officials around the world are on alert because some of the clusters are clearly happening in hospitals. At least five of the cases reported Sunday were at a government hospital in Riyadh.\nThe patient in Indiana is being kept isolated and hospital workers there are using special precautions to make sure the virus doesn’t spread.\n\"The patient is in full isolation and presents no risk to patients, staff or the general community,\" said Don Fesko, CEO of Community Hospital in Munster, Indiana. \"We are thoroughly prepared to handle respiratory infections. We continue to work closely with the CDC and State Health Department and are following every recommendation. Safety is our top priority.\"\nMiddle East Respiratory Sydrome (MERS) virus was first seen in 2012 and most cases are linked to the Middle East, although it’s now been seen in more than a dozen countries around the world. Many of those who are sick enough to show symptoms have had other conditions, such as cancer, diabetes or kidney disease.\nThe virus has killed more than 100 people and infected more than 300. But as scientists test more and more people in close contact with victims, they are finding some people appear to have been infected without ever having gotten sick. Saudi officials say four of the 15 cases reported Sunday did not ever become ill.\nMERS also doesn’t seems to be easily transmitted. Nonetheless, Centers for Disease Control and Prevention experts are tracking down people who had been in contact with the Indiana patient just to be sure and to caution them to be on the lookout for symptoms such as cough and fever.\n\"We are very pleased the patient is improving and no other cases have been identified at this time,\" said Indiana State Health Commissioner Dr. William VanNess. \"The swift diagnosis and precautionary measures taken have undoubtedly greatly helped reduce the risk of this potentially serious virus spreading.\"","url":"https://www.nbcnews.com/storyline/mers-mystery/mers-spreads-saudi-1st-us-case-stable-hospital-n96616"}
