{"authors":["James Burton For The Daily Mail"],"date_download":"2018-10-22 22:45:45","date_modify":"2018-10-22 22:45:45","date_publish":"2017-03-10 01:31:59","description":"The former Bank of England governor mounted a defence of the UK’s prospects after leaving the EU – advocating a hard Brexit with no transitional deals, and no customs union.","filename":"data/vaneerConsumption/MervynKingtellsBrusselswedontneednegotiation.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/0456AFE200000514-0-image-a-66_1489109124370.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299638_Mervyn-King-tells-Brussels-don-t-need-negotiation_1540248345.html","title":"Mervyn King tells Brussels we don't need negotiation","title_page":"Mervyn King tells Brussels we don't need negotiation | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mervyn King (pictured) said Britain should quit the single market and set its own terms for immigration\nBritain should quit the single market and set its own terms for immigration in order to get the best deal from Brexit, Lord Mervyn King has said.\nThe former Bank of England governor mounted a spirited defence of the UK’s prospects after leaving the EU – advocating a hard Brexit with no transitional deals, and no customs union.\nThe 68-year-old said that the country could rebalance its trade deficit and that the City would continue to thrive if the UK went out on its own.\n‘I’m not a great fan of any transitional arrangements or deals,’ he said. ‘We should make very clear what our position is.’\nLord King said that because Britain imported far more from the EU than it exported to the Continent, it was in a strong negotiating position and could expect foreign leaders to be keen for compromise.\n‘We don’t need to negotiate very much, actually,’ he said in an interview with Bloomberg. ‘It’s they who need to negotiate with us.’\nThe peer, a renowned economist who ran the Bank of England during the financial crisis, also warned that the House of Lords was on dangerous territory after intervening in the Brexit process.\nHe said that the unelected upper chamber should not be seeking to block the will of the people.\n‘The House of Lords needs to be pretty careful about this,’ Lord King said.\n‘There was a referendum, the decision was made very clear by both sides that it would be for the people to decide.\n‘That decision has been reached and now it’s the role of Parliament to implement that.’\nThe Lords have angered Brexit campaigners by passing amendments to a law which gives Theresa May the right to trigger Article 50 and start the Brexit process.\nThey have demanded both a ‘meaningful vote’ on the terms of the exit deal and a guarantee that the rights of EU nationals living in Britain would be unchanged.\nBrexit campaigners reacted furiously to the changes, arguing it was an attempt to make the Government’s negotiations more difficult and ultimately stop us leaving the bloc.\nThe bill will now go back to the House of Commons next week, where both amendments are expected to be removed by MPs.\nIt will then be sent back to the Lords, who will face pressure not to amend it again.\nMrs May is aiming to trigger Article 50 by the end of the month.\nPrime Minister Theresa May is aiming to trigger Article 50 by the end of the month. She has repeated the Government’s pledge to cut immigrant numbers to tens of thousands a year\nIn an interview this week, Lord King said peers were making a grave mistake by seeking to make place conditions on her attempt to get the best deal for Britain.\n‘It would be quite wrong for the House of Lords at this stage to try to lay down conditions as to what should be the process which is followed at the end of that period,’ he said.\n‘It would contravene the expressed wish of the House of Commons, and that of the referendum.’\nSince the referendum, Lord King has been adamant that Britain can thrive outside the EU.\n‘Brexit has had rather little impact on the economy, and may have rather little impact in the long run,’ he said in the Bloomberg interview, conducted earlier in the week.\n‘The political excitement has been enormous, the economic excitement much less so.’\nHe also insisted that it was time for Britain to set its own migration policy – and this should not be up for debate with Brussels.\nMrs May has repeated the Government’s pledge to cut immigrant numbers to tens of thousands a year, and ending free movement from other EU countries is likely to play a key part.\n‘It’s important that the UK now actually is proactive in setting out what the Government’s plan for immigration policy will be,’ Lord King said.\n‘This is not something that should be negotiated with Europe, it’s for the UK to decide.’\nBank bosses were among the biggest critics of Brexit during the Project Fear campaign, with a string of highly paid chief executives lining up to claim they would move jobs out of the country if Leave won.\nKing, a peer and renowned economist who ran the Bank of England during the financial crisis, also warned that the House of Lords was on dangerous territory after intervening in the Brexit process\nAlthough many have since gone quiet – and no jobs have yet been shifted abroad – an intense lobbying effort is underway to squeeze concessions from the Government.\nLord King urged ministers to ignore their pleas and focus on making Brexit work for ordinary people instead.\n‘I don’t think, in financial services, that it would be sensible for the Government to sacrifice the future of the British economy and the decision to leave the EU on the altar of high finance,’ he said.\n‘Actually it will make rather little difference to the major financial institutions.\n‘Some individuals will move, undoubtedly to Europe, but actually many will not.\n‘I think the future of the City of London is secure because of its role in the world as a whole.’","url":"https://www.dailymail.co.uk/news/article-4299638/Mervyn-King-tells-Brussels-don-t-need-negotiation.html"}
