{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 22:19:37","date_modify":"2018-10-22 22:19:37","date_publish":"2017-04-26 04:09:18","description":"The 67-year-old actress wore striking black and white wide-legged trousers, as she attended the 2017 PEN America Literary Gala at American Museum of Natural History in NYC","filename":"data/vaneerConsumption/MerylStreepstrutsherstuffinstripesatthe2017PEN.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/03/3F9BB84D00000578-0-image-a-52_1493173638783.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446156_Meryl-Streep-struts-stuff-stripes-2017-PEN_1540246777.html","title":"Meryl Streep struts her stuff in stripes at the 2017 PEN","title_page":"Meryl Streep struts her stuff in stripes at the 2017 PEN | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's already being hotly tipped for next year's Oscars, in Steven Spielberg's Pentagon Papers drama.\nAnd Meryl Streep once again looked like she was taking life in her stride, as she stepped out in a stunning monochrome ensemble on Tuesday.\nThe 67-year-old actress wore striking black and white wide-legged trousers by Alice + Olivia , as she attended the 2017 PEN America Literary Gala at American Museum of Natural History in NYC.\nBlack and white! Meryl Streep once again looked like she was taking life in her stride, as she stepped out in a stunning monochrome ensemble on Tuesday\nThe Mamma Mia star looked stylish as ever in her outfit, which was completed with a button detail waterfall shirt, and black box jacket.\nIt looked like her footwear had a platform heel, giving her legs even more length.\nThe three-time Academy Award winner piled her blonde tresses into an updo, which left side bangs loose to frame her pretty face.\nRadiant: The 67-year-old actress attended the 2017 PEN America Literary Gala at American Museum of Natural History in NYC\nThe youthful beauty added grey-framed spectacles and soft make-up to highlight her features.\nJust a simple pair of diamond stud earrings were needed to accessorise her simple sartorial style.\nMeryl is starring alongside Tom Hanks in the Spielberg project, which now has a release date of December 22 - qualifying it for the Oscars.\nLooking good: She wore striking black and white wide-legged trousers by Alice + Olivia which was teamed with a button detail waterfall shirt, and black box jacket\nBetween the lines: The Mamma Mia star looked stylish as ever in her outfit as she posed with composer Stephen Sondheim and actress Audra McDonald\nAccording to Variety on Saturday, Hanks will play hard-charging Washington Post editor Ben Bradlee, with Streep handling the role of iron-willed publisher Katharine Graham.\nThe pair made the decision to publish a classified history of the United States’ involvement in the Vietnam War over the objections of the Nixon administration.\nMeryl has 20 nominations for an Academy Award, which is a record number for any actor.\nShe will also play Topsy in Mary Poppins Returns, alongside Emily Blunt and Lin-Manuel Miranda. It's due for release in 2018.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446156/Meryl-Streep-struts-stuff-stripes-2017-PEN.html"}
