{"authors":[],"date_download":"2018-10-22 21:07:19","date_modify":"2018-10-22 21:07:19","date_publish":"2014-05-06 01:33:04","description":"Skywatchers are looking forward to a possible new meteor shower that could send up to 1,000 shooting stars per hour streaking through the sky.","filename":"data/vaneerConsumption/MeteorStormFromCometMayLightUpSkyThisMonth.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/422146/140505-question_6a02fa0ec09b13434c36d428d54e6d16.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_meteor-storm-comet-may-light-sky-month-n97791_1540242439.html","title":"'Meteor Storm' From Comet May Light Up Sky This Month","title_page":"'Meteor Storm' From Comet May Light Up Sky This Month","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nSkywatchers have something exciting to look forward to this month — a possible new meteor shower that could send up to 1,000 shooting stars per hour streaking through the sky.\nOn May 23 and May 24, Earth should plow through debris shed by Comet 209P/LINEAR, astronomers say. These extraterrestrial particles could give stargazers an incredible show as they burn up in the planet's atmosphere. But there's also a chance that the fireworks will fizzle.\n\"This potential new shower is so new that astronomers aren't sure what to expect,\" narrator Jane Houston Jones said in a skywatching video released by NASA's Jet Propulsion Laboratory in Pasadena, Calif., on April 30. \"Predictions run from less than 100 meteors per hour up to an unlikely but possible meteor storm as high as 1,000 per hour.\" [Video: New Meteor Shower Could Blaze Up in May]\nThe shower should appear to radiate from a point near Polaris (the North Star), which lies at the end of the handle of the Little Dipper, Houston Jones added. Observers in southern Canada and the continental United States are particularly well-placed to see the meteors.\nThe skies should be relatively dark on the nights of May 23 and 24, with the moon waning toward its new phase.\nComet 209P/LINEAR — which was discovered in 2004 by the Lincoln Near-Earth Asteroid Research project — makes one trip around the sun every five years or so. The comet is relatively small and dim, but its debris may put on a special show thanks to orbital dynamics.","url":"https://www.nbcnews.com/science/space/meteor-storm-comet-may-light-sky-month-n97791"}
