{"authors":["Associated Press"],"date_download":"2018-10-23 05:40:55","date_modify":"2018-10-23 05:40:55","date_publish":"2016-01-28 21:31:11","description":"PITTSBURGH (AP) — A cardiologist and a woman who ran a Pennsylvania methadone clinic raided by federal agents last fall have been charged with running a pill...","filename":"data/vaneerConsumption/Methadoneclinicheaddoctorchargedwithrunningpillmill.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421094_Methadone-clinic-head-doctor-charged-alleged-pill-mill_1540273255.html","title":"Methadone clinic head, doctor charged with running pill mill","title_page":"Methadone clinic head, doctor charged with running pill mill | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Methadone clinic head, doctor charged with running pill mill\nPITTSBURGH (AP) — A cardiologist and a woman who ran a Pennsylvania methadone clinic raided by federal agents last fall have been charged with running a pill mill.\nDr. Dominic DiLeo, 67, of Uniontown, and Rosalind Sugarmann, 64, of Allison Park, are accused of distributing drugs that weren't for a legitimate medical purpose.\nSugarmann headed the Addiction Specialists clinic in North Union Township that caught fire in July and was raided last fall by federal agents. DiLeo practices in nearby Uniontown.\nThey're charged with 19 counts each of unlawfully dispensing Suboxone, a drug used to treat addicts of heroin and other opiates. Suboxone produces a similar effect, but is less addicting than heroin, and is used to gradually wean addicts off the other drugs.\nBut Suboxone can also be abused by people to get high, and federal prosecutors in Pittsburgh say both defendants illegally supplied the drug to the same unnamed person weekly from March to July, then resuming in September in November.\nThe clinic burned on July 24.\nDiLeo is charged with 194 counts of supplying Suboxone to Sugarmann, on a weekly basis from January 2013 until early July. She is charged with aiding and abetting DiLeo, who allegedly gave the drugs to her under the alias \"Larry Greene,\" according to the indictment.\nDiLeo also faces four counts of giving a different unnamed person Xanax, an anti-anxiety drug, in August and September.\nFederal court records don't list attorneys who could comment on behalf of either defendant. They'll be arraigned Feb. 9 in Pittsburgh.\nDiLeo didn't immediately return a message left at his office Thursday. The number for the addiction clinic has been disconnected.\nDiLeo was sentenced to 10 years in prison for Medicare fraud in the 1990s. He also lost his medical license, but it was reinstated in 2005. His medical license was last renewed in 2014, according to online records with the Pennsylvania Department of State.\nDiLeo was convicted of writing illegal painkiller prescriptions and taking kickbacks that he allegedly spent on extramarital affairs. DiLeo also referred patients to a medical supply company he co-owned, but the patients referred there didn't need the oxygen he prescribed and he faked tests on the company's employees so he could submit fraudulent bills to their insurers.\nMore recently, DiLeo treated inmates at the Fayette County jail under a contract with PrimeCare Medical Inc. Warden Brian Miller told the Uniontown Herald-Standard that DiLeo no longer works for PrimeCare and doesn't have clearance to treat inmates.\nThe warden didn't return a call for additional comment, including explaining how a convicted felon got such clearance in the first place.\nEach count they face carries up to 10 years in prison, except for the four painkiller counts against DiLeo, which carry penalties of five years' each.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3421094/Methadone-clinic-head-doctor-charged-alleged-pill-mill.html"}
