{"authors":["Mark Duell For Mailonline"],"date_download":"2018-10-23 04:45:09","date_modify":"2018-10-23 04:45:09","date_publish":"2017-03-16 15:59:03","description":"Only the South East of England is still enjoying sunshine today - and this will soon disappear tomorrow, as Britain faces rain and winds coming in from the West with daytime temperatures down to 5C.","filename":"data/vaneerConsumption/MetOfficeWeekendwashoutafterhottestdayoftheyear.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E555C9F00000578-0-image-a-221_1489679166653.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320124_Weekend-washout-hottest-day-year_1540269909.html","title":"Met Office: Weekend washout after hottest day of the year","title_page":"Met Office: Weekend washout after hottest day of the year | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Britain is set for a wet and windy weekend as the pleasant early days of spring that saw temperatures reach 19C this week become a distant memory.\nOnly the South East of England is still enjoying sunshine today - and this will soon disappear tomorrow, as Britain faces rain and winds coming in from the West with daytime temperatures as low as 5C in some areas.\nThe Met Office has also issued an ice warning for northern Scotland running into tomorrow morning as blustery showers will turn progressively more wintry, with slight accumulations of snow possible on hills above 700ft.\nA couple enjoy the sunshine and mild weather among the daffodils at St James's Park in London this afternoon\nA group of young people enjoy eating their lunch in the mild spring weather at St James's Park in London today\nA couple take a photograph of the daffodils at St James's Park today on a week that saw temperatures reach 19C in the capital\nYoung people at St James's Park play a game in the mild weather today, one day after the warmest day of the year so far\nIt comes after Britain enjoyed the warmest day of the year so far yesterday as temperatures hit 18.8C (66F) at Kew Gardens in London, beating the previous 2017 record of 18.3C (65F) set in the same place on February 20.\nToday the warmest place in Britain was Shoeburyness in Essex which saw 16.7C (62F), but thermometers are unlikely to beat 12C (54F) in most parts of the country tomorrow, with Scotland falling to 5C (41F) during the day.\nMet Office forecaster Oli Claydon said there would be 'a bit of a change in regime' in the weather over the next few days as conditions turn more unsettled, with a cold front pushing through Britain today.\nHe told MailOnline: 'In London in that South East corner you've got away from the clouds - you're the only ones left with the sun now. The change in conditions is certainly starting to take note in the day tomorrow morning.'\nThe South East is still enjoying mild temperatures this afternoon but it is colder with blustery showers in the North and West\nYour browser does not support the iframe HTML tag. Try viewing this in a modern browser like Chrome, Safari, Firefox or Internet Explorer 9 or later.\nA man jogs through mist at sunrise at Fletcher Moss park in Didsbury, Greater Manchester, this morning\nDaffodils are pictured at sunrise in Didsbury, with the weather about to change over the next few days\nMr Claydon said it would be drier in the South before conditions change on Friday with more wet and windy weather coming in from the West, and there would be more organised bands of rain arriving from early tomorrow.\nHe added: 'From Friday then through the weekend it going to be a wet and windy picture.\n'The further east you are the better chance you have of staying dry. By Monday things are starting to look a little bit drier, although still windy.'\nTonight will be windy in the North and wintry showers will continue to move into western Scotland.\nCloud and drizzle will gradually clear from central Britain, to leave it dry with clear spells during the second half of the night.\nCentral Britain will then enjoy a bright start tomorrow but thickening cloud in the North and West will bring outbreaks of rain.\nThis will slowly spread south across the country, although it will remain dry in the far South East.\nA man jogs down a tree-lined path through mist at sunrise in Didsbury as temperatures are expected to fall this weekend\nMist covers a rugby pitch at Fletcher Moss Park in Didsbury this morning as Britain prepares for a wet and windy weekend\nBritain enjoyed the warmest day of the year so far yesterday as temperatures hit 18.8C. Didsbury is pictured this morning\nA duck at sunrise in Fletcher Moss Park in Didsbury this morning, on what is forecast to be a windy day in the North\nA small fishing boat at Cullercoats Bay on North Tyneside today, after yesterday which was was the hottest day of 2017 so far\nSaturday will be cloudy and wet to start, with persistent rain for central Britain. The South will face light rain with hill snow likely for the Scottish mountains, but it will turn drier and brighter during the afternoon.\nThen on Sunday it will be windy in the North with persistent rain in the morning. Showers will move into western areas during the afternoon, with the brightest conditions likely in the East.\nTemperatures are expected to be between 5C and 8C in Scotland tomorrow, 8C to 10C in the North of England and 10C to 12C in the South. This weekend it will be about 10C to 11C in Scotland and the North, while 15C is possible in the South.\nThe start of astronomical spring is only four days away, with the start date of March 20, although the country has been in meteorological spring since March 1.","url":"https://www.dailymail.co.uk/news/article-4320124/Weekend-washout-hottest-day-year.html"}
