{"authors":["Martin Robinson","Uk Chief Reporter For Mailonline"],"date_download":"2018-10-22 23:57:34","date_modify":"2018-10-22 23:57:34","date_publish":"2016-01-29 12:32:37","description":"Boris Johnson has instead handed Sir Bernard Hogan-Howe, who earns £281,000-a-year, a 12-month contract to run the Metropolitan Police.","filename":"data/vaneerConsumption/MetPolicebossSirBernardHoganHowedeniedthreeyearcontract.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/20AC102600000578-0-image-a-28_1454070734557.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422683_Met-Police-boss-Sir-Bernard-Hogan-Howe-denied-three-year-contract-Boris-row-2m-VIP-abuse-inquiry-takes-toll_1540252654.html","title":"Met Police boss Sir Bernard Hogan-Howe denied three-year contract","title_page":"Met Police boss Sir Bernard Hogan-Howe denied three-year contract | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Britain's most senior police officer has failed to win a new three-year contract as he faced growing criticism over his handling of the VIP abuse scandal.\nBoris Johnson has instead handed Sir Bernard Hogan-Howe, who earns £281,000-a-year, a 12-month contract to run the Metropolitan Police.\nThe decision means that Mr Johnson's successor as Mayor of London, either Labour's Sadiq Khan or Tory Zac Goldsmith, could replace him next September.\nUnder pressure: Boris Johnson, left yesterday, will extend Sir Bernard Hogan-Howe's contract by a year - but not the three years he wanted\nSir Bernard took over in 2011 after his predecessor Sir Paul Stephenson quit during the hacking scandal and had a reputation for being tough on crime.\nCrime rates have fallen in the capital and he is said to have played a pivotal role in tackling terrorism but his tenure has also been hit by several scandals.\nRecently there was growing fury over his refusal to apologise to ‘hounded’ 92-year-old war hero Lord Bramall in another storm over the unravelling VIP abuse investigation, Operation Midland.\nThe £2million investigation is based on evidence from one witness 'Nick', whose own family have said is a 'fantasist'.\nHowever, the collapse in the case against Lord Bramall has led to further questions over the veracity of Nick’s claims.\nHarvey Proctor, a former Tory MP implicated in the allegations of a murderous Westminster paedophile ring, has claimed Sir Bernard was seeking to postpone the collapse of Operation Midland until he had secured an extension of his contract.\nMr Proctor, 69, added: ‘I thought Hogan-Howe should have resigned over Operation Midland last summer, so I am quite surprised he has hung on all these months. The Home Secretary should not be giving him a contract extension, she should be sacking him or seeking his resignation.’\nScotland Yard's inquiry into alleged payments to public officials by journalists, the £20million Operation Elveden, has led to just one reporter being prosecuted.\nHounded: Lord Bramall, pictured with the Queen in 1995, was a victim of the Met's child sex abuse 'witch hunt' but Sir Bernard will not say sorry\nSir Bernard's five-year contract is due to expire in September. Legislation allows for an initial extension of up to three years, which can then be followed by unlimited one-year extensions.\nPolicing minister Mike Penning said: \"Any decision to extend the contract of the Commissioner of the Metropolitan Police is a matter for the Queen, based on the recommendation from the Home Secretary.\n\"This decision will be informed by any recommendation from the Mayor's Office for Policing and Crime.\"\nMrs May has clashed with Sheffield-born Sir Bernard over high-profile issues.\nLast summer the Home Secretary refused permission for the Met to deploy water cannon, leaving the force with three they cannot use.","url":"https://www.dailymail.co.uk/news/article-3422683/Met-Police-boss-Sir-Bernard-Hogan-Howe-denied-three-year-contract-Boris-row-2m-VIP-abuse-inquiry-takes-toll.html"}
