{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 22:16:50","date_modify":"2018-10-30 22:16:50","date_publish":"2016-12-14 00:00:00","description":"Metro Bank is planning to open 12 new branches next year and over 100 new branches by 2020, founder and chairman Vernon Hill tells Business Insider.","filename":"data/vaneerConsumption/MetroBankchairmanVernonHillonBrexitandgrowthplans.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_metro-bank-chairman-vernon-hill-on-brexit-and-growth-plans-2016-12_1540937810.html","title":"Metro Bank chairman Vernon Hill on Brexit and growth plans","title_page":"    Metro Bank chairman Vernon Hill on Brexit and growth plans - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Metro Bank founder and chairman Vernon Hill with his dog Duffy. Metro Bank LONDON — More than 1,000 bank branches have closed across the UK over the last 2 years, according to new stats from Which? But challenger Metro Bank is swimming against the tide, planning to open up to 12 new branches next year and over 50 more by 2020.\n\"You can't look at Metro through British bank eyes, because we're nothing like RBS or Lloyds,\" founder and chairman Vernon Hill told Business Insider in a recent interview. \"What we really are is a growth retailer that happens to be a bank.\"\nMetro Bank's branches — or \"stores\" as Hill likes to call them — are not just unusual because they are multiplying rather than disappearing. The branches, each hand picked by Hill, are open late, 7-days a week, and feature coin counting machines, credit and debit card printers, safety deposit boxes, and, perhaps most unusual of all, dog bowls.\n\"Banks won't let you bring your dogs in,\" says Hill, originally from New Jersey. \"Of course, there's no reason for it, it's just another stupid bank rule. We say dogs rule. We know your dog's name, we give it treats, we give it a water bowl. The customers take that to mean if you love my dog, you must love me. If you look at what Metro Bank is, it's all about service and convenience.\"\nHill's dog Duffy is wandering around Metro's Holborn headquarters while we chat. At one point Hill asks his assistant to make sure the door to his office is open so that the Yorkshire Terrier has the free run of the place.\n\"Everything we did in New York worked better here,\" he continues. Hill, 71, set up Commerce Bank in the US when he left university and left the multi-billion dollar lender in 2007. He was forced out by the bank's board over deals struck with companies run by family members. One commentator described his exit as a \"Greek tragedy\" in the New York Times.\nMetro Bank's headquarters in Holborn, London. Metro Bank Hill continues: \"They said you couldn't be open seven days a week, people wouldn't like the look, nobody cared about the long hours, the thing about the dogs — all this stuff that we do to make it fun, people said it wouldn't work.\n\"Somebody said to me these little lapel pins are too American, they're not British,\" he says pointing to an \"M\" on his jacket. \"Customers are loving it.\"\nThe \"stores\" are crucial to Hill's expansion plans. Metro aims to have 100 stores by 2020, up from today's 46 (the 47th opens in Colchester on Friday). If the big High Street banks are pulling back at the same time, all the better — less competition.\n\"You've had a cartel going here for 40 or 50 years,\" Hill says. \"You have five big banks and they have an underlying philosophy that they're doing you a favour by letting you bank with them. Every Brit knows it. Because they've had this closed market they overcharge, they underserve, and they've underinvested in their business.\n\"We showed up with a brand new model, it's built around the idea of winning fans not customers, and the customers say 'thank god we have a choice'.\"\nTrouble at Britain's \"big four\" lenders — HSBC, Lloyds, RBS, and Barclays — is also good for hiring, Hill says, as well as luring away customers.\nHill says: \"They're shrinking, they're firing, they're laying them off at 10 or 20,000 at a time. Do you want to stay there, or do you want to come work here?\"\nAs if on cue, a very loud conga line of staff decked out in feather boas and party hats emerges from a conference room down the hall. This is all part of induction for new staff — \"or indoctrination,\" Hill jokes. \"This is an exciting fun venture. This is great fun.\"\nMetro Bank staff. Metro Bank Metro Bank first opened its doors in 2010. A lot has changed since then — most obviously June's vote to leave the European Union. Does Brexit affect Hill's plans?\n\"It has no effect on me whatsoever. I don't take a position on Brexit because I don't think an American has the historic view of life to talk about it.\"\nMetro focuses on what Hill calls the greater London area, a generous sweep that covers Reading to the west, Cambridge to the north, Southend to the east, and Brighton down south. Hill adds: \"We've seen no slowdown at all. You're going to have ups and downs but London is just such an unbelievably dynamic city and I think it will remain dynamic no matter what the terms [of Brexit].\"\nMetro Bank managed to list in London in March despite poor market conditions and it has fared well since. Shares are up over 50% since listing, giving Metro a market value of £2.6 billion.\n\"When the American analysts write about us they seem to get it,\" Hill says. \"When the British bank analysts write about us they don't seem to get it because they're looking at us through traditional British bank eyes. That's not who we are.\" He repeats his \"growth retailer that happens to be a bank\" maxim.\nMetro Bank will have 900,000 accounts open by the end of the month, with a 50-50 split between consumer and commercial customers. Not bad for a bank that didn't exist 7 years ago.\nMetro is targeting deposits of £30 billion by 2020, up from close to £10 billion currently. But Hill adds: \"The upside here is so high. If we got 5% of the British deposit market you're talking about a £130 billion bank, which would give you a market cap of £25 billion. That should keep me busy for a while.\"","url":"https://www.businessinsider.com/metro-bank-chairman-vernon-hill-on-brexit-and-growth-plans-2016-12"}
