{"authors":[],"date_download":"2018-10-30 18:33:46","date_modify":"2018-10-30 18:33:46","date_publish":"2017-02-15 18:43:00","description":"A dentist who practiced in Gwinnett and DeKalb counties is headed to federal prison for Medicaid fraud.","filename":"data/vaneerConsumption/MetroAtlantadentistgetsfederalprisontimeforMedicaidfraud.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/10/Images/newsEngin.16770143_doctor.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_metro-atlanta-de_4caa27d02ca0b2f4d409d99413b893ca__1540924426.html","title":"Metro Atlanta dentist gets federal prison time for Medicaid fraud","title_page":"Metro Atlanta dentist gets federal prison time for Medicaid fraud","title_rss":"NULL","source_domain":"ajc.com","text":"A dentist who practiced in Gwinnett and DeKalb counties is headed to federal prison for Medicaid fraud.\nDr. Oluwatoyin Solarin was sentenced to a year and six months for filing false claims worth nearly $1 million, the U.S. Attorney’s Office in Atlanta announced Wednesday.\n“Solarin cheated the Medicaid program by submitting fraudulent claims, even billing the government for procedures she allegedly performed at the same time she was out of the country,” said U.S. Attorney John Horn. “The wealth she amassed through her scheme will now be forfeited and paid back to the government.”\nSolarin, who liked to invest in real estate holdings she’ll now forfeit, owned and operated Care Dental in Doraville and Duluth.\nFrom 2009 through 2013, Solarin “caused false claims to be submitted” for patients she hadn’t treated and others who were ineligible for Medicaid.\nSolarin pleaded guilty in November.\n“Rooting out health care fraud is central to the well-being of both our citizens and the overall economy. Schemes that steal money from the Medicare program harm taxpayers and raise healthcare costs,” said Veronica Hyman-Pillot, special agent in charge with IRS Criminal Investigation.","url":"https://www.ajc.com/news/local/metro-atlanta-dentist-gets-federal-prison-time-for-medicaid-fraud/KvS2ZNAjJIAn4nUyziMJiJ/"}
