{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-30 21:49:06","date_modify":"2018-10-30 21:49:06","date_publish":"2016-12-17 00:00:00","description":"Vernon Hill befriended Trump after setting up Commerce Bank in the US in the 1970s.","filename":"data/vaneerConsumption/MetroBankfounderVernonHillonTrumpelectionandBrexit.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_metro-bank-founder-vernon-hill-on-trump-election-and-brexit-2016-12_1540936146.html","title":"Metro Bank founder Vernon Hill on Trump election and Brexit","title_page":"    Metro Bank founder Vernon Hill on Trump election and Brexit - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Donald Trump talking to Vernon Hill in 2001. Spencer Platt/Getty Images LONDON — The founder of British challenger bank Metro believes the election of Donald Trump and Britain's vote to leave the European Union could be \"as important as Ronald Reagan and Maggie Thatcher\" to the global economy.\nVernon Hill told Business Insider in an interview this week that Trump's election is \"a dramatic revolt by the American public towards more free markets and less government. Trump is the face of that. I think this is as important as Ronald Reagan and Maggie Thatcher.\"\nHe added: \"I think this is a revolt on both sides of the Atlantic. Brexit was a revolt against Europe and a revolt against London too. Trump is a revolt against Washington. It's going to change America and your vote is going to change Britain.\"\nHill, originally from New Jersey, told BI he has known Trump \"for a long time\" and The Philadelphia Inquiry described Trump recently as Hill's \"sometime golfing buddy.\" Hill told BI: \"Yeah, I've played golf with Trump.\"\nHill says he has not spoken to Trump since his election victory last month but said: \"I think Trump is a positive change towards open markets and less government.\"\nTrump's cabinet picks have so far largely been drawn from private industry rather than politics, with eye-catching appointments including Exxon Mobil CEO Rex Tillerson as secretary of state and Goldman Sachs President Gary Cohn as head of the National Economic Council. It suggests Trump will be unashamedly pro-business in office.\nPrior to setting up Metro Bank, Hill ran Commerce Bank, a Philadelphia-based lender he set up in the 1970s. He left the multi-billion dollar lender in 2007. Hill was forced out by the bank's board over deals struck with companies run by family members. One commentator described his exit as a \"Greek tragedy\" in the New York Times.\nAsked if Trump's election tempted him to return to the US to start a new venture there, Hill told BI: \"This is my main thing. Half my times here but I got lots of things going on in America.\"","url":"https://www.businessinsider.com/metro-bank-founder-vernon-hill-on-trump-election-and-brexit-2016-12"}
