{"authors":[],"date_download":"2018-10-30 19:48:55","date_modify":"2018-10-30 19:48:55","date_publish":"2018-08-05 19:47:00","description":"Search for Georgia boy leads to ‘heartbreaking’ desert discovery; 11 children starving, removed","filename":"data/vaneerConsumption/MetroAtlantamenarrestedinNewMexicocompoundraid.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/08/05/Videos/4454452.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_search-for-atlanta-chi_ae47220c95d333d35bca7157ecfa5985__1540928935.html","title":"Metro Atlanta men arrested in New Mexico compound raid","title_page":"Metro Atlanta men arrested in New Mexico compound raid","title_rss":"NULL","source_domain":"ajc.com","text":"The message that made its way to Georgia from an isolated high desert compound in northern New Mexico was a desperate cry for help: “We are starving and need food and water.”\nThe plea that an Atlanta-area detective turned up marked a dramatic twist in a child abduction case involving a 3-year-old Clayton County boy whose father took him away last December. The detective forwarded the message to Taos County Sheriff Jerry Hogrefe, who executed a search warrant Friday on a makeshift compound that authorities believed was operated by armed Muslim extremists.\nREAD: Remains of a ‘young boy’ found near compound\nThe dusty property consisted of a small RV trailer surrounded by a crude wall of old tires and an earthen berm. What deputies and state investigators found when they stormed the compound Friday shocked the lawmen.\nAfter a standoff with two metro Atlanta men inside the heavily armed encampment, officers arrested Lucas Allen Morten and Siraj Ibn Wahhaj — the fugitive wanted in the child abduction case. But they weren’t the only ones at the property that had no running water, plumbing or electricity.\nAn aerial view of the compound in Amalia, New Mexico where authorities arrested two Metro Atlanta men on Friday in a child abduction case. One of the men, Siraj Wahhaj, is accused of abducting his three-year-old son from Clayton county in December. His son, Abdul-Ghani Wahhaj, was not found at the compound Friday, but investigators believe he had been there in the past few weeks. Source: Taos County Sheriff’s Office\nDeputies discovered 11 children and at least three women — believed to be their mothers — living there. Sheriff Hogrefe described the horrible conditions endured by the children with ages ranging from 1 to 15. He said in a statement they “looked like Third World refugees not only with no food or fresh water, but no shoes, personal hygiene and basically dirty bags for clothes.”\nMorten is charged with harboring a fugitive, and Wahhaj faces arrest on a child abduction warrant from Georgia. His missing son, Abdul-Ghani Wahhaj, was not at the compound and none of the adults detained — including the three women who were questioned and released — would offer information about his possible whereabouts.\nThe boy, who has various health issues that require medication, disappeared from his home in Clayton County last December. His mother told Clayton County police on Dec. 10 that she had not seen her son in more than a week, according to a Dec. 18 department news release.\nThe boy and his father had gone to a nearby park and never returned.\nBy happenstance, Wahaj and his son were seen Dec. 13 in Chilton County, Alabama, after they were involved in a single-vehicle accident along I-65 south of Birmingham. They were traveling with seven other people, including five children, and told the officer who worked the wreck that they were headed to New Mexico for a camping trip. A person driving a white Ford box truck picked them up after the accident. The truck was registered to Morton, whose address was listed as Atlanta.\nThe sheriff’s news release Saturday said his office had been investigating the case for two months along with the FBI and authorities in Clayton County. FBI agents had been conducting surveillance on the compound, but federal authorities did not believe there was probable cause to conduct a search, the sheriff said.\nThat changed recently when the Clayton County detective forwarded the tip to the sheriff’s office about the lack of food and water at the property. The sheriff in his statement did not identify the person who sent the plea for help from inside the compound.\n“I absolutely knew we couldn’t wait on another agency to step up and we had to go check this out as soon as possible,” Hogrefe said.\nHe said eight deputies and four state officers executed the warrant Friday morning and they moved in swiftly on the compound in the tiny community of Amalia, just south of the Colorado border along the Sangre de Cristo Mountains. They believed the occupants “were most likely heavily armed and considered extremist Muslims,” the release said.\nInitially, both Morton and Wahhaj refused officers’ commands to comply with the search. Wahhaj was holed up in the compound with a loaded AR-15 rifle, five 30-round magazines and four loaded pistols, including one he kept in his pocket. Additional ammo was found scattered in the compound.\nThe search for the 3-year-old boy continues. Authorities believe Abdul-Ghani Wahhaj had been at the compound within the past few weeks. Authorities turned over the 11 children found Friday to New Mexico child protective service officials. The sheriff described the “surprising and heartbreaking” conditions under which the children were kept. The only food found on the property Friday were a few potatoes and a box of rice.\n“It was the saddest living conditions and poverty I have seen,” he said.","url":"https://www.ajc.com/news/search-for-atlanta-child-leads-heartbreaking-desert-discovery/w8TnoEOIa8umB9qbz6QJ8O/"}
