{"authors":[],"date_download":"2018-10-23 02:26:23","date_modify":"2018-10-23 02:26:23","date_publish":"2016-01-28 17:15:26","description":"Mexican authorities on Thursday deported a US teenager known for using an \"affluenza\" defense in a fatal Texas drunk-driving accident, a month after the fugi...","filename":"data/vaneerConsumption/MexicodeportsUSaffluenzateen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h1lb-4vVdYopwYQ7f641721b07af9acea-804_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421187_Mexico-deports-US-affluenza-teen_1540261583.html","title":"Mexico deports US 'affluenza' teen","title_page":"Mexico deports US 'affluenza' teen | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mexico deports US 'affluenza' teen\nMexican authorities on Thursday deported a US teenager known for using an \"affluenza\" defense in a fatal Texas drunk-driving accident, a month after the fugitive was caught in a resort.\nThe National Migration Institute released a video showing agents escorting a bearded Ethan Couch, 18, into a plane flying from Mexico City to Dallas, Texas, after he dropped an appeal against his deportation.\nCouch, who had spent 28 days in a detention facility, will be met by US authorities in Dallas \"because he faces several charges,\" the institute said in a statement.\nView of the police van carrying American Ethan Couch while heading to the Mexican migration office in Guadalajara City on December 30, 2015 ©Hector Guerrero (AFP/File)\nCouch and his mother, Tonya, were detained by Mexican authorities in the Pacific resort of Puerto Vallarta on December 28 following an international manhunt.\nThe young man had disappeared late last year after missing a mandatory meeting with his probation officer.\nCouch apparently vanished after the emergence of a video showing him at a party taking part in a drinking game, which violated the terms of his probation.\nTonya Couch was deported from Mexico on December 31 and was promptly arrested by US authorities to face charges of hindering his apprehension.\nHer son had lodged an appeal that could have delayed his deportation for months, but he dropped it on January 15.\nIn 2013, the teen crashed his pickup into a group of pedestrians in Texas and another vehicle, leaving four dead and several seriously injured.\nCouch, who was 16 at the time, had a blood-alcohol level nearly three times the legal limit for an adult.\nThe son of millionaire parents made headlines during his trial when a psychologist testifying on his behalf claimed he suffered from \"affluenza.\"\nThe term, coined from affluence and influenza, implied that financial privilege made him unable to understand the consequences of his actions.","url":"https://www.dailymail.co.uk/wires/afp/article-3421187/Mexico-deports-US-affluenza-teen.html"}
