{"authors":["Lana Shadwick"],"date_download":"2018-10-30 18:14:55","date_modify":"2018-10-30 18:14:55","date_publish":"2017-02-05 15:55:19","description":"The Texas Attorney General is putting a Mexican national on trial Monday. Her alleged crime: illegally voting in two Texas elections.","filename":"data/vaneerConsumption/MexicanNationalOnTrialforAllegedIllegalVoting.json","image_url":"https://media.breitbart.com/media/2017/02/Rosa-Maria-Ortega.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2017_02_05__1540923295.html","title":"Mexican National On Trial for Alleged Illegal Voting","title_page":"Mexican National On Trial for Alleged Illegal Voting","title_rss":"NULL","source_domain":"breitbart.com","text":"The Texas Attorney General and a Texas county are putting a Mexican national on trial Monday. Her alleged crime: illegally voting in two Texas elections.\nThe 37-year-old woman, Rosa Maria Ortega, was indicted in November 2015 for the crime of “Illegal Voting.” She is now facing trial for the offense — a felony in Texas.\nAccording to the Tarrant County indictment, Ortega is accused of voting in the November 2012 General Election and in the May 2014 Primary Run-off Election. According to the indictment, she did so “when she knew she was not a United States citizen.”\nOrtega lives in Grand Prairie, Texas, a city located between Fort Worth and Dallas. According to a 2015 article by the local NBC affiliate, Ortega had previously applied to vote in the county but officials rejected her application when she acknowledged that she was not a citizen. She applied again five months later and claimed she was a citizen.\nAccording to officials prosecuting the case, Ortega did not vote in the 2016 presidential election. She was indicted by a Tarrant County grand jury in November 2015. Breitbart Texas’ Bob Price reported her arrest in 2015.\nThe Texas Penal Code provides that the offense of “Illegal Voting,” is committed where a person:\nvotes or attempts to vote in an election in which the person knows the person is not eligible to vote; knowingly votes or attempts to vote more than once in an election; knowingly impersonates another person and votes or attempts to vote as the impersonated person; or knowingly marks or attempts to mark another person’s ballot without the consent of that person.\nThe offense is a felony of the second degree unless the person is convicted of the lesser offense of attempt. The latter would be a state jail felony.\nTexas legislators enacted the law in 2011 and it became effective on January 1, 2012.\nOrtega is facing trial in Tarrant County Criminal District Court Number 3, the Honorable Judge Robb Catalano presiding. Catalano is a Republican judge who previously served as an assistant district attorney in the county.\nOn October 24, just prior to the November presidential election, the U.S. Department of Justice (DOJ) issued a press release warning poll watchers hoping to prevent voter fraud that they themselves could be violating federal voting rights law. The federal officials counseled them against communicating or “challenging voters,” reported Breitbart Texas.\n“The statement does not grant the varying distinctions in which states may allow communication between voters and poll watchers, nor does the DOJ note that some observers in specific states do indeed have the power to challenge would-be voters based on documented ineligibility,” the Breitbart Texas article noted. The DOJ was also publicizing an “Election Complaint Report” form where voters could report “a possible violation of the federal voting rights laws.”\nVoter fraud watchers urge that communications like these from the federal government acts, as it is thought to intend to, to stifle enforcement of voter laws by poll watchers and public election officials.\nJust days after he was sworn-in, President Donald Trump promised to call for a voter fraud investigation, including investigating those who illegally voted because they were not U.S. citizens, reported Breitbart Texas.\nDuring the traditional pre-Super Bowl interview with Fox News Channel host Bill O’Reilly, President Trump recommitted his administration to probing the larger issue of election integrity, particularly where voter rolls may become tainted with outdated and ineligible voters, by charging Vice President Mike Pence with leading a “commission” to look into the matter, according to The Washington Times.\nIn late January, Breitbart News published an article by California Assemblyman Tim Donnelly saying that “The media have exhibited a pathological determination to ignore any possibility of voter fraud, in spite of mountains of evidence to the contrary.”\nThe article, entitled “California’s Recipe for Voter Fraud on a Massive Scale,” laid out the things that enable voter fraud, including pushing massive voting by mail. Other components to the “recipe” includes: making it easy to vote online two weeks before Election Day; spending millions of taxpayer dollars handing out drivers licenses to illegal aliens; and passing a law that requires everyone with a drivers license to be “automatically” registered to vote.\nShortly before the 2016 Election, the Public Interest Legal Foundation released a study of select Virginia city and county voter registration records, finding more than 1,000 foreign nationals registered to vote with a significant percentage of them having voted before being found.\nA New York Assemblyman introduced legislation last week that if passed, would allow approximately 150,000 illegal aliens in New York City to get a driver’s license, reported Breitbart Texas. Statewide, 265,000 illegal aliens would be eligible.\nBoth chambers of the Texas Legislature have produced bills in the 2017 session that seek to prevent noncitizen voter registration from the outset. House Bill 1079, authored by Rep. Mike Schofield (R-Houston), and SB 136, submitted by Sen. Van Taylor (R-Plano), would require documentary proof of U.S. citizenship when registering to vote.\nTrue the Vote President Catherine Engelbrecht joined Breitbart News Daily in late November and said, “I mean, if it’s so easy to be a CNN, right, to affirm that there are no concerns to be had about illegal votes, and non-citizen voting isn’t something that we should look at, then let’s get CNN to ask the federal government to show us how they can conclusively tell us that non-citizens aren’t registered. Show us the process that they use to screen federal registration applications,” she suggested.\nEngelbrecht said no one has looked into it because when states ask to, they get sued. We’ve institutionalized the fraud, we’ve made it this taboo that no one’s allowed to speak about because this is what happens. It’s a political minefield, and it’s not for the faint of heart. But somebody’s got to walk through it, or at some point we’re going to find ourselves in a banana republic where votes really don’t matter, and then you can’t unring that bell. We’re perilously close to that point now,” Engelbrecht warned.\nIt “serves all of our interests” to ask the questions that need to be asked about how many illegal voters are on the voter rolls, she said.\nLana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.\nThis article has been updated to reflect additional information.\nTarrant County Indictment of Rosa Maria Ortega for Illegal Voting by lanashadwick on Scribd","url":"https://www.breitbart.com/border/2017/02/05/texas-putting-mexican-national-trial-alleged-illegal-voting/"}
