{"authors":["Associated Press"],"date_download":"2018-10-22 21:48:51","date_modify":"2018-10-22 21:48:51","date_publish":"2016-01-11 01:44:42","description":"MEXICO CITY (AP) — Mexican actress Kate del Castillo has stepped out of the fictional drug trafficker roles she played on TV and finds herself involved in th...","filename":"data/vaneerConsumption/MexicanactressKateDelCastilloreallifedrugconnection.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:8851de098fdf4654b5c86589a75db83a-3bWLCvS3pZb5eb4fce05c5e85c09-758_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3392887_Mexican-actress-Kate-Del-Castillo-real-life-drug-connection_1540244931.html","title":"Mexican actress Kate Del Castillo, real-life drug connection","title_page":"Mexican actress Kate Del Castillo, real-life drug connection | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mexican actress Kate Del Castillo, real-life drug connection\nMEXICO CITY (AP) — Mexican actress Kate del Castillo has stepped out of the fictional drug trafficker roles she played on TV and finds herself involved in the real world of drug capos.\nThe 43-year-old Del Castillo had her most memorable role in 2011 playing a drug kingpin in \"The Queen of the South,\" a TV series based on a book written by Spanish writer Arturo Perez-Reverte.\n\"It was every actress's dream,\" she said of the role in an interview with the Televisa network the following year. \"She is a character who sleeps with married men, smokes marijuana, traffics drugs, kills people, she swears a lot and she is a big drunk.\" She also played a mobster in the U.S. television series \"Weeds.\"\nFILE - In this March 24, 2013 file photo, Mexican actress Kate Del Castillo attends a NASCAR Sprint Cup auto race in Fontana, Calif. Del Castillo stepped out of the fictional drug-trafficker roles she played on TV and got involved in the real world of drug capos, after Sean Penn credited her with setting up a secret meeting with the world¿s most-wanted drug lord Joaquin ¿El Chapo¿ Guzman. (AP Photo/Reed Saxon, File)\nNow Del Castillo is credited by U.S. actor Sean Penn with setting up a secret meeting with the world's most wanted drug boss, Joaquin \"El Chapo\" Guzman, in the mountains of Mexico while he was on the run in October, three months before he was captured Friday.\nDel Castillo has long been fascinated with \"El Chapo,\" to whom she wrote a public appeal in 2012, urging him to do good and saying, \"Today I believe more in Chapo Guzman than in the governments that hide the truth from me.\" Del Castillo later told The Associated Press that \"nobody understood the irony, the sarcasm and the joke I was making\" in the letter that was posted to her Twitter account.\nBut many saw it as fitting in with her on- and off-screen persona.\n\"The Queen of the South set up an interview with El Chapo. I wouldn't expect any less of her,\" Perez-Reverte wrote in a blog.\nApparently, the letter drew Guzman's attention.\nPenn wrote that Del Castillo was first contacted by the drug kingpin's lawyer in 2012 after she sent the public appeal, which included urging him to start \"trafficking with love.\" Penn said Guzman sent her flowers, which she somehow missed. El Chapo's representatives contacted her again after his arrest in February 2014, when \"gringos were scrambling to tell his story,\" Penn wrote.\nDel Castillo has the kind of connections in Mexico's movie and film industry to actually get a film made.\nShe's the daughter of famed Mexican actor Eric del Castillo and has been a star herself for more than 20 years.\nBut it was unclear how far along the planning for the movie actually was. Del Castillo had not publicly commented on the revelations as of Sunday.\nIt was also unclear whether U.S. and Mexican authorities were investigating Del Castillo, who lives in Los Angeles and reportedly has U.S. citizenship.\nPenn described elaborate security measures — disposable phones and encrypted communications — that both he and Del Castillo took to keep the meeting secret.\nBut apparently, Del Castillo's contacts with Chapo's lawyers weren't as closely guarded — and were detected.\n\"Another important lead that allowed us to locate him, was the discovery that Guzman intended to make a movie about his life,\" said Mexican Attorney General Arely Gomez said Friday. \"To that end, he established communication with actresses and producers ... In fact, the surveillance allowed us to document the meetings between these people and his (Chapo's) lawyers.\"\nMarried twice, Del Castillo also was linked romantically to actor Demian Bichir, who co-starred with her in the 2005 film \"American Visa.\"\nDel Castillo is one of several Mexican actresses who have achieved some success with \"cross-over\" careers in the United States.\nShe appeared in the 2002 PBS series \"American Family,\" about a Latino family in Los Angeles.\nShe has also appeared on The CW network's breakout 2014 comedy, Jane the Virgin.\nMexican actor Gael Garcia Bernal said of the Chapo meeting, \"as a Mexican, this is a very serious matter. It's not something I can laugh about.\"\n\"There are a lot of deaths involved,\" said Garcia Bernal at the Golden Globe awards in Beverly Hills, California. \"It is a very painful topic ... I cannot take it lightly.\"\nChilean director Pablo Larrain said it appears Chapo's desire to make a biopic was responsible for his re-capture Friday, after he escaped a Mexican prison for the second time Last July.\n\"What killed El Chapo was vanity. Pure vanity,\" Larrain said at the awards.\nAna de la Reguera said she didn't want to comment on Del Castillo's actions. \"I love Kate and she is the best and she is my friend,\" said Del la Reguera. \"That's precisely why I don't want to comment.\"\n___\nAssociated Press Writer E.J. Tamara contributed to this report from Beverly Hills.","url":"https://www.dailymail.co.uk/wires/ap/article-3392887/Mexican-actress-Kate-Del-Castillo-real-life-drug-connection.html"}
