{"authors":["Penny Starr"],"date_download":"2018-10-30 20:35:29","date_modify":"2018-10-30 20:35:29","date_publish":"2018-10-30 18:43:39","description":"The Mexican ambassador to the U.S. described some of the migrants traveling through that country to the U.S. as “very violent.”","filename":"data/vaneerConsumption/MexicanAmbassadortoUSSomeinMigrantCaravanVeryViolent.json","image_url":"https://media.breitbart.com/media/2018/10/migrant-caravan-12345-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_10_30_mexican_df8cbfb9801220b3bb95126a8f098e70__1540931729.html","title":"Mexican Ambassador to U.S.: Some in Migrant Caravan ‘Very Violent’","title_page":"Mexican Ambassador to U.S.: Some in Migrant Caravan ‘Very Violent’","title_rss":"NULL","source_domain":"breitbart.com","text":"The leftist media are pushing the narrative that the thousands of migrants from Central America and elsewhere are just people fleeing violence in their homeland, but during an interview with National Public Radio on Monday, Geronimo Gutierrez, the Mexican ambassador to the U.S., described some of them as “very violent.”\n“I want to begin with the facts here,” Morning Edition host Steve Inskeep said. “Seven thousand or so people, which is a lot of people – looks like a lot on TV.”\n“But I do know it’s part of this much larger, somewhat ordinary flow of migrants,” Inskeep said. “So how serious a situation is this in the view of your government?”\nGutierrez called it a “humanitarian crisis” and said the Mexican government is “urging people” to enter the country in accordance with its immigration law and that migrants can seek refugee status in Mexico.\n“There was an effort to stop them at the border with Guatemala,” Inskeep said. “And in the end, the government more or less let them in. Is that right?”\n“We have been trying to avoid, at all costs, violence in the border,” Gutierrez said. “Unfortunately, some of the people in the caravan have been very violent against authority, even though that they have offered the possibility of entering in compliance with immigration law and refugee status.”\n“So police there is simply to uphold our laws,” Gutierrez said. “There is presence of the human rights commission of Mexico and also of several NGOs that can testify to the fact that the police has acted appropriately.”\n“But nevertheless, we want to make sure that our laws are enforced,” Gutierrez said.\nGutierrez told NPR that the number of migrants in Mexico at the time of the interview was around 3,500.\n“Out of those, we have 1,895 people that have requested – presented a request for refugee status – 1,435 of them are being processed, and about 422 have actually been repatriated to the states,” Gutierrez said, adding that some migrants “clearly intend to get to the U.S.”\n“We have close cooperation with U.S. authorities to handle this in the best possible way,” he said.\nAs Breitbart Texas reported on Tuesday, some of the migrants are, indeed, reportedly violent:\nMexico’s immigration authorities issued a warning about individuals in Guatemala who are building Molotov cocktails and other makeshift incendiary devices to be used against federal police officers guarding their southern border. The alert follows an incident where a group of migrants in what’s being dubbed the second caravan threw rocks at officials at the Guatemala-Mexico Border and tried to break through international barriers. Mexican law enforcement confirmed that some of the protesters in the clash carried firearms. The warning was issued by Mexico’s National Migration Institute (INM). The agency claimed it learned of various individuals in Tecun Uman, Guatemala, were building Molotov cocktails with the intent of using them against Mexican border authorities. In a public statement, INM asked the Guatemalan government to intervene, adding the violent actions were those of “criminals and not of a vulnerable migrant population.”\nThe Trump administration announced it is deploying 5,200 members of the U.S. military to the border to deal with the potential migrant invasion.\nFollow Penny Starr on Twitter.","url":"https://www.breitbart.com/politics/2018/10/30/mexican-ambassador-u-s-some-migrant-caravan-very-violent/amp/"}
