{"authors":["Ildefonso Ortiz"],"date_download":"2018-10-30 20:53:15","date_modify":"2018-10-30 20:53:15","date_publish":"2014-11-29 14:23:00","description":"The Mexican government is preparing to launch a new security strategy that they claim will fight drug cartels and public corruption. The plan, however, |","filename":"data/vaneerConsumption/MexicoAnnouncesYetAnotherSuspiciousSecurityStrategyToFightCartels.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/11/28/Grupo-coordinacion-tampsjpg.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_11_29__1540932795.html","title":"Mexico Announces Yet Another Suspicious Security Strategy To Fight Cartels","title_page":"Mexico Announces Yet Another Suspicious Security Strategy To Fight Cartels | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Mexican government is preparing to launch a new security strategy that they claim will fight drug cartels and public corruption. The plan, however, opens the door to eradicate political opponents.\nMexican President Enrique Pena Nieto said that in the coming days his government would implement a 10 part security strategy that included a universal emergency phone system similar to 911. But the general sentiment along the Mexican border is that the plan is filled with hot air. The announcements were made in a televised speech that was broadcast on various channels in Mexico.\nThe plan would kick off in the most troublesome states which include Tamaulipas, Guerrero, Michoacán and Jalisco. The new plan comes just months after the president had announced a similarly security strategy for Tamaulipas that has yet to put its citizens at peace. The Tamaulipas Security Strategy was kicked off in earlier this year. According to information released to Breitbart Texas, it has made thousands of arrests. But the general sentiment of the community members that Breitbart Texas has spoken to along the Tamaulipas border is that things haven’t changed.\n“Yes, he looks all pretty on TV talking about it and how Mexico is a paradise, but that is all he does, talk about it,” Mario Hernandez, a taxi driver in the border town of Brownsville, Texas, told Breitbart Texas. “If Mexico was so nice and peaceful I wouldn’t be driving people over there because they are too scared to go alone. That’s not a paradise, that’s hell.”\nAccording to the president’s televised speech, one of the main points in the security plan allows for the federal government to dissolve a municipal government and its police agencies turning over the operations to the federal government.\nPena Nieto said the plan will stop members of organized crime from infiltrating the government as they have done in numerous other cases. For example, the recent massacre of the 43 education students in Iguala, who were kidnapped by police under orders of the mayor and then allegedly killed by cartel members.\nPart of the security plan is of concern to various Matamoros business leaders that Breitbart Texas spoke to. The chief concern is that under the guise of fighting corruption, the Mexican government would kick out the mayors of the cities where the mayor is from a rival party. One of those likely targets would be the mayor of Matamoros Letty Salazar who has been the target of criticism from the state run media. Most recently Salazar was blamed for the death of four drug cartel members, three of whom were from Texas and had been killed by their own organization. The state run media castigated the mayor, claiming that her security forces had kidnapped and executed the “three young innocent Texas students”.\n“It is so easy for them to come up with another example like that down the line and remove anyone that doesn’t fit their agenda,” said Servando Garcia, a manufacturing manager from Matamoros who spoke with Breitbart Texas. “It is a concern for us because she and the Mexican marines are the only ones that have done anything to stop them (organized crime).”\nThe other aspects of the security plan call for the creation of a central state police agency that each state would run and task them with fighting organized crime not just street crime. The plan also calls for a universal emergency line like 911 that would be the one number to call for help.\nFollow Ildefonso Ortiz on Twitter @ildefonsoortiz.","url":"https://www.breitbart.com/border/2014/11/29/mexico-announces-yet-another-suspicious-security-strategy-to-fight-cartels/"}
