{"authors":[],"date_download":"2018-10-22 21:53:00","date_modify":"2018-10-22 21:53:00","date_publish":"2016-01-11 01:51:28","description":"Sean Penn's interview with drug lord Joaquin \"El Chapo\" Guzman caused a cross-border uproar, with Mexican authorities seeking to question him while US critic...","filename":"data/vaneerConsumption/MexicowantstoquestionSeanPennoverChapomeeting.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-6z2if-56CX32zFKLb7123928b84c8a4997-152_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3392681_Mexico-wants-question-Sean-Penn-Chapo-meeting-federal-source_1540245180.html","title":"Mexico wants to question Sean Penn over 'Chapo' meeting","title_page":"Mexico wants to question Sean Penn over 'Chapo' meeting | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mexico wants to question Sean Penn over 'Chapo' meeting\nSean Penn's interview with drug lord Joaquin \"El Chapo\" Guzman caused a cross-border uproar, with Mexican authorities seeking to question him while US critics lashed out at the American actor.\nA federal official told AFP that the attorney general's office wanted to talk with Penn and Mexican actress Kate del Castillo about their secretive meeting with Guzman in October, three months before his capture.\n\"That is correct, of course, it's to determine responsibilities,\" the official said on condition of anonymity, declining to provide more details, including a possible date for an interview with the stars.\nDrug kingpin Joaquin \"El Chapo\" Guzman is escorted into a helicopter at Mexico City's airport on January 8, 2016 following his recapture ©Alfredo Estrella (AFP)\nA second federal official said it was unclear whether Penn and del Castillo, who brokered the meeting, had violated any Mexican law.\nWhile a reporter could interview a drug cartel suspect, \"they're not journalists,\" the official said.\nWhite House chief of staff Denis McDonough told CNN that Penn's meeting with Guzman \"poses a lot of interesting questions for him and others involved in this so-called interview. We'll see what happens.\"\nThe US rock magazine Rolling Stone on Saturday published the interview that Guzman gave to the actors in an undisclosed jungle clearing in Mexico.\nDespite Penn's cloak-and-dagger efforts to keep the gathering secret, a Mexican official told AFP that authorities found out about the meeting, which eventually helped them track down the Sinaloa drug cartel chief.\nGuzman, 58, was arrested on Friday in a deadly military raid in the seaside city of Los Mochis, in his northwestern home state of Sinaloa.\nAttorney General Arely Gomez said on Friday that Guzman had met with unnamed actors and producers to discuss making a biopic about himself and that it was part of a \"new line of investigation.\"\nSome legal experts, however, doubt that Penn could face charges in the United States or Mexico.\n\"I seriously doubt that charges will be brought against them even though Sean Penn took extraordinary steps to prevent authorities from using his phone to track the whereabouts of Chapo,\" said Mike Vigil, a former senior official at the US Drug Enforcement Administration.\nFloyd Abrams, a New York attorney known for his defense of journalists, said Penn did not violate any US laws.\n- 'Grotesque' interview -\nThe meeting sparked criticism in the United States, with Republican presidential candidate Marco Rubio told ABC television that the interview was \"grotesque.\"\nJournalists questioned the ethical merits of the interview.\nWashington Post executive editor Marty Baron tweeted a link to a December story about the dangers and death faced by Mexican journalists, commenting: \"Good moment to remember what happens to real journalists who cover Mexican drug traffickers.\"\nRolling Stone posted an October 2 picture showing the Oscar-winning actor shaking hands with the mustachioed drug cartel leader.\nPenn writes that Guzman gave him a \"compadre\" hug when they met. He said they had a seven-hour sitdown followed by phone and video interviews.\n\"I supply more heroin, methamphetamine, cocaine and marijuana than anybody else in the world,\" Guzman said over sips of tequila. \"I have a fleet of submarines, airplanes, trucks and boats.\"\nThe White House said Guzman's boast about his trafficking exploits \"is maddening.\"\nRolling Stone also posted a video showing Guzman without a mustache, saying he decided to go into drug trafficking after the age of 15 because there were \"no job opportunities\" and \"no other way to survive.\"\nAsked if he felt some responsibility for the high level of addictions in the world, he said: \"It's false. The day that I don't exist, it won't reduce drug trafficking.\"\nIn a text message exchange after their meeting, Guzman discussed a marine helicopter raid in which authorities almost captured him on October 6. He played down injuries to his face and leg reported by the authorities, saying: \"Not like they said. I only hurt my leg a little bit.\"\nAuthorities said the marines did not shoot Guzman during the raid because he was accompanied by two women and a girl, but that he hurt himself in a fall.\n- Extradition bid -\nThe Rolling Stone interview emerged after Mexican prosecutors announced that they would start proceedings to extradite Guzman to the United States, a reversal from President Enrique Pena Nieto's earlier refusal to send him across the border.\nBut Guzman lawyer Juan Pablo Badillo vowed to appeal to the Supreme Court if necessary.\nGuzman is now back in the same prison that he escaped from on July 11, when he snuck down a hole in his cell's shower that led to a 1.5-kilometer (one-mile) tunnel outside the prison.\nThe world's most wanted drug baron was arrested after a military raid on a house in Los Mochis in which five suspects died and one marine was wounded. Six people were detained in the operation.\nGuzman and his security chief fled through the city's drainage system, but they were caught later after they stole a car.\nThe capture of 'El Chapo' ©Jonathan JACOBSEN (AFP)\nUS actor Sean Penn wrote that the 58-year-old Guzman gave him a big hug when they met at a Mexican jungle clearing and had a seven-hour sitdown followed by phone and video interviews ©Eric Feferberg (AFP/File)\nNewspapers in Mexico City show pictures of drug kingpin Joaquin \"El Chapo\" Guzman on their frontpages on January 9, 2016 a day after he was recaptured ©Alfredo Estrella (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3392681/Mexico-wants-question-Sean-Penn-Chapo-meeting-federal-source.html"}
