{"authors":["Colin Dwyer"],"date_download":"2018-10-22 21:23:37","date_modify":"2018-10-22 21:23:37","date_publish":"2018-06-25 00:00:00","description":"State police rounded up every member of Ocampo's department just days after a mayoral candidate died in a hail of gunfire. The victim was one of scores of Mexican politicians killed in the past year.","filename":"data/vaneerConsumption/MexicanTownsEntirePoliceForceDetainedAfterPoliticiansMurder.json","image_url":"https://media.npr.org/assets/img/2018/06/25/gettyimages-980876140_wide-4e3bce2dc3d8bbd2c594579a4c6d8f616414346c.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_06_25_623158190_mexican-authorities-detain-towns-entire-police-force-after-politician-s-murder_1540243417.html","title":"Mexican Town's Entire Police Force Detained After Politician's Murder","title_page":"Mexican Town's Entire Police Force Detained After Politician's Murder : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Mexican Town's Entire Police Force Detained After Politician's Murder\nEnlarge this image toggle caption Raul Tinoco/AFP/Getty Images Raul Tinoco/AFP/Getty Images\nTypically, when a headline pairs the words \"police\" and \"detain,\" it's fair to assume those police officers did the detaining. It's in their job description, after all.\nBut what unfolded early Sunday in the Mexican state of Michoacán wasn't exactly typical.\nThere, the small town of Ocampo's entire police force was disarmed and detained by state authorities. Michoacán law enforcement announced Sunday that the officers — all 27 at the department plus their chief, according to local media — \"were detained for internal affairs investigation.\"\nThe state police statement added only that municipal officers will be questioned to determine whether \"anyone has taken part in acts that violate the town's codes.\"\nBut Mexican publications drew a connection to last week's murder of Fernando Ángeles Juárez, a candidate for mayor in the township of roughly 24,000 people. Unidentified attackers gunned down the aspiring politician just outside his property.\nSlain just a week and a half from the July 1 election, which coincides with the national presidential election, Ángeles had been preparing for his run as a member of the center-left Party of the Democratic Revolution, or PRD.\n\"We call on authorities to provide protection to candidates and to punish those guilty of this deplorable act,\" the party said last week in a statement.\nIt wasn't for lack of trying that Michoacán had to wait until Sunday to perform their surprise sweep. The state police director himself had attempted to arrest the local department's chief, Oscar González García, only to be blocked and chased away by Ocampo cops, according to El Universal.\nThe BBC reports that González is suspected of ties to organized crime.\nAuthorities returned Sunday, this time with a much more sizable force — though even that couldn't prevent tussles between local police and their heavily armed state counterparts. Local media showed video images from the roundup, in which detainees' hands were tied as loud pops rang out in the background.\nÁngeles' murder was followed by an unusually dramatic confrontation — but his killing is far from unusual in a country that has seen scores of politicians murdered in the past year. In fact, last Wednesday night, another mayoral candidate from another party in Michoacán was shot to death, as well.\nThe state's governor, Silvano Aureoles, extended his \"heartfelt condolences\" to that candidate's family on Wednesday night. Just over 12 hours later, Aureoles had to tender new \"heartfelt condolences\" to the family of Ángeles.","url":"https://www.npr.org/2018/06/25/623158190/mexican-authorities-detain-towns-entire-police-force-after-politician-s-murder"}
