{"authors":["Katie Mchugh"],"date_download":"2018-10-30 22:13:51","date_modify":"2018-10-30 22:13:51","date_publish":"2016-10-04 15:25:20","description":"A Mexican illegal alien will spend 13 months in prison and is being ordered to pay $61 million in restitution after he started a forest fire that destroyed six homes. | Politics","filename":"data/vaneerConsumption/MexicanIllegalAlienSentencedtoPrisonAfterSettingSequoiaForestAblaze.json","image_url":"https://media.breitbart.com/media/2016/10/GettyImages-51131776-e1475594123809.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_10_04__1540937631.html","title":"Mexican Illegal Alien Sentenced to Prison After Setting Sequoia Forest Ablaze","title_page":"Mexican Illegal Alien Sentenced to Prison After Setting Sequoia Forest Ablaze | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Mexican illegal alien will spend 13 months in prison and is being ordered to pay $61 million in restitution after he started a forest fire that destroyed six homes, sparked mandatory evacuations, and devoured over 45 square miles of California’s Sequoia National Forest.\nAngel Gilberto Garcia-Avalos, 29, from Michoacán, Mexico, illegally drove off the road in the national park on August 16 with his young son. “His Nissan Maxima got stuck on a berm and his catalytic converter and muffler ignited dead grass,” sparking the blaze:\nThe fire swiftly spread and burned 29,322 acres in Kern and Tulare counties, according to Acting U.S. Atty. Phillip A. Talbert. Flames destroyed six homes and triggered mandatory evacuations of several communities in both counties… Ranchers spotted Garcia-Avalos carrying his 4-year-old son on his shoulders west of the Cedar Creek Campground area, where the fire had been reported, according to a U.S. District Court complaint. They suspected he started the fire and offered to help, but he said he was OK. Still, ranchers recorded the conversation with an iPhone. Garcia-Avalos told the ranchers that his car had been stolen and that his son saw the man who took it, and that he was walking home to Delano, which is more than 42 miles away from the Cedar Creek area, according to an affidavit written by U.S. Forest Service Special Agent Brian Adams. The ranchers were able to convince Garcia-Avalos to enter their home so that he could call someone for help. During the visit, they asked him several questions about the fire, and Garcia-Avalos denied responsibility, prosecutors say. At the crash site, fire investigators found a burned vehicle and shoe prints belonging to a small child and an adult. The shoe prints led investigators from the car to Highway 155.\nGarcia-Avalos was sentenced to seven months in prison for lying to U.S. Forest Service law enforcement officers and six months for starting the Cedar Fire. After serving his 13-month sentence, he will be deported back to Mexico, when he’ll start paying back $61 million in damages—at the low cost of only $25 per month, or $300 each year. (At that rate, it would take Garcia-Avalos some 203,333 years to pay the total cost of the damages.)\nSequoia National Forest, founded as a national park in 1890, holds the “greatest concentration of giant sequoia groves in the world,” according to the U.S. Forest Service. The giant sequoia is the single species in its genus and grows naturally in only one area of the world, the Sierra Nevada Mountains of California. These magnificent trees are the oldest and largest living things on Earth.\nConservative author Ann Coulter documents the sickening destruction of national parks and forests at the hands of illegal aliens setting up drug farms or attacking law enforcement as they break into the country. “Despite the evidence adduced by the GAO showing that illegal immigrants are both the single largest cause of wildfires and also the biggest impediment to extinguishing them, the government report dared not suggest building a fence,” she writes. “Instead, our government decided that 100 percent of the price of illegal aliens’ fire setting should be paid by Americans.”\nIllegal aliens have little respect for the American tradition of preserving natural wonders and biodiversity, Coulter writes in Adios, America:\nThe environmental damage done to federal parkland by the Mexican pot growers is breathtaking. According to USA Today, the illegals “scar the landscape by crudely terracing hillsides that erode under winter rain. They spill pesticides, fertilizer and diesel fuel used to power generators that run extensive drip-irrigation systems. They dam creeks for water sources, plant salsa gardens, disfigure trees and leave behind tons of garbage, human waste and litter.” Park officers find deer carcasses hanging from trees, owls impaled on posts, and claws from grisly bears displayed as trophies. Except for one fully brainwashed government official, who said, “I don’t want to single out one group,” there was no mistaking who was dumping pesticides, chopping down trees, and threatening hikers in our parks… The Mexican assault on America’s national parks goes well beyond what is absolutely necessary to cultivate marijuana crops. Reporters who have visited the sites gape in horror at the trash illegal aliens have left behind. Amid the plethora of two (2) New York Times stories on the pot farms, one said that law enforcement officers have found “elaborate tree-houses, makeshift showers and, invariably, trash and pesticides, much of which ends up in streams and creeks.” The Fresno Bee reported that the illegal immigrants leave behind “tons of trash” in addition to poaching deer and other park animals. The Los Angeles Times said of one camp: “Trash was strewn everywhere— empty cans, torn packets of noodles, a crusty leather rifle scabbard. A soggy sleeping bag was stuffed behind a tree.” The chief law enforcement officer at Sequoia National Park swept his hand toward the piles of trash, saying, “Nice, eh? Welcome to your national park.”\nGarcia-Avalos also holds a criminal record including burglary and car theft charges. American taxpayers will foot the bill for the court costs and to shelter and feed Garcia-Avalos during his sentence, and will likely eat the cost of the forest fire as well.","url":"https://www.breitbart.com/politics/2016/10/04/mexican-illegal-alien-sentenced-to-prison-after-setting-sequoia-forest-ablaze-lying-to-law-enforcement/"}
