{"authors":["Will Stewart In Moscow For Mailonline"],"date_download":"2018-10-23 01:36:45","date_modify":"2018-10-23 01:36:45","date_publish":"2017-04-26 12:04:37","description":"Serhiy Tiunov, a pro-Ukrainian commander, says friend Sergey Dubinsky confessed to moving a missile launcher later used to shoot down MH17, but denied pulling the trigger.","filename":"data/vaneerConsumption/MH17witnessfearsforlifeoverblamingRussiaforattack.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9F2FF600000578-0-image-a-92_1493204213137.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447044_Fears-MH17-witness-blames-Russia-attack_1540258605.html","title":"MH17 witness fears for life over blaming Russia for attack","title_page":"MH17 witness fears for life over blaming Russia for attack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There are fears for the life of a key witness to the MH17 plane disaster after he laid blame for the disaster squarely on Moscow.\nSergey Dubinsky, 54, a retired Russian colonel, confessed through a friend that he was responsible for moving a Buk surface-to-air missile system into place before it was used to shoot down the Malaysia Airlines plane in 2014.\nBut Serhiy Tiunov, a pro-Ukrainian who took Dubinsky's confession, says the colonel denies being personally responsible - instead blaming the 'b******* from Moscow.'\nSerhiy Tiunov (right) says his friend Sergey Dubinsky (left), a retired Russian colonel, has admitted to moving a missile launcher into position before it shot down MH17\nBut Tiunov (pictured) said Dubinsky denied pulling the trigger himself and instead blamed 'the b******* in Moscow' for the attack which killed 298 innocent people\nTiunov, a pro-Ukrainian military leader who fought with Dubinsky in Afghanistan, told Novaya Gazeta that he now fears his friend will be killed to keep the identities of those who launched the missile a secret.\nEveryone on board the plane, 298 passengers and crew, were killed after it was shot out of the sky. It is thought Russian-backed rebels fired at it after mistaking it for a Ukrainian military plane.r\nUkrainian secret services confirmed shortly after the incident that they had intercepted audio from Russian military channels of a known Red Army commander ordering a missile system into position before the strike.\nDubinsky aka Khmury (Grumpy) had already been unmasked as the man behind that voice, but Wednesday's comments mark his first significant account of the incident.\nTiunov (rear) says he believes Dubinsky (left) knows the identities of those who gave the order, and fears for his friend's life\nAt the time, he was head of military intelligence for the self-proclaimed and pro-Putin Donestsk People's Republic.\nDuring the conflict in Ukraine, Dubinsky and Tiunov had met several times, and the colonel had freed a number of Ukrainian soldiers captured by the rebels.\nTiunov said: 'I could not stay calm (and I told him) it is you who hit the Boeing passenger plane like gangsters!\n'I saw the expression on his face and felt that he was hurt, and took it very personally.\n'He said: \"You think I did it myself?\"\n'Then he pointed his finger at the heavens and said: \"It was done by b******* from Moscow!'\n'It was hard for him to talk about it, he had to make excuses. He is a military man after all, not a gangster.\n'It was clear for me, he understood that he was linked to it and that he was partly guilty in the death of civilians.\n'So he quickly ended our conversation.'\nThe revelation - if true - destroys the Kremlin's version that the plane was shot down by Ukrainian forces, and suggests a Moscow cover-up to hide the truth.\nThis Russian claim had already been rejected by an international probe into the disaster, but would mark the first denial from a source close to the Kremlin.\nTiunov said Dubinsky's confession came when he confronted his friend over the missile launch, accusing him of being a 'gangster'\nIf Tiunov's comments are accurate, it marks the first time Dubinsky has admitted his role in the MH17 disaster, and the first time a source close to Moscow has admitted Kremlin involvement\nTiunov said of Dubinsky: 'He was neither a b******, nor a rat. I know this.\n'Such people just don't survive in intelligence. He was fighting in Donbass (eastern Ukraine) as a soldier.\n'Yes, probably, he received a criminal command from his commander.\n'But I am 100 per cent sure - if he had known that it was a passenger plane, and if he had controlled the launch of the missile, he would have never chosen to kill civilians.\n'What's more, this is what I heard from him in person: \"It was done by b******* from Moscow!'\n'And now he is pictured as the most guilty man. I don't accept this.'\nHe stated: 'He is a key witness, but he is not a murderer.\n'And he is my friend. I want him to stay alive. I believe he did not press the button of that Buk, he only coordinated its movements.'\nIn total 298 people died in the air disaster in 2014. It is thought Russian-backed militants fired at the aircraft, thinking it was a Ukrainian military plane","url":"https://www.dailymail.co.uk/news/article-4447044/Fears-MH17-witness-blames-Russia-attack.html"}
