{"authors":["Belinda Grant Geary For Daily Mail Australia","Simon Tomlinson For Mailonline"],"date_download":"2018-10-23 02:48:56","date_modify":"2018-10-23 02:48:56","date_publish":"2016-01-11 15:16:29","description":"A safety expert has suggested that Malaysian Airlines flight MH370 was hijacked by its pilot before it crashed killing the plane's 239 passengers and crew, according to reports.","filename":"data/vaneerConsumption/MH370scaptainhijackedandcrashedtheMalaysiaAirlinesplane.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B570B00000578-0-image-a-186_1452525288956.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394086_Veteran-airline-pilot-claims-MH370-s-captain-hijacked-crashed-Malaysia-Airlines-aircraft-238-passengers-crew-board_1540262936.html","title":"MH370's captain hijacked and crashed the Malaysia Airlines plane","title_page":"MH370's captain hijacked and crashed the Malaysia Airlines plane | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A safety expert and former US airline pilot has suggested that Malaysian Airlines flight MH370 was hijacked by its captain before it crashed killing all 239 passengers and crew on board.\nCaptain John Cox, a veteran pilot and now the leader of an aviation safety consultancy, said there is evidence to suggest that Captain Zaharie Ahmad Shah took control of the plane before it disappeared on March 8, 2014.\n'The most likely theory, in my opinion, is the MH370 [disappearance] was an intentional act by the captain,' he told The Australian.\nScroll down for video\nCaptain John Cox (left) said there is evidence to suggest that Captain Zaharie Ahmad Shah (right) took control of the plane before it disappeared\nIt is widely believed that the aircraft's pilots fell unconscious from oxygen deprivation as the plane is understood to have flown without pilot intervention in the last five hours of its journey\nHowever, Captain Cox said it is more likely that Captain Zaharie intentionally programmed the plane to follow that path before flying over his home island of Penang, off the coast of Malaysia, to 'avoid attention', the Australian reported.\nOthers have speculated that the plan suffered a sudden and catastrophic loss of power that left it flying on auto-pilot until it ran out of fuel and crashed in the ocean.\nThe findings by the Australian Transport Bureau (ATB) explain why two crucial communications systems both stopped working and why air traffic controllers failed to contact the pilots.\nThe Boeing 777 is widely believed to have ditched in the Indian Ocean after disappearing on March 8 last year en route from Kuala Lumpur to Beijing, killing all 239 people on board.\nOthers suggest the Malaysian Airlines flight MH370 (above) suffered a sudden and catastrophic loss of power that left it flying on auto-pilot until it ran out of fuel and crashed in the ocean\nVital clue: In July, a two-metre-long flaperon wing flap (above) from MH370 washed up on the Indian Ocean island of Reunion, marking the first concrete evidence that MH370 met a tragic end in the sea\nCrash investigators revealed the jet's Satellite Data Unit (SDU) had unexpectedly tried to log on to a satellite around an hour and a half after the flight took off.\nThis request – known as a handshake or ping – was likely to have been caused by a power failure on board.\nThe SDU was able to reboot itself, after the auxiliary power unit kicked to restore electricity, allowing it to send a series of subsequent pings that allowed experts to locate its final position hundreds of miles away in the southern Indian Ocean.\nHowever, according to The Daily Beast, the ATB report said many of the plane's other electrical systems shut down, leaving the pilots powerless to control the aircraft.\nThis, the website says, supports the theory that a devastating fire on board caused the outage rather than deliberate actions by the pilots to sabotage the flight.\nIt notes that much of the power to run the plane's systems comes from generators attached to each of the two engines which, through multiple connections, is distributed throughout the aircraft.\nMystery: The Boeing 777 is widely believed to have ditched in the Indian Ocean after disappearing on March 8 last year en route from Kuala Lumpur to Beijing, killing all 239 people on board. A massive search is ongoing west of Australia, emboldened by the discovery of the wing flap on La Reunion island in July\nThe main concentration of the computers, which control the aircraft's communications systems, is located in the Main Equipment Centre (MEC) next to the forward cargo hold.\nAny possible fire in the hold could have breached the MEC, damaging the jet's avionics but also incapacitating the crew and passengers.\nHowever, the computers for the SDU are located in the roof of the cabin, meaning this system would have been able to continue transmitting.\nThe auto-pilot would also have been able to operate, leaving the jet flying as a 'zombie plane' until it ran out of fuel.\nWhen the engines stopped working, the SDU would then have lost power.\nBut when the APU kicked in, the SDU would have rebooted and automatically sent a final ping moments before it crashed, explaining why satellite data was received so late in the flight.\nThe report, however, does not explain what caused the power cut, only saying that it could be due to technical failures.\nIt also does not rule out deliberate action by Captain Zaharie Ahmad Shah or his co-pilot, whether a deliberate action to sabotage the aircraft or a desperate, failed attempt to temporarily cut the power to resolve a technical problem.\nIt says the outage could have been caused by the crew using overhead switches in the cockpit or accessing the MEC below the flight deck.\nThe findings were buried in a report by the ATB released last week which said fresh analysis of data on missing jet MH370 confirmed authorities are searching in the right place, with hopes remaining that it will one day be found.\nBased on satellite analysis of the jet's likely trajectory after it diverted from its flight path, ships have been scouring the seabed off Australia's west coast, so far covering 75,000 square kilometres (29,000 square miles) of a 120,000 square kilometre target zone without result.\nDeputy Prime Minister Warren Truss said the Australian Defence Science and Technology Group had been tasked with crunching all available data once again to make sure nothing had been missed.\nThe conclusions, using models of Inmarsat satellite communications data, aircraft dynamics and meteorological data to determine likely flight paths, were released in a new report - 'MH370 - Definition of Underwater Search Areas.'\n'The key outcomes of this additional work validate what has happened so far. It affirms that the aircraft is likely located somewhere in the 120,000 square kilometre area along the seventh arc,' Truss said, referring to the area where authorities believe the plane went down.\n'The new research further emphasises that we are searching in the right direction, it uses different methodology and has come to the same conclusions.\n'That gives us real encouragement that every effort is being made to ensure the search is well focused and well targeted and hopefully will therefore achieve someday a satisfactory result.'\nAustralian Deputy Prime Minister Warren Truss points to the MH370 search area in June last year. Last week, the Australian Transport Authority said fresh analysis of data on missing jet MH370 confirmed authorities are searching in the right place, with hopes remaining that it will one day be found\nThree ships continue to scour the area, in between returning to port to resupply - a four-day voyage in each direction through often harsh conditions.\n'Weather continues to impact on search operations but the onset of summer is expected to bring more favourable conditions over the coming months,' the Joint Agency Coordination Centre said in a separate update Thursday.\nSpeculation on the cause of the plane's disappearance has focused primarily on a possible mechanical or structural failure, a hijacking or terror plot, or rogue pilot action.\nInvestigators believe the aircraft ran out of fuel and crashed somewhere in the southern Indian Ocean, sparking one of the biggest mysteries in aviation history.\nDespite the satellite evidence pointing to the plane going down, many Chinese relatives of those on board remain sceptical, and are convinced their loved ones are alive, perhaps being held at an unknown location.\nIn July, a two-metre-long (almost seven-foot) flaperon wing part washed up on a beach on the Indian Ocean island of Reunion which was confirmed to be from the ill-fated flight, marking the first concrete evidence that MH370 met a tragic end.","url":"https://www.dailymail.co.uk/news/article-3394086/Veteran-airline-pilot-claims-MH370-s-captain-hijacked-crashed-Malaysia-Airlines-aircraft-238-passengers-crew-board.html"}
