{"authors":[],"date_download":"2018-10-22 22:03:35","date_modify":"2018-10-22 22:03:35","date_publish":"2014-06-08 06:03:57","description":"The Reward MH370 project aims “to encourage a whistle blower to come forward,” a statement issued by five family members said.","filename":"data/vaneerConsumption/MH370FamiliesSeek5MillionforRewardandInvestigation.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/238116/140308-malaysia-plane-js-1034_a5a775f88e6ce79ff901171214fb5597.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_mh370-families-seek-5-million-reward-investigation-n125526_1540245815.html","title":"MH370 Families Seek $5 Million for Reward and Investigation","title_page":"MH370 Families Seek $5 Million for Reward and Investigation","title_rss":"NULL","source_domain":"nbcnews.com","text":"“This mystery is unprecedented in the history of aviation, and we need to work as a collective community with one goal of finding the truth, the plane and the passengers,” Hunt said.\n“Utilizing the immense potential of the crowd we believe we can achieve our primary goal of recovering the flight where others methods have failed in the past,” he said. “We are convinced that somewhere, someone knows something, and we hope this reward will entice him or her to come forward.”\nThe statement said the project was launched by five family members of passengers. It included statements from Ghislain Wattrelos, whose children and wife were on the plane; Sarah Bajc, whose partner was aboard; Peter Weeks, whose brother was on board; and K.S. Narendran and Pralhad Shirseth, whose wives were aboard.\nBajc said she believed that “Without a new tactic, the truth and the plane will never be found.”\nFamily members of the passengers and crew have been highly critical of the search for the jet, which first was handled by the Malaysian government, then by Australia’s after new satellite data and analysis showed that the jet flew out over the Indian Ocean.\n— Gil Aegerter","url":"https://www.nbcnews.com/storyline/missing-jet/mh370-families-seek-5-million-reward-investigation-n125526"}
