{"authors":["Ekin Karasin","Dailymail.Com Reporter"],"date_download":"2018-10-23 00:04:27","date_modify":"2018-10-23 00:04:27","date_publish":"2017-03-16 08:50:02","description":"The British security service made 'substantial contributions' to the US investigation of the massive data breach, the FBI's executive director Paul Abbate revealed.","filename":"data/vaneerConsumption/MI5helpedcatchtwoRussianspiesinYahooemailhack.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/17/3E4E42A600000578-0-image-a-55_1489597663753.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319252_MI5-helped-catch-two-Russian-spies-Yahoo-email-hack_1540253067.html","title":"MI5 helped catch two Russian spies in Yahoo email hack","title_page":"MI5 helped catch two Russian spies in Yahoo email hack | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The MI5 have been praised for helping to unmask two Russian cyberspies who allegedly hacked around 500 million Yahoo accounts.\nThe British security service made 'substantial contributions' to the US investigation of the massive data breach, the FBI's executive director Paul Abbate revealed.\nFSB officers Dmitry Dokuchaev, 33, and Igor Sushchin, 43, and two other men face 47 charges including theft of trade secrets and computer fraud, the US Justice Department revealed on Wednesday.\nThe Justice Department has announced two Russian spies are among the four people charged over the massive data breach at Yahoo that impacted at least half-a-billion accounts\nSources claimed the MI5 was brought in to help the US probe as the actions of Russia's intelligence agency were classed as 'hostile actors'.\n'MI5 is investigating the same parts of the Russian intelligence services as the FBI — those hostile actors look to carry out cyber attacks in the UK,' a Whitehall insider told The Times.\n'The UK faces the same kind of threat. MI5 is working to counter any threat from the Russian intelligence looking to target the UK, in the same way as it has targeted the US.'\nThe hack targeted the email accounts of several US government figures, including 'cyber security, diplomatic, military and White House personnel', Russian journalists and opposition politicians and former government officials in neighboring countries.\nMcCord, acting assistant attorney general for the National Security Division, spoke to reporters in Washington DC on Wednesday morning.\nActing Assistant Attorney General Mary McCord speaks in front of a poster of one of the suspected Russian spies on Wednesday\nThe two other men were described as criminal hackers, and identified as: Alexsey Alexseyevich Belan, 29, and Karim Baratov - a 22-year-old Canadian and Kazakh national and a resident of Canada.\nBaratov has been taken into custody in Canada, and Belan is on the list of the FBI's most wanted cyber criminals.\nMcCord said the Russian spies 'protected, directed, facilitated, and paid,' Belan and Baratov to take part in the operation.\n'The criminal conduct at issue, carried out and otherwise facilitated by officers from an FSB unit that serves as the FBI's point of contact in Moscow on cybercrime matters, is beyond the pale,' she said in a statement.\nThe two Russian spies charged over the hack are Dmitry Dokuchaev (left) and Igor Sushchin (right)\nWHO ARE THE YAHOO HACKERS? Alexsey Alexseyevich Belan, 29: Born in Latvia and is a Russian national and resident. US Federal grand juries have indicted Belan twice before, in 2012 and 2013, for computer fraud and abuse, access device fraud and aggravated identity theft involving three US-based e-commerce companies and the FBI placed Belan on its 'Cyber Most Wanted' list. Belan is currently the subject of a pending 'Red Notice' requesting that Interpol member nations (including Russia) arrest him pending extradition. Belan was also one of two criminal hackers named by President Barack Obama on Dec. 29, 2016, pursuant to Executive Order 13694, as a Specially Designated National subject to sanctions. Dmitry Aleksandrovich Dokuchaev, 33: Officer in the FSB Center for Information Security, aka 'Center 18.' Dokuchaev was a Russian national and resident. Igor Anatolyevich Sushchin, 43: FSB officer, and a superior to Dokuchaev within the agency, and a Russian national and resident. Sushchin was embedded as a purported employee and Head of Information Security at a Russian investment bank. Karim Baratov, aka 'Kay,' 'Karim Taloverov' and 'Karim Akehmet Tokbergenov,' 22: He is a Canadian and Kazakh national and a resident of Canada. It is believed he was the suspect taken into custody.\nOne of the hackers allegedly used by the Russian spies is Alexsey Alexseyevich Belan (pictured), 29 - who is on the list of the FBI's most wanted cyber criminals\n'Once again, the Department and the FBI have demonstrated that hackers around the world can and will be exposed and held accountable.\n'State actors may be using common criminals to access the data they want, but the indictment shows that our companies do not have to stand alone against this threat.'\nThe range of charges are officially listed as: Conspiring to commit computer fraud and abuse, Conspiring to engage in and committing economic espionage, Conspiring to engage in and the theft of trade secrets, Conspiring to commit wire fraud, Accessing a computer without authorization to obtain information for the purpose of commercial advantage and private financial gain, Transmitting code with the intent to cause damage to computers, Counterfeit access device fraud, Counterfeit access device making equipment, and Aggravated identity theft.\nOne of the defendants has been taken into custody in Canada.\nMarissa Mayer, Yahoo's outgoing CEO, tweeted her thanks to the agencies shortly after the press conference\nMarissa Mayer, Yahoo's outgoing CEO, tweeted her thanks to the agencies shortly after the press conference.\n'Very grateful to the FBI & DOJ for bringing to justice the Russian officials & hackers who led the attack on Yahoo,' Mayer wrote.\nYahoo's Assistant General Counsel, Head of Global Law Enforcement, Security and Safety also commented on the indictments.\n'The indictment unequivocally shows the attacks on Yahoo were state-sponsored. We are deeply grateful to the FBI for investigating these crimes and the DOJ for bringing charges against those responsible,' Chris Madsen wrote.\nThe massive data breach at Yahoo saw the accounts of more than half-a-billion customers targeted (file photo)\nYAHOO'S FULL STATEMENT ON THE HACKING INDICTMENTS Earlier today, the US Department of Justice announced the indictment of four defendants, two Russian intelligence officers and two state-sponsored hackers, for the theft of Yahoo user data in late 2014, as well as cookie forging to obtain access to user accounts on our network in 2015 and 2016. The indictment unequivocally shows the attacks on Yahoo were state-sponsored. We are deeply grateful to the FBI for investigating these crimes and the DOJ for bringing charges against those responsible. This morning's announcement is consistent with our prior disclosures. On September 22, 2016, we disclosed our belief that a state-sponsored actor had stolen a copy of certain user account information for approximately 500 million user accounts in late 2014. On December 14, 2016, we provided details on the forging of cookies to gain access to certain user accounts without a password and we linked some of that activity to the same state-sponsored actor. We appreciate the FBI's diligent investigative work and the DOJ's decisive action to bring to justice those responsible for the crimes against Yahoo and its users. We're committed to keeping our users and our platforms secure and will continue to engage with law enforcement to combat cybercrime.\n'This morning's announcement is consistent with our prior disclosures. We appreciate the FBI's diligent investigative work and the DOJ's decisive action to bring to justice those responsible for the crimes against Yahoo and its users.\n'We're committed to keeping our users and our platforms secure and will continue to engage with law enforcement to combat cybercrime.'\nThe charges arise from a compromise of Yahoo user accounts that began at least as early as 2014.\nThough the Justice Department has previously charged Russian hackers with cybercrime - as well as hackers sponsored by the Chinese and Iranian governments - this would be the first criminal case brought against Russian government officials.\nIt comes as federal authorities investigate Russian interference through hacking in the 2016 presidential election.\nYahoo did not disclose the 2014 breach until last September when it began notifying at least 500 million users that their email addresses, birth dates, answers to security questions and other personal information may have been stolen.\nThree months later, Yahoo revealed it had uncovered a separate hack in 2013 affecting about 1 billion accounts, including some that were also hit in 2014.\nRich Mogull, CEO of security firm Securosis, said Wednesday's indictment 'shows the ties between the Russian security service and basically the criminal underground,' something that had been 'discussed in security circles for years.'\nCyber criminals gave Russian officials access to specific accounts they were targeting; and in return, Russian officials helped the criminals to evade authorities and let them keep the type of information that hackers that hack for money tend to exploit such as email addresses and logins and credit card information.\nMogull said he was surprised the Department of Justice was able to name specific individuals and issue the indictment.\n'We've come to expect that you don't really figure out who performs these attacks,' he said.\nThe fact that the indictment ties together the FSB and criminals is a new development, he said.\n'It will be very interesting to see what comes up in court, and how they tie those two together.'\nActing AAG for National Security Mary McCord speaks in front of a poster of a suspected Russian spy during Wednesday's press conference\nIt is alleged the FSB agents paid the hackers to target Yahoo. The spy agency has been referred to by some experts as Vladimir Putin's (pictured) modern-day KGB","url":"https://www.dailymail.co.uk/news/article-4319252/MI5-helped-catch-two-Russian-spies-Yahoo-email-hack.html"}
