{"authors":[],"date_download":"2018-10-30 14:27:28","date_modify":"2018-10-30 14:27:28","date_publish":"2014-09-20 00:00:00","description":null,"filename":"data/vaneerConsumption/MichelleKvetchestoChildrenwithCancer.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2014_09_michelle_kvetches_to_children_with_cancer_1540909648.html","title":"Michelle Kvetches to Children with Cancer","title_page":"Michelle Kvetches to Children with Cancer","title_rss":"NULL","source_domain":"americanthinker.com","text":"After admitting that she dislikes “selfies” but agreeing to be part of an “ussie,” and after discussing flying her dogs around on Air Force One, the first lady became painfully honest. So much so that she even complained to youngsters battling childhood cancers about the misery of living in the White House and being married to a guy who, besides being the president of the United States, spends an inordinate amount of time on the golf course.\nFirst Lady Michelle Obama figured now was as good a time as any to visit some sick children. Not the ones on breathing tubes suffering from Enterovirus 68, mind you, but non-contagious patients at St. Jude Children’s Research Hospital in Memphis, Tennessee.\nThe first lady’s grievances were expressed in response to the star-struck kids asking her what her “favorite part [was] about being in the White House.”\nMrs. Obama’s initial response to the question was that her favorite thing “[a]bout being in the – about being First Lady is being able to do stuff like this, really. And it is so special for me to get to meet kids like you guys.”\nMichelle didn’t mention the trolleys shuttling her and her guests to elegant state dinners in heated tents. Nor did she mention the famous people who drop by for parties and major events, or her unlimited access to $100-per-pound Wagyu beef, $12K Carolina Herrera gowns, millions of dollars for vacations all over the world, or the multitude of other perks she enjoys at taxpayers’ expense.\nInstead, Michelle unloaded her personal problems onto cancer-stricken kids. To commiserate with children who may not live to see puberty, Mrs. Obama chose to distract them by saying that for her, “[s]ometimes living in the White House and being married to the president and trying to live a life like that, it can be hard.”\nAs for us, okay, we get it: it’s hard times for Michelle Obama, which may be why, when she’s not vacationing or shopping for haute couture, she feels compelled to share her personal troubles with little kids on anti-nausea drugs. Still, one can’t help but wonder – if living in the White House with servants, butlers, and chefs is hard for Michelle, how would the first lady have fared as a seven-year-old enduring chemotherapy or radiation treatments?\nAfter involving the sick and dying in her marital struggles and her displeasure with her current living arrangements, Michelle turned upbeat and followed up her “married to … life like that … can be hard” comment with: “But when I meet you guys, I am so inspired, which is one of the reasons why I like to come and spend time with you guys.”\nThe FLOTUS then went on to tell the pediatric patients that she once worked in a hospital, but she skipped the part about it being a no-show job for $316K per year. Then Mrs. Obama complimented her audience, telling them, “[Y]ou all [are] smart … focused and courageous[.]” This is way more than can be said for the guy she’s married to, who, based on his leadership style, has turned out not to be smart, focused, or courageous.\nMichelle stressed to the kids, many of whom had no hair, that visiting with them is the “cool part” of being first lady, after which she repeated aloud the children’s question: \"What’s the best part of living in the White House?\"\nMichelle confessed that for her, one “best part” is the South Lawn.\nThe South Lawn is where heated tents have been erected in the dead of winter to wine and dine French presidents. It’s where Mrs. Barry O’Bama gets to dye the water in the fountain green on St. Patrick’s Day, where the annual Easter egg roll takes place, and where the Obamas hand out candy on Halloween. It is also where the White House Kitchen Garden and beehives reside, and where Marine One drops off at the house Michelle finds it hard to live in the husband she finds it hard being married to, and where Sunny and Bo occasionally drop stuff off, too.\nThen, in addition to doing Art Therapy, promising to dance after the cameras shut off, and agreeing to pour a bucket of water over the president’s head when she got home, Mrs. Obama told the kids:\nI like the Truman Balcony … that that’s one of my favorite places to be, because we can be outside and you can look over the fountain, and you see the Washington Memorial, and it’s a really pretty view. And it’s peaceful.\nThe Truman Balcony is where the president and his put-upon first lady, together with various world leaders, endure the drudgery of black-tie cocktail parties, where Michelle joins her husband in begrudgingly thanking the troops for their service at 4th of July picnics, and where the Obamas occasionally emerge like royalty to wave to the unwashed masses from a lofty perch, far from one-on-one contact with illegal teenage assassins, illegal sex offenders, and contagions like Enterovirus 68, MDR-TB, Norwegian scabies, malaria, and soon-to-be-arriving hemorrhagic Ebola.\nThe Truman Balcony is also the perfect platform for tossing cake to America’s starving peons. That’s why it’s good to know that if she’s feeling miserable about being married to the president and glum about the tough life she lives, Michelle has somewhere to go to take her mind off her troubles.\nAnd so, probably with good intentions at heart, the first lady did visit sick kids at St. Jude's Research Hospital. However, omitting tales of opulent indulgence while complaining to the terminally ill about her husband and her supposed difficult life in the White House proves again that Michelle Obama has no idea what it means to suffer.\nJeannie hosts a blog at www.jeannie-ology.com.","url":"https://www.americanthinker.com/articles/2014/09/michelle_kvetches_to_children_with_cancer.html"}
