{"authors":["Chris Spargo For Dailymail.Com"],"date_download":"2018-10-23 03:18:12","date_modify":"2018-10-23 03:18:12","date_publish":"2016-01-28 18:42:36","description":"Michael Sam is giving the National Football League one last shot, revealing on his Twitter account that he wanted to try and play in the league when asked by a fan.","filename":"data/vaneerConsumption/MichaelSamtryingtogetbackintotheNFLafteropenlygayfootballplayerwascut.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30ACB7DB00000578-0-image-a-2_1454003843684.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421337_I-m-going-one-shot-Michael-Sam-trying-NFL-openly-gay-football-player-cut-two-teams-rookie-season_1540264692.html","title":"Michael Sam trying to get back into the NFL after openly gay football player was cut","title_page":"Michael Sam trying to get back into the NFL after openly gay football player was cut | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Michael Sam is giving the National Football League one last shot.\nThe openly gay player, who was selected by the St. Louis Rams in the 2014 draft and then cut before the regular season began before going to the Dallas Cowboys, who aided him to their practice squad before waiving him just a few months later in November, having never played a regular-season game.\nAfter a fan on Twitter asked Sam if he was hoping to perhaps give the NFL one last chance and tryout for a team, he responded by saying; 'I'm going to give it one more shot.'\nScroll down for video\nBig news: Michael Sam has revealed he is going to give the NFL once last shot\nGet ready: Sam shared the news on Twitter with his fans this week as the NFL Veteran Combine is soon\nSo close: Sam was selected by the St. Louis Rams in the 2014 draft and then cut before the regular season began\nIn early 2015 Sam participated in Dancing With the Stars at the height of his media fame and during the NFL offseason.\nSam went to play in the Canadian Football League after a disappointing NFL Veteran Combine in 2015, signing a two-year contract with the Montreal Alouettes, making him the first openly gay football player in that league as well.\nHe abruptly left the team however in August after playing in just one game and sitting out five citing concerns with his mental health.\nTough times: Sam and his boyfriend Vito Cammisano ended their engagement in June (above in March)\nGood times: Sam also competed on Dancing With the stars last year\nIt had been revealed just two months prior to his departure that Sam and his boyfriend, Vito Cammisano, had ended their engagement.\nHe has been avoiding the spotlight ever since his departure from the CFL, though he did manage to become one of the most hated men on the internet just beofre Christmas when he stupidly decided to spoil the ending of the new Star Wars film on Twitter.","url":"https://www.dailymail.co.uk/news/article-3421337/I-m-going-one-shot-Michael-Sam-trying-NFL-openly-gay-football-player-cut-two-teams-rookie-season.html"}
