{"authors":["Joshua Caplan"],"date_download":"2018-10-30 17:50:35","date_modify":"2018-10-30 17:50:35","date_publish":"2018-10-30 15:05:36","description":"Michael Avenatti is \"breathing life\" into the Democrat Party as he courts former Clinton and Sanders advisers for a possible 2020 run.","filename":"data/vaneerConsumption/MichaelAvenattiBreathingLifeintoDNCWinsOverBernie.json","image_url":"https://media.breitbart.com/media/2018/10/michael-avenatti-fans-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_10_30__1540921835.html","title":"Michael Avenatti 'Breathing Life' into DNC, Wins Over Bernie","title_page":"Michael Avenatti 'Breathing Life' into DNC, Wins Over Bernie/Hillary Alums","title_rss":"NULL","source_domain":"breitbart.com","text":"Television lawyer and Resistance hero Michael Avenatti is “breathing life” into the Democrat Party as he courts former Hillary Clinton and Bernie Sanders advisers for a possible White House run in 2020, according to a new report.\nPolitico reports John Robinson, who served as the chief operating officer of Sanders’ 2016 campaign, has been informally advising Avenatti on a potential presidential run and will likely lead up the lawyer’s campaign if he runs. Adam Parkhomenko, who co-founded the Ready for Hillary super PAC in 2013, says he will back Avenatti if he jumps into the crowded Democrat field. “He’s absolutely the person I’m supporting in the 2020 primary, should he decide to run,” the veteran Clinton adviser, who is acting as a “liaison” between Avenatti and Democrat National Committee leaders, told Politico. “I think he is 90 to 95 percent leaning toward doing it.”\nEarlier this month, Avenatti tapped Roger Salazar, another Clinton 2016 alum, to oversee his media strategy, and hired Ready for Hillary committee treasurer Amy Wills Gray to oversee compliance for his The Fight PAC, supporting Democrat candidates running in the fast-approaching midterm election. Further, former Clinton White House counsel Jack Quinn and his wife Susanna Quinn recently threw a dinner for Avenatti at their Washington, D.C. home and have acted as informal advisers to the lawyer. Asked if he has any plans to join Avenatti’s campaign, Quinn shot down the idea.\n“I know Michael, I like him. I consider him a friend,” said Quinn. “But I have a lot of other friends who also want to be president.”\nWhile most establishment Democrats have bristled at the prospect of an Aventtai bid, some state party leaders are welcoming the Resistance hero with open arms. “The institutional Democrats now look at Avenatti as a threat. Now they’ve got to discredit him and blame him,” Mahoning County Democratic Party chairman David Betras said. “They weren’t blaming him in the spring when he was knocking the socks off of Donald Trump and Michael Cohen. They weren’t calling him a bad guy then.”\n“When our Democratic base was dead, beaten and broken, he came and breathed life in the party,” he added. “No one else was breathing life into the party. No one else was doing that.”\nAvenatti has said he will make a final decision on whether he will run for president by January 1.\nAs Avenatti continues to build out the infrastructure needed to run, the lawyer faces two possible investigations by the Department of Justice and mounting questions about his past business dealings. Senate Judiciary Committee Chairman Chuck Grassley (R-IA) referred Avenatti for two criminal probes last week, accusing the lawyer and his client, Julie Swetnick, of making false statements during the confirmation process of now-Supreme Court Justice Brett Kavanaugh.\nA recent Daily Beast report shined a light on Avenatti’s messy finances, including outstanding rent payments and tax liens, and he was ordered by a Los Angeles judge last Monday to fork over $4.85 million to his former law firm partner, who sued for the 2020 hopeful for stiffing him out of profits.\n“There’s all kinds of things I would not have done. Do I think any of them are disqualifying? No. Do I think any of them are disqualifying in the age of Donald Trump? Absolutely not,” Avenatti said of his past transgressions. “But look, I’m a real guy. I’m a genuine guy. But if I decide to do it and some of these things come out, I’m going to own them.”","url":"https://www.breitbart.com/politics/2018/10/30/2020-michael-avenatti-breathing-life-into-the-party-wins-over-bernie-hillary-alums/"}
