{"authors":["Charlie Spiering"],"date_download":"2018-10-30 19:02:16","date_modify":"2018-10-30 19:02:16","date_publish":"2015-03-19 12:36:02","description":"Michelle Obama speaks about the importance of educating girls during a trip to Japan. |","filename":"data/vaneerConsumption/MichelleObamaBeingAWorkingMomMadeMeABetterMother.json","image_url":"https://media.breitbart.com/media/2015/01/Michelle-Obama-Got-Your-Six-Jacquelyn-Martin-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_19__1540926136.html","title":"Michelle Obama: Being A Working Mom Made Me A Better Mother","title_page":"Michelle Obama: Being A Working Mom Made Me A Better Mother | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"During her trip to Japan, First Lady Michelle Obama praised “tremendous strides” in educating girls around the world, but described a personal opposition to the “outdated belief” that women had to eventually choose between their careers or their children.\n“We still struggle with the outdated belief that a woman cannot be both an accomplished professional and a devoted mother; that she has to choose between the two,” she said, asserting that such ideas limited not only women’s potential, but the potential of a nation.\nThe First Lady made her remarks during a “Let Girls Learn” event in Tokyo, Japan.\n“That’s where this issue gets personal,” she said, recalling her upbringing in a working class family in Chicago.\n“As a young girl I was bright, outgoing, with plenty of thoughts and opinions of my own, but like a lot of young women, I was often primarily defined by my relationship to the men in my life,” she said. “I was my father’s daughter, or, even though I was just as smart as my brother — I could hit a ball just as far, I could run just as fast — I was always just his little sister.”\nMrs. Obama continued her story, describing teachers who diminished her potential because of her background and downplayed her chances at getting accepted to Princeton.\n“Like so many girls across the globe, I got the message that someone like me wasn’t supposed to have big dreams; that I should keep my head down, my voice quiet, and I should make myself just a little smaller to fit other people’s modest expectations,” she said.\nMrs. Obama said her parents encouraged her to work hard and get an education which afforded her multiple career opportunities.\nBecoming a working mother, she explained, made her a better mother, partially because she was serving as a role model for her own daughters.\n“For me, being a mother made me a better professional, because coming home every night to my girls reminded me what I was working for,” she said. “And being a professional made me a better mother, because by pursuing my dreams, I was modeling for my girls how to pursue their dreams.”\nBut the First Lady primarily stressed the importance of education for women around the world, as part of her global initiative.\n“I know that for every girl like me, there are so many others across the globe who are just as smart, just as capable, just as hungry to succeed, but they never have the chance to go to school,” she said. “And that is such a profound waste of human potential -– and such a profound loss for our world.”","url":"https://www.breitbart.com/politics/2015/03/19/michelle-obama-being-a-working-mom-made-me-a-better-mother/"}
