{"authors":[],"date_download":"2018-10-22 21:01:58","date_modify":"2018-10-22 21:01:58","date_publish":"2014-06-03 22:43:22","description":"The action aims to help prevent steeper cuts in Detroit retiree pensions as the city tries to resolve the largest public bankruptcy in U.S. history.","filename":"data/vaneerConsumption/MichiganSenateApproves195MforDetroitBankruptcy.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/485611/140603-detroit-bankruptcy-protest-mms-1852_3e2c30120a92a71c02fe86e4735410a6.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_business-news_michigan-senate-approves-195m-detroit-bankruptcy-n121801_1540242118.html","title":"Michigan Senate Approves $195M for Detroit Bankruptcy","title_page":"Michigan Senate Approves $195M for Detroit Bankruptcy","title_rss":"NULL","source_domain":"nbcnews.com","text":"The action by the Republican-controlled Senate sends a package of nine bills to Gov. Rick Snyder, who has pushed lawmakers for state money for Michigan's biggest city. The measures won approval from the Republican-controlled House of Representatives on May 22.\nUnder the so-called grand bargain in Detroit's debt adjustment plan, Michigan's nearly $195 million lump sum contribution, along with $466 million pledged over 20 years by philanthropic foundations and the Detroit Institute of Arts, would be used to ease pension cuts for city retirees. The deal would also protect city art works from being sold to raise money to pay city creditors and includes commitments from two unions to raise money for retiree healthcare costs.\nAll of the contributions are contingent on each other and on members of Detroit's two retirement systems agreeing to accept minimal cuts to their pensions to help the cash-strapped city deal with $18 billion of debt and other obligations.\nSnyder, a Republican, praised the bipartisan votes on the bills, adding that he intends to sign them in the next day or two.\n\"This package of bills will allow the grand bargain to move forward,\" he told reporters. He also urged Detroit's creditors to vote in favor of the debt adjustment plan they received last month.\nThe legislation would allow Michigan to take the money out of its rainy day fund. The money would be paid back to the fund over time from Michigan's share of a national settlement with U.S. tobacco companies.\nState officials have warned that unless the state participates in the settlement, Michigan could be hit with big legal and social service costs in the wake of larger pension reductions for Detroit retirees.\nU.S. Bankruptcy Judge Steven Rhodes, who is overseeing the city's case, has set July 24 for the start of a hearing on Detroit's debt adjustment plan to determine if it is fair and feasible.\n-Reuters and The Associated Press","url":"https://www.nbcnews.com/business/business-news/michigan-senate-approves-195m-detroit-bankruptcy-n121801"}
