{"authors":["Sofia Barrett-Ibarria"],"date_download":"2018-10-30 22:33:51","date_modify":"2018-10-30 22:33:51","date_publish":"2014-08-15 01:03:08","description":"Longtime advocate and supporter of Parkinson's research Michael J. Fox says he was \"stunned\" to hear that Robin Williams had early-stage Parkinson's disease when he died. Like many others, Fox was deeply saddened by the news of Williams' passing,…","filename":"data/vaneerConsumption/MichaelJFoxsShockedToLearnRobinWilliamsHadParkinsonsDisease.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/954172fb-29a6-450b-8543-bc813f3b542a.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35872-michael-j-foxs-shocked-to-learn-robin-williams-had-parkinsons-disease_1540938831.html","title":"Michael J. Fox's Shocked To Learn Robin Williams Had Parkinson's Disease","title_page":"Michael J. Fox's Shocked To Learn Robin Williams Had Parkinson's Disease","title_rss":"NULL","source_domain":"bustle.com","text":"Longtime advocate and supporter of Parkinson's research Michael J. Fox says he was \"stunned\" to hear that Robin Williams had early-stage Parkinson's disease when he died. Like many others, Fox was deeply saddened by the news of Williams' passing, describing him in a tweet as \"Famously kind, ferociously funny, a genius and a gentle soul. What a loss.\"\nFox has been an outspoken proponent of Parkinson's awareness since he publicly shared his own experience with the disease in 1998, and Williams had been a longtime supporter of the Michael J. Fox Foundation for Parkinson's Research, which seeks to find a cure for the debilitating disease. When Williams' wife Susan Schneider released a public statement confirming that Williams had been displaying symptoms of early Parkinson's disease, Fox took to Twitter once again on Thursday morning to express his disbelief: \"Stunned to learn Robin had PD. Pretty sure his support for our [foundation] predated his diagnosis. A true friend; I wish him peace.\"\nIn her statement, Schneider said, \"Robin's sobriety was intact and he was brave as he struggled with his own battles of depression, anxiety as well as early stages of Parkinson's Disease, which he was not yet ready to share publicly. It is our hope in the wake of Robin's tragic passing, that others will find the strength to seek the care and support they need to treat whatever battles they are facing so they may feel less afraid.\" Williams will surely be sorely missed by friends like Fox and others who were unaware of his private struggle with Parkinson's.","url":"https://www.bustle.com/articles/35872-michael-j-foxs-shocked-to-learn-robin-williams-had-parkinsons-disease"}
