{"authors":[],"date_download":"2018-10-30 21:24:52","date_modify":"2018-10-30 21:24:52","date_publish":"2017-02-04 01:37:00","description":"Michael Vick’s NFL career is over.","filename":"data/vaneerConsumption/MichaelVicksaysheisretired.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/01/Images/010217%20falcons%20photos%20CC5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_michael-vick-says-retired__1540934692.html","title":"Michael Vick says he is retired","title_page":"Michael Vick says he is retired","title_rss":"NULL","source_domain":"ajc.com","text":"Michael Vick’s NFL career is over.\nThe Atlanta Falcons’ made Vick the first overall pick in the 2001 NFL Draft. He played six seasons in Atlanta before a federal conviction for his role in dog-fighting ring sent him to jail for 23 months.\nHe started 67 games going 38-28-1 in Atlanta. He completed 930 of 1,730 passes for 11,505 yards, 71 touchdowns and 52 interceptions as a Falcon. He went 2-2 in the playoffs. In 2002, he helped the Falcons upset the Green Bay Packers in a wild-card playoff game at Lambeau Field. It was the Packers' first playoff loss at home in the postseason.\nAs a runner, Vick blazed through 3,859 yards and 21 touchdowns as a Falcon. In 2006, he became the first - and only - quarterback in the NFL to rush for more than 1,000 yards in a season.\nThe Falcons released him in 2009 after failing to trade him. He went on to play for the Philadelphia Eagles, N.Y. Jets, and Pittsburgh Steelers.\nVick, 36, told ESPN's Josina Anderson he was retiring.\nTHIS JUST IN: Michael Vick tells @JosinaAnderson that he's officially retired from the NFL. pic.twitter.com/0sN66Ggo52 — SportsCenter (@SportsCenter) February 3, 2017\nIn a statement to ESPN, he said:\n\"I think it's time. ... “So now I think I'm officially ready, I'm ready to move on to different things in my life and different facets of my life.\"\nVick recently penned a letter to Atlanta looking back at his time in in the city. He had previously said he would like to retire a Falcon.","url":"https://www.ajc.com/sports/football/michael-vick-says-retired/ByfVSMhjbhEUlgkwcThwQP/"}
