{"authors":["Associated Press"],"date_download":"2018-10-22 20:04:01","date_modify":"2018-10-22 20:04:01","date_publish":"2016-01-29 00:17:19","description":"LANSING, Mich. (AP) — Michigan lawmakers directed another $28 million on Thursday to address Flint's lead-contaminated water supply, allocating money for bot...","filename":"data/vaneerConsumption/Michiganlawmakersapprove28MmoreforFlintwatercrisis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:a92ec434fd914e7ea035101ce67c7ba5-4PuZeKVXE7cd9005b2c8762c1f33-200_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420460_Michigan-set-OK-28M-address-Flint-water-crisis_1540238641.html","title":"Michigan lawmakers approve $28M more for Flint water crisis","title_page":"Michigan lawmakers approve $28M more for Flint water crisis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Michigan lawmakers approve $28M more for Flint water crisis\nLANSING, Mich. (AP) — Michigan lawmakers directed another $28 million on Thursday to address Flint's lead-contaminated water supply, allocating money for bottled water, medical assessments and other costs for the financially struggling city.\nThe quick and unanimous approval by the House and Senate came just over a week after the funding was proposed by Gov. Rick Snyder, who is expected to sign it quickly.\n\"We obviously have a number of issues that we have to deal with, whether it's infrastructure, whether it's folks having to pay for water that obviously is undrinkable,\" said Senate Minority Leader Jim Ananich, D-Flint. \"But the most important I think right now ... is to start the focus on the assessment and the providing of services.\"\nMembers of the Michigan National Guard load bottled water at a fire station, Thursday, Jan. 28, 2016 in Flint, Mich. The Michigan Legislature voted Thursday to direct another $28 million to address Flint's water emergency, allocating money for bottled water, medical assessments and other costs in the city struggling with a lead-contaminated supply. (AP Photo/Carlos Osorio)\nThis is the second round of funding enacted since the crisis was confirmed in the fall, bringing the total allocated to nearly $39 million. Snyder has promised to put forward more funding for Flint in his upcoming annual budget proposal — when he also will detail plans for a one-time $575 million surplus — but has not said how much.\nIt is unlikely to be as high as the up to $400 million figure mentioned in Congress on Thursday. Senate Democrats proposed that amount in emergency federal aid to Flint, with a requirement that the state match the spending on Flint pipes, dollar for dollar.\n\"This is a state responsibility,\" Michigan Sen. Gary Peters said at a news conference at the Capitol. \"The state broke it. They need to fix it.\"\nFlint's water became contaminated when the city, under emergency state management, switched from the Detroit municipal system and began drawing from the Flint River in April 2014 to save money.\nState regulators failed to ensure the new water was properly treated and lead from pipes leached into the water supply. Some children's blood has tested positive for lead, which has been linked to learning disabilities, lower IQ and behavioral problems.\nThe Board of State Canvassers rejected petitions Thursday to recall the Republican governor over his handling of Flint's water. Meanwhile, Progress Michigan, a liberal group critical of Snyder, released emails showing the state was sending water coolers a year ago to employees at a state office building in Flint.\nThat occurred after Flint announced it had briefly flunked some drinking water standards apart from the current lead contamination. The state told workers they could use the water cooler or drinking fountains.\n\"We have provided it continuously. That was a decision we made as the building owner\" in Flint, said Caleb Buhs, a spokesman for the agency that manages state buildings.\nThe damage to Flint's water distribution infrastructure potentially is $713 million, according to an assessment cited in the state's request for federal assistance, but Snyder and the Republicans who control the state Legislature said it is far too early to talk about a wholesale replacement of the pipes.\nThe governor's spokesman Dave Murray said the federal legislation is being reviewed but declined to say if Snyder supports it. Snyder is \"always grateful for support from our federal partners,\" he said.\nSnyder's administration has estimated it could cost up to $55 million to repair some 15,000 lead pipes. Officials are hopeful that the addition of anti-corrosion chemicals will effectively recoat the lines.\nThe state spending bill includes $500,000 for outside experts to study the integrity of the water system infrastructure.\n\"Before we start throwing money into infrastructure, we need to know really what the condition is, where the pipes are, how many there are,\" said House Appropriations Committee Chairman Al Pscholka, R-Stevensville. \"There's a lot of unknowns.\"\nThe money approved Thursday will pay for developmental assessments of children age 3 and younger, additional school nurses, lead and blood testing, plumbing fixture replacements and other costs.\nThe largest allotment — $4.6 million — is for bottled water, filters and replacement cartridges being distributed to residents in the city of nearly 100,000 people. About $3.9 million will be used to treat children with high blood-lead levels.\nSnyder said Wednesday that about 200 children have been identified but more need to be tested. Ananich pointed to an unknown number of people who were potentially exposed before the disaster came to light and were never tested before the toxin dissipated from their body.\n\"We have to assume this is population-wide,\" he said.\nLegislators also voted to extend Michigan's emergency declaration until mid-April, which coincides with a federal emergency declaration.\n___\nAssociated Press writer Matthew Daly in Washington, D.C., contributed to this report.\n___\nOnline:\nMichigan House Bill 5220: http://1.usa.gov/1PDt32I\n___\nFollow David Eggert at http://twitter.com/DavidEggert00 . His work can be found at http://bigstory.ap.org/author/david-eggert\nMembers of the Michigan National Guard load bottled water at a fire station, Thursday, Jan. 28, 2016 in Flint, Mich. The Michigan Legislature voted Thursday to direct another $28 million to address Flint's water emergency, allocating money for bottled water, medical assessments and other costs in the city struggling with a lead-contaminated supply. (AP Photo/Carlos Osorio)\nMembers of the Michigan National Guard load bottled water for residents at a fire station, Thursday, Jan. 28, 2016 in Flint, Mich. The Michigan Legislature voted Thursday to direct another $28 million to address Flint's water emergency, allocating money for bottled water, medical assessments and other costs in the city struggling with a lead-contaminated supply. (AP Photo/Carlos Osorio)\nSen. Debbie Stabenow, D-Mich., left, accompanied by Sen. Gary Peters, D-Mich., and others discusses proposed legislation to help Flint, Mich. with their current water crisis, during a news conference, Thursday, Jan. 28, 2016, on Capitol Hill in Washington. (AP Photo/Alex Brandon)","url":"https://www.dailymail.co.uk/wires/ap/article-3420460/Michigan-set-OK-28M-address-Flint-water-crisis.html"}
