{"authors":["Snejana Farberov For Dailymail.Com"],"date_download":"2018-10-23 02:56:22","date_modify":"2018-10-23 02:56:22","date_publish":"2016-01-28 18:15:58","description":"Rylie Whitten has spent the past three weeks at DeVos Children’s Hospital in Grand Rapids fighting for her life against the rare and extremely dangerous staph infection.","filename":"data/vaneerConsumption/Michigangirlwhosufferedtoxicshocksyndromecausedbyatamponiswalking.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC8F4B00000578-0-image-a-2_1454001439679.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421449_Michigan-girl-15-suffered-near-fatal-toxic-shock-syndrome-caused-tampon-walking-talking-again_1540263382.html","title":"Michigan girl who suffered toxic shock syndrome caused by a tampon is walking","title_page":"Michigan girl who suffered toxic shock syndrome caused by a tampon is walking | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"At the height of her health crisis, the teen was on life support, experienced organ failure and required kidney\nThree weeks later, Whitten can now walk and speak in a whisper, and doctors expect her to make a full recovery\nRylie Whitten can still only speak in a whisper and has difficulty walking, but the 15-year-old Michigan girl is grateful for every uttered word and shaky step, having nearly died from toxic shock syndrome.\nWhitten has spent the past three weeks at DeVos Children’s Hospital in Grand Rapids fighting for her life against the rare and extremely dangerous staph infection caused by a common feminine hygiene product.\nFor Rylie, a bubbly high school sophomore from Greenville, it all started with mild flu-like symptoms on January 4.\nHer parents, Nate Whitten and Jill Williams, said their usually healthy, strong daughter suddenly came down with aches all over her body and they decided to keep her home that Monday, on what was supposed to be the first day of school after the winter break.\nBack from the brink: Rylie Whitten, 15, pictured in a wheelchair alongside her parents this week, nearly died after contracting a rare bacterial infection\nMom's little girl: Jill Whitten, pictured left and right with Rylie, spent weeks at her daughter's bedside as she lay unconscious. The 15-year-old Michigan teen experienced organ failure and was on life support\nGlimmers of hope: Two weeks ago, Rylie appeared to have turned a corner and started showing signs of improvement\nGrateful: Her father, Nate Whitten (left), said Rylie's recovery has been 'mind boggling'\nBy the next morning, Rylie started vomiting and was moaning in pain, reported the station WZZM.\nThe Whittens took the ailing teenager to the doctor, who quickly ruled out influenza and meningitis.\nBut then a blood test found something highly alarming in Rylie's system, prompting her physician to call for an AeroMed helicopter to whisk her to a hospital in Grand Rapids for urgent treatment.\nAs it turned out, the Greenville High School student was suffering from Toxic Shock Syndrome - an extremely rare and life-threatening infection that is caused by streptococcus and staphylococcus bacteria that invade the patient's bloodstream, where they release poisonous toxins.\nAnyone can develop TSS, but a significant number of cases occur in young women who are on their period and using a tampon - particularly those designed to be 'super absorbent'.\nIt is recommended to change tampons every four to six hours, or more frequently if necessary.\nWomen are also urged to avoid using super-absorbent tampons and to never leave a tampon inserted overnight, as it could become a breeding ground for bacteria.\nDoctors at DeVos Children’s Hospital in Grand Rapids concluded that this seemed to be the cause of Rylie's illness.\nDr. Surender Rajasekaran, a pediatric intensive care physician at DeVos, told Spectrum Health Beat that Rylie was the sickest TSS patient he has ever treated.\nWhat ailed Rylie: Toxic Shock Syndrome is an extremely rare and life-threatening infection that is caused by streptococcus and staphylococcus bacteria that invade the patient's bloodstream\nThe high school student experienced organ failure and was on life support for nearly two weeks, with her mother holding vigil at her bedside day and night. Gradually, her condition began to improve.\nJust days after being moved out of the pediatric ICU, Rylie managed to get out of bed and stand up without anyone's help.\nAccording to her parents, the speed of Rylie's recovery over the past week has been nothing short of 'mind boggling' and miraculous.\n‘When she came here she could hardly touch her nose,’ he said. ‘Now she’s on the phone, doing her nails, walking, doing stairs.'\nWhen she speaks about the onset of her illness, Rylie's memories are hazy: she remembers feeling unwell and being airlifted to the hospital in Grand Rapids. She also recalls being scared.\n'And then- dreamland,' she said.\nGood cheer: On Tuesday, members of Michigan State University's cheerleading team visited Rylie and her parents at DeVos Children’s Hospital in Grand Rapids\nThe Spartan cheerleaders performed an impromptu dance to the MSU fight song for the high-schooler, who is herself a competitive dancer\nRylie, who hopes to go to MSU one day, got a hug from Michigan State University cheerleader Tyler Mehigh\nRylie, pictured third from the left posing with the MSU cheer squad, is still unsteady on her feet but is gaining strength with every passing day\nOn Tuesday, Rylie, who's a competitive dancer and plans to study music at Michigan State University after graduating from high school, was visited by five members of MSU’s cheerleading squad, who posed for pictures with the teen and even performed a routine for her in the hospital library.\nRylie is still unsteady on her feet, having had no use of her muscles of three weeks, and she speaks with a rasp due to damage to her vocal chords caused by the ventilator, but her parents say she is well on her way to a full recovery.\nShe is expected to be released from the hospital any day now and enter an outpatient rehabilitation program, where she would undergo speech and occupational therapy.\nAs she continues to recapture, Rylie and her parents are trying to raise awareness of the rare condition that nearly cost the high school sophomore her life.\n‘I hope it helps. I want others to know it's still happening and that it's not just the flu. That’s what we thought,’ she told WZZM. ‘I don’t want people to go through what I did.’\nA Facebook page titled ‘Prayers for Rylie’ now boasts more than 4,200 members, and as of Thursday morning, a GoFundMe campaign started by a relative has drawn nearly $6,000 in donations to help the Whitten family with their daughter's mounting medical expenses.\nYoung woman's plight: Doctors at DeVos Children’s Hospital in Grand Rapids concluded that Rylie likely caught TSS from a tampon\nUphill battle: Hospital staff described the 15 year old’s case as the worst they have ever encountered","url":"https://www.dailymail.co.uk/news/article-3421449/Michigan-girl-15-suffered-near-fatal-toxic-shock-syndrome-caused-tampon-walking-talking-again.html"}
