{"authors":[],"date_download":"2018-10-30 21:27:25","date_modify":"2018-10-30 21:27:25","date_publish":"2017-01-30 22:27:00","description":"Michael Vick is rooting for the Atlanta Falcons and Matt Ryan in the Super Bowl against the New England Patriots. There's no doubt about that.","filename":"data/vaneerConsumption/MichaelVickstunnedwhenFalconsdraftedRyan.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/30/Images/010217%20falcons%20photos%20CC4%20(1).jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_michael-vic_cbe341a5dae692ba706d39a8e3fc7624__1540934845.html","title":"Michael Vick ‘stunned’ when Falcons drafted Ryan","title_page":"Michael Vick was 'a little bitter' when Falcons drafted Matt Ryan","title_rss":"NULL","source_domain":"ajc.com","text":"Michael Vick, who according to TMZ.com is planning to celebrate his retirement with a party in Houston, is rooting for the Atlanta Falcons and Matt Ryan in the Super Bowl against the New England Patriots. There's no doubt about that.\n\"I’m excited as a fan, not only for the franchise but to see some good football.\"\nIn an interview with Sports Illustrated, published online Monday, the former Falcons quarterback expressed some resentment as the Falcons' publicly moved on after he was imprisoned for his role in a dog-fighting operation.\nVick told Sports Illustrated:\n\"I always watched ESPN when I was in Leavenworth [federal prison]. They were always talking about what was going on and current events in sports. In 2008 I was very anxious to see what would happen. A couple representatives from the Falcons had come out to see me. I was always keeping hope alive that maybe I could return and finish what I started, but I always knew that door would close and a new chapter would open for the Atlanta Falcons. When they drafted Matt when I was prison, I was a little shocked. Stunned. A little bitter. A little salty. But I was able to get over it quick because I understood the circumstances. ... \"It was just very hurtful. ... It was a very rough day mentally, emotionally and also spiritually. You start to question certain things. But I could only question so much because I knew the reason why I was at where I was at. Going against my core principles and what I was taught in life, and not being loyal to certain people and not being honest.\"\nBut that hurt didn't last long.\n\"I’ve pulled for Matt from Day One. He can breathe life back into the city, as well as with other guys surrounding him. Yeah it took years of building, but that’s what it takes in the NFL. He was very persistent in the process of being great, and maybe proving a lot of people wrong—not even proving them wrong, but gaining respect. That’s what it’s all about.\"\nVick took part in the Falcons’ tribute to the Georgia Dome, during their regular season finale. At the time, he expressed gratitude to the city and team for their support. He also voiced support for Ryan.\nHe told the AJC’s Jeff Schultz:","url":"https://www.ajc.com/sports/football/michael-vick-stunned-when-falcons-drafted-ryan/q9zqOUvgvco5vfeILLpLMM/"}
