{"authors":["Becky Freeth For Mailonline"],"date_download":"2018-10-23 04:08:19","date_modify":"2018-10-23 04:08:19","date_publish":"2016-01-11 17:10:12","description":"Michelle and Mark, both 28, spent Friday marking the passing of Nanny Pat at her Essex funeral, but the former Coronation Street actress is due to commence BBC drama Our Girl this month.","filename":"data/vaneerConsumption/MichelleKeeganforcedtoleaveMarkWrightbehindforOurGirlfilming.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/17/2FE9198100000578-0-image-a-24_1452531974773.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3394162_Michelle-Keegan-forced-leave-grieving-husband-Mark-Wright-Girl-filming-days-Nanny-Pat-s-funeral_1540267699.html","title":"Michelle Keegan forced to leave Mark Wright behind for Our Girl filming","title_page":"Michelle Keegan forced to leave Mark Wright behind for Our Girl filming | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's been three weeks since his beloved grandmother passed away.\nBut Mark Wright is also due to lose wife Michelle Keegan for two months as she heads to South Africa in the next two weeks for filming.\nMichelle and Mark, both 28, spent Friday marking the passing of Nanny Pat at her Essex funeral, but the former Coronation Street actress is due to commence BBC drama Our Girl this month.\nScroll down for video\nForced to leave: Michelle Keegan, seen here at Nanny Pat's funeral on Friday, is going to have to leave grieving husband Mark Wright's side just days after they marked the passing of his grandmother\nThough he's said very little since Pat's passing, he's identified as being broken-hearted saying in one Instagram post that in 2015 '1 special women vowed to be in my life forever and 1 special women left my life forever.'\nHe was visibly distraught as he carried the casket at Friday's funeral, which was attended by friends old and new, including Billie Faiers, Lydia Bright, James Argent and Ferne McCann.\nFaithful brunette Michelle has been by the side of her husband-of-eight months since the 80-year-old passed away just before Christmas.\nBut she signed on for the leading BBC war drama in June 2015, not long after the couple's lavish wedding ceremony.\nWorking away: She is due to head to South Africa in January for filming on Our Girl\nBy his side: Filming will take two months, as Mark tends to commitments to his own work in the UK\nHer commitment includes two months of intensive filming away from home in South Africa, which she has already anticipated to be hard, as well as rigorous training to get into shape.\nShe previously told Reveal magazine: 'It's definitely going to be difficult. But it's my job, so I have to be focused.'\nMark has commitments in the UK to his Heart FM radio show, as well as Take Me Out's ITV2 spin-off The Gossip, alongside Laura Jackson.\nHe has promised that he will go over to visit when he can.\nMark told Star magazine: 'If I get a free week, for sure [I'll go over]. I'm on Heart Radio twice a week, so I can't be there the whole time, but I'll get over as much as I can.'\nBig loss: While Mark gained a very special woman as a wife in 2015, he also lost another very special woman, his grandmother\nSpeaking this week about the job, Michelle told Hello magazine that her mind is focussed on fitness as she prepares to replace Lacey Turner's Molly Dawes in leading role Corporal Georgie Lane.\nShe said: 'Filming for Our Girl is going to start soon, so I want to improve my fitness levels for this.\n'I will be going to circuit training around twice a week and have been going to my home gym with my cousin Katy, every other day.\n'We motivate each other to go and feel loads better afterwards, I still can't do 5 pull ups! This is my one of the challenges I have set myself. I can do around 3 at the moment, so hopefully I can achieve this in the next 4-6 weeks.'\nBig job: Michelle is preparing to replace Lacey Turner's Molly Dawes, pictured, in leading role Corporal Georgie Lane as part of the 2016 drama\nMoving on: Michelle found fame in Coronation Street originally as Tina McIntyre","url":"https://www.dailymail.co.uk/tvshowbiz/article-3394162/Michelle-Keegan-forced-leave-grieving-husband-Mark-Wright-Girl-filming-days-Nanny-Pat-s-funeral.html"}
