{"authors":[],"date_download":"2018-10-22 22:23:35","date_modify":"2018-10-22 22:23:35","date_publish":"2014-05-10 10:23:47","description":"\"This unconscionable act was committed by a terrorist group determined to keep these girls from getting an education,\" first lady says.","filename":"data/vaneerConsumption/MichelleObamaHeartbrokenOverNigeriaKidnappedGirls.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/433781/140510-michelle-obama-mn-755_86da29bb92e8aabc053237c85780777f.1200;630;7;70;5.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_michelle-obama-heartbroken-over-nigeria-kidnapped-girls-n102061_1540247015.html","title":"Michelle Obama 'Heartbroken' Over Nigeria Kidnapped Girls","title_page":"Michelle Obama 'Heartbroken' Over Nigeria Kidnapped Girls","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nFirst lady Michelle Obama made a rare appearance on her husband’s weekly address on Saturday to express her outrage over the recent kidnapping of hundreds of Nigerian schoolgirls, and link their disappearance to the issue of girls’ education worldwide.\n\"Like millions of people across the globe, my husband and I are outraged and heartbroken over the kidnapping of more than 200 Nigerian girls from their school dormitory in the middle of the night,\" Obama said in the address.\n\"This unconscionable act was committed by a terrorist group determined to keep these girls from getting an education — grown men attempting to snuff out the aspirations of young girls.\"\n“In these girls, Barack and I see our own daughters,” she added. “And we can only imagine the anguish their parents are feeling right now.”\nThe girls’ families knew the dangers of sending their daughters to school, Obama said.\n“But they took that risk because they believed in their daughters’ promise,” she said.\nThe abduction of the schoolgirls from a school in Chibok, Nigeria, has sparked global outrage and drawn a spotlight on Boko Haram, the militants who took them.\nThe kidnappings have also served as a call to arms by those supporting the cause of women’s schooling around the world, including Pakistani schoolgirl and human rights activist, Malala Yousafzai and former British Prime Minister Gordon Brown.\n“More than 65 million girls worldwide are not in school,” Obama said. “When more girls attend secondary school that boosts their countries’ economy.”\nPeople have also been showing their support for the girls by taking part in protests and joining online campaigns calling for their rescue. Obama, actress Angelina Jolie and Yousafzai are among those backing the campaign and have posted photos of themselves holding a sign reading \"#BringBackOurGirls.\"\n— F. Brinley Bruton","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/michelle-obama-heartbroken-over-nigeria-kidnapped-girls-n102061"}
