{"authors":["Jennifer Newton For Mailonline"],"date_download":"2018-10-23 04:07:46","date_modify":"2018-10-23 04:07:46","date_publish":"2016-01-11 17:06:48","description":"Michelle Dobyne, from Tulsa, Oklahoma was forced to flee her home after a fire in the apartment block but gave a hilarious interview to a TV channel where she remained upbeat about her ordeal.","filename":"data/vaneerConsumption/MichelleDobynebecomesastarafterinterviewaboutherapartmentcatchingfire.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/19/300DE05200000578-0-image-a-2_1452540074719.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394102_We-AIN-T-gonna-no-fire-today-got-three-kids-bounced-Woman-internet-star-hilarious-interview-apartment-catching-fire_1540267666.html","title":"Michelle Dobyne becomes a star after interview about her apartment catching fire","title_page":"Michelle Dobyne becomes a star after interview about her apartment catching fire | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman who appeared on live TV after a fire at her apartment block has become an internet star after giving a hilarious interview to a TV reporter.\nMichelle Dobyne had to flee her home in Tulsa, Oklahoma after flames engulfed the building where she lived.\nAfter her ordeal she gave an interview to a local TV network where she recounted her experience of escaping the blaze at her home.\nMichelle Dobyne, who was forced to flee her home in Tulsa, Oklahoma after a fire at her apartment block\nBut rather than be downbeat about the fire leaving residents without any heat, her unusual positive interview has seen the clip go viral.\nAfter being asked about the fire, Ms Dobyne explains how she was on the phone to a friend while cooking breakfast when she heard a popping noise.\nShe told News on 6: 'She told me she heard a popping noise, and I said \"What?\" and she said \"Yeah\", I said \"Naww\".'\nMs Dobyne then goes on to explain how she then saw a neighbour taking her child outside without any shoes on.\nShe said: 'Aww girl it's cold outside, she said \"something ain't right, I said \"what?\" and then she said\"Aww man the building is on fire.\nAfter the fire, she gave a hilarious interview live on local TV, where she remained upbeat despite the fire\nShe told the TV reporter: 'I got my three kids and we bounced out, ah-ha. 'We ain't going to be in no fire, not today'\n\"I said, 'no what?'. So I got my three kids and we bounced out, ah-ha.\n'We ain't going to be in no fire, not today.'\nNow 100 residents at the apartment complex have been left without electricity or heat as the fire destroyed the electricty units at the block.\nThe popping noise that they could hear was was actually the electric cables catching alight.","url":"https://www.dailymail.co.uk/news/article-3394102/We-AIN-T-gonna-no-fire-today-got-three-kids-bounced-Woman-internet-star-hilarious-interview-apartment-catching-fire.html"}
