{"authors":["Caitlin O'Toole For Dailymail.Com"],"date_download":"2018-10-22 21:43:50","date_modify":"2018-10-22 21:43:50","date_publish":"2016-01-29 07:42:23","description":"The actor stopped by Brown University in Providence, Rhode Island to kick off his tour discussing Israel and the rise of modern anti-Semitism on college campuses on Thursday.","filename":"data/vaneerConsumption/MichaelDouglasgivestalkonIsraelandantiSemitismatBrownUniversity.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30AFF91E00000578-0-image-a-51_1454047409897.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422208_Michael-Douglas-looks-healthy-giving-talk-Israel-anti-Semitism-Brown-University-marking-five-years-cancer-free_1540244630.html","title":"Michael Douglas gives talk on Israel and anti-Semitism at Brown University","title_page":"Michael Douglas gives talk on Israel and anti-Semitism at Brown University | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Michael Douglas was the picture of health as he appeared on stage to speak about an issue that's close to his heart.\nThe actor stopped by Brown University in Providence, Rhode Island to kick off his tour discussing Israel and the rise of modern anti-Semitism on college campuses on Thursday.\nThe 71-year-old looked upbeat and relaxed chatted about reconnecting with his Jewish heritage.\nScroll down for video\nUpbeat: Actor Michael Douglas chatted about Israel at Brown University on Thursday\nOn Wednesday, the actor's rep shot down reports that his tongue cancer had returned.\n'He has five years clear,' the rep told Page Six.\n'That means it's not going to come back in the head and neck world.'\nOnstage at Brown, Michael looked healthy and relaxed in a black blazer over a grey v-neck sweater as he chatted with former Soviet dissident and former Israeli politician Natan Sharansky about their 'Jewish Journey.'\nThe men are embarking on a three-campus tour to chat about Judaisim, Israel and the rise of anti-Semitism, and will also travelling to Stanford and University of California-Santa Barbara next week.\nPassionate: The 71-year-old is traveling to three college campuses to discuss his Jewish heritage and the rise of anti-Semitism\nHealthy: The Wall Street star's rep recently confirmed the actor is now five years cancer-free\nThe talks were sponsored by Jewish groups including the Genesis Prize, which was awarded to Michael last year.\nThe $1 million prize, sometimes dubbed the 'Jewish Nobel', was given to Michael by Israel for his work as actor, producer and peace activist. The Wall Street star is also a UN Messenger of Peace, focusing on disarmament.\nThe Genesis Prize honors those who 'have attained excellence and international renown in their chosen professional fields, and who inspire others through their engagement and dedication to the Jewish community and the State of Israel.'\nIn touch with his roots: Michael was awarded the $1 million Genesis Prize last year for his work with Jewish communities, and said he would donate the money to charities\nSpeaking out: The actor wore a dark blazer over a grey sweater as he spoke to students at the prestigious Ivy League school\nMichael said he would donate the $1 million prize to organizations that promote diversity and inclusiveness in Judaism.\nMichael's father, 99-year-old actor Kirk Douglas, is Jewish, and although Michael was not raised to be religious, he has come to embrace his heritage and supports a number of Jewish causes and charities.\nHe and Welsh-born wife Catherine Zeta-Jones traveled to Israel last year to celebrate the bar mitzvah of their son Dylan, now 15.\nInclusive: Michael gestured as he spoke about reconnecting with his Jewish heritage\nThoughtful: The Wall Street star chatted about the issues with former Soviet dissident Natan Sharansky\nThe actor reconnected with Judaism through his son, who developed an interest through friends and went to Hebrew school.\n'I hope these teachings and values will be part of the legacy in the world that I leave for my children and those who follow,' the actor said when awarded the prize last January.\nMichael also recently opened up about his marriage and how he and Catherine, 46, saved their marriage after splitting in 2013.\nTalking points: The actor kept his notepad handy as he strolled out on stage for the discussion and Q&A\n'It took work on both our parts,' he told ET on Wednesday.\n'I don't think there's much chance of fixing a relationship if one of you is already out the door.'\nAnd Catherine added: I think we're both mellower and wiser. That comes naturally with time. We count our blessings.'\nThe couple celebrated their 15th wedding anniversary in November, and have two children: son Dylan and 12-year-old daughter Carys.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422208/Michael-Douglas-looks-healthy-giving-talk-Israel-anti-Semitism-Brown-University-marking-five-years-cancer-free.html"}
