{"authors":[],"date_download":"2018-10-22 22:02:47","date_modify":"2018-10-22 22:02:47","date_publish":"2014-05-08 18:24:40","description":"NFL draft analysts say Michael Sam, who stands to be the first openly gay player in the league, will probably be drafted late. What if he's not?","filename":"data/vaneerConsumption/MichaelSamWaitsforCallatNFLDraft.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/429141/140508-michael-sam-jms-1057a_570c0c5cda4a7539a29d601a14e74aad.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_michael-sam-comes-out_michael-sam-waits-call-nfl-draft-n100576_1540245767.html","title":"Michael Sam Waits for Call at NFL Draft","title_page":"Michael Sam Waits for Call at NFL Draft","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe NFL draft — the league’s Radio City-staged, nationally televised, endlessly hyped off-season spectacle — opens Thursday night, and for the first time an openly gay player will be waiting for a phone call.\nBut it could be a long wait for Michael Sam, the University of Missouri defender and all-American who came out in February. Draft analysts say he might not be selected until the last picks are made on Saturday — and perhaps not at all.\nIf that happens, Sam could still sign with a team as an undrafted free agent and play on Sundays this fall. But it would pose a public-relations problem for the NFL, the most profitable league in America, which has never had an openly gay player.\n“For them not to select him would be very problematic,” said Cyd Zeigler, the founder of OutSports.com, which published an insider account of Sam’s coming out three months ago. Fairly or not, he said, “If he isn’t selected, it’s a public black eye on the league.”\nNBC SPORTS: Draft Preview: Prospects Ready to End Long Wait\nZeigler likes Sam’s chances on the merits: The players Zeigler has talked to say that “that guy can play,” he said. Sam was named defensive player of the year in the Southeastern Conference, the toughest college conference in the nation.\n“There is a 99.99% chance @MikeSamFootball will be drafted,” Zeigler wrote Tuesday on Twitter. “I’d say 100%, but have to leave room for war and plague.”\nHe said that he thinks “the gay thing” will probably help with some teams and hurt with others.\nSome NFL scouts whispered in February that NFL locker rooms might not be ready for an openly gay player, but his announcement was generally well-received.\nPresident Barack Obama and first lady Michelle both offered praise on Twitter, and NFL commissioner Roger Goodell welcomed the announcement as a chance for the league to demonstrate its commitment to diversity.\nAt the time, Sam seemed an almost certain draft pick. But his stock dropped after what analysts said was a disappointing performance at the NFL combine, where players take physical and mental tests in front of coaches and scouts.\nNBC SPORTS: The beauty of the NFL draft is in the anticipation\n“I think he’s going to go late, and it has nothing to do with the storyline,” Jon Gruden, the former NFL coach and ESPN “Monday Night Football” analyst, said Thursday on MSNBC. “I think it has to do with his performance at the combine.”\nNate Silver of the prediction site FiveThirtyEight.com, earlier this week put Sam’s chances at “no better than 50-50,” based on an analysis of players rated similarly by media draft projections.\nIf all 32 teams pass on Sam for all seven rounds of the draft, it would at least add a headache for a league already dealing with the Miami Dolphins bullying scandal, a crisis over concussions and regular headlines of player's running afoul of the law.\nBrad Adgate, senior vice president of research at Horizon Media who studies the NFL’s ratings and image, said that a backlash might come not against the league but against individual teams.\nThose teams might face questions about why they chose, say, a borderline wide receiver over joining with Sam to break a barrier.\nStill, Adgate said, “It’s a very competitive league out there. It really comes down to his ability — is he an NFL-caliber player? The teams are not going to pick someone for publicity.”\nThe NFL has framed the question the same way: Teams will evaluate potential draft picks on the merits and nothing more.\n‘It means that no child will ever grow up in a world where there is no such thing as a gay pro football player. That’s pretty powerful.’\nFor his part, Sam, who said that the combine that he wanted to be seen as “Michael Sam the football player,” has kept a low profile ahead of the draft.\nHis agent, Howard Bragman, said on MSNBC that Sam considers this the biggest week of his life. Michael Strahan, the former New York Giant and daytime talk show host, told Sam at lunch recently to let go of what he can’t control, Bragman said.\n“It’s going to be fun,” he said. “And hopefully we can make a little history.”\nZeigler, from OutSports.com, said that the persistent questions about whether the NFL is “ready” have been fanned by the media. Beyond that, he said, teams will probably recognize that Sam’s entry into the league is a moneymaking opportunity.\nWhen and if Sam gets the call, it will mean much more than that.\n“It means that the NFL is what I thought it was,” Zeigler said. “It means that no child will ever grow up in a world where there is no such thing as a gay pro football player. That’s pretty powerful.”\nNBC SPORTS: Draft Prospects Consider Life in the Big Time","url":"https://www.nbcnews.com/storyline/michael-sam-comes-out/michael-sam-waits-call-nfl-draft-n100576"}
