{"authors":["Adam Jourdan"],"date_download":"2018-10-30 23:11:02","date_modify":"2018-10-30 23:11:02","date_publish":"2016-12-08 00:00:00","description":"China's highest court ruled in favor of basketball star Michael Jordan in a long-running trademark case relating to a local sportswear firm using his name","filename":"data/vaneerConsumption/MichaelJordanjustwonalandmarkcaseoverChinesecopycats.json","image_url":"https://amp.businessinsider.com/images/58492f01e02ba7e5008b80e6-1334-667.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_r-china-top-court-rules-in-favor-of-michael-jordan-in-trademark-case-2016-12_1540941062.html","title":"Michael Jordan just won a landmark case over Chinese copycats","title_page":"    Michael Jordan just won a landmark case over Chinese copycats - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"NBA basketball great Jordan speaks during a ceremony in Charlotte Thomson Reuters SHANGHAI (Reuters) - China's highest court has ruled in favor of former basketball star Michael Jordan in a long-running trademark case relating to a local sportswear firm using the Chinese version of his name, overturning earlier rulings against the athlete.\nThe former Chicago Bulls player sued Qiaodan Sports in 2012, saying the company located in southern Fujian province had built its business around his Chinese name and famous jersey number \"23\" without his permission.\nIn 2015 a court ruled in favor of Qiaodan Sports over the trademark dispute, a ruling which was then upheld by the Beijing Municipal High People's Court. After that ruling Jordan's legal team said they would take the case to China's top court.\nThe Chinese characters for Jordan's name read as \"Qiaodan\" in basketball-mad China, which also has a homegrown superstar in former Houston Rockets player Yao Ming.\nOn Thursday, China's Supreme People's Court overturned earlier rulings in favor of Qiaodan Sports using the characters for Jordan's Chinese name, although upheld a ruling allowing the firm to use the Romanized version \"Qiaodan\".\n\"I am happy that the Supreme People's Court has recognized the right to protect my name through its ruling in the trademark cases,\" Jordan said in a statement sent to Reuters.\n\"Chinese consumers deserve to know that Qiaodan Sports and its products have no connection to me.\"\nJordan, who has a net worth of $1.24 billion according to Forbes, is the majority owner of the Charlotte Hornets basketball team and has a lucrative endorsement contract with Nike Inc, which makes Air Jordan shoes.\nA separate naming rights case is still to be heard.","url":"https://www.businessinsider.com/r-china-top-court-rules-in-favor-of-michael-jordan-in-trademark-case-2016-12"}
