{"authors":["Kadeen Griffiths"],"date_download":"2018-10-30 23:36:12","date_modify":"2018-10-30 23:36:12","date_publish":"2014-08-13 15:50:26","description":"Michael Cera just pulled a Beyoncé. That's a sentence that I never thought I'd get to say ever. It's been eleven years since Cera rose to fame as George Michael Bluth in Arrested Development and and now he's releasing albums. This is not a drill.…","filename":"data/vaneerConsumption/MichaelCeraReleasesSurpriseAlbumIListenedToItSoYouDontHaveTo.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/7343a0b6-a43e-4251-a304-1b3f27efe8db.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35597-michael-cera-releases-surprise-album-i-listened-to-it-so-you-dont-have-to_1540942572.html","title":"Michael Cera Releases Surprise Album & I Listened To It So You Don't Have To","title_page":"Michael Cera Releases Surprise Album & I Listened To It So You Don't Have To","title_rss":"NULL","source_domain":"bustle.com","text":"Michael Cera just pulled a Beyoncé. That's a sentence that I never thought I'd get to say ever. It's been eleven years since Cera rose to fame as George Michael Bluth in Arrested Development and and now he's releasing albums. This is not a drill. Michael Cera released a surprise album and thought no one would notice. Clearly Michael Cera underestimated the Internet — or he was hoping that the Beyoncé method was a tried and true way to make sure as many people would be talking about your music as possible. Sadly, Michael Cera is no Beyoncé, so it's unlikely he's going to blossom into superstardom over this, but the album actually isn't the worst thing in the world.\nCera's album is called true that and it's available for free streaming online, although you get three bonus tracks if you actually buy it. The 18 tracks available for streaming, however, don't really leave an intense desire for more Michael Cera music. In the first place, most of them are instrumental pieces on which Cera doesn't sing at all — and I kind of wish he'd done more singing just for the sheer hilarity of it all — and in the second place it's kind of a mildly boring album. The music is good and Cera is obviously talented, which we got from his past experience as a touring bassist for Mister Heavenly, but it's more for fans of indie background music than fans of mainstream music. And I am not a fan of indie background music.\nSo for those who want to know what a Michael Cera album is like without listening to a Michael Cera album, I did it for you.\n1. \"uhohtrouble\"\nNot bad for a 48 second instrumental intro. Not bad at all.\n2. \"Moving In\"\nIs this entire album instrumental?\n3. \"Clay Pigeons (Blaze Foley cover)\"\nI've never heard this song so this is, by default, the best cover of it that I've ever heard. Good job, George Michael.\n4. \"What Gives (...I can't live like this)\"\nIt's quite possible that he should have called this song \"Huh?!\" because that's the exact feeling you get when you realize it's a song and that was the whole thing.\n5. \"Of A Thursday\"\nI literally feel like Lucy van Pelt right now listening to Schroeder play his toy piano.\n6. \"Too Much\"\nI've always wondered when someone would write a song for walking home on a rainy afternoon, but I never thought the person who would do it would be Michael Cera.\n7. \"Steady now\"\n8. \"Gershy's Kiss\"\nOh, my God, George Michael is trying to depress me. How is a song called \"Gershy's Kiss\" so somber? How? I thought it would be happy!\n9. \"Humdrummin\"\nWell, I guess if President Obama approves, then I have to approve as well.\n10. \"2048\"\nDoes Owl City know you're trying to rip them off?\n11. \"Ruth\"\nThis song sounds a lot less depressing if you imagine that Stitch is the one playing it.\n12. \"Old Grey Whistle\"\n13. \"Brat\"\nThis sounds like something that should have come out of Anastasia's music box in that not-Disney movie.\n14. \"ohNadine (you were in my dream)\"\nBest song on the album, hands down. If you're going to listen to any single song to get the general gist of what this album is about, make it this one.\n15. \"Sexy Danger\"\nCera, you shouldn't title a song \"Sexy Danger\" if this is all you're going to do with it. Just no. It's false advertising, sir, and I DO NOT appreciate it.\n16. \"Kettle\"\nIt sounds a little like \"Rhapsody in Blue,\" except nowhere near as exciting. Then again, \"Rhapsody in Blue\" is like four different songs, so there's no more exciting version of it out there anywhere.\n17. \"Smoke Eyes\"\nIf you're going to listen to one instrumental song on this album to get a pretty good idea of what the whole album is like, then it should be this one. I even tapped my foot a little.\n18. \"Those Days\"\nThis is, quite possibly, the most George Michael Bluth–y sounding song on the whole album. In fact, this song should just be George Michael's new theme song. Sorry, Michael Cera, but I think you should just stick to acting.\nImage: MichaelCeraMusic; hashtagnyu, megsokay, dwightyoumonkeyslut, peanutsguidetolife, thediaryofme, sholock, theblack-canary, malory-archer/Tumblr; Rebloggy (3); Wifflegiff (7)","url":"https://www.bustle.com/articles/35597-michael-cera-releases-surprise-album-i-listened-to-it-so-you-dont-have-to"}
