{"authors":[],"date_download":"2018-10-30 14:28:34","date_modify":"2018-10-30 14:28:34","date_publish":"2016-03-26 00:00:00","description":null,"filename":"data/vaneerConsumption/MichelleTeachesArgentinianGirlsaboutCatcallsandChauvinism.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2016_03_michelle_teaches_argentinian_girls_about_catcalls_and_chauvinism_comments_1540909714.html","title":"Michelle Teaches Argentinian Girls about Catcalls and Chauvinism","title_page":"Articles: Michelle Teaches Argentinian Girls about Catcalls and Chauvinism","title_rss":"NULL","source_domain":"americanthinker.com","text":"Although no one has stopped American girls from learning, the U.S. government banner Michelle Obama travels the world carrying reads: “Let Girls Learn.” In fact, observant American girls like myself have studied how the FLOTUS cleverly exploits gender-specific initiatives to bilk the American public into covering exorbitant travel expenses. If a girl uses her brain, it’s easy to figure out that every year, after her ski weekend in Aspen, while Sasha and Malia are on Easter break the FLOTUS feigns false concern for educating girls as an excuse to impose her entourage on world leaders. Annually, in the name of education, Michelle loads up a couple of Air Force Ones, jets all over the globe, dresses up in expensive clothes, sight sees and mooches a free meal off of whoever is dumb enough to buy into the ruse. The FLOTUS spends $222K for two nights in China, and in between dancing the tango and eating fried fat cakes in Botswana, Michelle manages to wangle... (Read Full Article)","url":"https://www.americanthinker.com/articles/2016/03/michelle_teaches_argentinian_girls_about_catcalls_and_chauvinism_comments.html"}
ng a Third World country dressed in haute couture, while in Argentina, a nation famous for cultural machismo, Mrs. Obama promoted “Let Girls Learn” by sharing how a girl with a modest background became the victim of catcalls.\nMichelle chose to lift up America’s greatness by telling women in a country where machismo is rampant that American men treated her as if she were a hunk of that $100 per pound Wagyu beef she regularly enjoys.\nMichelle flew all the way to South America to visit a school in the Barracas section of Buenos Aires to edify Argentinian girls with lessons that included stories about how American “men would whistle at [her] as if [her] body [was] their property,” which is how both she and her husband now view America.\nEither way, Michelle should already know that talking about machismo in Argentina is like talking about pacca sul sedere in Italy. What’s the problem, doesn’t the FLOTUS appreciate the diverse rainbow of difference that makes up the multicultural world her husband so highly esteems?\nHow about, instead of wasting her breath in South America, the FLOTUS come home and give that catcall speech to the illegal Mexican male immigrants currently flooding this country who think machismo is an acceptable way to behave toward American women?\nAccording to the FLOTUS, in addition to being frequently hooted at, teachers in the public school system also wronged her by asking brother Craig what he wanted to be when he grew up and talking down to her by asking who she intended to marry?\nDespite the perception that the road to her success was thwarted on every front, Michelle went on to prove her mettle by surpassing her failed basketball coach/ESPN commentator brother and marrying a failed president.\nAs for street harassment, Michelle, who spearheaded her healthy eating initiative by discussing Sasha and Malia’s body fat, just couldn’t get off the topic.\nThe FLOTUS filled rapt ears with stories of men noticing her body “…as if I were an object to be commented on instead of a full human being with thoughts and feelings of my own.”\nThe funny thing was all that meat market talk took place right around the time a picture of a sexy woman in fishnet stockings, wearing a short sequined dress with a slit up the side, wrapping her left leg around the president’s thigh during a tango, received worldwide circulation.\nNonetheless, with no way to verify the veracity of Michelle’s “strong… powerful… outspoken” tales of woe, the FLOTUS continued to school Argentinian girls about American teachers who “would call on the boys instead of the girls, even though the girls had better grades.”\nSeriously? Mrs. Obama wants girls to believe that her teachers only called on boys, and that the girls in Michelle’s school had better grades than all the boys? The only thing missing from that cock-and-bull story are embellishments about white male teachers at Michelle LaVaughn Robinson’s school calling on the white boys with worse grades, while relegating much smarter black girls, like herself, to emptying the trash cans.\nSorry, if this how Michelle thinks ‘girls learn,’ then girls should skip “Let Girls Learn” and just sign up for ‘Girls Will Believe Anything.”\nIn the end, Mrs. Obama shared how she found a way to work through the trial of being sexually harassed by men, and scorned and disqualified by her teachers.\nSimilar to her husband’s philosophy that defeats Islamic terrorism by partying while victims of extremist attacks are being stacked in freezers, Michelle told the girls that in response to being acknowledged for her outstanding female form and disdained for her mediocre mind, she “…decided not to listen to the voices of those who doubted or dismissed [her].”\nInstead, Michelle said, “I decided to listen to my own voice!” And, judging from her questionable decision to do things like show up in $1-a-day Cuba wearing $4K outfits, maybe Michelle Obama should find another voice to listen to.\nEither way, what Mrs. Obama didn’t expound upon was that despite having unexceptional grades, thanks to quotas, and a brother who grew up to be a Princeton basketball coach, she was able to attend an Ivy League school where, according to her difficult to read thesis, because of white faculty, she also felt uncomfortable.\nFrom Princeton, Michelle graduated Harvard Law, was underappreciated as a lawyer at Chicago’s Sidney Austin, met Barack Obama, converted to community organizing, and was taught from the best how to swindle the American public for everything she felt, and still feels, she is owed\nAnd so, what did this girl glean from Michelle’s Argentinian “Let Girls Learn” trip? I learned that the FLOTUS’s “Let Girls Learn” initiative is a convenient pretext Michelle Obama can use to get the nation she detests to foot-the-bill for all the high-priced vacations she’s convinced she deserves.\nJeannie hosts a blog at www.jeannie-ology.com","url":"https://www.americanthinker.com/articles/2016/03/michelle_teaches_argentinian_girls_about_catcalls_and_chauvinism.html"}
