{"authors":["Paige Tutt"],"date_download":"2018-10-30 23:27:25","date_modify":"2018-10-30 23:27:25","date_publish":"2014-08-13 18:08:49","description":"Last week in Ferguson, Missouri, Michael Brown, an unarmed 18-year-old black teenager, was shot multiple times and killed by a police officer. An eyewitness to the crime told the first responders that she saw the teen put his hands up in the air — a…","filename":"data/vaneerConsumption/MichaelBrownShootingRepresentsTheOngoingTragedyAmericaIsIgnoring.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/9a8a67f0-0efc-4f6f-af71-798f79aff30d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35557-michael-brown-shooting-represents-the-ongoing-tragedy-america-is-ignoring_1540942045.html","title":"Michael Brown Shooting Represents The Ongoing Tragedy America Is Ignoring","title_page":"Michael Brown Shooting Represents The Ongoing Tragedy America Is Ignoring","title_rss":"NULL","source_domain":"bustle.com","text":"Last week in Ferguson, Missouri, Michael Brown, an unarmed 18-year-old black teenager, was shot multiple times and killed by a police officer. An eyewitness to the crime told the first responders that she saw the teen put his hands up in the air — a universal sign of surrender — before an officer tried to place Brown under arrest. As Brown fled, the officer struck him with several bullets. He was pronounced dead not long after.\nBrown's death follows the tragic murder of 43-year-old Eric Garner, an asthmatic black unarmed adult male. Crude cell phone camera recordings taken in July show NYPD officers putting Garner in a headlock, kneeling on his head, and ignoring his gasps for air and cries that he couldn't breathe.\nOn my Facebook feed this week, I've seen about four friends posts about Brown. My feed has been filled up, instead, with posts about the late actor Robin Williams, funny cat videos, and summer vacation selfies.\nAs people, and as a country, it's time to reevaluate what constitutes a national tragedy.\nAs I look at these posts, and the general indifference to the murder of young black men, I think about my uncle, a slave to the prison system now for over 20 years. He told me once through bulletproof glass that he enjoyed \"being inside\" more than being out on the streets. Either way you look at it, our society is a prison for black men.\nThis is what being black in America is like.\nButton Poetry on YouTube\nAs a black woman, I do not feel safe, protected, or comforted by the presence of a cop car. I feel sick. I feel scared. I check my posture. I make sure I have my ID. I stand up straight. Is what I'm wearing okay? Do I look like I'm doing anything I'm not supposed to be doing?\nSure, Mike Brown's murder is receiving news coverage from multiple media outlets, but even that coverage is problematic. Many initial photos showed Brown in a cap and gown from his high school graduation. (He would have attended his first day of college on August 12.) But then, a different photo started circulating; one of Brown in an athletic jersey style tank top, throwing up what looked like a gang sign.\nThis switch has prompted hundreds of responses through the Twitter hashtag #IfTheyGunnedMeDown. I, myself, wondered how I would be depicted if I was murdered by police. Would the media say I worked hard and never got into any trouble a day in my life? Or would they say I was a black woman who often wore all black, had criminal relatives, and had radical ideas about race?\nI want to take a moment to acknowledge 12 men whose stories also ended too soon. They might not have been famous, but that doesn't mean their lives didn't matter.\nTrayvon Martin\nAllison Joyce/Getty Images News/Getty Images\nOn the night of February 26, 2012, Trayvon Martin was unarmed and heading home after buying Skittles and a soft drink from a gas station close to his home. George Zimmerman, a neighborhood watch coordinator, fatally shot the unarmed teen after following him home against a 911 dispatchers advice. The state of Florida eventually filed charges against Zimmerman, 46 days after Martin’s murder. Zimmerman was tried for second-degree murder and manslaughter, and was found not guilty on July 13, 2013.\nAmadou Diallo\nAn unarmed Guinnea-Bissau immigrant, Diallo was killed by four white police officers in plainclothes who shot 41 bullets at him. Nineteen of those bullets actually hit Diallo's body. The officers said Diallo was reaching for a gun when they shot him in the doorway of his apartment. He was reaching for his wallet. Each officer was acquitted of all charges.\nOscar Grant\nJustin Sullivan/Getty Images News/Getty Images\nIn 2009, 22-year-old Oscar Grant and four other black men were pulled off a train by three Bay Area Rapid Transit officers. Former Transit officer Johannes Johannes Mehserle argued that he thought Grant was reaching for a gun near his waistband. To prevent this, he intended to tase Grant, but accidentally shot him with a pistol instead. Grant was unarmed. Mehserle was sentenced to two years in prison, of which he served only 11 months.\nKenneth Chamberlain\nAfter his life medical alert necklace was inadvertently triggered on November 19, 2011, police arrived at Chamberlain's door, allegedly demanding to be let in. The police reportedly broke down his front door, tased him, and then shot him dead. His niece, who lived upstairs, said she repeatedly heard Chamberlain ask why the officers had their guns drawn. A grand jury reviewed the case and decided that no criminal charge would be made against police officers involved in the killing.\nChamberlain was an unarmed 68-year-old retired marine, and a 20-year veteran of the Westchester County Department of Corrections.\nKimani Gray\nAllison Joyce/Getty Images News/Getty Images\nKnown affectionately as \"Kiki,\" Gray was shot four times in the front and side of his body by plainclothes NYPD officers as he left a friend's birthday celebration on March 9, 2013. The report states that Gray pointed a gun at the officer, but numerous witnesses say he was unarmed. He was 16 years old.\nSteven Washington\nIn March of 2010, gang enforcement officers Allan Corrales and George Diego shot Steven Washington after he allegedly approached them and appeared to remove something from his waistband. The 27-year-old, who was autistic, was said to be looking around suspiciously. The officers claimed they had heard a loud noise in the area. No weapon was ever recovered.\nAlonzo Ashley\nIn July of 2011, 29-year-old Ashley was approached by law enforcement officials when he refused to stop splashing water in his face from a drinking fountain. According to his girlfriend, Ashley was suffering from heatstroke. The officers claimed that Ashley became irrational, shouting unintelligible comments, and throwing a trash can. They killed him with a taser, citing \"extraordinary strength.\" No criminal charges were ever filed against the officers, and neither officer disputes that Ashley was unarmed.\nTravares McGill\nIn July of 2005, in the same county in which Trayvon Martin was murdered, McGill was killed by two security guards, one of whom claimed McGill was trying to strike the guards with his vehicle. Forensic evidence showed the bullet that killed the unarmed 16-year-old hit him in the middle of the back, and that the guard kept firing even after the car had stopped moving toward him.\nRamarley Graham\nAndrew Burton/Getty Images News/Getty Images\nIn February of 2012, officers followed Graham into his grandmother's apartment. Graham was apparently trying to flush a bag of marijuana down the toilet. According to reports, Officer Richard Haste fatally shot the 18-year-old, who was unarmed. No weapon was ever recovered from the scene. An indictment was filed but later rescinded by a Brooklyn judge.\nKendrec McDade\nOfficers who were responding to a report of an armed robbery shot and killed 19-year-old McDade, a college student. When later searched, it was found that he was unarmed and only held a cell phone. McDade's parents later filed a lawsuit stating that their son was left on the street unattended without medical attention for a prolonged period of time, leading to his death.\nMcDade's last words, according to court documents, were, \"Why did they shoot me?” The officers involved were placed at first on paid administrative leave, but have since returned to active duty.\nVictor Steen\nIn 2009, the 17-year-old unarmed Steen was tased after fleeing from police, prompting him to crash his bicycle and be run over by the police cruiser. Steen's crime? Committing a traffic violation while riding his bike. The entire incident was caught on video. The officers were acquitted of any crime committed. This was the 57th taser-related death in Florida since 2001. Steen was unarmed.\nOrlando Barlow\nIn July of 2010, Barlow was shot from 50 feet away with an assault rifle by officer Brian Hartman. Barlow was surrendering on his knees, but Hartman argued that he feared Barlow was only pretending to surrender and would reach for a gun. Barlow was unarmed. A jury ruled the shooting excusable, and Hartman faced no repercussions. Hartman later resigned a month before it was uncovered that he and other officers printed T-shirts that read ”BDRT,” which stood for “Baby’s Daddy Removal Team.”\nThese names represent only a fraction of the unarmed black men killed in cities and towns all over the United States. But when a black man is killed, unarmed, for no reason at all, we as a people simply blink, and move on to the next Facebook post.\nAs people, and as a country, it's time to reevaluate what constitutes a national tragedy.","url":"https://www.bustle.com/articles/35557-michael-brown-shooting-represents-the-ongoing-tragedy-america-is-ignoring"}
