{"authors":["Anna Hopkins For Dailymail.Com"],"date_download":"2018-10-23 04:43:27","date_modify":"2018-10-23 04:43:27","date_publish":"2017-04-26 16:19:26","description":"Justin Michael Walling, 27, was found guilty on Friday after he had sex with a 13-year-old girl in Belding, Michigan in 2015. He served six years in prison for the same offense in 2004.","filename":"data/vaneerConsumption/MichigangirlrapedaftermeetingsexoffenderonFacebook.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA0890F00000578-0-image-a-48_1493221136648.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448264_Girl-13-raped-meeting-sex-offender-Facebook_1540269807.html","title":"Michigan girl raped after meeting sex offender on Facebook","title_page":"Michigan girl raped after meeting sex offender on Facebook | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Justin Michael Walling, 27, was found guilty on Friday after he had sex with two girls under the age of 16 over the last two years\nA sex offender who used Facebook Messenger to target young girls was convicted of multiple charges after a lengthy investigation in Michigan.\nA federal court found Justin Michael Walling, 27, guilty on Friday after he had sex with a 13-year-old girl in 2015.\nHe and the victim exchanged thousands of messages on the social media site, which grew increasingly sexual and led to the exchange of explicit photos before the two met in person and had sex.\nWalling previously served six years in prison in 2004 for first degree criminal sexual conduct - indicating that the victim was younger than 13 years old in that case.\nPolice began their investigation in July 2015 when an Ionia County mother reported that a man named 'Justin Blade' was communicating with her 14-year-old daughter, M Live reported.\nAssistant U.S. Attorney Alexis Sanford said that authorities then used the girl's computer to continue talking to 'Blade' and eventually secured his IP address.\nThat led them to the home of Walling's mother in Lowell, Michigan.\nAssistant U.S. Attorney Alexis Sanford said that authorities then used the girl's computer to continue talking to 'Blade' and eventually secured his IP address. That led them to the home of Walling's mother in Lowell, Michigan\nIn an interview on the patio of the home, Walling confessed to using Facebook to communicate with the underage girls.\nHe said he'd had sex with two girls younger than 16, the legal age of consent in Michigan, but he could not remember their names.\nWalling previously served six years in prison for first degree criminal sexual conduct - indicating that the victim was younger than 13 years old in that case\nHe did, however, remember the directions to the home of one of the victims, who lives in Belding, Michigan. The other, he said, lived nearby in Saranac.\nThe Belding girl's computer revealed over 3,000 messages between herself and Walling, which began with conversations about video games, before eventually turning sexual.\nThe two exchanged nude photos and later met in person. She told police they had sex twice at his home during the summer of 2015.\nWalling was found guilty on two counts of enticement of a minor, sexual exploitation of a child, receipt of child pornography and committing a felony offense involving a minor while being a registered sex offender.\nIn 2007, he was convicted of attempted criminal conduct in the third degree, and in 2008 he was found guilty of possession of child sexually abusive material.\nHe will be sentenced in this case on August 21 by U.S. District Judge Paul Maloney.","url":"https://www.dailymail.co.uk/news/article-4448264/Girl-13-raped-meeting-sex-offender-Facebook.html"}
