{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:33:35","date_modify":"2018-10-30 18:33:35","date_publish":"2015-01-21 01:20:00","description":"First Lady Michelle Obama will host Captain Phil Tingirides and Sergeant Emada Tingirides of the Los Angeles Police Department (LAPD) in a box seat at Tuesday night’s State of the Union Address in Washington, D.C. The First Lady's invitation comes as \"#BlackLivesMatter\" demonstrations have targeted the LAPD, among other departments, for alleged brutality against unarmed black suspects. |","filename":"data/vaneerConsumption/MichelleObamaHostsLAPDCaptainSergeantatSOTU.json","image_url":"https://media.breitbart.com/media/2015/01/Screen-Shot-2015-01-01-at-11.13.23-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_20__1540924415.html","title":"Michelle Obama Hosts LAPD Captain, Sergeant at SOTU","title_page":"Michelle Obama Hosts LAPD Captain, Sergeant at SOTU | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"First Lady Michelle Obama will host Captain Phil Tingirides and Sergeant Emada Tingirides of the Los Angeles Police Department (LAPD) in a box seat at Tuesday night’s State of the Union Address in Washington, D.C. The First Lady’s invitation comes as “#BlackLivesMatter” demonstrations have targeted the LAPD, among other departments, for alleged brutality against unarmed black suspects.\nMrs. Obama personally invited the two, husband and wife, to be recognized for their work spearheading the Community Safety Partnership (CSP) program. Captain Tingirides is a 35-year veteran of the LAPD, according to a White House release. An LAPD release noted that special guests are indicators of key points in President Barack Obama’s speech.\nEstablished in 2011, the CSP is aimed at building the relationship between the Los Angeles Police Department and residents of public housing communities, including the Watts neighborhood of South Los Angeles. The White House release emphasized the program’s significant role in a 50 percent reduction in violent crime in the Watts neighborhood–a neighborhood well-known for race riots in 1965 and a surge of gang violence in the 1990s.\nCaptain Tingirides described the CSP program, saying, “The officers go into the housing developments with the intent NOT to make arrests, but to create partnerships, create relationships, to hear the community and see what they need and then work together with HACLA to make those things happen.”\nLAPD Chief Charlie Beck said, “The recognition given by the President of the United States to a community engagement program like CSP, speaks volumes about the hard work and dedication of the men and women of the Los Angeles Police Department. Captain Phil Tingirides, Sergeant Emada Tingirides and the enthusiastic team that work the Community Safety Partnership program, have not only reduced crime, but also enhanced police/community relations and partnerships.”\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/politics/2015/01/20/michelle-obama-hosts-lapd-captain-sergeant-at-sotu/"}
