{"authors":[],"date_download":"2018-10-22 21:42:20","date_modify":"2018-10-22 21:42:20","date_publish":"2014-06-06 01:37:52","description":"Michael Egan III has withdrawn his lawsuit alleging he was sexually abused by former CNN and Disney executive David Neuman.","filename":"data/vaneerConsumption/MichaelEganIIIWithdrawsSexAbuseSuitAgainstExTVExecutive.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/491301/140605-michael-egan-iii-2144_3b6d8c5e0e2f63b8550f28b15f80fa6f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_michael-egan-iii-withdraws-sex-abuse-suit-against-ex-tv-n124171_1540244540.html","title":"Michael Egan III Withdraws Sex-Abuse Suit Against Ex-TV Executive","title_page":"Michael Egan III Withdraws Sex-Abuse Suit Against Ex-TV Executive","title_rss":"NULL","source_domain":"nbcnews.com","text":"The Associated Press does not typically identify alleged victims of sex abuse but is naming Egan because he has spoken publicly about his case.\nHe alleges Singer abused him several times during trips to Hawaii in 1999, when Egan was 17. Egan also accuses Singer of abusing him earlier in California as part of a Hollywood sex ring. The other lawsuits involve similar allegations.\nAll the defendants deny the claims. A judge next month will consider motions to dismiss the remaining cases.\nThe withdrawal of the lawsuit against Neuman \"exposes this despicable lawsuit for what it really was: an unethical smearing and failed shakedown of a completely innocent man,\" Neuman's Los Angeles attorneys said in a statement.\nEgan's Hawaii attorney, Mark Gallagher, referred questions to Egan's Florida attorney, Jeff Herman, whose office released a statement saying: \"Mr. Egan maintains the allegations and has even passed a polygraph test based on those specific allegations. We are evaluating our next step in seeking justice for Mr. Egan.\"\nLawyers for Neuman filed a motion last month to dismiss the case, arguing that Egan said in an statement under oath in 2003 that Neuman was not in Hawaii with him and didn't sexually assault him or engage in any kind of sexual behavior with him.\n\"Now, more than 10 years after signing the declaration, plaintiff inexplicably has chosen to suddenly claim that Mr. Neuman had engaged in the very conduct which 10 years earlier he swore Mr. Neuman had no part of,\" the motion said.\nNeuman has worked for Disney and CNN as a TV executive.\n— Associated Press","url":"https://www.nbcnews.com/news/us-news/michael-egan-iii-withdraws-sex-abuse-suit-against-ex-tv-n124171"}
