{"authors":["Ana Colón"],"date_download":"2018-10-30 22:28:53","date_modify":"2018-10-30 22:28:53","date_publish":"2014-08-15 16:02:56","description":"Ever since Scout Willis publicly called out Instagram for censoring her bare breasts earlier this summer, we've seen more and more nipples on social media. While Willis' Instagram account was shut down after she posted topless images on her account,…","filename":"data/vaneerConsumption/MichelleRodriguezsFreetheNippleShirtIsJustOneWayCelebsAreSupportingTheMovement.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/73b8a6b6-8761-4646-9864-b2a5deb0d42b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35911-michelle-rodriguezs-free-the-nipple-shirt-is-just-one-way-celebs-are-supporting-the-movement_1540938533.html","title":"Michelle Rodriguez’s “Free the Nipple” Shirt Is Just One Way Celebs Are Supporting The Movement","title_page":"Michelle Rodriguez’s “Free the Nipple” Shirt Is Just One Way Celebs Are Supporting The Movement","title_rss":"NULL","source_domain":"bustle.com","text":"Ever since Scout Willis publicly called out Instagram for censoring her bare breasts earlier this summer, we've seen more and more nipples on social media. While Willis' Instagram account was shut down after she posted topless images on her account, the Free The Nipple movement has gained a lot more momentum since. From Scout's sister Rumer Willis to Michelle Rodriguez, who was spotted rocking a \"Free The Nipple\" T-shirt at the Ibiza airport, celebrities have come together to endorse the campaign.\nWhile our favorite photo sharing platform is great for brunch pics, Instagram is not so welcoming of nipples. Notoriously, Instagram kicks off users who post images of breastfeeding or mastectomies. Willis was no exception: Her topless stroll around New York's East Village (which, she points out, is legal in NYC) got her booted off the platform. However, this very public dismissal only gave the Free The Nipple campaign more exposure among the Hollywood crowd.\nWhile Michelle Rodriguez is one of the newest members of the Free The Nipple celebrity club, she's already proven to be quite the supporter. She has been seen donning multiple styles of the campaign's signature T-shirts. You can purchase the T-shirts on the Free The Nipple website, and join the thousands of other activists fighting for nipple freedom long before Willis' now infamous walk through NYC.\nSee how celebrities have shown support for Free The Nipple. (Some images NSFW.)\nMichelle Rodriguez\nRodriguez, seen coming back from vacation, rocks one of her many Free The Nipple T-shirts.\nThe official Free The Nipple campaign posted this picture of Rodriguez back in April, lounging (or possibly doing pull-ups?) in a different style shirt.\nScout Willis\nOn May 27, Scout Willis sent out the tweet that was heard around the world. Willis posted the original image shared on (and then deleted by) Instagram of her walking topless out in public. She then changed her Twitter icon, temporarily, to Rihanna's topless cover of lui magazine.\nRihanna\nLarry Busacca/Getty Images Entertainment/Getty Images\n. . . Which Rihanna responded to with a manual retweet — the ultimate endorsement, in today's digital world. Rihanna has also seen Instagram's nipple wrath, also responding publicly to the platform's dismissal of female nudity.\nMiley Cyrus\nCyrus was an early supporter of the campaign: She shared this tweet back in December.\nCara Delevigne\nMichelle Rodriguez' ex is also part of Free The Nipple. The model counts a nipple top among her impressive T-shirt collection, and posted this image on Instagram from a shoot in Bali.\nSuki Waterhouse\nDelevingne's friend (and Bradley Cooper's girlfriend) showed support for the campaign by reposting this image from TaTa Top, the so-called \"breast bikini top ever.\" The design maneuvers around Instagram's community guidelines by putting the nipples on your clothing, so you're not technically topless. Cheeky. Waterhouse's straightforward caption, \"Free the nipple,\" leaves little question about where she stands on the issue.\nOlivia Wilde\nWilde caused quite the commotion when she was photographed breastfeeding her son, Otis, as part of her Glamour cover shoot. While not explicitly in support of the Free the Nipple movement, this represents a bold move in destigmatizing public breastfeeding — and, thus, public breast exposure.\nImages: Getty Images; Cara Delevingne, Suki Waterhouse/Instagram","url":"https://www.bustle.com/articles/35911-michelle-rodriguezs-free-the-nipple-shirt-is-just-one-way-celebs-are-supporting-the-movement"}
