{"authors":["Associated Press"],"date_download":"2018-10-22 20:41:52","date_modify":"2018-10-22 20:41:52","date_publish":"2016-01-29 02:59:22","description":"US Navy Cmdr Michael Misiewicz faces up to 20 years in prison after he shared information to defense contractor Leonard Glenn Francis, who overbilled the Navy by at least $20million.","filename":"data/vaneerConsumption/MichaelMisiewiczpleadsguiltytobriberyincorruptioncase.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/02/30AE680900000578-0-image-a-28_1454035860742.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422109_Navy-commander-Michael-Misiewicz-pleads-guilty-bribery-massive-corruption-case_1540240912.html","title":"Michael Misiewicz pleads guilty to bribery in corruption case","title_page":"Michael Misiewicz pleads guilty to bribery in corruption case | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"US Navy Cmdr. Michael Misiewicz has pleaded guilty to bribery charges after accepting theater tickets and prostitution services\nA Navy commander accused of diverting ships to Asian ports for a Malaysian contractor offering prostitution services and other gifts pleaded guilty to bribery charges Thursday.\nMichael Misiewicz is one of the highest ranking Naval officials to be charged in the massive scandal, which is centered on businessman Leonard Francis, nicknamed 'Fat Leonard' .\nFrancis has admitted to providing an exhaustive list of gifts in exchange for classified information that helped his company Glenn Defense Marine Asia Ltd. overbill the Navy by at least $20 million.\nHe used the bribes to obtain information that helped him beat out the competition and get Navy captains to steer ships to Pacific ports where he overcharged the Navy, prosecutors said.\nProsecutors say Francis asked captains to re-route ships to ports he owned or to small ports where they could impose fake port fees on the Navy.\nMisiewicz pleaded guilty to one count each of conspiracy to commit bribery and bribery of a public official at a hearing in federal court in San Diego.\nHe accepted theater tickets, prostitution services and other items, according to the criminal complaint.\nHe faces up to 20 years in prison if sentenced to the maximum amount for both charges.\nMisiewicz's defense lawyers said in a statement that he regrets his actions from 2011 to 2012.\nThey went on to say that they plan to show at his sentencing hearing this was an 'extreme departure from his otherwise distinguished and honorable 30 plus year career.'\nMisiewicz made international headlines in 2010 after an emotional return as a US Naval commander to his native Cambodia, where he had been rescued as a child from the violence of the Khmer Rouge and adopted by an American woman.\nHis sentencing hearing is set for April 29. Francis is awaiting sentencing.\nLt. Commander Todd Malaki, who has pleaded guilty in the same case, is scheduled to be sentenced Friday. He faces a maximum of five years in prison.\nLast week Petty Officer 1st Class Daniel Layug was sentenced to 27 months in prison for providing classified military information to Francis in exchange for an iPad, hotels, and monthly cash payments.\nMisiewicz is one of the highest ranking Naval officials to be charged in the massive scandal, which is centered on businessman Leonard Francis, nicknamed 'Fat Leonard' (pictured right)\nMisiewicz made international headlines in 2010 after an emotional return to his native Cambodia, where he had been rescued as a child from the violence of the Khmer Rouge and adopted by an American woman\nLayug told the court that he made a mistake and let his ego and greed lead him to betray his country.\n'It's very shameful what I did,' Layug said.\nUS District Court Judge Janis Sammartino in San Diego agreed.\n'You put the Navy at risk. You put your colleagues at risk. And you put our country at risk,' she said while handing down the sentence.\nLayug faced up to five years behind bars. Prosecutors asked for the 27-month term, saying Layug was the least culpable in the investigation.\nIn his plea deal, Layug admitted to accepting a digital camera, iPad 3, and paid for hotel rooms in several Asian countries along with $1,000 in monthly payments from GDMA in exchange for providing the company classified ship schedules and prices from competitors.\nLayug had a 'bucket list' of items he requested from GDMA ranging from a Blackberry phone to a Wii gaming unit, prosecutors said.\nLast week Petty Officer 1st Class Daniel Layug was sentenced to 27 months in prison for providing classified military information to Francis in exchange for an iPad, hotels, and monthly cash payments.\nIn an email on March 9, 2012, Layug asked GDMA's vice president of global operations: 'What are the chances of getting the new iPad 3? Please let me know.'\n'Layug essentially sold his honor for an iPad 3, and in doing so he put the US Navy at risk of embarrassment, exploitation, attack or worse,' US Attorney Laura Duffy said after the hearing.\nProsecutor Mark Pletcher indicated Thursday more arrests could still come.\nPletcher said that while Layug has expressed remorse for his actions, the court should not overlook the fact that the 27-year-old logistics specialist while stationed in Japan used his personal email address and was on the payroll for GDMA as part of the scheme.\n'These things all show his prolonged and dedicated commitment to making this conspiracy work,' he said.","url":"https://www.dailymail.co.uk/news/article-3422109/Navy-commander-Michael-Misiewicz-pleads-guilty-bribery-massive-corruption-case.html"}
