{"authors":["Regina F. Graham For Dailymail.Com"],"date_download":"2018-10-22 23:14:16","date_modify":"2018-10-22 23:14:16","date_publish":"2017-03-10 02:04:42","description":"One day after the plane carrying the University of Michigan men's basketball team slid off the runway, members of the team are crediting the pilot with saving their lives.","filename":"data/vaneerConsumption/Michiganbasketballteamcreditpilotsheroismincrash.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/02/3E1591B400000578-0-image-a-14_1489111471787.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299772_Michigan-basketball-team-credit-pilot-s-heroism-crash_1540250056.html","title":"Michigan basketball team credit pilot's heroism in crash","title_page":"Michigan basketball team credit pilot's heroism in crash | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"One day after the plane carrying the University of Michigan men's basketball team slid off the runway, members of the team are crediting the pilot with saving their lives.\nThe eighth-seeded squad was scheduled to depart Wednesday from Willow Run Airport in Ann Arbor to travel to Washington, D.C. for the Big Ten Tournament, but their plane aborted takeoff due to high winds and slid off the runway.\nAll 109 passengers and seven crew members were safely evacuated as no one suffered any serious injuries.\n'That pilot undoubtedly saved our lives,' one witness told Michigan Live. 'He knew something wasn't right.'\n'If anyone was seriously hurt, there would be no jokes,' guard Duncan Robinson told the Chicago Tribune. 'We're just thankful.'\nOne day after the plane carrying the University of Michigan men's basketball team slid off the runway (above), members of the team are crediting the pilot with saving their lives\nThe eighth-seeded squad was scheduled to depart Wednesday from Willow Run Airport in Ann Arbor to travel to Washington, D.C. for the Big Ten Tournament, but their plane aborted takeoff due to high winds and slid off the runway (above)\n'I hope I don't have anything more traumatic in my life,' forward Mark Donnal said. 'We're thanking God that everyone came out injury-free.'\nThe team was able to depart Thursday morning on a Delta Airlines plane and landed in the nation's capital just hours before tip-off in the Big Ten tournament.\nDespite a chaotic 24 hours, the Wolverines, who played in their practice uniforms since their game uniforms were left behind, beat Illinois in the tourney opener 75-55 at the Verizon Center.\nIn addition, their head coach John Beilien earned his 210th win as a result of Thursday's victory, surpassing legendary coach Johnny Orr's record for the most wins at the college.\nThe team departed Thursday morning for D.C. and boarded a Delta Airlines plane (above)\nThey arrived just hours before tip-off at the Verizon Center for the Big Ten Tournament (above) against Illinois\nWednesday's incident at the airport proved to be nothing short of scary for those aboard the plane.\n'Everyone was just in shock,' guard Andrew Dakich said.\nRobinson recalled looking across the row at forward Brent Hibbitts.\n'I had never seen so much fear in someone's eyes,' Robinson said.\n'It was such a chaotic moment. We just tried to get out as soon as possible.'\nPhotos from the scene show the MD83 plane on grass as the tail end of it rests on the runway.\nSince they had to leave their uniforms behind, the Wolverines played in their practice uniforms on Thursday (above).\nDespite a chaotic 24 hours, the Wolverines beat Illinois in the tourney opener 75-55 at the Verizon Center Thursday (above). Members of the team were thankful that no one was injured during the incident Wednesday and were thankful the pilot saved their lives\nThe charter aircraft, which was operated by Ameristar Charters, never lifted off the ground, witnesses told Michigan Live.\nThe pilot, who has not been publicly identified, slammed on the brakes sending the MD83 sliding.\nA witness told the newspaper that the landing gear on the plane collapsed as it went through a fence and 'the pilot opted to veer to the side instead of going toward buildings.'\nA ravine was just ahead and the plane miraculously stopped short of it.\nMichigan strength and conditioning coach Jon Sanderson told Michigan Live that 'it felt like forever' in reference to waiting for the plane to stop.\n'Thought it was gonna blow,' Sanderson said of the plane.","url":"https://www.dailymail.co.uk/news/article-4299772/Michigan-basketball-team-credit-pilot-s-heroism-crash.html"}
