{"authors":[],"date_download":"2018-10-22 21:41:50","date_modify":"2018-10-22 21:41:50","date_publish":"2014-05-07 22:23:43","description":"A World War II veteran was sentenced to three years in federal prison on Wednesday — his 90th birthday — for working as a Mexican cartel's drug mule.","filename":"data/vaneerConsumption/MichiganDrugMuleLeoSharpGets3Yearson90thBirthday.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/427551/140507-leo-sharp-1742_a84a64a92d7a642b319f54b6dcfe75fd.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_michigan-drug-mule-leo-sharp-gets-3-years-90th-birthday-n99826_1540244510.html","title":"Michigan Drug 'Mule' Leo Sharp Gets 3 Years on 90th Birthday","title_page":"Michigan Drug 'Mule' Leo Sharp Gets 3 Years on 90th Birthday","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA World War II veteran was sentenced to three years in federal prison on Wednesday — his 90th birthday — for working as a Mexican cartel's drug mule.\nLeo Sharp was hauling 104 bricks of cocaine (over 200 pounds) on a highway near Chelsea, Mich., when he was pulled over in 2011 for an illegal lane change.\nAccording to documents filed in U.S. District Court in Detroit, he had been running cocaine and other drugs as early as 2009, when he was just 86.\nHe also hauled duffle bags stuffed with cash back to the southwest border of the United States for the criminal organization that was part of Mexico's Sinaloa cartel, prosecutors said.\nLast week he was ordered to pay a half-million-dollar fine, and it was believed the judge in the case would show some leniency because of his age.\nBut on Wednesday, U.S. District Judge Nancy Edmunds said she couldn't justify not putting Sharp behind bars considering the nature of his crime.\n\"This is not a victimless crime,\" Edmunds said. \"This is a very serious offense.\"\nEdmunds gave Sharp three years in jail, plus an additional three years of supervised release.\nBefore he was sentenced, Sharp pleaded for mercy, and indicated that he might take his own life.\n“I’m really heartbroken I did what I did. But it’s done,” Sharp said, according to the Detroit Free Press. “I won’t live in prison, I’m just going to end my life if I end up there.”\nAfterward, Sharp turned to prosecutors and called the three-year prison term a \"death sentence.\"","url":"https://www.nbcnews.com/news/us-news/michigan-drug-mule-leo-sharp-gets-3-years-90th-birthday-n99826"}
