{"authors":["Kalhan Rosenblatt For Dailymail.Com"],"date_download":"2018-10-23 00:56:55","date_modify":"2018-10-23 00:56:55","date_publish":"2016-01-29 14:36:02","description":"Michael Phelps caused quite a distraction during Thursday's Arizona State versus Oregon basketball game. But that was the point. The 30-year-old Olympian appeared in the 'Curtain of Distraction'.","filename":"data/vaneerConsumption/MichaelPhelpsflasheshisabsinArizonaStateUniversitysCurtainofDistraction.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/14/30B2CDA400000578-0-image-a-9_1454076469407.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422839_Michael-Phelps-flashes-abs-Arizona-State-University-s-infamous-Curtain-Distraction_1540256215.html","title":"Michael Phelps flashes his abs in Arizona State University's 'Curtain of Distraction'","title_page":"Michael Phelps flashes his abs in Arizona State University's 'Curtain of Distraction' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Michael Phelps created such a distraction in the student section of the Arizona State University versus Oregon State basketball game, it was hard for the players to focus on anything else.\nBut that was the point.\nWearing a tiny swim suit and flashing his six-pack abs and gold medals, Phelps made an appearance in the Sun Devil's infamous 'Curtain of Distraction' between two shirtless students.\nScroll down for video\nSurprise!: A shirtless Michael Phelps made an appearance in the Arizona State University student section, flashing his six-pack abs as a part of the 'Curtain of DIstraction'\nPhelps and two students from the '942 Crew' tore off golden shirts and danced to distract opposing players\nThe crowd went wild as the 18-time gold medalist flashed his abs and danced with two shirtless students\nThe 'Curtain of Distraction' often features hilarious pranks, but Phelps is the first Olympian behind the curtain\nAlthough the medals were not Phelps's real Olympic gold, they added nicely to the 'Curtain of Distraction'\nResearch says the 'Curtain of Distraction' is worth approximately 1.41 points per game, but with Phelps in the mix, the 'Curtain' caused Oregon State to miss two free throw shots and lose two potential points\nThe 30-year-old Olympic great, who is working as an assistant swim coach at Arizona State University this year, helped the school's college basketball team claim victory over Oregon State with the distraction on Thursday.\nTwo Arizona State students stood at the ready, holding the black curtains closed as Oregon State's Stephen Thompson Jr. prepared to take two foul shots with less than 14 minutes left in the game..\nAs Thompson prepared to take the shot the students pulled the curtains open, revealing Phelps who ripped off a gold '942 Crew' shirt with the two other students.\nPhelps jumped up and down and danced with gold medals - although not any of his real 18 Olympic gold medals - dangling around his neck and a yellow swim cap on his head, a Chippendale's bow tie and cuffs and nothing else on, causing Thompson to miss the two free throw shots.\nArizona State coach Bobby Hurley said Phelps 'made a major contribution to the game.' Bob Bowman, the coach of Arizona State's swim team, later tweeted a picture of Phelps with the Sun Devil mascot.\nThe '942 Crew' excitedly tweeted out that Phelps would be making an appearance two days before the game.\nJust before the big reveal, two students in the '942 Crew' held the black curtains closed and at the ready\nAs Oregon's Stephen Thompson Jr. (pictured center, right) prepared to take two free throw shots, Phelps danced around shirtless and caused the player to miss both shots\nPhelps posted this picture to his Instagram saying 'Let's do this @942Crew !!' The student section had announced on its Twitter two days earlier that Phelps would be making a guest appearance at the game\nBob Bowman, the head coach of the Arizona State swim team, tweeted out this picture of Phelps with the school's Sun Devil mascot\n'We r excited to announce that 18X Gold Medalist @MichaelPhelps will be making an appearance in the Curtain Thursday!' the tweet said.\nThe moment of the reveal drew the loudest cheers from the crowd at Wells Fargo Arena.\nAzizona State University won the game 86-68.\nThe Sun Devils have been using the curtain since last season and Harvard researchers believe the curtain has a calculable impact on the games it's used during.\nThe Harvard College Sports Analysis Collective (HSAC) estimated '\"the Curtain of Distraction\" is worth approximately 1.41 points per game.'\nRegardless of its game-winning ability, it has been called one of the funniest trends in college sports.","url":"https://www.dailymail.co.uk/news/article-3422839/Michael-Phelps-flashes-abs-Arizona-State-University-s-infamous-Curtain-Distraction.html"}
