{"authors":[],"date_download":"2018-10-30 21:21:54","date_modify":"2018-10-30 21:21:54","date_publish":"2017-04-25 12:43:00","description":"On April 25, 2007, authorities went to a Virginia home owned by Atlanta Falcons quarterback Michael Vick. What they discovered was animal neglect.","filename":"data/vaneerConsumption/MichaelVicksdogfightinginvestigationlaunches.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/25/Images/VICKvirginia0427%203.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_this-day-fa_2f29be90814b52c3a820bfb8a1d01d57__1540934514.html","title":"Michael Vick's dog fighting investigation launches","title_page":"April 25, 2007:  Michael Vick's dog fighting investigation launches","title_rss":"NULL","source_domain":"ajc.com","text":"On April 25, 2007, the unimaginable happened.\nA drug investigation involving a cousin of Michael Vick led authorities to a residence in Virginia owned by the Atlanta Falcons quarterback.\nWhat they discovered was animal neglect. Police found about dozens of dogs, some heavily scarred, and various paraphernalia associated with dog fighting.\nIt was supposed to be a momentous week for Vick. He was supposed to speak to Congress members in Washington about increasing funding for after-school programs. He was supposed to represent Virginia Tech -- where he played college football -- during a pre-NFL draft ceremony honoring victims of a mass shooting.\nInstead, his Falcons career began to unravel.\nVick initially denied any involvement in the operation. Nearly four months later he pleaded guilty to a federal felony dog fighting conspiracy charge. He would serve nearly two years in prison. He would play football again, but not for the Falcons.\nHe recently penned a letter to Falcons fans detailing his emotions around the time of the investigation and his imprisonment.\nThe Best Friends Animal Society's sanctuary in Kanab, Utah, shelters 22 pit bulls rescued from Michael Vick's dogfighting ring in Virginia, including the scarred Lucas, believed to be Vick's grand champion fighter. Volunteer Bill Jones and his wife came from Ohio for three months to care for the Vick dogs in 2008. (Carol Guzy/The Washington Post)\nIn all, more than 30 dogs were seized in connection with the Bad Newz Kennels on Vick’s 15-acre property at 1915 Moonlight Road in Smithfield, Va. The property now serves as a haven for mistreated dogs.\nThe animals that were rescued were rehabbed, and thrived. Some were featured in a documentary, “The Champions,” that documented their successes. Little Red, who was adopted three years after she was discovered at Bad Newz Kennels, died earlier this month.\nAs for the Falcons, they began their turn around in 2008. The team hired general manager Thomas Dimitroff and coach Mike Smith. They inherited the core of a solid defense, drafted quarterback Matt Ryan and signed running back Michael Turner in free agency.\nSince then, the team has won back-to-back winning seasons for the first time in franchise history; the team returned to a Super Bowl; and the Falcons have league MVP in Ryan.\nVick retired from the NFL in February.","url":"https://www.ajc.com/sports/football/this-day-falcons-history-changed-with-discovery-michael-vick-dogs/YI3q0DNY523KIdCv47PE8L/"}
