{"authors":[],"date_download":"2018-10-30 21:24:35","date_modify":"2018-10-30 21:24:35","date_publish":"2017-02-01 15:59:00","description":"Mike Vick, quarterback, Atlanta Falcons. “I was those five words, man.”","filename":"data/vaneerConsumption/MichaelVickslettertoAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/01/Images/010217%20falcons%20photos%20CC6.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_michael-vick-letter-atlanta__1540934675.html","title":"Michael Vick’s letter to Atlanta","title_page":"Michael Vick’s letter to Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"Mike Vick, quarterback, Atlanta Falcons.\n“I was those five words, man.”\nVick, who is reportedly retiring from the NFL, was quarterback of the Super Bowl Atlanta Falcons until going to federal prison for his role in a dog-fighting ring.\nHe has written an open letter to Atlanta. A place where he grew to national stardom and where he feels he was at the center of a cultural rise.\nVick’s letter appears in the Player Tribune. Here are parts of what he wrote:\n“On the first day of my sentence at Leavenworth Penitentiary, on November 19, 2007, I made a list of three things that I wanted to accomplish. One was to make it home from prison safe. Two was to see my grandmother again, before she passed away. And three was to return to the Atlanta Falcons as their starting quarterback — and finish what I’d started. “I wanted to lead the Falcons to the Super Bowl. “When I tell people this, at first, I think most of them have the same reaction — that I was delusional. Mike, you really thought, after all that, that you were going to come back to the Falcons … and start at quarterback … like nothing had happened? “I think people would hear that I had hung on to the hope of returning to Atlanta as their quarterback … and then maybe assume that I was in denial about my entire situation. That I still wasn’t able to accept the full severity of what I had done. “But to be honest, that really wasn’t the case at all. In those first few months of my sentence, I really did come to understand how far I had fallen. I came to understand how much hurt I had caused, and how much work it was going to take to earn back just a portion of the respect that I had lost — both people’s respect for me, and my respect for myself. I came to accept the consequences.”\nHe writes that despite being in prison he hadn’t lost his identity:\n“But in my mind, even from a prison cell, there was at least one thing I hadn’t lost: I was still the Atlanta Falcons quarterback.”\nVideo by Jennifer Brett\nThen shock hit. The Falcons drafted Matt Ryan while he sat in prison.\nVick talks about his emotions and growth. And moving on ...","url":"https://www.ajc.com/sports/football/michael-vick-letter-atlanta/vV7yzqDywXbv2wTkj0cicJ/"}
