{"authors":["Charlie Spiering"],"date_download":"2018-10-30 18:56:19","date_modify":"2018-10-30 18:56:19","date_publish":"2015-02-17 17:23:47","description":"Michelle Obama seems funnier than the comedian hosting \"Funny or Die.\" |","filename":"data/vaneerConsumption/MichelleObamaToObnoxiousComedianWatchItYouCouldGetShot.json","image_url":"https://media.breitbart.com/media/2015/01/Michelle-Obama-Got-Your-Six-Jacquelyn-Martin-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_17__1540925779.html","title":"Michelle Obama To Obnoxious Comedian: ‘Watch It, You Could Get Shot’","title_page":"Michelle Obama To Obnoxious Comedian: ‘Watch It, You Could Get Shot’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"As part of the Obama administration’s continued relationship with “Funny Or Die,” First Lady Michelle Obama teamed up with one of its least appealing comedians, Billy Eichner from “Billy on the Street.”\nThe First Lady stood patiently in a grocery store aisle of fruits and vegetables with Big Bird, listening to Eichner’s rant about the upcoming games they had planned. As she reached out to point to one of the guests, Eichner hit her hand as he continued talking.\n“Did I just poke your hand or something?” Eichner said awkwardly.\n“It’s OK, but watch it, you could get shot,” the First Lady replied, referring to her Secret Service detail.\n“Oh my god! This is so much fun, fruits and vegetables, I could die at any moment,” Eichner exclaimed in mock horror.\nThe First Lady gamely continued on with the show, as Eichner made her to slow dance with Big Bird as he butchered a version of the song “I Don’t Want To Miss A Thing,” from the Armageddon soundtrack. Eichner also made the First Lady push him in a shopping cart while he recited Gwyneth Paltrow’s Oscar acceptance speech.\nThe video was filmed at Washington, D.C. grocery store to promote her “Eat Brighter!” campaign to promote eating fruits and vegetables using Sesame Street Characters.","url":"https://www.breitbart.com/politics/2015/02/17/michelle-obama-to-obnoxious-comedian-watch-it-you-could-get-shot/"}
