{"authors":[],"date_download":"2018-10-30 14:23:17","date_modify":"2018-10-30 14:23:17","date_publish":"2016-03-19 00:00:00","description":null,"filename":"data/vaneerConsumption/Michelles4KcasualCubancocktaildress.json","image_url":"https://www.americanthinker.com/images/bucket/2016-03/196275.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_03_michelles_4k_casual_cuban_cocktail_dress_comments_1540909397.html","title":"Michelle's $4K casual Cuban cocktail dress","title_page":"Blog: Michelle's $4K casual Cuban cocktail dress","title_rss":"NULL","source_domain":"americanthinker.com","text":"I'm the type of person that tries to make people feel comfortable. In order to accomplish that goal, I consider the company I keep and adjust accordingly. For instance, if I'm with overweight people, I don't discuss my diet and treadmill mileage. If I'm visiting with the elderly, I avoid the subject of wrinkles, nursing homes, and funerals. And, unlike Michelle Obama, if I volunteer at a soup kitchen, I don't wear my $565 Lanvin sneakers. But hey, that's just me. On the other hand, even if it makes people feel bad, the first lady seems to revel in showcasing her affluence. This week, in front of destitute Cubans who, on average, earn about $1 a day, Michelle Obama did just that. The first lady's imprudence began when the Obama entourage that included Sasha, Malia, Charlie Rangel, Grandma Marion, and Nancy Pelosi arrived in Cuba. After landing, Michelle descended to the tarmac from Air Force One decked... (Read Full Post)","url":"https://www.americanthinker.com/blog/2016/03/michelles_4k_casual_cuban_cocktail_dress_comments.html"}
ban health care system earn $67 a month. The food in Cuba is in such short supply that it's rationed, and in some cases, it's purchased illegally on the black market.\nYet despite the magnitude of Cuba's abject poverty, America's sartorial preener arrived in Havana wearing an ensemble whose cash value could support a Cuban family for six years.\nWhat next? When not trumpeting her good fortune in front of poor Cubans, Michelle will offer to entertain paraplegics by boogying to \"Uptown Funk\"?\nAnd the thoughtlessness got worse.\nAs poor Cubans lined the streets of Havana straining to catch a glimpse of American royalty, Michelle, guest of dictator/president Raúl Castro, made her way, dressed in yet another designer dress, to the Palace of the Revolution (of all places) for a state dinner.\nWhile Cubans ate peasant food like moros y cristianos, Michelle was dining on a sumptuous menu of \"[s]hrimp mousse … with cream of mojito; golden cream soup flavored with Caney rum accompanied by slivers of ham; traditional pork garnished with baby tamales … and a trio of Grandmother's sweets.\"\nAs Cubans roamed Old Havana in worn out flip-flops and secondhand clothes, Michelle impressed her hosts in a dress made of \"Kashmiri fabric embroidered with an Indian floral motif.\" This was a \"casual cocktail\" knee-length black floral dress by Naeem Khan that, according to the New York-based designer's collection, came with a $4,490 price tag.\nRounding that bottom line up, that little number's cash value could provide an average Cuban worker a salary for 12-plus years.\nIt's probably unfair for me to project my standard for how to treat people onto the first lady. Just because Michelle dresses like nobility in the company of the lowly doesn't mean she has little regard for the predicament of the poor. After all, the woman who sports overpriced clothes does have a husband who, when not paying for her haute couture, stresses the value of \"sharing our wealth.\"\nJeannie hosts a blog at www.jeannie-ology.com.","url":"https://www.americanthinker.com/blog/2016/03/michelles_4k_casual_cuban_cocktail_dress.html"}
