{"authors":["Breitbart News"],"date_download":"2018-10-30 18:29:08","date_modify":"2018-10-30 18:29:08","date_publish":"2014-12-17 17:54:19","description":"Elliot Seymour, the 29-year-old man who lost to actor Mickey Rourke in his return to boxing, now claims he was paid to intentionally lose the match, |","filename":"data/vaneerConsumption/MickeyRourkeBoxingOpponentClaimsHeWasPaid15KtoThrowMatch.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2014_12_17__1540924148.html","title":"Mickey Rourke Boxing Opponent Claims He Was Paid 15K to Throw Match","title_page":"Mickey Rourke Boxing Opponent Claims He Was Paid 15K to Throw Match | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Elliot Seymour, the 29-year-old man who lost to actor Mickey Rourke in his return to boxing, now claims he was paid to intentionally lose the match, reports TMZ.\nThe much-anticipated bout was over in just two rounds, after Rourke took Seymour to the canvas twice, knocking him down with a body shot.\nThe 62-year-old was hailed as the champion, but the knockdown led to immediate speculation that the fight was staged.\nAn anonymous source close to Seymour spoke to the Daily Mail, claiming the match was fake, and expressed concerns that Rourke had exploited the man.\nSeymour was said to be homeless at the time, and sleeping in Pasadena’s Memorial Park.\nTuesday, Seymour told TMZ Sports that he was to be paid $15 thousand to lose the match by a body shot in the second round, with $10 thousand up front and the rest when he returned to the U.S.\nHe claims that Rourke’s people dragged their feet on paying him the additional $5 thousand, and he is now speaking out because the pressure to keep lying was weighing on him.\nRourke’s trainer continues to deny the allegation, and says he believes Seymour changed his story to make more money.\nSeymour, who had a professional boxing career of 1-9 before his match with Rourke, also claims that nearly all of his punches in the match were choreographed.","url":"https://www.breitbart.com/entertainment/2014/12/17/mickey-rourke-boxing-opponent-claims-he-was-paid-15k-to-throw-match/"}
