{"authors":["Abrose For Mailonline"],"date_download":"2018-10-23 01:31:40","date_modify":"2018-10-23 01:31:40","date_publish":"2017-04-26 11:59:35","description":"Sporting the same tousled curls that became his father's signature during his Rolling Stones heyday in the 1960's, Lucas wore a trendy outfit as he enjoyed the evening with friends.","filename":"data/vaneerConsumption/MickJaggerssonLucasisspittingimageofrockstardad.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9EB93800000578-0-image-a-126_1493202108173.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446904_Mick-Jagger-s-son-Lucas-spitting-image-rockstar-dad_1540258300.html","title":"Mick Jagger's son Lucas is spitting image of rockstar dad","title_page":"Mick Jagger's son Lucas is spitting image of rockstar dad | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They say the apple doesn't fall far from the tree.\nAnd Lucas Jagger, 17, showed that he is the mirror image of his rockstar father Sir Mick, 73, when he attended a Dolce & Gabbana party in Sao Paulo, Brazil on Tuesday.\nSporting the same tousled curls that became his father's signature during his Rolling Stones heyday in the 1960's, Lucas wore a trendy outfit as he enjoyed the evening with friends.\nScroll down for video\nLookalike: Lucas Jagger, 17, (left) showed that he is the mirror image of his rockstar father Sir Mick, 73, (right) as he attended a Dolce & Gabbana party in Sao Paulo, Brazil on Tuesday\nWith a cheeky grin and twinkle in his eye, Lucas was the spitting image of his handsome father in his prime years.\nWearing a satin embroidered bomber jacket, Lucas showed that he even has his father's flair for fashion, as he paired his ensemble with some heavy black boots.\nWith beautiful actress Mariana Ruy Barbosa on his arm, Lucas also displayed that he has taken after his father's magnetic allure with the ladies.\nLadies' man: With beautiful actress Mariana Ruy Barbosa on his arm, Lucas also displayed that he has taken after his father's magnetic allure with the ladies\nCool dude: The rockstar offspring looked thrilled to be at the swanky event, which was also studded with other celebrity offspring\nMirror image: With his bone structure, full lips, curly locks and twinkly eyes, Lucas could be mistaken for Mick in his heyday\nThe rockstar offspring looked thrilled to be at the swanky event, that was also studded with other celebrity offspring.\nHe rocked a cool pair of shades whilst mingling with the crowd, that also included Brandon Thomas Lee, 20, son of Pamela Anderson and Tommy Lee, and model Pyper America Smith, 18.\nMick's mini-me was closely followed by his glamorous mother, Luciana Gimenez, 47, who showed off her stunning figure in a lace LBD.\nStar studded: The crowd also included Brandon Thomas Lee, 20, son of Pamela Anderson and Tommy Lee, and model Pyper America Smith, 18\nMeet the parents: Pamela and Tommy Lee pictured together in 2004\nBrazilian model Luciana looked as stunning as when she first caught Mick's eye - while he was married to model Jerry Hall.\nLuciana discovered that she was pregnant with Mick's child in 1998 after an eight-month affair, which resulted in Jerry and Mick's 22-year marriage dissolvement.\nIn 1999 Luciana was described as ‘the straw that broke the camel’s back’ by Jerry Hall during her divorce from Mick.\nLuciana previously said of model Jerry: 'I don't know how she feels about me, but I understand that I probably hurt her.'\nStill got it! Mick's mini-me was closely followed by his glamorous mother, Luciana Gimenez, 47, who showed off her stunning figure in a lace LBD. Luciana looked as stunning as when she first caught Mick's eye - while he was married to model Jerry Hall\nSir Mick Jagger's Brood Karis Hunt Jagger, 46\nJade Sheena Jezebel Jagger, 45\nLizzie Scarlett Jagger, 33\nJames Leroy Augustin Jagger, 31\nGeorgia May Ayeesha Jagger, 25\nGabriel Luke Beauregard Jagger, 19\nLucas Maurice Morad Jagger, 17\nDeveraux Octavian Basil Jagger, four months\nMick has remained close with his second youngest child, and the pair are often spotted attending football games together.\nSir Mick has eight children by five women, and maintains a good relationship with all of them.\nThe crooner has daughter Karis, 46, with American singer Marsha Hunt, 71, daughter Jade, 45, with first wife Bianca, 71 - who he divorced back in 1978 - and Lizzie, 33, James, 31, Gabriel, 19 and Georgia May, 25, with second wife Jerry Hall, 60, and Lucas, 17, with Luciana.\nThe rocker recently welcomed his eighth son Deveraux Octavian Basil in December 2016 with 29-year-old ballerina Melanie Hamrick.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446904/Mick-Jagger-s-son-Lucas-spitting-image-rockstar-dad.html"}
