{"authors":[],"date_download":"2018-10-22 20:06:10","date_modify":"2018-10-22 20:06:10","date_publish":"2016-01-29 00:30:26","description":"Microsoft shares rallied after the tech colossus reported earnings Thursday that surpassed Wall Street expectations with a winning shift into the Internet cl...","filename":"data/vaneerConsumption/Microsoftquarterlyprofitslipsbuttopsforecasts.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h5i7-2vdWmEltwXfba0ce28e632e471cb-838_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421906_Microsoft-quarterly-profit-slips-tops-forecasts_1540238770.html","title":"Microsoft quarterly profit slips but tops forecasts","title_page":"Microsoft quarterly profit slips but tops forecasts | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Microsoft quarterly profit slips but tops forecasts\nMicrosoft shares rallied after the tech colossus reported earnings Thursday that surpassed Wall Street expectations with a winning shift into the Internet cloud.\nMicrosoft made a profit of $5 billion on $23.8 billion in revenue in the final three months of last year, it said, propelling the company's shares about seven percent when the earnings figures hit, before giving up some of the ground.\nShares were up more than three percent to $53.91 in after-market trade, with analysts rejecting the notion that the technology veteran was somehow past its sell-by date.\nMicrosoft said that it made a profit of $5 billion on $23.8 billion in revenue in the final three months of last year ©Fred Dufour (AFP/File)\n\"It was a strong holiday season for Microsoft highlighted by Surface and Xbox,\" said chief operating officer Kevin Turner, referring to the company's tablet computer family and popular gaming console.\n\"Our commercial business executed well as our sales teams and partners helped customers realize the value of Microsoft's cloud technologies.\"\nNPD Group analyst Stephen Baker told AFP that \"People who think Microsoft is sliding into irrelevancy really need to re-evaluate how they see the company.\n\"They are a software-first company in a world that is increasingly about software.\"\nThe analyst credited Microsoft with having a \"nice mix\" of businesses and reasoned that while consumer products get a lot of attention, legions of people use productivity software or services on the job and off.\n- Looking to the cloud -\nCloud computing lets people use the Internet to tap into processing or data storage capacity at huge data centers.\nSoftware offered as a service in the Internet cloud has been a key aspect of Microsoft's effort to adapt to a shift away from packaged software on which the US company was built.\nMicrosoft quarterly profit was down overall, but still better than forecasts.\nRevenue from Microsoft Azure, which challenges cloud king Amazon Web Services, more than doubled while its overall \"Intelligent Cloud\" unit grew five percent to $6.3 billion, according to the earnings report.\n\"Businesses everywhere are using the Microsoft Cloud as their digital platform to drive their ambitious transformation agendas,\" said Microsoft chief executive Satya Nadella.\n\"The enterprise cloud opportunity is massive.\"\nNadella also revealed that Microsoft's recently released Windows 10 operating software now powers more than 200 million devices in the fastest adoption rate ever seen by the company.\nMicrosoft began rolling out Windows 10 last year, aiming to revive the tech giant's fortunes. The new operating system aims to be seamless across traditional computers and mobile devices such as tablets and smartphones.\nWindows remains the dominant PC platform but Microsoft has lagged rivals Apple and Google to power mobile devices such as tablets and smartphones.\nMicrosoft also sees the promise of some of its other offerings such as its Bing Internet search engine and the Windows Store for apps, games and other digital content.\nSurface tablet computers were a bright spot for Microsoft, with revenue increasing 29 percent on the back of the launch of Surface Pro 4 and Surface Book, according to the earnings report.\nThe number of people using Xbox Live online service for digital content and video game play climbed 30 percent to a record high 48 million.\n- Changing company? -\nMicrosoft has long specialized in software for getting tasks accomplished and there is a lot of money to be made in the cloud, according to the analyst Baker.\n\"People dont understand them,\" Baker said of Microsoft.\n\"They are not the same company they were a few years ago.\"\nMicrosoft earlier this month announced that it will put a billion dollars' worth of cloud computing power in the hands of non-profit groups and university researchers free of charge.\nA philanthropic arm of the US software giant will make the donation during the coming three years to 70,000 non-profit groups and researchers, Nadella said, while attending the World Economic Forum in Davos, Switzerland.\nThe philanthropic move comes as Microsoft continues adapting to a trend of people economically renting software as services in the Internet cloud instead of buying and installing programs on their machines.\nMicrosoft CEO Satya Nadella speaks during the presentation of Microsoft's cloud computing strategy in Berlin, on November 11, 2015 ©Gregor Fischer (DPA/AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3421906/Microsoft-quarterly-profit-slips-tops-forecasts.html"}
