{"authors":["Associated Press"],"date_download":"2018-10-22 20:06:27","date_modify":"2018-10-22 20:06:27","date_publish":"2016-01-29 00:29:51","description":"SAN FRANCISCO (AP) — Like a friendly but persistent sales rep, Microsoft has a message for anyone who owns a personal computer: If you haven't yet upgraded t...","filename":"data/vaneerConsumption/Microsoftearningsshoweffectsofturnaroundstrategy.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:dff83751b9d343b6b91e775186a9d014-4PuZeKVXE7cd9005b2c8762cf0c7-359_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421808_Microsofts-big-Windows-10-push-broader-strategy_1540238787.html","title":"Microsoft earnings show effects of turnaround strategy","title_page":"Microsoft earnings show effects of turnaround strategy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Microsoft earnings show effects of turnaround strategy\nSAN FRANCISCO (AP) — Like a friendly but persistent sales rep, Microsoft has a message for anyone who owns a personal computer: If you haven't yet upgraded to Windows 10, the company highly recommends it.\nSo highly, in fact, that in coming weeks, PC owners who have set their machines to automatically install important updates — like security fixes — could find the new operating system already downloaded and ready for activation.\nMicrosoft's aggressive campaign to promote Windows 10 has led to its deployment on more than 200 million devices since its July release. It's part of a multi-pronged strategy, along with a push to expand in \"cloud\" computing, that analysts say is driving the early stages of a financial turnaround, as evidenced by Microsoft's latest earnings report on Thursday.\nFILE - In this April 28, 2015, file photo, a man walks past a Microsoft sign set up for the Microsoft BUILD conference at Moscone Center in San Francisco. Microsoft reports financial earnings on Thursday, Jan. 28, 2016. (AP Photo/Jeff Chiu, File)\nThe Redmond, Washington-based tech company reported $5 billion in profit on nearly $24 billion in sales for the quarter ending Dec. 31. Revenue and profit were both down from a year ago, but after adjusting for deferred revenue and one-time costs, the numbers were better than Wall Street analysts expected.\nMicrosoft beat Wall Street's estimates for sales in key segments. Those include its cloud-computing segment, which lets commercial customers run their businesses on Microsoft's servers, and the division that sells PC software, Surface tablets and Xbox gaming consoles. Adjusted earnings amounted to 78 cents a share, while analysts polled by FactSet had expected adjusted earnings of 71 cents a share.\n\"All around, this looks like a quarter that (Microsoft CEO Satya) Nadella can frame and put in his office,\" FBR Capital Markets analyst Daniel Ives said. Microsoft's stock rose more than 3 percent in extended trading after the results came out.\nLong a dominant seller of PC-based software, Microsoft has seen its profit decline as consumers and businesses buy fewer PCs, cutting into licensing fees Microsoft gets from computer-makers. The last major upgrade of its operating system, known as Windows 8, was widely viewed as a flop, which hurt PC sales even more.\nNadella, who was named to the top job in 2014, has been pushing Microsoft to adapt to a world where people are increasingly using mobile gadgets, and where businesses are moving more of their operations to remote data centers, accessed via the Internet.\nMicrosoft broke with tradition last July by releasing Windows 10 as a free upgrade for older PCs, with no charge for future updates. It's also redesigned other popular products, such as the Office word-processing and spreadsheet programs, to work as mobile apps for devices running operating systems made by its rivals, Apple and Google.\nThe goal is to get people using Microsoft's latest products, no matter what kind of device they prefer, said Frank Gillett, a tech analyst with Forrester Research. He said that should give Microsoft more opportunities to make money by selling premium features or apps, such as online storage, Skype minutes or music and games.\nThe company is already seeing an increase in sales of apps and online advertising, tied to new features in Windows 10, Nadella told analysts Thursday.\nBut it's a gradual process, Gillett cautioned. Microsoft's personal-computing division reported $12.7 billion in sales for the December quarter, down 5 percent from a year earlier. Within that division, Microsoft said revenue from licensing Windows to PC makers was also down 5 percent, although the company noted that was better than the 8.3 percent decline in overall PC sales that market researchers have estimated for the October-December quarter.\nMeanwhile, analysts say Microsoft is also rapidly transforming its commercial-computing division by encouraging corporate customers to use its data centers. Microsoft's commercial \"cloud computing\" service is now the industry's second-largest, after Amazon's.\nThe potential for that business \"is massive — larger than any market we have ever participated in,\" Nadella said Thursday.\nRevenue for Microsoft's cloud division rose 5 percent, to $6.3 billion, for the December quarter. The company has had more success in that business than other established commercial tech giants like Hewlett-Packard and Oracle, according to Ives, who called cloud computing a \"bedrock\" element of Nadella's strategy.\nAs for the company's aggressive promotion of Windows 10, those promotional nudges have drawn a few complaints from PC owners who don't necessarily want to upgrade their software. But in coming months, Microsoft says the Windows 10 upgrade will be re-categorized from \"optional\" to \"recommended,\" which means people who use the automatic update feature on older Windows PCs could find the new software has downloaded automatically.\nMicrosoft says users will still get a prompt asking if they want to accept or decline the upgrade. They can also revert back to their old software if they change their mind within 31 days.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3421808/Microsofts-big-Windows-10-push-broader-strategy.html"}
