{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 21:29:03","date_modify":"2018-10-30 21:29:03","date_publish":"2016-12-20 00:00:00","description":null,"filename":"data/vaneerConsumption/MicrosofttestspaymentsAPI.json","image_url":"https://amp.businessinsider.com/images/58594740ca7f0c78048b6b52-750-375.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_microsoft-tests-payments-api-2016-12_1540934943.html","title":"Microsoft tests payments API","title_page":"    Microsoft tests payments API - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nMicrosoft has begun testing the Payment Request API, a developer solution for easier in-browser payments, in its Microsoft Edge web browser, according to a company blog post.\nRight now, the company has put the API into preview builds, with more definitive support and implementation on the horizon for next year.\nThe move could make it easier for developers to allow Windows 10 users across devices to make e-commerce payments through Microsoft Wallet.\nThe API helps solve pain points associated with digital buying. It's challenging for customers to buy in-browser, especially on mobile phones, thanks to pain points associated with smaller screens and slow connections. That's because consumers are often unwilling to go through complex checkout processes on these screens — 46% of cart abandonments occur at the payment stage, and others happen at address entry points or checkout login.\nPayment Request API, which was developed by a consortium, helps solve those problems, by using information that users have already entered into mobile wallets to fill checkout information feeds, which could ultimately lead to better conversions and higher sales. And because it's an API, it can build a consistent experience across websites, which pleases both consumers and merchants alike.\nThat could push more users to adopt Microsoft Wallet, ultimately making it a more competitive product in the ecosystem.\nBecause the API requires Microsoft Wallet to work, it could push more users to enter their information in the wallet. The pain points that the API can solve might be enticing to consumers looking for an easier way to shop on mobile. But because Microsoft Wallet is tied to the API, it could push more users to enter their information into the mobile wallet, which could grow adoption and bring on users that might test the wallet in other uses.\nThe wallet could also have a compelling use case for desktop shopping down the line. Windows Phones hold a small share of the overall smartphone market. But a considerable number of customers use Windows PCs, and 81% of e-commerce is done via desktop. That means that, if the API grows beyond just Microsoft Edge and into Chrome or other browsers for desktop, and Microsoft Wallet opts to support these browsers for Windows 10 users, its addressable base could expand, which could help the wallet find its niche among users looking for ways to check out faster on desktop.","url":"https://www.businessinsider.com/microsoft-tests-payments-api-2016-12"}
