{"authors":["Neil Munro"],"date_download":"2018-10-30 19:05:47","date_modify":"2018-10-30 19:05:47","date_publish":"2018-07-13 17:15:43","description":"Microsoft's president is threatening to move white-collar jobs out of the United States if President Donald Trump does not allow the company to hire foreign graduates for the U.S.-based jobs. Microsoft opposes fixes to OPT and H4 EAD college-grad outsourcing |","filename":"data/vaneerConsumption/MicrosoftThreatensTrumponMiddleClassVisaOutsourcing.json","image_url":"https://media.breitbart.com/media/2018/07/AP_18058615824681.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/midterm-election_2018_07_13__1540926347.html","title":"Microsoft Threatens Trump on Middle-Class Visa Outsourcing","title_page":"Microsoft Threatens Trump on Middle-Class Visa Outsourcing | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Microsoft’s president is threatening to move white-collar jobs out of the United States if President Donald Trump does not allow the company to hire foreign graduates for the U.S.-based jobs.\n“We don’t want to move jobs out of the United States and we hope that we don’t see decision making in Washington that would force us to do that,” said Brad Smith, the company’s president and chief legal officer told CNBC on July 12.\nThe company and its subcontractors already employ thousands of foreign college-grads via the H-1B, Optional Practical Training, and Employment Authorization Document temporary visa-worker programs.\nThese visa-outsourcing programs already keep a shifting population of at least 1.5 million foreign college graduates in U.S. jobs.\nThe issue is heating up because President Donald Trump’s “Hire American” policy has prompted agency officials to begin canceling a visa-worker program invented by officials working for former President Barack Obama. Under the so-called “H4 EAD” program, officials have granted work permits to roughly 100,000 spouses of foreign visa-workers, even though Congress bars the employment of foreign workers.\nThe similar OPT program was also created without approval from Congress, reportedly at the request of Microsoft, supposedly as a work-training program for foreign students at U.S. universities. But the program now provides companies with roughly 250,000 foreign graduates to take jobs sought by American youths. This year, Trump’s deputies set new rules to help reduce the use of OPT trainees in white-collar jobs sought by U.S. graduates.\nSmith said Microsoft would fund lawsuits to keep the 350,000 OPT and H4 EAD foreign workers in the jobs sought by debt-burdened U.S. graduates. “We’re not going to cut people loose,” he told CNBC. “We’re going to stand behind them,” he added.\nSalaries for U.S. college graduates have stalled amid the flood of foreign college-graduates temporary workers into prestigious U.S. jobs in universities, healthcare, research, software, business, and engineering. Many of the foreign workers take jobs at low salaries and long hours in the hope of eventually winning the deferred bonus of U.S. citizenship.\nHowever, Microsoft’s stock has risen from $65 a share to $105 a share since Trump’s inauguration, according to a Yahoo stock chart. That increase has provided roughly $00 billion in extra value to the stockholders.\nThese middle-class outsourcing programs are rarely mentioned in establishment media outlets, which instead focus on the concerns of migrants, including the Central American migrants who bring their children to trigger catch-and-release laws. The Smith interview was conducted by a reporter from Singapore.\nTo build support among Americans for hiring foreign graduates instead of American graduates, Smith said he would support a program to push Microsoft’s products and services into lower-density rural areas:\n“I think we have to show that on the one hand we will stand up for issues like immigration where we feel our interests are at stake,” Smith said. “But we also have to show that we get it, that we understand what these other parts of the country need and we need to take tangible steps ourselves as we’re striving to do, to meet those needs.”\n“They live in these broadband deserts,” Smith said about Americans.\nMicrosoft’s founder Bill Gates is a founding member of FWD.us, a D.C. advocacy group which is trying to block Trump’s pro-American immigration reforms. Smith is a major donor to the group, which was founded by a series of wealthy technology investors, including Facebook founder Mark Zuckerberg.\nSince 2014, Microsoft has asked the federal government for permission to import more than 16,000 H-1B workers, according to MyVisaJobs.com. Federal data suggests that roughly one-third of the requests were approved.","url":"https://www.breitbart.com/midterm-election/2018/07/13/microsoft-threatens-trump-over-middle-class-visa-outsourcing/"}
