{"authors":["Anthony Joseph For Mailonline"],"date_download":"2018-10-23 04:32:37","date_modify":"2018-10-23 04:32:37","date_publish":"2017-04-26 16:12:18","description":"Russel Zoryk (pictured), 25, from Middlesbrough, terrorised his ex-girlfriend, her new partner and their families over an 18-month campaign of 'vitriol and bile'.","filename":"data/vaneerConsumption/Middlesbroughstalkerbombardedexwithmessagesjailed.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3F9EFB4500000578-0-image-a-79_1493219520377.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4448252_Stalker-bombarded-ex-family-sick-messages_1540269157.html","title":"Middlesbrough stalker bombarded ex with messages jailed","title_page":"Middlesbrough stalker bombarded ex with messages jailed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Russel Zoryk, 25, from Middlesbrough, terrorised his ex-girlfriend, her new partner and their families over an 18-month campaign of 'vitriol and bile'\nA stalker, who bombarded his ex and her family with sickening messages and bomb hoaxes, has been jailed for eight years.\nRussel Zoryk, 25, from Middlesbrough, terrorised his ex-girlfriend, her new partner and their families over an 18-month campaign of 'vitriol and bile'.\nIn one of his most sinister manoeuvres, he sent a bomb hoax tweet to Newcastle and Durham airports in his former partner's name.\nHe sent a message in November 2015 saying: 'Thought #parisattacks were bad, wait for my luggage gifts. Death to the infidels. #allahackbar £ISIS'\nJudge Simon Bourne-Arton QC, the Recorder of Middlesbrough, said Zoryk was clearly obsessed with his ex and did not accept her rejection of him.\nHe told Zoryk: 'You planned your revenge on her and those who were close to her.\n'You threaten people from a distance. You threatened using means by which you can remain anonymous.\n'You gain pleasure, I have no doubt, from the thought of the effect of your threats on others.'\nHe said the messages were callous, 'graphic and vile' with dreadful threats, his stalking insidious and causing fear and distress.\nHe added Zoryk hoped to avoid detection and caused suspicion to fall on others.\nTeesside Crown Court heard how Zoryk targeted his victims with abusive, graphic messages after his love split in 2013.\nThe deluge of toxic correspondence contained lurid and violent threats referring to death, murder, rape, torture and mutilation.\nHe sent racist and homophobic messages in his ex's name, leading to her being wrongly condemned by members of the public.\nHis palm print was found on a letter containing white powder, which turned out to be dried potato, sent to his ex's grandfather saying: 'Hope this kills you.'\nHe urged a mentally ill family member to 'end your worthless pathetic life' at one point during the harassment between May 2014 and November 2015.\nAnd a dad received one message asking: 'What casket do you want your daughter to be in?'\nZoryk ordered unwanted taxis, takeaways and wedding brochures to people's homes.\nHe tried to cover his tracks hiding behind fake accounts under false identities, often posing as his ex or her new partner.\nJudge Simon Bourne-Arton QC, the Recorder of Middlesbrough, said Zoryk was clearly obsessed with his ex and did not accept her rejection of him.\nHe denied any wrongdoing, saying it was nothing to do with him and claiming to have been a victim of threatening emails.\nAfter he was arrested, he sent threatening emails to two detectives in the case, insulting police and referring to an officer's children.\nProsecutor Nicholas Lumley QC said Zoryk was a desperate, bitter and jealous liar who was the 'mystery man' behind all the malicious activity.\nZoryk, from Derby, denied sending a noxious substance with intent, communicating false information, two charges of stalking and three charges of intimidation.\nHe chose not to step into the witness box, or call any evidence in his defence, during his trial.\nHe showed no reaction in the dock as the jury unanimously found him guilty on all seven charges - his first conviction - on Tuesday afternoon.\nConor Quinn, defending, said immature Zoryk acted 'behind the safety of his computer screen but never came close to practising what he was preaching'.\nThe investigating officers were praised for their 'commendable' dedication in a highly unusual and difficult case.\nZoryk was given an indefinite restraining order banning him from contacting a number of named people.\nSpeaking after the hearing investigating officer, Detective Constable Chris Pringle, said: 'This is an extreme case of stalking and harassment investigated in partnership with specialist agencies.\n'Russel Zoryk made the lives of an innocent family a misery and went on to send tweets of an extremely serious and worrying nature to Durham Tees Valley and Newcastle International airports.\n'I am pleased with the outcome at court today and would hope that it provides some comfort to the victims in this case.'","url":"https://www.dailymail.co.uk/news/article-4448252/Stalker-bombarded-ex-family-sick-messages.html"}
