{"authors":["Kerry Mcdermott For Mailonline"],"date_download":"2018-10-23 00:59:31","date_modify":"2018-10-23 00:59:31","date_publish":"2017-03-10 08:22:29","description":"Michelle Micklewright, from Middlesborough, met her husband Kenny when she was 18 and he was 53. A decade later the couple are married with a nine-year-old daughter, Tyanna.","filename":"data/vaneerConsumption/Middlesboroughcouplemarrieddespitea35yearagegap.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/18/3E1DA03C00000578-0-image-a-4_1489084198473.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4298362_Middlesborough-couple-married-despite-35-year-age-gap_1540256371.html","title":"Middlesborough couple married despite a 35 year age gap","title_page":"Middlesborough couple married despite a 35 year age gap | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A woman who fell for a man 35 years her senior at 18 says people still mistake him for her father - even though they're now married with a daughter.\nMichelle Micklewright, now 29, was just 18 when she met Kenny Micklewright, who was 53 at the time, in Middlesborough in North Yorkshire.\nShe was initially afraid to tell anyone about her generation spanning romance with the pub manager, who is older than both of her parents, but within just three months they were publicly an item and Michelle was pregnant with the couple's daughter.\nMore than a decade on Michelle says strangers still assume Kenny, now 64, is her father - and their little girl's grandfather - and adds: 'The look on people's faces when we kiss is priceless.'\nMichelle Micklewright, now 29, met her husband Kenny, now 64, when she was just 18. The couple have a nine-year-old daughter, Tyanna\nThe couple, seen on their wedding day, married after Kenny proposed at midnight on new year's eve 2014\nBut Michelle insists her young at heart husband has more energy than she does and has no problem keeping up with nine-year-old Tyanna.\n'We always correct them, but just laugh it off,' she says of strangers who misunderstand the situation when the family is out and about.\n'When we first got together, a few people questioned why I was with Kenny and thought it wouldn't last. But he wasn't just a flash in the pan – it was serious.\n'To anyone who has a problem with age gap relationships, I'd say get over it because it's none of your business.'\nMichelle insists Kenny doesn't struggle to keep up with their nine-year-old daughter - and says he has more energy than she does\nThe couple met in 2006 at the pub Kenny managed, and started seeing one another after a night out in 2007 - but initially kept their relationship under wraps\nMichelle first met Kenny at the pub he managed back in 2006, but romance didn't blossom until the following year.\n'I'd known Kenny for a year before anything happened. I didn't think much of it at first, but once I got speaking to him, I really fell for him,' Michelle said.\n'He's really funny and doesn't act his age at all.'\nTheir relationship became romantic after they bumped into one another during a night out in 2007.\n'We ended up going back to the pub, and one thing led to another,' Michelle said.\n'I'd no idea he felt the same way about me. He's a really outgoing person anyway, so it was hard to tell if he was flirting.'\nThe couple admit that Kenny, now 64, is regularly mistaken for Tyanna's grandfather\nFrom there, the couple swapped numbers but, worried about what people would think, kept their romance under wraps at first,' she said.\nBut as things grew more serious, Michelle eventually confided in friends and family, and says her parents, though shocked, were supportive - even though Kenny is older than both her father Geoff, now 55, and mum Shirley, now 50.\nRecalling that first meeting, Michelle said: 'I felt sick with nerves, but Kenny broke the ice and, within minutes we were chattering away.\n'They all spoke about country and western music, and John Wayne films I'd never heard of.'\nKenny, seen left with Tyanna, and right with Michelle's dad Geoff, is almost a decade older than his father-in-law\nJust three months after the couple became an item, Michelle fell pregnant with Tyanna.\nAnd on New Year's Eve 2014, their little family became complete, when Kenny proposed at midnight.\nA decade on they say they're proof age really is just a number.\nDespite his advancing years, Michelle said that Kenny doesn't struggle to keep up with his daughter, claiming he's more energetic than most younger dads.\n'People also ask if we worry Kenny won't get as much time with Tyanna as a younger dad would,' she said.\n'That hurts to hear, but my answer is always the same - nobody knows what's going to happen in life.\n'The three of us are together now, and that's all that matters.\n'My teenage crush all those years ago is now my husband. He might be an older model but I wouldn't trade him in for the world.'","url":"https://www.dailymail.co.uk/femail/article-4298362/Middlesborough-couple-married-despite-35-year-age-gap.html"}
