{"authors":["Dave Perozek","Northwest Arkansas Democrat-Gazette"],"date_download":"2018-10-30 17:51:09","date_modify":"2018-10-30 17:51:09","date_publish":"2018-10-30 00:00:00","description":"BENTONVILLE — Some Arkansas middle school students are helping to spread Christmas cheer — and information about their home state — in the nation's capital this year.","filename":"data/vaneerConsumption/MiddleschoolpickedtorepresentArkansasatNationalChristmasTreeexperienceinDC.json","image_url":"https://media.arkansasonline.com/img/photos/2018/10/30/190183357_BC-ORNAMENT-001_ORIG_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2018_oct_30__1540921869.html","title":"Middle school picked to represent Arkansas at National Christmas Tree experience in D.C.","title_page":"Middle school picked to represent Arkansas at National Christmas Tree experience in D.C.","title_rss":"NULL","source_domain":"arkansasonline.com","text":"NWA Democrat-Gazette/CHARLIE KAIJO Art teacher Nikki Kalcevic (center) helps sixth-grader Shaekyra Carter, 11, (left) paint her ornament with Christina Espinosa, 11, (right) during an art class Monday at Ardis Ann Middle School in Bentonville.\nBENTONVILLE — Some Arkansas middle school students are helping to spread Christmas cheer — and information about their home state — in the nation's capital this year.\nArdis Ann Middle School in Bentonville was chosen to represent Arkansas in the America Celebrates display, part of the National Christmas Tree experience that begins Nov. 28 at President's Park in Washington.\nUnder the direction of art teacher Nikki Kalcevic, about two dozen sixth-graders came up with designs they painted onto plastic balls.\nThe 23 ornaments, each one a little bigger than a softball, will adorn one of 56 trees surrounding the larger national Christmas tree. Each tree will represent a U.S. state or territory and the District of Columbia, according to a National Park Service news release.\nThe Ardis Ann students' ornaments each have something to do with Arkansas.\nSofia Coberly, 11, paid homage to the state insect with a picture of a honeybee on top of a honeycomb. The opposite side of her ornament states, \"Merry Christmas from the bees.\"\nSofia believes bees deserve more respect for their role in the food chain.\n\"If there weren't honeybees or pollinators, the world wouldn't have any food,\" Sofia said. \"They're really important to people.\"\nShe thought by highlighting the importance of bees, she might make people think twice before they swat one out of fear of being stung.\nThe idea that her artwork will be on display for everyone in Washington to see excites her.\n\"The biggest thing I've done with an object I made was for an art show here at the school, and it was just a drawing,\" Sofia said.\nThe U.S. Department of Education, through a partnership with the National Park Service, worked with state art and education agencies to identify middle and high schools whose students would create the ornaments.\nKalcevic said she has a good relationship with Lana Hallmark, fine arts specialist at the Arkansas Department of Education. Hallmark invited Kalcevic to participate in the America Celebrates program.\nKalcevic initially wasn't aware her school was the only one in the state participating in the program.\n\"It's pretty special,\" she said.\nThe ornaments must be packed up and mailed to Washington by Wednesday.\nParticipating schools were asked not to decorate their ornaments with business or sports-related logos or anything political or religious, she said. Kalcevic chose her Thursday sixth-period art class to make the ornaments because those students seemed the most interested in the project, she said.\nKayla Wilson and Aralynn Hoover, both 12, created an ornament together that shows a plate of cookies and a mug of milk, which they pointed out is Arkansas' state beverage.\n\"It probably took us about three class periods to think of it, sketch it out and paint it,\" Kayla said.","url":"https://www.arkansasonline.com/news/2018/oct/30/middle-school-picked-represent-arkansas-national-c/"}
