{"authors":[],"date_download":"2018-10-22 22:29:01","date_modify":"2018-10-22 22:29:01","date_publish":"2014-06-09 18:47:18","description":"Two self-styled gurus of minimalism say their message of making life more meaningful with fewer possessions is one to which everyone can relate.","filename":"data/vaneerConsumption/MiddleClassMinimalistMessageSoundsOffKeyforPoor.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_24/497611/140609-minimalist-shopping-cover-1557_814b3d0095661f26af98f9cdefb2f163.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_middle-class-minimalist-message-sounds-off-key-poor-n126536_1540247341.html","title":"Middle Class Minimalist Message Sounds Off-Key for Poor","title_page":"Middle Class Minimalist Message Sounds Off-Key for Poor","title_rss":"NULL","source_domain":"nbcnews.com","text":"That advice might sound off-key for those in poverty.\n“A wealthy person minimalizing is making a lifestyle choice,” said Sasha Abramsky, a fellow at advocacy group DEMOS and author of “The American Way of Poverty, How the Other Half Still Lives.” Poor people, he said, “don’t have that option in the first place.”\nThrough their public relations representative, the two declined to say how much they earned from preaching a gospel of fewer possessions and less money. “Focusing primarily on money misses the point,” Millburn said via email.\nEven poor Americans can benefit from disciplined spending, Millburn insisted. “I think ultimately it’s about decisions with the resources we do have …. I think people don’t realize how much is going out the window.”\nNot so, said Arne Kalleberg, a professor of sociology at the University of North Carolina at Chapel Hill who studies poverty.\n“The poor people I’ve talked to, they know exactly how much money is going out the window because they’re counting pennies,” he said. “They know exactly which bills they’re going to not pay this month and how much they’ll pay in interest. That doesn’t mean poor people don’t waste money — every time you want to wash a pair of jeans, you have to pay $3 — but they do know where the money goes.”\n“As long as the big-picture inequalities remain, a conversation about minimalism … is going to end up blaming poor people when they stay poor.”\nIn a blog post, Millburn wrote, “I’m currently wearing a $100 pair of jeans, and, yes, they are worth $100 of my freedom to me; they are also my only pair of jeans, ergo I get immense value from them since I wear them almost every day.”\nIf you’re a middle-class person with a washer and a dryer in your house, that’s easy, Kalleberg said. Trips to a Laundromat cost both time and money.\nAnd for the people who can’t afford $100 jeans, perhaps they can have the cast-offs of elective minimalists.\nNicodemus said that at one point, he had roughly a dozen shirts he wore when he painted. “I probably only needed one or two painting shirts, if that,” he said.\n“I think that’s the nice thing about a lot of different charities. There are places now within communities … that have high-quality stuff,” Millburn said, saying he donated a lot of his clothes when he embraced minimalism.\n“I’m certain I can go to Goodwill ... if I was in a lower income situation [and] have free or very low-cost access to high quality goods.”\nBut there’s nothing generous about telling poor people they should be grateful for hand-me-downs, Abramsky argued.\n“It’s one thing for a wealthy person to say, ‘I don’t need that pair of jeans,’ but the psychology of telling a poor person, ‘you’re not good enough to buy new clothes’… psychologically, that comes with a lot of baggage,” he said.\nMinimalism also assumes a certain amount of free time, which poverty experts say is as scarce as disposable income for poor Americans.\n“I would say that for me I know that I have at least 20 minutes a day to sit and let my mind wander and do a little bit of meditation,” Nicodemus said.\nOthers can, too, he said. “They can find at least 20 minutes a day…. They can certainly slow down a little bit and make better decisions here and there.”\nIt’s not that simple, Kalleberg said. “Poverty comes with tremendous time restrictions,” he said. “With the psychological pressure of juggling … everything becomes stressful and everything generally takes longer than it would if you had resources.”\nUltimately, the problem of applying minimalism to everyone is that “it assumes everything is equal,” Abramsky said. It assumes poor people live in neighborhoods that are as safe as rich neighborhoods, that they have access to good grocery stores and doctor’s offices and parks and schools — and almost always, this isn’t the case.\n“It makes all of these assumptions about equal environments that don’t hold,” Abramsky said. “As long as the big-picture inequalities remain, a conversation about minimalism … is going to end up blaming poor people when they stay poor.”","url":"https://www.nbcnews.com/business/consumer/middle-class-minimalist-message-sounds-off-key-poor-n126536"}
