{"authors":["John J. Xenakis"],"date_download":"2018-10-30 22:04:17","date_modify":"2018-10-30 22:04:17","date_publish":"2016-01-03 12:00:21","description":"Saudi Arabians execute 47 prisoners for 'terrorism' including Shia cleric; Execution of Shia cleric Nirm al-Nimr triggers protests in Mideast","filename":"data/vaneerConsumption/MideastTensionsSurgeasIraniansBurnDownSaudiEmbassy.json","image_url":"https://media.breitbart.com/media/2016/01/Saudi-Embassy-Tehran-Fire.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_01_03__1540937057.html","title":"Mideast Tensions Surge as Iranians Burn Down Saudi Embassy","title_page":"Mideast Tensions Surge as Iranians Burn Down Saudi Embassy","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nSaudi Arabians execute 47 prisoners for ‘terrorism’ including prominent Shia cleric\nExecution of Shia cleric Nimr al-Nimr triggers mass protests in Mideast\nSaudi Arabians execute 47 prisoners for ‘terrorism’ including prominent Shia cleric\nA graphic appearing on the web site of Supreme Leader Khamenei that accuses of Saudi Arabia of supporting ISIS and also beheading people as ISIS does (khamenei.ir)\nOn Saturday, protesters in Tehran, the capital city of Iran, stormed the Saudi Arabian embassy, setting it on fire, and burning the entire insides, according to reports. There were widespread Shia protests in other parts of the Mideast, including the coastal city of Qatif in eastern Saudi Arabia, and in northwest Iran.\nWhat triggered the Shia protests was that Saudi Arabia on Saturday executed 47 prisoners — 45 Saudi citizens, one from Egypt and one from Chad.\nAccording to Saudi news media, most of those executed were Al-Qaeda members convicted for their involvement in bombing major government facilities in 2004, the Ministry of Interior and the Emergency Forces in the same year, killing several security men and citizens. They were also found guilty of bombing the US Consulate in Jeddah in 2004, killing four security men; and attacking the water refinery in Abqaiq in 2006, which claimed the lives of two security men.\nAccording to the Saudis, the executed men were convicted of embracing takfiri (deviant) ideology, contradicting the Koran and the Sunnah. The Sunnah are the writings of Muslim scholars in the centuries following the death of Mohammed, and they are one of the bedrocks that distinguish the Sunni and Shia branches of Islam.\nEmbracing takfiri ideology apparently meant not just the Shia ideology, but also the Al-Khawarij doctrine. The Khawarij were the first sect, in 657, to split from the mainstream Muslims following the death of Mohammed. They are rejected by both Sunni and Shia governments because they oppose much of the rule of law, even Sharia law, except their own interpretation. The Khawarij are still active today and, according to some scholars, the so-called Islamic State (IS or ISIS or ISIL or Daesh) is a Khawarij sect. Arab News (Riyadh) and Arab News and Call To Islam\nExecution of Shia cleric Nimr al-Nimr triggers mass protests in Mideast\nIran officials have been harshly condemning the 47 executions, particularly the execution of Mohammad Baqir Nimr al-Nimr, a well-known Shia cleric who spent more than a decade studying theology in Iran. He became an anti-government protester in Saudi Arabia, and has encouraged Shia protests in eastern Saudi Arabia. He was arrested in July 2012 and sentenced to death on October, 2014. Since then, Iran has frequently condemned the killing of al-Nimr, and demanded his release.\nThere were numerous statements form Iranian officials, including one by Supreme Leader Ayatollah Seyed Ali Khamenei who compared Saudi Arabia to ISIS in its ideology and the brutality of its executions. A statement appearing on the web site of the Islamic Revolutionary Guards Corps (IRGC) seemed designed to encourage Shia’s to protest:\nThe criminal act of execution of Sheikh Nimr the leader of Shia in Saudi Arabia is part of a Zionist [Israeli] conspiracy to sow discord among the world Muslims which will be aborted by the Heavenly blessings coming down to us by the pure blood of these martyrs. Definitely, Muslims will react to this atrocity and violence through consolidation of unity, which will contribute to the resistance ideals of liberation of the holy Quds [Jerusalem]. The medieval act of savagery by the Saudi regime is blatant violation of Sheikh Nimr’s inalienable rights and the freedom of expression, and a clear evidence that Takfirist [deviant] ideology of Wahhabist teachings, now championed by ISIL, has dominated the files and ranks of the Saudi government. […] Saudi regime will definitely pay heavy prices for the execution of Sheikh Nimr as unabashed and rash conduct.\nWidespread Shia protests began shortly afterwards in the eastern coastal city of Qatif in Saudi Arabia, in Bahrain, outside the Saudi consulate in Mashhad in northeastern Iran, and at the Saudi embassy in Iran. Protesters stormed the Saudi embassy in Tehran and set it on fire, burning the entire inside of the building, according to reports.\nThere was a BBC World Service special show that aired a couple of days ago — an hour of the top BBC reporters and analysts predicting what would happen in 2016. Most of it was pretty fatuous, but the thing that really made me start laughing was when one of the reporters, I think it was Lyse Doucet, predicted that in 2016, Saudi Arabia and Iran would get together to start peace talks, and would settle many of their differences by the end of the year. That was two days before the current incident. I don’t tell this to criticize Lyse Doucet, who is a fine reporter and analyst, but rather to show that reporters in general are extremely liberal and have no clue what is going on in the world, even in the countries they report from as correspondents.\nAs I have been saying for years, Generational Dynamics predicts that the Mideast is headed for a major war between Arabs and Jews, between different ethnic groups, and most particularly, a massive sectarian war between Sunnis and Shias. Thanks to numerous events in 2015, including the war in Yemen, the rise of ISIS, the military intervention of Russia, and Iran’s nuclear deal with the west, this sectarian war between Sunnis and Shias has moved a lot closer. And now it is only January 2, 2016, and these new events are going to have major repercussions in the weeks and months to come. Mehr News (Tehran) and Press TV (Tehran) and Reuters\nKEYS: Generational Dynamics, Saudi Arabia, Al-Khawarij doctrine, Qatif, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Iran, Mohammad Baqir Nimr al-Nimr, Seyed Ali Khamenei, Islamic Revolution Guards Corps, IRGC, BBC, Lyse Doucet, Israel\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2016/01/03/world-view-mideast-tensions-surge-as-iranians-burn-down-saudi-embassy/"}
