{"authors":[],"date_download":"2018-10-30 14:33:50","date_modify":"2018-10-30 14:33:50","date_publish":"2018-08-14 20:25:00","description":"On the second Tuesday of each month, the Midtown Development Review Committee holds a public meeting — sans a public comment period — to hear proposals regarding development in the area.","filename":"data/vaneerConsumption/MidtownDRCtohearplansforGeorgiaTechMicrogridofficeshomes.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/14/Images/IMG_6038.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_midtown-developm_c3a5215f4d58fe8434928a468d4705cb__1540910030.html","title":"Midtown DRC to hear plans for Georgia Tech Microgrid, offices, homes","title_page":"Midtown DRC to hear plans for Georgia Tech Microgrid, offices, homes","title_rss":"NULL","source_domain":"ajc.com","text":"On the second Tuesday of each month, the Midtown Development Review Committee holds a public meeting — sans a public comment period — to hear area development proposals.\nProposals aren’t required to be approved by the DRC before going to city planners, but getting clearance before approaching the city is considered neighborly and can help.\nREAD | Want to sleep at Ponce City Market? Short-term rentals now available\nREAD | Free art movement doubles as a city-wide scavenger hunt\nThree applications are scheduled to be presented at the Aug. 14 meeting, which begins at 5:30 p.m. on the 7th floor of 999 Peachtree St. (Note that applications may be revisions of previously discussed projects.)\nThe proposals are as follows:\n• Georgia Tech Microgrid - 770 Spring St.\nThe proposal is for an open-air power generation research facility, known as a “Microgrid,” at the northeast corner of 4th and Williams streets. All components, such as fuel cells, battery storage and micro turbines, would be placed on a platform and screened from view with 7-foot-high fencing, including gate access along Williams Street. Georgia Tech and Georgia Power would partner on the project with generated power intended to be delivered one block east to Coda Tech Square, which was first known as the High Performance Computing Center.\nApplicants: Mark Long, Georgia Tech; Seth Peek, Eberly & Assoc.\n• Portman Holdings - 712 West Peachtree St.\nThe proposal is for a 23-story office development that includes a “double height” lobby and 5,100-square-feet of retail space at the northeast corner of West Peachtree and 3rd streets. Above the lowest level is six levels of parking with about 520 spaces, topped by 16 stories of office space. The project proposes to share loading access from the adjacent western alley inline with Anthem HQ, the development at 740 West Peachtree St.\nApplicants: Charles Pinkham III and Hunter Richardson, Portman Holdings\n• Park Modern - 1200 14th Place\nThe proposal is for new four-story residential townhouses with 18 units at 44,565 square feet. Parking would be provided at two spaces per unit (36 total) accessible via a side and rear driveway connecting 14th Street and 14th Place. Open space includes a lap pool, park green and a dog run. This is revised from an application submitted in April.\nApplicants: Andrew Rutledge and Tyler Allgood of Office of Design, the architects of record.\nSee the projects on a map:\nThe DRC committee, appointed jointly by the city of Atlanta and Midtown Alliance, is made up of 10 people who represent residents, property and business owners, institutions, neighborhood associations and MARTA.\nThey provide formal recommendations to the Office of Planning on all Special Administrative Permit applications within Midtown’s special public interest zoning districts.\nApplicants must submit project information — such as project narratives, site plans, elevations and renderings — a week in advance to be placed on the agenda.\nLike Intown Atlanta News Now on Facebook | Follow us on Twitter\nIn other Midtown Atlanta news:","url":"https://www.ajc.com/news/local/midtown-development-committee-hear-plans-for-georgia-tech-microgrid/tGC54QAAkovTUunL7U9kOM/"}
