{"authors":["Liam Deacon"],"date_download":"2018-10-30 21:56:16","date_modify":"2018-10-30 21:56:16","date_publish":"2015-10-16 17:57:00","description":"The EU’s Forced Migrant relocation scheme is In Tatters as asylum seekers in Greece refused to be relocated to Luxembourg.","filename":"data/vaneerConsumption/MigrantRelocationStuntWasEUFundedAndNearlyHalfTheMigrantsAbsconded.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_10_16__1540936576.html","title":"Migrant Relocation Stunt Was EU-Funded… And Nearly Half The Migrants Absconded","title_page":"Migrant Relocation Stunt Was EU-Funded… And Nearly Half The Migrants Absconded","title_rss":"NULL","source_domain":"breitbart.com","text":"Jubilant photos (above) from last week, of the European Union’s (EU) grand plans for forced migration quotas spinning into action were indeed arranged by, and funded by the European Commission, in a propaganda effort that clearly went awry. The relocation of migrants from Italy to Sweden was very nearly abandoned after most of the migrants tried to run off.\nThe original plan, to move 33 Eritreans from Italy to Sweden, saw 14 of them abscond, and the remaining 19 moved and then kept “under lock and key” in the lead up to the publicity stunt.\nRegardless, a Commission report handed to EU leaders last night, seen by The Times, hailed the pantomime as “an important symbolic moment which marked the start of a new European approach to the way we treat asylum applications”.\nThey added: “However, beyond symbolism, relocations now need to become systematic, routine business in Italy and in Greece.”\nThis is unlikely, as the very feasibility of a forced relocation scheme within the Schengen area is now beginning to be called into question, as Greece and Italy have completely given up trying to send migrants to Luxembourg because so many of them demand to go to their preferred destination of Germany.\n“The quotas are not so people can go asylum shopping,” one EU diplomat told The Times. “If you say you are escaping war, you can’t refuse to go to Luxembourg. It is making a joke out of the whole quota system.”\nThe newspaper also reported that the attempted relocation of more than 30 migrants to Luxembourg – one of the continent’s richest nations – has been completely abandoned because “very many” demanded Germany instead.\nUnsurprisingly there have also been problems trying to get migrants to go to Estonia, which resisted the quota system, as authorities in Greece and Italy are reluctant to force migrants to do so.\n“Very many refugees are not keen to come to Luxembourg,” confessed Jean-Claude Juncker, the president of the European Commission and architect of the quota scheme, whose home country is Luxembourg.\n“It should not be a challenge for people fleeing their country of origin to ask them to come to Luxembourg,” he said, briefing MEPs on Wednesday evening, expressing his naive, or forced, surprise.\nThe quota scheme, which proposes to relocate 120,000 migrants into nation, was forced through the European Parliament in September, against the will of Eastern nations, Portugal and the UK, using a shady and undemocratic mechanism called qualified majority voting.\nAs of now, just six EU countries – Austria, France, Germany, Luxembourg, Sweden and Spain – have declared themselves ready to actually accept any.\n“The first relocations of people in clear need of protection have taken place, but much work is still needed to ensure that a substantial flow of several hundreds of relocations per month quickly follows,” said a Commission report handed out last night.","url":"https://www.breitbart.com/europe/2015/10/16/migrant-relocation-stunt-eu-funded-nearly-half-migrants-absconded/"}
