{"authors":["Chris Tomlinson"],"date_download":"2018-10-30 22:06:11","date_modify":"2018-10-30 22:06:11","date_publish":"2017-04-14 10:24:26","description":"Projections from Statistics Sweden indicate the population could rise by more than a million in 10 years due to migrants having children.","filename":"data/vaneerConsumption/MigrationandMigrantChildrentoBoostSwedenPopulationTo11MillionBy2026.json","image_url":"https://media.breitbart.com/media/2015/12/SWEDEN-EUROPE-MIGRANTS-train-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_04_14__1540937171.html","title":"Migration and Migrant Children to Boost Sweden Population To 11 Million By 2026","title_page":"Migration and Migrant Children to Boost Sweden Population To 11 Million By 2026","title_rss":"NULL","source_domain":"breitbart.com","text":"New projections from Statistics Sweden indicate the population could rise by more than a million within the next decade due to mass migration and migrants having many children.\nThe current population of Sweden has just recently passed the 10 million mark and according to new projections, the number will rise by another million within the next decade. Since 2014, the population has increased by over 100,000 people per year, mostly due to mass migration.\nIn 2015 alone, Sweden took in 163,000 asylum seekers. A recent report showed the already heavily migrant-populated southern city of Malmö had grown in the last year due solely to immigration.\nStatistics Sweden believes the trend of mass migration will slow down in the near future. Recent statements from Swedish Prime Minister Stefan Löfven, who said the previous open door policy to migrants would be over after the Stockholm terror attack last Friday, may support that analysis.\nThe agency claims that child births will contribute most of the new population growth in the coming years. “The level of childbearing is often high among people who have recently immigrated, in particular among those who have immigrated to start a family,” they note.\nLife expectancy will also presumably increase. “Among those born in 2017, 12 percent of the girls and just over seven percent of the boys are expected to be alive at the age of 100,” the report states.\nThe report notes that projections of future population growth or decline are difficult to predict because of incidents like the migrant crisis, adding there could also be an increase in the number of Swedes emigrating to different countries. In 2016, 43,000 Swedes or Swedish residents moved to a different country.\nIn much of Europe, the birth rates of natives of each country have declined to below replacement levels. The most dramatic case has been Germany where the birth rate is estimated to be 1.38 per woman according to the World Bank – well below the global replacement rate of 2.33 which would maintain the current population level.\nMany migrants coming to Sweden and elsewhere in Europe come from countries like Syria which has an estimated 3.0 birthrate, Iraq which has 4.6, and Afghanistan at 4.8 children per woman.\nThe current main migratory route into Europe through North Africa sees migrants from West African countries whose birth rates are even higher. In Nigeria, the rate is 5.7 children per woman and in countries like Niger, the birth rate is a massive 7.6 children per woman.\nFollow Chris Tomlinson on Twitter at @TomlinsonCJ or email at ctomlinson@breitbart.com","url":"https://www.breitbart.com/europe/2017/04/14/migration-migrant-children-boost-sweden-population-11-million-2026/"}
