{"authors":["Breitbart London"],"date_download":"2018-10-30 19:29:35","date_modify":"2018-10-30 19:29:35","date_publish":"2018-08-24 16:41:12","description":"ROME (AP) — Many of the 150 migrants stranded aboard a coast guard ship for a ninth day began a hunger strike Friday out of frustration that Italy won’t let them disembark in Sicily unless fellow European Union nations first pledge to take them, authorities said, in the latest standoff provoked by Italy’s anti-migrant interior minister. | London / Europe","filename":"data/vaneerConsumption/MigrantsAboardItalianCoastGuardShipBeginHungerStrike.json","image_url":"https://media.breitbart.com/media/2018/08/Screen-Shot-2018-08-24-at-17.38.33.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_08_24__1540927775.html","title":"Migrants Aboard Italian Coast Guard Ship Begin Hunger Strike","title_page":"Migrants Aboard Italian Coast Guard Ship Begin Hunger Strike | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"ROME (AP) — Many of the 150 migrants stranded aboard a coast guard ship for a ninth day began a hunger strike Friday out of frustration that Italy won’t let them disembark in Sicily unless fellow European Union nations first pledge to take them, authorities said, in the latest standoff provoked by Italy’s anti-migrant interior minister.\n“They can do whatever they believe,” Interior Minister Matteo Salvini tweeted, shrugging off the development that migrants were refusing meals aboard the Italian coast guard vessel Diciotti. The ship rescued them on Aug. 16 from a foundering human trafficker’s boat in the central Mediterranean, and for days now has been docked in the port of Catania, Sicily.\nAn opposition lawmaker, Sen. Davide Faraone said that on Friday Catania port officials told him “there’s tension” on the ship and that migrants have stopped eating.\nThirteen young children and ailing adults were evacuated from the Diciotti early in the drama. On Wednesday, 27 minors, all teenagers, were allowed to disembark in Catania. Salvini has been adamant that Italy’s populist government won’t allow any of the 150 adults still aboard the vessel disembark unless other EU nations commit to taking the asylum-seekers.\nAll but about 18 of those aboard are Eritrean; the others are from Somalia, Syria and Sudan. They have told authorities they suffered months and even years of inhumane treatment in detention in Libya, while waiting to leave that lawless country aboard smugglers’ boats.\nAnother opposition lawmaker who went aboard on Thursday expressed particular concern about 11 women, some as young as 19 or 20, still there.\nAppealing to Salvini, Laura Boldrini said: “As a father, they could be your daughter. At least let the young women off” the Diciotti.\nSky TG24 TV said some women aboard ate lunch Friday but the men refused the meal.\nBut Salvini was staying tough, as was fellow deputy premier, Luigi Di Maio, who heads the senior coalition partner, the euro-skeptic 5-Star Movement.\nDi Maio threatened that Italy could withhold some of its yearly 20 billion euro ($23 billion) contribution to the bloc if EU nations didn’t make good on promises earlier this year for more solidarity toward the Italians, who have seen more than 600,000 rescued migrants brought to Italian shores in recent years.\nIf the European Commission meeting doesn’t “decide anything about the Diciotti ship and the re-distribution of the migrants, I and all the 5-Star Movement are no longer willing to give 20 billion to the European Union,” Di Maio said.\nSimilar standoffs in recent weeks both involving rescue ships reaching Italy and Malta have been resolved when other EU members agreed to take some of the migrants.\nNearly 70 Per Cent of Italians Back Salvini’s Stand Against EU on Migrant Ferries https://t.co/gYDmsRmXNe — Breitbart London (@BreitbartLondon) June 17, 2018\nIn Brussels, EU Commission spokesman Alexander Winterstein retorted that “the European Union is a community of rules and it operates on the basis of rules, not threats.” He urged “all parties involved to work constructively together to find a swift solution.”\nA meeting in Brussels Friday of lower-officials from 12 countries, including Italy, was grappling with how to share the migrant burden among EU members. The meeting wasn’t called to deal with the Diciotti standoff, but was expected to discuss it.\nReferring to Di Maio’s threat, EU Parliament president Antonio Tajani lamented what he called “phrases smacking of propaganda” spouted by populist politicians.\nTajani told Sky TG24 in an interview that such standoffs over rescued migrants wouldn’t happen any more if EU countries, especially in Eastern Europe, had favored reform of the so-called Dublin arrangement, which requires migrants seeking EU asylum to apply for it in the country where they arrive.\nThe Italian foreign ministry said on Friday that a day earlier, Foreign Minister Enzo Moavero MIlanesi held a “courtesy meeting” with his Hungarian counterpart, who was in Rome on a private visit. During the meeting, the minister asked if the Hungarian government would be willing to take some of the migrants aboard the Diciotti but was rebuffed, the ministry statement said.\nSalvini has professed admiration in the past for Hungary’s tough stance on migrants.\nNear Catania’s dock, labor and human rights activists kept up a sit-in to protest Salvini’s refusal to let the migrants disembark.","url":"https://www.breitbart.com/europe/2018/08/24/migrants-aboard-italian-coast-guard-ship-begin-hunger-strike/"}
