{"authors":["Nick Hallett"],"date_download":"2018-10-30 21:17:57","date_modify":"2018-10-30 21:17:57","date_publish":"2015-09-07 12:01:13","description":"A Hungarian MEP has said that many of the migrants who have come to his country are little more than economic migrants.","filename":"data/vaneerConsumption/MigrantsRicherthanSomeHungariansSaysHungarianMEP.json","image_url":"https://media.breitbart.com/media/2015/09/GettyImages-4870981581.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_09_07__1540934277.html","title":"Migrants 'Richer than Some Hungarians’ Says Hungarian MEP","title_page":"Migrants 'Richer than Some Hungarians’ Says Hungarian MEP","title_rss":"NULL","source_domain":"breitbart.com","text":"A Hungarian MEP has said that many of the ‘refugees’ who have come to his country are little more than economic migrants and are even wealthier than some of the poorest people in Hungary.\nGyörgy Schöpflin, a member of the governing Fidesz party, told Sky News that some of refugees who swamped Budapest’s main railway station last week were not as desperate as media outlets had made them out to be.\n“When you’re looking at some of these refugees, they’re actually rather better off than some of the rather poorer people in Hungary.\n“They do have very sophisticated smart phones, designer clothes – they’re not the poorest of the poor.”\nSchöpflin, a Europhile and former Jean Monnet Professor of Politics at University College London, added: “Many of them are desperate of course, but some of them are only economic migrants and that’s a different situation. They have to be sorted out.”\nHe added that Hungary will accept “somewhere around 2,000” migrants permanently, but called on other EU nations to take action, and laid particular blame on Germany and Austria for causing the crowds after they insisted the migrants be processed.\nThe crowds continued to grow until Friday evening when, in a surprise move, the Hungarian government authorised buses to take thousands of migrants to the Austrian border where they disembarked and gathered in the small town of Nickelsdorf.\nThey then crowded into the town’s station while the Austrian government laid on two trains an hour to take them to Vienna.\nSome migrants even walked all the way from Budapest to the Austrian border after they grew tired of waiting and distrustful of the Hungarian authorities. Even when the buses arrived, some believed they may actually be taken to refugee camps instead of Austria.\nGermany and Austria have already pledged to take in as many migrants as possible with the head of Germany’s Federal Office from Migration and Refugees saying there was “no upward limit” on how many they could accept.","url":"https://www.breitbart.com/europe/2015/09/07/migrants-richer-than-some-hungarians-says-hungarian-mep/"}
