{"authors":["Vanessa Allen For The Daily Mail"],"date_download":"2018-10-23 03:25:41","date_modify":"2018-10-23 03:25:41","date_publish":"2016-01-29 18:18:17","description":"Families who fled Syria and Iraq with babies and toddlers handed over their savings to traffickers who promised them safe passage to Greece - and the EU.","filename":"data/vaneerConsumption/MigrantsdupedintopayingtraffickerssetupcamponTurkishCoast.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4BCC800000578-0-image-a-7_1454091481597.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423157_Abandoned-people-smugglers-Migrants-duped-paying-traffickers-Greece-set-camp-Turkish-Coast-crooks-run-money_1540265141.html","title":"Migrants duped into paying traffickers set up camp on Turkish Coast","title_page":"Migrants duped into paying traffickers set up camp on Turkish Coast | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hundreds of migrants have set up makeshift camps in a Turkish olive grove after they were cheated by people smugglers.\nFamilies who fled Syria and Iraq with babies and toddlers handed over their savings to traffickers who promised them safe passage to Greece - and the EU.\nBut when they reached the Turkish coast the smugglers tried to force them onboard a tiny, overcrowded boat at gunpoint to make the treacherous crossing.\nDuped: Families who fled Syria and Iraq handed their savings over to smugglers who promised safe passage\nWhole families were left stranded after traffickers tried to force them onto a tiny, overcorwded boat at gunpoint\nWhen the families refused to board the craft the traffickers abandoned them with nothing but the clothes they wore and the few scant belongings they had carried.\nMany were still wearing life jackets as they pondered their next move, while stranded hundreds of miles from home and with nowhere to go.\nThe perils of such crossings were highlighted yet again this week when the bodies of 25 migrants, including 10 children, were found off the coast of the Greek island of Samos after their crowded boat capsized.\nMore than 3,770 died making the crossing last year and 244 have been killed since the start of 2016, according to the International Organisation for Migration.\nThe families stranded in the olive groves near Kadirga in Turkey said the smugglers had shown them photographs of large boats and had promised them safe passage from Turkey to the Greek island of Lesbos.\nAround 400 people – the majority from Syria, Iraq and Afghanistan - gathered by roadsides or around makeshift camp fires.\nMany of the refugees were still wearing life jackets as they pondered their next move, while stranded in Turkey\nThe families stranded in the olive groves near Kadirga in Turkey said the smugglers had shown them photographs of large boats\nAuthorities in Turkey and Greece have warned they cannot cope with the huge numbers of refugees and other migrants seeking to flee war and poverty and make new lives in Europe.\nSome 1,500 people risk the Aegean Sea crossing every day, often in overcrowded boats or makeshift dinghies.\nIn response, Europe has drawn up plans for every migrant entering Greece to be returned to camps in Turkey, where EU countries would accept up to 250,000 documented asylum seekers a year.\nIf the resettlement programme is agreed, ferries will begin returning migrants – including refugees – from the Greek islands of Lesbos, Chios and Kos.\nBritain has rejected calls to allow 3,000 unaccompanied child refugees to come to Britain via Europe, but the Government has said it will take in such children from Syria and other war zones.\nIt has committed to taking a total of 20,000 refugees from Syria by 2020.","url":"https://www.dailymail.co.uk/news/article-3423157/Abandoned-people-smugglers-Migrants-duped-paying-traffickers-Greece-set-camp-Turkish-Coast-crooks-run-money.html"}
