{"authors":["John J. Xenakis"],"date_download":"2018-10-30 22:02:12","date_modify":"2018-10-30 22:02:12","date_publish":"2016-01-24 14:10:56","description":"Contents: Reader comments on xenophobic 'Soldiers of Odin' in Finland; European Union said to be collapsing over migrant crisis; Mideast borders set by Sykes-Picot and Balfour declaration under fire; The 2016 market meltdown raises fears of financial crisis |","filename":"data/vaneerConsumption/MigrationCrisisSignalsHistoricShiftsinEuropeandMideast.json","image_url":"https://media.breitbart.com/media/2015/12/Slovenia-Austria-migrants-Getty.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_01_24__1540936932.html","title":"Migration Crisis Signals Historic Shifts in Europe and Mideast","title_page":"Migration Crisis Signals Historic Shifts in Europe and Mideast","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nReader comments on xenophobic ‘Soldiers of Odin’ in Finland\nEuropean Union said to be collapsing over migrant crisis\nMideast borders set by Sykes-Picot and Balfour declaration under fire\nThe 2016 market meltdown raises fears of financial crisis\nReader comments on xenophobic ‘Soldiers of Odin’ in Finland\nThe 1916 Sykes-Picot agreement split the Mideast between Britain and France (Jewish Virtual Library)\nMy recent article “Clown protesters mock Finland’s xenophobic ‘Soldiers of Odin'” described a vigilante group in Finland confronting migrants, harassing them and sometimes threatening them with violence.\nThis article drew some reader criticisms:\nWhy am I classed as xenophobic in the derogatory sense when what I want is: 1. Preservation of my Judeo/Christian heritage and its attendant culture 2. Primacy of the English language in this country 3. Not to have crowding so as to packed in as an overpopulated 4th world dung heap – shades of “1984” 4. While I have sympathy for the refugees I will become one with them if they all come “here”. No country afford to pay for, settle and provide jobs for all who wish to enter. Every single picture I have seen of the countries of the refugees there is a dichotomy; the small population of the very rich, a middle class on the economic edge and vast majority in poverty. I do not want to see that as the future in this country and I am sure the xenophobic Europeans (my ancestors) do not want it either.”\n“Blaming the West is not the right answer. They’ve been fighting amongst themselves for centuries, and they all believe their way of worship to be closer to allah then all the others. The Shiite, Sunni, and the rest are unable to get along, and if you took the West out of it, you’d see just as much destruction. Muslims have been blaming everyone but themselves and always will. They are always the victims even though their acts are barbaric. Stoning women, beating and raping they feel justified in doing.”\n“The Soldiers of Odin may be the only protection women have from the invaders.\nThe first problem with xenophobia is that it is un-American.\nThe problem with vigilantes is that they do no good. A few vigilantes in Finland are not going to do anything to stop the flood of migrants and refugees coming into Europe. It is like trying to stop a tsunami with a teaspoon.\nAnother problem is that it makes things worse. Vigilantes will have no effect at all on the supposed objective of “protecting women,” but what it will do is aggravate people, create further hostility, and energize jihadists.\nWhat you have to accept, Dear Reader, is that there are historic changes going on, and that they can’t be stopped. Today’s World View article is about those historic changes, with the migration crisis challenging the borders of the European Union and the Mideast, while at the same time the global economy is facing a crisis.\nFrom the point of view of Generational Dynamics, this is a generational Crisis era, where the rules of diplomacy and mediation from the 1990s no longer apply. Treasure the time you have left, and use it to prepare yourself, your family, your community and your nation. How you do that is up to the individual, but being a vigilante will not accomplish it.\nEuropean Union said to be collapsing over migrant crisis\nMore than one million migrants and refugees came to Europe in 2015, mostly entering through Greece and Italy.\nRemarkably, some 35,000 more arrived during the first three weeks of 2016. It had been thought that the winter weather would slow the flow to a trickle, but it has not. That is almost 12,000 per week. That suggests that there could be millions more migrants and refugees arriving in 2016.\nAlready, the European Union’s prized open-border Schengen Agreement, appears to be crumbling. Several east European countries have put up fences, and other countries have closed all their borders, instituting border controls.\nAccording to far left billionaire George Soros, the European Union is on the verge of collapse:\nThere is plenty to be nervous about. As she (Merkel) correctly predicted, the EU is on the verge of collapse. The Greek crisis taught the European authorities the art of muddling through one crisis after another. This practice is popularly known as kicking the can down the road, although it would be more accurate to describe it as kicking a ball uphill so that it keeps rolling back down. Merkel correctly foresaw the potential of the migration crisis to destroy the European Union. What was a prediction has become the reality. The European Union badly needs fixing. This is a fact but it is not irreversible. And the people who can stop Merkel’s dire prediction from coming true are actually the German people. Now it’s time for Germans to decide: Do they want to accept the responsibilities and the liabilities involved in being the dominant power in Europe?\nFrench officials believe that France has been particularly affected by the migrant crisis since the November 13 attacks in which 130 people were killed by gunmen in a series of coordinated attacks across Paris. It later emerged that the gunmen had arrived in Europe with the flood of migrants entering Greece.\nFollowing the attacks, France instituted a state of emergency, allowing the police the power to raid homes without warrants and to impose house arrests without first seeking judicial oversight.\nFrance’s prime minister Manuel Valls said that it would be in effect until ISIS is defeated:\n[France will be] using all means in our democracy under the rule of law to protect the French people. As long as the threat is there, we must use all available means. [The state of emergency should stay in place] until we can get rid of Daesh. In Africa, in the Middle East, in Asia, we must eradicate – eliminate – Daesh. It is a total and global war that we are facing with terrorism. The war we are conducting must also be total, global and ruthless.\nThe European Commission President Jean-Claude Jüncker warns dismantling the Schengen zone and imposing new border controls would cost £2.3bn a year in lost business. The European Council President Donald Tusk says unless the EU makes progress in the next two months, Schengen could fail. CNBC and France24 and Independent (London)\nMideast borders set by Sykes-Picot and Balfour declaration under fire\nThis year is the 100th anniversary of the Sykes-Picot agreement, named after Frenchman Francois Georges-Picot and Briton Mark Sykes, signed by Britain, France and Tsarist Russia in May 1916. The agreement was originally kept secret because it was a betrayal of promises made to Arabs, but it was revealed in 1917 when the Bolshevik Revolution occurred in Russia. This was followed by the Balfour Declaration in 1917, promising the establishment of a Jewish state in Palestine.\nThe borders set by Sykes-Picot/Balfour have remained largely intact, with few exceptions. There was the independence of Sudan from Egypt, and then the secession of South Sudan. North and South Yemen were unified, as were the United Arab Emirates (UAE). There were also changes to the Palestinian territories and Palestine, related to the establishment of Israel.\nBut there are many Arabs, especially Palestinians, who blame Sykes-Picot/Balfour as the source of all their misery. The so-called Islamic State (IS or ISIS or ISIL or Daesh) has specifically said that Sykes-Picot is dead, but other nationalist Arab groups are calling for its abolition, mostly for local political reasons. The Kurds have been leading the calls for an end to Sykes-Picot, and the creation of a Kurdistan state.\nAccording to Oxford University historian Eugene Rogan, “The wartime partition agreements left a legacy of imperialism, of Arab mistrust in great power politics, and of a belief in conspiracies (for what are secret partition agreements if not conspiracies?) that the Arab peoples have held responsible for their misfortunes ever since.”\nThe rise of ISIS, fueled by sectarian violence led by Syria’s Bashar al-Assad, Russia’s Vladimir Putin, and Iran’s Seyed Ali Khamenei, have caused massive migrations of millions of people that are challenging the existing borders in the Mideast. Generational Dynamics predicts a major Mideast war between Sunnis and Shias, Israelis and Arabs, and among different ethnic groups. At the end of that war, there will be a major international conference that will set the new boundaries in the Mideast, as dictated by the winners, and that will certainly be the end of the Sykes-Picot agreement. Middle East Monitor and Atlantic Sentinel and Foreign Policy Journal and Jewish Virtual Library\nThe 2016 market meltdown raises fears of financial crisis\nThe first three weeks of 2016 have been the worst start of the year in market history. There were two emergency market shutdowns in China within the first four trading days of 2016. The Dow Jones Industrial Average has never lost this many points within the first three weeks. Trucking freight in the U.S. is in steep decline. Jobless claims are beginning to surge again.\nAccording to financial analyst Doug Noland:\nThe world has changed significantly – perhaps profoundly – over recent weeks. The Shanghai Composite has dropped 17.4% over the past month (Shenzhen down 21%). Hong Kong’s Hang Seng Index was down 8.2% over the past month, with Hang Seng Financials sinking 11.9%. WTI crude is down 26% since December 15th. Over this period, the GSCI Commodities Index sank 12.2%. The Mexican peso has declined almost 7% in a month, the Russian ruble 10% and the South African rand 12%. A Friday headline from the Financial Times: “Emerging market stocks retreat to lowest since 09.” Recent weeks point to decisive cracks at the “Core” of the U.S. financial Bubble. The S&P500 has been hit with an 8.0% two-week decline. Notably, favored stocks and sectors have performed poorly. Indicative of rapidly deteriorating economic prospects, the Dow Transports were down 10.9% to begin 2016. The banks (KBW) sank 12.9%, with the broker/dealers (XBD) down 14.1% y-t-d. The Nasdaq100 (NDX) fell 10%. The Biotechs were down 16.0% in two weeks. The small cap Russell 2000 was hit 11.3%. Bubbles tend to be varied and complex. In their most basic form, I define a Bubble as a self-reinforcing but inevitably unsustainable inflation. This inflation can be in a wide range of price levels – securities and asset prices, incomes, spending, corporate profits, investment and speculation. Such inflations are always fueled by some type of underlying monetary expansion – typically monetary disorder. Bubbles are always and everywhere a Credit phenomenon, although the underlying source of monetary fuel often goes largely unrecognized. … [In the ‘Periphery’:] At $275 billion, Chinese Credit growth surged in December to the strongest pace since June. While growth in new bank loans slowed (15% below estimates), equity and bond issuance jumped. China’s total social financing expanded an enormous $2.2 TN in 2015, down slightly from booming 2014. Such rampant Credit growth was (barely) sufficient to sustain China’s economic expansion. At the same time, I would argue that Chinese stocks, global commodities and developing securities markets in particular have been under intense pressure due to rapidly waning confidence in the sustainability of China’s Credit Bubble. A similar dynamic is now unfolding in U.S. and other “Core” equities markets: Sustainability in the (U.S. and global) Credit Bubble – the monetary fuel underpinning the boom – is suddenly in doubt. The bulls, Fed officials and most others see the economy as basically sound, similar to how most conventional analysts argued about the Chinese economy over the past year. Inherent fragility and unsustainability are the key issues now driving securities markets – in China, in the U.S, and globally. And, importantly, sentiment has shifted to the view that policy tools have been largely depleted.\nAs I have written many times (see “28-Aug-15 World View — Explanation of Price/Earnings ratio and Stock Valuations”), Wall Street stocks are in an enormous bubble, with the S&P 500 Price/Earnings ratio at an astronomical 22, far above the historical average of 14. Generational Dynamics predicts a financial panic and crisis, with the Dow falling to below 3000. ETF Daily News and Alt-Market.com and Credit Bubble Bulletin\nKEYS: Generational Dynamics, Finland, Soldiers of Odin, European Union, Schengen Agreement, George Soros, France, Manuel Valls, Jean-Claude Jüncker, Donald Tusk, Sykes-Picot Agreement, Balfour Declaration, Francois Georges-Picot, Mark Sykes, Yemen, United Arab Emirates, UAE, Palestine, Israel, Islamic State / of Iraq and Syria/Sham/the Levant, IS, ISIS, ISIL, Daesh, Eugene Rogan, Syria, Bashar al-Assad, Russia, Vladimir Putin, Iran, Seyed Ali Khamenei, Doug Noland\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2016/01/24/24-jan-16-world-view-migration-crisis-signals-historic-shifts-in-europe-and-mideast/"}
