{"authors":["Will Martin"],"date_download":"2018-10-31 00:31:31","date_modify":"2018-10-31 00:31:31","date_publish":"2016-12-01 00:00:00","description":"The ONS dropped its new statistics on immigration into the United Kingdom on Thursday.","filename":"data/vaneerConsumption/MigrationintotheUKhitnearrecordlevelsjustbeforetheBrexitvote.json","image_url":"https://amp.businessinsider.com/images/583ff18bdd08953e448b458e-960-480.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_office-for-national-statistics-official-migration-statistics-for-2016-2016-12_1540945891.html","title":"Migration into the UK hit near-record levels just before the Brexit vote","title_page":"    Office for National Statistics official migration statistics for 2016: EU migrants - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Somewhat dejected United Kingdom fans watch Ell and Nikki from Azerbaijan perform after the pair won the Eurovision Song Contest 2011 on May 14, 2011 in Dusseldorf, Germany. (Photo by Sean Gallup/Getty Images) Immigration into the UK hit record levels just before Britain voted to leave the European Union, according to data from the Office for National Statistics.\n650,000 thousand people came to the UK in the 12 months up to the end of June 2016, with a \"historically high\" number of European Union citizens coming into the country prior to the Brexit vote.\n284,000 EU citizens immigrated to the UK over the course of the year, something that the ONS says is the \"highest estimate recorded.\"\nThe number of people immigrating into Britain from outside the EU was 289,000.\nWhile a record number of people immigrated into the UK in the year, it was actually only a small increase from 2015's data. Just 11,000 more people entered the country than in the previous year.\nA big driver of the record immigration into the country from the European Union was an increased number of Bulgarian and Romanian citizens moving to Britain, the majority of whom move to Britain for work.\nCommenting on the new figures, Nicola White, the ONS' head of international migration statistics said:\n\"Net migration remains around record levels, but it is stable compared with recent years. Immigration levels are now among the highest estimates recorded - the inflow of EU citizens is also at historically high levels and similar to the inflow of non-EU citizens; there were also increases in the number of asylum seekers and refugees.\n\"These long-term international migration figures run to the end of June, so it is too early to say what effect, if any, the EU Referendum has had on long-term international migration. There does not however appear to have been any significant impact during the run-up to the vote.\"\nAnd here is the ONS' chart:\nOffice for National Statistics\nImmigration has been a hot-button topic in the UK, particularly since the Brexit vote. Numerous polls have shown that people voting for Brexit saw Britain's ability to place greater controls on who comes into the UK as the most important issue in the vote. Once recent poll found that 70% of people want any Brexit deal to include controls on immigration from the EU.","url":"https://www.businessinsider.com/office-for-national-statistics-official-migration-statistics-for-2016-2016-12"}
