{"authors":["Allan Hall In Berlin For Mailonline"],"date_download":"2018-10-23 00:10:57","date_modify":"2018-10-23 00:10:57","date_publish":"2017-03-16 09:10:24","description":"Hussein Khavari, from Afghanistan, who is accused of killing Maria Ladenburger, 19, in Freiburg, Germany, tried to strangle himself in a maximum security prison, according to authorities.","filename":"data/vaneerConsumption/Migrantheldoverwomansdeathattemptssuicideinjail.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/08/3E52994600000578-0-image-a-62_1489654555624.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319366_Migrant-held-woman-s-death-attempts-suicide-jail_1540253457.html","title":"Migrant held over woman's death attempts suicide in jail","title_page":"Migrant held over woman's death attempts suicide in jail | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An asylum seeker who lied to authorities that he was a child before 'raping and murdering an EU official's daughter' in Germany has attempted suicide in prison, it has emerged today.\nHussein Khavari, from Afghanistan, tried to strangle himself in the maximum security Hohenasperg Prison over the Christmas period, according to authorities.\nKhavari, accused of killing 19-year-old Maria Ladenburger in Freiburg, Germany, was discovered by a guard and taken to the hospital wing and is now under 24 hour observation at the jail.\nHussein Khavari (pictured), from Afghanistan, who is accused of killing Maria Ladenburger, 19, in Freiburg, Germany, tried to strangle himself in a maximum security prison, according to authorities.\nKhavari, accused of killing 19-year-old Maria Ladenburger (pictured) in Freiburg, Germany, was discovered by a guard and taken to the hospital wing and is now under 24 hour observation at the jail\nThe asylum seeker came to Germany in November 2015 having fled Greece where he had been jailed for trying to murder a young girl by throwing her off a cliff.\nHe says he is 17 but authorities believe him to be at least 22. Khavari stands accused of raping and drowning Maria - whose father is a legal adviser to the European Commission in Brussels - in October last year. His DNA was found at the crime scene.\nMaria worked as a helper in asylum homes in Freiburg. Police say Khavari pounced on her as she cycled home after a party in October, raped her and then drowned her in a river.\nHer killing sparked frenzied new waves of hatred and fear of refugees. Even the boss of the country's police union said her death would have been prevented had the open door asylum-seeker policy of Chancellor Angela Merkel been less lax than it is.\nKhavari stands accused of raping and drowning Maria (pictured) - whose father is a legal adviser to the European Commission in Brussels - in October last year. His DNA was found at the crime scene\nKhavari was born in Ghazni in Afghanistan and came to Germany as an illegal unaccompanied minor.\nIn numerous posts on the Internet he liked to present himself in the guise of a gangsta rapper: hair slicked back with gel, jogging pants and training shoes.\nOn Facebook, before the killing of Maria on October 16, he wore his hair long but it was cut back after the crime.\nA single strand of it was found at the crime scene but he left other traces of his DNA behind too.\nAnother disturbing photo he posted on his Facebook page in June shows a wolfman clutching a young maiden in his arms.","url":"https://www.dailymail.co.uk/news/article-4319366/Migrant-held-woman-s-death-attempts-suicide-jail.html"}
