{"authors":["Sue Reid For The Daily Mail"],"date_download":"2018-10-22 20:14:37","date_modify":"2018-10-22 20:14:37","date_publish":"2016-01-29 00:45:50","description":"The word has spread about how easy it is to be accepted as a child migrant in Sweden, which has become overwhelmed with ‘unaccompanied minors’ in what critics suspect is a huge fraud.","filename":"data/vaneerConsumption/Migrantchildrenpicturesthatshedlightongrowingscandalamidasylumcrisis.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/00/30AD76D100000578-0-image-a-39_1454028184079.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422000_Just-old-think-migrant-children-Alarming-pictures-shed-light-growing-scandal-amid-asylum-crisis_1540239277.html","title":"Migrant 'children' pictures that shed light on growing scandal amid asylum crisis","title_page":"Migrant 'children' pictures that shed light on growing scandal amid asylum crisis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Examine the ‘children’ in these pictures.\nOne is of Saad Alsaud, reported to have been the fastest 14-year-old in Sweden, dwarfing younger schoolboys and girls as they join him for a run.\nHe looks old enough to be the father of the children he is jogging with.\nThe other shows a Somalian named Youssaf Khaliif Nuur who claims he is 15 though he is 6ft tall and, according to one unconfirmed source, shaves his beard and moustache.\nHe appeared in a Swedish court yesterday accused of stabbing a woman to death at a young migrants’ hostel on Monday.\nThe extraordinary pictures of the two men, one Somalian and the other from Iraq, were published in the Swedish press to show how enthusiastically this politically correct nation welcomes in orphaned young migrants.\nClaimed to be 14: Saad Alsaud is reported to have been the fastest 14-year-old in Sweden, dwarfing younger boys and girls in a running event\nBut in the years that followed, the word has spread across Europe about how easy it is to be accepted as a child migrant in Sweden.\nNow, the country has become overwhelmed with ‘unaccompanied minors’ in what critics suspect is a huge fraud.\nOf course, it is hard not to have sympathy for children or young teenagers who find themselves alone among the great migrant trek across Europe. But it is another matter for those who are older to tell cynical lies in order the take advantage of an ultra-liberal system.\nChild migrants, unlike adult arrivals, are fast-tracked through the asylum process, and receive immediate housing and cash hand-outs of £160 a month.\nThree-quarters win permission to settle, at which point they can bring in relatives from their home countries.\nUnder Swedish human rights rules, migrants are not physically vetted so their age cannot be accurately assessed (even by measuring the size of their wrists or whether they have wisdom teeth), because such procedures are deemed intrusive, unfair and unreliable.\nThe growing scandal over bogus ‘child’ migrants was highlighted this week with the murder of 22-year-old aid worker Alexandra Mezher at a Swedish refugee hostel for children in Gothenburg, where her mother says residents lie about their age to get preferential asylum treatment.\nShe was stabbed after trying to break up a fight between two youths.\nYoussaf Khaliif Nuur has been charged with her killing. When he arrived in court this week, the Somalian was said to tower over his translator.\nClaimed to be 15: Youssaf Khaliif Nuur who claims he is 15 though he is 6ft tall and, according to one unconfirmed source, shaves his beard and moustache\nFor her part, psychology graduate Miss Mezher had warned her mother that she was caring for ‘big powerful guys’ aged up to 24, in a shelter designed for children aged 14 to 17.\nThe Swedish experience would seem to lend support to the stance of David Cameron this week, who has rejected calls to throw open Britain’s doors to migrant children arriving alone in Europe.\nThe Prime Minister has promised to ‘resettle’ genuine orphans from Middle East refugee camps and some stranded in Greece and Italy.\nKent County Council, being closest to the Channel, already receives vast numbers of child migrants, many smuggled by traffickers into the UK from the squalid French coast camps at Calais and Dunkirk.\nLast year, as the migration crisis blew up, the numbers of children arriving in the Garden of England surged. By September, it was responsible for 720 under-18s, three times as many as the same time a year earlier, and now Kent has appealed to other councils for housing help.\nThe scale of the crisis over how to treat both migrant children, and those who claim they are children, was revealed last autumn in Sweden when more than 8,000 — mainly from Syria, Afghanistan, Somalia and Iraq — arrived in one week: 1,716 said they were under 18 and thus ‘unaccompanied minors’.\nKilled: Miss Mezher (left and right), 22, described as an 'angel' by her mother (left), was fatally stabbed in the back and thigh at the asylum centre for young, unaccompanied migrants in Molndal, Sweden, on Monday morning\nIn the 12 months to the end of last year, the total of so-called minors had reached 33,250, many speaking only a smattering of English and almost none with a word of Swedish.\nOne social commentator named Merit Wager — an author and columnist on one of Sweden’s daily newspapers — claimed on her online blog in November that administrators at the immigration service had been ordered to ‘accept the claim that an applicant is a child if he does not look as if he is over 40’.\nAnd in a leaked interview to a Right-leaning Scandinavian newspaper, Dispatch International, a supervisor in a migrants’ hostel had this to say: ‘Many of us are under state orders to keep quiet if we think someone is lying on their asylum application. But, the supervisors here talk to each other about the fact that many of the “children” are in fact adults.’\nThe crisis has escalated because migrants arriving in Europe throw away their identity papers so they can avoid EU rules which say that if their asylum claim fails they must be returned to the country where they first registered in the EU.\nThis leaves the politically correct Swedes having to accept the word of ‘child migrants’, because they cannot prove their age claims one way or the other.\nArgument: Miss Mezher was working at a shelter for unaccompanied child refugees (pictured)\nStruggling to find beds for the new arrivals, the mayor of Vimmerby, in south-east Sweden, promised to house them in spare rooms in old people’s homes.\nThis policy, announced last October, was hurriedly reversed ten days ago. Mayor Tomas Peterson said it had been discovered the migrants were not children at all, but ‘men in their late teens’.\nThey had, the mayor said, caused ‘serious incidents’ by abusing the old people, throwing furniture and computers out of windows, playing loud music late at night, and showing no respect for the elderly.\nA year ago, Swedish television reported that an Afghan claiming to be aged 15 had beaten and threatened staff and other residents at a home for young migrants.\nHe choked a 14-year-old, pushing his face into a bowl of ice cream and tried to molest female migrants at the same home, scaring some so much that they ran away.\nHe, of course, is apparently the same age as the Somalian accused of stabbing a woman to death in a migrant hostel this week.\nThe spate of disturbing incidents has forced Swedish politicians to think again about age testing, although no decision is expected for six months.\nOver in neighbouring Norway, a more robust system of checking migrants’ ages is now in place.\nDental examinations — which are reliable indicators of the biological maturity of growing children — revealed nine out of ten ‘underage’ migrants were lying, and turned out to be older than 18.\nMeanwhile, the ace sprinter Saad Alsaud is happily settled in the southern Swedish city of Kristianstad.\nOn his Facebook page, he boasts of his sporting triumphs and gives his birth date as June 1996 — meaning that he is now, apparently, 19 and would have been 14 when that picture was taken.\nBut in overwhelmed Sweden, there is no way of proving, one way or the other, if he is telling the truth.","url":"https://www.dailymail.co.uk/news/article-3422000/Just-old-think-migrant-children-Alarming-pictures-shed-light-growing-scandal-amid-asylum-crisis.html"}
