{"authors":["Julian Robinson For Mailonline"],"date_download":"2018-10-23 01:18:43","date_modify":"2018-10-23 01:18:43","date_publish":"2016-01-11 12:09:21","description":"The body of a woman in her 30s was recovered from the rocks near Capo di Leuca in Puglia, Italy this morning, coastguards have revealed.","filename":"data/vaneerConsumption/Migrantwomandrownsand5missingafterhumantraffickersthrowthemoffboat.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300B485C00000578-0-image-a-61_1452524578190.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393790_One-dead-5-missing-migrant-boat-Italy-coastguard_1540257523.html","title":"Migrant woman drowns and 5 missing after human traffickers throw them off boat","title_page":"Migrant woman drowns and 5 missing after human traffickers throw them off boat | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A migrant has drowned and five more are missing after people smugglers threw them into the sea off the coast of southern Italy.\nThe body of a woman in her 30s was recovered from the rocks near Capo di Leuca in Puglia, this morning, Italian coastguards have revealed.\nAnother 37 Somalis who were on board either made it to shore safely or were scooped out of the water alive by rescuers.\nDiscovery: The body of a woman in her 30s was recovered from the rocks near Capo di Leuca in Puglia, this morning\nCoastguards say the dead woman and the five missing migrants were all thrown into the water by human traffickers from the wooden boat they were on.\nThe smugglers who had accompanied the migrants in the vessel from Greece then escaped on a second boat, officials said.\nThe 37 survivors are all Somalis and include 35 women and two males, one of them a 10-year-old boy.\nCoastguards say the dead woman and the five missing migrants were all thrown into the water by human traffickers from the wooden boat they were on\nThe 37 survivors are all Somalis and include 35 women and two males, one of them a 10-year-old boy\nThe child was among five people hospitalised for hypothermia, the coastguard said.\nLast year nearly 3,800 migrants died in attempts to enter the European Union by sea. More than one million people made the sea journey successfully.","url":"https://www.dailymail.co.uk/news/article-3393790/One-dead-5-missing-migrant-boat-Italy-coastguard.html"}
