{"authors":["John J. Xenakis"],"date_download":"2018-10-30 21:54:32","date_modify":"2018-10-30 21:54:32","date_publish":"2016-07-25 13:14:58","description":"Contents: Migrants trapped in Serbia march toward border with Hungary; The refugee problem continues, despite EU-Turkey deal | National Security","filename":"data/vaneerConsumption/MigrantsTrappedinSerbiaMarchTowardBorderwithHungary.json","image_url":"https://media.breitbart.com/media/2016/07/wi/ap_ap-photo-1329-e1469452492590.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_07_25__1540936472.html","title":"Migrants Trapped in Serbia March Toward Border with Hungary","title_page":"Migrants Trapped in Serbia March Toward Border with Hungary","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nMigrants trapped in Serbia march toward border with Hungary\nThe refugee problem continues, despite EU-Turkey deal\nMigrants trapped in Serbia march toward border with Hungary\nLast year’s Balkan Route: Migrants arrive from Turkey to Greece, through Macedonia and Serbia, then through Hungary or Croatia.\nLast year, hundreds of thousands of refugees, mostly from the war-torn countries of Syria, Iraq and Afghanistan, poured into Europe along the so-called “Balkan route.” The migrants reached Turkey, then crossed the Aegean Sea to reach Greece and travel to the border with Macedonia. They would cross Macedonia, then travel through Hungary and Austria to reach Germany. In June of last year, Hungary announced that it would build a razor-wire fence on the Hungary-Serbia border, which they did in September. Then the refugees tried to travel from Serbia into Croatia, and from there back into Hungary or into Slovenia, and on to Austria and Germany. But those borders were closed too. ( “20-Oct-15 World View — As winter approaches, thousands of European refugees may be trapped in the cold”.) In March of this year, the entire “Balkan Route” was permanently closed.\nToday, there are still about 3,000 refugees trapped in Serbia, living either near the Hungary border, or in the capital city Belgrade. They could apply for asylum in Serbia, but many don’t want to do that, because they really want to go to Germany and apply for asylum there.\nOn Friday, hundreds of refugees marched through Belgrade, launching a hunger strike to demand passage to western Europe. In this context, the “hunger strike” meant that they left untouched free food provided by aid groups. They carried placards reading also stage a sitting protest in Belgrade holding placards that read “Open the border,” “We are responsible global citizens,” “No to violence,” “Stop wars if you want to stop refugees” and “Prove that humanity is still alive.”\nAfter the hunger strike, they began marching toward the border with Hungary. By Sunday, about 300 young men (no women or children) were nearing the border, alongside a “friendly” Serbian police escort. The plan is to demand that Hungary open the border, and demand that is unlikely to be met. There may be a confrontation on Monday. InSerbia and AFP and AP\nThe refugee problem continues, despite EU-Turkey deal\nThe EU-Turkey refugee deal has reduced the flow of refugees from Turkey into Europe, but has not eliminated it entirely. More than 650,000 people passed through Serbia last year. So far in 2016, more than 100,000 migrants have passed through Serbia, many of them being guided by human traffickers whom they’ve paid. And 57,000 refugees are trapped in Greece, many of them still hoping to reach Germany.\nMany European officials are thankful that the recent coup attempt in Turkey failed, because if it had succeeded, then the new government might not have honored the refugee deal. But even so, there are two major factors that could still cause the entire refugee deal to unravel.\nThe EU committed to removing visa restrictions on EU travel by Turkish citizens. June 30 was the deadline set by Turkey for the European Union to lift visa restrictions on Turkey, so that any of Turkey’s 72 million citizens can travel freely around Europe’s Schengen zone. Surprisingly, we have not really heard anything about this plan since early May, and Turkey may have decided to drop the subject after there was so much opposition from some EU officials, because of Turkish human rights violations.\nSince the failed coup, Turkey’s president Recep Tayyip Erdogan has indicated that Turkey may reinstate the death penalty. Turkey abolished the death penalty in 2004 as one of the reforms that had been demanded by the European Union before Turkey would be allowed to join the EU. If the death penalty is reinstated, then there will be no chance that the EU will ease visa restrictions. There’s probably no chance anyway.\nThe other major issue that could unravel the refugee deal is that Brussels ruled last September that some 160,000 refugees would be distributed among the 28 EU member states. However, Slovakia, the Czech Republic, Poland and Hungary have said that they will not agree to accept any refugees. These feelings have hardened even further as the result of recent terror attacks in Europe.\nEven ignoring these two issues, Erdogan has fired almost 60,000 people at all levels of government in Turkey. ( “22-Jul-16 World View — Turkey’s Erdogan gives himself dictatorial powers, moving Turkey away from the West”) With Turkey’s government in chaos, they may simply lose control of the refugee situation, allowing a new surge of refugees into Europe. Reuters and Al-Jazeera and Daily Mail (London) and Irish Times\nKEYS: Generational Dynamics, Europe, Balkan Route, Greece, Macedonia, Serbia, Hungary, Croatia, Slovenia, Austria, Germany, Turkey, Recep Tayyip Erdogan\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2016/07/25/25-jul-16-world-view-migrants-trapped-serbia-march-toward-border-hungary/"}
