{"authors":["Virginia Hale"],"date_download":"2018-10-30 18:37:43","date_modify":"2018-10-30 18:37:43","date_publish":"2017-01-25 18:55:43","description":"Migrants allowed to stay in Switzerland on the basis that they risk death in their homelands are using welfare to fund holidays back home","filename":"data/vaneerConsumption/MigrantsWhoFledWarUseWelfaretoHolidayinHomelands.json","image_url":"https://media.breitbart.com/media/2017/01/SWITZERLAND-ERITREA-IMMIGRATION-REFUGEE-ASYLUM-RELIGION-CHURCH.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_01_25__1540924663.html","title":"Migrants Who 'Fled War' Use Welfare to Holiday in Homelands","title_page":"Migrants Who 'Fled War' Use Welfare to Holiday in Homelands","title_rss":"NULL","source_domain":"breitbart.com","text":"Migrants granted leave to remain in Switzerland on the basis that they risk death in their homelands are using welfare money to fund holidays back home, the Basler Zeitung reports.\nThe Swiss newspaper notes that thousands of migrants each year are heading to Eritrea for their holidays each year despite their having supposedly fled the northeast African nation in fear of their lives.\nAlthough a large proportion of Eritreans in Switzerland have been refused asylum, authorities are powerless to deport them because their homelands are deemed to be too dangerous by the country’s refugee policy.\nWhile there are no direct flights to Eritrea, the Basler Zeitung says it found that up to fifty people a day are leaving Switzerland in order to holiday in the African country.\nIt typically costs around 599 Swiss Francs (£475) in January or 650 Swiss Francs (£516) in high season for a return journey to Eritrea according to the German language daily, which notes that taxpayer stipends to migrants must be quite generous as the vast majority of Eritreans residing in Switzerland live on welfare.\nStating it to be unlikely that more than a small handful of migrants would “abuse the asylum system”, the Swiss Secretariat for Migration (SEM) told the Basler Zeitung that it’s difficult to work out the number of Eritreans who are taking holidays in their country of origin due to the lack of direct flights.\nOf the nearly 50,000 applications to travel abroad filed by refugees, asylum seekers and people in Switzerland who have temporary residence permits between 2010 and 2014, 97.5 per cent were successful.\nNoting that around 15,0000 of these passes were granted to Eritreans, the Basler Zeitung asks whether the sheer volume of migrants venturing back to the northeast African country suggests it is really “a mere matter of individual cases”, or whether it implies the situation is a “mass occurring phenomenon”.\nIn September Breitbart London reported that migrants granted asylum in Germany have been using welfare payments to holiday in the countries they fled, again supposedly in fear of their lives.","url":"https://www.breitbart.com/europe/2017/01/25/migrants-welfare-holiday-homelands/"}
