{"authors":["Lauren Holter"],"date_download":"2018-10-31 01:50:45","date_modify":"2018-10-31 01:50:45","date_publish":"2018-09-06 11:40:06","description":"An anonymous op-ed published on Wednesday that claimed to be from someone within the Trump administration set the internet ablaze. In an attempt to quiet at least one rumor, Vice President Mike Pence denied being the New York Times op-ed writer…","filename":"data/vaneerConsumption/MikePenceDeniesWritingTheNewYorkTimesOpEdThroughAStaffersShamingTweet.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/40226e9d-7684-443b-9e69-7e9d7e3bc8d5-getty-1027172268.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_mike-pence-denies-writing-the-new-york-times-op-ed-through-a-staffers-shaming-tweet-11771165_1540950645.html","title":"Mike Pence Denies Writing The 'New York Times' Op-Ed Through A Staffer's Shaming Tweet","title_page":"Mike Pence Denies Writing The 'New York Times' Op-Ed Through A Staffer's Shaming Tweet","title_rss":"NULL","source_domain":"bustle.com","text":"An anonymous op-ed published on Wednesday that claimed to be from someone within the Trump administration set the internet ablaze. In an attempt to quiet at least one rumor, Vice President Mike Pence denied being the New York Times op-ed writer Thursday morning.\n\"The Vice President puts his name on his Op-Eds,\" Jarrod Agen, Pence's chief deputy of staff and communications director, tweeted. \"The @nytimes should be ashamed and so should the person who wrote the false, illogical, and gutless op-ed. Our office is above such amateur acts.\"\nAgen's post followed numerous tweets from people pointing to the VP as the potential author of the op-ed entitled \"I Am Part of the Resistance Inside the Trump Administration\" — largely because of one word included in the article. Dan Bloom, a senior producer at Panoply Media, fixated on the anonymous author referring to the late Sen. John McCain as \"a lodestar for restoring honor to public life and our national dialogue.\" Bloom listed in a tweet thread the previous times Pence has used the word \"lodestar,\" which included a speech he gave at the United Nations last year.\nNevertheless, Pence's top aide vehemently denies that his office had anything to do with the story.\nIt wasn't just the public trying to uncover who wrote the scathing op-ed that claimed President Donald Trump has \"misguided impulses\" and a problem with \"amorality\" — the White House issued multiple statements calling for the writer to reveal their identity.\n\"Does the so-called 'Senior Administration Official' really exist, or is it just the Failing New York Times with another phony source?\" Trump tweeted on Wednesday. \"If the GUTLESS anonymous person does indeed exist, the Times must, for National Security purposes, turn him/her over to government at once!\"\nWhite House Press Secretary Sarah Sanders also tweeted a statement about the anonymous official after the op-ed was published, calling the writing \"pathetic, reckless, and selfish.\" Her statement suggested that she believed the person was real, though, as she asserted that the \"coward should do the right thing and resign.\"\nThe op-ed signaled a much larger problem within the White House than one disgruntled staffer, claiming that senior officials throughout the administration will \"privately admit their daily disbelief at the commander in chief’s comments and actions,\" as well as work \"to insulate their operations from his whims.\" Essentially, the op-ed described a coup within the administration to prevent the president from leading the country into chaos.\n\"It may be cold comfort in this chaotic era, but Americans should know that there are adults in the room,\" the anonymous author said. \"We fully recognize what is happening. And we are trying to do what’s right even when Donald Trump won’t.\" They later added that the nation has \"sunk low with him and allowed our discourse to be stripped of civility.\"\nOf course, if Pence had written the op-ed, it's unlikely he would admit to it. It was published anonymously for a reason, after all. But the vice president's staff is adamant that President Trump's second-in-command wouldn't disrespect his boss in such a blatant and public way.","url":"https://www.bustle.com/p/mike-pence-denies-writing-the-new-york-times-op-ed-through-a-staffers-shaming-tweet-11771165"}
