{"authors":["Nick Hallett"],"date_download":"2018-10-30 22:02:08","date_modify":"2018-10-30 22:02:08","date_publish":"2017-02-18 10:14:52","description":"U.S. Vice President Mike Pence told a gathering of European leaders Saturday the United States will be “unwavering” in its support for NATO, however he called on members to pay their “fair share”.","filename":"data/vaneerConsumption/MikePenceUSOffersNATOUnwaveringSupportButNationsMustPayTheirFairShare.json","image_url":"https://media.breitbart.com/media/2017/02/GettyImages-642513520.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_02_18__1540936928.html","title":"Mike Pence: U.S. Offers NATO ‘Unwavering Support’, But Nations Must ‘Pay Their Fair Share’","title_page":"Mike Pence: U.S. Offers NATO ‘Unwavering Support’, But Nations Must ‘Pay Their Fair Share’","title_rss":"NULL","source_domain":"breitbart.com","text":"U.S. Vice President Mike Pence told a gathering of European leaders Saturday the United States will be “unwavering” in its support for NATO, however he called on members to pay their “fair share”.\nSpeaking in Munich, Germany, Mr Pence said the U.S. would “stand with Europe today and every day,” telling the audience, “The United States of America strongly supports NATO and will be unwavering in our commitment to this trans-Atlantic alliance.\n“We’ve been faithful for generations, and as you keep faith with us, under President Trump, we will always keep faith with you.\n“This is President Trump’s promise: we will stand with Europe today and every day; we are bound together by the same noble ideals – freedom, democracy, justice, and the rule of law.”\nHowever, he also warned that some NATO members were “failing to pay their fair share” towards it.\n“The promise to share the burden of our defence has gone unfulfilled for too many for too long and it erodes the very foundation of our alliance,” he said.\n“Let me be clear, the President of the United States expects our allies to keep their word.\n“As of those moment, only the United States and four members meet this basic standard [of spending at least two per cent of GDP on defence]. The truth is that many of our allies lack a clear and credible path to meeting this minimum goal.”\n“It’s time to do more,” he added.\nIn terms of relations with Russia, Mr Pence called on the country to honour the Minsk agreement and “de-escalate” the violence in Ukraine.\n“The U.S. will continue to hold Russia accountable, even as we search for new common ground, which as you know, President Trump believes can be found,” he said.\nHe is expected to meet several European leaders later, including German Chancellor Angela Merkel, and the Prime Minister of Turkey.","url":"https://www.breitbart.com/politics/2017/02/18/mike-pence-u-s-offers-nato-unwavering-support-but-nations-must-pay-their-fair-share/"}
