{"authors":["Ben Kew"],"date_download":"2018-10-30 18:00:17","date_modify":"2018-10-30 18:00:17","date_publish":"2018-07-30 15:55:56","description":"In the latest episode of Stephen Colbert’s Showtime animated series Mike Pence admits to having slept with porn actress Stormy Daniels.","filename":"data/vaneerConsumption/MikePenceAdmitstoAffairwithStormyDanielsinStephenColbertsOurCartoonPresident.json","image_url":"https://media.breitbart.com/media/2018/07/MikePenceColbertpresident1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_07_30__1540922417.html","title":"Mike Pence Admits to Affair with Stormy Daniels in Stephen Colbert's 'Our Cartoon President'","title_page":"Mike Pence Admits to Affair with Stormy Daniels in Stephen Colbert's 'Our Cartoon President'","title_rss":"NULL","source_domain":"breitbart.com","text":"In the latest episode of Stephen Colbert’s Showtime animated series Our Cartoon President, Vice President Mike Pence admits to having slept with porn actress Stormy Daniels.\n“I have a confession that the American people deserve to hear,” Mike Pence says at a press conference designed to distract people away from the Mueller investigation. “It wasn’t Donald who made love to Mrs. Stormy Daniels and paid for her silence, it was me. I’m sorry for the pain I caused and thank my wife Karen for sticking by my side.”\nPence later refuses to apologize to his wife Karen, saying that refusing to take credit for having sex with Daniels is an “affront to the Lord.”\n“I wish God wanted me to apologize, too, but Romans 13 says, ‘The authorities that exist are appointed by the Lord,'” Pence explains. “God made Donald Trump president and to not take credit for plowing an adult film star is an affront to our Lord.”\nThe segment is a reference to Trump’s alleged affair with Stephanie Clifford, a porn actress who goes by the stage name Stormy Daniels. Clifford claims Trump paid her $130,000 to sign a nondisclosure agreement in the run-up to the 2016 presidential election to stop her publicly discussing the affair.\nOur Cartoon President, which premiered in February, seeks to open “the White House doors for an ‘all access’ look at a typical day in Donald Trump’s world, examining quintessentially Trumpian details of the presidency and his most important relationships.”\nAs noted by NewsBusters, the show “relies on acting out every sick fever dream against President Trump and his administration, often including his family members.” Despite being renewed for its second season, the show has received poor reviews. According to Rotten Tomatoes, the show has an average critic rating of 5.17/10, while just 42 percent of viewers said they liked it.\nColbert tweeted a clip from Sunday’s episode.\nTonight! At 10:30, Trump And Putin Watch Shark Week | Our Cartoon President | SHOWTIME https://t.co/M1Q7T1Uh3m via @YouTube — Stephen Colbert (@StephenAtHome) July 29, 2018\nFollow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.","url":"https://www.breitbart.com/entertainment/2018/07/30/stormy-daniels-mike-pence/"}
