{"authors":["Michael Patrick Leahy"],"date_download":"2018-10-30 20:19:03","date_modify":"2018-10-30 20:19:03","date_publish":"2015-01-29 13:30:51","description":"Indiana Gov. Mike Pence is the most recent Republican governor to buy into President Obama's push to expand Medicaid. |","filename":"data/vaneerConsumption/MikePenceBecomesLatestGOPEstablishmentGovernortoBuyIntoObamasMedicaidExpansion.json","image_url":"https://media.breitbart.com/media/2015/01/AP249836808015.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_29__1540930743.html","title":"Mike Pence Becomes Latest GOP Establishment Governor to Buy Into Obama's Medicaid Expansion","title_page":"Mike Pence Becomes Latest GOP Establishment Governor to Buy Into Obama's Medicaid Expansion | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Indiana Governor Mike Pence is showing leadership skills, but not ones the limited government, Tea Party wing of the Republican Party expected to see from him.\nOn Tuesday Pence became the most recent Republican governor to buy into President Obama’s push to expand Medicaid.\nPence, rumored to be considering a run for the 2016 Republican Presidential nomination, joined a growing number of Republican governors–including Ohio’s John Kasich, Tennessee’s Bill Haslam, New Jersey’s Chris Christie, Arkansas’s Asa Hutchinson, and New Mexico’s Susannah Martinez, who’ve chosen to side with the party’s big government wing and work with the Obama administration to expand Medicaid within their states.\nOnly Wisconsin’s Scott Walker and Texas’s now former governor Rick Perry among the Republican governors considering a bid for the party’s 2016 nod have sided with the party’s limited government-Tea Party wing and rejected the Obama administration’s entreaties to aid in the expansion of Medicaid.\nPence’s announcement on Tuesday was just the most recent instance of a policy decision that has damaged his standing with limited government conservatives. Last week, he announced a quickly reversed plan to establish a state run news service, labeled “Pravda on the Prairie” by Breitbart News, which brought ridicule and scorn from critics in Indiana and around the country.\nPence has also become embroiled in the Common Core educational standards controversy. His decision to, in effect, merely “rebrand” the controversial standards with a new name and, consequently, allow the state’s No Child Left Behind waiver to be restored, suggests Pence is more interested in keeping federal funds flowing into the state than protecting Indiana from federal intrusion.\nIn a statement issued Tuesday announcing “that the State has received approval from the federal government to use an updated version of the consumer-driven Healthy Indiana Plan known as HIP 2.0 instead of Medicaid to offer access to quality health care to 350,000 uninsured Hoosiers,” Pence took a page from his Common Core rebranding strategy.\nNo longer will Medicaid–the federal program for Americans below the poverty line–go by that name in Indiana. Instead, Pence has rebranded it as “Healthy Indiana Plan 2.0,” or HIP 2.0.\nYou can read the details of Pence’s HIP 2.0 plan here.\nUnder the Affordable Care Act (Obamacare), states that agree to expand Medicaid receive additional federal funding for the first few years of the expanded program’s operation. To date, “governors in 28 states and the District of Columbia have expanded Medicaid,” while governors in 22 states have just said no.\nNext week, Tennessee could become the 29th state to expand Medicaid when the state legislature convenes in a special session called by Republican Governor Bill Haslam to consider his plan to accept more federal funding and expand Medicaid. Conservative lawmakers, however, are expected to mount vigorous opposition to Haslam’s proposal.\nElsewhere, in 2013, when Ohio Governor John Kasich could not get the state legislature to buy into Medicaid expansion, he ran an end-run and got two years of the program approved by a “quasi-legislative” state organization. As the Toledo Blade reported, “[t]he [Medicaid] expansion was made possible when the quasi-legislative Ohio Controlling Board agreed to draw down $2.6 billion in federal funds to pay for it.”\nWith those two years now up and the Ohio Controlling Board funds depleted, Kasich is again pitching the state legislature to approve his version of Medicaid expansion.\nAmericans for Prosperity (AFP), The Heritage Foundation, and local limited government activists lead the parade of opposition.\nWhile Chase Downham, head of AFP’s Indiana chapter, called Pence’s “attempt to reform traditional Medicaid … laudable,” he noted still, “our concerns with HIP 2.0 remain.”\n“[T]he price of reforming traditional Medicaid should not come at the cost of expanding an already troubled entitlement program [Indiana’s HIP 1.0, introduced by former Governor Mitch Daniels] to include hundreds of thousands of able-bodied, working-age, childless adults,” Downham concluded.\nJohn Davidson, director of the Center for Health Care Policy at the Texas Public Policy Foundation, blasted Pence’s plan at the Federalist:\n[HIP 2.0] dragoons the entire non-disabled Medicaid population into the expansion scheme, not just those above the poverty line, and offers them a choice between a HIP Basic and a HIP Plus plan (some can also choose a plan that supplements employer coverage, a long-standing feature of traditional Medicaid), both of which feature a health savings account with a $2,500 deductible funded almost entirely by taxpayers. The state will still cover the entire cost of the deductible and copayments will be limited to 5 percent of income. The basic plan essentially requires nothing of enrollees. They get a health savings account and can either pay into it or not—the state will still cover the entire cost of the deductible and copayments will be limited to 5 percent of income, as they are for all Medicaid programs everywhere.\nOne respected free market health care reformer, Grace-Marie Turner of the Galen Institute, however, called Pence’s plan “a win.”\n“While conservatives are sure to criticize this plan as an expansion of Medicaid,” Turner wrote on Tuesday. “I see it as taking advantage of an opportunity to lay the groundwork for the kind of Medicaid reform that we must move toward in the future.”\n“Absent Obamacare,” Turner concluded, “many conservatives would praise this effort to make Medicaid look more like a Health Savings Account and catastrophic high-deductible coverage. This is an important start toward much-needed changes to this public program. By using the ObamaCare waiver option that the administration wanted, Gov. Pence has gained important and potentially transformative changes to Medicaid. This is a win.”\nIndiana resident Joy Pullman, managing editor at the Federalist and a research fellow at the Heartland Institute, has a different view.\n“According to federal measurements,” she wrote on Wednesday, “my family consists of ‘low-income Hoosiers’ even though we’ll make something near the median state income this year, because under Pence’s Medicaid expansion government dependents can earn twice as much as the federal poverty level. In fact, we’re eligible for Pence’s welfa…er, Medicaid expansion.”\nPullman offered this blunt assessment of Pence’s plan.\n“No way in hell are we taking it,” she wrote.\n“I am not about to get my family into a health-care program that offers worse care than being uninsured,” Pullman wrote.\n“[W]e live a quite comfortable middle-class lifestyle. We eat well, we have two cars, and our house is almost paid off. Our children are well-clothed and well-toyed. We have memberships to the local zoo and indoor gardens,” Pullman explained.\nThe Pullman family has “a high-deductible health plan,” Pullman wrote, “so [they] pay essentially all of [their] medical bills in cash.”\n“We have never had a problem affording that,” Pullman explained, “despite having also paid cash for our three kids’ births, although affording health care does entail taking the kids to immunization clinics instead of pediatricians to cut costs and visiting quick-care clinics instead of emergency rooms when we have a malady that requires medical attention.”\n“We don’t pay subsidized rates at the clinics. We pay the full cost,” Pullman said. “As my husband explained to the puzzled nurse once, ‘We can afford to pay.’ If we can, so can lots of people Pence just told to stick their bills to taxpayers.”\nA number of conservatives in Indiana are looking at Pence’s new health care plan with the same caustic disapproval displayed by fellow Hoosier Pullman in her article.\nThat attitude could spell trouble for HIP 2.0 in Indiana in 2015 as well as for Pence on the campaign trail in 2016, should he choose to offer his political leadership skills to the country as a whole.","url":"https://www.breitbart.com/politics/2015/01/29/mike-pence-becomes-latest-gop-establishment-governor-to-buy-into-obamas-medicaid-expansion/"}
