{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 20:12:58","date_modify":"2018-10-30 20:12:58","date_publish":"2018-07-11 14:28:27","description":"VP Mike Pence said Tuesday that he is proud to be part of a pro-life administration and would very much to see Roe v. Wade overturned.","filename":"data/vaneerConsumption/MikePenceIDontApologizeforBeingProLife.json","image_url":"https://media.breitbart.com/media/2018/05/wi/afp/07/3g369g_us-vice-president-mike-pence-organization-american-states-two-weeks-divisive-e1527868515986.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_11__1540930378.html","title":"Mike Pence: ‘I Don’t Apologize’ for Being Pro-Life","title_page":"Mike Pence: ‘I Don’t Apologize’ for Being Pro-Life | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"U.S. Vice President Mike Pence said Tuesday that he is proud to be part of a pro-life administration and would very much to see Roe v. Wade overturned.\nSpeaking with Dana Bash on CNN’s Situation Room, Mr. Pence clearly expressed his belief in the sanctity of human life while eluding Bash’s attempts to ensnare him.\nBash apparently sought to get an admission from the vice president that the administration had nominated Judge Brett Kavanaugh to the Supreme Court with the specific intent of overturning Roe v. Wade, the 1973 Supreme Court decision that abolished state laws on abortion and made it the law of the land.\n“Are you worried that he’s not going to follow what you want to do?” Bash asked, referring to the possibility of Kavanaugh going rogue and not exploiting opportunities to reverse Roe, to which Pence replied that what the president was looking for in a Supreme Court pick was above all fidelity to the U.S. Constitution.\n“Well, Dana, as you know, I’m pro-life; I don’t apologize for it, and I’m proud to be part of a pro-life administration that’s advanced pro-life policies,” Pence said. “But what I can assure you is that what the president was looking for here was a nominee who will respect the Constitution as written, who will faithfully uphold the Constitution in all of his interpretations of the law.”\n“Do you still want Roe vs. Wade to be overturned?” Bash asked, to which Pence responded, “I do, but I haven’t been nominated to the Supreme Court.”\nIn an effort to force Pence’s hand, Ms. Bash pushed harder, reminding the vice president of words spoken during the 2016 campaign.\n“Right. But you’re part of an administration that campaigned, you and the president, saying you will find nominees to overturn Roe vs. Wade,” she said. “Will you be disappointed if he is given that opportunity and he doesn’t? Will you be disappointed?”\nCNN’s Dana Bash: “Do you still want Roe v. Wade to be overturned?” Vice President Pence: “I do” https://t.co/oD6yVjvNZu https://t.co/BQ0hyzljxw — CNN Politics (@CNNPolitics) July 10, 2018\nOnce again Pence owned his pro-life convictions, while insisting that the president had not discussed Roe with Judge Kavanaugh.\n“Well, as I’ve said, I stand for the sanctity of life,” he said. “This administration, this president, are pro-life. But what the American people ought to know is that, as the president said today, this is not an issue he discussed with Judge Kavanaugh; I didn’t discuss it with him either.”\n“What we really focused on was the character, the background, the credentials and the judicial philosophy” of the nominee, he said.\nFollow Thomas D. Williams on Twitter Follow @tdwilliamsrome","url":"https://www.breitbart.com/politics/2018/07/11/mike-pence-i-dont-apologize-for-being-pro-life/"}
