{"authors":["Alex Swoyer"],"date_download":"2018-10-30 20:21:45","date_modify":"2018-10-30 20:21:45","date_publish":"2015-12-16 00:28:47","description":"Mike Huckabee and Rick Santorum defended Donald Trump’s position on Muslim immigration during the undercard debate.","filename":"data/vaneerConsumption/MikeHuckabeeRickSantorumDefendDonaldTrump.json","image_url":"https://media.breitbart.com/media/2015/12/Early-Debate-Justin-SullivanGetty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_12_15__1540930905.html","title":"Mike Huckabee, Rick Santorum Defend Donald Trump","title_page":"Debate: Mike Huckabee, Rick Santorum Defend Donald Trump","title_rss":"NULL","source_domain":"breitbart.com","text":"LAS VEGAS, Nevada — GOP presidential candidates former Arkansas Gov. Mike Huckabee and former Pennsylvania Sen. Rick Santorum defended GOP frontrunner Donald Trump’s statement to ban Muslims from coming into the United States until the government can put in place an effective vetting process during the undercard debate hosted by CNN in Las Vegas, Nevada on Tuesday.\nEven without being on stage, GOP frontrunner Donald Trump managed to drive the conversation within the first five minutes of the debate. Sen. Lindsey Graham (R-SC) took a swipe at Trump, saying, “Donald Trump has done the one single thing you cannot do, declare war on Islam itself. ISIL would be dancing in the streets.”\nThe moderator then turned to Santorum and asked him if he thought Muslims should have the right to religious liberty, just as Christians do.\n“Of course I do, but what Donald Trump was saying was nothing against Muslims. His comment was against this administration [that] doesn’t have a policy to properly vet people coming into this country. Lets just be honest about what’s being talked about,” Santorum replied.\nThe crowd applauded in agreement.\nSantorum continued, “We have to stop worry about offending some people and start defending all Americans, because we’re not right now.”\nHuckabee was also questioned about Trump’s proposal to ban Muslims from coming into the country.\n“I’d rather him be president than I’d have Hillary be president any day,” Huckabee responded. “If he becomes president, I think he would do a whole lot more to protect us than Hillary would, and a whole lot more than Barack Obama has done in his eight years.”","url":"https://www.breitbart.com/politics/2015/12/15/mike-huckabee-rick-santorum-defend-donald-trump-lindsey-graham-attack/"}
