{"authors":["Mary Avant"],"date_download":"2018-10-30 23:04:46","date_modify":"2018-10-30 23:04:46","date_publish":"2014-08-14 12:00:04","description":"As a girl who grew up watching every episode of That '70s Show (more than once), it still amazes me to see how far Jackie Burkhart (er, Mila Kunis) has come over her years in the spotlight. (Seriously, can you believe the little girl who started her…","filename":"data/vaneerConsumption/MilaKunis9BestRedCarpetMomentsarethePerfectWaytoRinginTheStars31stBirthday.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/73279d25-be1d-49d7-871c-590d7a8ecddf.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35715-mila-kunis-9-best-red-carpet-moments-are-the-perfect-way-to-ring-in-the-stars_1540940686.html","title":"Mila Kunis' 9 Best Red Carpet Moments are the Perfect Way to Ring in The Star's 31st Birthday","title_page":"Mila Kunis' 9 Best Red Carpet Moments are the Perfect Way to Ring in The Star's 31st Birthday","title_rss":"NULL","source_domain":"bustle.com","text":"As a girl who grew up watching every episode of That '70s Show (more than once), it still amazes me to see how far Jackie Burkhart (er, Mila Kunis) has come over her years in the spotlight. (Seriously, can you believe the little girl who started her career in Lisa Frank commercials went on to create a film like Black Swan?) And though the actress and soon-to-be-mother of Ashton Kutcher's baby has always been a sexy sight to behold, there's no denying that her fashion sense and red carpet style has developed into something to both envy and totally take seriously over the last several years. So to celebrate just how far she's come and how stylish she's gotten, let's count down nine of the 31-year-old birthday girl's best red carpet moments to date.","url":"https://www.bustle.com/articles/35715-mila-kunis-9-best-red-carpet-moments-are-the-perfect-way-to-ring-in-the-stars"}
