{"authors":[],"date_download":"2018-10-21 02:48:08","date_modify":"2018-10-21 02:48:08","date_publish":"2018-08-07 00:26:42","description":"Mitra joins as a digital producer. Coward will also work as a digital producer and a multi-platform editor. Roberts, a former digital editor, will focus on writing about technology and society.","filename":"data/vaneerConsumption/MiliMitraandKaitlinCowardjoinPostOpinionsstaffMollyRobertspivotstowriting.json","image_url":"https://www.washingtonpost.com/resizer/ZIwdtFReqPMJh15-SBE1si-PDjE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/K745CI4HXM5QBLJKZWU3RUL5MU.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/21/washingtonpost.com/pr_wp_2018_08_06__1540090088.html","title":"Mili Mitra and Kaitlin Coward join Post Opinions staff; Molly Roberts pivots to writing","title_page":"Mili Mitra and Kaitlin Coward join Post Opinions staff; Molly Roberts pivots to writing - The Washington Post","title_rss":"NULL","source_domain":"washingtonpost.com","text":"Announcement from Editorial Page Editor Fred Hiatt, Deputy Editorial Page Editors Ruth Marcus and Jackson Diehl, Editorial Copy Chief Trey Johnson, and Operations Editor Becca Clemons:\nWe’re pleased to announce that both of Opinion’s stellar 2018 summer interns have agreed to stay on in full-time roles. Mili Mitra, who is completing her second internship with us, will join Becca Clemons’ team as a digital producer. Kaitlin Coward, who has been working this summer both as a multi-platform editor and a digital producer, will continue in both roles, reporting to Trey Johnson and Becca. This in turn will free Molly Roberts, a previous two-time summer intern, to concentrate once again on writing. Molly will focus on technology and society, writing both unsigned editorials and signed pieces.\nMili recently graduated from Brown University with a concentration in Public Policy and Economics. She describes herself as a news geek from India and Singapore (by way of Minnesota). At Brown, she gained experience working on political campaigns, environmental policy research and human rights advocacy, but found her real passion editing the opinions page of the Brown Daily Herald.\nKaitlin graduated from Ohio University, where she was managing editor of the other Post. She previously spent a summer interning at the New York Times, and says, “I love all things grammar and style. It’s what I hope to keep doing for as long as I can. I’ve learned a lot in the past year about concussions in the NFL because I wrote an honors thesis about journalistic coverage of just that. Though most of my journalistic work has been based in news, I love sports, specifically tennis, soccer, hockey and figure skating.”\nMolly, a two-time Post intern, joined the Opinions team as a digital editor and producer in 2016 after graduating from Harvard College. She is a Washington native who was raised on KidsPost, and says she has been thrilled every step of the way to be working with the grown-ups now.\nWe’re delighted to have all three working with us in these roles.","url":"https://www.washingtonpost.com/pr/wp/2018/08/06/mili-mitra-and-kaitlin-coward-join-post-opinions-staff-molly-roberts-pivots-to-writing/"}
