{"authors":[],"date_download":"2018-10-30 21:11:16","date_modify":"2018-10-30 21:11:16","date_publish":"2018-07-14 02:21:00","description":"A federal grand jury returned an indictment Friday against a dozen Russian military intelligenc...","filename":"data/vaneerConsumption/MilitaryofficialsaccusedofhackingDNCsteal.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/07/13/Videos/4437907.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_russia-intell_e1755694411ab5367f39541bfda17dcb__1540933876.html","title":"Military officials accused of hacking DNC, steal","title_page":"12 Russians indicted: Military officials accused of hacking DNC, steal","title_rss":"NULL","source_domain":"ajc.com","text":"A federal grand jury returned an indictment Friday against a dozen Russian military intelligence officials accused of hacking into computers and disseminating private information in an effort to interfere in the 2016 presidential election, Deputy Attorney General Rod Rosenstein said.\n>> Read more trending news\n>> More on Robert Mueller's investigation\nThe Russians are accused of hacking into the computer networks of the Democratic National Committee and the presidential campaign of Hillary Clinton. Rosenstein said they also stole information on 500,000 U.S. voters after hacking a state U.S. election board.\nThe indictments are the latest in special counsel Robert Mueller’s probe of Russian meddling in the 2016 presidential election and its possible ties to President Donald Trump’s campaign.\n>> Russian hacking: Read the indictment charging Russian intelligence officers with election interference\nUpdate 6:14 a.m. EDT, July 14: President Donald Trump took to Twitter and responded to the story about the indictments, complaining that the stories “took place during the Obama administration.”\n“Why didn’t they do something about it, especially when it was reported that President Obama was informed by the FBI in September, before the Election?” Trump tweeted.\nThe stories you heard about the 12 Russians yesterday took place during the Obama Administration, not the Trump Administration. Why didn’t they do something about it, especially when it was reported that President Obama was informed by the FBI in September, before the Election? — Donald J. Trump (@realDonaldTrump) July 14, 2018\nUpdate 10:00 p.m. EDT July 13: House Judiciary Chairman Bob Goodlatte (R-VA) issued a statement Friday on the indictments of 12 Russian intelligence officers charged with interfering in the 2016 presidential election.\nGoodlatte praised the Justice Department for the indictments.\n“Today’s announcement from the Department of Justice again confirms that hostile foreign powers attempted to interfere in our elections. The Department of Justice should be commended for their efforts in rooting out these international criminals,” Goodlatte said.\nUpdate 4:15 p.m. EDT July 13: Russia’s Foreign Ministry denounced Friday’s indictments in a statement, saying they were “obviously” issued to “spoil the atmosphere” before Monday’s summit between Trump and Russian President Vladimir Putin.\n“Influential political forces of the United States, who oppose the normalization of relations between our countries and have been manufacturing blatant slander for two years,” were to blame for the indictments, the ministry's statement said, according to The Associated Press.\n\"It is regrettable that the circulation of false information in Washington has become the norm, and that criminal cases are brought for obvious political reasons,\" the statement said.\nThe Kremlin has denied that Russia interfered in the U.S. election.\nUpdate 3:10 p.m. EDT July 13: White House officials said in a statement Friday that the charges filed against a dozen Russian military intelligence officials \"include no allegations of knowing involvement by anyone on the campaign and no allegations that the alleged hacking affected the election result.\"\n>> 12 Russians indicted: Here’s what the DOJ says happened\n\"This is consistent with what we have been saying all along,\" White House spokeswoman Lindsay Walters said.\nPer pooler @anniekarni, White House spox Lindsay Walters has a statement on indictments today pic.twitter.com/PsuuotBjUh — Ben Jacobs (@Bencjacobs) July 13, 2018\nUpdate 2:25 p.m. EDT July 13: In Friday's indictment, officials said Russian operatives hacked into the computer networks of the Democratic Congressional Campaign Committee, the Democratic National Committee and the presidential campaign of Hillary Clinton before strategically releasing stolen information under the names \"DCLeaks\" and \"Guccifer 2.0.\"\n>> Mueller indicts 13 Russians, 3 Russian entities in election meddling probe\n“The Internet allows foreign adversaries to attack America in new and unexpected ways,” Rosenstein said Friday. “Free and fair elections are hard-fought and contentious, and there will always be adversaries who work to exacerbate domestic differences and try to confuse, divide, and conquer us. So long as we are united in our commitment to the shared values enshrined in the Constitution, they will not succeed.”\nOfficials said the investigation was bolstered by the work of the FBI’s cyber teams in Pittsburgh and San Francisco and with the National Security Division.\nIt isn’t the first time Mueller’s probe has led to charges against Russians believed to have interfered in U.S. elections. A grand jury indicted 13 Russian nationals and three Russian entities in February on accusations that they interfered with the election and political processes.\n>> Read the indictment: 13 Russians, 3 Russian entities accused of meddling in US elections\nUpdate 1:35 p.m. EDT July 13: Sen. Mark Warner, the vice chair of the Senate Intelligence Committee, joined other lawmakers Friday in calling for Trump to cancel a planned meeting with Russian President Vladimir Putin after a grand jury indicted a dozen of the country’s military intelligence officials.\n\"There should be no one-on-one meeting between our president and Mr. Putin,\" Warner, D-Virginia, told reporters.\n>> Trump and Putin to meet in Helsinki in July\nTrump and Putin are set to meet Monday in Helsinki. White House officials said last month that the pair will discuss the relationship between their countries along with a range of national security issues.\nUpdate ﻿1:25 p.m EDT July 13: Trump attorney and former New York Mayor Rudy Giuliani wrote Friday on Twitter that the indictments announced Friday “are good news for all Americans.”\n>> WikiLeaks emails: FBI investigates, Podesta claims he was targeted by Russian hackers\n“The Russians are nailed,” Giuliani said. “No Americans are involved. Time for Mueller to end this pursuit of the President and say President Trump is completely innocent.”\nThe indictments Rod Rosenstein announced are good news for all Americans. The Russians are nailed. No Americans are involved. Time for Mueller to end this pursuit of the President and say President Trump is completely innocent. — Mayor Rudy Giuliani (@RudyGiuliani) July 13, 2018\nTrump has frequently characterized Mueller’s investigation as a politically motivated “witch hunt.”\nThe charges revealed Friday bring the total number of people indicted as part of the Mueller probe to 32. Charges have ranged from money laundering and falsifying income tax returns to lying to FBI investigators. Five people, including former White House national security adviser Michael Flynn, have pleaded guilty to charges in the investigation.\nUpdate 1:05 p.m. EDT July 13: Lawmakers are calling on President Donald Trump to cancel his planned meeting with Russian President Vladimir Putin after a dozen of the country’s military intelligence officials were indicted Friday.\nINBOX: @SenSchumer calls on President Trump to cancel his meeting with Russian President Putin in light of today’s DOJ indictments. pic.twitter.com/kgafditjvs — Ed O'Keefe (@edokeefe) July 13, 2018\nFollowing AG #Rosenstein's announcement of #Mueller's newest #indictments against #Russian officials, I call on @realDonaldTrump to cancel his meeting w/#Putin,who has consistently lied about election interference.\nThey are attacking our country, Mr. President. Enough is enough. — Steve Cohen (@RepCohen) July 13, 2018\n﻿Original report: Eleven of the defendants were charged with conspiracy to commit computer crimes, eight counts of aggravated identity theft and conspiracy to launder money. Two defendants are charged with a separate conspiracy to commit computer crimes.\n>> Hacker releases personal information of nearly 200 Democrats\nThe suspects were named as Viktor Borisovich Netyksho, Boris Alekseyevich Antonov, Dmitriy Sergeyevich Badin, Ivan Sergeyevich Yermakov, Aleksey Viktorovich Lukashev, Sergey Aleksandrovich Morgachev, Nikolay Yuryevich Kozachek, Pavel Vyacheslavovich Yershov, Artem Andreyevich Malyshev, Aleksandr Vladmirovich Osadchuk, Aleksey Aleksandrovich Potemkin and Anatoliy Sergeyevich Kovalev.\nMore than a dozen people have been charged in Mueller’s probe of Russian election meddling and its possible ties to President Donald Trump’s presidential campaign.\n﻿Check back for updates to this developing story.\nThe Associated Press contributed to this report.","url":"https://www.ajc.com/news/national/russia-intelligence-officials-indicted-mueller-probe/GjOu361I7AANHPXWlvrnaO/"}
