{"authors":[],"date_download":"2018-10-22 22:10:17","date_modify":"2018-10-22 22:10:17","date_publish":"2014-06-06 19:07:56","description":"Today, Norfolk is one of five bases that are being studied as templates for how to better assess climate impacts across the military.","filename":"data/vaneerConsumption/MilitaryBasesBraceforSlowMotionWarWithClimateChange.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/495671/140608-naval-station-norfolk-jms-1823_6485f761e388ff36d5096b250652ae67.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_military-bases-brace-slow-motion-war-climate-change-n124761_1540246217.html","title":"Military Bases Brace for Slow-Motion War With Climate Change","title_page":"Military Bases Brace for Slow-Motion War With Climate Change","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMilitary bases across the country have a new enemy to brace against: climate change.\nNaval Station Norfolk, located in Virginia near the mouth of Chesapeake Bay, has long been known as the world’s largest naval complex. But more recently it has become the poster child for a relatively new risk facing the U.S. military: how to protect bases around the country from rising seas, more severe storms, wildfires, droughts and other impacts tied to a shifting climate.\nThat realization, Pentagon spokesman Mark Wright tells NBC News, came after a still-classified, 2008 National Intelligence Council report found that more than 30 military sites already face elevated risk -- and that’s just from rising sea levels.\n“Climate change is an additional risk which we must consider and manage as part of our mission planning process,” he says.\nThe Norfolk base is a case in point. It sits in a region with a long history of flooding given its geography, but what planners decades ago hadn’t expected was that high tides would get much higher over the last century.\nSince World War I, the increase has been about a foot, notes Joe Bouchard, a retired Navy captain who commanded the base in the early 2000s and has since lectured and written about climate impacts on military infrastructure.\n“Everything since then was built at the same level as World War I,” he says. “Nothing had been done to compensate for sea level rise because it happened slowly and people weren’t aware of it.”\nBy the 1990s, utility lines used to hook Navy ships up to power on shore were being impacted. “We had increasing electricity outages at high tides,” Bouchard recalls. “Electrical lines were submerged in sea water and that doesn’t work very well.”\nAt the time, Bouchard and others thought the base had sunk a bit since it was built on top of landfill material. That might explain part of the problem, but scientists only recently determined the entire coastal region has seen sea level increases three to four times the global average of around eight inches over the last century.\n\"It’s not like we’re suggesting there’s a trillion dollar bill that’s coming due tomorrow. We should identify risks and have a plan.”\nThe 1990s solution was to build taller piers that would carry those utility lines higher above the sea. Four piers were eventually built but even those designs are flawed, Bouchard says, because they don’t take into account more recent projections of even higher sea level rise –- anywhere between 1.5 and 7.5 feet over the next century.\nToday, Norfolk is one of five bases that are being studied as templates for how to better assess climate impacts across the military. The others are Eglin Air Force Base in Florida; Camp LeJeune in North Carolina; and Coronado Naval Station and the Marines’ Camp Pendleton, both in Southern California, where wildfires and drought are more of an issue than sea level rise.\nBut figuring out what to do, and at what cost, is still in its infancy.\nA 2011 National Research Council report found that 128 U.S. military sites could be impacted by sea-level rise of 3 feet or more. Of those, 56 are Navy facilities valued at $100 billion, the report stated.\nAt Norfolk, replacing just four piers cost $60 million. At Eglin, it cost $112 million to repair a barrier island protecting the base after it was hit by three hurricanes in 10 years.\nThe pilot studies emphasize that each base has its unique traits, making any template more of a challenge.\nScientists at Woods Hole Oceanographic Institution and Oklahoma State University are working with military researchers to come up with better assessment tools, and in Norfolk there’s even greater collaboration.\nLast Tuesday, local military brass, academia, city and state officials as well as industry unveiled their own pilot project to figure out what needs protecting across the region, not just on the Navy base.\nOld Dominion University, which is just 10 minutes from the base, is hosting this group effort, but the initiative really got its push from the Pentagon and the National Security Council, says Ray Toll, a retired Navy captain who serves as the university liaison to the Navy.\n“We weren’t used to coordinating with the community,” he says of the military. “But the whole region is at risk. Fixing one piece of it and not the other makes no sense.”\nThe group gave itself two years to come up with adaptation plans that all can support – from the 18 federal agencies in the area, to the seven city governments as well as the state and local industry.\nOnce the plans are in place, the next step would be to seek funding.\nCommunity leaders have all bought in, Toll says, but “if there are any laggards it’s maybe people who don’t believe in climate change or think it’s too hard to adapt. So it is up to us to show them it’s doable.”\nThat convincing could reach all the way to the U.S. Congress. Last month, the House passed an amendment to ban the Pentagon from using funds to study climate change impacts.\nThe Senate has no similar amendment before it, so the measure might not go anywhere. But it is a symbol of how climate still is a hot potato in Congress.\nThe military “aren’t being encouraged by Congress to look into these things,” says retired Brig. Gen. Gerald Galloway, one of 16 retired generals and admirals who last month issued their own review, concluding that climate efforts within the military “are not being undertaken with a sufficient sense of urgency.”\n“It’s a slow start because look at the pushback people have gotten when talking about climate change,” adds Galloway, a former combat engineer who now teaches disaster and water issues at the University of Maryland.\n“Typically,” he says, “the last thing people want to do is spend money if there’s any uncertainty” -- and climate projections certainly have that.\n“But it’s not like we’re suggesting there’s a trillion dollar bill that’s coming due tomorrow,” he says. “We should identify risks and have a plan.”","url":"https://www.nbcnews.com/science/environment/military-bases-brace-slow-motion-war-climate-change-n124761"}
