{"authors":["Simon Kent"],"date_download":"2018-10-30 18:31:49","date_modify":"2018-10-30 18:31:49","date_publish":"2016-02-18 11:51:30","description":"Anti-Semitism at the Oxford University Labour Club (OULC) has left Ed Miliband \"deeply disturbed\" and led to him cancelling an appearance at the university","filename":"data/vaneerConsumption/MilibandCancelsOxfordTalkAfterReportsofAntiSemitismatPoisonousLabourClub.json","image_url":"https://media.breitbart.com/media/2015/02/Ed-miliband.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_02_18__1540924309.html","title":"Miliband Cancels Oxford Talk After Reports of Anti-Semitism at 'Poisonous' Labour Club","title_page":"Miliband Cancels Oxford Talk After Reports of Anti-Semitism at 'Poisonous' Labour Club","title_rss":"NULL","source_domain":"breitbart.com","text":"Accusations of anti-Semitism within the Oxford University Labour Club (OULC) have left Ed Miliband “deeply disturbed” and led to his cancellation of an appearance to speak to students.\nThe OULC, which counts a number of politicians as former members, including Michael Foot and David Miliband, has been thrust into the public spotlight by allegations of racism and support for the Islamic terrorist group Hamas – with one MP calling for Labour leader Jeremy Corbyn to “personally look into” the claims.\nMr Milliband, the former Labour leader, was due to address the club’ s annual John Smith memorial dinner in a few weeks’ time however recent events have forced him to review the offer.\nA spokesman for the former Labour leader told the Press Association: “Ed is deeply disturbed to hear of reports of anti-Semitism in the Oxford University Labour Club.\n“It is right that the executive of the club has roundly condemned the comments and fully co-operates with the Labour Students’ investigation. Ed and the Labour Club have agreed that his talk should be postponed until the investigation is resolved.”\nAs Breitbart London reported, a co-chairman of the club, Alex Chalmers, resigned earlier this week, claiming a large proportion of members “have some kind of problem with Jews”. He alleged that some “poisonous” radical Left members had expressed support for Islamic terrorist front Hamas.\nOULC just voted to support Oxford Israeli Apartheid Week in a continuation of its solidarity with the Palestinian people. — OULC (@OxUniLabour) February 15, 2016\nA decision by the club to support Israeli Apartheid Week, which claims to highlight Israel’s “ongoing settler-colonial project and apartheid policies over the Palestinian people”, has angered some Labour MPs, who have called for the party to dissociate itself from OULC.\nIn explaining his decision to resign, Chalmers wrote on Facebook: “A large proportion of both OULC and the student left in Oxford more generally have some kind of problem with Jews. The decision of the club to endorse a movement with a history of targeting and harassing Jewish students and inviting anti-Semitic speakers to campuses, despite the concerns of Jewish students, illustrates how uneven and insincere much of the active membership is when it comes to liberation.”\nMore than 30 former and current chairs and executive members of OULC and others have now signed a letter condemning the club’s decision to endorse Israeli Apartheid Week. The signatories say Israeli Apartheid Week promotes a “one-sided narrative, seeking to dismantle the only majority-Jewish member-state of the United Nations”.\nThe letter goes on: “We are troubled by OULC’s decision and feel compelled to speak out. In a climate of rising antisemitism, we have a duty to oppose initiatives that foster an intolerant political culture which intimidates Jewish students.”\nThe Oxford University Jewish Society (JSoc) said it was “high time” the issue of anti-Semitism within the student left was confronted: “When anti-Semitism intersects with Palestinian solidarity politics, it is not the job of Jewish students to be quiet, but the job of Palestinian solidarity activists to rid their movement of anti-Jewish prejudice.”\nWe have received further reports of anti-semitism in @OxUniLabour and are appalled at such shocking prejudice. pic.twitter.com/frk9Gg8Bbf — Oxford JSoc (@oxfordjsoc) February 16, 2016","url":"https://www.breitbart.com/europe/2016/02/18/miliband-cancels-oxford-talk-after-reports-of-anti-semitism-at-poisonous-labour-club/"}
