{"authors":[],"date_download":"2018-10-22 22:31:29","date_modify":"2018-10-22 22:31:29","date_publish":"2014-05-11 09:52:31","description":"A medical official said 11 troops had their hands tied behind their backs and suffered close-range gunshots to the head.","filename":"data/vaneerConsumption/MilitantsKill20IraqiTroopsinBrazenAttackonBarracks.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_militants-kill-20-iraqi-troops-brazen-attack-barracks-n102421_1540247489.html","title":"Militants Kill 20 Iraqi Troops in Brazen Attack on Barracks","title_page":"Militants Kill 20 Iraqi Troops in Brazen Attack on Barracks","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBAGHDAD -- Militants in Iraq launched an audacious attack on a military barracks in a remote area in the country's north and killed 20 troops overnight, including some who had been bound and shot at close range, authorities said Sunday.\nThe killings at the barracks in the village of Ayn al-Jahish outside the northern city of Mosul represent the latest blow to the government's efforts to achieve stability in restive Sunni-dominated areas.\nGunmen staged the assault late Saturday night, two police officers said, shooting some at short range while others died when insurgents stormed the barracks. A medical official, who confirmed the causality number, said 11 troops had their hands tied behind their backs and suffered close-range gunshots to the head. All officials spoke on condition of anonymity as they were not authorized to release the information to journalists.\nThe slain troops are in charge of protecting an oil pipeline that sends Iraqi crude oil to international markets and guarding a nearby highway. Attacks on this pipeline are common in that area near Mosul, a former insurgent stronghold located about 360 kilometers (225 miles) northwest of Baghdad.\nThe brazen attack comes amid a surge in violence to levels unseen in Iraq since 2008. It's been the most serious challenge to the Shiite-led government's efforts to achieve stability. Last year, Iraq saw its highest annual death toll since the worst of the country's sectarian bloodletting began to subside in 2007, according to United Nations figures. The U.N. said violence killed 8,868 last year in Iraq.\n- The Associated Press","url":"https://www.nbcnews.com/news/world/militants-kill-20-iraqi-troops-brazen-attack-barracks-n102421"}
