{"authors":[],"date_download":"2018-10-30 14:19:11","date_modify":"2018-10-30 14:19:11","date_publish":"2016-12-13 00:00:00","description":null,"filename":"data/vaneerConsumption/MilitaryMillennialsgonewild.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2016_12_military_millennials_gone_wild__1540909151.html","title":"Military Millennials gone wild","title_page":"Military Millennials gone wild","title_rss":"NULL","source_domain":"americanthinker.com","text":"It didn’t much matter which uniform they were wearing; our young men and women in the service academies gave the left a little dose of their own medicine at Saturday’s annual Army-Navy football game. And as the oft repeated phrase goes, “it was a beautiful thing.” Of course, you’d hardly know it if your only source of news is the mainstream media. But if you search long and hard, you can find the cadets mercilessly mocking the left.\nBoth academies, typically steeped in on-the-record respect for elected officials and mandated political correctness, let loose in their own ways, mocking the many movements of the political Left.\nMake sure you hit the IJR link, as the pictures really are worth a thousand words – not to mention the long, sustained roar of approval from the crowd that barely received two seconds of audio up full on any of the major networks – that is, if they had enough fortitude to mention it at all. Though you may have run across multiple reports of the hundred or so (no doubt paid) anti-Trump protesters outside M&T Bank Stadium in Baltimore.\nThe cadets were imaginative and let their creativity run wild with ridicule of the left and each other, and they even used Trump phraseology to razz the other side. The IJR also reported:\nTrump himself loomed large at the game. Not even President yet, he commanded roaring cheers from all corners of the stadium when his waving, fist-pumping image was shown on the Jumbotron. The President-elect himself was meme-ified throughout the stands, where his image and most politically incorrect statements were printed on banners intended to mock the competing academy.\nMy personal favorite was “Annapolis: our nation’s first safe space.”\nThe Army-Navy football game is one of time-honored tradition. This year was the 117th football game between the U.S. Naval Academy’s Midshipmen and West Point’s Black Knights. Generally, it’s not a place where you’d hear much about the commonly accepted slang for a women’s private anatomy. But there it was – even printed on West Point banners screaming “Grab ’em by the Navy!” Even Trump had to get a laugh out of that one.\nAny way you cut it, both service academies displayed their unified approval and appreciation for the incoming president as well as his cabinet pick for secretary of defense, retired Marine general James “Mad Dog” Mattis.\nNot to be left out was that delightful, tolerant organization knows as Black Lives Matter, as the West Point Black Knights pointed out with a bold lampoon, “Army Football Matters.”\nMuch ink has been spilled about Millennials and their left-leaning bent. And of course, there is a sizeable volume of young libs from coast to coast. But it’s nice to know that our service academies are full of young men and women who seem to have an appreciation for their new commander-in-chief. Likewise, he for them.\nAnd on a frigid evening in Baltimore, the Midshipmen and the Black Knights showed humor, understanding, and even insight into their Millennial counterparts on the left.\nOddly enough, for the first time in over a decade, the underdog – West Point – actually won. Perhaps a fitting parallel to the triumph of Donald Trump.","url":"https://www.americanthinker.com/blog/2016/12/military_millennials_gone_wild_.html"}
