{"authors":["Akin Oyedele"],"date_download":"2018-10-30 22:59:03","date_modify":"2018-10-30 22:59:03","date_publish":"2018-07-25 00:00:00","description":"Millennials putting aside money for the future are largely sitting on cash, according to a Bankrate.com report. But it could be a costly option, given their expected longer lifespans, rising medical costs, and uncertainty about Social Security.","filename":"data/vaneerConsumption/Millennialsaremakingacostlyinvestingmistakebysittingoncash.json","image_url":"https://amp.businessinsider.com/images/5751ea8852bcd05c658c6be7-1536-768.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_millennials-cash-investing-long-term-2018-7_1540940343.html","title":"Millennials are making a costly investing mistake by sitting on cash","title_page":"    Millennials are making a costly investing mistake by sitting on cash - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Millennials putting aside money for the future are largely sitting on cash, according to a Bankrate.com report. REUTERS/Lucy Nicholson\nCash is king for millennials who are setting money aside for the future, according to a new Bankrate.com report.\nThe problem is this is one of the worst ways to earn any returns. And it doesn't jibe with millennials' expected longer lifespans, rising medical costs, and uncertainty about Social Security.\n\"Millennials are going to have the biggest retirement-savings burden in history,\" Greg McBride, the chief financial analyst for Bankrate.com, told Business Insider.\n\"The nest egg that they're going to have to accumulate on their own is going to be bigger than any other generation.\"\nThe survey found that 30% of 18- to 37-year-olds thought cash investments were the best place to park money they didn't plan to access for 10 or more years, compared with 21% of those 38 and older.\nA plurality of people in all age groups (32%) thought the stock market was best, versus 23% of millennials. Just 2% of people would've opted for bitcoin or other cryptocurrencies.\n\"For investment horizons of longer than 10 years, the stock market is an entirely appropriate investment,\" McBride said. \"Cash is not, and especially if you're not seeking out the most competitive returns.\"\nWhen asked, many Americans weren't aware of the interest rates they were earning on their savings accounts. The survey found 27% — a plurality — didn't know or refused to say. A quarter of respondents said they earned less than 1%, even as the top savings and money-market accounts nationally yield more than 2% in interest.\nMany millennials came of age around the 2008 financial crisis, and some were old enough to be scarred by the 2000 dot-com bust. This most likely explains at least in part why some are wary of the stock market — but it could end up being a costly reason many years from now.\n\"Millennials are saving for retirement at an earlier age than their predecessors and putting a higher priority on emergency savings,\" McBride said. \"It's just that how that money is invested over longer horizons is out of whack.\"\nMillennials aren't the only ones seen as parking too much cash for the long term.\n\"Our clients — and investors in general — are sitting on very high levels of cash,\" said Ida Liu, the global market manager for metro New York at Citi Private Bank, which caters to ultra-high-net-worth people. Right after the recession, cash made up roughly a quarter of clients' portfolios, Liu said. It's now at 22%, which is still \"really high,\" she added.\nA recent study by NerdWallet also found that Americans on average were holding more than $32,000 in cash.\n\"Put your cash to work because cash is an underperforming asset,\" Liu said.\nSee also:","url":"https://www.businessinsider.com/millennials-cash-investing-long-term-2018-7"}
