{"authors":["Lisa Ryan For Dailymail.Com"],"date_download":"2018-10-23 04:16:52","date_modify":"2018-10-23 04:16:52","date_publish":"2016-01-11 17:18:45","description":"The CDC said while teen smoking rates are down, half of young nonsmokers are still exposed to secondhand smoke - which can cause breathing problems, pneumonia and bronchitis in children.","filename":"data/vaneerConsumption/Millionsofnonsmokingteenagersarestillatriskofseriousillness.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300D12DD00000578-0-image-a-35_1452531490582.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3394241_Millions-non-smoking-teenagers-risk-illness-secondhand-smoke-experts-warn_1540268212.html","title":"Millions of non-smoking teenagers are still at risk of serious illness","title_page":"Millions of non-smoking teenagers are still at risk of serious illness | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Nearly half of non-smoking children and teenagers are exposed to secondhand smoke, according to a government study.\nSecondhand smoke has been linked to serious illnesses in children – including breathing problems, ear infections, bronchitis and pheumonia.\nIn adults, it’s been associated with heart disease and lung cancer.\nThe Centers for Disease Control and Prevention (CDC) found close to 50 per cent of all middle and high school non-smokers encountered secondhand smoke in 2013.\nPrevious studies indicated that secondhand smoke exposure declined in recent years.\nBut, the new study suggests it’s still affecting millions of young people.\nTeenage smoking rates are down, but millions of middle school and high school students are still exposed to tobacco though secondhand smoke, according to the CDC\nLead author Dr Israel Agaku, a researcher at the CDC, said: ‘These findings are concerning because the US Surgeon General has concluded there is no safe level of secondhand smoke exposure.’\nThe study analysed survey results from more than 17,000 middle school and high school students across the US.\nExposure was defined in the survey as being around tobacco smoke at least once within the past week.\nApproximately one in four nonsmokers who reported any secondhand smoke exposure said they were around tobacco smoke daily.\nThese findings are concerning because the US Surgeon General has concluded there is no safe level of secondhand smoke exposure Dr Israel Agaku, a researcher at the CDC\nThey were exposed to smoke at home, school, in cars and at public places.\nIt’s not clear how many of them had only brief exposure.\nThe study found that rates of exposure to secondhand smoking were higher in children and teenagers who smoke.\nAccording to the CDC, youth smoking has fallen steadily in recent years.\nOnly around nine per cent of high school students were smokers in 2014.\nAt least 26 states currently have smoke-free laws that affect indoor places and worksites.\nFurthermore, more than 80 per cent of US homes have no-smoking rules.\nCDC scientists said that efforts are needed to expand smoke-free zones, which could help keep secondhand smoke away from young people.\nSecondhand smoke has been linked to illnesses in children – including breathing problems, ear infections, bronchitis (pictured) and pheumonia. In adults, it is associated with lung cancer and heart disease\nThe news comes shortly after a study from University of California, Los Angeles and the University of Illinois Urbana-Champaign suggested that teenage smokers may be hard-wired to crave cigarettes.\nUsing MRI scans, they discovered that teenage brains have a different response to seeing people smoke.\nThe findings reveal teenage smokers have heightened responses in brain regions rich in the neurotransmitter dopamine - a chemical that modulates pleasure and reward centers.\nResearchers thus concluded teenage smokers therefore are likely to have a stronger 'reward' response to cigarettes.","url":"https://www.dailymail.co.uk/health/article-3394241/Millions-non-smoking-teenagers-risk-illness-secondhand-smoke-experts-warn.html"}
