{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 21:00:14","date_modify":"2018-10-30 21:00:14","date_publish":"2016-12-23 00:00:00","description":null,"filename":"data/vaneerConsumption/Millennialscoulddrivemobilewalletadoption.json","image_url":"https://amp.businessinsider.com/images/583f1d3be02ba7e5008b6dcc-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_millennials-could-drive-mobile-wallet-adoption-2016-12_1540933214.html","title":"Millennials could drive mobile wallet adoption","title_page":"    Millennials could drive mobile wallet adoption - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII\nThis story was delivered to BI Intelligence \"Payments Briefing\" subscribers. To learn more and subscribe, please click here.\nA user's age could be a major determinant of his or her likelihood to use a mobile wallet, according to new data from a Fiserv study.\nThe study found that, overall, just 16% of the general population had used a mobile wallet. But 33% of \"late millennials\" and 36% of \"early millennials\" had done so.\nThat's a significant boost, and could point to even higher adoption coming down the line as young millennials and Gen-Z gain spending power.\nThat could be a result of increased awareness overall. Data from TSYS found that the number of users who are likely or certain to put their information into a mobile wallet rose from 2015 to 2016. And at the same time, users who are neutral or unlikely to do so are on the decline. If a user puts their information into a wallet, they might be more likely to test it in-store since they've already engaged with the product. That could help grow adoption and engagement, and ultimately help these wallets become better integrated into the spending ecosystem.\nBut there's still room to grow before these wallets hit the mainstream. The hurdles that are stopping users from paying with wallets are relatively consistent. Fiserv found that nonusers avoid mobile wallets predominately because they don't trust the security involved. And many users also prefer physical wallets or don't have use for mobile wallets.\nThat fits with Federal Reserve data from Q4 2015, which found that security concerns and lack of interest were the biggest reasons consumers didn't use the wallet. As a result, wallet providers will have to continue to work to solve these issues if they want larger percentages of consumers to adopt wallets and form habits around them.\nMobile payments are becoming more popular, but they still face some high barriers, such as consumers' continued loyalty to traditional payment methods and fragmented acceptance among merchants. But as loyalty programs are integrated and more consumers rely on their mobile wallets for other features like in-app payments, adoption and usage will surge over the next few years.\nBI Intelligence, Business Insider's premium research service, has compiled a detailed report on mobile payments that forecasts the growth of in-store mobile payments in the U.S., analyzes the performance of major mobile wallets like Apple Pay, Android Pay, and Samsung Pay, and addresses the barriers holding mobile payments back as well as the benefits that will propel adoption.\nHere are some key takeaways from the report:\nIn our latest US in-store mobile payments forecast, we find that volume will reach $75 billion this year. We expect volume to pick up significantly by 2020, reaching $503 billion. This reflects a compound annual growth rate (CAGR) of 80% between 2015 and 2020.\nConsumer interest is the primary barrier to mobile payments adoption. Surveys indicate that the issue is less the mobile wallet itself and more that people remain loyal to traditional payment methods and show little enthusiasm for picking up new habits.\nIntegrated loyalty programs and other add-on features will be key to mobile wallets taking off. Consumers are showing interest in wallets with integrated loyalty programs. Other potential add-ons, like in-app, in-browser, and P2P payments, will also start fueling adoption. This strategy has been proved successful in China with platforms like WeChat and Alipay.","url":"https://www.businessinsider.com/millennials-could-drive-mobile-wallet-adoption-2016-12"}
