{"authors":[],"date_download":"2018-10-22 22:37:25","date_modify":"2018-10-22 22:37:25","date_publish":"2014-05-11 14:13:40","description":"While the Plains expected severe storms with large hail and damaging wind, higher elevations out West were blanketed with a late-season snowstorm.","filename":"data/vaneerConsumption/MillionsinPathofPossibleTornadoesandLargeHailinPlains.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/435246/140511-tornado-damage-jms-1919_bc22eaf8afc3d7c3db3ec9eb021d17ca.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_weather_millions-path-possible-tornadoes-large-hail-plains-n102491_1540247845.html","title":"Millions in Path of Possible Tornadoes and Large Hail in Plains","title_page":"Millions in Path of Possible Tornadoes and Large Hail in Plains","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMultiple possible tornadoes were reported in Nebraska, warnings popped up across Iowa, and the governor of Missouri declared a state of emergency Sunday as a line of storms rolled through and threatened to spawn twisters and produce large hail.\nA tornado was detected near Sutton, Neb.:\nForecasters from The Weather Channel warned that 3 million people, from the Plains to the Mississippi Valley, were in the path of possible “long-track” tornadoes, with Kansas, Nebraska and Iowa facing the greatest threat.\nIn Missouri, where a tornado damaged 200 to 300 homes in the town of Orrick a day earlier, Gov. Jay Nixon issued an emergency declaration and urged people to stay alert and heed weather warnings.\nCounties in Iowa and Nebraska spent part of the day under tornado warning, but there were no early reports of heavy damage.\nTen tornadoes had already touched down during the weekend in Missouri and Indiana, bringing wind up to 120 mph, which knocked out power and damaged hundreds of homes, according to The Weather Channel’s Greg Forbes. No injuries were reported.","url":"https://www.nbcnews.com/news/weather/millions-path-possible-tornadoes-large-hail-plains-n102491"}
