{"authors":[],"date_download":"2018-10-30 18:41:56","date_modify":"2018-10-30 18:41:56","date_publish":"2016-06-10 15:44:12","description":"UPDATE: The Gwinnett County planning commission voted this week to table this proposal until its July 5 meeting.","filename":"data/vaneerConsumption/MillenialhousingproposednearbusySnellvilleintersection.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/05/16/Images/photos.medleyphoto.9784905.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_millenial-housin_9c29ab402069fdaf7801b202465024ee__1540924916.html","title":"Millenial housing proposed near busy Snellville intersection","title_page":"Millenial housing proposed near busy Snellville intersection","title_rss":"NULL","source_domain":"ajc.com","text":"UPDATE: The Gwinnett County planning commission voted this week to table this proposal until its July 5 meeting.\nORIGINAL STORY: A new rezoning proposal would pave the way for 99 single-family homes and 300 apartments near a busy Snellville intersection.\nThe apartments, planning documents said, would target young professionals and millenials.\nThe proposal for the 56-acre site on Webb Gin House Road, about a half-mile east of Scenic Highway and the popular Shoppes at Webb Gin retail center, is scheduled to be considered by the Gwinnett County planning commission at its June 7 meeting. If approved, the development would still have to go before Gwinnett's Board of Commissioners before moving forward.\n»MORE: See renderings and maps of the proposed development in the gallery above.\nAccording to documents submitted to the planning commission, part of the development would consist of 27 townhomes and 72 single-family detached homes. Both types of units would offer at least 1,150 square feet of living space.\nThe rest of the property would include \"an upscale professional housing development consisting of 300 multi-family attached residences spread throughout six buildings,\" documents said. Amenities would include \"a luxurious clubhouse that will include an executive business center and conference room, a cyber cafe with free wi-fi, a state-of-the-art fitness center [and] a resort-style saltwater pool.\"\nThe development would add to an already bustling area near Snellville. A number of restaurants -- including Cracker Barrel and Zaxby's -- are planned just down the road near Scenic Highway and Pharrs Road. A dine-in movie theater is also under construction nearby.\n»MORE: Are they doing anything to fix traffic on Scenic Highway?\nThe proposal is just one of several the planning commission is slated to consider at its next meeting. Explore other proposals in the interactive map below or by clicking here -- and remember that agendas are tentative and subject to change.","url":"https://www.ajc.com/news/local/millenial-housing-proposed-near-busy-snellville-intersection/dMVynLASKrlmN4SZCsUKtI/"}
