{"authors":[],"date_download":"2018-10-30 21:35:59","date_modify":"2018-10-30 21:35:59","date_publish":"2016-08-02 19:28:34","description":"Miami (AFP) – Young people today are not having as much sex as previous generations, despite the widespread availability of dating sites and apps","filename":"data/vaneerConsumption/Millennialshavelesssexstudy.json","image_url":"https://media.breitbart.com/media/2016/08/wi/afp_16148ed76b092648439f15ecb0e132cec378e2c4-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/news__1540935359.html","title":"Millennials have less sex: study","title_page":"Millennials have less sex: study - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Miami (AFP) – Young people today are not having as much sex as previous generations, despite the widespread availability of dating sites and apps and more accepting attitudes about premarital sex, researchers said Tuesday.\nThe study focused on younger members of the millennial generation, and found they were the most sexually inactive group since the Depression era.\n“The only other generation that showed a higher rate of sexual inactivity were those born in the 1920s,” said the study by researchers at Florida Atlantic University and published in the Archives of Sexual Behavior.\nThe report found that among Americans aged 20 to 24, those born in the early 1990s were significantly more likely to report no sexual partners after age 18 than Gen Xers born in the late 1960s.\nFifteen percent of 20- to 24-year-old American millennials reported having no sexual partners since turning 18, compared to six percent of those born in the 1960s.\n“This study really contradicts the widespread notion that millennials are the ‘hookup’ generation, which is popularized by dating apps like ‘Tinder’ and others, suggesting that they are just looking for quick relationships and frequent casual sex,” said co-author Ryne Sherman, associate professor of psychology in the Charles E. Schmidt College of Science at Florida Atlantic University.\n“Our data show that this doesn’t seem to be the case at all and that millennials are not more promiscuous than their predecessors.”\nYoung women today are about twice as likely as men to be sexually inactive, it found.\nThe study also showed that fewer young people get a driver’s license or work for pay, suggesting they “are growing up more slowly than those born in the 1980s.”\nSeparate research out earlier this year by the US Centers for Disease Control and Prevention found that 41 percent of high school students said they had ever had sex, down from 54 percent in 1991.\nSherman said the reasons for the shift are complex, but that factors may include more sex education, greater awareness of sexually transmitted diseases, easy access to pornography and perhaps differing definitions across generational lines of what sex is, whether it means oral sex or intercourse.\nSomehow, knowing more about sex and being able to see it on video has not translated into more actual sex for young people today.\n“While attitudes about premarital sex have become more permissive over time, rise in individualism allows young American adults to have permissive attitudes without feeling the pressure to conform in their own behavior,” said Sherman.","url":"https://www.breitbart.com/news/millennials-have-less-sex-study/"}
