{"authors":["Press Association"],"date_download":"2018-10-22 22:34:22","date_modify":"2018-10-22 22:34:22","date_publish":"2016-01-28 10:42:07","description":"Serial killer Levi Bellfield's shock confession to the murder of Milly Dowler has prompted police to review probes into \"a number\" of other crimes. Bellfield...","filename":"data/vaneerConsumption/Millydowlermurderconfessionsparksfreshpoliceprobes.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-P-9e65958e-82d9-4c7d-9b2e-1b9619042c0f-4vVdYopwYQ7f641721b07abfc562-534_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3420310_Milly-Dowler-murder-confession-sparks-fresh-police-probes_1540247662.html","title":"Milly dowler murder confession sparks fresh police probes","title_page":"Milly dowler murder confession sparks fresh police probes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Milly Dowler murder confession sparks fresh police probes\nSerial killer Levi Bellfield's shock confession to the murder of Milly Dowler has prompted police to review probes into \"a number\" of other crimes.\nBellfield, who was given a whole-life prison sentence in June 2011 for killing the 13 year old, made the admission for the first time during an investigation into whether he had an accomplice, Surrey Police said.\nThe Metropolitan Police confirmed it was looking at new information relating to criminal investigations, but refused to give details.\nLevi Bellfield was convicted of three murders, including that of Milly Dowler in 2002\nA spokesman said: \"The MPS is liaising with a number of other UK police forces in relation to information which has been passed on to us regarding a number of criminal investigations. That information remains subject to assessment and for that reason we will not be discussing the matter in further detail at this time.\n\"We are not prepared to discuss at this time the number of investigations or details of any case.\"\nBellfield has been linked to several other crimes.\nAt the time of his conviction in June 2011, detectives said they believed Bellfield may have been responsible for around 20 attacks on women which were never solved.\nThese included the killing of Judith Gold, who was hit over the head in Hampstead, north London, in 1990, and Bellfield's schoolfriend Patsy Morris, 14, who was strangled on Hounslow Heath, west London, in 1980.\nAnna Maria Rennie identified Bellfield as the man who tried to force her into a car in Whitton, west of London, when she was just 17 in October 2001. But the jury at Bellfield's 2008 trial for the murders of two other women could not agree and the charge was left on file.\nAttempts for a retrial for attempted kidnap failed when Miss Rennie refused to attend court.\nBellfield was already in jail for the murders of Amelie Delagrange and Marsha McDonnell, and the attempted murder of Kate Sheedy, when he went on trial accused of killing Milly.\nIn 2008, he had been given a whole life term for murdering Ms McDonnell, 19, in 2003, and murdering Ms Delagrange, 22, and attempting to murder Ms Sheedy, 18, in 2004.\nMilly was snatched from the street while on her way from school to her home in Walton-on-Thames, Surrey, in March 2002.\nHer body was found in a wood in Yateley Heath, Hampshire - 25 miles from Walton-on-Thames.\nBellfield, 47, who now calls himself Yusuf Rahim, lived 50 yards from where Milly vanished but did not become a suspect until he was arrested by police in London for the other crimes in 2004.\nHe was found guilty of abducting and killing Milly following a trial at the Old Bailey before he lost a bid i n February 2012 to challenge his conviction at the Court of Appeal in London.","url":"https://www.dailymail.co.uk/wires/pa/article-3420310/Milly-Dowler-murder-confession-sparks-fresh-police-probes.html"}
