{"authors":["Sami Mokbel For Mailonline"],"date_download":"2018-10-23 01:44:26","date_modify":"2018-10-23 01:44:26","date_publish":"2017-03-10 10:13:42","description":"Who'll score the last ever FA Cup goal at White Hart Lane? Harry Kane? Dele Alli? But what about Shaun Cummings? Seems unlikely, of course. The Millwall star's hardly a regular on the scoresheet.","filename":"data/vaneerConsumption/MillwalldefenderShaunCummingseyesTottenhamscalp.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3BED2E8D00000578-0-image-a-15_1489140463372.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4300630_Millwall-defender-Shaun-Cummings-eyes-Tottenham-scalp_1540259066.html","title":"Millwall defender Shaun Cummings eyes Tottenham scalp","title_page":"Millwall defender Shaun Cummings eyes Tottenham scalp | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Who'll score the last ever FA Cup goal at White Hart Lane? Harry Kane? Dele Alli? But what about Shaun Cummings? Seems unlikely, of course.\nThe Millwall star's hardly a regular on the scoresheet, the defender spending his time stopping goals rather than scoring.\nIndeed, the Jamaica international has just two goals this season. But hold on.\nMillwall defender Shaun Cummings has scored two FA Cup goals so far already this season\nThe 28-year-old defender says beating Premier League sides have given Millwall confidence\nBoth those strikes have come in the FA Cup - his latest that euphoric last minute winner against Leicester in the previous round.\nThe idea doesn't sound so silly now does it? 'Scoring the last cup goal there (White Hart Lane)? Of course, that would be nice,' Cummings told Sportsmail.\n'To be honest, I don't remember too much about the goal against Leicester - I didn't even know it was in the 90th minute until I looked up at the screen.\n'But I know it was a very good feeling and doing it again this weekend would be great, of course.\nCummings scored a last-minute winner in the FA Cup fifth-round against Leicester City\nSpurs boss Mauricio Pochettino will be wanting a positive FA Cup farewell at White Hart Lane\n'But I don't care who scores, even if it's an own goal, as long as we get the victory.\n'We've got the confidence to go and get a result there. Since the third round all our victories have come against Premier League opposition so that gives us confidence.\n'We've done it the hard way. We know it's going to be tough, but it's a game of football. We want to make history at White Hart Lane on Sunday.'\nCausing a shock on White Hart Lane's FA Cup farewell will be easier said than done, however. Mauricio Pochettino's side are hunting down Chelsea at the top of the Premier League and on a run of nine consecutive home wins.\nCummings said: 'Look, we know they are a very good team with a very good manager. And they seem to be getting better and better. They deliver every week.\nStriker Harry Kane is set to face one of the clubs he played at during his time spent out on loan\nCummings has been impressed by the level of consistency shown by Spurs this campaign\n'They are playing near enough a full strength team in the FA Cup so we know we will be up against it.\n'We know we have to be hard to break down, that's the game plan. We have to limit their opportunities.'\nCummings added: 'The FA Cup is still a very special competition. Especially for people of my generation in their late 20s, early 30s.\n'It's always been a special competition to be part of. People say it's not as important anymore - particularly with the Champions League and the Premier League being as big as it is. But it's special to me.'","url":"https://www.dailymail.co.uk/sport/football/article-4300630/Millwall-defender-Shaun-Cummings-eyes-Tottenham-scalp.html"}
