{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 18:19:24","date_modify":"2018-10-30 18:19:24","date_publish":"2016-03-31 17:40:37","description":"A Texas high school teacher recently used a video of Breitbart's Milo Yiannopoulos to discuss the recent terror attacks in Brussels, Belgium.","filename":"data/vaneerConsumption/MiloYiannopoulosStudiedinTexasHighSchool.json","image_url":"https://media.breitbart.com/media/2016/01/milo-twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_03_31__1540923564.html","title":"Milo Yiannopoulos Studied in Texas High School","title_page":"Milo Yiannopoulos Studied in Texas High School | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Texas high school teacher recently used a video of Breitbart Tech editor Milo Yiannopoulos in a lecture to discuss current events and the recent terror attacks in Brussels, Belgium.\nAn instructor at St. John XXIII College Preparatory School in Katy, Texas, used a video of Yiannopoulos’ recent appearance on The Rubin Report to facilitate a discussion on current events and the recent terror attacks in Brussels. The attacks, which claimed 34 lives, have stirred up conversations on political correctness and radical Islam.\nBlake Smith, a student in the class, told Breitbart that his teacher “is actually a big fan of Milo.” The teacher provided the class with a worksheet for the students to respond to the comments made by Yiannopoulos in regards to the attacks in Brussels.\n“Why are we surprised that Muslims are blowing things up? That’s what they do,” Yiannopoulos claimed. “I don’t care about that, you know it’s horrific for the people who are on the receiving end of this terrorist stuff, but is anybody surprised that ISIS blew something up? No.”\n“It is not the people that the security service are worried about that’s the problem, it is the silent majority of Muslims who do nothing in this situation, have no peace movement, have no resistance to their own extreme elements, just like the progressive left in the West,” Yiannopoulos continued. “Is it eleven countries that you and I could be killed for who we are? That’s not ISIS, that is mainstream Muslim culture, and we are importing that stuff into Europe in millions.”\nTom Ciccotta writes about Free Speech and Intellectual Diversity for Breitbart. You can follow him on Twitter for @tciccotta.","url":"https://www.breitbart.com/tech/2016/03/31/milo-yiannopoulos-studied-in-texas-high-school/"}
