{"authors":["Lucas Nolan"],"date_download":"2018-10-30 18:16:57","date_modify":"2018-10-30 18:16:57","date_publish":"2016-07-07 15:23:14","description":"\"There's nothing irrational about fearing trannies, they're f***ing terrifying\" said Milo Yiannopoulos on The Joe Rogan Experience.","filename":"data/vaneerConsumption/MiloOnJoeRoganNobodyBelievesTransWomenAreWomen.json","image_url":"https://media.breitbart.com/media/2016/07/015_1024-e1467902166652.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/social-justice_2016_07_07__1540923417.html","title":"Milo On Joe Rogan: Nobody Believes Trans Women Are Women","title_page":"Milo On Joe Rogan: Nobody Believes Trans Women Are Women | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Breitbart Tech editor Milo Yiannopoulos appeared on the Joe Rogan Experience this week to discuss a range of topics including sexuality, why “transphobia” is normal and the censorship of the Orlando shooter’s 911 call.\nWhile discussing transgender issues, Milo said “there’s nothing irrational about fearing trannies, they’re f***ing terrifying …. I’m serious! They’re so scary!”\nElaborating on transgender rights, Milo said “I can’t get behind it, [the left] has forced us to take a moral position on a medical issue. This is not a moral issue this is a medical issue. If it is the case that people have a disorder or condition or dysphoria or whatever word they want to come up with for it, that means they were born with the wrong brain in the wrong body, never mind the fact that we’re always told that gender is socialised, apparently now abruptly you can have such a thing as a male brain.”\nHost Joe Rogan sarcastically replied, “Gender is a social construct Milo!”\nMilo’s continued, saying “unless you’re trans in which case you have a male brain in a female body. What a load of crap, do these people really expect us to believe this sh*t? They think that we have the same level of cognitive dissonance that they have.”\n“They think that we are as dumb as they are, they think that we don’t think things through like they don’t think things through. Well we do, we do think these things through and so do most people at home. And they’re told on one hand, if they manage to get this far into a Guardian editorial, that gender is a social construct and all of this kind of stuff and at the same time that masculinity is toxic and at the same time you can have a male brain.”\n“The trans movement is profoundly anti women because all it seems to be demonstrating is that men are better at being women than women are. Look at Caitlyn Jenner, woman of the year.”\n“The left is getting overconfident and it’s enforcing this stuff on people. Now if you don’t want to be a bigot and lose your job and lose your newspaper column and not appear on TV anymore and become persona non grata, you have to tell lies that you know aren’t true, that everybody knows aren’t true. For instance, that Caitlyn Jenner is a woman. Nobody believes that. No one.”\n“Nobody believes this but you have to say it, it’s so wrong. And when you realise what their real motivations are you understand why they don’t care about the science. And why they’re not interested in exploring what we were discussing, different treatment pathways, they don’t care. They want to tear down everything, they want to deconstruct the difference between men and women because they cannot cope with the fact that women aren’t as good at some things as men.”\n“Well, by the way, men aren’t as good at some things as women but you don’t talk about that because that doesn’t suit your narrative because you want to paint women as victims all the time. They want to pull apart and destroy everything.”\nYou can watch Milo’s full appearance on the Joe Rogan Experience below.","url":"https://www.breitbart.com/social-justice/2016/07/07/milo-joe-rogan-nobody-believes-trans-women-women/"}
