{"authors":["Lucas Nolan"],"date_download":"2018-10-30 18:16:04","date_modify":"2018-10-30 18:16:04","date_publish":"2016-07-11 21:21:55","description":"Milo Yiannopoulos appeared on Breitbart News Sunday on Sirius XM Patriot 125 to discuss the left’s view of America.","filename":"data/vaneerConsumption/MiloTheLeftDoesntLikeAmerica.json","image_url":"https://media.breitbart.com/media/2016/06/milo-orlando.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/social-justice_2016_07_11__1540923364.html","title":"Milo: 'The Left Doesn't Like America'","title_page":"Milo: 'The Left Doesn't Like America' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Breitbart Tech editor Milo Yiannopoulos appeared on Breitbart News Sunday on Sirius XM Patriot 125 to discuss the left’s view of America, Donald Trump’s attack ad on Hillary Clinton, and Milo’s upcoming college tour.\nHost of Breitbart News Sunday on Sirius XM Patriot 125 and Breitbart Editor-In-Chief, Alex Marlow, mentioned a caller he had previously had on the show and how it had clarified the regressive left’s genuine contempt for the American way of life. He asked Milo his opinion on the matter as a foreigner who loves America.\n“The left doesn’t like America, not a bit but at all, and the ways that you say that they’re trying to undermine and transform America, it’s very clear to me that’s what’s happening,” Yiannopoulos responded. “Is this guy paying attention to what’s happening in the media? With the war on men, it’s acceptable in the mainstream outlets to say ‘masculinity so fragile’ and ‘kill all white men, I bathe in male tears’ and this sort of stuff is endorsed by major media publications in the country.”\n“If you’re paying attention to what’s happening on university college campuses, the complete breakdown of free speech, the fundamental principle on which America is built, the 1st Amendment,” he continued. “Is he paying attention to what’s happening to the 2nd Amendment, after every one of these horrible attacks, no matter who it is, Obama wants to move further in the direction of gun free zones and gun control that will make people less safe not more safe? It seems to me that it’s very clear that the left is on a mission to change America fundamentally and to uproot many of its founding principles.”\nDiscussing the “star of David” tweet that presumptive GOP presidential candidate Donald Trump retweeted, Marlow asked Milo his opinion on the tweet as someone who is part Jewish.\n“This is so ridiculous, you can tell from the reaction, and it’s not very often Trump or someone connected to Trump rolls back from something, you can tell from the reactions they tried to cover it over with a circle or something, I mean come on!” Yiannopoulos responded. “Press is not populated by adults, that’s one thing you have to understand if you want to really work out what’s happening in America today and who really are the bad guys and what are the things that you should truly be outraged over, and there are some, and the things you should let pass you by. Our press is populated with children and children don’t understand context, they don’t understand nuance and they leap on weird things as an excuse to be able to do what they want and yell at their parents.”\nWhen discussing Milo’s upcoming college tour, Milo said, “So the Dangerous Faggot tour will be starting again bigger and better, we’re gonna have a tour bus, gonna have a whole team, I’ve got costumes planned, it’s going to be wonderful. We’re starting again in September we have thirty dates to confirm so far, there’s more to come, big colleges, I’m going to do Yale which I’m looking forward to.”\nListen to the full episode below:","url":"https://www.breitbart.com/social-justice/2016/07/11/milo-breitbart-news-sunday-left-doesnt-like-america/"}
