{"authors":["Tom Ciccotta"],"date_download":"2018-10-30 18:18:21","date_modify":"2018-10-30 18:18:21","date_publish":"2016-04-26 13:02:05","description":"Milo Yiannopoulos, Steven Crowder, and Christina Hoff Sommers fought off student protesters who continuously attempted to silence their right to speak.","filename":"data/vaneerConsumption/MiloMocksStudentProtestersWhoClaimHisPresenceIsaThreattoTheirPhysicalSafetyatUMass.json","image_url":"https://media.breitbart.com/media/2016/04/milo-light.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_04_26__1540923501.html","title":"Milo Mocks Student Protesters Who Claim His Presence Is a 'Threat to Their Physical Safety' at UMass","title_page":"Milo Mocks Student Protesters Who Claim His Presence Is a 'Threat to Their Physical Safety' at UMass | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In a packed auditorium at the University of Massachusetts on Monday night, Breitbart Tech editor Milo Yiannopoulos, comedian Steven Crowder, and former philosophy professor Christina Hoff Sommers fought off a crowd of student protesters who continuously shouted in an attempt to silence their right to speak.\nThe event was hosted by the UMass College Republicans in the University’s sizable Bowker Auditorium. Although most of the seats were filled by students eager to listen to the speakers, a few troublemakers who slipped into the event tried to silence the panelists by shouting and yelling.\nWhen Yiannopoulos stepped onto the stage for his introduction, he received a mixture of cheers and boos. Like most of his events, Yiannopoulos kept his introduction brief in an effort to leave more time for questions from students.\n“Feminism is cancer. Thank you very much,” Yiannopoulos said before he stepped away from the podium.\nMilo reacts to footage of his protesters pic.twitter.com/U8547bi2Yj — Mike Ma (black) (@MikeMa_) April 26, 2016\nComedian Steven Crowder didn’t respond kindly to the rude behavior from the student protesters, quickly calling them “silly liberal fruitcakes” for their attempts to yell over him and the other panelists. After one of the protesters called Crowder a “racist,” he quickly dismissed the student and accused him of simply regurgitating his professor’s criticisms of conservatives.\npeaceful protestors at UMass tonight pic.twitter.com/c8Pvx5F54m — Mike Ma (black) (@MikeMa_) April 26, 2016\nCrowder reminded the student protesters that the Yiannopoulos’ “Dangerous Faggot Tour” was created in response to the type of behavior they were exhibiting by attempting to stifle free expression: “This monster right here that you’re so afraid of – the face you see in your nightmares, was created by social justice warrior a**holes like you.”\nThe topic of the event was political correctness. Amongst the panelists, the overarching theme was that political correctness is a device used by regressive leftists to win debates without having to make an argument.\nSpeaking over the protesters’ shouting, Sommers called political correctness “an effort to impose a political agenda without having to argue.” Yiannopoulos criticized the students who have claimed throughout his tour that his presence on campus “is a threat to their physical safety,” calling them “f**king idiots.” Speaking about the shouting protesters, Crowder said “do you want to know what political correctness is? Look around and listen. These people don’t have arguments. They just yell out ‘racist.’ And they call the [Milo], who has a fetish for black dudes, a racist homophobe.”\nDespite the chaos, students took to social media after the event to express their satisfaction with the event.\nMet @Nero tonight, so worth the 2 hour drive. The SJW were no match tonight. Thanks for coming #daddy pic.twitter.com/14gPVrfwy4 — Bobby Legend (@BKliskeyDECA) April 26, 2016\nA lighter portion of the event involved Yiannopoulos’ explaining the variations of feminist jazz hands, because “even the standard jazz hands can be triggering for some.” Jazz hands are often used at feminist and social justice warrior gatherings because they claim that clapping can cause anxiety.\nTom Ciccotta writes about Free Speech and Intellectual Diversity for Breitbart. You can follow him on Twitter @tciccotta or on Facebook. You can email him at tciccotta@breitbart.com","url":"https://www.breitbart.com/tech/2016/04/26/milo-mocks-student-protesters-who-claim-his-presence-is-a-threat-to-their-physical-safety-at-umass/"}
