{"authors":["Lucas Nolan"],"date_download":"2018-10-30 19:12:06","date_modify":"2018-10-30 19:12:06","date_publish":"2017-01-05 20:17:00","description":"Breitbart Senior Editor MILO has been named LGBTQ Nation’s 2016 person of the year, an award for the “top newsmaker” in the LGBTQ community.","filename":"data/vaneerConsumption/MILONamedLGBTQNations2016PersonOfTheYear.json","image_url":"https://media.breitbart.com/media/2017/01/Jan5-640b.jpeg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/social-justice_2017_01_05__1540926726.html","title":"MILO Named LGBTQ Nation's 2016 Person Of The Year","title_page":"MILO Named LGBTQ Nation's 2016 Person Of The Year | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Breitbart Senior Editor MILO has been named LGBTQ Nation’s 2016 person of the year, an award for the “top newsmaker” in the LGBTQ community.\nMILO beat Vice President-elect Mike Pence for the top vote, receiving 70,000 votes, over 80% of all votes. Pence also received a formidable 23,000 votes.\nLGBTQ Nation say interview with MILO will be released next week. In their announcement of the award, LGBTQ Nation noted some of the allegedly “awful” reasons why MILO made the news in 2016, before acknowledging the Breitbart senior editor’s ability to influence the news cycle.\nYiannopoulos made the news throughout 2016 and always for truly awful reasons. He was a queer cheerleader for Donald Trump, whom he called “Daddy.” He has harassed and demeaned transgender people repeatedly.\nHate him or love him, one thing Yiannopoulos truly excels at is getting attention for himself and his causes. If he decides to highlight an issue, his fans will follow his every word on the subject and more often than not, it’ll get moved to a mainstream audience as the story picks up steam from online chatter. For a gay guy from Britain, he has truly made his mark on conservative American politics and entertainment. He’s been able to brand himself the ultimate gay provocateur in a year of provocateurs.\nYiannopoulos, however, wanted to add to his list of accomplishments in 2016, telling LGBTQ Nation his list included, “My banishment from Twitter, recently announced book deal (pre-order now!), cross-country college tour, my jawline, and a really cute Siberian fox & sable fur I just snapped up.”","url":"https://www.breitbart.com/social-justice/2017/01/05/milo-named-lgbtq-nations-2016-person-year/"}
