{"authors":["Ben Kew"],"date_download":"2018-10-30 18:17:12","date_modify":"2018-10-30 18:17:12","date_publish":"2016-07-20 02:22:14","description":"Breitbart's Milo Yiannopoulos has been permabanned from Twitter just 20 minutes before his “Gays for Trump” event at the GOP Convention.","filename":"data/vaneerConsumption/MiloSuspendedPermanentlybyTwitterMinutesBeforeGaysForTrumpPartyAtRNC.json","image_url":"https://media.breitbart.com/media/2016/07/Milo-714-e1470763830992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/social-justice_2016_07_19__1540923432.html","title":"Milo Suspended Permanently by Twitter Minutes Before 'Gays For Trump' Party At RNC","title_page":"Milo Suspended Permanently by Twitter Minutes Before 'Gays For Trump' Party At RNC | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Breitbart Tech editor Milo Yiannopoulos has been suspended from Twitter once more just 20 minutes before his “Gays for Trump” event takes place at the Republican National Convention.\nThe justification for the suspension is currently unknown, although it could be as a result of Milo’s run-in with Ghostbusters actress Leslie Jones on the site. Twitter CEO Jack Dorsey publicly reached out to Jones late on Monday evening after she complained about “abuse” on the platform. Milo was suspended despite the fact that he sent no abusive tweets to the actress.\nBuzzFeed gleefully reported that the suspension is permanent, citing a statement from Twitter promising a clampdown on “targeted abuse.” Milo has also received a message from Twitter confirming that that his ban is permanent, copied below.\nThe statement also promises to tackle “hateful” conduct, in the wake of widespread media condemnation of racist tweets sent to Leslie Jones. However, it remains to be seen whether Twitter will take any action against Jones’ own racially hateful tweets, seen below and archived here.\nLord have mercy…white people shit — Leslie Jones (@Lesdoggg) February 9, 2015\nIn a comment, Milo said “With the cowardly suspension of my account, Twitter has confirmed itself as a safe space for Muslim terrorists and Black Lives Matter extremists, but a no-go zone for conservatives.”\n“Twitter is holding me responsible for the actions of fans and trolls using the special pretzel logic of the left. Where are the Twitter police when Justin Bieber’s fans cut themselves on his behalf?”\n“Like all acts of the totalitarian regressive left, this will blow up in their faces, netting me more adoring fans. We’re winning the culture war, and Twitter just shot themselves in the foot.”\n“This is the end for Twitter. Anyone who cares about free speech has been sent a clear message: you’re not welcome on Twitter.”\nTwitter, a company in dire financial trouble, has developed a reputation for draconian, onesided and often-unexplained suspensions of conservative users.\nMeanwhile, the platform has demonstrated an unashamed bias towards progressive causes like Black Lives Matter, ignoring open calls for violence against police officers that emerged following both the Dallas and Baton Rouge shootings.\nIn further indication of its political biases, Twitter also let death threats against Republican Senators remain on the platform for months without taking action.\nPrevious attempts to punish Milo have generated huge backlashes from conservative users, and this one – Twitter’s most severe clampdown on the Breitbart senior editor so far – may generate the biggest yet.\nSupporters of Milo, who had more than 338,000 followers on Twitter prior to his suspension, have created the #FreeMilo and #FreeNero hashtags on the platform in protest at Twitter’s latest attack on the conservative commentator. It is currently accumulating approximately 20-30 tweets a minute. Unless Twitter artificially suppresses the hashtag, it’s likely to stay trending throughout the night.\nI received death threats for weeks from currently active accounts for posting an Israeli flag, yet @Nero gets banned over a review #FreeMilo — Kassy Dillon (@KassyDillon) July 20, 2016\nYou put yourself out there online, you're going to get hate. Deal with it or remove yourself from Internet. #freemilo — Julie Borowski (@JulieBorowski) July 20, 2016\nWord is @Nero has been permanently banned from Twitter. This was done right as his #RNCinCLE party was beginning – a calculated strike. — Mike Cernovich (@Cernovich) July 20, 2016\ndon't believe a damn word @twitter says about combating harassment. they only target accounts that rock their progressive boat#FreeMilo — Vey (@VeyGraphics) July 20, 2016\nWhat a ridiculous standard @twitter set. If we are held responsible for the tweets of any of our followers, why have any at all? #freemilo — Sheila Gunn Reid (@SheilaGunnReid) July 20, 2016\nSuspending the top gay conservative voice of the world?? Great move @jack, Very tolerant of you!!#FreeMilo — Baked Alaska™ (@bakedalaska) July 20, 2016\nMilo's ban confirms it: acid tongued conservatives are the only effective revolutionaries left. #FreeMilo — Stefan Molyneux (@StefanMolyneux) July 20, 2016\nTo be crystal clear, they're really coming for Milo because of his political beliefs. This is just the beginning.#FreeMilo — Dave Rubin (@RubinReport) July 20, 2016\n#FreeMilo is currently trending in the United States, at number 6 and rising rapidly.\nYou can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at ben@yiannopoulos.net.","url":"https://www.breitbart.com/social-justice/2016/07/19/breaking-milo-suspended-twitter-20-minutes-party/"}
