{"authors":["Charlie Nash"],"date_download":"2018-10-30 18:14:49","date_modify":"2018-10-30 18:14:49","date_publish":"2016-09-02 17:38:42","description":"Breitbart's Milo Yiannopoulos managed to troll Hollywood feminists in an ABC Nightline feature about ... trolling!","filename":"data/vaneerConsumption/MiloRoastsJonesDunhamSchumeronABCNightlineNoOneLikesThem.json","image_url":"https://media.breitbart.com/media/2016/09/pasted_image_at_2016_09_02_11_52_am-Cropped.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/social-justice_2016_09_02__1540923289.html","title":"Milo Roasts Jones, Dunham, Schumer on ABC Nightline: ‘No One Likes Them’","title_page":"Milo Roasts Jones, Dunham, Schumer on ABC Nightline: ‘No One Likes Them’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Breitbart’s Milo Yiannopoulos managed to troll Ghostbusters actress Leslie Jones and comedian Amy Schumer on national television during an ABC Nightline feature on … trolling!\n“Are you a troll?” asked ABC News Chief Foreign Correspondent, Terry Moran.\n“Of course” Milo replied with a smirk.\n“You called her a dude” responded Moran. “If Leslie Jones were right here, would you say ‘you look like a dude’?”\n“Yeah, probably” proclaimed Milo.\nMoran repeated the question in shock, and Milo reiterated his answer, repeating “Yeah, probably. I probably would.”\n“In the Twitter storm that happened, you called her a dude” said Moran.\n“I said it’s a good job there’s a hot black dude in the movie. She looks like a man” claimed Milo. “I am entitled to say I think a celebrity looks weird.”\n“You think that’s fair comment and a decent thing, a civil thing to do?” Moran asked, still in awe at Milo’s answers.\n“Of course it’s fair comment. That’s like the definition of fair comment” replied Milo. “May not be the civil thing to do, but if you don’t like it, don’t follow me on Twitter”.\nUpon being asked about his views on “body positivity”, Milo then set the ironsights on plus-size celebrity and “comedian” Amy Schumer.\n“It is insisted upon us that we all pay obeisance to the cult of Lena Dunham and Amy Schumer that are put on the cover of magazines, and we’re all expected to pretend that we like them” declared Milo. “Well, we don’t.”\nWhen Moran suggested that he enjoyed Amy Schumer’s comedy, Milo displayed a look of horror and disgust.\n“Nobody likes her” he replied.\nMoran continued with his praise of Schumer, leading to further disparagement from Milo.\n“Oh, please. Oh god… Then you must have very low standards for comedy” Milo interrupted.\n“Not very much makes me laugh with Amy Schumer. These are terrible, talentless people that we are instructed we must like, and the sort of sub-text is that if you don’t like them you’re some kind of bigot somehow.”\nYou can watch the full segment here.\nCharlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.","url":"https://www.breitbart.com/social-justice/2016/09/02/milo-abc-nightline-id-call-leslie-jones-dude-face/"}
