{"authors":[],"date_download":"2018-10-30 01:21:44","date_modify":"2018-10-30 01:21:44","date_publish":"2018-07-31 11:21:39","description":"Americans used to mind their own business. Now, everyone feels the need to investigate and destroy people with whom they disagree. It needs to stop.","filename":"data/vaneerConsumption/MindYourOwnDamnBusiness.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/07/5055510508_fc32ed8013_b.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862504.html","title":"Mind Your Own Damn Business","title_page":"Mind Your Own Damn Business %The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"We are a nation of meddlesome Americans. It was not always thus. There was a time when Americans did not nark on their neighbors. They didn’t inform on their coworkers. They have not, historically, been the comrades in a communist regime whispering, seeking favor from the authorities, and sending hated enemies to the gulag for minor infractions just for spite. Something in the last generation has changed. Americans have turned into a nation of busybodies, harassing strangers on the web, calling the police or their places of business, and generally feeling entitled to destroy someone with whom they disagree.\nWho needs Big Brother when anonymous strangers will seek to silence, defame, shame, and ruin innocent people when their target violates their personal moral code, not the law and not good sense?\nThere are a couple forms of this destruction. Over the weekend, I read two articles, both detailing the menacing behavior of people who should have just minded their own damn business. It is a lost American art, and it needs to come back now as innocent people are having their lives unnecessarily upended.\nExhibit A: A mom who left her 4 year old playing a game in the car while she ran in to the store for a couple minutes was ratted out to the police by an anonymous lady, via the New York Times:\nWhat happened began over a year before on a cool March day in 2011, at the end of a visit with my parents in Virginia. I needed to run an errand before our flight home to Chicago, and my son, then 4, didn’t want to get out of the car. “Come on,” I said. “No, no, no! I wait here.” I took a deep breath. I knew what I was supposed to do. But I was tired. I was late. I didn’t want, at that moment, to deal with a meltdown. And there was something else: a small, quiet voice I’d been hearing more and more lately. “Why?” the voice asked. Why did I have to fight this battle? He wasn’t asking to Rollerblade in traffic. He just wanted to sit in the car. Why couldn’t I leave him, just this once? If it had been warm out, I would have said no. I knew about how quickly a closed car can overheat, even on a 60-degree day. But it was cool and cloudy. I’d grown up in that same town in the 1980s and had spent hours waiting in the back seat of my parents’ station wagon, windows open, reading or daydreaming, while they ran errands. Had so much really changed since then So I told him I’d be right back. I cracked the windows and child-locked the doors and set the alarm. When I got back five minutes later, he was still playing his game, smiling. We picked up his sister and our suitcases back at my parents’ house and caught our flight home. It took me a while to figure out what had taken place in the parking lot — that a stranger had watched me go into the store, recorded my son, recorded the license plate on my mother’s car and called 911. [Editor’s note: The woman could have offered to watch the child just as easily, or quietly done so.]\nExhibit B: A woman left a comment about the dumb kids taking selfies at Auschwitz and saying that kids are dumb and shouldn’t pay the price for the rest of their lives, via Gizmodo:\nBut in September 2015, [Monika Glennon] she was suddenly plunged into an American nightmare. She got a call at 6 a.m. one morning from a colleague at Re/Max telling her something terrible had been posted about her on the Re/Max Facebook page. Glennon thought at first she meant that a client had left her a bad review, but it turned out to be much worse than that. It was a link to a story about Glennon on She’s A Homewrecker, a site that exists for the sole purpose of shaming the alleged “other woman.” The author of the Homewrecker post claimed that she and her husband had used Glennon as their realtor and that everything was going great until one evening when she walked in on Glennon having sex with her husband on the floor of a home the couple had been scheduled to see. The unnamed woman went into graphic detail about the sex act and claimed she’d taken photos that she used to get everything from her husband in a divorce. The only photo she posted though was Glennon’s professional headshot, taken from her bio page on Re/Max’s site. …. She was mystified as to the post’s author. She thought it could be a rival realtor, or an acquaintance who was angry at her. “I was looking at every person in my life and every stranger and wondering who did it to me and why,” Glennon told me by phone. “It makes you rethink every relationship in your life.” Eventually, after $100,000 in attorney’s bills, Glennon was able to unmask the culprit. It turned out to be a complete stranger who had been offended by a comment Glennon had made about a news article on Facebook.\nNotice the similarity? In both cases, complete strangers distorted innocent activities by their fellow Americans and decided to invade someone else’s life. Destroy someone’s life.\nWhat happened to minding one’s own business? When did American life so completely change?\nA few things have happened. In a small town, everyone knows the Town Gossip, the Church Biddy, the loose-lipped Guttersnipe, the Babbling Drunk. These folks were the exceptions to the rule of minding your own business. Either through overt meanness or carelessness, a gossip passed along their stories at the knitting circle or at the bar. And while these people were often disliked, they were a known quantity and could be avoided. Or, the person who heard a tall tale from these folks could filter the contents through the lens of knowing the character assassin’s tendencies. With the flat interaction online, filtering for character of a person on a Facebook page or fact-checking the veracity of a character assassin is impossible. An anonymous tip to a cop? Well, he’s gotta respond to nosy nellie… even though the evidence is a happy kid in a car.\nAnother change happened, too: More mothers are in the workforce, so fewer parents are at home. Even suburban neighborhoods are sometimes empty, save for one or two houses. People don’t know their neighbors and they don’t know the kids and they don’t interact with anyone. It’s easy to call the cops on people one doesn’t know. It’s less effort to be tattletale than a good neighbor.\nPublic shaming is now high art to be praised. People go onto the internet, take a picture, and write a post about some heinous sin that must be stopped: Like the crime of the peanut butter sandwich. Remember the mother who decided that the world needed to stop for her allergic kid? She wrote a Letter to the Mother at Target who fed her kid the peanut butter and jelly sandwich. The offended mom of the bubble boy had to express her very important rebuke? Oh yes, she had to. Here’s her ridiculousness:\nAs the mom of a 7-year-old with a life-threatening peanut allergy, I couldn’t help but wonder what I would say if I ever had the opportunity to speak with you directly. I read that you weren’t too thrilled about being “lectured” by another shopper about why the sandwich was such an issue. While you may never even read this, there are things I really want you to know and understand. I don’t want to “lecture” you, too; I just want to talk — mom to mom — because we’ve all made mistakes.\nReally? The mom who fed her kid a PB&J made a mistake? Not you, the sanctimonious scold?\nIf the kid is too sensitive to go to Target and breathe peanut dust, maybe he shouldn’t go anywhere. The world doesn’t need to change for him. He needs to prepare for a harsh, cold world. And his mother needs to tend to her business.\nAmericans need to go back to minding their own damn business. It’s not your business if someone wears a MAGA hat. It’s not your business if someone wears a Che shirt (though they do reveal themselves as morons and it’s okay to giggle). It’s not your business if a parent lets her kid play in the park across the street or take a walk or play in his own yard. It’s not your business if a kid is in a car playing a video game on a mild fall day. It’s not your business to be judge and jury to a commenter on Facebook or Twitter. Keyboard commando vigilantes might well expend some effort to better their own lives rather than seek some benign social media user to destroy.\nIt is none of your damn business. Mind your own business. Tend your own little catastrophe that’s called life. Fix your problems, your family’s problems, and if you’re so damn concerned about the world, volunteer and serve someone.\nWhat a narcissistic, overly sensitive, bitchy culture America has become. That is not what America used to be. Americans prized their independence, and the independence of their friends and neighbors. They might not agree with them, but it was none of their business.\nJust mind your business. It’s the American way.","url":"https://spectator.org/americans-need-to-mind-their-own-damn-business/"}
