{"authors":[],"date_download":"2018-10-22 21:30:17","date_modify":"2018-10-22 21:30:17","date_publish":"2014-06-05 17:16:55","description":"Protection is usually given to sites of biological or cultural importance, but only five site have been covered for geological significance.","filename":"data/vaneerConsumption/MineralSiteKeytoAntarcticasHistoryGetsProtectedStatus.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/489856/140605-antarctica-jms-2349_c884560ae0722f1821e0110172832f6a.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_mineral-site-key-antarcticas-history-gets-protected-status-n123701_1540243817.html","title":"Mineral Site Key to Antarctica's History Gets Protected Status","title_page":"Mineral Site Key to Antarctica's History Gets Protected Status","title_rss":"NULL","source_domain":"nbcnews.com","text":"Geological analysis shows that one billion years ago, the nearby Stornes Peninsula was a shallow inland basin, rich in boron and phosphorus, the key chemical constituents of the rare minerals.\nAt the time of their discovery, four of the minerals - boralsilite, stornesite, chopinite and tassieite - were new to science, while the rest were extremely rare elsewhere.\n\"It's fantastic to see these extremely unusual, unique minerals being protected, and being recognized for their geological significance,\" Chris Carson, the head of Australia's Antarctic Geoscience program, told Reuters.\nCarson, who helped map the area more than 10 years ago, collected small samples of rock that were taken to Australia for analysis, to yield insights into the geological processes that led to the evolution and formation of Antarctica.\n\"Geological features are extremely valuable to science and to our understanding of how Antarctica has evolved and developed over millions of years,\" Carson said.\n\"We can actually say things about this sedimentary basin in Stornes Peninsula that we can't say about anywhere else.\"\nEnvironmental protection status in Antarctica is usually given to sites of biological or cultural importance, but only five sites, in total, have been covered for geological significance.\nThe protection includes curbs on use of surface vehicles and survey markers, as well as construction activity. Access to each site is to be restricted through the use of a permit system, with limits on the numbers of samples taken.\nAustralia led the protected area proposal, which was jointly sponsored by other nations with research programs in the area, including China, India and Russia.\nMuch of Antarctica is protected by the 1959 pact, which has the backing of major powers including the United States and China. It bars nuclear explosions, radioactive waste disposal and military deployment, and sets environmental safeguards.\n-- Reuters","url":"https://www.nbcnews.com/science/environment/mineral-site-key-antarcticas-history-gets-protected-status-n123701"}
