{"authors":[],"date_download":"2018-10-22 21:24:09","date_modify":"2018-10-22 21:24:09","date_publish":"2016-01-28 07:35:26","description":"Mining mogul Gina Rinehart has lost her crown as Australia's wealthiest person to a \"reclusive\" American heiress with her net worth plummeting US$3.2 billion...","filename":"data/vaneerConsumption/MinerRinehartlosesbillionsandrichestAustraliancrown.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g605-4vVdYopwYQ7f641721b07aa4b98a-902_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420488_Miner-Rinehart-loses-billions-richest-Australian-crown_1540243449.html","title":"Miner Rinehart loses billions and richest Australian crown","title_page":"Miner Rinehart loses billions and richest Australian crown | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Miner Rinehart loses billions and richest Australian crown\nMining mogul Gina Rinehart has lost her crown as Australia's wealthiest person to a \"reclusive\" American heiress with her net worth plummeting US$3.2 billion, an annual rich list reported Thursday.\nAfter five years at the top, long-time Australian resident Blair Parry-Okeden took the title from Rinehart with a fortune estimated at $8.8 billion, Forbes Asia said.\nRinehart dropped to the second spot after losing a legal battle that impacted her shareholding in mining company Hancock Prospecting, which has also taken a hit due to a plunge in iron ore prices.\nFormerly ranked Australia's wealthiest person by Forbes, Gina Rinehart has dropped to second place after heiress Blair Parry-Okeden ©Tony Ashby (AFP/File)\nA 16 percent drop in the Australian dollar against the greenback over the last year has also hurt the size of her fortune if measured in the US currency.\nShe now comes in at $8.5 billion after a court ordered her to relinquish control of a multi-billion dollar trust to her eldest daughter following a bitter family feud.\nParry-Okeden, who debuts at number one, confirmed to Forbes she has Australian citizenship.\nThe 65-year-old grew up in Hawaii and moved to her former husband Simon's native Australia decades ago.\n\"After her mother's death in 2007, she inherited a quarter of American media conglomerate Cox Enterprises,\" Forbes said.\nProperty tycoon Harry Triguboff came in at number three with $6.9 billion. His value climbed $1.3 billion on the back of a booming rental and apartment market.\nAnother iron ore magnate, Andrew Forrest, dropped 12 spots to 22 with a net worth of $1.24 billion, down 41 percent from last year, making him the biggest loser in percentage terms.","url":"https://www.dailymail.co.uk/wires/afp/article-3420488/Miner-Rinehart-loses-billions-richest-Australian-crown.html"}
