{"authors":["Shivali Best For Mailonline"],"date_download":"2018-10-22 23:48:33","date_modify":"2018-10-22 23:48:33","date_publish":"2017-03-16 08:02:55","description":"The technology was launched in February by SpacePharma, a Swiss-Israeli company based in Herzliya, Israel, and now the first experiments have been completed.","filename":"data/vaneerConsumption/Miniaturelabbeginsscienceexperimentsinouterspace.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54706D00000578-0-image-a-8_1489671640232.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4319174_Miniature-lab-begins-science-experiments-outer-space_1540252113.html","title":"Miniature lab begins science experiments in outer space","title_page":"Miniature lab begins science experiments in outer space | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Orbiting the Earth at more than 300 miles (500 kilometres), a tiny satellite laboratory is helping scientists carry out experiments that take gravity out of the equation.\nThe miniature lab, which is the size of a tissue box, was launched into space last month, and the first experiments have now been completed successfully.\nIn space, cells and molecules behave differently, helping researchers make discoveries in fields from medicine to agriculture.\nThe miniature lab, which is the size of a tissue box, was launched into space last month, and the first experiments have now been completed successfully\nWHY DO EXPERIMENTS IN SPACE? In space, cells and molecules behave differently, helping researchers make discoveries in fields from medicine to agriculture. Performing experiments in space allows scientists to remove accelerations that could affect the experiment. This applies to many materials experiments, such as crystal growth. It also applies to plasma physics experiments and to experiments involving studying very small perturbations and forces.\nThe technology was launched in February by SpacePharma, a Swiss-Israeli company.\nUsually, experiments are sent up to the International Space Station and carried out with the help of astronauts, or they are conducted on parabolic airplane flights that enjoy short bursts of weightlessness.\nBut SpacePharma says its miniature lab is a new way for researchers to work in microgravity for extended periods.\nYossi Yamin, founder of SpacePharma, said: 'Everything can be done remotely while the system is in outer space.\n'We upload the link with the command files to the lab and the experiment takes place.'\nClients then receive data and images directly from the experiments, which are carried out on custom-built glass chips and can be run multiple times to test different reactions.\nThe satellite currently in space holds four experiments, the first being done for a German research institute.\nA second launch, also with four experiments, is scheduled for August and includes research for a top tier pharmaceutical company, Mr Yamin said.\nAn employee works on a miniature laboratory at Israeli-Swiss company SpacePharma's research and development site in Herzliya, Israel\nBy next year he hopes to begin sending up satellites that each hold some 160 experiments.\nSpacePharm is not the only firm performing experiments in zero gravity conditions.\nNestle has also turned to zero gravity to perfect the foam in its chocolate mousse and coffee, while drugmakers like Eli Lilly have used it to improve drug designs.","url":"https://www.dailymail.co.uk/sciencetech/article-4319174/Miniature-lab-begins-science-experiments-outer-space.html"}
