{"authors":["The Food","Dining Team Offers Reviews","Previews","Food News","Fun Bites Food Trends For Metro Atlanta S Vast Food","Dining Scene."],"date_download":"2018-10-30 19:56:44","date_modify":"2018-10-30 19:56:44","date_publish":"2017-03-30 16:00:09","description":"Since wrapping production in New Orleans two years ago, and a successful run on the film festival ci...","filename":"data/vaneerConsumption/MinidocumentaryTheNewOrleansSazeracnowonlinevid.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/29/Images/WPIMAGE_cmgajcfoodandmore_15030.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/blog_atlanta-restaurants_wa_9049932fbf4b00e9a5835d1a7194dfd8__1540929404.html","title":"Mini-documentary \"The New Orleans Sazerac\" now online (vid","title_page":"WATCH HERE: Mini-documentary \"The New Orleans Sazerac\" now online (vid","title_rss":"NULL","source_domain":"ajc.com","text":"Since wrapping production in New Orleans two years ago, and a successful run on the film festival circuit, Atlanta-based filmmakers James Martin and Jen West’s mini-documentary on the history and mystery of the sazerac cocktail is now available to view online. The 20-minute film explores the origins of the word “cocktail” as well as the sazerac’s humble beginnings in Antoine Peychaud’s French Quarter pharmacy as a Cognac and bitters concoction.\nMartin and West filmed the documentary on location in New Orleans in July 2015 during beverage conference Tales of the Cocktail. The pair wrangled a crew of notable cocktail experts including bartenders Chris Hannah of Arnaud’s French 75 Bar (where the opening scenes were filmed) and Compère Lapin’s Abigail Gullo along with historians such as David Wondrich and Chris McMillian. The cast of characters in the film trace the history of the official cocktail of New Orleans with insights into the drink’s various formulas from Cognac to brandy to rye whiskey.\nDirector James Martin discusses a scene with bartender Chris Hannah at Arnaud's French 75 Bar. Photo courtesy of Four x Productions\nThe film debuted in Atlanta last Spring at the Atlanta Film Festival where it won an audience choice award and was named Best Crowdfunded Project. But the highlight of the duo’s year came when “Sazerac” was tapped by the Cannes Film Festival to take part in the Emerging Filmmaker Showcase in France. \"In Cannes, we were able to serve sazeracs right on the French Riviera,” Martin recalls of the experience. “It was cool to see so many people try the cocktail for the first time.\"\nMartin and West have been showcasing “Sazerac” at festivals around the country since returning from France last May. Martin says traveling with the film has lead to \"amazing opportunities to set up pop-up events allowing people to taste the sazerac” and expose them to its history through their documentary. This included debuting the film where it all began--back in New Orleans during 2016’s Tales of the Cocktail.\n\"One of our most exciting memories was serving sazeracs on the rooftop of The Ace Hotel during a screening in New Orleans,” Martin tells us. “It felt so great taking the film back to its roots.\"\nFilmmakers James Martin and Jen West on the red carpet for a screening of \"Sazerac\" at the 2016 New Orleans Film Festival. Photo courtesy of Four x Productions\nThe pair is currently developing The City Cocktail series which will explore drinks like the Los Angeles Zombie, Philadelphia Clover Club and the classic New York Manhattan. Stay tuned.\nAfter all of the festival screenings and multiple awards, the filmmakers felt the time was right to bring “Sazerac” to the public at large. “It’s common to keep a film offline during the festival circuit,\" Martin says. \"We knew this S pring would be the perfect time for folks to finally get a chance to watch the film online, and then go outside to have a couple Sazeracs.”\nSo, grab yourself a sazzy, sit back and relax on the porch while you watch “The New Orleans Sazerac”.\nCheers!\nRead more of our coverage of the Atlanta bar scene\n15 mimosa brunches around Atlanta\n86 women-owned restaurants, food/beverage businesses in Atlanta\n4 new Atlanta-distilled spirits to add to your home bar\nWe predict Atlanta’s top 5 cocktail trends for 2017\n10 best drinks of 2016 in Atlanta\nRead The A List: The faces, places, dishes and drinks defining the Atlanta dining scene right now\nRead more stories like this by liking Atlanta Restaurant Scene on Facebook, following@ATLDiningNews on Twitter and @ajcdining on Instagram.","url":"https://www.ajc.com/blog/atlanta-restaurants/watch-here-mini-documentary-the-new-orleans-sazerac-now-online-video/WvF5vjFbVddvs7PBta7dNP/"}
