{"authors":[],"date_download":"2018-10-30 14:20:47","date_modify":"2018-10-30 14:20:47","date_publish":"2014-05-31 00:00:00","description":null,"filename":"data/vaneerConsumption/MinimumWageDenyingOpportunity.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_05_minimum_wage_denying_opportunity_comments_1540909247.html","title":"Minimum Wage: Denying Opportunity","title_page":"Blog: Minimum Wage: Denying Opportunity","title_rss":"NULL","source_domain":"americanthinker.com","text":"Does it make any economic sense to raise the minimum wage when youth, minority, and inner city unemployment are so high? More regulations and costs reduce opportunities. Where there is high demand for workers, companies already pay higher wages than the new proposals and where demand and jobs are weak it will further reduce opportunities instead of helping. The national labor participation rate is at its lowest level for 35 years. Is it wise to raise the minimum wage when so many or do not have a job or are discouraged from looking? The more regulations and costs are increased, the fewer opportunities there will be to get a first-time opportunity. Prevailing wage laws were put in effect around 1930, essentially to prevent poor minorities from the south from taking white union workers jobs in the North. These laws have oppressed minorities and taxpayers for over 80 years and politicians continue to pretend they care. A study by the Heartland Institute shows how these laws... (Read Full Post)","url":"https://www.americanthinker.com/blog/2014/05/minimum_wage_denying_opportunity_comments.html"}
obs that were competitively bid. We are consistently told about the crumbling infrastructure and the need to create jobs and that the solution is always higher taxes. If the politicians would repeal the prevailing wage laws, many more projects could be completed with current dollars and consequently a huge number of jobs would be created without harming the economy by raising taxes. I am amazed when people use the argument that you can’t raise a family on the minimum wage. I have tried to ascertain when they could. The 1950s and 1960s were very good for job growth and you certainly couldn’t raise a family of three or four on the minimum wage. The federal minimum wage in 1950 was 75 cents per hour. If you worked a full time job of 2,080 hours you would have earned $1,560 per year. The median family income in 1950 was around $4,000 per year. In 1970 the minimum wage was $1.45 per hour. If you worked a full time job of 2,080 hours you would have earned $3,016 per year. The median family income in 1970 was around $9,500 per year. Today the minimum is $7.25 per hour or if you worked a full time job of 2,080 hours you would earn $15,080 per year. The median family income in 2012 was $51,371 per year. The federal minimum wage was established in the 1930s and at no time does it appear that it was adequate to raise a family nor was it meant to be. It was meant to provide a start. In the late 1960s when I was a teenager I worked several jobs for around $1 per hour which was below the federal minimum wage. (There were many exemptions at the time for small and local businesses). I was thankful to have the opportunity to earn a paycheck and learn a proper work ethic. Throughout its history the United States has created the opportunity for people to move up the economic ladder. As more barriers and costs are imposed on job creators, the less likely it is that this great economic model will continue. The government continually handing out free stuff and making a greater percentage of people dependent for survival will never be a substitute for creating economic opportunities for people to move up the economic ladder.","url":"https://www.americanthinker.com/blog/2014/05/minimum_wage_denying_opportunity.html"}
