{"authors":[],"date_download":"2018-10-30 00:55:18","date_modify":"2018-10-30 00:55:18","date_publish":"2014-11-06 09:00:00","description":null,"filename":"data/vaneerConsumption/MiniMetotheManWhoWouldNotDie.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/11/Screen20Shot202014-10-2720at205.21.5420PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860918.html","title":"Mini-Me to the Man Who Would Not Die","title_page":"Mini-Me to the Man Who Would Not DieThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The Greatest Comeback: How Richard Nixon Rose From Defeat to Create the New Majority\nBy Patrick J. Buchanan\n(Crown Forum, 392 pages, $28)\nTo begin at the beginning, I happen to believe that Pat Buchanan is one of the ablest, most eloquent political writers alive today. If his take-no-prisoners style and love of the mischievous quip occasionally cause him to charge a bridge too far, it never diminishes his mastery of the language. Agree with him or disagree with him—and I tend to agree with him more often than not—Pat is always a delight to read. Even a critic reviewing one of Pat’s earlier books for the Washington Post conceded that “Buchanan is a muscular writer, fully in command of the English language…adept at linking history, statistics, and the writings of philosophers and economists to proffer forceful arguments,” while a reviewer for the Philadelphia Inquirer would praise him as “an honest writer who opens his mind and psyche in a way few people can….He minces nothing except an occasional opponent.” What the eighteenth-century poet and playwright Oliver Goldsmith said of that rambunctious old Tory Dr. Samuel Johnson could equally be applied to Pat: “There is no arguing with Johnson: for if his pistol misses fire, he knocks you down with the butt end of it.”\nBut before reviewing Pat Buchanan’s latest, and in many ways most interesting, book, a bit of up-front disclosure is in order. From 1972 until Richard Nixon’s resignation four decades ago, Pat and I were next-door neighbors, occupying adjoining suites in the Old Executive Office Building, I as one of the president’s full-time speechwriters and Pat as a sort of speechwriter emeritus, still lending his hand on major addresses, but also overseeing production of the daily press digest, producing policy memos for the president’s eyes alone, and something more.\nIf not quite a political surrogate for the son Richard Nixon never had, Pat was certainly the chief’s Mini-Me, the aide whose gut beliefs and political instincts most closely matched Nixon’s own. I don’t think there was anyone else on the White House staff with whom Nixon was quite as comfortable. Even when he had already decided to steer a different course for reasons of Realpolitik, Nixon relished Pat’s forceful, forthright polemics, which probably represented what Nixon really believed and would have liked to do if only he dared: for example, Pat’s suggestion that he make a bonfire of the Oval Office tapes.\nAn added reason for the Nixon-Buchanan affinity was the fact that, while there were a few old Washington and California hands who had known Nixon from his earliest political days, Pat was one of a handful of bright, energetic, and dedicated men and women, most of them fairly young at the time, who were at the heart of Richard Nixon’s incredible political resurrection after he had lost both the 1960 presidential election and the California gubernatorial race two years later. After the latter humiliating defeat, the anonymous pundits at Time had smugly—and a bit prematurely—declared Nixon dead: “Barring a miracle his political career ended last week,” they wrote in their November 16, 1962 issue.\nThe miracle duly occurred, thanks mostly to Nixon’s incredible ability to pick himself up off the floor, dust himself off, and figure out how to get it right the next time. Get it right he did, in 1964 and 1966 as a party unifier and tireless campaigner for hundreds of GOP candidates. Then he went on to craft and continuously fine-tune a campaign for the presidential nomination and the White House itself. Pat Buchanan was there from the start, seeing it all and shaping a lot of it himself. In The Greatest Comeback he provides the reader with a funny, moving, incisive account of history as it happened. As such, his book will make fascinating reading not only for Nixon lovers and haters old enough to remember the events covered, but for future historians in search of an informed, intimate account of one of the greatest political resurrections of all time.\nAt its very heart is a portrait of the Richard Nixon few others knew and understood as well as Pat Buchanan did. Besides bringing Nixon alive in all his contradictions in the narrative, Pat also includes a fascinating appendix of notes and memos he sent to Nixon along with RN’s handwritten edits and responses, a real glimpse into the interaction of two very sharp, highly attuned political minds.\nThis past August, which marked the fortieth anniversary of the Nixon resignation, I was asked to do a short reminiscence for the website of the National Interest on the end of the saga that began with the events described in The Greatest Comeback. I mentioned that I had had the privilege of working closely with three presidents: Nixon, Ford, and Reagan, and that I had come to like and admire each of them in different ways.\nEach one had entered office at a time of crisis, each one had to tackle massive inherited problems, and each one had made a substantial contribution against heavy odds. But Richard Nixon was the most fascinating and complex of the three, a man who rose from the political dead more than once and lived to attain hard-earned standing as an elder statesman after being driven from office in disgrace. Nothing came easily to him. There were no inherited privileges, none of the superficial charisma that often covers a multitude of sins, and no loyal cadre of establishment cheerleaders to rally public opinion. But it was Richard Nixon and many of the team members he assembled—Henry Kissinger, George Shultz, and Patrick Moynihan to name only three, plus scores of less well-known policy experts and skilled specialists—who would lend intellectual strength and depth to domestic and foreign policy for the rest of the twentieth century and beyond.\nAnd then there were the millions of blue-collar, independent, and Democratic voters who, for the first time, cast their ballots for a Republican president, hesitantly in 1968 and overwhelmingly in 1972. They and their descendants returned to the Republican fold again in 1980 to make the Reagan Revolution possible, just as the “lasting structure for peace” crafted by Richard Nixon made the historic collapse of communism achievable without global conflagration.\n“Not all that bad,” I concluded, “for what most historians continue to dismiss as a ‘failed’ presidency.” One hopes that, even now, Pat Buchanan is at work on a successor volume, offering his unique insider’s view of the triumphant and tragic events that followed The Greatest Comeback. No one could tell that story better.","url":"https://spectator.org/60784_mini-me-man-who-would-not-die/"}
