{"authors":[],"date_download":"2018-10-22 21:01:17","date_modify":"2018-10-22 21:01:17","date_publish":"2014-05-05 17:44:35","description":"The pregnant mother drove her minivan into the ocean with her three children inside.","filename":"data/vaneerConsumption/MinivanMomsLawyerPlanstoFileForInsanityDefense.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/421081/140505-140306-mental-health-minivan-mom-js-1607-1340_c79946109e8e9c9f1b9bf4379b85010d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_minivan-mom-case_minivan-moms-lawyer-plans-file-insanity-defense-n97421_1540242077.html","title":"Minivan Mom's Lawyer Plans to File For Insanity Defense","title_page":"Minivan Mom's Lawyer Plans to File For Insanity Defense","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe lawyer for the pregnant mother who drove her minivan into the Atlantic Ocean off the coast of Florida with her three children inside will pursue an insanity defense, he said Monday.\nEbony Wilkerson, 32, faces three counts of attempted second-degree murder, reduced from three counts of attempted first-degree murder and three child abuse charges she was originally charged with after the March 4 incident off of Daytona Beach, Fla.\nThe children told rescuers who rushed to the van that \"mom tried to kill us.\"\nWilkerson's attorney, public defender James Purdy, told NBC affiliate WESH that Wilkerson is currently receiving mental health care at a hospital and he planned to file for the insanity defense before a court deadline.\nPurdy said Wilkerson, who is eight months pregnant, was hospitalized after hitting herself in the stomach, according to The Associated Press.\nPurdy also asked for \"original\" video of the incident Monday, since he said he has only seen video taken by a bystander aired on local TV news outlets and \"we don’t know if they’re complete, if they cover the entire thing, if they have been sped up, if they have been slowed down.”\nWilkerson is being held on $1.2 million bond.\n— Elisha Fieldstadt","url":"https://www.nbcnews.com/storyline/minivan-mom-case/minivan-moms-lawyer-plans-file-insanity-defense-n97421"}
