{"authors":["Tim Sculthorpe","Deputy Political Editor For Mailonline"],"date_download":"2018-10-23 00:09:23","date_modify":"2018-10-23 00:09:23","date_publish":"2017-04-26 09:19:34","description":"While the controversial plans were dropped to avoid a political fight on the eve of the election, ministers insist the plans will be revived if the Tories secure their expected landslide win on June 8.","filename":"data/vaneerConsumption/Ministersabandonplansfordigitaltaxreturns.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/245912D800000578-0-image-a-10_1493194766891.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446754_Ministers-abandon-plans-digital-tax-returns_1540253363.html","title":"Ministers abandon plans for digital tax returns","title_page":"Ministers abandon plans for digital tax returns | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The Government has scrapped key Budget policies including a crackdown on tax avoidance and plans for multiple digital tax returns because of the election.\nThe slimmed down Budget laws were waved through Parliament last night to ensure tax and spending continues through the election period.\nWhile the controversial plans were dropped to avoid a political fight on the eve of the election, ministers insist the plans will be revived if the Tories secure their expected landslide win on June 8.\nCompromises have also been found on reforms to universities, laws on medical supplies and broadband.\nThe fate of the Government's Criminal Finance Bill, which includes new laws on the proceeds of crime, is uncertain.\nReforms to tax returns were dropped by the Government to ensure a slimmed down Budget law could be waved through Parliament last night\nGovernments always have to cut deals with the Opposition on what new laws can be put on the books before general elections as unfinished legislation collapses when Parliament closes for the polls.\nThe Commons is expected to be suspended tomorrow before being dissolved on May 3 ahead of the snap election.\nSome of the tax avoidance proposals announced by Chancellor Philip Hammond in March were among the policies removed, including a crackdown on 'enablers' via the introduction of a new penalty.\nAmong the other measures to be dropped from the Bill were plans to push businesses and self-employed people to file multiple digital tax returns each year.\nThe move had been criticised, including by a number of Conservative MPs who felt it placed an extra burden on small businesses.\nBut moves to introduce a sugar tax on soft drinks with the most added sugar from April 2018 are among the parts of the Finance (No. 2) Bill to survive.\nAsked if there would be another Budget after the election to re-announce the dropped measures, the Prime Minister's deputy spokeswoman said: 'What she (Ms Ellison) said was that we would legislate for the remaining provisions at the earliest opportunity in the next parliament.'\nTheresa May (pictured campaigning in Bridgend yesterday) will tell ministers to reintroduce the plans after the election if she secures her expected victory\nGovernments always have to cut deals with the Opposition ahead of elections to save as many of their plans as possible before Parliament is dissolved. Pictured: Jeremy Corbyn leaving home today\nAnnouncing the climb downs, Treasury minister Jane Ellison said: 'A number of key policy changes to the tax system, such as measures to tackle tax avoidance, are not proceeding now and will be brought forward in a Finance Bill at the first opportunity after the election.\n'However, even in its shortened form, the Bill takes action in three areas that have been consistent priorities in our changes to the tax system.'\nChancellor Philip Hammond will have to start again with legislation for some of his Budget plans after the election (file picture)\nMs Ellison said this includes action to reduce the deficit and raise funds for public services, making the tax system fairer and also introducing the sugar tax.\nShe said: 'This Bill marks an important step in tackling childhood obesity by legislating for the soft drinks industry levy.'\nThe Bill will undergo further scrutiny in the House of Lords before it can become law.\nLabour spokesman Peter Dowd welcomed the approval of a Budget in such a short time frame.\n'Scrutiny is the fundamental role of Parliament, so when we can't get enough time for that scrutiny role we need to ensure that measures are not simply pushed through willy nilly, and I don't think they have been in that regard,' he said.\nThe Labour MP also backed the flagship sugar tax proposals.\nThe SNP's Kirsty Blackman (Aberdeen North) supported the Government's decision to withdraw digital tax returns from the Bill.\nBut she urged ministers to undertake a full review of changing self-employment practices before making any changes to taxation.\nMs Blackman also said the Treasury had failed to recognise and make plans for the impact of Brexit.","url":"https://www.dailymail.co.uk/news/article-4446754/Ministers-abandon-plans-digital-tax-returns.html"}
