{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:17:33","date_modify":"2018-10-30 21:17:33","date_publish":"2014-11-13 14:55:00","description":"Education lawyers are referring to the Minneapolis School District’s recent announcement that suspensions of non-white students must receive the approval |","filename":"data/vaneerConsumption/MinneapolisPublicSchoolsSuspensionPolicyDrawsCriticismofRacialQuotas.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2014/Education/classroom_AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_11_13__1540934253.html","title":"Minneapolis Public Schools' Suspension Policy Draws Criticism of 'Racial Quotas'","title_page":"Minneapolis Public Schools' Suspension Policy Draws Criticism of 'Racial Quotas' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Education lawyers are referring to the Minneapolis School District’s recent announcement that suspensions of non-white students must receive the approval of the superintendent of schools as the establishment of “racial quotas.”\nHans Bader, senior attorney at the Competitive Enterprise Institute (CEI) told Breitbart News the Minneapolis district is “adopting what the courts would consider to be racial quotas in discipline to help resolve an investigation by the Education Department’s federal Office for Civil Rights.”\nAs Breitbart News’ Warner Todd Huston previously reported, reacting to reports that students of color are ten times more likely to receive a suspension than white students, school Superintendent Bernadeia Johnson, a black woman, stated that her new policy will “disrupt” the current trend of suspensions.\nBader, who practiced education law and had a position at the Education Department’s Office for Civil Rights, also wrote in a blog post on Wednesday that the new policy reflects that “what school districts care about most is what the Education Department wants, not what’s constitutional.”\nBader observed that the new policy will mean “suspensions of white and Asian students will occur without any impediment or scrutiny from the superintendent.”\nHe continued:\nAs Minnesota Public Radio put it, “MPS must aggressively reduce the disproportionality between black and brown students and their white peers every year for the next four years. This will begin with a 25 percent reduction in disproportionality by the end of this school year; 50 percent by 2016; 75 percent by 2017; and 100 percent by 2018.” In the eyes of most courts, that’s a quota. Such racial percentage-based rules violate the U.S. Seventh Circuit Court of Appeals’ unanimous ruling in People Who Care v. Rockford Board of Education, 111 F.3d 528 (7th Cir. 1997), striking down as a violation of the Constitution’s equal protection clause a rule that forbade a “school district to refer a higher percentage of minority students than of white students for discipline,” and rejected the argument that such a rule was permissible to prevent disparate impact.\nWriting at National Review, Roger Clegg, former assistant attorney general and practicing attorney, criticized the new school suspension policy at Minneapolis Public Schools, referring to it as “blatantly illegal.”\n“This is in response to pressure from the Obama administration for school districts to get their numbers right, racial-disparity-wise,” Clegg wrote. “This superintendent’s proposal is ridiculous, of course, but should come as no surprise, as it is the predictable (and predicted) results of the administration’s ‘guidelines’ in this area.”\nClegg added that “the children who will be hurt the most when badly behaving students are not disciplined will be their classmates – who are themselves likely to be ‘black or brown.’”\nIn an editorial Tuesday, Investors Business Daily (IBD) was equally critical of the Minneapolis school discipline quotas, referring to them as “state-sanctioned racism.”\n“If you think that sounds a bit racist, you’re not alone,” wrote the editors. “Like most urban school districts, MPS suspends blacks at a higher rate than whites due to the fact that black students commit a disproportionately high share of campus crimes.”\n“But the Obama regime, which sees racism behind every corner, blames biased teachers and administrators for the disparity – even though Johnson is black,” they added.\nIBD observed that San Diego schools have become more violent due to similar racial quotas in that city, resulting in more black-on-black violence that will deprive black kids of a decent education.\n“At its premier charter school, Lincoln High, students report daily fights now, mostly involving black kids,” stated IBD. “In the past month, there have been several arrests, including one involving a butcher knife, according to local reports. Victims have been hauled off by ambulance.”\nSimilarly, writing at Instapundit, law professor Glenn Reynolds also criticized the Minneapolis Public Schools’ policy, citing Bader’s statement to Reason that the quotas violate a federal appeals court ruling. He described it as “another reason to avoid the public school.”","url":"https://www.breitbart.com/politics/2014/11/13/minneapolis-public-schools-racially-driven-suspension-policy-draws-criticism-of-racial-quotas/"}
