{"authors":[],"date_download":"2018-10-22 20:34:29","date_modify":"2018-10-22 20:34:29","date_publish":"2014-05-02 16:08:49","description":"Storage locker arrest in Waseca, Minn., averted carefully planned violent assault with guns and bombs, according to court records.","filename":"data/vaneerConsumption/MinnesotaTeenMethodicallyPlottedCarnageinThreeActsPoliceSay.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/415201/140501-john-ladue_-2237_59fbb10b9cec9b5e881004eca7cb1b0d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_minnesota-teen-methodically-plotted-carnage-three-acts-police-say-n95736_1540240469.html","title":"Minnesota Teen Methodically Plotted Carnage in Three Acts, Police Say","title_page":"Minnesota Teen Methodically Plotted Carnage in Three Acts, Police Say","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMinnesota teenager John David LaDue methodically plotted a horrific assault in three acts designed to inflict maximum casualties in his home and school before his expected death at the hands of a police SWAT unit, according to court documents.\nAn affidavit in a criminal complaint filed in a Waseca County court paints a chilling portrait of the 17-year-old’s preparations for what police say was intended to be a murderous rampage that would begin at his home and, after a brief detour to set a diversionary fire, continue at the high school he attended.\nLaDue, who is charged with attempted murder and explosives in connection with the alleged plot, amassed a frightening arsenal over a nine-month period, including an SKS assault rifle with 400 rounds of ammunition, a 9mm Beretta handgun with ammunition and at least six homemade bombs, according to the affidavit by Waseca police Capt. Kris Markeson.\nThe affidavit did not make clear how LaDue obtained the weapons.\nAs detailed in a 180-page notebook found in a locked guitar case in LaDue’s bedroom, the teenager planned to kill his parents and sister with a .22-caliber rifle to avoid making too much noise, then proceed to a rural location and start a fire in an attempt to attract and occupy first responders.\nWhile the blaze burned, he intended to go to Waseca Junior & Senior High School, which he attended, and set off pressure-cooker bombs and other explosive devices in the cafeteria. He then would kill the school’s liaison police officer and shoot as many students as possible before dying at the hands of police marksmen, Markeson said.\n“LaDue planned on setting off pipe bombs and throwing Molotov cocktails down the main wing corridors in the school, and then shooting and killing students as they rushed out of the corridors,” according to the affidavit.\nIn preparation for the assault, it said, LaDue admitted he had previously detonated explosive devices at a nearby elementary school, outside a local church and in a city park in an effort to refine his bomb-making skills.\nIn addition to documenting his plan, the journal contained entries describing LaDue’s “thoughts, plans, to-do lists, supply lists, successes and failures (in his bomb experimentation) .. attempts and successes he made at acquiring additional firearms and ammunition,” Markeson said. It also outlined chillingly mundane details of the plot, such as LaDue getting a job so he could purchase necessary supplies, getting a checking account and debit cards and renting a storage locker to store his growing cache of weaponry, he said.\nIt also described the strange encounter on Tuesday between LaDue and police officers at a storage facility where he had rented a unit, ultimately unraveling his plot.\nThree Waseca police officers arrived at the storage facility after a neighbor called to report that she had seen someone sneak through her backyard and enter the commercial business from the rear.\nWhen the officers announced their presence, the affidavit said, LaDue was initially defensive, but then told Officer Tim Schroeder that he would talk to them if the officer could guess correctly what he was doing in the storage unit. When Schroeder said he believed LaDue had been making explosive devices, the teenager agreed to accompany police to the Waseca Police Department, where he was subsequently interviewed and arrested, it said.\nIn addition to the guns, police recovered an array of bomb-making and related gear at LaDue’s home and the storage locker. Other items included various containers of ball bearings, a pressure cooker, three boxes of Remington 12-gauge shotgun shells, military trip wire, a ski mask and a black duster/trench coat. Three 5-pound bags of potassium perchlorate and a 10-pound bag of red iron oxide were among the array of chemicals recovered, as well.\nThe criminal complaint said LaDue told police that he originally planned the attack for April 20, the anniversary of the Columbine High School massacre that killed 13 people in Littleton, Colo., in 1999. He changed his plans when he realized April 20 was Easter Sunday and school was not in session.\nThe Bloomington, Minn., police bomb squad detonated the completed bombs, and members of the squad were shocked by the amount of bomb-making chemicals and components that LaDue had in his possession, the affidavit said.","url":"https://www.nbcnews.com/news/us-news/minnesota-teen-methodically-plotted-carnage-three-acts-police-say-n95736"}
