{"authors":[],"date_download":"2018-10-22 22:39:53","date_modify":"2018-10-22 22:39:53","date_publish":"2014-05-12 13:31:52","description":"John LaDue, 17, was charged with attempted murder and explosives counts after police caught him planning a rampage to kill students and his family.","filename":"data/vaneerConsumption/MinnesotaTeenSaidToHavePlottedSchoolAttackDueinCourt.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/415206/140501-john-ladue-2232_7c70d879d4ad9f86f3822b6483d4f874.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_crime-courts_minnesota-teen-said-have-plotted-school-attack-due-court-n103016_1540247993.html","title":"Minnesota Teen Said To Have Plotted School Attack Due in Court","title_page":"Minnesota Teen Said To Have Plotted School Attack Due in Court ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Minnesota teenager who police say plotted to murder his family, then unleash a massacre at his high school, returns to juvenile court Monday as authorities work to prosecute him as an adult.\nJohn LaDue, 17, was charged with 10 attempted first-degree murder and explosives counts after police caught him planning a rampage to kill \"as many students as he could\" at his school.\nIf convicted as a juvenile, LaDue could be free at age 21. But prosecutors on Monday will fight to have his case moved out of juvenile court. Each explosive count alone could carry a sentence of 18 years if prosecutors succeed, according to an affidavit filed by the County of Waseca district court.\nLadue’s father, David Ladue, told NBC affiliate KARE that he will fight to have his son tried as a juvenile and recent visits with the boy in jail have revealed that his son is remorseful for his sinister plan.\nPolice found a 180-page notebook in LaDue’s bedroom that detailed a timeline in which he would shoot his mother, father and sister and then set a fire to distract first responders, according to court papers. His plan then called for explosives to be set at Waseca Junior & Senior High School, where he would shoot as many fleeing schoolmates as possible.\nLaDue planned to carry out the violent spree two weeks from when he was apprehended on May 1, when a Waseca resident flagged police about a suspicious man trudging through her backyard, according to court documents. She became even more concerned when she saw LaDue fiddling with the lock of a nearby storage locker, where the teen kept part of his arsenal of explosives, ammunition and firearms. Other weapons and bomb-making materials were found in LaDue's home, according to an affidavit.\nDavid LaDue told KARE that his son grew up in a loving and stable home, and he does not know where the murderous thoughts stemmed from.\n— Elisha Fieldstadt","url":"https://www.nbcnews.com/news/crime-courts/minnesota-teen-said-have-plotted-school-attack-due-court-n103016"}
