{"authors":["Allum Bokhari"],"date_download":"2018-10-30 18:20:38","date_modify":"2018-10-30 18:20:38","date_publish":"2016-05-12 13:35:53","description":"As students across the country retreat into safe spaces, the University of Minnesota at Twin Cities attempts to buck the trend.","filename":"data/vaneerConsumption/MinnesotaFacultyConsidersToughNewFreeSpeechProtections.json","image_url":"https://media.breitbart.com/media/2016/03/2519766036_9e37579642_o-1-e1463059961768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/tech_2016_05_12__1540923638.html","title":"Minnesota Faculty Considers Tough New Free Speech Protections","title_page":"Minnesota Faculty Considers Tough New Free Speech Protections","title_rss":"NULL","source_domain":"breitbart.com","text":"As students across the country retreat into safe spaces and call campus authorities over even mildly offensive speech, often with the support of administrators, one college aims to buck the trend.\nThe faculty of the University Of Minnesota At Twin Cities is considering a motion that would make free speech the college’s “paramount value.” If passed, it would, according to Inside Higher Ed, represent “the strongest such affirmation seen on any campus.”\nOne of the primary aims of the motion is to make it easier for controversial speakers to come to campus without being “shouted down.” As we reported in March, Professor Dale Carpenter, a faculty member who is championing the proposal, specifically cited the fraught visit of Breitbart Tech editor Milo Yiannopoulos and American Enterprise Institute scholar Christina Hoff Sommers as a catalyst for the motion.\nThe faculty’s proposed statement contains four key principles in defence of free speech, including a specific protection for speech that may be considered “hateful.”\nA public university must be absolutely committed to protecting free speech, both for constitutional and academic reasons Free speech includes protection for speech that some find offensive, uncivil, or even hateful. Free speech cannot be regulated on the ground that some speakers are thought to have more power or more access to the mediums of speech than others Even when protecting free speech conflicts with other important University values, free speech must be paramount\nThe faculty has also published a second draft document, proposing a number of actions to promote these four goals. These include the possible creation of a “Free Speech Advocate” on campus, as well as a pledge to “vigorously defend” when “serious disruption” is anticipated.\nAccording to the document, this could take the form of ” chanting, persistent heckling, or other noisy demonstrations that make it difficult or impossible for the audience to hear what the speaker is saying.”\nSounds familiar!\nAccording to Professor Carpenter, students have already started protesting the proposals. One student allegedly called for “discursive affirmative action” to correct “perceived imbalances of power and influence among speakers.” Of course, as Carpenter notes, this specifically contradicts the third principle of the Faculty Senate’s proposals.\nThe proposals are likely to come before the Senate again when college resumes in the fall semester.\nYou can follow Allum Bokhari on Twitter, add him on Facebook, and download Milo Alert! for Android to be kept up to date on his latest articles.","url":"https://www.breitbart.com/tech/2016/05/12/minnesota-faculty-considers-tough-new-free-speech-protections/"}
