{"authors":["Ann Powers"],"date_download":"2018-10-23 02:07:26","date_modify":"2018-10-23 02:07:26","date_publish":"2014-06-02 00:00:00","description":"The chart-topping singer talks about fame, what country means to her and being \"married to a man who's married to attention,\" in the words of \"Priscilla,\" a song from her new album.","filename":"data/vaneerConsumption/MirandaLambertsPriscillaAnOdeToBeingQueenOfAKing.json","image_url":"https://media.npr.org/assets/img/2014/05/30/ml-randeestnicholas_1286_r_wide-377626277723e9886576b387713f2ce4593f0e15.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_allsongs_2014_06_02_316713147_miranda-lamberts-priscilla-an-ode-to-being-queen-of-a-king_1540260446.html","title":"Miranda Lambert's 'Priscilla,' An Ode To 'Being Queen Of A King'","title_page":"Miranda Lambert's 'Priscilla,' An Ode To 'Being Queen Of A King' : All Songs Considered : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Miranda Lambert's 'Priscilla,' An Ode To 'Being Queen Of A King'\nEnlarge this image toggle caption Randee St. Nicholas/Courtesy of the artist Randee St. Nicholas/Courtesy of the artist\nPop stars are the ideal companions of their fans' daydreams, speaking their most romantic hopes and defiant declarations through the songs on the Top 40. Miranda Lambert, however, is the kind of friend who's not going to take anybody's bull. As country's most lauded million-selling artist, beloved by everyday listeners and critics alike, Lambert has crafted a body of work grounded in the realism of muscle, flesh and heart.\nLambert entered stardom swinging a decade ago with Thelma and Louise-style anthems like \"Kerosene,\" and since then has proven her versatility with power ballads, honky-tonk and humor. \"My disposition permeates the room when I walk in a place — I'm sorry,\" she sings, her voice dripping dare me, on the title track of her new album Platinum, which will be released tomorrow. It's that edge, her willingness to sing about the warts as well as the wins in her life, that makes her great. Platinum rides on the face-to-face intimacy Lambert generates into more thematic and musical areas than ever before. From barroom heartache to bathroom-mirror feminine self-empowerment, from the comfort of nostalgia to the consciousness-raising questioning can bring, Lambert portrays a whole life for listeners to contemplate. Up, down and sideways, it's her life, but it also might be yours.\nOne source of glamour and, sometimes, grief, in Lambert's life is her very exposed marriage to her fellow country kingpin Blake Shelton, who's gained an audience beyond the genre as the most genial judge on The Voice. Together nine years, the couple (like most celebrity pairs) has been laughing off breakup rumors since the beginning. Lambert turns that defense mechanism into musical money on Platinum with \"Priscilla.\" The rockabilly-flavored romp was written expressly for Lambert by her frequent collaborator Natalie Hemby with Nicolle Galyon and Jimmy Robbins, inspired by a television documentary about Elvis and Priscilla Presley. The song is funny, but with a bittersweet undertone: being \"queen of the king\" did not serve Priscilla very well. Lambert, in a very different position as Shelton's co-royal on the contemporary music scene, sings with the self-awareness of someone who can't completely shake emotional insecurities despite all of her success.\nIn an email exchange this week, Lambert answered a few questions about \"Priscilla,\" Platinum and her creative process to accompany this song debut. It's a one-day stream, so listen to \"Priscilla\" here before Platinum hits all retail outlets tomorrow. And enjoy this exchange with a woman who defines what it means to be down-to-earth in pop music today.\nElvis and Me is one of my favorite rock memoirs and I've always been fascinated by the young Priscilla Presley. She was such a style icon, but obviously her relationship with Elvis was ... complicated. You and Blake are no Elvis and Priscilla — for one thing, you have a flourishing career. But I love that you invoke her as an icon. It's fun and kitschy but also gives her some respect. Your performance is fun, done with humor, but also has a bit of an emotional edge in there. What were your thoughts as you were approaching the material?\nExactly that. To keep it fun. Not to be taken too seriously, though it is a serious subject at times. The subject being ... the pressure put on a couple in the public eye. The tabloids and untrue stories are laughable at this point. But the hardships of time apart and figuring out how to have alone time in a business like ours is something you have to figure out. I think this song addresses the issues perfectly. Priscilla is an icon. Who are these men without us women! (wink wink)\n\"Priscilla\" is one of several rockers on the album, including the great \"Bathroom Sink,\" about bucking beauty standards, and \"Somethin' Bad,\" your duet with Carrie Underwood, which is a total arena anthem. You really have figured out how to do rocking country without sounding like \"one of the bros\" — you bring a woman's perspective, and use rock elements when addressing a wide variety of topics, not just partying or barn-burning revenge. How have you developed your more rocking side?\nI don't really have a strategy. I just write songs or choose songs that make me think and feel, and I hope that they do the same for other people. Whatever sound they may lean toward. I do love the in-your-face subject matters. The rockers allow me to emote a little more than I could in normal everyday conversation. It's an excuse to get rowdy and not get in trouble!\nPlatinum is your most eclectic album yet, soundwise. Five albums into your career, you seem to be sending a signal: You have mastered the country form in all its variations. What was most exciting for you to try on this album? What do you still feel like you are mastering, in your own performances, and in writing?\nI enjoy collaborating. With the Time Jumpers we did something on \"All That's Left\" that's different for me. Texas swing, reminds me of home! It's one of my favorites on the record. Also, the collaborations with Carrie [Underwood] and Little Big Town. Carrie is such a great singer, singing with her pushes me as a vocalist. I am a huge fan of Little Big Town, so I'm honored that they are on this album.\nAs far as what else I want to master ... so many things! Become a better writer and a better storyteller. Making tonight's show better than last night's. Those are goals I will also strive for.\nCountry music integrates humor and emotionalism with an ease that you don't find in many other genres. You do that in a way that recalls the greats, like June Carter Cash. How do you do humor without being corny? Maybe being corny is OK sometimes too.\nI think I am just figuring out the humorous side of myself. I attribute that mostly to my husband Blake. He is really funny and quick-witted. Being around that for the past nine years, well, it's rubbed off a little I guess. I needed it to. I have a tendency to be cynical at times and take everything seriously. Thankfully I married someone just the opposite. This record has more humor than any of my others.\nYou seem like a restless person, creatively — really open to trying new things, while still maintaining a relationship to country traditions. What does tradition mean to you, as a lived experience?\nTradition means so many different things to so many different people. That's why there are all kinds of music for all kinds of kinds. Me, I just want to feel something when I hear a song or sing a song. That's what country music especially is all about. And honesty: telling the damn truth or singing about a lie you told. And confessing that to the public through song. Bringing out emotion you otherwise might bury. Good, bad, mad, sad, happy, et cetera.\nTradition? Hmmmm ... I'll say this ... I am pretty open-minded when it comes to trying new things, creatively or in life in general. At the same time, I am a stickler on keeping true to who I am. And when I get comfortable, it's hard to adjust to change. My mom and dad really taught my brother and me about building character and following your heart. Family and friends, relationships in general are important to me (though I am not great at them all at times). And going with your gut, not taking no for an answer if it's something you really believe in. Being anything I want to be because I believe I can. ... That's what mom passed on for my brother and me to live by. Character and working for what you have ... standing for something ... really standing for it with your feet planted, never to waver. My dad taught us that.","url":"https://www.npr.org/sections/allsongs/2014/06/02/316713147/miranda-lamberts-priscilla-an-ode-to-being-queen-of-a-king"}
