{"authors":["Ryan Parry West Coast Correspondent For Dailmail.Com"],"date_download":"2018-10-23 03:21:59","date_modify":"2018-10-23 03:21:59","date_publish":"2017-03-16 14:09:42","description":"On Wednesday Mischa Barton, 31, filed restraining orders against two ex-boyfriends she believes are shopping a sex tape featuring the actress: Jon Zacharias and Adam Shaw.","filename":"data/vaneerConsumption/MischaBartonsexaccusedinsextapescandalpictured.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E544FC100000578-0-image-a-36_1489669570160.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320008_This-ex-Mischa-Barton-accuses-peddling-Revenge-Porn_1540264919.html","title":"Mischa Barton's ex accused in sex tape scandal pictured","title_page":"Mischa Barton's ex accused in sex tape scandal pictured | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The ex-boyfriend of Mischa Barton accused of secretly filming a 'revenge porn' sex tape of the actress is the son of Revenge of the Nerds screenwriter Steve Zacharias, DailyMail.com can reveal.\nJon Zacharias was named this week in bombshell court documents which showed Barton had taken out a restraining order against him and a second man she once dated called Adam Shaw.\nThe action was aimed at preventing either man from shopping the x-rated sex tape to the highest bidder or leaking it online.\nNo evidence has been presented to show that Zacharias or Shaw are behind the sale of the video but Barton has accused Zacharias of secretly filming their sex sessions during their relationship.\nScroll down for video\nMischa Barton leaving her lawyer's office in Los Angeles, after it was revealed she had taken out restraining orders against two former boyfriends, one of them Jon Zacharias\nAccording to paperwork filed at Los Angeles Superior Court, Barton says her ex recorded videos of 'me having sex with him, taking a shower, and took other naked pictures of me.'\nShe said all videos and photos were taken without her 'knowledge or permission', adding: 'Jon is trying to sell those tapes without my permission for $500,000.'\nNow DailyMail.com has discovered that Zacharias is a 30-year-old technology and marketing expert from Illinois and the son of comedy-writing legend Steve Zacharias.\nSteve co-wrote the screenplay for hit 1984 movie Revenge of the Nerds and also wrote episodes for hit shows Happy Days, The Partridge Family and All in the Family, where he won an Emmy for 'Outstanding Writing in a Comedy Series'.\nRevenge of the Nerds was a classic sex comedy in which the nerds plot their revenge against the jock fraternity boys who repeatedly humiliate them. The movie had three sequels.\nIn court documents Barton says she first met Zacharias in October last year and her lawyer says they only dated 'briefly'.\nBarton says she didn't realize Zacharias was recording their 'intimate relations' and taking 'photos of me naked in the shower' until after they broke up. The actress says she split with Zacharias after she learned he was only interested in her because she was a celebrity\nBarton has accused Zacharias of secretly filming their sex sessions during their relationship\nOn LinkedIn Zacharias describes himself as a freelance digital marketing, branding and search engine marketing expert\nOn Monday DailyMail.com exclusively revealed that an x-rated video showing the OC actress having sex with a dark haired man - now believed to be Zacharias - was being offered to the highest bidder with the starting price of $500,000.\nThe footage was being touted to online porn companies, with a number of porn industry giants considering the offer.\nIn the video Barton is seen wearing a grey hoodie and nothing else, having unglamorous sex on a double bed with the man who is wearing just a black t-shirt.\nThe explicit footage appears to have been shot on a bed with a distinctive leather and mirror-paneled headboard.\nDailyMail.com has found a photo posted on Zacharias' Facebook page that shows the exact same headboard.\nZacharias snapped a selfie in his robe cuddling up with his pet poodle Mia in the same bed in July last year - just a few months before he met Barton.\nInterestingly his Facebook profile says he lives in Los Angeles and has been in a relationship since October 10, 2015, although there's no sign of a regular girlfriend in his photo album.\nHis father Steve Zacharias is the screenwriter of pop classic Revenge of the Nerds. He also wrote episodes for hit shows Happy Days, The Partridge Family and All in the Family, where he won an Emmy for 'Outstanding Writing in a Comedy Series'\nJon Zacharias describes himself a s a technology and marketing expert on Facebook. In the court documents Mischa says he's 'great with technology'\nOn Valentine's Day this year Zacharias posted another photo of him and his dog Mia, showing she's the only lady in his life at the moment.\nIronically, on his timeline in November last year - around the time he will have been dating Barton - Zacharias shared a post left by The Zacharias Sexual Abuse Center on his Facebook page.\nThe successful sexual assault and rape advocacy center carrying his family's name is in Illinois near to where his parents live.\nAccording to his LinkedIn profile Zacharias did some pro-bono marketing work for the center in 2013, although it's not clear what connection the family has to the center.\nHis LinkedIn profile says he's a 'Freelance Digital Marketing, Branding and Search Engine Marketing Expert' and has a degree from the California Western School of Law.\nOne of his contacts says he's an 'SEO genius'.\nOn Facebook he says he's the Chief Marketing Officer for AlphaBiologica, a vitamin and supplements company.\nHe's also listed as the Chief marketing officer at Beverly Hills Temple of the Arts at the Saban Theater, as well as working for other firms.\nThe explicit footage appears to have been shot on a bed with a distinctive leather and mirror-paneled headboard. DailyMail.com has found a photo posted on Zacharias' Facebook page that shows the exact same headboard\nDad Steve, 69, and mom Marcia, also 69, have been married for 39 years and are from Highland Park, Illinois. They have three children.\nMarcia is listed as a professional counselor and marriage and family therapist.\nOn Tuesday a judge signed off on temporary domestic violence restraining orders against a Zacharias and Adam Shaw.\nBarton says she didn't realize Zacharias was recording their 'intimate relations' and taking 'photos of me naked in the shower' until after they broke up.\nThe actress says she split with Zacharias after she learned he was only interested in her because she was a celebrity.\nShe then began dating Shaw, a former friend of Zacharias, who told her that her ex had been bragging about the intimate material in his possession.\nShe goes on to say Shaw copied the photos and videos and tried to erase them from Zacharias' computer.\nShe said: 'Mr Zacharias is very technical, so I doubt that Mr Shaw was actually able to erase anything from Mr Zacharias' computer.'\nBarton said her and Shaw eventually broke up recently when he, too, 'tried to take advantage of me and forged my signature on some checks. He was arrested.'\nThe Beautiful Life star claims both guys are desperate for money, and she believes one or both are responsible for shopping the sex tape.\nShe stated: 'The only two people who could have any sexually intimate photos or videos of me are Jon Zacharias and Adam Shaw. Each of them desperately need money. It is only a matter of hours before those videos and photos could be sold and published online without a court order preventing the sale.'\nLondon-born Barton, 31, said she would be 'devastated' if the material were publish.\nMischa Barton gave an emotional statement Wednesday describing how her ‘worst fear’ was realized when she learned a sex tape of her was being shopped around Hollywood\nRuling: This is the restraining order that Mischa Barton and her legal team filed on Tuesday\nJon Zacharias is named as the man who filmed Mischa Barton during sex and then allegedly tried to sell it.: Mischa describes what happened to her and Zacharias during their relationship\n'It would hurt my career and I would be publicly embarrassed. The attempt to sell these videos or photos is nothing short of domestic violence in the form of revenge pornography and is being used to get back at me after the breakup of a relationship and to take advantage of my celebrity status - all without my permission, knowledge or consent.'\nEarlier on Wednesday Barton gave an emotional statement at her lawyer's office describing how her ‘worst fear’ was realized when she learned about the sex tape.\nOn Monday DailyMail.com revealed that Kevin Blatt, Hollywood’s sex-tape broker, had been approached by a third party with the video.\nHe said: 'The tape is being shopped around porn valley, the asking price is $500,000.\n'I know that at least three large online porn sites, YouPorn.com, Porn.com and RedTube.com have reviewed it and they're all seriously considering the offer.\n'I've seen stills from the video, it's clearly Mischa in my opinion.\n'She's seen performing a sex act on a guy and can be seen having sex in various positions.'\nAttempt to reach Zacharias by DailyMail.com have been unsuccessful.","url":"https://www.dailymail.co.uk/news/article-4320008/This-ex-Mischa-Barton-accuses-peddling-Revenge-Porn.html"}
