{"authors":[],"date_download":"2018-10-22 21:10:54","date_modify":"2018-10-22 21:10:54","date_publish":"2014-06-04 12:53:47","description":"The notable incumbents we’ve seen forced into runoffs so far this cycle eventually lost their races.","filename":"data/vaneerConsumption/MississippiRunoffBadNewsforThadCochran.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/486376/senate_mississippi-jpeg-0c651_191e390c8975f3e71636e0a7fada0e92.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_mississippi-runoff-bad-news-thad-cochran-n122171_1540242654.html","title":"Mississippi Runoff Bad News for Thad Cochran","title_page":"Mississippi Runoff Bad News for Thad Cochran","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA runoff is likely in Mississippi, and that isn’t good news for Cochran\nWith 99.5% precincts reporting, Tea Party challenger Chris McDaniel leads incumbent Sen. Thad Cochran (R-MS) by just more than 2,000 votes in Mississippi’s GOP Senate race. And with no one reaching 50% -- McDaniel is at 49.6% and Cochran at 48.9% -- it appears this contest will be headed for a June 24 runoff three weeks from now. And that isn’t good news for the six-term incumbent Cochran. First, the notable incumbents we’ve seen forced into runoffs so far this cycle (think Ralph Hall and David Dewhurst in Texas) eventually lost their races. Second, in a low-turnout runoff, the smart money is that the Tea Party will be more fired up to head to the polls than Cochran’s backers. And third, the storyline that dominated the homestretch of this primary and hurt McDaniel (the arrests linked to photographs of Cochran’s bedridden wife) could seem like old news come June 24, while a newer national storyline (questions about Cochran’s age) is surfacing after this dispatch from the Atlantic’s Molly Ball. “As he made his way toward the exit, the senator held out his hand to me. I had met and interviewed him less than half an hour before. ‘Hello, how are you doing?’ he said with a kindly smile. ‘I'm Thad Cochran.’” Then again, it’s possible that new revelations come out the arrests, and it’s equally possible that McDaniel finds himself on the defensive on another issue. But if Cochran was in trouble before the last night, he’s in bigger trouble today.\nTwo remaining questions for Cochran vs. McDaniel, Part 2\nOne, do pro-Cochran outside groups try to prop up the incumbent? McDaniel has benefitted from outside groups so far, but does Haley Barbour now bring in the cavalry to save Cochran? Two, what does the National Republican Senatorial Committee do in the runoff? In the original primary, not only was it backing the incumbent Cochran, it also went for the kill against McDaniel -- helping to turn those arrests into a national story. We bet the folks at the NRSC are doing some polling right now to see how electable, or unelectable, McDaniel could be in a general election. As we wrote yesterday, Democrats have a semi-credible candidate waiting in the wings to face the runoff winner: former Rep. Travis Childers (D-MS).\nThe other races we were watching\nIn the other primaries last night, state Sen. Joni Ernst easily crossed the 35% threshold in Iowa’s GOP Senate contest to advance to the general election, and she’ll face Rep. Bruce Braley (D-IA) in November -- in what will be a top-tier race to watch. (Ask yourself: What race is more likely to flip in November – Kentucky or Iowa?) In California’s gubernatorial primary, former Bush administration official Neel Kashkari (at 19.0%) narrowly beat Tea Partier Tim Donnelly (14.8%) to finish second in the state’s top-two “jungle primary”; Kashkari will face incumbent Democratic Gov. Jerry Brown (who got 54.5% in the primary). In California’s congressional primaries, Rep. Mike Honda (D-CA) and challenger Ro Khanna (D) finished one and two, respectively, and thus will face off again in November; it appears that Ted Lieu (D) and Elan Carr (R) advanced in the race to succeed retiring Rep. Henry Waxman (D-CA); and CA-31 is too close to call. Politico: “Republican Paul Chabot advanced out of California’s 31st District primary on Tuesday — but it remains unclear whether a Democrat or fellow Republican will face him on the ballot this fall. Democrat Pete Aguilar stood in second place by early Wednesday morning, and the national party hopes his 390-vote lead over Republican Lesli Gooch holds up so that they can try to pick up the seat from retiring GOP Rep. Gary Miller and avoid a repeat of 2012, when the two general-election candidates in the Democratic-leaning district were both Republicans.”\nGOP averts disaster in California\nThere’s a larger point to make about California: Republicans averted disaster, and even showed some signs of life. Donnelly being the GOP’s gubernatorial standard bearer would have been bad news for other Republicans up and down the ticket. What’s more, there were some Dem incumbents on the Congressional level who received less than 50% in their primaries. It means Democrats may have to spend more money defending California incumbents than they planned. This isn’t to say that the GOP is making a comeback in California -- far from it. But progress has to start from somewhere, right?\nA mixed night for the party-switching ex-reps\nAlso last night, it was a mixed night for party-switching ex-congressmen in the South. Ex-Democrat-turned-Republican Gene Taylor lost his primary against Rep. Steven Palazzo (R-MS). But in Alabama, ex-Democrat-turned-Republican-turned-Democrat Parker Griffith won the Democratic nomination for governor. One other race worth mentioning: Jeff Bell won the GOP nomination to face Cory Booker in New Jersey’s Senate contest. Who is Jeff Bell? He won the GOP Senate nomination in 1978, but lost to Bill Bradley. Is that the longest stretch between a candidate winning primaries – 1978 to 2014?\nOn Obama’s muscular speech in Warsaw\nIn Poland earlier this morning, President Obama delivered a very muscular speech -- one that Eastern Europeans likely wanted to hear. “I have come to Warsaw today—on behalf of the United States, on behalf of the NATO Alliance—to reaffirm our unwavering commitment to Poland’s security. Article 5 is clear—an attack on one is an attack on all. As allies, we have a solemn duty—a binding treaty obligation—to defend your territorial integrity. And we will. We stand together—now and forever—‘for your freedom and ours.’ Poland will never stand alone. Estonia will never stand alone. Latvia will never stand alone. Lithuania will never stand alone. Romania will never stand alone. These are not just words. They are unbreakable commitments.” This is as hawkish of a tone we have heard POTUS make overseas since his famous Peace Prize \"case for war\" acceptance speech.\nOn Bergdahl\nOn the Bergdahl story, we can tell you that the White House didn’t expect this amount of Republican blowback, and it also didn’t expect so much criticism on Bergdahl as a soldier. This is why the White House seems to be caught flat-footed here. On the other hand, all the criticism directed at Bergdahl and the White House seeming to bypass Congress -- instead of being focused on the Taliban Five -- is perhaps unsustainable in the long run, because it raises the question: So that means you didn’t want the United States to bring him back home? That is a tough side to be on in the long run. But the administration clearly needs to be careful sounding too praise worthy of Bergdahl. Exposure for all on this. The larger political fight that is coming is over the rest of the GITMO detainees. That's what we should be bracing for.\nClinton folks distance themselves a bit on the Bergdahl story\nHere’s another point to make on this story: It appears folks close to Hillary Clinton are distancing themselves from the Obama administration’s decision here, despite the fact that Clinton herself seemed to endorse it yesterday. “Secretary of State Hillary Clinton was personally and intensely involved in the debate over swapping five Taliban commanders for Sgt. Bowe Bergdahl in 2011 and 2012. But she had severe reservations about the potential deal, and demanded stricter conditions for the release of the prisoners than what President Obama settled for last week,” the Daily Beast reports. It’s a reminder that, when Clinton was secretary of state, she usually was on the more cautious and hawkish side when it came to making tough national-security decisions. Basically if Gates or Panetta were on the opposite side of the White House on a particular issue, Clinton usually chose to side with her Defense Dept counterpart rather than the president.\nWhite House eyes Cleveland Clinic head for VA secretary\nFinally given all the other news out there, remember that VA scandal? Well, it appears that there’s a front-runner for the job, if he wants it. “The Obama administration has approached Dr. Delos ‘Toby’ Cosgrove about running the troubled Department of Veterans Affairs, according to the Wall Street Journal,” the Cleveland Plain Dealer writes. “It is unclear whether the White House is also considering others for the VA secretary's job. The job became vacant last Friday with Secretary Eric Shinseki's resignation amid the growing scandal over patient treatment delays.” Who is Cosgove? He’s the head of the famous Cleveland Clinic (he’s also a Vietnam vet with a Bronze Star). The vetting process has just begun here, but this the model of the type of person the Obama White House wants.\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews","url":"https://www.nbcnews.com/politics/first-read/mississippi-runoff-bad-news-thad-cochran-n122171"}
