{"authors":[],"date_download":"2018-10-22 21:03:53","date_modify":"2018-10-22 21:03:53","date_publish":"2014-05-05 08:05:22","description":"\"It's very sensible to go back and have a look at all of the data that has been gathered,\" said MH370 search chief Angus Houston.","filename":"data/vaneerConsumption/MissingMalaysiaAirlinesJetWereTheyLookinginRightPlace.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_20/391851/140422-bluefin-mh370-545a_d4d2e8059f07b2b6a25d7e4bbc29a1f1.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_missing-malaysia-airlines-jet-were-they-looking-right-place-n96961_1540242233.html","title":"Missing Malaysia Airlines Jet: Were They Looking in Right Place?","title_page":"Missing Malaysia Airlines Jet: Were They Looking in Right Place?","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTwo months and thousands of man hours into the search, data compiled in the hunt for the missing Malaysia Airlines jet will be re-examined by experts to make sure the right area is being scoured, officials said Monday.\n\"It's very sensible to go back and have a look at all of the data that has been gathered, all of the analysis that has been done and make sure there are no flaws in it, the assumptions are right, the analysis is right and the deductions and conclusions are right,\" search chief Angus Houston told reporters in Canberra, Australia.\nStarting Wednesday, all of the data will be re-examined by an international team. No debris from the missing Boeing 777 has been located despite crews searching more than 1.8 million square miles of the southern Indian Ocean.\nThe hunt has focused on the remote region after a team of analysts calculated MH370's likeliest flight path based on satellite and radar data.\nSignals consistent with transmissions from aircraft black boxes were also heard in the area early last month by a U.S. Navy-owned pinger locator.\nHouston's comments followed discussions with Malaysian Defense Minister Hishammuddin Hussein and Chinese Transport Minister Yang Chuantang to determine the next stage of the search.\nOfficials are contacting governments and private contractors to find out whether they have specialized equipment that can dive deeper than the unmanned Bluefin-21 submarine that has spent weeks scouring the seafloor.\nThe Associated Press contributed to this report.","url":"https://www.nbcnews.com/storyline/missing-jet/missing-malaysia-airlines-jet-were-they-looking-right-place-n96961"}
