{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-23 03:46:26","date_modify":"2018-10-23 03:46:26","date_publish":"2016-01-28 19:27:30","description":"Students at Nipher Middle School in Missouri have been raising money to help their classmate, eighth grader Spencer Vincent and his family pay for the cost of his recent liver transplant.","filename":"data/vaneerConsumption/Missourimiddleschoolstudentshelpclassmatewhohadlivertransplantraising20K.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/19/30ACBF8700000578-0-image-a-76_1454009140723.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421485_Missouri-middle-school-students-help-classmate-liver-transplant-raising-20K-50K-goal_1540266386.html","title":"Missouri middle school students help classmate who had liver transplant raising $20K","title_page":"Missouri middle school students help classmate who had liver transplant raising $20K | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A teacher has made helping a student who had a liver transplant her lesson plan to show how one person can make a difference, leading students to raise money for their classmate's medical costs.\nSpencer Vincent, 14, an eighth grader at Nipher Middle School in Missouri was diagnosed with a chronic condition that caused his immune system to attack the ducts of his liver, KPLR11 reported.\nTwo weeks ago, he underwent a nearly-six hour surgery in which his life-saving liver transplant was successfully performed.\nScroll down for video\nA teacher has made helping student Spencer Vincent (pictured), who had a liver transplant, her lesson plan to show how one person can make a difference, leading students to raise money to help with his medical costs\nThis semester, Nipher Middle School students in teacher Florance Borman's class called The Power of One wanted to raise money to help pay for Spencer's liver transplant. He had been diagnosed with a condition causing his immune system to attack the ducts of his liver\nAnd this semester, students in teacher Florance Borman's class called The Power of One, a concept of how one person can make a difference, wanted to raise money to help pay for Spencer's liver transplant.\nThey have been raising money for the Children Organ Transplant Association in honor of Spencer and have already brought in $20,110 of their $50,000 goal.\n'These kids are so excited about things and so passionate about it and I see that coming through with how much they love Spencer and want to do stuff for him over and above anything I have seen,' Borman told KPLR11.\nSpencer was diagnosed with Primary Sclerosing Cholangitis and in November he was told by doctors that he would be placed on the list for a liver transplant.\n'These kids are so excited about things and so passionate about it and I see that coming through with how much they love Spencer and want to do stuff for him over and above anything I have seen,' Borman said\nOn January 11, Spencer (pictured at home) got the call that a liver transplant donation was available and hours later, doctors performed the surgery. Following the surgery he has to be out of school for at least 10 weeks\n'It just made me think, like, that could be any of us and it was Spencer, a kid in my own school and it's just crazy' Sara Mattingly, Spencer's classmate, told KPLR11.\nOn the morning of January 11, Spencer and his family got the call that a liver transplant donation was available and hours later, doctors at St. Louis Children’s Hospital performed the surgery.\nFollowing the surgery, Spencer has to be out of school for at least 10 weeks and does his school work from home, but his classmates continue checking on him.\n'I want him to know that I may not know you but I would be happy to meet you and we are working really hard for you and we hope you get better,' classmate Kiden Smith told KPLR11.\nHis classmates have been raising money for the Children Organ Transplant Association in honor of Spencer and have already raised $20,110 of their $50,000 goal\nWhile Spencer is excited to get back to school, he is thankful for his classmates and their support\nAccording to his donation page, a liver transplant can commonly exceed $500,000.\nAs the students work to meet their fundraising goal, they have planned a trivia night in April to help raise more money.\nWhile Spencer is excited to get back to school, he is thankful for his classmates and their support.\n'Thank you for supporting me and following my story, I'll be back soon,' he said.","url":"https://www.dailymail.co.uk/news/article-3421485/Missouri-middle-school-students-help-classmate-liver-transplant-raising-20K-50K-goal.html"}
