{"authors":["Lauren Barbato"],"date_download":"2018-10-30 23:09:54","date_modify":"2018-10-30 23:09:54","date_publish":"2014-08-14 00:16:20","description":"Mississippi has one abortion clinic — a bright pink house flanked by anti-abortion protesters and \"This Clinic Stays Open\" banners. For the last two years, the clinic, Jackson Women's Health Organization, has been in danger of closing due to an…","filename":"data/vaneerConsumption/MississippiAppealsAbortionRulingSoItsOneRemainingClinicCanShutDown.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/3a23711f-878a-4d00-b43c-21af64f0c96b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35701-mississippi-appeals-abortion-ruling-so-its-one-remaining-clinic-can-shut-down_1540940994.html","title":"Mississippi Appeals Abortion Ruling So Its One Remaining Clinic Can Shut Down","title_page":"Mississippi Appeals Abortion Ruling So Its One Remaining Clinic Can Shut Down","title_rss":"NULL","source_domain":"bustle.com","text":"Mississippi has one abortion clinic — a bright pink house flanked by anti-abortion protesters and \"This Clinic Stays Open\" banners. For the last two years, the clinic, Jackson Women's Health Organization, has been in danger of closing due to an admitting privileges law. Although the clinic won a major legal victory in July, it looks like the battle over Mississippi's last standing abortion clinic isn't over yet: Attorney General Jim Hood wants to reverse the federal appeals court ruling striking down Mississippi's abortion law. In doing so, the state once again puts the clinic — and its patients — in jeopardy.\nHood reportedly filed a petition on Wednesday requesting the 5th U.S. Circuit Court of Appeals to reconsider its ruling, issued in late July, so that Mississippi can enforce the admitting privileges law. The law, passed in 2012, requires doctors at Jackson Women's Health Organization to be board-certified and have admitting privileges at a local hospital. However, the clinic's physicians were denied admitting privileges at seven local hospitals.\nBecause Jackson Women's Health Organization would have been forced to close, the appeals court struck down the law. Without an abortion clinic in Mississippi, the law would place an \"undue burden\" on a woman's constitutional right to an abortion, the appeals court panel said.\nDefendants of the law argued that Mississippi women could travel to nearby states, such as Louisiana or Tennessee, if they needed an abortion. But the 5th Circuit panel didn't buy that argument:\n[We] hold that Mississippi may not shift its obligation to respect the established constitutional rights of its citizens to another state. Such a proposal would not only place an undue burden on the exercise of the constitutional right, but would also disregard a state’s obligation under the principle of federalism — applicable to all fifty states — to accept the burden of the non-delegable duty of protecting the established federal constitutional rights of its own citizens.\nTim Boyle/Getty Images News/Getty Images\nWhen the appeals court panel handed down the ruling last month, Mississippi Gov. Phil Bryant, a passionate supporter of the law, released a statement expressing dismay with the court.\nI am disappointed that two judges concluded that HB 1390 is unconstitutional. This measure is designed to protect the health and safety of women who undergo this potentially dangerous procedure, and physicians who provide abortions should be held to the same standards as physicians who perform other outpatient procedures.\nBryant added that because the case was heard by a panel of judges and not the full circuit court, he and Hood would be taking legal action to address \"the entire court.\" In Wednesday's filing, Hood stated that a separate panel of 5th Circuit judges upheld a similar admitting privileges law in Texas, and so the appeals court contradicted itself. The Associated Press reported it's uncertain when the court would consider taking on the Mississippi case again.\nMississippi isn't the only state to get entangled in a legal battle over an admitting privileges law, which is largely known as a TRAP law meant to limit access to abortion rather than improve women's health care. Just last week, a U.S. judge struck down Alabama's admitting privileges law, also claiming it placed an \"undue burden\" on women seeking abortions. In his opinion, Judge Myron Thompson wrote that there was “exceedingly weak” evidence that the admitting privileges law, which would have closed three out of five Alabama abortion clinics, was necessary for the patients' safety.\nImages: Getty Images (2)","url":"https://www.bustle.com/articles/35701-mississippi-appeals-abortion-ruling-so-its-one-remaining-clinic-can-shut-down"}
