{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-23 00:07:40","date_modify":"2018-10-23 00:07:40","date_publish":"2016-01-28 13:37:04","description":"She's got one of the most enviable figures around, so it comes as no surprise to see model Monika Radulovic showing it off on Thursday","filename":"data/vaneerConsumption/MissUniverseAustraliaMonikaRadulovicvisitsSydneyOperaHouse.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA291300000578-0-image-a-31_1453982661467.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420709_Miss-Universe-Australia-Monika-Radulovic-puts-leggy-display-visits-Sydney-Opera-House_1540253260.html","title":"Miss Universe Australia Monika Radulovic visits Sydney Opera House","title_page":"Miss Universe Australia Monika Radulovic visits Sydney Opera House | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's got one of the most enviable figures around, so it comes as no surprise to see model Monika Radulovic showing it off on Thursday.\nThe brunette beauty - who was crowned Miss Universe Australia in 2015 - flaunted her trim pins and put on a busty display in high-waisted shorts and a plunging crop top.\nThe 26-year-old on Thursday was spotted at The Sydney Opera House meeting cast members of the cabaret and acrobatic show Blanc de Blanc.\nScroll down for video\nStunning: Miss Universe Australia Monika Radulovic flaunted her trim pins and put on a busty display in high-waisted shorts and a plunging crop top in Sydney on Thursday\nLooking monochrome chic, her shorts were white and cream while her top was black.\nMonika had her brown hair straightened out and over her shoulders and her make-up included dewy foundation and a pink lip.\nBut apart from her legs, her accessories also drew attention, as she carried a black, white and brown Givenchy hand bag.\nSlung across her shoulders, she teamed it with a cream fluffy key ring.\nMeanwhile she kept her jewellery simple, and wore a red leather watch and showed off her diamond engagement ring from her fiancé, artist Alesandro Ljubicic.\nOutfit essentials: The brunette carried a Givenchy hand bag over her shoulder which had a fluffy cream key ring attached to it\nMonika appeared in high spirits as she met the cast of the new production Blanc de Blanc, which is held at the Sydney Opera House until February 28.\nOn the Sydney Opera House website, it comes with a strict warning advising guests that it is recommended for over 18s, writing: 'This performance contains adult concepts, full frontal nudity and references to alcohol consumption. The performance will contain theatrical haze, strobe lighting and limited organic herbal cigarette smoking.'\n'It’s the perfect crowd, a night of lavish laughs and immersive, naughty fun,' it also says.\nMonika met some of the performers on the steps of the iconic venue, and posed alongside them, including those who were performing tricky acrobatic moves while shirtless.\nHot to trot! Looking monochrome chic, her shorts were white and cream while her top was black\nShe's a beauty! The model had her brown hair straightened out and over her shoulders and her make-up included dewy foundation and a pink lip\nHello there! Monika appeared in high spirits as she met the cast of the new production Blanc de Blanc, which is held at the Sydney Opera House until February 28\nMonika also shared images from her time at the Sydney Opera House, where she made cocktails at Opera Bar.\nShe also shared another shot of herself with the venue in the background, writing: 'Spending my day off the best way possible; exploring my beautiful city. How incredible is the #sydneyoperahouse,' in part of her post.\nThe stunner recently had a stint on television, filling in as a Weekend Sunrise weather presenter recently for James Tobin while he was off.\nIt turned out to be quite a controversial start for the stunner, after sports broadcaster Hamish McLachlan placed his arms around her waist during a live weather report.\nA warm welcome: The star posed with two topless performers\nNot for young eyes: On the Sydney Opera House website, it comes with a strict warning advising guests that it is recommended for over 18s\nMixing it up! Monika also shared images from her time at the Sydney Opera House, where she made cocktails at Opera Bar","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420709/Miss-Universe-Australia-Monika-Radulovic-puts-leggy-display-visits-Sydney-Opera-House.html"}
