{"authors":["Awr Hawkins"],"date_download":"2018-10-30 18:21:42","date_modify":"2018-10-30 18:21:42","date_publish":"2014-09-11 13:39:56","description":"On September 10, the Missouri Senate voted to override Governor Jay Nixon's (D) veto of SB 656--the legislation to allow schools to train teachers to |","filename":"data/vaneerConsumption/MissouriSenateVotesToOverrideDemGovernorsVetoOfArmedTeachersBill.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2013/Guns/teachers-guns-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_09_11__1540923702.html","title":"Missouri Senate Votes To Override Dem Governor's Veto Of Armed Teachers Bill","title_page":"Missouri Senate Votes To Override Dem Governor's Veto Of Armed Teachers Bill | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On September 10, the Missouri Senate voted to override Governor Jay Nixon’s (D) veto of SB 656–the legislation to allow schools to train teachers to become “School Protection Officers” and carry guns with which to protect children on campus.\nSB 656 also allows people who possess a concealed carry permit (CCW) to openly carry firearms, and it lowers the legal age for a CCW from 21 to 19.\nThe override passed by a margin of 23 to 8. A house vote is set for September 11, where the veto is expected to be overturned.\nBreitbart News previously reported that when Governor Nixon vetoed the legislation in July, he said, “Arming teachers will not make our schools safer.” But he did not explain how training teachers in firearms proficiency would fail to make schools safer than they are now.\nLikewise, The Kansas City Star reports that Kansas City Mayor Sly James believes legalized open carry will make his city less safe. But the bill’s sponsor, Senator Will Kraus (R-Lee’s Summit), successfully argued that because open carry will only be legal for those with a CCW, the people who openly carry “will have been qualified with their weapons.”\nIt is worth noting that if SB 656 becomes law, Kansas City’s recent ban on the open carry of firearms will be lifted.\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2014/09/11/missouri-senate-votes-to-override-dem-governor-s-veto-of-armed-teachers-bill/"}
