{"authors":[],"date_download":"2018-10-30 20:27:36","date_modify":"2018-10-30 20:27:36","date_publish":"2015-10-19 13:01:18","description":"Authorities were giving kudos Monday to technology — and the perseverance of Georgia Tech students — for the safe return of a fellow student who disappeared after a Friday night party.","filename":"data/vaneerConsumption/MissingGeorgiaTechstudentfoundalivebutbruised.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_missing-georgia-_41c5133b38407cc6e08070ed681ca3ff__1540931256.html","title":"Missing Georgia Tech student found alive, but bruised","title_page":"Missing Georgia Tech student found alive, but bruised","title_rss":"NULL","source_domain":"ajc.com","text":"Authorities were giving kudos Monday to technology — and the perseverance of Georgia Tech students — for the safe return of a fellow student who disappeared after a Friday night party.\nJames Hubert, a senior at Tech, was found Monday morning along railroad tracks near DeKalb Avenue and Arizona Street in northeast Atlanta and taken to Grady Memorial Hospital, police said. He had been beaten and was unconscious, his mother Diane Hubert posted on Facebook.\nGeorgia Tech police Chief Robert Connolly credited “students for not giving up on their friend.”\nHubert, an aerospace engineering major from metro Atlanta and vice president of Georgia Tech’s Phi Delta Theta fraternity, had last been seen about 11 p.m. Friday at an off-campus sorority party at The Foundry at Puritan Mill on Joseph E. Lowery Boulevard, Atlanta police said. Cellphone records showed he was possibly in the area of DeKalb Avenue a couple of hours later.\n“The students rallied together and then they started searching,” Connolly told The Atlanta Journal-Constitution. “The students stayed out until midnight last night, putting out pamphlets and combing the area, anywhere they could possibly find [cell phone] pings along the route.”\nThe students “were not going to stop. They checked every hospital, every hotel, they checked everywhere,” Connolly said. “They didn’t give up on their friend.”\nThat doggedness paid off Monday morning, when Hubert was found battered, but alive, by a female student searching the area where Hubert’s cell phone had pinged.\nAtlanta police Lt. Charles Hampton described Hubert’s injuries as minor, adding that he was “not sure where those injuries came from.”\nHampton said while investigators had not found any evidence of foul play, Hubert has not been coherent enough to tell detectives what happened.\n“Once he gets to a state that we can interview him, we will ask him more information to further our investigation,” he said.\nOn Facebook, Hubert’s mother posted “HE’S ALIVE,” on her page. “Please continue to pray for his speedy recovery. He’s in bad shape but alive.”\nShe later posted a photo from Grady that showed her son with a bruised eye and other facial injuries.\n— Staff photographer John Spink contributed to this article.","url":"https://www.ajc.com/news/local/missing-georgia-tech-student-found-alive-but-bruised/IFX4IAKZb8aKyRC9iSUEFL/"}
