{"authors":[],"date_download":"2018-10-22 20:40:22","date_modify":"2018-10-22 20:40:22","date_publish":"2014-06-02 18:09:22","description":"Mississippi Sen. Thad Cochran remains the man Tea Party activists would most love to send packing after losing a series of high-profile races in 2014.","filename":"data/vaneerConsumption/MississippiPrimaryCouldBeLastStandforTeaParty.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/482046/140602-mcdaniel_mississippi_teaparty-1344_efab8b8ce70fde7688d7d11e984298b4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_elections_mississippi-primary-could-be-last-stand-tea-party-n120471_1540240822.html","title":"Mississippi Primary Could Be Last Stand for Tea Party","title_page":"Mississippi Primary Could Be Last Stand for Tea Party","title_rss":"NULL","source_domain":"nbcnews.com","text":"“It’s the worst: Chris McDaniel supporter charged with a felony for posting video of Senator Thad Cochran’s wife in a nursing home. Had enough?” a narrator says in a new commercial Cochran’s campaign is airing.\nIt’s not clear if the flap will put Cochran, 76, over the top. But it may have helped the longtime senator, who earlier this year seemed like the perfect man for the Tea Party to topple. In 2010 and 2012, Republican underdogs like Utah’s Mike Lee, Texas’ Ted Cruz and Florida’s Marco Rubio rode the Tea Party energy to defeat more establishment Republicans who were caught by surprise.\nCochran, like the other Republicans who were defeated, has a series of disadvantages: he is out of practice running in close races after winning landslides for years, has a generally conservative record but is not a firebrand in the mold of Cruz and is known mainly for his skill in navigating the congressional appropriations process to win money for his state, something Tea Party conservatives do not value.\nAnd Cochran can also easily be painted, as McDaniel has argued, as a politician steeped in Washington: Cochran was elected to the House in 1972, the Senate six years later and has served there since.\nOn the campaign trail, Cochran has touted that experience, arguing his seniority helps him be more effective for the state.\nI'm going to Washington to draw a line in the sand. I'm going to fight with Mike Lee. I'm going to fight with Rand Paul. I'm going to fight with Ted Cruz\nMcDaniel, 41, has campaigned in the mold of other Tea Party Republicans, pledging to repeal Obamacare, railing against Washington and pledging to serve only two terms in office if elected.\n\"I'm going to Washington to draw a line in the sand. I'm going to fight with Mike Lee. I'm going to fight with Rand Paul. I'm going to fight with Ted Cruz. We're going to be young. We're going to be dynamic. We're going to be energetic and we're going to change this country together,” he said in an interview with WLOX-TV, a station in Southern Mississippi, on the eve of the primary.\nIf McDaniel wins on Tuesday, he will illustrate the enduring power of conservative activists and join figures like Utah’s Lee who have defeated longtime Republican incumbents.\nBut if he loses, like anti-establishment candidates in North Carolina, Georgia and Kentucky have already in this GOP primary season, it will suggest that the party’s establishment has returned to the driver’s seat in controlling how the GOP picks its nominees.","url":"https://www.nbcnews.com/politics/elections/mississippi-primary-could-be-last-stand-tea-party-n120471"}
