{"authors":[],"date_download":"2018-10-30 20:59:22","date_modify":"2018-10-30 20:59:22","date_publish":"2015-06-24 23:18:17","description":"Readying for a walk around the Mississippi state Capitol building, Barbara Carpenter gazed at the state flag drooping high above her, listless in the stifling, late afternoon heat.","filename":"data/vaneerConsumption/MississippicouldbelaststatetoflyConfederateflagat.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_mississippi-could-last_803f3ca2dcd0277be20609afa6c9cc16__1540933162.html","title":"Mississippi could be last state to fly Confederate flag at...","title_page":"Mississippi could be last state to fly Confederate flag at...","title_rss":"NULL","source_domain":"ajc.com","text":"Readying for a walk around the Mississippi state Capitol building, Barbara Carpenter gazed at the state flag drooping high above her, listless in the stifling, late afternoon heat.\n“Hasn’t this already been decided?” the 52-year-old church clerical worker said, adjusting her earbuds and tightening her sneaker laces as she mulled whether the Confederate battle symbol should continue to be displayed on the banner.\n“I’m not sure if it’s good or not, but there it is and the people of this state voted on it. I hate to even think of going through all that again.”\nAnd while residents like Carpenter are weary of a debate over the flag, the issue has taken on new life in the wake of a racially-fueled massacre in Charleston, S.C. The preliminary moves made this week in South Carolina to haul the Confederate battle flag down from state Capitol grounds has sparked a wave of soul searching by other Southern states where the emblem still enjoys popularity and is displayed on license plates and monuments.\nIf South Carolina follows through on Gov. Nikki Haley’s pledge to remove the Confederate battle flag from outside the state Capitol in Columbia, Mississippi will stand alone in having the polarizing symbol waving at seat of state government.\nOn Wednesday, Republican Alabama Gov. Robert Bentley ordered the Confederate battle flag removed from a memorial on State House grounds. Earlier this week, Mississippi ‘s House speaker — a conservative white Republican — stunned many in the state by declaring he thought it was time for the symbol to go.\n“We must always remember our past, but that does not mean we must let it define us,” Philip Gunn, said in a statement.\n“As a Christian, I believe our state’s flag has become a point of offense that needs to be removed. We need to begin having conversations about changing Mississippi’s flag.”\nWhile the state’s U.S. senator Roger Wicker, also a Republican, followed suit, the state’s governor and lieutenant governor have been ambivalent and it’s highly unlikely the state will do anything before the Legislature convenes again in January. Even then, the prospects are uncertain at best. Civil rights advocates have collected some 50,000 signatures on a petition aimed at removing the flag, according to the the liberal group MoveOn.org\nMississippi may be known as the Hospitality State but it has long adopted a certain defiance. It resisted integration and the civil rights movement well after many other Southern states had accepted the inevitability of equal rights. It was the last state to abolish slavery by ratifying the 13th Amendment and also the last to repeal Prohibition. Mississippi was among the last SEC schools to integrate its football teams.\nStill, state Sen. Hillman Frazier, said Mississippi and South Carolina “are joined at the hip.”\n“They were the first to secede from the Union and we followed. We were both among the last to ratify the 13th Amendment,” Frazier said. “So, when they say ‘enough’ I think this state will listen.”\n“Do we really want to be all alone on this, of all things?”\nA PUBLIC MANDATE\nStill, for all their similarities, on this issue the political terrain is different in the two states.\nSouth Carolina was shaken to the core by the massacre at Emanuel African Methodist Episcopal Church in Charleston that left nine dead. The violence reached directly into the legislative chambers, with a state senator — the church’s pastor — among the dead. The shooter Dylann Roof has said he wanted to start a race war and multiple online photos surfaced showing him with the Confederate battle symbol focused attention on the flag, which continued to fly high in Columbia even through the state and American flags dipped to half staff out of respect to the dead.\nSouth Carolina will be at the center of the 2016 presidential contest as an early primary state and that added pressure to Republican leaders in the state to act.\nAnd in South Carolina, the Confederate battle flag is simply ornamental. Legislators will need to vote only to move where it is displayed. In Mississippi, the Confederate symbol is a part of the state flag, occupying the upper left corner of the banner. Lawmakers would need to alter the state flag itself , a politically fraught process that has proven contentious in others states, like Georgia.\nJust ask former Georgia Gov. Roy Barnes, whose re-election defeat in 2002 is blamed, in part, on his successful push the year before to change Georgia’s flag and shrink the Confederate symbol.\nBarnes said Wednesday he had no regrets.\n“We don’t own these offices. If I had to get beat to do it, so what?” the Democrat said at a news conference in Atlanta. “Now we don’t have to go through what South Carolina is going through and what Mississippi is now going through.”\nWhile in Georgia the changes to the state flag were approved by a vote by state lawmakers, in Mississippi elected officials threw the matter to the voters, That same year Mississippians voted by a roughly 2-1 margin to keep the Confederate battle cross in place. That vote is brandished by supporters of the flag as evidence of a clear public mandate.\n“I would caution the politicians in this state not to go against the will of the people,” said Greg Stewart of the Mississippi chapter of the Sons of Confederate Veterans told the Atlanta Journal-Constitution on Wednesday.\n“We’ve got a record of handling this as mature adults … leave it to the people, because otherwise it will make people bitter and then (Dylann) Roof gets what he wants after all.”\nCHANGING TIMES\nNot everyone agrees that matter is settled.\nSome say views in Mississippi have changed since 2001, with old guard support for the flag waning.\nNotably, while former Gov. Haley Barbour has indicated he still supports the state’s flag, which he noted has been place since 1894, his nephew Henry Barbour tweeted that he believes the symbol has run it’s course.\nOthers say the 2001 vote was marred by confusion and a bungled campaign effort by supporters of the change.\n“It should come down,” said Pastor Johnny Cameron, of Greater Mountain Calvary Baptist Church, said. “It is a calling card for hate and bigotry.”\nCameron said he and other pastors will be mounting an effort in the coming weeks to mobilize opposition to the flag.\nBut Stewart, of the Confederate Veterans said his group will also be strategizing for what he expects to be a coming political fight.\nHe likened efforts to remove the Confederate Battle symbol to the Taliban blowing up giant, historically-significant Buddhas in Afghanistan in an attempt to scrub history clean of competing viewpoints.\n“Words and symbols have to exist so people can communicate and when you start restricting words and symbols then you are hurting peoples ability to communicate and to remember history, all of it,” Stewart said.\n“What’s next? Where does it stop?”\nStill, others say it is not all cut and dry.\nAs he sat outside the Medgar Evers Library in Jackson, Dwight Smith, who is black, said he can see both sides.\n“For some people this is the flag their granddaddies fought and died under and so they see it as next to holy,” Smith said. “And then there are some and to them it’s all about hate.”\n“To me? What do I think? It’s just a piece of cloth.”","url":"https://www.ajc.com/news/mississippi-could-last-state-fly-confederate-flag-capitol/7d9NUTk7JtfLqW1ljO1vcP/"}
