{"authors":[],"date_download":"2018-10-30 14:29:17","date_modify":"2018-10-30 14:29:17","date_publish":"2015-01-19 00:00:00","description":null,"filename":"data/vaneerConsumption/MissUSAsmessageofhopeandloveandpeacetoterrorists.json","image_url":"https://www.americanthinker.com/images/bucket/2015-01/193949.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_01_miss_usas_message_of_hope_and_love_and_peace_to_terrorists__comments_1540909757.html","title":"Miss USA's message of 'hope and love and peace' to terrorists","title_page":"Blog: Miss USA's message of 'hope and love and peace' to terrorists","title_rss":"NULL","source_domain":"americanthinker.com","text":"The runner-up in the Miss Universe contest, Miss USA Nia Sanchez, gave an answer to her on-stage question that would make Barack Obama proud. Chosen to be one of the five finalists, Sanchez was asked by Filipino world champion boxer Manny Pacquaio, in painfully broken English, the following question: If you were given 30 seconds to deliver a message to a global terrorist, what would you say? After furrowing her perfectly arched eyebrows, rethinking and repeating what she thought he had said, Nia replied: I know as Miss USA I can always spread a message of hope and love and peace and so I would do my very best to spread that message to them and everyone else in the world. Miss Israel wasn’t one of the finalists. However, rest assured that if Doron Matalan, who served as a sergeant in the Israeli army, were asked a question about terrorism, her answer probably wouldn’t include the words “hope and love and peace.” What, pray... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/01/miss_usas_message_of_hope_and_love_and_peace_to_terrorists__comments.html"}
aris by Islamic terrorists?\nFrom the sound of Miss USA’s politically correct answer, there’s a good chance that when Jihadi John was busy beheading Americans James Foley, Steven Sotloff, and Peter Kassig with a kitchen knife, a preoccupied Nia was practicing how to walk around on sky-high heels while balancing a book on her head.\nEither that, or the girl has inhaled way too much hair spray.\nIt would probably come as a complete shock to Miss Nia that if the global terrorists got their hands on her pretty little head, it wouldn’t remain on her shoulders for very long.\nCould it be that the fetching girl from Nevada has been so busy having her teeth laminated and practicing good posture that she’s totally oblivious to the fact that every day, terrorists rape, genitally mutilate, and splash acid in the faces of little girls?\nAnd that’s if they’re lucky.\nIf Nia and her second-place crown were to go on a humanitarian mission to bring her feel-good message to global terrorists, she’d be immediately sold into sex slavery, stoned for indecency, or beheaded.\nAlthough we’re used to hearing such love-and-peace nonsense from Mr. Negotiation, Barack Obama, the fact that an American in a Miss Universe contest would give such an asinine response to such a serious question confirms that, by and large, beauty pageant contestants should really stick to strutting around in bikinis and evening gowns and quit trying to come up with solutions to world problems.\nStill, Miss Sanchez probably has an exciting future ahead of her.\nIn fact, there’s always the chance that if the president tuned in and heard Miss USA’s brilliant answer to the global terrorist question, with her Latina heritage and all, she could qualify as a stand-in for actress Eva Longoria, who occasionally brainstorms with Obama on issues like border security.\nIn his quest to prove to the naysayers that “hope and love and peace” change even the hardest of hearts, Obama could ask the black-belt beauty to advise him on how to better endear himself to ISIS, al-Qaeda, and Iran.\nIn the end, it’s too bad that the USA wasn’t represented by a girl with both beauty and brains and the gumption to look directly into the camera and say: “My 30-second message to global terrorists is this: despite our lily-livered president, America knows where you are, and we’re coming for you!”\nJeannie hosts a blog at www.jeannie-ology.com.","url":"https://www.americanthinker.com/blog/2015/01/miss_usas_message_of_hope_and_love_and_peace_to_terrorists_.html"}
