{"authors":[],"date_download":"2018-10-22 21:13:11","date_modify":"2018-10-22 21:13:11","date_publish":"2014-05-06 09:58:43","description":"“They simply don’t make vehicles to go to the sort depths of the ocean that we are talking about here,” Capt. John Noble said.","filename":"data/vaneerConsumption/MissingMH370OnlyHandfulofSubsCapableofHuntingJet.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_21/367601/140421-bluefin-0418_e313c7f8fb6b8211ca1c6bcd3451bdca.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_missing-mh370-only-handful-subs-capable-hunting-jet-n97901_1540242791.html","title":"Missing MH370: Only 'Handful' of Subs Capable of Hunting Jet","title_page":"Missing MH370: Only 'Handful' of Subs Capable of Hunting Jet","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nOnly \"a handful\" of submersible vehicles can search the depths of the southern Indian Ocean in the area that is believed to be the final resting place of missing Malaysia Airlines Flight MH370, experts said Tuesday.\nOfficials announced Monday that all of the data compiled in the hunt for the Boeing 777 will be re-examined to make sure the right area is being scoured as part of a new $55 million phase of the operation.\nCapt. John Noble, the former general manager of the International Salvage Union, told NBC News that it made sense to narrow down the search area as much as possible.\n“You'd be lucky if there was a handful of vehicles that can to go to the sort depths of the ocean that we are talking about here because they simply don't make them,” Noble said.\nA U.S. Navy deep-tow search system called the Orion might be an option, Noble said. It can search to a maximum depth of 20,000 feet of seawater, according the U.S. Navy Supervisor of Salvage and Diving. The Orion would operate in tandem with a remotely operated vehicle called Curv 21 which could salvage any wreckage.\nMost commercially owned remotely operated vehicles (ROV’s) aren’t designed to go to those depths because there simply isn’t the call for them, according to Dr. Simon Boxall at Britain’s University of Southampton. As a result, many of those built are used for government research projects.\nThey have a distinct advantage over autonomous underwater vehicles like the Bluefin 21 sub which has been leading the search, because their cameras allow a live view of the seabed he said. The Bluefin’s data can only be downloaded and analyzed by researchers after it has resurfaced, he added.\n“An ROV will also have manipulators like claws built onto it,” he added. “So if you found a black box they would be capable of picking it up or they can attach cables to a wing so it can be brought to the surface.”\nAt around $17,000 per day, an ROV costs considerably more to run than the Bluefin, Boxall said.","url":"https://www.nbcnews.com/storyline/missing-jet/missing-mh370-only-handful-subs-capable-hunting-jet-n97901"}
