{"authors":[],"date_download":"2018-10-22 21:26:01","date_modify":"2018-10-22 21:26:01","date_publish":"2014-05-07 08:25:10","description":"The group of experts will “continue the review of information that will assist in progressing future underwater search planning,” authorities said.","filename":"data/vaneerConsumption/MissingFlightMH370ExpertsGatherinAustraliatoReviewData.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_35/257101/140317-malaysia-jet-10a_62c2099a537fc49714f0694b368be4d7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_missing-flight-mh370-experts-gather-australia-review-data-n98976_1540243561.html","title":"Missing Flight MH370: Experts Gather in Australia to Review Data","title_page":"Missing Flight MH370: Experts Gather in Australia to Review Data","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA team of aviation experts met in Australia on Wednesday to review all of the data relating to missing Flight MH370.\nThe group will “continue the review of information that will assist in progressing future underwater search planning,” Australia’s Joint Agency Coordination Centre said in a statement. “The work of the groups will be ongoing in the coming weeks as the underwater search planning progresses.\"\nRepresentatives from the U.S. National Transportation Board, the U.K.’s Air Accident Investigation Branch and the Australian Transportation Safety Bureau were among those who attended the meeting in Canberra.\nExperts from Inmarsat, the British satellite communications company which helped to narrow down the serach zone, and technical advisers from Boeing were also present.\nNo debris has been found since the Malaysia Airlines jet vanished on March 8.\nOn Tuesday, an expert told NBC News that only \"a handful\" of commercial vehicles could search the depths of the southern Indian Ocean in the area that is believed to be the Boeing 777's final resting place.\n- Henry Austin","url":"https://www.nbcnews.com/storyline/missing-jet/missing-flight-mh370-experts-gather-australia-review-data-n98976"}
