{"authors":["Awr Hawkins"],"date_download":"2018-10-30 22:16:28","date_modify":"2018-10-30 22:16:28","date_publish":"2018-07-23 18:51:19","description":"Senate challenger Austin Peterson (R) is celebrating the Second Amendment ahead of Missouri's primaries by giving away a 3-D gun printer. | Politics","filename":"data/vaneerConsumption/MissouriSenateChallengerCelebrates2ndAmendmentwith3DGunPrinterGiveaway.json","image_url":"https://media.breitbart.com/media/2018/07/austin-petersen-missouri-congress.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_07_23__1540937788.html","title":"Missouri Senate Challenger Celebrates 2nd Amendment with 3-D Gun Printer Giveaway","title_page":"Missouri Senate Challenger Celebrates 2nd Amendment with 3-D Gun Printer Giveaway | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Senate challenger Austin Petersen (R) is celebrating the Second Amendment ahead of Missouri’s primaries by giving away a 3-D gun printer.\nHis office issued a release on the giveaway, saying, “This week we will be releasing two endorsements as well as beginning a giveaway. The giveaway will be for a Ghost Gunner 2 3D printer, which is a device that allows individuals to 3D print an AR15 lower in their home. Previously, Austin was banned from Facebook twice for giving away an AR15 on Facebook.”\nA Defense Distributed Ghost Gunner 2 allows Americans to complete 80 percent lowers for AR-15s or 1911 pistols in their own home:\nOn September 28, 2017, Petersen published an open letter to Mark Zuckerberg, regarding difficulties he experienced while trying to publicize his AR-15 giveaway. The letter said in part:\nIn my campaign for the United States Senate, I have made Facebook a centerpiece of my outreach efforts. I have used both my Personal Profile and my Official Page to connect with friends, family, and supporters, and to share and express our views about the future of the country. That’s why, on September 22, I was so shocked to receive a notification from Facebook informing me that I had been “blocked” from using Facebook for thirty days because I “recently posted something that violates Facebook’s policies.” Believing this to be a mistake, my campaign reached out to Facebook for more information. Today — six days later — I still have not received an explanation, and the block remains in effect. At the same time the block was affected, a Facebook Live video I had posted to my Official Page promoting my campaign’s AR-15 giveaway was removed. A few days later, a Status Update posted to my Profile referencing the same giveaway was also removed.\nPetersen is running in the Missouri Republican primary on August 7, 2018.\nAWR Hawkins is an award-winning Second Amendment columnist for Breitbart News, the host of the Breitbart podcast Bullets with AWR Hawkins, and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.","url":"https://www.breitbart.com/politics/2018/07/23/missouri-senate-challenger-celebrates-2nd-amendment-gun-printer-giveaway/"}
