{"authors":[],"date_download":"2018-10-22 22:23:22","date_modify":"2018-10-22 22:23:22","date_publish":"2014-05-09 17:56:26","description":"Russell Bucklew, 45, says a tumor in his head could lead to a bloody, prolonged lethal injection.","filename":"data/vaneerConsumption/MissouriInmateChallengesLethalInjectionBasedonBirthDefect.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_21/432721/140509-bonne-terre-death-row-mn-1440_4fecc413784ab7ab5e1146e8134861d2.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_lethal-injection_missouri-inmate-challenges-lethal-injection-based-birth-defect-n101646_1540247002.html","title":"Missouri Inmate Challenges Lethal Injection Based on Birth Defect","title_page":"Missouri Inmate Challenges Lethal Injection Based on Birth Defect","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA Missouri death-row inmate is trying to stop his execution on the grounds that a tumor in his head would make the lethal injection \"bloody, prolonged and excruciating.\"\nConvicted murderer and rapist Russell Bucklew — dubbed a \"homicidal Energizer bunny\" by one prosecutor — was born with a medical condition that causes malformed vessels to form in his head, face and throat, leading to hemorrhages and bleeding difficulty.\nThe large masses could stop Missouri's execution drug, pentobarbital, from circulating as intended, prolonging the execution in violation of the constitutional protection against cruel and unusual punishment, his lawyers argued in court papers on Friday.\n\"The size of Mr. Bucklew's tumor and the weakness of his distended vessels create a very substantial risk that he will suffer excruciating, even tortuous pain during execution,\" they wrote.\nBucklew, 45, was sentenced to death for the 1996 shooting death of Michael Sanders, who had given refuge to his abused ex-girlfriend. He also kidnapped and raped the ex-girlfriend and shot at a police officer.\n\"In my closing arguments, I referred to him as a homicidal Energizer bunny, because you could shoot him, jail him, and if he hates you and wants to hurt you, he'll just keep coming after you,\" prosecutor Morley Swingle told the Southeast Missourian newspaper last month.\nThe Missouri Attorney General's office said it would not comment on pending litigation.\nThe move to stop Bucklew's execution comes days after a botched execution in Oklahoma ignited a new round of debate on lethal injections.\nHis lawyers referenced the messy death of Clayton Lockett — who appeared to regain consciousness and writhe in pain after a possible vein collapse — to suggest an unhealthy prisoner might face even more complications.\nMissouri uses pentobarbital, likely obtained from a compounding pharmacy, to kill prisoners. Lockett was given a three-drug protocol of midazolam, vecuronium bromide and potassium chloride.\nExecutions in Oklahoma are on hold while the state investigates what went wrong, and Lockett's death is expected to become fodder for challenges to lethal injection in other states.\n— Tracy Connor","url":"https://www.nbcnews.com/storyline/lethal-injection/missouri-inmate-challenges-lethal-injection-based-birth-defect-n101646"}
