{"authors":["Jacob Polychronis For Daily Mail Australia","Australian Associated Press"],"date_download":"2018-10-23 01:06:22","date_modify":"2018-10-23 01:06:22","date_publish":"2017-03-10 08:44:45","description":"Samuel Thompson, 22, was last seen Tuesday morning in his 2016 Ford Mustang leaving his home in Albion, Brisbane. The vehicle was located 150km away on Thursday morning north of Byron Bay.","filename":"data/vaneerConsumption/MissingBrisbanemanfeareddeadafterMustangisfound.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E21A47200000578-0-image-a-2_1489135434212.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300238_Brisbane-man-missing-feared-dead-Mustang-found_1540256782.html","title":"Missing Brisbane man feared dead after Mustang is found","title_page":"Missing Brisbane man feared dead after Mustang is found | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Samuel Thompson, 22, was last seen Tuesday morning leaving his Albion home in his 2016 Ford Mustang\nA Brisbane family has grave fears for a missing Brisbane man after his orange muscle car was found abandoned in northern NSW.\nSamuel Thompson, 22, was last seen Tuesday morning leaving his Albion home, in Brisbane's north, in his 2016 Ford Mustang.\nThe vehicle was located 150km away on Thursday morning by NSW police in the small town of Wooyung, north of Byron Bay.\nPolice are fearing the worst for Mr Thompson, as family members say his behaviour is out of character.\n'People go missing all the time but normally those people aren't of good physical and mental health,' Detective Inspector Tim Trezise said on Friday.\n'Police hold grave concerns for his safety, we don't know where he is.\nDet Insp Trezise said Mr Thompson was close to his family, friends and girlfriend, but no one had heard from him since Tuesday.\n'His family are very concerned for his welfare and want the community to help find Sam,' he said.\nHis social media accounts have not been used, and officers found nothing unusual in his apartment.\nAn ongoing major investigation involving about 20 officers is trying to locate Mr Thompson.\nDet Insp Trezise said police are unsure if Mr Thompson's disappearance is connected to a robbery in Northgate in September 2016 where his car was stolen.\n'That offence remains outstanding, it was never solved,' he said.\nThe vehicle was located 150km away on Thursday morning by NSW police in the small town of Wooyung, north of Byron Bay\n'There are certainly suspects in relation to the robbery and we'd like to locate them.\n'It'd be nice to be able to rule them out of any connection with Sam's disappearance.'\nMr Thompson is described as Caucasian, about 180cm tall with a slim build, brown hair and brown eyes.\nPolice have appealed for anyone with information regarding the 22-year-old's whereabouts or who may have seen his Mustang between Tuesday and Thursday morning to come forward.\nMr Thompson's Ford Mustang bears Queensland registration with the number plate 'SAMMO'.","url":"https://www.dailymail.co.uk/news/article-4300238/Brisbane-man-missing-feared-dead-Mustang-found.html"}
