{"authors":[],"date_download":"2018-10-22 23:01:21","date_modify":"2018-10-22 23:01:21","date_publish":"2014-05-13 13:31:01","description":"Tracking of passenger jets should be improved after the \"unthinkable” disappearance of MH370, aviation leaders at the ICAO conference was told.","filename":"data/vaneerConsumption/MissingMH370PassengerJetsMustBeTrackedEUSays.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_26/237921/140308-malaysia-plane-js-0659_8faeb8287368d4013607739c8cbb487d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_missing-mh370-passenger-jets-must-be-tracked-eu-says-n104056_1540249281.html","title":"Missing MH370: Passenger Jets Must Be Tracked, EU Says","title_page":"Missing MH370: Passenger Jets Must Be Tracked, EU Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe world's leading aviation body on Tuesday debated how to improve passenger-jet tracking in light of the disappearance of a Malaysia Airlines flight.\nTracking of passenger jets should be improved because it is “unthinkable” that a flight such as Malaysia Airlines MH370 could simply disappear, aviation industry leaders were told.\n\"An aircraft should be permanently tracked, even beyond radar coverage, and in case of an accident it should be immediately located,\" the European Union said in a paper to the industry’s global body, the United Nations-linked International Civil Aviation Organization (ICAO).\nRegulators have been discussing since 2010 how to improve communications with passenger jets over oceans and remote areas after Air France Flight 447 plane crashed into the Atlantic a year earlier, but they have so far failed to agree on a feasible or co-ordinated international approach to the problem.\nHowever, worldwide alarm at the failure to find MH370 in more than two months since it vanished en route to Beijing has pushed the issue to the top of the aviation agenda.\nOn the second of a two-day ICAO conference at the group's headquarters in Montreal, Canada, discussion continued Tuesday over how to better track long-haul flights in vast areas that are not covered by radar.\n“AF447 and MH370 cannot be considered as isolated cases,” read the European Union’s contribution to the discussion. “There is a growing number of long-range aircraft that fly over oceans to connect distant continents. It is important to improve the ability to quickly locate (missing) aircraft for saving potential survivors and preventing effectively future accidents.”\nThe EU paper also recommended better tracking of flight data in light of the theory that MH370 might have been brought down in a deliberate act. The Boeing 777’s cockpit voice recorder and flight data recorder from are still missing, presumed to be with the wreckage.\n“Without prejudice to the [MH370] causes, this accident highlighted a number of vulnerabilities, in particular regarding the possible intentional disconnection of airborne [tracking] systems,” the EU paper said.\n“The fact that a number of other airplane losses are related to deliberate actions by pilots leads to include this issue in aircraft tracking, in particular by alerting someone on the ground of the development of an unusual situation.”\n“Knowing as soon as possible the development of unusual situations, such as the deliberate disconnection of flight recorders or tracking systems, should help to improve our understanding of them and in turn to prevent loss of data as a result of a crash. It should enable to quickly distinguish intentional events from related accidents.”\nThe Associated Press contributed to this report.\n-Alastair Jamieson","url":"https://www.nbcnews.com/storyline/missing-jet/missing-mh370-passenger-jets-must-be-tracked-eu-says-n104056"}
