{"authors":["Awr Hawkins"],"date_download":"2018-10-30 18:21:34","date_modify":"2018-10-30 18:21:34","date_publish":"2014-09-09 18:21:38","description":"In July, Missouri Governor Jay Nixon (D) vetoed SB 656--legislation that would have allowed schools to train faculty to become","filename":"data/vaneerConsumption/MissouriLawmakersMeettoOverrideDemGovernorsVetoofArmedTeachersBill.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2014/Guns/handgun-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_09_09__1540923694.html","title":"Missouri Lawmakers Meet to Override Dem Governor's Veto of Armed Teachers Bill","title_page":"Missouri Lawmakers Meet to Override Dem Governor's Veto of Armed Teachers Bill | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In July, Missouri Governor Jay Nixon (D) vetoed SB 656–legislation that would have allowed schools to train faculty to become “School Protection Officers” and carry guns with which to protect children on campus.\nThe Missouri General Assembly will convene on September 10 and 11 in an attempt to override Nixon’s veto of this bill.\nOn May 17 Breitbart News reported the Missouri House passed SB 656 by a margin of 111 to 28. It takes 109 votes to override a veto. The South County Mail reported the Missouri Senate passed the bill 21-7, two votes short of the 23 necessary to override a veto. However, it should be noted the three Republican state senators “were not present for the vote.”\nThe NRA-ILA reports that when Governor Nixon vetoed the bill he said, “Arming teachers will not make our schools safer.” He said that while he supported “authorized law enforcement officers employed as school resource officers” he could not “condone putting firearms in the hands of educators.”\nGovernor Nixon did not explain why “educators” cannot educate and at the same time be ready to defend their own lives and the lives of children.\nFollow AWR Hawkins on Twitter @AWRHawkins Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2014/09/09/missouri-lawmakers-meet-to-override-dem-governor-s-veto-of-armed-teachers-bill/"}
