{"authors":[],"date_download":"2018-10-22 22:23:39","date_modify":"2018-10-22 22:23:39","date_publish":"2014-06-09 00:00:00","description":"Authorities are asking for the public’s help as they attempt to track down Nicole Goodlett, reported missing in March in Spartanburg, SC.","filename":"data/vaneerConsumption/MissinginAmericaNicoleGoodlett.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_24/497866/nicolegoodlett_e5a29d75e67dd6f2526d7e7f387c7288.nbcnews-fp-1200-630.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/feature_missing-in-america_missing-america-nicole-goodlett-n126726_1540247019.html","title":"Missing in America: Nicole Goodlett","title_page":"Missing in America: Nicole Goodlett  - NBC News","title_rss":"NULL","source_domain":"nbcnews.com","text":"Local authorities are asking for the public’s help as they attempt to track down Nicole Goodlett, who was first reported missing on March 12, 2014 by her parents in Spartanburg, SC.\nGoodlett, who is called Alazay or Zay by friends, suffers from depression. Her parents do not believe she has her medication with her, and are duly concerned for her safety.\nGoodlett is 5'10\" tall, weighs 130 pounds and wears her hair both curly and straight.\nInvestigators believe that Goodlett may be the victim of foul play, but cannot give more information about that belief without compromising their investigation.\nJerald Howard, Goodlett’s boyfriend, has been identified as a person of interest in the case. Howard dropped their twin girls at his parents' home after she went missing and has been back and forth since. No charges against him have been filed, but they would like to speak with him about the case.\nThe twins are now in the Department of Social Services custody while her 5-year-old son is with Goodlett's parents.\nIf you know where to find Howard or Goodlett, please call 1-888-CRIME-SC.","url":"https://www.nbcnews.com/feature/missing-in-america/missing-america-nicole-goodlett-n126726"}
