{"authors":["Associated Press"],"date_download":"2018-10-22 20:08:26","date_modify":"2018-10-22 20:08:26","date_publish":"2016-01-29 00:32:16","description":"JEFFERSON CITY, Mo. (AP) — Missouri lawmakers on Thursday blocked a plan that would have raised taxes on the state's most valuable farmland. Property taxes o...","filename":"data/vaneerConsumption/Missourilawmakersblockhighertaxesonsomefarmland.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421974_Missouri-lawmakers-block-higher-taxes-farmland_1540238906.html","title":"Missouri lawmakers block higher taxes on some farmland","title_page":"Missouri lawmakers block higher taxes on some farmland | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Missouri lawmakers block higher taxes on some farmland\nJEFFERSON CITY, Mo. (AP) — Missouri lawmakers on Thursday blocked a plan that would have raised taxes on the state's most valuable farmland.\nProperty taxes on Missouri farms are based on their productive value — the amount of money they're expected to generate from agriculture — instead of market value. The best land is deemed Grade 1, and the worst is Grade 8. The Missouri Tax Commission voted in December to raise productivity values by 5 percent on land in the top four grades for the 2017 and 2018 tax years.\nLawmakers had until early March to pass a resolution blocking the increase. The Senate voted 29-2 on Thursday to reject it, following the House's 133-24 vote last week. The resolution does not need the governor's signature to take effect.\nAbout 35 percent of Missouri's 37 million acres of farmland are in the top four grades. Farmers usually grow cotton and rice on that land, while lower grades are typically used for pastures or timber, said Scott Brown, an assistant research professor of agriculture and applied economics at the University of Missouri.\nThe tax commission proposes new productive values every two years, though lawmakers have only allowed two adjustments since 1995. Productive value is speculative, Brown said, and policymakers can disagree on how to interpret historical trends. For instance, crops grown on high-grade land have had good returns the last few years, he said, though that could either mean the land is undervalued or that returns will likely decrease in the future.\nSen. Mike Parson, the Republican from Bolivar who handled the resolution in the Senate, said the timing wasn't right for more taxes on farmers.\n\"Agriculture's a tough arena,\" he said after the vote, pointing out that the average farmer is getting older, and many families are selling off their farms rather than continuing to grow food.\n\"It's very difficult for a young man, a young woman to get in that arena anymore just because of the cost of it. But the demands are not going to go away,\" he said.","url":"https://www.dailymail.co.uk/wires/ap/article-3421974/Missouri-lawmakers-block-higher-taxes-farmland.html"}
