{"authors":["Associated Press"],"date_download":"2018-10-22 20:08:17","date_modify":"2018-10-22 20:08:17","date_publish":"2016-01-28 00:23:32","description":"KANSAS CITY, Mo. (AP) — Missouri Sen. Claire McCaskill did something Wednesday that her congressional colleagues in Washington have found elusive: She reache...","filename":"data/vaneerConsumption/MissouriSenMcCaskillservesonjuryrulesforplaintiff.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:d7024a71eb2b46079affbe9c2fdaee5f-4vVdYopwYQ7f641721b07a6b76d4-378_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419927_Missouri-Sen-McCaskill-serves-jury-rules-plaintiff_1540238897.html","title":"Missouri Sen. McCaskill serves on jury, rules for plaintiff","title_page":"Missouri Sen. McCaskill serves on jury, rules for plaintiff | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Missouri Sen. McCaskill serves on jury, rules for plaintiff\nKANSAS CITY, Mo. (AP) — Missouri Sen. Claire McCaskill did something Wednesday that her congressional colleagues in Washington have found elusive: She reached a consensus, even if it was during her first-ever stint on a jury.\nThe Democratic former prosecutor and 11 other jurors sided with a 51-year-old St. Louis County man, Leotis Tate, in his negligence lawsuit against QuikTrip Corp. over his 2014 tumble outside one of the company's convenience stores.\nThe jurors awarded Tate $45,000 in damages, but he'll only get $33,750 because they deemed him to be 25 percent at fault. Each side must pay its own attorney fees.\nFILE - In this Aug. 23, 2013 file photo, Sen. Claire McCaskill, D-Mo., speaks in St. Joseph, Mo. Much to her astonishment but fulfilling a lifelong dream, the former prosecutor was chosen Monday, Jan. 26, 2016 for jury duty in St. Louis to help decide a slip-and-fall case against a convenience store giant accused of negligence. (AP Photo/The St. Joseph News-Press, Sait Serkan Gurbuz, File)\nMcCaskill, who gushed on Twitter on Monday about how being picked for a jury was astonishing and a lifelong dream, said Wednesday that hearing and deciding the case left her \"feeling empowered.\"\n\"Everyone (on the jury) had very different perspectives and different viewpoints, a lot like Congress,\" she told The Associated Press by telephone after hustling back to Washington. \"Instead of retreating to corners, everyone listened to each other. People were willing to compromise.\n\"I was thinking during the whole deliberations, 'This is how Congress should work. This is what our Founding Fathers envisioned.'\"\nMcCaskill also took to Twitter again, casting lawyers' questions that she found repetitive or irrelevant as \"kinda irritating to jurors.\"\n\"This will be the first time I've listened to a judge's instructions to the jury when I haven't been going over my closing argument in my head,\" she tweeted.\nShe followed that with: \"Lots of people have asked, 'Why didn't you get out of jury duty?' Didn't try.\" And she said she doesn't think her Beltway colleagues should, if called, telling the AP that a 1991 federal law allowing members of Congress to decline serving on juries \"flat wrong.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3419927/Missouri-Sen-McCaskill-serves-jury-rules-plaintiff.html"}
