{"authors":["Rachel Eddie","Tanya Li For Daily Mail Australia"],"date_download":"2018-10-22 20:40:01","date_modify":"2018-10-22 20:40:01","date_publish":"2016-01-28 02:35:12","description":"The owner of Mister Jones espresso, in Bermagui, NSW, has been blasted with death threats after placing a sign which referred to Australia Day as 'national D***head Day'.","filename":"data/vaneerConsumption/MisterJonesespressobarreceivesdeaththreatsoverAustraliaDaysign.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/02/30A63F2400000578-0-image-a-25_1453947771881.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420218_Owner-coffee-shop-Bermagui-NSW-receives-death-threats-Australia-Day-sign_1540240801.html","title":"Mister Jones espresso bar receives death threats over Australia Day sign","title_page":"Mister Jones espresso bar receives death threats over Australia Day sign | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A complaint was made to the police and\nThe owner of a rural coffee shop has been flooded with death threats after posting a sign which said they would be open on 'national d***head day'.\nA blackboard sign was put up at the Mister Jones café on Monday, the day before Australia Day which said: 'Yes, we're open on national d***head day.'\nOutrage at the café in Bermagui, five hours south of Sydney, had grown after a photo of the sign was shared to a popular Facebook page and went viral.\nThe owner of Mister Jones, Matt, outlined in a Facebook post that he was receiving 'graphic and explicit' death threats through his voicemail.\nThe threats ranged from 'vandalism, arson, murder and mass violence', while vandals drilled his door locks and glued the store windows shut to prevent him from re-opening.\nA blackboard sign was put up at the Mister Jones café on Monday, a day before Australia Day which said: 'Yes, we're open on national d***head day'\nAn image of the sign was posted to Meanwhile in Australia on Monday, and has since been liked and shared more than 7,000 and 3,500 times, respectively.\nThe majority of the 1,900 comments on the post have chastised the Mister Jones café, while some have hijacked the Facebook page for the business and left poor reviews with a one star rating.\n'Over the last days, messages have been cascading through my email account, containing unprintable abuse and describing group plans for physical attacks,' Matt, owner of Mister Jones, said.\n'My voicemail account has mercifully reached capacity and I've long stopped listening to the graphic and explicit death threats. These messages have been much more chilling than the thousands posted online.'\nSome outraged at the sign appear to have made up seeing 'rats and cockroaches scurrying away' and being served coffee that tasted like 'diarrhoea' or 'bong water'.\nMany called the café 'disgraceful' or 'un-Australian'.\nOutrage at the café in Bermagui, five hours south of Sydney, has grown after it a photo of the sign referring to Australia Day as 'D***head Day' was shared to a popular Facebook page and went viral\nThe image of the sign referring to Australia Day as 'D***head Day' was also shared to pages including Truthophobes – Exposing the Truth about Islam and Aussie Infidels, who also shared pictures of the owners.\nMatt, in his Facebook post continued to say that Australia Day was a 'singular atrocity.'\n'Celebrating January 26 at best trivialises - and at worst glorifies - the invasion of this continent, declaration of terra nullius, massacre and attempted genocide of its 30,000 year old indigenous population.'\nAccording to one customer who wrote in support of the Mister Jones café, owners have since taken the sign down 'just in case some pissed hoons wanted to throw bottles'.\nThe customer also said there was a 'queue out the door' for the coffee bar, unaffected by those outraged at the sign.\nKeith Dowden, Bermagui Chamber of Commerce president, confirmed the sign had been removed, Bega District News reported.\nThe same café reportedly had a sign at its entrance on Australia Day last year which said: 'Strictly no patriotism beyond this point'.\nA NSW police spokesperson told Daily Mail Australia that a complaint was lodged with Bermagui police on Monday. Investigations are continuing.","url":"https://www.dailymail.co.uk/news/article-3420218/Owner-coffee-shop-Bermagui-NSW-receives-death-threats-Australia-Day-sign.html"}
