{"authors":["Associated Press"],"date_download":"2018-10-23 00:34:59","date_modify":"2018-10-23 00:34:59","date_publish":"2017-03-10 07:14:07","description":"MELBOURNE, Australia (AP) - Fast bowler Mitchell Starc won't play in the remaining two cricket tests against India due to a stress fracture in his right...","filename":"data/vaneerConsumption/MitchellStarcoutoffinal2Indiatestswithfootfracture.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300226_Mitchell-Starc-final-2-India-tests-foot-fracture_1540254899.html","title":"Mitchell Starc out of final 2 India tests with foot fracture","title_page":"Mitchell Starc out of final 2 India tests with foot fracture | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MELBOURNE, Australia (AP) - Fast bowler Mitchell Starc won't play in the remaining two cricket tests against India due to a stress fracture in his right foot, a big blow to Australia's chances of winning the four-match series which is level at 1-1.\nCricket Australia physiotherapist David Beakley said in a statement Friday that Starc experienced pain in his right foot during the second test in Bangalore \"which unfortunately had not subsided a few days after the test as we had hoped ... we made the decision to scan his foot in Bangalore this morning and unfortunately it has revealed a stress fracture.\"\nBeakley said Starc would return to Australia for treatment and rehabilitation.\nCricket Australia said it would name a replacement player in the next few days.\nIt is the same foot that Starc broke in November 2015, which put him out of the game for six months. He was also affected by bone spurs in the right foot and ankle from 2013.\nIn 11 test matches since his mid-2016 return, Starc has spearheaded Australia's attack, claiming 57 wickets at an average of 24.8 runs apiece. In 36 tests since debuting in 2011, he has 148 wickets at 28.4.\nStarc's spell with the second new ball on day four at Bangalore, in the innings where he picked up the series-ending injury, was the catalyst for an Indian collapse - with the hosts losing 5-20 - that left Australia 188 to win. India still won the match by 75 runs to level the series.","url":"https://www.dailymail.co.uk/wires/ap/article-4300226/Mitchell-Starc-final-2-India-tests-foot-fracture.html"}
