{"authors":["Samantha Young","Guest Commentary","Laurel Rosenhall"],"date_download":"2018-10-30 22:41:28","date_modify":"2018-10-30 22:41:28","date_publish":"2016-09-15 08:00:00","description":"Parents have a right to know how their particular local schools are performing, but California’s new accountability system fails to provide that","filename":"data/vaneerConsumption/MixedGradeIsnewstateschoolreviewmethodamishmashoragoodstart.json","image_url":"https://calmatters.org/wp-content/uploads/__sized__/uploads/School_Success_FeaturePhoto-thumbnail-1200x1200-70.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939288.html","title":"Mixed Grade: Is new state school review method a \"mishmash\" or a \"good start\"?","title_page":"Mixed Grade: Is new state school review method a \"mishmash\" or a \"good start\"? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Parents have a right to know how their particular local schools are performing, but California’s new accountability system fails to provide that information, former Los Angeles Mayor Antonio Villaraigosa charged Wednesday.\nVillaraigosa, who is eyeing a 2018 gubernatorial bid, made his comments during a wide-ranging panel discussion about the new assessments, which backers described as a positive move away from rating schools based solely on standardized tests. “Parents have a right to know how their school’s doing,” he told a crowd of teachers, students and parents at a state forum in Long Beach co-sponsored by CALmatters, the Southern California News group and Cal State University Long Beach. “This measurement, this mishmash that we have here, that took three years to implement or at least get a proposal, doesn’t really tell you how an individual school is doing.”\nAssemblyman Patrick O’Donnell, the Long Beach Democrat who chairs the Assembly Education Committee, countered the criticism by describing the new assessment system as a work in progress. “I think we’re off to a good start,” he said. “We’re going to have a new system that tells people how schools are doing on different things.”\nThe dispute centers around a new accountability system—endorsed unanimously last week by the state Board of Education—that aims to evaluate schools on a broad set of measures, including academics, graduation rates, college preparedness and English-learner proficiency. It replaces the test-based system known as the Academic Performance Index, which critics say failed to take into account a host of factors that affect student performance.\nThe idea is to hold schools accountable for how much progress students are making in each school, rather than providing one overall school score that pits schools against schools. The state’s new rating system plays well with teachers’ unions that chafe at the evaluations, but parents, students and civil rights advocates say it makes it hard for the state—and parents—to identify underperforming schools.\nSpecifically, Villaraigosa complained the proposed assessments will be shown in a color-coded chart that doesn’t detail a school’s metrics or overall performance. “For primary school kids, and for middle school kids and for high school kids, when you go to college, you get a grade. Here we’ve got colors, the colors of the rainbow,” Villaraigosa said. “If it’s good enough for kids, why isn’t it good enough for schools?”\nThe state board is working on how to communicate school performance under the new rating system, and O’Donnell acknowledged that parents would need to learn the new metrics. “This isn’t like McDonalds where you go and get the number 3 meal, and it’s easy and it’s done,” he added. “Too many people spend more time, quite frankly, in the line at McDonalds than they even do looking at the metrics associated with their school.”\nMembers of the panel—which also included Marquita Grenot-Scheyer, vice chancellor for teacher education and public school programs for the Cal State chancellor’s office,and Carl A. Cohn, executive director at the California Collaborative for Educational Excellence, agreed that the old way of measuring student success hasn’t worked. But they grappled with how to close a staggering academic performance lag among California’s 3.7 million African-American and Latino children, who are disproportionately poor and make up 60 percent of students in school today.\nCohn, who is to lead the new state agency tasked with assisting struggling school districts, described the achievement gap as a complex issue that betrays the hard work being done in the classrooms. He argued that any focus on the achievement gap must take into account other factors that help to create it—including poverty and racially-isolated housing. “I’m fine with talking about the gap,” he said, “as long as we understand the complexities that are involved in how our national policies have not made it any easier in the past three decades to close the gap.”\nSome children’s advocates and civil justice groups have expressed concern that under the new system, a swath of underperforming schools won’t be held accountable without proper state oversight.\nVillaraigosa echoed that concern and implored state leaders not to make excuses that struggling students can’t be taught. He encouraged the state to employ best practices to ensure school districts get the help they need to improve.\nThe panel, moderated by CALmatters reporter Judy Lin, also criticized the media for inaccurately portraying teachers in coverage of a lawsuit that challenged teacher tenure. In August, the California Supreme Court let stand teacher protections that plaintiffs had argued make it harder to fire bad teachers and stymie academic performance. “I worry about the simple line that’s being drawn between what a teacher does in a classroom and that child’s achievement,” Grenot-Scheyer said. “It is complicated. There are many variables that impact that.”\nWatch the “A for Accountability” panel debate how to measure school success\nSamantha Young is a freelance writer and CALmatters contributor based in Sacramento.","url":"https://calmatters.org/articles/mixed-grades-experts-clash-over-whether-states-new-school-review-system-is-mish-mash-or-good-start/"}
