{"authors":["Alex Swoyer"],"date_download":"2018-10-30 18:22:24","date_modify":"2018-10-30 18:22:24","date_publish":"2015-11-12 18:03:28","description":"Mark Schierbecker filed charges against Professor Melissa Click with the University of Missouri police department.","filename":"data/vaneerConsumption/MizzouStudentFilesChargesAgainstMelissaClick.json","image_url":"https://media.breitbart.com/media/2015/11/University-of-Missouri-Communications-Assistant-Professor-Melissa-Click.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_12__1540923744.html","title":"Mizzou Student Files Charges Against Melissa Click","title_page":"Mizzou Student Files Charges Against Melissa Click","title_rss":"NULL","source_domain":"breitbart.com","text":"Mark Schierbecker, the Mizzou student behind the video catching the University of Missouri’s communications professor Melissa Click calling for pushback against the media, preventing the protest from being covered, filed charges against her with the University of Missouri police department.\nSchierbecker told Breitbart News, “I pressed charges against Melissa Click and also the former Associate Dean for undergraduate studies at the Journalism school just filed a formal complaint with the Title IX office about her.”\nKSDK reported that police department spokesperson Major Brian Weimer said the complaint had been filed and “We are looking into this and following up.”\nClick was caught calling for “muscle” to get Schierbecker removed from recording the protest that has sparked national outrage across the nation. In the video, Click attempts to grab Schierbecker’s camera and stop him from filming of the protest.\nSchierbecker’s video has since gone viral on a number of national news networks.\nHe said Breitbart News was the first media outlet to contact him about his video and the incident that has since sparked national outrage.\nUPDATE:\n“He’s filed his complaint and we are investigating it,” Weimer tells Breitbart News Thursday afternoon, adding that each case is unique so there is no set time on when the next step could occur following the investigation.\n“I have not read everything in it. I don’t know what the investigator is specifically doing, but they will read it, depends on what’s been reported. They’ll look into it to see if charges are applicable and they’ll go forward,” he said.\nWeimer explained the process that follows after a police report is initially filed. “A report is filed and it’s investigated. If a crime is determined then either an arrest may be made, a warrant request may be made, a number of things can happen,” he said.","url":"https://www.breitbart.com/politics/2015/11/12/mizzou-student-files-charges-professor-melissa-click/"}
