{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:21:30","date_modify":"2018-10-30 18:21:30","date_publish":"2015-11-22 05:33:55","description":"Racial protests have caused Mizzou's image to suffer to the extent that state lawmakers will be closely scrutinizing its funding next year.","filename":"data/vaneerConsumption/MizzouHiresLobbyistStateFundingScrutinized.json","image_url":"https://media.breitbart.com/media/2015/11/GettyImages-496421764-mizzou.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_21__1540923690.html","title":"Mizzou Hires Lobbyist, State Funding Scrutinized","title_page":"Mizzou Hires Lobbyist, State Funding Scrutinized","title_rss":"NULL","source_domain":"breitbart.com","text":"In the wake of student protests inspired by Black Lives Matter, the University of Missouri’s image is apparently suffering to the extent that the school has hired a lobbyist as state lawmakers will be closely scrutinizing its funding next year.\nA report by the Associated Press observes that concerned alumni are aghast following the resignations of Mizzou’s president and Columbia campus chancellor after the allegations of racism at the school. Student protests included a hunger strike and the threat of a boycott by the school’s football team. In addition, a video showed Mizzou Communications assistant professor Melissa Click attempting to snatch a journalist’s camera and then calling for “muscle” to remove him. With further support from Black Lives Matter, the school’s protests spread to other campuses across the country.\nLast week it was discovered that Mizzou activist Jonathan Butler had falsified a key claim that was made against the school’s president Tim Wolfe – that he was hit by a car carrying Wolfe in the homecoming parade. As Breitbart News reported, however, a video shows that Butler himself actually rushed toward the car.\nMizzou’s now tarnished image, reports AP, prompted the school to hire a lobbyist – the son of U.S. Sen. Roy Blunt (R) – and to send letters to some 20,000 students who will begin school there in the fall, reassuring them and their parents that the campus is safe.\nNevertheless, university spokeswoman Mary Jo Banken says the school climate is “probably going to be somewhat unsettling for a while.”\nMoving forward, Banken said the university will be articulating the steps it is taking to address student accusations of racism, and to develop diversity training for administrators, faculty, and students. Additionally, Mizzou has a new administrative position – that of vice chancellor for inclusion, diversity and equity.\n“Yes, we do care about the image, that’s important,” Banken said. “But more importantly it’s doing what needs to be done, and doing the right thing and then talking about it openly. I think then as a result of that, our image will improve.”\nMissouri state Sen. Kurt Schaefer (R) – chairman of the Senate Appropriations Committee – told AP that lawmakers will be dealing with the fallout of the accusations in 2016, and that his role to advocate for the university’s funding interests within the state Senate has now been made more difficult by the allegations of the activists on campus.\n“We’re all pretty disappointed in how this makes our state and our flagship university look,” said state Rep. Scott Fitzpatrick (R), vice chairman of the House Budget Committee, which decides funding for Missouri’s public higher education institutions.","url":"https://www.breitbart.com/politics/2015/11/21/mizzou-hires-lobbyist-state-funding-scrutinized-due-image-crisis/"}
