{"authors":["Marta Jary For Daily Mail Australia"],"date_download":"2018-10-22 22:28:52","date_modify":"2018-10-22 22:28:52","date_publish":"2017-04-26 04:48:41","description":"He was linked to his My Kitchen Rules rival Amy Murr but Tim Atwill has revealed he's single, and very keen to date the new Bachelorette Sophie Monk.","filename":"data/vaneerConsumption/MKRsTimsayshedlovetodateSophieMonk.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9CB40A00000578-0-image-a-15_1493185709964.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446190_MKR-s-Tim-says-d-love-date-Sophie-Monk_1540247332.html","title":"MKR's Tim says he'd love to date Sophie Monk","title_page":"MKR's Tim says he'd love to date Sophie Monk | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He was linked to his My Kitchen Rules rival Amy Murr but Tim Atwill has revealed he's single, and very keen to date the new Bachelorette Sophie Monk.\nAsked on the Jodie and Soda breakfast show if either he or cooking partner Kyle have ever 'been with' Sophie, 37, Tim was very fast to respond.\n'Have we been with her? No but I'd love to!' Tim quipped, adding that he enjoys Sophie's personality, and her assets.\nScroll down for video\nTim's smitten: He was linked to his My Kitchen Rules rival Amy Murr but Tim Atwill has revealed he's single, and very keen to date the new Bachelorette Sophie Monk\n'I just like her. She's a little bit bogan, a bit funny and she’s got a nice… rack,' the home cook said.\nBoth men revealed they were single, after both being linked to fellow contestants on the show.\n'All that's done, it's finito. We're single,' Tim said.\nPerfect woman? 'I just like her. She's a little bit bogan, a bit funny and she’s got a nice… rack,' the home cook said\nFan: 'Have we been with her? No but I'd love to!' Tim quipped, adding that he enjoys Sophie's personality, and her assets\nTim had sparked rumours that he was dating fellow contestant Amy when the pair were spotted with their arms around one another on a 'date' in March.\nIt was the first time the pair had been seen getting close after it was revealed they have been secretly dating for months.\nAccording to New Idea, the pair had been seeing one another a while and found love shortly after filming.\nArm in arm: My Kitchen Rules contestants Amy and rival Tim had been spotted with their arms around one another on a 'date' with their castmates\nCooking up a romance? According to New Idea, MKR's Amy (pictured with brother Tyson) has been secretly dating rival co-star Tim for months\nWas it Tim? Amy previously confirmed she was dating a co-star but didn't name names saying, 'It's still fairly new...but we're very happy'\nAccording to the publication, both stars have refused to confirm the romance and Tim avoided the question when asked if he's dating the brunette.\nAmy previously confirmed she was dating a co-star but didn't name names saying, 'It's still fairly new...but we're very happy'.\nSeafood King Josh had confirmed the romance, saying: 'I can't believe it hasn't come out yet!'\nFlirty: Tim's team mate Kyle kissed love interest Bek on screen, thrilling fans with their sizzling chemistry but they have split since then\nSorry, Kyle! However Bek recently confirmed that the pair aren't dating, and are just friends\nKyle had his own MRK romance, kissing love interest Bek on screen, thrilling fans with their sizzling chemistry, but that relationship fizzled.\nBek recently confirmed that the pair aren't dating, and are just friends.\nShe told news.com.au she now has a new boyfriend, and while Kyle was keen to pursue a relationship she feels they 'just work out better as friends.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446190/MKR-s-Tim-says-d-love-date-Sophie-Monk.html"}
