{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-23 01:43:05","date_modify":"2018-10-23 01:43:05","date_publish":"2017-04-26 12:20:18","description":"MKR's Courtney and Valerie make the grand final","filename":"data/vaneerConsumption/MKRsCourtneyandValeriemakethegrandfinal.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9D4F4200000578-0-image-a-29_1493205612053.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446116_MKR-s-Courtney-Valerie-make-grand-final_1540258985.html","title":"MKR's Courtney and Valerie make the grand final","title_page":"MKR's Courtney and Valerie make the grand final | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The teams going into the My Kitchen Rules grand final have been revealed.\nOn the show on Wednesday, mother and daughter team Valerie and Courtney made the top two of the show, and will battle brother and sister duo Amy and Tyson for $250,000.\nThe news came after Valerie and Courtney sent Tim and Kyle packing, after a tense sudden-death showdown.\nScroll down for video\nIn it to win it! MKR's Courtney (R) cried as she and mother Valerie (L) made the grand final\n'I'm just so proud,' Courtney said as she burst into tears.\nShe added to camera to her mother: 'You know who will be extra proud, is poppy,' referring to Valerie's father, who handed down a book of family recipes which they cook from in the competition.\nTim and Kyle meanwhile, were 'gutted' that they didn't make it through to the grand final.\nSorry boys! The news came after Valerie and Courtney sent Tim and Kyle packing, after a tense sudden-death showdown\n'To come this close and not go to the big dance is disappointing,' Kyle said.\nTim added that they were still proud to have finished in third place on the show.\nHe commended Valerie and Courtney on making it through, saying: 'Congratulations, I'm stocked for you honestly, it's a great achievement.'\nTim and Kyle finished on a grand total score of 46, while the girls scored 50 points.\nThe boys served an entree of scallops with celeriac puree and pancetta, a main of confit duck with coffee pumpkin, and a dessert of brownie with chocolate stout mousse and coffee syrup.\nIt's on! Courtney and Valerie will battle Amy and Tyson (seen) for $250,000 in the grand final\nValerie and Courtney cooked an entree of peppered chicken livers with fennel and tomato chutney, a main of oxtail stew with pickled onion mash and eggplant kasundi, and a dessert of cardamom dumplings with saffron creme anglaise.\nThe girls were told by judge Colin Fassnidge that 'there was nothing bad I can say' about their entree.\nPete said it was a dish they would 'remember for a long time.'\nThey also had glowing reviews for their main, but fell short on their dessert.\nToo sweet! The mother and daughter duo had glowing reviews for their main, but fell short on their dessert\nJudge Karen Martini said the dumplings had a great texture, but she thought the anglaise was a little too thin.\nColin meanwhile, said the anglaise was 'way too sweet.'\nTim and Kyle were told their presentation for their entree was lacking, while they should have put more on the dish.\nPete Evans said: 'Kyle, I know you, if you were served that as a part of a three course meal, you would be disappointed.'\nPete said their main was a 'stellar dish.'\nThey also fell short on their dessert, with judge Guy Grossi saying he didn't enjoy the mousse, because the stout flavour was really strong.\nThe judges were also divided on the use of pretzels on their dessert, as they were just crushed from the packet.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446116/MKR-s-Courtney-Valerie-make-grand-final.html"}
