{"authors":["Marta Jary For Daily Mail Australia"],"date_download":"2018-10-22 21:46:06","date_modify":"2018-10-22 21:46:06","date_publish":"2017-04-26 02:44:49","description":"My Kitchen Rules star JP Huillet appears to have taken a swipe at his ex-girlfriend Nelly Riggio as she continues her romance with dessert chef, Adriano Zumbo.","filename":"data/vaneerConsumption/MKRstarJPHuillettakesaswipeatNellyRiggio.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/01/3F9B6E1800000578-0-image-a-18_1493168259868.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4445960_MKR-star-JP-Huillet-takes-swipe-Nelly-Riggio_1540244766.html","title":"MKR star JP Huillet takes a swipe at Nelly Riggio","title_page":"MKR star JP Huillet takes a swipe at Nelly Riggio | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"My Kitchen Rules star JP Huillet appears to have taken a swipe at his ex-girlfriend Nelly Riggio as she continues her romance with dessert chef, Adriano Zumbo.\nPhotos which seem to have been taken on a wild night out earlier this month, show JP, 30, partying with a pretty female friend who ‘hijacked’ his Instagram Story.\nThe woman shared a selfie, which was accompanied by the telling caption: ‘JP has better taste in girls now’.\nDig? My Kitchen Rules star JP Huillet appears to have taken a swipe at his ex-girlfriend Nelly Riggio as she continues her romance with dessert chef, Adriano Zumbo\nThe comment appears to be a dig at Nelly, 26, who split with JP late last year after and went on to date Adriano Zumbo, 35.\nJP and Nelly had appeared on My Kitchen Rules in 2016, receiving the nickname 'the lovebirds' before ending their relationship some time after filming.\nIn a second image, JP is seen posing with two blonde women and holding his finger to his lips.\nIn March, JP shared a cryptic quote to Instagram about 'loyalty' that also appeared to reference his former love.\nHappier times: JP and Nelly had appeared on My Kitchen Rules in 2016\nBetter days: They recieved the nickname 'the lovebirds' before ending their relationship some time after filming\n'Some people aren't loyal to you... They are loyal to their need of you... Once their needs change, so does their loyalty,' the message read.\nJP had previously taken to Instagram to say he wished 'nothing but the best for everyone involved' after the Just Desserts star began dating his former love.\n'Just so everyone knows I'm happy and healthy and wish nothing but the best for everyone involved,' he wrote.\nShe moved on: In March, JP shared a cryptic quote to Instagram about 'loyalty' that also appeared to reference his former love\nGracious: JP had previously taken to Instagram to say he wished 'nothing but the best for everyone involved' after the Just Desserts star began dating his former love\nFine then: 'Just so everyone knows I'm happy and healthy and wish nothing but the best for everyone involved,' he wrote\nLoved up: He did however previously admit that it has been a 'tough time' as Nelly and Adriano continued to post a slew of loved-up snaps, which have lately sparked engagement rumours\nHe did, however, previously admit that it has been a 'tough time' as Nelly and Adriano continued to post a slew of loved-up snaps, which have lately sparked engagement rumours.\nThe chatter began last month when Nelly was seen donning a prominent ring while posing alongside her chef beau.\nRing on it: The chatter began last month when Nelly was seen donning a prominent ring while posing alongside her chef beau\nEngaged? The brunette sported a large bauble on her right hand in a picture she uploaded to Instagram (pictured)\nThe brunette sported a large bauble on her right hand in a picture she uploaded to Instagram, with her followers quick to point out it might be better suited as a wedding band.\nThe photo showed the two smiling at the camera as they prepared to jet off to New Zealand, but it was her accessories that seemed to draw attention.\nA sparkling box cut ring rested on the middle finger of her right hand, with one fan commenting: 'That ring looks like it belongs on the other hand, one finger down'\nWorking together? The Daily Telegraph's Confidential reported that Nelly previously landed a job in Sydney for Zumbo's dessert chain\nThe Daily Telegraph's reported that Nelly previously landed a job in Sydney for Zumbo's dessert chain.\nNelly moved from Brisbane to Sydney last September, to take on a role in research and development.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4445960/MKR-star-JP-Huillet-takes-swipe-Nelly-Riggio.html"}
