{"authors":["Marta Jary For Daily Mail Australia"],"date_download":"2018-10-22 23:26:32","date_modify":"2018-10-22 23:26:32","date_publish":"2017-03-16 06:56:25","description":"My Kitchen Rules contestants Amy and rival Tim have been spotted with their arms around one another on a 'date' with their castmates.","filename":"data/vaneerConsumption/MKRsTimandrivalAmyspottedtogetheronadate.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/06/3E522F6D00000578-0-image-a-57_1489644904790.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318922_MKR-s-Tim-rival-Amy-spotted-date_1540250792.html","title":"MKR's Tim and rival Amy spotted together on a 'date'","title_page":"MKR's Tim and rival Amy spotted together on a 'date' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"My Kitchen Rules contestants Amy and rival Tim have been spotted with their arms around one another on a 'date' with their castmates.\nThe pair appeared cosy and close in an image posted to MKR contestants David and Betty's Instagram on Wednesday.\n'Anchors away! We're setting sail tonight!' the image was captioned, indicating that the group would be aboard a boat that evening.\nScroll down for video\nArm in arm: My Kitchen Rules contestants Amy and rival Tim have been spotted with their arms around one another on a 'date' with their castmates\nIt's the first time the pair have been seen getting close after it was revealed they have been secretly dating for months.\nAccording to New Idea, the pair have been seeing one another a while and found love shortly after filming.\nAccording to the publication, both stars have refused to confirm the romance and Tim avoided the question when asked if he's dating the brunette.\nAmy confirmed she was dating a co-star but didn't name names saying, 'It's still fairly new...but we're very happy'.\nSeafood lover Josh meanwhile confirmed the romance, saying: 'I can't believe it hasn't come out yet!'\nCooking up a romance? According to New Idea, MKR's Amy (pictured with brother Tyson) has been secretly dating rival co-star Tim for months\nTim - who said he and Amy were 'really close' - added he's ready to start a family no that he's 30 years old.\n'I'm 30 years old, I'm at a point now that if I find the right person I definitely will be willing to,' Tim said.\nIt comes after Tim's team mate Kyle kissed love interest Bek on screen, thrilling fans with their sizzling chemistry.\nKeeping mum: According to the publication, both stars have refused to confirm the romance and Tim (L, pictured with team mate Kyle) avoided the question\nHowever Bek recently confirmed that the pair aren't dating, and are just friends.\nBlonde beauty and vet Bek, told news.com.au the she now has a new boyfriend, and while Kyle was keen to pursue a relationship she feels they 'just work out better as friends.'\nFlirty: It comes after Tim's team mate Kyle kissed love interest Bek on screen, thrilling fans with their sizzling chemistry\n'There was a spark there but we just work out better as friends,' she said about hunky bartender Kyle.\n'I have a boyfriend that's not Kyle and that happened straight after we left My Kitchen Rules,' Bek said.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318922/MKR-s-Tim-rival-Amy-spotted-date.html"}
