{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-23 00:46:03","date_modify":"2018-10-23 00:46:03","date_publish":"2017-04-26 10:38:53","description":"MKR's Amy is left blushing as Tim calls her 'darling' after romance rumours","filename":"data/vaneerConsumption/MKRsAmyisleftblushingasTimcallsherdarling.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/10/3F9D4F2900000578-0-image-a-13_1493199521028.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446396_MKR-s-Amy-left-blushing-Tim-calls-darling_1540255563.html","title":"MKR's Amy is left blushing as Tim calls her 'darling'","title_page":"MKR's Amy is left blushing as Tim calls her 'darling' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Reports recently claimed that My Kitchen Rules stars Amy and Tim have been dating for months.\nAnd on the show on Wednesday, the pair did little to dispel rumours.\nWhile cooking in the sudden-death showdown against Valerie and Courtney, Tim left Amy blushing when he called her 'darling.'\nCooking up a romance? MKR's Amy is left blushing as Tim calls her 'darling'\n'Pressure's really on you Tim, isn't it?,' Amy called out to Tim as she looked on from above in kitchen HQ.\n'It sure is darling, it sure is,' Tim replied, leaving Amy and her brother Tyson giggling.\nTim's team mate Kyle meanwhile heard the remark and thought it was odd.\nThe start of it all? Tim is seen right, with team mate Kyle\n'Darling?,' Kyle said.\nTim and Kyle were busy making their dessert, with Tim having made the brownie in the preparation time for their entree and main.\nAt the start of the show, Kyle called Amy 'beb.'\n'Very interesting boys,' Amy called out, about their coffee pumpkin puree for their main.\n'Thanks beb,' he replied, making them laugh.\nTim confirmed on radio this week that he and Kyle are single, despite reports he's dating Amy.\nStressful: Tim and Kyle were busy making their dessert, with Tim having made the brownie in the preparation time for their entree and main\n'All that's done, it's finito. We're single,' Tim told Jodie and Soda.\nAccording to New Idea, Tim and Amy had been seeing one another a while and found love shortly after filming.\nAccording to the publication, both stars have refused to confirm the romance and Tim avoided the question when asked if he's dating the brunette.\nAmy previously confirmed she was dating a co-star but didn't name names saying, 'It's still fairly new...but we're very happy'.\nSeafood King Josh had confirmed the romance, saying: 'I can't believe it hasn't come out yet!'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446396/MKR-s-Amy-left-blushing-Tim-calls-darling.html"}
