{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-23 01:48:14","date_modify":"2018-10-23 01:48:14","date_publish":"2017-04-26 12:22:09","description":"MKR's Tyson and Amy joke Kyle is the new 'angry, angry man'","filename":"data/vaneerConsumption/MKRsTysonandAmyjokeKyleistheangryangryman.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9D4F3200000578-0-image-a-35_1493205704901.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446348_MKR-s-Tyson-Amy-joke-Kyle-angry-angry-man_1540259294.html","title":"MKR's Tyson and Amy joke Kyle is the 'angry, angry man'","title_page":"MKR's Tyson and Amy joke Kyle is the 'angry, angry man' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"My Kitchen Rules star Tyson is nicknamed the 'angry, angry man' due to his temper.\nAnd on Wednesday's show, the former Uber driver and his sister Amy joked that fellow contestant Kyle is actually the 'angry, angry man,' after he went on a foul-mouthed tirade while cooking in sudden-death.\n'Muttering under his breath, swearing at inanimate objects, jaw clench, classic signs of angry, angry man there,' Tyson said with a laugh.\nScroll down for video\nTyson's been replaced! On MKR on Wednesday, Tyson and Amy joked that Kyle (seen) is the new 'angry, angry man' after the hunk went on a foul-mouthed tirade\nAmy said: 'I think by the looks of it, Kyle might be the actual angry, angry man!'\nShe added: 'He's a lot bigger than you too, he'd make a way better Hulk,' referring to the famous fictional character.\n'Can you imagine Kyle green? Perfect,' she said with a chuckle.\nLoving it: 'Can you imagine Kyle green? Perfect,' Amy (seen left with brother Tyson) said with a chuckle\nKyle started swearing to himself as he checked on his and team mate Tim's duck, which was browning up in the oven.\nThe pressure was on for the pair as they battled in sudden-death against Valerie and Courtney.\nThe boys served an entree of scallops with celeriac puree and pancetta, a main of confit duck with coffee pumpkin, and a dessert of brownie with chocolate stout mousse and coffee syrup.\nPressure: Kyle started swearing to himself as he checked on his and team mate Tim's duck, which was browning up in the oven\nValerie and Courtney cooked an entree of peppered chicken livers with fennel and tomato chutney, a main of oxtail stew with pickled onion mash and eggplant kasundi, and a dessert of cardamom dumplings with saffron creme anglaise.\nTim and Kyle were eventually eliminated after they finished on a grand total score of 46, while the girls scored 50 points.\n'To come this close and not go to the big dance is disappointing,' Kyle said.\nTim added that they were still proud to have finished in third place on the show.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446348/MKR-s-Tyson-Amy-joke-Kyle-angry-angry-man.html"}
