{"authors":["Josh Hanrahan","Marta Jary For Daily Mail Australia"],"date_download":"2018-10-23 00:35:10","date_modify":"2018-10-23 00:35:10","date_publish":"2017-03-10 07:13:49","description":"My Kitchen Rules contestant Betty Banks may have landed herself in more hot water just hours after she was caught up in controversy surrounding fake porn accounts.","filename":"data/vaneerConsumption/MKRsBettyBankstakesvideoselfiewhiledriving.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/04/3E1FD91600000578-0-image-a-19_1489119178764.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299908_MKR-star-Betty-Banks-takes-video-selfie-driving_1540254910.html","title":"MKR's Betty Banks 'takes video selfie while driving'","title_page":"MKR's Betty Banks 'takes video selfie while driving' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"My Kitchen Rules contestant Betty Banks may have landed herself in more hot water just hours after she was caught up in controversy surrounding fake porn accounts.\nThe 27-year-old Sydney-based reality TV star was in the headlines on Friday after it was revealed multiple social media accounts were falsely using her name and images to share X-rated material.\nAnd it seems Betty has again landed herself in the headlines for the wrong reasons, after uploading a video to social media showing herself hitting out at the controversy as she drove in her car - an illegal act in New South Wales.\nScroll down for video\nIn hot water? My Kitchen Rules contestant Betty Banks may have landed herself in trouble with a video selfie she took while driving being uploaded to Instagram\nThe brunette beauty uploaded a video of herself to Instagram in which she could be seen holding her phone singing along to a Veronicas song as she drove her vehicle.\nAppearing to hit out at reports surrounding her fake porn controversy, she captioned the video: 'This is what I think about today's papers'.\nUnder NSW law, Betty could have faced a fine and/or lose demerit points had she been caught by Police.\nControversial: The 27-year-old reality TV star was also in the headlines on Friday after it was revealed multiple social media accounts were falsely using her name and images\nDaily Mail Australia has approached Channel Seven for comment on the incident.\nIt comes after the Daily Telegraph reported that several accounts impersonating the Instagram model were set up without her knowledge, involvement or permission.\nOne account pretending to be Betty was also involved in a sexual role playing group and shared graphic fantasies in a series of x-rated tweets.\nFake accounts: The fake hardcore porn scandal came after it was revealed that a number of social media accounts were falsely using her name and images to share x-rated material\nNot afraid: Under NSW law, Betty could have faced a fine and/or lose demerit points had she been caught by Police while using her phone\nOne fake steamy exchange reads: 'moans as she sticks her a** out slightly while quickly pulling your boxers off'.\nWhile another reads: 'You're just turning me on so bad *moans while slides her hand down to your pants starting to unbuckle it and pulls them down*.\nA Channel 7 spokeswoman also reportedly told the the Daily Telegraph the accounts were not linked to the show or Bettina.\nExplicit: Once fake steamy exchange reads: 'moans as she sticks her a** out slightly while quickly pulling your boxers off'\nBikini babe: Betty also regularly posts sexy bikini snaps of herself on Instagram\nThe spokesperson also, 'suggested the profile images and handles may have been changed since she had become a household name'.\nPosting under her full name Bettina Banks, she has numerous selfies posing in lacy lingerie and completely topless on her official Instagram page.\nBetty also shares bikini snaps from frequent holidays to Bali, flaunting her many tattoos in tiny swimwear.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299908/MKR-star-Betty-Banks-takes-video-selfie-driving.html"}
