{"authors":["Andrew Meola"],"date_download":"2018-10-30 21:08:34","date_modify":"2018-10-30 21:08:34","date_publish":"2016-12-21 00:00:00","description":"With nearly 80% of US residents owning a smart phone, it was only a matter of time that they became our newest payment technology.","filename":"data/vaneerConsumption/Mobilepaymentstechnologyandcontactlesspaymentsexplained.json","image_url":"https://amp.businessinsider.com/images/5820b26246e27a1b008b525e-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mobile-payment-technology-contactless-payments-explained-2016-11_1540933714.html","title":"Mobile payments technology and contactless payments explained","title_page":"    Mobile payments technology and contactless payments explained - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII The rise of mobile payments technology truly began in 2014 when Apple Pay hit the market. At the time, it was the only major mobile wallet out there.\nBut in the last two years, mobile wallets have flooded the market with offerings such as Samsung Pay, Chase Pay, Android Pay, Microsoft Wallet, Walmart Pay, and Kohl's Pay. Each of these offers unique benefits to the user and encourages customers to form shopping habits around them.\nAnd so far, they seem to be succeeding.\nBI Intelligence, Business Insider's premium research service, finds that mobile payment volume will reach $75 billion this year. That figure should swell to $503 billion by 2020 thanks to advancements in mobile payments technology.\nBelow, we've outlined how mobile and contactless payments work and explained the different types of payments technology that are shaping the present and future.\nWhat Are Contactless Payments and How Do They Work?\nTo understand how contactless payments work, let's take a hypothetical example. You have an iPhone, which allows you to take advantage of Apple Pay. You input your credit card information onto your phone, which stores it for later use.\nLater on, you're shopping at a store that has mobile payment readers at the register. Rather than reach for your wallet, you take out your phone and hold it a few inches away from the point-of-sale (POS) terminal. This device then automatically reads the payment information stored on the smart chip embedded in your card and then processes the transaction.\nEach chip connects to an antenna, and POS terminals emit a high frequency radio wave that facilitates communication between the reader and the phone. When the mobile device is in range, a wireless communication protocol links the terminal and the phone, which exchange information and conduct a secure transaction.\nAll of this occurs in fractions of a second.\nNear-Field Communication (NFC) Payment Technology\nNear-field communication, or NFC, technology works by bringing together two electronic devices, typically a mobile device such as a smartphone and a reader of some kind. NFC tech always involves one initiator that generates an RF field to power a passive target. In terms of payments technology, the reader would be the initiator and the smartphone (which contains the stored credit card information) would be the target.\nThe market potential for NFC payment technology is enormous, as merchants have actually been inadvertently rallying behind this type of contactless payment tech. As more U.S. merchants adopt the EMV security standard as of October 1, 2015, they must order new EMV-compliant terminals from major providers such as Verifone and Ingenico. More often than not, these devices accept NFC payments through mobile wallets.\nIn short, EMV will help make NFC technology universal because NFC offers a clear preferred mobile acceptance technology. And this transition is well underway. Verifone said in its Q3 2015 earnings call that NFC terminal penetration had likely reached 100% among top-tier merchants.\nREUTERS/Beck Diefenbach\nBluetooth Payment Technology\nBluetooth is a bit of a wild card in the payments industry. Mobile payments technology focuses quite a bit on NFC, and with good reason. But Bluetooth could be the true transformer in this area.\nAll the major mobile platform developers, such as Apple, Google, Microsoft, and BlackBerry have supported Bluetooth for the last several years, but they shifted focus to NFC in the payments world as they released their mobile wallets (Apple Pay, Android Pay, etc.).\nBluetooth, however, could change the game. Mobile payments such as Apple Pay have been slow to catch on in certain areas, but Bluetooth likely would not have such problems, especially because it has some inherent advantages.\nFor starters, Bluetooth has a much longer range than NFC, as it can reach up to 50 meters compared to NFC's need to have the two devices centimeters away from each other. This longer range could reduce friction during the checkout process even more than NFC technology already does. On top of this, Bluetooth creates a truly hands-free experience because shoppers would not even need to take out their phones to tap them to a reader.\nFurthermore, Bluetooth payment processing is almost always faster than NFC, even if it's by fractions of a second. And finally, NFC is limited to one-to-one interaction, as in one mobile device and one payments reader. But Bluetooth can facilitate multiple transactions at once from a single payments terminal, which would further speed up the checkout process.\nMore to Learn\nMobile payments technology will evolve in numerous ways in the coming years, but this is just one piece of the much larger and more complex payments ecosystem.\nThat's why BI Intelligence spent months compiling the greatest and most comprehensive guide on the world of payments entitled The Payments Ecosystem Report: Everything You Need to Know About The Next Era of Payment Processing.\nTo get your copy of this invaluable guide to the payments industry, choose one of these options:\nSubscribe to an ALL-ACCESS Membership with BI Intelligence and gain immediate access to this report AND over 100 other expertly researched deep-dive reports, subscriptions to all of our daily newsletters, and much more. >> START A MEMBERSHIP Purchase the report and download it immediately from our research store. >> BUY THE REPORT\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of the fast-moving world of the payments ecosystem.","url":"https://www.businessinsider.com/mobile-payment-technology-contactless-payments-explained-2016-11"}
