{"authors":["Andrew Meola"],"date_download":"2018-10-30 21:50:14","date_modify":"2018-10-30 21:50:14","date_publish":"2016-12-16 00:00:00","description":"With mobile Internet usage surpassing desktop, fintech companies are adapting to customer demands for mobile friendly financial services. See how mobile fintech is set to grow in 2016.","filename":"data/vaneerConsumption/Mobilefintechisheretostaywithbankingandpaymentservices.json","image_url":"https://amp.businessinsider.com/images/575aef2fdd08959b5b8b46b3-1136-568.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_mobile-fintech-is-here-to-stay-with-banking-and-payment-services-2016-12_1540936214.html","title":"Mobile fintech is here to stay with banking and payment services","title_page":"    Mobile fintech is here to stay with banking and payment services - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BI Intelligence Mobile Internet usage has finally overtaken desktop, a fact that has had wide-ranging implications across various tech sectors.\nFinancial technology companies have become acutely aware of this shift and have been adapting to consumer demands for more mobile-friendly financial services as a result.\nConsider how millennials are moving more frequently toward digital banking. And as a result, they're walking into their banks' traditional brick-and-mortar branches less often than ever before.\nThis particular generation represents the largest piece of the U.S. population at 26% and the employed population at 34%, so it's evident that their behaviors and preferences will have a significant effect on the future of the banking industry, particularly with regard to the way banks interact with their customers.\nBelow, we've outlined the growth of mobile fintech, mobile banking, and laid out the map for the mobile payment future.\nGrowth of Mobile Fintech\nAs mobile has become the dominant channel for Internet usage, so to has it become the main way that most consumers interface with their apps, banks, and more.\nAs a result, the major banks (Bank of America, JPMorgan Chase, Wells Fargo, etc.) released mobile apps to allow their customers to handle their finances without the need to walk into a brick-and-mortar store or even use their computers.\nFrom there, mobile fintech swelled to include peer-to-peer payments, digital-only banks, and mobile wallets such as Apple Pay, Android Pay, and more.\nGrowth of Mobile Banking\nThe payments sector is far more mature than other fintech segments, and a small handful of companies now dominate the business-to-consumer (B2C) aspect in particular.\nPayPal is the unquestioned leader in digital payments in the U.S. and Europe, but Apple Pay and Android Pay have captured the prime positions for in-store mobile payments all around the globe. On top of this, Alipay and WeChat are the major heavyweights in China.\nThe remittance space has also surged due to companies such as TransferWise, which has been valued at over $1 billion, along with Remitly, WorldRemit, and Azimo. Furthermore, digital-first Xoom earns more revenue from electronic channels than 75-year-old MoneyGram, the second-largest remittance company on the planet.\nBII\nGrowth of Mobile Payment Transaction Services\nBI Intelligence, Business Insider's premium research service, expects P2P payments transacted on mobile devices to grow from $5.6 billion in 2014 to $174 billion by 2019, and from a 1% share of total P2P payments in 2014 to 30% by 2019.\nP2P payment apps such as Venmo have soared in the US market in the last several years, and BI Intelligence forecasts volume, transactions, and users to continue to grow as more consumers become aware that these apps address actual everyday payment issues. For example, the ability to transfer money instantly through a mobile device is far easier and quicker than writing a check or finding an ATM and taking out cash.\nVenmo has demonstrated the potential of mobile P2P, as it processed $2.5 billion in transactions in the third quarter of 2015, a 174% increase from the $906 million the app processed in the same period in 2014. Venmo, in particular, has also benefited from network effects because so much of its use stems from social situations, such as splitting restaurant checks or splitting rent among roommates.\nGrowth of Other Mobile Industries\nThe explosion of mobile fintech has boosted other industries, particularly insurance and investing.\nInsurtechs have started to flourish because the insurance industry has been slow to modernize in comparison to the rest of the financial services industry. This is thanks to a multitude of reasons that include capital requirements and increasingly complex regulatory hurdles.\nBut as some of these hurdles have started to disappear, insurtechs have moved in to fill the gap and take advantage of the opportunity created. VC-backed funding for insurtechs surged 225% between 2014 and 2015, which made this one of the most active segments in fintech.\nAs for investing, robo-advisors are quickly becoming the largest disrupter in this space. BI Intelligence predicts that robo-advisors will manage $8 trillion in global assets by 2020.\nRobo-advisors have moved into three distinct models, but they all have the same goal. Standalone firms such as Betterment (the most popular U.S. robo-advisor) use algorithms to suggest stocks and manage customers' portfolios. Hybrid robo-advisors blend automated recommendations with on-demand advice from a human advisor. And advanced standalone firms use more sophisticated algorithms to create and actively manage portfolios.\nAnd mobile has made both insurtechs and robo-advisors accessible right in customers' pockets wherever they go.\nMore to Learn\nThe fintech space should continue to grow in the next few years, and the expansion of mobile will only help propel that growth to the next level.\nThat's why BI Intelligence spent months compiling the greatest and most comprehensive guide on the world of fintech entitled The Fintech Ecosystem Report: The Emerging Technologies and Firms Driving Change in Financial Services and How Legacy Players Can Navigate The Disruption.\nTo get your copy of this invaluable guide to the payments industry, choose one of these options:\nSubscribe to an ALL-ACCESS Membership with BI Intelligence and gain immediate access to this report AND over 100 other expertly researched deep-dive reports, subscriptions to all of our daily newsletters, and much more. >> START A MEMBERSHIP Purchase the report and download it immediately from our research store. >> BUY THE REPORT\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of the fast-moving world of financial technology.","url":"https://www.businessinsider.com/mobile-fintech-is-here-to-stay-with-banking-and-payment-services-2016-12"}
