{"authors":["Edwin Mora"],"date_download":"2018-10-30 20:31:58","date_modify":"2018-10-30 20:31:58","date_publish":"2016-06-25 00:33:37","description":"An angry mob of more than a thousand Islamic extremists torched at least 80 Christian homes in an Egyptian village.","filename":"data/vaneerConsumption/Mobof1000PlusIslamistsSet80ChristianHomesAblaze.json","image_url":"https://media.breitbart.com/media/2016/06/mob-islamists-attack-coptic-christian-houses-screenshot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_06_24__1540931518.html","title":"Mob of 1,000-Plus Islamists Set 80 Christian Homes Ablaze","title_page":"Egypt: Mob of 1,000-Plus Islamists Set 80 Christian Homes Ablaze","title_rss":"NULL","source_domain":"breitbart.com","text":"An angry mob of more than a thousand Islamic extremists, described as “fanatic Muslims” by a terrorized witness, reportedly torched at least 80 Christian homes in an Egyptian village and injured Christians who tried to stop them, all over rumors that a Coptic resident was converting his home into a church.\nThe incident took place last week in Egypt’s Qaryat al-Bayda village, near Alexandria, reports The Foreign Desk, adding that the attack resulted in two Coptic Christians who were trying to reason with the Islamists being seriously wounded and caused thousands of dollars worth of property damage.\n“On Friday afternoon, following Friday noon prayer, a great deal of fanatic Muslims gathered in the front of the new house of my cousin, Naim Aziz, during its construction because of a rumor spread in the village that this building would be turned into a church,” revealed Mousa Zarif, a Christian who witnessed the events, told the International Christian Concern (ICC), an advocacy group that reports on persecution against Christians.\n“They were chanting slogans against us. Among these slogans were: ‘By no means shall there be a church here,’” added Zarif.\nThe mob, described as Islamic extremist by The Foreign Desk, destroyed the construction materials they believed were being used to turn the Christian-owned home into a church.\nAziz, the owner of the house under construction, denied that he was transforming his home into a church, saying he was “only building a new house for his son,” reports Daily News Egypt.\nCurrently, residents of the Egyptian village are forced to travel four miles to pray at the Holy Virgin and the Archangel Michael Coptic Orthodox Church, notes the Daily Express.\nCoptic Christians in Egypt, where an estimated 90 percent of the population is Muslim, have long faced persecution.\nThe Foreign Desk reports:\nThe mob first ransacked the home, destroying the construction materials and also attacked Aziz and his brother, who were both seriously injured. The attackers then began chanting traditional Islamic afternoon prayer on loudspeakers aimed at Christian families in the village as they torched their cars and homes, even as police began to arrive, according to ICC.\nFather Karas Naser, the priest of the Holy Virgin and the Archangel Michael Coptic Orthodox Church, was reportedly assaulted by the mob.\nThe radical Islamists intercepted his car and “attacked him but some moderate Muslims intervened, rescuing him from their hands and getting him out of the car,” revealed Zarif, according to the Christian advocacy group ICC.\n“Police were called to the scene but either could not or refused to stop the destruction,” points out the Daily Express. “The crowd continued to set homes and cars on fire in the presence of officers…”\n“No one did anything and the police took no pre-emptive or security measures in anticipation of the attacks,” Anba Makarios, a local Christian cleric, told the Express, adding, “We are not living in a jungle or a tribal society. It’s incorrect for anyone to declare himself judge, police and ruler.”\nHowever, The Foreign Desk reports that police arrested six Copts and six Muslim men during the attack.\n“This is usual business for the Egyptian government in how they deal with sectarian violence,” Mina Abdelmalak, a Coptic activist, told The Foreign Desk.\nAn ICC spokesman added:\nIt is unspeakable that the victims of these attacks were charged with crimes while the perpetrators continue to enjoy total impunity. It continues to show how Christians in Egypt are treated like second class citizens. We call on the Egyptian authorities to ensure that justice is served and that Christian communities like this be protected from further assault in Egypt.\nThe Coptic Christian victims were forced to surrender their rights when police pushed them into reconciling with the Islamist aggressors, argued Abdelmalak.\nCiting a blog post Sarah Yerkes authored for the The Brookings Institution, Christian Today reports:\nThe status of Coptic Christians in Egypt remains in a dismal state, and President Abdel Fatah el-Sissi has been accused of turning a blind eye towards the suffering in the ongoing Muslim-Christian tensions.\nYork’s is a visiting fellow in the Center for Middle East Policy and a Council on Foreign Relations International Affairs fellow.\nAbdelmalak acknowledged that the number of incidents linked to acts of aggression against Coptic Christians is not as high as it was under Sisi’s predecessor, President Mohamed Morsi of the Muslim Brotherhood.\nLast month, an estimated 300 Muslims looted and torched Christian homes in addition to stripping a 70-year-old Christian woman naked after accusing her son of having an affair with a Muslim woman, Reuters reports.","url":"https://www.breitbart.com/national-security/2016/06/24/egypt-fanatic-mob-1000-plus-islamists-set-80-christian-homes-ablaze/"}
