{"authors":["Frances Martel"],"date_download":"2018-10-30 20:42:42","date_modify":"2018-10-30 20:42:42","date_publish":"2015-04-30 18:51:30","description":"Greek Finance Minister Yanis Varoufakis and his wife were the victims of an anarchist mob attack while dining out.","filename":"data/vaneerConsumption/MobofAnarchistsAttacksGreekFinanceMinisterVaroufakisatDinner.json","image_url":"https://media.breitbart.com/media/2015/04/Greek-Finance-Minister-Yanis-Varoufakis-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_30__1540932162.html","title":"Mob of Anarchists Attacks Greek Finance Minister Varoufakis at Dinner","title_page":"Mob of Anarchists Attacks Greek Finance Minister Varoufakis at Dinner | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Days after being pulled back from leading the Greek diplomatic team in talks with the European Union regarding the nation’s astronomical debt, Greek Finance Minister Yanis Varoufakis and his wife, Danae Stratou, were the victims of an anarchist mob attack while dining out.\nBloomberg News reports that the attack occurred around midnight Tuesday while the couple was eating in Exarchia, a neighborhood of Athens. A group of hooded anarchists entered the restaurant “making threats, throwing objects at the couple and demanding they leave.”\nGreek newspaper Ta Nea reports that the most detailed account of the incident comes from Varoufakis himself, in a report to police authorities. “I don’t believe their intention was to hurt us because if they did they could have, due to the force of numbers,” he explained. “Before I could stop her and before the anarchists reached us, Danae rose and wrapped her arms around me, turning her back to them so that they would have to hit her before they got to me.”\nThe group then left the restaurant and waited for the couple outside, where Varoufakis spent some time conversing with those open to discussion. No one was hurt in the incident, though one anarchist “hit [Varoufakis] lightly in the head.”\nTa Nea reports that about ten anarchists entered the restaurant, while the group waiting outside numbered up to 60.\n“I am a regular in Exarchia 30 years and will continue to go,” Varoufakis said of the neighborhood, adding that the incident reminded him of his youth there.\nKathimerini published video of the incident, in which the group can be seen yelling at Varoufakis to “get out of here and do not come back” and “you are a politician and not to be believed”:\nVaroufakis, of the Coalition of the Radical Left party (Syriza), was recently recalled from talks over Greece’s debt with the European Union. Bloomberg reports that a meeting between Greek and European leaders on Friday “descended into name-calling as the currency bloc’s finance ministers hurled abuse at their Greek colleague, accusing him of being a time-waster, a gambler and an amateur.”\nDespite being elected largely due to the popularity of radical leftist policies in Greece–and because of European fears that Syriza head Alexis Tsipras would be an intransigent prime minister on leftist ideology–Syriza has not been immune to attacks from leftist anarchists who believe the party is not doing enough to rebuff efforts by the rest of the continent to impose responsible economic policies on the nation. In March, a group of 50 anarchists overran the headquarters of the party, making demands on the party to move further left. The group appeared especially interested in prison reform, demanding the release of several Marxist terrorists. Among the terrorists mentioned by name was a member of the Conspiracy of the Fire Nuclei–a group the United States designated as a terrorist organization–who was arrested after a bomb prematurely detonated and severely injured him.","url":"https://www.breitbart.com/national-security/2015/04/30/mob-of-anarchists-attacks-greek-finance-minister-varoufakis-at-dinner/"}
