{"authors":["Samantha Matthews"],"date_download":"2018-10-30 23:36:09","date_modify":"2018-10-30 23:36:09","date_publish":"2014-08-13 16:00:01","description":"There's already a lot to love about Modcloth, and the fashion company's recent announcement adds another awesome item to the list. Modcloth has been ahead of the curve in fashion retail by promoting a love for body types in all shapes and sizes for…","filename":"data/vaneerConsumption/ModclothSignsNoPhotoshoppingPledgeInCaseYouNeedAnotherReasonToLoveTheBrand.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/0959c68c-7414-4819-860b-dc1fac69e416.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35595-modcloth-signs-no-photoshopping-pledge-in-case-you-need-another-reason-to-love-the-brand_1540942569.html","title":"Modcloth Signs No Photoshopping Pledge, In Case You Need Another Reason To Love The Brand","title_page":"Modcloth Signs No Photoshopping Pledge, In Case You Need Another Reason To Love The Brand","title_rss":"NULL","source_domain":"bustle.com","text":"There's already a lot to love about Modcloth, and the fashion company's recent announcement adds another awesome item to the list. Modcloth has been ahead of the curve in fashion retail by promoting a love for body types in all shapes and sizes for a while, specifically offering clothing on the site in various sizes, including plus. And now Modcloth has signed an anti-photoshop pledge, making it the first fashion company to jump on board the Heroes Pledge for Advertisers, a petition forcing advertisers to be open about the Photoshopping tactics that take place on their advertisements.\nBy signing the pledge advertisers are asked to \"do their best not to alter the models shape, size, color, or proportion as well as enhancing or removing features.\" Taking into consideration that Photoshop alterations will most likely still be made, the pledge asks that advertisers clearly label the image to note the changes that took place. ModCloth CMO Nancy Ramamurthi spoke with Fashionista about why this petition rings true with the company.\n\"We don't have professional models on our site and we've been doing this since 2002,\" Ramamurthi said. \"We've never been a company that has misrepresented or altered the photos of our models, we've had hundreds of independent designers all produce clothing on our site and we've really worked hard to ensure they're for women of all sizes.\"\nI already adore Modcloth and its desire to support this pledge makes me love the site even more. The images on the site promote positive body image and of course fashionable clothing. These 5 ridiculously pretty editorial shots prove just how awesome Modcloth really is, and that you don't need to 'Shop to get a pretty picture.\nImages: Modcloth","url":"https://www.bustle.com/articles/35595-modcloth-signs-no-photoshopping-pledge-in-case-you-need-another-reason-to-love-the-brand"}
