{"authors":["Michelle Moons"],"date_download":"2018-10-30 18:08:15","date_modify":"2018-10-30 18:08:15","date_publish":"2016-06-11 15:27:44","description":"San Diego Mayor Kevin Faulconer won the over 50 percent needed this week to avoid a November runoff election and score his first non-special election win. | Local","filename":"data/vaneerConsumption/ModerateFalconerReElectedAsSanDiegoMayorAvoidingRunoff.json","image_url":"https://media.breitbart.com/media/2016/06/faulconer-download-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2016_06_11__1540922895.html","title":"Moderate Falconer Re-Elected As San Diego Mayor, Avoiding Runoff","title_page":"Moderate Falconer Re-Elected As San Diego Mayor, Avoiding Runoff | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"San Diego Mayor Kevin Faulconer won the over 50 percent needed this week to avoid a November runoff election and score his first non-special election win.\nFaulconer was the only registered Republican in the technically non-partisan race for the position of mayor of one of America’s eighth-largest city. He won 58.53 percent of the vote in Tuesday’s election with 100 percent of precincts reporting.\nHe beat out former Democrat and former Assemblywoman Lori Saldana who ran as an Independent and won 22.2 percent of the vote. Bringing up the rear, registered Democrat and former San Diego City Councilman Ed Harris pulled in just 19.27 percent of the vote.\nPolitical consultant John Hoy told local 10 News that Faulconer is likely to benefit from his work on “more traditional Democrat issues” when it comes to working with the City Council. Faulconer was a City Councilman himself for eight years before assuming office as Mayor. Lifeguard union chief Harris was appointed to replace Faulconer on the City Council. Based on the City Charter he was precluded from running for the position in the subsequent election.\nIn May Faulconer revealed funding details for his climate change action plan. He called the $127 million in allocations, “just the down payment.” The San Diego Union Tribune reported, “The money would pay for dozens of projects including tree planting, striping of bike lanes, solar panel installations, sidewalk and road repairs, and stormwater and sewer upgrades.”\nFaulconer has also pushed the LGBT agenda as San Diego LGBT Weekly writer Nicole Murray Ramirez wrote, “Kevin Faulconer will go down in history as one of the most supportive of LGBT equality. Within days of being elected, Mayor Faulconer accepted the national chairmanship of Mayors for Marriage Equality.”\nIn January Faulconer backed Republican Sen. Marco Rubio for President. The Atlantic reported, “Faulconer’s advisers can tout approval numbers above 50 percent across the board, including from Latinos and voters who described themselves as “very liberal.”” The report went on, “He is pro-choice, pro-marriage equality, pro-comprehensive immigration reform, and pro-gun control. But on the economic side, Faulconer is against tax and minimum-wage hikes and in favor of pension reform and bidding out city services.”\nSan Diego voter registration as of May 23, 2016 was comprised of: 36.89 percent Democratic Party, 32.29 percent Republican Party, 25.93 percent No Party Preference and 4.88 percent other party affiliation.\nFaulconer first won election to the position of mayor in a 2014 special election to replace disgraced Democrat Mayor Bob Filner. A former long-time Congressman, Filner came under intense scrutiny for a litany of sexual harassment charges that eventually resulted in a payment of at least hundreds of thousands of dollars to claimants and forced Filner from office. In one case he pleaded guilty to false imprisonment and misdemeanor battery.\nA San Diego reporter later admitted that many in the media had known about sexual harassment accusations against Democrat Filner for years and never looked into or reported on them before his election as mayor. The Atlantic reported that Filner had been the city’s first Democrat elected as mayor in two decades.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2016/06/11/moderate-falconer-re-elected-san-diego-mayor-avoiding-runoff/"}
