{"authors":["Harry Pettit For Mailonline"],"date_download":"2018-10-23 02:07:06","date_modify":"2018-10-23 02:07:06","date_publish":"2017-03-16 12:25:59","description":"EXCLUSIVE: Billy Eldridge, 26, grew up in a small village in Yorkshire but now works as a gold trader in Hong Kong after he was scouted by a modelling agent while on holiday in New York City.","filename":"data/vaneerConsumption/ModelBillyEldridgerevealshowhebecameastar.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/16/3E4DFF6E00000578-0-image-a-76_1489596244855.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4316262_Model-Billy-Eldridge-reveals-star_1540260426.html","title":"Model Billy Eldridge reveals how he became a star","title_page":"Model Billy Eldridge reveals how he became a star | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Not every small-town, working class boy gets the chance to party with Rita Ora. But for Instagram model Billy Eldridge, 26, it's just another day at the office.\nAs if living in a real-life fairytale, Billy went from a working-class boy in a small Yorkshire village to a model walking runways around the world after he was scouted in the middle of a busy New York city street.\nHe has since swapped the life of a full-time model for a lucrative career as a gold trader, living and working out of a five-star hotel in Hong Kong.\nNot content with his own success, Billy has also turned his hand to helping others and has started his own charity to support orphans living in rural China - but says his transient lifestyle has rendered him 'un-dateable'.\nCatwalk star: Billy struts his stuff for designer Rocco Barocco at Milan fashion week\nMuscular: Billy in an indoor swimming pool in Hong Kong, left, and on holiday in the Maldives\nStar-studded nights: Billy, left, backstage with Rita Ora, centre, at one of her New York gigs\nBorn near Brighton, England, Billy moved to a tiny town called Pickering in Yorkshire when he was five years old after his parents divorced.\nWith little money after the divorce, Billy had to move with his older brother Charlie, then seven years old, and Mum Jane, into a small hotel owned by his grandparents.\n'I'll admit it sounds luxurious,' Billy told FEMAIL. 'But it wasn't hugely successful, and was in the middle of nowhere with only twelve rooms.'\nAfter the divorce Billy's father lived just a few streets away from his sons, but rarely saw either of them.\nHumble beginnings: Billy aged six\n'My Dad was a waste of space and never did anything for the family,' Billy said.\n'After the divorce we would only see him on a Sunday for the first six months and then never saw him after that.\n'He missed birthdays and didn't call, even stopped sending money to Mum after that. I guess some people just aren't meant to have kids.'\nBut Billy's mother stepped up in the family's time of need, studying a degree in hospitality alongside two jobs, including gruelling night shifts at a supermarket and evenings as a waitress.\nBilly got seriously into basketball at secondary school and was even selected for the England team at the age of 16. At 18 he secured a basketball scholarship to study at a Virginia Tech, and jetted off to the US.\n'Virginia was a huge culture shock for me,' he said. 'I was dropped right in the middle of the Bible belt living with the most religious family I've ever met.\n'We weren't even allowed a poker night!'\nWhile in the US, Billy got his first big modelling break. He was spotted by America's Next Top Model host Nole Marin, the director of AIM Model Management, while walking down a busy New York City street on holiday.\nSporting dreams: Aged 18, Billy secured a scholarship to play basketball for Virginia Tech\nChance encounter: He was spotted by America's Next Top Model judge Nole Marin, right\nFamous friends: Billy poses with actress Gabrielle Union, left, on a night out\nHe said: 'I remember this really short guy looked me up and down... I didn't really think anything of it but stopped and turned around once he had walked past.\n'He was just stood there looking at me, then he came over and gave me his card and told me to come to his studio the next day.\n'I was a little anxious because I had no idea who he was, but I thought I'd take a punt and head over.'\nLuckily for Billy, Marin was just starting a new agency and was the first model he signed.\nAt just 22 years old Billy then spent two years travelling around the world as an Abercrombie and Fitch model.\nSuccessful career: Posing in a photo shoot for Leonardo Corredor in New York last month\nLuxury lifestyle: Billy soaks up the sun on top of a friend's yacht in Hong Kong\nHe found himself regularly invited to lavish events, meeting A-list celebrities, and globetrotting to exotic places he had never imagined he would see.\nBut it was the fashion weeks Billy worked at that amazed him most.\n'Getting to go to fashion weeks was incredible, I would just sit there thinking \"what am I doing here?\" It's mind-blowing, you don't what to do with yourself.\nStar power: Billy with Domenico Gabbana of Dolce and Gabbana\n'There were loads of parties during the week after each day's events where you are essentially paid to mingle with the celebrities there.\n'I would just try to speak to everyone and network like crazy, and that's where the gold trading stuff came in.'\nAfter two years in the business, Billy embarked on a master's degree in economics at University College London.\nUsing the connections he made as a model, Billy landed a job as a gold trader in Hong Kong. He has now set up a charity to rehouse orphans in rural China.\nWith the Chinese government moving so much of their poverty-stricken rural population to the cities, millions of helpless children have been left abandoned in villages dotting the country.\n'The lucky ones have been left with grandparents or other family,' Billy said. 'But those without this luxury have been left abandoned – 104million of them.\n'I was reading about these kids in The Economist one day and said \"this is f****d,\" I'm here, in Hong Kong, living in the Four Seasons hotel. Many of my small bunch of friends in Hong Kong are billionaires – I knew I had to do something.'\nBrooding: A shot from Billy’s Instagram, taken in Trump Soho hotel, in downtown New York\nFanfare: Crowds gather as Billy and other male models perform at the opening of the flagship Abercrombie & Fitch store in Hong Kong. He travelled the world with the American brand\nBilly sells on the unwanted luxury items of his wealthy friends via his charity's online store alongside other, more conventional methods of raising funding.\nThe project is still in its early stages, but Billy hopes he can help as many kids as possible to give those a chance in life who otherwise wouldn't have one.\nBut while Billy admits he has had the experience of a lifetime, life as a model is far from perfect.\nCharity work: The Left Behind Foundation, which was founded by Billy, sent Swiss student Lynn, left, to the Shandong region of China last month to meet local children\n'Because of all the travelling and your circle of friends the job does change people and you become un-dateable really,' he told FEMAIL.\n'You do sometimes feel lonely even though you're with people all time, but a lot of them are fake. I wasn't brought up with money, so sometimes I do feel a little different.\n'But I think that's also what has allowed me to flourish and keep it all at arm's length when it gets too much.'\nTo find out more about The Left Behind Foundation here.","url":"https://www.dailymail.co.uk/femail/article-4316262/Model-Billy-Eldridge-reveals-star.html"}
