{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:56:17","date_modify":"2018-10-30 20:56:17","date_publish":"2015-11-11 17:09:13","description":"A cinema in Scotland has been criticised for cancelling a film that portrays the life of Mohammad, but without depicting him.","filename":"data/vaneerConsumption/MohammadFilmScreeningCanceledAfterSaudiHijackedPetition.json","image_url":"https://media.breitbart.com/media/2015/11/Screen-Shot-2015-11-11-at-15.04.21.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2015_11_11__1540932977.html","title":"Mohammad Film Screening Canceled After Saudi Hijacked Petition","title_page":"Mohammad Film Screening Canceled After Saudi Hijacked Petition","title_rss":"NULL","source_domain":"breitbart.com","text":"A cinema in Scotland has been criticised for cancelling a film that portrays the life of Mohammad, but without depicting him. Less than a hundred people had signed a petition against the screening, some from Saudi Arabia and Nigeria.\nThe Grosvenor Cinema in Glasgow was due to screen Moustapha Akkad’s 1977 Oscar-nominated film about the life of the Islamic prophet and the birth of Islam next month.\nThe Islamic Society of Britain (ISB), who organised the screening, protested the cancellation in the face of a “small number of objections”, after a mere 93 people signed an anonymous petition. Some of the signatures were from Scotland, but many were from countries as far away as Bahrain.\nThe petition protests that the “film is hugely inappropriate” primarily because relatives of Mohammad are portrayed by “non-Muslims”, which is against the “honour and dignity” of Islam. The film is also said to contain “other inappropriate material such as music and dancing” and a “number of historical inaccuracies”.\nThe National Secular Society campaign manager Stephen Evans said in a statement:\n“It’s a sad sign of the times that such a small petition has forced the venue to cancel. We hope the cinema will change its position and not allow the weapon of offence to be used to restrict its freedom as a cinema to screen films and the freedom of audiences to watch them.”\nA spokesman for the ISB said: “As Scottish Muslims, we believe in the principles of freedom of speech and have worked for decades to promote the rights of people to make Islam relevant to British society.\n“These protestors demonstrate the worst elements of our community, as they are imposing their beliefs on others. We will not be bullied by these people. We are also appealing for the Grosvenor to stick to the original agreement, and show the film.”\nThe film caused some controversy when it was made; with Hollywood refusing to make it after the Muslim World League in Mecca, Saudi Arabia rejected the plan.\nIt was ultimately financed and facilitated by Moroccan and Libyan leaders. Many Islamic scholars and Imams were consulted in the process and the producers avoiding showing Mohammad at all to avoid offending Muslims.\nThe director saw the project as bridging understanding between East and West.\nJust this year a big budget Iranian film ‘Muhammad, Messenger of God’ drew similar criticisms for telling the story of Mohammad and showing his arms and legs as a baby. The director became the subject of a fatwa from Indian clerics in September, but was eventually chosen by Iran as its contender for the 2016 Oscars.\nThe Grosvenor Cinema has not made any public comment on the cancellation of the screening.","url":"https://www.breitbart.com/europe/2015/11/11/mohammad-film-screening-cancelled-after-saudi-hijacked-petition/"}
