{"authors":["Monica Busch"],"date_download":"2018-10-31 01:46:02","date_modify":"2018-10-31 01:46:02","date_publish":"2018-08-27 19:36:01","description":"Although the Trump administration has tried to use 20-year-old Mollie Tibbetts' death to bolster its immigration platform, Tibbetts' father thanked the Hispanic community while eulogizing her during her Sunday funeral service. Specifically, he…","filename":"data/vaneerConsumption/MollieTibbettsDadGaveAEulogyWithATouchingMessageForTheHispanicCommunity.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/8837b931-ce2d-4ab2-a4fe-289abeaaed7b-shutterstock_9796744g.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_mollie-tibbetts-dad-gave-a-eulogy-with-a-touching-message-for-the-hispanic-community-10252794_1540950362.html","title":"Mollie Tibbetts’ Dad Gave A Eulogy With A Touching Message For The Hispanic Community","title_page":"Mollie Tibbetts’ Dad Gave A Eulogy With A Touching Message For The Hispanic Community","title_rss":"NULL","source_domain":"bustle.com","text":"Although the Trump administration has tried to use 20-year-old Mollie Tibbetts' death to bolster its immigration platform, Tibbetts' father thanked the Hispanic community while eulogizing her during her Sunday funeral service. Specifically, he thanked the community for all of its support during the search for his daughter.\n\"The Hispanic community are Iowans. They have the same values as Iowans,\" Rob Tibbetts said during Mollie's eulogy, according to The Des Moines Register. \"As far as I'm concerned, they're Iowans with better food.\"\nTibbetts said that he ate at a number of Mexican restaurants during the search for his daughter, and that the employees at those restaurants were sensitive to what he was going through, according to the Register. Tibbetts has not otherwise publicly commented on how his daughter's death has been brought into the immigration policy debate.\nAfter news broke that Mollie's suspected murderer may be an undocumented immigrant, the White House sent out a controversial tweet, suggesting that undocumented immigration was the culprit.\n\"For 34 days, investigators searched for 20-year-old Mollie Tibbetts,\" the White House account tweeted. \"Yesterday, an illegal alien, now charged with first-degree murder, led police to the cornfield where her body was found. The Tibbetts family has been permanently separated. They are not alone.\"\nMollie went missing on July 18, after she had gone out for a run. Authorities found her body about six weeks later, in a field located just outside of Brooklyn, Iowa, the AP reports. Experts concluded that she died from stabbing-related injuries.\nAuthorities say that Cristhian Bahena Rivera, the 24 year-old man accused of killing Mollie, is an undocumented Mexican immigrant. Investigators claim that Rivera admit to following Mollie during part of her run on July 18, the day she went missing. He then said, according to law enforcement officials investigating the case, that he approached her, and that Mollie was alarmed at the time, according to The Washington Post.\nRivera reportedly told investigators that he blacked out at some point after approaching Mollie. After being interviewed by police, Rivera led authorities to Mollie's body, according to multiple reports. Police had found Rivera after seeing both Mollie and his car on security footage nearby, according to the Post. Rivera was charged with first degree murder and, as of Monday, has not yet entered a plea.\nSome members of Mollie's family have publicly pushed back against the narrative that she died because of immigration policy. Sandi Tibbetts Murphy, identified by Vox as Mollie's cousin, penned a lengthy Facebook post on the issue:\nYes, that man is an immigrant to this country, with uncertainty as to his legal status. But it matters not. He could have been a citizen, born in this country; he could have been an older, white man from anywhere; he could have been a man from Mollie’s world... He is a man who, because of his sense of male entitlement, refused to allow Mollie the right to reject his advances – the right to her own autonomy. Mollie was murdered because a man denied her right to say no.\nUndoubtedly, the sudden politicization of Mollie's death has made her family's mourning all the more difficult. But as of Monday, there have been conflicting reports regarding her alleged murderer's immigration status, and it's not currently clear whether that will have any bearing on a potential trial. For now, her family and community will continue trying to process their unexpected loss.","url":"https://www.bustle.com/p/mollie-tibbetts-dad-gave-a-eulogy-with-a-touching-message-for-the-hispanic-community-10252794"}
