{"authors":["Mollie King For The Mail On Sunday"],"date_download":"2018-10-22 23:54:56","date_modify":"2018-10-22 23:54:56","date_publish":"2017-03-16 08:19:43","description":"Mollie King enjoyed a relaxing break at the Sandals South Coast resort at Bluefields Bay in sunny Jamaica, a couples-only retreat to which she brought a female friend.","filename":"data/vaneerConsumption/MollieKingattheSandalsSouthCoastresortJamaica.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/15/19/3E4EA20D00000578-0-image-a-121_1489605899910.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travelsupplement_article-4315764_Mollie-King-Sandals-South-Coast-resort-Jamaica_1540252496.html","title":"Mollie King at the Sandals South Coast resort Jamaica","title_page":"Mollie King at the Sandals South Coast resort Jamaica | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Six years ago I stayed at the Sandals Grande St Lucian resort; it was so brilliant that I’ve always wanted to experience another Sandals holiday in the Caribbean.\nSo when I had the chance to visit Jamaica – somewhere I’ve always wanted to go – I jumped at the opportunity to spend a week at the Sandals South Coast resort at Bluefields Bay.\nWe flew to Montego Bay and then had a transfer of about 90 minutes, which involved a beautiful drive through the Blue Mountains, a lovely way to see the heart of the island. Straight away I was impressed with how friendly the locals were: nothing seems to be too much trouble for anybody.\nMollie King, pictured on the beach at the Sandals South Coast resort at Bluefields Bay in sunny Jamaica, where she escaped for fun-filled getaway\nI went with my friend Chelcee.\nSandals is a couples-only resort (it’s the perfect place for a romantic break) so we were slightly anxious about being two women together. When we arrived, we walked into the room and there was a big display of a heart on the bed and rose petals everywhere.\nThe man who was showing us to our room was a bit embarrassed: ‘Oh, I’m sorry about this – we assumed you were coming with a man.’ Someone had also run a bath and put petals in it; Chelcee and I burst out laughing, but then we had a squabble to decide who could go in first!\nActually, not all the couples are mixed sex: we saw a few groups of women on girl-only trips all having a good time. We befriended a gang of girls from Texas and had a great time together.\nWe quickly explored the resort and discovered there was more than enough to keep us busy during our stay. We didn’t plan to go sightseeing: everything had been so fast-paced back home, I just wanted to chill out.\nBut we knew that we were unlikely to be sitting around: we planned to play every single sport they had going – squash, tennis, basketball, snorkelling, water-skiing…\nOne of her favourite places during the evening was the 360 bar, pictured, which boasts glorious views over the entire bay\nWhen I was 12, I was in the British youth skiing team and in a youth GB squad for water-skiing as well. Everything you learn when skiing on the mountains is completely the opposite for water-skiing.\nJamaica is capitalising on its famous link to winter sports: everybody has seen the film Cool Runnings about a Jamaican bobsleigh team taking part in the 1988 Winter Olympics in Calgary, Canada.\nNow, on the north of the island near Montego Bay they have a Cool Runnings ‘bobsled’ rollercoaster ride.\nIn the airport, they also have a Cool Runnings restaurant where numerous TV screens play the film, and all the menus are set out with behind-the-scenes photos and press cuttings from when Jamaica entered. It’s great fun.\nI love the Jamaican laid-back vibe and I’m a great fan of reggae. There’s always reggae music at the Sandals resort played around the pool: Top 40 music redone with a reggae vibe, and lots of Bob Marley, so you know you’re in Jamaica, which I think is great.\nReggae and the Caribbean sound is back in fashion so listen out for my new album to see if it’s influenced my sound at all.\nMollie and her friend aimed to take part in every activity offered – including squash, tennis, basketball, snorkelling and water-skiing. Pictured, the resort's jetty\nOne of the great things about staying in Sandals is the huge choice of places to eat – seven restaurants offering meals all included in the basic price.\nAt the South Coast resort they’d just opened a new sushi bar called Sushi On The Sand which was fantastic. You feel you can just eat and eat… you could eat your body weight in food. We were on holiday so we didn’t stint ourselves as far as food was concerned.\nI’m quite lucky that I have a fast metabolism. I work out a lot: I would rather indulge and then work it off at the gym than have to be very careful all the time.\nAt the resort I didn’t go to any organised exercise classes: it was more taking exercise through sports. I enjoyed trying new things.\nOn the north of the island near Montego Bay they have a Cool Runnings ‘bobsled’ rollercoaster ride, pictured\nOne day the call went out around the pool asking if people wanted to take part in a water volleyball match. Chelcee and I volunteered. When the game started, it quickly became very obvious that most Americans have grown up playing pool volleyball. They were all brilliant, belting the ball at us.\nSo we were given a crash course and eventually were able to give a better show.\nThere were lots of group activities like this going on but generally we enjoyed more chilled-out things such as paddle-boarding or snorkelling.\nIn the evenings the resort has plenty of entertainment, which was very professional (we were expecting something more Hi-de-Hi). There was lots of live-music dancing. A nightclub was open until the wee small hours.\nOne of our favourite places to hang out was the 360 bar, where you have a glorious view over the whole bay: the perfect place to sip a gin and tonic as you watch the sun go down.\nIt was a bit of a shock getting back to London, where everything runs at 100mph. I miss the laid-back life at Sandals.\nMy next foreign trip is to Los Angeles for work. And shortly after, I’ll be going somewhere to shoot the video for my next record. When all of this starts, Jamaica will suddenly feel a very long way away.\nTRAVEL FACTS Seven nights at Sandals South Coast in a Beachfront Deluxe Room costs from £2,043pp. This includes Luxury Included® (all-inclusive) accommodation, return flights from Gatwick and transfers. Visit sandals.co.uk or call 0800 597 0002.","url":"https://www.dailymail.co.uk/travel/travelsupplement/article-4315764/Mollie-King-Sandals-South-Coast-resort-Jamaica.html"}
