{"authors":[],"date_download":"2018-10-30 18:30:26","date_modify":"2018-10-30 18:30:26","date_publish":"2017-03-07 20:35:00","description":"Angel Spears lost her 18-year-old son Gabriel Swain, popular and beloved among his peers and family, in DeKalb County in July.","filename":"data/vaneerConsumption/MombegsforanswersindeathofpopularDeKalbteendumpedbyroad.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/03/Videos/5347038073001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_mom-begs-for-ans_5043abf2e7f7ecd37c7b871e80d119b9__1540924226.html","title":"Mom begs for answers in death of popular DeKalb teen dumped by road","title_page":"Mom begs for answers in death of popular DeKalb teen dumped by road","title_rss":"NULL","source_domain":"ajc.com","text":"She just wants to know.\nAngel Spear lost her 18-year-old son Gabriel Swain, popular and beloved among his peers and family, in DeKalb County in July. Answers have been few, with no arrests.\n“I’m angry. I’m hurt. But, yet, I feel like I can forgive if they would be man enough at this point to come forward,” the mother told Channel 2 Action News. “He was my only child. He was all I had. He was my best friend.”\nDeKalb police detective Vance van Hees told the station he suspects that Swain knew the killer and that it’s well-known in some circles who killed him.\nSwain’s body was found on Flat Rock Road near Browns Mill Road, which isn’t far from Panola Mountain State Park. The teen had been missing three days and had more than a half dozen gunshot wounds, Channel 2 reported.\nThe crime may have been motivated by “jealousy,” police believe.\nVan Hees said whomever is responsible could still be a danger.\n“These people are going to continue to live in that community and if they’ve done it before, I don’t see why they wouldn’t be willing to do it again,” he said.\nAnyone with information can call Crime Stoppers at 404 577-TIPS (8477). Even those who remain anonymous can be eligible for a reward.","url":"https://www.ajc.com/news/local/mom-begs-for-answers-death-popular-dekalb-teen-dumped-road/0l0eZqQ8sBjor3V1h9EGwM/"}
