{"authors":[],"date_download":"2018-10-30 20:41:42","date_modify":"2018-10-30 20:41:42","date_publish":"2015-06-12 03:47:32","description":"A Gwinnett County, Georgia mother is fighting a flesh-eating bacteria. WSB-TV’s Tyisha Fernandes talked to her husband who says it started as a small pain in her shoulder.","filename":"data/vaneerConsumption/Mombattlingflesheatingbacteriadoctorsdontknowhowshe.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/WSBTV/2015/06/12/Images/photos.medleyphoto.7415871.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_mom-battling-_d2fd2fb200fce219a7f5755f04c9878d__1540932102.html","title":"Mom battling flesh-eating bacteria, doctors don't know how she...","title_page":"Mom battling flesh-eating bacteria, doctors don't know how she...","title_rss":"NULL","source_domain":"ajc.com","text":"A Gwinnett County, Georgia mother is fighting a flesh-eating bacteria.\nWSB-TV’s Tyisha Fernandes talked to her husband who says it started as a small pain in her shoulder.\nNow she is facing the risk of losing her hands and feet.\nDoctors have not figured out how Cindy Martinez, 34, got the dangerous bacteria yet, and that's what's scaring her family the most.\nMartinez is at Gwinnett County Medical Center wondering if doctors will have to surgically remove her hands and feet.\n“I love her more than ever before,” said husband David Martinez.\nFor the past two weeks, the Gwinnett County police officer has been by his wife's side.\nThe bacteria has forced doctors to surgically remove dead muscle and tissue from his wife.\n“We have two children together. Our son is 5 and our daughter is 2 years old. We've been married for 13 years,” Martinez told Fernandes.\nThe couple met as young Marines in their 20s.\nMartinez had to take a leave of absence from the Police Department as his wife fights for her life.\n“I still have two small children who need their dad, you know? We still have normal days of life, bills and work, we have to get done,” Martinez said.\nDoctors say the flesh-eating bacteria, called necrotizing fasciitis, comes from some kind of open wound.\nHowever, Martinez told Fernandes that doctors haven't figured out how Cindy got it yet. What he does know, is that it started with a pain in her shoulder\n“That seems to be the mystery at this point. We don't know. She didn't have any injury, and initially at home when she was feeling the pain, I looked at where the pain was at and I didn't notice anything and that's what's troubling. I don't know,” Martinez said.\nThe Martinez family is counting on prayers right now, and they’re really hoping for a miracle since David had to take time off from the Gwinnett County police force.\nA GoFundMe page has been set up to help support the family.","url":"https://www.ajc.com/news/national/mom-battling-flesh-eating-bacteria-doctors-don-know-how-she-got/EQjwAFTxSC38cdlHxgX5KM/"}
