{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 22:26:33","date_modify":"2018-10-30 22:26:33","date_publish":"2014-08-15 17:33:39","description":"I know. You're sick of Frozen everything. But unless your heart is literally made of ice, then you will absolutely love this adorable video of a mother and daughter lip-syncing \"Love Is An Open Door\" together. And what if you're a naysayer, and…","filename":"data/vaneerConsumption/MomDaughterFrozenLoveIsanOpenDoorDuetIsGahhhtheCutestThingEverVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/921c3842-117f-4b57-a676-fbf0c8b693bc.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35952-mom-daughter-frozen-love-is-an-open-door-duet-is-gahhh-the-cutest-thing-ever_1540938393.html","title":"Mom & Daughter 'Frozen' \"Love Is an Open Door\" Duet Is Gahhh, the Cutest Thing Ever - VIDEO","title_page":"Mom & Daughter 'Frozen' \"Love Is an Open Door\" Duet Is Gahhh, the Cutest Thing Ever — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"I know. You're sick of Frozen everything. But unless your heart is literally made of ice, then you will absolutely love this adorable video of a mother and daughter lip-syncing \"Love Is An Open Door\" together. And what if you're a naysayer, and you're convinced that you're a frigid bitch? This video will definitely unfreeze your solid heart. It's too cute.\nThe mother takes on the role of evil Hans, and the daughter Teigan — who is seriously a mini star in the making — takes on Anna's part, and they get all of the words, even the dialogue. It looks like they've been practicing, which makes the video all the more adorable; it's like you can see that this mom and daughter have spent hours singing Frozen together. Even if you cannot stand Frozen and think you will rip out your own teeth if you hear \"Let It Go\" one more time, somewhere inside of your Frozen-loathing heart, you know that the Disney animated musical is bringing families together, since they have songs they can sing and act out together. If that ain't what Disney is for, then please, for the love of Walt, tell me what is.\nPREPARE YOURSELF FOR SO MUCH ADORABLENESS. Seriously — between this and a GIF of cats on a Pilates ball I recently found, I think the Internet is trying to kick my ovaries into hyperdrive or something.\nAubrey Marceaux on YouTube\nImage: Aubrey Marceaux/Youtube","url":"https://www.bustle.com/articles/35952-mom-daughter-frozen-love-is-an-open-door-duet-is-gahhh-the-cutest-thing-ever"}
