{"authors":["Sara Malm For Mailonline"],"date_download":"2018-10-23 00:03:20","date_modify":"2018-10-23 00:03:20","date_publish":"2016-01-29 12:46:48","description":"This 7.2ft-long female sand tiger shark ended a 'turf war' by simply eating a male banded hound shark, which was just 3.9ft long in an aquarium in Seoul, South Korea.","filename":"data/vaneerConsumption/MomentasharkisEATENbyitsbiggerrivalatSouthKoreanaquarium.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/12/30B233D000000578-0-image-a-64_1454071492182.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422728_There-s-bigger-fish-Incredible-moment-shark-EATEN-bigger-rival-South-Korean-aquarium_1540253000.html","title":"Moment a shark is EATEN by its bigger rival at South Korean aquarium","title_page":"Moment a shark is EATEN by its bigger rival at South Korean aquarium | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"There are a number of ways to end a domestic, and some are more drastic than others.\nThis female shark ended hers by simply eating a male opponent in an aquarium in Seoul, South Korea.\nThe female sand tiger shark measures 7.2ft, while her late rival, a male banded hound shark, was only 3.9ft long.\nHanger is real: A female sand tiger shark ate a male banded hound shark rival at an aquarium in South Korea\nThe aquarium said the female shark would have to regurgitate the body of the male shark after a week as she would not be able to digest him.\nTen minutes after the attack, the larger shark was filmed swimming around with the body of her tank mate hanging out her mouth.\nApproximately 21 hours later, only the tip of the tail remained, as the shark swam around the aquarium's undersea tunnel in front of aquarium guests.\nThe tail is expected to stay in her mouth for about four to five days, the aquarium said, adding that the shark will regurgitate the creature after about a week.\nThe aquarium believes the incident to be a kind of 'turf war'.\nEnd of discussion: The female shark is said to have eaten the smaller shark over a turf war, but sand tiger sharks are known to feed on other sharks in the wild\n'Sharks have their own territory. However, sometimes when they bump against each other, they bite out of astonishment.\n'I think the shark swallowed the whole body, because they usually eat it all when they bite the head part,' said PR manager of COEX aquarium, Oh Tae-youp.\nFights between small sharks have happened in the past, Oh added, but this kind of occurrence is rare and the first of its kind at the aquarium itself.\nThe aquarium started breeding big sharks about 10 years ago, according to the aquarium. Now, they say, a total of 42 sharks live together in the tank, with two turtles and 20 rays living alongside\nBig fish to fry: The sand tiger shark measures 7.2ft, while the banded hound shark was only 3.9ft long\nRegretting that later: Staff at the aquarium said the sand tiger shark would have to regurgitate the body later as she would be unable to digest him\nSand tiger sharks are relatively placid and slow-moving, and are not known to have ever killed humans.\nHowever, for other sharks - and for each other - they are slightly more dangerous.\nAs well as fish, crustaceans and squid, a sand tiger shark's diet includes other sharks.\nDuring pregnancy, the most developed sand tiger shark embryo will feed on its siblings, a reproductive strategy known as intrauterine cannibalism.\nThe COEX Aquarium, located in Seoul's trendy Gangnam district, one of South Korea's largest.","url":"https://www.dailymail.co.uk/news/article-3422728/There-s-bigger-fish-Incredible-moment-shark-EATEN-bigger-rival-South-Korean-aquarium.html"}
