{"authors":["James Dunn","Ollie Gillman For Mailonline"],"date_download":"2018-10-23 00:37:35","date_modify":"2018-10-23 00:37:35","date_publish":"2016-01-28 14:42:47","description":"Sharon Robinson, 71, and her husband Larry, 73, thought they would never get Tipsy back after the dog escaped from their home in Stockton, California, last month and was adopted.","filename":"data/vaneerConsumption/MomentCaliforniacouplegetdogbackafteritwasADOPTEDbynewfamily.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/20/16/30624BA700000578-0-image-a-66_1453309129081.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421069_Touching-moment-couple-finally-dog-escaped-ADOPTED-family_1540255055.html","title":"Moment California couple get dog back after it was ADOPTED by new family","title_page":"Moment California couple get dog back after it was ADOPTED by new family | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the touching moment that an elderly couple finally got their dog back after being left heartbroken when it was adopted by another family after escaping.\nSharon Robinson, 71, and her husband Larry, 73, were in Boston visiting his son when eight-year-old Tipsy escaped from their home in Stockton, California.\nThey desperately searched for the Shetland Sheepdog for days but when the tracked her down, she had been adopted by another family who were refusing to give her back.\nBut eventually, the family - who did not want to be identified' agreed to return her, and this video captures the beautiful moment that the couple were re-united with their lost pet.\nScroll down for video\nDog-gone: Sharon and Larry Robinson's dog Tipsy escaped and was taken in by a new family, who have refused to give her back\nThe Robinsons, pictured on their wedding day, were visiting family in Boston when Tipsy, eight, got away\nThe couple eventually tracked down Tipsy, only to find that another family had taken their Shetland Sheepdog in - and they will not give her back\nValley Humane Society in California took Tipsy from an animal shelter and gave her to a new family\nMrs Robinson sobbed as she greeted her, later saying: 'We're never going to let you go again,' in as she embraced the dog in the touching moments captured by Inside Edition.\nTipsy escaped on December 5 and the Robinsons found out on January 12 that their dog had been adopted by a family that had lost their own Sheltie, Fox40 reported.\nValley Humane Society had found Tipsy at an animal shelter in Stockton in December but she was not eating, so they took her to their rescue home instead.\nIt was there where the new family found the dog, who does not have a chip and was not wearing a collar, and decided to take her home just after New Year.\n'We looked every day. I even looked when I was sick, and they thought I was coming with pneumonia again,' Mrs Robinson said. 'I just want her back.'\nShe offered to pay the new family back any fees they incurred while adopting Tipsy and pleaded for them to hand over her beloved pet, but they refused.\nThe Robinsons had not chipped Tipsy and she was not wearing her collar when she escaped from their home in Stockton, California\n'They’ve loved her for a little over two weeks. I’ve loved her for eight-and-a-half years,' she said.\n'I might add we paid for her in the beginning and we had no intention of giving her away,' she added.\nMrs Robinson said her husband's health is in decline and that Tipsy was his 'companion'.\n'This is a sad situation and one that is heartbreaking,' she said. 'While I realize she should have had a microchip in place our medical bills took presence as we never thought we would need to deal with a situation like this.'\nMrs Robinson is now considering taking legal action against Valley Humane Society.\nMelanie Sadek, executive director of Valley Humane Society, told Daily Mail Online that everyone at the center was also 'heartbroken' that they had passed Tipsy on.\nMrs Robinson offered to pay the new family back any fees they incurred while adopting Tipsy and pleaded for them to hand over her beloved pet, but they refused\nTipsy was Mr Robinson's 'companion' and his wife said the situation was 'heartbreaking', but the new family changed their mind and agreed to give their beloved pet back\nShe said the rescue organization did not know the Sheltie had an owner and that they needed to find her a new home so she would settle down and start eating again.\nMs Sadek said legal ownership had passed from Stockton animal services to Valley Humane Society and then on to the new family, meaning there was nothing she was legally able to do.\nBut the family were slammed on social media, with users telling them to give the dog back, and branding the 'selfish'.\nEventually, the family agreed to return her and she is now back with Mrs Robinson, who was quite understanding of their reluctance, saying: 'I understand the pain that they're feeling.'\nMs Sadek added that just 26 per cent of the 5,000 dogs who pass through Stockton animal services every year are reclaimed by owners, and they do not have the facilities to hold on to every dog until someone comes forward.","url":"https://www.dailymail.co.uk/news/article-3421069/Touching-moment-couple-finally-dog-escaped-ADOPTED-family.html"}
