{"authors":["Jennifer Smith For Dailymail.Com"],"date_download":"2018-10-23 02:52:52","date_modify":"2018-10-23 02:52:52","date_publish":"2017-03-16 13:26:48","description":"The attack was caught on surveillance footage at a mall in Koreatown in central Los Angeles on Friday evening. The woman was waiting for a friend at the time.","filename":"data/vaneerConsumption/MomentLosAngelesmanattackswomanwithaHAMMER.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E54571100000578-0-image-a-27_1489670769330.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320110_Shocking-moment-man-brutally-attacks-woman-HAMMER_1540263172.html","title":"Moment Los Angeles man attacks woman with a HAMMER","title_page":"Moment Los Angeles man attacks woman with a HAMMER | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man has been filmed brutally attacking a 24-year-old woman with a hammer after asking her if she was Korean.\nThe attack occurred on Friday evening in a mall in Los Angeles's Koreatown.\nThe man was filmed approaching the woman first to ask her if she was Korean then reappeared clutching the weapon in his hand.\nWitnesses told KTLA he struck her more than 20 times in under a minute before they were able to stop him.\nScroll down for video\nA man was filmed brutally attacking a 24-year-old woman with a hammer at a Koreatown mall in Los Angeles on Friday evening. Above, he swings his arm before landing his first blow\nThe man, who has not been named, approached the woman first to ask her if she was Korean\nThe woman was standing waiting for a friend in front of a row of shops on the exterior balcony of the mall when he approached her at around 6pm.\nShe was filmed on surveillance footage innocently answering his question then looking back towards the parking lot beneath her.\nHe reappeared calmly from behind another corner with the hammer in his right hand. He strode up towards her then swung his arm back to land his first blow.\nIt's likely he was carrying the hammer in his backpack.\nHe reappeared seconds later clutching the weapon in his right hand while the woman, oblivious to the looming attack, looked out over the parking lot\nThe man surrendered to a security guard and was held to the ground by another by-standers as others tended to the victim\nPassers-by rushed to help the woman who they said screamed for him to stop for around 45 seconds.\nOne man was able to get him to put the hammer on the ground and held him down until police arrived.\nThe man was charged with attempted murder and a hate crime.\nThe woman was taken to hospital but has been released. Police have not yet named the man or given details of his arrest.","url":"https://www.dailymail.co.uk/news/article-4320110/Shocking-moment-man-brutally-attacks-woman-HAMMER.html"}
