{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 21:32:18","date_modify":"2018-10-22 21:32:18","date_publish":"2016-01-29 07:03:25","description":"Banana ran away from home in southwest Miami-Dade County on Sunday, and managed to get inside the house of a 100-year-old, who awoke in the middle of the night to find the animal on her chest.","filename":"data/vaneerConsumption/MomentBananathekinkajouwascapturedandreunitedwithherowner.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30B0158A00000578-0-image-a-2_1454049114621.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422266_The-moment-Banana-kinkajou-captured-reunited-owner-sneaking-elderly-woman-s-house-night-crawling-CHEST_1540243938.html","title":"Moment 'Banana' the kinkajou was captured and reunited with her owner","title_page":"Moment 'Banana' the kinkajou was captured and reunited with her owner | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"'Banana', the mischievous kinkajou who escaped from her cage and gave a Florida woman the fright of her life this week, has been recaptured and reunited with her owner.\nThe rare rainforest creature ran away from her home in southwest Miami-Dade County on Sunday, and managed to get inside the house of a 100-year-old, who awoke in the middle of the night to find the animal cuddled up on her chest.\nThe woman screamed, before calling her son-in-law, who was able to come over and capture Banana, who by that time had climbed up into a skylight.\nLuckily her owner, Raymond Fernandez, saw a story about what happened on TV, and rushed to get his pet back.\nScroll down for video\nKinkajou want a cracker?: Banana ran away from her Florida home and then gave a 100-year-old woman the shock of her life. This is the moment the woman's son-in-law attempts to lure Banana from the attic\nCome on: Carlos Aguaras, the man who captured Banana, said it took some time to get Banana\nGot you: After some coaxing, Banana - a nocturnal animal - finally came down from up in the roof\nThe four-legged kinkajou (pictured) - an animal usually found living in trees in the jungles of Central and South America - climbed into bed with with an elderly woman and fell asleep\n'I was tenting my house and I had to move her to my brother's house in a temporary cage, and she figured out a way to open it up,' the owner told Local 10 News.\n'She's got really good hands.'\nKinkajous are nocturnal animals native to the rainforests of Central and South America.\nMr Hernandez said he has had Banana for five years.\n'I got my baby back,' Mr Fernandez said.\n'I can't believe it. I thought she was lost forever.'\n'Banana', the mischievous kinkajou who escaped from her cage and gave a Florida woman the fright of her life this week, has been recaptured and reunited with her owner\nThe animal, which had been attracted to the warmth of the woman, was also affectionately stroking her face\n'I can't believe it. I thought she was lost forever': Raymond Fernandez was chuffed to get his prized pet back\nCarlos Aguaras, the man who captured Banana, said it took some time to get Banana.\nMr Aguaras said: 'I was awaken by a phone call at 2am which is never good news, and it was from my terrified mother-in-law.'\nHe explained he then shot round to her home - where she lives with a carer who was fast asleep - to try and capture the wild animal.\nBy the time he arrived, the kinkajou - which typically spend most of their time in trees - had made it into the home's attic.\nHe managed to lure it out with food before capturing it in a cage and taking it to the vet.\nDr Don J. Harris at the South Dade Avian and Exotic Animal Medical Center recognised the kinkajou as Banana - a local's prized pet.\nShe was taken to the South Dade Animal Hospital for care.\nBanana was then reuinted with her owner on Wednesday.\nKinkajous can turn their feet backwards, making it easy for them to run in both directions. Spending much of their time up tall trees, the monkey-like creatures are commonly seen hanging from their tails when out in the wild.\nAfter escaping, Banana was taken to the South Dade Animal Hospital (pictured) for care. She was then reunited with her owner on Wednesday\nAccording to National Geographic, they are sometimes called 'honey bears' because they raid bees' nests by slurping honey from the hive.\nThere is yet to be any word on how the animal managed to escape.\nHowever, the 100-year-old's family certainly hope this will be the last time.","url":"https://www.dailymail.co.uk/news/article-3422266/The-moment-Banana-kinkajou-captured-reunited-owner-sneaking-elderly-woman-s-house-night-crawling-CHEST.html"}
