{"authors":["Keiligh Baker For Mailonline"],"date_download":"2018-10-23 00:27:15","date_modify":"2018-10-23 00:27:15","date_publish":"2017-04-26 10:01:30","description":"Driving instructor David Eckersley said his shaken student was left unable to drive for a month after the shock of the collision in St Helens, Merseyside.","filename":"data/vaneerConsumption/Momentamotoristploughsintobackofalearnerdriver.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F9DB21E00000578-0-image-a-29_1493197187191.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446884_Moment-motorist-ploughs-learner-driver_1540254435.html","title":"Moment a motorist ploughs into back of a learner driver","title_page":"Moment a motorist ploughs into back of a learner driver | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the moment a motorist ploughed into the back of a learner driver while allegedly texting - causing her to hit herself in the face with her own pink phone.\nDriving instructor David Eckersley said his shaken student was left unable to drive for a month after the collision in St Helens, Merseyside.\nHis rear dashcam footage shows how the Renault Clio driver accelerated and ploughed into the Suzuki Swift being driven by his pupil - with the woman clearly grasping a pink mobile phone in her right hand.\nThis is the moment a motorist ploughed into the back of a learner driver during a lesson\nThe dashcam even catches the moment the reckless driver ends up smashing herself in the head with the phone at the moment of impact.\nAfter initially protesting her innocence, Mr Eckersley claims the woman's attitude changed once he informed her that the whole incident had been caught on camera.\nMr Eckersley, 26, said: 'It was a frightening experience for the young girl behind the wheel of my car.\n'We both ended up with whiplash and my face cracked off the dashboard due to the force of the impact.\nDriving instructor David Eckersley said his shaken student was left unable to drive for a month after the shock of the collision with this car (pictured) in St Helens, Merseyside\nThe footage shows the woman clearly grasping a pink mobile phone in her right hand\n'The road we were on leads up a particularly tricky roundabout with a pub in the middle of it so you really need to concentrate.\n'The young girl who was learning had correctly slowed down on the approach and I leaned forward in my seat to get a better view of what was coming. There's a crest on the right that means you can't see that well.\n'Next thing I know we feel this massive shunt in the back of us and it threw me face-first into the dashboard.\n'Thankfully neither of us suffered anything worse than whiplash but it was terrifying for the poor learner.\nThe dashcam even catches the moment the reckless driver ends up smashing herself in the head with the phone at the moment of impact\n'As we are hit all I remember is my sunglasses coming off and uttering the occasional swear words.\n'I then checked to see if Lauren was ok. She was very quiet, in shock. The blonde girl was at my window by this point.\n'I get out and she immediately said 'who's at fault here?'. I told her she was as she'd ran into the back of us.\n'She said 'what are you stopping for?' and I told her you can't take a roundabout at 30mph.'\nThe incident happened near the Moss Bank pub in Scafell Road, St Helens, last June.\nMr Eckersley, who set up Swift Drive Driving School three years ago, said he hoped the clip would serve as a lesson to those who continue to use phones behind the wheel.\nThe damage caused to Mr Eckersley's car following the crash at a roundabout in St Helens\nMr Eckersley said: 'There's so much technology these days that mean you don't have to hold your phone while driving, I don't understand why people still do it.\n'From the video, it looks like this girl sped up and possibly hit the wrong pedal because she wasn't concentrating. She got out looking really cross and immediately blamed us. She had a small dog in the car with her too.\n'I told her I thought she was on the phone and would be checking the film. That's when she went quiet. You can see her scratching her head at the end of the footage, wondering what she's done.\n'I had to cancel all my remaining lessons for the next three days, losing almost £500. I was in pain all weekend and had to go to A&E because of the pain in my back and shoulders.\n'I can't stress enough how dangerous it is to text and drive. There's no excuse really.'","url":"https://www.dailymail.co.uk/news/article-4446884/Moment-motorist-ploughs-learner-driver.html"}
