{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-23 00:37:05","date_modify":"2018-10-23 00:37:05","date_publish":"2016-01-28 14:39:47","description":"Captured on camera is the unbelievable moment a woman was filmed knitting behind the wheel while travelling down a main road in the city of Novosibirsk in south-central Russia.","filename":"data/vaneerConsumption/MomentwomanisfilmedKNITTINGwhiledrivinginRussia.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AA821100000578-0-image-a-77_1453991221413.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421048_Look-no-hands-Astonishing-moment-woman-filmed-KNITTING-driving-busy-road_1540255025.html","title":"Moment woman is filmed KNITTING while driving in Russia","title_page":"Moment woman is filmed KNITTING while driving in Russia | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Staying focussed on the road while behind the wheel of a car is very important.\nBut this woman in Russia does not appear to have received the safety memo, if this video is anything to go by.\nCaptured on camera is the unbelievable moment a woman was filmed knitting behind the wheel while travelling down a main road.\nAstonished motorists watched open-mouthed as the lady drove at speeds of up to 30mph while doing crochet\nAstonished motorists in the city of Novosibirsk in south-central Russia watched open-mouthed as the woman drove at speeds of up to 30mph while doing crochet.\nThe footage shows the woman in a Smart car ploughing on through heavy traffic on the dual carriageway.\nThe driver appears to be using both hands to hold the needles and wool while she works on her creation.\nAnd at times she is not even looking at the road ahead as she concentrates on not dropping her equipment.\nDangerous multi-tasking: Despite being distracted the woman keeps up with the bumper-to-bumper traffic\nThe driver appeared to be using both hands to hold the needles and wool while she worked on her creation\nBut despite being distracted the woman keeps up with the bumper-to-bumper traffic.\nThe video was captured on the mobile phone of a fellow motorist, who was driving in a car in the next lane.\nThe clip was posted on Russian social media website Vkontakte, and was used as an example of bizarre driving.\nOne viewer commented: 'What she's doing is so dangerous.'","url":"https://www.dailymail.co.uk/news/article-3421048/Look-no-hands-Astonishing-moment-woman-filmed-KNITTING-driving-busy-road.html"}
