{"authors":[],"date_download":"2018-10-22 22:45:43","date_modify":"2018-10-22 22:45:43","date_publish":"2014-05-12 16:39:29","description":"A report says marketers are ignoring a sizable consumer group with spending power: women without children.","filename":"data/vaneerConsumption/MomsGetMarketingAttentionButWomenWithoutKidsSpendMore.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_20/436686/140512-women-retail-mms-1251_b82ca6bc5729067b97f1fcc5f705ce55.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_moms-get-marketing-attention-women-without-kids-spend-more-n103331_1540248343.html","title":"Moms Get Marketing Attention, But Women Without Kids Spend More","title_page":"Moms Get Marketing Attention, But Women Without Kids Spend More","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nMadison Avenue is living in the past when it comes to American women’s lives, a new report says.\nIt argues that marketers drop the ball when it comes to one sizable group of consumers: women without kids.\nThe report by public relations firm DeVries Global says non-moms are either painted with unflattering chick-lit stereotypes or ignored entirely, even though they shop at higher-end stores, spend more and have a greater influence on social media.\nIt’s a big group. DeVries cites Census data that shows 47 percent of women in their childbearing years are kid-free. (Census defines \"childbearing\" as beginning at 15, though, and only 5 percent of 15- to 19-year-olds are moms.)\nAmerican women have their first kids at 25, on average. About 29 percent — nearly 12 million — of women between the ages of 25 and 44 are childfree.\nThis overlooked group has been dubbed the “otherhood” by author Melanie Notkin. Notkin wrote the book \"Otherhood: Modern Women Finding A New Kind of Happiness,\" the impetus behind the report.\nThe report says Madison Avenue needs “a new lexicon for talking to the Otherhood, one that doesn’t emphasize marriage and family life as the Holy Grail for women.”\n“Our observations have been … they assume it’s a household and a more traditional family,” said Adrianna G. Bevilaqua, managing director of the creative and strategic services team at DeVries. “Marketing hasn’t caught up to the way people are living today.”","url":"https://www.nbcnews.com/business/consumer/moms-get-marketing-attention-women-without-kids-spend-more-n103331"}
