{"authors":[],"date_download":"2018-10-30 20:03:52","date_modify":"2018-10-30 20:03:52","date_publish":"2017-04-14 14:51:00","description":"A DeKalb County mother is outraged by what she calls excessive force used by school workers against her son.","filename":"data/vaneerConsumption/MomsaysexcessiveforceusedonsonatDeKalbschool.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/04/11/Videos/5394471232001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_video-dekalb-mom_0b4fb28b2e08aff0299b9a9fbde8921a__1540929832.html","title":"Mom says 'excessive force' used on son at DeKalb school","title_page":"VIDEO: Mom says 'excessive force' used on son at DeKalb school","title_rss":"NULL","source_domain":"ajc.com","text":"A DeKalb County mother is outraged by what she calls excessive force used by school workers against her son.\nMarquisha Brown said video shows her 15-year-old son was held down by a school employee last month at Stone Mountain High, according to Channel 2 Action News.\nWhile the boy was held down, a resource officer pepper-sprayed the teen, the mom said.\n“What did he do that y’all were trying to kill him, cause why are y’all choking him?” she said on Channel 2.\nBrown said her son was caught up in the aftermath of a fight between two other boys.\nShe acknowledged that she isn’t personally aware of what happened before the video started rolling, but she said even if her son was the one fighting the force would be excessive.\nDeKalb County Schools released a statement to Channel 2:\n\"The DeKalb County School District is dedicated to protecting the health and safety of its students and staff. The images in the video are troubling. The video also depicts an attempt to conclude a disruption involving multiple students, including some that failed to comply with directives by staff members.\"\nBrown’s son was suspended and charged with simple battery, she said.\nChannel 2 said school district officials wouldn’t comment on whether the employees were disciplined because of policy against speaking on personnel matters.\nLike DeKalb County News Now on Facebook | Follow on Twitter and Instagram","url":"https://www.ajc.com/news/local/video-dekalb-mom-says-school-workers-used-excessive-force-son/4JApXeO70VimxdUJhb4e2O/"}
