{"authors":["Paddy Dinham For Mailonline"],"date_download":"2018-10-22 23:59:47","date_modify":"2018-10-22 23:59:47","date_publish":"2017-03-16 08:43:15","description":"The plane, which was destined for Malaga, had to turn around just before it was airborne when the fault was spotted. A passenger said it was 'scary' adding she was 'feeling lucky'.","filename":"data/vaneerConsumption/MonarchflightfromBirminghamtoMalagaabortstakeoff.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/08/252AE03F00000578-0-image-a-6_1489654002440.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319292_Monarch-flight-Birmingham-Malaga-aborts-off_1540252787.html","title":"Monarch flight from Birmingham to Malaga aborts take-off","title_page":"Monarch flight from Birmingham to Malaga aborts take-off | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A Monarch Airlines flight from Birmingham Airport had to abort take-off at the last minute because one of its engines overheated.\nThe plane, which was destined for Malaga, had to turn around just before it was airborne when the fault was spotted.\nA passenger said the aborted landing was 'scary' adding she was 'feeling lucky'.\nThe plane, which was destined for Malaga, had to turn around just before it was airborne when the fault was spotted (file image)\nPassengers all debarked safely and have been put on another flight, believed to depart later this morning.\nOne traveller aboard the 7am service to Malaga said a 'deathly silence' fell on the plane.\nIt was thought the engine had overheated.\nClive Shotton, 62, said; 'We were due to leave Birmingham Airport for Malaga at 7am on Thursday.\n'But as the plane began to take off we suddenly came to an emergency stop.\n'Everyone on board was very concerned, and a deathly silence fell.\n'We were told by staff on board that the engine overheated but that it was new and had only been installed on the plane yesterday.\n'We were moved to another aircraft to continue the journey.'\nWest Midlands Fire Service was called but no 999 crews were sent to the scene.\nThe plane had been due to fly from Birmingham Airport (pictured) to Malaga this morning\nIt said the alert was instead dealt with by the airport's in-house fire team.\nPassengers were put on a different aircraft to continue their journey.\nA Monarch spokesman said: 'A spokesman for the airline said: 'Monarch flight ZB970 operating from Birmingham to Malaga today experienced a technical issue during take off at Birmingham Airport.\n'The aircraft returned to stand safely, and all passengers transferred to another aircraft to continue their journey.'","url":"https://www.dailymail.co.uk/news/article-4319292/Monarch-flight-Birmingham-Malaga-aborts-off.html"}
