{"authors":["Glen Williams For Mailonline"],"date_download":"2018-10-23 01:09:14","date_modify":"2018-10-23 01:09:14","date_publish":"2017-04-26 11:12:28","description":"The French outfit, who were drawn against Juventus in the semi-finals of the competition after beating Borussia Dortmund, have been one of the success stories in Europe this year","filename":"data/vaneerConsumption/MonacocanstunJuventusandreachChampionsLeaguefinal.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F739A7800000578-0-image-a-4_1493206181949.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-4447030_Monaco-stun-Juventus-reach-Champions-League-final_1540256954.html","title":"Monaco can stun Juventus and reach Champions League final","title_page":"Monaco can stun Juventus and reach Champions League final | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Monaco defender Kamil Gilk believes his side can 'surprise everyone again' and overcome Juventus to reach the Champions League final.\nThe French outfit, who were drawn against Juventus in the semi-finals, have been one of the success stories in Europe this year. Their heroics against Manchester City and Borussia Dortmund, coupled with their stellar domestic campaign, has made for impressive viewing.\nLeonardo Jardim's side have scored three goals in each of their last four Champions League outings and their attacking potency has been a trademark of their play. And Glik believes if their form in front of goal continues in such a rich vein then the Serie A giants will get a nasty shock next month.\nKamil Glik (right) believes Monaco can shock Juventus to reach the Champions League final\nMonaco's thrilling campaign saw them overcome Manchester City and Borussia Dortmund\n'It will not be easy but there's no pressure on us,' he told Tuttosport.\n'I think every team was hoping to draw Monaco, but look how far we've come. I believe we can get to the final. We'll try to surprise everyone again.'\nMonaco are level on points with Paris Saint-Germain at the top of Ligue 1 but with a game in hand over their nearest rivals. They have been propelled to the top of the league, and the final four of Champions League, courtesy of the scintillating form shown by strike partners Radamel Falcao and Kylian Mbappe.\nFalcao, a seasoned campaigner at 31 years of age, has scored 25 goals in all competitions while Mbappe, one of Europe's hottest young prospects, has contributed 21 goals during an incredible breakthrough season.\nAnd Glik believes they can 'surprise everyone again' by beating Juventus in the semi-final\nBut when the Italians make the trip to the French principality they will bring their own potent combination of young and old.\nGilk will be tasked with keeping Gonzalo Higuain and Paulo Dybala quiet - an assignment which will play a huge role in deciding who reaches the Principality Stadium in Cardiff on June 3.\n'Dybala and Higuain are very important and we will try to contain them,' he concluded.\nJuventus travel to Stade Louis II on May 3 before Monaco make the return trip to Turin on May 9.","url":"https://www.dailymail.co.uk/sport/football/article-4447030/Monaco-stun-Juventus-reach-Champions-League-final.html"}
