{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-31 00:10:20","date_modify":"2018-10-31 00:10:20","date_publish":"2015-11-18 08:00:00","description":"The California Teachers Association, one of Sacramento’s most powerful interests, is heading into an extraordinary year with decisions on the ballot, in","filename":"data/vaneerConsumption/Moneyandcloutonthelineforteachersunionin2016.json","image_url":"https://calmatters.org/wp-content/uploads/classroom.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540944620.html","title":"Money and clout on the line for teachers union in 2016","title_page":"Money and clout on the line for teachers union in 2016 | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"The California Teachers Association, one of Sacramento’s most powerful interests, is heading into an extraordinary year with decisions on the ballot, in the Capitol and in the courts holding the potential to impact its clout for many years to come.\nBillions of dollars for schools will likely be at stake on the 2016 ballot as well as pivotal campaigns for state Legislature and a question about union pensions. Meanwhile, the Capitol is expecting a robust debate about how schools are evaluated and courts will hear two lawsuits challenging the teachers union.\n“It’s a big year for education in California. To the extent we’re part of that, it’s a big year for us,” said union president Eric Heins.\nCTA has become a force in Sacramento by pouring millions into influencing ballot measures and electing lawmakers, then millions more lobbying legislators after they take office. The union’s formidable political operation — spending about $200 million on campaigns and lobbying in the last 15 years — is funded by roughly 300,000 classroom teachers who pay approximately $1,000 each in annual union dues.\nRecently, the U.S. Supreme Court decided it will hear a case next year, known as Friedrichs, that challenges the union’s financial muscle. In California, the union is appealing a ruling in another case, called Vergara, that says union rules prevent disadvantaged students from getting a proper education.\nThe case that aims at union influence challenges CTA’s requirement that all teachers pay union dues. Today, about 29,000 California teachers have opted to pay less than the full dues in order to avoid a contribution to the union’s political activity. If the lawsuit is upheld, union dues could be voluntary.\nA ruling against CTA at the U.S. Supreme Court could weaken all public employee unions because many workers will stop paying dues, according to an analysis by the Economic Policy Institute. That would strike a significant blow to CTA, said Jessica Levinson, a professor of political law at Loyola Law School.\n“The thing that makes unions powerful is the vast sums of money they can use to exert political influence,” Levinson said, so any reduction in funds “is going to be a loss to their power.”\nThe lawsuit about union rules argues that teacher tenure and dismissal policies deprive children of an adequate education by keeping ineffective teachers in place, especially at schools that serve the neediest students. The union lost the case in the Superior Court but it appealed with the backing of Gov. Jerry Brown, Attorney General Kamala Harris and state School Superintendent Tom Torlakson.\n“Those lawsuits are political attacks on us,” Heins said. “They’re funded by people who don’t like unions. They haven’t been able to get their way through the Legislature or the ballot box, so now they’re trying the courts.”\nIn addition to the court challenges, teachers are gearing up for a heavy campaign season in 2016.\nBillions of dollars for schools will likely be up for a vote in the form of a school construction bond and a tax measure. CTA has not yet taken a position on a $9 billion school bond that has qualified for the November ballot. But the union is working on an initiative to stop the scheduled expiration of some temporary taxes that voters approved in 2012 with Proposition 30. Various proposals are in the works to raise at least $5 billion a year by extending some of those taxes.\nTeachers are likely to fight another ballot measure that seeks to reduce the state’s pension debt by adding restrictions for all future public employees.\nBeyond the ballot measures, next year’s election could also spawn big fights between labor and business over legislative candidates, with teachers working at odds against groups that want to change education.\nNext year will be the last election for several years with a significant number of open legislative seats. For groups that spend big on politics, it’s an opportunity to shape the Legislature in a way that won’t be possible for years to come. After the 2016 election, there will not be any open seats in the Assembly until 2024, unless an office is vacated.\n“The open seats are that much more important given how long of a dry spell there will be before another large cohort in the Assembly,” said Bill Lucia, president of EdVoice, an education advocacy group that is frequently at political odds with CTA.\nIn the Capitol, the teachers union will also be involved in a major policy decision about how the state will evaluate school performance. The state has suspended the previous measure and with a new Common Core curriculum being put in place, the state Board of Education is preparing a new method for holding schools accountable.\nDemocratic political consultant Andrew Acosta said that though CTA faces significant battles next year, it’s accustomed to big fights. In 2005, for example, CTA and other unions defeated four ballot measures backed by then-Gov. Arnold Schwarzenegger, including one to change teacher tenure rules and another to curb political spending by unions.\n“When they go to war, they go to war,” Acosta said. “They don’t go half way in.”\nCorrection: An earlier version of this story inaccurately said the California Teachers Association had lost an early decision in the case that challenges its mandatory union dues. The union won the Friedrichs case at the lower levels, and plaintiffs are appealing to the U.S. Supreme Court.","url":"https://calmatters.org/articles/money-and-clout-on-the-line-for-teachers-union-in-2016/"}
