{"authors":["Sylvia Longmire"],"date_download":"2018-10-30 19:31:59","date_modify":"2018-10-30 19:31:59","date_publish":"2015-12-14 15:10:41","description":"The drug trafficking ties between Colombia and Mexico go back decades, to when Colombian cartels started supplying Mexican drug runners with cocaine in the late 1970s.","filename":"data/vaneerConsumption/MoneyLaunderingNetworkBetweenColombianandMexicanCartelsDisrupted.json","image_url":"https://media.breitbart.com/media/2015/12/FBI-File-Photo-Cash.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2015_12_14__1540927919.html","title":"Money Laundering Network Between Colombian and Mexican Cartels Disrupted","title_page":"Money Laundering Network Between Colombian and Mexican Cartels Disrupted","title_rss":"NULL","source_domain":"breitbart.com","text":"The drug trafficking ties between Colombia and Mexico go back decades, to when Colombian cartels started supplying Mexican drug runners with cocaine in the late 1970s. Those ties have since strengthened, and the recent discovery of a money laundering network between the two countries’ more powerful cartels is evidence of this.\nAccording to the Mexican magazine Proceso, on December 10, elements of Colombia’s investigative police (DIJIN) and Interpol arrested seven family members in the city of Cali for laundering over $454,000 in drug payments between the Sinaloa and Urabeños cartels.\nAccording to Pablo Ruiz, head of the DIJIN’s special crimes unit, the seven belonged to a laundering network that also operated in Houston, Texas and Guadalajara, Mexico, reported El Espectador. From these cities the money would be transferred in smaller sums, using a technique known as “smurfing,” to exchange houses in the Colombian cities of Cali and Buenaventura. This method is intended to camouflage the flow of money so as to avoid raising suspicion.\nIn those Colombian cities, the family members paid others to use their bank accounts for the smurfing process. Usually the individuals being paid lived in poorer neighborhoods, making them easy targets and more willing to accept what were likely handsome commissions for their acquiescence. Once in Colombia, the funds would be funneled into bank accounts to buy assets and other goods.\nAccording to InSightCrime.org, criminal organizations involved in money laundering are scaling down their operations to avoid detection, largely as a result of more scrutiny being paid to larger financial transactions. In Colombia, where profits from money laundering are estimated to account for two percent of the national GDP, over 140 different money laundering techniques have been identified, many of which, such as “smurfing,” are extremely difficult to detect, reported the website.\nSylvia Longmire is a border security expert and Contributing Editor for Breitbart Texas. You can read more about cross-border issues in her latest book, Border Insecurity: Why Big Money, Fences, and Drones Aren’t Making Us Safer.","url":"https://www.breitbart.com/border/2015/12/14/money-laundering-network-colombian-mexican-cartels-disrupted/"}
