{"authors":[],"date_download":"2018-10-30 00:51:07","date_modify":"2018-10-30 00:51:07","date_publish":"2018-08-16 00:05:21","description":null,"filename":"data/vaneerConsumption/MoneyforNothingandtheRentsforFree.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/1024px-PCH_Santa_Monica_-_panoramio_1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860667.html","title":"Money for Nothing and the Rent’s for Free","title_page":"Money for Nothing and the Rent’s for FreeThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"Sacramento\nAfter debating rent control in Santa Monica on Monday with a leader of a liberal community group, I was left thinking about a great quotation from a famous left-wing Californian, author Upton Sinclair: “It is difficult to get a man to understand something, when his salary depends on his not understanding it.” In this case, Santa Monica residents’ controlled rent depends on their not knowing the first thing about how economies work.\nSinclair ran for governor in 1934 on the End Poverty In California (EPIC) platform. In the ensuing years, California progressives have grabbed control over every lever of power in the state. Lo and behold, poverty wasn’t ended. In fact, California has the highest poverty rate in the nation, when the Census Bureau takes cost of living into account.\nLiberal activists think they’re helping the poor, but if Proposition 10 passes in November, then those poverty rates will spread across the state as more municipalities embrace extreme forms of rent control. Recent reports suggest that Santa Monica, which has some of the toughest rent controls in the nation, also has the highest rents in the nation. Median home prices there have topped $1.7 million. Hey, how has rent control been working there so far?\nThe basics are pretty obvious to readers of this magazine. You get less of whatever the government punishes, and rent control punishes people who provide rental housing. It turns every proposed rent increase into a political battle. Rent control boards and bureaucrats decide what private property owners can charge their customers. So people get out of the business — or invest mainly in high-end luxury apartments and condos. There’s no money to be made renting affordable units to people who are likely to squat there until your dying day.\nRent control stops new apartment construction. It encourages current owners to turn their properties into condominiums or vacation rentals. I’m a landlord, and if the cities where I have homes embrace rent control, then I will immediately sell the properties to people who will occupy them. That means rental properties come off of the market. People have to live somewhere, so rent control has the side effect of driving up the cost of single-family homes. California already is underbuilding about 100,000 units a year, and rent control makes that situation worse.\nAnd, of course, landlords are not about to renovate their properties if they wish their rent-controlled tenants would get out of there anyway. So buildings deteriorate. Tenants take their landlords to court to force them to make basic improvements. It also stops turnover. Many people get really cheap rents, so they don’t leave. In rent-controlled buildings, renters often own homes elsewhere and drive fancy cars — but they aren’t going to give up cheap rent near the beach. It creates the “frozen city,” where people don’t ever move. There are stories of rich movie stars living for peanuts in someone’s else’s building.\nI don’t expect progressives to care about little things such as theft of property, which is really what rent control is all about. But do they really want the kind of black markets seen in socialist countries? It’s tough to get into one of these controlled markets. So apartments get passed along to next of kin or friends. Desperate renters offer under-the-table payoffs to landlords. Renters illicitly sublet the apartments if they move, thus the renter gets all of the value from the investment and sweat equity provided by others.\nMy opponent talked about the need to help the poor and minorities. But poorer people tend to be newcomers. The folks who’ve lived in rent-controlled apartments for years tend to be wealthier. It makes it nearly impossible for lower-income people to get onto the first step of the housing ladder. And because many people are enjoying their discounted rent, they never get out in the open market and buy a property. They miss the chance to build equity and wealth. As an aside, Venezuela has had strict rent controls since 1960, which has led to the creation of shanty towns. People have to live somewhere.\nI asked one man at the event what he did for a living. He designs websites. I asked what he would do if the government forced him to build me a website at half the cost of what the market rate would be. Well, he wouldn’t build it for me. Bingo.\nSpecifically, Prop. 10 would eliminate the 1995 Costa-Hawkins Act, which forbade rent controls on newer buildings, single family residences, and condos. It also stopped vacancy controls, whereby cities stop landlords from raising rents to market rates once the units are vacant. My debating adversary argued that imposing such controls would be one of the solutions to Santa Monica’s housing crisis. I’m sure city leaders would push such a thing.\nIn fact, Costa-Hawkins passed as a means to put the brakes on some of these crazier cities. If landlords can’t raise rents after a tenant leaves, then most of them will never put them back on the market. There’s a reason that thousands of San Francisco apartments are vacant. Landlords aren’t about to lock in new tenants already given that city’s tenant laws make it virtually impossible to ever evict them. Imagine what will happen when they can’t raise rents at all (or beyond what the board tells them).\nProp. 10 doesn’t impose rent control on the state, but allows municipalities to adopt any manner of control that strikes their fancy. Coastal cities will go further down that road and less-costly inland cities will probably do nothing. That will exacerbate the housing crisis as people will have even more reason to flee these cities and move to more affordable markets. More controls will increase that exodus, which drives up rental costs in those lower-priced areas.\nThe rent-control advocates assure us that their plan only enhances local control. Well, local control is good when it comes to the provision of public services. But we don’t want local officials deciding what we pay for goods and services. I can’t imagine any locally elected official, especially in places such as the People’s Republic of Santa Monica, campaigning on a platform of letting rents return to market rates. It will be far more likely for them to declare that “the rent is too damn high” — and to promise ever-tougher rules to protect people.\nI was asked whether landlords ever do unscrupulous things. Of course they do. So do tenants, by the way. But there’s nothing like a free market to weed out the bad actors. Indeed, rent controls push smaller landlords out of the business and help assure that only the big, dreaded corporate players or the most bare-knuckled business people stay in the game. These rent-controllers will only get more of what they decry: bad landlords, crumbling properties, astonishingly high rents, and scarcity.\nThe history of rent control bears out these results in every city where they’ve been tried. But my arguments fell on deaf ears. People living in rent-control apartments love their below-market rents. So there’s no convincing them otherwise. The question — and the answer will say much about the future of this state — is whether enough voters outside these progressive havens can understand the basics of supply and demand.\nSteven Greenhut is Western region director for the R Street Institute. Write to him at sgreenhut@rstreet.org.","url":"https://spectator.org/money-for-nothing-and-the-rents-for-free/"}
