{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:49:09","date_modify":"2018-10-30 22:49:09","date_publish":"2016-06-15 08:00:00","description":"Some of the outsized money spent on California legislative races this year came pouring through the mail slot of voter Michael Johnson’s home, arriving in","filename":"data/vaneerConsumption/Moneyrainsfromperfectstormofpolitics.json","image_url":"https://calmatters.org/wp-content/uploads/bomb-2-e1516147574620.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939749.html","title":"Money rains from perfect storm of politics","title_page":"Money rains from perfect storm of politics | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Some of the outsized money spent on California legislative races this year came pouring through the mail slot of voter Michael Johnson’s home, arriving in the form of two or three glossy ads a day in advance of the June primary.\nMost of the ads weren’t from candidates. They were from interest groups that have business before the Legislature, running their own campaigns to elect a favored Assembly contender.\n“Literally this felt like an election not between these candidates but between these special interests,” said Johnson, a former health insurance director who lives in Hollywood. “I can only imagine the kind of spending that we’re going to see now in the general election.”\nIt will be huge.\nInterest groups have more at stake this year than usual, and they are spending accordingly. Due to term limits that now allow lawmakers to hold their posts longer, this is the last year until 2024 that a batch of Assembly members will be forced out by term limits. Fourteen of 80 members cannot seek re-election this year, so those contests have no incumbents. But over the next three elections, there will be no vacancies created by term limits.\nThe situation is different in the state Senate, where there will likely be only a handful of open seats in the next election. Still, races this year are critical for groups that want to tilt the politics of the Democrat-dominated Legislature.\nLawmakers may stay in office for 12 years – up from six in the Assembly and eight in the Senate – under a law passed by voters in 2012. Other changes in California’s political rules over the past two decades created the open primary, in which the top two finishers advance to November regardless of party affiliation, and capped the amount of money that can be donated directly to candidates.\nThe rules combined to prompt an enormous infusion of independent money in legislative races this year, funding advertising campaigns not controlled by candidates. The outcome in November could be a Legislature with a larger bloc of Democrats who are friendly to business interests and less bound to traditional Democratic allies.\nIt’s a frustration to those on the left, such as labor unions and environmentalists, who dominated Democratic politics under the old rules.\n“Some of these candidates these business groups are supporting are not moderate candidates,” said Steve Smith, spokesman for the California Labor Federation. “They are simply candidates that will be beholden to business interests when they get into office.”\nUnions and environmental groups paid for campaigns supporting some liberal Democrats this year. They scored a key victory in a Malibu-area Senate district where Henry Stern, a Democrat with a strong environmental record, ousted a business-backed Democrat and will face Republican Steve Fazio in November.\nBusiness interests supported a few Republicans in parts of the state where the GOP is strong. But by far, most of the independent spending in the primary was by business groups and education activists backing Democrats they believe will align with their interests. Altogether, oil companies, real estate agents, charter school advocates and other groups poured nearly $29 million into independent expenditures.\nBig money in legislative races\nThe heavy advertising caught some candidates by surprise.\n“You create a campaign plan and a voter outreach strategy, and then all of a sudden these things start happening that are totally outside of your control,” said Marc Berman, a Democrat running for a Palo Alto-area Assembly seat who benefited from $1.2 million in independent spending, largely by real estate and education groups.\n“I would open my mailbox and there would be two or three – or one day, four – pieces of mail with my face on it.”\nThough he was confronted by voters angry about all the mail, “the outside help definitely increased my name I.D.,” Berman said.\nLike most who were helped by such spending, Berman is advancing to the general election, in which he will face another Democrat, Vicki Veenker. In eight of the 10 primary races that featured $1 million or more in independent expenditures, two Democrats advanced to the general election.\nThat sets up expensive fights between business and labor interests. It also marks success for advocates of the open primary system, who believe business-friendly Democrats will prevail over more liberal party members in contests without a Republican on the ballot.\n“The open primary isn’t about putting a Democrat against a Republican. It’s about putting a moderate Dem against a liberal Dem,” said David Townsend, a Democratic political consultant who championed the switch to the “top two” primary.\nHe runs a PAC funded by corporations such as Chevron and Walmart that supports business-friendly Democrats. His group worked with other business-backed PACs this year to boost a crop of moderate Democrats who could bring the Legislature closer to the political center.\n“The big-money special interests have figured out the ‘top two’ a lot better than the rest of us have, and it’s paying off,” said labor-friendly Democratic political consultant Steve Maviglio, who campaigned against the open primary when it was on the statewide ballot.\n“Over the long term, that’s going to yield tremendous results.”","url":"https://calmatters.org/articles/money-rains-from-perfect-storm-of-politics/"}
