{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-31 00:24:39","date_modify":"2018-10-31 00:24:39","date_publish":"2016-12-02 00:00:00","description":"The Italian startup has a new chief investment officer and chief financial officer.","filename":"data/vaneerConsumption/MoneyFarmgetsnewCIOfromPIMCOandCFOCabotSquare.json","image_url":"https://amp.businessinsider.com/images/58411bf5dd08953f448b47e5-640-320.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_moneyfarm-gets-new-cio-from-pimco-and-cfo-cabot-square-2016-11_1540945479.html","title":"MoneyFarm gets new CIO from PIMCO and CFO Cabot Square","title_page":"    MoneyFarm gets new CIO from PIMCO and CFO Cabot Square - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"MoneyFarm's new CIO Richard Flax, left, and new CFO Paolo Savini Nicci. MoneyFarm Online wealth manager MoneyFarm has named two new senior executives drawn from investment manager PIMCO and private equity fund Cabot Square Capital.\nRichard Flax is joining the startup as chief investment officer. He joins from $1.5 trillion investment manager PIMCO, where he was a portfolio manager. He held the same role at Goldman Sachs prior to working at PIMCO.\nPaolo Savini Nicci is also joining MoneyFarm as the company's CFO. Savini Nicci is a veteran of Cabot Square Capital, a private equity fund that has invested in MoneyFarm, and most recently led a turnaround of a Cabot Square portfolio company.\nSavini Nicci told Business Insider: \"What has been delivered [at MoneyFarm] until now has been extremely interesting. That is what brought me here. I've known the team for quite a while, since my Cabot Square Capital days.\"\nMoneyFarm, founded in Milan in 2011, gives people access to low-cost wealth management services online. It is one of a number of so-called \"robo advisors\" — digital services to help people invest and manage their money.\nThe company launched in the UK at the start of the year and both Savini Nicci and Flax will be based in MoneyFarm's London office.\nFlax told Business Insider: \"The value proposition that MoneyFarm offers is a very compelling one for the consumer.\"\nHe adds he was enticed to leave financial giant PIMCO to join a startup by \"the opportunity to come into something at a relatively early stage and hopefully make a real positive contribution.\"\nHe adds: \"There's an underlying thesis here which is that advances in technology will allow relatively small businesses, in terms of numbers of people and infrastructure, to actually compete very well with much larger and established organisations.\"\nCustomers have grown by 60% so far this year, according to the company. MoneyFarm currently has 80,000 customers but does not disclose assets under management.\nRespected business columnist Anthony Hilton wrote in a recent piece for the Evening Standard that: \"Some hard-bitten investment professionals have serious doubts about whether the business model for robo-advisers actually makes sense.\"\nHe pointed to portfolio manager Alan Miller, who argued in blog posts earlier this year that startups would have to spend too much money on customer acquisition to ever really make much money. This margin mean it takes years to recoup the amount spent on actually getting customers to invest.\nSavini Nicci says: \"Intellectually, it is an argument. We obviously have a different view. We underwrite clients profitably right now so the relationship between customer acquisition and lifetime value is already positive to this day.\n\"Secondly, in a world in which interest rates are so low and market volatility is substantially higher than it was in the past, a digital wealth management proposition with low cost products becomes significantly more attractive to the customer.\"\nFlax adds: \"When you think about the size of the overall investment market, that's obviously very big. There's a big opportunity, a big space, and there's a lot of different solutions that exist. I don't think the market is going to go into any one single direction.\"\nMoneyFarm has raised over $30 million to date, with German insurer Allianz recently taking an undisclosed stake in the business.","url":"https://www.businessinsider.com/moneyfarm-gets-new-cio-from-pimco-and-cfo-cabot-square-2016-11"}
