{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 22:48:38","date_modify":"2018-10-30 22:48:38","date_publish":"2015-11-03 08:00:00","description":"In a hotel ballroom blocks from the state Capitol, nearly three dozen wanna-be legislators gathered recently to learn the ways of Sacramento. They were","filename":"data/vaneerConsumption/Moneytalkscandidateslisten.json","image_url":"https://calmatters.org/wp-content/uploads/capitolsideview_medium.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939718.html","title":"Money talks, candidates listen","title_page":"Money talks, candidates listen | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"In a hotel ballroom blocks from the state Capitol, nearly three dozen wanna-be legislators gathered recently to learn the ways of Sacramento.\nThey were members of city councils and school boards up and down California, ranchers and attorneys, Republicans and Democrats, moms and dads – all candidates for the Legislature who’d signed up for this crash course in how things really work.\nHigh on the agenda: money.\n“If you simply take the time and the courtesy to have a conversation with us, and figure out where we agree and where we don’t agree, you might avoid a multimillion dollar I.E. (campaign) against you,” Carlos Marquez, political director of the California Charter Schools Association, said to the roomful of candidates.\n“I think that goes for a lot of the folks here,” he said, gesturing across the panel leading a session called, “How to ace a PAC interview.”\nTheir talk about “I.E.” – it stands for “independent expenditures” – was the insider way of saying: It’s not just you against your opponent. We can be a major player in your race by communicating to voters about you – good or bad.\nState law caps the amount donors can give to a candidate. But donors can spend unlimited sums to support or oppose a candidate by giving to an independent expenditure committee. And just as the “super PAC” has become a growing force in presidential races, these limitless campaigns paid for by interest groups in Sacramento are taking on a larger role in legislative races.\nCampaigns run by candidates for state Senate and Assembly last year raised $157.5 million – a record-setting sum and a 14 percent increase from the prior election. But the money spent by independent expenditure committees increased at a far steeper clip. Spending by independent committees affecting legislative races was up by 37 percent last year, according to calculations by MapLight, which studies money in politics. Those groups – an assortment of labor unions, corporations and professional associations – spent more than $53 million.\nPut another way: Independent expenditures now make up one-fourth of all the money in legislative races in California – up from 7 percent in 2002. And in competitive races where the independent groups are most active, their campaigns sometimes outspend the candidates themselves.\n“Conventional wisdom is that the candidates are running their show,” said Mike Madrid, a Republican political consultant who helped create the nonprofit Leadership California Institute that put on the candidate training in Sacramento.\n“What this tells them is that with the system we’ve got, that’s really not always the case. Very often, because there is so much money moving around the campaigns (in the form of) independent expenditures, the candidate is the least in control.”\nSen. Ben Allen, a Democrat from Santa Monica, got a taste of that when he ran for state Senate last year in a race that attracted $2.7 million in independent expenditures. Business groups that wanted him to win sent voters a mailer slamming his opponent. Allen had no input, and it wasn’t the kind of campaign he intended.\n“I was committed to running a positive campaign, so anything that deviated from that positive message, I found problematic,” he said.\nAssemblyman David Chiu (D-San Francisco) said he routinely encountered voters who didn’t know which ads came from him and which ones were from outside groups as he campaigned last year in a race that drew $1.8 million in independent expenditures.\n“Campaigns are full of distractions and there is no doubt that outside spending adds to the fog of a race,” Chiu said.\nLast month, Gov. Jerry Brown signed a bill that’s meant to add some clarity. It was carried by Assemblywoman Susan Bonilla (D-Concord), who ran unsuccessfully for Senate in a race earlier this year that saw $9.6 million in independent expenditures. Her Assembly Bill 990 — which went into effect as soon as Brown signed it — requires larger, bolder disclosures on campaign mail sent by independent groups, stating that the advertisement doesn’t come from a candidate.\nEven so, the money in an independent campaign is hard to track. Typically several donors put money into a committee that then doles it out to help or hurt various candidates. But the money can pass through multiple committees before it’s spent, making it harder to discern the path of influence.\n“The accountability behind that is much less,” said Jessica Levinson, a professor of election law at Loyola Law School. “We have candidate campaigns and then we have these shadow campaigns.”\nThe funders of those campaigns were frank as they addressed the candidates gathered in the hotel ballroom. The panel included representatives of big-money interests across the political spectrum: doctors, Realtors and labor unions.\nAlma Hernandez, political director for the Service Employees International Union, drew nervous laughter when she told the room she loves reviewing “hit pieces.”\n“Sometimes it’s a big win to keep SEIU out of your district,” she said.\nThe message wasn’t lost on Rajiv Dalal, a Democrat from La Canada Flintridge who is running for Assembly next year.\n“None of us want to see outside money because we are all working really hard in the district to raise money and run great campaigns,” he said. “But they have their interests to protect in Sacramento and that was their tutorial on how they play.”","url":"https://calmatters.org/articles/money-talks-candidates-listen/"}
