{"authors":["Colin Dwyer"],"date_download":"2018-10-22 21:42:46","date_modify":"2018-10-22 21:42:46","date_publish":"2018-08-16 00:00:00","description":"The heavy rains hitting the popular tourist destination of Kerala have loosed deadly floods and landslides. \"Never before had the State witnessed a calamity of this scale,\" says a local leader.","filename":"data/vaneerConsumption/MonsoonHammersIndiaWithUnprecedentedFloodHavocKillingScoresOfPeople.json","image_url":"https://media.npr.org/assets/img/2018/08/16/gettyimages-1017450350_wide-ace1550aa664c3cd6777146df87488e13a829a73.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_08_16_639224478_monsoon-hammers-india-with-unprecedented-flood-havoc-killing-scores-of-people_1540244566.html","title":"Monsoon Hammers India With 'Unprecedented Flood Havoc,' Killing Scores Of People","title_page":"Monsoon Hammers India With 'Unprecedented Flood Havoc,' Killing Scores Of People : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Monsoon Hammers India With 'Unprecedented Flood Havoc,' Killing Scores Of People\nEnlarge this image toggle caption AFP/Getty Images AFP/Getty Images\nMonsoon rains are lashing southern India, where water has overrun riverbanks, submerged city buildings and left a death toll of dozens of people. The chief minister of Kerala, the state hit hardest by the storms, has described the situation as \"an unprecedented flood havoc.\"\n\"The calamity has caused immeasurable misery and devastation. Many lives were lost. Hundreds of homes were totally destroyed and many more were damaged,\" Chief Minister Sri Pinarayi Vijayan said in his plea for public donations. \"Never before had the State witnessed a calamity of this scale.\"\nOfficials there, including Vijayan, are calling the situation \"the worst monsoon disaster since 1924,\" when India recorded the highest rainfall totals in its history.\nCiting an official at the chief minister's office, Reuters reports that at least 79 people have died in floods in the past week. Local media put the death toll even higher, as many as 114 people, and say that at least 30 people died Thursday alone.\nThat brings the total toll to at least 265 monsoon-related deaths in Kerala state — a destination so popular with tourists, it's earned the moniker \"God's own country\" — since the skies above it opened up in late May.\nSome 85,000 people have been displaced and dozens are missing in the midst of the disasters caused by the monsoon — from landslides and falling debris to flooding and bridge collapses.\nKerala's Cochin International Airport, one of the country's busiest, has suspended operations, citing the \"heavy inflow of water consequent to [the] opening of dams.\"\nAuthorities have opened nearly all of the dams in the state — a desperate gambit meant to ease the pressure the rainfall has exerted on their structures, but that has further flooded low-lying areas nearby and left residents stranded on the small pockets of dry land they can find.\nEnlarge this image toggle caption AFP/Getty Images AFP/Getty Images\nOne resident of the city of Cochin told the BBC about her own narrow escape, after her friends woke her to warn her of the rising floodwaters.\n\"I opened the door and water gushed in,\" Krishna Jayan said. \"When we stepped into the street, we were neck-deep in water.\"\nPrime Minister Narendra Modi, who will be visiting the besieged region, also announced Thursday that he has asked India's defense ministry \"to further step up the rescue and relief operations across the state.\" As NPR's Lauren Frayer notes, this means soldiers, military vehicles and a statewide red alert, India's highest such warning.\nNearly two dozen more helicopters and some 200 more boats will join the rescue efforts by Friday.\nBut rescue workers aren't likely to have an easy time of it. The India Meteorological Department is forecasting \"extremely heavy [rain]falls\" over the state in the coming days, as well.","url":"https://www.npr.org/2018/08/16/639224478/monsoon-hammers-india-with-unprecedented-flood-havoc-killing-scores-of-people"}
