{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:00:43","date_modify":"2018-10-30 20:00:43","date_publish":"2015-02-10 05:18:42","description":"On February 9, the Montana House passed HB 203 which blocks any future federal ban on semi-automatic firearms or the magazines they use.","filename":"data/vaneerConsumption/MontanaHousePassesBilltoBlockFedsSemiAutoGunMagBan.json","image_url":"https://media.breitbart.com/media/2015/02/woman-semi-automatic-gun-range-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_09__1540929643.html","title":"Montana House Passes Bill to Block Fed's Semi-Auto Gun/Mag Ban","title_page":"Montana House Passes Bill to Block Fed's Semi-Auto Gun/Mag Ban | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On February 9, the Montana House passed HB 203 which blocks any future federal ban on semi-automatic firearms or the magazines they use.\nBreitbart News previously reported that state representative Art Wittich (R-Bozeman) sponsored the bill, and that other Montana lawmakers heard testimony on the measure on January 27.\nHB 203 is titled the “Montana Federal Semiautomatic Firearm and Large Capacity Magazine Enforcement Prohibition Act.”\nIt prohibits the state or an agent of the state “from enforcing, assisting in the enforcement of, or otherwise cooperating in the enforcement of a federal ban on firearms or magazines and [also prohibits the state or an agent thereof] from participating in any federal enforcement action implementing a federal ban.”\nHB 203 passed the Montana House by a vote of 58-42.\nThe Tenth Amendment Center reports that the bill “will now go to the Senate, where it will first be assigned to a committee for approval before the Senate has an opportunity to send it to the Governor’s desk.”\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/02/09/montana-house-passes-bill-to-block-feds-semi-auto-gunmag-ban/"}
