{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:00:46","date_modify":"2018-10-30 20:00:46","date_publish":"2015-01-28 03:17:32","description":"Rep. Art Wittich's (R-Bozeman) House Bill 203 prohibits the state from enforcing federal bans \"on semiautomatic weapons or large magazines.\"","filename":"data/vaneerConsumption/MontanaLawmakersConsiderBillBlockingFedsSemiAutoGunMagBan.json","image_url":"https://media.breitbart.com/media/2015/01/AR-15-semiautomatic-rifle-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_27__1540929646.html","title":"Montana Lawmakers Consider Bill Blocking Fed's Semi-Auto Gun/Mag Ban","title_page":"Montana Lawmakers Consider Bill Blocking Fed's Semi-Auto Gun/Mag Ban | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On January 27, Montana lawmakers heard testimony on Representative Art Wittich’s (R-Bozeman) House Bill 203, which prohibits the state from enforcing any federal ban “on semiautomatic weapons or large magazines.”\nHB 203 is titled the “Montana Federal Semiautomatic Firearm and Large Magazine Enforcement Prohibition Act.”\nAccording to ShallNot.org, the act would “prohibit the state from enforcing, assisting in the enforcement of or otherwise cooperating in the enforcement of a federal ban on semiautomatic weapons or large capacity magazines.”\nThis is nullification, whereby a state rejects the enforcement of a law or laws within its borders after being convinced said law/laws violate(s) the federal government’s constitutional authority.\nRep. Wittich said: “Citizens are increasingly realizing that the federal government is inventing ‘authority’ over their rights, including [the rights] under the 2nd Amendment. States are similarly realizing they can and must refuse to participate in these improper regulatory expansions.”\nHB 203 has now been referred to Montana’s House Judiciary Committtee.\nFollow AWR Hawkins on Twitter @AWRHawkins Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/01/27/montana-lawmakers-consider-bill-blocking-feds-semi-auto-gunmag-ban/"}
