{"authors":["David Greene"],"date_download":"2018-10-23 00:47:26","date_modify":"2018-10-23 00:47:26","date_publish":"2016-05-06 00:00:00","description":"The state's oil industry had been going gangbusters and then oil prices began to drop. What is it like to live in a place with such extremes, and can the government do anything to stabilize things?","filename":"data/vaneerConsumption/MontanasOilBoomFadesAheadOfThe2016PresidentialElection.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2016_05_06_476994003_montanas-oil-boom-fades-ahead-of-the-2016-presidential-election_1540255646.html","title":"Montana's Oil Boom Fades Ahead Of The 2016 Presidential Election","title_page":"Montana's Oil Boom Fades Ahead Of The 2016 Presidential Election : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Montana's Oil Boom Fades Ahead Of The 2016 Presidential Election\nThe state's oil industry had been going gangbusters and then oil prices began to drop. What is it like to live in a place with such extremes, and can the government do anything to stabilize things?\nDAVID GREENE, HOST:\nSo I am here on the other side of country, in Montana, getting the view from Montana this election year. And we drove the other day to the Northeast corner of the state where suddenly the bare, pale landscape is dotted with these grasshoppers, these machines with metal arms drilling into the ground for oil.\n(SOUNDBITE OF TRAIN)\nGREENE: And trains are going by, carrying oil. It's really been boom times in this part of Montana for a while. But now there's a fear of a bust with oil prices so low. And so what's it like to live in a place with such extremes and how, if at all, can the government help stabilize things? We talked about this in one of the communities in the middle of this area, Fairview. The only judge in town is a guy named Ray Trumpower. That's right. His name is Trumpower.\nRAY TRUMPOWER: It's an odd name. There's not many of us around.\nGREENE: You know, you drive with your mom or dad and you think that's stressful if they're in the passenger's seat. Try a judge.\nTRUMPOWER: You go up and follow the curb. Now stop at the stop sign (laughter).\nGREENE: You know, the interesting thing about a judge, he can tell when the oil business is booming and when it's not by the crimes he's dealing with.\nTRUMPOWER: When there was a boom here, it was DUIs. It was getting paid, going drinking. Then it progressed into drugs. Now we get partner family member assaults. There's no money. You're not working hard enough. They're whooping up on each other.\nGREENE: Now, a bust in this part of Montana would mean a loss of jobs. That's already happening. Less money being spent at businesses. People moving out. And so in place with such volatility, where do people seem to be turning?\nTRUMPOWER: Trump. Trump is a funny figure. The best way I can describe it is he's a whiteboard. You can see anything you want to see in Trump.\nGREENE: Now, as a judge, Trumpower says he can't endorse anyone specifically himself. He said he hears from many people who in a moment of uncertainty want to believe big promises. And there are some other realities in this community that make Hillary Clinton less appealing.\nTRUMPOWER: We still have problems with women in charge here.\nGREENE: What do you mean by that?\nTRUMPOWER: A woman president. There is still sexism in Richland County - and not just by men. My wife's grandmother, she will not vote for Hillary.\nGREENE: A lot to talk about here, I think. David Parker is with me, a political science professor at Montana State University. Hey, David.\nDAVID PARKER: Hey.\nGREENE: So to what extent does a place like this, with so much volatility, rely on elected leaders to bring any sense of stability?\nPARKER: Well, the first thing I think I should say is that Montanans, like most Westerners, have this love-hate relationship with government. And it's particularly the federal government. Many of the European settlers were drawn to the area because the federal government promised them 360 acres if they worked the land.\nAnd then the federal government, through the Newlands Act in 1902, said, hey, we're going to irrigate that land and pay for it. But we had a drought in the teens, in the '20s. A lot of people left. There was a market crash. And the people that stayed felt betrayed.\nAnd today they see a lot of their work and efforts to extract resources to flow downstream to market - and they're trying to make a living at the same time - the only thing they see coming back are regulations that make it difficult to do what they want to do. So they are weary of the federal government because of their past.\nGREENE: You know, I want to play a voice for you because not everyone was leery of the federal government. I was at Smoky's Bar & Casino in Bainville, in this oil region, and the bar is across the street from an old mill. You walk inside. It's dark in the middle of the day. There was country music playing and a couple regulars there, including Roger Olson (ph).\nROGER OLSON: OK, ask me a question. I'll give you an answer.\nGREENE: So Roger is a farmer who has seen all the ups and downs we've been talking about. But there was nothing as low as when his wife was diagnosed with breast cancer five years ago.\nOLSON: We went and got insurance through Obamacare. She got cancer a month later and it helped save her life.\nGREENE: And so he tells me that he will be voting for a woman who as first lady pushed for access to health insurance.\nOLSON: I want Hillary because she's got more common sense than the rest all put together. And she's been all over the world. And they've torn her down for 20 years and they haven't won yet.\nGREENE: So, David Parker, there is a man who had sort of an interaction with the federal government, believes that a government program helped save his wife's life. That doesn't seem to fit with a lot of the mold that you were talking about. What do you make of someone like that?\nPARKER: So a lot of people, when they think of the West and think of Montana, they think of this rugged individualism - right? - this determination, this steely determination. But somebody told me that Montana's a working ranch. And in a working ranch...\nGREENE: The whole state?\nPARKER: The whole state is a working ranch. So it's people working hard but also working together as part of community. And part of that community at the end of the day is the federal government. I mean, in a lot of respects we can't survive here without community. And the federal government's part of that.\nAnd the federal government, at the same time, is - makes it hard but also has bailed us out. The federal government brought us the New Deal programs to help conserve the land. It helped build public works projects that gave people jobs. And today when companies go belly-up, it's the federal government that helps pay for the environmental cleanup costs of this extracted economy that we have.\nGREENE: All right. David Parker teaches at Montana State University. He's also written a book about Montana politics. It's called \"Battle For The Big Sky.\"\nWe are at the Feed Cafe in Bozeman with NPR Generation Listen with Yellowstone Public Radio. It's a wonderful scene here with a great audience. We'll be here all morning. And also about 10 feet to my right is Jenn Adams, a Montana singer-songwriter here with us at the Feed Cafe. And, Jenn, take us out of the segment here.\nJENN ADAMS: (Singing) You are standing at the window, watching Autumn rain. Seasons are leaving like outbound trains. The house is empty. It echoes in your mind. Nobody knows how to say goodbye. Do you remember...\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2016/05/06/476994003/montanas-oil-boom-fades-ahead-of-the-2016-presidential-election"}
