{"authors":["Giuseppe Fonte","Valentina Za"],"date_download":"2018-10-30 20:57:55","date_modify":"2018-10-30 20:57:55","date_publish":"2016-12-23 00:00:00","description":"Looking to end a protracted banking crisis that has gummed up the economy, Prime Minister Gentiloni authorised a €20 billion fund to help lenders in distress.","filename":"data/vaneerConsumption/MontedeiPaschiItaliangovernmentbailout.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_monte-dei-paschi-bailout-2016-12_1540933075.html","title":"Monte dei Paschi Italian government bailout","title_page":"    Monte dei Paschi Italian government bailout - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters/Stefano Rellandini\nROME (Reuters) — The Italian government approved a decree on Friday to bail out Monte dei Paschi di Siena after the world's oldest bank failed to win investor backing for a desperately needed capital increase.\nLooking to end a protracted banking crisis that has gummed up the economy, Prime Minister Paolo Gentiloni said his Cabinet had authorised a 20 billion-euro ($20.9 billion) fund to help lenders in distress - first and foremost Monte dei Paschi.\nWithin minutes of the late-night Cabinet meeting ending, the country's third largest lender issued a statement saying it would formally request state aid, opening the way for possibly the biggest Italian bank nationalisation in decades.\nThe government has said its long-awaited salvage operation will work within European Union rules, meaning some Monte dei Paschi bondholders will be forced to accept losses to ensure the taxpayer does not pick up all of the bill.\nHowever, the government and Monte dei Paschi promised protection for around 40,000 retail savers who had bought the bank's junior debt. Many of the high street investors say they were unaware of the risks when they purchased the paper.\n\"Today marks an important day for Monte dei Paschi, a day that sees it turn a corner and be able to reassure its depositors,\" said Gentiloni, who only took office last week and has made the bank rescue his first priority.\nMonte dei Paschi emerged as the weakest of some 51 European banks subjected to stress tests earlier this year by the European Central Bank. It was given until the end of the year to sort out its problems or face being wound down.\nThe collapse of Monte dei Paschi would have threatened the savings of thousands of Italians and could have had devastated the wider banking sector, which is saddled with 356 billion euros of bad loans - a third of the euro zone's total.\nBond conversions\nThe Siena-based bank has been laid low by ill-judged acquisitions and mismanagement and has the largest proportion of bad debts among Italian lenders compared to its capital.\nIt had hoped to raise 5 billion euros from private investors, but confirming an earlier Reuters report, the bank said late on Wednesday that it had failed to secure an anchor investor for its offer of new shares.\nThe government said full details of the rescue plan have yet to be worked out, but it outlined the contours in a statement.\nItaly's Prime Minister Paolo Gentiloni Reuters/Remo Casilli It said the bank's Tier 1 bonds, which are mostly held by professional investors, would be converted into shares at 75 percent of their nominal value.\nTier 2 bonds, which are mostly in the hands of retail investors, will be converted instead at 100 percent of their face value. To further insulate small savers from losses, Monte dei Paschi will offer to swap the shares they end up with as a result of the forced conversion with regular bonds and sell the same shares to the state instead.\n\"The rescue will require a (new) business plan that European authorities will need to approve and that will allow Italy's third-largest bank to finally return to operate at full throttle to support the economy and with the full confidence of its depositors,\" said Economy Minister Pier Carlo Padoan.\nOther banks that may struggle to raise capital in coming months are Banca Popolare Di Vicenza, Veneto Banca and Banca Carige. Italy is also struggling to find a buyer for four small banks rescued from bankruptcy a year ago: Banca Etruria, Banca Marche, CariFerrara and CariChieti.\nThe measures approved on Friday include both the possibility for the state to inject fresh capital into lenders and to provide a guarantee on their borrowings to ensure they have enough liquidity.\nIf the government uses all the 20 billion euros it is authorised to spend on the banking sector, it will worsen the country's already difficult debt position.\nItaly's debt stands at some 133 percent of gross domestic product - second only to Greece in the euro zone. A further 20 billion euros of debt will push the ratio above 134 percent.","url":"https://www.businessinsider.com/monte-dei-paschi-bailout-2016-12"}
