{"authors":["Jim Edwards"],"date_download":"2018-10-30 22:34:31","date_modify":"2018-10-30 22:34:31","date_publish":"2016-12-12 00:00:00","description":"The major Italian bank holds assets that way too over-valued, says Lonsin Capital partner Marco Elser.","filename":"data/vaneerConsumption/MontedeiPaschiownsapalaceinRomethatallegedlyshowstheshakinessofitsfinancialhealth.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_monte-dei-paschi-di-siena-palace-rome-books-valued-2016-12_1540938871.html","title":"Monte dei Paschi owns a palace in Rome that allegedly shows the shakiness of its financial health","title_page":"    Italy's Monte dei Paschi di Siena has a palace in Rome on its books valued at three times its actual value - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The outside of a palace owned by MPS. Google Monte dei Paschi di Siena, the Italian bank currently struggling to persuade the market to participate in its €5 billion ($5.3 billion) rescue plan, owns a \"palace\" in Rome that its books value at three times its real value, according Lonsin Capital partner Marco Elser.\nElser made the case on Bloomberg TV this morning that MPS's books are questionable and should be subjected to \"forensic\" investigation. He also questioned whether its Tier 1 capital ratio — currently at 12.9% according to Bloomberg this morning — was accurate.\nMPS has until the end of the year to raise €5 billion to save itself. If it cannot find the money then the Italian government will be forced to step in, wiping out its bondholders. That might precipitate a domino-effect through the rest of Italy's shaky bank sector. Italy's banks are riddled with bad loans that have been written onto their books as assets even though they are non-performing. It is difficult to figure out how short on cash the banks really are because historically they have been over-valuing their assets. The entire system may need a €52 billion recapitalisation, according to Deutsche Bank.\nTalking to Bloomberg's Guy Johnson, Elser said:\n\"Monte dei Paschi owns lots of buildings in Rome which they have unfortunately on their books at significantly higher values than their current value. The problem really is are those assets necessarily properly priced? I can give you anecdotal evidence of these things. Right around the corner from Bloomberg's offices there is a beautiful palace which belongs to Monte dei Paschi di Siena, they have it on their books at, I can say it, 60 million euros. What's it worth? Twenty at best. Is that part of the accounting?....\"\n\"The valuations written in black on white do not necessarily reflect the actual facts. one has to to do a lot of empirical due diligence, a lot of forensic investigations, to verify these things.\"\nMarco Elser Bloomberg It is not clear which building, exactly, Elser was referring to but MPS does own the Palazzo Rondinini on the Via del Corso in the centre of Rome.\n\"The space is also notable for the marble chunks - inscriptions from Roman tombs, bas reliefs from sarcophagi, busts, fragments and pieces of altars - that are set into the courtyard's walls like nuts set in toffee nougat,\" according to this anonymous blogger who has visited it.\nThe Italian banking association allows visitors to tour the various palaces that its banks own once a year. The palace's courtyard also holds a six-hour clock, \"the only traditional Roman six-hour clock to survive Pius IX's introduction of the French 12-hour time keeping in 1846,\" the blogger says.\nThe inside of the palace looks like this, according to the ABI's gallery:\nABI\nThe Rondinini Palace was built in 1750.\nABI\nIt was commissioned by the Marchesa Margherita Amber Rondinini.\nABI\nHis son Joseph reconceived the palace as a \"museum residence.\"","url":"https://www.businessinsider.com/monte-dei-paschi-di-siena-palace-rome-books-valued-2016-12"}
