{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:00:51","date_modify":"2018-10-30 20:00:51","date_publish":"2015-02-22 03:49:58","description":"The Montana House endorsed a bill on Saturday to repeal the Common Core standards by a vote of 55-45.","filename":"data/vaneerConsumption/MontanaHouseEndorsesBilltoRevokeCommonCore.json","image_url":"https://media.breitbart.com/media/2015/02/this-weeks-common-core-standards-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_02_21__1540929651.html","title":"Montana House Endorses Bill to Revoke Common Core","title_page":"Montana House Endorses Bill to Revoke Common Core","title_rss":"NULL","source_domain":"breitbart.com","text":"The Montana House endorsed a bill on Saturday to revoke the Common Core standards by a vote of 55-45. All but four Republicans voted for the measure and all 41 Democrats opposed it.\nHouse Bill 377, sponsored by state Rep. Debra Lamm (R), would void the Common Core standards adopted four years ago, and establish a separate 16-member committee to create alternative standards, according to the Billings Gazette.\n“I believe that there is a real constitutional problem with the way Common Core has come into the state,” Lamm said during a House Education Committee hearing Wednesday, which eventually advanced the bill with a vote of 8-7.\nLamm also drafted several other bills, including one that would bar schools from using an annual assessment developed outside of Montana. The state has participated in the Smarter Balanced (SBAC) interstate consortium, one of the two federally funded groups creating tests aligned with the Common Core standards.\nAnother bill would prohibit the Board of Public Education from changing a school district’s accreditation status or withholding funding if it rejects the Common Core or the Smarter Balanced tests.\nYet another bill would require school districts to obtain written consent from parents to collect students’ personal biometric and psychometric data, as well as standardized test data and information regarding personal or socioeconomic status.\nDuring the committee hearing, which lasted nearly seven hours, Superintendent of Public Instruction Denise Juneau argued against the bill, saying, “We should not go back on setting high expectations for our students.”\nJuneau reportedly said Lamm’s bills are a “constitutional overstep” that would undermine the Board’s authority over the state’s schools.\nBillings parent Kari Zeier, however, said, “The fallacies within Common Core go beyond party lines. It is time to stop playing politics and work together to create new educational standards by Montanans for Montanans.”\nHouse Bill 377 was advanced to the House Appropriations Committee for another hearing prior to a final House vote.","url":"https://www.breitbart.com/politics/2015/02/21/montana-house-endorses-bill-to-revoke-common-core-standards/"}
