{"authors":["Jim Edwards"],"date_download":"2018-10-30 23:34:43","date_modify":"2018-10-30 23:34:43","date_publish":"2016-12-06 00:00:00","description":"While MPS \"only\" needs €5 billion the fear is that if the state has to step in it could lead to a series of ever-larger dominoes falling.","filename":"data/vaneerConsumption/MONTEDEIPASCHIItalytakesasteptowardabankbailoutcrisis.json","image_url":"https://amp.businessinsider.com/images/5846c88ddd089539448b4b48-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_monte-dei-paschi-italy-bank-bailout-crisis-2016-12_1540942483.html","title":"MONTE DEI PASCHI: Italy takes a step toward a bank bailout crisis","title_page":"    MONTE DEI PASCHI: Italy takes a step toward a bank bailout crisis - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Thomson Reuters Italy lurched one step further toward a full-blown bank bailout crisis today as government officials told executives at Monte dei Paschi di Siena to prepare for a possible €5 billion state bailout as soon as this weekend, the Financial Times reports.\nA failure to secure a bailout could end up \"threatening the solvency of the Italian state itself,\" according to FT columnist Gideon Rachman.\nThe rejection of constitutional reform in Sunday's referendum — and the resignation of prime minister Matteo Renzi — has made the Italian economic picture more uncertain, potentially scaring off the private investors who had previously said they would cooperate with MPS's plan to have market investors take care of its non-performing loans (NPLs). Thus the rumours that the state may be forced to step in with taxpayers' money.\nWhile MPS \"only\" needs €5 billion to make its bad loan consolidation plan work, the fear now is that if the state has to step in — or fails to step in — it could lead to a series of ever-larger dominoes falling that, ultimately, could threaten the entire Italian economy.\nThis is how those dominoes are currently lined up:\nMost immediately, if MPS cannot get its €5 billion recapitalisation done ...\n... then the picture starts to look bleaker for Unicredit, a bigger bank that needs a €13 billion rescue from its NPL book.\nThe entire system may ultimately need an injection of around €52 billion, according to Deutsche Bank analyst Paola Sabbione.\nAnd behind that, there are €360 billion in impaired loans in the entire system, according to the Bank of Italy, of which €200 billion are of the worst sort, non-performing \"sofferenze.\" (€360 billion is the equivalent of about 20% of Italian GDP.)","url":"https://www.businessinsider.com/monte-dei-paschi-italy-bank-bailout-crisis-2016-12"}
