{"authors":["Sean Moran"],"date_download":"2018-10-30 19:59:27","date_modify":"2018-10-30 19:59:27","date_publish":"2017-05-01 22:03:27","description":"Montana Democrat nominee Rob Quist encouraged climate skeptics to consider suicide in a response to a question on climate change.","filename":"data/vaneerConsumption/MontanaDemocratRobQuistEncouragesClimateSkepticstoConsiderSuicide.json","image_url":"https://media.breitbart.com/media/2017/04/quist.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_05_01__1540929567.html","title":"Montana Democrat Rob Quist Encourages Climate Skeptics to Consider Suicide","title_page":"Montana Democrat Rob Quist Encourages Climate Skeptics to Consider Suicide | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Montana Democrat nominee Rob Quist encouraged climate skeptics to consider suicide in a response to a question on climate change.\nQuist debated Republican nominee Greg Gianforte and Libertarian Mark Wicks for Montana’s U.S. House at-large seat to replace Ryan Zinke, the interior secretary. Montana’s at-large district will hold their special election on May 25th.\nThe Democrat nominee was criticized for performing many times at a nudist resort in Idaho. National Republican Congressional Committee spokesman Jack Pandol said in an email, “The more Rob Quist’s past is laid bare, the more his claim to represent Montana values is exposed as another charade. When all is stripped away, this washed-up hippie is just a naked embarrassment to the voters he’s running to represent.”\nQuist, a musician, attacked his Republican opponent for being out of touch with the average Montanan, lamenting that there are enough millionaires in Congress. He explained, “We don’t have representation for every-day Montanans that work. I really feel like there are enough millionaires in Congress. Do we really need to send one more? There are over 300 millionaires in Congress. We need someone who can represent the people of Montana.”\nGianforte replied that he favors prosperity for all and that there should be more engineers rather than lawyers in Congress. He explained, “This pejorative of a millionaire? Again, I’ve been clear: I’m in favor of prosperity. I’m an electrical engineer. Honestly, I think we have too many lawyers in Washington. Maybe we need some more engineers. They’re trained to solve problems and we can actually do math, which is a desperately needed skill back there.”\nThe Republican nominee answered a question about climate change and the Clean Power Plan saying, “Everyone believes that the climate is changing.” However, he added, “Using EPA’s data calculated by the Cato Institute; they said if we shut down every coal-fired plant in North America our environment would be two-hundredths of a degree cooler a hundred years from now…for that we are willing to give up 7,000 jobs in Montana and $1.5 billion in annual revenue? That’s not a smart business decision.”\nQuist responded to Gianforte. Rather than refuting the Republican nominee’s argument, he encouraged climate skeptics to consider ending their lives. He said, “To me this a cumulative thing, you cannot just say closing one plant or not is going to make a difference. This is something that the entire world needs to address and you know what, if any of you that feel like this is not a problem, I challenge you to go into your car in your garage, start your car and see what happens there.”\nWatch the entire debate here.","url":"https://www.breitbart.com/politics/2017/05/01/montana-democrat-rob-quist-encourages-climate-skeptics-to-consider-suicide/"}
