{"authors":["William Bigelow"],"date_download":"2018-10-30 20:00:24","date_modify":"2018-10-30 20:00:24","date_publish":"2015-07-02 20:23:28","description":"On Tuesday, inspired by Supreme Court Chief Justice John Roberts’ dissent in the recent ruling legalizing gay marriages across the country, one Montana man who has two wives took the logical next step, applying for his polygamous marriage to be legalized.","filename":"data/vaneerConsumption/MontanaManFilesApplicationforPolygamousMarriage.json","image_url":"https://media.breitbart.com/media/2015/07/apply-for-polygamous-marriage-CBS-News.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_02__1540929624.html","title":"Montana Man Files Application for Polygamous Marriage","title_page":"Montana Man Files Application for Polygamous Marriage | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On Tuesday, inspired by Supreme Court Chief Justice John Roberts’ dissent in the recent ruling legalizing gay marriages across the country, one Montana man who has two wives took the logical next step, applying for his polygamous marriage to be legalized.\nNathan Collier, 46, of Lockwood, Montana, saw Roberts’ dissent, in which he wrote that people in polygamous relationships could use the same legal argument propounded by the gay community: that the ban on gay marriage disrespected and subordinated them. Along with his wives Victoria and Christine, he traveled to the Yellowstone County Courthouse in Billings to file an application with the county clerk. Collier said that the county clerks rejected the application, but then backtracked, saying they would have to ask the county attorney.\nEvery state in the nation bans bigamy, but Collier will not be denied, telling the Associated Press on Wednesday, “It’s about marriage equality. You can’t have this without polygamy.”\nCollier, formerly a Mormon, married Victoria, now 40, in 2000, adding a second religious ceremony in 2007 in which he married Christine. He eschewed obtaining a marriage license so he could not be charged with bigamy. He and his wives have been featured on the reality cable television show “Sister Wives” on TLC.\nCollier told KTVQ, “We just want to add legal legitimacy to an already happy, strong, loving family,” adding, “We’re not even asking for acceptance, we’re just asking for tolerance. Let us live our lives together without fear.” Asked how they filled out the application, Christine answered, “There’s a spot on there where you put the dissolution date of your previous marriage and we put not applicable.”\nThe Collier family includes seven children, some of whom derive from Collier and his wives and some who come from previous relationships the adults have had.\nChristine opined, “It’s two distinct marriages, its two distinct unions, and for us to come together and create family, what’s wrong with that? I don’t understand why it’s looked upon and frowned upon as being obscene.”\nAlthough Collier apparently e-mailed the ACLU of Montana asking for support, ACLU legal director Jim Taylor said he was not aware of any email and had no opinion of Collier’s request. Taylor protested that the recent Supreme Court decision “is about something very different.”\nAnne Wilde, a co-founder of the polygamy advocacy organization Principle Voices, located in Utah, said that although most polygamous families are content with the decision by a federal judge that decriminalized cohabitation, Collier’s appeal still has value. She said, “We hope the Supreme Court decision will show the direction the nation is going: more liberal, it’s more understanding about people forming the families the way they want.”\nOr, as Collier tweeted back in January:","url":"https://www.breitbart.com/politics/2015/07/02/montana-man-files-application-for-polygamous-marriage/"}
