{"authors":["Associated Press"],"date_download":"2018-10-23 04:47:36","date_modify":"2018-10-23 04:47:36","date_publish":"2016-01-11 18:00:23","description":"ROME (AP) — The chairman of Rome's bid for the 2024 Olympics sees no need for a public referendum on the candidacy. Rome's city council voted \"nearly unanimo...","filename":"data/vaneerConsumption/MontezemoloseesnonecessityforRomebidreferendum.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-urn:publicid:ap.org:59c67b810a5e46c4b8f8f03ef9ef9d81-3WAQP5SaQH704788ebcf7e19326c-585_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3394288_Montezemolo-sees-no-necessity-Rome-bid-referendum_1540270056.html","title":"Montezemolo sees no 'necessity' for Rome bid referendum","title_page":"Montezemolo sees no 'necessity' for Rome bid referendum | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Montezemolo sees no 'necessity' for Rome bid referendum\nROME (AP) — The chairman of Rome's bid for the 2024 Olympics sees no need for a public referendum on the candidacy.\nRome's city council voted \"nearly unanimously\" in support of the bid last year, \"and the government has expressed maximum support, so we don't see the necessity,\" Luca Cordero di Montezemolo said Monday.\nLast week, the small, left-wing movement Radicali Italiani called for a referendum on the Rome bid, citing spiraling costs of recent Olympics.\nRome 2024 Olympic bid committee chairman Luca Cordero di Montezemolo arrives for a press conference at the foreign press association in Rome, Monday, Jan. 11, 2016. The chairman of Rome's bid for the 2024 Olympics doesn't see the \"necessity\" for a public referendum on the candidacy. Luca Cordero di Montezemolo points out that Rome's city council voted \"nearly unanimously\" in support of the bid last year, \"and the government has expressed maximum support, so we don't see the necessity.\" (AP Photo/Alessandra Tarantino)\n\"If someone wants to make publicity in an electoral campaign, let them do it,\" Montezemolo said at Rome's foreign press association. \"But we're accustomed to dealing with institutions. I don't see the necessity for a referendum right now.\"\nThe German port city of Hamburg dropped out of the 2024 race in November after the bid was defeated in a referendum. Budapest, Hungary, another 2024 bidder, is also facing calls for a referendum.\nLos Angeles and Paris are the other 2024 bidders, with the IOC to select the host city in 2017.\nRome is currently being governed by an extraordinary commissioner since Ignazio Marino resigned as mayor in October, and elections are expected in June.\n\"This city needs a big challenge,\" Montezemolo said. \"Without a big (event), it's difficult to do things involving public services and the periphery.\"\nItalian Premier Matteo Renzi has expressed strong support for the Rome bid and plans to travel to Switzerland later this month to push the candidacy in talks with officials of the International Olympic Committee.\nMontezemolo also announced a bid budget of 24.9 million euros ($27 million) — more than double the previous estimate of 10 million euros (nearly $11 million) but significantly less than the budgets of main rivals Paris and Los Angeles.\nThe budget highlights the Rome bid's \"frugality,\" Montezemolo said, adding that 5 million euros ($5.4 million) will come from private contributions and the rest from public sources like the Italian Olympic Committee and the government.\nParis is spending 60 million euros ($65 million), while Los Angeles raised $35 million in a single week for its bid campaign.\n\"We are significantly lower,\" Montezemolo said.\nWith a candidacy featuring 70 percent existing venues — many of them built for the 1960 Games in the Italian capital — Rome had announced a games operating budget of 6 billion euros ($6.5 billion), or roughly half of what London spent in 2012. But Montezemolo said it was premature to announce a precise figure because it depends on the number of temporary venues needed.\nMontezemolo also announced that the torch relay would begin on the Sicilian island of Lampedusa if Rome is awarded the games\n\"This would be a strong sign for the south and for the big theme in Europe right now, which is migrants,\" Montezemolo said, referring to the waves of migrants who have reached Lampedusa's shores.\n___\nAndrew Dampf on Twitter: www.twitter.com/asdampf\nRome 2024 Olympic bid committee chairman Luca Cordero di Montezemolo adjusts his tie as he arrives for a press conference at the foreign press association in Rome, Monday, Jan. 11, 2016. The chairman of Rome's bid for the 2024 Olympics doesn't see the \"necessity\" for a public referendum on the candidacy. Luca Cordero di Montezemolo points out that Rome's city council voted \"nearly unanimously\" in support of the bid last year, \"and the government has expressed maximum support, so we don't see the necessity.\" (AP Photo/Alessandra Tarantino)","url":"https://www.dailymail.co.uk/wires/ap/article-3394288/Montezemolo-sees-no-necessity-Rome-bid-referendum.html"}
