{"authors":[],"date_download":"2018-10-22 21:42:25","date_modify":"2018-10-22 21:42:25","date_publish":"2014-06-06 02:38:13","description":"Lunar rocks brought back by the Apollo astronauts contain evidence of a Mars-sized planet that scientists say crashed into Earth and created the moon.","filename":"data/vaneerConsumption/MoonRocksRevealEvidenceofPrimordialSmashUp.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/491341/140605-theia_f8c110591433f8ab8d0d6269664cf950.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_moon-rocks-reveal-evidence-primordial-smash-up-n124196_1540244545.html","title":"Moon Rocks Reveal Evidence of Primordial Smash-Up","title_page":"Moon Rocks Reveal Evidence of Primordial Smash-Up","title_rss":"NULL","source_domain":"nbcnews.com","text":"Different planets in the solar system have slightly different chemical makeups. Therefore, scientists suspected that moon rocks might hold telltale chemical fingerprints of whatever body smashed into Earth. But until now, the evidence was elusive.\n“We have developed a technique that guarantees perfect separation,” of oxygen isotopes from other trace gases, Daniel Herwartz, with the University of Cologne in Germany, wrote in an email to Reuters. \"The differences are small and difficult to detect, but they are there.\"\nHerwartz is the lead author of a paper on the discovery, published this week in the journal Science.\nThe results indicate that the composition of the moon is about 50 percent Theia and 50 percent Earth, although more work is needed to confirm that estimate.\nThe team analyzed rocks brought back to Earth by NASA astronauts during the Apollo 11, Apollo 12 and Apollo 16 missions to the moon, which took place in 1969 and 1972.\n\"This work is the first to claim to see such a difference in the isotopes of oxygen,\" said Robin Canup, a planetary scientist with the Southwest Research Institute in Boulder, Colorado, who was not involved in the research. \"The reported difference between the Earth and moon is extremely small, small enough that I think there will be debate as to whether the difference is real or an artifact of how one interprets the data.\"\n— Irene Klotz, Reuters","url":"https://www.nbcnews.com/science/space/moon-rocks-reveal-evidence-primordial-smash-up-n124196"}
