{"authors":["Associated Press"],"date_download":"2018-10-22 20:07:25","date_modify":"2018-10-22 20:07:25","date_publish":"2016-01-28 00:15:33","description":"TURIN, Italy (AP) — Alvaro Morata ended a 20-match goalscoring drought with two goals as holder Juventus beat 10-man Inter Milan 3-0 in the first leg of thei...","filename":"data/vaneerConsumption/Moratanets2asJuventusbeatsInter30inCupsemiopener.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:864f8e6902494404938e3d8a480c3ea1-4vVdYopwYQ7f641721b07a6ad76a-499_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3419970_Morata-nets-2-Juventus-beats-Inter-3-0-Cup-semi-opener_1540238845.html","title":"Morata nets 2 as Juventus beats Inter 3-0 in Cup semi opener","title_page":"Morata nets 2 as Juventus beats Inter 3-0 in Cup semi opener | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Morata nets 2 as Juventus beats Inter 3-0 in Cup semi opener\nTURIN, Italy (AP) — Alvaro Morata ended a 20-match goalscoring drought with two goals as holder Juventus beat 10-man Inter Milan 3-0 in the first leg of their Italian Cup semifinal on Wednesday.\nMorata hadn't scored for nearly four months but he powerfully struck a penalty into the top left corner in the 36th minute after Juan Cuadrado had been barged over by Jeison Murillo.\nThe Spain forward doubled his tally shortly after the hour with a brilliant finish into the top far corner after Patrice Evra's cross had taken a fortunate bounce off an Inter defender into his path.\nJuventus' forward Alvaro Morata celebrates after scoring on a penalty kick during the Italian Cup first-leg, semifinal match between Juventus and Fc Internazionale of Milan at the Olympic stadium in Turin, Italy, Wednesday, Jan. 27, 2016. (Andrea Di Marco/ANSA via AP Photo) ITALY OUT\n\"It was quite a tough period, also off the pitch because of the psychological problems I had,\" Morata said. \"My teammates helped me so much, the coach, the club, they all talked to me every day. Now I have to continue like this.\"\nInter's hopes of getting back into the match all but evaporated when Murillo was sent off in the 70th minute following a second booking for another foul on Cuadrado.\nPaulo Dybala finished off the scoring six minutes from time, sidefooting a shot between the legs of Samir Handanovic from the edge of the area to ensure Juventus takes a clear advantage into the second leg at San Siro on March 2 or 3.\nIt was Dybala's 15th goal of the season.\nIt was also the first time Juventus has beaten Inter in the Italian Cup since 1972.\n\"I could have thought about losing in Turin but not 3-0, it's an exaggerated result for Juventus,\" Inter coach Roberto Mancini said. \"The aim was to stay in the game in the first half, the penalty changed the match.\n\"Until the penalty, Juventus didn't create any danger, I don't remember Handanovic making a save. The second goal was our gift, the ball came to Morata from an error by (Felipe) Melo.\"\nAC Milan edged Alessandria 1-0 in the first leg of their semifinal on Tuesday.\nJuventus' forward Alvaro Morata, right, scores on a penalty kick during the Italian Cup first-leg, semifinal match between Juventus and Fc Internazionale of Milan at the Olympic stadium in Turin, Italy, Wednesday, Jan. 27, 2016. (Alessandro Di Marco/ANSA via AP Photo) ITALY OUT\nJuventus' forward Alvaro Morata celebrates after scoring on a penalty kick during the Italian Cup first-leg, semifinal match between Juventus and Fc Internazionale of Milan at the Olympic stadium in Turin, Italy, Wednesday, Jan. 27, 2016. (Andrea Di Marco/ANSA via AP Photo) ITALY OUT\nJuventus midfielder Patrice Evra, right. stops the ball during the Italian Cup first-leg, semifinal match between Juventus and Fc Internazionale of Milan at the Olympic stadium in Turin, Italy, Wednesday, Jan. 27, 2016. (Andrea Di Marco/ANSA via AP Photo) ITALY OUT\nJuventus midfielder Paul Pogba jumps for the ball during the Italian Cup first-leg, semifinal match between Juventus and Fc Internazionale of Milan at the Olympic stadium in Turin, Italy, Wednesday, Jan. 27, 2016. (Andrea Di Marco/ANSA via AP Photo) ITALY OUT","url":"https://www.dailymail.co.uk/wires/ap/article-3419970/Morata-nets-2-Juventus-beats-Inter-3-0-Cup-semi-opener.html"}
