{"authors":["Frank Langfitt"],"date_download":"2018-10-23 05:37:14","date_modify":"2018-10-23 05:37:14","date_publish":"2015-06-02 00:00:00","description":"Rescuers pulled three people alive from inside a cruise ship carrying mostly retirees that overturned in China's Yangtze River. The ship carried more than 450 people and over 400 remain missing.","filename":"data/vaneerConsumption/MoreThan400StillMissingAfterCruiseShipOverturnsInChina.json","image_url":"https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2015_06_02_411533405_more-than-400-still-missing-after-cruise-ship-overturns-in-china_1540273034.html","title":"More Than 400 Still Missing After Cruise Ship Overturns In China","title_page":"More Than 400 Still Missing After Cruise Ship Overturns In China : NPR","title_rss":"NULL","source_domain":"npr.org","text":"More Than 400 Still Missing After Cruise Ship Overturns In China\nRescuers pulled three people alive from inside a cruise ship carrying mostly retirees that overturned in China's Yangtze River. The ship carried more than 450 people and over 400 remain missing.\nAUDIE CORNISH, HOST:\nA Chinese cruise ship carrying more than 450 people capsized in the Yangtze River late Monday. Poor weather has hampered rescue efforts. Divers have brought several people out alive from the upturned hull, but only 14 passengers are known to have survived, revised down from 15 reported earlier.\nMELISSA BLOCK, HOST:\nNPR's Frank Langfitt is in Jianli in central China covering the story. And Frank, there are images of this tourist boat upside down, completely capsized but at the same time, stories of some rescues as there's still hope that others may be found alive.\nFRANK LANGFITT, BYLINE: The boat has capsized more than 24 hours ago, so I think there's a lot of concern that obviously, the longer this goes on, the less hope there is for folks. There's been a great effort. A lot of divers have been out. They've been using helicopters and boats, even bringing in heavy equipment. But we haven't heard of a rescue in actually many, many hours.\nBLOCK: Who was on this boat, Frank? How many people in all?\nLANGFITT: Well, it was over 450 people, and most of the passengers were retirees from eastern China from Shanghai, where I work, also Suzho, other big cities in eastern China. The boat itself is a four-story boat, a live-aboard. The capacity's over 500, so it wasn't overloaded. And this is kind of a classic cruise boat that goes up the Yangtze River. In this case, they started off in Nanjing and went all the way - were supposed to go all the way up to Chongqing in southwestern China.\nBLOCK: And what happened? Why did this boat capsize?\nLANGFITT: Authorities say there was a tornado, and winds were at least 71 miles per hour. The winds lasted maybe 15 to 20 minutes. The ship sank very quickly, and there was no time for most people to escape. This is something very interesting. About two-and-a-half hours later, they pulled the captain out of the water downstream, and he's actually been detained. There's no charges, but it's clear that they're questioning him.\nBLOCK: Frank, Chinese authorities are keeping reporters away from the scene of the accident, but they did have a news conference. Did you learn anything?\nLANGFITT: Not a thing, Melissa. It was really, really striking. It was mostly just a recitation of all these numbers, which the government often does. They say, oh, we have thousands of soldiers here and all of these divers and all of these numbers but no new facts at all. It's been a long time since we've heard anything new. And it's also very striking, the mood of the whole place. Before going into the press conference, I ran into an angry family member of a passenger who wanted to go into the press conference and ask questions, and he was surrounded by officials who were trying to basically get rid of him. And I tried to talk to him, and at one point, officials actually tried to wrestle the tape recorder away from myself and my assistant, Yang. And then they took the guy, and they hustled him back to a back room to hide him, basically.\nWe went to the hospital tonight. There were survivors in a room there - four cops right in front, not allowing any of us, including Chinese state media, to, you know, even inquire if we could talk to somebody. And so the sense you're getting right now is the government is trying to maintain very, very tight control over the narrative and also really tightly control information.\nBLOCK: Frank, one last thing. What do you make of the visit by the Chinese premier to the accident site?\nLANGFITT: That's - that is normal, and the Chinese premiers often do this when there's an accident. And this is an extraordinary accident. In all the time I've covered China off and on for close to 20 years, I've never heard of so many people potentially dying in a boat accident like this. The Chinese premier, naturally, will come to a place like this, and he will be on television. And he'll be seen directing things. And even though this is an authoritarian country, the government officials here do feel very much that they need to show that they care, that they're concerned, that they're on top of things, especially a disaster of this - you know, of these proportions.\nBLOCK: Frank, thanks very much.\nLANGFITT: You're very welcome, Melissa.\nBLOCK: That's NPR's Frank Langfitt. He's in Jianli in the province of Hubei in China. That's near where the cruise ship capsized. Hundreds are still missing.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/2015/06/02/411533405/more-than-400-still-missing-after-cruise-ship-overturns-in-china"}
