{"authors":[],"date_download":"2018-10-30 18:42:24","date_modify":"2018-10-30 18:42:24","date_publish":"2016-12-14 22:16:00","description":"A DeKalb County Thai restaurant failed a health inspection after an official noted a variety of issues. Then it received an 81.","filename":"data/vaneerConsumption/MoreissuesinlatesthealthcheckatDeKalbThaispot.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/14/Images/1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_more-issues-latest-health-check-dekalb-thai-spot__1540924944.html","title":"More issues in latest health check at DeKalb Thai spot","title_page":"More issues in latest health check at DeKalb Thai spot","title_rss":"NULL","source_domain":"ajc.com","text":"Update: The restaurant, which has said it’s working to improve its health score, did this week. But the inspector found issues, giving a score of 81. Read the full new report here.\nOriginal story: A DeKalb County Thai restaurant failed a health inspection after an official noted dirty utensils stored as clean and food storage issues.\nBest Seafood and Noodle World, located at 1363 Clairmont Road, received a 60/U on Tuesday, according to the inspector’s report.\nChef Alex Bun told The Atlanta Journal-Constitution on Thursday that the restaurant would be re-checked and pass next week.\nThe inspector noted that raw beef was stored above cooked food and that a “non-continuous” method was being used to cook chicken.\nAlso of note was that rice was kept from the beginning of December and dried food was found in the cooler.\nThe restaurant received a 90 on its last check, in July, and a 100 before that in April.\nBest Seafood and Noodle World 1363 Clairmont Road, Decatur Score: 60/U Read the full report here.\nLike DeKalb County News Now on Facebook | Follow on Twitterand Instagram","url":"https://www.ajc.com/news/local/more-issues-latest-health-check-dekalb-thai-spot/14qwFsIF9LDqBuWPToGnaP/"}
