{"authors":[],"date_download":"2018-10-22 22:43:02","date_modify":"2018-10-22 22:43:02","date_publish":"2014-06-10 20:02:25","description":"Airlines are doing a better job of arriving on time, although more than one in five flights still run late.","filename":"data/vaneerConsumption/MoreAirlineFlightsArrivingonTimeGovernmentSays.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/500261/140610-hawaiian-airlines-1558_6f44b56d0e340e1211e72254e78f3aee.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_more-airline-flights-arriving-time-government-says-n127696_1540248182.html","title":"More Airline Flights Arriving on Time, Government Says","title_page":"More Airline Flights Arriving on Time, Government Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nAirlines are doing a better job of arriving on time, although more than one in five flights still run late.\nThe U.S. Transportation Department said Tuesday that the nation's biggest airlines achieved an on-time arrival rating of 79.6 percent in April. That is up from 77.6 percent in March and 77.3 percent in April 2013.\nThe most punctual airlines were Hawaiian, Alaska and Virgin America. The most likely to be late were ExpressJet, Southwest Airlines and Envoy, which used to be called American Eagle.\nThe government said that canceled flights were down — 1.1 percent of domestic flights, compared with 1.8 percent in April 2013. And no domestic flights were stuck on the ground for more than three hours, although one international flight remained on the tarmac for four hours, exceeding the limit in federal rules.\nThe airlines reported that for every 1,000 passengers in April, there were 2.92 bags that were lost, stolen, damaged or delayed, down slightly from the 3.07 rate in April 2013. Virgin America rated best at bag handling, while Envoy was worst by a wide margin.\nComplaints to the government rose 16 percent, but the number of consumers who filed a formal complaint remained tiny — 1,259 complaints out of 483,499 flights that were tracked. Southwest had the lowest rate of complaints; Frontier Airlines had the highest.\nThe Transportation Department report covers 12 airline companies but excludes smaller carriers such as Spirit Airlines and Allegiant Air because their revenue from domestic flights is less than 1 percent of the industry total.\n— The Associated Press","url":"https://www.nbcnews.com/business/travel/more-airline-flights-arriving-time-government-says-n127696"}
