{"authors":["Laurel Rosenhall","Guest Commentary","Reader Reactions","Dan Morain"],"date_download":"2018-10-30 23:16:25","date_modify":"2018-10-30 23:16:25","date_publish":"2015-11-11 08:00:00","description":"Compared with the partisan gridlock that gripped Sacramento just a few years ago, dynamics in the statehouse can seem almost cuddly these days. There are","filename":"data/vaneerConsumption/Morethanfriends.json","image_url":"https://calmatters.org/wp-content/uploads/nazarianmoorlach_medium_2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540941385.html","title":"More than friends?","title_page":"More than friends? | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Compared with the partisan gridlock that gripped Sacramento just a few years ago, dynamics in the statehouse can seem almost cuddly these days.\nThere are friendly handshakes after lawmakers cross party lines to vote for each others’ bills. Bipartisan banter is visible on social media, where legislators trade funny stories and post selfies with friends across the aisle. A group of young lawmakers recently formed a bipartisan caucus focused on technology, while Democrats and Republicans attend dinner parties together or don red and blue to play baseball.\n“There is a renewed emphasis on working together and building relationships. It is a completely different way of thinking,” said Rob Lapsley, who has been close to Capitol politics for decades as a Republican appointee and advocate for business groups.\nAfter several years of partisan gridlock and stalled budgets, angry voters passed a series of political reforms that made important changes in the Legislature. District boundaries are now drawn by a citizens’ panel, the “Top Two” primary was designed to elect more moderates and a supermajority vote is no longer needed to pass the budget.\nOne of the biggest changes allows lawmakers to serve up to 12 years in one chamber, replacing a six-year term limit in the Assembly and eight years in the Senate. That is one reason Sen. John Moorlach (R-Costa Mesa) said he broke with fellow Republicans this year to support a bill about HIV testing by Assemblyman Adrin Nazarian (D-Sherman Oaks).\n“I’m thinking, ‘What’s the bigger picture?’ How do I develop a relationship with the other side?” said Moorlach.\nLike Moorlach, who took office this year, most legislators in office today were elected since the new rules passed. With so many signs of friendliness, many wonder whether Sacramento has shed its rigid ideological differences and is now more capable of reaching bipartisan compromise.\nThat question is being put to the test. Lawmakers are in the midst of two special sessions to find money – most likely new taxes – for long-overdue road repairs and a shortfall in the Medi-Cal health system for the poor.\nDemocrats hold every statewide office as well as large majorities in both houses of the Legislature, so they can pass almost anything over Republican objections. But Republicans remain critical on a huge issue: taxes.\nRaising taxes requires approval from two-thirds of the Legislature, which takes all Democrats plus at least three Republicans – two in the Assembly and one in the Senate. So far, however, the proposals to get at least $3.6 billion for road repairs and another $1 billion for Medi-Cal have stalled over partisan differences on higher taxes.\n“Anything is possible but some things are just not probable,” said Senate Republican leader Jean Fuller of Bakersfield.\nBut a leading GOP voice in the Assembly said, “everything has to be on the table.”\n“I’m not convinced that what’s been proposed are the right answers. But we’re not yet done with those conversations,” said Assemblyman Chad Mayes of Yucca Valley, who will take over next year as Republican leader.\nThe incoming Assembly speaker said he saw bipartisanship at work when he helped negotiate a $7.5 billion water bond last year, another issue that required approval from two-thirds of the Legislature. Assemblyman Anthony Rendon (D-Lakewood) said the plan was informed, in part, by trips he made to Central Valley farming communities at the invitation of Republican colleagues.\n“So I have good working relationships with a lot of those folks,” Rendon said.\nHe was elected in 2012 as part of the first wave of lawmakers allowed to remain in one chamber for 12 years. That class of Assembly members – from both parties – created a tradition of going to dinner together a few times a year.\n“We just get together to relax as members of our class in a bipartisan way,” said Assemblyman Ken Cooley (D-Rancho Cordova).\nTwo members of the class – Assemblywomen Melissa Melendez and Lorena Gonzalez – exemplify the public face of bipartisanship. Melendez, a Republican from Lake Elsinore, is a Navy veteran and an ardent supporter of gun rights. Gonzalez, a Democrat from San Diego, is an attorney and former union leader. They’re political opposites on most issues but have become friends.\n“I totally disagree with her but I totally respect her,” Gonzalez said.\nWill those kinds of relationships shape the Legislature’s ability to tackle the big issues that loom in the months ahead? It’s too soon to say for sure, Melendez said.\n“But I think… there will be more willingness to sit down and talk,” she said. “Instead of immediately putting up the guard.”","url":"https://calmatters.org/articles/more-than-friends/"}
