{"authors":[],"date_download":"2018-10-30 20:32:33","date_modify":"2018-10-30 20:32:33","date_publish":"2014-10-17 14:35:54","description":"Ga. 400 drivers will gain more elbow room starting on Friday, at least during the most congested times of day.","filename":"data/vaneerConsumption/MoreshoulderlanesopentoGa400drivers.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p5/MyAJC/2014/10/17/Images/photos.medleyphoto.6282196.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_traffic_more-shoulder-lanes-open-400-drivers__1540931553.html","title":"More shoulder lanes open to Ga. 400 drivers","title_page":"More shoulder lanes open to Ga. 400 drivers","title_rss":"NULL","source_domain":"ajc.com","text":"Ga. 400 drivers will gain more elbow room starting on Friday, at least during the most congested times of day.\nFrom 4 to 6 p.m. on weekdays only, motorists will be allowed to drive on the shoulder of the road in “flexible shoulder lanes” when traveling northbound on certain segments of the highway.\nThose segments are between the North Springs MARTA station and Northridge Road, and between Old Milton Parkway and Windward Parkway.\nIndividuals who work in the Windward corridor can also use a new northbound shoulder lane from 6:30 to 10 a.m. between Old Milton Parkway to Windward Parkway.\nThe flexible shoulder lanes are an expansion of an existing program that since 2012 has allowed drivers headed south on weekday mornings to use the shoulder lane between Holcomb Bridge Road and Northridge Road, and between Northridge and the North Springs MARTA Station.\nThe flexible shoulder lanes program has proved to be an easy-to-implement, inexpensive way to offer immediate relief to commuters, said GDOT spokeswoman Natalie Dale.\nSoon, commuters will be able to take advantage of even more of them.\nAn additional southbound shoulder lane between North Springs MARTA and Abernathy Road will open by early November. Another southbound lane between Mansell Road and Holcomb Bridge and a northbound lane between Abernathy and North Springs MARTA will follow in the months to come.\nA 45-mph advisory speed limit will be posted for shoulder lane traffic. Pull-off sites for disabled vehicles or accidents are adjacent to each of the new shoulder lanes.","url":"https://www.ajc.com/news/traffic/more-shoulder-lanes-open-400-drivers/DKXXAX88MNSSe0MBlqj8nM/"}
