{"authors":[],"date_download":"2018-10-23 00:56:08","date_modify":"2018-10-23 00:56:08","date_publish":"2016-01-28 15:05:26","description":"China's controversial campaign to hunt down alleged white-collar criminals living abroad netted 857 fugitives last year, the country's public security minist...","filename":"data/vaneerConsumption/Morethan800fugitivesreturnedtoChinagovt.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g9kn-4vVdYopwYQ7f641721b07ae7c435-202_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421123_More-800-fugitives-returned-China-govt_1540256168.html","title":"More than 800 'fugitives' returned to China: govt","title_page":"More than 800 'fugitives' returned to China: govt | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"More than 800 'fugitives' returned to China: govt\nChina's controversial campaign to hunt down alleged white-collar criminals living abroad netted 857 fugitives last year, the country's public security ministry said.\nBeijing's secretive \"Operation Fox Hunt\" has ruffled feathers in some countries that say Chinese law enforcement agents have been operating covertly on their soil without the approval or consent of local authorities.\nFew details of what extradition procedures are involved, if any, were given.\nBeijing's secretive \"Operation Fox Hunt\" has ruffled feathers in some countries that say Chinese law enforcement agents have been operating covertly on their soil without the approval or consent of local authorities ©Mark Navales (AFP/File)\nThe drive largely focuses on suspected economic criminals, including corrupt officials, who have also been targeted by President Xi Jinping's much-publicised anti-graft campaign.\nOf those repatriated last year, 366 turned themselves in, the ministry said in a statement on its website late Wednesday -- implying that nearly 500 were seized against their will.\nIt did not make clear who carried out the arrests.\nThe wanted individuals were returned from 66 countries and regions, the ministry said, including the United States, Spain and Italy, and over 70 percent had lived outside China for five years or more.\nThe ministry also announced the creation of a department of overseas fugitives affairs to oversee Operation Fox Hunt this year.\nLast August, the New York Times reported that Chinese agents were entering the United States on tourism or trade visas and using \"strong-arm tactics\" to compel their targets to return.\nConcerns over extra-territorial Chinese activities have been heightened in recent weeks by the disappearance of five Hong Kong booksellers known for salacious titles critical of Beijing leaders.\nAmong them Lee Bo, a British passport holder, disappeared from a book warehouse in Hong Kong and resurfaced in China weeks later saying he was \"assisting an investigation\".\nPro-democracy lawmakers and activists believe mainland agents kidnapped him despite having no right to operate in the city, which has a separate legal and political system from the mainland.\nSwedish national Gui Minhai vanished from Thailand, reappearing in custody on Chinese national television, confessing that he had come to the People's Republic to \"take legal responsibilities\" for a fatal accident that occurred 11 years earlier.","url":"https://www.dailymail.co.uk/wires/afp/article-3421123/More-800-fugitives-returned-China-govt.html"}
