{"authors":[],"date_download":"2018-10-30 00:54:17","date_modify":"2018-10-30 00:54:17","date_publish":"2017-01-03 16:35:52","description":null,"filename":"data/vaneerConsumption/MoreWinningontheStateLevelReliefforTaxpayersin2016.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/01/the_hobbit_the_desolation_of_smaug_1920x1080_by_sachso74-d7sr1wl.0.0.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860857.html","title":"More Winning on the State Level: Relief for Taxpayers in 2016","title_page":"More Winning on the State Level: Relief for Taxpayers in 2016The American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"2017 is off and running! And what better inspiration to keep working for critical reforms across the states than a look back at some of 2016’s most exciting policy victories.\nPersonal Income Tax Elimination: Tennessee eliminated all state personal income taxes in April, joining seven other income-tax-free states. The CEO of the Beacon Center of Tennessee said, “They [lawmakers] realized that this tax unfairly hurts senior citizens and job creators and did the right thing to repeal it. We can now celebrate a major reduction to the tax bills of many Tennesseans who are in desperate need of tax relief.”\nTennessee eliminated all state personal income taxes in April, joining seven other income-tax-free states. The CEO of the Beacon Center of Tennessee said, “They [lawmakers] realized that this tax unfairly hurts senior citizens and job creators and did the right thing to repeal it. We can now celebrate a major reduction to the tax bills of many Tennesseans who are in desperate need of tax relief.” Local Right to Work: In a major win for right-to-work laws, a Kentucky town won a federal appeal to implement local right to work. This represents a critical victory for workers’ freedom.\nIn a major win for right-to-work laws, a Kentucky town won a federal appeal to implement local right to work. This represents a critical victory for workers’ freedom. 26th Right to Work State: Speaking of right-to-work, in February, West Virginia passed the Workplace Freedom Act and became the 26th right-to-work state.\nSpeaking of right-to-work, in February, West Virginia passed the Workplace Freedom Act and became the 26th right-to-work state. Labor Reform Election Victories: In Alabama, South Dakota, and West Virginia, voters backed labor union reforms. In Alabama, some 70% of voters supported an amendment to enshrine right-to-work in the state’s constitution. In South Dakota, a union-backed ballot measure aimed at destroying right-to-work protections was rejected by around 80% of voters. Finally, lawmakers in West Virginia, who helped pass right-to-work, were overwhelmingly rewarded with re-election.\nIn Alabama, South Dakota, and West Virginia, voters backed labor union reforms. In Alabama, some 70% of voters supported an amendment to enshrine right-to-work in the state’s constitution. In South Dakota, a union-backed ballot measure aimed at destroying right-to-work protections was rejected by around 80% of voters. Finally, lawmakers in West Virginia, who helped pass right-to-work, were overwhelmingly rewarded with re-election. State Corporate Income Tax Reduction:Five states implemented corporate income tax reductions, including Arizona, Indiana, New York, New Mexico, and North Carolina\nMany Americans often look to Washington for change, but the real reform is happening in communities and states across the nation. In 2017, expect to see more states make game-changing advances in the fight for freedom.","url":"https://spectator.org/more-winning-on-the-state-level-relief-for-taxpayers-in-2016/"}
