{"authors":["Press Association"],"date_download":"2018-10-23 02:12:25","date_modify":"2018-10-23 02:12:25","date_publish":"2017-03-16 12:38:08","description":"Levels of trapping to supply restaurants are around their highest since monitoring began in 2002.","filename":"data/vaneerConsumption/Morethan800000songbirdsillegallykilledonMoDbaseinCyprusRSPBwarns.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/13/wire-228577-1489670610-878_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4320074_More-800-000-songbirds-illegally-killed-MoD-base-Cyprus-RSPB-warns_1540260745.html","title":"More than 800,000 songbirds illegally killed on MoD base in Cyprus, RSPB warns","title_page":"More than 800,000 songbirds illegally killed on MoD base in Cyprus, RSPB warns | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"More than 800,000 songbirds were illegally killed on a British military base in Cyprus in the autumn to supply restaurants serving a local delicacy, environmentalists said.\nLevels of illegal trapping of birds such as robins and black caps remain around their highest levels at the British territory since monitoring began in 2002, the RSPB and Birdlife Cyprus said.\nAnd efforts to remove non-native Australian acacia trees which have been planted on Ministry of Defence land to lure the birds have stalled after the trappers organised large protests and a blockade.\nThe conservation groups called for urgent support from the UK Government to ensure the removal of the invasive trees continues, and for the Republic of Cyprus to crack down on black market restaurants which serve songbirds.\nBirds are caught to provide restaurants with the main ingredient for the local delicacy ambelopoulia – a plate of cooked songbirds.\nThe illegal activity is being driven by organised crime gangs who make millions from the trade, a report from the conservation groups said, and there has been an increase of 183% in the number of nets used to trap birds since monitoring began in 2002.\nA plate of cooked songbirds (RSPB/PA)\nBetween August and October 2016, the British Sovereign Base Area police force, backed by specialists from RSPB Investigations staff, opened more cases and confiscated more mist nets used to trap the birds than ever previously recorded.\nBut efforts to remove acacias were largely abandoned in 2016, after 54 acres were taken out in the preceding two years. Only seven acres were removed last autumn, leaving 90 acres still standing on the British firing range, the RSPB and Birdlife Cyprus said.\nMartin Harper, RSPB conservation director, said: “This report sadly highlights that the British base is the number one bird killing hotspot on the whole island of Cyprus. Many much loved garden bird species are being trapped and killed for huge profit by criminal gangs.”\nOverall some 1.7 million birds could have been killed within the conservationists’ survey area, covering both the British base and Cyprus Republic areas, and almost 2.3 million across the whole of Cyprus, the report said.\nNets for trapping songbirds\nMartin Hellicar, director of BirdLife Cyprus, said: “While our latest findings clearly show that the worst bird killing hotspot in Cyprus remains on Ministry of Defence land, we cannot ignore the distasteful fact that the restaurants serving trapped birds operate within the Cyprus Republic.\n“Enforcement against these law-breaking restaurants has been limited, at best, in recent years, and the Cypriot authorities must change this.”\nA Ministry of Defence spokesman said: “We’re committed to tackling illegal bird trapping and the RSPB has recognised our increased enforcement activity which has led to a record number of arrests, equipment seizures, prosecutions and fines.\n“For the second year running we’ve halted the rising trend in the numbers of birds being killed by poachers and we continue to work with the RSPB and Birdlife Cyprus to implement a long-term strategy to reduce this number.”","url":"https://www.dailymail.co.uk/wires/pa/article-4320074/More-800-000-songbirds-illegally-killed-MoD-base-Cyprus-RSPB-warns.html"}
