{"authors":["Neil Munro"],"date_download":"2018-10-30 19:07:03","date_modify":"2018-10-30 19:07:03","date_publish":"2015-11-18 16:02:23","description":"Many Foreign Professionals Rushing Through Immigration Back-Door Opened By Obama","filename":"data/vaneerConsumption/MoreForeignProfessionalsUseObamasImmigrationBackDoor.json","image_url":"https://media.breitbart.com/media/2015/11/GettyImages-150937277-camera.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_18__1540926423.html","title":"More Foreign Professionals Use Obama's Immigration Back-Door","title_page":"More Foreign Professionals Use Obama's Immigration Back-Door","title_rss":"NULL","source_domain":"breitbart.com","text":"President Barack Obama is quietly opening another immigration door just for foreign professionals —and 120,000 overseas graduates are rationally rushing in to snag U.S. white-collar jobs and the chance to win the greatest prize on the planet: American citizenship.\nThe growing rush was highlighted Nov. 16 by the New-York-based Institute of International Education, which showed a dramatic increase in foreign professionals joining the the “Optional Practical Training” visa program.\nThe OPT program allows foreign graduates of U.S. colleges to work in the United States for up to 29 months in a wide variety of white-collar business, video, journalism, art, medical and technology jobs.\nObama’s deputies have already broadened the types of jobs that can be taken, and are now expanding the visa term up to three years, or up to six years if the foreigner gets two degrees from U.S. colleges, despite pushback from Iowa Republican Sen. Chuck Grassley.\nThe number of OPT participants jumped from 76,031 in the 2010/2011 sch0ol year, up to 120,287 in the 2014/15 school year, according to the N.Y.-based Institute of International Education. That is a 71 percent increase in four years.\nThe OPT number grew by 13.5 percent, or 14,000 people, in the 2014/2015 school year, according to the institute’s “Fast Facts” data.\nAll foreign graduates can join the OPT program for one year. Graduates who study math, science, engineering or science can work for 29 months in a growing variety of jobs. Those criteria are so broad that they allow foreign business graduates to compete for U.S. white-collar jobs.\nThe number of foreign students who are studying for a business or science degree that will make them eligible for the OPT program jumped by roughly 9 percent in the past year, up to roughly 630,000 in the 2014/2015 school year. That’s one-year jump of roughly 66,000 potential OPT professionals.\nThere is no cap on the OPT program, so the current growth-rate could push the OPT program up to 200,000 foreign professionals by the 2018/9 academic year.\nIt is equal to half the bachelors business-degrees awarded in 2012, and almost twice the number of bachelors degrees awarded in “communications, journalism, and communications technologies.” It is almost twice the number of 2012 engineering degrees, almost twice as many “biological and biomedical sciences” degrees three times the number of “computer and information sciences” degrees.\nThe extra OPT inflow adds to the existing population of foreign white-collar professionals temporarily working in the U.S Those professionals hold H-1B, H, and L visas in the United States. The resident population of foreign professionals is now at least 650,000 professionals, and they are working in a wide variety of professional jobs at universities, accounting firms, hospitals, and technology firms.\nThe number of foreign professionals inside the United States will also grow much larger if Congress approves Obama’s pending Pacific-wide free-trade treaty.\nThe OPT program was created to cut the wages of Americans professionals in accounting, consulting, management, technology and many other sectors, said Ian Smith, an attorney in Washington, D.C., who works for the Immigration Reform Law Institute.\nAs more OPTs flood into the U.S. labor market, “experienced [American professionals] will either not be hired or will be replaced… and their [college-graduate] kids are going to be hurt by compressed wages from more artificial competition,” he said.\n“The middle class,” Smith said, “should definitely see themselves as completely targeted by executives and shareholders and the global business elite.”\nThe OPT program is strongly supported by business groups, universities, progressives and Obama because it transfers wealth and political influence from America’s professional class to progressives and business interests. There’s little chance that the OPT program can be amended or ended until Obama is replaced by a pro-American president.\nOPT is very valuable for universities, because they can provide fee-paying foreign customers with a work permit that lasts for at least 12 months.\nObama’s deputies are trying to expand the OPT program, despite being rebuffed by an August court defeat. Under long-standing rules, they have posted their planned regulation online, and the public is allowed to file comments until midnight, Nov. 18. Additional public objections may help civil-rights lawyers stop the planned expansion.\nIn 2012, Obama’s deputies expanded the list of jobs open to OPTs. The list now includes archeologists and architects, food science and environmental studies, forestry and teaching, mining, design, biology, military skills, astronomy and atmospheric science, veterinary and nuclear science, and much else.\nFor the last 10 years, the little-known program has grown rapidly with minimal notice from the public, the media or from politicians, even as public anger has grown over the outsourcing of professional jobs via the H-1B program.\nThe OPT programs’s many scandals have not been highlighted by the established media, even though the program undercuts and sidelines the expensively-educated siblings, spouses, children and neighbors of many influential politicians, journalists, political advocates and civil servants.\nFor example, the OPT program allows employers to save roughly $10,000 in Social Security taxes over 29 months if they hire a foreigner instead of an American, said David North, an expert on the program at the Center for Immigration Studies. “As a rule of thumb… the employees are getting a $10,000 break by hiring an alien instead of a citizen,” he told Breitbart.\nThat large saving puts Americans at a competitive disadvantage in a labor market already flooded with foreign white-collar and blue-collar labor. In 2013, for example, the autopilot 1965 immigration law and Obama’s pro-foreigner policies added roughly 2.1 million foreigners to the labor market, just as 4.4 million young Americans began looking for jobs. That year, wages flatlined, profits soared and a major stock-market index jumped by $5 trillion.\nThe OPT program also allows foreign graduates of American colleges to begin working their way towards citizenship. Once naturalized, they can bring their siblings and retired parents — plus their own children — into the United States. That path to citizenship typically starts with an OPT job, then a H-1B job and then — perhaps — a work-permit, a Green Card and eventually citizenship.\nObama’s deputies are also drafting regulations to help foreign professionals working on OPT and H-1B visas to win work-permits, which put them on a predictable path to citizenship.\nCitizenship a hugely valuable prize for any foreigner — and a huge incentive to work for low-wages in the United States. For guest-workers seeking citizenship, it is a government-provided delayed payout earned by working long hours and for low wages over a decade. That means it is also a government-provided subsidy to profit-seeking employers who hire cheap foreign workers instead of native-born Americans.","url":"https://www.breitbart.com/politics/2015/11/18/120000-foreign-professionals-rushing-immigration-back-door-opened-obama/"}
