{"authors":[],"date_download":"2018-10-30 14:13:11","date_modify":"2018-10-30 14:13:11","date_publish":"2016-11-02 12:40:00","description":"Georgia is looking into reports of more voting machines 'flipping' votes after Democratic complaints voters had trouble choosing Clinton over Trump.","filename":"data/vaneerConsumption/MoreGeorgiavotingmachinesunderreviewforflippingvotes.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/11/02/Images/newsEngin.16661818_103016-ELX-Earlyvote-2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_aa008247c4b2ca82935935dead165861__1540908791.html","title":"More Georgia voting machines under review for 'flipping' votes","title_page":"More Georgia voting machines under review for 'flipping' votes","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia is investigating more reports of voting machines ‘flipping’ voters’ presidential choices, although the problems remain isolated amid what may be a record turnout during the state’s early voting period ahead of Tuesday’s presidential election.\nThe Georgia Secretary of State’s Office confirmed to The Atlanta Journal-Constitution that it has opened investigations into four additional counties including Baldwin, Clayton, Cobb and Coweta. In each instance, the office received notice from state Democratic officials of an individual voter in each of those counties who reported a problem with an individual machine. Officials removed a machine in Bryan County last week after the AJC reported a similar problem, and that original investigation remains open.\nThe decision comes as the AJC obtained a letter sent Tuesday by Georgia Democrats in Congress to U.S. Attorney General Loretta Lynch. Citing the AJC report last week, the letter urges the Justice Department to consider sending poll monitors “or any other election monitoring resource” to Georgia on Election Day. State officials, however, said voters should be confident in an election system that a vast majority of voters have used without a hiccup.\n“Out of nearly 2 million votes cast, there have only been a few isolated issues reported,” said David Dove, chief of staff and legal counsel in the Secretary of State’s Office. “We are currently investigating those incidents. There is no evidence of any widespread problems.”\nOfficials said the Bryan County malfunction was likely due to a calibration issue involving the touchscreen. Dove said last week that the county did not properly conduct testing on the machine to confirm it could accurately capture a voter’s choice. Problems with other machines would likely also be caused by a similar issue, although state officials will be looking to see if they can replicate the problem reported by voters.\nThe instances now being investigated by the state all involve voters who said the machines initially switched their votes from Democratic presidential nominee Hillary Clinton to Republican hopeful Donald Trump. All indicated, however, that they were able to correct the problem and properly record their votes. While isolated problems are bound to happen in every election, the problems this fall are coming during a time of heightened rhetoric over Trump’s claim of a “rigged” election and national concern over the security of the nation’s voting system.\nThe Georgia NAACP said last week it had also heard of isolated, unconfirmed issues in a handful of counties including Putnam, where state officials sent an investigator who could not replicate the problem. The state is looking into whether local election officials in Putnam properly tested their machines.\nDove — whose boss, Georgia Secretary of State Brian Kemp, is a Republican — said the state views the issue as nonpartisan and is committed to making sure every vote cast is accurate. The office’s top priority, he said, was “to ensure secure, accessible, and fair elections in Georgia.”\n“Voters should trust the local elections officials and their county elections boards, which are made up of Democrats and Republicans,” Dove said. “When they call our office reporting these issues,” he added, the reports are treated as “real and not politics”\nIn the meantime, state officials are encouraging voters to double-check their choices on the summary screen of the machines they vote on to make sure everything is correct before they officially cast their ballot. If voters have any questions or concerns while voting, they are encouraged to speak up and ask poll workers for help.\nEarly voting continues through Friday, the state’s deadline for early ballots. Polls will be closed through the weekend and Monday. They re-open 7 a.m. through 7 p.m. on Tuesday, Election Day.\nRead more:\nEarly voting in metro Atlanta ends Friday\nHow to vote in Georgia for the Nov. 8, 2016 election\nWhere to vote in Georgia on election day","url":"https://www.ajc.com/news/state--regional-govt--politics/state-looking-reports-more-georgia-vote-machines-flipping-votes/gjapagdPtQbxsn7ZZMTqXN/"}
