{"authors":["Zoe Szathmary For Dailymail.Com"],"date_download":"2018-10-22 23:50:18","date_modify":"2018-10-22 23:50:18","date_publish":"2016-01-11 07:37:44","description":"Davis Hospital and Medical Center and McKay-Dee Hospital employed Elet Neilson, who has the genotype 2b strain.","filename":"data/vaneerConsumption/Morethan7000patientsfearedexposedtohepatitisCattwoUtahhospitals.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/07/300596C500000578-0-image-a-49_1452497439927.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393480_We-consider-outbreak-7-000-patients-feared-exposed-hepatitis-C-coming-contact-infected-nurse-two-Utah-hospitals_1540252218.html","title":"More than 7,000 patients feared exposed to hepatitis C at two Utah hospitals","title_page":"More than 7,000 patients feared exposed to hepatitis C at two Utah hospitals | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Davis Hospital and Medical Center and McKay-Dee Hospital employed Elet Neilson, who has hepatitis C\nPatients possibly came into contact with hepatitis C at two hospitals in Utah, where a 49-year-old nurse with the disease had worked.\nDavis Hospital and Medical Center and McKay-Dee Hospital employed Elet Neilson, who has the genotype 2b strain, Fox 13 reported.\nThe news station reported Neilson entered a guilty plea for an attempted possession of a controlled substance misdemeanor charge.\nScroll down for video\nAccording to Fox 13, she was ordered to pay a fine and did not serve any jail time.\nThe news outlet reported 35 percent of those who received letters about free testing did so - out of 7200 people total.\nJanuary 31 is the last day for free tests.\nThe CDC's Dr. Angela Dunn told KUTV: 'So we don't know exactly how it happened; all we know is we have two cases that are related.\n'And one of the cases is a healthcare provider that was working in the emergency department and fired for using medications illegally.'\nReferring to one patient with hepatitis C who was a blood donor, Dunn told the CBS station: 'This person had no risk factors, so we looked into his medical history and identified his visit at the McKay-Dee medical center as his only risk factor.\n'And then having been treated by this healthcare provider who also had hepatitis C and was diverting drugs.'\nDavis Hospital and Medical Center in Layton, Utah, is seen here, one of the hospitals where Neilson worked\nDunn explained to Fox 13: 'People can have no symptoms for decades and then all of the sudden their liver will start failing and that's a deadly part of the disease.\n'So it's important to be identified early in the disease course when people don't have symptoms so they can get effective treatment.'\nKUTV identified June 2011 - April 2014 and June 2012 - November 2014 as the exposure periods for Davis Hospital and Medical Center and Mckay-Dee Hospital, respectively.\nDunn told the Standard-Examiner: 'We do consider this an outbreak.\n'When we have two or more hepatitis C-related infections, we consider it an outbreak.'\nMcKay-Dee Hospital in Ogen, Utah, is pictured in this Google image","url":"https://www.dailymail.co.uk/news/article-3393480/We-consider-outbreak-7-000-patients-feared-exposed-hepatitis-C-coming-contact-infected-nurse-two-Utah-hospitals.html"}
