{"authors":["Business Insider Intelligence"],"date_download":"2018-10-30 22:05:52","date_modify":"2018-10-30 22:05:52","date_publish":"2016-12-15 00:00:00","description":null,"filename":"data/vaneerConsumption/Morebanksareclosingasdigitalbankingbooms.json","image_url":"https://amp.businessinsider.com/images/5852e154a1a45e38468b5b0b-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_more-banks-are-closing-as-digital-banking-booms-2016-12_1540937152.html","title":"More banks are closing as digital banking booms","title_page":"    More banks are closing as digital banking booms - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"BII This story was delivered to BI Intelligence \"Fintech Briefing\" subscribers. To learn more and subscribe, please click here.\nBritish bank branch closures are continuing apace, according to the BBC.\nNew research by Which?, the leading UK consumer organization, has shown that 1,045 branches have closed in the last two years — HSBC closed 27% of its branches, while Lloyds closed 14%. The smaller Co-operative Bank closed a whopping 53% of its branches.\nBanks say they are closing branches because people are using them less, in favor of digital banking. HSBC said that branch visits are down by 40%, with 93% of customers now making contact with the bank via phone calls, the internet, or smartphone, according to the BBC. Lloyds, meanwhile, plans to speed up its branch closure program in 2017 due to fewer customers visiting its branches in person.\nOther evidence supports the banks' claims that people are turning to digital channels — the British Bankers Association (BBA) found that banking app downloads rose by 25% from 2014 to 2015, while app logins rose by 50% over the same period.\nHowever, branch closures mean banks risk failing some customers and losing business as a result. Which? pointed out that while 56% of adults used online banking last year, there are still 20 million adults who do not or cannot use these services. That's partly due to poor broadband connection in rural parts of the UK, and a lack of tech savvy among the elderly or people with learning difficulties.\nBy closing branches, banks risk alienating these sections of society, could suffer reputational damage, and may even see revenue loss. A recent survey from Bain found that around 40% of global customers who experienced a branch closure took their business to another bank. This suggests that while adapting to consumer preferences and technological change is important, it is also necessary for banks to ensure they continue to cater to all consumer segments.\nMore millennials are moving toward digital banking, and as a result, they're walking into their banks' traditional brick-and-mortar branches less often than ever before.\nThis generation accounts for the greatest share of the U.S. population at 26% and the employed population at 34%, so it's easy to see why their behaviors and preferences will have a profound effect on the future of the banking industry, particularly with regard to the way banks interact with their customers.\nThird parties are expanding their role in providing services that consumers use to manage their money. And the more that role grows, the more it will disrupt the relationship between banks and their customers.\nTo paint a clearer picture of the future of the banking industry, John Heggestuen, managing research analyst at BI Intelligence, Business Insider's premium research service, surveyed 1,500 banked millennials (ages 18-34) on their banking behaviors and preferences — from their preferred banking devices, to what banking actions they perform on those devices, to how often they perform them.\nAll of that rigorous research led to an essential report entitled The Digital Disruption of Retail Banking that dives deep into the industry and details what its future will look like.\nHere are some of the key takeaways from the report:\nThe bank branch will become obsolete. It will be some time before the final death rattle, but improving online channels, declining branch visits, and the rising cost per transaction at branches are collectively leading to branch closures.\nBanks that don't act fast are going to lose relationships with customers. Consumers are increasingly opting for digital banking services provided by third-party tech firms. This is disrupting the relationships between banks and their customers, and banks are losing out on branding and cross-selling opportunities. For many banks, this will require further commoditization of their products and services.\nThe ATM will go the way of the phone booth. Relatively low operational costs compared to bank branches, paired with customers' preference for in-network ATMs, makes the ATM an attractive substitute for bank tellers. But as cash and check transactions decline, the ATM will become nonessential, ultimately facing the same fate as the physical branch.\nThe smartphone will become the foundational banking channel. As the primary computing device, the smartphone has the potential to know much more about banks' customers than human advisors do. The smartphone goes everywhere its user goes, has the ability to collect user data, and is already used for making purchases. Therefore, the banks that will endure will be those that offer banking services optimized for the smartphone.","url":"https://www.businessinsider.com/more-banks-are-closing-as-digital-banking-booms-2016-12"}
