{"authors":[],"date_download":"2018-10-23 00:27:45","date_modify":"2018-10-23 00:27:45","date_publish":"2017-03-16 09:43:14","description":"Iraqi authorities said Thursday that more than 150,000 people have fled fighting in and around west Mosul since security forces launched an operation to...","filename":"data/vaneerConsumption/Morethan150000IraqisfledwestMosulfightingministry.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/09/wire-227533-1489657402-114_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4319452_More-150-000-Iraqis-fled-west-Mosul-fighting-ministry_1540254465.html","title":"More than 150,000 Iraqis fled west Mosul fighting: ministry","title_page":"More than 150,000 Iraqis fled west Mosul fighting: ministry | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Residents of west Mosul flee the city on March 14, 2017, among more than 150,000 that have been displaced by the offensive government forces launched against the Islamic State group last month\nIraqi authorities said Thursday that more than 150,000 people have fled fighting in and around west Mosul since security forces launched an operation to retake it from jihadists last month.\nThe International Organization for Migration released displacement figures on Wednesday indicating that nearly 100,000 had fled, but those statistics included fewer people residing outside of camps.\nAccording to Iraq's ministry of migration and displaced, 152,857 people have fled the west Mosul area since the battle to recapture it from the Islamic State group began on February 19.\nMore than 98,000 are housed in camps, while more than 54,000 are staying in areas that have been recaptured from IS, the ministry said.\nResidents of west Mosul flee the city on March 15, 2017, among more than 150,000 people who have been displaced by the offensive government forces launched against the Islamic State group last month\nIS overran large areas north and west of Baghdad in 2014, but Iraqi forces backed by US-led air strikes have since retaken most of the territory they lost.\nIraqi forces launched the operation to recapture Mosul from IS in October, retaking the east of the city before setting their sights on the smaller but more densely populated west.\nThey have made steady progress against the jihadists, retaking a series of neighbourhoods and important sites including the airport, the train station, Mosul museum and the provincial government headquarters.\nBut the pace of the advance has been periodically slowed by bad weather, which makes air strikes more difficult and turns dirt streets into avenues of thick mud.","url":"https://www.dailymail.co.uk/wires/afp/article-4319452/More-150-000-Iraqis-fled-west-Mosul-fighting-ministry.html"}
