{"authors":[],"date_download":"2018-10-30 01:18:11","date_modify":"2018-10-30 01:18:11","date_publish":"2018-08-02 13:24:40","description":null,"filename":"data/vaneerConsumption/MoreMoneyforAlbanyLessPowerinWashington.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/08/Empire_State_Plaza_Albany_New_York_34776968311_cropped-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862291.html","title":"More Money for Albany, Less Power in Washington","title_page":"More Money for Albany, Less Power in WashingtonThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"House Republicans seek to extend the Trump tax reforms that sunset in 2025 through something called Tax Reform 2.0. House Ways and Means Committee Chairman Kevin Brady (R-TX) says this effort to permanentize last December’s reforms includes the limitation on the state and local tax (SALT) deduction.\n“We think out of fairness that cap ought to remain,” Brady explains, adding that despite the limitation, the $10,000 allowed in SALT deductions “covers the vast majority of Americans.”\nBut it does not cover the vast majority of New Yorkers, who claimed an average of over $22,000 in SALT deductions for the 2015 tax year. So, the Empire State, and several other high-tax states, filed a far-fetched lawsuit in July that calls Congress’s exercise of its taxing authority unconstitutional. The Constitution, which explains, “The Congress shall have Power to lay and collect Taxes,” appears to disagree. The Sixteenth Amendment provided further powers: “The Congress shall have power to lay and collect taxes on incomes, from whatever source derived, without apportionment among the several States, and without regard to any census or enumeration.”\nNew York, Connecticut, New Jersey, and Maryland challenge that power, on constitutional grounds no less, in the lawsuit.\n“The Founders were deeply concerned that the federal government would exercise its tax power to encroach upon the original and sovereign authority of the States to raise revenues through taxes,” the lawsuit claims. “To avoid this possibility, the Founders reserved to the States concurrent authority to levy taxes. When the Constitution was ratified, it was widely understood that the federal government could not abrogate the States’ sovereign tax authority, and that the federalism principles embedded in the Constitution would constrain the federal government’s tax power.”\nBut New York, Connecticut, New Jersey, and Maryland remain free to cut, raise, or keep their current rates. The cap on the SALT deduction no longer rewards them, or at least no longer does so in such an exorbitant way, for keeping taxes high. Filers more or less pay the state rate and the federal rate, instead of paying less to the feds on account of paying more to the state.\nThe four states suing the federal government lack the might they once wielded in part because of the greed of elected officials. In enriching their power, these politicians eroded the power of their states. The four suing states boasted 88 electoral votes in 1960. Today, they count 60 votes between them. High taxes have consequences. Amassing more power in Albany meant surrendering it in Washington.\nLike the lawsuit, permanentizing the SALT deduction cap seems, at least at this time, unlikely. Its proponents released something called “A House GOP Listening Session Framework.” But an actual bill, let alone a vote, remains elusive.\nApart from the litigation, high-tax states explore the option of replacing income with payroll taxes or relabeling income taxes as charitable donations as a means of avoiding the SALT deduction cap’s negative impact on high earners. One unexplored course of action involves cutting taxes. So anathema does this option strike local lawmakers that they entertain Orwellian endarounds on the law (and language) and call “unconstitutional” what plainly appears in the Constitution. Nothing seems sacred save for a nine percent or higher state income tax rate.\nCalifornia currently features a 13.3 percent tax on the highest earners. Hawaii imposes an 11 percent tax. In Minnesota and Oregon, rates near 10 percent.\nThe states possess the power to reduce the burden unleashed by the SALT deduction cap by reducing the burden of their own onerous rates. And in exercising this power at the state level, they may find that they gain more of it nationally.\nHunt Lawrence is a New York-based investor. Daniel Flynn is the author of five books.","url":"https://spectator.org/more-money-for-albany-less-power-in-washington/"}
