{"authors":[],"date_download":"2018-10-22 20:28:23","date_modify":"2018-10-22 20:28:23","date_publish":"2014-06-01 11:56:04","description":"Adding a cheap, older chemotherapy drug to the treatment for advanced prostate cancer can help men live longer, researchers report.","filename":"data/vaneerConsumption/MoreChemoEqualsLongerLifeForSomeProstateCancerPatients.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_22/480071/140601-chemotherapy-jsw-1034a_d68711d64905994b1c5d795a6fa91f76.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_cancer_more-chemo-equals-longer-life-some-prostate-cancer-patients-n119566_1540240103.html","title":"More Chemo Equals Longer Life For Some Prostate Cancer Patients","title_page":"More Chemo Equals Longer Life For Some Prostate Cancer Patients","title_rss":"NULL","source_domain":"nbcnews.com","text":"It’s a surprising reversal of the latest common wisdom, which is that less treatment is often better for cancer patients.\nThe extra upfront treatment improved survival by 39 percent in the men in the study, whose prostate cancer had spread to their bones or elsewhere – patients who often have little hope.\n“This is one of the biggest improvements in survival we have seen in patients with adult solid metastatic tumors,” said Dr. Christopher Sweeney of the Dana-Farber Cancer Institute in Boston, who helped lead the study.\nA common treatment for men whose prostate cancer has spread is called androgen suppression or chemical castration – drugs are used to cut production of testosterone, which feeds the tumor. Sometimes the cancer keeps growing, anyway, and the question has been when to add more chemotherapy.\nDoctors are reluctant to do too much too soon, because chemo can be toxic. “Do you throw everything at the patient in the beginning or do you wait?” asked Dr. Clifford Hudis, president of the American Society for Clinical Oncology, which highlighted the findings at its annual meeting.\nSweeney’s government-funded team studied 790 men who got either chemical castration alone or with the drug docetaxel, sold under the brand name Taxotere but also available as a cheaper generic version.\nAfter two and a half years, 136 men who got hormone treatment alone had died, compared to 101 men who got both drugs.\n“This study shows a remarkable and meaningful prolongation in survival for advanced prostate cancer,” Hudis said.\nMore than 240,000 men are diagnosed with prostate cancer in a year and close to 30,000 die from it.\n“This will engender controversy because the chemo drug is not without controversy,” Hudis told NBC News. “They are talking about survival. They are not just talking about disease control.”\nOne of the men who got docetaxel died because of side effects of the treatment, but for the most part the extra drug did not make the patients sicker. Sweeney pointed out it’s important for doctors to make sure men are healthy enough to stand it.\n“Some patients are too frail for chemotherapy,” Sweeney told a news conference. “It is a little difficult for an 80-year-old to get chemotherapy.”\nHudis, who is also an oncologist at the Memorial Sloan-Kettering Cancer Center, said the findings were only possible because of government-funded cancer research. “These are often studies that industry is less interested in performing, for example finding a new use for an old drug,” he said.","url":"https://www.nbcnews.com/health/cancer/more-chemo-equals-longer-life-some-prostate-cancer-patients-n119566"}
