{"authors":[],"date_download":"2018-10-30 20:19:51","date_modify":"2018-10-30 20:19:51","date_publish":"2015-12-28 11:43:06","description":"Metro Atlanta will get a small reprieve from the soggy conditions Tuesday, when there’s only a 30 percent of rain in the forecast.","filename":"data/vaneerConsumption/Morerainonthewayfollowedbycoolertemperatures.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/29/Images/photos.medleyphoto.8532340.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/weather_more-rain-the-way-followed-cooler-temperatures__1540930791.html","title":"More rain on the way, followed by cooler temperatures","title_page":"More rain on the way, followed by cooler temperatures","title_rss":"NULL","source_domain":"ajc.com","text":"Metro Atlanta will get a small reprieve from the soggy conditions Tuesday, when there’s only a 30 percent of rain in the forecast. But there won’t be time for things to dry out.\nThat’s because more rain is on the way, according to Channel 2 Action News meteorologist Brad Nitz. The chance of rain climbs to 100 percent for Wednesday, when heavy rain and thunderstorms return.\nAs much as 5 inches of rain could fall by Wednesday night, prompting the National Weather Service to issue a flood warning for parts of DeKalb and Fulton counties until further notice. A flood watch is also in place for most of north Georgia.\nMore rain was the last thing needed in parts of northwest Georgia, where overflowing rivers led to flooded streets.\nMonday morning in Gordon County, the bodies of two men were pulled from separate bodies of water, both apparent drowning victims. Rain late Monday forced county leaders to close additional roads.\nTemperatures will reach the upper 60s for both Tuesday and Wednesday, with lows in the upper 50s, before the next major change in the forecast arrives. The unseasonably warm weather will turn much cooler by the weekend, Nitz said.\nFriday’s forecast is a dry one, but highs will top out at around 50 degrees before dropping into the 30s overnight, Nitz said. Expect more sunshine Saturday, when temperatures may not climb out of the 40s.","url":"https://www.ajc.com/weather/more-rain-the-way-followed-cooler-temperatures/3lpgXMWN5Ju8lJjF0DZorL/"}
