{"authors":[],"date_download":"2018-10-30 01:24:05","date_modify":"2018-10-30 01:24:05","date_publish":"2016-04-22 04:00:00","description":"Everyone knows recycling is good for the planet, but isn’t it nice when going green is not only good for the environment — but also your wallet?","filename":"data/vaneerConsumption/Morethan12easywaysgoinggreeninAtlantacansaveyoumoney.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/04/22/Images/photos.medleyphoto.9465399.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/lifestyles_environment_more_0803a5985a0ad54ccbdf6a0ea4154a97__1540862645.html","title":"More than 12 easy ways going green in Atlanta can save you money","title_page":"More than 12 easy ways going green in Atlanta can save you money","title_rss":"NULL","source_domain":"ajc.com","text":"Everyone knows recycling is good for the planet, but isn’t it nice when going green is not only good for the environment — but also your wallet?\nThere are many ways recycling and protecting the Earth can save you money and in some cases earn you cash.\nHere’s a look at more than 12 ways:\nJoin the Freecycle Network and get (and give) free stuff.\nThe Freecycle Network is a nonprofit movement of people dedicated to keeping good items out of landfills. With several groups in metro Atlanta, you can find things such as TVs, toys, children’s clothing, furniture — even free packing boxes. The Freecycle Network is made up of 5,286 groups with 9,127,254 members around the world. Each local group is moderated by volunteers. Membership is free. https://www.freecycle.org/\nEarth Day. (Via Flickr/for the AJC)\nSell your clothes to local thrift stores.\nWe all have those nice pieces in our wardrobe we can’t part with, but if it doesn’t fit or if it’s a piece of clothing you haven’t worn in several months, it’s a good time to think about selling it. A recent piece by Atlanta Journal-Constitution shopping writer Nedra Rhone offers the following tips: get the season right (if you are cleaning out your winter merchandise now, it’s way too late) and know the ropes. In general, you get more money by selling on consignment versus selling for cash, but you wait longer for the payment. Policies may vary by store, but at Buffalo Exchange on Ponce de Leon in Atlanta (http://www.buffaloexchange.com/locations/atlanta/atlanta/ ), when you sell an item you get 30 percent of the selling price in cash or 50 percent in store trade. First-time consignors at Finders Keepers, with Decatur-area and Avondale Estates locations (http://www.fkconsign.com/), must have at least 10 items to create an account. If an item doesn’t sell at the initial price, it is marked down over a 60-day period, then donated. The percentage the consignor receives from the items that sell depends on the actual selling price — you get a higher percentage (up to 60 percent) for items that sell for more money. A few years ago, Rhone made the rounds of local resale and consignment stores. She didn’t make a lot of money selling for cash ($25 for 11 items of mall-brand clothing). Consigning earned about $200, but that was over a period of six months. But remember, recycling unwanted clothing reduces landfill waste as well as the amount of resources needed to produce new clothing.\nIf you haven’t already, it’s time to buy a water bottle.\nIt’s estimated that each day in the United States more than 60 million plastic water bottles are thrown away. Refilling your own water bottles at home or work is an easy way to protect our resources. And you can also save money. Each bottled water costs about a buck or more.\nBorrow instead of buying.\nYou can borrow books and movies from the library. Checking out a book saves money, not to mention the ink and paper that goes into printing new books. Another great way to take a book? Leave a book at Little Free Libraries, which dot metro Atlanta. A growing trend nationally, the wee structures, most about the size of a birdhouse, are a way for neighbors to share books. Maybe there’s one — or more — in your neighborhood. Check out a map of Little Free Libraries at https://littlefreelibrary.org/ourmap/.\nStop driving solo to work.\nWalk or bike to work. This saves on gas and parking costs while improving your cardiovascular health and reducing your risk of obesity. Also consider carpooling. The Clean Air Campaign (http://cleanaircampaign.org/) can help employees find carpooling solutions to lessen our carbon footprint. GA Commute Options offers cash incentives for carpooling.\nWATCH: Origin of Earth Day\nRELATED: Earth Day 2017 Celebration on April 22\nThe Worldwatch Institute, a global environmental organization, offers the following ideas on how you can go green and save green at home and the office:\nSet your thermostat a few degrees lower in the winter and a few degrees higher in the summer to save on heating and cooling costs.\nInstall compact fluorescent light bulbs (CFLs) when your older incandescent bulbs burn out.","url":"https://www.ajc.com/lifestyles/environment/more-than-easy-ways-going-green-atlanta-can-save-you-money/2DF8JDeTLDE6E5hSumVK2H/"}
