{"authors":[],"date_download":"2018-10-30 01:14:04","date_modify":"2018-10-30 01:14:04","date_publish":"2014-09-13 00:00:00","description":null,"filename":"data/vaneerConsumption/Morecostlyfreestuffinthelandofentitlements.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2014_09_more_costly_free_stuff_in_the_land_of_entitlements_1540862044.html","title":"More costly free stuff in the land of entitlements","title_page":"More costly free stuff in the land of entitlements","title_rss":"NULL","source_domain":"americanthinker.com","text":"Chicago- - coincidentally home of President Barack Obama (D) - has, temporarily I'm sure, done better than generous California in free stuff. The Chicago Public Schools are now offering Michelle Obama-approved free lunches for all! And while they're generously at it, free breakfasts too!\nYep, no such thing as student embarrassment when the so called required family income documents for free lunch indicate the sucker parent(s) earn so much that the student only qualifies for reduced price lunch or - horrors!, even worse - must pay full price. Or...must bring a lunch from home!\nAll this new benevolence, leading to additional government dependency, will supposedly eliminate fraud and ease administration of the school lunch program for the school administration. Not to mention qualify and reward the Chicago Public School district- - and the dependent parents - for even more federal $$$ for valiantly increasing the number of children \"living at the poverty level.\"\nThe high number of students living at the poverty level in the district qualified CPS to meet the required threshold for full reimbursement by the U.S. Department of Agriculture, according to CPS officials. (snip) The district expects to serve 72 million meals to students in the coming year, two million more than during the last school year. “If a student eats that day, the district gets reimbursed,” said Leslie Fowler, executive director of CPS’ nutritional support services. “But if they don’t eat, then CPS doesn’t get reimbursed and there’s no cost associated with that meal. We can’t predict what they do or don’t do, but we hope we can encourage them to participate.” In the past, the school district’s free and reduced lunch program for financially eligible students was fraught with fraud. Several CPS school officials, including principals and assistant principals, were accused by the district’s Inspector General of providing false income information on applications for the free lunch program. A 2012 Tribune analysis highlighted flaws in the federal free lunch program, in which school districts have been rewarded for enrolling as many students as possible. The free lunch numbers are then used to help determine poverty levels that can contribute billions of dollars to districts. On Thursday, Fowler said making lunch free for all would put an end to fraudulent applications submitted for the free and reduced lunch program. “Absolutely, because we’re not relying on those documents anymore,” she said.\nApparently Obama's former fellow Hyde Park resident, a genuine University of Chicago Professor (Economics) and genuine Nobel Prize winner (Economics) was wrong, wrong, wrong when he wrote - and supposedly proved - \"There's No Such Thing as a Free Lunch\" among other free (whoops, there's that word again) market treatises. Therefore, the concept must be pure science fiction, despite award winning science fiction author Robert A. Heinlein's eerily 1966 prophetic award winning \"The Moon Is a Harsh Mistress,\" which popularized the acronym, TANSTAAFL, (there ain't no such thing as a free lunch.)\nBut what happens to the students on weekends and vacations? What about dinner? What do they eat when they can't get their free school lunch or breakfast? Freed (that word just keeps popping up) from buying and preparing these essential meals during the week, certainly the students' parents have the time and money, plus enough food stamps, to purchase the basics for healthy meals at home which also strengthens the parent-child bond and the parents' sense of responsibility to their children. Not according to the professional enablers. For instance, Feeding America provides weekend food for those times when parents won't. (And to be fair, when a few can't.)\nHow can a child focus on solving a math problem or memorizing a new word when she or he is trying to ignore the persistent pangs of hunger? Across the country, teachers and school nurses have found that in some instances, Monday morning comes and they are forced to compete against hunger for the attention of their students. More than 18 million children qualify for free or reduced price meals through the National School Lunch Program, the fuel that they need to get them through the week. What happens to these children when they go home over the weekend? For more than 15 years, the Feeding America BackPack Program has been helping children get the nutritious and easy-to-prepare food they need over the course of the weekend. Today, bags of food assembled at more than 150 local food banks are distributed at the end of the week to nearly 230,000 children every year.\nNo, Feeding American doesn't provide job training or any form of employment or educational help to free many of the recipients from dependency or even teach them how to shop economically for nutritious food, or provide any other inducements for their clients to leave poverty. If they did, the officials involved would have to raise their opinions and expectations of the recipients while lowering those of their own. And for many, they would be out of a job.\nBut where does the \"reimbursement\" in the form of \"billions of dollars to districts\" from the federal government or even donations to various food banks originate? It seems the food and staffing for the free lunches and breakfasts and many other food programs are not free after all. The financial cost is borne by the federal and various local governments' taxpayers plus some donations.\nHowever, the incalculable psychological and social cost in general and on the so called beneficiaries in particular for such dependency and rewards for learned helplessness are paid for by the entire society.\nUh oh, Friedman and Heinlein were correct after all. Oh.","url":"https://www.americanthinker.com/blog/2014/09/more_costly_free_stuff_in_the_land_of_entitlements.html"}
