{"authors":["Georgia Diebelius For Mailonline"],"date_download":"2018-10-23 02:13:53","date_modify":"2018-10-23 02:13:53","date_publish":"2016-01-11 13:57:20","description":"Custom officials found almost seven pounds worth of the yellow metal on the flight, which landed at Rajiv Gandhi International Airport in India, yesterday, local media reports.","filename":"data/vaneerConsumption/Morethan77kworthofgolddiscoveredbeneathseatonAirIndiaflight.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/13/014686BD000004B0-0-image-a-35_1452519959484.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/travel_travel_news_article-3393856_More-77-000-worth-gold-discovered-hidden-beneath-seat-Air-India-flight_1540260833.html","title":"More than £77k worth of gold discovered beneath seat on Air India flight","title_page":"More than £77k worth of gold discovered beneath seat on Air India flight | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"More than 7.5million rupees (£77,000) worth of gold has reportedly been discovered hidden beneath a seat on a flight.\nCustom officials found almost seven pounds worth of the yellow metal on an Air India flight, which landed at Rajiv Gandhi International Airport in Shamshabad, India, yesterday, local media reports.\nBased on a tip-off, staff searched the aircraft, which had landed following a flight from Dubai, and discovered the expensive metal.\nCustom officials found almost seven pounds worth of the yellow metal on an Air India flight, local media reports\nThe bars of gold had been allegedly concealed behind a pipe beneath a seat in the cabin.\nThe New Indian Express claimed that the incident is the fifth case of its kind to take place in the last six weeks after flying this route, with two incidents in January and three in December.\nSo far, more than 22 pounds worth of abandoned gold is said to have been discovered.\nThe bars of gold had been allegedly concealed behind a pipe beneath a seat in the cabin (stock image)\nSpeaking to the New Indian Express, an airport official said: 'We recovered 3.1 kg from AI-952 which arrived at 9am at Shamshabad. It was found abandoned and hence no arrest.\n'In flights, there would be a hollow pipe which supports the three seats.\n'The window side of the pipe is usually open and gold biscuits are kept inside that for the next passenger to locate and retrieve.'","url":"https://www.dailymail.co.uk/travel/travel_news/article-3393856/More-77-000-worth-gold-discovered-hidden-beneath-seat-Air-India-flight.html"}
