{"authors":[],"date_download":"2018-10-22 20:28:25","date_modify":"2018-10-22 20:28:25","date_publish":"2014-06-01 02:40:06","description":"The findings come in the wake of “Nightly News” anchor Brian Williams’ wide-ranging, exclusive interview with Snowden.","filename":"data/vaneerConsumption/MoreAmericansOpposeEdwardSnowdensActionsThanSupportThem.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_22/467491/140527-snowden-jms-0034_dd74ca1af735f7c7180c603dd7e2e240.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_more-americans-oppose-edward-snowdens-actions-support-them-n119476_1540240105.html","title":"More Americans Oppose Edward Snowden's Actions Than Support Them","title_page":"More Americans Oppose Edward Snowden's Actions Than Support Them","title_rss":"NULL","source_domain":"nbcnews.com","text":"In the NBC News poll, 24 percent said they back Snowden’s release of information about how government agencies collect intelligence data to media outlets, compared with 34 percent who disagree with his actions.\nAnother 40 percent said they didn’t have an opinion. Yet among those who say they’ve closely followed the story, 49 percent oppose Snowden’s actions and 33 percent support them.\nThe poll shows a striking difference of opinion in Snowden by age. Those ages 18 to 34 tend support Snowden’s actions, by 32 percent to 20 percent, and view him a favorable light, compared with all other age groups who don’t.\nThe overall numbers are essentially unchanged from a January 2014 NBC News/Wall Street Journal poll, when 23 percent of registered voters said they supported Snowden’s actions, versus 38 percent who opposed them.\nThe documents stolen by Snowden and then released to journalists disclosed the global reach of U.S. intelligence, including descriptions of government surveillance of U.S. telephone and email records, tapping of undersea fiber-optic cables carrying internet traffic, and accessing Yahoo and Google’s internal user data without either company’s knowledge.\n\"His disclosures have damaged the security of this country and I'm not going to get into a point-by-point inventory of the specifics of how he’s done that,\" Defense Secretary Chuck Hagel said on NBC News' \"Meet the Press\" on Sunday.\n\"There is plenty of evidence he did damage to the security of this country.\"\nRead the full NBC News poll.\nBut in the interview with Williams, Snowden said he viewed himself as a patriot. \"I may have lost my ability to travel,\" he said. \"But I've gained the ability to go to sleep at night and to put my head on the pillow and feel comfortable that I've done the right thing even when it was the hard thing. And I'm comfortable with that.\"\nSnowden also said he wanted to back home to the United States. “I don't think there's ever been any question that I'd like to go home. I mean, I've from day one said that I'm doing this to serve my country.”\nSnowden’s interview also produced a pointed response from the Obama administration. “If Mr. Snowden wants to come back to the United States today, we'll have him on a flight today. We’d be delighted for him to come back,” Secretary of State John Kerry said on NBC’s Today Show. “And he should come back and -- and that’s what a patriot would do. A patriot would not run away and look for refuge in Russia or Cuba or some other country. A patriot would stand up in the United States and make his case to the American people.”\nThe NBC poll finds Americans -- by a 2-to-1 margin – view Snowden in a negative light: 27 percent of voters have an unfavorable opinion of him, while 13 percent have a positive one.\nBy comparison, a July 2013 NBC/WSJ poll showed opinions on Snowden as 36 percent negative, 11 percent positive.\nThe NBC poll was conducted by the Democratic firm Hart Research Associates and the Republican polling firm Public Opinion Strategies of 800 registered voters (including 240 reached by cell phone) from May 27-29. It has a margin of error of plus-minus 3.5 percentage points.","url":"https://www.nbcnews.com/news/us-news/more-americans-oppose-edward-snowdens-actions-support-them-n119476"}
