{"authors":["Liam Deacon"],"date_download":"2018-10-30 22:05:36","date_modify":"2018-10-30 22:05:36","date_publish":"2018-07-26 17:15:29","description":"BBC football pundit-turned liberal activist Gary Lineker has joined the campaign demanding a second referendum to overturn Brexit.","filename":"data/vaneerConsumption/MoreImportantthanFootballLuvvyLinekerBacksSecondBrexitVote.json","image_url":"https://media.breitbart.com/media/2018/07/GettyImages-150912456.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2018_07_26__1540937136.html","title":"'More Important than Football': Luvvy Lineker Backs Second Brexit Vote","title_page":"'More Important than Football': Luvvy Lineker Backs Second Brexit Vote | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"BBC football pundit-turned liberal activist Gary Lineker has joined the campaign demanding a second referendum, to overturn Brexit.\nThe former England footballer and one of the BBC’s highest-paid employees has become an outspoken supporter of Brussels and mass migration since the vote in 2016, frequently accusing opponents of racism online.\nAfter calling for a second vote Wednesday, he was immediately backed by campaigning Labour MP David Lammy, who tweeted: “Top man… thank god some people are prepared to stick their neck out and not pander to the ‘will of the people’ bollocks.”\nMr Lineker had argued in a statement that Brexit had created a “mess” with “terrible consequences”.\nHowever, he was mocked when a year-old tweet quickly surfaced, in which he had insisted he did not want a second vote and called for people to “get over” the Brexit vote.\nThis tweet from a year ago is being bandied about. Happy to admit I’ve now changed my mind. Didn’t envisage at the time that we’d ever contemplate a ‘’no deal Brexit’ and the ensuing carnage that would bring. https://t.co/xI90kHZBZQ — Gary Lineker (@GaryLineker) July 26, 2018\nIn the new statement, he wrote: “I spent most of the last few weeks totally focused on a fantastic World Cup. But it was impossible to avoid what was happening in the Brexit debate back home.\n“Now I’m back I find the whole thing more bewildering and worrying than ever.\n“Whether you voted Leave or Remain, did anyone really vote for the mess we seem to be in, let alone the prospect of no deal with all the terrible consequences attached to that?”\n“There are some things in life that, even for someone like me, are more important than football.\n“This is one of them. I am not a politician but I know when something is going wrong and right now Brexit feels like it is going very wrong indeed.\nGary Lineker Jokes about Elderly, Dying Brexit Voters https://t.co/F74XxmtacG pic.twitter.com/kGe9zKghem — Breitbart London (@BreitbartLondon) December 18, 2016\n“The politicians seem unable to resolve the problem the people gave them in voting to Leave.\n“That is why I think there should be a People’s Vote on the final deal, and why I am sending best wishes and good luck to the campaigners who will be stepping up the pressure over the summer.”\nFollowing online criticism about Mr Lineker’s stance and the BBC’s supposed impartiality, a spokesman insisted he was welcome in the organisation with his outspoken views.\n“As we’ve stated in the past, Gary is not involved in any news or political output for the BBC and as such any expression of his personal political views does not affect the BBC’s impartiality.”","url":"https://www.breitbart.com/europe/2018/07/26/more-important-than-football-luvvy-lineker-backs-second-brexit-vote/"}
