{"authors":["Allan Hall For Mailonline"],"date_download":"2018-10-22 23:33:30","date_modify":"2018-10-22 23:33:30","date_publish":"2016-01-28 12:32:18","description":"More Germans are arming themselves in the wake of the Cologne sex attacks on New Year's Eve with more residents signing up to self-defence courses and sales of pepper spray skyrocketing.","filename":"data/vaneerConsumption/MoreGermansarmingthemselvesinthewakeofColognesexattacks.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/2FD6957D00000578-0-image-a-64_1453984316716.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420864_More-Germans-arming-wake-Cologne-sex-attacks-gun-sales-threefold-areas_1540251210.html","title":"More Germans arming themselves in the wake of Cologne sex attacks","title_page":"More Germans arming themselves in the wake of Cologne sex attacks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"More Germans are arming themselves in the wake of the Cologne sex attacks on New Year's Eve, it has emerged.\nAlso on the increase is enrollment in self-defence courses - particularly among women - and sales of pepper sprays that are commonly used by police against protests.\nIt comes as several other countries claim to have seen gun sales increase just weeks after hundreds of women reported being robbed and molested by migrants in Cologne on December 31.\nSome areas of Germany have reported a threefold increase in gun sales following the sex attacks that occurred near Cologne train station on New Year's Eve. Pictured are revellers at the New Year celebrations\nTwo policemen stand guard outside the train station in Cologne in the days following the sex attacks\nMore than 200 women claimed to have been attacked during the night of chaos, while hundreds more reported similar crimes across other European cities\nOne gun seller in North Rhine-Westphalia - the state to which Cologne belongs - said: 'People no longer feel safe, otherwise they would not be buying so many products here,' German broadcaster Deutsche Welle reported.\nHe claims sales of weapons have increased three-fold since December 31.\nWhile gun laws are stringent for the purchase of revolvers and pistols, they are less so for gas-guns and signal pistols which are allowed to be carried outside the home and can be bought by anyone aged 18 and over.\nFelix Beilharz, a social media expert from Cologne, told DW: 'There has been an increase of at least 1,000 percent or more in Google search queries for gun permits since January.'\nCourses in self defence are booked out in Cologne and other cities for weeks in advance - something that was not the case this time last year.\nGun sellers say that most would-be buyers want a small weapon that can fit into a bedside table or a handbag.\nTwo weeks ago it emerged gun sales had jumped 350 per cent in Austria amid 'unease' over increasing numbers of migrants following the Paris terror attacks, firearm dealers claimed.\nThe final months of 2015 showed increases in gun permit applications, while dealers reported huge demand for self defence weapons such as tasers, pepper spray and blank firing-guns.\nMigrants outside the main train station in Salzburg, Austria, in a bid to cross into Germany and claim asylum\nHundreds of migrants who arrived at the Hungarian-Austria border by train make their way into Austria. Many Austrian residents have been purchasing weapons amid increased fears of break-ins and crime\nIt comes just months after shotguns were reported to have sold out across the country as residents became increasingly paranoid about refugee numbers.\nAnd Czech Independent TV has also reported on an arms upsurge. A few months ago it was revealed most rifles in the country were out of stock.\nA central weapon register was introduced in June 2014 to record all legal firearm sales and this year more than 14,000 new weapons were purchased.","url":"https://www.dailymail.co.uk/news/article-3420864/More-Germans-arming-wake-Cologne-sex-attacks-gun-sales-threefold-areas.html"}
