{"authors":[],"date_download":"2018-10-22 22:20:35","date_modify":"2018-10-22 22:20:35","date_publish":"2014-06-09 18:51:28","description":"The crash that injured comedian Tracy Morgan came days after the trucking industry won Senate support to roll back new rules to ensure drivers get enough rest.","filename":"data/vaneerConsumption/MorganCrashCameasSenateMovedtoEaseRulesonTruckersRest.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_24/497371/140609-140609-tracy-1502_1dfd2ae994f3dfdb0c4593404d901a03.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_autos_morgan-crash-came-senate-moved-ease-rules-truckers-rest-n126556_1540246835.html","title":"Morgan Crash Came as Senate Moved to Ease Rules on Truckers' Rest","title_page":"Morgan Crash Came as Senate Moved to Ease Rules on Truckers' Rest","title_rss":"NULL","source_domain":"nbcnews.com","text":"After an unsuccessful lawsuit failed to reverse the new rules, the Senate Appropriations Committee voted 21 to 9 in favor of an amendment offered by Sen. Susan Collins, R-Maine, to strip funding to enforce the new rules. Collins said the new rules have had \"unintended consequences that are not in the best interest of carriers, shippers and the public.\"\nThe amendment, attached to a transportation funding bill, would suspend the new rules.\nThe new regulations require long-haul drivers to cut their maximum workweek to 70 hours from 82, and \"restart\" those 70 hours with a 34-hour break once a week. Drivers are also required to include at least two nighttime rest breaks from 1 a.m. to 5 a.m. during that 34-hour break.\nThe trucking industry has argued that the new limits have created more highway traffic congestion and higher shipping costs for consumers.\nThe industry also argues that it's already doing a good job of reducing accidents, and that the government's own data supports that position. The number of people killed each year in large truck crashes has fallen almost 30 percent, to nearly 3,800 in 2012, from 5,282 in 2000, according to the Federal Motor Carrier Safety Administration.\nThe administration counters that fatigue is a leading factor in truck crashes and that 4,000 truck accidents a year is still too many. The new rules, it maintains, will prevent some 1,400 crashes and 560 injuries, and save 19 lives each year, according to its analysis.\nn January, a Washington State University study found that the new rules are more effective at combating driver fatigue. The researchers found that drivers who took more overnight breaks during the restart period \"experienced fewer lapses of attention, reported less sleepiness while on duty, and maintained their lane position better than those with only one nighttime period in their restart.\"\nThe study significantly overstates the benefits of the two breaks, said Dave Osiecki, head of policy and regulatory affairs at the American Trucking Associations.\nThe rules grew out of a wider program by the White House to make U.S. highways safer by reducing the number of truck accidents and fatalities. The program also includes a safety rating system that shippers can review when they choose a new carrier, with the goal of prodding the trucking industry to further improve the safety of its drivers and equipment.\nThe DOT says the new rules will also produce a broader economic benefit. The department's analysis found that in 2009 alone, large truck and bus accidents cost some $20 billion in medical and insurance costs, infrastructure damage, lost wages and productivity. The analysis also estimated $470 million in benefits from reduced driver mortality.\nThe DOT's analysis found that more than 85 percent of drivers would see little to no change in their schedules as a result of the rule, a figure the industry disputes.\nNo one disputes that the rules also come with a cost to the trucking industry. More breaks and time off the road means it will take more drivers—and more trucks to move the same volume of goods.\nThat means carriers will have to find more qualified drivers at a time when the industry already is having a hard time filling openings. It's not hard to see why. Trucking is not an easy way to make a living. Drivers spend days—sometimes weeks on the road—working irregular hours for a median wage of $39,700 a year or about $19 a hour. Driver turnover last year topped 100 percent, according to industry estimates.\n\"Many of them are among the older more experienced drivers,\" said Osiecki, of the American Trucking Associations. \"Now we've got to go find new fresh, inexperienced drivers. Generally speaking that's not a good thing for safety.\"\nDrivers say the new mandatory rest breaks mean they have to juggle deliveries to make sure they abide by the new rules. Many distribution centers now impose tight windows on when they will accept a shipment. And unlike a driver on a cross-country family vacation, he said, truckers looking to take an extended rest stop have fewer opportunities to pull over when they feel tired\nThe new regulations have also had the unintended consequence of putting more traffic on the nation's already congested highways, according to some truckers.\nBecause the new rules require all drivers to \"restart\" their week with rest periods that end at 5 a.m., they can no longer stagger the beginning of their new work day. That means they're required to start work just as the morning rush hour begins.\n\"That's a higher safety risk because crash risk is higher in the morning hours than in the night time hours,\" Osiecki said.","url":"https://www.nbcnews.com/business/autos/morgan-crash-came-senate-moved-ease-rules-truckers-rest-n126556"}
