{"authors":["Oscar Williams-Grut"],"date_download":"2018-10-31 00:35:44","date_modify":"2018-10-31 00:35:44","date_publish":"2016-12-01 00:00:00","description":"The investment bank thinks investment will decline, inflation will rise, and consumer spending will fall: a lethal cocktail for GDP growth.","filename":"data/vaneerConsumption/MorganStanleyBrexitanalysisBritainwillturnintoaBBBeconomy.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_morgan-stanley-brexit-article-50-analysis-britain-will-turn-into-a-bbb-economy-2016-12_1540946144.html","title":"Morgan Stanley Brexit analysis: Britain will turn into a 'BBB' economy","title_page":"    Morgan Stanley Brexit analysis: Britain will turn into a 'BBB' economy - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Get ready for a bumpy ride. REUTERS/Marcos Brindicci Morgan Stanley expects \"Brexit to drive lower and more volatile growth\" in 2017 and beyond, the investment bank warned in a note sent to clients on Wednesday afternoon.\nThe bank said in its 2017 UK economics and strategy note that it predicts the UK will move to \"BBB\" economic growth as a result of Brexit-driven uncertainty — \"below-par, bumpy, and brittle.\"\nThe bank expects growth to slow dramatically in the coming years (below par), be more likely to face shocks due to the political environment (bumpy), and more vulnerable to those shocks when they do come (brittle). Morgan Stanley likens the economic environment to 2011-12 when Europe was gripped by a debt crisis and Britain was struggling with what was thought to be a \"double-dip\" recession. (Subsequent data showed this wasn't actually the case.)\nEconomist Jacob Neil and his team at Morgan Stanley sum up in a brilliantly succinct paragraph just why they think Brexit means storm clouds on the horizon for the British economy. They write:\n\"We think that UK economics and politics will be dominated by the Brexit process over the forecast horizon. This will drive a slowdown, driven first by a decline in investment, due to a perceived risk of higher barriers to business with the EU, and then by slower consumer spending growth, as the labour market softens, but especially as higher inflation erodes real wage growth. We also see a series of Brexit stops - crunch points in the negotiations - which we think will be defining UK risk events, and drive political and market volatility.\"\nRates cut again and more QE\nDespite its pessimistic outlook, Morgan Stanley in fact raises its growth forecast for 2017 — but only because it was too pessimistic to begin with. Morgan Stanley now expects 1% GDP growth next year, compared to an earlier forecast of just 0.6%. The Office for Budget Responsibility (OBR) expects 1.4% growth next year.\nMorgan Stanley expects the collapse of the pound and rising oil prices to drive inflation above the Bank of England's 2% target in April next year and peak at 3% in the first-half of 2018.\nAs a result of the expected \"BBB\" growth the bank expects the government to borrow £40 billion more than it pencilled in at the recent Autumn Statement to \"accommodate the hit from Brexit.\" Morgan Stanley also believes the Bank of England will cut interest rates yet again, to 0.10%, to soften the impact of rising prices. The interest rate rise should come in May of next year and Morgan Stanley also expects more quantitative easing in 2018.\n'Extra caution is clearly required'\nHowever, the investment bank caveats all these predictions by saying: \"So far, most forecasters, ourselves included, have been too pessimistic.\"\nPro-Brexit papers, such as the Daily Mail and Daily Express, and politicians, such as former education secretary Michael Gove and leading Tory backbencher Jacob Rees-Mogg, have all heavily criticised economists in recent weeks for what they see as overly pessimistic Brexit forecasts, both before and since the vote.\nAlmost all banks and economic think tanks predicted a recession if Britain voted for Brexit ahead of the June 23 vote. But most backtracked on the forecasts after the shock vote.\nMorgan Stanley admits in Wednesday's note: \"We expected a substantial negative impact on the economy in the run-up to and aftermath of the referendum, and there is little evidence of any such impact.\"\nGove said recently that the economics profession is in \"crisis\" and Rees-Mogg, who sits on the Treasury Select Committee, said some of the borrowing assumptions made by the Office for Budget Responsibility (OBR) in its audit of last week's Autumn Statement are \"lunatic.\" The Daily Mail last week also attacked the Institute of Fiscal Studies for predicting the longest period of wage stagnation in 70 years due to rising inflation.\nMorgan Stanley writes in its 2017 forecast note:\n\"There is a wide diversity of opinion over next year, with Brexiteers criticising the OBR and Bank of England for being too pessimistic in forecasting 1.4%Y growth in 2017, while we think that this is an optimistic number. Looking further ahead, given the unprecedented nature of Brexit, and the associated uncertainty over the pace and depth of adjustment, extra caution is clearly required.\"\n'There is a good chance that resilience continues for longer than we expect'\nThe bank highlights several factors that could blow its forecasts off course, both for better and for worse.\nOn downside risks, Morgan Stanley flags high house prices and Britain's big current account deficit — the trade gap reflecting the difference between what Britain pays for overseas goods and the amount of foreign money coming into the country. If the pound worsens further, the trade gap could become wider as foreign goods get more expensive.\nOn the upside, however, the bank says: \"The UK economy has been surprisingly resilient in the face of considerable uncertainty already. There is a good chance that this resilience continues for longer than we expect.\"\nThe key question is whether consumers keep spending in the face of rising prices. Morgan Stanley points to recent credit data showing credit card debt at a record high. The bank says this \"could leave 2017 consumer spending stronger than our forecasts.\"\nIt adds that the economy could be in a better shape than it expects if Brexit negotiations progress well, particularly if a transition deal for trade after exiting the EU is agreed.\nAll in all, Morgan Stanley's 2017 outlook for the British economy can pretty much be summed up as: hope for the best, prepare for the worst.","url":"https://www.businessinsider.com/morgan-stanley-brexit-article-50-analysis-britain-will-turn-into-a-bbb-economy-2016-12"}
