{"authors":["Akin Oyedele"],"date_download":"2018-10-30 23:46:21","date_modify":"2018-10-30 23:46:21","date_publish":"2018-07-15 00:00:00","description":"BI PRIME: A classic indicator of an economic recession will show up within the next year, according to a team of strategists at Morgan Stanley.","filename":"data/vaneerConsumption/MorganStanleysaysrecessionsignalcomingmid2019.json","image_url":"https://amp.businessinsider.com/images/5b48fb977439161c008b49bf-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_morgan-stanley-says-recession-signal-coming-mid-2019-2018-7_1540943181.html","title":"Morgan Stanley says recession signal coming mid-2019","title_page":"    Morgan Stanley says recession signal coming mid-2019 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A traffic light signals red in front of the Weisweiler brown coal power plant of German energy supplier RWE, in Weisweiler, near Aachen, Germany March 12, 2018. Wolfgang Rattay/Reuters\nA classic indicator of an economic recession will show up within the next year, according to a team of strategists at Morgan Stanley.\nIn a note Thursday, they forecast the yield curve, which plots bond yields at various maturities, will invert by mid-2019.\nThe difference between 10- and 2-year Treasury yields was at 24.87 basis points on Friday, its lowest level in 11 years. That's because the yield on the longer-dated bond, which is normally higher, is not rising as quickly as the two-year yield. The Federal Reserve has been raising short-term interest rates to move further away from post-crisis policies, but long-term rates have not followed suit.\nWhenever their difference turns negative, it's a sign that investors are losing confidence in the economy.\n\"If the Fed shrugs at the tightening in financial conditions we envision and hikes rates in December 2018 anyway, we think certain parts of the yield curve would end the year in flat or inverted state,\" the strategists including Sam Elprince said.\nAccording to Morgan Stanley's strategists, the Fed will signal its plans to stop shrinking its balance sheet — another post-crisis measure — earlier than investors expect next April. They also believe that investors are underestimating the size of the Fed's assets — the so-called System Open Market Account — that's necessary to keep the effective fed funds rate within target.\n\"The surprisingly early end of balance sheet normalization we envision — including the way in which we think the Fed will roll over its Treasuries and reinvest its agency debt and agency MBS principal — should benefit Treasuries outright (yields lower),\" Elprince said. He recommended investors go overweight Treasurys and underweight corporate bonds.\nMorgan Stanley forecasts that the 10-year yield will fall to 2.75% by year-end and 2.50% by the middle of 2019, falling below the 2-year, which should be at 2.55%.\nRecession this time or not?\nThe yield curve has recently attracted more attention because of its historical role as a recession indicator. If Morgan Stanley's forecast for inversion is correct but no recession follows, it would be only the second such occurrence since the 1960s.\nStill, many investors are not worried yet.\nRalph Axel, a rates strategist at Bank of America Merrill Lynch, thinks the flattening curve is well explained by Fed policy and the unemployment trate. \"In some ways, a declining yield curve slope can actually be thought of as a good thing,\" Axel said in a note Thursday.\nLike Elprince, Axel sees the 2y-10y spread \"near or just below\" zero by mid-2019. He noted also that the compensation investors demand to own longer-term bonds — the term premium — is lower in this cycle than usual. The best explanation for this is the low level of inflation risk, Axel said; inflation is the reason why bond investors typically require more compensation for extending into longer-dated bonds.\nInstead of looking at the yield curve for recession risk, he said a more reliable indicator would be monthly payrolls.\nEven if the yield curve inverts, a recession likely won't follow immediately. According to LPL Financial, there's been a 21-month gap on average between inversions and recessions since 1978. The stock market also didn't buckle immediately, returning 12.7% on average in the months between.\nFor now, a flattening yield curve is sure to keep mesmerizing Wall Street.","url":"https://www.businessinsider.com/morgan-stanley-says-recession-signal-coming-mid-2019-2018-7"}
