{"authors":["Snejana Farberov For Dailymail.Com"],"date_download":"2018-10-23 05:41:39","date_modify":"2018-10-23 05:41:39","date_publish":"2016-01-28 21:31:50","description":"Morgan Arnold was charged as an adult and subsequently pleaded guilty to first-degree murder in the 2013 killing of her father, Maryland businessman and blogger Dennis Lane.","filename":"data/vaneerConsumption/MorganArnoldwhoplottedtohaveherboyfriendstabherfathergets30YEARSinprison.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/21/30AD5DA100000578-0-image-a-45_1454015896785.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421683_Special-needs-girl-plotted-boyfriend-stab-father-death-just-14-gets-30-YEARS-prison_1540273299.html","title":"Morgan Arnold who plotted to have her boyfriend stab her father gets 30 YEARS in prison","title_page":"Morgan Arnold who plotted to have her boyfriend stab her father gets 30 YEARS in prison | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 17-year-old Maryland girl has been sentenced to 30 years in prison for orchestrating her father's stabbing death with the help of her mentally disabled older boyfriend when she was 14.\nMorgan Lane Arnold was charged as an adult and subsequently pleaded guilty to first-degree murder in the May 2013 killing of her father, 58-year-old businessman and blogger Dennis Lane.\nOn Wednesday, Howard County Judge William Tucker handed down the 30-year sentence, calling it ‘one of the most difficult decisions that this court has ever had to make.’\nLengthy sentence: Morgan Arnold (left) has been sentenced to 30 years in prison for coaxing her then-boyfriend, Jason Bulmer (right), into murdering her father in 2013\nVictim: Dennis Lane, 58, a businessman and blogger, was found stabbed to death in his Ellicott City, Maryland, home in May 2013\nAmbush: Prosecutors said Arnold left the door into the basement at her father's residence (pictured) unlocked, allowing Bulmer to slip inside armed with a butcher knife\nProsecutors argued that Arnold and her then-boyfriend, Jason Bulmer, who was 19 at the time of the slaying but still in the 10th grade, plotted to kill Lane for two months, outlining their murderous plans in a series of text message exchanges and Skype conversations.\nAuthorities said Arnold left the door into the basement at her family home in Ellicott City unlocked, allowing Bulmer to slip in and stab Lane to death with a butcher knife in May 2013.\nThe plan was for Bulmer also to kill Lane's fiancee, Denise Geiger, but the mortally wounded 58-year-old man was able to subdue his attacker, giving Geiger a chance to pry the knife from the teen's hands.\nAfter he was found covered in blood along with Arnold in her bedroom, Bulmer told police, 'I am her boyfriend. I stabbed him and she told me to do it.'\nThe teen, who suffers from a learning disorder and has the mind of a child between the ages of 9-12, according to psychiatrists, claimed that his girlfriend wanted her father dead 'because she was sick of him.'\nDuring pre-trial proceedings in 2014, a forensic psychiatrist testified that Arnold, who was said to be suffering from Asperger's syndrome and a host of other mental-health issues, told her she was 'glad' her father was dead.\nStar-crossed lovers: Bulmer and Arnold, who were 19 and 14, respectively, at the time of the murder, were described as social misfits suffering from mental health problems\nAfter the killing, Bulmer (left) told police he killed Lane (right) at Arnold's request 'because she was sick of him'\n'My fantasy came true. he disappeared,' she was quoted as telling Dr Neil Blumberg.\nMental health experts testified that at different points throughout her childhood and adolescence, Arnold has been diagnosed with attention-deficit hyperactivity disorder, depression, anxiety and schizoaffective disorder.\nArnold and Bulmer were described during court proceedings as social misfits who were obsessed with fantasy characters.\nWhile the defense argued that Arnold was afraid of her older boyfriend, Judge Tucker said on Wednesday that having read their electronic exchanges, he believed that the girl was the one pulling the strings, reported The Baltimore Sun.\nDennis Lane's sister, Kelly Lane, described her niece in her written victim impact statement as 'smart and manipulative,' and said that Bulmer was 'her first victim.'\nBulmer pleaded guilty to first-degree murder and was sentenced to 30 years in prison in July 2014.\nAt the completion of her sentence, Arnold will be on supervised probation for another five years.","url":"https://www.dailymail.co.uk/news/article-3421683/Special-needs-girl-plotted-boyfriend-stab-father-death-just-14-gets-30-YEARS-prison.html"}
