{"authors":["Associated Press"],"date_download":"2018-10-22 21:17:10","date_modify":"2018-10-22 21:17:10","date_publish":"2016-01-29 06:08:52","description":"SAN DIEGO (AP) — The Church of Jesus Christ of Latter-day Saints banned a member of a San Diego congregation from contact with children years before his arre...","filename":"data/vaneerConsumption/Mormonsbannedaccusedmolesterfromcontactingchildren.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422108_Mormons-banned-accused-molester-contacting-children_1540243030.html","title":"Mormons banned accused molester from contacting children","title_page":"Mormons banned accused molester from contacting children | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mormons banned accused molester from contacting children\nSAN DIEGO (AP) — The Church of Jesus Christ of Latter-day Saints banned a member of a San Diego congregation from contact with children years before his arrest this week on suspicion of being a former child television host known as \"Mr. Wonder,\" who is accused of sexually abusing children during a camping trip in Louisiana nearly four decades ago.\nFrank Szeles, as he was known in the San Diego area, was \"removed from all positions related to children\" after failing to comply with the church's child protection policies, Eric Hawkins, a church spokesman, said in an email Thursday.\nAfter his removal, a parent expressed \"a generalized concern\" about the suspect's behavior toward a child and the church urged the parent to report it to authorities, said Hawkins. He said he didn't know if the parent reported it.\nThe church spokesman said Szeles belongs to a group of Mormon congregations in the San Diego area called the Sweetwater Stake. But Hawkins didn't indicate which positions Szeles held and said he couldn't elaborate on the nature of the alleged incidents.\nHowever, Hawkins said the church did not report the matter itself because \"what we were told was not criminal in nature.\"\nAsked to comment, the suspect's attorney, Marc Carlos, said, \"Clearly whatever these allegations were, they were not serious enough to refer to the police, which is what they should have done if they were serious.\"\nThe Boy Scouts of America said Wednesday that the suspect was Cubmaster of Pack 888 in Bonita, near San Diego, but he was \"removed from Scouting several years ago for non-compliance with our youth protection policies and procedures.\" Without elaborating, it said his removal followed a complaint from a parent who was not involved in the group and was unrelated to scouting.\nAuthorities say the man arrested Monday at his Bonita home is Frank John Selas, a 76-year-old fugitive who hosted the \"Mr. Wonder\" children's show on KNOE-TV in north Louisiana in the 1970s and changed his name after moving to the San Diego area.\nThe suspect challenged authorities to prove he is the fugitive. On Wednesday, a judge ordered him to be held without bail and scheduled a hearing for Feb. 11 to establish identity.\n___","url":"https://www.dailymail.co.uk/wires/ap/article-3422108/Mormons-banned-accused-molester-contacting-children.html"}
