{"authors":[],"date_download":"2018-10-30 20:34:33","date_modify":"2018-10-30 20:34:33","date_publish":"2015-03-27 15:57:19","description":"The U.S. Bankruptcy Court this week approved a plan that will let financially-strapped Morris Brown College emerge from bankruptcy, the chairman of the college’s board of trustees said.","filename":"data/vaneerConsumption/MorrisBrowntrusteeCollegeemergingfrombankruptcy.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_morris-brown-trustee-college-emerging-from-bankruptcy__1540931673.html","title":"Morris Brown trustee: College emerging from bankruptcy","title_page":"Morris Brown trustee: College emerging from bankruptcy","title_rss":"NULL","source_domain":"ajc.com","text":"The U.S. Bankruptcy Court this week approved a plan that will let financially-strapped Morris Brown College emerge from bankruptcy, the chairman of the college’s board of trustees said.\nIn a statement, board Chairman Preston Williams said the action, approved at a Wednesday hearing and confirmed Thursday by a signed order by Judge Barbara Ellis-Monro, “will allow the college to exit bankruptcy and move forward to regain its accreditation.”\nThe college filed for Chapter 11 bankruptcy reorganization in August 2012.\nIn a motion filed this week, the college spelled out a plan to resolve several remaining minor claims, including debts to ADT Security Service, the Robert W. Woodruff Library, a consulting firm and two individuals. A hearing on that motion has been scheduled for April 29.\nWilliams said that as part of the bankruptcy proceedings, the college sold 26 acres of property and buildings to InVest Atlanta and Friendship Baptist Church for $14.7 million, but retains ownership of the school’s administration building, Griffin Hightower Classroom building and Fountain Hall.\nFriendship Baptist is one of two churches that sold to make way for the future $1.3 billion Atlanta Falcons stadium just steps from the Morris Brown property.\n“This is a bittersweet ending to a long and complex process,” Williams said. “Bitter, because we had to sell property that had historical significance to so many people. Sweet, because we emerge from bankruptcy fully functional and current with all of our debt obligations.”\nWilliams said the college has remained in operation throughout the Chapter 11 reorganization process, and is scheduled to graduate 21 students on May 16.","url":"https://www.ajc.com/news/morris-brown-trustee-college-emerging-from-bankruptcy/kj2ccm8eSF7Ob4XZKoyusM/"}
