{"authors":["Colin Fernandez For The Daily Mail"],"date_download":"2018-10-22 20:06:38","date_modify":"2018-10-22 20:06:38","date_publish":"2016-01-28 00:14:35","description":"Fears the Zika virus could strike Britain were fuelled after an insect expert claimed mosquitos that can carry the disease have been found here.","filename":"data/vaneerConsumption/MosquitoeslinkedtoZikavirusareintheUKexpertsays.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/00/3099AD5100000578-0-image-a-29_1453939969083.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420180_Mosquitoes-linked-baby-defect-UK-Expert-says-flies-coming-Britain-container-ships-grooves-car-tyres_1540238798.html","title":"Mosquitoes linked to Zika virus 'are in the UK', expert says","title_page":"Mosquitoes linked to Zika virus 'are in the UK', expert says | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Fears the Zika virus could strike Britain were fuelled after an insect expert claimed mosquitos that can carry the disease have been found here.\nHoward Carter said there have been several sightings of the Aedes Aegypti flying around in the countryside.\nThe mosquito can carry the Zika virus which is gripping Brazil and the Americas and can cause babies to be been with abnormally small heads and brains.\nPregnant women have been advised not to travel to countries affected by the disease – and some holiday companies said they would refund customers unable to travel over fears of the virus.\nA mosquito of the Aedes species, which has been known to transmit the Zika virus, has been reported on the Kent coast and in West Sussex\nNow Mr Carter, one of Britain's leading bite protection experts, said the Aedes species had been reported on the Kent coast and in West Sussex.\nHe said: 'They are here already and I have seen them myself north of Chichester in West Sussex.\n'I am aware of sightings on the Kent coast which have been reported to me so it is not a matter of if or when - they are here.'\nHe said they are getting into the country in the grooves of car tyres where females lay their eggs in trapped water in the rims.\nThey are also able to arrive in stagnant water in container ships carrying coffee, according to Mr Carter.\nHe added: 'They are not here in any great great numbers yet.\n'But in my view it is only a matter of time before that becomes the case.\n'It may be a year or it may be 10 but it will be here because of global warming creating a warmer and more attractive climate.'\nThe Zika virus has spread like wild fire across 20 countries in south and central America in the past year.\nMr Carter's claims are lent support by a report by Public Health England exper Jolyon Medlock last year which warned northern Europe would become increasingly threatened by mosquito and other insect borne diseases.\nHeartbreaking: The Zika virus has been blamed for causing severe brain damage to newborn babies\nThree British people have already caught the Zika virus after traveling in South America.\nA Danish tourist returning home from Latin America has been diagnosed with the virus.\nBrazil - which is set to host the Olympics this summer - is the worst-hit nation with around a million feared to be infected.\nUnited Airlines will allow customers who planned to travel to Zika-affected countries to postpone or cancel their trips with no penalty, it announced this week. The news comes as airlines, hotels and cruise operators serving Latin America and the Caribbean facing growing concerns among travellers regarding the mosquito-borne virus.\nAmerican Airlines tweeted to one concerned traveler, whose wife is pregnant, that it is currently refunding tickets to cities in El Salvador, Honduras, Panama, and Guatemala. But some Twitter users lamented their ruined vacations and their inability to get a refund from tourism operators.\nZIKA VIRUS: WHAT IS IT AND HOW CAN IT BE PREVENTED? The Zika virus is transmitted by the Aedes aegypti mosquito (inset), which is also known to carry yellow fever. The terrifying virus has now started to spread across the Americas How it spreads: Zika virus is spread to people via mosquito bites. The most common symptoms of Zika virus disease are fever, rash, joint pain and conjunctivtis. Infected patients are typically ill for a few days to a week. While the illness is generally mild, some experts in Brazil have suggested a possible link between the virus in pregnant women and subsequent birth defects. The CDC said recently it is aware of reports of increased numbers of babies born with microcephaly, or smaller than expected head size, in Brazil. The Ministry of Health in Brazil is concerned about a possible association between the Zika virus and increased numbers of babies born with microcephaly. How to prevent it: There is no vaccine to prevent, or medicine to treat Zika virus. Travellers can protect themselves by taking steps to prevent mosquito bites, such as using a mosquito net and wearing insect repellent. Pregnant women are being warned to avoid travelling to 22 countries were outbreaks have been reported. Source: CDC\nStu Privett, an HR systems specialist for the Royal College of Nursing in London, tweeted about cancelling a trip to Barbados with his wife, who is in her first trimester. Privett said he was unable to get a refund from Virgin Holidays.\n'They basically said it was our choice not to go on the holiday,' Privett told Reuters. 'Basically (it's) a case of 'we just lose all the money we've spent.' A Virgin Holidays spokesperson said the company would look into the claim. The National Travel Health Network and Centre also urges rethinks on trips to the Dominican Republic, Venezuela, Colombia, Guadeloupe, Panama, Guyana, Suriname, Honduras, Guatemala, Mexico, Martinique, French Guiana, Paraguay, Bolivia, Ecuador, El Salvador, Barbados, Puerto Rico and Haiti.\nZika symptoms are similar to flu including fever, joint pain, rash, headache and muscle pain. However, many people show no signs.\nIt's only in the past few months there's been evidence to link infection in pregnancy and birth defects, microcephaly (a small head).","url":"https://www.dailymail.co.uk/news/article-3420180/Mosquitoes-linked-baby-defect-UK-Expert-says-flies-coming-Britain-container-ships-grooves-car-tyres.html"}
