{"authors":["Quoctrung Bui"],"date_download":"2018-10-23 05:25:18","date_modify":"2018-10-23 05:25:18","date_publish":"2014-05-05 00:00:00","description":"Lots of Americans spend some time near the top of the income ladder — and many spend at least a few years in poverty.","filename":"data/vaneerConsumption/MostAmericansMakeItToTheTop20PercentAtLeastForAWhile.json","image_url":"https://media.npr.org/assets/img/2014/05/05/screen-shot-2014-05-05-at-11.27.50-am_wide-ac8d013c6e6147833b44d0c5eb2914662e050c1d.png?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_money_2014_05_05_308380342_most-americans-make-it-to-the-top-20-percent-at-least-for-a-while_1540272318.html","title":"Most Americans Make It To The Top 20 Percent (At Least For A While)","title_page":"Most Americans Make It To The Top 20 Percent (At Least For A While) : Planet Money : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Most Americans Make It To The Top 20 Percent (At Least For A While)\nWe often talk about income as if it's this fixed thing. Those people over there are the 1 percent. These over here live in poverty. That other group is the people in the top 20 percent. That's not the way it is.\nWhile economic mobility hasn't increased in this country over the past few decades, there is still churn. Lots of people move up and down the income ladder over the course of a career.\nWhat are the chances an American spends time in the top 1 percent? In the top 10 or 20 percent? How likely is it that people will live in poverty for some part of their adult lives?\nBecause many people may have a windfall once in their lives — think of a middle-class family selling a house they've owned for decades — we looked at how many Americans will find themselves in various income categories for at least two consecutive years.\nThe data for the graphs come from Mark Rank and Thomas Hirschl, who have analyzed over 40 years of household income data and ran the numbers on how likely each household will switch income groups.\nWhy is there so much churn in income? There are no real surprises here. According to Rank and Hirschl, raises, promotions, new careers, and a spouse entering or leaving the workforce can all create large swings in household income.","url":"https://www.npr.org/sections/money/2014/05/05/308380342/most-americans-make-it-to-the-top-20-percent-at-least-for-a-while"}
