{"authors":[],"date_download":"2018-10-30 14:31:05","date_modify":"2018-10-30 14:31:05","date_publish":"2016-12-06 18:22:00","description":"These Atlanta homes for sale are some of the priciest, most expensive mansions and real estate in the area.","filename":"data/vaneerConsumption/MostexpensiveAtlantahomesforsaleineachcounty.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/12/Images/photos.medleyphoto.11727926.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/classifieds_homes_the-prici_15e782af838580a0f69ff0f273a4343a__1540909865.html","title":"Most expensive Atlanta homes for sale in each county","title_page":"Most expensive Atlanta homes for sale in each county","title_rss":"NULL","source_domain":"ajc.com","text":"Atlanta has some amazing celebrity homes for sale. These range from gorgeous Craftsman homes to sprawling suburban mansions. This is how people in Atlanta live when they have several million dollars to spend on beautiful, imposing homes.\n﻿1. South Fulton $12.5 million\nEver wanted to live in an English manor? Now you can buy one with an eight-car garage, boat/ATV, pool house, carriage house, formal living room and butler kit.\n4965 Butner Rd, Atlanta, GA\n﻿2. Gwinnett $1.35 million\n(Dave Cullens / Those Aerial Guys)\nEnjoy life on the riverfront with this custom-built home in sought-after Riverview. The listing boasts “panoramic views of the sparkling Chattahoochee from every room.” Oh, and there’s a huge six-car garage.\n[Read more: $1.5M Gwinnett estate offers ‘panoramic views of the sparkling Chattahoochee’]\n﻿3. Cobb $8.9 million\nThis amazing estate brings the Mediterranean to East Cobb. It boasts beautiful finishes and “gold leaf domes hung with Baccarat Crystal. There’s also a gym with a redwood sauna, guest suite and lighted tennis court.\n4348 Paper Mill Rd SE, Marietta, GA 30067\n4. North Fulton $7.85 million\n127A Bulloch Ave, Roswell, GA 30075 (Atlanta Fine Homes Sotheby’s International Realty)\nYou know a house is impressive when it has its own name. Mimosa Hall is a historical antebellum estate known for more than 6,000 square feet of neoclassical design. Between the high ceilings and black-and-white marble hall, this house stands out even in expensive North Fulton.\n127A Bulloch Ave, Roswell, GA 30075\n[More photos of this house: For less than $8M, this historic Roswell antebellum estate is yours]\n5. Cherokee $13.5 million\n(Atlanta Fine Homes)\nFor those who need some living space, there is a luxury estate near Milton on 40-plus acres. Those acres include gardens, pastures, a stocked lake and a fantastic mansion. Read the full description linked below, it’s something.\n1950 Lower Birmingham Rd, Canton, GA 30115\n6. DeKalb $3.6 million\nA few million will buy you an old-school Druid Hills home that’s been renovated and expanded. Between the wine cellar, large garage with included workshop and one-bedroom carriage house, there’s plenty of space to breathe here.\n1761 S Ponce De Leon Ave NE, Atlanta, GA 30307\n﻿7. Fayette $3.69 million\n171 County Line Road Fayetteville, Georgia 30215 171 County Line Road Fayetteville, Georgia 30215 8. Clayton $5.9 million Lake country is never as beautiful as it is along the northern basin of Lake Burton. This house advertises itself as the embodiment of classic Adirondack Great Camps architecture with a fresh modern aesthetic. 41 Lady Bug Ln Clayton GA 9. Rockdale County $879,000 This tall four-story home offers spacious living and a huge media room. The description bills it as a \"hidden jewel within walking distance to restaurants.\" 2102 Timbale Rd, Atlanta, GA 10. Henry $2.2 million Have a good time on Lake Spivey with this amazing lakefront estate. According to the listing, the home was custom-built so every room has a view of the water. The custom layout also affords guests seated at the wraparound bar a view of meals as they are prepared on the indoor grill. 3432 S Bay Dr, Jonesboro, GA 30236 11. Douglas $749,000 This elegant European-style custom home packs a large punch for its price, which includes horse stables and a resort-style pool house for guests. 5405 Punkintown Rd, Douglasville, GA\nThings to do","url":"https://www.ajc.com/classifieds/homes/the-priciest-homes-for-sale-your-metro-atlanta-county/ZiWVVToWJu9u9pPIcx0dCM/"}
