{"authors":["Kipp Jones"],"date_download":"2018-10-30 21:16:22","date_modify":"2018-10-30 21:16:22","date_publish":"2016-03-10 19:39:54","description":"Veteran Saturday Night Live cast member Darrell Hammond praised GOP frontrunner Donald Trump on Thursday for his positive attitude and work ethic.","filename":"data/vaneerConsumption/MostPositivePersonIHaveEverSeen.json","image_url":"https://media.breitbart.com/media/2015/10/donald-trump-snl-2004-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_03_10__1540934182.html","title":"'Most Positive Person I Have Ever Seen'","title_page":"'SNL' Cast Member on Trump: 'Most Positive Person I Have Ever Seen'","title_rss":"NULL","source_domain":"breitbart.com","text":"Veteran Saturday Night Live cast member Darrell Hammond praised GOP frontrunner Donald Trump on Thursday for his positive attitude and work ethic.\nHammond, who is perhaps best known for his striking impersonations of former President Bill Clinton and journalist Ted Koppel, came out of retirement in November after Trump’s most recent SNL hosting gig.\nIn an interview with The Hollywood Reporter on Thursday, the 60-year-old comedian and impressionist discussed coming back to play Trump, who hosted the show on November 7.\n“A lot of people say he is cocky or full of himself. Maybe he is, but he is also the most positive person I have ever seen except the athletes that have have [sic] come on the show,” Hammond told the publication of Trump.\n“You know, he did not believe himself to be an actor. He is not somebody from our world, so he is somebody who came earlier and stayed later,” said Hammond, adding, “And I thought it was interesting because the athletes do the same thing because they know this is not their world, but something inside them tells them ‘I’ll figure a way to do this somehow.’”\nHammond also elaborated on the hard work that goes into impersonating public figures: “The problem is this: The closer you get to distasteful or what a person would consider below the belt, the funnier you are. But you really want to try and not step over that line if you can,” he said. “I mean, they are presidential candidates for God’s sake. You want to lend them that respect. It has to be on TV or in the newspaper or online. They have to do it.”\nHammond then said his impersonations are in good fun. “I think of it like a locker room towel snap,” he said.\nRead the full interview here.\nWatch a clip of Hammond as Trump on SNL below:","url":"https://www.breitbart.com/politics/2016/03/10/veteran-snl-cast-member-praises-donald-trump-most-positive-person-i-have-ever-seen/"}
