{"authors":["Hannah Paine For Daily Mail Australia"],"date_download":"2018-10-22 23:42:36","date_modify":"2018-10-22 23:42:36","date_publish":"2017-03-16 07:40:21","description":"As The Biggest Loser: Transformed returns to TV this week, Daily Mail Australia looks back at some of the series' most memorable participants.","filename":"data/vaneerConsumption/MostmemorableBiggestLoserAustraliacontestants.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E52052400000578-0-image-a-31_1489642141278.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4318784_The-memorable-Biggest-Loser-Australia-contestants_1540251756.html","title":"Most memorable Biggest Loser Australia contestants","title_page":"Most memorable Biggest Loser Australia contestants | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's the reality TV show that promises to transform the size and health of contestants.\nBut not all of The Biggest Loser's stars can boast just a smaller waist - as many also turned their weight loss on the show into financial gain that they still enjoy today.\nAnd as The Biggest Loser: Transformed returns to TV this week, Daily Mail Australia looks back at some of the series' most memorable participants.\nDaniel Jofre and The Jofre Family - 2015\nSo who was the biggest winner? Daily Mail Australia looks back at the most memorable Biggest Loser contestants - and how some turned weight loss into financial gain\nA then 24-year-old labourer, Daniel entered The Biggest Loser competition tipping the scales at 132 kilos and won the competition after shedding 51.6 kilos, bringing his weight down to just 80 kilos.\nDaniel was the joint winner with his uncle Rob and brothers Pablo and Tony, who also went onto make show history with the biggest combined weight loss totalling 208 kilos.\nTransformed: Daniel was the joint winner with his uncle Rob and brothers Pablo and Tony, who also went onto make show history with the biggest combined weight loss totalling 208 kilos\nFamily affair: Today the Jofres run a highly-successful personal training company, recently returning from a tour of the United States. Pictured: Tony Jofre\nToday the family run a highly-successful personal training company, recently returning from a tour of the United States.\nThe family promote their status as the biggest weight losers in the reality TV show's history to run one-on-one personal training sessions and special fitness events.\nDaniel has an active social media account where he provides regular updates of him working out and preparing healthy meals.\nAlison Braun - 2008\nTransformed! Mother-of-three Alison Braun won legions of fans when she managed to maintain her whopping 66 kilo weight loss after walking away from the show in 2008\nKeeping it off: And the 43-year-old has managed to maintain her 55 kilo figure almost a decade on\nMother of three Alison Braun won legions of fans when she managed to maintain her whopping 66 kilo weight loss after walking away from the show in 2008.\nAnd the 43-year-old has kept her 55 kilo figure almost a decade on, despite facing her fair share of hardship in the years after filming the show.\nAlison's husband tragically took his own life in 2009, and she was forced to have surgery to remove her toxic breast implants late last year.\nSam Rouen - 2008\nSuccess story: Overweight student Sam Rouen went from 154 kilos to 93 kilos, winning the season after clocking up the year's biggest weight loss\nLooking hot! Since his time on the show Sam has become a firefighter and shown off his ripped physique in fundraising calendars\nPerhaps the most popular winner in the show's history, 19-year-old university student Sam Rouen certainly struck a chord with viewers.\nThe overweight teenager went from 154 kilos to 93 kilos, winning the season after clocking up the year's biggest weight loss.\nSince his time on the show Sam has become a firefighter and shown off his ripped physique in fundraising calendars.\nFiona Faulkner - 2006\nLook at her now! The current host of the weight loss series got her start on TV as a shy 23-year-old from Geelong, Victoria\nMaking a comeback: The stunning blonde returned to the series as its host in 2015\nThe current host of the weight loss series got her start on TV as a shy 23-year-old from Geelong, Victoria.\nShe went onto to lose 30 kilos on the show, dropping down to just 71 kilos, and has since enjoyed a career as a successful plus-size model.\nThe stunning blonde returned to the show as its host in 2015.\nAdro Sarnelli - 2006\nOriginal: The first ever winner of The Biggest Loser Australia has enjoyed a successful career as a personal trainer, body builder and motivational speaker since his weight loss\nFitness is his business: The Newcastle man lost 51 kilos on the show, dropping from 136 to 85 kilos, and maintaining it after the series\nThe first ever winner of The Biggest Loser Australia has enjoyed a successful career as a personal trainer, body builder and motivational speaker since his weight loss.\nNewcastle resident Adro Sarnelli lost 51 kilos on the show, dropping from 136 to 85 kilos, and maintaining it after filming.\nBut this month, the father-of-three was accused by his former girlfriend Carla Price of leaving her 'damaged' when their relationship ended.\nEmma Duncan - 2011\nSlimmed down: Emma Duncan won her series after she shed an impressive 62 kilos, getting down from 133.9 kilos to 72 kilos\nNewcastle hairdresser Emma Duncan won her series after she shed an impressive 62 kilos, getting down from 133.9 kilos to 72 kilos.\nHowever Emma struggled to maintain her weight after leaving the series, at one point getting back up to 108 kilos.\nShe told The Daily Telegraph in late 2015 that she had managed to finally get her weight stable at 85 kilos.\nStruggled: Emma struggled to maintain her weight after leaving the series, at one point getting back up to 108 kilos. In 2015, she claimed her weight was at a stable 85 kilos","url":"https://www.dailymail.co.uk/tvshowbiz/article-4318784/The-memorable-Biggest-Loser-Australia-contestants.html"}
