{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 22:46:15","date_modify":"2018-10-30 22:46:15","date_publish":"2014-08-14 19:24:38","description":"News flash: Shark Week isn't real. Okay, well some of it's real, and you're not watching a television show in your mind — this isn't I Heart Hucakbees' \"how am I not myself?\" going on over here. But a lot of it is mythical — starting with Shark of…","filename":"data/vaneerConsumption/MostSharkWeekSharksArentRealButDoesItMatter.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/b714bf20-0e2d-499e-a5a6-efab2d737ba2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35818-most-shark-week-sharks-arent-real-but-does-it-matter_1540939575.html","title":"Most Shark Week Sharks Aren't Real, But Does It Matter?","title_page":"Most Shark Week Sharks Aren't Real, But Does It Matter?","title_rss":"NULL","source_domain":"bustle.com","text":"News flash: Shark Week isn't real. Okay, well some of it's real, and you're not watching a television show in your mind — this isn't I Heart Hucakbees' \"how am I not myself?\" going on over here. But a lot of it is mythical — starting with Shark of Darkness: Wrath of Submarine , which Vox pointed out is made up. Southern Fried Science also noted that it comes with a disclaimer slapped on by the Discovery Channel that says:\nIts existence is highly controversial. Events have been dramatized, but many believe Submarine exists to this day.\nSo basically, it's the Paranormal Activity of Shark Week. So we're supposed to assume that some people will swallow this shark-lore as real stuff because they ~believe~ and are smoking the shark ganja? Well, when there's evidence to back it up — ie: scientists on the documentaries — it seems like palatable, believable stuff, whether you're high on shark fin or not.\nBut io9 pointed out that real scientists are tricked to comment on what ends up being a fake-umentary. The gist of it is that producers contact experts to speak on behalf their specialties, without saying exactly what their comments will be used for — io9 gives the example of Jonathan Davis, who wound up being featured on 2013's Voodoo Sharks, via some slick editing that combined his comments to be about a mythical shark. Davis does not specialize in voodoo sharks, FYI.\nKoichi Kamoshida/Getty Images News/Getty Images\nBut it shouldn't come as too much of a surprise — Shark Week is all about the television version of click bait. Will people watch it? Is that a good title? We've already discussed how Shark Week names its titles before the shows are even developed — it's about giving the audiences something that will make them gasp in awe, or perhaps for accurately, tune in. And of course people will tune in to Zombie Sharks or Night of The Living Shark Whores (the latter is fictitious — although it definitely sounds like a worthy pitch for 2015, if you ask me). Add in the hoopla of \"IT'S SHARK WEEK!!!!\" and Discovery Channel has its viewership set.\nAnd while some may feel duped by The Discovery Channel's pseudo-science during Shark Week, it's not going to stop the majority from watching. You still click on that video of \"YOU MUST SEE THIS ADORABLE BABY SHARK AND A GORILLA SPEAK IN TONGUES OMG!!!!!\" after 10,000 dumb videos, only to see that it's sock puppets. And then you're like, \"why didn't I just watch that corgi running up an escalator that's going in the opposite direction? Ugh ugh — ooh, a shark-horse! What's that? A shorse?\" You get the picture, and you know the feeling.\nRyan Pierse/Getty Images Sport/Getty Images\nIt's inherently duplicitous of The Discovery Channel to entice scientists to donate their shark wisdom without telling them what their worlds will be used for, but that's unlikely to stop the powerful force that is Shark Week. The titles will likely get only more bizarre, outlandish and worthy of incredulity — until maybe it will hit a point where Shark Week will either dissolve, eat itself alive, or have to go back to being about, you know, real science.","url":"https://www.bustle.com/articles/35818-most-shark-week-sharks-arent-real-but-does-it-matter"}
