{"authors":[],"date_download":"2018-10-23 01:38:33","date_modify":"2018-10-23 01:38:33","date_publish":"2017-03-10 09:58:09","description":"The elegant columns of a west Mosul church stand plastered with Islamic State group propaganda after the jihadists' infamous religious police took over the...","filename":"data/vaneerConsumption/MosulchurchturnedintoISreligiouspolicebase.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/09/wire-195177-1489139894-353_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300600_Mosul-church-turned-IS-religious-police-base_1540258713.html","title":"Mosul church turned into IS religious police base","title_page":"Mosul church turned into IS religious police base | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An Iraqi soldier inspects the debris on January 22, 2017 at St. George's Monastery, on the northern outskirt of Mosul, which was destroyed by jihadists in 2015\nThe elegant columns of a west Mosul church stand plastered with Islamic State group propaganda after the jihadists' infamous religious police took over the Christian place of worship.\nThe sign above the door of Um al-Mauna (Our Mother of Perpetual Help) in Iraq's second city reads \"Chaldean Catholic church\", but its jihadist occupants had other ideas.\n\"No entry, by order of the Islamic State Hesba Division (the religious police), they wrote on the building's outside wall.\nFive jihadists lie dead outside, their bodies twisted and one with the top of his skull blown off, after Iraqi forces retook the neighbourhood from IS this week.\nThe church \"was an important office for the authorities tasked with making sure (Mosul) residents had a beard, wore short robes and followed their extremist convictions,\" says Lieutenant Colonel Abdulamir al-Mohammedawi of the elite Rapid Response Division.\nIraqi forces are pushing an offensive to retake the whole of Mosul, the jihadist group's last major urban bastion in the country, after retaking its eastern side in January.\nIS fighters took control of the city in 2014, imposing their harsh interpretation of Islamic law on its inhabitants.\nThe battle for Mosul\nAbove the door of the ochre-coloured church, IS members have damaged a stone cross. Not far away, they seem to have tried to rip another from a metal door off its hinges.\nNot a single crucifix, or statue of Jesus Christ or the Virgin Mary has survived in the building's nave, from which all mark of Christianity has been methodically removed.\nOnly the grey marble altar remains. In the church's empty alcoves lies the base of a statue that was probably also destroyed, decorated with red and yellow flowers.\nThe posters on the church's marble columns give an indication of what life was like under IS.\n- Chilling illustrations -\nOne shows religious invocations to repeat in the mornings and evenings, while another explains the benefits of praying in a mosque.\nA \"town document\" lists the 14 rules of life in Mosul under jihadist rule: \"The trade and consumption of alcohol, drugs and cigarettes is banned.\"\nWomen should wear modest attire and only appear in public \"when necessary\", it says.\nA pamphlet on the rubble-covered ground explains the different forms of corporal punishment prescribed for theft, alcohol consumption, adultery and homosexuality.\nIt comes complete with chilling illustrations.\nJihadists have scribbled their noms de guerre on the church's walls, and a large chandelier has been dumped in the yard.\nIn the church's small side rooms, artificial flower garlands are draped near posters explaining how to use a Kalashnikov rifle.\nChaldeans make up the majority of Iraq's Christians. But a community that numbered more than a million before the 2003 ouster of Saddam Hussein has since dwindled to less than 350,000 in the face of recurring violence.\nAn Iraqi man and a boy go through the wreckage of their home in the Shuhada neighbourhood of west Mosul on March 9, 2017\nIn June 2014, jihadist fighters led by IS seized control of Mosul and ordered the city's Christian community to convert to Islam, pay a special tax, leave or face execution.\nWeeks later, the jihadists swept through Qaraqosh and the rest of the Nineveh Plain east of Mosul, where an estimated 120,000 Christians lived, prompting them all to flee.\nBut the Um al-Mauna Church is in a better condition than most of the rest of the Al-Dawasa neighbourhood, which has been ravaged by the fighting.\nOn one of its empty trading streets, once flashy shop facades have been reduced to contorted iron and shredded concrete.\nOn one poster advertising male clothing, IS members -- whose interpretation of Islam forbids human representation -- have blacked out the faces and bare arms of the models.","url":"https://www.dailymail.co.uk/wires/afp/article-4300600/Mosul-church-turned-IS-religious-police-base.html"}
