{"authors":["Steph Cockroft For Mailonline"],"date_download":"2018-10-23 02:18:54","date_modify":"2018-10-23 02:18:54","date_publish":"2017-03-16 12:50:03","description":"Donna Robinson, from Castleford, West Yorkshre, said her daughter Poppy (pictured together) has tried to stab herself and has thrown herself in front of moving cars in an attempt to end her life.","filename":"data/vaneerConsumption/Mothersaysdaughterhastriedtokillherself50times.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E53AEDD00000578-0-image-a-38_1489668528685.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320100_Mother-says-daughter-tried-kill-50-times_1540261134.html","title":"Mother says daughter has tried to kill herself 50 times","title_page":"Mother says daughter has tried to kill herself 50 times | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A mother says her autistic eight-year-old daughter has tried to kill herself 50 times in the past year.\nDonna Robinson said her daughter Poppy has tried to stab herself and has thrown herself in front of moving cars in an attempt to end her life.\nThe mother-of-three said she is constantly having to watch the young girl and has to hide any items around the house which could be used in her suicide bid.\nDonna Robinson said her eight-year-old daughter Poppy (pictured togther) has tried to stab herself and has thrown herself in front of moving cars in an attempt to end her life\nMs Robinson, from Castleford, West Yorkshire, said: 'I think the number of attempts has been well over 50 times.\n'We cannot carry on like this. I have had to hide everything from her.\n'She recently came home from school with something she had made and I found her trying to strangle herself with it. I did not even think there was something she could use but this is what we have to look out for.'\nMs Robinson said there is no clear reason behind Poppy's actions but said she feels she is 'riding an unimaginable storm waiting for lightening to strike'.\nShe is now calling for improved mental health services for youngsters.\nThe worried mother says that, because she is helping Poppy, the schoolgirl is not getting help from NHS Wakefield Clinical Commissioning Group and Child and Adolescent Mental Health Services (CAMHS).\nShe said: 'There just seems to be no help available for young children.\n'No one hears or suspects children so young to be even thinking like this at such a young age but I know we are not the only ones. Nobody wants to speak up about it because they don't want to be viewed negatively but something has to be done.'\nThe mother-of-three said she is constantly having to watch the young girl (pictured)\nShe said it has been a 'constant battle' to get help.\n'The local NHS services want to discharge her but nothing has changed,' she said.\n'We need to be given the help to treat this now because when they get older, we will have less control and it will be much more difficult to stop them.'\nMs Robinson is also backing an initiative set up by another parent Nicola Dye, which calls for new measures to treat children.\nMs Dye, from Crewe, spoke out last year following her 13-year-old daughter Olivia's attempted overdose on the children's ward.\nShe has produced a list of aims and has started a petition to have them discussed in parliament.\nGillian Archbold, Diversity Manager at Wakefield-based charity Kidz Aware, said: 'We are helping more families now than anytime in the 25 years I have been working in the sector.\n'Most of the children who use CAMHS services say they have not been helped and still self-harm.\n'There is a bigger percentage of children who don't even get seen by CAMHS and that is because the GPs are not trained in mental health and unable to explain the extent of what the family is going through in the referral. Some of these children and families have had their lives turned upside down.'\nFor confidential support call the Samaritans on 116123, visit a local Samaritans branch or see www.samaritans.org for details.","url":"https://www.dailymail.co.uk/news/article-4320100/Mother-says-daughter-tried-kill-50-times.html"}
