{"authors":[],"date_download":"2018-10-30 21:49:05","date_modify":"2018-10-30 21:49:05","date_publish":"2016-12-21 18:26:00","description":"Naturally conceived quadruplets were born to a metro Atlanta couple on Friday. The babies, all weighing about 3 pounds, should be going home in February.","filename":"data/vaneerConsumption/MotherofGeorgiaquadrupletsWeregonnadoitWeregonnabeOK.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/21/Images/DSC_0889.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_mother-georgia-quadruplets-gonna-gonna__1540936145.html","title":"Mother of Georgia quadruplets: ‘We’re gonna do it. We’re gonna be OK’","title_page":"Mother of Georgia quadruplets: ‘We’re gonna do it. We’re gonna be OK’","title_rss":"NULL","source_domain":"ajc.com","text":"Kortney Miller gave birth to four babies on Friday, but it could be another seven days before she gets to hold them.\n“I’ve touched their feet, but I want to feel them,” she said.\nIn the few days since giving birth to the naturally conceived quadruplets at Piedmont Newnan Hospital via cesarean section, Miller has watched their pink legs stretch out and eyelids gently flutter open.\n“They were so squished at first,” she said. “But they’ve really grown.”\nNaturally conceived quadruplets were born to a metro Atlanta couple. (Piedmont Newnan Hospital)\nBrandon, Brayden, Bryant and sister Kenlee were born at 29 weeks, a typical age for multiples. All four weighed about 3 pounds.\nMiller and her husband, Justin, both 23, learned they were having more than one baby when Miller was just over a month pregnant. She was surprised, but not shocked. Multiples run in her family.\n“That’s all that’s on my momma’s side,” she said.\nShe figured she’d have two. Maybe three.\n“I thought ‘my body’s not gonna be able to carry four, I’m gonna die,’” Miller said. “I was scared.”\nA few weeks later she heard their heartbeats, and saw eight tiny feet on an ultrasound.\n“I thought, ‘we’re gonna do it, we’re gonna be O.K.,’” she said.\nEvery night for months she drank three glasses of chocolate milk to relieve her heartburn.\nOn Dec. 14, she started feeling a pressure in her belly. A scheduled C-section was still a month away. She told her doctor. By 8 a.m. Friday she was in the hospital with her mom, calling her husband and asking him to drive back home.\nHe was already on his way to Publix in Powder Springs, where he’s worked as a butcher since he was 18.\nHe had stopped for breakfast at Martin’s in Douglasville. He got the call when he was in line to order. He got out of line. The C-section was scheduled for 1:30.\n“So I got back in line,” he said.\n(www.accessatlanta.com)\nIn the delivery room were Miller’s husband, her mom and the couple’s 4-year-old son, Bentlee, who was nervous seeing his mom in a wheelchair.\n“I told him ‘momma’s fixin’ to go have your brothers and sister,’” Miller said. “He was panicking.”\nSince September the couple has prepared by telling Bentlee he’s going to be a big brother, stocking up on diapers and figuring out sleeping situations. Bentlee got to pick out his baby sister’s name, Kenlee. It’s the name of his old girlfriend at daycare.\nMiller, a stay-at-home mom, said they’re lucky to have a strong support system. Both her and her husband’s family live nearby, most are only a 10-minute drive away. When the babies come home around the end of February, their grandmothers will alternate weeks helping Miller.\nShe’s grateful for the support from the hospital, too.\nThe “quad squad” started planning for the babies’ arrival months earlier when Miller was about four months along. Over 20 doctors and nurses were in the delivery room Friday.\n“Things could not have gone better,” said Adegboyega Aderibigbe, a Piedmont neonatologist, in a news release. “Everyone knew what to expect. When the day arrived, we had a few hours’ notice and everything went smoothly, thanks to the ‘quad squad’s’ teamwork.”\nWhen the babies come home they’ll sleep in cribs in their parents’ room, two in each crib. It’ll be a change from their enclosed incubation beds.\n“They’ll only be 4 to 5 pounds when they come home,” she said. “They’re not gonna leave us.”","url":"https://www.ajc.com/news/local/mother-georgia-quadruplets-gonna-gonna/xCieHRWIWH5k9w1kEPfKtK/"}
