{"authors":["Siofra Brennan For Mailonline"],"date_download":"2018-10-23 00:40:54","date_modify":"2018-10-23 00:40:54","date_publish":"2017-03-16 10:13:12","description":"Jessica Williams, 23, of Hampshire had a difficult pregnancy including developing an angry red rash that she scratched until her skin bled, but it vanished moments after her daughter Ivy was born.","filename":"data/vaneerConsumption/Motherwasallergictopregnancy.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/10/3E535FF700000578-0-image-a-18_1489659186388.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4319514_Mother-allergic-pregnancy_1540255254.html","title":"Mother was allergic to pregnancy","title_page":"Mother was allergic to pregnancy | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A first-time mum has told how she was allergic to her unborn baby after she developed an angry red rash all over her body.\nJessica Williams, 23, of Waterlooville, Hampshire, watched the rash fade before her eyes minutes after she'd given birth.\nUnfortunately the full-time mum suffered a host of problems while pregnant with daughter, Ivy, now six months, including blood clots and severe morning sickness.\nJessica says: 'It was like my unborn baby was trying to kill me. The rash was unbearably itchy and it would keep me awake at night.\nProud parents Jessica Williams, 23, and Daniel Powell, 28, both of Waterlooville, Hampshire, pictured in September 2016 after the birth of daughter, Ivy\nAfter a difficult pregnancy, essica developed an angry red rash on her tummy at 38 weeks\n'But I was relieved that Ivy was born healthy despite my eventful pregnancy.'\nJessica met partner Dan Powell, 28, a roofer, in September 2014 and the couple discovered they were expecting their first child together in January 2016.\nJessica says: 'It was definitely a surprise, but we were so happy. I was smitten with Dan and we were excited to start a family.'\nBut, at just seven weeks pregnant, Jessica was hit by extreme morning sickness.\nWithin moments of giving birth to her daughter Ivy, Jessica was delighted to see her rash starting to fade\nShe says: 'Before I knew it, I was vomiting 10 times a day and couldn't keep anything down.\n'It got so bad that I was hospitalised for dehydration.\n'Thankfully, my illness didn't affect the baby and I was relieved when our 12-week scan showed that everything was fine.'\nTwo months later, Jessica's sickness was still persisting and after undergoing tests at her GP surgery, she was diagnosed with swine flu.\nThankfully she recovered within a fortnight.\nThe angry red rash on Jessica's baby bump. She was prescribed antihistamines to treat the condition, which she was told was linked to hormonal changes\nThe angry red rash pictured on Jessica Williams' leg. Her skin condition was so itchy she would scratch until she drew blood\nDespite feeling ill, Jessica was determined that nothing would spoil her pregnancy.\nShe says: 'At my 20-week scan, we were delighted to discover we were having a girl.\nWhat is PEP? Polymorphic eruption of pregnancy is the appearance of an itchy, bumpy rash during the last three months of pregnancy. It usually occurs in a first pregnancy and stars on the abdomen, particularly on stretch marks. Although it often spreads to other parts of the body it usually doesn't affect the face. The condition is more common in twin or triplet pregnancies and while it's been linked to hormone changes there's no definitive evidence as to why it happens.\n'Straight away, I started shopping for pink baby clothes and picked out a pram.'\nBut Jessica's problems continued and one morning, at 28 weeks, she couldn't sit up and her chest felt heavy.\nAt first she put it down to having a big bump, but, still unable to lift her body off the bed ten minutes later, she phoned her mum.\nJessica recalls: 'Mum was so worried she drove me to the doctors, who called an ambulance after realising how high my blood pressure was.'\nAt Queen Alexandra Hospital in Portsmouth, doctors told Jessica she had blood clots on her lungs which could be fatal.\nShe says: 'I was given blood-thinning tablets and strict orders to rest. But all I cared about was the wellbeing of my unborn child.\n'I was already on iron tablets as doctors discovered I had anaemia, a common condition in pregnancy.'\nJessica was excited to start a family with Daniel, but was hit with severe morning sickness at seven weeks and had to be hospitalised\nWorse still, at 38 weeks pregnant, Jessica developed an angry red rash on her belly.\nShe says: 'Red tendrils snaked around my stomach and my partner Dan agreed it was strange. It looked awful.'\nA week later, the rash had spread all over her body.\nShe remembers: 'I was so embarrassed and refused to show it to anyone. The itching became unbearable and I was constantly restless.\nDespite a difficult pregnancy, Jessica says it was all worth it for her baby daughter\n'I even scratched my skin so much that it bled.'\nJessica's GP diagnosed her with polymorphic eruption of pregnancy (PEP), which is related to hormone changes, and prescribed antihistamines to soothe the rash.\nShe says: 'Essentially, my body was trying to fight the pregnancy.\n'I was shocked though, after the other complications I'd suffered during my pregnancy I wondered what else would go wrong. But in the end, I knew my baby would be worth all the pain and stress.'\nThe doting mum is keen to have a sibling for Ivy, despite a tumultuous first pregnancy\nTwo weeks later, in September 2016, Jessica went into labour and gave birth to baby Ivy, weighing a healthy 8lb.\nShe says: 'As the nurses stitched me up, I glanced down at my stomach and was shocked to see the rash fading in front of my eyes - it was fascinating to watch.\n'But, as I held Ivy, all the problems of the past nine months just faded away.'\nBaby Ivy, who was born in September 2016, pictured when she was five weeks old\nIvy is now six months and thriving, despite all of the health complications her mum suffered while pregnant.\nJessica says: 'We'd love to give her a sibling one day.\n'Doctors have reassured me to experience the rash during a second pregnancy would be extremely rare, but if I had to, I'd go through it all over again.'","url":"https://www.dailymail.co.uk/femail/article-4319514/Mother-allergic-pregnancy.html"}
