{"authors":[],"date_download":"2018-10-22 21:01:29","date_modify":"2018-10-22 21:01:29","date_publish":"2014-06-03 20:45:45","description":"After weeks of searching, a South New Jersey mother got the chance to thank the strangers who helped her 15-month-old daughter during a seizure.","filename":"data/vaneerConsumption/MotherFindsMysteryMenWhoSavedBabysLife.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/485301/140603-good-samaritan-rescue-jms-1614_2b76fbf3d877c2b214000e0379ae9bd4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_mother-finds-mystery-men-who-saved-babys-life-n121701_1540242089.html","title":"Mother Finds Mystery Men Who Saved Baby's Life","title_page":"Mother Finds Mystery Men Who Saved Baby's Life","title_rss":"NULL","source_domain":"nbcnews.com","text":"Wearing plain clothes that Tuesday, the Good Samaritans turned out to be New Jersey State Police Detective Sgt. Michael Davis and his partner Detective Sgt. First Class Michael Flory.\nShari Williams had just pulled up to the Olive Garden in Deptford, N.J. to grab lunch with her two daughters when she noticed her baby girl, Diamon, had begun suffering a seizure and wasn't breathing.\nAlthough she is CPR certified, Williams panicked and cried for help worried her baby might die in her arms. Moments later, two men heard her high-pitched screams and rushed over to help.\nDavis took the child from the mother's arms and cradled the baby atop the hood of her SUV and applied chest compressions.\n\"We thought it was a joke at first. When we saw the mother she was definitely in a state of panic. The baby was just lifeless. So we knew this wasn't a joke. This was the real thing,\" said Flory.\nThe state police partners have been working together for the past 9 years and are known as the \"Mike and Mike Show.\" That day was the first time the officers were in a situation to give life-saving CPR. Their training paid off. Davis said Flory kept him calm while he administered the CPR.\n\"We were fortunate enough to be here at the right place at the right time,\" said Davis. \"Hopefully anyone in our situation who had the training in CPR would perform the duty to help out their fellow man.\"\nOnce Diamon gasped for air, there was a sigh of relief for all those who gathered in the parking lot. The baby was transported to Cooper University Hospital and was discharged hours later, diagnosed with having had a febrile seizure spurred on by a increase in temperature.\n\"We were praying she was OK,\" said Flory. \"We were curious to see her outcome and hoped she made it OK.\"\nWilliams tried getting in touch with the men, but didn't know their name. So she took to her Facebook page asking for anyone who may have known them to come forward.\nNBC10.com told Diamon's story and also posted Williams' plea to our Facebook page hoping to find the men. Then, two weeks ago, the men came forward.\n\"I give all the credit to your daughter. She is the one who is the fighter. We just happened to be at the right place at the right time,\" Davis said. \"She's the hero in this whole situation. It was Diamon's day to shine. I appreciate being able to help her out.\"\nDiamon is doing fine and is expected to grow out of the condition that caused the seizure, her mother said.\nOnce the reunion was over, Williams took Diamon and her 3-year-old sister to the lunch they never made it to three weeks ago.","url":"https://www.nbcnews.com/news/us-news/mother-finds-mystery-men-who-saved-babys-life-n121701"}
