{"authors":["Euan Mclelland For Mailonline"],"date_download":"2018-10-23 03:24:12","date_modify":"2018-10-23 03:24:12","date_publish":"2016-01-11 16:02:49","description":"The woman's 'entirely innocent' 12-year-old lost her place at the Queen's Gate School (pictured) in London because of the 'disastrous mess' that followed her mother's 'ridiculous' allegations.","filename":"data/vaneerConsumption/Motherwhofalselycomplainedthatteacherflirtedwithpupilhasdaughterthrownout.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300C0AB700000578-0-image-a-72_1452528526201.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394005_Mother-falsely-complained-teacher-18-000-year-girl-s-school-flirted-13-year-old-pupil-daughter-12-thrown-result_1540265052.html","title":"Mother who falsely complained that teacher flirted with pupil has daughter thrown out","title_page":"Mother who falsely complained that teacher flirted with pupil has daughter thrown out | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Ros Kamaryc (pictured), headteacher at Queen's Gate School in South Kensington, expelled the pupil after her mother's lewd allegations\nA mother who claimed a male teacher at a £18,000-a-year private school had 'flirted' with a pupil has lost a High Court bid to stop her own daughter being expelled following the accusation.\nA judge said the woman's 'entirely innocent' daughter had lost her place at the exclusive Queen's Gate School in South Kensington because of the 'complete, utter, disastrous mess' that followed her mother's 'ridiculous' allegations.\nMr Justice Jay, sitting in London, described the girl as being an 'excellent pupil' but refused her mother's request for an injunction to force the all-girls' school - described by the 2015 Tatler Schools Guide as 'seriously oversubscribed' - to re-admit her daughter.\nThe judge ruled the expulsion was not unlawful and that the school principal, Ros Kamaryc, had acted 'in good faith'.\nEducation bosses concluded that the mother's conduct breached the school's parent contract and led to 'a breakdown of trust and confidence' between parent and school.\nThe judge said: 'I regard the general situation here as distressing. That this child should have lost her place at this school in these circumstances is extremely unfortunate.\n'She is the one who ultimately will have to suffer from the disruption.'\nThe mother, who cannot be named for legal reasons but was referred to as FKS throughout the case, had applied for an emergency injunction requiring Queen's Gate to take back her child, SHS, in the first term of the new year. She also wanted her daughter's younger sister to start classes at the school too.\nThe judge said Queen's Gate wrote a letter to the mother in December 2015 'effectively terminating the relationship between the parties and expelling SHS', who had joined the school in September 2014.\nSHS had been awarded a 50 per cent bursary, but problems arose when the mother applied for a 100 per cent bursary and a meeting was arranged to discuss an increase.\nThe judge said the mother complained she was verbally attacked during the meeting on July 7, 2015, 'and effectively traumatised'.\nAllegations were made on both sides, and the mother then involved two friends in the matter, both of whom wrote to the school saying they were appalled by its conduct.\nThey also criticised the education and facilities the school offered.\nQueen's Gate School (pictured) wrote a letter to the girl's mother in December 2015 'effectively terminating the relationship between the parties and expelling SHS', who had joined the school in September 2014\nOne subsequently made further allegations in an email that a staff member had flirted with a 13-year-old pupil. That allegation was then repeated to the Charity Commission, who asked the Independent Schools Inspectorate (ISI) to investigate.\nThe Commission dismissed the complaint and described it as 'wholly unfounded', said the judge.\nThe mother accepted she was the source of the information behind the allegation but 'stringently denied' asking her friend to send the email - 'or indeed knew it was being sent'.\nMr Justice Jay said the 12-year-old lost her place at the school because of the 'complete, utter, disastrous mess' that followed her mother's 'ridiculous' allegations\nThe flirting incident was alleged to have occurred at a reception for new parents being welcomed to Queen's Gate in September 2014.\nIn it, the mother claimed a staff member, while talking to her, was 'looking over her shoulder at a female pupil and was flirting with her'.\nThe judge said the idea that there 'could have been flirting with a 13-year-old in the presence of the claimant strikes me as being entirely ridiculous'.\n'It is a serious allegation to make, however ridiculous it may sound, and certainly caused the [staff member] considerable personal concern and distress. I reject the allegation, which should not have been raised,' he said.\nDuring the hearing, the mother had told the judge she had received 'malicious and unfair' notice of her daughter's expulsion just four days before Christmas.\nOn New Year's Eve there was an email telling her not to send her daughter to Queen's Gate for the start of the new term on January 4.\nShe said an injustice had taken place because the terms of the parent contract had never been properly explained to her. She had also been denied a fair hearing.\nThe mother had made her application for an injunction in person. Outside court she said she had been unfairly refused an adjournment so that she could find a legal representative to put her case.\nShe said: 'The judge appears to have unreasonably ruled against me and not addressed all the evidence.","url":"https://www.dailymail.co.uk/news/article-3394005/Mother-falsely-complained-teacher-18-000-year-girl-s-school-flirted-13-year-old-pupil-daughter-12-thrown-result.html"}
