{"authors":["Julia Sidwell For Mailonline"],"date_download":"2018-10-22 23:23:04","date_modify":"2018-10-22 23:23:04","date_publish":"2016-01-28 12:16:07","description":"Fiona Miller, 26, from Orkney, Scotland, was diagnosed with multiple sclerosis at 28 weeks pregnant. She spent the first two months of baby Lucas' life having treatment and physio.","filename":"data/vaneerConsumption/MotherwasPARALYSEDbyMSfromthewaistdownaftergivingbirth.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30AA376300000578-0-image-a-21_1453983332554.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3419990_Having-baby-left-paralysed-Mother-26-diagnosed-MS-pregnant-reveals-weak-cuddle-newborn-learns-walk-again_1540250584.html","title":"Mother was PARALYSED by MS from the waist down after giving birth","title_page":"Mother was PARALYSED by MS from the waist down after giving birth | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An expectant mother has revealed how she was left paralysed from the waist down after giving birth to her first child.\nFiona Miller, 26, from Orkney, Scotland first passed off her bad headaches and blurry vision as normal symptoms of pregnancy.\nBut she was diagnosed with Multiple sclerosis at 28 weeks and, despite giving birth to a healthy son, was forced to spend the two months of his life learning to sit, stand and walk again.\nFiona Miller, 26, from Orkney, Scotland first passed off her bad headaches and blurry vision as normal symptoms of pregnancy. However she was left paralysed from the waist down after giving birth to her son Lucas (pictured)\nRecalling her shock diagnosis, Fiona said: 'She [the consultant] told me that I had lesions on my brain.\n'I didn't really grasp, at that stage, what a lesion was. Then the consultant told us I might have Multiple sclerosis.\n'I was stunned, and when I came out of the consultation I went back to my bed and just burst into tears. The last thing you want to hear when you're pregnant is that you might have a condition like that.'\nFiona first started suffering with ill-health when she was 18 weeks pregnant and initially tried to carry on as normal.\nFiona and partner Graeme Bain, were shocked to discover that Fiona had lesions on her brain. The mother-to-be was diagnosed with Multiple Sclerosis at 28 weeks. Pictured Fiona, Graeme and Lucas during her recovery\nDoctors had to wait until Fiona had given birth to start treatment for fear of harming her unborn baby. Two days after Lucas was born she started a course of disease-modifying drugs and eventually physiotherapy. By the beginning of July 2014, Fiona was using a zimmer frame and later a walking stick\nHowever when they got worse, she went to A&E with her partner Graeme Bain, 35, and the couple were given the suspected diagnosis.\nThe consultant could not tell whether the lesions were active or not. To find out for sure, dye would need to be injected into her brain which could potentially harm her unborn baby.\nFiona continued to fly back and forth from Orkney to Aberdeen to see her consultant.\nThen, in March 2013, her vision problems extended to both eyes and she started having problems with her balance.\nThe expectant mother was officially diagnosed with MS at 28 weeks pregnant, however she was unable to start treatment for fear of harming her unborn baby.\nShe said: 'While I tried to face the diagnosis head on, I had weakness in my legs, my balance was awful and my eyesight worsened.\nFiona said: 'Two days after giving birth my health deteriorated and I couldn't move my legs,' she said. 'I was paralysed from the waist down. It was simply terrifying'\nTwo days after giving birth, Fiona started treatment and Lucas was unable to stay in the hospital with her. She was devastated she was unable to look after her baby son and struggled to bond with him as a result\n'The doctors were unable to treat me with the disease-modifying drugs I needed because they would harm my baby.\nFortunately, they arranged for me to start an infusion treatment immediately after I gave birth.'\nFiona gave birth to a son Lucas in May 2014. She and father Graeme were relieved he'd been born healthy, but Fiona's ideas of being a hands-on mother were soon stripped away.\n'Two days after giving birth my health deteriorated and I couldn't move my legs,' she said. 'I was paralysed from the waist down. It was simply terrifying.'\nFiona had relapsing remitting MS, which meant her symptoms would come and go. Pregnancy only increased the risk of relapse, which damaged the coating around the nerve fibres in Fiona's brain and caused paralysis.\nTwo days after giving birth, Fiona started treatment and Lucas was unable to stay in the hospital with her.\n'I didn't start seeing the positive effects of treatment for seven weeks,' she said. 'When I started receiving alemtuzumab, I got really cold, my eyesight got worse, and I was dealing with all of this with a new baby.\nFiona could only give Lucas a bottle once a day and there were days she was far too tired to spend much time even holding him. She said: 'I wished I could have given him the cuddles that a mother should'\nAt first she was afraid to spend time alone with her newborn son, who is now 20 months (pictured). She said: 'The first day I spent 15 minutes with Lucas by myself while Graeme went out of the room to take a phone call - it was petrifying'\nFACTS ABOUT MULTIPLE SCLEROSIS There are 200,000 to 3 million cases each year in the US Treatment cannot cure MS, but it can reduce how the number of relapses you have and slow down the damage that builds up over time MS is when the immune system attacks the protective sheath that covers a person's nerves MS is an incurable condition. Once diagnosed, MS stays with you for life Some people with severe MS may lose the ability to walk\n'The worst part was that Graeme and Lucas were unable to stay in the hospital with me. It was heartbreaking seeing them walk out the door every night - no mother should have to watch that.'\nFiona was devastated she was unable to look after her baby son and admitted she struggled to bond with him as a result.\n'I gave Lucas a bottle once a day, if that,' she said. 'There were days I was too tired to spend much time even holding him.\n'I wished I could have given him the cuddles that a mother should give their newborn child.\n'I also didn't feel secure enough to hold him for any length of time. I remember the first day I spent 15 minutes with Lucas by myself while Graeme went out of the room to take a phone call – it was petrifying.\n'I was also unable to breastfeed because of the treatment I was receiving. I was quite upset because I'd really been looking forward to doing it.'\nWith treatment and extensive physiotherapy, Fiona eventually learnt to sit up and to stand again.\n'It felt like it was taking ages and I was very impatient,' she said. 'The first time I tried to stand I fell to the floor.\nFiona was also incredibly disappointed about being unable to breastfeed baby Lucas because of her treatment (pictured cradling him in hospital)\nFiona is now back home and, with Graeme and her family's support, she's doing her best to be the hands-on mother she always wanted to be. She struggles to stand for long periods and is unable to carry Lucas very far\n'The second, I managed to stand for three seconds. But after a second dose of treatment, I began to feel much stronger. When my left leg began to move again, I knew it was all coming back.'\nBy the beginning of July 2014, Fiona was using a zimmer frame and a couple of weeks later she was able to use crutches.\n'It felt like an achievement, but I was only able to walk about 20 metres at the most using walking aids,' she said.\nNow Fiona is back home and, with Graeme and her family's support, she's doing her best to be the hands-on mother she always wanted to be.\n'I'm okay day-to-day, but I still can't walk like I once could,' she said. 'I still struggle to stand for long periods and can't carry Lucas for long distances. It's tough, but I am determined to get better for Lucas.'\nMore than 100,000 people live with MS in the UK and the condition effects almost three times as many women as men.\nSymptoms usually start in 20s and 30s, at a time when some women may be thinking about starting a family.","url":"https://www.dailymail.co.uk/femail/article-3419990/Having-baby-left-paralysed-Mother-26-diagnosed-MS-pregnant-reveals-weak-cuddle-newborn-learns-walk-again.html"}
