{"authors":["Hannah Moore","Tanya Li For Daily Mail Australia"],"date_download":"2018-10-23 01:10:24","date_modify":"2018-10-23 01:10:24","date_publish":"2017-03-16 10:52:43","description":"Karl-Melo Richards was last seen by his mother at their family home in Maroubra, Sydney, in September last year and hasn’t been heard from since.","filename":"data/vaneerConsumption/Mothersanguishatfindingacureforhermissingson.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/05/3E501D9000000578-0-image-a-21_1489643415528.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4318484_Mother-s-anguish-finding-cure-missing-son_1540257024.html","title":"Mother's anguish at finding a cure for her missing son","title_page":"Mother's anguish at finding a cure for her missing son | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A mother has issued a desperate plea urging her missing son to go and see a doctor.\nKarl-Melo Richards was last seen by his mother at their family home in Maroubra, Sydney, in September last year and hasn't been heard from since.\nJust one week before his disappearance, the 25-year-old had tests on his hair follicles to try and treat his depression.\nThen, three weeks after he went missing, the results came back showing he had an 'off the chart' amount of heavy metal toxins in his bloodstream.\nHis mother Vanessa Richards told that's life! magazine that her son had 10 times the normal level of aluminium, lead and uranium in his system.\nVanessa Richards (pictured with her son Karl when he was three) has issued a desperate plea to her missing son to go and see a doctor\nKarl-Melo Richards was last seen by his mother at their family home in Maroubra last year\nShe thinks he could have come in contact with them through his job or while surfing in metallic waters.\nAnd she believes he may have a condition which meant he could not process the metals through and out of his system - which she said could have been fixed with a special diet and supplements.\nShe claimed he could also have tried an alternative therapy called chelation where a synthetic product is injected into the bloodstream to help remove the metals.\n'It was such awful timing. After nine years of looking for answers, suddenly we had one – but no Karl,' she said.\nBut six months on, she still has hope he will return home.\n'Of course, I sometimes think the worst might have happened and he's ended his life but I cling to hope for my son,' she said.\n'Darling, if you're reading this, please call me. I love you and always will.'\nShe hasn't seen him since 1.45pm on September 2 when she left for work.\nJust one week before his disappearance, the 25-year-old had tests on his hair follicles to try and treat his depression\nHis mother, Vanessa, has previously addressed her missing son in an emotional video, urging him to seek immediate medical attention\nThe family returned home later that afternoon to find him gone, with the front and back doors open and Mrs Richards has said she knew immediately that something 'was very wrong.'\nMr Melo-Richards' left his keys, wallet and car behind but took his mobile phone, which was later switched off.\nEarlier that day, he had split up with his long-term girlfriend and had been suffering from frequent depressive episodes in the last year.\nHe had not slept for four days before his disappearance.\nShe said the family kept their house unlocked hoping he would walk back in.\nThey walked for hours sticking posters bearing Mr Melo-Richards' face on lamp posts.\n'At night, I went on the internet posting his description, praying for a sighting. But it was like he'd vanished into thin air,' she said.\nShe's previously addressed her missing son in an emotional video, urging him to seek immediate medical attention after results of tests performed before he went missing revealed high levels of heavy metals and traces of uranium in his blood.\nShe then tells him to go to a doctor who performs chelation to detoxify and remove heavy metals or minerals from the body, which will gradually lift the depression.\n'If you can hear this message please go to a doctor that does chelation. I hope then that you may be able to think more clearly and return to us some day,' she says, tearing up.\n'If you can't return, just to let us know that you're out there and you're okay would be a great comfort. We miss you so much.'\nMr Melo-Richards had just completed his carpentry course when he went missing.\nMr Melo-Richards (left) had just completed his carpentry. He spent the last three years working as an apprentice plumber and was almost qualified\nMissing posters have been placed in south Maroubra and surrounding suburbs\nHe spent the last three years working as an apprentice plumber and was almost qualified.\nHe is described as being of Caucasian appearance, 175-180cm tall, broad-shouldered with a fit medium build, olive skin, close-cropped brown hair and brown eyes.\nWhen he was last seen he was wearing a T-shirt or long sleeved, dark blue fleecy lined hooded canvas jacket, dark blue jeans and closed-in shoes, and carrying an 'FCS' brand backpack.\nAnyone who saw Mr Melo-Richards between 2pm and 5pm on September 2, particularly in the South Maroubra area, near Broome St or the surf club, is urged to call police.","url":"https://www.dailymail.co.uk/news/article-4318484/Mother-s-anguish-finding-cure-missing-son.html"}
