{"authors":[],"date_download":"2018-10-30 20:17:27","date_modify":"2018-10-30 20:17:27","date_publish":"2016-02-16 23:16:03","description":"The mother of a DeKalb student shot to death while away at college pleaded on Tuesday for help solving her son’s murder.","filename":"data/vaneerConsumption/MotherofslainSavannahStatestudentpleadsforhelp.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/02/16/Videos/4758487819001.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_mother-slain-sav_5cc5c76595ff43c171d13f2f85099a3a__1540930647.html","title":"Mother of slain Savannah State student pleads for help","title_page":"Mother of slain Savannah State student pleads for help","title_rss":"NULL","source_domain":"ajc.com","text":"The mother of a DeKalb student shot to death while away at college pleaded on Tuesday for help solving her son’s murder.\nSharron Starks during a press conference asked students who may know something to come forward with information about the death of her 22-year-old son, Christopher Starks.\nFor a mother to send her child away to college and see him come home in a body bag is very, very painful, Sharron Starks said during the press conference.\nChristopher Starks, who graduated from Miller Grove High School in 2012, was a junior at Savannah State University when he was shot to death during a fight in the student union on Aug. 27.\nHe was a former football standout and an aspiring rapper who performed under the name “Booley Boo,” The Atlanta Journal-Constitution previously reported.\nChristopher Starks received a scholarship to play football at Appalachian State University, but later transferred to be closer to family, his father earlier told the Atlanta Journal-Constitution.\nThe investigation is ongoing and no arrests have been made in the case.\nAnyone with any information about the incident is requested to call SSU Police at 912-358-3004 or the GBI Statesboro Office at 912-871-1121.","url":"https://www.ajc.com/news/local/mother-slain-savannah-state-student-pleads-for-help/OHd2JbC5a2vekz8yPjXP6J/"}
