{"authors":["Esra Gurkan For Mailonline"],"date_download":"2018-10-23 03:28:08","date_modify":"2018-10-23 03:28:08","date_publish":"2017-04-26 14:49:56","description":"What started out as an innocent text exchange soon turned sour, when a mother who thought she was texting her daughter accidentally messaged a 35-year-old man from Wisconsin.","filename":"data/vaneerConsumption/Motherrefusestobelieveshehastextedthewrongnumber.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/14/3FA0052A00000578-0-image-a-4_1493214380495.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4446830_Mother-texts-WRONG-person-hilarious-exchange_1540265288.html","title":"Mother refuses to believe she has texted the wrong number","title_page":"Mother refuses to believe she has texted the wrong number | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man has shared the hilarious text exchange he had with a stranger after she refused to believe he wasn't her daughter.\nImgur user velakskin, from Wisconsin, shared screenshots of their messages on the site, and they have already been viewed by over 130,000 people in just a few hours.\nIn the messages the mother mistakenly contacts the 35-year-old believing him to be her 18-year-old daughter Jess, and asks him to pick up milk, turkey and ham.\nBut despite his efforts to warn her that she had confused his number for someone else's, she refused to believe him and became increasingly angry at 'Jess'.\nImgur user velakskin has shared a text exchange he had with a mother who refused to believe she had the wrong number - and it racked up over 130,000 views\nEven after sending selfies of himself and his wife to the unknown number the mother still believed that Jess was behind the messages, and as punishment for what she believes to be a prank, threatened to cancel her promised trip to the movies.\nAfter many texts, he later went to the shops and sent her a picture of himself with a carton of milk and some turkey, but he said, 'I didn't get ham because as I said earlier I don't like ham'.\nEventually the mother realises that he is telling the truth upon discovering Jess asleep at home, and launches a torrent of abuse his way.\nHowever, the Imgur user remains unfazed admitting that he will be posting their entire exchange online as it is 'internet gold.'","url":"https://www.dailymail.co.uk/femail/article-4446830/Mother-texts-WRONG-person-hilarious-exchange.html"}
