{"authors":[],"date_download":"2018-10-30 14:31:36","date_modify":"2018-10-30 14:31:36","date_publish":"2015-06-10 00:00:00","description":null,"filename":"data/vaneerConsumption/MothersuesFranceforlettingherkidjoinISIS.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_06_mother_sues_france_for_letting_her_kid_join_isis_1540909896.html","title":"Mother sues France for 'letting' her kid join ISIS","title_page":"Mother sues France for 'letting' her kid join ISIS","title_rss":"NULL","source_domain":"americanthinker.com","text":"The mother of a young Frenchman who converted to Islam and went to join jihadist fighters in Syria is suing the state for failing to stop him leaving the airport of his Riviera home town of Nice.\nWith all the radical Muslims living there now, how nice can Nice be?\nBryan Dancona, from a Catholic family, left Nice two days after celebrating Christmas with relatives at the end of 2013, and is now in Syria, from where he occasionally telephones his mother Nadine, said her lawyer Samia Maktouf, who argued the case at a civil court in Paris on Tuesday. Nadine Dancona is seeking 110,000 euros ($124,000) on the grounds border police at Nice airport should have stopped a minor - Bryan was 16 at the time - for questioning when he turned up with no personal belongings other than his identity papers for a flight toTurkey, a staging post for people traveling into war-torn Syria.\nThe mother, who appears to be of Arab descent, seems to be saying that the French government, and not she, was responsible for the conduct of her child.\nI'm always confused by parents who throw up their hands in feigned ignorance and say, \"We had no idea that X was going to join the Islamic State!\" When the son converted to Islam, don't you think his \"Catholic\" family should have noticed? Did they not notice their son becoming fundamentalist, speaking in favor of radical Islam, and speaking of intolerance and violence towards others?\nThe fact that this mother is suing France is the ultimate in shifting responsibility. Was France responsible for raising her child, or inculcating him with hate? No, his mother and father were.\nRather than the mother suing France, I think the French people should sue France for the crime of bringing in hundreds of thousands of intolerant Muslims, a non-trivial percentage of whom hunt down and kill civilians with impunity.\nThis article was produced by NewsMachete.com, the conservative news site.","url":"https://www.americanthinker.com/blog/2015/06/mother_sues_france_for_letting_her_kid_join_isis.html"}
