{"authors":[],"date_download":"2018-10-23 03:04:46","date_modify":"2018-10-23 03:04:46","date_publish":"2016-01-29 17:50:26","description":"A mother who took her toddler to Syria and joined the Islamic State (IS) group is thought to have become Friday the first British woman to be convicted after...","filename":"data/vaneerConsumption/MotherwhotooktoddlertoRaqqaconvictedbyUKcourt.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7i4ev-4PuZeKVXE7cd9005b2c876cd3c9e-786_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3423211_Mother-took-toddler-Raqqa-convicted-UK-court_1540263886.html","title":"Mother who took toddler to Raqqa convicted by UK court","title_page":"Mother who took toddler to Raqqa convicted by UK court | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Mother who took toddler to Raqqa convicted by UK court\nA mother who took her toddler to Syria and joined the Islamic State (IS) group is thought to have become Friday the first British woman to be convicted after returning home.\nTareena Shakil, 26, was found guilty of IS membership and encouraging terrorism in posts on Twitter before leaving Britain.\nThe court in Birmingham, central England, heard she was radicalised on the Internet and in October 2014 told her family she was going to Turkey for a beach holiday.\nAn undated photo released by West Midlands Police service and received in London on January 29, 2016, shows Tareena Shakil as she poses for a custody photograph\nInstead, she crossed the border into Syria and then went to IS stronghold Raqqa.\n\"I left to build us all a house in heaven, allah promised us heaven if we sacrifice our worldly life x,\" she wrote in a message to a relative. \"I'm not coming back.\"\nIn Raqqa, she was kept in a large house with other single women and posed with her son for a selfie while wearing a black balaclava branded with the IS symbol.\nOther pictures found on her phone showed her posing with an AK-47 assault rifle and a hand gun.\nHowever, Shakil found life under IS rules too strict.\nIn January 2015, after repeatedly looking up \"I want to leave ISIS\" on the Internet, she and her son travelled by road to the Turkish border.\nThey ran one kilometre to escape into Turkey, dodging a three-man IS patrol before handing themselves into the Turkish military, she told the court.\nShe was arrested when police boarded her flight home at London's Heathrow Airport last February.\nDuring her trial, Shakil claimed she only travelled to Syria because she wanted to live under sharia law.","url":"https://www.dailymail.co.uk/wires/afp/article-3423211/Mother-took-toddler-Raqqa-convicted-UK-court.html"}
