{"authors":["Sophie Williams For Mailonline"],"date_download":"2018-10-23 02:15:11","date_modify":"2018-10-23 02:15:11","date_publish":"2016-01-28 17:02:49","description":"The 30-year-old mother had her hard earned cash snatched by a scammer who had offered to sell her bus tickets to her home province. The woman was spotted sobbing in a bus station by Chinese media.","filename":"data/vaneerConsumption/MotheroftworobbedofhardearnedcashbyascammerinChina.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/12/30A9A15500000578-0-image-a-17_1453984312834.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3420768_The-long-road-home-Moment-thrifty-mother-two-loses-hard-earned-cash-heartless-robber-trying-buy-train-ticket-family_1540260911.html","title":"Mother of two robbed of hard earned cash by a scammer in China","title_page":"Mother of two robbed of hard earned cash by a scammer in China | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"During the run up to China's Lunar New Year, people in the country look forward to returning home and seeing their family.\nBut Xiao Wei, a mother of two was left devastated after a scammer robbed her of £159 (1,500 yuan) in a long-distance bus station snatching the money from her hand, the People's Daily Online reports.\nThe 30-year-old mother was trying to travel by bus from east China's Fujian province to her home-town of Nanning in Guangxi province.\nUpsetting: Xiao Wei had saved £159 (1,500 yuan) to pay for tickets for her and her children to travel home\nAngry: The mother-of-two was trying to visit her hometown while her husband stayed behind to work\nXiao Wei's husband works as a fisherman and is working at sea during the holidays, so she opted to return home to visit family.\nThe mother arrived at the bus station Quanzhou to find that tickets to Nanning were sold out. The mother decided to return home and try again the next day.\nHowever when she got in a taxi to return home, the driver said he knew someone who worked for the bus company and could supply her and her children with tickets.\nShe met with the employee who offered her tickets for £63 (600 yuan). The mother, who had her daughter in her arms took out her entire savings and the man quickly snatched her cash from her.\nBefore she had time to put her daughter down, the man had disappeared.\nUpset: Xiao Wei was left crying in the bus station after being robbed by a man posing as a bus employee\nHeartwarming: Generous passersby handed the woman cash to help pay for her tickets home\nHelp: Police took a statement from Xiao Wei and have warned people of buying secondary tickets\nThe woman was later seen by locals and Chinese media crying in the bus station.\nShe was heard calling out: 'I am a mother with two children. Why would someone try to scam me?'\nLocal police arrived on the scene and took a statement from her.\nGenerous passersby gave the mother money to enable her to return home.\nShe thanked the police for their assistance saying: 'You are the reason I still have hope in humanity.'\nAuthorities have warned people of incidents of inflated prices of tickets and scammers selling fake tickets during the Lunar New Year travel period.\nIn January 2014, 814 people were arrested for selling fake train tickets. Over 49,000 tickets were confiscated in the run up to the Lunar New Year period during that year.","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3420768/The-long-road-home-Moment-thrifty-mother-two-loses-hard-earned-cash-heartless-robber-trying-buy-train-ticket-family.html"}
