{"authors":["Sophie Williams For Mailonline"],"date_download":"2018-10-22 23:05:19","date_modify":"2018-10-22 23:05:19","date_publish":"2016-01-29 10:50:16","description":"A mother in south-west China has created over 220 different breakfasts with a fairytale theme for her daughter. The mother says she wanted to help her child become more confident at school.","filename":"data/vaneerConsumption/MotherinChinacreatesfairytalethemedbreakfastsforherdaughter.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/08/30B0814200000578-0-image-a-10_1454056168531.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_peoplesdaily_article-3420996_Loving-mother-crafts-delicious-meals-daughter-daily-depicts-different-fairytale_1540249519.html","title":"Mother in China creates fairytale themed breakfasts for her daughter","title_page":"Mother in China creates fairytale themed breakfasts for her daughter | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For most parents, getting their children to eat certain types of food can be a nightmare.\nBut a mother in south-west China has found an ingenious way of ensuring that her daughter eats a healthy meal each morning - by making her breakfast depicting a different story, the People's Daily Online reports.\nBy January 13 this year, the mother, named Wang Jing, had made over 220 different breakfasts for her seven-year-old child.\nBeautiful: The mother creates a different breakfast every day for her daughter before she goes to school\nTimid: The mother Wang Jing (left) says her daughter (right), named Xiao Xiong, is very shy in the classroom\nDifferent: Each plate of food tells its own story based on the family's personal experiences\nWang Jing stopped working in early 2015 to become a housewife.\nShe says her daughter, known by the name of Xiao Xiong, is very shy and she hoped that creating an exciting breakfast would make her happier when going to school.\nThe mother has a story behind each breakfast. She says her inspiration comes from daily life.\nWang wakes up early every morning to create an exciting breakfast where no story is the same.\nTalking to Chinese media she said: 'I want to give her a special gift so she can happily go to school.'\nWang Jing posts the breakfast photos online every day.\nThe photos include a dragon made from strawberries and bananas and a woodland scene featuring a deer made from rice cake and broccoli trees along with quail's eggs.\nOne dish the mother made featured ducks swimming in front of a bridge made from mushroom dumplings.\nAccording to Wang Jing, her daughter was set to attend a story-telling competition that day and was going to tell a story about ducks swimming in front of a bridge.\nShe designed the colourful breakfast to cheer for her daughter before the contest.\nWang Jing made this dish for her daughter on the day she was set to tell a story about ducks at school\nCute: For this dish, the mother used rice cake to create the deer and broccoli to make a tree scene\nEncouragement: The mother hoped that making the breakfasts would help conquer her daughter's shyness\nAccording to the mother, Xiao Xiong has become more confident thanks to the exciting breakfasts and she says she will continue to cook thrilling dishes for the child as she adapts to real life.\nThis isn't the first case of people in China making exciting dishes for their loved ones.\nIn December last year, it was reported that a devoted husband cooked three different dishes every day for his wife to help her regain her appetite after childbirth.\nHe prepared 600 various dishes over 273 days.\nPretty plate: Dishes have included woodland creatures, dragons, swans and even angry birds characters","url":"https://www.dailymail.co.uk/news/peoplesdaily/article-3420996/Loving-mother-crafts-delicious-meals-daughter-daily-depicts-different-fairytale.html"}
