{"authors":["Catherine Simpson For Mailonline"],"date_download":"2018-10-23 03:41:24","date_modify":"2018-10-23 03:41:24","date_publish":"2016-01-29 18:50:59","description":"Catherine Simpson from Edinburgh knew her daughter was different but her fears were dismissed by doctors. Nina was diagnosed with autism aged ten, inspiring her mother to write a book.","filename":"data/vaneerConsumption/Motherrevealshowshewassentonparentingcoursesandfeltlikeafailurebeforeherdaughterwasdiagnosedwithautismagedten.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B49B8600000578-0-image-a-7_1454093399047.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-3423181_Mother-reveals-sent-parenting-courses-felt-like-failure-daughter-diagnosed-autism-aged-ten_1540266084.html","title":"Mother reveals how she was sent on parenting courses and felt like a 'failure' before her daughter was diagnosed with autism aged ten","title_page":"Mother reveals how she was sent on parenting courses and felt like a 'failure' before her daughter was diagnosed with autism aged ten | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A mother who felt a failure as a parent when doctors failed to diagnose her daughter with autism has written a book based on her experiences.\nCatherine Simpson from Edinburgh knew her daughter Nina was different from an early age but her fears were dismissed by medical professionals.\nHere she talks to FEMAIL about her journey up until Nina was finally diagnosed with Asperger's syndrome age ten, and beyond...\nCatherine Simpson struggled with her daughter Nina, pictured above with her mother as toddler, because doctors failed to diagnose her with autism. Inspired by her daughter she has now written a book about autism\nIt was festival day in my home town and I was excited to be taking my one-year-old daughter, Nina, to see the parade for the very first time.\nAs a child I'd always loved it and I couldn't wait to share it with her. The floats and bands headed our way and my friend's baby - who was the same age - clapped and stared in wonder but Nina screamed and writhed in my arms and wouldn't be calmed.\nI took her to a nearby café but she still screamed so I took refuge in the toilet where she instantly calmed down.\nI could faintly hear the cheers of the crowd as I stood in the cubicle cuddling Nina, feeling terrified and very lonely because her reaction had confirmed something I'd been trying to ignore since she was born: Nina was different.\nRight from birth Nina looked as though she was at odds with the world - crying constantly and never sleeping for more than an hour or two at a time.\nShe only quietened when we picked her up facing away from us so there was no one 'in her face' and she preferred to take her bottle propped on the sofa not being cuddled (very much against the guidelines).\nCatherine, above with Nina today, first knew something was different about Nina during a festival day in her home town. While other babies loved the parade Nina screamed and writhed and wouldn't be calmed\nPeople tried to reassure me: 'It's just a phase, she'll grow out of it.' I lived in hope.\nEvery day I'd wake up and think: 'I wonder if today life will become normal.' But it never did. Mixing with other babies was a nightmare: their noise upset Nina and I found myself constantly apologising and leaving in tears.\nAt home, though, Nina discovered books - from only eight months old she could turn the pages in a board book. From 18 months she was forming a rudimentary alphabet.\nRight from birth Nina cried constantly and never slept for more than an hour or two at a time. She preferred to take her bottle propped on the sofa and not being cuddled by anyone. Above, Nina as baby with Catherine\nWhen she was two I took her to the GP and explained that she was upset a lot and didn't seem to hear me when I tried to reassure her.\nThey tested her hearing, which was perfect, and referred me to a doctor who was considered a leading autism specialist.\nUnfortunately he laughed in my face and declared: 'That child has not got autism.' I think this dismissal was probably because at that time autism was thought to be a boy's condition. We struggled on.\nAt school Nina was clever but had difficulty making friends. She found the noise and chaos of the playground overwhelming.\nNina, above aged six (front), was not a sociable child. Catherine invited children round to the house and organised games to help her make friends - but Nina lost interest and would disappear to her room\nI spent many hours inviting children round to the house and organising games to help her make friends - only to find myself playing with the visitors on my own as Nina lost interest and disappeared to her room.\nWhen she was seven I asked for another referral. This time she was assessed by various psychologists who said it was all my fault.\nI was sent on two parenting courses and told: 'If you treat your child differently, she will act differently.'\nOn their advice we brought in the 'naughty step' and star charts and rewards - none of which made the slightest bit of difference except to make me feel like a failure as a mother.\nThese were very dark days. I was giving motherhood my all but didn't seem to be able to help my eldest child - by now I had another daughter, Lara, three years younger than Nina, who appeared to be sailing through school without any problems.\nNina, above aged ten, was bullied at school where children ostracised her, called her names and once even kicked her down the stairs. The school claimed to have a zero tolerance approach, but nothing was done\nI read every book I could get about hidden disabilities. I knew there was something but I'd been told categorically that it wasn't autism, so what was it?\nI was baffled, distraught and very lonely. My husband and I discussed how best to help Nina but we didn't know what we were dealing with.\nI think we were both terrified for her future and it was too much to express out loud, even to each other.\nPrimary school was becoming more fraught with the introduction of homework, which caused enormous stress - Nina believed schoolwork should be done at school - and we were desperate to get to the bottom of things before she began secondary school.\nI asked for another referral when she was ten.\nThis time we saw Dr Nicky Cannon, Consultant Child and Adolescent Psychiatrist at Edinburgh's Sick Children's Hospital.\nShe was wonderful and listened to what I said - something I'd not felt before. She met Nina and carried out an assessment and told us she had Asperger's syndrome (a form of autism).\nAbove: a family picture with Nina, Catherine, Lara and dad Marcello on a trip to Graceland. Nina struggled to come to terms with her diagnosis at first until one day she and Catherine discussed her special talents - including how she'd learned to read without trying and could absorb the words in a book\nI burst into tears in her office and she asked: 'You're not surprised are you?' No, I wasn't surprised - but it was still a shock to have it confirmed that my child had a life-long incurable condition that might affect every aspect of her life.\nI read everything I could about Asperger's syndrome and many things fell into place.\nOften people with Asperger's are very sensitive to loud noises and smells; crowds are stressful; unpredictable events may be upsetting; friendships may be tricky. It was like I'd been given 'The Nina Handbook'. I began to understand her and it was an enormous relief.\nNot only did I now know for sure that her difficulties weren't my fault but Nina began to understand herself too.\nUnfortunately, other people were less understanding. Secondary school turned into a nightmare of bullying. Various boys and girls made Nina's life a misery.\nNina doesn't like the term Autism Spectrum Disorder because she is not 'disordered'. Left, Nina, Catherine and Lara. Right, Nina's card to Catherine at age ten, shortly after she was diagnosed with Asperger's syndrome\nNina, above age 15, got a full set of 'A's at Edinburgh Steiner and a place studying German at Edinburgh University. She is now in her third year, living independently in Germany and having the time of her life\nThey ostracised her, called her names, took her things and one day even kicked her down the stairs. We discussed the bullying with the school, which claimed to have a zero tolerance approach to it, but nothing was done.\nWe withdrew Nina and sent her to the Edinburgh Steiner School where she thrived from the moment she walked in.\nShe made friends and discovered a love of German. For the first time she was part of a community.\nHowever, it took Nina a while to come to terms with her diagnosis.\nCatherine Simpson wrote Truestory about a boy with autism based on her own experiences\nOne day in the car we had a conversation about what a wonderful brain she had: how she had an amazing memory; how she'd learned to read without trying; how she could absorb the words in a book much faster than I could.\nFrom then on she became proud to be autistic - that is her preferred word.\nShe doesn't like the term Autism Spectrum Disorder because she is not 'disordered'. It was during the very hardest time - when Nina was being bullied at school - that I started to write.\nFeeling trapped at home I began an Open University course in Creative Writing.\nThey say 'write what you know' and I started to write a novel, called Truestory, about a woman with a son called Sam, a child with autism who refuses to leave the house.\nIt is fictional but it is inspired by many of the experiences we had raising Nina - the ups and downs, the terror of the unknown, the fear for the future.\nThe opening chapters won a Scottish Book Trust New Writers Award in 2013.\nThe book deals with a serious subject, but is full of hope and humour, with many laughs provided by Sam's secret online life.\nIt seems right to have a happy ending because we have had our own 'happy ending'.\nNina got a full set of A's at Higher at Edinburgh Steiner and a place studying German at Edinburgh University. She is now in her third year, living independently in Germany and having the time of her life.\nNina didn't read the book until it was published - she wanted it to be 'a proper book' before she looked at it - and her reaction was heartwarming and a huge relief.\nShe said: 'I like it because it is a sympathetic portrait of a kid with autism. It shows we are not just being difficult or a nuisance, but that we can't turn our weird off.'\nIf Truestory helps other families who are going through something similar not to feel so alone, then for me that will be the happiest ending of all.","url":"https://www.dailymail.co.uk/femail/article-3423181/Mother-reveals-sent-parenting-courses-felt-like-failure-daughter-diagnosed-autism-aged-ten.html"}
