{"authors":[],"date_download":"2018-10-22 22:02:40","date_modify":"2018-10-22 22:02:40","date_publish":"2014-05-08 19:59:33","description":"The mother of one of the abducted Nigerian girls says that she'd rather the Boko Haram terrorists burn down her home than keep her daughter.","filename":"data/vaneerConsumption/MotherofNigerianSchoolgirlJustReturnMyDaughter.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/422526/140506-msn-140506-boko-haram-430a-0728_2c69bd71eb92a408e8cf222bd4078905.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_world_mother-nigerian-schoolgirl-just-return-my-daughter-n100696_1540245760.html","title":"Mother of Nigerian Schoolgirl: Just Return My Daughter","title_page":"Mother of Nigerian Schoolgirl: Just Return My Daughter  ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe mother of one of the abducted Nigerian girls says that she'd rather the Boko Haram terrorists burn down her home than keep her daughter.\n\"I prefer — if they would ask my suggestion — they should go into my house, burn my house, break everything inside of my house, if they give me my daughter, that would be better for me, than taking my daughter,\" the woman, identified as Ester, told Al Jazeera in a video that was shared with NBC News.\n\"Even if they take my life at that moment, I think I'm satisfied more than if they take my daughter away. Honestly I'm not happy at all. I just feel like killing myself.\"\nHer 15-year-old daughter was among nearly 300 schoolgirls taken from the northern Nigerian town of Chibok by the fundamentalist group whose name means \"Western education is sinful.\"\nThe group's leaders are reportedly selling the girls to other Islamists in Nigeria, Chad and Cameroon.\nAl Jazeera also interviewed a girl who was able to escape from the terrorists. Her father insisted that they blur her face out of fear of reprisals.\n\"After they attacked the town, they then took us to their camp,\" the girl recounted. \"I and three other girls lied to them, saying that we needed to use the toilet. That is how we ran away. They chased us but we kept running.\"\nThe U.S. has pledged to do more to help return the abducted girls to their families. Secretary of State John Kerry said Thursday that a team of U.S. officials and agents from across the government are arriving in Nigeria now to help find the girls and help the Nigerian government counter threats from Boko Haram.","url":"https://www.nbcnews.com/news/world/mother-nigerian-schoolgirl-just-return-my-daughter-n100696"}
