{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:52:48","date_modify":"2018-10-30 19:52:48","date_publish":"2015-10-05 13:14:46","description":"On October 1 Cheyenne Fitzgerald was shot in the back during the attack at Umpqua Community College, and her mother says the attack is a reminder that Americans must be armed for self-defense.","filename":"data/vaneerConsumption/MotherofOregonShootingVictimTellsAmericansTheyMustBeArmed.json","image_url":"https://media.breitbart.com/media/2015/02/gun-free-zone-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_05__1540929168.html","title":"Mother of Oregon Shooting Victim Tells Americans They Must Be Armed","title_page":"Mother of Oregon Shooting Victim Tells Americans They Must Be Armed | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On October 1 Cheyenne Fitzgerald was shot in the back during the attack at Umpqua Community College, and her mother says the attack is a reminder that Americans must be armed for self-defense.\nDuring a segment aired by NBC Nightly News on October 4, Fitzgerald’s mother–Bonnie Schaan–said her daughter should have been armed and she stressed that Americans must arm themselves so they are able to defend their lives if such a heinous attack befalls them.\nSchaan said, “America we need to pack guns–if this is what it’s coming to–to have to protect ourselves.” And Schaan was not alone in her views. Rather, numerous Sunday sermons in Roseburg, Oregon, focused “God and guns.”\nOn October 2 Breitbart New reported that Roseburg residents were rallying to the Second Amendment in the wake of the attack. One resident–disabled Marine Casey Runyan–said he carries a Glock handgun “everywhere he goes.” He added, “All my friends agree with me. That’s the only kind of friends I have.” Another resident criticized the gun-free policies at UCC, claiming such policies open the door to cowardly attackers.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/10/05/mother-oregon-shooting-victim-tells-americans-must-armed/"}
