{"authors":[],"date_download":"2018-10-22 23:01:17","date_modify":"2018-10-22 23:01:17","date_publish":"2014-05-13 09:30:10","description":"One mother watched the video on television on Monday evening and spotted her daughter, said Dumoma Mpur in Chibok, Nigeria.","filename":"data/vaneerConsumption/MotherIDsHerDaughterinBokoHaramVideoofNigerianSchoolgirls.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2015_03/435466/140512-boko-haram-girls-615a_3b1b1e9775136d2661af7e911428fe35.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_mother-ids-her-daughter-boko-haram-video-nigerian-schoolgirls-n103921_1540249277.html","title":"Mother IDs Her Daughter in Boko Haram Video of Nigerian Schoolgirls","title_page":"Mother IDs Her Daughter in Boko Haram Video of Nigerian Schoolgirls","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA mother of an abducted Nigerian schoolgirl has identified her daughter in a video posted by Islamist rebels that showed dozens of girls in captivity, a school leader said on Tuesday.\nThe mother watched the video on television on Monday evening and spotted her daughter among the girls sitting on the ground and wearing veils, said Dumoma Mpur, parent-teachers association chairman at Government Girls Secondary School in Chibok, northeastern Nigeria.\n\"The video got parents apprehensive again after watching it but the various steps taken by the governments and the coming of the foreign troops is boosting our spirit, even though I have not seen the any one soldier in Chibok yet,\" Mpur told Reuters by telephone.\nThe leader of rebel group Boko Haram, Abubakar Shekau, issued the video on Monday offering to release more than 200 schoolgirls, who were kidnapped from the school in a raid on April 15, in exchange for prisoners held by the government. It was not immediately apparent when the video of the girls was filmed.\nThe Nigerian government said it was exploring all options in its effort to rescue the girls. The United States and Britain have sent experts to help with the search and Nigeria has sent two divisions to the northeastern border region.\n-Reuters","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/mother-ids-her-daughter-boko-haram-video-nigerian-schoolgirls-n103921"}
