{"authors":["James Gordon For Dailymail.Com"],"date_download":"2018-10-23 04:14:31","date_modify":"2018-10-23 04:14:31","date_publish":"2017-03-16 15:28:00","description":"A mother from Port Orange, Florida became frantic after realizing someone had taken her daughter from a daycare center. Holly Smith's child was reported gone for nearly two hours.","filename":"data/vaneerConsumption/Mothers911callafterdaughterwastakenbyWRONGperson.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54C79E00000578-0-image-a-23_1489674924722.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320314_Mother-s-911-call-daughter-taken-WRONG-person_1540268071.html","title":"Mother's 911 call after daughter was taken by WRONG person","title_page":"Mother's 911 call after daughter was taken by WRONG person | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The mother of a four-year-old child was in for a nasty shock on Friday afternoon when it was discovered her little girl had already been picked up by another woman at the school.\nHolly Smith, 32, from Port Orange near Daytona Beach, Florida, was told that a coworker of hers had already collected her daughter from daycare.\nIt meant that when the mom-of-two arrived, one of her kids was nowhere to be found.\nTo make matters worse, there appeared to be a catalog of mistakes made in the run-up to the girl, called Emily, being released from the school.\nScroll down to hear the 911 call\nMom-of-two Holly Smith's child was reported gone for nearly two hours after she was picked up by the wrong person from daycare\nIn a 911 call in which lasted for more than ten minutes, Holly is heard desperately calling the police to tell them that her daughter is nowhere to be found.\nShe tearfully explains what staff at the center told her: that someone masquerading as a co-worker of hers came to pick up her child.\n'I have no idea who it would have been,' she tells the dispatcher through floods of tears. 'They said they had made arrangements but I hadn't. I am sorry for calling 911 but I didn't know what else to do.'\nDuring parts of the call, Holly completely breaks down and is unable to speak as she sobs down the line.\nTowards the end of the recording, a staff member comes on the phone and explains to the dispatcher during the chaos of the children's dismissal a woman presented ID to a teacher and explained that an arrangement had been made to pick Emily up.\nHowever, despite obvious warning signs including the little girl's reluctance to leave with a stranger she had never met, the imposter said the child's mother was on the phone and that it was okay to go.\nThe staff at the center then told Holly that they had been told over the phone earlier in the day that she had personally instructed a coworker to pick up her daughter.\nHolly says that she neither made nor received any such call from the center.\nThen, as staff then hurriedly looked for surveillance footage to determine who it was that collected Emily, it was revealed that the CCTV cameras at the Pathways Early Learning Center were not working.\nThere was no physical record as to whom the youngster had gone home with.\nIt made for a terrifying two hours for Holly who at one point questioned whether she might even see her child again.\n'It was just almost two hours of pure hell,' Ms Smith told News 6. 'When I was told the cameras weren't functioning. I lost it, because that would have been the only lead in finding whoever took her.'\nThe center's CCTV cameras were broken, so there was no record of who came to collect the missing child\nIt wasn't until the daycare was about to close that staff finally realized what had happened.\nAnother child had been left behind and someone had somehow picked up the wrong kid, taking home Holly's daughter instead.\nEventually that woman brought Emily back to the daycare. The nursery claim that the woman is a friend of another mother and was instructed to pick up her child but accidentally collected the wrong one.\nHolly has now removed both of her daughters from the center after the scare.\nShe claims she had chosen the facility based on its security features it boasted that included a fingerprint entry system and all-round CCTV coverage.\nCaregivers are also supposed to show photo identification before picking up children.\n'This is inexcusable,' Holly said. 'They have all of these security measures, and it was still allowed for my child to go home with the wrong person.'\n'We just want the security measures to be thoroughly examined and fixed. No parent should ever go through what I had to go through that day.'\nPathways Early Learning Center has released the following statement:\n'On Friday, there was an incorrect pairing of parent and child at school dismissal. The child's parent had made advanced arrangements to have a friend pick up the child. The friend had never met the child before. When she arrived at the center, she provided proper ID to prove she was the parent's appointee.\nThe center could be fined up to $500 for sending the wrong child home with a stranger. Holly Smith is no longer leaving her children there after this potentially serious mistake\n'Apparently, this appointee retrieved the incorrect child. Immediately upon discovering the inadvertence, the center was able to effect the correct pairings. All children were safe and accounted for within a short time.\n'The center is conducting an investigation as well as cooperating with all governmental agencies regarding the matter. The center is happy that the day ended with all children in their appropriate homes. '\nPort Orange Police say no charges will be filed, but the Florida Department of Children and Families is investigating and the facility could face a $500 fine.","url":"https://www.dailymail.co.uk/news/article-4320314/Mother-s-911-call-daughter-taken-WRONG-person.html"}
