{"authors":[],"date_download":"2018-10-22 21:35:12","date_modify":"2018-10-22 21:35:12","date_publish":"2014-05-07 18:54:38","description":"Mothers are the latest group of people urging the president to stop deportations of immigrants.","filename":"data/vaneerConsumption/MothersUrgeObamatoUsePowerofPentoStopDeportations.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/427011/1440507-immigration-reform-1439_33eb2396c863e62a48975c541b6f281f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_latino_mothers-urge-obama-use-power-pen-stop-deportations-n99591_1540244112.html","title":"Mothers Urge Obama to Use Power of Pen to Stop Deportations","title_page":"Mothers Urge Obama to Use Power of Pen to Stop Deportations","title_rss":"NULL","source_domain":"nbcnews.com","text":"A group of mothers, some not legally in the country, urged President Barack Obama Wednesday to use \"the power of the pen\" to halt deportations that have numbered about 2 million during his time in office and urged Congress to pass immigration reform.\nThe mothers from several U.S. cities told their personal stories of being separated from family and living in the U.S. under a fear of deportation. The protest was planned for just a few days before Mother's Day to underscore the deportation impact on families. A report issued Tuesday detailed the disproportionate impact of deportations on Latino families.\nTheir protest coincided with the release Wednesday of statement from the office of Democratic Rep. Steny Hoyer of Maryland that listed 30 Republicans with comments supportive of immigration reform. \"Is Speaker Boehner listening?\" the statement asks.\nObama has ordered a review of immigration enforcement policies, but has also delayed taking executive action in hope that Republicans would act by summer. Recent analyses of the president's enforcement policies show the bulk of deportations are focused on people who have recently crossed the border or tried to enter again after a previously ordered deportation and those accused of a crime, whether serious or a misdemeanor.","url":"https://www.nbcnews.com/news/latino/mothers-urge-obama-use-power-pen-stop-deportations-n99591"}
