{"authors":["Mail Online Reporter"],"date_download":"2018-10-23 03:15:17","date_modify":"2018-10-23 03:15:17","date_publish":"2017-03-16 14:00:41","description":"A BBC journalist, her camera crew and a group of German tourists fled for their lives today as Mount Etna, Europe's most active volcano, exploded in Italy today.","filename":"data/vaneerConsumption/MountEtnaeruptsforcingBBCfilmcrewtoflee.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/18/3E5739A400000578-0-image-a-8_1489687543804.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320394_Tourists-BBC-crew-forced-flee-Mount-Etna-erupts_1540264517.html","title":"Mount Etna erupts forcing BBC film crew to flee","title_page":"Mount Etna erupts forcing BBC film crew to flee | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A BBC journalist, her camera crew and a group of German tourists have been caught on camera fleeing from an eruption on the slopes of Mount Etna in Italy today.\nA woman can be heard screaming on the video as those caught on the volcano rushed to get back into a minibus which took them to safety. An elderly man, a tourist, can be seen bleeding from a cut on his forehead.\nLater in the video banging and booming sounds can be heard as the volcano erupts.\nAfter running to safety the BBC's global science correspondent, Rebecca Morelle, tweeted: 'BBC team all OK - some cuts/ bruises and burns. Very shaken though - it was extremely scary.\n'Running down a mountain pelted by rocks, dodging burning boulders and boiling steam - not an experience I ever ever want to repeat,' she added.\nShe described it on Twitter: 'Lava flow mixed with steam - caused huge explosion - group pelted with boiling rocks and steam.'\nMs Morelle, who was on the volcano with cameraman Rachel Price and producer Alison Francis, said eight people had suffered head injuries, burns, cuts and bruises.\nMount Etna erupted for the third time in just under three weeks, spitting molten lava nearly 650 feet into the sky above Sicily.\nThe temperature inside the mountain is believed to be 1,000 degrees Centigrade (1,832 degrees Fahrenheit).\nThe crew kept filming as they fled from the eruption of Mount Etna\nAn elderly man (pictured left), believed to be a tourist, can be seen mopping a bleeding wound on his forehead\nSnow-covered Mount Etna, Europe's most active volcano, spews lava during an eruption in the early hours of Thursday\nMount Etna is pictured erupting in the early hours of Thursday. 'Many injured - some head injuries, burns, cuts and bruises. Volcanologist said most dangerous incident experience in his 30 year career,' a BBC journalist at the scene said\n'An amazing 78 year old lady was very close - but safely got away,' Ms Morelle tweeted.\n'Incident could have been worse - explosions like this have killed - but seems minor injuries for now,' she added.\nItalian news reports say scientists investigating the recent eruptions were injured when magma spewing from the volcano hit snow, causing an explosion.\nThe Catania operation centre of Italy's volcanology institute confirmed today that members of a team taking measurements on the active volcano had been injured, but had no details on the numbers involved or the seriousness of the injuries.\nThe Italian authorities said 35 tourists were on the volcano when the eruption happened.\nMount Etna, on the east coast of Sicily, close to the 'toe' of the Italian mainland 'boot', is Europe's most active volcano\nA BBC camera crew, including journalist Rebecca Morelle (left) were caught up in the explosion. Lava and steam explodes from the volcano in the early hours of Thursday morning (right)\nThe BBC's global science correspondent, Rebecca Morelle, was at Mount Etna on Thursday afternoon when it erupted again\nClouds of ash can be seen emerging from the bowels of the Earth. Mount Etna, in Sicily, is almost 11,000 feet high\nSnow-covered Mount Etna, Europe's most active volcano, spews lava during an eruption in the early hours of today\nLava flow mixed with steam caused a huge explosion around lunchtime on Mount Etna on Thursday\nLava can seen pouring down Mount Etna today on this photograph taken from the European Space Agency satellite Sentinel. The volcano is close to the east coast of Sicily (seen on the right)\nThe president of the Italian Alpine Club chapter in Catania, Umberto Marino, was travelling up the volcano in a snowmobile when injured people started running in his direction.\nHe told the Catania Today website: 'The material thrown into the air fell back down, striking the heads and bodies of people who were closest.'\nThe Italian news agency ANSA said three German tourists and another person were taken to hospital with head injuries.\nA scientist from Italy's volcanology institute, Boris Behncke, suffered a bruise to his head but he said on his Facebook page: 'I am generally fine and having a good, well-deserved beer in this moment.'\nMr Behncke said it was 'frightening, and spectacular at the same time.'\nThis latest phase of activity at Europe's highest volcano follows the first eruption in more than a year at the end of February.\nThe eruption came from a relatively new crater on the southeastern side of the 3,000-metre peak.\nIt was captured on film by Italy's Geology and Vulcanology Institute (INGV).\nEtna has been putting on a show in recent days, however Catania's airport remains open and there have been only periodic spews of volcanic ash.\nThe new eruption began on Wednesday and continued on Thursday as tourists and scientists visited Mount Etna\nThe eruption early on Thursday morning came from a relatively new crater on the southeastern side of Mount Etna\nMount Etna is seen from the side of a road as it spews lava during an eruption earlier on Thursday\nItalian news reports say scientists investigating the recent eruptions on Thursday afternoon were injured\nThis file photo shows an eruption at Mount Etna on Wednesday, before the latest incident which the group were caught up in","url":"https://www.dailymail.co.uk/news/article-4320394/Tourists-BBC-crew-forced-flee-Mount-Etna-erupts.html"}
