{"authors":["Khaleda Rahman","Daniel Piotrowski For Daily Mail Australia"],"date_download":"2018-10-22 23:54:19","date_modify":"2018-10-22 23:54:19","date_publish":"2017-03-16 08:12:33","description":"Kemel Barakat, 29, was found dead after being hit with more than a dozen bullets in his stomach and chest while he was asleep in his home in Mortlake in the early hours of Friday.","filename":"data/vaneerConsumption/MournerssayfarewelltoSydneyHellsAngelsbikieBlackie.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/08/3E525AF300000578-0-image-a-2_1489651938019.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319034_Hundreds-mourners-farewell-Hells-Angels-bikie-Blackie_1540252459.html","title":"Mourners say farewell to Sydney Hells Angels bikie Blackie","title_page":"Mourners say farewell to Sydney Hells Angels bikie Blackie | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hundreds of mourners gathered to farewell a Hells Angel bikie associate known as ‘Blackie’ who was shot dead as he slept.\nKemel Barakat, 29, was found dead after being hit with more than a dozen bullets in his stomach and chest while he was asleep in his home in Mortlake in Sydney in the early hours of Friday.\nOn Thursday, mourners arrived at the Alawi Youth Movement Centre in Marrickville for Mr Barakat’s funeral.\nThere was a heavy police presence at the service with several marked and unmarked vehicle doing laps of the industrial area as it was held, according to the Sydney Morning Herald.\nHundreds of mourners gathered to farewell a Hells Angel bikie associate who was shot dead as he slept. Pictured, the coffin carrying the body of Kemel Barakat is carried out by relatives\nThe service was also well attended by undercover police officers and reporters 'acting casual' in their cars.\nDuring the memorial service, a washed Mr Barakat was wrapped up in a white cloth with his face exposed.\nRelatives, including his wife Amanda, spoke to him and said heartfelt final farewells, some touching his neck.\nHe was carried in his casket to Rookwood Cemetery where he was buried.\nAmong those paying their respects was Ahmad ‘Rock’ Ahmad, a close friend of Mr Barakat and the brother of murdered crime figure Wally Ahmad.\nMr Barakat was aware that he was being targeted as just weeks before his death, he avoided being shot in Sydney’s western suburbs.\nHe had only been living in the Mortlake apartment for a month or so when he was killed.\nMourners are pictured outside the Alawi Youth Movement Centre in Marrickville following Mr Barakat’s funeral service\nAmong those paying their respects was Ahmad ‘Rock’ Ahmad (pictured), a close friend of Mr Barakat and the brother of murdered crime figure Wally Ahmad\nThe address was only supposed to be known to his close friends, family and the police.\nHis unit was secure – but according to the Herald, there was no sign of forced entry inside.\nIt has been claimed the woman inside the apartment when Mr Barakat died was in his bed at the time of his death.\nHowever, the woman was not injured and his wife has cast doubt on those claims.\nHis wife was on holiday in Thailand at the time.\nPolice are investigating whether Mr Barakat was killed for his alleged role in the brazen public shooting of hitman Hamad Assaad.\nMr Barakat, who was a senior member in the Comancheros before switching allegiances, is one of numerous suspects in the murder of 29-year-old Mr Assaad, who was killed outside his home in Georges Hall in October last year.\nMr Barakat (pictured) was a senior member in the Comancheros before switching allegiances\nMr Barakat (pictured with his wife) was shot dead while his wife was on holiday in Thailand\nMr Assaad is reportedly the prime suspect in the public shooting of convicted killer Walid ‘Wally’ Ahmed a few months earlier.\nHe was killed after being shot on the rooftop car park of the Bankstown Central shopping centre in April.\nOne theory proposes that Mr Assaad was killed as revenge for his suspected role in Mr Ahmad’s death.\nTen underworld figures have been killed in Sydney since 2015.\nThe spate of bloody murders prompted NSW Police to launch Strike Force Osprey in November to oversee the investigations into each of the incidents.","url":"https://www.dailymail.co.uk/news/article-4319034/Hundreds-mourners-farewell-Hells-Angels-bikie-Blackie.html"}
