{"authors":["Sami Mokbel For Mailonline"],"date_download":"2018-10-22 23:29:29","date_modify":"2018-10-22 23:29:29","date_publish":"2016-01-29 11:26:39","description":"Sportsmail understands the Belgium midfielder has signed a four year contract - with an option for a further year. Dembele has established himself as a key member of Pochettino's plans.","filename":"data/vaneerConsumption/MousaDembelepensnewfouryeardealatTottenhamaftermidfielderbecomeskeyfigureunderbossMauricioPochettino.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/11/30B1DF2900000578-0-image-a-44_1454067428302.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3422603_Mousa-Dembele-pens-new-four-year-deal-Tottenham-midfielder-key-figure-boss-Mauricio-Pochettino_1540250969.html","title":"Mousa Dembele pens new four-year deal at Tottenham after midfielder becomes key figure under boss Mauricio Pochettino","title_page":"Mousa Dembele pens new four-year deal at Tottenham after midfielder becomes key figure under boss Mauricio Pochettino | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Tottenham midfielder Mousa Dembele has handed Mauricio Pochettino a huge boost by signing a new long term deal.\nThe Belgium midfielder has signed a new four-year contract - with the option of a further year.\nSigning the midfielder to fresh terms was viewed as a priority by chairman Daniel Levy given he had just 18 months left on his current deal.\nMousa Dembele puts pen to paper on a new four-year contract alongside manager Mauricio Pochettino\nDembele, pictured in action against Crystal Palace, has made 18 Premier League appearances this season\nDembele has established himself as a key member of Pochettino's plans this season with a number of excellent displays.\nHe told Spurs TV: 'I am very happy I've signed and I'm happy to be part of our future.\nMOUSA DEMBELE AT TOTTENHAM Joined: August 29, 2012 Cost: £15million from Fulham Appearances: 143 Goals: 9\n'The way we're playing, the way the club is developing, everything is very good and everyone wants to be part of this team and this club.\n'That's why I'm proud to extend my contract.'\nDembele joined Spurs from Fulham for £15million in the summer of 2012 and has gone on to play 143 times in all competitions, scoring nine goals.\nThe former AZ Alkmaar star has netted four goals in 20 appearances so far this season, including a winner against Anderlecht in the Europa League group stage.\nPochettino shakes hands with midfielder Dembele at Tottenham's training ground in Enfield on Thursday\nDembele says he is proud to extend his contract at White Hart Lane after joining the club back in 2012\nDembele added: 'I think we're playing very well as a team. The team is very young and I'm one of the older players now.\n'It's nice to play in this team with the new young players. They're doing fantastic. Every year you can see we are getting better and better.\n'The vibe is very nice. You want to be in a club where the vibe is good and the future is bright. That's why I'm so happy to have extended.\n'If you're happy somewhere then time flies. Of course (I feel at home). That's the biggest thing for me, to feel comfortable.\nDele Alli and Christian Eriksen celebrate with Dembele after his goal against Aston Villa in November 2015\nDefender Kevin Wimmer (left) tussles with Dembele during a Tottenham training session in Enfield\n'I'm very happy about my season at the moment. It's easier to play well if the team is playing well. We know what to do in the games and we have a certain style.\n'I'm very happy with the season so far but we want to achieve something. We need to keep winning the games and at the end of the season I hope I can have more positive talk than at the moment.","url":"https://www.dailymail.co.uk/sport/football/article-3422603/Mousa-Dembele-pens-new-four-year-deal-Tottenham-midfielder-key-figure-boss-Mauricio-Pochettino.html"}
