{"authors":[],"date_download":"2018-10-22 20:43:14","date_modify":"2018-10-22 20:43:14","date_publish":"2014-06-02 20:11:12","description":"Several movie and television filming companies want the OK to use unmanned aircraft for aerial photography.","filename":"data/vaneerConsumption/MovieCompaniestoFAALetUsFlyDronesForFilming.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/482736/140602-video-drone-jms-1805_3b2c17f90dd290efa805bbac9793c3d7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_tech-news_movie-companies-faa-let-us-fly-drones-filming-n120616_1540240994.html","title":"Movie Companies to FAA: Let Us Fly Drones For Filming","title_page":"Movie Companies to FAA: Let Us Fly Drones For Filming","title_rss":"NULL","source_domain":"nbcnews.com","text":"The FAA has been under intense pressure from Congress and industry to allow commercial drone flights to do work that in many cases is too dirty, dull, or dangerous for manned aircraft. Drones are also often less expensive to operate than manned aircraft. The agency has been working for the past decade on safety regulations to permit widespread commercial drone use, but has repeatedly delayed issuing regulations.\nThe FAA's current timetable calls for releasing proposed regulations for operating small drones — usually defined as weighing less than 55 pounds — by November. It would take at least months, and possibly years, after that to make the regulations final.\nFAA officials caution that rushing to gain the economic and other benefits of drones could put manned aircraft at risk. U.S. skies have more aircraft and more varied types of aircraft and aircraft operations than anywhere else in the world.\nBen Gielow, general counsel for the Association for Unmanned Vehicle Systems International, a trade association for the commercial drone industry, said he's pleased the FAA is considering the petitions. But he said if the agency \"is only going to grant permission on a limited, case-by-case basis, then this doesn't really open up the skies for anyone who wants to fly.\"\nDespite FAA's ban, drones have already been used by the movie industry, including to film parts of the Martin Scorsese-directed movie \"The Wolf of Wall Street.\" Remote or autonomous aircraft can be a godsend to the filmmaking process. Shots where you'd normally have to use a helicopter — with pilot, copilot, camera operator, and more — can be done from the ground with drones, saving money and manpower.\nA wide range of other businesses from real estate agents to beer makers to journalists have also ignored the drone ban.\nAt least two lawsuits have been filed challenging the ban. An administrative law judge with the National Transportation Safety Board who heard one of the challenges ruled that the FAA can't enforce regulations that don't yet exist. The agency is appealing that decision.\n— The Associated Press and NBC News staff","url":"https://www.nbcnews.com/tech/tech-news/movie-companies-faa-let-us-fly-drones-filming-n120616"}
