{"authors":["Liam Deacon"],"date_download":"2018-10-30 20:06:09","date_modify":"2018-10-30 20:06:09","date_publish":"2016-11-14 12:09:28","description":"Tory MPs and members of Theresa May’s cabinet have called on the Prime Minister to make use of Nigel Farage's close links to Donald Trump to build transatlantic links and a trade deal after Brexit.","filename":"data/vaneerConsumption/MPsCallonTheresaMaytoMakeUseofFaragesLinkstoDonaldTrump.json","image_url":"https://media.breitbart.com/media/2016/11/GettyImages-622856346.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_11_14__1540929969.html","title":"MPs Call on Theresa May to Make Use of Farage's Links to Donald Trump","title_page":"MPs Call on Theresa May to Make Use of Farage's Links to Donald Trump","title_rss":"NULL","source_domain":"breitbart.com","text":"Tory MPs and members of Theresa May’s cabinet have called on the Prime Minister to make use of Nigel Farage’s close links to Donald Trump to build transatlantic links and a trade deal after Brexit.\nOver the weekend, the interim UKIP leader became the first foreign politician to meet with President-Elect Trump since the U.S. election. Mrs. May was the 11th world leader to speak to Mr. Trump on the phone, after the presidents of Egypt and Mexico.\n“We should not dismiss Nigel Farage,” a senior government source told The Telegraph following Mr. Farage’s meeting. Another said it was clear “some dialogue” would be essential with Mr. Farage. “Conversations will have to happen,” they added.\nTory peer and former trade envoy Lord Marland agreed: “Anything we can do at any level to rebuild that relationship will be to Britain’s advantage, and if Farage happens to be one of the people who encourages that relationship then so be it,” he told The Times.\nEdi Truell, a private equity investor who has given the Conservatives hundreds of thousand of pounds, also said Mr. Farage’s links should be exploited.\n“If you have got someone who has got a relationship then for goodness sake, use it,” he said. “In business, that is exactly what we do. You could say he represents 52 per cent of the population [who voted for Brexit].”\nReacting to claims Mr. Farage could act as a Brexit ambassador for the UK in the U.S. on Friday morning, sources close to Mrs. May initially told the BBC Mr. Farage was an “irrelevance” and denied the government lacked contacts with Trump’s team.\nBrexit champion Nigel Farage spoke to Sky News earlier to discuss Trump. He talked about the insanity of No 10’s response to his warm meeting with the President-elect, and he opened up about forging a deeper Special Relationship between the UK and the US going forward. Give it a watch. Posted by Leave.EU on Sunday, 13 November 2016\nInternational Trade Secretary Liam Fox reportedly insisted he had no intention of using Mr. Farage as a go-between.\nTop Downing Street staffers have also used their Twitter accounts to denigrate Mr. Trump and promote Hillary Clinton, banning anyone “reaching out” to Mr. Trump and calling him a “chump”, as Breitbart London revealed last week. Mr. Farage has revealed that such comments are concerning to Mr. Trump.\nMr. Farage hit back over the weekend, saying it was in the “national interest” for Downing Street to consider involving him in efforts to reach out to the president-elect.\n“The problem is that No 10 keep on putting out press statements saying that I’m irrelevant,” he told the BBC. “I would have thought that in the national interest I might just be able to broker a coming together of these parties that don’t know each other at all.”","url":"https://www.breitbart.com/europe/2016/11/14/mps-call-on-theresa-may-to-make-use-of-farages-links-to-donald-trump/"}
