{"authors":["Matt Dathan","Mailonline Political Correspondent"],"date_download":"2018-10-22 23:04:55","date_modify":"2018-10-22 23:04:55","date_publish":"2016-01-28 11:43:06","description":"As Parliamentary authorities search for ways to minimise the estimated £4bn bill for taxpayers, MPs have begun lobbying to save their facilities from being turned into tourist venues.","filename":"data/vaneerConsumption/MPsfearParliamentrevampwillcostthemtheirhairsalonandcarpark.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/11/30A0D9DC00000578-0-image-a-4_1453980923086.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420644_MPs-fear-Parliament-revamp-cost-hair-salon-flower-shop-car-park_1540249495.html","title":"MPs fear Parliament revamp will cost them their hair salon and car park","title_page":"MPs fear Parliament revamp will cost them their hair salon and car park | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MPs fear they could lose their hair salon, flower shop and car park as part of the multi-billion revamp of Parliament.\nAs Parliamentary authorities search for ways to minimise the estimated £4bn bill for taxpayers, MPs have begun lobbying to save their facilities from being turned into tourist venues.\nThe cheapest and quickest option for refurbishing the Palace of Westminster would require MPs to temporarily move out of the building for up to six years.\nMPs have started to privately lobby the committee overseeing the plans to ensure that they do not lose their on-site hairdressers, flower shop and car park\nMPs will have to move out of the House of Commons chamber temporarily while the refurbishment takes place\nA specially-made chamber built in the courtyard of the Department of Health – just 100 yards down the road from the Palace of Westminster – is the preferred option among MPs.\nBut they have started to privately lobby the committee overseeing the plans to ensure that they do not lose their on-site hairdressers and flower shop while they are away, according to The Times.\nRemaining close to the Palace of Westminster would be the most convenient option for government ministers, who would continue to work in Whitehall departments and must be held accountable to Parliament.\nMPs will have to move out of the House of Commons chamber for at least six years while essential repairs take place.\nThe Palace of Westminster is riddled with asbestos, leaking ceilings, rodents and moths and was described as a 'death trap' by one close to the refurbishment plans.\nMPs could be moved from their current home, left, to a temporary chamber built in the Department of Health courtyard, right, as part of plans to refurbish the decaying Palace of Westminster\nThe proposal to move to the Department of Health is among the most popular because it is housed just 100 yards from the Commons entrance and many MPs' offices are in the adjacent building at 1 Parliament Street\nAn independent report commissioned by Parliament estimated that the revamp would cost more than £7bn and take 32 years to complete if politicians did not move out of the building temporarily.\nBut the costs could be halved to an estimated £3.5bn and take just six years if MPs and peers agree to a temporary new home.\nPlans to rehouse MPs in Whitehall was discussed by Labour's Shadow Leader of the Commons at Monday's Parliamentary Labour party meeting, according to reports in the Guardian and Huffington Post.\nMr Bryant told his colleagues that Parliament's Joint Committee on the Palace of Westminster had all but ruled out the idea of relocating MPs outside London.\nChris Grayling, the Leader of the Commons and chairs the cross-party committee overseeing the refurbishment plans, is expected to tell Tory MPs of the plans later this week.\nWhere to relocate roughly 800 peers is proving more difficult.\nChris Bryant, the Shadow Leader of the Commons, briefed Labour MPs about the plans to relocate MPs at a meeting on Monday. He told them that the idea of rehousing MPs outside London had been all but ruled out\nOne idea is to move MPs to the House of Lords, pictured above. The last time MPs debated in the upper chamber was after bombing damaged the House of Commons chamber during the Second World War\nSimilar courtyards in the Treasury or the Foreign and Commonwealth Office could be used as part of the refurbishment, which is expected to begin following the 2020 general election.\nMPs moved to the House of Commons during the Second World War after bombing damaged the chamber.\nMoving MPs to a courtyard in the Department of Health is popular with some MPs because it could easily be integrated into the current Parliamentary estate.\nIt is located next to 1 Parliament Street and Porcullis House, where many MPs' offices are housed, meaning MPs could go to vote in the temporary chamber without leaving the estate and avoiding security concerns.\nDepartment of Health staff would have to move out of the offices in Richmond House at 79 Whitehall while a temporary chamber is built.\nPrevious proposals for relocating MPs caused controversy, with a plan to house politicians in an underground car park generating outrage because it was the spot where Tory MP Airey Neave was killed by an IRA car bomb in 1979.\nA suggestion to rehouse MPs in an underground car park on the estate caused outrage because it was the spot where Tory MP Airey Neave was killed by an IRA bomb in 1979\nTory MP Stuart Andrew told the Mail on Sunday that the plan was 'bonkers'.\n'The very idea of us holding debates in an underground car park – especially that location – will be anathema to most of us,' he said.","url":"https://www.dailymail.co.uk/news/article-3420644/MPs-fear-Parliament-revamp-cost-hair-salon-flower-shop-car-park.html"}
