{"authors":[],"date_download":"2018-10-30 00:58:06","date_modify":"2018-10-30 00:58:06","date_publish":"2017-02-06 02:32:56","description":null,"filename":"data/vaneerConsumption/MrPerfectForever.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2017/02/Brady2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861086.html","title":"Mr. Perfect Forever","title_page":"Mr. Perfect ForeverThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"All week long — actually, for two weeks — I was worried about the New England Patriots’ chances against a hot and talented Atlanta team. It didn’t help that all the pre-Super Bowl coverage focused almost entirely on the Patriots and on Tom Brady and how victory would not only record setting for both but also a juicy opportunity to gain revenge over the evil NFL commissioner, Roger Goodell. Everyone seemed to want to jinx the Pats’ chances. When asked for my predictions, I was cautious, and so when the first half last night confirmed my worst fears I could only steel myself against the anti-Brady, anti-Patriots onslaught that was bound to come. My only consolation was that the one-sidedness of the game would cause many a viewer to change channels and thus be spared having to watch the ghastly Gaga halftime show.\nThe second half, when it finally came (perhaps the too long break for the halftime garbage disoriented the inexperienced Falcons), didn’t seem much better. Atlanta went ahead 28-3 midway through the third quarter and you could hear even more channel changing across the nation. But then a funny thing happened on the way to an Atlanta rout. New England steadily picked up its game — but come on, a clanked extra point after their first TD reminded once again that this didn’t seem to be the Patriots’ night. But something else was happening. The clear advantage Atlanta enjoyed in speed and strength was beginning to mean less and less as the game wore on. While the Pats were able to fall back on their superior coaching and training, which had a way of weakening Atlanta’s abilities. As the fourth quarter wore on, the only question was whether the Patriots would have enough time to score twice and convert two two-point conversions to force overtime. Which they stunningly did, with under a minute to spare.\nHad Atlanta been on its first half level, it would have used that remaining time in regulation to get into field goal range. Instead, they were shot, down for the count. I knew that if the Patriots won the overtime toss, they’d march down to score a TD to win in sudden death without the Falcons’ ever having possession in OT. Which is how it turned out. The most stunning comeback ever in Super Bowl annals.\nAs for Roger Goodell, afterward he came over to Tom Brady and offered friendly congratulations. Brady had too many other things on his mind to react, it seemed. Revenge is sweetest when the bad guy ceases to matter. What the Patriots accomplished is as impressive as anything any team has ever achieved. People were scoffing that Super Bowl LI meant nothing — who cares about a nothing number like 51? Opinions may vary, but early reactions suggest that this one outdid all the 50 that came before.\nOf course, too, there’s a good chance the Patriots will lose claim to the Super Bowl championship because of the team’s friendly ties to Donald Trump. A lot of Roger Goodells out there will demand that Deflategate have a successor.\nMore seriously, how much longer can Tom Brady keep this up? He’s the greatest ever — so what will he, at age 40, be playing for now? Could it simply be for the love of the game? Lucky him.","url":"https://spectator.org/mr-perfect-forever/"}
