{"authors":["Kelly Mclaughlin","Ashley Collman For Dailymail.Com","Associated Press"],"date_download":"2018-10-22 21:05:01","date_modify":"2018-10-22 21:05:01","date_publish":"2016-01-29 05:35:22","description":"Frank John Selas III, or Frank Szeles, as he was known in the San Diego area, was 'removed from all positions related to children' at the Church of Jesus Christ of Latter-day Saints.","filename":"data/vaneerConsumption/MrWonderFrankJohnSelasIIIbannedbyMormonchurchfromcontactwithchildren.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/05/30AFEAFF00000578-0-image-a-106_1454045690756.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422154_Pedophile-TV-host-Mr-Wonder-banned-Mormon-church-contact-children-breaching-child-protection-policies_1540242301.html","title":"Mr Wonder Frank John Selas III banned by Mormon church from contact with children","title_page":"Mr Wonder Frank John Selas III banned by Mormon church from contact with children | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man who was accused of sexually abusing children during a camping trip nearly four decades ago when he was known as television show host Mr Wonder was also banned from contact with children from the Church of Jesus Christ of Latter-day Saints.\nFrank John Selas III, or Frank Szeles as he was known in the San Diego area, was 'removed from all positions related to children' after failing to comply with the church's child protection policies, Eric Hawkins, a church spokesman, said on Thursday.\nAfter his removal, a parent expressed 'a generalized concern' about the suspect's behavior toward a child and the church urged the parent to report it to authorities, Hawkins said.\nThe church spokesman said in an email that Selas belongs to a Mormon congregation in the San Diego area.\nA man going by the name Frank Szeles (left) was arrested in San Diego this week, and authorities believe he is a former Louisiana children's television host wanted on molestation charges for more than 35 years (right). It was revealed on Thursday that he was also banned from contact with children from the Church of Jesus Christ of Latter-day Saints\nThe 76-year-old man claims he is not the wanted Frank John Selas IIII. A judge ordered all pictures of Szeles taken in court on Wednesday not to show his face until his identity is proven\nBut Hawkins didn't specify which one, indicate which positions he held or elaborate on the nature and time of the alleged incidents. He didn't immediately respond to questions seeking more detail.\nAsked to comment, the suspect's attorney, Marc Carlos, said, 'Clearly whatever these allegations were, they were not serious enough to refer to the police, which is what they should have done if they were serious'.\nAuthorities say the man arrested Monday at his Bonita home is Frank John Selas, a 76-year-old fugitive who hosted the Mr Wonder children's show on KNOE-TV in north Louisiana in the 1970s and changed his name after moving to the San Diego area.\nThe suspect challenged authorities to prove he is the fugitive. On Wednesday, a San Diego judge ordered him to be held without bail and scheduled a hearing for February 11 to establish identity.\nThe man arrested by the US Marshals Service at his home goes by Frank Szeles and advertised swim lessons and other activities for young children.\nAuthorities say the former television host changed his name.\nIn the late 1970s, Selas hosted the Mr Wonder show on KNOE-TV in north Louisiana. In 1979, the Rapides Parish Sheriff's Office fielded complaints from parents who accused Selas of abusing their children, following a Cub Scouts camping trip in the Kisatchie National Forest.\nThe Boy Scouts of America said on Wednesday that the suspect was Cubmaster of Pack 888 in Bonita, near San Diego, but he was 'removed from Scouting several years ago for non-compliance with our youth protection policies and procedures'.\nWithout elaborating, it said his removal followed a complaint from a parent who was not involved in the group and was unrelated to scouting.\nSelas, then 39, allegedly then fled the country before investigators could arrest him. His car was found abandoned in Dallas, Texas and it's believed he traveled to Rio de Janeiro Brazil.\nEventually he returned to the United States in the early 1980s, where he was allegedly joined by his wife, and they moved around the country often, living in Chicago; South Royalton, Vermont; Sheffield, Massachusetts; his hometown of Darien, Connecticut and most recently San Diego where a neighbor says he has been living since 1999.\n'He always had a lot of kids around him,' neighbor Haywood Gammon told ABC News.\nHe is charged with two counts of obscene behavior with a juvenile.\nAuthorities have not said whether Selas' wife, Maria Magdalena Aranda Selas Szeles, will face charges.\nThe family of the man arrested Monday appeared in court on Wednesday, but didn't speak with reporters. The man's attorney, Marc Carlos, read a statement from the family that pleaded for privacy.\n'Despite the allegations, for 37 years, Frank Szeles has been a husband, father and grandfather and has always provided for his family,' the family said.\nSelas hosted a children's television show in Louisiana in the 70s as 'Mr Wonder'. He was also a Cub Scout leader. He fled the country with his family in 1979 after a few Cub Scouts accused him of sexually abusing them on a camping trip\n'He is well-loved, respected and supported by his family and friends and the community here in San Diego.'\nCarlos said the developments were 'a shock to everyone'.\nSzeles Enterprises advertised swim lessons, Cub Scouts and Saturday field trips for boys 5 to 11 years old in the San Diego area.\nNeighbors said on Wednesday that parents often took their children to play in his backyard pool.\n'He always had a lot of kids around him,' said Haywood Gammon, who lives next door and said the man had been living there with his wife at least since he arrived in 1999.\nThe Boy Scouts of America said Frank Szeles was Cubmaster of Pack 888 in Bonita but was 'removed from Scouting several years ago for non-compliance with our youth protection policies and procedures'.\nWithout elaborating, it said his removal followed a complaint from a parent who was not involved in the group and was unrelated to scouting.\nLt Tommy Carnline, a spokesman for the Rapides Parish sheriff's office, said investigators identified seven alleged victims.\nSteve Jurman, supervisory deputy US marshal in San Diego, said there have been no reports of victims in the San Diego area, where authorities believe he has lived since the 1980s.","url":"https://www.dailymail.co.uk/news/article-3422154/Pedophile-TV-host-Mr-Wonder-banned-Mormon-church-contact-children-breaching-child-protection-policies.html"}
