{"authors":["Sarah Rumpf"],"date_download":"2018-10-30 19:11:58","date_modify":"2018-10-30 19:11:58","date_publish":"2015-07-08 20:39:17","description":"A federal grand jury indicted Aldair Garcia-Miranda, 21, Selvin Raymundo Salazar, 23, and Raul Ernesto Landaverde-Giron, 25, accusing them of being members of the La Mara Salvatrucha gang, also known as MS-13, and for allegedly taking part in several murders, attempted murders, and other extortion and racketeering activities. Two are not U.S. citizens or have any other legal resident status or work permits. |","filename":"data/vaneerConsumption/MS13GangMembersIndictedinMarylandMurderPlotsWereInUSIllegally.json","image_url":"https://media.breitbart.com/media/2014/12/ms-13-arms-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_08__1540926718.html","title":"MS-13 Gang Members Indicted in Maryland Murder Plots Were In US Illegally","title_page":"MS-13 Gang Members Indicted in Maryland Murder Plots Were In US Illegally | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"At least two of the three alleged members of the MS-13 gang who were indicted this week in Maryland were in the country illegally and had been previously deported, Breitbart News has learned.\nAs reported earlier, a federal grand jury indicted Aldair Garcia-Miranda, 21, Selvin Raymundo Salazar, 23, and Raul Ernesto Landaverde-Giron, 25, accusing them of being members of the La Mara Salvatrucha gang, also known as MS-13, and for allegedly taking part in several murders, attempted murders, and other extortion and racketeering activities.\nMS-13 is comprised primarily of immigrants or descendants from El Salvador, and is active in multiple areas throughout the U.S., including several Maryland counties in the greater Washington, D.C. metro area.\nThe gang has a reputation for extreme violence, and brutal retribution against rivals. One of the murders that was part of Monday’s indictments involved a man named Merlin Edjardo Garcia, 23, who was the target of a kill order by MS-13 in El Salvador. Garcia fled to Frederick, Maryland, where the defendants allegedly tracked him down, lured him to a wooded area, and shot and stabbed him until he was dead.\nOn Wednesday, Breitbart News spoke to Marcia Murphy, the public affairs officer for the U.S. Attorney’s Office in Maryland. Murphy confirmed that at least two of the three defendants were in the country illegally.\nAccording to Murphy, Salazar was recently convicted for illegal reentry; the conviction was probably in 2014 but she was not certain of the precise date. Landaverde-Giron also had an indictment for illegal reentry on his record.\nThis means that Salazar and Landaverde-Giron are not U.S. citizens or have any other legal resident status or work permits. Furthermore, “illegal reentry” is a charge that is only brought against illegal immigrants who were previously deported and reentered the U.S. illegally.\nMurphy told Breitbart News that, at this time, there was not any public information proving that the third defendant, Garcia-Miranda, was also an illegal immigrant, but she also did not have any information that would confirm him as a citizen or legal resident.\nRead Breitbart News’ earlier report on the indictment of the three alleged MS-13 gang members here.\nFollow Sarah Rumpf on Twitter @rumpfshaker.","url":"https://www.breitbart.com/politics/2015/07/08/ms-13-gang-members-indicted-in-maryland-murder-plots-were-in-us-illegally/"}
