{"authors":["Ian Hanchett"],"date_download":"2018-10-30 20:21:55","date_modify":"2018-10-30 20:21:55","date_publish":"2015-10-20 19:16:15","description":"MSNBC's Seitz-Wald: Webb Dropping Out Admission That 'Traditional Democratic Party Has Come And Gone'","filename":"data/vaneerConsumption/MSNBCsSeitzWaldWebbDroppingOutAdmissionThatTraditionalDemocraticPartyHasComeAndGone.json","image_url":"https://media.breitbart.com/media/2015/10/Seitz-Wald-1020-Thumbnail.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_20__1540930915.html","title":"MSNBC's Seitz-Wald: Webb Dropping Out Admission That 'Traditional Democratic Party Has Come And Gone'","title_page":"MSNBC's Seitz-Wald: Webb Dropping Out Admission That 'Traditional Democratic Party Has Come And Gone' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"MSNBC Political Reporter Alex Seitz-Wald said that former Democratic Virginia Senator Jim Webb dropping out of the Democratic primary is an admission that “the traditional Democratic Party has come and gone” on Tuesday’s “MSNBC Live.”\nSeitz-Wald said, “really, Jim Webb has never been a particularly good fit for the Democratic Party. This is a former Ronald Reagan administration appointee. He’s a former Marine. He was drafted sort of into the Democratic Party to run for the Senate from Virginia in 2006, because he could speak authoritatively against the Iraq War. But on a whole host of other issues, from race, to climate change, to LGBT rights, he hasn’t really been in lockstep with the Democratic Party, and especially not the post-Obama Democratic Party. This presidential campaign for Jim Webb has been all about trying to restore what he views as the traditional Democratic Party, so that’s rural voters in the South, in Appalachia, especially white voters, who have really abandoned the Democratic Party in recent years. But, if he announces today he’s running for an independent, as my sources say he will, that’s sort of a declaration of failure almost in that attempt. He’s admitting that Democratic Party, that he wants to see, the traditional Democratic Party has come and gone, and that there’s no longer room for him there.”\n(h/t Real Clear Politics)\nFollow Ian Hanchett on Twitter @IanHanchett","url":"https://www.breitbart.com/politics/2015/10/20/msnbcs-seitz-wald-webb-dropping-out-admission-that-traditional-democratic-party-has-come-and-gone/"}
