{"authors":["Isolde Walters For The Daily Mail"],"date_download":"2018-10-22 21:35:47","date_modify":"2018-10-22 21:35:47","date_publish":"2016-01-11 01:14:32","description":"In future, the company says all of its bread and rolls, including standard white loaves, will be baked with extra fibre. It comes after they already started adding extra vitamin D to its baked goods.","filename":"data/vaneerConsumption/MSscrapsbasicbreadforfibrefilledalternativesafterfallinsales.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/02/30017A3E00000578-0-image-a-54_1452477669672.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393142_Is-toast-simple-white-loaf-M-S-scraps-basic-bread-fibre-filled-alternatives-fall-sales_1540244147.html","title":"M&S scraps basic bread for fibre-filled alternatives after fall in sales","title_page":"M&S scraps basic bread for fibre-filled alternatives after fall in sales | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Basic white bread, a staple of the British diet since the industrial revolution, appears to be on its way out, replaced by specialty loaves and alternatives baked with extra fibre and vitamins.\nAmid falling sales of the traditional white loaf, Marks & Spencer is claiming to be the first major grocery retailer to banish basic bread from its shelves.\nIn future, it says, all of its bread and rolls, including standard white loaves, will be baked with extra fibre.\nBasic white bread is on its way out and will soon be replaced by specialty white loaves and alternatives baked with extra fibre and vitamins at Marks &Spencer\nThe company has already started adding extra vitamin D to its baked goods after research revealed that half of Britain’s adult population are deficient. Normally produced by exposure to sunlight, vitamin D is vital for healthy bones in children and adults.\nNow M&S, which sells nearly a quarter of Britain’s ready meals, is announcing that all of its bread, including its cheapest white loaves and rolls will contain extra fibre.\n‘The days of the simple white loaf are numbered,’ it says. ‘We’re now adding fibre to all our bread – including white, to make a healthier bread for all the family.’\nJenny Galletly, product developer for the retailer, said the change is in response to growing customer demand for what she calls ‘breads with benefits’. She added: ‘By using a vitamin D yeast and adding fibre to our breads and bread rolls we’re helping our customers boost their intake without having to make big changes to their diet.’\nM&S claims to be the first major grocery retailer to stop selling white bread and switch to healthier alternatives\nNutritionists welcomed the move as part of a nationwide trend away from basic ‘fluffy white bread’ to healthier alternatives amid concern that many people lack fibre in their diets.\nIncreasingly, the traditional white loaf has been falling out of favour with consumers. More than £40million was wiped off sales of traditional white bread last year, triggering a retail price war which saw an average of 15p off a large loaf normally costing around £1.14.\nReasons for the decline in sales include the growth of in-store bakeries; a 14 per cent decline in children taking sandwiches to school and, most importantly, the growing popularity of speciality breads with higher fibre content.\nFibre helps to reduce cholesterol levels, aids the digestive system and is linked to improved heart health and reduced risk of type 2 diabetes.\nCharlotte Stirling-Reed, a diet and nutrition consultant, said the latest move by M&S was welcome: ‘Fibre doesn’t get enough publicity. We hear a lot about salt and sugar but one of the things we should be hearing more about is fibre. Most of us are not eating enough of it.’\nWhite bread was originally reserved for the wealthy, consumed by the ancient Romans while the poor ate rough, brown bread.","url":"https://www.dailymail.co.uk/news/article-3393142/Is-toast-simple-white-loaf-M-S-scraps-basic-bread-fibre-filled-alternatives-fall-sales.html"}
