{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:59:47","date_modify":"2018-10-30 19:59:47","date_publish":"2015-03-24 01:29:11","description":"Northwestern Engery is lobbying against a bill that makes it legal to sue cities and municipalities that infringe on 2nd Amendment rights.","filename":"data/vaneerConsumption/MTUtilityCompanyLobbyingAgainstProtectionof2ndAmendmentRights.json","image_url":"https://media.breitbart.com/media/2014/12/2nd-Amendment-Rally-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_23__1540929587.html","title":"MT Utility Company Lobbying Against Protection of 2nd Amendment Rights","title_page":"MT Utility Company Lobbying Against Protection of 2nd Amendment Rights | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"NorthWestern Energy, Montana’s largest gas and electric company, is lobbying against a Republican bill that protects 2nd Amendment rights by making it legal for residents to sue cities and municipalities that infringe on those rights.\nThe 2nd Amendment protections are contained in legislation put forth by state representative Matthew Monforton (R-69th Dist.), who is worried that Michael Bloomberg and other gun control advocates could work successfully in some municipalities to limit the exercise of 2nd Amendment rights unless further precautions are taken.\nAccording to Fox News, Northwestern Energy opposes the legislation because it fears that it could face lawsuits for barring its employees from being armed.\nYet representative Monforton made sure the language only applies to “government entities.”\nMontana Shooting Sports Association’s Gary Marbut thinks Northwestern Energy’s lobbying efforts against the bill run “contrary to the interests of its 542,000 gas and electric customers in Montana, most of whom are avid gun owners and hunters.” Moreover, Marbut said the fact that they are a “large corporation and have been given a monopoly by the Public Service Commission” should be enough to prevent them from lobbying against the interest of pro-gun Montanans.\nBecause Michael Bloomberg also opposes the measure, Northwestern Energy has been forced to state whether the former mayor is, in fact, paying for their lobbying efforts against 2nd Amendment protections. The utility company responded to these inquiries by explaining that their “lobbying expenses are borne by shareholders” and that “Michael Bloomberg does not have a financial interest in the company.”\nFollow AWR Hawkins on Twitter @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/03/23/mt-utility-company-lobbying-against-protection-of-2nd-amendment-rights/"}
