{"authors":["Christine Distasio"],"date_download":"2018-10-30 23:47:27","date_modify":"2018-10-30 23:47:27","date_publish":"2014-08-13 05:26:53","description":"So this guy orchestrated all of this to sell books. Right? I'm sorry, that was wildly misleading, but David does seem like the world's worst father. MTV's new summer drama is packing on the mystery — though not in the department of the theory that…","filename":"data/vaneerConsumption/MTVsFindingCarterTheoryThatDavidIsInvolvedInCartersKidnappingGetsFurtherProof.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/5dd05831-071e-459d-89db-aade2390948b.JPG?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35552-mtvs-finding-carter-theory-that-david-is-involved-in-carters-kidnapping-gets-further-proof_1540943247.html","title":"MTV's 'Finding Carter' Theory That David Is Involved In Carter's Kidnapping Gets Further Proof","title_page":"MTV's 'Finding Carter' Theory That David Is Involved In Carter's Kidnapping Gets Further Proof","title_rss":"NULL","source_domain":"bustle.com","text":"So this guy orchestrated all of this to sell books. Right? I'm sorry, that was wildly misleading, but David does seem like the world's worst father. MTV's new summer drama is packing on the mystery — though not in the department of the theory that Carter and Taylor aren't twins. (They most definitely are, people. Sorry.) Tuesday night's new episode of Finding Carter offered further proof that David is involved with Carter's kidnapping. Because having your child abducted isn't screwed up enough without you having a hand in it.\nBustle writer Kaitlin came up with an excellent, but also really traumatizing, theory about David's involvement in Carter's abduction — which, unsurprisingly, would have helped him sell books. A broke, struggling writer looking to make some quick cash to not feel inferior to his bread-winning, already-wealthy wife plans to have his child abducted for ransom that he'll later split with her kidnapper. Totally screwed up, right? Totally not something that you want to believe would ever happen or be orchestrated by a father, right? Well, Tuesday night's new episode of Finding Carter made good on Alexis Denisof's, who plays David, promise that fans will learn \"interesting and surprising things\" about his character in upcoming episodes.\nApparently, one of those interesting things is that he's got a prior relationship with Lori, at least, that's what it seemed like on Tuesday night. After Carter confessed to planning to run away with Lori to David and revealed that she'd chosen to be a part of their family instead, David actually did a really strange thing. He went to Elizabeth and told her, which was fine, but then he insisted that they call Lori and let her know that Carter never wanted to see or speak to her again. Why would he want to contact and provoke his daughter's kidnapper? If that's sounds strange and irresponsible, it only gets stranger from there.\nWhile Elizabeth couldn't go through with speaking to the woman that made her live in a nightmare for years, David seemed to have a rapport with Lori and a history. During the phone call, Lori referenced \"the last time\" that David underestimated her and that he should know better than do it again with this phone call. And David, in turn, made a comment about Lori's identity, saying \"Lori or Janet or whatever you're calling yourself these days.\"\nThis could all just be a reference to the fact that Lori went by the name Janet when she first met Carter's parents and claimed to be a home care nurse, at which point David and Elizabeth underestimated her skill of kidnapping. But I'm not buying it. There's something fishy about David and his desire to make that call and it's only a matter of time before we all find out what it is.\nImage: MTV","url":"https://www.bustle.com/articles/35552-mtvs-finding-carter-theory-that-david-is-involved-in-carters-kidnapping-gets-further-proof"}
