{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 22:49:20","date_modify":"2018-10-30 22:49:20","date_publish":"2014-08-14 18:30:20","description":"Even though The Interview has been pushed back to December, we're still going to get to see James Franco's inept journalist character, Dave Skylark, in action. In fact, James Franco — er, Dave Skylark — stars in this MTV VMAs promo, since he'll be…","filename":"data/vaneerConsumption/MTVVMAPromowithJamesFrancoPokesFunatNickiMinajMoreVIDEO.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/27c66efc-c10e-4b57-9b4c-cfab6da7bb89.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35802-mtv-vma-promo-with-james-franco-pokes-fun-at-nicki-minaj-more-video_1540939760.html","title":"MTV VMA Promo with James Franco Pokes Fun at Nicki Minaj & More - VIDEO","title_page":"MTV VMA Promo with James Franco Pokes Fun at Nicki Minaj & More — VIDEO","title_rss":"NULL","source_domain":"bustle.com","text":"Even though The Interview has been pushed back to December, we're still going to get to see James Franco's inept journalist character, Dave Skylark, in action. In fact, James Franco — er, Dave Skylark — stars in this MTV VMAs promo, since he'll be taking to MTV to host the pre-show segments. As always, Franco is committed to character (and here's a big high five to the totally game celebrities who play along with him as he asks them inane questions).\nIn the promo below, you'll see Dave Skylark ask Nicki Minaj about her song \"Superb Ass\" — which you probably know as \"Super Bass,\" but when you're in the hands of Skylark, everything changes. He gets Australia and Austria mixed up. You know, the usual antics of a subpar interviewer. But he believes he's a hard-hitting journalist, asking the tricky questions, so it's all the more entertaining.\nSince it looks like these celebs are in on the joke, hopefully naysayers who are anti The Interview will see that the movie is all in good fun, and that in no way do Franco and Seth Rogen's characters or their real-life alter egos have violent agendas. They're just inept, unqualified, silly dudes who think they're asking the big question, and are obviously not.\nYou can check it out below.","url":"https://www.bustle.com/articles/35802-mtv-vma-promo-with-james-franco-pokes-fun-at-nicki-minaj-more-video"}
