{"authors":[],"date_download":"2018-10-30 01:14:10","date_modify":"2018-10-30 01:14:10","date_publish":"2018-06-23 00:05:16","description":null,"filename":"data/vaneerConsumption/MuellersConcordMismanagementIsConvulsing.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2018/06/Indonesian_pit_bull_terrier.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540862050.html","title":"Mueller’s Concord Mismanagement Is Convulsing","title_page":"Mueller’s Concord Mismanagement Is ConvulsingThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"On February 16, 2018, Special Counsel Robert Mueller obtained a federal indictment of 13 Russian nationals and 3 Russian companies for conspiring to wage “information warfare” by “impairing, obstructing, and defeating the lawful functions of the United States by dishonest means in order to enable Defendants to interfere with U.S. political processes, including the 2016 presidential election.”\nThe media heralded the indictment as a major achievement by Team Mueller. But a few observers questioned whether Mueller truly expected any of the defendants to appear in a U.S. court to answer the charges. Others asked if the indictment was merely an empty public relations gesture by the special counsel’s office attempting to show that its investigation was producing solid results.\nAgainst all expectations, in April 2018, lawyers for one of the Russian corporate defendants, Concord Management and Consulting, LLC (“Concord”), entered their appearances in the U.S. District Court for the District of Columbia. They then served extensive discovery requests on Team Mueller seeking full disclosure of the government’s case and investigation including sensitive national security and intelligence information.\nThis type of discovery is called “graymail,” in which the government must disclose closely guarded state secrets in order to proceed with the prosecution. The alternative is to drop the charges.\nSo, should Team Mueller bother to litigate the discovery requests? The maximum penalty against Concord is a $500,000 fine or compensation to anyone damaged by the alleged conspiracy. But these may be mere theoretical penalties since there appears to be no way for the government to levy Concord’s assets in Russia. In short, even if the prosecution wins at trial, no one will go to prison and the fines may be uncollectible. So what’s the point of the exercise?\nIf the Muellerites lose the discovery litigation and are faced with having to disclose sensitive intelligence about the case and their investigation, should they withdraw the indictment against Concord? And, if they drop the charges, are they prepared for the resulting public relations disaster?\nBottom line: how did such a purportedly smart bunch of lawyers get themselves into this fix?\nOn Friday May 5, 2018, Team Mueller tried to buy some maneuvering time by filing a motion asking U.S. District Judge Dabney Friedrich to postpone Concord’s arraignment set for May 9, 2018. They claimed that it was unclear whether Concord had formally accepted the court summons related to the case. In their motion, they included Concord’s discovery requests.\n“Until the Court has an opportunity to determine if Concord was properly served, it would be inadvisable to conduct an initial appearance and arraignment at which important rights will be communicated and a plea entertained,” wrote the prosecutors. “That is especially true in the context of this case, which involves a foreign corporate defendant, controlled by another, individual foreign defendant, that has already demanded production of sensitive intelligence gathering, national security, and foreign affairs information.”\nThe prosecutors proposed that the arraignment be postponed while the parties briefed the issue of whether the court summons has been properly served on Concord.\nThe next morning, without breaking a sweat, Concord’s lawyers breezily replied, “Defendant voluntarily appeared through counsel as provided for in [the federal rules], and further intends to enter a plea of not guilty. Defendant has not sought a limited appearance nor has it moved to quash the summons. As such, the briefing sought by the Special Counsel’s motion is pettifoggery.”\nThe defense lawyers argued that the special counsel was trying “to usurp the scheduling authority of the Court” by waiting until Friday afternoon to try to delay a proceeding scheduled for the following Wednesday. They also stated that the special counsel’s office has not replied to Concord’s discovery requests and, ratcheting up the pressure, stated that their client intends to assert its speedy trial rights.\nJudge Friedrich, a Trump appointee, denied the special counsel’s request and ruled that the arraignment would proceed as scheduled.\nAt the May 9, 2018 arraignment, Concord’s lead counsel was asked whether he represents Concord Catering, another one of the charged Russian companies. He replied that he did not and added, “I think we’re dealing with the government having indicted the proverbial ham sandwich. That company didn’t exist as a legal entity during the time period alleged by the government.”\nAs Homer Simpson would say, “Doh!!”\nThen, hinting at more graymail to come, he remarked that, “We now know that the special counsel apparently has access to [Concord’s] confidential filings at the Office of Foreign Assets Control, which in and of itself is a disturbing fact.”\nThe defense lawyer then turned the heat up to eleven by stating, “Your Honor, we waive formal reading of the indictment. We enter a plea of not guilty. We exercise our right to a speedy trial.”\nOn June 12, 2018, Team Mueller responded to the defense discovery requests by warning the court that Russian intelligence services still have active “interference operations” into U.S. elections and that handing over certain evidence in the criminal case could imperil ongoing investigations. They asked Judge Friedrich for an order to protect voluminous evidence sought by Concord. According to the prosecution, the evidence includes between 1.5 and 2 terabytes of data and involves U.S. residents not charged with crimes who Team Mueller says were unwittingly recruited by Russians to engage in political activity.\nIn requesting a protective order, the Muellerites argued that disclosure of such evidence would help foreign intelligence services in Russia and elsewhere while undermining U.S. law enforcement and national security investigations. U.S. documents identify “sources, methods and techniques used to identify the foreign actors behind these interference operations.” Improper disclosure of that information would tip foreign intelligence services about how the U.S. operates and let them “adjust their conduct, thus undermining ongoing and future national security operations.”\nThe prosecutors claimed that they have gathered “unclassified but sensitive information that remains relevant to ongoing national security investigations and efforts to protect the integrity of future U.S. elections.” It includes the identities of cooperating individuals and companies, as well as links between the defendants, uncharged parties and foreign governments, that goes well beyond what the prosecution intends to disclose at trial. They gave additional details to Judge Friedrich under court seal.\nThe special counsel asked the judge to preclude any of Concord’s co-defendants from reviewing evidence until they appear in her courtroom to respond to the charges. One of those co-defendants is Yevgeny Prigozhin, a Russian national who has ties to Russian President Vladimir Putin. He is also a principal officer and stake holder in Concord.\nIn a move calculated to render the Muellerites even more crazed than they already are, Concord’s lawyers insisted that their client should be able to share the evidence produced in discovery with Prigozhin in order to prepare a defense to the charges. To anyone with an IQ above that of a celery stalk, such a fundamental and entirely proper move should have been anticipated. Nevertheless, this seems to have caught Team Mueller completely by surprise.\nThe prosecutors desperately and fatuously countered that “As long as Prigozhin chooses not to appear personally in front of this court, he is not entitled to review any discovery in this case.” Then, moving beyond desperation into the realm of rank insanity, Team Mueller proposed that, any foreign national (i.e., Concord) who wants to disclose sensitive discovery materials to others would have to go through a government “firewall counsel” which would supposedly be “separate” from the prosecution team. In other words, in order to prepare for trial, defense counsel would have to obtain the government’s permission before it used evidence produced in discovery to interview witnesses or investigate the basis of the criminal charges. This is, to put it mildly, a form of discovery that only mad dog prosecutors would deem legal or appropriate.\nThe court has yet to rule on the prosecution’s Soviet-style request. Meanwhile, it is fair to ask why Mueller and his band of legal geniuses didn’t anticipate getting themselves into this jam before they brought this indictment. Did it never occur to them that one or more of the defendants would actually appear in court to fight the charges? Generally speaking, when you file criminal charges, there is always the risk that pesky defendants will show up to defend themselves. That’s just one of a thousand reasons why it’s a truly boneheaded idea to use a criminal indictment as a public relations tool to create the appearance that your $20,000,000 counterintelligence operation is getting results.\nSo the Mueller pit bulls are running around with their fur on fire. Even if they win the discovery battle and the case at trial, what’s the prize? A $500,000 fine or compensation to victims? How will they collect?\nOn the other hand, if they lose the discovery battle, they will be faced with a bitter choice. Either disclose the purported classified secrets and go to trial or protect the secrets by dropping the charges against Concord. Option A would result in a meaningless “victory.” Option B would be a major embarrassment and further proof that they are wasting their time and millions of our tax dollars trying to undo the outcome of the 2016 presidential election.\nEither way, it couldn’t happen to a nicer bunch of thugs.\nGeorge Parry is a former federal and state prosecutor who practices law in Philadelphia. He blogs at knowledgeisgood.net and can be reached by email at kignet1@gmail.com.","url":"https://spectator.org/muellers-concord-mismanagement-and-convulsing/"}
