{"authors":["Liam Quinn For Daily Mail Australia"],"date_download":"2018-10-23 02:31:15","date_modify":"2018-10-23 02:31:15","date_publish":"2016-01-11 14:54:20","description":"Muhammad Daniel, a New Zealand man who joined Islamic State in Syria, has created a bizarre social media page where he refers to himself as a 'teacher' for the barbaric group.","filename":"data/vaneerConsumption/MuhammadDanielwhofledtoSyriasetsupaLinkedInpageasISISschoolteacher.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300AE07A00000578-0-image-a-52_1452521678906.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394019_Extremist-Muhammad-Daniel-fled-Syria-teach-children-ISIS-sets-LinkedIn-profile_1540261875.html","title":"Muhammad Daniel who fled to Syria sets up a LinkedIn page as 'ISIS school teacher'","title_page":"Muhammad Daniel who fled to Syria sets up a LinkedIn page as 'ISIS school teacher' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A New Zealand man who joined Islamic State in Syria has created a bizarre social media page where he refers to himself as a 'teacher' for the barbaric group.\nMuhammad Daniel, 43, who joined ISIS after previously claiming he wanted to escape the group, refers to himself as an 'education management professional' in a perplexing LinkedIn profile believed to belong to him.\nDaniel - known as Mark John Taylor prior to a name change in 2009 after being kicked out of Pakistan - lists, 'school teacher' for 'the Islamic State' as his current occupation and claims to have started the role in October 2014.\nScroll down for video\nMuhammad Daniel, a New Zealand man who joined Islamic State in Syria, has created a bizarre social media page where he refers to himself as a 'teacher' for the barbaric group\n'Teaching children from Ages 5-12 or Grades 1-8,' the profile it is believed belongs to Daniel reads.\n'Basic English Conversation language. Teaching Grammar, past and present tenses. Teaching with a puppet and enjoyed having fun with the students.\n'Living in the heart of the Islamic State is a good experience and I encourage others to come and see for themselves.\n'There's no danger here and a great place to bring up the family. Except Western Jet fighters that always drop bombs on Civilians!'\nIn 2011, Daniel - who had already been deported from Pakistan by this stage - told 60 Minutes New Zealand he travelled to the country in 2009 to 'find a wife'\nMuhammad Daniel, 43, refers to himself as an 'education management professional' in the perplexing LinkedIn profile it is believed belongs to him\nDaniel lists his current employer as 'The Islamic State' and says he has been with the group since October 2014\nHe also described himself by saying: 'I take proud (sic) in been (sic) a professional in doing my best in the education industry. I always strive to improve and offer my best advice to those who need it.'\nThe strange social media appearance comes after the 43-year-old launched an appeal to be granted a new passport, which he needed because he destroyed his original copy, in 2014.\nIn an interview with Aotearoa Independent Media Centre, the bearded Kiwi claimed he planned to leave Syria in October of that year.\nDaniel also refers to his time in the New Zealand Army - previously he said the reason he travelled to Syria was he was rejected from re-enlisting with the military\n'I only went there for adventure Jihad, but along the way I realised Syria is in a very dire need of humanity aid and support,' he said, refuting his alleged terrorist activities.\nHowever in July of the same year, Daniel told the NZ Herald he planned to remain in Syria until he had achieved 'martyrdom' - and that his defection to the terrorist group was the result of 'refused by the NZ Army for re-enlistment'.\nIn 2011, Daniel - who had already been deported from Pakistan by this stage - told 60 Minutes New Zealand he travelled to the country in 2009 to 'find a wife'.\n'I didn't have a death wish I was just looking for a lady for marriage. It was my mistake. People might call me stupid and dumb for making that mistake but that's my problem,' he told 60 Minutes.\nAt the time, New Zealand Prime Minister John Key said in 2011 that Taylor was 'someone that has quite a number of restrictions on him for very good reasons'.\n'There's no danger here and a great place to bring up the family. Except Western Jet fighters that always drop bombs on Civilians!' Muhammad Daniel said on a LinkedIn page it is believed he operates\n'Living in the heart of the Islamic State is a good experience and I encourage others to come and see for themselves,' it is believed the Kiwi jihadi wrote on social media","url":"https://www.dailymail.co.uk/news/article-3394019/Extremist-Muhammad-Daniel-fled-Syria-teach-children-ISIS-sets-LinkedIn-profile.html"}
