{"authors":["Mary Chastain"],"date_download":"2018-10-30 20:56:10","date_modify":"2018-10-30 20:56:10","date_publish":"2015-12-22 04:48:49","description":"Mehmet Görmez stated that the damage caused by the Islamic State (ISIS/ISIL) is on par with the damage caused by those who draw Muhammad.","filename":"data/vaneerConsumption/MuhammadCartoonCauseSameDamageasIslamicState.json","image_url":"https://media.breitbart.com/media/2015/02/0012211554.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_12_21__1540932970.html","title":"Muhammad Cartoon Cause Same Damage as Islamic State","title_page":"Turkish Official: Muhammad Cartoon Cause Same Damage as Islamic State","title_rss":"NULL","source_domain":"breitbart.com","text":"Mehmet Görmez, the head of Turkish Religious Affairs (Diyanet), stated that the damage caused by the Islamic State (ISIS/ISIL) is on par with the damage caused by those who draw Muhammad.\n“Today, the damage caused the networks, distant from any belief, reason and wisdom, who engrave the name [of God] on their so-called flags is no less than the [damage caused by] cartoons –intolerable by any means– by the pioneers of Islamophobia,” he declared.\nHe added: “However, I regret to say that the biggest problem of Muslims today is that they have lost the status of being an example and cannot deservedly represent of our prophet’s message of grace and mercy.”\nAs Hürriyet Daily News points out, the Islamic State use the word “God” on their flag.\nFrom The Independent:\nThe white banner at the top of the flag reads: “There is no god but Allah [God]. Mohammad is the messenger of Allah.” This phrase is a declaration of faith used across Islam, and is known as the shahada. Underneath is a white circle emblazoned with black writing reading “Mohammed is the messenger of God”, which is meant to resemble the Prophet’s seal, similar to that used to close an envelope.\nGörmez issued the statement “in his message on Mawlid an-Nabi, the Islamic anniversary of the birthday of Prophet Muhammad, which is on the night of Dec. 22 this year.”\nThe Islamic State has murdered over 10,000 people since their extensive push in Syria and Iraq in June 2014.\n“The Syrian Observatory for Human Rights (SOHR), which has secret sources inside ISIS territory, said 3,207 have been killed in that war-torn country,” wrote The Daily Mail. “Another 7,700 were executed in Iraq, according to the Iraqi Observatory for Human Rights [IOHR], which tracks ISIS violations.”\n“The soldiers and civilians who have been beheaded, shot dead, drowned, blown up, stoned to death and thrown off buildings for violating ISIS’s twisted laws all contributed to this mammoth death toll,” it adds. “The figure does not include the thousands more who have been killed in battle and suicide bombings – or the innocent people mown down by ISIS extremists as they tried to flee.”\nThe Islamic State also executed 1,858 in Syria, including 98 women and 76 children under 18-years-old. SOHR noted that they did not include the young boys ISIS “forced to carry out suicide bombing missions.”\nIraq Body Count reported 17,049 civilian deaths in 2014. June held the highest total:\nThat June peak of 2,534 was the month that marked the beginning of the ISIS offensive. Actions by, and by others in reaction to, ISIS appear only to have worsened an existing trend in rising civilian casualties… Among the 17,049 civilians recorded killed, many deaths were attributable to the actions of specific armed groups while the perpetrators of many killings remain unknown. 1,748 civilians were reported killed by Iraqi military air strikes, while 4,325 were killed by ISIS.\nThese numbers do not include the 130 who perished in Paris in November when Islamic State operatives conducted attacks at six locations. Terrorists slaughtered 89 people alone at the Bataclan concert hall.\nIn January, two people devoted to the Islamic State killed ten journalists and two police officers in Paris. The attackers stormed the Charlie Hebdo headquarters because the magazine published cartoons of Muhammad.","url":"https://www.breitbart.com/national-security/2015/12/21/turkish-official-muhammad-cartoons-cause-damage-islamic-state/"}
