{"authors":[],"date_download":"2018-10-30 01:13:26","date_modify":"2018-10-30 01:13:26","date_publish":"2015-05-20 00:00:00","description":null,"filename":"data/vaneerConsumption/MultiskilledSarahcansavetheUSA.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_05_multi_skilled_sarah_can_save_the_usa_1540862006.html","title":"Multi-skilled Sarah can save the USA","title_page":"Multi-skilled Sarah can save the USA","title_rss":"NULL","source_domain":"americanthinker.com","text":"Multi-skilled Sarah can save the USA\nSarah Palin was elected mayor and Alaska governor and then was nominated and ran for vice president because of her own hard work, talents, and skills, not because her husband had power or wealth. With her husband, Palin raised/is raising five children, including one who is, in politically correct parlance, mentally challenged. No village for her. A modern woman, she multi-tasks, quickly and ably learning new technology.\nAnd now, we're reminded of another of her skills. \"White bikers, black thugs: Why Texas looked to relax gun laws after biker shootout.\" The editors chose this photo, which had nothing to do with the story. Or does it? Were they subtly sending a message of a strong woman able to deal with multi cultural people effectively? Now, who would be more effective as president of the USA during these uneasy times? Who would be more effective standing up to Putin, ISIS, Iran, oil-rich Saudi Arabia? Sarah Palin, who as Tina Fey of SNL accidentally but accurately noted, could see Russia from her house? Sarah Palin, who drilled, drilled, drilled for oil in Alaska, thus paving the way for our economic independence from the murderous, thieving oil cartel? Or Hillary Rodham Clinton, who became a wealthy cattle futures trader, senator from New York, secretary of state, and highly paid, in demand speaker all on the coattails – and other assets – of her husband? And other men. Could she deal with the strongmen of Russia, the Muslim nations, and other nations on her own? Choose the right people to do so when she can't even use one modern device safely? Thanks, Washington Post, for reminding us of whom we need in these troubled times. Even if this isn't what you really meant.","url":"https://www.americanthinker.com/blog/2015/05/multi_skilled_sarah_can_save_the_usa.html"}
