{"authors":["Alison Smith-Squire For Mailonline"],"date_download":"2018-10-23 01:44:59","date_modify":"2018-10-23 01:44:59","date_publish":"2017-03-10 10:17:29","description":"Doctors told Louise Adams, from Stoke-on-Trent, there was a 95 per cent her baby would not survive after her waters broke at just 22 weeks but she kept him alive by drinking water.","filename":"data/vaneerConsumption/Mumkepthersonaliveafterherwatersbrokeat22weeks.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/10/3E21AB7E00000578-0-image-a-3_1489140932098.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4300276_Mum-kept-son-alive-waters-broke-22-weeks_1540259099.html","title":"Mum kept her son alive after her waters broke at 22 weeks","title_page":"Mum kept her son alive after her waters broke at 22 weeks | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A mother has revealed how she kept her son alive in the womb by drinking seven pints of water a day.\nDoctors told Louise Adams, 28, from Stoke-on-Trent, Staffordshire, her baby had only a 5 per cent chance of surviving after her waters broke at just 22 weeks.\nBut Mrs Adams and her husband Jakk, 32, were determined to keep their son alive and began researching other options. They discovered that in other countries women whose water breaks early are advised to drink seven pints of water a day to replenish the liquid lost and help keep the baby healthy in the womb.\nThree months later, the couple welcomed son Joseph - a 'real-life water baby'.\nFamily: Parents Louise and Jakk Adams with their six-month-old son, Joseph, in January\nMiracle baby: Tiny Joseph, pictured left and right in hospital, defied the doctors' odds\nDevastated: Louise's waters broke at just 22 weeks. Pictured, her 22-week pregnancy scan\nMrs Adams said: 'Although UK doctors were sceptical, I discovered in other countries around the world mothers whose waters break early are put on a drip.\n'I'm convinced he survived such low odds because when my waters broke, I replaced them by ensuring I was well hydrated.'\nThe couple, who are both teachers, were in 'complete shock' when doctors said there was nothing that could be done to save their child because he had not yet reached 24 weeks.\nMrs Adams said: 'All they could do is monitor me in hospital waiting for the inevitable miscarriage, which they said would happen in days.\n'But I could feel Joseph kicking. I couldn't just sit around doing nothing to save him.'\nMrs Adams scoured the internet and discovered that drinking more has been shown to replenish lost amniotic fluid - the liquid the baby needs to grow in the womb.\nDetermined: Louise said drinking seven pints of water a day helped keep her son alive\nProud: Father Jakk, left, and mother Louise, right, with their 'real-life water baby', Joseph\nCheck-up: Mrs Adams, pictured in water, kept sipping water and relaxed for three months\n'The more the mother drinks the more the baby drinks and urinates,' Mrs Adams explained.\n'As excretion of urine by the unborn baby is the major source of amniotic fluid production in the second half of pregnancy, it made sense that increasing my fluid intake could make a difference.'\nDOES DRINKING MORE WATER WORK? British doctors do not advise pregnant women whose waters break early to drink more fluid as they say there is little research to claim it works. However, in common with other US websites, the Mayo Clinic states treatment for low amniotic fluid (oligohydramnios) can include drinking more fluids to maintain a healthy level. It is possible to temporarily increase the amount of amniotic fluid with a procedure known as amnioinfusion, in which saline is instilled into the amniotic sac.\nAfter six days in hospital, Mrs Adams went home, and over the next 13 weeks rested and constantly sipped water.\nShe recalls: 'I shut myself off from the world. It wasn't easy but I drank around seven pints a day.\n'I also consumed cranberry juice and raw cloves of garlic after reading they could ward off infection, common when the waters break early.\n'Doctors and midwives were sceptical and gave me no hope. They told me there was little research and it was unlikely to make any difference. But I had nothing to lose.'\nTo everyone's delight, Joseph continued to grow.\n'Getting past 24 weeks was the first hurdle as I knew at that point he at least had some chance of survival if born then,' she recalls, 'once past 24 weeks doctors finally gave me steroids to mature Joseph's lungs and antibiotics to prevent infection.'\nHe was finally delivered at Royal Stoke University Hospital by c-section, weighing a healthy 5Ib 10oz.\nHealthy: Louise said son Joseph, pictured left in hospital, is a 'smiling bundle of joy'\nLoved: Parents Louise and Jakk Adams with sons Isaac and Joseph, now six months old\n'When we heard him crying his eyes out, we were overjoyed. He was absolutely perfect and did so well, he came home after just a week.'\nJoseph is now aged six months. His mother says: 'He is a smiling bundle of joy. He never gave up fighting and beat all the odds.'\nA spokesperson for Little Heartbeats, a charity which supports women who suffer from PPROM said: 'Many of our Mum's believe drinking water to replenish their amniotic fluid levels have helped.\n'Many other countries such as the US do recommend that mum's increase their water consumption.'","url":"https://www.dailymail.co.uk/femail/article-4300276/Mum-kept-son-alive-waters-broke-22-weeks.html"}
