{"authors":["Sophie Haslett For Daily Mail Australia"],"date_download":"2018-10-22 22:22:43","date_modify":"2018-10-22 22:22:43","date_publish":"2017-03-16 03:29:54","description":"Melissa Holman, 34, from the Gold Coast, has been a surrogate for two women. She has seen 18 babies born with her donor eggs. Ms Holman speaks to FEMAIL about her experiences.","filename":"data/vaneerConsumption/Mumofthreetalksaboutbeingasurrogateandeggdonor.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/02/3E5050B300000578-0-image-a-26_1489629889781.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4318396_Mum-three-talks-surrogate-egg-donor_1540246963.html","title":"Mum of three talks about being a surrogate and egg donor","title_page":"Mum of three talks about being a surrogate and egg donor | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It was while she was on a break as a young nurse that Melissa Holman first encountered just how difficult it can be for some women to become mothers.\nAfter she heard another woman crying down the hall because she was on her seventh failed IVF cycle, the Gold Coast woman said she remembers 'feeling like I wished I could help her'.\nEight years later, Ms Holman, now 34, has been a surrogate for two women, and also seen 18 babies born with her donor eggs.\n'I was 27, I'd had a couple of kids, I didn't need my eggs anymore,' Ms Holman told Daily Mail Australia of her first experience.\nMelissa Holman (pictured left with a recent surrogate mother Kelly and her daughter) has been a surrogate for two women; she has seen 18 babies born with her donor eggs\nThe mother-of-three (pictured with her daughter, Emily) told FEMAIL: 'I was 27, I'd had a couple of kids, I didn't need my eggs anymore'\nMs Holman was a surrogate for Teresa (both pictured with little baby, Nina) - and she said the moment she saw Nina with Teresa she was happy: 'I wouldn't swap that moment for anything'\nFollowing on from her experience at the hospital, Ms Holman found herself browsing the local papers a couple of weeks later.\n'I saw an ad, and a couple looking for a compassionate egg donor. The rest is history,' she said.\nSince 2009, and her first egg donation, Ms Holman has been a surrogate twice. She told FEMAIL she found it 'hugely rewarding' on both occasions:\nBy the time we got Nina, and I put her in her mother's arms, she was crying with happiness. I wouldn't swap that moment for anything\n'The first surrogacy was exhausting, both physically and emotionally. I had three miscarriages before I have gave birth to a little girl for the mother.\n'By the time we got Nina, and I put her in her mother's arms, she was crying with happiness. I wouldn't swap that moment for anything.'\nThe second surrogacy took place just this year.\n'A few weeks ago I gave birth to a baby boy. This is me holding him,' Ms Holman wrote in a moving Facebook post on Tuesday.\n'He was perfect - a screaming newborn mess, lifted off my stomach and put gently into his mother's loving arms.\n'Those arms were not mine. She's next to me in this picture. I'm a surrogate, and he was the second baby I placed in another mother's arms.'\nShe said that she has found both of her surrogacy experiences 'hugely rewarding' (pictured with Teresa and baby Nina)\nMs Holman (left) said she feels so passionately about surrogacy and egg donation because motherhood is so important to so many women (pictured with Teresa, her second surrogacy)\n'These women might have been me, and yet for them to have a child - something which happened so naturally for me - it's such a struggle,' she told FEMAIL\nMs Holman said she feels so passionately about surrogacy and egg donation because motherhood is so important to so many women.\n'These women might have been me, and yet for them to have a child - something which happened so naturally for me - it's such a struggle,' she told FEMAIL.\n'When I see a baby in their new mother's arms I feel happiness, and almost an increased happiness because I'm so acutely aware of the mothers' struggles to reach that happiness.\n'I'm a practical person at the end of the day, I've had my children. I walk past the nappy aisle in Woolworths and think I'm so glad I'm not there anymore.\n'Someone needs something that I have; for me it's that simple.'\n'When I see a baby in their new mother's arms I feel happiness, and almost an increased happiness because I'm so acutely aware of the mothers' struggles to reach that happiness,' Ms Holman told FEMAIL (pictured with three of her donor mothers)\n'I'm a practical person at the end of the day, I've had my children. I walk past the nappy aisle in Woolworths and think I'm so glad I'm not there anymore'\n'Someone needs something that I have; for me it's that simple,' she said (pictured: one of Ms Holman's donor families)\nMs Holman said she always strikes up a bond with the women she donates to - either on the phone, face to face or over messages.\nHowever, she also said that she has plenty going on in her own life and so is happy to leave them alone to be mothers once they have their babies:\n'I do choose them, and they are women who might be my friends, but when you've done this a few times you get an instinct for someone and what type of person they are quite quickly.\n'The fondness some might imagine I feel for the babies I feel for the mothers,' she said.\nMs Holman has currently reached her 'family limit' of egg donations in Australia, but the subject is something she remains incredibly passionate about.\n'I've been doing this for quite some years now, but that feeling of happiness when you donate doesn't get old.\n'I'd say to anyone who thinks they'd like to be an egg donor, talk to other women who have done it and don't jump in. If you understand the gift you're giving, it's right for you.\n'Alone we can move stones, and together we can move mountains.'\nTo follow Mel Holman on Facebook, you can click here. She also has a blog, which you can find here.","url":"https://www.dailymail.co.uk/femail/article-4318396/Mum-three-talks-surrogate-egg-donor.html"}
