{"authors":[],"date_download":"2018-10-30 20:17:20","date_modify":"2018-10-30 20:17:20","date_publish":"2017-01-11 18:44:00","description":"Dr. Nedra Dodds and her assistant were charged with murder in connection with the deaths of two patients in 2013","filename":"data/vaneerConsumption/MurderchargesdroppedagainstformerCobbcosmeticdoctors.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/01/11/Images/nedra_20170111171437.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_crime--law_murder-char_74b2123da74a4240a35eb08b8d90c208__1540930640.html","title":"Murder charges dropped against former Cobb cosmetic doctors","title_page":"Murder charges dropped against Cobb cosmetic doctors indicted in 2016","title_rss":"NULL","source_domain":"ajc.com","text":"Murder and other charges against two Cobb County cosmetic doctors accused in the deaths of two people have been dropped, according to Channel 2 Action News.\nDr. Nedra Dodds and her assistant, Kevin McCowan, were indicted last year in the 2013 deaths of two patients seen at Dodds’ Opulence Aesthetic Medicine practice in Kennesaw.\nTwo counts of murder, aggravated battery and theft by deception charges have been dropped against Dodds and McCowan, Channel 2 reported.\nNedra Dodds, Kevin McCowan (Credit: Cobb County Sheriff’s Office)\nApril Jenkins of Savannah died after a fat-transfer procedure in April 2013, The Atlanta Journal-Constitution previously reported.\nIn June 2013, firefighters arrived at Dodds’ practice to find Miami businesswoman Erica Beaubrun lying in a pool of blood after a buttocks reduction procedure. She similarly went into cardiac arrest, according to a police report.\nDodds’ clinic closed and, after a 2015 hearing, the state revoked Dodds’ medical license. Dodds’ medical license was also revoked in Pennsylvania and South Carolina.\nBREAKING: Murder & all charges dropped against Dr. Nedra Dodds indicted in 2016 over allegations “botched” procedures led to 2 deaths @wsbtv pic.twitter.com/Jr64w1Vlvh — Aaron Diamant (@AaronDiamantWSB) January 11, 2017\nCobb County District Attorney Vic Reynolds told Channel 2 this case has troubled him since 2013, but he made the decision to drop the charges because he didn’t think the case could be made in a criminal situation.\n“The buck stops with me,” Reynolds told the news station. “It's my decision — and it's not an easy decision; it's not a decision that I like and it's a decision that weighs on me.\"\nAudrey Jenkins, whose sister April died in Dodds’ clinic, said she accepts Reynolds’ decision.\n“I think the district attorney did what he thought was best for the case to proceed or not to proceed, so I'm not disappointed or angry about that,” Jenkins told Channel 2.\nThe Jenkins family still has a civil lawsuit pending against Dodds.","url":"https://www.ajc.com/news/crime--law/murder-charges-dropped-against-former-cobb-cosmetic-doctors/tPBP93M3Y9MpLxuPBLulbM/"}
