{"authors":["Harvey Day","Charlie Moore For Mailonline"],"date_download":"2018-10-23 02:13:08","date_modify":"2018-10-23 02:13:08","date_publish":"2017-03-10 11:09:48","description":"The mugshots belonged to New Scotland Yard Detective Herbert Mew who worked in London in the 1920s. In total, he amassed 64 of them. They are tipped to sell for £800 at auction.","filename":"data/vaneerConsumption/Murderersandfraudstersposefor1920smugshots.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/12/3E22EC2F00000578-0-image-a-82_1489150730424.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300586_Murderers-fraudsters-pose-1920s-mugshots_1540260788.html","title":"Murderers and fraudsters pose for 1920s mugshots","title_page":"Murderers and fraudsters pose for 1920s mugshots | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A fascinating collection of criminals' mugshots from the 1920s have been unearthed after 90 years.\nThe mugshots belonged to New Scotland Yard Detective Herbert Mew who worked in London in the 1920s. In total, he amassed 64 of them.\nThey have come up for auction and are tipped to sell for £800.\nThe mugshots belonged to New Scotland Yard Detective Herbert Mew who worked in London in the 1920s\nInterestingly, the men are wearing smart suits while the ladies are in hats and bonnets, a far cry from today's less than flattering mugshots.\nIn their ranks is a murderer, a group of bank robbers and numerous fraudsters.\nThere are also mugshots of a group of bank robbers in Euston Road who were caught in the act. They had brought along explosives to blow open the safe which contained £1,600.\nThe bulk of the criminals in the mugshots were up on fraud charges which perhaps explains their expensive looking clothes.\nSORDID TALE OF A TAILOR WHO MURDERED HIS MISTRESS... One of the photos is of Cecil Arthur Maltley who murdered his mistress Alice Middleton on August 24, 1922 in a home in Hyde Park Gardens. The 47 year-old tailor, who lived in a flat above his shop, shot her and wrapped her corpse in a sheet. Alice Middleton (left) who was murdered by Cecil Arthur Maltley (right) on August 24, 1922 in a home in Hyde Park Gardens Alice's husband was in the Far East serving with the Merchant Navy and in the summer of 1922 she moved in with Maltby. Her husband upon his return in December 1922 attempted to find Alice but had no luck so he reported her missing. When police visited Maltby he told them that Alice had left him on August 15. They decided to keep a watch on the shop but Maltby never seemed to leave the flat. Police obtained a health order on the grounds of the premises being in an unsanitary condition. On January 10, 1923, officers charged into the premises and heard a shot from the bedroom. Maltby had put a gun in his mouth and pulled the trigger.\nThe bulk of the criminals in the mugshots were up on fraud charges which perhaps explains their expensive looking clothes - including Horace Maskell (bottom centre) who committed fraud\nOther crimes that feature in the mugshot parade photo album are larceny, theft of food and receiving stolen goods\nOther crimes that feature in the mugshot parade are larceny, theft of food and receiving stolen goods. The biggest scammer seems to be Hugh Lindsey who was accused of a £10,000 fraud. At the other end of the scale, Ulrie Edwin was alleged to have committed a £12 fraud.\nA newspaper cutting about Edwin, which is part of the collection, reads: 'Detectives struggle at arrest of man of colour. The landlady refused to open the front door, so they forced it.\n'The prisoner was found concealed behind a door with an empty bottle of whisky, he resisted when told he would be arrested and force had to be used to get him from the room.'\nOne of the most striking mugshots is of portly but well dressed Australian jeweller Jack Tar Fishwick (bottom right) who committed three robberies in 1923. He fought in the First World War but went awol and married Lucy Mary Broadhurst from Staffordshire who was convicted at the Old Bailey of bigamy in 1919\nHe added: 'The majority of the mugshots are for people on fraud charges, although there is also one murder'\nUlrie Arthur Edwin (top left and right) who hid behind a door to try and evade capture after he was charged with fraud. Other mugshots are of G Hughes (bottom centre) who committed larceny and attempted fraud\nMr Chapman went on: 'When I first saw the mugshots I could not believe how smartly dressed they all were with their expensive looking suits'\nHe said: 'The mugshots belonged to Detective Mew and were passed down his family but they have emerged now as a result of a house clearance'\nGlen Chapman, specialist at C&T Auctions of Ashford, Kent, which is selling the mugshots said: 'There is a particularly interesting case of a bank job in Euston where there are three pictures of the crime scene which were taken in the aftermath.\n'The majority of the mugshots are for people on fraud charges, although there is also one murder. When I first saw the mugshots I could not believe how smartly dressed they all were with their expensive looking suits.\n'The mugshots belonged to Detective Mew and were passed down his family but they have emerged now as a result of a house clearance.'\nThe sale takes place on March 15.\nThis page of the album shows a finely dressed woman who has been curiously labelled as 'The Dope Queen' and I. Jacobs who obtained food and lodgings by false pretences\nIncluded in the album were Ted Hartley who received stolen goods and G White (bottom left) who committed larceny and fraud\nSome of the photos have red ink where Mew has written the names of the criminals and included in this album is a strung bounded paper folder 'Photographic exhibits' with three pictures taken in the aftermath of a botched Euston bank job\nOther images show men in fine suits posing for their mugshots after being arrested in the 1920s\nThe arrested men stared intently at the camera as they posed for their official booking photograph","url":"https://www.dailymail.co.uk/news/article-4300586/Murderers-fraudsters-pose-1920s-mugshots.html"}
