{"authors":[],"date_download":"2018-10-30 20:51:07","date_modify":"2018-10-30 20:51:07","date_publish":"2018-07-11 10:00:00","description":"More from Atlanta columnist Bill Torpy on the Glynn County district attorney who some say enabled a murderous cop to escape justice.","filename":"data/vaneerConsumption/MurderousGeorgiacopGlynnCountyrottennessrevealed.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/WSBTV/2018/07/03/Videos/4430494.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_torpy-large-some_93191170f5a4de88cf02dcaa6b463145__1540932667.html","title":"Murderous Georgia cop: Glynn County rottenness revealed","title_page":"Murderous Georgia cop: Glynn County rottenness revealed | Torpy","title_rss":"NULL","source_domain":"ajc.com","text":"I must admit, I got snowed by District Attorney Jackie Johnson in Brunswick. And it was a masterful obfuscation by an office that seems to master the art.\nJohnson is the prosecutor who helped a couple of trigger-happy Glynn County cops avoid prosecution in the sickening 2010 shooting death of Caroline Small, an unarmed mother trapped in her car after a slow-speed chase.\nTwo months ago, Johnson cut a deal to let one of those cops, Robert “Cory” Sasser, out of jail on bond after he was involved in an armed standoff on May 17 with his fellow cops, kicking two of them in the groin. It was the second time Sasser was bonded out that month. The first was after an arrest for harassing his estranged wife on May 13 at her home. She told cops he threatened to kill her.\nAnd then, two weeks ago, Sasser hunted down his estranged wife, Katie, and executed her moments after shooting to death her male friend, Johnny Hall.\nThe next day, Johnson released a statement saying why on earth she allowed the release of this clearly troubled man.\n“After consulting with police officers involved in the May 17 incident (and) the victim in the May 13 incident … the State and counsel for the defense agreed to a new bond with conditions which was approved and entered by the court,” the DA said in the statement.\nOn first blush, Johnson’s wording makes it seem the cops and even Sasser’s terrified wife somehow supported this bird-brained decision.\nBut it appears the DA was weasel wording. “Consulting with” doesn’t mean “agreeing with,” which is how most people took it on first read.\nConsider this: Just before Sasser’s second release, Katie texted the police witness coordinator to make it clear he should not be released, that he needed long-term therapy and she was “scared that he has nothing left to lose.”\nAlso, that his guns should be secured.\nI wonder how Katie Sasser took that “consulting.”\nOfficer with Troubled Past Fatally Shoots Wife, Her Boyfriend and Himself\nMany officers, I am told, were not happy with Sasser’s second release in May, although it is unclear whether the department tried to stop it. It is clear, however, that the force acted indecisively in not arresting Sasser after he stalked his wife at a Brunswick restaurant on June 26, two days before he killed her.\nSasser was free on his second bond when he entered the pizzeria where his wife was. According to Johnny Hall, who was dead 48 hours later, Sasser aimed his finger like a gun at them. Arresting Sasser on a bond revocation shouldn’t have been a close call for cops, other law enforcement authorities tell me. Hell, he shouldn’t have even been in the county.\nGlynn County police said they investigated but could not take Sasser into custody without a judge’s signature. They said they forwarded the paperwork to the court and the DA. So, instead of taking action, they shuffled paper.\nLast week, Glynn County Police Chief John Powell released body cam footage and other details from the May 13 incident, the one where Sasser tangled with cops outside his wife’s home.\nKatie Kettles Sasser at her front door the night of May 13 as officers answer a domestic incident involving her estranged husband Lt. Robert C. Sasser. This photo is from police body cam footage. The man in the background is John Hall Jr. Both Kettles Sasser and Hall were fatally shot by Lt. Sasser on June 28 at Hall’s home. Sasser then killed himself with a gunshot in a SWAT incident at his home. Source: Glynn County Police body cam (The Atlanta Journal-Constitution)\nBut police did not release info about the May 17 standoff or the June 26th stalking incident.\nPowell, in a statement touting accountability and transparency, said the DA requested the other two cases not be released “at this time due to an ongoing investigation by the Georgia Bureau of Investigation.”\nThe GBI is investigating whether any Glynn County cops gave Sasser information to help locate his wife. But county police files concerning the Sasser incidents should be considered closed cases — because everyone is dead — and, therefore, a matter of public record. They have nothing to do with the GBI investigation.\nGBI Director Vernon Keenan told me, “I don’t know why they made that decision. We did not ask for any information to be withheld. The other information has no impact on our investigation.”\nThe GBI and Glynn County authorities clashed several years ago when the DA’s office and the cops shielded Sasser and his partner, Michael T. Simpson — two officers who should have been indicted in the killing of Caroline Small.\n“The Caroline Small investigation was a debacle,” Keenan said. “We changed our policy after that so we’d never have a situation where a department works against our investigation.”\nKeenan, a likable fellow who tries to get along, then added, “In fairness to Jackie Johnson, we work very well with her office — aside from the Caroline Small case.”\nAside from that, Mrs. Lincoln, how did you like the play?\n» AJC INVESTIGATION: Did Caroline Small have to die?\nSeveral people told me that Chief Powell, on the job not quite a year, is trying to change the department.\nJason Clark, who represented victim Johnny Hall, said, “Powell had no love for” Sasser, noting he was working to fire him.\nSo why wasn’t Sasser picked up on a bond revocation right before the shooting?\n“I think there was ego involved,” Clark said. “They didn’t want to make a case against Sasser they couldn’t win.”\nHe worries authorities “are setting this up to be a case of victim blaming.” He fears they’ll say they didn’t arrest Sasser because they didn’t believe the soon-to-be victims.\nOn why authorities are continuing to withhold information, he said, “They miscalculated. It just made people angrier.”\nOne angry person is Heather Butler, who has several Glynn County cops in her family, including her husband.\nBrunswick Judicial Circuit District Attorney Jackie Johnson in Cobb Superior Court in Marietta in August 2013. (PHIL SKINNER / AJC)\nShe started two petitions, one calling for the impeachment of two magistrates, and the other calling for disciplinary action against Johnson for allowing the second bond.\nThere is no petition against the cops, but two out of three ain’t bad.\nButler filed the petitions as “a statement of the voters: We’re paying attention and we’re not happy about it.”\nJohnson, it should be noted, won without opposition in 2016.\nSasser had a bad reputation on the force. “I can’t name a single person who liked him,” Butler said. “Hot-headed, angry, unpleasant. Stories going back 10 years say he was a loose cannon.”\nStill, he was promoted to lieutenant after the Small shooting, such was the department. And, interestingly, the department says it can’t find the last six years of his personnel file!\nButler said the DA and the magistrates should have noticed they had a problem with Sasser’s escalating behavior. “He had nothing left to lose. Everyone saw this coming, except the DA and the judge.”","url":"https://www.ajc.com/news/local/torpy-large-something-stinks-brunswick-and-ain-paper-mills/kHAdn8AY94VuWMEGWrEb4I/"}
