{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 20:25:21","date_modify":"2018-10-30 20:25:21","date_publish":"2016-12-07 13:24:06","description":"A woman accused of robbing, beating, and burning a grandmother was caught taking selfies and posting them to social media while behind bars.","filename":"data/vaneerConsumption/MurderSuspectCaughtTakingSelfiesBehindBars.json","image_url":"https://media.breitbart.com/media/2016/12/Mina-Ellery-jail-selfie-screenshot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_12_07__1540931121.html","title":"Murder Suspect Caught Taking Selfies Behind Bars","title_page":"Murder Suspect Caught Taking Selfies Behind Bars","title_rss":"NULL","source_domain":"breitbart.com","text":"A Georgia woman accused of robbing, beating, and burning a grandmother who later died has been caught taking selfies and posting them to social media while behind bars.\nMina Ellery is now in trouble for allegedly posting selfies on Facebook in which she is making a “duck face” with a jailhouse phone in her hand and sticking her tongue out, CBS46 reported.\nEllery and three others were arrested and charged with the killing of 83-year-old Dorothy Dow in August.\nMeriweather County Sheriff Chuck Smith said the suspects broke into Dow’s home, beat her, poured gasoline on her, and then lit her on fire.\nInvestigators stated that a visitor snuck a cell phone camera into one of the visitation rooms inside the jail, and Sheriff Smith said authorities are reviewing surveillance footage to see who snuck the phone into the facility illegally.\n“This isn’t right. She’s in there for a reason, and it shouldn’t be like she’s smiling and having fun while another family is sad and grieving,” Sherry Lee Ellerly, the suspect’s mother, told CBS46.\nSmith said the jail does not have pat downs or metal detector screenings for visitors, but there will be a staff review following the incident.\n“We’re going to make sure our jail staff is following the procedures,” said Smith. “We’re also going to use our video surveillance that we have here within the jail, and this is going to help us identify this person. That’s why this person is going to be held responsible.”\nSmith is looking to file criminal charges with the District Attorney’s Office against whoever is responsible once that person is found.\nThis is not the first time a jail inmate has been caught posting selfies to social media in recent months.\nA Tennessee inmate was caught taking selfies with an illegal cell phone in October, and an inmate from West Virginia was caught taking selfies with a cell phone and posting them to Facebook while in the back of a prison van.","url":"https://www.breitbart.com/politics/2016/12/07/murder-suspect-caught-taking-selfies-behind-bars/"}
