{"authors":["Alicia Lu"],"date_download":"2018-10-30 23:38:57","date_modify":"2018-10-30 23:38:57","date_publish":"2014-08-13 15:30:55","description":"A murder case in Gainesville, Florida, has provided further evidence that technology can be both your best friend and your worst enemy. According to new evidence in the trial accusing a man of killing his roommate, Pedro Bravo asked Siri where to…","filename":"data/vaneerConsumption/MurderSuspectAllegedlyAskedSiriWhereToHideADeadBodySoSheReplied.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/c1d7f252-ab24-4425-a168-e65bc83cf259.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35581-murder-suspect-allegedly-asked-siri-where-to-hide-a-dead-body-so-she-replied_1540942737.html","title":"Murder Suspect Allegedly Asked Siri Where To Hide A Dead Body, So She Replied","title_page":"Murder Suspect Allegedly Asked Siri Where To Hide A Dead Body, So She Replied","title_rss":"NULL","source_domain":"bustle.com","text":"A murder case in Gainesville, Florida, has provided further evidence that technology can be both your best friend and your worst enemy. According to new evidence in the trial accusing a man of killing his roommate, Pedro Bravo asked Siri where to hide the body of Christian Aguilar.\nBravo, then an 18-year-old Santa Fe College undergrad, has been charged with the first-degree murder and kidnapping of University of Florida student Christian Aguilar in September 2012. According to police interrogation tapes played at the trial, the two roommates had argued over Bravo's ex-girlfriend, whom Aguilar was dating at the time. Bravo reportedly told police that he had beaten Aguilar and kicked him out of his truck. The next month, Aguilar's body was found by hunters about 60 miles away from Gainesville. Authorities believe that Aguilar was poisoned and then suffocated.\nAccording to Gainesville police, Bravo asked Siri to be his accomplice on the night of September 20, 2012. He said to the iPhone app, \"I need to hide my roommate.\" Instead of assuming some innocent scenario where maybe Aguilar was trying to shake an angry date or avoid his English professor, Siri apparently replied, \"What kind of place are you looking for? Swamps. Reservoirs. Metal foundries. Mines. Dumps.\"\nIf you've ever asked Siri where or how to hide a body, you'll know that's the answer she's programmed to respond with — which is an amusing quirk in, well, 99.9 percent of instances. Not this one, unfortunately.","url":"https://www.bustle.com/articles/35581-murder-suspect-allegedly-asked-siri-where-to-hide-a-dead-body-so-she-replied"}
