{"authors":["Breitbart News"],"date_download":"2018-10-30 20:26:46","date_modify":"2018-10-30 20:26:46","date_publish":"2018-08-06 13:09:23","description":"'Murphy Brown' is seen \"through the prism of the press,” producer Diane English told TV critics. \"The press is not the enemy of the people.”","filename":"data/vaneerConsumption/MurphyBrownRevivaltoTackleTrumpthePressandMeToo.json","image_url":"https://media.breitbart.com/media/2018/01/MurphyBrown1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_08_06__1540931206.html","title":"‘Murphy Brown’ Revival to Tackle Trump, the Press, and #MeToo","title_page":"‘Murphy Brown’ Revival to Tackle Trump, the Press, and #MeToo","title_rss":"NULL","source_domain":"breitbart.com","text":"BEVERLY HILLS, Calif. (AP) — “Murphy Brown” will weigh in on the MeToo movement when the series starring Candice Bergen returns to a very different world in September, the show’s creator said Sunday.\nThe 13-episode reboot reunites Bergen as a sharp-tongued investigative journalist and TV anchor with most of the original cast from the CBS show’s initial 10-year run that ended in 1998 — before the internet and the rise of 24-hour cable news took hold. Once again, scripts will be inspired by current events, including the fourth episode entitled “(Hashtag) MurphyToo.”\nExecutive producer and writer Diane English told a TV critics’ meeting the episode was developed months ago and inspired by the movement against workplace sexual harassment and assault that first gained momentum last fall.\n#MurphyBrown picks up on November 8, 2016. You know what that means. #TCA18 — Chris Harnick (@chrisharnick) August 5, 2018\n\"The script of the first show is so fearless…we really stick our heads in the lion's mouth\" – Candice Bergen, on the revival of #MurphyBrown #TCA18 — Jason Nathanson (@ABCNewsJason) August 5, 2018\n“It’s a powerful movement,” she said. “We wanted to do it justice.”\nEnglish said the show’s writing staff, comprised of men and women of different ages who are gay and straight, spent days discussing what she calls “a complicated issue.”\n“We came at it from so many different angles. Just the conversations we had in there, the perspectives that people have from their own particular prism,” English said. “I don’t think there’s probably a woman out here that hasn’t had an experience with misogyny and misconduct.”\nHowever, English is not one of them. She says she never experienced any kind of sexual misconduct or misogyny at CBS, where CEO Leslie Moonves is under investigation for such behavior.\nEnglish said everyone on “Murphy Brown” takes the allegations against Moonves and other network employees raised in a recent New Yorker magazine article “extremely seriously” and fully supports the investigation.\n“I’m focusing the show really through the prism of the press,” English said. “The First Amendment and the free press is under attack like I’ve never seen before. The press is not the enemy of the people.”\nThe series debuts Sept. 27.","url":"https://www.breitbart.com/entertainment/2018/08/06/murphy-brown-revival-to-tackle-trump-the-press-and-metoo/"}
