{"authors":["Associated Press"],"date_download":"2018-10-23 03:33:35","date_modify":"2018-10-23 03:33:35","date_publish":"2016-01-29 18:30:07","description":"MELBOURNE, Australia (AP) — Andy Murray arrived at the Australian Open fully prepared to become a father before becoming champion. Murray left his pregnant w...","filename":"data/vaneerConsumption/MurraybeatsRaonicin5toreach5thAustralianOpenfinal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:348945dc74a348e78baf5b3260c0e61b-3bmscybNe842cce83474b58bdddc-909_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422778_Murray-beats-Raonic-5-reach-5th-Australian-Open-final_1540265615.html","title":"Murray beats Raonic in 5 to reach 5th Australian Open final","title_page":"Murray beats Raonic in 5 to reach 5th Australian Open final | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Murray beats Raonic in 5 to reach 5th Australian Open final\nMELBOURNE, Australia (AP) — Andy Murray arrived at the Australian Open fully prepared to become a father before becoming champion.\nMurray left his pregnant wife in Britain ahead of the start of the tournament, promising to fly home at any time if needed.\nHowever, the 28-year-old Murray has now given himself a chance of becoming a champion first following his five-set win over Milos Raonic on Friday to reach the final for the fifth time.\nAndy Murray of Britain waves as he leaves Rod Laver Arena following his win over Milos Raonic of Canada in their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Aaron Favila)\nHis 4-6, 7-5, 6-7 (4), 6-4, 6-2 victory sets up a final against five-time champion Novak Djokovic in Sunday's title match.\nMurray is 0-4 in finals at Melbourne Park with Djokovic having won all five previous Australian Open finals.\n\"Five finals is a great achievement. You can't take that away from me,\" Murray said. \"So I have to be proud of that achievement.\n\"Doesn't matter what's happened in the past. What matters is what happens Sunday.\"\nThree of Djokovic's wins in Australia have come in finals against his old friend Murray, every odd-numbered year since 2011.\n\"He loves playing on this court, we've played a bunch of times here,\" Murray said. \"Hopefully it can be a different result.\"\nMurray has had a lot on his mind this time. His wife, Kim, is expecting their first baby next month. His father-in-law, Nigel Sears, was in Melbourne as coach for Ana Ivanovic and had to be rushed to a hospital by ambulance during a match on Rod Laver Arena, which happened to coincide with Murray's third-round match on an adjacent arena.\nSears spent a night in a nearby hospital, but was considered well enough to return home. While his father-in-law was being treated in hospital, Murray at times thought his departure from Australia may have been earlier than expected.\nHe stayed, and won his next two matches in straight sets, shaking out some of the emotions.\nHe had more to contend with against Raonic, who was playing in the semifinals of a Grand Slam tournament for only the second time, and aiming to be the first Canadian man to reach the final of a major.\nIn an unusual start, the first seven points of the match went against serve, with Raonic breaking at love and then facing triple break point before holding for a 2-0 lead. It was Raonic's only service break of the match, with Murray fending off six other break-point chances.\nRaonic was hampered by an adductor problem in his upper right leg from late in the third set. He needed a medical time out, and later in the fourth set had a massage from the trainer.\n\"I couldn't push off, I couldn't get up to serve, and I couldn't change direction,\" Raonic said. \"Probably the most heartbroken I've felt on court.\"\nAfter having his serve broken to open the fifth set, Raonic walked back to his chair and angrily smashed his racket on the hard court surface twice, breaking it.\n\"I guess that was sort of just the whole frustration of everything sort of getting out,\" said Raonic, who tends not to be demonstrative on court.\nMurray went on a run of winning 20 of 25 points to go ahead 4-0 and all but clinch the four-hour match, and a spot in a ninth Grand Slam final.\nMurray said he sensed Raonic slowing down, but had to keep his mind on his own side of the court. He'll have to do that again against top-ranked Djokovic, who won 27 of his 28 matches in Grand Slams in 2015.\nThere hasn't been a walkover in the final of a Grand Slam tournament since Wimbledon in 1931, when Sidney Wood Jr. won the title because fellow American Francis Shields withdrew because of injury.\nFor now, Murray is planning on playing.\n\"I need to keep my game plan very well, not have any lapses in concentration and just play the best I can,\" said Murray, who has won only nine of his 30 career meetings with Djokovic.\nBrother Jamie is in the doubles final with Bruno Soares against Daniel Nestor and Radek Stepanek on Saturday, giving the Murray siblings the distinction of being the first brothers to appear in the singles and doubles finals at the same major in the Open era. The men's doubles decider follows the women's final between six-time champion Serena Williams and Angelique Kerber.\nIn the women's doubles final Friday, Martina Hingis and Sania Mirza beat the Czech pair of Andrea Hlavackova and Lucie Hradecka 7-6 (1), 6-3 to claim their third Grand Slam title together.\nMirza couldn't extend her run in mixed doubles, losing with her partner Ivan Dodig of Croatia 7-5, 7-6 (4) later Friday to Elena Vesnina and Soares in the semifinals.\nMilos Raonic of Canada plays a forehand return to Andy Murray of Britain during their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Aaron Favila)\nAndy Murray of Britain yells during his semifinal match against Milos Raonic of Canada at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Rafiq Maqbool)\nAndy Murray of Britain reacts after losing a point to Milos Raonic of Canada during their semifinal match at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Aaron Favila)\nMilos Raonic of Canada talks to a trainer during his semifinal match against Andy Murray of Britain at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Vincent Thian)\nCoach Amelie Mauresmo and trainer Matt Little cheer Andy Murray of Britain during his semifinal match against Milos Raonic of Canada during their semifinal at the Australian Open tennis championships in Melbourne, Australia, Friday, Jan. 29, 2016.(AP Photo/Rafiq Maqbool)","url":"https://www.dailymail.co.uk/wires/ap/article-3422778/Murray-beats-Raonic-5-reach-5th-Australian-Open-final.html"}
