{"authors":["Associated Press"],"date_download":"2018-10-22 20:38:37","date_modify":"2018-10-22 20:38:37","date_publish":"2016-01-29 02:38:55","description":"MELBOURNE, Australia (AP) — Andy Murray and Milos Raonic are set to meet in a men's semifinal for the right to play five-time champion Novak Djokovic in an A...","filename":"data/vaneerConsumption/MurrayRaonicmenssemifinalsetatAustralianOpen.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-urn:publicid:ap.org:69d90aa40df049b183919446ba92c484-2vdWmEltwXfba0ce28e632f2611b-798_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3422123_Murray-Raonic-mens-semifinal-set-Australian-Open_1540240717.html","title":"Murray-Raonic men's semifinal set at Australian Open","title_page":"Murray-Raonic men's semifinal set at Australian Open | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Murray-Raonic men's semifinal set at Australian Open\nMELBOURNE, Australia (AP) — Andy Murray and Milos Raonic are set to meet in a men's semifinal for the right to play five-time champion Novak Djokovic in an Australian Open men's final.\nThe roof was closed over Rod Laver Arena early Friday afternoon with rain showers in the area, but those were expected to clear in time to have an open stadium for the night match.\nDjokovic, who has won all five finals he's played at Melbourne Park, beat Roger Federer in four sets Thursday to advance to Sunday's championship decider.\nAndy Murray of Britain reaches for a forehand return to David Ferrer of Spain during their quarterfinal match at the Australian Open tennis championships in Melbourne, Australia, Wednesday, Jan. 27, 2016.(AP Photo/Rafiq Maqbool)\nThe first final of 2016 will be played on Friday afternoon — the women's doubles championship between the No. 1-ranked team of Martina Hingis and Sania Mirza play Andrea Hlavackova and Lucie Hradecka.","url":"https://www.dailymail.co.uk/wires/ap/article-3422123/Murray-Raonic-mens-semifinal-set-Australian-Open.html"}
