{"authors":["Press Association"],"date_download":"2018-10-23 03:15:32","date_modify":"2018-10-23 03:15:32","date_publish":"2017-03-16 14:08:09","description":"Marmion replaces Murray, who has failed to shake off a shoulder problem, at scrum-half while Henderson is preferred to Toner in the second row.","filename":"data/vaneerConsumption/MurrayandTonermissoutonIrelandsmatchagainstEngland.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/15/wire-229333-1489679596-585_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4320420_Murray-Toner-miss-Ireland-s-match-against-England_1540264532.html","title":"Murray and Toner miss out on Ireland´s match against England","title_page":"Murray and Toner miss out on Ireland´s match against England | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Conor Murray has failed to shake off his shoulder problem and will miss Ireland’s RBS 6 Nations finale with England, while boss Joe Schmidt has dropped lock Devin Toner.\nFit-again Jared Payne starts at full-back ahead of Rob Kearney, with Iain Henderson preferred to Toner in the second-row and Kieran Marmion replacing Murray at scrum-half.\nKeith Earls has shaken off his groin complaint to start on the wing, but Schmidt sprung a surprise with his decision to drop lineout co-ordinator Toner.\nFull-back Kearney has suffered a knee injury, opening the door for Payne to feature for the first time since suffering a lacerated kidney in November.\nIreland will certainly view losing British and Irish Lions scrum-half Murray as a huge blow ahead of the England showdown.\nEngland are chasing a second-successive Grand Slam and a world-record 19th straight win at the Aviva Stadium on Saturday.\nMurray and Johnny Sexton have built one of the standout half-back partnerships in northern hemisphere rugby, and Ireland have tended to rely on the duo’s stewardship in their finest moments.\nJoe Schmidt\nIreland are bidding to avoid losing to all three home nations rivals in one championship for the first time since 1998, and must now do so without several of their most trusted lieutenants.\n“There’s still an opportunity to finish second which is a massive thing for us,” said Schmidt.\n“We can still attain the target of second place, so there’s still a heck of a lot for us to gain individually and collectively.”","url":"https://www.dailymail.co.uk/wires/pa/article-4320420/Murray-Toner-miss-Ireland-s-match-against-England.html"}
