{"authors":["Belinda Grant Geary For Daily Mail Australia"],"date_download":"2018-10-23 00:55:54","date_modify":"2018-10-23 00:55:54","date_publish":"2016-01-28 15:04:57","description":"As social media reacts to Mitchell Pearce's on-film scandal, people of all walks of life have jumped to the disgraced player's defence claiming the outrage that ensued was a complete 'overreaction'.","filename":"data/vaneerConsumption/MusicianslawyersandNRLfansdefendRoostersstarMitchellPearceformakingapoorjokeinsideaprivatehouse.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB1CC000000578-0-image-a-54_1453993322893.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420912_Musicians-lawyers-NRL-fans-defend-Rooster-s-star-Mitchell-Pearce-making-poor-joke-inside-private-house_1540256154.html","title":"Musicians, lawyers and NRL fans defend Roosters star Mitchell Pearce for 'making a poor joke inside a private house'","title_page":"Musicians, lawyers and NRL fans defend Roosters star Mitchell Pearce for 'making a poor joke inside a private house' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It is the scandal on everyone's lips.\nProminent rugby league player Mitchell Pearce put his fruitful career in jeopardy after he was unknowingly caught on film allegedly kissing a woman without consent, urinating on himself and drunkenly thrusting at a small dog.\nBut 24 hours after the unedited footage was aired, people from all walks of life have jumped to the disgraced Sydney Roosters player's defence - claiming the outrage that ensued has been a complete 'overreaction'.\nHigh-profile lawyers, musicians and a significant number of social media punters have suggested that he was simply drunk at a private party and that while he acted inappropriately, no laws were broken and no was one injured.\nScroll down for video\nMusicians, lawyers and social media users have defended disgraced Roosters star Mitchell Pearce for 'making a poor joke inside a private house'\nThe Roosters halfback was unknowingly caught on film allegedly kissing a woman without consent, urinating on himself and drunkenly thrusting at a small dog during Australia Day celebrations\nHigh profile Sydney lawyer Chris Murphy, who defended Bulldogs champion Hazem El Masri against domestic violence allegations, distinguished himself from 'the crowd kicking him to death' with several Tweets in support of Pearce.\nHe said the 'common verdict' among several women he spoke to about the incident was that he was drunk and 'carrying on stupid' but 'didn't hurt anyone'.\nMr Murphy said he has seen young people facing the courts for around 40 years and in that time he learned it is never a mistake to give a young person another chance.\n'Know it would be better for all to fix Mitchell Pearce than destroy him,' he wrote on Thursday.\nHigh profile Sydney lawyer Chris Murphy distinguished himself from 'the crowd kicking him to death' with several Tweets in support of Pearce\nMr Murphy (right) defended Bulldogs champion Hazem El Masri (centre) against domestic violence allegations\nHe was joined by another high-profile criminal lawyer, Adam Houda, who said that while he could not support the embattled league player's actions, he did not think it should end his career.\n'I don't agree with what Mitchell Pearce did, but I don't agree with crucifying him either. Forgive & forget,' Mr Houda wrote.\nAustralian hip-hop artist 360 also weighed in on the controversy, stating that 'when people get drunk, they do stupid s***'.\n'Mitchell Pearce was wasted, big whoop. The way the reports spoke about the video I thought he was going to behead the dog and drink it's blood,' he wrote in a post to Facebook that has since been deleted.\nMr Murphy was joined by another high-profile criminal lawyer - Adam Houda\nMr Houda said that while he could not support the embattled league player's actions, he did not think it should end his career\nAustralian hip-hop artist 360 also weighed in on the controversy, stating that 'when people get drunk, they do stupid s***'\n'He was loose.. Big f***in deal. When the lady asked him to leave he didn't cause any problems,' he said\n'He was loose.. Big f***in deal. When the lady asked him to leave he didn't cause any problems.'\nThe 29-year-old rapper from Melbourne said that the 'real issue' was that another party goer filmed the rugby league player without his knowledge so they could 'cash in' on the scandal, adding that the racist remarks which also featured in the two-minute video were just as offensive.\nHis sentiments were mirrored by former rugby league player and indigenous Australian Anthony Mundine.\nThe professional boxer initially said that Pearce had been 'acting like a drunk' and it was a 'stupid mishap'.\nHowever, he changed his tune on Thursday when he said the New South Wales State of Origin representative had portrayed the Aboriginal community in a poor light.\nWhen Pearce was asked if he had urinated on a woman's coach at the Australia Day party, the 26-year-old made the comment that he was Aboriginal.\nThis prompted a woman who was insisting that he leave to say: 'I don't care. It's not Redfern, we are not claiming land rights here.'\nWhen Pearce was asked if he had urinated on a woman's coach at the Australia Day party, the 26-year-old made the comment that he was Aboriginal\nThe professional boxer initially said that Pearce had been 'acting like a drunk' with the simply media beating up a story from a 'stupid mishap'\nHowever, he changed his tune on Thursday when he said the New South Wales State of Origin representative had portrayed the Aboriginal community in a poor light\nOthers agreed with Mundine, condemning Pearce and the woman involved for the racist slurs\nMundine said that while Pearce joked that being Aboriginal justified his crude actions, it was alcohol that was the issue and insinuating otherwise was just wrong.\n'Alcohol was the problem here, but what was said about my race is wrong and they need to pull their heads in, basically,' he told the Sydney Morning Herald.\n'That sort of casual racism, [expressing] low opinions of people and looking down on people is hurtful, and that was what that sort of language depicted to me,' he said.\nPaul Gallen, captain of the Cronulla Sharks and friend of Pearce, spoke out on Thursday stating that he is concerned with the 26-year-old's welfare and that he had only really hurt himself.\n'People make mistakes. We all make mistakes and unfortunately when it involves us guys, those mistakes generally appear to be bigger,' Gallen said.\n'The environment we live in today is an absolute fishbowl and people are willing to profit out of that and things can go wrong very quickly as is what has happened in this case.\n'He hasn't hurt anyone. His actions have only really hurt himself I believe.'\nSocial media users also backed the shamed sports star, writing on Twitter that the alcohol-fuelled incident had been blown way out of proportion.\nPaul Gallen, captain of the Cronulla Sharks and friend of Pearce, spoke out on Thursday stating that he is concerned with the 26-year-old's welfare and that he had only really hurt himself\n'People make mistakes. We all make mistakes and unfortunately when it involves us guys, those mistakes generally appear to be bigger,' Gallen said of Pearce\nSocial media users also backed the shamed sports star, writing on Twitter that the alcohol-fuelled incident had been blown way out of proportion\n‘Omg Mitchell Pearce. Private house. No one was hurt, no laws broke it was a (poor) joke with apparent friends. Massive overreaction,’ one woman wrote.\n'I cannot see that Mitchell Pearce's idiocy is grounds for him to be barred for life from his present livelihood. I find the idea absurd,' wrote another.\nMen also went in to bat for Pearce, stating that his actions were in poor taste but were not a 'sackable offence'.\n'Okay yeah Mitchell Pearce got too f***ed up, but Christ he didn't hurt anyone! Get him off the booze, let him keep his jersey,' said another Twitter user.\n'Not condoning it but Mitchell Pearce story has been blown out of all proportion. Its not that bad really. Fine him but don't end his career,' another man wrote.\nMen also went in to bat for Pearce, stating that his actions were in poor taste but were not a 'sackable offence'\nWhile many have defended him, others have suggested that it was not Pearce's behaviour toward the dog that was reprehensible but the way he allegedly forced himself on a woman at the start of the clip.\nA slurring Pearce walked over to the woman and asked for a kiss, to which she replied 'no I am a lesbian'.\nHe placed his hands on each side of her face and appeared to kiss her for a second before the woman turned away, asked if he urinated on her couch, pulled her dog away from his crotch and asked him to leave.\nA Facebook group that go by the name 'Mad F****ing Witches' said it is wrong that everyone has focused on what happened to the dog, who was not physically harmed.\n'Mitchell Pierce did do something to a dog and it was confused and shaken up for a few seconds, but ultimately unharmed,' the group posted to Facebook on Thursday.\n'What he did to a woman, though, appears to be much more serious, and certainly appears to be without consent.'\n'What he did to a woman, though, appears to be much more serious, and certainly appears to be without consent,' the group wrote on Facebook\nA Facebook group that go by the name 'Mad F****ing Witches' said it is wrong that everyone has focused on what happened to the dog, who was not physically harmed\nOn Twitter others joined in, stating that kissing a woman without her consent is inappropriate and should be widely condemned.\nThe Roosters halfback has been stood down by the club pending a formal investigation but it is expected that the NRL will hand him a six-week suspension for the upcoming season.\nHe will be stripped of the Roosters co-captaincy, fined around $50,000 and barred from the club's UK trip for the World Club Challenge.\nThe incident occurred on Australia Day after Pearce had been drinking with his team-mates on a sanctioned cruise around Sydney Harbour.\nHe posted photographs on Instagram of the group on the cruise and on a bus on the way to the boat party on Tuesday.\nThe incident occurred on Australia Day after Pearce had been drinking with his team-mates on a sanctioned cruise around Sydney Harbour\nHe posted photographs on Instagram of the group on the cruise and on a bus on the way to the boat party on Tuesday\nThe captain decided to carry on partying after the boat cruise and met up with friends at a small gathering - where the footage was taken by a fellow guest.\nAt least two other Roosters recruits are reportedly being investigated over their role in the scandal.\nSydney Roosters coach Trent Robinson said the club is 'going through' the incident with Pearce and the NRL.","url":"https://www.dailymail.co.uk/news/article-3420912/Musicians-lawyers-NRL-fans-defend-Rooster-s-star-Mitchell-Pearce-making-poor-joke-inside-private-house.html"}
