{"authors":["James Delingpole"],"date_download":"2018-10-30 20:23:38","date_modify":"2018-10-30 20:23:38","date_publish":"2015-06-25 13:15:21","description":"This weekend sees arguably the high point of the music festival year - Glastonbury - and naturally one of the main things that is exercising the liberal |","filename":"data/vaneerConsumption/MusicissexistThiscaringfivepointplanwilleradicaterocksgenderbias.json","image_url":"https://media.breitbart.com/media/2015/06/glastonbury1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_06_25__1540931018.html","title":"Music is sexist. This caring five-point plan will eradicate rock's gender bias.","title_page":"Music is sexist. This caring five-point plan will eradicate rock's gender bias. | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"This weekend sees arguably the high point of the music festival year – Glastonbury – and naturally one of the main things that is exercising the liberal media is the disgracefully small proportion of female artistes on the bill.\nYes, OK, so there’s my kids’ former babysitter Florence Welch headlining the main stage. (But only because one of the Foo Fighters broke his leg and had to pull out at the last minute). Apart from that, though, it’s a male-dominated affair, with just 14 per cent of the acts – according to calculations by the Guardian – comprising female artistes.\nOther festivals have an even poorer record. For example, at Creamfields, the percentage of women on the bill is just 3 per cent; and at Download, it is really little better at just 4 per cent.\nWho would ever have possibly imagined that festivals specialising respectively in dance music and heavy metal would attract such a poor turn-out of female talent?\nWhy, if you didn’t know better, you’d almost imagine that most girls lacked either the inclination or the skill-set to make it big in the world of DJ-ing and grinding, throbbing, noisy guitar rock!\nBut obviously we don’t think that way here. That would be sexist. Misogynistic too, probably.\nThat’s why to help the world of rock correct this outrageous gender imbalance, we’ve come up with a few positive suggestions.\n1. Scrap guitars.\nThe guitar is an inherently sexist musical instrument, especially the electric version with its nasty, cutty, thin metal strings which can really hurt delicate female hands – not to mention long nails – which will already have been softened by regular dishwashing. You only have to see the way male rock stars wield their “axes” to realise that they see it as little more than a glorified penile extension. This discriminates against women guitarists who, not ever having owned a penis themselves, look slightly uncomfortable holding what is essentially no more than the musical equivalent of a strap-on.\nFurthermore male guitarists start with a distinct advantage over women. For many years – and with huge regularity during adolescence – they have accumulated great dexterity running their hands up and down their personal pink “fretboard.” So after that, guitar playing comes naturally. Only a handful of women – Courtney Love, comes to mind – have accumulated sufficient experience in this regard to compete on a level playing field.\nThis is why, in the interest of equality, we propose that guitars be replaced by an instrument more in keeping with female anatomy and aptitude: the triangle. TING!\n2. Ban the charts\nCharts are discriminatory because they introduce an unwelcome competitive element to music – something at which men traditionally excel because their basic, unempathetic, prehistoric brains are wired to imagine that getting to number one is the equivalent of killing a woolly mammoth.\nJudging music purely on such “commercial” qualities as musicianship, proficiency, a decent hook, catchy tune, clever lyrics and so on gives men an unfair advantage over women, many of whom may place greater value on more spiritual or emotional qualities like ‘really expressing themselves’, ‘trying hard’, and ‘battling against entrenched male oppression.’\nA good example of this is Yoko Ono, who despite being at least the equal in her own special way of her former partner John Lennon, has often found her work snubbed by an industry cruelly and sexistly obsessed with patriarchal nonsense like sales and favourable reviews.\nIf we cannot ban the charts altogether, then we should at least move to a quota system not unlike the excellent one that obtained in French radio for many years whereby for every track by the Beatles or the Smiths the station played it would have to play three dozen by Johnny Halliday and Serge Gainsbourg.\n3. Reconfigure “toilet” venues\nOne of the biggest problems for female artistes trying to break into the music scene is the often lengthy period they have to spend touring the country playing one-man-and-a-dog “toilet” venues. Men, being naturally predisposed to filth, can cope with the squalor. But women can find it oppressive, especially the rudimentary changing room and lavatory facilities.\nThis problem can be easily solved. All that needs to happen is that all small-to-medium size rock venues must be compelled by law to redecorate and reconfigure themselves in a female-friendly manner: their auditoria can be converted to tasteful dressing rooms, while their changing room and toilet areas can be turned into the auditorium. This shrinking of the playing area will have the added advantage of giving women performers a reasonable chance of finding sufficient paying fans to fill the venue, thus boosting their fragile self-esteem.\n4. Redefine lateness\nMusic fans can be notoriously intolerant when their bands turn up two hours late. Not even Justin Bieber can get away with it. This can prove particularly tough on all-female groups for whom time is a malleable concept, especially when there is good shopping to be had in the area, or if their rider happens to include large quantities of chocolate and/or a foot spa.\nAgain this can be solved very simply. Venues wishing to book female bands for a Wednesday event should simply tell them that the event is happening on Tuesday. That way there is a better than even chance that the band’s arrival on stage will coincide with the presence of an audience.\n5. Feminise band names and rock terminology\n“Axe” – just in case we don’t ban guitars – is clearly male-biased. Prefer “iron”, “washing up brush” or “personal massager.”\nThe long tradition of aggressively male-friendly band names may be harder to eradicate. What we can be certain of is that, if more women had been properly represented in music earlier, then one or two familiar names would have sounded very different.\nFor example:\nEwww! Beatles! Gross!\nThe Literally Who?\nThe Spots And Stripes So Do Not Work, Sweetie\nChocolates and Roses? (He Is Definitely Having An Affair.)\nHole","url":"https://www.breitbart.com/the-media/2015/06/25/music-is-sexist-this-caring-five-point-plan-will-eradicate-rocks-gender-bias/"}
