{"authors":["Elizabeth Ballou"],"date_download":"2018-10-30 23:24:32","date_modify":"2018-10-30 23:24:32","date_publish":"2014-08-13 18:47:24","description":"Have you ever perked up when the radio plays a song that first hit popular stations when you were in middle or high school? Do you turn the volume up to obnoxious levels, even though you know the song isn't that good now, and wasn't great in the…","filename":"data/vaneerConsumption/MusicNostalgiaTheresaScientificReasonYouLovethatBlink182SongSoMuch.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/7/10/f3aa40e9-dbb3-4d9e-8057-b33ffe0351ff-getty-2250392.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35621-music-nostalgia-theres-a-scientific-reason-you-love-that-blink-182-song-so-much_1540941872.html","title":"Music Nostalgia: There's a Scientific Reason You Love that Blink 182 Song So Much","title_page":"Music Nostalgia: There's a Scientific Reason You Love that Blink 182 Song So Much","title_rss":"NULL","source_domain":"bustle.com","text":"Have you ever perked up when the radio plays a song that first hit popular stations when you were in middle or high school? Do you turn the volume up to obnoxious levels, even though you know the song isn't that good now, and wasn't great in the first place? (Confession: I will start tapping out the rhythm to Rihanna's \"Disturbia,\" which came out when I was a freshman in high school, whenever I hear it.) Turns out there may be a scientific reason for that: \"Music nostalgia,\" or the phenomenon of prescribing special value to songs that came out when we were in our formative years, is an actual neurological occurrence.\nSlate's Mark Joseph Stern begins by discussing the way music interacts with the brain to stimulate various neural locations:\n\"Sing along to a song in your head, and you’ll activate your premotor cortex, which helps plan and coordinate movements. Dance along, and your neurons will synchronize with the beat of the music. Pay close attention to the lyrics and instrumentation, and you’ll activate your parietal cortex, which helps you shift and maintain attention to different stimuli.\"\nThe relationship between music and the human nervous system is, in fact, so complex that it constitutes an entire scientific field: the cognitive neuroscience of music. According to Daniel Levitin, author of This Is Your Brain On Music, listening to music can have a significant impact on our brain chemistry, including the way we feel both physically and mentally. When we listen to our favorite songs, our brains release dopamine, a pleasure-inducing neurotransmitter that's also released by a good meal (or a good roll in the hay). Many of our favorite songs are chosen when our personalities (and thus our musical tastes) are coalescing, which principally happens between the ages of 12 and 22. Obviously, that's not to say that personality development can't occur after 22, but there's a reason why so many YA novels by authors like Sarah Dessen can be pretty angsty: first having to figure out who you are is, well, pretty stressful. But it can also result in the discovery of songs you'll caterwaul along to for the rest of your life.\nMusic can also influence the way we recall memories. In 1999, Schulkind, Hennis, and Rubins documented the power of music to bring back specific memories. Since many of our \"firsts\" (first swig of nasty beer, first school dance, first time we wear red lipstick, first time we get the courage to hold someone else's hand, and so on) occur during our teens, and because so many of those moments are, by their nature, accompanied by music of some kind, those memories can get linked pretty strongly with the songs themselves. For example, one-hit wonder Daniel Powter's \"Bad Day\" was playing during my first (incredibly awkward) dance, so I giggle whenever that comes on.\nWant to try out the phenomenon for yourself? One of the \"Now That's What I Call Music!\" albums (there are 50 — yes, five-zero — of them now) is probably a good place to start. Although I am not responsible for any unexpected reactions to Baz Luhrmann's \"Everybody's Free (To Wear Sunscreen).\"","url":"https://www.bustle.com/articles/35621-music-nostalgia-theres-a-scientific-reason-you-love-that-blink-182-song-so-much"}
