{"authors":["Mark Little","Lazard Asset Management"],"date_download":"2018-10-30 22:40:51","date_modify":"2018-10-30 22:40:51","date_publish":"2018-07-31 00:00:00","description":"Big players in the music and video gaming industries who used to sell their product in a physical format have been reborn in the digital age. The music industry has turned around to digitalization, while the video game industry started offering more features for purchase.","filename":"data/vaneerConsumption/MusicvideogamingindustriesHowdigitalrisechangedprofitability.json","image_url":"https://amp.businessinsider.com/images/5b60b292b354cd37008b4909-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_music-video-gaming-industries-how-digital-rise-changed-profitability-2018-7_1540939251.html","title":"Music, video gaming industries: How digital rise changed profitability","title_page":"    Music, video gaming industries: How digital rise changed profitability - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"REUTERS/Ina Fassbender\nInvesting In a Time of Digital Dragons\nWe all know the digital disruption story now. Along comes cavalier new entrant wearing the cloak of new technology, slashing prices and delivery times and destroying ancient business models. But it's not only the cavaliers who are enjoying the benefits of a new world in which everyone is connected at high speed, all the time. Big players in the music and video gaming industries who used to sell their product in a physical format - vinyl, cassette, shiny disc - have been reborn in the digital flames, and this is in turn affecting how investors are looking at this once volatile market.\nMusic- An Industry on The Rise\nThe music industry has maybe seen the greatest turnaround in its fortunes. From its 2000 high on the back of a boom in the new CD technology, industry sales declined relentlessly for a decade, halving by 2014. Digital distribution was the culprit. The spread of mp3 technology saw every song ever recorded become a small compressed file, easy to transfer from computer to computer.\nPiracy hit the industry hard, and the apparent white knight of iTunes turned out to be a false friend. Its saviour has been streaming. Here was a service that for $10 a month, gave you access to the entire past and present of musical history, streamed to your digital device in real time via wifi or high-speed mobile connection. As the service improved, customer take-up at Spotify and its peers accelerated dramatically, drawing a reluctant Apple into the fray in 2015. Amazon and others have followed. In 2016 the industry grew for the first time since 2000, and in 2017, it was up by 8%. Spotify listed on the NYSE recently and is currently valued at over $30bn.\nFor music labels, the benefit has been greater than just a return to growth. Profitability is higher, as digital delivery removes physical costs of product, transportation and inventory write-offs. Retailer margin is replaced with the margin of the streaming provider, but there are now competing platforms rather than the monolithic iTunes, and only three big music labels to supply them, so the balance of negotiating power is more equitably split. But maybe even more important, the revenues become much more steady and predictable, and much less dependent on the latest greatest hit band. As such, the industry has gone from declining, volatile and barely profitable, to one that is growing, much more predictable, and increasingly profitable.\nDigital Connectivity Transforming Video Games\nMy sons love FIFA, the world's leading football computer and video game. However, they no longer play with each other, but with strangers matched up globally via online connections. When they're not trading players in Ultimate Team, they're building online football careers from apprenticeship up. Ominously, small ongoing charges for 'Coins' have started appearing on my bills.\nTheir FIFA obsession tells the story of how digital disruption has affected video game companies as well. Historically, these companies were very dependent on a small number of big hits, sold mainly straight after launch, with attendant volatility amplified by the cycle of new gaming console releases. A disappointing new game or delay to a key title would periodically send the share price crashing.\nHistorically, a customer would simply buy the game, play it solo until he or she had exhausted its possibilities and thrill, then buy another one. Today that same customer will enter an almost infinite world, frequently updated and expanded by the game's makers, and with every gaming experience different, as it now involves interactions with a large and diverse online community of players. As a result, gamers now play these games for much longer.\nIn addition, while playing the game they are now offered a variety of features for purchase. These features might include new funky costumes for their characters, shortcuts to better weapons or access to new areas. These have proved hugely popular and steady daily and monthly purchases can double the revenue from a console game release over time. This innovation has been widely adopted by makers of games for mobile devices, where the dominant business model today is a game that is free to download and play, but with many opportunities to upgrade, customize and progress through the game. While console games have not yet become free-to-play, the worlds are converging.\nFor the gaming companies, the benefits of connectivity go even further. As with music, the majority of gamers are no longer buying the likes of Assassins Creed in a physical format, but simply downloading the game onto their console. Naturally, this is much more profitable than the sale of a physical CD game. In addition, it allows much easier sale of back catalogue games. With digital delivery a $3 game can be very profitable, even in Emerging Markets, which might have struggled to afford a more expensive product.\nPut all these factors together and you get a video game industry that has been transformed. Revenues are not only growing but have become much less volatile as franchises endure and as the share of old games and in-game sales rises relative to the share of new games. Meanwhile, profitability has been rising rapidly, driven by digital delivery and the increasing share of back catalogue sales, much like in the music industry. Unsurprisingly, the companies themselves are becoming much more highly valued by the stock market.\nInvestors Should Take Heed\nMy job is to run investment portfolios focused on companies with sustainably high, or improving, financial productivity, trading at attractive valuations. Historically, I avoided investing in the music industry or the video game industry as they were volatile industries, with fading financial returns. Yet today, these businesses are seeing revenues that are not only growing fast, but becoming much more predictable, and often much more profitable. Company valuations have started to follow the sharp improvement in business quality and outlook. I have been thinking about these industries in a completely different way, and some of the portfolios than I manage are invested in a number of companies exposed to this trend. The digital revolution will continue to push profitability in both the music and the video game industry, so investors should watch this market with a renewed, digital-focused, view.\nMark Little is a managing director and portfolio manager at Lazard Asset Management.","url":"https://www.businessinsider.com/music-video-gaming-industries-how-digital-rise-changed-profitability-2018-7"}
