{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 20:30:27","date_modify":"2018-10-30 20:30:27","date_publish":"2017-04-12 13:31:22","description":"For years, Egyptian Copt Michel Fahmy could hear a Muslim preacher invoking God's wrath on Christians in sermons blared over loudspeakers.","filename":"data/vaneerConsumption/MuslimAntiChristianIncitementRisesinCrisisTornEgypt.json","image_url":"https://media.breitbart.com/media/2016/11/muslim-bro.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_04_12__1540931427.html","title":"Muslim Anti-Christian Incitement Rises in Crisis-Torn Egypt","title_page":"Muslim Anti-Christian Incitement Rises in Crisis-Torn Egypt","title_rss":"NULL","source_domain":"breitbart.com","text":"CAIRO (AFP) – For years, Egyptian Copt Michel Fahmy could hear a Muslim preacher invoking God’s wrath on Christians in sermons blared over loudspeakers from a mosque near his home.\nThe radical message, he says, is a reason for jihadist attacks on his minority like the twin bombings of churches on Sunday that killed 45 people.\nSunday’s attacks followed a December 11 suicide bombing in a Cairo church. The Islamic State group claimed responsibility for all three.\n“In mosques there are prayers to harm Christians,” says Fahmy, referring to Friday prayer sermons in which some preachers lead congregations in imprecations against Islam’s “enemies”.\n“They incite to violence, youths are being filled with hatred against us and acting on it,” says the 50-year old who runs a souvenir shop in Cairo.\n“It concerns us all. It leads to terrorism and to Christians being targeted,” he adds.\nThe shock from the Palm Sunday attacks was palpable on the faces of Coptic passersby doing their Holy Week shopping, as they passed by the wooden crucifixes and statues of Christ and Mary lining Fahmy’s store front.\n“Society does not teach youths that Muslims and Copts are brothers and of the same nation, upbringing plays a big role” he says.\nSome Copts point to the school system, where Muslims and Christians attend different religious classes.\n“The problem starts at school where children are treated differently,” says Lillian Anis, 23, who works in a clothing store.\n“In school some refused to speak to me because I was a Christian,” she adds.\nCoptic Christians have also long complained of radical discourse in some mosques and on Islamic satellite channels.\n-‘Incitement everywhere’-\nSeveral Coptic Christians told AFP they had heard similar messages in Friday sermons or on Islamic television channels.\nPresident Abdel Fattah al-Sisi has repeatedly urged Cairo’s Al-Azhar, the prestigious Sunni Muslim institution, to “modernise religious discourse.”\nFollowing Sunday’s bombing, he said a committee would be formed to tackle the issue.\nMany of the Islamic satellite channels in Egypt that broadcast criticisms of Christians had been closed after the military ouster of Islamist president Mohamed Morsi in 2013.\nThe religious endowments ministry which oversees mosques has also cracked down on unlicensed preachers and mosques, and picks the weekly topic for Friday sermons nationwide, to ensure any potentially subversive political content is avoided.\nSectarian unrest in Egypt had increased since the 1970s when president Anwar Sadat was seen as empowering Islamists over his socialist opponents.\nThe violence usually revolved around rumours of Christian-Muslim love affairs or reports that Christians were building churches.\nJihadists have also targeted Christians before the recent bombings, with a suicide bomber blowing himself up outside a Coptic Church in Alexandria in 2011.\nSome Islamist extremists look down on Christians as second-class citizens.\nLaw student Abram Anis says the extremists are “brainwashed by the religious incitement they hear against Christians everywhere.”\nThe incitement intensified after Morsi’s ouster, which led to a crackdown that killed hundreds of his supporters and unleashed a jihadist insurgency that has left hundreds of policemen and soldiers dead.\nMorsi’s overthrow was announced by then army chief Sisi, flanked by Coptic Pope Tawadros II and Muslim religious leaders and politicians.\nThe Islamists singled out the Christians for blame, and following the deadly dispersal of pro-Morsi camps in Cairo on August 14, 2013 attacked dozens of Coptic properties across the country.\nSunday’s attacks brought home the dangers of the incitement to the Christian minority, which makes up about 10 percent of Egypt’s 90 million people.\n“I’m afraid for my daughter — I can’t stop worrying about it,” says Hala Bushra, clasping the hand of her five-year-old.","url":"https://www.breitbart.com/middle-east/2017/04/12/anti-christian-incitement-rises-crisis-torn-egypt/"}
