{"authors":["Andrew Court For Daily Mail Australia"],"date_download":"2018-10-23 01:42:43","date_modify":"2018-10-23 01:42:43","date_publish":"2017-04-26 12:16:11","description":"17-year-old contestant Brittania Clifford-Pugh auditioned on Wednesday night's episode of the show  and shared a 'powerful message'.","filename":"data/vaneerConsumption/MuslimteeninspiresVoicecoacheswithpowerfulmessage.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/11/3F9F1F3700000578-0-image-a-19_1493204149825.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4447282_Muslim-teen-inspires-Voice-coaches-powerful-message_1540258963.html","title":"Muslim teen inspires Voice coaches with powerful message","title_page":"Muslim teen inspires Voice coaches with powerful message | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"On Wednesday's nights emotional episode of The Voice, 17-year-old Brittania Clifford-Pugh took to the stage to audition for the singing competition.\nAnd the Toowoomba teen, who is a practicing Muslim, inspired the superstar coaches with both her vocal abilities and her 'powerful message'.\n'I'm really here because I want to crush some stereotypes,' Brittania told the panel.\n'Crushing stereotypes': 17-year-old contestant Brittania Clifford-Pugh auditioned on Wednesday night's episode of the show and shared a 'powerful message'\n'Just because you look a certain way, you're a certain faith or you come from somewhere, or you believe something, it doesn't have to change the fact that you're an artist and a musician,' the contestant continued.\nKelly Rowland called the singer's message 'powerful', while Boy George added that it was 'beautiful'.\nBefore taking to the stage, Brittania revealed why the blind audition format of the show appealed to her.\n'Beautiful':\" Boy George was impressed with the Toowoomba teen and her message\n'I've come to do a blind audition because it allows me to be, like, immediately equal with everybody else,' she stated.\nAnd she managed to impress with her cover of Taylor Swift's 'Safe and Sound' turning the chair of Boy George.\n'It allows me to be immediately equal with everybody else': Brittania was impressed with the blind auditions process\nSupport: Brittania's family were on hand to watch her audition for the four coaches\nMeanwhile, there was no shortage of drama on the episode, with rivalries between the superstar coaches heating up.\n18-year-old Sally was the first contestant to take the stage, showing off her musical chops with a heart-wrenching ballad.\nBoth Kelly and Boy George turned their chairs, with the two international coaches pitching off against one another for the first time.\nA new feud? Kelly faced off against Boy George for contestant Sally\nGeorge argued that he was the best for Sally, telling the teen, 'We can break Australia's heart together'.\nBut fireworks erupted when Kelly started to plead her case, with George stating, 'Just back off and sit down!'\nWith an undecided Sally standing on the stage yet to make her pick, George humorously began singing Kelly's Destiny's Child smash, 'Say My Name'\nWinner! Sally picked the 80s pop icon as her mentor\nIt was convincing enough for Sally, who picked the 80s pop icon, causing Kelly to sink back in her chair in defeat.\n'She hates me!' George said of Kelly, who seemed visibly upset at losing out.\n19-year-old law student Fasika arrived at the audition accompanied by her family, including her skeptical father, who hoped that the teenager would stick to her studies, rather than showbiz.\nSwapping study for showbusiness? Law student Fasika showed off her singing chops, turning two chairs\nThe patriarch told host Sonia Kruger that in Ethiopian culture working in entertainment was for a lower class of people.\n'Even up to now he says 'Study, study, study'', Fasika said.\nThe teenager turned the chairs of Delta and Boy George, with her showbiz future looking bright.\nHowever, Kelly was left devastated by her decision not to turn around for Fasika, butting her head on the buzzer in regret.\nDamn! Kelly was left devastated by her decision not to turn for Fasika, who ended up on Delta's team\nRegret: Kelly couldn't contain her upset\nNew Zealand-born contestant Arthur got the judges excited as he took to the stage , with infamously-fussy coach Seal immediately turning for the soul singer.\nThe episode ended on an explosive note when 30-year-old singer Annalisse arrived for her audition.\nMesmerising: Annalisse turned all four chairs with her powerful vocals\nThe brunette turned all four chairs with her mesmerising version of Bonnie Raitt's 'I Can't Make You Love Me', leading to a squabble between the superstars.\nSeal, Kelly, Boy George and Delta all plead their case to Annalisse, before she eventually decided to settle on the 'Kiss From A Rose' crooner.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4447282/Muslim-teen-inspires-Voice-coaches-powerful-message.html"}
