{"authors":["Dr. Phyllis Chesler"],"date_download":"2018-10-30 18:41:50","date_modify":"2018-10-30 18:41:50","date_publish":"2014-12-18 16:08:23","description":"The Supreme Court has just agreed to hear a case concerning the rights of a woman to wear hijab, a headscarf, while working at Abercrombie and Fitch. This |","filename":"data/vaneerConsumption/MuslimWomenSueinUSCourtsforRighttoWearIslamicGarbontheJob.json","image_url":"https://media.breitbart.com/media/2014/12/afghan-women-burqa-reuters-670.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2014_12_18__1540924910.html","title":"Muslim Women Sue in US Courts for Right to Wear Islamic Garb on the Job","title_page":"Muslim Women Sue in US Courts for Right to Wear Islamic Garb on the Job | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Supreme Court has just agreed to hear a case concerning the rights of a woman to wear hijab, a headscarf, while working at Abercrombie and Fitch. This case began in 2008, in Tulsa, Oklahoma on behalf of then seventeen-year-old Samantha Elauf and is known as Equal Employment Opportunity Commission vs Abercrombie and Fitch Stores, Inc.\nFrance banned the burqa (a head, face, and full body covering). To do so in a religion-neutral way, they banned “face masks” and all other religious insignia. France also banned hijab (a headscarf) in certain settings such as public schools for both staff and students and for those who “deliver public services.”\nIn 2014, the European Court of Human Rights upheld the French burqa ban. Other governments (Denmark, Germany, Turkey, Russia, China) have also banned the headscarf in school or in general. Yes, even Turkey– although, paradoxically, it has begun to force more children into religious schools where hijab is mandatory.\nIn this case, it is our own federal government which has brought the suit against Abercrombie and Fitch, Inc.\nAt least ten “friends of the court” briefs have been submitted by religious and civil rights organizations, including the American-Arab Anti-Discrimination Committee, the American Jewish Committee, the National Jewish Commission on Law and Public Affairs, the Becket Fund for Religious Liberty, and the Council on American-Islamic Relations aka the Muslim Brotherhood in America and the un-indicted co-conspirator in the Holy Land Foundation lawsuit.\nThe issue is framed in this way:\nWhether an employer can be liable under Title VII of the Civil Rights Act of 1964 for refusing to hire an applicant or discharging an employee based on a ‘religious observance and practice’ only if the employer has actual knowledge that a religious accommodation was required and the employer’s actual knowledge resulted from direct, explicit notice from the applicant or employee.\nSimilar right to wear hijab cases have been brewing all across America for the last decade.\nIn 2004, the U.S. Justice Department supported a lawsuit brought on behalf of a sixth grade student in Oklahoma who wanted to wear hijab in her public school. That same year, the school reviewed their policy, amended their dress code, paid the student an undisclosed sum, and allowed her to attend classes wearing hijab.\nIn 2006, in a small claims matter in Michigan, a Muslim woman, Ginnah Muhammed, refused to take off her face mask (niqab) while she testified. Judge Paul Paruk dismissed her case. Muhammed sued, and the ACLU backed her. They argued for a “religious exception” to courtroom attire. Although Muhammed’s small claims case was against a car rental agency, here is what Michael Steinberg, legal director of the ACLU of Michigan stated:\nThe Michigan Supreme Court should not slam the door of justice on a category of women just because of their religious belief…Under the proposed rule, women who are sexually assaulted do not have their day in court if they wear a veil mandated by their religion.\nSexual assault was not at issue nor was the victim afraid that testifying might lead to her death. Leave it to the ACLU to almost always get it wrong.\nOn June 17, 2009, the Michigan Supreme Court, in a 5-2 vote, ruled that a Judge had the power to “require witnesses to remove head or facial covering as (the witness) was testifying.”A Judge has the right to see a witness’s “facial expressions” to determine her “truthfulness”while she testifies.\nBoth the American Civil Liberties Union (ACLU) and the Council on American-Islamic Relations (CAIR) have gone to court in Florida (2002), California (2005), Michigan (2008), and Oklahoma (2008) to fight for a Muslim woman’s right to cover her hair or face—whether it is while being photographed for a driver’s license or for a police mug shot or while working at McDonald’s or at Abercrombie Kids.\nIn 2007, CAIR wrote a letter on behalf of a Muslim woman in Georgia who refused to remove her headscarf in order to enter a courtroom to plead “not guilty” to a traffic ticket.\nReligious Muslims are outraged that Christians can wear crucifixes, nuns and priests can wear habits, Jews can wear skullcaps or wigs and head coverings, Sikhs can wear turbans, Hindus can wear veils and saris, but Muslims cannot wear hijab, burqas or niqab.\nThey have a point. The face mask (niqab) and the burqa (ambulatory body bag) mask all five senses and make human interaction impossible. But what’s wrong with hijab (a head covering)?\nOver the years, I have interviewed a number of religious Muslim women who are completely westernized, educated, modern, and certainly anti-Jihad. They “cover” their hair for religious, ethnic, and feminist reasons. It is a statement of “who they are” and what they believe in. This sometimes includes a desire to publicly signify a belief in God and to separate themselves from a secular, promiscuous world in which women dress provocatively.\nReligious people do not want the government telling them how to dress or limiting their religious practices. Many secular feminists have viewed Islamic “coverings” as either a Muslim woman’s religious right or as her culturally sanctioned expression of modesty. In addition, many progressives see the ban on the burqa (not to mention discrimination against hijab) as a form of “racial profiling,” or as “Islamophobic.”\nI am on record as calling for an American ban on the burqa (face mask, ambulatory body bag) as a violation of woman’s rights and a health hazard. Dr. Daniel Pipes is on record about the burqa being a national security risk. A head covering is more problematic. The Qu’ran mandates “modesty” for both men and women. Mullahs have interpreted the hadith as requiring women to cover their hair.\nHowever, some people fear that if America legally accepts hijab in the public square that doing so may represent the proverbial “nose of the camel.” Once the camel’s “nose” is permitted in the tent, soon enough, the demands for halal food, separate classes for boys and girls, separate swimming facilities, breaks for prayer, and the recognition of Muslim holidays in public, tax-funded public schools and in government employment may soon follow.\nSome counter-terrorism experts fear that permitting what is Arab and Islamic clothing on the job, at school, in the United States at this time in history may not be the same as allowing a nun, a priest, a rabbi, or a religious Jew or Sikh to wear a head covering. Why? Because no other religious ideology calls for supremacy over infidels or for violent Jihad against infidels and against other Muslims who do not adopt extremist views. None of the other religions mentioned views the state and religion as one or views non-co-religionists as “kafirs,” infidels, whom Muslims are supposed to dominate, tax, persecute, and convert via the sword. Islam is also the only religion among them in which believers are commanded to kill all those who leave the religion. In addition, since global Jihad is upon us, permitting head coverings at work may frighten or offend some customers and may not comport with the expected dress code on the job.\nI am not suggesting that any individual hijab-wearer would kill anyone. But neither will she necessarily oppose those who exercise such rights under Sharia law.\nThe Supreme Court will have to carefully balance the separation of religion and state; freedom of religion; the nature of public space and business bottom lines; and individual civil rights—over and against the meaning that the Islamic headscarf may have in such dangerous times.\nI eagerly await the oral arguments and the Supreme Court ruling.","url":"https://www.breitbart.com/national-security/2014/12/18/muslim-women-sue-in-us-courts-for-right-to-wear-islamic-garb-on-the-job/"}
