{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 18:40:52","date_modify":"2018-10-30 18:40:52","date_publish":"2016-02-08 18:23:05","description":"A new Muslim, hijab-wearing Barbie doll has taken Instagram by storm. |","filename":"data/vaneerConsumption/MuslimHijabBarbieBecomesInstagramStar.json","image_url":"https://media.breitbart.com/media/2016/02/Hijab-Barbie-etsy.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_02_08__1540924852.html","title":"Muslim Hijab Barbie Becomes Instagram Star","title_page":"Muslim Hijab Barbie Becomes Instagram Star | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A new Muslim, hijab-wearing Barbie doll has taken Instagram by storm.\nThe doll that has been a fashion icon for decades has recently undergone some transformations – different skin tones and body types – and now has appeared as “Hijarbie,” wearing the Muslim hijab.\nHaneefa Adam, who earned a Masters degree in pharmacology in the UK, says she was inspired to create the Hijarbie Instagram account after coming across the Barbie Style Instagram page.\n“I thought I had not seen Barbie dressed in a hijab before so I decided to open an Instagram account and dressed Barbie up in the clothes that I made,” Adam said, reports CNN. “I thought it was really important for a doll to be dressed like how I would be.”\nAdam contrasts the often scantily clad Western Barbie to her Hijarbie which she says is a “modest doll” — one that offers Muslim girls a role model to whom they can relate.\n“It has roots in my religion and cultural identity,” she added. “The way Barbie dresses is very skimpy and different and there’s nothing wrong with it. I just wanted to give another option for Muslim girls like me.”\nAccording to the news report, Hijarbie how has 19,400 followers on Instagram, and there have been many requests from throughout the world to purchase the doll.\nNevertheless, Adam says some comments she has received have viewed the hijab as a sign that Muslim women are “oppressed,” a notion that Adam denies and claims is a misconception.\n“People think that when Muslim women cover up they are forced to,” she said. “[The] majority of us are not.”\n“We want to cover up and express our religion,” she continued. “But a lot of Muslims don’t cover their hair and it doesn’t make them any less of a Muslim. I think this is a great platform to try and get the Muslim identity to the world and correct some misconceptions.”\nHowever, two Muslim women penned a December op-ed at the Washington Post in which they say the hijab campaign is intended to hide Islam’s sexist political agenda, and urged Americans to stand against Islam’s ideological oppression of women.\n“Journalists and media outlets must stop making the mistake of defining hijab as ‘headscarf,’ furthering a sexist propaganda campaign to equate the two,” wrote Asra Q. Nomani and Hala Arafa.\nThe two Muslim women noted:\nIn the name of ‘interfaith,’ well-intentioned Americans are getting duped by the agenda of Muslims who argue that a woman’s honor lies in her ‘chastity,’ pushing a platform to put a headscarf on every woman. Please do this instead: Do not wear a headscarf in ‘solidarity’ with the ideology that most silences us, equating our bodies with ‘honor.’ Stand with us instead with moral courage against the ideology of Islamism that demands we cover our hair.\nIn their op-ed, Nomani and Arafa argued that events such as “World Hijab Day” – during which non-Muslim women are invited to don the hijab in solidarity with Muslims – hides a political goal.\n“Muslim special-interest groups are feeding articles about ‘Muslim women in hijab‘ under siege,” the authors say. “Staff members at the Council on American-Islamic Relations [CAIR], which has pressed legal and PR complaints against U.S. companies including Disney World and Abercrombie & Fitch, have even called their organization ‘the hijab legal defense fund.’”\nA federal judge concluded in 2009 that “the government has produced ample evidence to establish the associations of CAIR … with Hamas” the jihad-group based in Gaza that shoots rockets in Israeli towns and communities. Since then, FBI leaders have sharply reduced any connection to the group, which has also been and has been declared a terrorist organization by the United Arab Emirates.","url":"https://www.breitbart.com/politics/2016/02/08/muslim-hijab-barbie-becomes-instagram-star/"}
