{"authors":["Raheem Kassam And Chris Tomlinson"],"date_download":"2018-10-30 18:34:06","date_modify":"2018-10-30 18:34:06","date_publish":"2016-01-19 10:55:37","description":"The Muslim Member of Parliament for Bradford West, Naz Shah, yesterday invited U.S. Presidential candidate Donald Trump to her constituency, at the peak |","filename":"data/vaneerConsumption/MuslimMPInvitedTrumpToVisitBradfordWhereMuslimsBeatChristianConvertsAndJUSTTWODAYSAfterABritishSoldierIsFoundBeatenBloodiedOnTheStreets.json","image_url":"https://media.breitbart.com/media/2016/01/nazbradford.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_01_19__1540924446.html","title":"Muslim MP Invited Trump To Visit Bradford, Where Muslims Beat Christian Converts, And JUST TWO DAYS After A British Soldier Is Found Beaten, Bloodied On The Streets","title_page":"Muslim MP Invited Trump To Visit Bradford, Where Muslims Beat Christian Converts, And JUST TWO DAYS After A British Soldier Is Found Beaten, Bloodied On The Streets | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The Muslim Member of Parliament for Bradford West, Naz Shah, yesterday invited U.S. Presidential candidate Donald Trump to her constituency, at the peak of the exchange of hubris during the parliamentary committee debate on banning the American business mogul.\nShe proclaimed before her fellow MPs: “I, as a Member of Parliament for Bradford West, would give an open invitation to Donald Trump to visit my constituency… the reason I’d give him an open invitation to visit my constituency is I’d take him to the synagogue, I’d take him to the church, I’d take him to the mosques, I’d invite him for a curry – we are the curry capital of Britain.”\nBut just this weekend, it was reported that a 20-year-old soldier had been discovered “robbed and beaten” in Sackville Street in the heart of Ms. Shah’s constituency.\nA Bradford council gritting team discovered the man on the ground near to the National Media Museum, his body and face severely beaten and bloody. He was taken to Bradford Royal Infirmary where he was diagnosed with several fractures and severe cuts to his face.\nWest Yorkshire Police reported that the soldier had been, “in bars in Sackville Street in the early hours of Saturday morning and then left alone to get a taxi home from the interchange. He appears to have been attacked while walking along the Prince’s Way towards the interchange and has also lost property in this incident, which is being investigated as a robbery.”\nAttacks in Bradford are not uncommon, and even attacks which fuel Trump’s statements that the UK has “no-go zones” have occurred as recently as November.\nBreitbart London reported a terrifying attack on a man in Bradford who was viciously beaten by Muslim men with pickaxes for the “crime” of converting to Christianity from Islam.\nNissar Hussain, a 49 year old father-of-six, was attacked outside his home by multiple hooded men and was taken to the very same Bradford Royal Infirmary as the young soldier attacked on Saturday. Hussain remarked that members of the large Bradford Muslim population, “call us scum and treat us like second class citizens.”\nMr. Hussain has told Breitbart London in an exclusive interview that a local Muslim shopkeeper threatened to behead him, claiming that he would do so were the pair not in the United Kingdom.\nNaz Shah MP was an active participant in yesterday’s parliamentary debate on whether or not to ban Donald Trump from the UK because of his past statements calling for Muslims to be temporarily barred from entering the United States until the country could in his words, “figure out what’s going on.”\nThese remarks came in relation to Islamic extremism in the wake of the San Bernardino shootings on December 2nd 2015 that took the lives of 14 civilians and the two attackers.\nA spokesman for Ms. Shah told Breitbart London: “Naz Shah MP is on parliamentary work and is not able to respond directly to your query at this time… I will bring this to the attention of Naz Shah MP on her return.”\nWhile Mr. Trump has not responded personally to either the invite by Ms. Shah or the debate about banning him from the UK, Sarah Molone, the executive vice president of Trump’s multi-million pound Turnberry golf course released a statement saying, “it is absurd that valuable parliamentary time is being wasted debating a matter raised as part of the American presidential election.”\nThe Independent newspaper’s Ashley Cowburn has also reported Ms. Shah’s invitation to Mr. Trump, but has not mentioned any of the incidents as reported above.","url":"https://www.breitbart.com/europe/2016/01/19/muslim-mp-invited-trump-to-visit-bradford/"}
