{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 18:46:41","date_modify":"2018-10-30 18:46:41","date_publish":"2015-01-09 04:46:01","description":"Muslim-raised actor Haaz Sleiman is set to portray Jesus Christ in National Geographic's upcoming television movie \"Killing Jesus.\"","filename":"data/vaneerConsumption/MuslimRaisedActoronPlayingJesusIslamBelievesThatJesusIsaProphet.json","image_url":"https://media.breitbart.com/media/2015/01/Haaz-Sleiman-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_01_08__1540925201.html","title":"Muslim-Raised Actor on Playing Jesus: 'Islam Believes That Jesus Is a Prophet'","title_page":"Muslim-Raised Actor on Playing Jesus: 'Islam Believes That Jesus Is a Prophet' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Muslim-raised actor Haaz Sleiman is set to portray Jesus Christ in National Geographic’s upcoming television movie “Killing Jesus,” an adaptation of Bill O’Reilly’s bestselling 2013 book Killing Jesus: A History.\nSpeaking at the Television Critics Association press tour on Wednesday, Sleiman told TheWrap that not only does his faith not preclude him from playing Christianity’s central figure, the two religions are not as different as they seem.\n“Islam believes that Jesus is a prophet, and they honor him – highly – and they respect him and they follow his teachings,” Sleiman told the outlet. “So, for me, as somebody who was raised Muslim, it is an honor to actually play Jesus, just because of that.”\n“I’m going to sound cheesy right now: the first thing I thought was ‘love,'” Sleiman told Entertainment Weekly about his first thoughts after receiving the coveted role. “I really just felt love in the moment. He has influenced me heavily prior to getting this part and there’s nothing more powerful than that, and that’s what’s going to lead me through the whole journey.”\nThe filmmakers behind Killing Jesus told the Independent that the movie will be “different in a major respect” from other TV movie adaptations.\n“This is the behind-the-scenes story of the life and death of Jesus,” screenwriter Walon Green said. “A non-Christian viewer will really like this film. They can immerse themselves in the human story of phenomenal guy Jesus and what he is and what he comes from – his roots.”\nKilling Jesus, a three-hour special event, will reportedly premiere in spring 2015 on National Geographic. The film also stars Kelsey Grammer as King Herod and Stephen Moyer as Pontius Pilate. Ridley Scott and David Zucker will executive produce.","url":"https://www.breitbart.com/entertainment/2015/01/08/muslim-raised-actor-haaz-sleiman-set-to-play-jesus-in-tv-movie/"}
