{"authors":["Breitbart Tv"],"date_download":"2018-10-30 18:40:33","date_modify":"2018-10-30 18:40:33","date_publish":"2016-08-04 19:03:22","description":"A Fox 6 report says a Muslim woman in Indiana was asked to leave a Family Dollar store for wearing full Islamic garb, and the woman recorded the incident | Video","filename":"data/vaneerConsumption/MuslimWomanKickedFromFamilyDollarStoreforWearingIslamicGarb.json","image_url":"https://media.breitbart.com/media/2016/08/muslim-woman1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/video_2016_08_04__1540924833.html","title":"Muslim Woman Kicked From Family Dollar Store for Wearing Islamic Garb","title_page":"Muslim Woman Kicked From Family Dollar Store for Wearing Islamic Garb | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A Fox 6 report says a Muslim woman in Indiana was asked to leave a Family Dollar store for wearing full Islamic garb, and the woman recorded the incident on video.\nThirty-two-year-old Sarah Safi says she had just entered a Gary, IN Family Dollar store to purchase some charcoal when she was told to uncover her face or leave.\n“I might have made it 10 steps into the store and I hear the lady behind the counter say, ‘Ma’am, you need to take that off your face or you need to leave my store,’” Safi told reporters.\nThat is when Safi pulled out her phone to record the exchange. She told the employee, who said she was the manager, that she was wearing a niqab and a hijab for religious purposes.\nThe employee responded, “I understand, but you have to understand, too, this is a high crime area and we get robbed a lot. You need to remove that from your face or remove yourself from the store.”\nShe was then told by the manager that if she did not leave, the police would be called.\nRather than having her children see her confronted by the police, Safi decided to leave.\nSafi said she just wants to sit down with the manager and talk to her about her beliefs.\nFamily Dollar has not released a statement regarding the incident, and the manager refused to speak on camera.\nFollow Breitbart.tv on Twitter @BreitbartVideo","url":"https://www.breitbart.com/video/2016/08/04/muslim-woman-kicked-from-family-dollar-store-for-wearing-islamic-garb/"}
