{"authors":["Lia Beck"],"date_download":"2018-10-31 01:46:58","date_modify":"2018-10-31 01:46:58","date_publish":"2018-09-06 15:03:25","description":"The idea of a \"mustard pizza\" sounds terrifying. I mean, just picture tomato sauce being replaced with a whole bunch of mustard. Bleh! But, really, mustard combined with bread, cheese, and veggies and/or meat isn't usually \"bleh\" at all — it's a…","filename":"data/vaneerConsumption/MustardPizzaIsAThingThatExistsTwitterHasThoughts.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/6/ec86d593-72d3-444f-965c-4d50dad079f6-b6c8e680-8c63-4e9b-a12f-32821a27db9c-getty-972622958.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_mustard-pizza-is-a-thing-that-exists-twitter-has-thoughts-11771759_1540950418.html","title":"Mustard Pizza Is A Thing That Exists & Twitter Has Thoughts","title_page":"Mustard Pizza Is A Thing That Exists & Twitter Has Thoughts","title_rss":"NULL","source_domain":"bustle.com","text":"The idea of a \"mustard pizza\" sounds terrifying. I mean, just picture tomato sauce being replaced with a whole bunch of mustard. Bleh! But, really, mustard combined with bread, cheese, and veggies and/or meat isn't usually \"bleh\" at all — it's a sandwich. Well, mustard pizza really does exist, and it's even less like a normal pizza than you might be imagining. Are you ready to form a very strong opinion about something you've never heard of until now? Let's begin.\nAs shown in a video from Food Insider, the mustard pizza at hand is from a New York City pizza place called Lions & Tigers & Squares, which sells Detroit-style pizza. Before we go any further, you should know that Detroit-style pizza is square, has a very thick, crispy crust, is cooked in a pan, and is made using brick cheese. So, the base of the mustard pizza is already more bread-y than a traditional pizza.\nAs for what's on the mustard pizza, it doesn't have your usual toppings, either. The Lions & Tigers & Squares pie is topped with corned beef, sauerkraut, and brick cheese, making it more like a Reuben/pizza hybrid... but with a lot of mustard. It's at least more like a deli sandwich in a pizza shape, but with cheese a lot of people haven't even heard of.\nEven if this is all sounding good to you, the sheer amount of mustard might be a turn-off for some. There is a reason why this is called mustard pizza rather than, say, corned beef pizza, and it's because there's a lot of mustard involved. Just look at the video! They are going through Gulden's spicy brown like there's no tomorrow!\nThere's also another reason it's called mustard pizza (aside from that it's catchy and got people talking). As explained in Food Insider's video by one of the shop's owners, the idea behind the pizza was born at Papa's Tomato Pies in Trenton, New Jersey. According to legend, a drunk customer tried to order a mushroom pizza, but it sounded like he said \"mustard pizza\" with his slurring, so the shop gave him a pizza that had both mustard and tomato sauce. The Lions & Tigers & Squares guys took this idea and... well, made something that sounds entirely different, but that still involves a lot of mustard. The Papa's Tomato Pies mustard pizza is, according to their site, \"a local favorite with a thin layer of mustard between the crust and the cheese, topped with tomato sauce.\"\nUnsurprisingly, people of the internet who have not tried the mustard pizza have strong opinions:\nWhile it's fine to talk about whether this looks good or not, it seems the real question here is whether or not this is a pizza. Like with the great \"is a hot dog a sandwich\" debate, we have to ask ourselves what makes something a pizza. Is this a pizza? Is it an open-faced sandwich? Should the Papa's Tomato pizza be the only one really considered mustard pizza? Is that entirely too much mustard regardless of what we're calling this thing? (Yes. Yes, it is.)","url":"https://www.bustle.com/p/mustard-pizza-is-a-thing-that-exists-twitter-has-thoughts-11771759"}
