{"authors":[],"date_download":"2018-10-22 21:04:54","date_modify":"2018-10-22 21:04:54","date_publish":"2016-01-28 06:35:25","description":"President Thein Sein hailed the \"triumph\" of Myanmar's transition of power Thursday, in a last address to a military-dominated parliament before it makes way...","filename":"data/vaneerConsumption/Myanmarpresidenthailstriumphofdemocratictransition.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7g5kd-2vdWmEltwXfba0ce28e6324f6016-833_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3420352_Myanmar-president-hails-triumph-democratic-transition_1540242294.html","title":"Myanmar president hails 'triumph' of democratic transition","title_page":"Myanmar president hails 'triumph' of democratic transition | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Myanmar president hails 'triumph' of democratic transition\nPresident Thein Sein hailed the \"triumph\" of Myanmar's transition of power Thursday, in a last address to a military-dominated parliament before it makes way for a historic new legislature led by Aung San Suu Kyi's pro-democracy party.\nThe Southeast Asian nation, choked for decades under junta rule, is on the cusp of a remarkable political transition after Suu Kyi's National League for Democracy (NLD) thundered to victory in November elections.\nMyanmar's people are hoping her government can reboot a country eviscerated by army rule that battered the economy and repressed dissent.\nMyanmar President Thein Sein (R) waves as he leaves parliament after giving his final farewell speech in Napyidaw on January 28, 2016 ©Aung Htet (AFP)\n\"Even though there were difficulties and challenges, we were able to bring a democratic transformation eventually,\" Thein Sein said addressing the military-stacked legislature for the last time.\n\"This is a triumph for all Myanmar's people,\" he added.\n\"As everyone knows, for over five decades we were far away from a multi-party democratic system,\" he said.\nThein Sein, who under drawn-out handover rules retains his post until the end of March, has been a key player in Myanmar's astonishing reform process so far.\nHe was among a host of military figures who shed their uniforms to form a government in 2011.\nInitially that government was viewed with suspicion as a civilian front for the army's continued domination of the country from behind the scenes.\nWhile the army retains major clout -- a quarter of parliamentary seats are ringfenced for unelected soldiers -- sweeping political and economic reforms since 2011 have surprised the international community and encouraged a flood of foreign investment.\nThey also culminated in November's polls which passed peacefully and fairly and saw Suu Kyi's party scoop nearly 80 percent of elected seats in the national parliament.\n- 'Better foundation?' -\nSuu Kyi, 70, now has the weight of the nation's expectations on her shoulders, after a decades long struggle against junta repression.\nObservers say the former political prisoner is seeking to find ways to placate a twitchy military, which maintains huge political and economic sway.\nThe Nobel laureate faces a formidable challenge in an impoverished nation, blighted by corruption and torn by ethnic minority civil wars and religious divisions.\nShe is barred from the presidency by the junta-era constitution that many believe was designed specifically to exclude her, but has vowed to rule through a proxy, who is yet to be named in public.\nThe new NLD MPs, many of whom are political novices from a diverse range of professions, will take their seats on February 1 following the final day of a lame duck session by the outgoing parliament on Friday.\nThein Sein's party was all but annihilated in the legislature, but the outgoing leader said he had not launched the reforms in order to hold on to power.\n\"During the last five years we have built a better foundation for the next government, who won the 2015 election. I did not do this with the expectation of being a second term president,\" he said.\nHe listed a fragile peace process, better access to health care and education and greater freedom of information as his main reforms.\nBoth he and powerful army chief Min Aung Hlaing have pledged to support the transition towards democracy in the face of Suu Kyi's popular mandate.\nA flurry of political plays have dominated the days leading up to the handover, leaving analysts struggling to decipher their meaning in a country where decision-making has long been made in secret.\nChair of the National League for Democracy (NLD) Aung San Suu Kyi has the weight of the nation's expectations on her shoulders after a long struggle against junta repression ©Aung Htet (AFP)\nMyanmar is on the cusp of a political transition after Suu Kyi's National League for Democracy (NLD) thundered to victory in November elections ©Ye Aung Thu (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3420352/Myanmar-president-hails-triumph-democratic-transition.html"}
