{"authors":[],"date_download":"2018-10-23 03:37:05","date_modify":"2018-10-23 03:37:05","date_publish":"2017-03-16 14:43:14","description":"Myanmar should close bleak camps where tens of thousands of displaced Rohingya Muslims have been trapped for nearly five years, a commission led by former UN...","filename":"data/vaneerConsumption/MyanmarmustallowRohingyatoleavecampsAnnancommission.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/14/wire-228989-1489675397-701_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4320568_Myanmar-allow-Rohingya-leave-camps-Annan-commission_1540265825.html","title":"Myanmar must allow Rohingya to leave camps: Annan commission","title_page":"Myanmar must allow Rohingya to leave camps: Annan commission | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"More than 120,000 Rohingya Muslims have languished in camps since they were driven from their homes by sectarian unrest that engulfed western Rakhine State in 2012\nMyanmar should close bleak camps where tens of thousands of displaced Rohingya Muslims have been trapped for nearly five years, a commission led by former UN chief Kofi Annan said Thursday.\nMore than 120,000 Rohingya have languished in camps since they were driven from their homes by sectarian unrest between Buddhists and Muslims that engulfed western Rakhine State in 2012.\nMost are not allowed to leave the squalid displacement camps where they live in piecemeal shelters with little access to food, and denied access to basic education and healthcare.\nMyanmar's de facto leader Aung San Suu Kyi last year appointed Annan to head a commission tasked with healing long-simmering divisions between Buddhists and Muslims in Rakhine.\n\"The commission calls for a plan to close all IDP camps in Rakhine state,\" Ghassan Salame, a member of the body, told reporters at the launch of the body's interim report.\nThe report also called for the government to ensure \"security and livelihood opportunities at the site of return/relocation\" for those leaving the camps, including by building new houses.\nRohingya should also be given a transparent path to becoming citizens and restrictions on the movements of those who already have it should be lifted, it added.\nMyanmar has long faced international condemnation for its treatment of the Rohingya, who many in the Buddhist majority reject as illegal immigrants from Bangladesh.\nThe issue has reached boiling point in recent months after the army launched a bloody crackdown in the north of Rakhine after deadly attacks on several police border posts in October.\nUN investigators who interviewed escapees in Bangladesh have accused Myanmar's security forces of responding with a campaign of murder, gang rape and arson that may amount to genocide.\nRights envoy Yanghee Lee called the on UN to launch its highest-level probe into the violence, which she said may be part of a government campaign to drive the Rohingya from the country.\nBut a draft resolution tabled by the UN Human Rights Council stopped short of calling for a Commission of Inquiry into the violence.\nSalame said the Annan commission backed calls for an independent investigation into the violence in northern Rakhine in its report, but said anything further would be beyond the body's remit.\nIt identified three initial camps to close -- one housing over 200 Rohingya along with two others that are home to Buddhist Rakhines and Kaman Muslims who were also displaced in the 2012 violence.\nSuu Kyi's office welcomed the report and said it would implement the \"large majority of recommendations\" without giving more details.","url":"https://www.dailymail.co.uk/wires/afp/article-4320568/Myanmar-allow-Rohingya-leave-camps-Annan-commission.html"}
