{"authors":[],"date_download":"2018-10-22 23:18:02","date_modify":"2018-10-22 23:18:02","date_publish":"2016-01-29 11:00:27","description":"Belting out the lyrics \"dreams may come true\" in a jaunty a capella, a former top general serenaded lawmakers Friday as Myanmar's long-dominant military elit...","filename":"data/vaneerConsumption/MyanmararmyMPsleaveparliamentonkaraokehighnote.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h7a2-4PuZeKVXE7cd9005b2c8768f24fe-326_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422206_Curtain-falls-Myanmars-army-led-parliament_1540250282.html","title":"Myanmar army MPs leave parliament on karaoke high note","title_page":"Myanmar army MPs leave parliament on karaoke high note | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Myanmar army MPs leave parliament on karaoke high note\nBelting out the lyrics \"dreams may come true\" in a jaunty a capella, a former top general serenaded lawmakers Friday as Myanmar's long-dominant military elite marked their exit from parliament with song and dance.\nSwept from their seats by Aung San Suu Kyi and her National League for Democracy (NLD) party, outgoing army-backed MPs took a good-natured approach to their historic power transfer via a karaoke machine.\nParliament welcomed the handover to the Nobel laureate's MPs by throwing a party after its closing session Friday afternoon, complete with energetic dance routines by ethnic minority MPs and a host of voluble vocalists.\nChairperson of the National League for Democracy (NLD) Aung San Suu Kyi attends the last day of the Union parliament regular session in Naypyidaw on January 29, 2016 ©Ye Aung Thu (AFP)\n\"May you be healthy/May you be strong/ May you be joyful all your life long,\" crooned parliament speaker Shwe Mann, the junta's former number three who has become an unlikely ally of Suu Kyi's in the legislature despite his erstwhile position as leader of the rival ruling party.\n\"Dreams may come true,\" his English language song continued as he encouraged fellow MPs old and new to sing along to a tune he said he learned at school.\nSuu Kyi had a front row seat and kicked off the festivities with a speech of warm congratulations to the outgoing lawmakers for paving the way for her party to take power.\nThe Union Solidarity and Development Party (USDP), an army proxy stuffed with former generals that has run Myanmar since 2011, has sought to respond with grace to stunning victory for Suu Kyi and her party in the November polls.\n- 'The Lady' did not sing -\nIts camaraderie is in stark contrast to the repression that characterised the junta years when Suu Kyi's party saw its 1990 election win snatched away by the generals and thousands of democracy activists faced prison and bloody crackdowns.\n\"The most important thing is unity. So I wrote a song about that, even though I have been very busy recently,\" Saw Hla Tun, a lower house USDP MP, told AFP before the event.\nOther top performers included upper house speaker Khin Aung Myint, a USDP heavyweight who regaled parliament with jokes in his parting speech Friday, even complimenting \"The Lady\" as Suu Kyi is known in Myanmar on her looks.\nEven the scores of unelected army MPs, who prop up the military's continuing political clout with a quarter of parliament seats, were not left out of the festivities.\nOne uniformed soldier took to the stage to sing a classic Myanmar song of chivalry and adventure, to the entertainment of the crowd.\nWhile the vast majority of new NLD lawmakers who will take their seats on Monday have no previous experience in parliament, the party does boast poets and a rapper among the diverse professions of its MPs.\nSome NLD members took to the stage Friday for a colourful dance performance by ethnic minority MPs.\nBut while the afternoon did draw to a genial close, it was not over when \"the Lady\" sung -- Suu Kyi did not put her musical talents on display.\nMyanmar's new parliament\nChairperson of the National League for Democracy (NLD) Aung San Suu Kyi attends the last day of the parliament's lower house regular session in Naypyidaw on January 28, 2016 ©Ye Aung Thu (AFP)","url":"https://www.dailymail.co.uk/wires/afp/article-3422206/Curtain-falls-Myanmars-army-led-parliament.html"}
