{"authors":[],"date_download":"2018-10-30 00:58:18","date_modify":"2018-10-30 00:58:18","date_publish":"2014-06-26 08:00:00","description":null,"filename":"data/vaneerConsumption/MyDayattheUnitedNations.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2014/06/UN_meeting_on_environment_at_General_Assembly.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540861098.html","title":"My Day at the United Nations","title_page":"My Day at the United NationsThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"It was my first visit to the United Nations building, and no doubt my last. Many times I had seen the forty-story, Le Corbusier-designed flat slab, but never had reason to go there. As we drove by taxi through the East River tunnel to Manhattan, I was reminded that Cuban exiles once launched a bazooka at the building to protest the presence of Che Guevara. That was in 1964—the good old days, one might almost say. The missile fell short and exploded in the East River. Guevara, a left-wing hero, was giving a speech at the time.\nThe New York Times reported:\nA single shell from the bazooka, a portable rocket launcher used by the Army, arced across the river from Queens and fell harmlessly about 200 yards from the shore. The blast sent up a geyser of water and rattled windows in the U.N. headquarters just as Major Guevara, Havana’s Minister of Industry, was denouncing the United States.\nGuevara “paused not a moment in his speech.” Later, strolling through the delegates’ lounge in his green fatigue uniform and highly polished boots, he said, “with a languid wave of his cigar, that the explosion has ‘given the whole thing more flavor.’” Less than three years later he was captured in Bolivia by forces assisted by the CIA and summarily executed. The leftist hero lives on in poster images.\nAt the time of the bazooka shot, another Cuban woman was apprehended with a big knife at the UN entrance. She vowed to kill Guevara if she could find him. So when I was there in May I was not surprised to find that entry involves various security checks.\nMy wife had been invited by a delegation from the Holy See to join a panel on the family and give a speech. So I tagged along. Outside we were met by Archbishop Vincenzo Paglia from Rome, president of the Pontifical Council for the Family. The UN was celebrating the “International Day of Families.” Plural, notice—just in case anyone might think same-sex marriage was out of bounds. The secretary general said that he welcomed “families, regardless of their structure.” The UN “High Representative for the Alliance of Civilizations,” a Muslim, shook our hands.\nWe had some time before the event, so I wandered about, went to the UN cafeteria, and took a few notes.\nThe UN was founded in 1945 by fifty-one countries. Now they number 193 and they speak many languages. A former Israeli ambassador published a book called Tower of Babble: How the United Nations Has Fueled Global Chaos. I’m afraid I haven’t read it but it sounds interesting. The 193 nations put out press releases galore, and I dare say most of them are never read. Notices and signposts are restricted to English and French, however. At one point I found myself in the Batiment du Secretariat—but you can figure that out. In 1958 the John Birch Society launched a campaign to get “the U.S. out of the UN and the UN out of the U.S.” Their warning that the UN planned to impose “world government” sounded plausible at the time. The EU has an analogous ambition for Europe.\nWe met Austin Ruse, the president of the Catholic Family and Human Rights Institute, who was writing an article for Breitbart.com. When I asked him how many people work at the UN, he said that it is “not exactly a transparent institution.” That I can believe. The UN’s biennial budget is about $5.4 billion, of which the U.S. pays 22 percent. But that doesn’t include peacekeeping forces—another $7 billion.\nThe U.S. is often in arrears in its dues, as are many other nations. In 1984, the U.S. actually defunded the Paris-based UNESCO, and did so for eighteen years. It had become too anti-American, and I think there was an improvement after the cutoff. (More recently the U.S. defunded UNESCO once again, this time over its admission of “Palestine.”)\nThousands of people who work at the UN are paid huge tax-free salaries (U.S. employees do pay taxes), and they certainly boost the economy of Manhattan’s East Side. My glance around the cafeteria suggested that not many people were present that day. (Writing press releases? Attending meetings? On urgent travel?)\nAs I see it, the UN is a ship that exists for the benefit of its crew: no cargo, no destination, few external constraints. The UN Security Council issues many resolutions but the veto power of permanent members ensures that little action is taken. On balance that is probably a good thing.\nAmericans today pay little attention to the United Nations—or to any organization with “International” in its title. International Labor Organization, anyone? International Monetary Fund? The IMF began as a system of international payments to maintain fixed exchange rates. But when floating rates arrived in 1971, the IMF somehow survived. No surprise there. As a friend of mine said of the ruling class’s ambition to have a cushy life, “Where there’s a will, there’s a way.”\nWinston Churchill once said that to “jaw-jaw is better than to war-war,” and that I do agree with. The UN could do worse than to display it on the wall. Today, a leading UN goal is “to keep peace throughout the world.” During the Cold War, it went through a strong disarmament phase; I saw an old disarmament display in a corridor. My own belief is that the American and Soviet possession of nuclear weapons kept the peace between the superpowers quite satisfactorily for over forty years.\nOn “World Peace Day” a few months ago, Pope Francis called for the “disarmament of all parties, beginning with nuclear and chemical weapons disarmament.” Question: Who starts disarming first? As a comment on world affairs, it strikes me as being out of touch. There must be a Vatican secretariat that dreams up these things. The Pope is supposed to live in the real world, not a utopian one. But ensconced as I was in this heartland of diplomacy, I decided not to bring it up with Archbishop Paglia.\nOur panel discussion was held in a big, bowl-shaped conference room. In addition to the two archbishops, there was a super-tactful Muslim—a UN regular who said nothing memorable—and a rabbi from Argentina. Focusing on the Torah, he avoided the usual UN cant (“promote dialogue,” “sustainable development,” “message of tolerance,” “respectful diversity”) but he included nothing provocative either (such as Leviticus 20:13—sorry, you’ll have to look it up).\nArchbishop Paglia tried to hold the line, telling the audience that the family is made of “male/female” and “parent/child.” It combines “in a lasting fashion two kinds of relations characterized by radical differences, one being male and female, and the other being parent and child.” The family had not always been perfect, he added, but over time it had “purified itself little by little.” He was referring to a time when the father literally owned his wife. (But is that still not true in much of the Muslim world?)\nMy own suspicion is that, in the Western world, the family is not so much purifying itself as falling apart. Further, the U.S. has become the world leader in that disintegration. Over-generous welfare benefits encourage pre-marital sex because we know that the government will pick up the child-care tab when needed. I don’t need to remind you (but President Obama should) of the most striking outcome—the destruction of the black family.\nOur politically correct judges—widely praised whenever they find laws against same-sex marriage to be unconstitutional—make matters worse. That such assaults on tradition are today considered meritorious shows just how anti-Christian our times have become.\nMy wife was the last to speak. Incidentally, she is also on the board of the Sandia National Laboratories, which is responsible for the maintenance of nuclear weapons. I’m sure we all hope that they still work. As to the family, she said that it is under attack “from cultural, economic, and political forces that are both new and far more aggressive than ever before.” It is no longer the age-old force of human concupiscence that challenges it, “but organized, well-funded, and persistent activists who want to change all social structures.”\nOur task must be to counterattack, to rally all available forces to reestablish the indispensable unit of the family founded on marriage as the societal norm.…We must begin our own “long march through the institutions” to take back our culture.\nWhen she finished people rushed up and praised her bravery. I agreed with all that she said but the response showed that controversy is not expected in these precincts. Delegates were already pouring in for the next pow-wow. Ours had exceeded the time limit. Someone told me what the new topic was but I forgot to write it down.","url":"https://spectator.org/59577_my-day-united-nations/"}
