{"authors":[],"date_download":"2018-10-30 14:21:09","date_modify":"2018-10-30 14:21:09","date_publish":"2017-01-26 00:00:00","description":null,"filename":"data/vaneerConsumption/Myfavoriteliberalfallacies.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2017_01_my_favorite_liberal_fallacies_comments_1540909269.html","title":"My favorite liberal fallacies","title_page":"Blog: My favorite liberal fallacies","title_rss":"NULL","source_domain":"americanthinker.com","text":"Elizabeth Smiley’s recent blog item convinced me it might be useful to list and then refute some key arguments liberals like to bring up. Here’s my “top ten” list. 1. Abortion is morally okay because the Supreme Court said so. Refutation: Legal permissibility does not entail moral permissibility. Slavery was legal at one time, and not just in this country, but we can agree it’s always been morally wrong. Racial laws passed by the Nazis during the 1930s were clearly morally wrong. 2. Abortion is morally okay because women have a right to their bodies. Refutation: The “right to one’s body” is not absolute in the moral or the legal sense. You can’t jump off a building intending to kill someone by landing on him. Selling body parts of an aborted fetus is illegal, certainly in this country. 3. Abortion is morally okay because the fetus is an organ and may be removed for medical reasons just... (Read Full Post)","url":"https://www.americanthinker.com/blog/2017/01/my_favorite_liberal_fallacies_comments.html"}
 so the fetus cannot be an organ because no organs have organs.\n4. Abortion is morally okay because the fetus is not a human being.\nRefutation: The issue is whether the unborn have moral rights as strong as the rest of us. It requires argument to prove that this is not the case regarding the unborn. It would need to be proved (i) that A’s moral rights are as strong as B’s only if A and B are both human beings, and (ii) that the unborn are not human beings. Liberals who advocate in favor of animal rights would deny (i), which is far from obvious anyway. Biology refutes (ii).\n5. Abortion is morally okay because the fetus is alive only after birth.\nRefutation: Medically speaking, human beings are judged to be alive provided brain function can be detected. Conversely, human beings are judged to be no longer alive when no brain function is detected. Brain function in the unborn can be detected at about eight weeks, so by the medical definition, it is false that the fetus is alive only after birth.\n6. Donald Trump is not a legitimate president because Hillary Clinton won the popular vote.\nRefutation: Receiving a greater percentage of the votes counted than the opponent is not how a candidate is considered the winner in our system of presidential elections. In any case, the actual votes cast in such elections are unknown because the count stops once election officials determine that a candidate’s lead cannot be overtaken.\n7. Donald Trump is not a legitimate president because the Russians tried to influence our election in Trump’s favor.\nRefutation: The Russians may or may not have hacked DNC computers to obtain and then allegedly provide negative information about the Clinton campaign to WikiLeaks. Even if they did, a cause-effect relationship hardly follows, especially in light of much better explanations such as Trump’s effective campaign, Clinton’s underestimation of Trump’s support, and dissatisfaction with Obama’s foreign and domestic policies.\n8. Donald Trump is not a legitimate president because he was voted into office by a “basket of deplorables.”\nRefutation: This is a form of attack on the personal character of those who voted for Trump and as such exemplifies the fallacy called in logic ad hominem.\n9. If you criticize Obama or any other black leader, you must be motivated by racial animosity.\nRefutation: Questioning an opponent’s motives in raising objections is also a form of personal attack. The opponent may be justified in raising the objections despite alleged racial animosity toward the person being criticized.\n10. If you criticize the actions of ISIS or some other Muslim group, you must be motivated by animosity toward Islam.\nRefutation: Also an ad hominem attack, so the same refutation applies.\nA frequent contributor to American Thinker, Arnold Cusmariu holds a Ph.D. in philosophy from Brown University. His most recent publication is “A Methodology for Teaching Logic-Based Skills to Mathematics Students,” Symposion 3.3 (2016), 259-292. A PDF of this article is available free of charge from the journal site.","url":"https://www.americanthinker.com/blog/2017/01/my_favorite_liberal_fallacies.html"}
