{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-22 23:33:37","date_modify":"2018-10-22 23:33:37","date_publish":"2016-01-11 06:35:04","description":"Sarah-Jayne McIntosh (pictured), 18, from Southport, Merseyside, usually has a heart rate of around 84 beats per minute so called 111 immediately when it jumped to 210bpm.","filename":"data/vaneerConsumption/MyFitbitsavedmylifeStudentdiscoveredshehadheartconditionwithgdget.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/06/2FFACE0900000578-0-image-a-13_1452494008770.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393461_My-Fitbit-saved-life-Student-discovered-dangerous-heart-condition-fitness-gadget-got-Christmas-present-revealed-pulse-tripled_1540251217.html","title":"My Fitbit saved my life: Student discovered she had heart condition with gdget","title_page":"My Fitbit saved my life: Student discovered she had heart condition  with gdget | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A student discovered she had an undiagnosed heart condition after being rushed to hospital when a fitness gadget revealed her heart rate had tripled.\nSarah-Jayne McIntosh, 18, from Southport, Merseyside, got a Fitbit for Christmas, which constantly measures her her heart rate, which is usually around 84 beats per minute (bpm).\nBut last Wednesday, she realised the rate had jumped to a shocking 210bpm while she was simply sitting down studying in her halls of residence at Edge Hill University, in Ormskirk, Lancashire.\nSarah-Jayne McIntosh, 18, from Southport, Merseyside, got a Fitbit for Christmas, which constantly measures her heart rate, which is usually around 84 beats per minute (bpm)\nBut last Wednesday, she realised the rate had jumped to a dangerous 210bpm while she was simply sitting down studying in her halls of residence at Edge Hill University, in Ormskirk, Lancashire\nThe worried student rang the NHS non-emergency 111 number and they immediately dispached an ambulance, which rushed her straight to Southport and Formby District General Hospital.\nIt was there that she was told she had a heart condition, which she was totally unaware of before.\nMs McIntosh said: 'As soon as I got to hospital, they hooked me on all these machines and did some blood tests and they have found an issue with my heart.\n'Apparently one pathway from one chamber to the heart from the other was misfiring.\n'Instead of the chambers beating one after another like it normally should, they were beating at the exact same time, which was causing my heart rate to increase.\n'The doctor said I had two heartbeats. I had a resting rate of 190 bpm and they couldn't get it to lower.\n'They used shock to try and reset it but in the end, they had to use this medication, which reacts within 10 seconds to force the heart to slow down along with the rest of my body.\n'For the first time that day I could get a full breath and I felt a lot better.\nFitbit data shows how her heart rate suddenly jumped last Wednesday to 210bpm\n'My heart rate convulsed and started to gradually reduce.'\nOnly last week, FitBit's heart monitoring devices were branded wildly inaccurate in a US lawsuit accusing the company of false advertising.\nDevices sold by the leading maker of fitness trackers are mis-recording heart rates by a very significant margin while on the brink of causing health risks for users, according to a complaint filed this week in a San Francisco federal court.\nA Colorado woman alleges that her Charge HR device under-reported her actual heart rate by 50 per cent, as recorded manually by her personal trainer after a period of intense exercise.\n'Scores of customer complaints confirm these are not isolated incidents,' according to to the complaint, which was brought as a class action on behalf of other customers.\nBut FitBit has defended its products, pointing to internal studies verifying their accuracy.\nSpokeswoman Heather Pierce said: 'We do not believe this case has merit.","url":"https://www.dailymail.co.uk/news/article-3393461/My-Fitbit-saved-life-Student-discovered-dangerous-heart-condition-fitness-gadget-got-Christmas-present-revealed-pulse-tripled.html"}
