{"authors":["Maanvi Singh"],"date_download":"2018-10-22 21:57:39","date_modify":"2018-10-22 21:57:39","date_publish":"2015-09-21 00:00:00","description":"She used pods from the moringa tree to make a delicious lentil stew. And it turns out she was on to something: Researchers now say the tree, which grows in Asia and Africa, is packed with nutrition.","filename":"data/vaneerConsumption/MyMomCookedMoringaBeforeItWasASuperfood.json","image_url":"https://media.npr.org/assets/img/2015/09/21/istock_000056729444_medium_wide-b043a7ae0d67d6def9f147bdd0a498403e677c8d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_goatsandsoda_2015_09_21_439509739_mother-knows-best-when-it-comes-to-cooking-with-moringa_1540245459.html","title":"My Mom Cooked Moringa Before It Was A Superfood","title_page":"My Mom Cooked Moringa Before It Was A Superfood : Goats and Soda : NPR","title_rss":"NULL","source_domain":"npr.org","text":"My Mom Cooked Moringa Before It Was A Superfood\nEnlarge this image toggle caption PHONLAWAT/iStockphoto PHONLAWAT/iStockphoto\nAmericans are starting to pay more attention to moringa these days. Some are touting this tropical tree as the newest and greatest superfood. And all the excitement is understandable: Moringa leaves and seed pods are packed with protein and vitamins. Its nutritional value rivals that of milk, yogurt and eggs.\nEnlarge this image toggle caption Vani Singh Vani Singh\nBut people in Asia and Africa have been eating it for years. In India, we call moringa the drumstick tree — for its long, drumstick-like seed pods. It's easy to come by in Mumbai, where I grew up. My mother would use the young, tender pods to make this amazing lentil stew called sambhar.\nMy mom was excited to hear I was reporting on moringa. \"It used to be our favorite, especially with hot rice and a big dollop of fresh, homemade butter,\" she says.\nIt's true: I loved this stuff, even as a kid who generally rejected wholesome foods. The pods' outer skins are too tough and fibrous to eat. So you've got to fish them out of the stew, suck out the juicy seeds and flesh and chuck the skin. They taste like green beans — but sweeter. \"Although you fussed over a lot of vegetables,\" my mom says, \"you never fussed over drumstick sambhar, which was very surprising.\"\nRecently, researchers around the world have taken a renewed interest in this hardy plant and its many nutritional benefits. And they're learning that all that moringa I gorged on as a child might have been healthier than I ever realized.\n\"Moringa is truly one of those plants in which all parts of the plant can be used,\" says Jed Fahey, a biochemist at the Johns Hopkins Bloomberg School of Public Health who has been studying this tree for two decades. It makes for great firewood, and both its leaves and pods are edible. Mature seeds can be used to make vegetable oil. It grows wicked fast, it's drought resistant — and a couple of dried seeds, crushed up, can purify a bottle of contaminated water.\nPlus, it thrives in the dryland tropics of India, Africa and South America. \"It grows in areas that overlap almost perfectly with the areas of the world which are undernourished,\" Fahey notes.\nThat's why, Fahey says, its real value lies in its ability to feed poor communities in Asia and Africa — which is where it grows best. The leaves, which taste a bit peppery, like arugula, are a good source of easily digestible protein as well as vitamins A and C, calcium and iron. The seed pods are also rich in protein and high in omega-3 fatty acids.\nAs Americans learn more about moringa, they're developing an appetite for it as well. Lately, moringa supplements and energy bars are becoming fashionable in the U.S.\nSome of these moringa suppliers source responsibly, Fahey says, but others do not. About 15 years ago, supplement-makers encouraged subsistence farmers in Senegal and Bangladesh to start growing moringa instead of other crops, he says. When these companies couldn't turn a profit selling their moringa products, the farmers — who had stopped growing food they could use to feed their families — paid the price. \"They were really left in dire straits,\" Fahey says.\nIf you can find responsibly sourced moringa and afford to try it, Fahey is all for taking a taste. But here in the U.S., we can get the same nutritional benefits from more commonplace vegetables like broccoli, which grows locally and costs less to import. \"I just think that we should remember that [moringa] is a novelty at the moment,\" Fahey says.\nHe and other scientists are still looking into its medicinal value, and Fahey will be among those presenting at an international moringa conference in November. There's good evidence that moringa has some anti-diabetic and cancer prevention properties, but the research is still in its preliminary stages.\nMeanwhile, my mom tells me that in southern India, some folks have other ideas: \"They thought it was an aphrodisiac.\" It's true. In some Tamil movies, women who are having marital troubles will try serving up moringa for dinner. At least at this point, there's no science to back that strategy.","url":"https://www.npr.org/sections/goatsandsoda/2015/09/21/439509739/mother-knows-best-when-it-comes-to-cooking-with-moringa"}
