{"authors":[],"date_download":"2018-10-30 01:03:02","date_modify":"2018-10-30 01:03:02","date_publish":"2015-03-29 00:00:00","description":null,"filename":"data/vaneerConsumption/MyproblemwithCruzisthathesveryverysmart.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_my_problem_with_cruz_is_that_hes_very_very_smart_1540861382.html","title":"'My problem with Cruz is that he's very, very smart'","title_page":"'My problem with Cruz is that he's very, very smart'","title_rss":"NULL","source_domain":"americanthinker.com","text":"'My problem with Cruz is that he's very, very smart'\nIf establishment pundits can’t deny a Republican’s intelligence, then they have to claim his intelligence is a problem. The other day, NPR’s Robert Siegel assembled his usual suspects from the New York Times, Washington Post and Brookings Institution to provide a “balanced” review of the week in politics, including the latest from Ted Cruz. These two short sentences provide a perfect example of the uphill climb Cruz and any Republican has ahead:\nDAVID BROOKS of the NY Times: “My problem with Cruz is that he’s very, very smart – he’s going to Wall Street these days and impressing people with his intelligence – but he’s in the new era of performance politics. He actually hasn’t done much governing in his life but he’s done a lot of performing.” Let’s completely skip over the attempt to connect Cruz with the evil Wall Street bankers and investors. Never mind, too, that while Obama was doing whatever community organizers do, Cruz was hard at work with the Supreme Court Justice William Rehnquist and in the courtroom. This pundit Brooks (who is supposed to be the New York Times’ house conservative) is the same guy who claimed Obama was the smartest presidential candidate ever, based on nothing but press releases and the crease in Obama’s pants. For Brooks and the others this was a good thing even though the contention was completely unverifiable by his college transcripts, which remain legally sealed and never revealed. If we are talking about a Democrat, or Obama specifically, presumed intelligence is a good thing. If we are talking about a Republican, or Cruz specifically, demonstrated and proven intelligence is a problem, according to Brooks. I guess there’s nothing worse for MSM journalists than a smart Republican. It’s awfully hard to attack a person’s statements when his intelligence is supported by his college transcripts, his 80 U.S. Supreme Court briefs and 43 oral arguments, including nine in front of the U.S. Supreme Court, which are all public and not under lock and key. While Obama claims to have been a professor of Constitutional Law, Cruz is a proven expert and has been involved in the analysis of some of the most controversial and important legal issues presented to the Supreme Court for decades. In other words, those who can, do; those who can’t, teach, I guess. Next, and even juicier, Brooks had a problem with the fact that Cruz is just a guy who performs speeches to big crowds of supporters. Again, if a Democrat, or Obama specifically, gives lofty well-delivered speeches to cheering fans, he’s the greatest politician to have ever graced a political stage. If a Republican, or Cruz specifically, gives an inspired speech it’s just soaring rhetoric bearing no substance. Lastly, Cruz’s lack of governing experience is apparently a big negative worth emphasizing. Being Progressive journalists, they can’t even see the irony in their own statements. Candidate Obama not only never governed anything (and still hasn’t), he was famous for voting present on almost every piece of significant legislation presented during his time in the Illinois legislature and he spent most of his time in the U.S. Senate campaigning for president, compiling one of the worst attendance records ever. So, if a Republican, or Cruz specifically, is falsely deemed to have little or no governing experience, it’s bad. If a Democrat, or Obama specifically, is best known for his empty chair in state and federal legislatures, it’s not a problem. It’s amazing how much hypocrisy David Brooks from the New York Times can pack into one short statement.","url":"https://www.americanthinker.com/blog/2015/03/my_problem_with_cruz_is_that_hes_very_very_smart.html"}
