{"authors":[],"date_download":"2018-10-22 21:44:38","date_modify":"2018-10-22 21:44:38","date_publish":"2014-05-07 02:56:26","description":"Sharie Keil helps lead a shame-free alliance of sex offenders and their families, supported by researchers who see registries as a \"failed policy.\"","filename":"data/vaneerConsumption/MySontheSexOffenderOneMothersMissiontoFighttheLaw.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/426156/140507-offender-reform-keil-jm-04_7d6caeb27c8d37de16e5de238402d9bc.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_my-son-sex-offender-one-mothers-mission-fight-law-n98876_1540244678.html","title":"My Son, the Sex Offender: One Mother's Mission to Fight the Law","title_page":"My Son, the Sex Offender: One Mother's Mission to Fight the Law","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn the run up to Halloween one year, Sharie Keil saw something that really made her jump: Missouri governor Jay Nixon, then the attorney general.\nHe was on television to announce that registered sex offenders were hereby banned from participating in her favorite holiday. On threat of a year in jail, they had to stay inside and display a sign saying they had no candy. The goal was “to protect our children,” as Nixon put it, but Keil heard only a peal of political hysteria.\nShe is not a sex offender nor, at 63, a new-age apologist for pedophiles or predators. She is a mother, however, and in 1998 her 17-year-old son had sex with a pre-teen girl at a party. He was convicted of aggravated sexual abuse, which got him six months in county jail and a lifetime of mandatory registration as a sex offender. Ten years later, after the Halloween law, Keil felt shocked into action.\n”As my husband says, I decided to go on the war path,” she remembers.\nToday, she’s at the forefront of a growing fight against sex offender registries, a shame-free alliance of offenders and their families, supported by researchers and some advocates who helped pass stringent anti-abuse laws in the first place. They’re organized (albeit loosely) under Reform Sex Offender Laws, a five-year-old lobby that claims 38 state affiliates and a steady patter of legal and legislative victories.\nMost of their progress, however, has been limited to a slice of the registry: juvenile offenders. That would remove Keil’s son, but this former soccer mom and chapter head of the League of Women Voters wants to abolish the public registry altogether. She funds a powerful RSOL affiliate, Missouri Citizens for Reform, which has helped push sweeping changes through the Missouri House four years in a row, only to see the effort smothered in the Senate or, last summer, stabbed by a governor’s veto.\n“Changing the registry would provide relief for tens of thousands of Missourians,” Keil says. “Since there are nearly 800,000 people on the registry nationally, millions of lives would change for the better.”\nAs reckless as Keil’s ideas may sound, she and her intellectual allies—among them Nicole Pittman, an attorney who slammed registries in a Human Rights Watch report last year—are fervently opposed to sexual abuse and believe in jail time for law breakers. However, they also hope to realign the law with second-chance ideals and new research that shows rehabilitation is possible, even for America’s last pariahs.\nIf they succeed, Keil believes, public safety will actually improve. As the registries shrink or disappear, law enforcement will be freed to focus on crime prevention. If the movement fails, she warns, public safety could suffer. Truly dangerous people will be lost in the thousands that police must monitor, while relatively harmless offenders break bad in a system that gives them no hope for a normal future.\n“We’re all in the soup,” Keil says, using one of her favorite metaphors for describing the way the registry absorbs all offenders, undifferentiated by risk. “They throw it over everyone, and it’s like being in a quagmire. You can’t lift your legs high enough to get out.”\n“We need to forget everything we think we know about sex offenders, because 20 years of research has shown us it’s all pretty much wrong.”\nTo victims’ advocates, of course, that’s precisely the idea. For years many have lobbied to apply the term “sex offender” to a broad cross section of juveniles and adults, flashers and rapists. The rationale is that sex offenders are incurable, insatiable, and psychologically the same. Under federal law, for example, a Jerry Sandusky-type will be on the registry—and so will a 14-year-old whose hand wandered under the knickers of an 11-year-old sibling. Under Missouri law, Keil’s son got the same registry requirements as a violent attacker.\nSince 1994, when Congress first required sex offender registries, the population on the rolls has doubled and doubled again. “It seems to make sense, doesn't it?” said President George W. Bush, moments before signing the Sex Offender Registry and Notification Act of 2006, which expanded registration to nonviolent crimes like indecent exposure and public urination. Scott Berkowitz, president of RAINN, the country’s largest anti-sexual assault organization, called it “a landmark bill…that’s going to make a real difference.”\nKeil wants to shatter this mindset. Over the years, her family and affiliated businesses have sunk more than a quarter million dollars into Missouri politics, including tens of thousands of dollars related to sex offender reform. That kind of money opens doors and Keil has hired a lobbyist to walk through each one. She wants to win with data, not emotion. And last year it seemed she had.\nThe Missouri legislature passed a law that would remove juveniles from the registry, making it the first state to vote its way out of compliance with federal law (others have yet to vote their way into compliance). Keil saw it as a first step to broader reform. But Nixon vetoed the bill last July.\nNow Keil is hoping to hit back by telling her personal story for the first time. After the veto, the Associated Press revealed Sharie’s lobbying role and published her husband’s name and primary business. Fearing vigilantism, she requested that NBC not repeat those names or the name of her hometown.\nWith those conditions met, she welcomed a meeting in a gazebo on her ranch south of St. Louis, where she explained what the governor—and everybody else—needs to do when it comes to sex crimes.\n“We need to forget everything we think we know about sex offenders,” she says, “because 20 years of research has shown us it’s all pretty much wrong.”\n“We've cast such a broad net that we're catching a lot of juveniles who did something stupid.”\nIn the aftermath of her son’s conviction, Keil felt “smashed to the floor” by the requirements of his sentence. The weekly probation meetings. The mandatory therapy. Slip ups could mean jail time. What if he got a flat tire near a park? What if he pulled into a school parking lot to use a pay phone?\n“It felt harder to stay out of trouble than is even possible,” she says.\nSex offenders have come to face a medieval series of possible fates, including chemical castration, civil commitment, and, most commonly, a lifetime on the move. They jump from apartment to apartment, job to job, pushed out as employers and landlords discover their public records—and point to the door. Today, if the registry were a city, it would have more people than Boston and Halloween would be the least of its problems.\nBut hold on a minute, Keil thought: does any of this actually help public safety?\nShe found part of her answer in the form of Mary Duval, another mother of a registered sex offender. Duval’s son was 16 when he slept with a 13-year-old he had met at a club for older teens. After his conviction for sexual abuse, he had “sex offender” stamped on his license and couldn’t go to his brother’s football games. Duval decided to fight it, inspiring Keil to do the same.","url":"https://www.nbcnews.com/news/us-news/my-son-sex-offender-one-mothers-mission-fight-law-n98876"}
