{"authors":["Will Stewart In Moscow For Mailonline"],"date_download":"2018-10-22 21:43:11","date_modify":"2018-10-22 21:43:11","date_publish":"2016-01-28 08:45:36","description":"Her haunting image is seen on dozens of old pictures, mainly of landmarks of the city of Krasnoyarsk, central Russia, during the reign of the last emperor Nicholas the Second.","filename":"data/vaneerConsumption/MysteryovergirlindozensofphotostakeninRussia100yearsago.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AAF76600000578-0-image-a-2_1453991466450.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420560_Who-phantom-girl-Siberia-Mystery-surrounds-identity-girl-appears-dozens-photographs-taken-Russian-city-100-years-ago_1540244591.html","title":"Mystery over girl in dozens of photos taken in Russia 100 years ago","title_page":"Mystery over girl in dozens of photos taken in Russia 100 years ago  | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A search has been launched to find the identity and life story of a mysterious 'phantom girl' found on photographs taken in tsarist Siberia in the early part of the last century.\nHer haunting image is seen on dozens of old pictures, mainly of landmarks in the city of Krasnoyarsk, central Russia, during the reign of the last emperor Nicholas the Second.\nSome were used as postcards and posters but the wealthy-looking girl - always immaculately dressed but with a serious face - was often portrayed so small that her presence was not previously seen as significant.\nDiscovery: A search has been launched to find the identity and life story of a mysterious 'phantom girl' (circled) found on photographs taken in tsarist Siberia in the early part of the last century\nMystery: One striking image shows the girl posing on a rooftop in front of famous Krasnoyarsk Railway Bridge, opened in 1899, which carries the Trans Siberian railway over the Yenisei River\nOnly now, with technology used to zoom in on the yellowing photos snapped a decade or so before Russia succumbed to the 1917 Bolshevik revolution, is she clearly seen in many photos.\nNow the Krasnoyarsk Regional Museum of Local Lore has launched a hunt to discover the identity of the girl, who is believed to have been aged between 8 and 10 when the pictures were taken.\nOne theory is that she may have been from a rich local family, which could have escaped eastward from the advancing Communist tyranny, and that the answer to the intriguing secret of her identity may lie abroad in Europe or America.\nShe is always well-dressed, in a light-coloured cape with a long plait, dark ribbons tied to its end, and carries an umbrella, but is seldom if ever the focal point of the picture.\nOne striking image shows her posing on a rooftop in front of famous Krasnoyarsk Railway Bridge, opened in 1899, which carries the Trans Siberian railway over the Yenisei River.\n'In another, she poses with several boys, near Krasnoyarsk teachers' seminary, somehow imperious in her light coloured coat with a darker dress underneath, and her distinctive trademark boater-style hat,' reported The Siberian Times.\nLocal experts have dated the images to between 1906 and 1908 but insist that they were not all part of one shoot on a single day.\nHaunting: Her image is seen on dozens of old pictures, mainly of landmarks in the city of Krasnoyarsk, central Russia, during the reign of the last emperor Nicholas the Second\nInvestigation: Only now, with technology used to zoom in on the yellowing photos snapped a decade or so before Russia succumbed to the 1917 Bolshevik revolution, is she clearly seen in many photos\nTheory: One idea is that she may have been from a rich local family, which could have escaped eastward from the advancing Communist tyranny, and that the answer to the intriguing secret of her identity may lie abroad in Europe or America\nAt first researchers believed she was dressed in identical clothes in each of the 24 images so far unearthed, but closer inspection shows this is not the case.\nIlya Kuklinsky, senior researcher of the museum, said: 'It was only modern equipment that allowed us to notice the girl. When you look at the old pictures, you do not see her.\n'She is rather small there. When we made high resolution scans and zoomed in, we saw her more closely, along with the details of her clothes and hairstyle.'\nHe added: 'She changes boots, stockings, and we can see some differences in her dress, but she is always in the same pose and with the same facial expression.\n'She never smiles. The fact that she changes her clothes makes me think that the pictures were taken not in a single day. It was over a period of some time. But what was the aim?'\nDespite good records and archives of local photographers at the time, the researchers cannot identify who took the pictures.\nResearch: At first researchers believed she was dressed in identical clothes in each of the 24 images so far unearthed, but closer inspection shows this is not the case\nDespite good records and archives of local photographers at the time, the researchers cannot identify who took the pictures\nSeveral have an imprint F.E.A. on them - which is perhaps a significant clue, but it does not relate to a known professional or amateur photographer at the time.\nSome but not all the images came to the museum from a collection of Nikolai Grigorovskiy, owner of a Krasnoyarsk bookshop before revolution.\nA glass negative featuring the girl was from the collection of well known photographer Ludwig Yulyevich Wonago: yet his name does not match the initials.\nMuseum experts believe the photographer was likely to have been an amateur at a time when photography was a pastime of the well-to-do.\n'We think that the girl could be the photographer's daughter, or his niece, but we do not know for sure, as we do not even know the photographer's name,' he said.\n'The set of pictures was named 'Phantom Girl'. I think we must try to solve this mystery, since the girl is almost a kind of brand for Krasnoyarsk.\n'It is quite strange that no one noticed her, though the pictures were widely used as illustrations - and they were even made into posters.'","url":"https://www.dailymail.co.uk/news/article-3420560/Who-phantom-girl-Siberia-Mystery-surrounds-identity-girl-appears-dozens-photographs-taken-Russian-city-100-years-ago.html"}
