{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 21:09:14","date_modify":"2018-10-30 21:09:14","date_publish":"2015-02-02 20:53:44","description":"Moments before his suspicious death in a Saudi Arabian hotel, American defense contractor Christopher Cramer reportedly sent a warning text.","filename":"data/vaneerConsumption/MysteryDeepensinDeathofUSContractorinSaudiArabia.json","image_url":"https://media.breitbart.com/media/2015/02/Christopher-Cramer-final-text-handout.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_02__1540933754.html","title":"Mystery Deepens in Death of US Contractor in Saudi Arabia","title_page":"Mystery Deepens in Death of US Contractor in Saudi Arabia | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Moments before he reportedly died in his Saudi Arabian hotel under suspicious circumstances, American defense contractor Christopher Cramer texted, “I’m at the Marakim [sic] Tabuk Hotel in Saudi. I think something bad is going to happen to me tonight. Please contact state ddept [sic] ASAP. Bad things were said.”\nSo far, Saudi Arabian officials reportedly have refused to release Cramer’s body; Cramer was working for a company that was contracted by Israel’s Elbit Systems.\nCramer was on the job for Kollsman, Inc., when, on January 15, he was reportedly found death outside the third floor of a hotel room in Tabuk, Saudi Arabia. The Jewish Press reports that Cramer was in the country to seal a weapons deal for the company. Elbit is perhaps best known for its avionics systems and fleet of Unmanned Aerial Vehicles (UAV).\n“We received a message from Kollsman, Inc., Elbit Systems’ subcontractor in America, saying its employee Chris Cramer passed away during a work trip,” said a spokesperson for the company.”\nThe spokesperson added:\nThe circumstances of his death are being investigated by the American State Department. We have no further details at this stage and we are waiting for the State Department to update our American subcontractor. Cramer worked for the company for 12 years. We cannot provide details on the project he was working on, but this is a Kollsman product, an American product with no Israeli technologies involved in its production.\nCramer’s family has gone on the record stating they do not believe Saudi officials’ story that he committed suicide by jumping out the third-floor window of his hotel room.\nCramer was sent to Saudi Arabia to inspect a thermal site on a TOW missile system, according to Haaretz.\nThe Cramer family attorney, Noah Mandell, told Fox News, “The missile system was already sold to the Saudi company [and] they were complaining it wasn’t working.” Mandell added, “He was basically sent to see if he could prove that they were firing it incorrectly.” The attorney said he had reason to believe the clients were purposely sabotaging the system so they could get brand new equipment.\nThe American government has reportedly left completing the investigation in the hands of Saudi Arabian officials.\n“For questions regarding the investigation, we refer you to the Tabuk (Saudi Arabia) Police Department,” said an official State Department memo on the matter.\n“All the information we’re getting back right now … is that the State Department and FBI, everybody, is sitting on their hands waiting for the Saudis to do their investigation,” Cramer’s nephew told the Daily Beast.","url":"https://www.breitbart.com/national-security/2015/02/02/mystery-deepens-in-death-of-us-contractor-in-saudi-arabia/"}
