{"authors":[],"date_download":"2018-10-22 21:07:52","date_modify":"2018-10-22 21:07:52","date_publish":"2014-06-04 10:10:39","description":"Scientists say it is a long shot, but they may have found audio recordings of MH370 hitting the ocean at high speed.","filename":"data/vaneerConsumption/MysteriousUnderwaterNoiseCouldBeNewMH370LeadScientists.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_35/257101/140317-malaysia-jet-10a_62c2099a537fc49714f0694b368be4d7.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-jet_mysterious-underwater-noise-could-be-new-mh370-lead-scientists-n122081_1540242472.html","title":"Mysterious Underwater Noise Could Be New MH370 Lead: Scientists","title_page":"Mysterious Underwater Noise Could Be New MH370 Lead: Scientists","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA mysterious, indistinct rumbling noise captured on a five-second audio clip could be a fresh lead in the hunt for missing Malaysia Airlines Flight MH370, scientists in Australia said Wednesday.\nThe recording was made on the day the Boeing 777 went missing by ocean floor monitoring devices that are normally used to detect earthquakes and underwater nuclear tests.\nResearchers at Curtin University, in Perth, Australia, believe the audio is consistent with the low-frequency sounds that might be generated by a large passenger jet crashing into the ocean at high speed.\nHowever, the mystery sound appears to come from a location inconsistent with other data about the plane's final movements, according to Alec Duncan, a senior fellow at Curtin University.\n\"I wouldn't rule out the possibility that these sounds came from the plane,\" Duncan told NBC News. \"But there’s about a 90 percent chance they are from another source.\"\nBy analyzing data from two listening posts off Perth, on the southwest Australian coast, the team were able to determine that the noise does not match up with locations suggested by the so-called satellite \"handshakes\" sent by the plane in its final hours. Those satellite signals have been used by investigators to define the ocean search area for the plane.\n\"The crash of a large aircraft in the ocean would be a high energy event and expected to generate intense underwater sounds,\" he said.\"\n\"If we didn't have the handshakes it would be certainly worth investigating, but because we know the satellite data has come from the plane it conflicts with the area we believe these sounds have come from.\"\nDuncan and his colleagues at the university’s Centre for Marine Science and Technology have monitoring devices in several Indian Ocean locations. When the MH370 search operation was focused on the northern part of that vast body of water, the scientists checked their equipment for activity but found nothing.","url":"https://www.nbcnews.com/storyline/missing-jet/mysterious-underwater-noise-could-be-new-mh370-lead-scientists-n122081"}
