{"authors":[],"date_download":"2018-10-22 21:03:21","date_modify":"2018-10-22 21:03:21","date_publish":"2014-05-05 19:43:59","description":"The new lines date to around 300 B.C., making them at least 300 years older than the oldest Nazca lines.","filename":"data/vaneerConsumption/MysteriousRockLinesMarkedWaytoAncientPeruFairs.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/421451/chinca-lines-5-140505_1_f214faa3c83f150017c9adf56bcf9202.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_science-news_mysterious-rock-lines-marked-way-ancient-peru-fairs-n97511_1540242201.html","title":"Mysterious Rock Lines Marked Way to Ancient Peru Fairs","title_page":"Mysterious Rock Lines Marked Way to Ancient Peru Fairs","title_rss":"NULL","source_domain":"nbcnews.com","text":"Archaeological surveys revealed large, ancient mounds in the valley. Over three field seasons, Stanish and his colleagues mapped these mounds, as well as nearby rock lines associated with each mound. They found 71 geoglyph lines or segments, 353 rock cairns, rocks forming circles or rectangles, and one point at which a series of lines converged in a circle of rays. The researchers also excavated one cluster of man-made mounds.\nThe excavations and mapping revealed a carefully built environment. Some long lines marked the spot where the sun would have set during the June solstice (the winter solstice in the Southern Hemisphere). Two U-shaped mounds also pointed toward the June solstice sunset, and the largest platform mound on the site lined up with the solstice as well. These lines and mounds probably served as a way to mark time during festivals, Stanish said.\nSome lines are set out to frame pyramid structures, Stanish said. The lines are parallel, but because parallel lines seem to converge with distance, these framing lines appear to point directly at pyramids. Other lines run parallel to roads that are still used today, Stanish said.\n\"I don't think people needed the signposts, but it was more kind of a ritualized thing, where you come down and everything's prepared,\" he said.\nIn that way, Stanish said, the lines are like pottery: one invention used for multiple purposes.\n\"Native Americans in this part of the world were extremely ingenious,\" he said.\n-- Stephanie Pappas, Live Science\nThis is a condensed version of a report from LiveScience. Read the full report. Follow Stephanie Pappas on Twitter and Google+. Follow @livescience on Twitter, Facebook & Google+.\nCopyright 2014 LiveScience, a TechMediaNetwork company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","url":"https://www.nbcnews.com/science/science-news/mysterious-rock-lines-marked-way-ancient-peru-fairs-n97511"}
