{"authors":["Alexandra Klausner For Dailymail.Com"],"date_download":"2018-10-23 02:26:08","date_modify":"2018-10-23 02:26:08","date_publish":"2016-01-28 17:13:06","description":"Don Harris, 77, the president of the Maricopa County NAACP was asked to resign on Wednesday night after he told Phoenix, Arizona reporter Monique Griego she had 'nice t**s.'","filename":"data/vaneerConsumption/NAACPleaderfacescallsforresignationafterhesaysreporterhasnicets.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC45A000000578-0-image-a-11_1454001141088.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421241_NAACP-leader-faces-calls-resignation-says-reporter-nice-t-s_1540261568.html","title":"NAACP leader faces calls for resignation after he says reporter has 'nice t**s'","title_page":"NAACP leader faces calls for resignation after he says reporter has 'nice t**s' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"privilege' makes it ok to direct a comment at a Latina woman\nRev. Jarrett Maupin said he is fine with a white NAACP leader just not one whose 'white\nThe president of the Maricopa County NAACP was asked to resign on Wednesday night after he told a Phoenix, Arizona area reporter she had 'nice t**s'.\nDon Harris, who is president of the civil rights chapter even though he is white, was speaking with 12 News' Monique Griego On Tuesday about a recent racist incident at an Arizona high school.\nTeens at Desert Vista High School were wearing letter shirts for a class picture day and used their wardrobe to spell out the word 'NI**ER' for a photograph last week.\nScroll down for audio\nNAACP leader: Don Harris, the white president of the NAACP in Maricopa County, was asked to resign on Wednesday after he made a sexist comment about a TV reporter\nSexist comment: Don Harris was caught on audio saying that reporter Monica Griego has 'nice tits' after discussing a racist incident at a high school\nHarris was one of 50 community leaders who gathered for a private meeting to speak out against the incident before making the side comment about Griego which was caught on tape by the Phoenix New Times.\nHe told Griego of the meeting: 'It doesn't fix anything. We're on a pathway now to making things better.'\nWhen Griego turned to ask a question to someone else, Harris made the lewd remark.\nWhen asked by the Phoenix New Times if there should be any efforts to rid the world of sexist comments after his gaffe became public he responded: 'I'm going to slash my wrists,' he said.\n'Better yet, I'm going to throw myself out of a f**king window, except I'm on the first floor... I'm one of the best goddamned people in the state,' he added in a bizarre rant.\nAfter news of his string of offensive comments broke, Harris said he emailed executive board members of the Maricopa County NAACP to offer his resignation if they wanted it.\n'I said if they want me gone, I'm gone,' he told The Arizona Republic.\n'I'm not ducking from anything. I did something stupid and wrong and I'm sorry for it. I can't beat myself forever about it. I said it. And I can't be any more sincere,' he added.\nThe Rev. Jarrett Maupin called for Harris' resignation on Wednesday evening in a press release.\nHigh school drama: Harris was one of 50 community leaders who gathered for a private meeting to speak out against this racist incident before making the side comment about Griego\nFriendship: Harris has been linked to some controversial town figures like Maricopa County’s Trump-supporting sheriff Joe Arpaio with whom he is friends\nRev. Jarrett Maupin told the Daily News that he was fine with a white man being leader of a NAACP chapter but added that the president's sexist comment at a Latina woman is a sign of 'white privilege'.\n'When you have a certain amount of privilege in your mind, you’ll say what you want about anything,' he said.\nMaupin told the Daily News he was also troubled about the setting in which the comment was made since it was during a discussion about curbing racism at schools.\nThe chapter's vice president Ann Hart said that the NAACP does not stand by Harris' words but that he has done good work for the organization and that his resignation is 'up to him.'\nGriego said on Wednesday night that she didn’t hear the 'nice t**s' comment and does not want to make a comment.\nHarris has said that he gave up his law practice in order to devote more time to the NAACP.\nHarris has been linked to some controversial town figures like Maricopa County’s Trump-supporting sheriff Joe Arpaio with whom he is friends.\n'Longtime friend Don Harris came by my office. He's the new head of local NAACP. I expect a great relationship,' tweeted Arpaio last January along with a picture of the two men together.\nHarris spoke to CNN’s Anderson Cooper about Rachel Dolezal last year, another controversial white NAACP leader.\n'You’ve gotta have credibility,' he said. 'Once you lose that credibility, the efficacy of your leadership fails.'","url":"https://www.dailymail.co.uk/news/article-3421241/NAACP-leader-faces-calls-resignation-says-reporter-nice-t-s.html"}
