{"authors":["Associated Press"],"date_download":"2018-10-23 01:09:26","date_modify":"2018-10-23 01:09:26","date_publish":"2017-04-26 11:15:24","description":"BARCELONA, Spain (AP) - Defending champion Rafael Nadal cruised past Rogerio Dutra Silva of Brazil 6-1, 6-2 to reach the third round of the Barcelona Open on...","filename":"data/vaneerConsumption/NadalandMurrayadvanceto3rdroundinBarcelonaOpen.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/22/wire-468265-1493243375-784_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4447112_Murray-advances-Barcelona-injured-Tomic-withdraws_1540256966.html","title":"Nadal and Murray advance to 3rd round in Barcelona Open","title_page":"Nadal and Murray advance to 3rd round in Barcelona Open | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"BARCELONA, Spain (AP) - Defending champion Rafael Nadal cruised past Rogerio Dutra Silva of Brazil 6-1, 6-2 to reach the third round of the Barcelona Open on Wednesday.\nTop-seeded Andy Murray also advanced, but without having to play as Bernard Tomic withdrew before their second-round match because of a lower back injury.\nNadal, making his debut at the newly named \"Rafa Nadal\" center court in Barcelona, had a slow start to the second set against the 69th-ranked Brazilian, but recovered by winning the final six games to secure the victory.\nRafael Nadal of Spain returns a shot to Rogerio Dutra Silva of Brazil during the Barcelona Open Tennis Tournament in Barcelona, Spain, Wednesday, April 26, 2017. (AP Photo/Manu Fernandez)\n\"I think I played a solid match. I think it was a comfortable win,\" Nadal said. \"I played well, with the right intensity against a player that came in with a lot of victories on clay this year.\"\nThe fifth-ranked Nadal is a nine-time champion at the clay-court tournament. He is coming off his 10th title at the Monte Carlo Masters.\nNadal will next play Kevin Anderson of South Africa.\nThe top-ranked Murray was originally going to skip the Barcelona Open but decided to play after being eliminated in the third round at the Monte Carlo Masters, when he blew a 4-0 lead in the deciding set to Albert Ramos-Vinolas.\nMurray is trying to regain his form going into the French Open following a right elbow injury that kept him out of the Miami Open and the Davis Cup quarterfinals.\nHe will play 40th-ranked Feliciano Lopez of Spain, who defeated Albert Montanes 6-2, 6-2.\nIt was the final career match for Montanes, who had announced last week that the Barcelona Open would be his last tournament after nearly 20 years on tour.\nThe 36-year-old Barcelona resident won six ATP titles and was ranked a career-high 22nd in 2010. His first-round victory over Guillermo Garcia-Lopez on Monday was the 255th of his career.\nIn other second round matches, fifth-seeded David Goffin of Belgium defeated Nikoloz Basilashvili 7-5, 6-0, while qualifier Hyeon Chung of South Korea beat 12th-seeded Philipp Kohlschreiber of Germany 6-3, 6-4.\nRafael Nadal of Spain prepares to return a shot to Rogerio Dutra Silva of Brazil during the Barcelona Open Tennis Tournament in Barcelona, Spain, Wednesday, April 26, 2017. (AP Photo/Manu Fernandez)\nRafael Nadal of Spain returns a shot to Rogerio Dutra Silva of Brazil during the Barcelona Open Tennis Tournament in Barcelona, Spain, Wednesday, April 26, 2017. (AP Photo/Manu Fernandez)","url":"https://www.dailymail.co.uk/wires/ap/article-4447112/Murray-advances-Barcelona-injured-Tomic-withdraws.html"}
