{"authors":[],"date_download":"2018-10-22 20:37:14","date_modify":"2018-10-22 20:37:14","date_publish":"2014-05-02 19:05:33","description":"Fruit of the Loom is launching a new line of boxer briefs with the Naked Cowboy, who walks around Times Square in his underwear strumming a guitar.","filename":"data/vaneerConsumption/NakedCowboyChangesUnderwearforFruitoftheLoomCampaign.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_18/417391/140502-140502-cowboy-1457_384bf55479053f21f22f9bd9ac600eb4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_consumer_naked-cowboy-changes-underwear-fruit-loom-campaign-n95901_1540240634.html","title":"Naked Cowboy Changes Underwear for Fruit of the Loom Campaign","title_page":"Naked Cowboy Changes Underwear for Fruit of the Loom Campaign ","title_rss":"NULL","source_domain":"nbcnews.com","text":"The Naked Cowboy — real name Robert Burck — will launch the new line with promotions on Tuesday. While he usually wears traditional white briefs, ten-gallon hat and cowboy boots (for tips), the marketing campaign will see him switch to Fruit of the Loom's new underwear, which have tapered legs to prevent them from riding up.\n\"His primary wardrobe is so important to his daily job, we thought why not showcase him in our new boxer briefs,\" said Melissa Burgess-Taylor, senior vice president for marketing and merchandising for Fruit of the Loom.\nAn accompanying billboard on the Nasdaq Tower in Times Square will read: \"Even the Naked Cowboy has changed his underwear.\" The campaign makes sense as Burck is photographed by thousands of tourists daily in the square in the heart of midtown Manhattan.\nThe company wouldn't disclose what it is spending on the campaign. A separate TV campaign shows men and women performing jobs like orchestra conductor and baseball grounds crew performing in their underwear.\n- The Associated Press","url":"https://www.nbcnews.com/business/consumer/naked-cowboy-changes-underwear-fruit-loom-campaign-n95901"}
