{"authors":["Michelle Andrews"],"date_download":"2018-10-23 05:38:29","date_modify":"2018-10-23 05:38:29","date_publish":"2016-11-12 00:00:00","description":"Members of the military are more than twice as likely to have hepatitis C as the general public. For many, including Jim McGough, the virus takes its final toll decades after they are first infected.","filename":"data/vaneerConsumption/NameOfAVietnamVeteranKilledByHepatitisCAddedToTheWall.json","image_url":"https://media.npr.org/assets/img/2016/11/08/jim-mccough1971_wide-5d417374299b1eeb8f293957f72f586bbe5015d3.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2016_11_12_501172064_name-of-a-vietnam-veteran-killed-by-hepatitis-c-added-to-the-wall_1540273109.html","title":"Name Of A Vietnam Veteran Killed By Hepatitis C Added To 'The Wall'","title_page":"Vietnam Veteran Killed by Hepatitis C Now Memorialized, Too : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Name Of A Vietnam Veteran Killed By Hepatitis C Added To 'The Wall'\nEnlarge this image toggle caption Gordon Gammack/The Des Moines Register Gordon Gammack/The Des Moines Register\nThe Vietnam War ended more than 40 years ago, but it continues to claim military lives. Nearly every spring new names are etched into the black granite walls of the Vietnam Veterans Memorial in Washington, D.C., which pays tribute to the more than 58,000 service members who lost their lives.\nJim McGough is one of them. As a 19-year-old infantry soldier in 1971, Army Specialist McGough was with members of his unit near the Laotian border when came under fire. A grenade exploded nearby, tearing apart his feet and lower legs. McGough was taken by medevac to Okinawa, where he underwent surgery, including a transfusion to replace the blood he had lost. Unable to wear army boots after the injury, he was shipped back to the United States, where he married his high school sweetheart, Sheryl Isaacson. They settled down near their hometown of Fort Dodge, Iowa.\nTwenty years passed before McGough, who worked in magazine advertising sales, learned that he had hepatitis C, a bloodborne viral infection that attacks the liver and can cause scarring, called cirrhosis, as well as liver cancer. The virus only was discovered in 1989, and routine testing of the blood supply began shortly afterward. It was about that time that McGough, a regular blood donor, learned he had been infected. He'd never used intravenous drug or gotten tattoos — common routes of infection — so the McGoughs figured Jim must have contracted the virus when he had the blood transfusion in Japan.\nVeterans are more than twice as likely to have hepatitis C as members of the general population, studies have found. The virus is significantly more common among Vietnam era veterans than those of any other service era.\nMcGough went to a liver specialist, who found no damage. The standard treatment at the time, a combination of the drugs interferon and ribavirin, had debilitating side effects. So Jim and Sheryl decided not to do anything about his infection.\n\"We were having a great time,\" says Sheryl, now 62. \"We're going, 'No big deal.' When you're young, you're invincible.\"\nBut in his late 40s, Jim started to show signs of liver damage. About that time, he and Sheryl took a trip to the nation's capital, and visited the Vietnam Veterans Memorial. He thought it was magnificent, Sheryl remembers, and told her, \"If this thing kills me, I want to get my name added.\"\nEnlarge this image toggle caption Courtesy of Sheryl Issacson McGough Courtesy of Sheryl Issacson McGough\nIn January 2014, the virus did kill him. Jim had gone through the interferon treatment by then, but couldn't shake the disease. He finally succumbed to liver cancer.\nIn order to have their names added to \"The Wall,\" Vietnam veterans must meet criteria established by the Department of Defense. Many of the 376 names that have been added since the memorial was completed in 1982 are people who died during the war or shortly afterward but whose records were misplaced, for example, or who were overlooked for other reasons. Their deaths generally must be the result of injuries sustained during the war in Vietnam or a defined combat zone. A number of causes of death don't qualify, including exposure to the defoliant Agent Orange or similar chemicals, illness or suicide related to post-traumatic stress disorder, diabetes, cancer and heart attack.\n\"They reject far more than they accept,\" says Tim Tetz, director of outreach for the Vietnam Veterans Memorial Fund, which founded the memorial and is responsible for adding new names to it.\nIn McGough's case, at the bottom of a box in the family's basement, Jim and Sheryl found a handwritten note from a nurse in Okinawa, ordering a blood transfusion for Jim the day after he was wounded. That was the documentation they needed to prove his disease was service-related, so he could qualify for veteran's disability benefits. Eventually, after a lengthy application and evaluation, the approval to add McGough's name to the memorial was granted.\nIn addition to Jim McGough, seven names were inscribed in 2016. There's not much room left to add more names, Tetz says, at least not long ones. There's space for one more long name, he says, fewer than 20 medium-length names and many more short ones. It's an issue that the National Park Service is wrestling with, according to Tetz.\nIn 2013, the first of a number of pricey new drugs was approved by the Food and Drug Administration that cure hepatitis C in as little as eight weeks with relatively few side effects. Yet the price tags for a course of treatment, which can exceed $84,000 created financial challenges for programs like the Veterans Health Administration.\nEnlarge this image toggle caption Courtesy of Sheryl Issacson McGough Courtesy of Sheryl Issacson McGough\nAfter additional financial support from Congress, the VHA has been able to treat many more veterans; the number of those who are eligible and still waiting for treatment has dropped in the past year from 145,000 to 71,000, says Dr. David Ross, director of the HIV, Hepatitis, and Public Health Pathogens Programs at Department of Veterans Affairs.\nIt was all too late for McGough, though, who died just weeks before the first of these drugs came on the market.\n\"I can hardly bear to watch those commercials,\" said Sheryl Isaacson McGough. \"It's just heartbreaking.\"\nKaiser Health News is an editorially independent news service that is part of the nonpartisan Henry J. Kaiser Family Foundation. Michelle Andrews is on Twitter:@mandrews110.","url":"https://www.npr.org/sections/health-shots/2016/11/12/501172064/name-of-a-vietnam-veteran-killed-by-hepatitis-c-added-to-the-wall"}
