{"authors":["Lauren Holter"],"date_download":"2018-10-31 01:46:51","date_modify":"2018-10-31 01:46:51","date_publish":"2018-09-06 15:48:11","description":"Despite serving in Congress for more than three decades, Nancy Pelosi's new TIME magazine cover marks the first issue that's granted her that honor. Entitled \"The Persistence of Nancy Pelosi,\" the cover story encapsulates that very fact, as well…","filename":"data/vaneerConsumption/NancyPelosisTIMECoverIsHugelySignificantForTheDemocraticLeader.json","image_url":"https://imgix.bustle.com/uploads/getty/2018/9/6/c1bdd9b4-8bb0-4b36-afd2-33a80a36a504-getty-969182438.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_nancy-pelosis-time-cover-is-hugely-significant-for-the-democratic-leader-11774610_1540950411.html","title":"Nancy Pelosi's 'TIME' Cover Is Hugely Significant For The Democratic Leader","title_page":"Nancy Pelosi's 'TIME' Cover Is Hugely Significant For The Democratic Leader","title_rss":"NULL","source_domain":"bustle.com","text":"Despite serving in Congress for more than three decades, Nancy Pelosi's new TIME magazine cover marks the first issue that's granted her that honor. Entitled \"The Persistence of Nancy Pelosi,\" the cover story encapsulates that very fact, as well explains why she's so determined to stay on Capitol Hill.\n\"Nancy Pelosi stopped caring about what people think of her a long time ago, so she has no qualms about eating ice cream for breakfast with a stranger. Dark chocolate, two scoops, waffle cone,\" Molly Ball's TIME cover story begins.\nThe House minority leader and former speaker of the House has represented California in Congress since 1987. As Ball points out, Pelosi \"knows what her critics say about her: that she’s too old, too 'toxic,' too polarizing; that after three decades in Congress and 15 years leading her party’s caucus, she has had her turn and needs to get out of the way.\" Yet she told TIME she refuses to leave Congress without another woman serving in an equal or higher elected position.\nHer TIME cover was a long time coming, as she's previously commented that former House Speaker John Boehner and Senate Majority Leader Mitch McConnell have both graced the cover.\n\"I was never on the TIME magazine cover even though I was the first woman to be [Speaker],\" Pelosi said at a 2014 press conference, as CNN reported. \"Isn't that a curiosity? That the Republicans win, Boehner's on TIME magazine. Mitch McConnell wins, he's on the cover of TIME magazine. Isn't there a pattern here?\"\nShe similarly called out critics in that same press conference who asserted she should resign after Democrats lost the House, asking the last time McConnell was told he should step aside because his part lost control of the Senate.\n\"It's just interesting as a woman to see how many times that question is asked... and how many times that question is never asked of Mitch McConnell,\" she told reporters. \"I'm here as long as my members want me to be here, as long as there's a reason to be here. I'm not here on a schedule, on anything except a mission to get a job done.\"\nAlthough some on Twitter claimed this was the first time Pelosi was featured on the cover of any major national magazine, she was actually on the cover of New York magazine in 2009 while serving as speaker of the House.\nPelosi also appeared on a 2011 cover of Ms. magazine that took a dig at the other magazines that hadn't yet featured the first female speaker of the House. “The Woman Time and Newsweek Won’t Put On Their Covers,\" the Ms. magazine cover read.\nOver the years, Pelosi has pointed to this discrepancy as an example of the ways men and women in politics are treated differently. In a 2010 interview with The New York Times, she said:\nWhen I became the speaker, we won 30 seats. It was a victorious thing — I was the first woman speaker. It didn’t get that much play. And I’m not a publicity seeker, so it was OK with me. Boehner, before the election, they had him on the cover of Newsweek. Now he’s on the cover of Time, and women are coming to me and saying, 'Is the job less important when a woman holds it?'\nShe now has her own TIME cover to point to, after all these years.","url":"https://www.bustle.com/p/nancy-pelosis-time-cover-is-hugely-significant-for-the-democratic-leader-11774610"}
