{"authors":["Caroline May"],"date_download":"2018-10-30 22:16:07","date_modify":"2018-10-30 22:16:07","date_publish":"2015-07-16 17:07:00","description":"While Pelosi said she remains supportive of the sanctuary policies she expressed sympathy for the Steinle family.","filename":"data/vaneerConsumption/NancyPelosiOnSanFranciscoISupportTheSanctuary.json","image_url":"https://media.breitbart.com/media/2015/07/Pelosi-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_16__1540937767.html","title":"Nancy Pelosi On San Francisco : ‘I Support The Sanctuary’","title_page":"Nancy Pelosi On San Francisco : ‘I Support The Sanctuary’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"House Democratic Leader Nancy Pelosi (R-CA) says she still supports San Francisco’s sanctuary city policies, despite the murder of a young women allegedly by a multiple-deportee, multiple-felon illegal immigrant released from custody due to those policies.\n“I support the sanctuary,” Pelosi told reporters Thursday.\nPelosi’s support for San Francisco as a sanctuary city comes as its policies are under fire for leading to Kathryn Steinle’s murder, allegedly by an illegal immigrant with a long rap sheet who had been deported at least five times.\nAsked about the case and Republican calls for mandatory minimum sentences for illegal immigrants who reenter the U.S. after a prior deportation, Pelosi said she has not supported minimum sentences.\n“Mandatory minimum sentences have not been something I have supported,” she said, recalling federal judges who have requested discretion on sentencing matters but noted that a prior Democratic immigration bill had a graduated sentencing structure for repeat offenders.\n“So I think that is probably a better model than is being put forth by the Republicans,” she said.\nWhile Pelosi said she remains supportive of the sanctuary policies she expressed sympathy for the Steinle family.\n“We have this terrible case and our hearts and prayers go out to the family, but in terms of your question which was the bill about mandatory minimums let me also say, if we had passed the comprehensive immigration reform — which is the answer to many of the questions that you may ask on this subject — then we’d be in a better place,” she said.","url":"https://www.breitbart.com/politics/2015/07/16/nancy-pelosi-on-san-francisco-i-support-the-sanctuary/"}
