{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:07:45","date_modify":"2018-10-30 18:07:45","date_publish":"2018-09-07 20:37:17","description":"Nancy Pelosi (D-CA), likely Speaker of the House if Democrats win the midterm elections, said wages only kept pace with inflation.","filename":"data/vaneerConsumption/NancyPelosiTrashesJobsReportAnalystsCallGreatestofAllTime.json","image_url":"https://media.breitbart.com/media/2018/08/Another-Nancy-Pelosi-gavel-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_09_07__1540922865.html","title":"Nancy Pelosi Trashes Jobs Report Analysts Call 'Greatest of All Time'","title_page":"Nancy Pelosi Trashes Jobs Report Analysts Call 'Greatest of All Time' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"House Minority Leader Nancy Pelosi (D-CA), who would likely become Speaker of the House if Democrats win the midterm elections in November, trashed Friday’s jobs report — even though Blackrock called it “the greatest of all time.”\nThe Bureau of Labor Statistics reported that the U.S. economy created 201,000 new jobs in August — more than the 190,000 expected — and unemployment stayed at 3.9%. Moreover, wages grew 2.9% year-on-year.\nBlackrock, an investment company, praised it not just for the numbers in it, “but rather for the fact that it serves as something of a capstone.. the greatest run of job gains in US history, with 19 million new jobs created since the start of 2010,” according to CNBC’s Carl Quintanilla.\nEven former President Barack Obama, in a speech attacking President Donald Trump, acknowledged that the Trump economy was doing “great” — though he felt that he deserved credit for it, and mocked Republicans who criticized his economic record.\nBut “great” or “greatest of all time” was still not great enough for Pelosi, who tweeted that the August jobs report “further evidence that the soaring cost of living for families continues to lead to stagnant real wage growth for workers.”\nShe issued a longer statement:\nAugust’s jobs report shows that the soaring cost of living for families continues to lead to stagnant real wage growth for workers. While the wealthy and well-connected fill their pockets, hard-working men and women are struggling to keep up with everyday needs that are getting more and more expensive. Families across the country are facing soaring health costs from the GOP’s sabotage campaign and skyrocketing prescription drug prices from the same Big Pharma companies that were just handed massive unpaid-for tax breaks by the GOP tax scam for the rich. But instead of fighting for families and seniors, the Republican Congress wants to add even more to the deficit with even bigger tax breaks for the wealthiest 1 percent, hoping to force cuts to Medicare, Medicaid and Social Security. The American people deserve better than a Republican Congress and Administration that ransacks their pocketbooks and futures again and again, just to enrich the GOP’s special interest friends. Democrats are fighting For The People: lowering their health care costs and prescription drug prices, increasing pay through strong economic growth by rebuilding America, and cleaning up corruption to make Washington work for the American people.\nThe inflation rate is currently reported to be 2.9%.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/politics/2018/09/07/nancy-pelosi-trashes-jobs-report-analysts-call-greatest-of-all-time/"}
