{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:07:29","date_modify":"2018-10-30 18:07:29","date_publish":"2018-09-04 12:54:01","description":"House Minority Leader Nancy Pelosi (D-CA) rebuked a National Public Radio reporter for asking her about her prospects to return as Speaker.","filename":"data/vaneerConsumption/NancyPelosiRebukesNPRReporterforAskingHerAboutSpeakersJob.json","image_url":"https://media.breitbart.com/media/2018/08/Nancy-Pelosi-gavel-Associated-Press.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2018_09_04__1540922849.html","title":"Nancy Pelosi Rebukes NPR Reporter for Asking Her About Speaker's Job","title_page":"Nancy Pelosi Rebukes NPR Reporter for Asking Her About Speaker's Job | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"House Minority Leader Nancy Pelosi (D-CA) rebuked a National Public Radio reporter for asking her about her prospects to return as Speaker of the House if Democrats win the November midterm elections.\nNPR reported Monday:\nHouse Minority Leader Nancy Pelosi has gotten fed up with all the speculation. “It is the least important question you could ask,” she told NPR, “with all due respect to your list of questions there.” The question, of course, is whether Pelosi would have enough votes to retake the Speaker’s gavel if Democrats win back control of Congress in November. Republicans have focused their advertising fire on Pelosi this year, and as a result, she and many Democratic candidates are hearing that question a lot. “You wake up each day thinking, what can I do to advance what I believe in, to make the future better. And then some reporter comes up and asks you: ‘who are you going to vote for for leader?'” Pelosi said. “The most important thing is, what does this election mean for the American people?”\nPelosi lost the job after leading her party to a crushing defeat in 2010, thanks to her efforts to push Obamacare through the House, along with massive government spending bills.\nRather than resigning — as political leaders in most countries do when suffering defeat — she clung to power and pushed aside all rivals, continuing to exert the centralized control she wielded when in power.\nThough she came to the Speaker’s office in 2007 with promises to “drain the swamp,” she reneged almost immediately on that pledge by backing Rep. Jack Murtha (D-PA) to be her deputy. She is making similar promises today, vowing to take up Democrats’ efforts to paralyze the Trump administration with investigations.\nSeveral dozen Democratic Party candidates have pledged not to vote for Pelosi as Speaker, as have those who have won special elections in the past several months. But Pelosi is the party’s most prolific fundraiser and has effectively bought the support of her caucus by funneling cash to their campaigns.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/the-media/2018/09/04/nancy-pelosi-rebukes-npr-reporter-for-asking-her-about-speakers-job/"}
