{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:11:08","date_modify":"2018-10-30 20:11:08","date_publish":"2015-01-27 05:58:08","description":"Responding to Nancy Pelosi, Archbishop Cordileone said “no Catholic can dissent in good conscience” from the Church’s teaching on abortion.","filename":"data/vaneerConsumption/NancyPelosiIHaveGreatStandingtoSpeakonAbortionasaCatholicandaMomofFive.json","image_url":"https://media.breitbart.com/media/2015/01/Nancy-Pelosi-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_01_26__1540930268.html","title":"Nancy Pelosi: I Have ‘Great Standing’ to Speak on Abortion as a ‘Catholic and a Mom of Five’","title_page":"Nancy Pelosi: I Have ‘Great Standing’ to Speak on Abortion as a ‘Catholic and a Mom of Five’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Responding to pro-abortion House Minority Leader Nancy Pelosi’s statement last week that she had “great standing” to speak about the issue of abortion because she is a “Catholic and a mom of five,” San Francisco Archbishop Salvatore Cordileone said that “no Catholic can dissent in good conscience” from the Church’s teaching on the sanctity of human life.\nAs CNSNews.com reports, Pelosi would not say during her January 22 press briefing whether a 20-week-old unborn child is a “human being.” She said, however, that it was “true” she knew “more about having babies than the pope,” and that a woman has “the right” to an abortion.\n“The fact is, is what we have said: the life and the health of the mother is what is preeminent in when a decision is made about a woman’s reproductive health,” Pelosi said, after refusing to respond to the question of whether an unborn child at 20 weeks is a human being. “It isn’t an ideological fight; it is a personal health issue.”\n“So, in any event, this is up to women, their conscience, their God, their doctor, their health, their fate, their survival. And that is what the decision should be,” Pelosi added. “Decisions about women’s reproductive health should not be made by politicians in Washington, D.C. but should honor the decisions that have been made by the Supreme Court, a decision made by the Supreme Court, recognizing the right of women to have that choice.”\n“It is a scientific fact that human life begins at conception,” the archbishop wrote to CNSNews.com. “This has been established in medical science for over 100 years. Catholic moral teaching acknowledges this scientific fact, and has always affirmed the grave moral evil of taking an innocent human life.”\n“This has been the consistent teaching of the Church from the very beginning, a teaching already discernible in the natural moral law, and so a teaching from which no Catholic can dissent in good conscience,” he added.\n“It is the obligation of pastors of souls to reach out to their people who have difficulty understanding and accepting such important teachings of the Church in order to extend to them true pastoral care and, where appropriate, to establish a regular dialogue.”\nPelosi said she was opposed to the Pain Capable Unborn Child Protection Act—which was pulled from a vote in the House last week after a group of Republicans, led by Rep. Renee Ellmers, objected to some language in the bill—and the No Taxpayer Funding of Abortion and Abortion Insurance Full Disclosure Act.\nRegarding the failure of the House to vote on the Pain Capable bill, which would ban late-term abortions past the fifth month of pregnancy, Rep. Tim Huelskamp (R-KS) said in a statement to Breitbart News, “Actions like pulling this important pro-life bill from the House floor, when we clearly had the votes for passage, again demonstrates exactly why grassroots conservatives do not trust Republican leadership in Washington.”\n“New polling shows tremendous support for this bill – and it should be sent to the Senate and then onto the President’s desk as soon as possible,” Huelskamp added. “Being the Party of Life doesn’t mean just passing one pro-life bill one day of the year, it means Republicans should fight for the sanctity of human life at every turn. Doing anything less is not only political suicide – it is simply wrong.”","url":"https://www.breitbart.com/politics/2015/01/26/nancy-pelosi-i-have-great-standing-to-speak-on-abortion-as-a-catholic-and-a-mom-of-five/"}
