{"authors":["Jake Polden For Mailonline"],"date_download":"2018-10-23 02:24:34","date_modify":"2018-10-23 02:24:34","date_publish":"2016-01-11 14:27:03","description":"Mary Cooksey Patterson, who lives in Sumrall, Mississippi, recorded her grandparents looking at images from her recent pregnancy scan before the family announced she was expecting triplets.","filename":"data/vaneerConsumption/NanMaryCookseyPattersondiscovershergranddaughterisexpecting3babies.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300AB81B00000578-0-image-a-99_1452521630225.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393925_Is-twins-s-triplets-priceless-moment-nan-discovers-granddaughter-expecting-THREE-babies-contain-excitement_1540261474.html","title":"Nan Mary Cooksey Patterson discovers her granddaughter is expecting 3 babies","title_page":"Nan Mary Cooksey Patterson discovers her granddaughter is expecting 3 babies | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This is the heartwarming moment a great-grandmother-to-be discovered her pregnant granddaughter was going to have triplets - and could not contain her excitement.\nMary Cooksey Patterson, who lives in Sumrall, Mississippi, recorded her grandparents looking at images from her recent pregnancy scan.\nGoing through the pictures, the grandmother asks: 'Is that it right there?' while attempting to point out the image of the baby.\n'Look at that little baby': The grandmother is filmed pointing out her great-grandchild in the scan image\nMary, who holds the camera,asks: 'What does that one say,' alluding to the fact that the pictures are marked to show they capture different babies.\nBut her excited grandmother misses the question and instead starts shouting: 'Oh yeah, yeah, look at that little baby'.\nShe then begins pointing out the image to the rest of the family huddled around her before proudly stating: 'That little baby is completely formed'.\n'That little baby is completely formed': The video maker films her nan beaming with pride while looking through the pictures\nA family member then takes two of the scan images from the woman and asks her to read what is written alongside the picture of the baby.\nAnother woman says: 'Baby A,' before the man shows the grandmother the other image, which reads 'Baby B'.\nReacting in shock, the nan jumps backwards and shouts: 'No, twins,' before asking the video maker excitedly: 'Is it twins?'\nA family member takes two of the scan images from the nan and asks her to read what is written alongside the picture of the baby\nMary stays silent - presumably because there is another surprise in store - and waits for a family member to read the words: 'Baby C'.\nThe grandmother, who appears to be lost in the excitement of it all, continues to ask: 'What? What? Is it twins?' before the family collectively announces that Mary is expecting triplets.\nThe video maker is then approached by her grandmother, who grabs hold of her and asks whether the news is true.\nReacting in shock the woman jumps backwards and asks her granddaughter to confirm she is expecting twins\nMary replies that it is and films her gran screaming in excitement while clasping her hands in delight.\nSince appearing on YouTube the video has been viewed more than 75,000 times and a number of users have commented on the gran's reaction.\nOne viewer wrote: 'That almost made me cry. So sweet'.","url":"https://www.dailymail.co.uk/news/article-3393925/Is-twins-s-triplets-priceless-moment-nan-discovers-granddaughter-expecting-THREE-babies-contain-excitement.html"}
