{"authors":["Associated Press"],"date_download":"2018-10-23 02:34:47","date_modify":"2018-10-23 02:34:47","date_publish":"2017-03-16 13:14:46","description":"This nan pizza is a fun way to eat the flavors of India in America's favorite food. The popular chicken tikka masala is widely believed to have been created...","filename":"data/vaneerConsumption/NanPizzaisafunwaytoeattheflavorsofIndia.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/13/wire-228517-1489670097-144_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320198_Nan-Pizza-fun-way-eat-flavors-India_1540262087.html","title":"Nan Pizza is a fun way to eat the flavors of India","title_page":"Nan Pizza is a fun way to eat the flavors of India | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"This nan pizza is a fun way to eat the flavors of India in America's favorite food. The popular chicken tikka masala is widely believed to have been created in England for the British palate and is actually the national dish. But it is so tasty that restaurant diners have demanded that the dish is made worldwide.\nThese days, nan - Indian flatbread - is available in nearly every grocery store. It can be plain or flavored, and even stuffed.\nNan used to be an occasional treat when I'd go out to eat at an Indian restaurant. It was hard not to fill up on the nan before the meal arrived. But now that nan is as available as pita bread, you can enjoy it at home.\nThis Jan. 20, 2017 photo shows nan pizza at the Institute of Culinary Education in New York. This dish is from a recipe by Elizabeth Karmel. (AP Photo/Richard Drew)\nThe small size and light and airy texture of store-bought nan makes it a shoe-in for a quick pre-made pizza crust. And because I wanted to keep the pizza in the spirit of India, I am topping the pizza with chicken tikka masala which is tailor-made for pizza as it is the sauce and toppings in one. The ever-popular dish is chock-full of chunks of chicken simmered in an aromatic, creamy and slightly spicy tomato sauce full of onions, garlic, ginger, cumin and turmeric.\nThis sauce is the perfect thing to brighten up a boneless, skinless chicken breast and will \"dress\" to impress grilled shrimp, pork and countless vegetables. I used to think that I could only have this exotic sauce in an Indian restaurant, but truth be told, it is one of the easiest pan sauces to make.\n___\nNAN PIZZA WITH CHICKEN TIKKA MASALA\nServings: 6\nStart to finish: 55 minutes\n2 tablespoons clarified butter (ghee)\n1 tablespoon olive oil\n2 cups white onions, finely chopped (1 large onion)\n3 cloves garlic, grated\n1 inch piece of ginger root, grated\n3 tablespoons tomato paste\n2 teaspoons smoked sweet paprika\n1 teaspoon ground cumin\n¼ teaspoon cayenne pepper\n1 teaspoon sea salt\n½ teaspoon turmeric powder\n¼ teaspoon ground cinnamon\n2 cups crushed tomatoes\n½ cup heavy whipping cream or sour cream\n2 boneless skinless chicken breasts, cut into 1-inch cubes\n2 cups grated mozzarella cheese\n4 tablespoons grated Parmesan cheese\n4 prepared nan bread\nHeat clarified butter or ghee and olive oil in a heavy-bottom saucepan. Sautee onions until translucent. Add garlic and ginger. Stir to combine and continue sauteing until the garlic and ginger begin to turn golden.\nAdd tomato paste, paprika, cumin, cayenne, salt, turmeric and cinnamon. Saute for a couple more minutes to \"toast\" the spices.\nAdd the crushed tomatoes and chunks of chicken. Bring to a boil; reduce heat and simmer about 20 minutes with the lid on. Stir occasionally. Stir in cream. Continue to simmer on low heat with the lid off, stirring occasionally until the sauce is reduced and the consistency of thick gravy. The sauce can be made in advance and kept for 2 days in the refrigerator.\nTo use: Preheat oven to 400 F. Lay the nan out on a rack set into a sheet pan and sprinkle a small amount of the grated cheese on the bread. Top the cheese with the tikka masala, leaving a ½ inch border around the edge. Sprinkle the top with more grated cheese. Place in the oven for about 15 minutes. The pizza is done when the cheese is melted and the edges are crisp.\nRemove from the oven and brush the edges with a little olive oil while it is still hot. Serve and enjoy.\n___\nNutrition information per serving: 490 calories; 227 calories from fat; 25 g fat (13 g saturated; 0 g trans fats); 92 mg cholesterol; 975 mg sodium; 41 g carbohydrate; 4 g fiber; 7 g sugar; 28 g protein.\n___\nEDITOR'S NOTE: Elizabeth Karmel is a barbecue and Southern foods expert. She is the chef and pit master at online retailer CarolinaCueToGo.com and the author of three books, including \"Taming the Flame.\"","url":"https://www.dailymail.co.uk/wires/ap/article-4320198/Nan-Pizza-fun-way-eat-flavors-India.html"}
