{"authors":["Kirspencer For Daily Mail Australia"],"date_download":"2018-10-22 23:01:27","date_modify":"2018-10-22 23:01:27","date_publish":"2017-03-10 01:51:18","description":"She's the Oscar-nominated actress who was recently spotted sharing an emotional hug with her former partner Liev Schreiber.","filename":"data/vaneerConsumption/NaomiWattslooksrelaxedonschoolruninNewYork.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/09/23/3E1ECA7D00000578-0-image-a-42_1489102456591.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299286_Naomi-Watts-looks-relaxed-school-run-New-York_1540249287.html","title":"Naomi Watts looks relaxed on school run in New York","title_page":"Naomi Watts looks relaxed on school run in New York | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's the Oscar-nominated actress who was recently spotted sharing an emotional hug with her former partner Liev Schreiber.\nAnd on Thursday, mother-of-two Naomi Watts took time out of her busy schedule to focus on her family, picking up her sons from school in New York.\nThe 48-year-old appeared comfortable and confident as she pounded the pavement, carrying a black case as she ran errands with a friend.\nWatts going on? Naomi looked relaxed as she pounded the New York pavement while picking up her sons from school on Thursday\nThe King Kong actress dressed appropriately for the city's cool temperatures, sporting a long denim skirt that finished just below her ankles.\nShe paired it with a striped shirt, a black leather-look jacket and comfortable white sneakers.\nNaomi's short blonde bob framed her face, and she also wore pale pink sunglasses as she checked her phone.\nShe opted for minimal makeup on the outing, keeping a casual look and allowing her natural beauty to shine through.\nBusy mum: The British-Australian actress focused on her family, watching as one of the boys clung to a pole on the walk home from school\nWatch me! Naomi is mum to Alexander 'Sasha' Pete, nine, and Samuel 'Sammy' Kai, eight,\nThe British-Australian actress carried a black case as well as some shopping.\nShe looked in happy and relaxed spirits after running errands with a friend.\nWhile she strolled along, one of the boys decided to jump up on a pole and cling to it as his mother watched on.\nRunning errands: Naomi stepped out to run some errands with a friend, keeping things casual and comfortable in her white sneakers\nNaomi is mother to Alexander 'Sasha' Pete, nine, and Samuel 'Sammy' Kai, eight, who she shares with ex Lieve Schreiber.\nThe couple were together for 11 years, before separating in September last year.\nEarlier this month, they were spotted sharing an emotional embrace outside the home of Minnie Driver's older sister Kate.\nLiev, 49, planted a kiss on Naomi's cheek as the Hollywood actress wrapped her arms around his neck during their bittersweet moment.\nWhat's in the case? The blonde beauty carried a mysterious case while out in New York\nGypsy: Naomi has been busy shooting scenes in New York for her role in the upcoming HBO series Gypsy\nNaomi has been busy shooting scenes in New York for her role in the upcoming HBO series Gypsy.\nShe plays therapist Jean Holloway, who becomes too involved in her patients' lives.\nThe blonde was spotted on set last month, with the first two episodes of the 10-part series directed by Sam Taylor-Johnson.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299286/Naomi-Watts-looks-relaxed-school-run-New-York.html"}
