{"authors":["Sarah Jones For Dailymail.Com"],"date_download":"2018-10-23 04:58:53","date_modify":"2018-10-23 04:58:53","date_publish":"2017-03-10 15:04:57","description":"The 48-year-old two-time Academy Award-nominated actress opted for a low-key look as she kept concealed behind shades and dark cap while stepping out with her sons in New York City.","filename":"data/vaneerConsumption/NaomiWattsstepsoutwithhertwosonsinNYC.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/14/3E2377EA00000578-0-image-a-7_1489157814262.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4301534_Naomi-Watts-goes-incognito-steps-two-sons_1540270733.html","title":"Naomi Watts steps out with her two sons in NYC","title_page":"Naomi Watts steps out with her two sons in NYC | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She shared a warm embrace with her former partner and father of her children, Liev Schreiber, just days before.\nAnd Naomi Watts went incognito as she stepped out with her two sons - Alexander, nine, and Samuel, eight - in New York City on Thursday.\nThe 48-year-old actress kept concealed behind pale pink retro-inspired shades and a dark beanie cap.\nLow-key look: Naomi Watts went incognito as she stepped out with her two sons - Alexander, nine, and Samuel, eight - in New York City on Thursday\nThe King Kong star shielded herself from the brisk Big Apple weather in a black hooded sweatshirt.\nShe donned army green khakis, black trainers and added a pop of color with bright orange ankle socks.\nShowing off her flawless complexion and natural beauty, the two-time Oscar nominee went fresh-faced for her afternoon outing.\nThe British-Australian beauty held hands with her young boys as they made their way through the bustling streets.\nWho's that girl? The 48-year-old King Kong star kept concealed behind pale pink retro-inspired shades and a dark beanie cap\nMeanwhile, Naomi was spotted sharing an emotionally charged hug with her ex partner of 11 years last week in Brentwood, California.\nLiev, 49, planted a kiss on Naomi's cheek as the actress wrapped her arms around his neck during their tender moment.\nThe former couple were joined outside the home by Minnie Driver's older sister Kate, who has been friends with Naomi, 48, for years.\nNaomi and Liev, who announced their split on September 26, have remained amicable for the sake of their two sons.\n'New phase': Naomi shares her two sons with ex-partner of 11 years, Liev Schreiber, 49. The couple amicably split in September; they are pictured here just weeks before announcing their separation\nThe former couple released a joint statement at the time that read: 'Over the past few months we've come to the conclusion that the best way forward for us as a family is to separate as a couple.'\n'It is with great love, respect, and friendship in our hearts that we look forward to raising our children together and exploring this new phase of our relationship.'\nMeanwhile, Naomi has been busy shooting scenes in New York for her role in the upcoming HBO series Gypsy.\nShe plays therapist Jean Holloway, who becomes too involved in her patients' lives in the 10-part series directed by Sam Taylor-Johnson.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4301534/Naomi-Watts-goes-incognito-steps-two-sons.html"}
