{"authors":[],"date_download":"2018-10-30 01:12:14","date_modify":"2018-10-30 01:12:14","date_publish":"2018-08-21 00:00:00","description":"A team of scientists from NASA’s Ames Research Center, the University of Hawaii and Brown University have uncovered evidence of water ice on the moon’s surface.","filename":"data/vaneerConsumption/NASAfindsevidenceofwatericeonmoon.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/21/Videos/4465478.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_world_nasa-finds-evidence-water-ice-moon__1540861934.html","title":"NASA finds evidence of water ice on moon","title_page":"NASA news: Water ice confirmed on moon, NASA moon news","title_rss":"NULL","source_domain":"ajc.com","text":"A team of scientists from NASA’s Ames Research Center, the University of Hawaii and Brown University have uncovered evidence of water ice on the moon’s surface.\n» RELATED: NASA's response to 9-year-old job applicant is out of this world\nNASA’s Jet Propulsion Laboratory made the announcement Monday, confirming ice deposits “in the darkest and coldest parts” of the moon’s polar regions.\nThe scientists used data from NASA JPL’s Moon Mineralogy Mapper (M3) instrument, launched by the Indian Space Research Organization in 2008, to identify the ice. Their findings were published in the journal, Proceedings of the National Academy of Sciences.\n» RELATED: ‘Building blocks of life’ found on Mars, NASA reveals in new Curiosity rover announcement\nThe M3 instrument offered scientists data on ice’s reflective properties as well as data on the way its molecules absorb infrared light to help differentiate between liquid water, vapor and solid ice, according to NASA.\n“The small tilt of the rotation axes” causes topographic depressions in the moon’s polar regions, such as impact craters, researchers wrote in the study. Those depressions are permanently shadowed from sunlight, leading to extremely low surface temperatures. In fact, about 93 percent of the ice locations found exhibited annual maximum surface temperatures below 110 K s(or -262 F). And the warmest temperatures never reach more than -250 F.\n» RELATED: Scientists find thick sheets of ice just below Mars’ surface\nWhile previous observations have noted possible signs of ice on the surface of the moon, this is the first to confirm the detections.\n“With enough ice sitting at the surface -- within the top few millimeters -- water would possibly be accessible as a resource for future expeditions to explore and even stay on the Moon, and potentially easier to access than the water detected beneath the Moon's surface,” NASA wrote in the news release.\nScientists hope to continue to learn more about the ice and its interaction with the lunar environment.\nRead more about the scientists’ findings at pnas.org.","url":"https://www.ajc.com/news/world/nasa-finds-evidence-water-ice-moon/PZrNCj98tptbn0qEKF0jHL/"}
