{"authors":[],"date_download":"2018-10-30 20:18:55","date_modify":"2018-10-30 20:18:55","date_publish":"2015-12-18 12:25:42","description":"If you find an odd-looking “rock” in the Locust Grove area of Henry County, it might just be part of a meteor that came hurtling toward Earth at nearly 30,000 mph Thursday night.","filename":"data/vaneerConsumption/NASAFireballoverHenryCountywasmeteorenteringatmosphere.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/18/Images/photos.medleyphoto.8504380.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_nasa-fireball-ov_26f48023138334bc822b3bafcd9cef0f__1540930735.html","title":"NASA: Fireball over Henry County was meteor entering atmosphere","title_page":"NASA: Fireball over Henry County was meteor entering atmosphere","title_rss":"NULL","source_domain":"ajc.com","text":"If you find an odd-looking “rock” in the Locust Grove area of Henry County, it might just be part of a meteor that came hurtling toward Earth at nearly 30,000 mph Thursday night.\nOfficials with NASA have confirmed that a fireball spotted over the south metro skies just after sunset Thursday was a meteor entering the Earth’s atmosphere.\n“We have received numerous reports concerning a bright fireball that occurred over Georgia at 6:33 p.m.,” space agency officials said in a posting on the NASA Meteor Watch Facebook page. “All 6 NASA all sky meteor cameras in the southeast picked up the meteor at an altitude of 50 miles above McDonough.”\nOfficials estimated the fireball was caused by a piece of an asteroid weighing at least 150 pounds, moving at a speed of 29,000 mph.\n“The NASA cameras tracked it to an altitude of 17 miles above the town of Locust Grove, where it had slowed to a speed of 9,000 mph,” the Facebook posting said.\nThe space agency said fragments of the object possibly survived to reach the ground as meteorites, and, “if so, they are located in Henry County south of Locust Grove, or in the counties adjacent to this area.”","url":"https://www.ajc.com/news/local/nasa-fireball-over-henry-county-was-meteor-entering-atmosphere/tXwecj168NU4TPEdBtLLwO/"}
