{"authors":["Cheyenne Macdonald For Dailymail.Com"],"date_download":"2018-10-23 05:24:12","date_modify":"2018-10-23 05:24:12","date_publish":"2017-03-16 16:16:31","description":"The photo released by NASA this week shows a view of the Holden Crater in southern Margaritifer Terra, with finely layered deposits sweeping across the floor in strips of white and purple.","filename":"data/vaneerConsumption/NASAmagerevealsalookatMarsHoldenCrater.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/16/3E5553D600000578-0-image-a-13_1489680381342.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sciencetech_article-4320852_Breathtaking-image-reveals-look-Mars-Holden-Crater_1540272252.html","title":"NASA mage reveals a look at Mars' Holden Crater","title_page":"NASA mage reveals a look at Mars' Holden Crater | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A stunning new image from the Mars Reconnaissance Orbiter reveals a new glimpse at the red planet’s watery past.\nThe photo released by NASA this week shows a view of the Holden Crater in southern Margaritifer Terra, with finely layered deposits sweeping across the floor in strips of white and purple.\nAccording to the space agency, water once flowed through a breach in the crater rim, leaving the deposits in the southwestern section far more exposed.\nA stunning new image from the Mars Reconnaissance Orbiter reveals a new glimpse at the red planet’s watery past. The photo released by NASA this week shows a view of the Holden Crater in southern Margaritifer Terra, with finely layered deposits sweeping across the floor in strips of white and purple\nThe deposits are seen beneath a cap of alluvial fan material, the tan to brown section of the image, NASA explains.\nAnd, individual layers can be seen spanning hundreds of meters to kilometers.\nObservations by the MRO’s CRISM instrument suggest there may even be clay within the beds.\nBut, the beds in the alluvial fan show less continuity, which goes against assumptions on the presence of clay.\nThe deposits there may have come from runoff into a lake on the crater floor.\nEarlier this month, a view of Mars Echus Chasma revealed more insight on the behaviour of ancient water more than three billion years ago.\nAt that time, volcanic and tectonic activity on Mars caused massive amounts of groundwater to come pouring from the Echus Chasma.\nStunning new images from the ESA’s Mars Express show the scars of these ancient mega-floods snaking through the Kasei Valles region.\nThis outflow channel network is one of the largest on Mars, spanning roughly 3,000 kilometers (1,864 miles) from its source.\nA new image, captured on May 25, 2016, shows a portion at the mouth of Kasei Valles. A number of features on the Martian landscape show the effects of the massive flood\nMARS: A WET PLANET Evidence of water on Mars dates back to the Mariner 9 mission, which arrived in 1971. It revealed clues of water erosion in river beds and canyons as well as weather fronts and fogs. Viking orbiters that followed caused a revolution in our ideas about water on Mars by showing how floods broke through dams and carved deep valleys. Mars is currently in the middle of an ice age, and before this study, scientists believed liquid water could not exist on its surface. In June 2013, Curiosity found powerful evidence that water good enough to drink once flowed on Mars. In September of the same year, the first scoop of soil analysed by Curiosity revealed that fine materials on the surface of the planet contain two per cent water by weight. Last month, scientists provided the best estimates for water on Mars, claiming it once had more liquid H2) than the Arctic Ocean - and the planet kept these oceans for more than 1.5 billion years. The findings suggest there was ample time and water for life on Mars to thrive, but over the last 3.7 billion years the red planet has lost 87 per cent of its water - leaving it barren and dry.\nEchus Chasma sits east of the volcanic region Tharsis, and north of the Valles Marineris canyon system, according to the ESA.\nThe remnants of the flood stretch all the way to the plains of Chryse Planitia, roughly 3,000 km from the source.\nA new image, captured on May 25, 2016, shows a portion at the mouth of Kasei Valles.\n‘A combination of volcanism, tectonics, collapse, and subsidence in the Tharsis region led to several massive groundwater releases from Echus Chasma, which subsequently flooded the Kasei Valles region around 3.6-3.4 billion years ago,’ according to the ESA.\n‘These ancient mega-floods have left their mark on the features seen today.’\nEchus Chasma sits east of the volcanic region Tharsis, and north of the Valles Marineris canyon system, according to the ESA. The remnants of the flood stretch all the way to the plains of Chryse Planitia, roughly 3,000 km from the source\nA number of features on the Martian landscape show the effects of the massive flood.\nA huge impact crater known as the Worcester Crater survived the erosive forces.\nMaterial around the 25-km-wide crater has been eroded, but parts downstream have remained.\nAccording to the ESA, this has created the appearance of a streamlined island, suggesting there may have been varying water levels or different flood episodes.\nMore than three billion years ago, volcanic and tectonic activity on Mars caused massive amounts of groundwater to come pouring from a source known as the Echus Chasma. Stunning new images reveal the scars of the ancient mega-floods snaking through Kasei Valles\nBut, the debris blanket around a nearby crater is still intact, suggesting the impact occurred after the flood.\nAnd, it indicates that the floodplain was rich in water or water ice, with signs of a ‘splash’ as water-rich debris was ejected.\nThe view also reveals another large crater, which sits on a plateau roughly 1km higher than the plains below.\nA small depression in the center suggests a weaker layer, such as ice, was buried beneath at the time of impact.\nAnd, the ejecta has a grooved pattern that sets it apart from the rest, suggested it may have been created in a different type of impact.\nThis could have been a difference in the energy, the way the ejecta was thrown, or the composition of the plateau material, according to the ESA.\nThe plateau is surrounded by small dendritic channels, adding support to the idea of varying flood magnitudes and different episodes.\nThe images also reveal smaller craters in the plains, which appear to have lighter coloured ‘tails’ that point in a direction opposite the flood flow.\nAccording to the ESA, these were formed by impacts that happened after the flooding, with tails etched by winds blowing westward.\nBehind the crater, the dust appears undisturbed, as they were protected from wind by the raised rims.","url":"https://www.dailymail.co.uk/sciencetech/article-4320852/Breathtaking-image-reveals-look-Mars-Holden-Crater.html"}
