{"authors":[],"date_download":"2018-10-22 21:54:02","date_modify":"2018-10-22 21:54:02","date_publish":"2014-06-06 20:42:09","description":"NASA says its saucer-shaped Low-Density Supersonic Decelerator is still grounded at a U.S. Navy facility in Hawaii, waiting for favorable winds.","filename":"data/vaneerConsumption/NASAsFlyingSaucerCoolsItsJetsinHawaiianHangar.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_23/493401/140606-saucer_bde923583c09ad3317a2a56036cad212.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_nasas-flying-saucer-cools-its-jets-hawaiian-hangar-n124886_1540245242.html","title":"NASA's Flying Saucer Cools Its Jets in Hawaiian Hangar","title_page":"NASA's Flying Saucer Cools Its Jets in Hawaiian Hangar","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nTechnically speaking, NASA's Low-Density Supersonic Decelerator has a single 17,500-pound-thrust, solid-fueled rocket engine — and figuratively speaking, the saucer-shaped test vehicle is cooling its jets at the U.S. Navy's Pacific Missile Range Facility in Kauai, Hawaii, waiting for favorable winds.\nNASA spokesman David Steitz told NBC News the winds are a no-go for a Saturday launch attempt, and that means Monday is the next opportunity to loft the 15-foot-wide saucer up to 120,000 feet at the end of a helium balloon. Once that happens, the LDSD can light its engine, rocket up to 180,000 feet and open up its inflatable, doughnut-shaped drag shield to slow its supersonic descent to the Pacific Ocean.\nThe point of the uncrewed flight isn't to spark a wave of UFO sightings, but to test technologies that could be used to land bigger payloads on Mars. Check out this report to learn more about the LDSD, check in with the project's Web page to find out if Monday is a go, and keep an eye on NASA-TV's video coverage when the test takes place.","url":"https://www.nbcnews.com/science/space/nasas-flying-saucer-cools-its-jets-hawaiian-hangar-n124886"}
