{"authors":["Awr Hawkins"],"date_download":"2018-10-30 21:25:15","date_modify":"2018-10-30 21:25:15","date_publish":"2015-07-02 18:31:15","description":"NASCAR Asks Fans To 'Refrain' From Displaying Confederate Flag At NASCAR Events","filename":"data/vaneerConsumption/NASCARAsksFansToRefrainFromDisplayingConfederateFlagatEvents.json","image_url":"https://media.breitbart.com/media/2015/06/ap_ap-photo1848-1024x687.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2015_07_02__1540934715.html","title":"NASCAR Asks Fans To 'Refrain' From Displaying Confederate Flag at Events","title_page":"NASCAR Asks Fans To 'Refrain' From Displaying Confederate Flag at Events | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On July 2, NASCAR officials released a statement asking fans to “refrain” from displaying Confederate flags at NASCAR facilities and events.\nThe request comes on the heels of a Breitbart News report that Daytona International Speedway will not ban the Confederate flag at the July 5 Coke Zero 400.\nAccording to NBC News, NASCAR’s statement says:\nAs members of the NASCAR industry, we join NASCAR in the desire to make our events among the most fan-friendly, welcoming environments in all of sports and entertainment. To do that, we are asking our fans and partners to join us in a renewed effort to create an all-inclusive, even more welcoming atmosphere for all who attend our events. This will include the request to refrain from displaying the Confederate Flag at our facilities and NASCAR events.\nNASCAR did not explain how an atmosphere that excludes myriad fans who fly the flag can also be “all-inclusive,” but the organization made clear that its opposition to the Confederate flag plays as part of a broader opposition to “offensive” imagery:\nWe are committed to providing a welcoming atmosphere free of offensive symbols. This is an opportunity for NASCAR Nation to demonstrate its sense of mutual respect and acceptance for all who attend our events while collectively sharing the tremendous experience of NASCAR racing.\nNASCAR’s request that fans “refrain” from displaying the Confederate flag was signed by, “International Speedway Corporation (ISC), Auto Club Speedway, Chicagoland Speedway, Darlington Raceway, Daytona International Speedway, Homestead-Miami Speedway, Kansas Speedway, Martinsville Speedway, Michigan International Speedway, Phoenix International Raceway, Richmond International Raceway, Route 66 Raceway, Talladega Superspeedway, Watkins Glen International, Speedway Motorsports Inc. (SMI), Atlanta Motor Speedway, Bristol Motor Speedway, Charlotte Motor Speedway, Kentucky Speedway, Las Vegas Motor Speedway, New Hampshire Motor Speedway, Sonoma Raceway, Texas Motor Speedway, Dover International Speedway, Indianapolis Motor Speedway, Pocono Raceway, Iowa Speedway, Mid-Ohio Sports Car Course, Road America, Canadian Tire Motorsport Park, Eldora Speedway, [and] Gateway Motorsports Park.”\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly awrhawkins@breitbart.com.","url":"https://www.breitbart.com/sports/2015/07/02/nascar-asks-fans-to-refrain-from-displaying-confederate-flag-at-events/"}
