{"authors":["Robert J. Marlow"],"date_download":"2018-10-30 21:24:28","date_modify":"2018-10-30 21:24:28","date_publish":"2016-04-02 07:04:38","description":"Canadian authorities arrested a NASCAR driver, who last year became the the first native American to start a Sprint Cup race, and charged him as a chief operative in a tobacco-smuggling and drug-running operation. | Sports","filename":"data/vaneerConsumption/NASCARDriverBustedinBiggestCrackdownonTobaccoSmugglinginNorthAmerica.json","image_url":"https://media.breitbart.com/media/2016/04/Derek-White.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2016_04_02__1540934668.html","title":"NASCAR Driver Busted in Biggest Crackdown on Tobacco Smuggling in North America","title_page":"NASCAR Driver Busted in Biggest Crackdown on Tobacco Smuggling in North America | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Canadian authorities arrested a NASCAR driver, who last year became the the first Native American to start a Sprint Cup race, and charged him as a chief operative in a tobacco-smuggling and drug-running operation.\nForty-five-year-old Derek White, a member of the Mohawk Indian Tribe who boasts 22 starts in the NASCAR XFINITY Series, faces seven charges, including three counts each of conspiracy and fraud against the government, and one count of profiteering as a criminal organization.\nBloomberg News reported that “White is listed as one of the top-ranking members of the smuggling operation, according to a chart provided by police.” A spokesman for the Quebec provincial police, said that the smuggling ring bought shipments of tobacco leaf in North Carolina, routed them to the northern border and resold them in Canada.\nWhite and his cohorts, which numbered about sixty individuals, used their proceeds to purchase cocaine and then laundered a portion of the money abroad, in Europe.\nNot declaring the tobacco shipments avoided payment of hefty tax burdens. Baggies of 200 cigarettes sold for $5 at Native American smoke shops on the U.S. side of the border. Over 10 percent of tobacco used throughout the world is illegally carried from field to user, according to Bloomberg.\nFox News reports that the smuggled shipments confiscated included:\nMore than 52,800 kilograms of tobacco, representing fraud of approximately $13.5 million; More than $1.5 million in cash from illegal transactions in Canada; Nearly $3 million in U.S. dollars;836 kg of cocaine; 21 kg of methamphetamine; 100 g of Fentanyl; and 35 pounds of cannabis.\nOverall 70 raids took place in Quebec and Ontario. Meanwhile, some 700 Canadian and U.S. police participated in the dragnet.\nSporting News points out that NASCAR drivers arrested for various activities is nothing new. According to early race-car mythology, the sport originated when moonshiners jacked up their cars to enhance their speed to outrace chasing law enforcement officials.","url":"https://www.breitbart.com/sports/2016/04/02/nascar-driver-busted-biggest-crackdown-tobacco-smuggling-north-america/"}
