{"authors":["Keertana Sastry"],"date_download":"2018-10-30 23:21:34","date_modify":"2018-10-30 23:21:34","date_publish":"2014-08-13 19:59:07","description":"If you had told me anytime during the first season of Nashville that I would feel anything but contempt or annoyance toward Avery Barkley, I would have told you to shut your incorrect mouth. Now, after a whole season of being really endearing and…","filename":"data/vaneerConsumption/NashvilleSeason3JulietteAverySpoilersRevealThereAreMoreObstaclesAheadfortheCouple.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/bdfc9152-1807-4f2b-9fd2-4d32751ee0d5.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35563-nashville-season-3-juliette-avery-spoilers-reveal-there-are-more-obstacles-ahead-for-the-couple_1540941694.html","title":"'Nashville' Season 3 Juliette & Avery Spoilers Reveal There Are More Obstacles Ahead for the Couple","title_page":"'Nashville' Season 3 Juliette & Avery Spoilers Reveal There Are More Obstacles Ahead for the Couple","title_rss":"NULL","source_domain":"bustle.com","text":"If you had told me anytime during the first season of Nashville that I would feel anything but contempt or annoyance toward Avery Barkley, I would have told you to shut your incorrect mouth. Now, after a whole season of being really endearing and engaging in a beautiful romance with Juliette Barnes, I actually like Avery. I want him to be happy. And I want him to be happy with Juliette. But the happy ending these two deserve may have been ruined forever when Juliette slept with sleazy music executive Jeff Fordham. I know it's been a while since this happened but I'm still grossed out by it. Can Avery and Juliette move past the betrayal and be in a healthy relationship in Season 3? Well, aside from the cheating, they actually have a few big obstacles, including a new waitress at the Bluebird Cafe.\nApparently Nashville's favorite restaurant/live music venue will be hiring a new member to the waitstaff and she could be Avery's new romantic interest. According to SpoilerTV, Avery will be the waitress' object of desire in Season 3 and considering what happened with Juliette, he will probably return the good vibes. Not much else is known about this new woman but my guess is she can sing. It is Nashville after all. But Avery's road away from Juliette won't be so easy considering another new addition to their storyline: a baby.\nFirst things first. Congratulations Hayden Panettiere on her pregnancy! While in real life, I'm extremely happy for her, I'm a ball of nerves for Juliette as Panettiere's pregnancy will be written into Juliette's storyline. That means that Juliette is pregnant with either Avery or Jeff's baby. If it's the former, that's potentially positive news for the former couple as it could potentially lead to a reunion, as long as they're not only together for the baby. If, however, the Apocalypse happens and its Jeff's baby, his spawn could be the nail in the coffin for Juliette and Avery. So how will these two newbies affect the relationship? There a few ways this season can go.\nThe Baby Is Avery's & The Waitress Is History\nThis outcome seems like the endgame. Apparently Juliette will be shocked by who the father of her child could be. The most obvious reveal Nashville could follow is that the baby is Jeff's because that would cause the most negative drama. But wouldn't it actually be more shocking if the baby is Avery's? The couple could actually have the chance at a reconciliation. And at this point in Nashville a happy ending would be the most shocking storyline of them all.\nThe Baby Is Avery's & He Still Goes For The Waitress\nJust because Juliette is having his baby, it doesn't mean Avery is forced to get back together with her. She cheated on him and it's his right to decide if he's willing to trust her and resume their relationship. He wouldn't be derided for choosing a new relationship with a woman who most likely has less baggage than Juliette, but Avery would probably feel guilty about it.\nThe Baby Is Jeff's & Avery Goes For The Waitress\nThis would make sense. If Avery's finds out Jeff is the father of Juliette's baby, it doesn't seem like there's anything stopping him from moving on. In fact, his road is then clearly paved towards the new woman.\nThe Baby Is Jeff's & The Waitress Is Still History\nCome on, I just don't see this happening. But if Avery really can get past being with a woman who is carrying the Devil's child, Juliette needs to lock him down quick.\nImages: ABC; chylerleigh (3), harveyxspector, whentherightonecomesalong/Tumblr","url":"https://www.bustle.com/articles/35563-nashville-season-3-juliette-avery-spoilers-reveal-there-are-more-obstacles-ahead-for-the-couple"}
