{"authors":["Ekin Karasin For Mailonline"],"date_download":"2018-10-23 01:43:22","date_modify":"2018-10-23 01:43:22","date_publish":"2017-03-16 11:56:41","description":"Natalie Finn, 16, of Iowa, was lying in her own waste when police found her having a cardiac arrest in her home - which reeked of animal and human waste and was covered in urine-soaked blankets.","filename":"data/vaneerConsumption/NatalieFinnwhostarvedtodeathwaswearingadiaper.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/13/3E5476AD00000578-0-image-a-38_1489671841981.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319844_Teenager-starved-death-neglected-by_1540259002.html","title":"Natalie Finn who starved to death was wearing a diaper","title_page":"Natalie Finn who starved to death was wearing a diaper | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Natalie Finn, 16, starved to death in a dirty diaper on the squalid floor of her adoptive parents' home in October\nA teenage girl starved to death in a dirty adult diaper while lying on the filthy linoleum floor of her adoptive mother's cat-ridden house.\nNatalie Finn, 16, died in October after being found by emergency services languishing on the floor at her home in West Des Moines, Iowa.\nShe was taken to hospital but died of cardiac arrest brought on by severe starvation.\nHer adoptive mother, Nicole Finn, is charged with her murder and with abusing and neglecting her two adoptive siblings - a 14-year-old girl and a 15-year-old boy.\nHer adoptive father Joseph, who lived in a separate home, faces charges for kidnapping, child endangerment and child neglect.\nNatalie had been lying in her own waste for 'some time' when police found her in October, according to a police search warrant which was unsealed on Tuesday.\nHer siblings were also underweight and had bedsores, according to police.\nThere was no furniture in their bedroom or in the bedrooms of her other adopted siblings and the house was overrun by cats and kittens whose feces were scattered everywhere.\n'Many animals roamed freely, including well over a dozen kittens and cats,' one said in an arrest affidavit that was obtained by The Des Moines Register.\nNicole Finn, 42, is charged with the teenager's murder. Her ex- husband Joseph faces child endangerment and kidnapping charges\nBlankets which were 'heavily soaked' in what was believed to be urine covered the floor of the room Natalie shared with two of her siblings.\n'There were numerous kennels with dogs scattered inside the residence.'\nPolice say the woman kept the children inside the home against their will to be tortured and starved.\nShe nailed boards to the windows of the house to stop them from escaping when she learned they had been panhandling for food at a nearby grocery store, according to authorities.\nThey adopted the children together but later separated, and Joseph lived in a different home where they would visit him.\nHe told police after Natalie's death that they enjoyed being in his house more because they were given more to eat.\nNatalie had been lying in her own waste for 'some time' when emergency services found her\nBoth of the girl's adoptive parents (above in court in December) are awaiting trial. They have not yet pleaded to the charges\nChild protective services and police visited Nicole's house at least once before Natalie's death but nothing was done to remove the children.\nA health worker who investigated the case was fired after the teenager's death.\nAuthorities visited the home in August, two months before Natalie's death, but said she was starving herself\nThey were called in to look in to the family after receiving reports from Natalie's school, Walnut Creek Campus, that she would come to class dirty and hungry.\nDespite their concern and claims from neighbors that she used to ask them for food and clothes, she was allowed to carry on living in the home.\nIn August, police and child protective services visited the house and even noted that Natalie was wasting away but said in a report she was starving herself.\nThey said there was 'ample' food in the home.\nThe fired health worker told colleagues she believed there may have been cause for concern but nothing was done.\nShe said the other children told her they were scared of their adoptive mother but that there was not enough evidence to remove them from her care.\n'What happened to not only Natalie but her siblings was preventable,' Senator Matt McCoy said on Wednesday once the documents were unsealed.\n'It's a horrific situation and I feel heartbroken for Natalie and her siblings who were, in essence, sealed in that room and left to die.'\nThe teenager had repeatedly asked neighbors for food and clothing in the months before her death in her West Des Moines house, pictured here\nhttp://www.kcci.com/article/search-warrant-reveals-new-details-in-natalie-finn-case/9137248","url":"https://www.dailymail.co.uk/news/article-4319844/Teenager-starved-death-neglected-by.html"}
