{"authors":["Chloe-Lee Longhetti For Daily Mail Australia"],"date_download":"2018-10-23 01:41:13","date_modify":"2018-10-23 01:41:13","date_publish":"2016-01-28 16:09:15","description":"Natalie Bassingthwaighte is excited to be focusing on acting again and says she relished her role as Julie Bamford in Ten's miniseries Brock","filename":"data/vaneerConsumption/NatalieBassingthwaighteopensupaboutplayingPeterBrocksformermistress.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/15/30AB325500000578-0-image-a-48_1453995246369.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3421000_Natalie-Bassingthwaighte-opens-playing-late-Peter-Brock-s-former-mistress-Julie-Bamford-miniseries_1540258873.html","title":"Natalie Bassingthwaighte opens up about playing Peter Brock's former mistress","title_page":"Natalie Bassingthwaighte opens up about playing Peter Brock's former mistress | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Natalie Bassingthwaighte has admitted that playing Julie Bamford, partner of late Australian motor racing ace Peter Brock, had a profound effect on her.\nIn preparation for the role in Network Ten's upcoming drama Brock, Natalie, 40, focused on understanding what made Julie tick and the essence of her relationship with racing car champion.\n'Julie goes through a pretty traumatic time. Finally meeting the love of her life, then finally being able to be together, then him dying,' the former X Factor judge told AAP while at an Emirates Australian Open lunch on Thursday.\nScroll down for video\nOpening up: Natalie Bassingthwaighte has talked about her new acting role in the miniseries Brock, where she plays Julie Bamford\n'I could definitely draw some inspiration from my own life for the role. It was a very spiritual and quite a cathartic experience for me.\n'The most important thing for me was to get the essence of who she was, still is, and the relationship her and Peter had. From what I know, it was obviously very physical and sexual. But it was emotional and spiritual and there was a whole other side to her that was really fun to add in there.'\nThe singer and former X Factor judge says she has relished getting back into acting after a break doing reality TV, juggling her children's fashion label and motherhood.\nShe worked hard! To prepare for the role in Network Ten's upcoming drama Brock, Natalie, 40, focused on understanding what made Julie tick and the essence of her relationship with racing car champion\nJulie and Peter had an affair for 15 years, conducting their relationship behind the back of Julie's best friend, Peter's wife Bev.\nThe women became embroiled in a bitter fight over his estate following his sudden death in a car rally in 2006.\nPeter and Bev had been together for 28 years when he left her in 2005 to move in with Julie.\nHistory: Julie Bamford and Peter Brock had an affair for 15 years, conducting their relationship behind the back of Julie's best friend, Peter's wife Bev. The lovers are seen here in 2005\nHis wife: Peter and Bev had been together for 28 years when he left her in 2005 to move in with Julie. Bev and Peter are seen here in 2004\nAlso appearing in the show alongside Natalie, is actor Matt Le Nevez, who will portray Peter.\nActing had been on hold while Natalie concentrated on reality TV and is now ready to concentrate on that side of her career.\n'I filmed Brock last year and so that was exciting for me to get back into the acting world because that's where my heart is at the moment.'\nBut she is cautious about being typecast.\nCo-stars: Also appearing in the show alongside Natalie, is actor Matt Le Nevez, who will portray Peter\n'I want to play different things every time. It's pretty easy to get typeset,' she said. 'Some other opportunities have come my way that I've chosen not to take for that very reason.\n'But then there are some other opportunities I can't wait for. I feel like if it's a great story and a great script, whether it's real or made up, if it's written well with a great cast and good director, I'm in. I like a challenge.","url":"https://www.dailymail.co.uk/tvshowbiz/article-3421000/Natalie-Bassingthwaighte-opens-playing-late-Peter-Brock-s-former-mistress-Julie-Bamford-miniseries.html"}
