{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 20:50:19","date_modify":"2018-10-22 20:50:19","date_publish":"2016-01-28 04:14:15","description":"The 34-year-old actress was a natural beauty on the red carpet on Wednesday as she joined her co-stars at the New York premiere.","filename":"data/vaneerConsumption/NataliePortmandonsembroideredfloralgownforJaneGotaGunpremiere.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/03/30A6897300000578-0-image-a-122_1453952833934.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420331_Natalie-Portman-dons-embroidered-floral-gown-delicate-sleeves-premiere-Jane-Got-Gun_1540241419.html","title":"Natalie Portman dons embroidered floral gown for Jane Got a Gun premiere","title_page":"Natalie Portman dons embroidered floral gown for Jane Got a Gun premiere | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Natalie Portman was a red carpet beauty at the premiere of her latest film on Wednesday.\nThe 34-year-old actress opted for a black gown with colourful embroidery as she arrived at the premiere of Jane Got A Gun in New York hosted by Serpent's Bite Whisky.\nThe mother-of-one's dress featured sheer short sleeves, a high neckline and long flowing skirt, while she pulled her brunette locks into a classic chignon.\nScroll down for video\nFloaty frock: Natalie Portman wowed at the premiere for her new movie Jane Got a Gun on Wednesday\nThe Black Swan star completed her look with berry-hued lipstick and carried a chic satin box clutch.\nJoining her at the The Museum of Modern Art event was her co-star Joel Edgerton, 41, who looked suave in a navy suit.\nIn Jane Got A Gun, Natalie plays the starring character, Jane, who asks a former love to help her save her outlaw husband (Edgerton).\nFeminine look: The 34-year-old actress looked gorgeous in an embroidered black dress with sheer sleeves\nClassic look: Natalie completed the look with berry lipstick and satin clutch\nDuring an appearance on Good Morning America earlier that day, Natalie revealed why a western movie appealed to her.\nThe actress said: 'I loved the idea of a love story in the the wild west because love seems like that kind of lawless atmosphere.\n'This story of this woman having to sort of face her deepest fears in this really challenging environment was very parallel to sort of the experience of making films.'\nOn-screen partners: The beauty posed alongside co-star Joel Edgerton as the duo celebrated the premiere of the western drama\nStylish looks: Model Tali Lennox and Jazmin Grace Grimaldi (Albert II, Prince of Monaco's daughter) also made an appearance at the event\nNatalie is mother to four-year-old son Aleph Portman-Millepied with her husband, professional ballet dancer and choreographer Benjamin Millepied.\nWhile the family lives in Paris, France, she told hosts: 'I think the US will always feel like home to me, but it's an incredible experience to get to live in Paris. It's obviously a dream city for so many Americans I think especially - we hold Paris as a dream place in our minds.'\nThe lovebirds began dating in 2009 after they met on the set of her film, Black Swan.\nShe announced their engagement one year later and married on August 4, 2012 in Big Sur, California.\n'I loved the idea of a love story in the the wild west because love seems like that kind of lawless atmosphere' Natalie appeared on Good Morning America earlier in the day to talk about her movie","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420331/Natalie-Portman-dons-embroidered-floral-gown-delicate-sleeves-premiere-Jane-Got-Gun.html"}
