{"authors":["Kirspencer For Daily Mail Australia"],"date_download":"2018-10-22 23:43:05","date_modify":"2018-10-22 23:43:05","date_publish":"2017-03-10 04:04:54","description":"The 26-year-old positively glowed as she relaxed poolside in Los Angeles, smiling as she soaked up some sunny rays.","filename":"data/vaneerConsumption/NatalieRosersoaksupthesunbypoolsideinLosAngeles.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/03/3E1F767E00000578-0-image-a-91_1489116746931.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4299664_Natalie-Roser-looks-fit-fabulous-bikini-poolside_1540251785.html","title":"Natalie Roser soaks up the sun by poolside in Los Angeles","title_page":"Natalie Roser soaks up the sun by poolside in Los Angeles | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She split from her personal trainer fiancé Dan Adair last October and is rumoured to be dating Neighbours star, Harley Bonner.\nBut model Natalie Roser put her love life aside on Thursday, and was busy working on her tan.\nThe 26-year-old positively glowed as she relaxed poolside in Los Angeles, smiling as she soaked up some sunny rays.\nRadiant: Aussie model Natalie Roser glowed as she posed poolside in a black and white bikini on Thursday\nPutting her toned tummy on display, she showcased her incredible abs and enviable, slender pins.\nShe wore a checked black and white bandeau bikini from her very own swimsuit line.\nAccessorising with a black cap and no jewellery, the bare-face beauty kept it simple, drawing attention to her striking features and flawless complexion.\nHer luscious blonde tresses hung in waves over her chest as she smiled for the camera.\nClassic: The blonde beauty wore a checked bandeau bikini from her very own swimsuit line\nThe star shared the image with her 755,000 Instagram followers, captioning the moment 'LA is weather #goals today! I'll be wearing my cute @roserthelabel bikini all day'\nThe lazy day was in contrast to her activities Wednesday, when the model posted a photo of herself working up a sweat during an intense session at the gym.\nSporting a black singlet and workout shorts, Natalie pulled her long locks to the side, playfully joking 'I don't know why I bother washing my hair'.\nFavourite piece: Natalie wore the bikini in different ways, wearing denim shorts with the bathers when she posed in them beachside\nHitting the gym: The lazy day was in contrast to Natalie's activities Wednesday, when the model posted a photo of herself working up a sweat during an intense session at the gym.\nThe young model moved to the Los Angeles earlier this year to pursue a modelling career after her shock-split from fiance, Dan.\nIt didn't take Natalie too long to find love again though, with rumours swirling last month about a new beau when Neighbours star Harley posted a picture of the two together for Valentine's Day.\nOn Tuesday, the actor posted another picture with the blonde bombshell, captioning the moment 'Missing this beautiful creature. One month to go... Hurry up time, you big stupid idiot head.'\nNew beau: Natalie and former fiance Dan Adair broke off their engagement last year, with the former Miss Universe contestant seen cosying up to Neighbours star, Harley Bonner","url":"https://www.dailymail.co.uk/tvshowbiz/article-4299664/Natalie-Roser-looks-fit-fabulous-bikini-poolside.html"}
