{"authors":["Ross Mcdonagh For Dailymail.Com"],"date_download":"2018-10-22 21:09:21","date_modify":"2018-10-22 21:09:21","date_publish":"2016-01-28 06:47:50","description":"The camera-shy crooner was sat right in the middle in a short white dress and enormous white bow on her head, face as always hidden behind her lengthier fringe.","filename":"data/vaneerConsumption/NataliePortmanandTheRootsdonSiawigsonJimmyFallon.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/06/30A7117000000578-0-image-a-34_1453962262965.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3420413_Natalie-Portman-Roots-don-Sia-wigs-perform-percussion-Iko-Iko-Jimmy-Fallon_1540242561.html","title":"Natalie Portman and The Roots don Sia wigs on Jimmy Fallon","title_page":"Natalie Portman and The Roots don Sia wigs on Jimmy Fallon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Little girl with a sharp bob, killer moves and an inappropriate relationship with an older actor - Leon: The Professional could easily be a Sia music video.\nOn Wednesday Natalie Portman met the singer for real when the two performed together on The Tonight Show.\nThe two joined Jimmy Fallon and the entire Roots crew for an all-percussion rendition of the Dixie Chicks' New Orleans anthem Iko Iko.\nScroll down for video\nDixie Chicks: Natalie Portman, Jimmy Fallon and The Roots all donned Sia wigs to perform all-percussion Iko Iko with her on Wednesday's tonight show\n'My grandma and your grandma, sitting by the fire,' the host began to mutter shortly after his monologue, before suddenly asking the crowd if they wanted to see Natalie Portman, Sia and The Roots perform it instead.\nHe then rolled a tape of that exact bizarre line-up, all dressed in either black or while, each wearing a matching two-tone Sia wig.\nThe camera-shy crooner herself was sat right in the middle in a short white dress and enormous white bow on her head, face as always hidden behind her lengthier fringe.\nShe then lead the motley crew then kicked into an impressive version of the creole classic, with Portman displaying notable knowledge of the lyrics.\nMotley crew: The Host rolled a tape of the bizarre line-up, all dressed in either black or while, each wearing a matching two-tone Sia wig\nA for effort: 'You guys are so cool and I'm just like the dorky mom,' the 34-year-old sheepishly laughed back at the studio, now wearing gorgeous short red dress\nFan: The actress was full of praise for the Chandelier singer: 'Shes so so cool, i just love that voice. She is amazing'\nOscar-winner the Grouch: 'I was panicking back there, i looked like I was performing on sesame street,' she added\n'You guys are so cool and I'm just like the dorky mom,' the 34-year-old sheepishly laughed back at the studio, now wearing gorgeous short red dress.\n'I was panicking back there, I looked like I was performing on sesame street,' she added.\nHowever she was full of praise for the Chandelier singer: 'She's so so cool, I just love that voice. She is amazing'; but did add of Jimmy's performance: 'You were killing it on the spoons.'\nHarvard grad: The host complimented her on her tenacity in researching the correct lyrics\nResearch: 'I just Googled it,' she giggled. 'I'm a person who uses Wikipedia like all other people.'\nRavishing: She looked stunning in a fit and flare red dress with a mesh skirt, teamed with ruched black ankle boots\nBig grin: She couldn't take the smile off her face as she interview with the TV star continued\nThe host then repaid the compliment, praising the Oscar-winners tenacity in researching the correct lyrics.\n'I just Googled it,' she giggled. 'I'm a person who uses Wikipedia like all other people.'\nNatalie's directorial debut A Tale Of Love And Darkness closed the New York Jewish Film Festival on Tuesday, while her upcoming western Jane Got A Gun hits theatres this weekend\nAttack of the clones: Sia also performed at the end of the night, with her usual troop of mini Sias\nRetiring: The camera-shy crooner wore a short white dress and enormous white bow on her head, face as always hidden behind her lengthier fringe","url":"https://www.dailymail.co.uk/tvshowbiz/article-3420413/Natalie-Portman-Roots-don-Sia-wigs-perform-percussion-Iko-Iko-Jimmy-Fallon.html"}
