{"authors":["Greg Bluestein"],"date_download":"2018-10-30 20:20:57","date_modify":"2018-10-30 20:20:57","date_publish":"2015-12-24 16:49:25","description":"Gov.","filename":"data/vaneerConsumption/NathanDealdeclaresstateofemergencyinthreenorthGeorgiacounties.json","image_url":"https://politics.myajc.com/rf/image/PortalConfig/np-paid/assets/politics.myajc/images/og-share-icon.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/politics.myajc.com/blog_politics_nathan-deal-d_e352e18583262c6a4dafcee777b8c858__1540930857.html","title":"Nathan Deal declares state of emergency in three north Georgia counties...","title_page":"Nathan Deal declares state of emergency in three north Georgia counties...","title_rss":"NULL","source_domain":"ajc.com","text":"Gov. Nathan Deal declared a state of emergency in three north Georgia counties that suffered widespread flooding amid severe Christmas Eve storms.\nThe order extends to Fannin, Gilmer and Pickens counties through Jan. 3.\n\"Following severe weather that resulted in flooding, damage to roads and properties and downed trees, the state is working to ensure the affected counties have access to the resources necessary for response efforts,\" Deal said.\nHe added that he may add more counties to the list as the severe weather rolls through north Georgia.\nHouse Speaker David Ralston, who represents part of the area under the emergency order, said he is praying \"for the state and local emergency personnel who will be away from their families today and tonight rendering aid to those impacted by this severe weather.\"\nA storm front that spawned deadly tornadoes in Mississippi, Tennessee and Arkansas pummeled metro Atlanta and north Georgia on Thursday, and more rain was forecast through Christmas Day.\nThe weather system has spawned two dozen tornadoes in six states from Indiana and Illinois to the Deep South, killing three people in Mississippi, two in Tennessee and one in Arkansas.\nRead more about the storms by clicking here.","url":"https://politics.myajc.com/blog/politics/nathan-deal-declares-state-emergency-three-north-georgia-counties-amid-christmas-eve-storms/EovuDvxJtGkbkNe8ZEgZcK/"}
