{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 18:04:14","date_modify":"2018-10-30 18:04:14","date_publish":"2015-07-19 14:46:30","description":"The National Jewish Democratic Council (NJDC), an organization that exists to boost Jewish support for Democrats, has announced its \"strong support\" for the nuclear deal with Iran. Not \"cautious support,\" or even \"support.\" Strong support. |","filename":"data/vaneerConsumption/NationalJewishDemocraticCouncilStronglySupportsIranDeal.json","image_url":"https://media.breitbart.com/media/2015/07/NJDC.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_07_19__1540922654.html","title":"National Jewish Democratic Council 'Strongly Supports' Iran Deal","title_page":"National Jewish Democratic Council 'Strongly Supports' Iran Deal | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The National Jewish Democratic Council (NJDC), an organization that exists to boost Jewish support for Democrats, has announced its “strong support” for the nuclear deal with Iran. Not “cautious support,” or even “support.” Strong support.\nThe statement is likely a signal to wavering Democrats, including Sen. Charles Schumer (D-NY).\nIn a statement explaining its reasoning, the NJDC ignores the fact that the deal expires after a decade, and that it will give billions of dollars to Iran, some of which will fund terror. The NJDC also ignores the fact that the deal will lift an arms embargo and ballistic missile sanctions on Iran over time.\nThe NJDC seems to rely on an analysis by the White House that the deal meets the five conditions set out by the Washington Institute for Near East Affairs. Those White House talking points are false; the Iran deal fails each of the Institute’s criteria.\nThe NJDC also claims the deal achieves “the core goals of negotiations and will ultimately lead to a safer and more secure region.” But the deal does not even meet the administration’s own goals, and our regional allies are unanimous in opposing it–including the Israeli left.\nThe president himself recently said that Iran’s nuclear “breakout” time could be “zero” in the years after the deal begins to expire, ten years hence.\nHow, then, can the NJDC claim “that this deal will in fact achieve the core goal of preventing Iran from obtaining a nuclear weapon”? It cannot.\nAnd while some provisions of the deal are debatable, what is not debatable is that Iran continues to sponsor terror; that it continues to promise “death to America” and “death to Israel”; that it killed hundreds of Americans in Iraq; that it is at war with America’s allies; and that it continues to suppress its own people.\nThere are no human rights provisions in the agreement. And the fate of four Americans held by Iran is unresolved.\nIn its rhetoric and aims, Iran is little different from the Nazi regime. One could understand if the NJDC gave the Iran deal reluctant support, out of a mistaken belief that there is no alternative.\nBut to “strongly support” a deal with the Iranian regime–especially a flawed agreement such as this one–is to collaborate with the Nazis of today.","url":"https://www.breitbart.com/politics/2015/07/19/national-jewish-democratic-council-strongly-supports-iran-deal/"}
