{"authors":["Felicia Mello","Dan Morain"],"date_download":"2018-10-30 22:39:50","date_modify":"2018-10-30 22:39:50","date_publish":"2018-07-11 01:43:33","description":"Some Native American tribes accuse the University of California of delaying the legally required return of bones, and are pushing state legislation to force UC to speed its efforts.","filename":"data/vaneerConsumption/NativeAmericantribesclashwithUCoverbonesoftheirancestors.json","image_url":"https://calmatters.org/wp-content/uploads/Myra-Masiel_Robbie-Short.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540939190.html","title":"Native American tribes clash with UC over bones of their ancestors","title_page":"Native American tribes clash with UC over bones of their ancestors | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"(End-of-session update: The governor signed Assembly Bill 2836 into law Sept. 27, requiring the University of California to submit its new repatriation policies to the state’s Native American Heritage Commission by July 2019.)\nAs tribal archaeologist for the Pechanga Band of Luiseño Indians, Myra Masiel uses her UC Berkeley anthropology training daily. Her mission: track down skeletons of Native Californians extracted from gravesites over the last two centuries and shipped off to museums around the world, and return them to the tribe’s ancestral land near Temecula so they can be reburied with dignity.\nBut lately that quest has put Masiel at odds with her alma mater.\nThe remains of thousands of Native Americans, along with possessions such as beads and fishhooks buried with them, now sit in drawers and boxes at University of California museums. Federal and state laws require their return to tribes able to prove a connection to them. Some tribes accuse university officials of delaying so professors can continue to study the bones, and are pushing state legislation to force UC to speed its efforts.\n“As an anthropologist, you don’t own what you’re taking care of. They’re in your care,” said Masiel. “But I think the research community does feel that they own them.”\nOver decades, archaeologists and common looters excavated Native American cemeteries—some even motivated by the racist eugenics movement, which compared skull shapes to attempt to prove white superiority.\nIn 1990, U.S. law began requiring federally funded museums to list remains in their collections, along with any “associated funerary objects” or other sacred items, and share the list with tribes, who could then make repatriation claims. California law extended that approach to state-funded museums.\nBut UC campus responses varied widely. UCLA’s Fowler Museum has transferred nearly all of the 2,300 remains in its collection to tribes, according to its archaeology curator, Wendy Teeter. But at UC Berkeley’s Phoebe Hearst Museum, which holds one of the largest collections of human remains in the country, fewer than 300 bodies have been returned out of more than 9,000.\n“It’s a huge black eye on the institution,” said Phenocia Bauerle, Berkeley’s director of Native American Student Development. She said the slow pace of repatriation has hurt her ability to build trust with Native American students and tribes.\nRandy Katz, Berkeley’s vice chancellor for research, said the university “works diligently to care for (remains) in a respectful and legal manner.” He noted that he recently appointed more Native Americans to the campus committee reviewing repatriation requests, once dominated by anthropologists and with only one Native American member.\nPechanga’s dispute with the Hearst Museum began on San Nicolas Island, a sandy, scrub-covered outpost about 60 miles offshore of Southern California, owned by the Navy. Archaeologists with the Navy and Cal State Los Angeles were digging there, seeking to unravel the mystery of the Lone Woman, a Native American whose story inspired the novel Island of the Blue Dolphins.\nThat didn’t sit well with the Pechanga tribal council, which said traditional songs and stories prove the tribe’s connection to the island. It filed a petition with the Navy, which agreed the tribe had a cultural affiliation with the area. That meant digging had to stop—and by law, the nearly 500 remains uncovered on the island over the decades could go to the tribe.\nIn what tribal representatives describe as a six-year saga, other museums—including UCLA’s Fowler—have said they will return bodies they have from San Nicolas. The Navy has given permission for island reburial to Pechanga and three other Luiseño and Chumash tribes. But UC Berkeley insists it must conduct its own investigation before returning some of the remains.\nThe dispute reflects a longstanding clash of worldviews, with UC academics weighing concerns of descendants against potential research benefits.\n“There’s a wealth of data in the human body,” said Robert Bettinger, professor emeritus of anthropology at UC Davis. “We can trace a whole series of isotopes that will tell us about your diet, about the water you drank and probably the region you came from.”\nBettinger worries that if tribes rebury remains without allowing anthropologists to examine them, society will lose the opportunity to gain detailed knowledge about life in western North America before Europeans’ arrival. “Maybe this is patronizing from an archaeologist’s point of view, but I think someday, somebody in the Native American community is going to ask, ‘Why don’t we know this?’ ” he said. “And the answer will be because some of your forebears decided it was more important not to know that.”\nBut for many tribes, the very idea that their ancestors would become research objects is, in Pechanga chairman Mark Macarro’s word, “abhorrent.”\n“As long as these remains are out there and our people are in pieces in different institutions,” he said, “the tribes have this sense that things are really out of balance.”\nMacarro subscribes to the Luiseño view that the world was created in the Temecula Valley, and is skeptical of academics who he sees as guessing at history, constantly changing their ideas as new evidence discredits the old ones.\n“Look, if you want to know the past,” he said, “talk to us.”\nCalifornia’s Assembly has passed legislation by San Diego Assemblyman Todd Gloria, a member of Alaska’s Tlingit Haida tribe, to create a uniform UC repatriation process, overseen by the state’s Native American Heritage Commission. Tribes would have equal representation on campus committees, and the state auditor would review UC’s legal compliance.\n“If (research) was done in a cooperative fashion with the descendants, maybe something could happen here,” Gloria said. “Sadly, right now the relationship is very adversarial.”\nMatching centuries-old skeletons with contemporary Native American groups can be challenging. Poor record-keeping abounds. Even when likely descendants are identified, they sometimes lack the money or land to take on repatriation.\nUCLA’s Teeter said her team reaches out to tribes to help identify the origin of remains.\n“We’re not talking about Neanderthals; we’re not talking about Homo erectus. We’re talking about people that are sometimes just a generation or two separated from us,” Teeter said. “There’s more value in making sure our relationships are true and ethical than in trying to hold onto (someone’s) ancestors.”\nTeeter said the collaboration with tribes is one reason for UCLA’s high repatriation rate. At UC Berkeley, by contrast, campus officials have designated more than 80 percent of the remains in its North American collection as “culturally unidentifiable”—a legal limbo that means researchers can study the bones without seeking permission from any tribe. Katz says that’s because they come from a broader range of places and time periods.\nIn a basement room filled with white file boxes, UC Davis osteologist Michael Walters sorts through plastic bags full of bone fragments so small they look like wood chips. He’s searching for human bones that were mislabeled as animal, and sometimes he finds them—a body part from a child, for example, that was so small that an undergraduate in the 1960s decided it must have come from a bird.\nWalters is part of a three-person team hired by UC Davis to update its inventory of about 300 sets of Native American remains—finding additional bones that researchers in the past missed, and returning those that can be repatriated to tribes.\nHuman bones go to a separate room closed to the public and the press. There, black curtains cover the shelves that house the bodies, the lighting is dim, and there’s an area for tribal representatives to make religious offerings, according to staff.\nWalters wears gloves, and speaks to the bones while he works. “I do say hello and good morning to them, I apologize for colonialism,” he said. “My goal is to get that person home.”\nBut even this process is controversial. The United Auburn Indian Community says its own claim for repatriation of remains and sacred items from UC Davis has dragged on for years, and objects to scientists handling the bones as disrespectful.\nThe scientists contend they must ensure there’s sufficient evidence to repatriate the bones—or they could be sued by anthropologists who want to study them. In 2012, Bettinger and two other UC scientists seeking DNA to study ancient migrations sued but failed to stop the university from transferring two 9,000-year-old skeletons to the Kumeyaay tribes.\nUC has not taken a position on Gloria’s bill, though Berkeley’s Katz said he’s “concerned that as written it will increase layers of bureaucracy and hobble our ability to act swiftly on the advice of the new (committee) we’ve established that is more representative and inclusive of Native American perspectives.”\nWhile the tribes await Senate action, Masiel continues her work. Last month, she flew to Europe to consult with a museum about remains that she says have ties to her people.\n“The tribe, we’re very patient,” she said. “We don’t forget. I will continue to fight for these people until they get returned back to where they came from.”\nThis story and other higher education coverage are supported by the College Futures Foundation.","url":"https://calmatters.org/articles/native-american-tribes-clash-with-uc-over-bones-of-their-ancestors/"}
