{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:47:59","date_modify":"2018-10-30 19:47:59","date_publish":"2015-02-19 23:24:09","description":"The National Iranian American Council (NIAC) has taken out a full page ad in the New York Times to oppose Israeli Prime Minister Benjamin Netanyahu’s upcoming speech to a joint session of Congress on March 3.","filename":"data/vaneerConsumption/NationalIranianAmericanCouncilBuysFullPageAdinNYTAgainstNetanyahuSpeech.json","image_url":"https://media.breitbart.com/media/2015/02/netanyahu-serious-Reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_02_19__1540928879.html","title":"National Iranian American Council Buys Full-Page Ad in NYT Against Netanyahu Speech","title_page":"National Iranian American Council Buys Full-Page Ad in NYT Against Netanyahu Speech | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The National Iranian American Council (NIAC), a group long accused of having close ties to the Iranian regime under Ayatollah Khamenei, has taken out a full page ad in the New York Times to oppose Israeli Prime Minister Benjamin Netanyahu’s upcoming speech to a joint session of Congress on March 3.\nNIAC President Trita Parsi said of his organization’s advertisement, “The U.S. and its closest allies are on the brink of a historic deal that will both prevent an Iranian bomb and war with Iran, and Congressional hawks are orchestrating political stunts with foreign leaders to try to kill it.”\n“The American people do not want another senseless military adventure and certainly don’t consider Benjamin Netanyahu to be their commander in chief,” he added.\nThe ad asks, “Who is our Commander in Chief?” providing two choices: Barack Obama or Benjamin Netanyahu.\n“Congressional hawks are bringing Israeli Prime Minister Netanyahu to Capitol Hill to push for new sanctions that could kill the talks and start a war,” the NIAC ad concludes.\nIt may not come as a surprise to NIAC’s critics when the group’s rhetoric closely resembles that which is promulgated by the Iranian regime.\nIndependent polling has revealed that NIAC, which claims to be the voice of the Iranian-American community, did not in any way represent Iranian Americans who support a pro-democracy trajectory for Iran. Iranian-American citizens also overwhelmingly believe that NIAC is simply a lobby for the Ayatollah’s Islamic Republic, according to the poll results.\n“I feel his lobbying has secretly been more for the Islamic Republic,” said Mohsen Makhmalbaf, who is one of the leaders of Iran’s Green Movement, of NIAC president Trita Parsi.\n“You cannot find any difference between [NIAC’s] statements and the Iranian regime’s statements. Either officially or unofficially they are following the path of the regime,” explained Iranian jailed dissident Amir Fakhravar, who heads the Iranian Freedom Institute.\nNIAC’s internal documents, revealed as the result of a failed defamation lawsuit against an investigative journalist, showed that Parsi has held a years-long relationship with Iranian Defense Minister Javad Zarif. On its website, NIAC responds to its critics by determining that they are either “neoconservative activists” or “MEK (People’s Mujahedin of Iran) supporters.”","url":"https://www.breitbart.com/national-security/2015/02/19/national-iranian-american-council-buys-full-page-ad-in-nyt-against-netanyahu-speech/"}
