{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 20:12:45","date_modify":"2018-10-30 20:12:45","date_publish":"2018-06-19 02:19:10","description":"The pro-life Susan B. Anthony List (SBA List) announced Monday its endorsement of Michigan Republican John James for the U.S. Senate.","filename":"data/vaneerConsumption/NationalProLifeGroupEndorsesMichiganRepublicanJohnJamesforUSSenate.json","image_url":"https://media.breitbart.com/media/2018/06/john-james-for-us-senate-michigan-facebook.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2018_06_18__1540930365.html","title":"National Pro-Life Group Endorses Michigan Republican John James for U.S. Senate","title_page":"National Pro-Life Group Endorses Michigan Republican John James for U.S. Senate | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The pro-life Susan B. Anthony List (SBA List) announced Monday its endorsement of Michigan Republican John James for the U.S. Senate.\n“John James will be a strong voice for the pro-life movement,” Jane Abraham, SBA List chairman of the board, said in a statement. “John’s strong position on life is exactly what Michigan needs in the United States Senate. We urge all Michigan voters concerned with protecting life to support John James.”\nJames, a combat veteran, businessman, and conservative, is running against venture capitalist and former investment banker Sandy Pensler in the GOP primary election on August 7. The winner will face Democratic incumbent Sen. Debbie Stabenow.\n“I’m honored to receive the endorsement of the Susan B. Anthony List as the only pro-life candidate in this race,” James said in a statement. “Sandy Pensler and Debbie Stabenow are not pro-life, and that is why Right to Life, the Family Research Council and the Susan B. Anthony List exclusively endorsed me. When elected to the Senate, I will be a fierce defender of life for both the born and unborn.”\nAs Breitbart News reported in April, in 1992, Pensler ran for Congress as a pro-choice Republican who also endorsed government-funded health care. The Detroit Free Press noted that Tom Shields, a spokesman for Pensler, said his candidate’s position has “evolved” on the issue of life.\nThe Michigan Faith and Freedom Coalition, however, posted its disapproval of Pensler to its Facebook account.\n“There is NO WAY conservatives in Michigan – in a US Senate GOP Primary – will support Sandy Pensler as a candidate,” the group wrote. “We urge everyone to take a real close look at ‘Pro-Choice Pensler.’ This is not the kind of candidate we need representing conservatives in Michigan.”\nJames also has the support of Kid Rock and has received the exclusive endorsement of National Right to Life and the Right to Life of Michigan PAC. He has the full endorsement of the American Conservative Union, which hosts CPAC, and the Senate Conservatives Fund.\nIn addition to his pro-life views, James vows to protect the Second Amendment. After graduating from West Point in 2004, he became a Ranger-qualified aviation officer and then went on to serve with distinction in Operation Iraqi Freedom, where he logged 753.8 combat flight hours leading two Apache platoons.\n“Faith and family, God and country, and service before self,” James told Breitbart News in April. “Those used to be American values, but now we call them conservative values because the progressive left has actually left the reservation.”","url":"https://www.breitbart.com/politics/2018/06/18/national-pro-life-group-endorses-michigan-republican-john-james-us-senate/"}
