{"authors":["Chriss W. Street"],"date_download":"2018-10-30 20:47:39","date_modify":"2018-10-30 20:47:39","date_publish":"2015-01-03 17:43:42","description":"Average gasoline prices are the lowest since May 2009.","filename":"data/vaneerConsumption/NationalGasolinePricesLowestSinceMay2009.json","image_url":"https://media.breitbart.com/media/2014/12/california-gas-pump-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_01_03__1540932459.html","title":"National Gasoline Prices Lowest Since May 2009","title_page":"National Gasoline Prices Lowest Since May 2009 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"AAA estimates U.S. households in 2014 saved an average of $115 on gasoline compared to last year, with the majority of that savings coming during the price collapse that sent the national price down to an annual low of $2.26 on the last day of the year. Gasoline prices have continuously fallen every day for an all-time record of 97 days. The last time America saw such a low average national price was on May 12, 2009.\nWith the highest daily national average of $3.70 per gallon on April 28 and the lowest $1.40 lower on December 31, gas prices fell 39% from peak to trough this year.\nConsumers saved about $14 billion on gasoline in 2014 compared to 2013 and $22 billion compared to 2012. Looking back for the last four years comparing the average national cost of a gallon of gasoline at $3.34 per gallon in 2014, the price was down 15 cents from 2013, down 26 cents from 2012, down 17 cents from 2011, but up 71 cents from 2010. Compared to the same time last year, consumers have saved about $215 million on gasoline expenditures.\nCalifornia won the booby prize again for highest average annual price in the contiguous 48 states for a gallon of gas, with a price of $3.75, exceeding the highest national daily average by $.05. Connecticut and New York trailed closely behind the not-so-Golden State at $3.65.\nThe cheapest state to buy gas was South Carolina with an annual average of $3.10 per gallon. The other low price winners included Missouri at $3.11, Mississippi at $3.12, Tennessee at $3.13, and Arkansas at $3.14.\nThe four states that are below the magic $2.00 per gallon price are Missouri at $1.897, Oklahoma at $1.93, and Ohio and Indiana at $1.99. The four states that have the highest national price today are New York at $2.79, Vermont at $2.70, Connecticut at $2.67, and California at $2.62.\nAAA predicts the national average price of gas will drop by 10 cents per gallon over the next two weeks as the pump prices catch up to crude oil’s plunge. California gas prices may rise by 30-50 cents to over $3.00 per gallon during the spring refinery maintenance season due to a new law and the state’s switch to the more expensive summer gasoline blend.\nBut other than a world war or a huge meteor strike, U.S. gasoline prices seem destined to fall for the next couple years. The global surplus of crude oil production averaged 2.2 million barrels per day during November and December, according to the U.S. Energy Information Administration. The U.S. and the other developed economies in Organization for Economic Cooperation and Development report crude oil inventories grew by 124 million barrels in the last two months, the largest gain since 1997.","url":"https://www.breitbart.com/local/2015/01/03/national-gasoline-prices-lowest-since-may-2009/"}
