{"authors":[],"date_download":"2018-10-22 21:11:20","date_modify":"2018-10-22 21:11:20","date_publish":"2014-06-04 15:59:50","description":null,"filename":"data/vaneerConsumption/NationalRepublicanssaytheyareallinforCochran.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_first-read_national-republicans-say-they-are-all-cochran-n122441_1540242680.html","title":"National Republicans say they are 'all in' for Cochran","title_page":"National Republicans say they are 'all in' for Cochran","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe National Republican Senatorial Committee tells NBC News that it's \"all in\" for Sen. Thad Cochran, R-Miss., in his likely runoff against Tea Party challenger Chris McDaniel.\n\"We are all in for Thad,\" NRSC spokesman Brad Dayspring said.\nCochran and McDaniel appear headed for a June 24 runoff after no candidate reached 50 percent of the vote in the June 3 Mississippi GOP Senate primary. With 99 percent of votes in, McDaniel has 49.6 percent and Cochran 48.9 percent.\nAnd while Cochran could very well be the underdog (incumbents this cycle haven't fared well in runoffs), Dayspring says that McDaniel has challenges, too. \"He's broke, has scandal still hanging over him, national attention now on his controversies,” he said. “It's going to be expensive and outside parties will need to invest and help, but this remains a dead heat.\"\nAlthough the NRSC backed Cochran in the primary, there was some doubt how enthusiastically it might back him in the runoff -- given the chance that McDaniel could wind up as the party's nominee in November.","url":"https://www.nbcnews.com/politics/first-read/national-republicans-say-they-are-all-cochran-n122441"}
