{"authors":[],"date_download":"2018-10-30 21:24:53","date_modify":"2018-10-30 21:24:53","date_publish":"2018-08-01 13:00:11","description":"WASHINGTON (AP) — The New York Mets have been searching for any reason to smile during a miserable season. This laugher wasn't exactly","filename":"data/vaneerConsumption/NationalsSetTeamScoringRecordRoutReyesMets254.json","image_url":"https://media.breitbart.com/media/2018/08/AP-Alex-Brandon.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2018_08_01__1540934693.html","title":"Nationals Set Team Scoring Record, Rout Reyes, Mets 25-4","title_page":"Nationals Set Team Scoring Record, Rout Reyes, Mets 25-4 | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"WASHINGTON (AP) — The New York Mets have been searching for any reason to smile during a miserable season. This laugher wasn’t exactly what they had in mind.\nIn the highest-scoring game in Nationals franchise history, Daniel Murphy hit two early home runs and Washington kept pouring it on against emergency reliever Jose Reyes and the Mets in a 25-4 rout Tuesday night.\n“Even to throw Jose Reyes out there and the guys hit them like they did, you don’t even see that in BP,” Mets manager Mickey Callaway said. “Those guys were locked in, they came out tonight and they beat us up pretty bad.”\nThe Nationals set the team scoring mark dating to their days when they started as the Montreal Expos in 1969. It was the Mets’ most-lopsided loss in their 57-season history, worse than a 26-7 pounding by Philadelphia in 1985.\nIt got so out of hand, Mets television announcers Keith Hernandez, Ron Darling and Gary Cohen took turns reading verbatim from the team’s media guide in the late innings — the SNY network played the theme from “Masterpiece Theatre” in the background.\nReyes made the first pitching appearance of his career, and the 35-year-old infielder got tagged for home runs by Matt Adams and Mark Reynolds in a six-run eighth. Throwing a fastball in the mid-80s mph and a curve in the upper 40s, Reyes gave up five hits, walked two and threw 48 pitches.\nReyes retired Ryan Zimmerman on a flyball to begin the inning. The Nationals went batty after that, and Zimmerman came up again with two outs.\nThis time, Reyes floated in a pitch that hit Zimmerman in the leg. Zimmerman did a little shake in the batter’s box, then playfully faked a charge toward the mound, drawing a laugh from Reyes.\n“I didn’t want to make two outs against him. I’ve played against Jose for a long time. He’s one of my favorite players to play against,” Zimmerman said. “He always has a smile on his face. That was pretty funny and surreal to hit against him after all that we’ve been through against each other.”\nReyes said he had wanted to pitch in one game before he retires.\n“When you are on the mound before you throw a pitch, it’s fun,” he said. “But when you start to see people hit a homer and stuff … I don’t want to see that.”\nAsked if he was available for Wednesday’s game, Reyes kidded: “Not for pitch.”\nReyes wore one of ace Jacob deGrom’s gloves on the hill. DeGrom was among many players on both sides chuckling at the spectacle.\nTrea Turner, who apologized before the game to his teammates for homophobic and racially insensitive tweets he sent several years ago, had four of Washington’s 26 hits. Pitcher Tanner Roark hit a three-run double during a seven-run first inning.\nMurphy drove in six runs, Anthony Rendon had four RBIs and Zimmerman also homered.\nAhead 7-0, the Nationals then scored exactly three runs in the second, third, fourth and fifth innings.\nHours after general manager Mike Rizzo capped a relatively uneventful trade deadline day by expressing his confidence in the Nationals as currently constituted, Washington broke loose in evening its record at 53-53.\nBryce Harper, who had been mentioned in trade speculation, hit a pair of RBI doubles and scored three times.\n“It’s been an emotional day and it was a good way to end it,” Nationals manager Dave Martinez said.\nLeading 25-1 in the ninth, the Nationals still hit a little speed bump at the end. Reliever Shawn Kelley gave up a home run to Austin Jackson, wound up and flung his glove to the ground.\nThe homer came after Kelley, working quickly, had been told to slow down by the plate umpire.\n“I was just trying to get through the inning and get the game over with,” Kelley said. “I thought everybody had seen enough baseball for one evening.”\nKelley said he was sorry for his tantrum.\n“You should never throw your glove. We should act like adults,” he said.\nJeff McNeil hit his first career home run. As he headed from the plate back the Mets dugout, he already had the souvenir. The ball came back on the field and was flipped to him before he reached the bench.\nRoark (5-12) went seven innings. Steven Matz (5-9) got only two outs and allowed seven runs in the shortest start of his career.\nMurphy had an RBI single in the first, a two-run homer in the second and a three-run drive in the third. The ex-Met is hitting .391 (59 for 151) with 11 homers and 43 RBIs against New York.","url":"https://www.breitbart.com/sports/2018/08/01/nationals-set-team-scoring-record-rout-reyes-mets-25-4/"}
