{"authors":["Michelle Moons"],"date_download":"2018-10-30 19:34:29","date_modify":"2018-10-30 19:34:29","date_publish":"2015-06-09 21:12:15","description":"SACRAMENTO -- A sea of red flowed over the steps of California’s State Capitol on Tuesday as opponents of the new vaccine bill, SB 277, rallied against its passage. Hundreds gathered to hear legislators and a diverse variety of Californians from across the state denounce the bill ahead of a public hearing in the State Assembly’s Committee on Health. |","filename":"data/vaneerConsumption/NationofIslamJoinsAntiVaccineBillProtestinSacramento.json","image_url":"https://media.breitbart.com/media/2015/06/Islam-SB277-Michelle-Moons-Breitbart-News.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/local_2015_06_09__1540928069.html","title":"Nation of Islam Joins Anti-Vaccine Bill Protest in Sacramento","title_page":"Nation of Islam Joins Anti-Vaccine Bill Protest in Sacramento | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"SACRAMENTO — A sea of red flowed over the steps of California’s State Capitol on Tuesday as opponents of the new vaccine bill, SB 277, rallied against its passage. Hundreds gathered to hear legislators and a diverse variety of Californians from across the state denounce the bill ahead of a public hearing in the State Assembly’s Committee on Health.\nAssembly Member Devon Mathis (R-Visalia) said, “This bill, in my opinion, is not about vaccines. It is about combatting an overreaching government from infringing our Constitutional rights, religious freedoms and to protect the relationships between the patients and their medical professional.”\nMathis cited the previously passed AB 2109, which requires healthcare professionals to discuss the benefits and risks associated with vaccinations.\n“SB 277 is a vehicle to strip Californians of their rights and set precedents which can ripple across the nation. I did not spend 10 years as a Sergeant in the Army National Guard getting blown up twice for our country to come home and have legislators try to infringe on your rights.”\nAssembly Member Shannon Grove (R-Bakersfield) spoke next, saying, “Sacramento politicians, some of them up here, they don’t trust you as parents. They assume you’re ignorant or stupid. They think that you can’t be trusted with the care of your own children. But they have forgotten who they work for.” The crowd cheered.\nShe continued:\nThere is no public health crisis here that warrants this law. These politicians don’t want you to think for yourself. They think they are better parents than you are. And they are annoyed that you are clogging up their hallways. They are annoyed that you are demanding to be left alone. They are annoyed that you are not compliant. They don’t want you to question their wisdom or their expertise. They don’t want you demanding your freedom or your constitutional rights for your children to a good quality education. They think they have the final sa- so.\n“Keep fighting, because if they take this from you and you cower down this will not be the last thing they take from you,” Grove closed.\nAssembly Member Jim Patterson (R-Fresno), a member of the Assembly Committee on Health, said, “There is something fundamentally wrong with a law that strips away parental responsibility and parental rights.”\nHe continued, “There is something wrong with a bill that suggests that the only alternative that you would have for your children is homeschooling. I thought we apologized for internment camps a long time ago.”\nEven the Nation of Islam turned up. Minister Tony Muhammad, Western Regional Representative for the Nation of Islam, identifying himself as a Representative of Minister Louis Farrakhan, said, “This heinous bill has come to the attention of the black community. I’m here to represent a man who told me to tell you that this fight is a universal fight.”\nHe compared the bill to the story of the Pharaoh of Egypt killing all male babies under two in Egypt. “Could this be a bill to destroy our boy babies? I’m letting you know that the black community, we are not going to stand by.”\nThe final speaker of the rally, Dr. Bob Sears, said that “this bill is not about whether vaccines are right or wrong,” and that if legislators “vote against this bill it doesn’t mean that they’re anti-vaccine at all.”\nRather, he said, the bill would be ineffective. He argued that if SB 277 had been enacted leading into last winter’s measles outbreak, it would not have stopped the spread of the disease.\nThe rally closed with leaders guiding protesters to the hearing for SB 277 in the Assembly Committee on Health, ongoing as of this writing.\nFollow Michelle Moons on Twitter @MichelleDiana","url":"https://www.breitbart.com/local/2015/06/09/hundreds-gather-in-sacramento-to-protest-vaccine-bill/"}
