{"authors":[],"date_download":"2018-10-22 21:29:21","date_modify":"2018-10-22 21:29:21","date_publish":"2014-05-07 14:32:41","description":"The latest results on national assessment tests reinforce concerns that large numbers of students are unprepared for college or the workplace.","filename":"data/vaneerConsumption/NationsReportCardHighSchoolSeniorsShowNoImprovement.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_nations-report-card-high-school-seniors-show-no-improvement-n99231_1540243761.html","title":"Nation's Report Card: High School Seniors Show No Improvement","title_page":"Nation's Report Card: High School Seniors Show No Improvement","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn an abysmal showing, only about one-quarter of U.S. high school seniors performed solidly in math on a national assessment known as the nation's report card, reinforcing concerns that large numbers of students are unprepared for college or the workplace.\nIn reading, almost 4 in 10 students reached that level, known as \"proficient,\" or higher.\nIn both subjects on the 2013 exam there was little change from 2009, when the National Assessment of Educational Progress (NAEP) test was last given to 12th-graders. The national results come from a representative national sample of 92,000 public and private school students.\nThe stagnation is \"unacceptable,\" said David Driscoll, chairman of the National Assessment Governing Board, which sets policy for the exam.\n\"Achievement at this very critical point in a student's life must be improved to ensure success after high school,\" Driscoll said.\nThe results follow on just-released research that U.S. high school graduation rates in 2012 reached 80 percent, a record.\nJohn Easton, acting commissioner of the Education's Department's National Center for Education Statistics, said one hypothesis is that lower-performing students who in the past would have dropped out were in the sampling of students who took the exam.\nIn reading, 38 percent share of students performing at or above proficient was lower than when the assessment was first given in 1992, when it was 40 percent. Scores have remained similar since 1994.\nPast comparisons in math date only to 2005. Scores increased from 2005 to 2009, but then stagnated.\nEven as 12th-grade scores have flat-lined, third- and eighth-grade students have made slow but steady progress on the exam since the early 1990s; most progress came in math. At all levels, there continue to be racial disparities, with white students performing better than African-American and Hispanic students.\n— The Associated Press","url":"https://www.nbcnews.com/news/us-news/nations-report-card-high-school-seniors-show-no-improvement-n99231"}
