{"authors":["Simon Black","Sovereign Man"],"date_download":"2018-10-31 00:25:49","date_modify":"2018-10-31 00:25:49","date_publish":"2018-07-10 00:00:00","description":"For every $1 the US government borrowed in the last decade resulted in just 44 cents of economic output. The problem is not the debt itself. It’s that the government does not invest in things that will bring in returns.","filename":"data/vaneerConsumption/NationaldebtUSgovernmentspendingspedpastincomeinlastdecade.json","image_url":"https://amp.businessinsider.com/images/5b44fec2d7751408398b47fa-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_national-debt-us-government-spending-sped-past-income-in-last-decade-2018-7_1540945549.html","title":"National debt: US government spending sped past income in last decade","title_page":"    National debt: US government spending sped past income in last decade - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"The National debt is shown behind Federal Reserve Chairman Jerome Powell, left, as he makes the semiannual monetary policy report to the House Financial Services Committee, Tuesday, Feb. 27, 2018, in Washington. Jacquelyn Martin/AP\nExactly ten years ago, in the middle of the summer of 2008, the world was only two months away from the most severe financial crisis since the Great Depression.\nAt the time, the size of the US economy as measured by Gross Domestic product was around $14.8 trillion- by far the largest in the world.\nAnd the US national debt back then was about 64% of GDP- roughly $9.5 trillion.\nFast forward a decade and take a snapshot of the same numbers: US GDP has grown nearly 35% to $19.9 trillion.\nBut the national debt has soared 122% to over $21 trillion.\nThe debt-to-GDP ratio in the United States is now 106%, meaning that the national debt is larger than the size of the entire US economy. Yet the debt keeps growing. Rapidly.\nNow, debt isn't really the problem here. The problem is the way that it's been used.\nDebt (affectionately referred to as 'other people's money') can actually be a great way to enhance investment returns when used wisely and judiciously.\nPrivate equity fund managers use debt to acquire businesses through what's known as a 'leveraged buy-out', where they'll put up a portion of the cash they need, and borrow the rest.\nI did this a couple of years ago, for example, when I purchased an Australian-based business for $6 million.\nA local bank offered to finance most of the acquisition with a $4.5 million loan at around 5.75%.\nThat meant I only needed to write a $1.5 million check for a business that was earning nearly $2 million annually.\nIt was a no-brainer, because I knew there would be more than enough money to make the loan payment (less than $500k annually) and still generate a substantial return on investment.\nReal estate investors do the same when they purchase property.\nIf you have, say, $1 million, you could pay cash for a single property that costs $1 million… or you could use that money as a down payment and buy a $5 to $10 million property.\nIf the investment is a good one, the cash flow will more than cover the loan payments, and you'll end up making a lot more money.\nIntelligent governments (hopefully not an oxymoron) will do the same thing, borrowing money to finance infrastructure projects that generate more growth and tax revenue.\nSeveral years ago in Panama, for example, the government borrowed billions of dollars to finance the expansion of the Panama Canal.\nThat's a lot of debt to take on for such a small country. But they knew that expanding the canal would dramatically increase the revenue that it generates.\nThe canal was originally opened in 1914 back when cargo ships were much, much smaller.\nBut by the early 21st century, the US Army Corps of Engineers (which built the Panama Canal in the early 1900s) estimated that the number of cargo ships which could no longer fit in the canal's locks accounted for 45% of global trade and shipments.\nSo increasing the size of the canal to accommodate those larger ships (and hence generate more revenue from the increased tolls) was a great investment… and one where debt made a lot of sense.\nSo Panama borrowed about $3 billion to finance the canal expansion in 2008; at the time the country's GDP was about $23 billion.\nA decade later, the Canal expansion is complete, and Panama's economy has nearly tripled to $62 billion.\nIt was clearly a good investment: they borrowed $3 billion in debt and got WAY more than $3 billion in additional economic output.\nNow let's go back to the US.\nIn the same period, from 2008 through 2018, the US government borrowed an additional $11.6 trillion on top of the existing debt they had already borrowed.\nSo you'd think that there would have been AT LEAST $11.6 trillion in additional economic output, right?\nBut that's not what happened in the Land of the Free.\nUncle Sam borrowed $11.6 trillion between 2008 and 2018. But the US economy only grew by $5.1 trillion.\nSo every $1 the government borrowed resulted in just 44 cents of economic output.\nAgain, you'd think that every $1 borrowed would have generated at least $1 in economic output.\nAfter all, if you borrow $10 million to acquire real estate, you'd think you'd AT LEAST have an asset worth $10 million. And if it's a good investment, hopefully more than that.\nThe US government used to make good investments.\nIn 1803, the administration of Thomas Jefferson acquired 2.1 million square kilometers of land from the French in what became known as the Louisiana Purchase.\nJefferson's people negotiated a hell of a deal, paying the equivalent of about $300 million- just 40 cents per acre in today's money. And yes, they used debt to finance the purchase.\nLater administrations bought Florida from the Spanish, Alaska from the Russians, the Virgin Islands from Denmark, etc. These were all phenomenal deals.\nEven as late as the 1950s, the bulk of the US federal budget was productivity-related investments like infrastructure. Mandatory entitlements comprised just 29% of the budget.\n(Bear in mind, back then they still had plenty of entitlement programs including Social Security, the GI Bill, etc.)\nBy the early 21st century there were hardly any productivity-related investments remaining.\nMandatory entitlements alone account for more than 60% of the US federal budget.\nAnd Uncle Sam managed to blow $2 billion on a website- literally six times more than the entire Louisiana Purchase cost in inflation-adjusted dollars.\nWith decisions like that, it's easy to understand how $11.6 trillion in debt would only result in $5.1 trillion in economic output.\nAnd that's the real killer.\nIt's not the debt itself. It's the painfully wasteful decisions of what they choose to do with it.","url":"https://www.businessinsider.com/national-debt-us-government-spending-sped-past-income-in-last-decade-2018-7"}
