{"authors":["Thomas Colson"],"date_download":"2018-10-30 20:37:18","date_modify":"2018-10-30 20:37:18","date_publish":"2016-12-29 00:00:00","description":"The news comes amid predictions from economists and estate agents that London's property boom may be grinding to a halt.","filename":"data/vaneerConsumption/NationwideLondonhousepricesrisebelowUKaverageforfirsttimesince2008.json","image_url":"https://amp.businessinsider.com/images/586530a3dd0895427f8b4a21-1136-568.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_nationwide-london-house-prices-rise-below-uk-average-for-first-time-since-2008-2016-12_1540931838.html","title":"Nationwide: London house prices rise below UK average for first time since 2008","title_page":"    Nationwide: London house prices rise below UK average for first time since 2008 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Willesden Green, London Wikipedia / CC 3.0 LONDON — House prices in London grew more slowly in 2016 than the national average for the first time since 2008, according to Nationwide's latest House Price Index.\nFigures from the mortgage lender put UK house price growth in 2016 at 4.5%, the same rate as 2015. Price growth in London fell to 3.7%, down from 12.2% in 2015.\nThe news comes amid predictions from economists and estate agents that London's property boom may be grinding to a halt, amid slowing demand and political uncertainty brought on by the Brexit vote.\nRobert Gardner, Nationwide's chief economist, said: \"There were signs that London's significant period of outperformance may be drawing to a close. For the first year since 2008, annual house price growth in the capital was lower than the UK average, with prices increasing by 3.7% over the year, down from 12.2% in 2015.\"\nLondon remained the most expensive part of the country to buy a home. The average price for a home in the capital is £473,073, compared to £205,937 nationally.\nGardner said that house price growth nationally had been stable in 2016, with strong house price growth in England, and slightly more subdued growth in Wales, Scotland, and Northern Ireland.\nHe said that the \"modest\" economic slowdown predicted by the Bank of England for 2017 will result in modestly slower house price growth, and predicted a small gain of around 2% over the year.\nGiven that the Bank of England predicts a 2.7% rise in inflation next year, a nominal increase of 2% would actually represent a real-terms decrease in capital appreciation.\nJeremy Leaf, former chairman of the Royal Institute for Chartered Surveyors, said in an emailed statement: \"London clearly has suffered more in the price stakes than elsewhere in the country, a reverse of what we were seeing earlier in the year and for most of 2015.\n\"The real test for the market will come in the early new year when we see whether continuing low mortgage rates and lack of new and existing housing supply prove more relevant than uncertainty over unemployment, inflation and the wider economy post-Brexit,\" he added.","url":"https://www.businessinsider.com/nationwide-london-house-prices-rise-below-uk-average-for-first-time-since-2008-2016-12"}
