{"authors":["Dr. Susan Berry"],"date_download":"2018-10-30 21:29:02","date_modify":"2018-10-30 21:29:02","date_publish":"2014-07-14 21:48:20","description":"The National Governors Association (NGA) owns the copyright - along with the Council of Chief State School Officers (CCSSO) - to the Common Core State |","filename":"data/vaneerConsumption/NationalGovernorsGroupAvoidsRadioactiveCommonCore.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2014/07/14/nga-meeting-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2014_07_14__1540934942.html","title":"National Governors Group Avoids 'Radioactive' Common Core","title_page":"National Governors Group Avoids 'Radioactive' Common Core | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The National Governors Association (NGA) owns the copyright – along with the Council of Chief State School Officers (CCSSO) – to the Common Core State Standards. When the nationalized standards are mentioned these days, however, many governors would rather change the subject.\nIn fact, the NGA, holding summer meetings in Nashville, had not even placed the controversial standards on its official agenda, a sign, as the Wall Street Journal states, “the bipartisan idea has become a political minefield.”\nMuch to the surprise of many Washington, D.C., pundits, the standards, and even the name itself, “Common Core,” have “become, in a sense, radioactive,” said Iowa Gov. Terry Branstad (R), according to the Associated Press.\nThe governors’ association is not taking a position on implementation of the Common Core, though the group was a key player when the standards were developed in 2009.\n“I guarantee you there will be a lot of discussion this week about it among individuals and in governors-only meetings in terms of, ‘Tell me what you are doing. What’s the impact?'” said Tennessee Gov. Bill Haslam (R), who has continued his support for the Common Core and joined with former Florida Gov. Jeb Bush (R) and U.S. Sen. Lamar Alexander (R-TN) in March to promote them.\nIndeed, for Republicans, the issue of the Common Core has also been described by former Gov. Mike Huckabee (R) as “toxic,” and has served to separate the GOP establishment, supported by the U.S. Chamber of Commerce, from constitutional conservatives who oppose the federal government’s hand in pushing Common Core through President Obama’s Race to the Top (RttT) stimulus program and the promise of relief from federal No Child Left Behind restrictions.\nEmmett McGroarty, education director of the American Principles Project, is concerned about federal overreach into education.\n“The NGA and many individual governors want to ignore the cold, hard facts,” McGroarty told Breitbart News. “The Framers intended that the governors and state legislatures would protect citizens from federal intrusion so that the people could make their own decisions about important matters like education policy.”\n“With respect to the Common Core, many governors – spurred on by the NGA – failed to do this, and in fact the NGA actually invited the federal government to push the standards into the states,” McGroarty explained. “Together, the NGA and those governors cut state legislators and citizens out of the process.”\nMcGroarty asserts that, because of the failure to include state lawmakers and parents in the process, “the NGA’s Common Core Standards are defective and lock children into a low-quality education.”\n“The Common Core initiative is a man-made disaster that arose from a lack of respect for the people, the legislators who represent them, and the constitutional structure intended to protect them,” McGroarty said.\nIn an ironic twist, leading the states in repealing the Common Core standards, without simply “rebranding” or renaming them, is Oklahoma Gov. Mary Fallin (R), who also happens to be the chair of the NGA. Oklahoma will not only write its own standards, which the law says must be shown to be sufficiently unlike the Common Core, but has reverted to its former PASS standards for the coming school year.\n“Common Core has become a divisive issue in our nation, with the concern that the federal government is trying to mandate standards down to states,” Fallin said Friday. “The governors are listening to their voters and their constituents back home who are concerned about the federal overreach into states, and each governor will do what’s in the best interest of their states.”\nThough Indiana Gov. Mike Pence (R) was the first of the governors to declare the Common Core repealed in his state, many Hoosier parents have been highly critical of his decision to ignore both them and the advice of standards experts he invited to assist in writing replacement standards. It turns out Pence’s replacement standards are remarkably similar to the Common Core and, in some cases, even inferior.\nAccording to the WSJ, however, Pence, a 2016 presidential hopeful, “rejects” that claim.\nSouth Carolina, led by Gov. Nikki Haley (R), also plans to write its own standards to replace the Common Core, though the nationalized standards will remain in place for the coming school year.\nGov. Bobby Jindal (R), also a 2016 potential presidential hopeful, has taken on his state’s superintendent and state school board president – who have threatened to sue the governor – to remove Louisiana from the PARCC Common Core test consortium, a battle that has demonstrated the power that state boards of education have achieved through the years over state legislatures, local school districts, and parents.\nAnna Arthurs, a physician and parent organizer of a grassroots group in Louisiana, said she is not surprised that Common Core has been avoided at the recent NGA meetings.\n“It is getting difficult for this D.C.-based trade organization to continue to defend the full initiative associated with these standards,” Arthurs told Breitbart News. “The NGA can no longer continue with the false claim that these standards were ‘state-led’ and are the will of American voters, teachers, principals, and parents.”\n“The NGA also can no longer deny the federal government’s role in this initiative, since we now know that cash-strapped states were financially coerced to adopt these standards in order to receive Race to the Top federal stimulus funds, NCLB waivers and Title I funds,” Arthurs continued. “These standards may not have been a federal mandate, but that is only because the federal government could not do this by law. They skirted the law as best they could and their intent is undeniable.”\nArthurs also challenged what has been the claim of the NGA and other proponents that the Common Core is just “standards,” and not “curriculum.”\n“We have seen the publisher’s criteria sent out by the NGA and CCSSO to textbook companies to instruct them how to make their material comply with these national standards,” Arthurs said. “Also, it is the federal government that exclusively funds the national PARCC and SBAC assessment tests which will be used to make sure that states are teaching to these standards.”\nArthurs said that, contrary to the depiction of Common Core opponents as “crazy,” American parents – and voters – have become very informed and educated about the standards initiative.\n“We are not going away,” she asserted. “Several of the members of the NGA initially supported these standards due to the impressive Gates-funded sales pitch, but they too have educated themselves. They are now paying attention to the facts and the will of their constituents.”\nIn a recent Washington Post interview, Bill Gates admitted that the primary goal of the Common Core was to socially engineer the “huge problem that low-income kids get less good education than suburban kids get…”\nThe argument has been made, however, that in attempting to make it easier for low-income and minority children to be part of an engineered “workforce,” the low-quality Common Core standards actually do a disservice to bright children wanting to move on to STEM careers, regardless of their background.\nDr. Sandra Stotsky, Professor Emerita, University of Arkansas, and Dr. R. James Milgram, Professor Emeritus, Stanford University, are both standards experts who were invited to be members of the Common Core Validation Committee, but refused to sign off on the standards.\nIn an email statement to Breitbart News, Stotsky said:\nIt is a sad commentary on the education of both Republican and Democratic governors that neither group of governors has seen fit to ask their higher education teaching faculty in science, engineering, and mathematics to tell them how Common Core’s mathematics standards and tests deepen the lack of equity in K-12 education.\n“Some of us really don’t care about things like whether or not Common Core is a federal takeover of public education,” Milgram, a mathematician, told Breitbart News.\n“If the standards were capable of improving the outcomes for our brighter students who would, normally, be interested in STEM areas, I’d be their strongest supporter,” he added. “But they don’t do this at all. They are aimed at the weakest students and provide an absolute minimum for students to enter a community college, nothing more.”\n“Statistically speaking, even if a student with this background wanted to major in a STEM related area, only one in fifty would succeed,” Milgram said.","url":"https://www.breitbart.com/politics/2014/07/14/National-Governors-Group-Avoids-Radioactive-Common-Core/"}
