{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:40:38","date_modify":"2018-10-30 20:40:38","date_publish":"2016-07-09 15:35:57","description":"Contents: Japan's elections put constitution's pacifism clause into question; Nato deploying a 'tripwire' of 4,000 soldiers along Russia's border | National Security","filename":"data/vaneerConsumption/NatoDeployingaTripwireof4000SoldiersAlongRussiasBorder.json","image_url":"https://media.breitbart.com/media/2016/07/wi/afp_4b6f41311b24ea0cb7850890bef658acb5e7abdb-e1468078543385.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_07_09__1540932038.html","title":"Nato Deploying a 'Tripwire' of 4,000 Soldiers Along Russia's Border","title_page":"Nato Deploying a 'Tripwire' of 4,000 Soldiers Along Russia's Border","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nJapan’s elections put constitution’s pacifism clause into question\nNato deploying a ‘tripwire’ of 4,000 soldiers along Russia’s border\nJapan’s elections put constitution’s pacifism clause into question\nShinzo Abe campaigning for Sunday’s elections (Kyodo)\nOn Sunday, Japan will hold parliamentary elections for half the seats in Japan’s upper house. There is a possibility (far from a certainty) that the Liberal Democratic Party (LDP) will, along with its coalition partner Komeito, get a two-thirds supermajority in the upper house. LDP, which is led by prime minister Shinzo Abe, already has a two-thirds supermajority in the lower house.\nJapan’s constitution may be amended only by a two-thirds vote of both houses of the Diet (parliament). So if Abe gets his desired supermajority in both houses, then his LDP party could amend the constitution.\nAnd Abe has said repeatedly in the past that what he’d like to change is the “self-defense” clause of the constitution, that prohibits Japan’s armed forces from being involved in military actions except in self-defense. Here is the text of the actual clause, as written by an American team led by Gen. Douglas MacArthur, who had led the American forces to victory of Japan in World War II:\nCHAPTER II – RENUNCIATION OF WAR Article 9. Aspiring sincerely to an international peace based on justice and order, the Japanese people forever renounce war as a sovereign right of the nation and the threat or use of force as means of settling international disputes. In order to accomplish the aim of the preceding paragraph, land, sea, and air forces, as well as other war potential, will never be maintained. The right of belligerency of the state will not be recognized.\nThe movement to amend the self-defense clause has gathered steam in the last ten years, primarily motivated by the rise of China and in particular China’s military threats against the Senkaku Islands, which are governed by Japan.\nIn 2015, Japan adopted new “collective defense” laws, partially departing from the pacifism in the constitution. The old self-defense clause of the constitution has been interpreted to permit military action only when Japan itself is being attacked, and only on Japanese soil. The new collective defense laws reinterpret the self-defense clause to include “collective self-defense,” which would permit military action anywhere in the world under some circumstances when an ally (such as the United States) is attacked. I discussed the meaning of “collective self-defense” in detail in 2014 in “5-May-2014 World View — Japan debates ‘collective self-defense’ to protect America and Japan”.\nAmending the self-defense clause is extremely controversial in Japan, so much so that Abe isn’t even talking about in his campaigning, choosing to focus instead on the economy. That may be an even greater risk, because Japan’s economy has not been doing well, and some people blame the weakness of Abe’s “Abenomics” program of massive stimulus through monetary easing, fiscal stimulus and structural reforms. The goal was to reach 2% inflation, but instead Japan remains in a deflationary spiral. Perhaps the only good news for Abe is that deflation is a worldwide phenomenon, so it can’t be blamed specifically on him. Japan Times and Constitution of Japan and Manila Times and CNBC\nNato deploying a ‘tripwire’ of 4,000 soldiers along Russia’s border\nAt an annual summit meeting in Warsaw Poland on Friday, Nato announced that it will deploy four multinational battalions of 1,000 soldiers each, in each of four countries — Poland, Lithuania, Latvia and Estonia. The deployment will take place in six to nine months.\nThese four countries have been urgently requesting such a deployment for years, especially since Russia invaded Ukraine and annexed Crimea. These countries are nervous that Russia’s president Vladimir Putin will order his army to do the same kind of thing to one or all of them.\nThe four battalions will come from four different Nato countries: the United States, Germany, Canada and the United Kingdom.\nIt will not be possible to defend against an invasion by Russia’s massive army with just 4,000 soldiers. However, this “tripwire” force will almost certainly deter Russia from invading. In Ukraine, Russia’s forces were able to just walk in and take over, especially in Crimea, with little or no resistance. But Russia won’t be able to do the same in Poland or the Balkans because it would amount to a declaration of war against Nato, which even Vladimir Putin would probably like to avoid. Radio Poland and France 24 and Nato Joint Resolution and CNN\nKEYS: Generational Dynamics, Japan, Shinzo Abe, Abenomics, Liberal Democratic Party, LDP, Komeito, China, Senkaku Islands, collective self-defense, Nato, Poland, Lithuania, Latvia, Estonia, tripwire force, United States, Germany, Canada, United Kingdom, Russia, Vladimir Putin, Ukraine, Crimea\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2016/07/09/9-jul-16-world-view-nato-deploying-tripwire-4000-soldiers-along-russias-border/"}
