{"authors":["Associated Press"],"date_download":"2018-10-23 02:03:15","date_modify":"2018-10-23 02:03:15","date_publish":"2016-01-28 16:43:13","description":"BRUSSELS (AP) — The NATO chief said Thursday the alliance is considering a U.S. request to provide AWACS surveillance planes to help in the fight against Isl...","filename":"data/vaneerConsumption/NATOconsideringUSrequestforAWACStofightIslamicState.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420831_NATO-considering-US-request-AWACS-fight-Islamic-State_1540260195.html","title":"NATO considering US request for AWACS to fight Islamic State","title_page":"NATO considering US request for AWACS to fight Islamic State | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NATO considering US request for AWACS to fight Islamic State\nBRUSSELS (AP) — The NATO chief said Thursday the alliance is considering a U.S. request to provide AWACS surveillance planes to help in the fight against Islamic State extremists.\nNATO Secretary-General Jens Stoltenberg told reporters \"we are now looking into that request.\" He said \"different ways\" to provide the support were under consideration but no decision had been made yet.\nThe trans-Atlantic alliance is not directly involved in the fight against Islamic State, although the United States and all other NATO member states belong to the coalition fighting IS in Iraq and Syria.\nSince about 30% of the personnel aboard NATO AWACS planes are German, the issue has aroused particular interest in Germany. Deploying German service personnel in a combat zone would require approval from that country's parliament.\nStoltenberg said the AWACS question will be considered at a meeting of NATO defense ministers in Brussels in early February, but declined to predict when a decision might be made. He assured German journalists that their country's concerns will be taken into account.","url":"https://www.dailymail.co.uk/wires/ap/article-3420831/NATO-considering-US-request-AWACS-fight-Islamic-State.html"}
