{"authors":["Associated Press"],"date_download":"2018-10-23 01:14:08","date_modify":"2018-10-23 01:14:08","date_publish":"2016-01-28 15:32:19","description":"BRUSSELS (AP) — NATO declared Thursday that alliance defense spending is finally moving in the \"right direction,\" although one country, the United States, st...","filename":"data/vaneerConsumption/NATOchiefAllieddefensespendinggoinginrightdirection.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-urn:publicid:ap.org:8a0026000ad3415ea966e321319bf51e-2vdWmEltwXfba0ce28e632a2eb01-434_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3420661_NATO-chief-Allied-defense-spending-goes-right-direction_1540257248.html","title":"NATO chief: Allied defense spending going in right direction","title_page":"NATO chief: Allied defense spending going in right direction | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NATO chief: Allied defense spending going in right direction\nBRUSSELS (AP) — NATO declared Thursday that alliance defense spending is finally moving in the \"right direction,\" although one country, the United States, still accounts for almost three-quarters of the alliance's total military expenditures.\nIn NATO's annual report released Thursday, the U.S. share stood at 72 percent of total spending.\nNATO secretary-general Jens Stoltenberg said in 2015, 16 NATO countries not only stopped cuts to their defense budgets but increased expenditures in real terms. Twenty-three of the 28 NATO members boosted the amounts they spend on tanks, planes and other military hardware.\nNATO Secretary General Jens Stoltenberg speaks during a media conference as he presents the NATO annual report in Brussels on Thursday, Jan. 28, 2016. NATO says alliance defense spending is moving in the ¿right direction,¿ though one country, the United States, still accounts for almost three quarters of the alliance¿s total defense expenditures. (AP Photo/Virginia Mayo)\n\"Over the past year, we have started to move in the right direction,\" Stoltenberg told reporters in Brussels.\n\"After many years of substantive reductions in defense spending, the cuts now are practically stopped among European allies and Canada,\" he said. \"And in 2015, defense cuts were close to zero.\"\nBut, Stoltenberg said, \"we all need to do more. Because to the east and to the south, we face the biggest security challenges in a generation.\"\nAccording to the report, aggregate defense spending by NATO countries actually shrank in 2015 by 1.5 percent to an estimated $871 billion, which Stoltenberg said was due to cutbacks in U.S. military operations in Iraq and Afghanistan as well as spending reductions in major European alliance members like Italy.\nIn the same period, total military spending by NATO's European members and Canada dropped a mere 0.3 percent, a third of the reduction the previous year.\nSummarizing the contradictory trends, Stoltenberg said when it comes to current defense spending by NATO allies, \"the picture is mixed, but the picture is better.\"\nFaced with new and simultaneous security threats from Russia and extremist Muslim movements in the Middle East and North Africa, U.S. President Barack Obama and other NATO leaders agreed in September 2014 that their countries should aim to spend 2 percent of Gross Domestic Product on defense.\nStoltenberg said while only three countries made good on that target in 2014, five did last year: the United States, Britain, Greece, Poland and Estonia.\nThe national leaders also vowed at the summit in Wales to devote 20% of defense spending to major equipment purchases and research and development. According to the NATO report, in 2015 only three countries met both that benchmark and the 2 percent of GDP target: the U.S., Britain and Poland.\n\"Boosting our defense posture does not come for free,\" Stoltenberg said. \"We still have a very long way to go ... because it's not enough to stop the cuts. We have to also start to increase.\"","url":"https://www.dailymail.co.uk/wires/ap/article-3420661/NATO-chief-Allied-defense-spending-goes-right-direction.html"}
