{"authors":["Associated Press"],"date_download":"2018-10-23 05:28:22","date_modify":"2018-10-23 05:28:22","date_publish":"2016-01-29 21:21:35","description":"SAN DIEGO (AP) — A federal judge on Friday sentenced a Navy officer to 40 months in prison for providing ships and submarine schedules to a Malaysian contrac...","filename":"data/vaneerConsumption/Navyofficersentencedto40yearsinbriberycase.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3423501_Navy-officer-sentenced-40-years-bribery-case_1540272502.html","title":"Navy officer sentenced to 40 years in bribery case","title_page":"Navy officer sentenced to 40 years in bribery case | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Navy officer sentenced to 40 years in bribery case\nSAN DIEGO (AP) — A federal judge on Friday sentenced a Navy officer to 40 months in prison for providing ships and submarine schedules to a Malaysian contractor in exchange for cash, the services of a prostitute and luxury hotel stays in Singapore, Hong Kong and the island of Tonga.\nLt. Cmdr. Todd Dale Malaki told Judge Janis L. Sammartino that he regretted his actions before he was sentenced Friday in San Diego.\nMalaki is among nine defendants who have pleaded guilty to bribery charges including the case's central figure, Singapore-based executive Leonard Francis. The gregarious businessman bribed Navy officials with extravagant gifts to obtain information that helped his Glenn Defense Marine Asia bilk the Navy out of at least $20 million, according to the criminal complaint. Francis is awaiting sentencing.\nOnly one defendant is still fighting the charges. Prosecutors have suggested there still could be arrests in the ongoing investigation that has rocked one of the world's largest Navy fleets.\nSammartino told the court that a more significant sentence was warranted because of Malaki's long-term corruption over more than seven years. She said Malaki's case was \"one of the most serious offenses the court has seen in its tenure in the Southern District of California.\" She ordered Malaki, 44, to pay a $15,000 fine and $15,000 in restitution to the Navy.\nMalaki's defense attorney, Jeremiah Sullivan, said his client has taken responsibility for what he did.\n\"He dedicated 26 years of his life to serving the Navy and his country and he let everyone down,\" Sullivan said. \"It pains him that he hurt so many.\"\nMalaki had faced a maximum of five years in prison. He is the second defendant to be sentenced. Last week, Navy Petty Officer First Class Daniel Layug was sentenced to 27 months in prison for conspiracy to commit bribery.\nMalaki's sentencing comes a day after Navy Cmdr. Michael Misiewicz, one of the highest ranking officers charged in the case, pleaded guilty to one count each of conspiracy to commit bribery and bribery of a public official. He faces up to 20 years in prison if sentenced to the maximum amount for both charges.\nProsecutors say he and Francis moved ships like chess pieces, diverting them to Pacific ports with lax oversight where GDMA submitted fake tariffs and other fees.\nIn 2010, Misiewicz caught the world's attention when he made an emotional return as a U.S. Naval commander to his native Cambodia, where he had been rescued as a child from the violence of the Khmer Rouge and adopted by an American woman. His homecoming was widely covered by international media.","url":"https://www.dailymail.co.uk/wires/ap/article-3423501/Navy-officer-sentenced-40-years-bribery-case.html"}
