{"authors":["Associated Press"],"date_download":"2018-10-22 20:22:36","date_modify":"2018-10-22 20:22:36","date_publish":"2016-01-29 01:15:25","description":"SAN DIEGO (AP) — A Navy commander accused of diverting ships to Asian ports for a Malaysian contractor offering prostitution services and other gifts pleaded...","filename":"data/vaneerConsumption/Navycommanderpleadsguiltyinmassivebriberycase.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-3421624_Navy-commander-plead-guilty-massive-bribery-case_1540239756.html","title":"Navy commander pleads guilty in massive bribery case","title_page":"Navy commander pleads guilty in massive bribery case | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Navy commander pleads guilty in massive bribery case\nSAN DIEGO (AP) — A Navy commander accused of diverting ships to Asian ports for a Malaysian contractor offering prostitution services and other gifts pleaded guilty to bribery charges Thursday, marking the eighth conviction in the massive scandal.\nMichael Misiewicz is one of the highest ranking Naval officers charged in the case, which is centered on businessman Leonard Francis, nicknamed \"Fat Leonard\" because of his wide girth. Misiewicz pleaded guilty to one count each of conspiracy to commit bribery and bribery of a public official at a hearing in federal court in San Diego.\nHe faces up to 20 years in prison if sentenced to the maximum amount for both charges.\nHis defense lawyers said in a statement that Misiewicz regrets his actions from 2011 to 2012. They went on to say that they plan to show at his sentencing hearing this was an \"extreme departure from his otherwise distinguished and honorable 30 plus year career.\"\nOnly one defendant of the nine named in the case is still fighting the charges. Prosecutors say the investigation is ongoing and there could be more arrests.\nFrancis has admitted to providing an exhaustive list of gifts in exchange for classified information that helped his Singapore-based company, Glenn Defense Marine Asia Ltd., or GDMA, overbill the Navy by at least $20 million. He is awaiting sentencing.\nMisiewicz accepted theater tickets, prostitution services and other items, according to the criminal complaint. He provided ship routes to Francis and then they moved ships like chess pieces, diverting them to Pacific ports with lax oversight where GDMA submitted fake tariffs and other fees, prosecutors said.\nIn 2010, Misiewicz caught the world's attention when he made an emotional return as a U.S. Naval commander to his native Cambodia, where he had been rescued as a child from the violence of the Khmer Rouge and adopted by an American woman. His homecoming was widely covered by international media.\nA sentencing hearing was set for April 29.","url":"https://www.dailymail.co.uk/wires/ap/article-3421624/Navy-commander-plead-guilty-massive-bribery-case.html"}
