{"authors":["Ollie Gillman For Dailymail.Com"],"date_download":"2018-10-23 00:25:41","date_modify":"2018-10-23 00:25:41","date_publish":"2016-01-28 14:25:09","description":"Vice Admiral Ted Branch had his access to classified information revoked in November 2013 after he was linked to a corruption scandal involving a Singapore-based Navy supplier.","filename":"data/vaneerConsumption/NavyintelligencechiefTedBranchbarredfromseeingmilitarysecretssince2013.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AB012D00000578-0-image-a-32_1453991620907.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420979_Admiral-charge-Navy-intelligence-barred-seeing-military-secrets-2013-amid-20million-corruption-scandal_1540254341.html","title":"Navy intelligence chief Ted Branch barred from seeing military secrets since 2013","title_page":"Navy intelligence chief Ted Branch barred from seeing military secrets since 2013 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Vice Admiral Ted Branch had his access to classified information revoked in November 2013 after he was linked to a corruption scandal\nThe admiral in charge of the Navy's intelligence operations has been barred from seeing military secrets for more than two years.\nVice Admiral Ted Branch had his access to classified information revoked in November 2013 after he was linked to a $20million corruption scandal.\nBranch is yet to be charged, but he has not been cleared either - leaving the Navy in the bizarre predicament of having an intelligence chief who is unable to read top secret documents.\nRear Admiral Bruce Loveless, one of Branch's deputies, has also had his access to classified information suspended.\nAccording to the Washington Post, senior Navy officers have to check rooms are clear of any sensitive documents or files before Branch walks in.\nHe is also reportedly unable to be briefed on secret missions and some national security issues.\nA senior official told the Post that the Navy was 'frozen' until Branch is either charged or cleared.\n'We have no actionable information on Admiral Branch, good, bad or otherwise. All we know is that he's wrapped up in this somehow,' the source said.\n'Is it optimum? No, it's not optimum. But it's where we are,' they added.\nBranch is a three-star admiral, director of naval intelligence and is also the Navy's chief information officer.\nHe was originally a fighter pilot, serving over Grenada, Lebanon, the Balkans and Iraq, before climbing the military ladder.\nRear Admiral Bruce Loveless (left), one of Branch's (right) deputies, has also had his access to classified information suspended\nLeonard Glenn Francis, head of Navy supplier Glenn Defense Marine Asia, pleaded guilty to bribing senior Navy officers with prostitutes, grand dinners, luxury hotel stays and cash\nIn 2013, he was linked to a $20million fraud scandal which saw the head of a Singapore-based Navy supplier arrested on bribery charges.\nThe Naval Criminal Investigative Service and the Justice Department had been investigating Glenn Defense Marine Asia (GDMA), which restocked U.S. ships in Asia.\nLeonard Glenn Francis, chief executive of GDMA, was charged with bribing senior Navy officers with prostitutes, grand dinners, luxury hotel stays and cash.\nHe pleaded guilty to the scam, which is said to have seen military officials accept the bribes in turn for directing U.S. ships to Francis' ports so the Navy could be overcharged for supplies to the tune of $20million.\nNumerous Navy officials have been arrested and Francis could face 20 years in prison.\nNeither Branch or Loveless have been arrested or charged and the Navy has not released any information on how they are linked to the case.\nA source close to the probe told the Post that Branch and Francis met 16 years ago and remained in touch with each other afterwards.\nBoth Branch and Loveless declined to comment.\nNavy spokeswoman Rear Admiral Dawn Cutler said Branch and Loveless' suspension 'has not impacted the Navy's ability to manage operations', and that their deputies cover any work that requires access to classified information.","url":"https://www.dailymail.co.uk/news/article-3420979/Admiral-charge-Navy-intelligence-barred-seeing-military-secrets-2013-amid-20million-corruption-scandal.html"}
