{"authors":["John Hayward"],"date_download":"2018-10-30 20:49:33","date_modify":"2018-10-30 20:49:33","date_publish":"2016-08-25 20:03:55","description":"Iranians have performed dangerous \"high-speed intercepts\" of U.S. ships twice this week, forcing a U.S. Navy ship to fire 3 warning shots.","filename":"data/vaneerConsumption/NavyFiresWarningShotsasIranPerformsHighSpeedIntercepts.json","image_url":"https://media.breitbart.com/media/2016/08/USS-Squall-twitter.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_08_25__1540932573.html","title":"Navy Fires Warning Shots as Iran Performs 'High-Speed Intercepts'","title_page":"Navy Fires Warning Shots as Iran Performs 'High-Speed Intercepts'","title_rss":"NULL","source_domain":"breitbart.com","text":"The Iranians have performed dangerous “high-speed intercepts” of American ships twice this week. In the second encounter, occurring in the Persian Gulf on Wednesday, a U.S. Navy ship was forced to fire three warning shots at the Iranian aggressors.\nThe first incident occurred Tuesday near the Strait of Hormuz, where U.S. officials told Reuters four of Iran’s Islamic Revolutionary Guard Corps vessels “harassed” the USS Nitze, an Arleigh Burke-class guided-missile destroyer.\nThe Iranians performed a “high-speed intercept” and ignored 12 attempts at communication by the Nitze, followed by ten flares fired in their direction. Two of the Iranian crafts closed to within 300 yards of the American destroyer.\nStars and Stripes relates a statement from the U.S. Navy that the Nitze “changed course away from the Iranian vessels, despite being near offshore oil rigs, to de-escalate the situation and avoid collision.”\nNavy spokesman Cmdr. Bill Urban called Iran’s conduct “unsafe and unprofessional,” and warned such behavior could “lead to escalation and miscalculation.”\nThe situation did indeed escalate on Wednesday in the northern end of the Persian Gulf, where CNN reports two U.S. patrol craft and a Kuwaiti Navy ship were subjected to harassment by an Iranian boat.\nCNN reported:\nAt one point, the Iranian boat came within 200 yards of one of the US Navy boats. When it failed to leave the area after the Navy had fired flares and had a radio conversation with the Iranian crew, the US officials said, the USS Squall fired three warning shots. Following standard maritime procedures, the Navy fired the three shots into the water to ensure the Iranians understood they needed to leave the immediate area.\nThe USS Squall is a Cyclone-class coastal patrol boat, armed with 25mm and .50 caliber machine guns, grenade launchers, and Stinger missiles. Presumably, the warning shots were fired with one of the machine guns.\n“If any foreign vessel enters our waters, we will give them a warning, and if it is an act of aggression, we will confront them,” Iran’s defense minister, Gen. Hossein Dehghan, defiantly declared on Thursday. Stars and Stripes notes that international maritime law guarantees the right of passage through the waters in question.\nVideo has been posted of the Nitze incident, in which the aggressive Iranian craft are identified as WPBs (coastal patrol boats) with “weapons uncovered”:","url":"https://www.breitbart.com/national-security/2016/08/25/u-s-navy-fires-warning-shots-as-iran-performs-high-speed-intercepts/"}
