{"authors":[],"date_download":"2018-10-30 18:22:58","date_modify":"2018-10-30 18:22:58","date_publish":"2018-10-30 17:02:28","description":"Brandon Javier Acuna, 21, is charged with first-degree murder in the death Curtis Fitzherbert Adams, also 21.","filename":"data/vaneerConsumption/Navysailorshotkilledbymanhetriedtohelponfreewaypolicesa.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/CmgSharedContent/2018/10/30/Images/police%20lights.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_national_navy-sailor-s_ab1680522d243b1225db8bf6f2dc873d__1540923778.html","title":"Navy sailor shot, killed by man he tried to help on freeway, police sa","title_page":"Navy sailor shot, killed by man he tried to help on freeway, police sa","title_rss":"NULL","source_domain":"ajc.com","text":"An active duty sailor who pulled over on a San Diego freeway to help who he thought was a stranded motorist was shot and killed by the man, police said.\nBrandon Javier Acuna, 21, is charged with first-degree murder in the death of the sailor, identified by The Navy Times as Curtis Fitzherbert Adams. Adams, 21, worked as a steelworker constructionman in the service, the newspaper reported.\nHe was stationed at Naval Amphibious Base Coronado.\nThe San Diego Union-Tribune reported that police officials said Monday they were investigating whether two other people were also involved in Adams’ slaying, as well as another shooting that took place about 10 minutes before Adams was killed. Acuna and the other suspects are believed to have shot at a man who interrupted an attempt to break into his car, investigators said.\nPolice officials told NBC San Diego that Adams and his girlfriend were driving south on Interstate 15 around 2:20 a.m. Saturday when Adams spotted who he thought was a stranded driver standing next to a white car. He pulled over to help.\nAs soon as Adams got out of his car, he was gunned down, NBC San Diego reported. His girlfriend called 911 and he was rushed to UC San Diego Medical Center, where he was pronounced dead.\n>> Read more trending news\nAdams’ girlfriend was able to give officers a description of the shooter and the car he fled in. California Highway Patrol officers spotted the vehicle abandoned along Interstate 5, and San Diego patrol officers found Acuna walking nearby, The Navy Times reported.\nAlong with the murder charge, Acuna is charged with second-degree burglary, the NBC affiliate said. San Diego Sheriff’s Department records show he’s being held without bail at the San Diego Central Jail.\nCourt records show a criminal history dating back to when Acuna turned 18, the news station reported. Last year, he pleaded guilty to methamphetamine possession.\nAcuna was placed on three years’ probation six weeks before the fatal shooting.\nThe Navy Times reported that Adams, a New York native, enlisted in the Navy in March 2016. He reported that September to the Amphibious Construction Battalion 1 in San Diego.\nHis cousin, Desmond Abrams Jr., described his cousin for the Union-Tribune as a childhood mischievous prankster who grew into a man with a love of music, cars and clothes. Adams, nicknamed Slim Wavy, always had a hairbrush in his hand.\nFellow Naval steelworker Jasmine Lam commented on that quirk on Facebook.\n“You were never not brushing your hair, lol,” Lam wrote. “RIP Slim Wavy.”\nAbrams said throughout his cousin’s life, Adams always did what he could to help others.\n“He always wanted to do great things,” Abrams told the newspaper. “He always wanted to help people.”\nAbrams said Adams told him he joined the Navy to be a role model to others in the Brooklyn community where he grew up. Adams was a first generation American, the son of parents who immigrated from the West Indies.\nAbrams said his cousin was proud of his roots, but also proud to be an American and to serve his country.\n“He was very excited about deploying and doing his job with the Navy,” Abrams said. “He loved the uniform. He was really proud of being a sailor.”","url":"https://www.ajc.com/news/national/navy-sailor-shot-killed-man-tried-help-freeway-police-say/3QHyEIB67gGwsJkRy9mRjN/"}
