{"authors":["John Hayward"],"date_download":"2018-10-30 19:56:40","date_modify":"2018-10-30 19:56:40","date_publish":"2016-03-29 02:32:53","description":"51-year-old Charles R. Ingram III, a veteran of the U.S. Navy, doused himself with gasoline and set himself ablaze outside a VA clinic.","filename":"data/vaneerConsumption/NavyVeteranBurnsHimselfAliveOutsideVAClinic.json","image_url":"https://media.breitbart.com/media/2016/03/department-of-veterans-affairs-logo-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_03_28__1540929400.html","title":"Navy Veteran Burns Himself Alive Outside VA Clinic","title_page":"Navy Veteran Burns Himself Alive Outside VA Clinic","title_rss":"NULL","source_domain":"breitbart.com","text":"51-year-old Charles R. Ingram III, a seven-year veteran of the U.S. Navy, doused himself with gasoline and set himself ablaze outside a VA clinic on Saturday, March 19, for reasons as yet unclear.\nAlthough he was swiftly airlifted to Temple Burn Center in Philadelphia for treatment, he died of his injuries that night. The Press of Atlantic City reports that, according to Police Chief Paul Newman, Ingram did not leave a note explaining his actions.\nHowever, Atlantic County Veterans Affairs Director Bob Frolow said the location of the suicide sent a message that should not be ignored: “At the very least, his actions were an expression of need… It’s a shame and sign of desperation and need. This might open a window on that need.”\nFrolow pointed out that the clinic was closed at the time of Ingram’s Saturday suicide, as it only offers daytime hours Monday through Friday. He described this as a “hardship for many who cannot get there during work hours.”\n“More than ever, we are determined – no, emboldened – to carry on our quest to provide every veteran with the health care they need, when they need it and where they need it,” said veterans’ advocate Marco Polo Smigliani, of Ingram’s home Egg Harbor Township. “Hearts are deeply saddened today, and our mission continues so that one among us will not have died in vain.”\nThe Daily Beast reports Ingram walked some nine miles from his home in Egg Harbor to the clinic, passing an American Legion park and a memorial dedicated to military veterans along the way. After he set himself on fire, he was spotted by a passing motorist who called 911, and he was attended by another bystander who tried to extinguish the flames with blankets. Ingram was nevertheless so badly burned that a fire chief said it was “a little unbelievable” that he survived as long as he did.\n“’Rich,’ as he was known to family and friends, served in the Navy from 1985 to 1992, attaining the rank of chief petty officer. He left behind a wife, Billie, and two children, ages 3 and 5. The day before he killed himself, a local newspaper photographed the kids playing with other locals at nearby John F. Kennedy Park. Two days prior was his wife’s birthday; his daughter’s fourth birthday was two weeks away,” writes the Daily Beast.","url":"https://www.breitbart.com/national-security/2016/03/28/navy-veteran-burns-himself-alive-outside-va-clinic/"}
