{"authors":["Breitbart News"],"date_download":"2018-10-30 21:17:31","date_modify":"2018-10-30 21:17:31","date_publish":"2015-11-08 20:03:41","description":"NBC has released early figures for the ratings on Donald Trump's Saturday Night Live hosting gig, and they're yuuuge.","filename":"data/vaneerConsumption/NBCDonaldTrumpBumpsSNLRatingstoHighestinThreeYears.json","image_url":"https://media.breitbart.com/media/2015/11/CTTl8w2UkAAqdf9.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_11_08__1540934251.html","title":"NBC: Donald Trump Bumps SNL Ratings to Highest in Three Years","title_page":"NBC: Donald Trump Bumps SNL Ratings to Highest in Three Years | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"NBC has released early figures for the ratings on Donald Trump’s Saturday Night Live hosting gig, and they’re yuuuge.\nThe Associated Press downplays the Trump bump while admitting he brought NBC’s numbers to a three-year high:\nVery good, but not spectacular. Preliminary Nielsen ratings measuring households in 56 U.S. markets gave Saturday’s “SNL” its highest rating only since January 2012. Basketball great Charles Barkley was host that night. Full results, including viewership figures, will be released Thursday, NBC said.\nEntertainment Weekly compares those ratings to Hillary Clinton’s appearance in October:\nAccording to NBC, SNL had a whopping 6.6 household rating on Saturday night, easily beating the season’s previous high: the 41st season premiere last month, hosted by Miley Cyrus and with a guest appearance by none other than … Hillary Clinton. In fact, Trump’s overnight rating was 47 percent higher than the Miley/Hillary episode. … The actual number of SNL viewers will be available later in the week. But for point of comparison, the season premiere delivered 6.3 million viewers, so Trump’s episode could be close to 10 million.\nRead the rest of that story here.","url":"https://www.breitbart.com/entertainment/2015/11/08/nbc-donald-trump-bumps-snl-ratings-to-highest-in-three-years/"}
