{"authors":["John Nolte"],"date_download":"2018-10-30 20:04:05","date_modify":"2018-10-30 20:04:05","date_publish":"2015-02-07 21:06:25","description":"According to Maureen Dowd in the New York Times, NBC News executives knew Brian Williams had a problem with the truth but the infrastructure wasn't in place to do anything about it. Per Dowd, things were so bad with Williams that his \"flourishes to puff himself up\" became \"a joke in the news division.\" |","filename":"data/vaneerConsumption/NBCNewsKnewBrianWilliamswasPathological.json","image_url":"https://media.breitbart.com/media/2015/02/brian-williams-hurrican-katrina.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_02_07__1540929845.html","title":"NBC News Knew Brian Williams was 'Pathological'","title_page":"Dowd: NBC News Knew Brian Williams was 'Pathological'","title_rss":"NULL","source_domain":"breitbart.com","text":"According to Maureen Dowd in the New York Times, NBC News executives knew Brian Williams had a problem with the truth but the infrastructure wasn’t in place to do anything about it. Per Dowd, things were so bad with Williams that his “flourishes to puff himself up” became “a joke in the news division.”\nHIS was a bomb that had been ticking for a while.\nNBC executives were warned a year ago that Brian Williams was constantly inflating his biography. They were flummoxed over why the leading network anchor felt that he needed Hemingwayesque, bullets-whizzing-by flourishes to puff himself up, sometimes to the point where it was a joke in the news division.\nBut the caustic media big shots who once roamed the land were gone, and “there was no one around to pull his chain when he got too over-the-top,” as one NBC News reporter put it.\nIt seemed pathological because Williams already had the premier job, so why engage in résumé inflation? And you don’t get those jobs because of your derring-do.","url":"https://www.breitbart.com/the-media/2015/02/07/maureen-dowd-nbc-news-knew-brian-williams-was-pathological/"}
