{"authors":[],"date_download":"2018-10-30 01:13:49","date_modify":"2018-10-30 01:13:49","date_publish":"2015-02-18 00:00:00","description":null,"filename":"data/vaneerConsumption/NBCsfakenewsisjealousofrealnews.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_02_nbcs_fake_news_is_jealous_of_real_news_1540862029.html","title":"NBC's fake news is jealous of real news","title_page":"NBC's fake news is jealous of real news","title_rss":"NULL","source_domain":"americanthinker.com","text":"But some of the real humor--and irony--was SNL's total unawareness of its liberal normative with its ensuing errors. Sarah Palin was there--and look how prophetic she was, Tina Fey. Sure Fey, in her Palin persona, mouthed \"I can see Russia from my house\" years ago but Palin saw the future of an imperial brutal Russia and a death panel government health system that liberals, including SNL staff, can't admit to this day.\nSo there we were, watching Saturday Night Live's 40th (really 39 1/2) anniversary Valentine to itself, enjoying it for the most part in spite of its usual slant and some weak bits, noticing how well some of the regulars aged--or hadn't (Chevy Chase, Dan Aykroyd--what happened?) and missing some of my favorite skits (parodying those die hard Stark Trek fans who couldn't admit the series was over.) And where was Weekend Update anchor Dennis Miller, now a conservative talk show host? Oh.\nBut the breathtaking irony award for total lack of awareness and revealing its political blindness occurred during a Weekend Update segment with the aforementioned Fey and her colleagues Amy Poehler plus the original female anchor, Jane Curtin. The unblissfully smug Curtin announced \"I used to be the only pretty blonde woman reading the fake news. Now there's a whole network for that\" as the Fox News logo popped up in the background. (around 1 minute, 18 seconds into the video).\nAlas, Amy Poehler didn't immediately segue into her sharp \"Really? Really?\" character.\nSNL appears on NBC where it is a reliable money maker for the network; a few days earlier NBC's prime anchor/editor uhm, newsreader had been suspended/fired after revelations that his reports that he covered the signing of the Declaration of Independence, the fall of the Berlin Wall and had looked death in the face when his helicopter \"bird\" had received fire were well...fake. And the network apparently had been aware of his fake news for quite some time. The NBC peacock would have been more appropriate.\nBut apparently Jane is still an \"ignorant slut\" as are some of the terrified cast members.\nIt took some brave non cast members, successful in their own right, to make the NBC real news/fake news connect. Two of the most interesting took place in the Red Carpet Special interviews prior to the show. Live, unscripted, unrehearsed and unexpected they provided a good counterpoint to some of the awkward scripted moments.\nJim Carrey asked Matt Lauer, one of NBC's infotainment's real news anchors and a Today show host:\n“Where are hiding Brian Williams?” “Oh, look at the time,” Lauer joked as the moment dragged on. “I just want to say something in his defense,” Carrey continued. “If the helicopter in front of me gets hit, I’m taking the story.”\nOoooh! Independence like that could get him fired. Or not hired. Oh.\nVerifying his cred for accuracy and toughness, former Mayor Rudy Giuliani bluntly explained the behind the scene moments of his appearance on the show several weeks after the September 11 attacks.\nRUDY GIULIANI: Well I thought that was one of the most patriotic moments for this show, maybe for America, very unifying. Lorne [Michaels] gave me a great line. As we finished God Bless America, he came up to me and he said “Is it all right if we are funny?” I said “Oh I guess you could try to start now.” And, but it was his - I want to make sure, you know Brian Williams, all this stuff. I want to make sure you understand that was his line. He wrote it. I read it. I was not smart enough to have that line.\nOnly Jerry Seinfeld, whose landmark sitcom about nothing brought glory to NBC, dared to mention Williams right on the show. Bounding to the stage, he opened his funny segment with\n\"Did you know Brian Williams was one of the original SNL players?\"\nThanks Jerry, you always were about something.\nAnd so are those attractive blonde Fox News anchors giving us real news.","url":"https://www.americanthinker.com/blog/2015/02/nbcs_fake_news_is_jealous_of_real_news.html"}
