{"authors":["William Bigelow"],"date_download":"2018-10-30 21:04:06","date_modify":"2018-10-30 21:04:06","date_publish":"2015-08-05 01:33:57","description":"NC County Commission Chairman Walks Out after Muslim Invocation","filename":"data/vaneerConsumption/NCCountyChairmanWalksOutafterMuslimInvocation.json","image_url":"https://media.breitbart.com/media/2015/08/Opening-Prayer-at-County-Commission-Meeting-Channel-9-News.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_08_04__1540933446.html","title":"NC County Chairman Walks Out after Muslim Invocation","title_page":"NC County Chairman Walks Out after Muslim Invocation","title_rss":"NULL","source_domain":"breitbart.com","text":"On Monday night in Lincoln County, North Carolina, Lincoln County Commission Chairman Carrol Mitchem walked out of the commission’s meeting when the invocation started with a Muslim prayer.\nMitchem, a devout Christian, had told WSOC-TV that if a meeting commenced with a Muslim prayer he would leave, and he kept his word Monday night when a leader of an interfaith group did just that. He had said, “I ain’t gonna have no new religion or pray to Allah or nothing like that,” adding that those against Christian prayer could “Wait until we’re done praying.”\nWithin the last week, nearby Rowan County filed an appeal of U.S. District Judge James Beaty’s May ruling that the county’s practice of starting meetings with Christian prayers violated the First Amendment. The judge’s decision was prompted by a lawsuit from the ACLU in 2013. The commission had previously decided to allow all faiths access to the invocation in order to avoid lawsuits.\nIn May, Mitchem told WBTV, “Other religions, or whatever, are in the minority. The U.S. was founded on Christianity. I don’t believe we need to be bowing to the minorities. The U.S. and the Constitution were founded on Christianity. This is what the majority of people believe in, and it’s what I’m standing up for.” Asked about Judge Beaty’s ruling, he replied, “Changing rules on the way the United States was founded, Constitution was founded (I don’t like). I don’t need no Arab or Muslim or whoever telling me what to do or us here in the county what to do about praying. If they don’t like it, stay the hell away.”\nLater in May, Duston Barto, the editor of Muslim American, which is published in Charlotte, fired off a letter to the Lincoln Times News to respond to Mitchem’s comments. In the letter, he wrote, “Telling us to “stay the hell away” because of our chosen religion is a slap to the face … I would prefer, instead, to have a discussion with Mitchem and give him some literature so that he can get to know a bit about the religion that he clearly knows very little about and which is one of the fastest growing religions in the world.”","url":"https://www.breitbart.com/politics/2015/08/04/nc-county-commission-chairman-walks-out-after-muslim-invocation/"}
