{"authors":["Jessica Chia For Dailymail.Com"],"date_download":"2018-10-23 03:57:43","date_modify":"2018-10-23 03:57:43","date_publish":"2017-03-16 14:58:50","description":"A three-year-old was found dead on the front porch of his Morganton, North Carolina, home after a passing driver noticed his body outside in freezing temperatures.","filename":"data/vaneerConsumption/NCtoddlerisfounddeadonthefrontporchofhishouse.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/14/3E54D63F00000578-0-image-a-15_1489676217957.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4320382_Boy-3-dead-porch-house_1540267063.html","title":"NC toddler is found dead on the front porch of his house","title_page":"NC toddler is found dead on the front porch of his house | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A three-year-old was found dead on the front porch of his home after a passing driver noticed his body outside in freezing temperatures.\nA driver called the Burke County Sheriff's Office at 7.45am on Wednesday in Morganton, North Carolina, and deputies found the toddler dead while his mother and her boyfriend were still asleep inside the house.\nInvestigators believe the boy, who celebrated his third birthday on Tuesday, wandered outside in the night while wind chill values fell zero.\nAn autopsy is scheduled for Thursday.\nA three-year-old was found dead on the front porch of his home in Morganton, North Carolina, (above) after a passing driver noticed his body outside in freezing temperatures\nThe sheriff's office received a call on Wednesday morning from a driver who reported seeing a child laying on the front porch of a home on the 1200 block of Hopewell Road.\nDeputies arrived just minutes later to find the boy dead while the mother and her boyfriend were still fast asleep inside.\nInvestigators said the inside door of the house was open, WSOCTV reported. It remains unclear whether the storm door closed after he was outside.\nTemperatures were in the mid-20s early Wednesday, with a strong wind.\nAn autopsy is scheduled on Thursday, and Sheriff Steve Whisenant told WBTV: '[We're] trying to determine how the child got outside, how long the child had been outside, and what the actual cause of death is.'\nAn investigation is ongoing and deputies spent hours at the house collecting evidence and interviewing both the mother and her boyfriend, along with family members and neighbors.\nAn investigation is ongoing and deputies spent hours at the house collecting evidence and interviewing both the mother and her boyfriend, who were asleep inside the house\nPat Williams, who lives in the neighborhood, said his mother moved in earlier this month.\nAnother neighbor David Barrier was overwhelmed with emotion, calling the toddler's death a 'tragedy' while offering prayers for the family.\nThe boy's name has not been released. No charges have been filed in connection to his death.","url":"https://www.dailymail.co.uk/news/article-4320382/Boy-3-dead-porch-house.html"}
