{"authors":[],"date_download":"2018-10-30 20:21:51","date_modify":"2018-10-30 20:21:51","date_publish":"2015-12-11 13:56:14","description":"The weekend will be unseasonably warm, and while Saturday will be partly sunny, clouds will build on Sunday and there’s a slight chance of rain Sunday night.","filename":"data/vaneerConsumption/NearrecordhighslotsofroadworkinAtlantasweekendforecast.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/12/11/Images/photos.medleyphoto.8482185.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_near-record-high_3c3824c0ed8705c7d2e42806dc5408a0__1540930911.html","title":"Near-record highs, lots of roadwork in Atlanta’s weekend forecast","title_page":"Near-record highs, lots of roadwork in Atlanta’s weekend forecast","title_rss":"NULL","source_domain":"ajc.com","text":"The weekend will be unseasonably warm, and while Saturday will be partly sunny, clouds will build on Sunday and there’s a slight chance of rain Sunday night.\nMotorists can expect to find lanes closed for construction on several stretches of metro Atlanta interstates as road crews take advantage of the dry and warm weather.\nHere are the areas to avoid if you don’t want to be stuck in traffic this weekend:\nRoad work to impact Interstates 20, 75, 85, 285 and 575\nThe Express Lanes project will shut down one southbound lane of I-75 between South Marietta Parkway and Delk Road and one southbound lane of I-575 from Ga. 92 to Bells Ferry Road and from Chastain Road to Barrett Parkway, beginning at 9 p.m. Friday and continuing through 5 a.m. Saturday.\nAuthorities will be slowing — but not completely stopping – I-75 traffic in both directions between Windy Hill Road and South Marietta Parkway for utility work from 6:30 to 9:30 a.m. on Sunday.\nSign structure work will shut down one southbound lane of I-75 between I-575 and North Marietta Parkway from 9 p.m. Friday through 5 a.m. Monday.\nWork on the South Metro Express Lanes project will close two southbound lanes of I-75 between Ga. 138 and Ga. 155 from 7 p.m. Friday through 5 a.m. Saturday.\nTwo southbound lanes of I-85 will be closed nightly between Cleveland Avenue and Ga. 74.\nOne lane of I-285 in each direction will be closed all weekend between Moreland Avenue and Jonesboro Road.\nAlso on I-285, two eastbound lanes between I-20 and Donald Lee Hollowell Parkway will be closed from 9 a.m. Saturday until 5 a.m. Monday.\nEast of Atlanta, one eastbound lane of I-20 will be closed all weekend between Almon Road and U.S. 278.\nOne lane of Ga. 400 will be closed in each direction between Lenox and Holcomb Bridge roads throughout the weekend for lane striping.\n» For updated traffic information, listen to News 95.5 and AM 750 WSB and follow @ajcwsbtraffic on Twitter.\nNear-record highs likely this weekend\nChannel 2 meteorologist Karen Minton is forecasting near-record highs this weekend, and while Saturday should be dry, there’s a 20 percent chance of rain late in the day on Sunday.\nMinton is forecasting highs of 74 Saturday and 72 Sunday, with morning lows each day in the mid-50s.\nAtlanta’s record high Saturday is 77, set in 1971, while Sunday’s record high is 73, set in 1991.\nThe rain moving in on Sunday should continue into the beginning of the work week, with up to an inch of rainfall possible.\nThere’s also a chance of isolated thunderstorms Sunday night into Monday, when Minton is forecasting an 80 percent chance of rain.\n» Check the full forecast and track changes\nHigh school football championships top weekend events\nGeorgia’s high school football titles will be decided Friday and Saturday at the Georgia Dome, with three games on Friday, beginning at 1 p.m., and four games on Saturday, beginning at 10 a.m.\nNext door to the dome, the Hawks play the Spurs Saturday night at Philips Arena.\n» Full list of weekend events","url":"https://www.ajc.com/news/local/near-record-highs-lots-roadwork-atlanta-weekend-forecast/q0F8lIbMzanTsLDRHvzzZJ/"}
