{"authors":["John Binder"],"date_download":"2018-10-30 18:11:48","date_modify":"2018-10-30 18:11:48","date_publish":"2018-08-16 00:16:31","description":"Nearly 250 counties across the United States have more registered voters on the voting rolls than the number of eligible, citizen voters.","filename":"data/vaneerConsumption/Nearly250CountiesHaveMoreRegisteredVotersThanEligibleVoters.json","image_url":"https://media.breitbart.com/media/2018/08/Ohio-Voters-Brendan-SmialowskiAFPGetty-Images.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/midterm-election_2018_08_15__1540923108.html","title":"Nearly 250 Counties Have More Registered Voters Than Eligible Voters","title_page":"Eric Eggers: Nearly 250 Counties Have More Registered Voters Than Eligible Voters","title_rss":"NULL","source_domain":"breitbart.com","text":"Nearly 250 counties across the United States have more registered voters on the voting rolls than the number of eligible, citizen voters, Government Accountability Insititute (GAI) research director Eric Eggers reveals in his new book.\nEggers told Breitbart News Editor-in-Chief Alex Marlow on SiriusXM Patriot’s Breitbart News Daily, as his new book, Fraud: How the Left Plans to Steal the Next Election, details, that voter fraud in the U.S. is a real issue that has yet to be dealt with.\n“You have 248 counties in this country that have more registered voters than you have citizens of legal voting age … nearly three million people are registered to vote in more than one state,” Egger said. “Even Barack Obama’s … administration said that yeah, maybe 16 million election registrations are completely inaccurate. And in some states, this is as many as one-in-seven [registrations].”\nEggers said Democrats and left-wing organizations funded by globalist billionaire George Soros fight “at every turn to keep any effort to increase [voter] security,” which he said, “includes leveling the charges of racism anytime a state wants to do anything” about combatting voter fraud.\nListen to Eric Egger’s full interview here:\nIn exclusive Breitbart News interviews, Eggers said the “Democratic Party political machine is built in part on the reliance of illegal votes cast by demographics that vote reliably for Democrats.”\nA report chronicled by Breitbart News noted how despite claims that voter ID laws are aimed at suppressing voter turnout among black Americans, the latest Senate election in Alabama debunked this talking point.\nIn the Alabama Senate runoff election last year — where Roy Moore and Doug Jones fought to take Attorney General Jeff Sessions’ former seat — black Americans turned out in droves to push Jones over the edge to win the election, even as the state had implemented a new voter ID law.\nEggers has said that there is “no evidence” to support the claim that voter ID laws suppress or decrease voter turnout among black Americans.\nBreitbart readers can grab a copy of Eggers’ new book, Fraud: How the Left Plans to Steal the Next Election, on Amazon.","url":"https://www.breitbart.com/midterm-election/2018/08/15/exclusive-eric-eggers-nearly-250-counties-have-more-registered-voters-than-eligible-voters/"}
