{"authors":["Dana Varinsky"],"date_download":"2018-10-30 22:58:19","date_modify":"2018-10-30 22:58:19","date_publish":"2016-12-09 00:00:00","description":"Rolling back environmental regulations, as Trump has promised to do, won't solve the problems created by the long list of coal companies now in bankruptcy.","filename":"data/vaneerConsumption/NearlyhalfofUScoalisproducedbycompaniesthathavedeclaredbankruptcy.json","image_url":"https://amp.businessinsider.com/images/5849ee4eca7f0c20008b4688-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_us-coal-bankruptcy-trump-2016-12_1540940299.html","title":"Nearly half of US coal is produced by companies that have declared bankruptcy","title_page":"    Nearly half of US coal is produced by companies that have declared bankruptcy - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"A coal miner looks on as Mitt Romney speaks at American Energy Corporation in Beallsville, Ohio in 2012. Getty/Justin Sullivan When Peabody Energy, the biggest coal producer in the US, declared bankruptcy in April, it joined a long list of coal compatriots in the chapter 11 club.\nArch Coal, the country's second biggest producer, filed for bankruptcy in January, and Alpha Natural Resources, the fourth biggest, sought chapter 11 protection in August 2015 (it emerged from bankruptcy in July 2016).\nBut that doesn't mean the companies stopped mining or producing the fuel. In fact, a pproximately 44% of US coal now comes from companies that have declared bankruptcy sometime in the last four years. Those are troubling stats for President-elect Donald Trump, who campaigned on the promise of bringing the country's declining coal industry back to life.\nBy choosing Scott Pruitt, an outspoken opponent of environmental rules and ally of the fossil fuel industry, to head the EPA, Donald Trump seems to be sending a message that, as promised, his administration will attempt to roll back air quality regulations and open more federal land to coal mining.\nBut those efforts won't counteract the market trend enough to restore coal to its former prominence. Energy industry executives have suggested they aren't likely to return to coal no matter what Trump does, and even Mitch McConnell warned that it's hard to tell whether conservatives' pro-coal efforts will really bring business back, since \"it's a private sector activity.\"\nThroughout his campaign, Trump repeatedly blamed what he called \"Obama's war on coal\" for this stark decline, alleging that government regulation was killing American jobs and making the country less energy independent.\nThe sector is indeed in a downward spiral. Coal production in the beginning of 2016 hit the lowest level it's been since a major strike in 1981, and that the current number of coal employees (approximately 66,000 in 2015) is the lowest on record since the US Energy Information Administration began collecting data in 1978.\nBut while air quality rules and renewable energy subsidies have created incentives to move away from coal, the irony is that the real opponent in the \"war\" is the free market.\nBrookings Institution Several factors, all of which are mostly out of lawmakers' control, have had major impacts on the coal business over the last decade. First, thanks to hydraulic fracturing (fracking) technology, natural gas has become a more desirable fuel because it burns cleaner and is cheaper than coal. In 2000, half of the US' electricity came from coal-powered plants and about 15% came from natural gas, according to a Brookings Institution analysis; today coal and gas each make up about a third of the country's electricity generation.\nAdditionally, prices of renewables have fallen dramatically — the cost of building a solar photovoltaic plant has fallen by about 80 percent since 2009, making it more financially feasible for states to invest in solar and wind power. Third, as buildings and other facilities have become more energy-efficient and begun gathering power from rooftop solar panels, electricity sales in the US have started to flatten. Plus, a slowing of the Chinese economy has caused exports to go down, and automation has replaced jobs in mines and coal production facilities.\nIn addition to sending former miners into unemployment and financial hardship, the recent slew of bankruptcies poses two other serious problems. Coal companies are legally bound to pay for cleanup around mine sites. Most are required to get a bond to insure that reclamation happens even if they go under. But a loophole allows the biggest corporations to self-bond, meaning that they guarantee their own future cleanup funds. With three of the four biggest producers in or just out of bankruptcy, that opens the possibility that they won't pay to reclaim the land, leaving polluted water and illness-causing dust behind.\nCompanies in bankruptcy also often suggest that they can't afford to keep doling out pension funds, and attempt to drop the retiree benefits they committed to pay. According to NPR, this could be the case for 16,000 retired miners in seven states by the end of 2016. Senate Democrats have been working to pass a proposal for the government to cover these benefits, called the Miners Protection Act, but it has faced opposition from Mitch McConnell and other Republicans.\nEven if the plan were to go through, however, it would use funds set aside for the reclamation of abandoned mines (those left behind without proper cleanup, a situation that now seems somewhat likely) and transfer the money to pay for canceled pensions.\nIt's a complicated problem that simply rolling back regulations will not fix.","url":"https://www.businessinsider.com/us-coal-bankruptcy-trump-2016-12"}
