{"authors":["Compiled Democrat-Gazette Staff Wire Reports"],"date_download":"2018-10-30 22:07:24","date_modify":"2018-10-30 22:07:24","date_publish":"2017-01-07 00:00:00","description":"Facing calls to strike back at Russia for what U.S. intelligence agencies have termed Moscow's interference with the 2016 presidential election campaign, Donald Trump instead suggested warmer relations between the two countries.","filename":"data/vaneerConsumption/NeedtodrawRussiacloserTrumptweets.json","image_url":"https://media.arkansasonline.com/img/photos/2017/01/07/resized_250499-trump_transition_11_71-22397_t600.JPG?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2017_jan_08__1540937244.html","title":"Need to draw Russia closer, Trump tweets","title_page":"Need to draw Russia closer, Trump tweets","title_rss":"NULL","source_domain":"arkansasonline.com","text":"WASHINGTON -- Facing calls to strike back at Russia for what U.S. intelligence agencies have termed Moscow's interference with the 2016 presidential election campaign, Donald Trump instead suggested warmer relations between the two countries.\nThe president-elect took to Twitter on Saturday to discuss the potential U.S.-Russia relationship under his administration, a day after U.S. spy chiefs briefed him on the Russian measures they said were directed by President Vladimir Putin.\n\"Having a good relationship with Russia is a good thing, not a bad thing,\" Trump said in three tweets. \"Only 'stupid' people, or fools, would think it is bad! We have enough problems around the world without yet another one.\"\n\"When I am President, Russia will respect us far more than they do now,\" Trump assured his 19 million Twitter followers.\n[TRUMP: Timeline of president-elect’s career + list of appointments so far]\nOn Friday, top U.S. intelligence officials met with the president-elect at Trump Tower in New York to present evidence that Putin personally ordered cyber and disinformation attacks on the U.S. campaign.\nPutin developed \"a clear preference\" for Trump to win, the agencies said in a declassified summary of their findings. The agencies said they \"assess Putin and the Russian government aspired to help President-elect Trump's election chances when possible by discrediting Secretary Clinton and publicly contrasting her unfavorably to him,\" according to the report, which was referring to Democrat Hillary Clinton.\n\"All three agencies agree with this judgment. CIA and FBI have high confidence in this judgment; NSA has moderate confidence,\" the report said. \"Moscow will apply lessons learned from its Putin-ordered campaign aimed at the U.S. presidential election to future influence efforts worldwide, including against U.S. allies and their election processes.\"\nRequests for comment Friday to the Russian Embassy in Washington were not returned. But posts from the Twitter account of the Russian Embassy in the United Kingdom on Saturday dismissed the report, calling it \"a pathetic attempt at tainting Americans' vote by innuendo couched in Intel new-speak.\"\nThe report was released shortly after intelligence chiefs briefed Trump on their findings that Russia was responsible for the hacking of Democratic Party computers and the leaking of emails damaging to Clinton. Russia has denied the accusations repeatedly.\nTrump said Saturday that negligence by the Democratic National Committee had allowed the hacking to go ahead.\n\"Only reason the hacking of the poorly defended DNC is discussed is that the loss by the Dems was so big that they are totally embarrassed!\" Trump tweeted. By contrast, \"the Republican National Committee had strong defense!\" he said -- although the intelligence report said Russia had targeted both major parties.\nIn a statement after Friday's meeting, the president-elect didn't explicitly endorse the intelligence officials' conclusions, but said he has \"tremendous respect for the work and service done by the men and women of this community to our great nation.\"\n\"While Russia, China, other countries, outside groups and people are consistently trying to break through the cyber infrastructure of our governmental institutions, businesses and organizations including the Democrat National Committee, there was absolutely no effect on the outcome of the election including the fact that there was no tampering whatsoever with voting machines,\" Trump said in the statement.\nThe intelligence agencies agreed that there was no evidence of ballots being hacked but said in the report that \"we did not make an assessment of the impact that Russian activities had on the outcome of the 2016 election.\"\nTrump said Friday that he will appoint a team to develop a plan \"to aggressively combat and stop cyberattacks\" within 90 days of taking office.\nIn a related move, the Department of Homeland Security on Friday designated elections systems as \"critical infrastructure,\" which will allow the federal government to provide cybersecurity resources to state and local jurisdictions.\nThe determination came after months of review and despite opposition from many states worried that the designation would lead to increased federal regulation or oversight on the many decentralized and locally run voting systems across the country.\n\"Given the vital role elections play in this country, it is clear that certain systems and assets of election infrastructure meet the definition of critical infrastructure, in fact and in law,\" Homeland Security Secretary Jeh Johnson said in a statement Friday. He added: \"Particularly in these times, this designation is simply the right and obvious thing to do.\"\nIn Russia, politicians and commentators took to social media Saturday to ridicule the U.S.' intelligence findings as a potpourri of baseless conjecture.\nIn a message posted on Twitter, Alexey Pushkov, a member of the defense and security committee of the Russian parliament's upper house, ridiculed the U.S. report as akin to CIA assertions that Iraq had weapons of mass destruction.\n\"Mountain gave birth to a mouse: all accusations against Russia are based on 'confidence' and assumptions. US was sure about Hussein possessing WMD in the same way,\" Pushkov tweeted.\nMargarita Simonyan, editor-in-chief of RT, a state-funded television network that broadcasts in English, who is cited repeatedly in the report, posted her own message on Twitter scoffing at the U.S. intelligence community's accusations.\n\"Aaa, the CIA report is out! Laughter of the year! Intro to my show from 6 years ago is the main evidence of Russia's influence at US elections. This is not a joke!\" she wrote.\nEven Russians who have been critical of their government voiced dismay at the U.S. intelligence agencies' account of an elaborate Russian conspiracy.\nAlexey Kovalyov, a Russian journalist who has frequently criticized RT, said he was aghast that the report had given so much attention to the television station.\n\"I do have a beef with RT and their chief,\" Kovalyov wrote in a social media post, \"But they are not your nemesis, America. Please chill.\"\nThe Kremlin, which has denied any role in the hacking of the Democratic National Committee computer system, had no immediate response to the declassified report. Putin instead made a show of business as usual, attending a church service to mark the start of Orthodox Christmas.\nHope and Skepticism\nTrump has expressed admiration for Putin as a strong leader and predicted that the pair can work together on issues such as fighting the Islamic State terrorists. He returned to that theme Saturday: \"Both countries will, perhaps, work together to solve some of the many great and pressing problems and issues of the world!\"\nSteven Pifer, a former U.S. ambassador to Ukraine and deputy assistant secretary of state for Russia and Ukraine, was skeptical.\n\"I also would like to see better U.S.-Russia relations, but that will require some change in Russian (and American) policies,\" Pifer, a senior fellow at the Brookings Institution, said in an email Saturday. Trump \"gives no indication that he wants any changes in Kremlin policy. The concern thus is that he might get to 'good' relations with Russia simply by accepting a lot of egregious Russian actions.\"\nDrawing on multiple intelligence sources, the CIA, the FBI and the National Security Agency said in the report that Russia's operation blended covert activity, including cyberattacks, with public efforts by Russian government agencies, state-funded media outlets and paid social media users known as \"trolls.\"\nTrump \"should make clear that that is absolutely unacceptable and will result in retaliation,\" Pifer said. \"This is not about re-litigating the election -- Mr. Trump won and will be president -- it's about protecting the core of the American democratic system.\"\nThe agencies emphasized that the public version issued Friday, unlike classified versions presented to Trump, President Barack Obama and members of Congress, didn't include all of the sources, methods and supporting evidence used by the U.S. spy agencies.\nTrump also announced Saturday that he wants retired Sen. Dan Coats, who has been critical of Russia, to be national intelligence director, describing the former member of the Senate Intelligence Committee as the right person to lead the new administration's \"ceaseless vigilance against those who seek to do us harm.\"\nCoats, in a statement released by Trump's transition team, said: \"There is no higher priority than keeping America safe, and I will utilize every tool at my disposal to make that happen.\"\nInformation for this article was contributed by Nafeesa Syeed and Nick Wadhams of Bloomberg News; by Jill Colvin, Deb Riechmann, Eileen Sullivan, Julie Pace, Eric Tucker, Chad Day, Tami Abdollah and Jack Gillum of The Associated Press; and by Andrew Higgins, Oleg Matsnev, Neil MacFarquhar and Nicholas Fandos of The New York Times.\nA Section on 01/08/2017","url":"https://www.arkansasonline.com/news/2017/jan/08/need-to-draw-russia-closer-trump-tweets/"}
