{"authors":["Associated Press"],"date_download":"2018-10-23 05:38:34","date_modify":"2018-10-23 05:38:34","date_publish":"2017-03-10 15:24:18","description":"MOSCOW (AP) - Just days before the 100th anniversary of Yevgeni Khaldei's birth, the daughter of the photographer who took the iconic World War II image of...","filename":"data/vaneerConsumption/NegativesoffamedSovietphotographerfinallyrecovered.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/15/wire-196687-1489159461-976_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4301672_Negatives-famed-Soviet-photographer-finally-recovered_1540273114.html","title":"Negatives of famed Soviet photographer finally recovered","title_page":"Negatives of famed Soviet photographer finally recovered | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"MOSCOW (AP) - Just days before the 100th anniversary of Yevgeni Khaldei's birth, the daughter of the photographer who took the iconic World War II image of Red Army soldiers atop the Reichstag has regained possession of his negatives after a 15-year court battle.\nAnna Khaldei is now preparing to bring the negatives back to Moscow and to open an exhibition next month that includes previously unseen shots by the renowned photographer.\nYevgeny Khaldei's long career included commissioned portraits of Soviet leaders including Josef Stalin and Mikhail Gorbachev, but is best known for his dramatic image of soldiers unfurling a large Soviet flag on the roof-edge of the Reichstag after the Red Army took control of the seat of Nazi power on May 2, 1945.\nIn this March 9, 2017 photo, Anna Khaldei, daughter of famed Russian photographer Yevgeni Khaldei, and her legal attorney Daniel Rothstein, hold prints and negatives of photos taken by her father, recovered after a legal battle of more than 15 years, in New York, USA. Renowned photographer Yevgeni Khaldei, is noted for his iconic photo of Red Army soldiers raising the Soviet flag atop the Reichstag in Berlin, Germany, on May 2, 1945, but Anna Khaldei is now hoping to mount a retrospective exhibition of her father's work, recording history through his lens.(AP Photo)\nAlthough the photo became the most potent image of the Red Army's grueling offensive against Nazi Germany, Khaldei's career declined soon after. He was fired from state news agency Tass in 1948 - many believe he was a victim of anti-semitism - and earned a living as a freelancer for many years.\nA few months before his death in 1997, he signed an agreement with a New York-based photojournalist to be his agent. But Anna Khaldie later filed suit, claiming the agent seized more than 3,000 of his negatives, as well as prints. After a series of court rulings, she was able to take possession of the negatives on Wednesday, two days before the centennial of Khaldei's May 10, 1917 birthday.\n\"After 20 years of waiting, I experienced such happiness,\" she said by telephone from New York City.\nShe said the exhibition she is planning, which includes new photographs, aims to show the humane impulse of her father's recording of history through the lens, particularly in his war photography.\n\"For Yevgeny Khaldei, every photo he took was very dear. It's not only the events he photographed but the people who participated in the events,\" she said. \"If it was during a military action he was photographing someone who was running in the attack, and in 10 meters he could be dead. In the negative he was still alive and he was running toward victory.\"\nThe daughter's attorney, Daniel Rothstein, said that Yevgeny Khaldei, like many Soviet-raised people bewildered by free markets, likely misunderstood the agent contract.\n\"Yes, he was vulnerable. He was 80 years old,\" he said. \"It is a typical story of things that got lost or misplaced or improperly treated among the ruins of the Soviet Union.\"\nFILE- In this May 2, 1945 file photo, Soviet soldiers hoist the red flag over the Reichstag after the fall of Berlin, which is one of the iconic images of World War II taken by renowned photographer Yevgeny Khaldei. Just days before the 100th anniversary of Yevgeni Khaldei's birth, the daughter of the photographer who took the iconic WWII image of Red Army soldiers atop the Reichstag, Anna Khaldei has regained possession of his original negatives after a 15-year court battle and is now hoping to mount an exhibition of her father's work, recording history through his lens. (Yevgeny Khaldei/iTAR-TASS file photo via AP)\nFILE This Feb. 1990 file photo shows veteran photographer Yevgeni Khaldei, who famously took the May 2, 1945 photo of Soviet soldiers hoisting the red flag over the Reichstag after the fall of Berlin, which became one of the iconic images of World War II. The daughter of the photographer Yevgeni Khaldei, Anna Khaldei has regained possession of his original negatives after a 15-year court battle and is now hoping to mount an exhibition of her father's work, recording history through his lens.(ITAR-TASS file photo via AP)","url":"https://www.dailymail.co.uk/wires/ap/article-4301672/Negatives-famed-Soviet-photographer-finally-recovered.html"}
