{"authors":[],"date_download":"2018-10-30 21:15:27","date_modify":"2018-10-30 21:15:27","date_publish":"2018-07-19 14:13:00","description":"Do you love to impress friends with random factoids? Are you the queen of useless knowledge? Do you ponder the airspeed velocity of an unladen swallow?","filename":"data/vaneerConsumption/NeighborhoodguidetotrivianightsinAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/19/Videos/4442847.vpx.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/events_nightlife--singles_t_ac3a6450170fd786d32b414daefdc1ad__1540934127.html","title":"Neighborhood guide to trivia nights in Atlanta","title_page":"Neighborhood guide to trivia nights in Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"Do you love to impress friends with random factoids? Are you the queen of useless knowledge? Do you ponder the airspeed velocity of an unladen swallow? Well, you need to get yourself to a trivia night ASAP!\nAtlanta’s watering holes know you have the need to be quizzed while sipping on brew. So, what are your best bets? We gathered some of our favorite neighborhood spots to battle below!\n»RELATED: And the best burger in Atlanta is ...\nDecatur – Twain's Brewpub and Billiards\n211 E Trinity Place, Decatur.\nThe popular brewpub in Decatur is not only serving up some tasty house made brews, but also giving you the chance to serve up some knowledge on your friends. Things get started at 8 p.m. every Monday night. Prizes are house cash and bragging rights. If you want to keep the games going, Twain’s is stacked with other diversions, like pool tables, shuffleboard and darts. Twain’s menu is a cut above the usual bar fare so you may want to camp out all night.\nDiesel Filling Station, 870 N. Highland Ave., Atlanta. 404-815-1820, www.dieselatlanta.com. This bar bills itself as “super nerdy” hosting all things Nerd Trivia from Dirty South Trivia on Tuesdays to Sunday \"Walking Dead\" viewing parties to themed bar crawls and more. It also offers a covered patio for pups to enjoy a rest during the walk through Virginia-Highland. / Photo by Tori Allen PR\nVirginia Highland – Diesel Filling Station\n870 N. Highland Ave., Atlanta.\nNeed a serious challenge? Or need to prove your nerd credentials once and for all? Well, get your \"Firefly\" and Marvel knowledge ready. Diesel does Nerd-Core Trivia on Tuesdays. Think nerdy movies and TV shows mixed with computer questions, comic books and more. It's tough. On Thursdays, it’s time for Dirty South Trivia. Double trivial!\nMidtown – The Highlander\n931 Monroe Dr NE #101, Atlanta.\nWant a little heavy metal with your trivia? On Sundays, The Highlander lets you extend the weekend just a little bit with a night of self-esteem lifting (or crushing) trivia. The best part is this dive bar does not have the typical freezer-to-fryer fare. Check out the house-made favorites, like jerk chili and pasta–rella sticks (mozzarella sticks wrapped in pasta … really). Order a pitcher of whatever sounds good and some tots on the side of anything, and everything will be right.\nIntown - Grindhouse Killer Burgers\n(Piedmont Rd., Decatur and Memorial Dr.)\n1842 Piedmont Ave NE, Atlanta; 433 North McDonough St., Decatur; 701 Memorial Dr SE, Atlanta.\nYou can have fun on Mondays, and you can have it with a burger and a boozy shake at Grindhouse. Dirty South Trivia starts at 8:30 p.m. and if you prefer beer over shakes, there are pitcher specials during trivia. Decatur has an awesome deck. Piedmont & Memorial have great patios.\nRoswell – Lucky’s Burger and Brew 1144 Alpharetta St, Roswell.\nDoes Fido have all the answers? If you’re in Roswell with a trivia itch, grab the pup and head straight to Lucky’s. The dog friendly restaurant hosts Team Trivia 8 p.m. every Wednesday. Settle in with a glass of brew and one of their juicy burgers. You have 16 to choose from, including the Georgia Dawg Pounder with a fried pimento cheese ball and red pepper jelly.\nHere are some more photos from the St. Patrick's Day party at Republic Social House.\nGrant Park – Republic Social House 437-C Memorial Dr SE, Atlanta.\nWhen the weather is gorgeous, grab a seat at the rooftop bar at Republic Social House. Next to Oakland Cemetery in Grant Park, Republic has weekly game nights that bring in a huge crowd of PBR-swilling folks. On Thursdays, get your grown-up knowledge ready for Sex, Drugs and Rock & Roll Trivia. Republic ups its trivia game the first Thursday of every month with themed trivia. It’s usually based on a TV show or movie franchise like The Office, Stars Wars or Seinfeld. You have to sign up in advance for themed trivia so keep your eye on their Facebook page.\n»RELATED: 6 Atlanta food halls that will (or soon will) delight your taste buds\nSandy Springs – Battle & Brew\nGeeks unite at “Atlanta’s first Game Bar!” Every Wednesday in Sandy Springs they’re gathering to outdo one another in Geek Trivia. Topics range from science to \"Star Wars\" and everything in between. And they promise — no sports questions! If you love the vibe here, there are tons of other weekly events for your inner geek. Gamers, no console gaming until trivia’s over, sorry.\n5920 Roswell Rd A120, Sandy Springs.\nSandy Springs – Hudson Grille 6317 Roswell Road, Sandy Springs.\nTeam Trivia starts at 8 p.m. Wednesdays at the Sandy Springs location of this popular sports bar chain. Take your eyes off one of the many flat screens and work that memory bank. Other Hudson Grille locations feature trivia too so check out the one nearest you.\nWestside – Rocky Mountain Pizza Co.\n1005 Hemphill Ave NW, Atlanta.\nTake on the students from Georgia Tech every week at Rocky Mountain Pizza. On Tuesday nights, teams of engineering and physics majors gather in this pizza spot. Trust us, you’ll want to brush up on your science knowledge. Tuesday Trivia is charity night so some of the money you spend on pizza, beer, etc will go to a worthy cause. Come back on Thursdays for more trivia. Fun bit of trivia about this spot: Legend has it that the trivia at Rocky Mountain inspired a famous episode on Adult Swim’s \"Aqua Teen Hunger Force.\"","url":"https://www.ajc.com/events/nightlife--singles/trivia-night/neighborhood-guide-trivia-nights-atlanta/jAPWQxHjeazYX7GjjlSwSI/"}
