{"authors":[],"date_download":"2018-10-30 20:20:00","date_modify":"2018-10-30 20:20:00","date_publish":"2015-09-17 10:12:08","description":"Quick thinking by determined neighbors and years of firefighter training resulted in a dramatic late-night rescue Wednesday of a mother and her four children trapped behind burglar bars at a southwest Atlanta home.","filename":"data/vaneerConsumption/NeighboronAtlantahousefireWecouldhearthemhollering.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/09/17/Images/photos.medleyphoto.8163605.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_neighbor-atlanta_4221a717d641e8d3889fc15e5a13957f__1540930800.html","title":"Neighbor on Atlanta house fire: ‘We could hear them hollering’","title_page":"Neighbor on Atlanta house fire: ‘We could hear them hollering’","title_rss":"NULL","source_domain":"ajc.com","text":"Quick thinking by determined neighbors and years of firefighter training resulted in a dramatic late-night rescue Wednesday of a mother and her four children trapped behind burglar bars at a southwest Atlanta home.\nThe mother and three of her children remained in the burn unit at Grady Memorial Hospital on Thursday evening.\n“I was just hearing little children saying, ‘Help! Help!’” said neighbor Kendarrious Chester, who was outside the home about 10:30 p.m. Wednesday. Chester told Channel 2 Action News he ran for help at his home two doors down.\n“We just ran up the street and as we’re running up the street we could hear them hollering and screaming ‘Help,’ said Syreeta Chester, an aunt who has lived in the neighborhood for 30 years.\nChester’s nephew, brother and friend managed to remove burglar bars from the window to enter the burning, smoke-filled home.\nThey were able to help rescue Tamifonika Jones, 31, and her daughter Makiyah, 9, but three other children - two boys and a girl - remained trapped inside.\n“He [nephew] kicked the door in and he tried to go in, and he came back out and said, ‘Auntie, I can’t go in there because there’s so much smoke’.”\nWhen firefighters from Station No. 2 arrived, the blaze was shooting out of the back of the house. Moments later, flames and black smoke burst out the front.\nCapt. Chip Newell said firefighters faced a “worst-case scenario” of people trapped amid flames, no visibility and toxic smoke.\nThe children appeared to be in the back of the house, but trying to remove thick burglar bars from bedroom windows would waste too much precious time, he said at a news conference Thursday. “Seconds count,” Newell said.\nA three-man hose team entered through the front, blasting water as Newell and two other firefighters followed close behind.\n“They had to go in there and keep the fire off of us,” Newell said. “If you have three kids trapped, you put it all on the line.”\nSgt. Christopher Martin and Sgt. Jesse Yates felt their way down a hallway to a bedroom. Inside Yates, felt an unconscious child on the floor.\nTwo minutes later, according to the rescue log, the second child was found in a hallway and carried out the front door by Newell.\n“They [firefighters] went in and I looked up and they were bringing one of the little girls out, and she was limped over, and I looked up again, and they were bringing the little boy out, and he was limped over,” Syreeta Chester said. “The mom said, ‘Where’s my baby? Where’s my baby’?”\nMoments later, Martin found a third child in the back bedroom, taking him out through the window after firefighters outside broke off the burglar bars.\nThe children’s father, Damien Walker, told Channel 2 Action News he was at work at the time of the fire. He said the children’s mother, Tamifonika Jones is in ICU and two of the the boys, 8-year-old Damien Walker and 7-year-old Antonio Jones, are in critical condition. Damiana Jones, 12, is in stable condition. Makiyah, 9, was not admitted to the hospital.\n“My number one concern is my wife and my kids coming out of there okay. Everything else I can work out later.”\nNewell, the fire captain, said years of training paid off Wednesday night.\n“You don’t see anything – you’re in a strange house and you don’t know where anything is,” Newell said. “I couldn’t feel more proud of these men.”","url":"https://www.ajc.com/news/local/neighbor-atlanta-house-fire-could-hear-them-hollering/zXDoJIvFGXZPdOgrDoegUP/"}
