{"authors":["Katherine Rodriguez"],"date_download":"2018-10-30 22:05:20","date_modify":"2018-10-30 22:05:20","date_publish":"2018-09-01 20:31:45","description":"Fox News host Laura Ingraham said Friday that a new Neil Armstrong biopic is \"trashing patriotism\" because it leaves out the American flag.","filename":"data/vaneerConsumption/NeilArmstrongMovieTrashingPatriotismbyLeavingOutUSFlag.json","image_url":"https://media.breitbart.com/media/2018/09/Ryan-Gosling-First-Man-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2018_09_01__1540937120.html","title":"Neil Armstrong Movie 'Trashing Patriotism' by Leaving Out U.S. Flag","title_page":"Ingraham: Neil Armstrong Movie 'Trashing Patriotism' by Leaving Out U.S. Flag","title_rss":"NULL","source_domain":"breitbart.com","text":"Fox News host Laura Ingraham told her viewers on The Ingraham Angle Friday that the soon-to-be-released Neil Armstrong biopic is “trashing patriotism” because it leaves out the moment when the American flag is placed on the moon.\n“It’s another way of trashing patriotism,” Ingraham said Friday evening. “It’s another way of moving beyond the nationalism, or nationalistic spirit of the moment.”\nFox News contributor Raymond Arroyo echoed Ingraham’s statement, saying the upcoming movie, First Man, plays fast and loose with the facts.\n“My feeling is, you’re doing a biopic, stick to the facts,” Arroyo said. “He planted an American flag. Plant an American flag.”\nIngraham’s comments came after Ryan Gosling, the Canadian actor who plays Armstrong in First Man, said in a recent interview that the American moon landing scene omits the part where Armstrong and Buzz Aldrin stand with the American flag on the moon because the accomplishment “transcends American borders.”\nGosling added that the feat was a “human achievement” and not an American one, acknowledging he had a “cognitive bias” due to his Canadian background.\nMany people on Twitter, including media figures, politicians, and other celebrities, have shared their disgust with the producers’ decision to omit the scene:\nUgh. Hollywood throwing an iconic American achievement under the bus in order to increase the foreign box office. Lost revenue from me.https://t.co/LAB6JQWAtC — John Robb (@johnrobb) August 31, 2018\nThis is total lunacy. And a disservice at a time when our people need reminders of what we can achieve when we work together. The American people paid for that mission,on rockets built by Americans,with American technology & carrying American astronauts. It wasn’t a UN mission. https://t.co/eGwBq7hj8C — Marco Rubio (@marcorubio) August 31, 2018\nBut why not just present the facts as they were? I think Ryan Gosling is a wonderful actor, but omitting the seminal moment in the midst of mankind’s greatest achievement seems a purposeful denigration of the 400,000 Americans who accomplished it. https://t.co/K6SldeBkPA — James Woods (@RealJamesWoods) August 31, 2018\nSome users even began the Twitter hashtag #BoycottFirstMan to encourage Americans to boycott the movie when it is released in theaters.\nFirst Man, which is about the 1969 moon landing, is scheduled to be released in theaters on October 12, 2018.","url":"https://www.breitbart.com/entertainment/2018/09/01/laura-ingraham-neil-armstrong-movie-trashing-patriotism-leaving-american-flag/"}
