{"authors":["Greg Myre"],"date_download":"2018-10-22 21:44:24","date_modify":"2018-10-22 21:44:24","date_publish":"2018-07-17 00:00:00","description":"The late South African leader would have turned 100 on Wednesday. As part of the commemorations, a new book brings together many of the deeply personal letters he wrote during his 27 years in prison.","filename":"data/vaneerConsumption/NelsonMandelasPrisonLettersOneDayIWillBeBackAtHome.json","image_url":"https://media.npr.org/assets/img/2018/07/17/gettyimages-585863220_wide-2c243f15584cefc053404b10bfdbf3e7bc53c246.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/2018_07_17_629742101_nelson-mandelas-prison-letters-one-day-i-will-be-back-at-home_1540244664.html","title":"Nelson Mandela's Prison Letters: 'One Day I Will Be Back At Home'","title_page":"Nelson Mandela's Prison Letters: 'One Day I Will Be Back At Home' : NPR","title_rss":"NULL","source_domain":"npr.org","text":"Nelson Mandela's Prison Letters: 'One Day I Will Be Back At Home'\nEnlarge this image toggle caption Louise Gubb/Corbis via Getty Images Louise Gubb/Corbis via Getty Images\nNelson Mandela, who died in 2013, would have been 100 years old on Wednesday. A new book is out to mark the occasion, The Prison Letters of Nelson Mandela.\nThese deeply personal letters, many to his wife, his children and his closest friends, have never previously been published.\nThey were compiled by Sahm Venter, a senior researcher at the Nelson Mandela Foundation. Born in Johannesburg, Venter worked as a journalist for 20 years, reporting on South Africa and its struggles with apartheid. She and I worked together at The Associated Press in 1990 when Mandela was released from 27 years in prison.\nVenter spoke to NPR recently about the book. These interview highlights have been edited for length and clarity.\nNelson Mandela never liked to talk about personal matters. When you would ask him these kinds of questions, he would always steer the conversation somewhere else. What did you learn about him with these letters?\nThere was so many things that happened in prison that were devastating to him. The separation from his children, the death of his mother, the death of his son. So I don't think he could be guarded.\nWhat did he say after he lost his mother, and then a year later, his eldest son?\nHe wrote to family members thanking them for burying [his mother], for going to the funeral, for attending to all of the things that he should have attended to as the son.\nHis son Tembi got killed in a car accident in July 1969 and he has said that he applied for permission to go to his funeral. Not only was it denied, but [prison authorities] didn't even write back to tell him it was denied.\nPeople who were in prison with him said that he was very quiet. He sat in his cell and he wrapped a blanket extremely tightly around his shoulders, I suppose almost like a missing hug, and just sat there quietly for as long as he could.\nMandela had two daughters with Winnie Mandela and they were just ages 3 and 1 when he went to prison. They weren't even allowed to see him until they were 16, so the only way he could really be a parent was through his letters.\nHe had to try and be a father by remote control and I guess when [the girls] were really small they had little bits read to them. And then when they were older they were allowed to write letters and receive them.\nZindzi, his youngest daughter, visited him from the age of 16. Later on, when they were allowed a contact visit, she couldn't believe how tall he was because all of the time that she was able to visit him, he was sitting down, and she didn't realize how tall he was.\nI'd like you to read one of the letters he wrote to his daughters, from 1969. So they were maybe 10 or 11 years old at the time.\n\"Zindzi says her heart is sore because I'm not at home and wants to know when I will come back. I do not know my darlings when I will return. You will remember that in the letter I wrote in 1966 I told you that the white judge said I should stay in jail for the rest of my life. It may be long before I come back. It may be soon. Nobody knows when it will be. Not even the judge who said I should be kept here but I am certain that one day I will be back at home to live in happiness with you until the end of my days.\"\nSahm, you work at the Mandela Foundation so you have access to his documents. But these very private letters were scattered all over the place. How did you track them down?\nThere's a large number of letters at the National Archives [of South Africa], which received them after the transition from apartheid. They kept boxes and boxes of his entire prison record.\nThere were also letters from what we called the Donald Card collection, named for a policeman who had them.\nIn 1971, these three hardcover notebooks that [Mandela] used to write copies of his letters, suddenly disappeared from Mandela's cell on Robben Island [prison].\nNobody knew where they were until 2004, when this former policeman contacted the Nelson Mandela Foundation and said, \"I have these books.\" He said he was given them for safekeeping by somebody at some stage. But he then donated them back to Nelson Mandela.\nWhat was your most surprising find in these letters?\nThere was a letter in one of the prison boxes. It was a beautiful letter written to his daughter Zindzi, probably for her 18th or 19th birthday, and her birthday is in December. And it was clearly never sent. There was a note from prison officials saying, \"The prisoner does not have permission to send a letter with a Christmas card.\" So they just didn't send it. I contacted Zindzi and told her about it. She had no idea about it. So all these years later she got her letter.\nSeveral years after Mandela got out of prison, he went back to Robben Island where he'd been held for so many years. You went with him. What did he tell you on that visit?\nI was fascinated by the fact that every afternoon at 3:30, they would lock the doors and the prisoners would be in those single cells until about 5:30 the next morning. So I asked him, \"What did he do when he was locked away like this every day.\" And he said, \"I read and I wrote letters.\"\nSo he spent a lot of time and effort on those letters. They were beautifully written full of detail and essentially he poured his heart into them.","url":"https://www.npr.org/2018/07/17/629742101/nelson-mandelas-prison-letters-one-day-i-will-be-back-at-home"}
