{"authors":["Jack Gaughan For Mailonline"],"date_download":"2018-10-23 02:04:17","date_modify":"2018-10-23 02:04:17","date_publish":"2016-01-29 16:17:54","description":"JACK GAUGHAN: The opening weeks of Nemanja Vidic's trophy-laden time at Manchester United were tough. But after hitting the gym, he would go on to be Sir Alex Ferguson's defensive rock.","filename":"data/vaneerConsumption/NemanjaVidicbecameManchesterUnitedsimmovableobjectafteratoughstarthewasbravefiercelycompetitiveandawinner.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B436E300000578-0-image-a-10_1454085253395.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423081_Nemanja-Vidic-Manchester-United-s-immovable-object-tough-start-brave-fiercely-competitive-winner_1540260257.html","title":"Nemanja Vidic became Manchester United's immovable object after a tough start... he was brave, fiercely competitive and a winner","title_page":"Nemanja Vidic became Manchester United's immovable object after a tough start... he was brave, fiercely competitive and a winner | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The opening weeks of Nemanja Vidic's trophy-laden time at Manchester United were tough. He arrived in England a skinny 25-year-old easily manoeuvred off the ball and given a fierce welcome.\nTraining was intense, Vidic battered about all over Carrington. A test of his mettle, with Paul Scholes later admitting Sir Alex Ferguson's esteemed squad were unsure as to what the club had just spent £7million on.\nFurther the case when the Serbian was given a chasing by Blackburn Rovers in a 4-3 defeat at Ewood Park in his third outing. David Bentley scored a hat-trick that night; this was not the Russian Premier League where Spartak Moscow rolled over all in sight, defenders barely contributing. A wake-up call, if he actually needed one.\nNemanja Vidic says goodbye to Old Trafford after his last home game as a Manchester United player in 2014\nVidic slides in on Barcelona forward Lionel Messi during the 2011 Champions League final at Wembley\nVidic lifts the Premier League trophy at Old Trafford in 2011 after helping Manchester United win their 19th title\nVidic points to the sky as he celebrates opening the scoring against Sunderland at Old Trafford in 2008\nNEMANJA VIDIC CAREER Red Star (2001-04) – 95 apps, 6 goals Spartak Moscow (2004-05) – 41 apps, 4 goals Man United (2006-14) – 300 apps, 21 goals Inter Milan (2014-16) – 28 apps, 1 goal Serbia (2002-11) – 56 apps, 2 goals\nVidic didn't then possess the physicality becoming prevalent in English football and vowed to change. From that first month he was always found in the gym, constantly pumping weights to bulk up. Removing him from there proved difficult.\nHe would grow into Ferguson's immovable object at his defence's heart. The man who stood firm in adversity, throwing himself in front of strikers, heading countless crosses away from danger. Alongside Rio Ferdinand, he was the manager's rock.\nThat is why, with his 15 pieces of silverware, United supporters are so nostalgic after Vidic's retirement announcement this Friday. Bar those first few weeks there was hardly a troubling moment, finishing captain, Ferguson overlooking Ferdinand to reaffirm just how crucial Vidic was.\nAll that in eight years at Old Trafford. Five Premier League titles, one Champions League, three League Cups, five Community Shields and a Club World Cup. The only pot missing was the FA Cup, with United still searching for their first since 2004.\nVidic formed a brilliant partnership with England's Rio Ferdinand in the heart of Manchester United's defence\nVidic tussles with Chelsea midfielder Oscar during a 0-0 draw with Chelsea in the Premier League in 2013\nVidic rises highest to score with a powerful header against Tottenham at White Hart Lane in February 2007\nLiverpool striker Daniel Sturridge is challenged by Vidic during a Premier League clash in March 2014\nOLD TRAFFORD HONOURS Premier League – 2006-07, 2007-08, 2008-09, 2010-11, 2012-13 League Cup – 2005-06, 2008-09, 2009-10 Champions League – 2007-08 Club World Cup – 2008\nWith almost 300 appearances he has the highest win percentage of any United player to have turned out over 100 times. The goals from corners were a trademark, with his determined stare when ball met with netting.\nFerdinand and Vidic's combo was the most revered defensive partnership in this country, perhaps in Europe. There are video compilations of their work together online. Perhaps that lies in United's fanatical fanbase but few blockers are reserved quite so much adulation.\nVidic poses with Sir Alex Ferguson after joining Manchester United from Spartak Moscow for £7m in 2006\nVidic slides in on Liverpool striker Fernando Morientes during a feisty clash at Anfield in February 2006\nVidic waves to supporters during an open top bus parade after winning the Premier League title in 2013\nOpponents had respect and admiration too. Didier Drogba was not shy in admitting that they were the hardest defenders he ever faced, pleasure heightened when getting the better of the two in Chelsea's titanic clashes. It didn't happen too often, so worth savouring, was his rationale.\nUnited miss them both and that Vidic's retirement was published on Manchester United's website indicates the level of regard still held for him. Expect an ambassadorial role to follow and the 34-year-old to be back in the North West soon enough.\nManchester loves his personality as well as performances. Vidic understood - understands - the club and tapping into that would make perfect sense long term. He was a competitor but does not take himself too seriously.\n'I watched Kung-Fu Panda 2 with my kids,' he said. 'I really liked the first one - probably one of the best cartoons I've seen. My other favourite is Finding Nemo, the one about the fish.'\nManchester United mascot Fred the Red puts his hand on Vidic's shoulder before a game with Hull in 2014\nVidic (centre) celebrates with team-mates Federico Macheda (left) and Wes Brown (right) in November 2010\nVidic suffered a bloody nose during his final appearance for Manchester United against Southampton\nWith no airs and graces, United supporters relate to him. He was never afforded the deserved credit by Ferguson but did not crave it, instead thundering into tackles, barging markers and offering that last line of courageous defending. A good job his shirt was invariably red.\nVidic's last act as a Manchester United player was to wander over to the travelling thousands in Southampton on 2013-14's final day with blood pouring from his nose. He'd taken a right old, unintentional, smack from Rickie Lambert. Spilling for the cause until the bitter end, and all rather fitting.\nAs United wrote on social media on announcing the news: 'No nonsense. No prisoners. No fear.' After those first few training sessions, anyway.","url":"https://www.dailymail.co.uk/sport/football/article-3423081/Nemanja-Vidic-Manchester-United-s-immovable-object-tough-start-brave-fiercely-competitive-winner.html"}
