{"authors":["John J. Xenakis"],"date_download":"2018-10-30 20:41:49","date_modify":"2018-10-30 20:41:49","date_publish":"2015-11-30 14:40:50","description":"Nepal's fuel deal with China collapses, as India border blockade worsens; Communist Maoists block all India vehicles from entering Nepal","filename":"data/vaneerConsumption/NepalsFuelDealwithChinaCollapses.json","image_url":"https://media.breitbart.com/media/2015/05/ap_ap-photo965-e1448894440407.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_11_30__1540932109.html","title":"Nepal's Fuel Deal with China Collapses","title_page":"Nepal's Fuel Deal with China Collapses","title_rss":"NULL","source_domain":"breitbart.com","text":"This morning’s key headlines from GenerationalDynamics.com\nNepal’s fuel deal with China collapses, as India border blockade worsens\nCommunist Maoists block all India vehicles from entering Nepal\nMany lose jobs in Bihar, India’s border, as well as Nepal\nNepal’s fuel deal with China collapses, as India border blockade worsens\nGraffiti in Kathmandu reads ‘Let’s protest against the Indian blockade’ in Nepali (Reuters)\nThe Hindu religion Madhesis ethnic group, living in Nepal’s Tarai region on the border with India, is continuing its blockade of all commercial traffic from India, which started on September 24. The blockade has cut off the only source of imports of petroleum and cooking gas to Nepal, as well as many other goods. ( “8-Nov-15 World View — Nepal turns to China as border tensions with India increase”)\nOn October 28, China and India signed a memorandum of understanding that China would provide fuel to Nepal to compensate for the blockade, effective ending India’s monopoly over fuel supplies to Nepal.\nHowever, the deal may be collapsing because the committee charged with implementing the deal, the Nepal Oil Corporation (NOC), are apparently so buried in bureaucracy that they cannot make any progress. According to an anonymous bureaucrat:\nIn the last two months of the crisis, only three meetings of the NOC board, chaired by commerce secretary, were held and they were focused on monitoring and distribution of petroleum products rather than on expediting the business-to-business (B2B) deal with PetroChina.\nDetails from open news sources are sketchy, but apparently Gopal Bahadur Khadka, managing director of NOC, was holding up the official deal because he was trying to use his privately owned company Birat Petroleum to purchase the fuel from China at twice the market price, and then to resell it to NOC at market price.\nWith all the corruption going on in Washington and on Wall Street, it should not surprise anyone that there is also corruption in Nepal. Nepal has yet to recover from the massive earthquake six months ago, and people without shelter are going to have to try to survive the Himalayan country’s cold winter, but none of that mattered to Khadka, apparently, as long as he got his money.\nA source close to the Prime Minister KP Sharma Oli said that Khadka is going to be sacked on the charge of “failing to perform duty satisfactorily.” Are you kidding me?\nIn the last decade, American banksters created trillions of dollars in fraudulent subprime-mortgage-backed synthetic securities, and sold them to investors knowing that they were fraudulent. And yet the Obama administration, which depends on these banksters to make huge donations to his campaigns, and to his pet projects like Obamacare, has never criminally charged a single person. It is enough to make any decent person vomit, but the mainstream media are too in love with President Obama to vomit.\nSo now, in Nepal, a bureaucrat who allegedly committed truly massive fraud, at a time when Nepal itself is in danger, is being fired for “failing to perform duty satisfactorily.” That would be the reason to fire someone who was falling asleep in meetings. We can only guess that Prime Minister Oli is probably getting kickbacks from somewhere, because if Khadka is no criminal, then I do not know what a “criminal” is. Himalayan Times and Review Nepal\nCommunist Maoists block all India vehicles from entering Nepal\nWhile ethnic Madhesis in Nepal are blockading commercial traffic from India into Nepal, Communist Maoists have announced a bandh (general strike) that blocks any Indian vehicles whatsoever to enter Nepal. According to an India police chief:\nWe have not allowed Indian vehicles into Nepal via Banbasa bridge today after a bandh call by the Maoists (Viplav faction) in Nepal, but Nepalese vehicles plied normally. The Nepalese police had advised against allowing Indian vehicle towards their territory fearing violence by the Maoist group which has called for the bandh.\nThe Maoists are blaming India for the blockade by the Madhesis, who are Hindu. The blockade was triggered by the passage of a new Nepal constitution that marginalizes the Madhesis, and purposely limits the Madhesi representation in the parliament to 10%, even though they constitute 40% of the population. India has been lobbying Nepal to modify the constitution, but insists that it has done nothing to support or encourage the blockade.\nOn Saturday morning, a car belonging to the Indian embassy in Kathmandu was vandalized and torched. A Maoist spokesman claimed credit:\nWe had earlier warned not to ride Indian vehicles in Nepal, otherwise the angry people can do anything. [India’s Narendra] Modi government did not take this issue seriously and that is why the people are angry. This anger will convert into a struggle. This will neither benefit India nor Modiji [Modi supporters].\nInterestingly, both police officials and embassy officials are denying the Maoist claim, saying that the vehicle caught fire due to a technical fault. Presumably, the same technical fault broke the windows, even though the car was parked and no one was in it.\nAccording to the Maoist spokesman:\nOur strike is against India’s blockade and its interference in Nepal. How long will people of Nepal suffer? India must back down.\nTribune of India and AFP and Review Nepal and Times of India\nMany lose jobs in Bihar, India’s border, as well as Nepal\nThe blockade is causing economic devastation on both sides of of the Nepal-Indian border.\nAfter the blockade began, Nepal’s border state of Tarai was forced to close industries, shops and schools. This put many Madhesis out of work, and resulted in skyrocketing prices for essential commodities and petroleum products.\nFor the same reason, thousands of workers from the India’s eastern state of Bihar were out of work. Prices also skyrocketed in Bihar itself because of the shortage of essential items. Tribune of India\nKEYS: Generational Dynamics, Nepal, India, Tarai, Madhesi, China, Nepal Oil Corporation, NOC, Gopal Bahadur Khadka, KP Sharma Oli, Narendra Modi, Maoists, Communists, Kathmandu, Bihar\nPermanent web link to this article\nReceive daily World View columns by e-mail","url":"https://www.breitbart.com/national-security/2015/11/30/world-view-nepals-fuel-deal-with-china-collapses-as-india-border-blockade-worsens/"}
