{"authors":["Associated Press"],"date_download":"2018-10-23 02:30:09","date_modify":"2018-10-23 02:30:09","date_publish":"2017-03-10 11:44:08","description":"KATHMANDU, Nepal (AP) - Nepal asked India on Friday to investigate the fatal shooting of a Nepali man by Indian border guards, officials said.Deputy Prime...","filename":"data/vaneerConsumption/NepalasksIndiatoprobekillingofmanbyborderguards.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/12/wire-196035-1489150754-324_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4300956_Nepal-asks-India-probe-killing-man-border-guards_1540261809.html","title":"Nepal asks India to probe killing of man by border guards","title_page":"Nepal asks India to probe killing of man by border guards | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"KATHMANDU, Nepal (AP) - Nepal asked India on Friday to investigate the fatal shooting of a Nepali man by Indian border guards, officials said.\nDeputy Prime Minister Bimalendra Nidhi said he called Indian External Affairs Minister Sushma Swaraj and asked her for an investigation and the punishment of those responsible.\nThe 25-year-old man was shot by border guards on Thursday during a dispute between people on both sides of the border over the construction of a culvert in the area.\nNepalese students shout slogans against the Indian government near the Indian Embassy in Kathmandu, Nepal, Friday, March 10, 2017. A 25-year-old Nepali man was shot by Indian border guards on Thursday during a dispute between people on both sides of the border over the construction of a culvert in the area. (AP Photo/Niranjan Shrestha)\nNidhi said the Indian side assured him there would be an investigation.\nA statement from Indian Ministry of External Affairs said border guards have initiated an inquiry.\nA group of students protested the killing outside the Indian Embassy in Kathmandu on Friday.\nOpposition political parties also spoke against the killing in parliament and demanded that Nepal strongly protest the incident.","url":"https://www.dailymail.co.uk/wires/ap/article-4300956/Nepal-asks-India-probe-killing-man-border-guards.html"}
