{"authors":[],"date_download":"2018-10-23 00:46:39","date_modify":"2018-10-23 00:46:39","date_publish":"2015-05-04 00:00:00","description":"Some have vented their anger by throwing rocks at visiting politicians. Others have become social workers in their villages. But many Nepalis are absorbed in the daily struggle to find food and water.","filename":"data/vaneerConsumption/NepaliVillageStrugglesToRecoverFromEarthquake.json","image_url":"https://media.npr.org/assets/img/2015/05/05/jmmsindupalchowk8218_wide-e92f1b61bdae91f7677d2f7a90e0c98b8fe82a2d.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/templates_transcript_transcript.php_storyId=404236490_1540255599.html","title":"Nepali Village Struggles To Recover From Earthquake","title_page":"Nepali Village Struggles To Recover From Earthquake : Parallels : NPR","title_rss":"NULL","source_domain":"npr.org","text":"MELISSA BLOCK, HOST:\nIn Nepal, more than 7,000 people are now known to have died in the earthquake that hit nine days ago. Millions are trying to rebuild their lives. NPR's Julie McCarthy went into the quake zone to the area that suffered the greatest number of fatalities. She sent this report.\nJULIE MCCARTHY, BYLINE: Driving east out of Kathmandu, the road turns north and coils toward the border with Tibet. We crawl past the tree line - an ooh and ah as the snowcapped peaks of the Langtang mountain range come into view, indelible and breathtaking. But alongside the beauty of this singular Nepali panorama sits another more sobering scene.\nThe earthquake has altered the landscape of towns along this popular pass. No house, no business appears to have withstood the fury of the quake. In the town of Chautara which it straddles the winding, mountainous road. It's in the district that lost the greatest number of people in the quake - some 2,600. This weekend, in the same district, improbably, survivors were pulled from beneath the rubble. In Chautara, Amrit Shrestha, 36, thinks he smells something rotting beneath the wreckage of his home. A Norwegian firefighter asks him, is it garbage? Perhaps a person? He's uncertain.\nAMRIT SHRESTHA: Maybe or may not be. Maybe dogs, maybe chickens, everything.\nMCCARTHY: He says they pulled out the bodies of neighbors, and he's still digging out belongings from the pile of timbers and bricks that were once his family home. Amrit's energetic clearing of debris marks him as a pragmatic, get-on-with-it man. I wondered how he and many others like him function when all around is in ruins.\nWhat do you do when you get up in the morning? What's the first thing you do?\nA. SHRESTHA: First thing, we have to collect water in our ponds and everywhere. There is no electricity. How can we get electricity? Slowly we'll on - and we'll make a house slowly. But now we have to be safe first. Our life is precious. So nobody's injured. That's the good thing.\nMCCARTHY: Amrit's clothing store has been destroyed, but he's found a new purpose in this quake - collecting essentials and delivering them to the neediest among them. He's now, he says, a social worker.\nA. SHRESTHA: If I can give something to others, then I just do.\n(CROSSTALK)\nMCCARTHY: Amrit gets those basic supplies from the aid camp up the road. There's a field where children play games and where the Norwegian Red Cross is installing a mobile hospital. By all appearances, this is not a town that's been overlooked. The Army is out, and U.N. four-wheel-drive vehicles roar up the road.\nUNIDENTIFIED MAN: (Foreign language spoken).\nMCCARTHY: But restaurant owner Sunita Shrestha is acid on the subject of what Nepali politicians have done for the community here.\nSUNITA SHRESTHA: (Speaking Nepalese).\nMCCARTHY: \"We're sleeping on the ground that's still shaking, and we don't sleep because of the high winds and rain,\" she says. When local politicians showed up last week, Sunita says residents pelted them with stones in protest before they escaped. Across the street, Shovit Shrestha sits on the stoop of his old-fashioned hardware store selling the one thing he's got that his neighbors need - nails. While he offers them the promise of rebuilding, he despairs at any reconstruction for himself. He says the government is giving $5,000 to rebuild.\nSHOVIT SHRESTHA: (Speaking Nepalese).\nMCCARTHY: \"That money is peanuts,\" he says. \"I've lost 10 times that in merchandise alone.\" It's one man's loss in a country full of stories like his. Julie McCarthy, NPR News, Chautara, Nepal.\nCopyright © 2015 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.","url":"https://www.npr.org/templates/transcript/transcript.php?storyId=404236490"}
