{"authors":["Neil Munro"],"date_download":"2018-10-30 19:09:25","date_modify":"2018-10-30 19:09:25","date_publish":"2018-06-21 21:12:54","description":"Is Ryan's amnesty an amnesty? Ryan wants Trump to say no.","filename":"data/vaneerConsumption/NervousRepublicansAskTrumptoSaveRyansAmnestyBill.json","image_url":"https://media.breitbart.com/media/2018/06/Paul-Ryan-Deceiver-J.-Scott-Applewhite-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/midterm-election_2018_06_21__1540926565.html","title":"Nervous Republicans Ask Trump to Save Ryan's Amnesty Bill","title_page":"Nervous Republicans Ask Trump to Save Ryan's Amnesty Bill | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"House Speaker Paul Ryan’s fading amnesty bill could be revived if President Donald Trump publicly touts his support for the measure, GOP amnesty advocates and leaders are telling reporters.\nThe appeal to Trump is likely being sent by Ryan to Trump’s chief of staff, John Kelly.\nRyan’s team has already postponed by the vote for a day, and is using the time to persuade and cajole GOP conservatives to support his bill, which includes an amnesty for 1.8 million illegals and a fast-track to green cards for roughly 300,00 Indian tech-workers and their spouses.\nOne unidentified GOP advocate says the caucus is being moved towards a yes vote:\nGOP lawmaker exits meeting and says compromise immigration bill is “a lot closer to passing than it was earlier,” because of Goodlatte defeat, passage of farm bill and backing from Trump https://t.co/FGKO95WVJx — Scott Wong (@scottwongDC) June 21, 2018\nThe Hill.com reported via Twitter that:\nSome House conservatives want @realDonaldTrump to clarify whether or not he thinks compromise immigration bill amounts to “amnesty,” as many groups on right are saying. If he tweets it’s NOT amnesty, they may get on board.\nSome House conservatives want @realDonaldTrump to clarify whether or not he thinks compromise immigration bill amounts to “amnesty,” as many groups on right are saying. If he tweets it’s NOT amnesty, they may get on board — Scott Wong (@scottwongDC) June 21, 2018\nRep Mark Walker, chairman of the Republican Study Committee told a NBC Capitol Hill reporter that “What would compliment the most to that is having the president continue to add to his voice to this compromise bill.”\n.@RepMarkWalker says that House members needs the president's vocal support of the compromise bill. \"What would compliment the most to that is having the president continue to add to his voice to this compromise bill\" — Leigh Ann Caldwell (@LACaldwellDC) June 21, 2018\nHowever, Trump made clear earlier in the day that he not going to enthusiastically back Ryan’s amnesty, partly because the 49 Democratic Senators are expected to block Ryan’s amnesty bill and immigration reform which helps Americans. He tweeted:\nWhat is the purpose of the House doing good immigration bills when you need 9 votes by Democrats in the Senate, and the Dems are only looking to Obstruct (which they feel is good for them in the Mid-Terms). Republicans must get rid of the stupid Filibuster Rule-it is killing you! — Donald J. Trump (@realDonaldTrump) June 21, 2018\nRep. Mike Coffman, who was one of GOP legislators who split the party by pushing the discharge-petition measure, also wants the President to save Ryan’s amnesty, according to a RollCall reporter.\nIn the early afternoon, Coffman helped defeat the stronger immigration-reform bill drafted by Rep. Bob Goodlatte, the chairman of the House judiciary committee. The bill got 193 GOP votes, despite opposition from Ryan, his leadership team and many business groups.\nBut the rejection of the Goodlatte bill means the President should help Coffman push the Ryan bill through the House, Coffman argued. “Now that we really have just one option on the table, I think the American people need to hear from the president about how important this bill is to his administration to get it passed,” said Coffman.\nGOP Rep. Mike Coffman, a top Dem target in 2018, said the same: “Now that we really have just one option on the table, I think the American people need to hear from the president about how important this bill is to his administration to get it passed” https://t.co/cuNPrRtHMU — Bridget Bowman (@bridgetbhc) June 21, 2018\nCoffman’s Colorado district is a swing district, partly because GOP legislators worked with business groups to import huge numbers of pro-government Hispanic voters over the last few decades. He is now trying to save his seat in November by supporting the arrival of more pro-government Hispanic voters.\nCoffman was recorded as a no vote on the Goodlatte bill, along with 40 other GOP members, including the legislators who pushed for the discharge petition, plus a few legislators who are firmly against any amnesty, no matter the value of a political trade.\nThe fourth-ranking Republican, Rep. Cathy McMorris Rodgers also voted against the Goodlatte bill, even though she is chair of the GOP House conference, and is trying to win more votes for Ryan’s bill.\n41 House Republicans voted No on Goodlatte-McCaul immigration bill including \"compromise\" bill authors Curbelo & Denham and GOP Conference Chair McMorris Rodgers. https://t.co/nBgfDJQgZR pic.twitter.com/6VPrRJKYvS — Craig Caplan (@CraigCaplan) June 21, 2018\nMcMorris Rodgers said she voted against the Goodlatte bill because Ryan’s bill is a better match for Trump’s ‘Four Pillars’ reform. Ryan’s bill offers a bigger amnesty than Goodlatte’s bill, and McMorris Rodger’s has previously supported amnesty proposals which help farmers in her Washington State district.\nMy statement on the Securing America's Future Act. pic.twitter.com/d8jyr47Rzn — CathyMcMorrisRodgers (@cathymcmorris) June 21, 2018\nOn June 15, McMorris Rodgers sent talking-points to GOP legislators to help them defend Ryan’s amnesty bill when talking to their voters. “The bill does not provide amnesty to anyone … The bill simply allows the DACA population – children who were brought here through no fault of their own and grew up in the United States – an opportunity to get right with the law and earn a legal status in our country,” says the talking-points memo.\nMcMorris Rodgers’ memo echoed the demand by GOP donors that the nation’s immigration policy should serve their business purposes, and not serve Americans’ desire for a middle-class lifestyle, marriage and kids. She wrote:\nKEY MESSAGE: America is a nation of immigrants; however, our current immigration system is outdated and failing the American people. The status quo on the border puts us in danger, and our current immigration system keeps the best and brightest from coming here legally. For the first time in decades, we are taking serious steps to fix our visa and immigration system while fully funding the President’s request to build the border wall. This bill starts a step-by-step approach, and the first step is building a wall and securing our border.\nStill, Ryan’s team has picked up a few votes, including support from Missouri Rep. Vicky Hartzler.\n.@RepHartzler (R-Mo), member of RSC, says she stayed up late and read entire compromise immigration bill and will vote YES. — Scott Wong (@scottwongDC) June 21, 2018\nBut Ohio Rep. Jim Jordan, co-chair of the House Freedom Caucus, is skeptical about the bill’s future.\nAsked if leadership may be concerned the compromise bill will get less votes than the 193 the conservative Goodlatte bill got, @Jim_Jordan says: \"I don't know if they're concerned about that but I think that's the case.\" — Lindsey McPherson (@lindsemcpherson) June 21, 2018\nSpeaker Ryan is trying to persuade the legislators, and one reporter Tweeted that he offered to hold a vote on mandatory use of E-Verify. But Ryan has already announced he will soon hold a vote on E-Verify in combination with a huge guest-worker program for farmers. There is no evidence that Democrats will support the E-Verify program, even if it is packaged with a national amnesty.","url":"https://www.breitbart.com/midterm-election/2018/06/21/amnesty-wavering-gop-reps-want-cover-from-president-trump/"}
