{"authors":["Jack Montgomery"],"date_download":"2018-10-30 17:58:38","date_modify":"2018-10-30 17:58:38","date_publish":"2017-04-28 08:07:22","description":"SNP MPs representing seats where Brexit support is strong have broken ranks with the party to support repatriation of Scotland's fisheries.","filename":"data/vaneerConsumption/NervousSNPMPsBreakRankstoSignProBrexitFishingPledge.json","image_url":"https://media.breitbart.com/media/2017/04/Fishing-for-Leave.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2017_04_28__1540922318.html","title":"'Nervous' SNP MPs Break Ranks to Sign Pro-Brexit Fishing Pledge","title_page":"'Nervous' SNP MPs Break Ranks to Sign Pro-Brexit Fishing Pledge","title_rss":"NULL","source_domain":"breitbart.com","text":"SNP MPs representing fishing communities where support for Brexit is strong have broken ranks with the Europhile party line, signing a pledge calling on Scotland to leave the EU and take back its fishing waters.\nThe Scottish Fishermen’s Federation believes leaving the EU and ending its jurisdiction over British fisheries via the Common Fisheries Policy (CFP) is “the only way of ending the farcical situation under which the country is forced to give away almost two-thirds of the fish from some of the richest fishing grounds in the world”.\nNo serving SNP MPs or MSPs backed Brexit during the referendum – although former Cabinet Secretary Alex Neil confessed he voted Leave in the privacy of the polling booth after it was over.\nMedia commentators are speculating that Eilidh Whiteford and Mike Weir publicly endorsed the fishing pledge in order to help see off challenges from Scottish Conservative Party rivals in the upcoming June 8th snap election.\nWhiteford represents Banff and Buchan, which includes the fishing ports of Fraserburgh and Peterhead, and where local SNP councillor John Cox has been pushing for the SNP to give up its attempts to retain EU membership and embrace the “significant opportunities” which Brexit could provide.\nAnother SNP MP, Tommy Sheppard, has pleaded with the pro-separation Scottish Green Party not to run in seats the Conservatives are targeting, to avoid “splitting the pro-Yes vote [and] the anti-Tory vote”.\nSpeaking at First Minister’s Questions in Edinburgh Thursday, Nicola Sturgeon claimed her party had, in fact, been “consistent over many, many years in our criticisms of the Common Fisheries Policy”.\nShe reminded Scottish Conservative leader Ruth Davidson that it was a Tory administration under the late Ted Heath which decided that “in the wider UK context, the fishermen must be regarded as expendable” in 1973, when Britain first went into the European Economic Community, as the EU then called itself.\nThe Conservatives must exorcise the betrayal of Britain’s fishing & coastal communities to the EU.Take Back Control! https://t.co/QzJD9hMaY8 pic.twitter.com/UqRxdCK1J1 — Fishing for Leave (@fishingforleave) April 26, 2017\nIt is true that Nicola Sturgeon’s predecessor, Alex Salmond, denounced the Common Fisheries Policy as “disastrous for Scotland’s fishing communities, the Scottish economy and our maritime environment” in 2004, saying that it was “imperative that we remove the dead hand of Brussels mismanagement as soon as possible”.\nHowever, a long-standing policy to unilaterally reclaim control over fisheries from Brussels was quietly discarded in 2014, and talk has since turned towards giving up on the industry as a means of smoothing a separate Scotland’s readmission to the EU.","url":"https://www.breitbart.com/europe/2017/04/28/nervous-snp-mps-break-ranks-party-sign-pro-brexit-fishing-pledge/"}
