{"authors":[],"date_download":"2018-10-30 14:34:58","date_modify":"2018-10-30 14:34:58","date_publish":"2015-03-17 00:00:00","description":null,"filename":"data/vaneerConsumption/Netanyahu180degreeturnonPalestinianstatehood.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_03_netanyahu_180_degree_turn_on_palestinian_statehood_1540910098.html","title":"Netanyahu 180-degree turn on Palestinian statehood?","title_page":"Netanyahu 180-degree turn on Palestinian statehood?","title_rss":"NULL","source_domain":"americanthinker.com","text":"In similar vein, Jerusalem bureau chief Jodi Rudoren tells Times readers in her lead paragraph that \"as long as he is the leader, a Palestinian state would not be established, reversing his support for a two-state solution to the Palestinian conflict.\"\nOn March 16, the New York Times trumpets a front-page headline on its website that reads: \"Netanyahu Says No Palestinian State if he is Re-elected.\"\nThus, the lead, bolstered by the headline, flatly puts out the word that Netanyahu's support for a two-state solution has been reversed. Period. No ifs, ands, or buts, or qualifiers.\nBut has there really been a Netanyahu reversal from his erstwhile support of two states living side by side? The record suggests otherwise.\nTo plumb Netanyahu's position on eventual Palestinian statehood, one has to go back half a dozen years to an address he gave at Bar-Ilan University on June 14, 2009. In media shorthand, this speech repeatedly has been cited as an endorsement of a two-state solution.\nBut Bar-Ilan did not serve up a clear, simple swing by Netanyahu toward recognition of an eventual \"Palestine.\" There is far more content and substance in that speech.\nA few quotes from Netanyahu's Bar-Ilan address show that it came with lots of qualifiers. Here are the telling quotes:\n\"If we get a guarantee of demilitarization, and if if the Palestinians recognize Israel as the Jewish state, we are ready to agree to a real peace agreement, a demilitarized Palestinian state side by side with the Jewish state.\"\nAnd those were not the only ifs. \"Israel needs defensible borders with Jerusalem remaining the united capital of Israel,\" Netanyahu declared. Plus an end to Palestinian incitement.\nAnd to wrap it all up, Netanyahu told his Bar-Ilan audience that \"Palestinians must decide between the path of peace and the path of Hamas. I will not sit down at a conference table with terrorists who seek to destroy\" Israel.\nIn other words, there have been very high bars for Palestinians to qualify for statehood, as far as Netanyahu is concerned. But what about now, as media headlines trumpet a supposed Bibi conversion away from Palestinian statehood? A closer look also finds another big if.\nYes, Netanyahu seems quite emphatic that the two-state solution is out the window. But there remains a possible eventuality that Mideast conditions will permit another go at Palestinian statehood when circumstances are more propitious, Netanyahu suggests. No timetable, to be sure.\nNetanyahu's current big qualifier is that his rejection of \"Palestine\" is meant for today. It is current turmoil in a violent, destabilized Middle East that prompts Netanyahu to defer further steps toward Palestinian statehood. Given its many past disappointments in peace-making, Israel is not about to make a huge territorial concession while ISIS and Company run roughshod across the region.\nOne Gaza example is more than sufficient evidence that an Israeli withdrawal from the West Bank to form a Palestinian state would result in ISIS and similar terrorist outfits quickly filling the vacuum left by Israel.\nSo no great shock that Netanyahu is not disposed to head in that direction – today, at least.\nLeo Rennert is a former White House correspondent and Washington bureau chief of McClatchy Newspapers.","url":"https://www.americanthinker.com/blog/2015/03/netanyahu_180_degree_turn_on_palestinian_statehood.html"}
