{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:43:40","date_modify":"2018-10-30 19:43:40","date_publish":"2015-07-14 15:46:36","description":"Israeli Prime Minister Benjamin Netanyahu spoke out against the “historic mistake” of the P5+1-Iranian nuke deal finalized Tuesday morning.","filename":"data/vaneerConsumption/NetanyahuIranianNukeDealaHistoricMistake.json","image_url":"https://media.breitbart.com/media/2015/07/Netanyahu-glare-getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_14__1540928620.html","title":"Netanyahu: Iranian Nuke Deal a ‘Historic Mistake’","title_page":"Netanyahu: Iranian Nuke Deal a ‘Historic Mistake’ | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Israeli Prime Minister Benjamin Netanyahu spoke out against the “historic mistake” of a nuclear deal finalized Tuesday morning between the P5+1 world powers and the Iranian regime.\nNetanyahu spoke of the deal while meeting with visiting Netherlands Foreign Minister Bert Koenders, The Jerusalem Post reported.\nIt appeared to the Israeli leader that the world powers were willing to strike an accord “at any price.”\nThe deal–which is being lauded by Iranian media as a victory–will allow for the terror regime to cash in for “hundreds of billions of dollars,” which will be used to finance its terror operations throughout the world, Netanyahu warned.\n“It is impossible to prevent an agreement when the negotiators are willing to make more and more concessions to those who chant ‘Death to America’ even during the negotiations,” he added, referencing Tehran’s celebration of Al-Quds day on Friday, where demonstrators called for the destruction of the United States and Israel.\nNetanyahu pledged that Israel would not allow Tehran to acquire nuclear weapons.\nThe Israeli leader called his security cabinet in for a meeting at 4:30 p.m. local time Tuesday following the agreement.\nDefense Minister Moshe Ya’alon said Tuesday, in what has been described as the “most fierce criticism” of the deal offered to date, that the nuclear deal was built on the fundamentals of “lies and deceit.”\nDescribing Tehran as “the world’s leading exporter of terror,” Ya’alon said Iran had “arrived at the negotiating table in a weak position, and has emerged victorious. Instead of fighting terror with all its might, the free world has granted legitimacy to Iran’s hateful, murderous ways.”\nHe added:","url":"https://www.breitbart.com/national-security/2015/07/14/netanyahu-iranian-nuke-deal-a-historic-mistake/"}
