{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:10:00","date_modify":"2018-10-30 21:10:00","date_publish":"2015-03-02 15:29:06","description":"Israeli Prime Minister Benjamin Netanyahu previewed his speech in Congress on Tuesday when he addressed the annual policy conference of the American Israel Public Affairs Committee (AIPAC) on Monday. \"Reports of the demise of the Israeli-U.S. relations not only premature--they're just wrong. You're here to tell the world that our alliance is stronger than ever,\" he said, to applause. \"Never has so much been written about a speech that hasn't been given,\" he joked. |","filename":"data/vaneerConsumption/NetanyahutoAIPACNoDisrespectforObama.json","image_url":"https://media.breitbart.com/media/2015/03/Screen-Shot-2015-03-02-at-7.15.20-AM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_03_02__1540933800.html","title":"Netanyahu to AIPAC: No 'Disrespect' for Obama","title_page":"Netanyahu to AIPAC: No 'Disrespect' for Obama | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Israeli Prime Minister Benjamin Netanyahu previewed his speech in Congress on Tuesday when he addressed the annual policy conference of the American Israel Public Affairs Committee (AIPAC) on Monday. “Reports of the demise of the Israeli-U.S. relations [are] not only premature–they’re just wrong. You’re here to tell the world that our alliance is stronger than ever,” he said, to applause. “Never has so much been written about a speech that hasn’t been given,” he joked.\nNetanyahu told delegates that his speech had not been intended to show any disrespect to President Barack Obama or his office. “I have great respect for both,” he said, before ticking off a list of things Obama had done to support Israel, adding that there were some secret forms of assistance to Israel that he could not describe in public. “I am deeply grateful for his support, and so should you be.” He added that his job was not “to inject Israel into the American partisan debate.”\nRather, he said, his purpose in addressing Congress was “to speak up about a potential deal with Iran that could threaten the survival of Israel.” Pointing to a map that he had arranged to have projected on the wall, Netanyahu described the terrorist operations that Iran was coordinating around the world. “As Prime Minister of Israel, I have a moral obligation to speak up in the fact of these dangers while there is still time to avert them,” saying Jews could never be passive again.\n“No one makes alliances with the weak,” he continued. Israel, he said, had a voice because of its strength. “Tomorrow, as Prime Minister of the one and only Jewish state, I plan to use that voice.” He warned that Iran was not only developing a capacity to make nuclear weapons–“lots of them”–but that it was also “devouring country after country” and “exporting terror throughout the world.” While disagreement was natural among allies, he said, this issue was particularly important.\n“American leaders worry about the security of their country. Israeli leaders worry about the survival of their country. I think that encapsulates the difference.” That difference, he said, was the reason that the U.S. and Israel had encountered disagreements throughout 70 years of their relationship–disagreements that had sometimes led Israel to act alone. Yet throughout, he said, the relationship had continued to grow stronger, because the U.S. and Israel share the same values.\nNetanyahu gave special recognition to Czech Republic President Miloš Zeman, recognizing the Czech people as among the most steadfast of Israel’s allies, and noting that when he had joined the Israel Defense Forces (IDF), he had received a Czech rifle–part of a shipment that had reached Israel’s military in 1948, when the young state had few other sources of armaments. He also recognized Israeli ambassador to the U.S. Ron Dermer, “a man who knows how to take the heat.”\nSenior Editor-at-Large Joel B. Pollak edits Breitbart California and is the author of the new ebook, Wacko Birds: The Fall (and Rise) of the Tea Party, available for Amazon Kindle.\nFollow Joel on Twitter: @joelpollak","url":"https://www.breitbart.com/politics/2015/03/02/netanyahu-to-aipac-no-disrespect-for-obama/"}
