{"authors":["Deborah Danan"],"date_download":"2018-10-30 19:40:34","date_modify":"2018-10-30 19:40:34","date_publish":"2017-02-15 21:06:11","description":"JERUSALEM – Working with Arab nations is the key to peace with the Palestinians, Prime Minister Benjamin Netanyahu said at the White House press conference Wednesday, while President Donald Trump concurred, calling the idea \"terrific.\" | Israel / Middle East","filename":"data/vaneerConsumption/NetanyahuPeaceWillComefromWorkingwithArabPartners.json","image_url":"https://media.breitbart.com/media/2017/02/bt.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2017_02_15__1540928434.html","title":"Netanyahu: Peace Will Come from Working with Arab Partners","title_page":"Netanyahu: Peace Will Come from Working with Arab Partners | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"JERUSALEM – Working with Arab nations is the key to peace with the Palestinians, Prime Minister Benjamin Netanyahu said at the White House press conference Wednesday, while President Donald Trump concurred, calling the idea “terrific.”\nDeclaring that “new ideas” were needed to inject life into the moribund peace process, Netanyahu said that he and the president had been discussing how to galvanize other nations in the region toward a peace process.\n“I believe that the great opportunity for peace comes from a regional approach from involving our newfound Arab partners in their pursuit of a broader peace and peace with the Palestinians,” Netanyahu said.\nTurning to Trump, Netanyahu added, “I think that if we work together, we have a shot.”\nWhile Trump did not expound on how such a plan would look, he responded that it was a “terrific thing” that would involve “many, many countries” in the region.\n“It is something that is very different, hasn’t been discussed before,” Trump said. “We’re going to have other players at a very high level and I think it might make it easier on both the Palestinians and Israel to get something done.”\nAcknowledging a thaw in relations between Israel and some of the Arab nations, Trump said, “I think we have some pretty good cooperation from people in the past who would have never, ever thought about doing this,” he added.\nNetanyahu later said that many other countries in the Middle East share the same concerns as Israel and the U.S. about Iran.\n“There are so many others in the region who see eye to eye on the great magnitude and danger of the Iranian threat,” the prime minister said, adding that it was time to “roll back Iran’s aggression and danger.”\nWatch the press briefing here (starts minute 51)","url":"https://www.breitbart.com/middle-east/2017/02/15/netanyahu-peace-will-come-working-arab-partners/"}
