{"authors":["Parry Ernsberger"],"date_download":"2018-10-31 01:45:50","date_modify":"2018-10-31 01:45:50","date_publish":"2018-08-27 20:22:48","description":"Netflix is rolling out a new horror show on Oct. 12, and the just-released photos of The Haunting of Hill House — as per Entertainment Weekly — will leave you feeling totally spooked. The 10-episode series is a \"modern reimagining\" of the eponymous…","filename":"data/vaneerConsumption/NetflixsTheHauntingOfHillHouseWillMakeForPerfectHalloweenViewingPHOTOS.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/b0d2e781-126e-4d4d-8aff-34eda7041d8c-hohh_105_unit_01251r-1-2.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_netflixs-the-haunting-of-hill-house-will-make-for-perfect-halloween-viewing-photos-10246368_1540950350.html","title":"Netflix's 'The Haunting Of Hill House' Will Make For Perfect Halloween Viewing - PHOTOS","title_page":"Netflix's 'The Haunting Of Hill House' Will Make For Perfect Halloween Viewing — PHOTOS","title_rss":"NULL","source_domain":"bustle.com","text":"Netflix is rolling out a new horror show on Oct. 12, and the just-released photos of The Haunting of Hill House — as per Entertainment Weekly — will leave you feeling totally spooked. The 10-episode series is a \"modern reimagining\" of the eponymous 1959 Shirley Jackson novel, and it sounds like it'll be even more psychologically thrilling than the original.\nAccording to a press release from the streaming giant,\n\"'The Haunting of Hill House' explores a group of siblings who, as children, grew up in what would go on to become the most famous haunted house in the country. Now adults, and forced back together in the face of tragedy, the family must finally confront the ghosts of their past — some of which still lurk in their minds while others may actually be stalking the shadows of Hill House.\"\nAnyone else have goosebumps already? Well, you might want to turn on all the lights in your house because the photos from the show are totally going to freak you out.\nNetflix released six stills from the upcoming series, and every one of them is more confusingly creepy than the last. There's one of actor Carla Gugino wrapped up in what looks like either a very cozy red robe or an equally cozy velvet wrap dress, and she kind of has this dead-eyed, \"I'm going to kill you later\" look on her face.\nNetflix\nAnother one of the photos shows Henry Thomas — who starred as Elliott in E.T. — sitting on a bench next to a little girl, casually covered in blood. The footie pajama-wearing little girl appears totally unbothered by Thomas' red-stained attire. That's definitely more freaky than if she were to be, for example, hysterically crying and horrified. Definitely not a normal reaction.\nNetflix\nThere's a still of Timothy Hutton holding back an astounded-looking Michiel Huisman, but there's no telling what terror lies within their view. And another of the dilapidated, fog-drenched Hill House itself, one of an eerily-lit single red door, and one of Thomas and a car full of kids looking totally traumatized in an empty parking lot.\nNetflix\nFeeling scared and confused? Well, there's more. The Haunting of Hill House also has its very own dedicated Twitter account, and there's a good possibility that it'll ruin Crosby, Stills, & Nash's \"Our House\" for you forever.\nOver the last few days, the account has been tweeting short lyric clips from the song accompanied by vintage-looking family photos, and it all culminated with a teaser for the series that's almost completely devoid of sound.\nThe one-and-a-half minute teaser slowly pans by several rooms set along a dim hallway, assumedly within the Hill House. There are blink-and-you'll-miss-it moments that seem hidden in each passing room, though, and each moment makes it abundantly clear that something supernatural is definitely going down.\nNetflix\nFans hoping to ease the scares by reading the book first might want to rethink that plan. The Haunting of Hill House book is described as \"the story of four seekers who arrive at a notoriously unfriendly pile called Hill House,\" according to Amazon. \"At first, their stay seems destined to be merely a spooky encounter with inexplicable phenomena,\" it continues, \"But Hill House is gathering its powers—and soon it will choose one of them to make its own.\" No mention of a family returning, which seems to be the main conceit of the Netflix series. In fact, it's unclear how — if at all — the novel and the Netflix series will intertwine. Regardless, the show will likely be super scary in its own right. Be afraid. Be very afraid.","url":"https://www.bustle.com/p/netflixs-the-haunting-of-hill-house-will-make-for-perfect-halloween-viewing-photos-10246368"}
