{"authors":[],"date_download":"2018-10-30 17:56:17","date_modify":"2018-10-30 17:56:17","date_publish":"2015-08-23 04:00:00","description":"Former neurosurgeon Ben Carson has been gaining momentum in the crowded Republican race for president, fueled in part on support from social conservatives.","filename":"data/vaneerConsumption/NeurosurgeonCarsoncutshisownpathinpursuitofGOP.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_state--regional-govt--_13c666f83643699b5d1d018e76c51ce0__1540922177.html","title":"Neurosurgeon Carson cuts his own path in pursuit of GOP...","title_page":"Neurosurgeon Carson cuts his own path in pursuit of GOP...","title_rss":"NULL","source_domain":"ajc.com","text":"Former neurosurgeon Ben Carson has been gaining momentum in the crowded Republican race for president, fueled in part on support from social conservatives.\nRecent polls show Carson, 63, moving into the top tier in the field of 17 that continues to be lead by billionaire Donald Trump.\nCarson, 63, has an appealing personal story of growing up poor in a single-parent household in Detroit with bad grades and worse temper. Challenged by his mother, who’d only completed the third grade, to do better, Carson went on to excel in high school and go onto Yale and medical school.\nIn a distinguished career in pediatric neurosurgery at the Johns Hopkins Children’s Center, Carson performed the first successful separation of craniopagus (Siamese) twins joined at the back of the head in 1987.\nHe speaks openly of his childhood experience and of his faith. As a candidate, he’s declared that he’s opposed to abortion and said he supports a flat tax.\nTo date, Carson’s taken rides on the Truth-O-Meter five times. None of his statements have been top rated — True or Mostly True — or given the worst rating — Pants on Fire. He’s had one Half True, one Mostly False and three False.\nHere’s summaries of a majority. The full fact-checks can be viewed at www. politifact.com.\nBen Carson on Sunday, August 16th, 2015 in an interview on “Fox News Sunday”\nThe number of people who “believe in socialism … is increasing.”\nIn an interview with Fox News Sunday’s Chris Wallace, Carson gave the far-left side of the political spectrum a shout out as he defended his 10 percent flat-rate tax plan, which is based on the biblical practice of tithing.\n“You make $10 billion, you pay $1 billion. Now, I know a lot of people say that’s a problem because that guy’s still got $9 billion left, we need to take his money. But you see Chris, that’s called socialism,” Carson said Aug. 16. “And I recognize a lot of people here who believe in socialism. That number is increasing.”\nWe were curious about Carson’s claim that socialism is gaining ground in America.\nWe found that the polling evidence is lacking, but experts said there is a noticeable shift particularly in younger Americans. Younger Americans appear to be more open to the idea of socialism, which they equate with European social programs and Nordic-style social democracies.\nWe rated his claim Half True.\nBen Carson on Monday, April 6th, 2015 in a speech in Manchester, N.H.\n“We spent twice as much per capita for health care in this country as the next closest nation.”\nGiven his background, Carson is familiar with, and critical of, the country’s medical system.\nAppearing in New Hampshire, Carson told attendees at a health-care forum organized by the National Cultural Diversity Awareness Council that the Affordable Care Act was either poorly thought out, or designed to control “every aspect” of people’s lives.\n“We have atrocious problems with access (and) horrible inefficiency problems,” he said.\nCarson argued on behalf of health-savings accounts as a way to make people take responsibility for their own health care spending.\nCarson went on to say that the United States, at No. 1, doubles the health care spending of the No. 2 nation.\n“We spent twice as much per capita for health care in this country as the next closest nation,” he said during a 30-minute talk, which ranged from his own biography to entitlement and military spending.\nWe thought that was worth looking into. Could the United States really be spending twice as much per person as nations with universal health care, such as those in Europe?\nCarson’s numbers are off. Spending in the United States is about 1.4 times the next-highest nation, and it’s about 1.7 times the average of the nations that rank second through ninth in spending — the group Carson’s spokeswoman said he had been intending to reference in his comment.\nThat said, Carson has a point that spending in the U.S. is higher, and approaches double its peers, especially when looking at the average spending for the other Organization for Economic Co-operation and Development (OECD) nations.\nOn balance, we rated Carson’s claim Mostly False.\nBen Carson on Thursday, August 6th, 2015 in the first Republican debate\n“Ukraine was a nuclear-armed state. They gave away their nuclear arms with the understanding that we would protect them.”\nCarson might be a superb neurosurgeon, but how well that has prepared him for the White House was one of the questions tested in the first GOP debate.\nModerator Bret Baier of Fox News asked Carson whether he would have used military force against Syrian President Bashar al-Assad after there was convincing evidence that Syrian forces had used chemical weapons on its own people.\nCarson didn’t answer the question directly. Rather, he said reductions in America’s military forces have curtailed its options. He segued from that into the charge that America’s stature on the world scene has suffered.\n“Our friends can’t trust us anymore,” Carson said. “You know, Ukraine was a nuclear-armed state.They gave away their nuclear arms with the understanding that we would protect them. We won’t even give them offensive weapons.”\nWas Ukraine a nuclear state? And did it give up its nukes with assurances that the United States would protect it?\nThe answer to the first question is: not really. As for promised protections, the signed documents tell us that America pledged not to attack Ukraine, and that’s quite different from a promise to defend it.\nWe rated this claim False.\nBen Carson on Wednesday, march 4th, 2015 in an interview on CNN\n“A lot of people who go into prison straight, and when they come out they’re gay.”\nHomosexuality is a choice, just look at the prisons, Carson said on CNN.\nIn a March 4 interview, the likely 2016 presidential contender said he believes that legalizing same-sex marriage is a decision that should be left to the states. He also argued that homosexuality is a choice, rather than biological.\n“Because a lot of people who go into prison go into prison straight — and when they come out, they’re gay. So, did something happen while they were in there? Ask yourself that question,” said Carson, a former head of pediatric neurosurgery at Johns Hopkins Hospital.\nWe’ll jump to the point here: There is no conclusive evidence to support Carson’s claim that “a lot of people” make a switch from heterosexual to homosexual while in prison. Further, the medical community tends to conclude that homosexuality is not a matter of choice — notably the American Psychological Association.\n“Dr. Carson’s contention has a political intent but is absent of awareness of research on human sexuality,” said Mark Fleisher, a social science professor at Case Western University, who studies sexuality and violence in prisons.\nWe rated Carson’s claim False. After we published the fact check, Carson apologized for his comments and said in part: “I do not pretend to know how every individual came to their sexual orientation.”","url":"https://www.ajc.com/news/state--regional-govt--politics/neurosurgeon-carson-cuts-his-own-path-pursuit-gop-nomination/tkqE2KwBSlEJIO0W6ra1qI/"}
