{"authors":[],"date_download":"2018-10-22 22:53:11","date_modify":"2018-10-22 22:53:11","date_publish":"2014-06-11 10:16:48","description":"Democrats in the Silver State chose \"none of these candidates\" as the most popular option in a primary for governor.","filename":"data/vaneerConsumption/NevadaDemocratsChoseNoneofTheseCandidatesinPrimary.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_24/501316/140611-nevada-primary-election-639a_111903b2181e9f06a663bd1a89cfeeb4.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/politics_elections_nevada-democrats-chose-none-these-candidates-primary-n128166_1540248791.html","title":"Nevada Democrats Chose 'None of These Candidates' in Primary","title_page":"Nevada Democrats Chose 'None of These Candidates' in Primary","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nElections have historically been defined by their winners and losers - but on Tuesday a primary in Nevada returned a disheartening result for all the candidates: nobody won.\nVoters in the state's Democratic primary for governor were so unimpressed by the eight men on offer that the most popular option on the ballot paper was \"none of these candidates,\" which received 30 percent of the vote, according to figures from The Associated Press.\nSign up for breaking news alerts from NBC News\nDemocrat activists in the state acknowledged earlier this year that they had failed to find a credible challenger to face incumbent Republican Gov. Brian Sandoval, according to Politico. And it clearly showed at the polling stations, with more than 21,000 people turning out with the express purpose of saying \"no thanks\" to the sum total of their party's would-be governors.\nIf voters did in fact want an empty seat instead of a challenger to face Sandoval they will be disappointed: In second place behind \"none of these candidates\" was Robert Goodman, a man who has run twice before and this time received 25 percent of the vote. State law means he will be the Democratic candidate.\nAside from failed 2012 House candidate Stephen Frye, who won 11 percent of the vote, no other candidates got into double digits. Unsurprisingly, this was the source of great amusement on Twitter as the results rolled in.","url":"https://www.nbcnews.com/politics/elections/nevada-democrats-chose-none-these-candidates-primary-n128166"}
