{"authors":[],"date_download":"2018-10-30 00:55:22","date_modify":"2018-10-30 00:55:22","date_publish":"2016-10-19 00:11:53","description":null,"filename":"data/vaneerConsumption/NevadaESARulingIsaWininMoreWaysthanOne.json","image_url":"https://39uhx2trii4zt1im-zippykid.netdna-ssl.com/wp-content/uploads/2016/10/NPLD_2012_-_Nevada_9391758928.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/spectator.org/__1540860922.html","title":"Nevada ESA Ruling Is a Win in More Ways than One","title_page":"Nevada ESA Ruling Is a Win in More Ways than OneThe American Spectator","title_rss":"NULL","source_domain":"spectator.org","text":"The Nevada Supreme Court’s September ruling declaring education savings accounts (ESAs) constitutional is great news for students in the Silver State and for students across the country as well.\nNevada’s ESA program, enacted in 2015 and launched in 2016, grants to parents access to most (and in some cases all) of the money allocated for their child’s public education. Parents can spend ESA funds on learning alternatives such as private school tuition, textbooks, learning therapies, and tutoring. Unlike many other school choice programs currently in existence, Nevada’s ESA program is “universal,” which means nearly all (96 percent) students in the state are eligible. The only requirement is students must have attended a Nevada public school for at least 100 days before qualifying for the state’s ESA.\nTwo challenges to the program’s constitutionality led to its suspension soon after it was implemented, but the Nevada Supreme Court’s ruling will result in the removal of the suspension if the state’s legislature finds a different way to fund the program.\n“The funding violation is unique to Nevada, due to the way education funding is mandated by the state constitution,” said Michael Schaus, communications director at the Nevada Policy Research Institute, in an interview I conducted with him. “This ruling affirms the concept of broad-based educational choice as constitutional — a very positive win for other states that are looking for precedent.”\nThere will continue to be challenges to school choice programs across the country, of course; the ruling will do little to stop unions from using whatever power they have to keep kids in traditional public schools that are closest to home — even if that means children are forced to attend decrepit, poorly run, and/or dangerous schools.\nFor instance, Florida’s tax credit scholarship program is one of the nation’s largest and most successful. A record-breaking 92,000 low-income students are taking advantage of the program this year, and data show minority students benefit more from this reform than other students in the state. But despite the program’s achievements, the state’s largest teachers union has fought it tooth-and-nail. It announced it September, after losing again in court, it has decided to appeal the case, which is meant to destroy the scholarship program, to the state’s Supreme Court.\nPrecedents, while not foolproof, are powerful tools school choice advocates can use when defending educational choice programs in court, making the Nevada case a big victory for proponents of liberty across America. But precedents shouldn’t be the only focus of this important story. More than 8,000 students have applied to receive an ESA in Nevada. Assuming the legislature fixes the funding problem the court took issue with, scores of students will be able to access better schools.\nRobert Holland, a Heartland Institute senior fellow, has called attention to a report issued by the U.S. Government Accountability Office (GAO), which found, “Participation in voucher and education savings account (ESA) programs, which fund private school tuition and other educational expenses, has more than doubled in the past 5 years.\n“GAO’s rounded numbers showed an enrollment expansion from 70,000 to 147,000, with funds provided for the students increasing from $400 million to $859 million,” Holland writes. “This growth, noted GAO, resulted both from the creation of new school choice programs and expansion of existing ones.”\nIf GAO’s numbers are accurate, and all the well-researched evidence suggests they are, the Nevada ruling has real value beyond serving as an example to other courts: It could help to dispel the myth advanced incessantly by anti-choice liberals that states confidently, “School reform is dead,” while also opening the gateway for school choice to flourish as it is meant to.\nParents and their children are increasingly embracing ESAs, and they do this for one simple reason: They work. A 2013 survey of Arizona ESA families found all parents using education savings accounts were satisfied with their experience. It’s almost certain we’ll see a similar surge of happy ESA families in Nevada, and if we don’t because families find they don’t like having education freedom and ESAs aren’t fulfilling their needs, families will stop using them, and teachers unions and their allies will be placated.\nInstead of trying to use foolish and costly legal tactics to prevent parents from doing what they believe is right for their kids, anti-choice zealots should let school choice programs fail or succeed on their own. If traditional government school advocates are truly confident education choice programs will fail, as they say they are, they shouldn’t have anything to worry about.","url":"https://spectator.org/nevada-esa-ruling-is-a-win-in-more-ways-than-one/"}
