{"authors":["Bryan Logan"],"date_download":"2018-10-30 22:01:13","date_modify":"2018-10-30 22:01:13","date_publish":"2016-12-15 00:00:00","description":"Gov. Brian Sandoval has been a strong supporter of the mysterious electric-car startup since it chose a site in North Las Vegas to build its $1 billion factory.","filename":"data/vaneerConsumption/NevadasgovernorlightsupFaradayFuturesnaysayersinascathingstatement.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_faraday-future-nevada-governor-treasurer-statement-2016-12_1540936873.html","title":"Nevada's governor lights up Faraday Future's naysayers in a scathing statement","title_page":"    Nevada's governor lights up Faraday Future's naysayers in a scathing statement - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Nevada Gov. Brian Sandoval. AP Photo/David Becker, File Nevada Gov. Brian Sandoval has some words for people who are questioning Faraday Future, the mysterious electric-car startup that wants to build a $1 billion factory in North Las Vegas.\nIn a joint statement issued by the governor's office and North Las Vegas Mayor John Lee earlier this month, Sandoval went after state treasurer, Dan Schwartz, who has been Faraday Future's most vocal detractor.\n\"It is unclear whether or not the Treasurer has read the legislation or understands the agreement between Nevada and Faraday Future, but the state and taxpayers are fully protected should Faraday not meet its $1 billion investment,\" the statement, dated December 1 and viewed by Business Insider, reads.\n\"Although the Treasurer appears to expect failure, I have always planned for success,\" it continued.\nSchwartz, in multiple conversations with Business Insider has expressed doubt that Faraday Future's primary investor, Jia Yueting, had the financial means to shepherd the upstart from concept to a functioning operation.\n\"I think Mr. Jia built a bridge too far,\" Schwartz told Business Insider in a conversation earlier this month.\nGov. Sandoval disagrees. His statement continues: \"We fully vetted the project, its financing, and pursued the opportunity. The state continues to communicate with Faraday and the company has spent more than $100 million in development related to the site, which includes payments to local businesses and contractors.\"\nHowever, when you add to the mix some unpaid debts, a work-stoppage at the company's inaugural plant in North Las Vegas, and production deadlines that are in flux, the skepticism meter starts to peak.\nFor its part, Faraday Future has insisted the bills will be paid, the factory will be built, and the cars will be produced, but, so far, there is precious little to inspire confidence, outside of a handful of teaser videos and images ahead of the company's second debut at the Consumer Electronics Show next month.","url":"https://www.businessinsider.com/faraday-future-nevada-governor-treasurer-statement-2016-12"}
