{"authors":["Joseph Murray"],"date_download":"2018-10-30 22:18:47","date_modify":"2018-10-30 22:18:47","date_publish":"2016-06-04 17:18:23","description":"Before the Libertarian Party threatens Donald Trump, it must get its own house in order and contend with the influx of Anti-Trump Republicans.","filename":"data/vaneerConsumption/NeverTrumpDenialLibertarianPipeDreams.json","image_url":"https://media.breitbart.com/media/2016/06/Never-Trump-bumper-sticker.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2016_06_04__1540937927.html","title":"#NeverTrump Denial & Libertarian Pipe Dreams","title_page":"#NeverTrump Denial & Libertarian Pipe Dreams","title_rss":"NULL","source_domain":"breitbart.com","text":"Lyin’ Ted couldn’t stop Donald Trump. Little Marco failed miserably. Low-energy Jeb didn’t even raise his fists.\nBut for a #NeverTrump GOP establishment stalled in the denial stage of their grief, the Libertarian Party is offering a siren song of seduction.\n“We are seeing record interest in the party,” Carla Howell, the national Libertarian Party’s political director, told Politico days before her party’s nominating convention in Orlando. “Membership has spiked; it has gone up about 30 percent in the last few months.”\nThe Politico article also reports that some noteworthy GOP operatives, such as Mary Matalin, are defecting to the Libertarian Party. The conclusion is that the Libertarian Party might do to Trump what the Reform Party did to George H.W. Bush.\nBut the establishment exodus is not a sign of troubles ahead for Trump, but rather a necessary purging. Trump is merely reclaiming a party that was overrun by neoconservatives who trace their origins back to the Democrat Party. These neocon squatters came to the GOP disenchanted with George McGovern – the anti-war 1972 Democratic presidential nominee – and never left.\nSince their hostile takeover, neoconservatives have rejected the counsel of John Adams and “gone abroad in search of monsters to destroy.” Where Teddy Roosevelt proclaimed, “Thank God I am not a free trader,” neoconservatives have embraced the utopian trade policies of Democrat Woodrow Wilson.\nThe fact is that the neoconservatism is not steeped in the experience of the four men on Mount Rushmore, nor is it a part of the GOP tradition. Rep. Paul Ryan may try and claim the moral mantle of Republicanism, but his brand is one that perverts traditional conservatism.\nSo if these individuals feel a disdain for a Trump campaign that is restoring Republicanism, their departure is not a loss. And the fact they are fleeing to the Libertarian Party merely demonstrates that these Republican refugees are without power, authority, and influence.\nWhat exactly does the Libertarian Party (not to be confused with libertarianism) have to offer these exiles or America? It has a vice presidential candidate who thinks that enforcing immigration laws is the same as Hitlerism. Then there is the national chairman hopeful who decided to strip naked, while on television, during the national convention.\nThe man atop the ticket, former New Mexico Gov. Gary Johnson, is a pot connoisseur who told the Daily Caller in March that he had consumed marijuana edibles just weeks before the interview. If Johnson loves pot on the campaign trail, will Mary Jane be his chief of staff?\nPushing aside the fact that the Libertarian Party resembles one of the three rings at Ringling Brothers, the party is marginal at best. The party’s website shows that its “elected officials” are at the very bottom of the political food chain.\nHere is a sampling of the party’s elected officials: a constable in Arkansas, some city councilmen in California, a water and sanitation member in Colorado, a school board member in Minnesota, and a mayor in Texas. Not exactly a great record for a party that has been around for four decades.\nCan we really say that this is a party that should be taken seriously on the national stage? Or, better yet, should be taken seriously period?\nThe party’s royal family, the Ron Paul clan, has only had political success running as Republicans, not Libertarians. Both Ron and Rand have brought Libertarian ideals to the GOP and, in doing so, have done more to advance the cause of liberty than the entire Libertarian Party.\nMake no mistake; aspects of libertarianism are positive and prudent, but the Libertarian Party has serious issues that have nothing to do with ideology. The Orlando striptease is just the tip of the iceberg.\nAnd the fact that rejected Republicans are treating it as Syrians are treating Europe will only add to the party’s woes. Just look what happened when Pat Buchanan moved to the Reform Party in 2000. Trump has nothing to worry about.\nBut for those Republican refugees seeking amnesty in the party this election cycle, one can only hope Johnson is generous with his brownies.\nJoseph R. Murray II is a conservative commentator, former campaign official for Pat Buchanan, and author of Odd Man Out. He can be reached at jrm@joemurrayenterprises.com.","url":"https://www.breitbart.com/politics/2016/06/04/nevertrump-denial-libertarian-pipe-dreams/"}
