{"authors":[],"date_download":"2018-10-30 20:37:57","date_modify":"2018-10-30 20:37:57","date_publish":"2015-07-18 20:32:41","description":"The Gwinnett County Marine veteran recovering from her battle with a flesh-eating bacteria recently underwent additional amputations, her husband announced Friday.","filename":"data/vaneerConsumption/NewamputationsforGwinnettwomanfightingflesheatingbacteria.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p6/AJC/2015/07/18/Images/photos.medleyphoto.7698820.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_new-amputations-_bf5beb04415b580c06781ca08e779486__1540931877.html","title":"New amputations for Gwinnett woman fighting flesh-eating bacteria","title_page":"New amputations for Gwinnett woman fighting flesh-eating bacteria","title_rss":"NULL","source_domain":"ajc.com","text":"The Gwinnett County Marine veteran recovering from her battle with a flesh-eating bacteria recently underwent additional amputations, her husband announced Friday.\nCindy Martinez has been hospitalized since Memorial Day, when her husband David — a Gwinnett County police officer — took her to Gwinnett Medical Center and the couple learned that she had contracted necrotizing fasciitis. Martinez has generally been considered “stable” but, on June 25, she had both feet and her right hand amputated.\nOn Friday, David Martinez wrote on Facebook that his wife had undergone additional surgeries — both legs have now been amputated just below the knee, and the right arm has now been amputated above the elbow, he wrote.\nThe fingers on Cindy Martinez’s left hand have now been removed as well.\n“All the amputations appear to be healing,” David Martinez wrote, “but she is still being monitored closely.”\nWhat may have necessitated the additional amputations was unclear. Martinez said his wife was recently transferred to a hospital in Augusta, where she is in the intensive care unit.\n“She currently has limited use of the left hand,” he wrote. “The next step for Cindy would be a rehabilitation center to learn basic movements and functions.”\nA fundraiser for the Martinezes was held Saturday night at Hebron Baptist Church in Dacula. The event raised more than $12,600, Channel 2 Action News reported.\nAs of Saturday afternoon, an online fundraising page had collected more than $87,000 in donations for the family.\nCindy and David Martinez are both former Marines. They have a 5-year-old son and 2-year-old daughter.","url":"https://www.ajc.com/news/local/new-amputations-for-gwinnett-woman-fighting-flesh-eating-bacteria/HymG9kcLUaefUTxtmtLwaL/"}
