{"authors":[],"date_download":"2018-10-22 21:19:50","date_modify":"2018-10-22 21:19:50","date_publish":"2014-06-04 19:39:36","description":"The Xbox One will soon be home to dozens more apps for you to play with, including lots of options for streaming the latest shows and games.","filename":"data/vaneerConsumption/NewAppsComingtoXboxOneHBOGoTwitterVevoandMore.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_23/487771/24_b92f72cf47ce87afad8b5b38cd392c57.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gadgets_new-apps-coming-xbox-one-hbo-go-twitter-vevo-more-n122766_1540243190.html","title":"New Apps Coming to Xbox One: HBO Go, Twitter, Vevo and More","title_page":"New Apps Coming to Xbox One: HBO Go, Twitter, Vevo and More","title_rss":"NULL","source_domain":"nbcnews.com","text":"The Twitter app will integrate with TV viewing, so you can watch discussions of and reactions to shows or games live. Unfortunately, it doesn't look like you'll be able to see reactions to, say, a horrifying scene from \"Game of Thrones\", since the Twitter integration shown only works with cable and satellite, not streaming apps. A Microsoft representative told NBC News they'd have more specific details on this feature later.\nYou'll be able to peruse Vine videos, watch an NBA or NHL game, or stream shows from a number of networks that have their own apps — MTV, ABC, FX, and so on. There are plenty of similar options for Xbox One owners in Europe, Russia, and other regions, too.\nThis will put the app total well above that of rival PlayStation 4 — although Sony has been vocal about the fact that its console is focused on games rather than media.\nWhen will this app bonanza take place? Microsoft is only saying \"by the end of this holiday season,\" which isn't very helpful. You can expect at least a few this summer, though, a Microsoft representative confirmed via email.","url":"https://www.nbcnews.com/tech/gadgets/new-apps-coming-xbox-one-hbo-go-twitter-vevo-more-n122766"}
