{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 22:17:00","date_modify":"2018-10-30 22:17:00","date_publish":"2015-11-03 13:23:57","description":"A newly-introduced ballot initiative seeks to eliminate sanctuary cities in California by implementing federal law at the state level.","filename":"data/vaneerConsumption/NewBallotInitiativetoEndCaliforniasSanctuaryCities.json","image_url":"https://media.breitbart.com/media/2015/09/Sanctuary-city-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_11_03__1540937820.html","title":"New Ballot Initiative to End California's Sanctuary Cities","title_page":"New Ballot Initiative to End California's Sanctuary Cities","title_rss":"NULL","source_domain":"breitbart.com","text":"A newly-introduced ballot initiative seeks to eliminate sanctuary cities in California by implementing federal law at the state level.\nThe initiative, emtitled “Davis-Oliver and Kate’s Law, Protecting Americans,” was sent to Attorney General Kamala Harris for approval for signature collection.\nThe referendum will require law enforcement officials to cooperate with the Department of Homeland Security in several ways, including notifying them about detainers calling for the surrender of criminals to federal authorities.\nThe issue of sanctuary cities has received a significant amount of attention following the July shooting death of Kate Steinle in San Francisco by five-time deportee and seven-time convicted felon Juan Francisco Lopez-Sanchez. Lopez-Sanchez indicated that he had come to San Francisco partly because of its sanctuary city policy.\nThe city’s sanctuary city policies enabled now-embattled San Francisco Sheriff Ross Mirkarimi’s department to refrain from notifying Immigration and Customs Enforcement (ICE) when Lopez-Sanchez was released in March, in spite of an ICE hold filed against Lopez-Sanchez that same month.\nThe new initiative would require local law enforcement to notify the Secretary of Homeland Security “with identifying information” about every illegal alien with questionable status in the State of California. It would also require that authorities be notified “in a timely manner” so that it can be determined whether an individual is a candidate for deportation from the United States.\nA poll that was recently released by the Institute of Governmental Studies (IGS) at the University of California Berkeley found that Democrats (73%), Republicans (82%) and independents (71%) all oppose sanctuary city policies. The poll also suggested that 74 percent of participants believe local authorities should be required to abide by a federal request to hold a detained person who is in the country illegally.\n“A strong majority of respondents made it clear that local authorities should not be able to ignore a federal request to hold an undocumented immigrant,” IGS Director Jack Citrin, who is a professor of political science at Berkeley and immigration expert, said of the findings.\nFollow Adelle Nazarian on Twitter @AdelleNaz and on Facebook.","url":"https://www.breitbart.com/politics/2015/11/03/new-ballot-initiative-end-californias-sanctuary-cities/"}
