{"authors":["Lucy Mapstone For Mailonline"],"date_download":"2018-10-23 02:36:10","date_modify":"2018-10-23 02:36:10","date_publish":"2016-01-11 14:58:55","description":"Set in 1973 in the midst of the political uprising in Chile, Colonia tells the tale of a young woman who is desperate to find her husband after he's kidnapped by General Pinochet's secret police.","filename":"data/vaneerConsumption/NewColoniatrailershowsEmmaWatsonandDanielBrhlindulgeinpassionatedisplay.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/15/300BA53600000578-0-image-a-27_1452526877962.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393981_Emma-Watson-indulges-passionate-display-Daniel-Br-hl-roll-bed-new-trailer-dark-thriller-Colonia_1540262170.html","title":"New Colonia trailer shows Emma Watson and Daniel Brühl indulge in passionate display","title_page":"New Colonia trailer shows Emma Watson and Daniel Brühl indulge in passionate display | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Emma Watson is going far to prove she's not the goody-two shoes Harry Potter character Hermione Granger any more.\nThe 25-year-old actress appears in the brand new trailer for her forthcoming hard-hitting film Colonia, clearly showing how far she's come since her younger days as she puts on a magnificent display in the teaser.\nBased on true events and set in 1973 in the midst of the political uprising in Chile, Colonia tells the tale of a young woman who is desperate to find her husband after he's kidnapped by General Augusto Pinochet's secret police.\nScroll down for video\nPassionate: Emma Watson and Daniel Brühl put on a passionate display as husband and wife in the brand new trailer for Colonia\nEmma's character Lena must track down Daniel - played by Rush star Daniel Brühl - who has been taken to the Colonia Dignidad, a cult in a sealed-off commune, which she decides to join in order to rescue him.\nHowever, in the midst of the gripping politically-charged trailer, the most eye-catching scene shows Emma and Daniel rolling around in bed together in the throes of romance.\nApproaching Daniel in the kitchen, Emma's character Lena sneaks in to take a photograph of him as he cooks in the nude, covered in just an apron.\nHarry Potter days are over: The 25-year-old actress is known to have several romantic scenes with her co-star in the hard-hitting thriller, putting her Hermione Granger days behind her\nCheeky! The scene begins when Emma - who plays Lena - walks in on her on-screen husband cooking in the nude\nGreat look: Rush star Daniel - who plays a character also called Daniel - is then seen preparing to playfully chase his wife\nRolling around: Lena and Daniel indulge in a very tactile romantic display on the bed\nHe then chases her out of the room and onto the bed, where they indulge in a romantic kiss on the bed, hinting that more happens in the full scene.\nEmma looks gorgeous as she wears nothing but an oversized white men's shirt, her brunette locks swept up into a messy bun, looking the epitome of a relaxed lover as they fool around.\nBut the trailer quickly takes a dark and dramatic turn as it becomes apparent that Daniel is in deep water as he's taken away by the authorities.\nSteamy: Laying down together on the bed, they then proceed to kiss\nTrouble brewing: Set in 1973 in the midst of the political uprising in Chile, Colonia tells the tale of a young woman who is desperate to find her husband after he's kidnapped by General Augusto Pinochet's secret police\nWill she rescue him? Lena has to save her husband after he's kidnapped by dictator Augusto Pinochet's secret police\nThe film is directed by Oscar-winner Florian Gallenberger and is based on the true story of a German woman whose boyfriend was kidnapped by dictator Augusto Pinochet's secret police.\nColonia sees Lena and Daniel become entangled in a Chilean military coup against Pinochet, before Daniel is abducted by the police force, National Intelligence Directorate (DINA).\nDetermined Lena tracks her spouse down to Colonia Dignidad, a commune masquerading as a charitable mission, however does not release its residents become part of a cult after they enter.\nThe new trailer for the movie - which premiered at the Toronto Film Festival in September - also shows Lena's communication with Colonia Dignidad's leader Paul Schäfer, played by Michael Nyqvist.\nFilming for the movie began in Luxenbourg in October 2014 and was later shot in Munich, Berlin and Buenos Aires.\nGlobal release dates are yet to be confirmed however the film is set to air in Germany in February 2016.\nChilling: Scenes involve Daniel being stolen away in the night and taken to an unbreakable commune, Colonia Dignidad\nHaunting: The brand new trailer also shows Lena's communication with Colonia Dignidad's leader Paul Schäfer, played by Michael Nyqvist","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393981/Emma-Watson-indulges-passionate-display-Daniel-Br-hl-roll-bed-new-trailer-dark-thriller-Colonia.html"}
