{"authors":[],"date_download":"2018-10-23 05:42:37","date_modify":"2018-10-23 05:42:37","date_publish":"2016-01-29 21:35:27","description":"New allegations surfaced Friday of child sexual abuse in the Central African Republic involving UN peacekeepers as well as troops serving in a European missi...","filename":"data/vaneerConsumption/NewclaimsofchildsexabusebypeacekeepersinCAfrica.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-doc-7h8m2-3bmscybNe842cce83474b5a20b4d-341_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3422464_UN-says-new-claims-child-abuse-foreign-troops-C-Africa_1540273357.html","title":"New claims of child sex abuse by peacekeepers in C. Africa","title_page":"New claims of child sex abuse by peacekeepers in C. Africa | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"New claims of child sex abuse by peacekeepers in C. Africa\nNew allegations surfaced Friday of child sexual abuse in the Central African Republic involving UN peacekeepers as well as troops serving in a European mission and in France's Sangaris operation.\nUN rights chief Zeid Ra'ad al-Hussein described the latest claims to come to light as \"extremely serious allegations\" and said it was \"crucial that these cases are thoroughly and urgently investigated.\"\nThe new cases linking EU and French troops are said to date to 2014 but have only been discovered in recent weeks as a result of a UN investigation.\nUnited Nations peacekeepers patrol on January 2, 2016 in Bangui ©Issouf Sanogo (AFP/File)\nThe allegations against UN peacekeepers mostly date back to last year and in a first, the United Nations revealed the nationalities of the troops involved.\nThey are from Bangladesh, the Democratic Republic of Congo, Morocco, Niger and Senegal.\nThere has been a wave of allegations against UN peacekeepers serving in the Central African Republic, but the latest probe brought to light possible crimes committed by European Union (EUFOR) forces.\nTwo girls said they were raped by EUFOR soldiers, while two others said they were paid to have sexual relations with other EUFOR soldiers, a UN statement said.\nThe four were aged between 14 and 16 at the time.\nThree girls told UN investigators that they believed their abusers were from Georgia.\nIn Brussels, an EU source said the allegations were \"totally unprecedented\" for an EU mission.\nSome 150 Georgian soldiers were deployed with the EUFOR contingent, which at its peak counted some 700 soldiers sent to Bangui to help restore order.\nReacting to the allegations, EUFOR said in a statement that \"the EU takes these allegations very seriously.\"\nGeorgia's defence ministry said it would \"do everything possible to ensure that those individuals committing such crimes are held responsible.\"\n- Sex for cookies -\nUN staff also interviewed two children allegedly abused in 2014 by soldiers from the French Sangaris force.\nThe girl and boy were aged seven and nine respectively at the time.\n\"The girl said she had performed oral sex on French soldiers in exchange for a bottle of water and a sachet of cookies.\n\"Both she and the nine-year-old boy said that other children were abused in a similar fashion in repeated incidents involving several French soldiers,\" the statement said.\nThe six cases of alleged abuse by foreign troops took place at a sprawling camp for displaced people at M'Poko, near Bangui's airport.\nFrench soldiers serving in the Sangaris force are already being investigated in France over allegations that they forced children in CAR to perform sexual acts in exchange for food.\nOn Friday, Defence Minister Jean-Yves Le Drian ordered a fresh probe following the latest allegations.\n- New claims against UN peacekeepers -\nIn the latest wave of allegations facing the troubled UN mission in the Central African Republic, eight soldiers and two police were accused of having sex with minors.\nFour of the soldiers are from Niger, two from Bangladesh, one from Morocco and one from the Democratic Republic of Congo, along with two police from Senegal.\nThe latest claims bring to 22 the number of cases of sexual abuse involving peacekeepers from the UN mission in the Central African Republic.\nThe new cases follow a hard-hitting report released last month that found the United Nations had grossly mishandled allegations of child sex abuse in CAR.\nUN Secretary-General Ban Ki-moon fired the head of the 10,000-strong MINUSCA force last year over the mounting number of cases, but the allegations have continued to surface.\nUN spokesperson Rupert Colville (L) and Interim Director of the UN Information Service in Geneva, Ahmad Fawzi, brief the press on new claims of child abuse by foreign troops in Africa, on January 29, 2016 in Geneva ©Fabrice Coffrini (AFP)\nUnited Nations High Commissioner for Human Rights Zeid Ra'ad Al Hussein said UN human rights staff interviewed two children who were allegedly abused in 2014 by soldiers from the French Sangaris force ©Fabrice Coffrini (AFP/File)","url":"https://www.dailymail.co.uk/wires/afp/article-3422464/UN-says-new-claims-child-abuse-foreign-troops-C-Africa.html"}
