{"authors":["Simon Jones For Mailonline"],"date_download":"2018-10-23 02:35:54","date_modify":"2018-10-23 02:35:54","date_publish":"2016-01-11 14:54:44","description":"Newcastle have opened talks with Bordeaux over the transfer of winger Henri Saivet. The 25-year-old is due on Tyneside with his agent as the clubs try to complete a £4.5million deal.","filename":"data/vaneerConsumption/NewcastlereachagreementwithBordeauxsHenriSaivetinlatesttransfernews.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300A63F800000578-0-image-a-37_1452523898011.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3394016_Newcastle-reach-agreement-Bordeaux-Henri-Saivet-4-5million-deal-set-French-winger-St-James-Park_1540262154.html","title":"Newcastle reach agreement with Bordeaux's Henri Saivet in latest transfer news","title_page":"Newcastle reach agreement with Bordeaux's Henri Saivet in latest transfer news | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Newcastle have opened talks with Bordeaux over the transfer of winger Henri Saivet.\nThe 25-year-old is due on Tyneside with his agent as the clubs try to complete a £4.5million deal.\nIt could prove a busy week for the St James' Park club as they continue to press for the £10m transfer of Jonjo Shelvey from Swansea too.\nNewcastle are expecting a busy few weeks with Bordeaux winger Henri Saivet set to spark a transfer splurge\nThe 25-year-old scored for Bordeaux against Liverpool in the Europa League group stage earlier this season\nBordeaux have a verbal agreement in place to sell Saivet for £4.5m with a further £730,000 following based on appearances.\nNewcastle are putting themselves in a better position than rivals as they are willing to pay the majority if not all of the transfer fee in one go as opposed to over a number of years.\nAnd Bordeaux coach Willy Sagnol confirmed an agreement has been reached with the Premier League club at his press conference on Monday.\nSagnol said: 'Newcastle and Bordeaux have reached an agreement for the sale of Henri Saivet. Saivet has been the most important player of the first six months of this season.\nNewcastle manager Steve McClaren will hope Saivet is the first of many this January transfer window\nEmmanuel Riviere (right) and Cheick Tiote (left) share a joke on the training pitch ahead of the midweek game\n'He wanted to leave the club as he was in need of a new challenge. He's been here for a while. I've given him my blessing to leave.'\nBordeaux midfielder Wahbi Khazri added: 'Henri's depart will have an impact. He's a good player but it will give others the chance to step forward and take their chance.'\nMagpies boss Steve McClaren admitted Saivet is on Tyneside having a medical and discussing terms, saying on Monday: 'We are just waiting for the outcome.'\nSiem de Jong walks outside during the first-team training session ahead of the game with Manchester United\nYoan Gouffran looks on during training while Jack Colback is challenged by Ayoze Perez during a match\nThe club are also close to the signature of Swansea's unsettled England midfielder Shelvey. The 23-year-old, who has fallen out of favour with Swans interim boss Alan Curtis, has told friends he's ready to sign a five-year deal at St James' Park.\nThe two clubs are expected to tie up the details of the transfer fee this week, and Shelvey is already set on the idea of working for former England manager McClaren.","url":"https://www.dailymail.co.uk/sport/football/article-3394016/Newcastle-reach-agreement-Bordeaux-Henri-Saivet-4-5million-deal-set-French-winger-St-James-Park.html"}
