{"authors":["Press Association"],"date_download":"2018-10-23 00:39:29","date_modify":"2018-10-23 00:39:29","date_publish":"2017-04-26 10:29:42","description":"The managing director was one of several men held during raids by tax authorities in the UK and France, a source confirmed.","filename":"data/vaneerConsumption/NewcastleUnitedbossLeeCharnleyheldintaxprobe.json","image_url":"https://i.dailymail.co.uk/1/2017/04/26/19/wire-467305-1493232554-88_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4446960_Several-arrested-soccer-tax-fraud-probe_1540255169.html","title":"Newcastle United boss Lee Charnley held in tax probe","title_page":"Newcastle United boss Lee Charnley held in tax probe | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Newcastle United boss Lee Charnley has been arrested by officials investigating a suspected income tax and national insurance fraud.\nThe managing director of the newly-promoted club was one of several men held during raids by tax authorities in the UK and France, a source confirmed.\nHM Customs and Revenue refused to name any of the people held in the raids and declined to comment on reports that West Ham United were also involved in the probe, but said premises in the north east and south east of England had been raided, as well as locations in France.\nHMRC have released a statement: pic.twitter.com/UGCGLjs1Mh — PA Dugout (@PAdugout) April 26, 2017\nBusiness and financial records, computers and mobile phones were also seized in the raids.\nIn a statement, the service said: “HMRC has arrested several men working within the professional football industry for a suspected income tax and national insurance fraud.\n“180 HMRC officers have been deployed across the UK and France today.\nLee Charnley, right\n“Investigators have searched a number of premises in the north east and south east of England and arrested the men and also seized business records, financial records, computers and mobile phones.\n“The French authorities are assisting the UK investigation, have made arrests and several locations have been searched in France.\n“This criminal investigation sends a clear message that, whoever you are, if you commit tax fraud you can expect to face the consequences.\n“As this is an ongoing investigation, HMRC is unable to provide any further detail at this time.”\nThe HMRC are cracking down on use of employee benefit trusts (Joe Giddens/PA)\nNewcastle United were promoted back to the Premier League earlier this week at the first time of trying.\nCharnley, 39, who became boss of the Mike Ashley-owned club three years ago, has been credited for keeping manager Rafa Benitez despite last season’s relegation from the Premier League.\nMeanwhile, a West Ham spokesman confirmed the club’s offices at the London Stadium were raided by HMRC officers.\nWest Ham United Football Club\nThey said: “The club is cooperating fully with HMRC to assist their enquiries. No further comment will be made at this time.”","url":"https://www.dailymail.co.uk/wires/pa/article-4446960/Several-arrested-soccer-tax-fraud-probe.html"}
