{"authors":["Press Association"],"date_download":"2018-10-23 05:40:04","date_modify":"2018-10-23 05:40:04","date_publish":"2016-01-11 18:32:19","description":"Mark Sampson has extended his contract as England Women head coach until 2019. The former Bristol Academy boss guided the Lionesses to third place at the Wor...","filename":"data/vaneerConsumption/Newcontractforenglandwomencoachmarksampson.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-P-f0e59830-de44-4dee-b1c4-67bb3c5a6f02-3WAQP5SaQH704788ebcf7e206cd6-423_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3393838_New-contract-England-Women-coach-Mark-Sampson_1540273204.html","title":"New contract for england women coach mark sampson","title_page":"New contract for england women coach mark sampson | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"New contract for England Women coach Mark Sampson\nMark Sampson has extended his contract as England Women head coach until 2019.\nThe former Bristol Academy boss guided the Lionesses to third place at the World Cup in Canada last summer.\nThe 33-year-old's new deal will include the 2019 World Cup campaign which will take place in France.\nMark Sampson led England Women to third place in last year's World Cup\n\"I am delighted to have agreed to continue working with the Lionesses through to the 2019 FIFA Women's World Cup,\" he told thefa.com.\n\"It is an honour and a privilege to manage such a fantastic group of people who represent their country with incredible pride and passion.\"\nSampson was appointed in December 2013 and, as well as helping England to their best-ever World Cup finish in 2015, they now sit fifth in the world rankings - their highest ever position.\nEngland have also won both of their Euro 2017 qualifying games so far and look well set to feature in the tournament in Holland next summer.\nSampson, who is shortlisted for FIFA Women's World Coach of the Year at tonight's Ballon d'Or awards in Zurich, added: \"We have all worked very hard over the last two years to improve both individually and collectively and our World Cup bronze medal highlights the progress this team has made.\n\"It was crucial post the World Cup that we worked hard to continue to grow the game and I am pleased, with the steps we have taken, we are ready to do just that.\"","url":"https://www.dailymail.co.uk/wires/pa/article-3393838/New-contract-England-Women-coach-Mark-Sampson.html"}
