{"authors":[],"date_download":"2018-10-22 20:43:38","date_modify":"2018-10-22 20:43:38","date_publish":"2014-06-02 23:06:57","description":"The White House's new carbon pollution rules would slash emissions from the power sector by 30 percent by 2030.","filename":"data/vaneerConsumption/NewCarbonRulesHeresHowStatesCouldBeForcedtoCutEmissions.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/482836/140602-carbon-emissions-1922_6ff2ea2ae2862db23d0c04d35785f5f1.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_new-carbon-rules-heres-how-states-could-be-forced-cut-n120756_1540241018.html","title":"New Carbon Rules: Here's How States Could Be Forced to Cut Emissions","title_page":"New Carbon Rules: Here's How States Could Be Forced to Cut Emissions","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIn a bid to stave off the dire effects of global warming on human health and the environment, the White House on Monday unveiled a new plan to slash carbon emissions from the power sector by 30 percent below 2005 levels by the year 2030.\n\"That's like cancelling out annual carbon pollution from two-thirds of all cars and trucks in America,\" Gina McCarthy, the administrator of the U.S. Environmental Protection Agency, said in announcing the new rules.\nJust how is the EPA going to make this happen?\nThe Obama administration's plan trumpets flexibility, leaving it up to the states to figure out just how they plan to slash power-sector emissions of the greenhouse gas largely responsible for human-caused global warming.\nSome states may choose to retrofit existing power plants with technology that increases their efficiency or sucks carbon dioxide from smokestacks. Others will retire old and inefficient coal-fired power plants in favor of natural gas-fired plants or other \"cleaner\" technologies such as nuclear, solar and wind.\nThe lowest hanging fruit just about everywhere is \"reducing demand for electricity in the first place,\" Kyle Aarons, a senior fellow with the Center for Climate and Energy Solutions, a Washington-based think tank focused on energy and climate change issues, told NBC News.\nHow can states stick to the coal plants they have?\nToday, the country's 600 coal-fired power plants generate about 40 percent of the nation's electricity. Reserves of the energy-dense rock are abundant and it remains inexpensive, so there's economic incentive to keep burning coal. To do so, however, will require those plants to become more energy-efficient.\nTechnology is available to increase plant efficiency by about one third, largely by increasing the pressure at which they produce the steam used to spin electricity-generating turbines, according to Charles Freeman, a research engineer at the Department of Energy's Pacific Northwest National Laboratory in Richland, Wash.\n\"However, the reality is that in order to make those changes and increase the efficiency of an older coal power technology, the extent of retrofit is usually quite significant such that the investment can approach the cost of putting a whole new plant in place,\" he told NBC News.\nWhat about sucking carbon dioxide out of smokestacks?\nAnother option is to scrub carbon dioxide from smokestacks before it is emitted to the air and bury it in the ground, a process known as carbon capture and storage. The problem is, \"carbon capture does not exist today,\" said Daniel Kammen, an energy policy expert at the University of California at Berkeley.\n\"We talk about it,\" he added. \"There are a lot of people who think it is going to be a big deal, but if you want to implement it today, it is not cost-effective.\"\nThat doesn't mean the technology won't be viable in the future.\nIn the meantime, noted Kammen, any plant today can burn biomass — woody waste products, for example — along with coal. That reduces the amount of coal needed to generate electricity and puts to use waste material that is readily available across the country.\n\"Across the country, there has been a large number of coal plants that have either been retired or have been announced for retirement because the economics are tougher just because of the natural gas.\"\nCan't natural gas also take up some of the slack?\nThe U.S. is currently awash in natural gas, thanks largely to newly accessible desposits in shale rock formations. This, in turn, has radically changed the energy marketplace.\n\"Across the country, there has been a large number of coal plants that have either been retired or have been announced for retirement because the economics are tougher just because of the natural gas,\" Carl Imhoff, who manages the electric infrastructure market for the Pacific Northwest National Laboratory.\nHe and other experts expect that trend to continue, and the new EPA rules could accelerate the retirements. Since gas-fired power plants emit about 50 percent less carbon dioxide than a coal-fired plant, the transition is often cast as a bridge to a cleaner energy future.\nThis is \"all good, but effectively the only way to really get to the long-term targets is to start replacing not only coal, but also gas with renewables,\" Kammen said.\nWhat about wind, solar and other renewables?\nAnd renewables, Kammen added, are indeed ready for the challenge, a sentiment echoed by the EPA's McCarthy, who noted that since 2009, \"wind energy in America has tripled and solar has grown tenfold.\"\nThe big hurdle facing the ramping up of renewables is their inherent intermittency — when the wind isn't blowing or the sun isn't shining, these sources aren't generating electricity. That means batteries or other technologies are required to store the energy until it is needed.\nKammen said storage is a long-term concern — something to worry about in 2020 or 2030, once renewables account for a higher fraction of the country's energy portfolio.\n\"In the immediate term, there really isn't a crisis at all. Investing in storage now is exactly what we want to do so that in, say, 2020, when we see a lot more renewables on the grid then we have other ways to store that energy,\" he said.\nOne strategy, he noted, is the encouragement of electric vehicle sales, whose car batteries can sell power back to the grid during peak demand.\nWhat's the role of energy efficiency in all of this?\nAccording to Aarons, across much of the country, using less electricity or getting more energy out of the fuel \"could definitely play a very big role\" in meeting the new goals. Energy efficiency will likely get its biggest push in coal states, which may see their electric rates rise due to the new rules.\n\"Those are the states where you are going to have a lot of opportunity to reduce your consumption, so you are using fewer kilowatt hours per month to offset those rise in rates,\" he explained.\nAccording to Kammen, becoming more energy-efficient is \"job one\" across the board — from the power plant to the lightbulb in the bathroom. The piece missing in the EPAs new rules: raising the price of carbon, such as through a carbon tax, as an incentive to invest in renewable energy.","url":"https://www.nbcnews.com/science/environment/new-carbon-rules-heres-how-states-could-be-forced-cut-n120756"}
