{"authors":["Press Association"],"date_download":"2018-10-23 00:33:20","date_modify":"2018-10-23 00:33:20","date_publish":"2017-04-26 10:19:22","description":"Nearly 200 officers from HM Revenue and Customs (HMRC) took part in the raids.","filename":"data/vaneerConsumption/NewcastleandWestHamraidedaspartofinvestigationintosuspected5mfraud.json","image_url":"https://i.dailymail.co.uk/1/2017/04/27/08/wire-470253-1493276978-525_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4446938_Tax-authorities-probing-suspected-tax-fraud-make-arrests-club-raids_1540254800.html","title":"Newcastle and West Ham raided as part of investigation into suspected £5m fraud","title_page":"Newcastle and West Ham raided as part of investigation into suspected £5m fraud | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"An Anglo-French investigation into suspected tax fraud in football has seen several men arrested in dawn raids at Newcastle United, West Ham and France.\nOfficers from HM Revenue and Customs (HMRC) also visited Premier League leaders Chelsea on Wednesday morning but no items were seized or arrests made.\nAnd according to local reports, French officials have arrested four football agents, with Marseille’s transfer dealings understood to be under investigation.\nHMRC have released a statement: pic.twitter.com/UGCGLjs1Mh — PA Dugout (@PAdugout) April 26, 2017\nNewcastle’s managing director Lee Charnley is so far the only confirmed arrest but Press Association Sport understands he has already been released without charge. It also believed there were no arrests made at West Ham.\nThe dramatic series of events, which appear to have taken everybody by surprise, started with reports of police raids at Newcastle’s St James’ Park and training ground and West Ham’s London Stadium.\nCLUB STATEMENT: Newcastle United has issued the following statementhttps://t.co/lSVHHrOq7A pic.twitter.com/7duE8up6Wm — Newcastle United FC (@NUFC) April 26, 2017\nSoon after, a spokesperson for HMRC confirmed that its officers, not police, had “arrested several men working within the professional football industry for a suspected £5million income tax and National Insurance fraud”.\nThe co-ordinated raids, across the UK and France, involved 180 officers, with investigators searching premises in the north east and south east of England and seizing computers, mobile phones and paperwork.\nWest Ham's London Stadium ( John Walton/PA)\nThe spokesperson continued: “This criminal investigation sends a clear message that, whoever you are, if you commit tax fraud you can expect to face the consequences.”\nA short statement from West Ham later confirmed their offices at the former Olympic stadium were raided but said the Premier League side was “cooperating fully” with the investigation.\nWest Ham statement: \"The Club is cooperating fully with HMRC to assist their enquiries. No further comment will be made at this time.” — Andy Sims (@AndyCSims) April 26, 2017\nA spokesman for Chelsea said: “In connection with its wider investigation, HMRC has requested certain information which the club will provide.”\nThere is no suggestion of any wrongdoing on the Stamford Bridge club’s part and Marseille, sixth in Ligue 1, have not replied to a PA Sport request for comment.\nNewcastle were the last of the English clubs to make a statement, waiting until the evening to confirm a “member of its staff has this morning been assisting HMRC with their inquiries”.\nNewcastle managing director Lee Charnley (Chris Ison/PA)\nThe club did not confirm it was Charnley who was detained but PA Sport understands this to be the case. The 39-year-old became Newcastle’s managing director three years ago, having quietly risen through the ranks at a club that has experienced considerable upheaval over the years.\nLike his boss, club owner Mike Ashley, Charnley rarely, if ever, speaks to the media but has been credited for keeping manager Rafael Benitez at the club despite last season’s relegation from the Premier League.\nThat disappointment looked like it was behind the club on Monday when Benitez’s men sealed promotion with a 4-1 win over Preston but today’s shock news will alarm fans once more.\nFrance’s National Financial Office released a statement, confirming arrests in the country: “This judicial operation to combat tax fraud, carried out jointly by the French and British authorities and supervised by two PNF magistrates, took several months to prepare and mobilised 32 investigators.”","url":"https://www.dailymail.co.uk/wires/pa/article-4446938/Tax-authorities-probing-suspected-tax-fraud-make-arrests-club-raids.html"}
