{"authors":["Craig Hope For Mailonline"],"date_download":"2018-10-23 05:51:09","date_modify":"2018-10-23 05:51:09","date_publish":"2017-04-26 17:08:11","description":"Newcastle’s long-standing links with agents, intermediaries and clubs in France, it would appear, is a key focus of the investigation into Income Tax and National Insurance fraud.","filename":"data/vaneerConsumption/NewcastleUnitedcouldbemadetopayforFrenchlinks.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3F9DD5B200000578-0-image-a-8_1493220189157.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_sportsnews_article-4448276_Newcastle-United-pay-French-links_1540273869.html","title":"Newcastle United could be made to pay for French links","title_page":"Newcastle United could be made to pay for French links | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"In January of 2013, Newcastle United raided the French transfer market and signed five players to help keep them in the Premier League.\nMore than four years on, however, it is the club’s St James’ Park stadium and training ground which are the target of the raids by HMRC officials.\nNewcastle’s long-standing links with agents, intermediaries and clubs in France, it would appear, is a key focus of the investigation into Income Tax and National Insurance fraud.\nHMRC officers were spotted at Newcastle United's training ground on Wednesday morning\nManaging director Lee Charnley has been arrested and his Tyneside home has also been raided.\nAnd all of this a little over 24 hours after they sealed promotion back to the Premier League. Supporters, quite rightly, are worried about the potential consequences for their team.\nA points deduction has been mooted, but, right now, no-one knows. Charges may or may not be brought and sanctions may or may not be imposed, we just do not know at this early stage.\nManaging director Lee Charnley (right) has been arrested and his home on Tyneside raided\nBut what we do know is that the football club, its players and supporters have been left reeling at a time which was supposed to be one of celebration.\nIt is Charnley who runs the club on a day-to-day basis and he is the bridge between manager Rafa Benitez and owner Mike Ashley. His absence - be it temporary or longer term - will be heavily felt in a practical sense. Indeed, it is Charnley who will probably have to sign-off the club statement confirming his own arrest - we were still waiting for that some six hours after the news broke.\nIn the wake of Monday’s 4-1 win over Preston, Benitez cast doubt on his own future with the Magpies. It is understood he was due to sit down with Charnley and Ashley following the season’s end and the Spaniard wants guarantees over investment and control of transfers. Those discussions may take on a different tone in light of Wednesday’s developments.\nCharnley is a key ally for Benitez and his arrest can only add to the current air of uncertainty around the club.\nSt James' Park was also targeted as HMRC confirmed they'd made 'several arrests'\nIt should, of course, be a time of great stability. Supporters are happy - they have a world-class manager and their team is heading back to the Premier League.\nBut, as ever with Newcastle United, controversy is only ever one day away. That proved to be the case quite literally this week given the timing of the raids and Charnley’s arrest on the back of a promotion party which extended in the early hours of Tuesday.\nOf those players who have featured this season, just one of them - Yoan Gouffran - arrived via a French club. He was one of the quintet brought in during the winter window of 2013 and one of 15 who have been signed from France in the past seven years, the period which HMRC’s investigation is thought to cover.\nSo while Newcastle's French connection may have quietened in the past couple of seasons, it could yet have serious consequences on their future.\nOf the players to play for United this season, only Yoan Gouffran arrived from a French club","url":"https://www.dailymail.co.uk/sport/sportsnews/article-4448276/Newcastle-United-pay-French-links.html"}
