{"authors":["Sami Mokbel For Mailonline"],"date_download":"2018-10-23 03:34:10","date_modify":"2018-10-23 03:34:10","date_publish":"2016-01-29 18:41:23","description":"Newcastle are interested in Atletico Madrid left-back Guilherme Siqueira. The Magpies have\nenquired about a potential loan switch until the end of the season.","filename":"data/vaneerConsumption/NewcastleinterestedinsigningGuilhermeSiqueriaandLucasOrbanforproblemleftbackpositionasclubalsohuntnewstriker.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/18/30B4CCD100000578-0-image-a-9_1454092751192.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_football_article-3423229_Newcastle-interested-new-left-backs-Guilherme-Siqueria-Lucas-Orban-Steve-McClaren-s-radar_1540265650.html","title":"Newcastle interested in signing Guilherme Siqueria and Lucas Orban for problem left-back position as club also hunt new striker","title_page":"Newcastle interested in signing Guilherme Siqueria and Lucas Orban for problem left-back position as club also hunt new striker    | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Newcastle are interested in Atletico Madrid left-back Guilherme Siqueira.\nThe Magpies have enquired about a potential loan switch until the end of the season.\nSteve McClaren wants to add a new left-back to his ranks and believes Siqueira fits the bill.\nNewcastle are interested in Atletico Madrid left-back Guilherme Siqueira (right)\nValencia left-back Lucas Orban (left) is also on the radar for Steve McClaren's struggling side\nNewcastle have also looked at Valencia left-back Lucas Orban.\nThe 26-year-old is an Argentina international and well known to Newcastle coach Ian Cathro who worked at Valencia as assistant to former manager Nuno.\nOrban joined Valencia from Bordeaux for £2.5million in 2014 but started out at River Plate. He can also play at centre-back and has made 12 appearances this season with his last coming in Valencia's 3-0 Copa del Rey win over Granada earlier this month.\nThey face competition though from other Premier League sides who are looking for cover at full-back and are talking to Orban's representatives.\nNewcastle are pushing hard to sign a striker before Monday's deadline and have opened discussions with Roma over a loan move for Ivorian striker Seydou Doumbia.\nThe clubs are close to finalising terms for a deal that could see him move permanently in the summer for £7m, and Doumbia is due to fly to England for talks on Saturday.","url":"https://www.dailymail.co.uk/sport/football/article-3423229/Newcastle-interested-new-left-backs-Guilherme-Siqueria-Lucas-Orban-Steve-McClaren-s-radar.html"}
