{"authors":[],"date_download":"2018-10-30 21:52:10","date_modify":"2018-10-30 21:52:10","date_publish":"2018-09-07 18:53:00","description":"The contract preserves CSX’s exclusive control over freight access but also reserves Georgia’s right to install passenger rail at a future date.","filename":"data/vaneerConsumption/NewCSXleaseaddressespassengerrailSilverComet.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/08/03/Images/newsEngin.22653695_trainfatal.0313-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-govt--politics_n_36ab6704de460475697e44e923c4e3a4__1540936330.html","title":"New CSX lease addresses passenger rail, Silver Comet","title_page":"New CSX lease addresses passenger rail, Silver Comet","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia’s State Properties Commission announced on Friday the signing of a new, 50-year lease agreement with CSX for the company’s continued use of the state-owned Western and Atlantic railroad.\nThe contract preserves CSX’s exclusive control over freight access but also reserves Georgia’s right to install passenger rail at a future date.\nThe implementation of passenger rail is subject to several caveats, including a prohibition on “high-speed” rail. The contract includes a stipulation that the introduction of passenger rail be subject to a “mutual agreement” between the state and the company on safety, planning and engineering.\nCSX also agreed to abandon more than two miles of unused rail to be converted into an extension of the Silver Comet Trail in exchange for $10.\nThe lease payments are expected to bring in about $1.2 billion over the next 50 years.\nThe company has agreed to pay $1 million a month starting in 2020, with rent payments increasing by 2.5 percent a year. CSX will also pay 50 percent of revenue from any subleases and third-party agreements.\nIn a written statement, State Rep. Teri Anulewicz praised the contract’s economic impact and the implications for extending Cobb’s greenways and transit options.\n“This is the critical first step in connecting the Comet and the Beltline,” she wrote. “I think it is very good to have all options, including passenger rail, on the table as we move transit and mobility discussions forward in Cobb, and in the region.”","url":"https://www.ajc.com/news/local-govt--politics/new-csx-lease-addresses-passenger-rail-silver-comet/CusA2GMHVV8QpwsP5s30uK/"}
