{"authors":[],"date_download":"2018-10-30 18:34:22","date_modify":"2018-10-30 18:34:22","date_publish":"2016-10-07 22:16:00","description":"The suspect admitted she was the PlentyOfFish user who went by the name Layla234567 and met the victim before his death.","filename":"data/vaneerConsumption/NewdetailsinDeKalbonlinedatingmurderofGwinnettman.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/10/06/Images/Collins,%20Jordan.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_detective-dekalb_ea64db26892127fc0d7ef104f30f632b__1540924462.html","title":"New details in DeKalb online dating murder of Gwinnett man","title_page":"New details in DeKalb online dating murder of Gwinnett man","title_rss":"NULL","source_domain":"ajc.com","text":"New details emerged Friday in the death of Jordan Collins, a 23-year-old Norcross father who died after meeting up with a woman he met on the popular dating app PlentyOfFish.\nDetective V.R. Van Hees of DeKalb County police testified in a preliminary hearing for Clarissa McGhee, who is charged with murder in the Sept. 1 crime outside Lithonia. The case had a “definite gang nexus\" and McGhee admitted she was the woman who’d met Collins while using the screen name Layla234567, Van Hees testified.\nPolice found that name in Collins’ cellphone after he was gunned down in an alleged robbery attempt, believed to have been set in motion by McGhee.\nA slender and fresh-faced 21-year-old McDonough resident and former barista, she sat shackled at the hands and feet in court, swallowed by an orange jumpsuit.\nClarissa McGhee (Photo courtesy of DeKalb County jail)\nShe showed no emotion as Hees testified on the sordid case.\nHees said McGhee claimed she went to meet Collins and his brother Chad Collins, 24, on the night of the murder to perform “escort services.” She brought along another woman and two men for “protection.”\nHees said the two men were known to gang detectives, though he wasn't sure which gang. He could find no evidence either Collins brother was involved in a gang.\nPolice have said the meeting was a date and that the two men attempted to rob Jordan Collins before he was shot to death and his brother was wounded. Family of the victim disputed the notion that the brothers would employ escorts.\n\"I'm certain they weren't escorts,\" sister Franchesca Collins said after the hearing. That's \"a story they came up with\" to muddy the waters.\n»RELATED: Dating site 'shocked' by ties to DeKalb murder\nMcGhee’s attorney, Cal Leipold, challenged the state’s case, which he characterized as murky and weak. He pointed out that Hees hadn’t accused McGhee of pulling the trigger or even witnessing the shooting.\n“There’s no way she should be sitting here charged with murder,” he said.\nThe state, however, is relying on Georgia’s party-to-a-crime statute, which makes it so anyone who aids in the commission of a crime is legally just as guilty as those who carry it out.\nMagistrate Judge Howard W. Indermark upheld the charges and found probable cause to allow the state to proceed with the case in superior court.\nThe other three suspects are scheduled to have hearings later this month. They're all charged with murder and held without bond in the county jail.\n>>RELATED: DeKalb murderer who fled court arrested in South Carolina\n-\nLike DeKalb County News Now on Facebook | Follow us on Twitter and Instagram","url":"https://www.ajc.com/news/local/detective-dekalb-online-dating-murder-has-definite-gang-ties/Nr2dz6RQs8vIr5ImRgup0N/"}
