{"authors":[],"date_download":"2018-10-30 14:12:04","date_modify":"2018-10-30 14:12:04","date_publish":"2016-12-05 22:54:00","description":"A new designation by the U.S. Census Bureau will force Gwinnett County to offer Spanish-language ballots to tens of thousands of Hispanic voters.","filename":"data/vaneerConsumption/NewdesignationmeansGwinnettmustofferSpanishlanguageballots.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/05/Images/newsEngin.16380048_vote-stickers-crop.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_new-designation-_ccf9ae9289d9a0948216fe354914dd66__1540908724.html","title":"New designation means Gwinnett must offer Spanish language ballots","title_page":"New designation means Gwinnett must offer Spanish language ballots","title_rss":"NULL","source_domain":"ajc.com","text":"A new designation by the U.S. Census Bureau will force Gwinnett County to offer Spanish-language ballots and other assistance to tens of thousands of Hispanic voters.\nThe move comes amid surging minority voter registration across metro Atlanta, and with a federal voting rights lawsuit pending against Gwinnett. It also comes less than a month after Hispanic voters helped Hillary Clinton turn the county blue for the first time in decades.\n\"GALEO is very glad about the designation by the U.S. Census Bureau and the requirement to provide much needed Spanish language assistance to Latino voters in Gwinnett County,\" Jerry Gonzalez, executive director of the Georgia Association of Latino Elected Officials, said in a news release Monday afternoon.\n\"Voting is an important right we have as U.S. citizens, regardless of English language proficiency. As we had mentioned over one year ago, the need for Spanish language assistance and information is certainly a reality.\"\nThe Census Bureau designation falls under Section 203 of the federal Voting Rights Act. It requires jurisdictions to provide bilingual ballot access if more than 5 percent or 10,000 citizens of voting age are members of a single language minority and have difficulty speaking English.\nGwinnett — the only Georgia county included on the designation list released Monday — is home to an estimated 171,000 Latinos, or one out of every five residents, according to the latest census estimates.\nGwinnett County spokesman Joe Sorenson said Tuesday that the county was \"certainly going to comply with any federal requirements that we fall under now.\" He said it wasn't yet clear, however, how long it might take to get everything in order.\nThe process will affect not only ballots but registration materials and other \"daily operations,\" Sorenson said.\nThe Census Bureau's designation is just the latest chapter in an ongoing saga involving Spanish-language ballots in Georgia's second largest county.\nIn October 2015, GALEO and New York-based LatinoJustice asked the Gwinnett and neighboring Hall County to provide the bilingual voting materials, citing a different provision of the federal Voting Rights Act that requires governments to make Spanish-language ballots available to Puerto Ricans who have difficulty reading English. (Puerto Ricans are American citizens but Spanish is the dominant language spoken on the island).\nThe Gwinnett County Board of Registrations and Elections voted in January to deny the request, but at least one board member — vice chairman Stephen Day, who cast the lone dissenting vote — acknowledged at the time that the county's hand might eventually be forced by the Census Bureau.\nAnalysis by The Atlanta Journal-Constitution showed that in 2016, less than 50 percent of Gwinnett voters identified themselves as white on registration forms. Minority voter registration in the county grew by 30 percent between 2015 and 2016.\nHillary Clinton claimed 51 percent of Gwinnett's votes in last month's presidential election, marking the first time the county had chosen a Democratic candidate since Jimmy Carter in 1976. Democrat Samuel Park also claimed a new state House of Representatives seat for his party, besting incumbent Republican Valerie Clark in District 101.\n“It’s just a matter of time before Gwinnett turns Democratic, and an election cycle or two after that for Cobb,” University of Georgia political scientist Charles Bullock told The AJC in October.","url":"https://www.ajc.com/news/local/new-designation-means-gwinnett-must-offer-spanish-language-ballots/fPFSvwtDLBS4QOZ3YBnwGP/"}
