{"authors":["John Hayward"],"date_download":"2018-10-30 20:46:06","date_modify":"2018-10-30 20:46:06","date_publish":"2016-01-21 18:59:40","description":"The spread of the Islamic State into India is a matter of grave concern for the authorities, and political division among the people.","filename":"data/vaneerConsumption/NewDelhiPoliceArrestFourIslamicStateOperatives.json","image_url":"https://media.breitbart.com/media/2016/01/Islamic-state-Reuters-1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_01_21__1540932366.html","title":"New Delhi Police Arrest Four Islamic State Operatives","title_page":"New Delhi Police Arrest Four Islamic State Operatives","title_rss":"NULL","source_domain":"breitbart.com","text":"The spread of the Islamic State into India is a matter of grave concern for the authorities, and political division among the people, as demonstrated by the rise of the Hindu Swabhiman militia, whose appeal rests largely on fears that the government cannot protect provincial Indians from ISIS.\nIt will not soothe any nerves to learn that four young ISIS operatives have been arrested in New Delhi, and stand accused of planning a Paris- or Jakarta-style slaughter to coincide with India’s Republic Day on January 26.\n“The arrests confirmed the presence of ISIS in India for the first time, transforming what was till now a concern into an actual security threat,” reports the Times of India. “The ISIS cell members, according to the police, said they were close to preparing IEDs and procuring weapons on the instruction of handlers who they were in touch with over VOIP, WhatsApp and Facebook.”\nThe authorities charged that the would-be bombers had already scouted several popular shopping malls for high-casualty attacks. Under interrogation, they admitted to planning bomb attacks in crowded areas that “would have led to a stampede, causing maximum casualties.”\nTheir handlers, located in Syria and Iraq, fed them ISIS propaganda on the Internet, including the Islamic State’s official online magazine, Dabiq.\nThe four alleged Islamic State terrorists are all students, between the ages of 19 and 23. One of them, Akhlaq ur Rehman, is a third-year engineering student at a polytechnic college, and was arrested when he arrived at the school to write an exam paper. The other three are pursuing bachelor’s degrees.\nIBN Live reports that New Delhi is on high alert. The Intelligence Bureau warned of a possible ISIS attempt to assassinate Indian Prime Minister Narendra Modi and French President Francois Hollande, who will be visiting for the Republic Day celebration. Other attack plots similar to the attacks on civilians in Paris and last week’s bombing in Jakarta (which seems to weigh especially heavy on the minds of Indian security officials) are being investigated.","url":"https://www.breitbart.com/national-security/2016/01/21/new-delhi-police-arrest-four-islamic-state-operatives/"}
