{"authors":[],"date_download":"2018-10-30 01:05:23","date_modify":"2018-10-30 01:05:23","date_publish":"2014-09-08 00:00:00","description":null,"filename":"data/vaneerConsumption/NewDealforInsiderSpiesCouldHavePreventedSnowdenCase.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/articles_2014_09_new_deal_for_insider_spies_could_have_prevented_snowden_case_1540861523.html","title":"New Deal for Insider Spies Could Have Prevented Snowden Case","title_page":"New Deal for Insider Spies Could Have Prevented Snowden Case","title_rss":"NULL","source_domain":"americanthinker.com","text":"New Deal for Insider Spies Could Have Prevented Snowden Case\nIn the espionage business, uncovering secrets passed on to the enemy by a captured insider spy is critical to resuming normal operations. Until a thorough damage assessment is completed, intelligence agencies don’t know what data are secure, or if agents in place are safe. And while a captured insider spy routinely agrees to cooperate if prosecutors drop the death penalty, psychiatrist David L. Charney discovered that the defendant is not committed to the assessment process. He (rarely a she) knows that the U.S. has not exercised the death penalty to punish spies since 1953, when Julius and Ethel Rosenberg were electrocuted for passing atomic secrets to the Soviets. However, Charney discovered, captured moles harbor a phobic fear of jail time. How, he posits, can this realization be applied to plea bargaining strategy to ensure that captured insider spies cooperate thoroughly with the damage assessment process? Charney’s observation, one of a raft of findings and proposals for revolutionizing protocols for handling captured insider spies, is derived from investing two hours, once a week for a year with three jailed double agents: the FBI’s Robert Hanssen, one of the most notorious moles of the modern era; Earl Pitts of the FBI; and Brian Regan of U.S. Air Force intelligence and the National Reconnaissance Office. In 2010, after 18 years of interviews and research, Charney shared Part One of his findings in the Intelligencer magazine, published by the Association of Former Intelligence Officers (AFIO). Titled “True Psychology of the Insider Spy,” Charney's findings show ten stages of life experienced by insider spies, accompanied by descriptions of each phase and ancillary notes that complete the psychological profile. In August 2014, the AFIO published a standalone magazine containing Part Two of Charney’s findings, “Proposing a New Policy For Improving National Security by Fixing the Problem of Insider Spies,” with suggestions that turn counterintelligence on its head. Aware that his proposals will certainly create controversy, Charney proposes the establishment of NOIR, the National Office of Intelligence Reconciliation, which encompasses his position that damage assessment is far more important than punishment. He suggests replacing imprisonment with ancillary punishment, a quid pro quo that enhances full cooperation. If the insider spy reneges, he is summarily sent to jail. But even more effective, according to Charney, is to provide a method for insider spies to turn themselves in early to stop the flow of secrets to foreign intelligence agencies. Part of the reasoning, as Charney points out, comes from the fact that insider spies are rarely uncovered by counterintelligence. More likely is that a defector from an enemy spy agency identifies moles working for that agency. Or the U.S. pays large sums to a contact, who probably approached us anyway. This was the case with capturing the FBI’s Robert Hanssen, who ranks in the top two or three of the U.S. insider spies in terms of damage to the U.S.\nNOIR necessarily would not be located within an existing intelligence agency – this to assure the insider spy that no one else will know he is turning himself in. Once matriculated into the NOIR system, the subject is presented with the option to avoid prison by cooperation, with caveats: loss of job and security clearance, repayment of monies by a foreign power, payment of a fine based on damages to the spy agency, submission to lifetime financial scrutiny, the possibility of adopting another identity and separation from family and friends, and agreement that he will engage fully in damage assessment. If he withholds information, or in any way does not cooperate, the deal is off, and prison awaits. Charney has concluded that stanching the bleeding early in the process should be the paramount goal of an intelligence agency with a captured mole on its hands. He adds that insider spying is more like embezzling than stealing, meaning that secrets are stolen imperceptibility over long stretches of time. Moles don’t break in and grab merchandise of the shelves; instead, they quietly remove items over months and years, leaving the keeper of the secrets to verify what is missing. Consequently, damage assessment is a tedious, detailed, time-consuming process Charney wants to shorten so that intelligence agencies can get on with protecting the country and bounce back faster from the internal blow to self-esteem caused by the exposure of an insider spy. The longer stealing secrets goes on, the more difficult to complete an accurate damage assessment. For example, Robert Hanssen operated as an insider spy for 15 years. The CIA’s Aldrich Ames, second only to Hanssen in compromising intelligence secrets, operated for nearly ten years. I visited the CIA for the first time in 2002. Walking down a corridor, I saw a medium-sized T-shaped metal stand propping up a sign created with white plastic letters on a black background: Robert Hanssen Damage Assessment Unit. Innocuous as the sign was, I felt a frisson of drama and danger. But now I realize that knowing what Hanssen passed on to the USSR and the Russian Federation in his 15-year career as a mole far outstripped in importance his punishment. Charney’s proposal would offer the Hanssens (and the Snowdens) of the spy world a chance to come clean without going to jail – the consequence that motivates moles to continue stealing secrets.","url":"https://www.americanthinker.com/articles/2014/09/new_deal_for_insider_spies_could_have_prevented_snowden_case.html"}
