{"authors":["Matthew Debord"],"date_download":"2018-10-30 22:52:26","date_modify":"2018-10-30 22:52:26","date_publish":"2016-12-10 00:00:00","description":"Demand for EVs isn't just weak — it's practically non-existent.","filename":"data/vaneerConsumption/NewFiatChryslerelectriccarCES.json","image_url":"https://amp.businessinsider.com/images/5693d190c08a80492c8b6cfa-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_new-fiat-chrysler-electric-car-ces-2016-12_1540939946.html","title":"New Fiat Chrysler electric car CES","title_page":"    New Fiat Chrysler electric car CES - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"FCA will introduce an all-electric Tesla at CES. Chrysler One of the biggest critics of electric cars also runs one of the worlds largest automakers.\nFiat Chrysler Automobiles CEO Sergio Marchionne has as much as begged customers to avoid buying his electric vehicles (EVs) because he loses so much money on them.\nDemand for EVs isn't just weak — it's practically non-existent. Globally, electric cars have captured only 1% of the market.\nMeanwhile, in the US alone, new sales records have been set as pickups trucks and SUVs powered by gas motors have experienced a massive resurgence in popularity.\nIt's not like the world's carmakers are against EVs. They've all seen Tesla make a business out of them, really from nothing, in just a decade.\nThe issue is that they shouldn't want to commit to building and marketing cars that consumers don't want. And make no mistake about it, consumers are not showing runaway EV interest.\nThere have now been perfectly viable, affordable, and technologically sophisticated electric cars in the market for the better part of ten years. And sales haven't improved to the extent that a carmaker would normally think about spending the billions necessary to develop new fleets of EVs.\nSergio Marchionne, FCA's CEO. REUTERS/Rebecca Cook\nAnd yet, the EVs just keep on coming. Now, even Marchionne is changing his tune, as Bloomberg reported. The carmaker will reveal an all-electric version of its Pacifica minivan at the Consumer Electronics Show in Las Vegas in January, wrote Tommaso Ebhardt and Jamie Butters.\n\"'A key theme for 2017 will be the increased availability of battery electric and plug-in hybrid vehicles,\" Bloomberg Intelligence analyst Michael Dean told reporters. 'This provides a dilemma for automakers as they sacrifice traditional cash-cow internal combustion engine sales for expensive and lower-margin electric cars, necessary to meet onerous new emissions legislation.'\"\nAll these new EVs look cool and point toward a future in which the old-school gas motor will be a museum piece. Unfortunately, for the vast majority of consumers, the new wave of EVs are largely science fiction.\nIncreasingly stringent new fuel-economy regulations are indeed driving the development of EVs, rather than natural market demand. The automakers derisively refer to these cars as \"compliance vehicles\" and undertake them only to be able to continue selling their profit drivers. Okay, that's not entirely why they explore EVs — they want to patent new propulsion technologies so that they don't get left in the dust if there is a big breakthrough that dramatically shifts that market.\nThe big car companies are hoping that a Donald Trump administration will give them a break on fuel-economy and emissions regulations. It remains to be seen if that will happen. But until then, the EVs will keep on coming, even if nobody wants to buy them.","url":"https://www.businessinsider.com/new-fiat-chrysler-electric-car-ces-2016-12"}
