{"authors":["Laurel Rosenhall"],"date_download":"2018-10-30 22:26:10","date_modify":"2018-10-30 22:26:10","date_publish":"2016-03-09 08:00:00","description":"A month after taking over as the California Assembly’s Republican leader, Chad Mayes brought his caucus to a shelter for homeless mothers. The lawmakers","filename":"data/vaneerConsumption/NewGOPleaderwantstogiveahandup.json","image_url":"https://calmatters.org/wp-content/uploads/mayes1.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938370.html","title":"New GOP leader wants to give ‘a hand up’","title_page":"New GOP leader wants to give ‘a hand up’ | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"A month after taking over as the California Assembly’s Republican leader, Chad Mayes brought his caucus to a shelter for homeless mothers.\nThe lawmakers listened as women shared stories of drug abuse and recovery. They poked their heads into rooms crowded with bunk beds. They greeted children bouncing balls on the playground.\n“It’s important to take a look, to see how people are changing their lives and what we can do as legislators to assist,” Mayes (R-Yucca Valley) said as he toured the St. John’s Program for Real Change in Sacramento. “I believe in redemption. … If we can offer a hand up, we’re going to do that.”\nThe son of an evangelical pastor who still plays guitar at his father’s church, Mayes became the minority leader in January, just a year into his career in the Legislature. He takes over as the Republican Party is fracturing at the national level over the presidential nomination, and dwindling in California, where less than 28 percent of voters are now registered Republican.\nMayes, 38, believes he can make his party relevant in this blue state by moving away from social issues like gay marriage and abortion, and focusing instead on quality of life issues like housing affordability and the need for middle-class jobs. Fueled by his Christian faith and a pragmatic style, Mayes is trying to make poverty alleviation a key focus for Republicans.\nAssemblywoman Kristin Olsen (R-Riverbank), who preceded Mayes as minority leader, said the caucus is behind Mayes and hopes his approach will lead to “policy and quality of life benefits, as well as political benefits” that can grow the party.\n“We as Republicans need to do a much better job demonstrating that we care about people,” Olsen said.\nWith his focus on the poor, Mayes is highlighting an issue that’s also a priority for Democrats. The new Democratic Assembly Speaker Anthony Rendon called on colleagues to help “lift California families out of poverty” as he was sworn in earlier this week.\nIt remains to be seen how much common ground the new leaders will find in their quests to help the poor, but they have developed a good working relationship, meeting for drinks every other week at an Irish pub near the Capitol.\nMayes “seems to be the type of guy who is open to a lot,” said Rendon (D-Lakewood). “The fact that he’s interested in poverty as an issue, and aggressively addressing the issue, means we can at least have a conversation with him.”\nDemocratic Gov. Jerry Brown said in a statement emailed to CALmatters that Mayes “has proven himself to be a thoughtful and effective leader.” Last month, Mayes worked with Democrats to reach a bipartisan agreement to tax health plans to fund the Medi-Cal health system for the poor. The tax restructuring required approval from two-thirds of the Legislature, giving Republicans rare leverage.\nOn poverty, the parties came together last year to support a tax credit for low-income working adults. But often, they differ in how they approach the issue.\nCalifornia has the nation’s highest poverty rate: more than 23 percent when accounting for the cost of living. Democrats want government to play a central role in addressing it and have proposed spending billions of dollars to increase public assistance, offer more child care for needy families, build housing for the homeless and raise the minimum wage. Republicans argue government should take a smaller role, preferring to relax regulations for employers and support private charities.\nDemocrats earlier this year rejected a Republican bill to spend $50 million on grants to aid organizations – like the St. John’s program – that require participants to stay sober. Most Republicans – including Mayes – voted against a Democratic bill last year to repeal a cap on welfare grants that prevents mothers from getting assistance for babies conceived while they were on welfare.\nThis year, Mayes is carrying a bill to give bonus grants to Cal-Works recipients who complete high school or earn a college degree. The details are still being developed, but the goal is to help people escape poverty through education.\n“I’ve never seen a proposal like that from a Republican,” said Jessica Bartholow, a lobbyist for the Western Center on Law and Poverty. “This is somebody who is a little different.”\nShe said neither party is doing enough to alleviate poverty but likes the direction Mayes is taking and finds him sincere. He started talking to her about how to reduce poverty shortly after he was elected, first at meetings in his office and then over pizza.\nBut Democrat Greg Rodriguez, who is running against Mayes in this year’s election, dismissed the GOP leader’s interest in poverty as “a big talking point. … It sounds good, but we need to look at some concrete examples,” Rodriguez said.\nMayes, who was elected to the Assembly in 2014 after serving several years in local government, is married with no children. He grew up in Yucca Valley, a small desert town in San Bernardino County where about 20 percent of residents live in poverty. He attended the Christian school his parents ran, then discovered an interest in politics at community college. He went on to Liberty University in Virginia, the evangelical school founded by Rev. Jerry Falwell. Mayes opposes abortion but is quick to distance himself from Falwell’s fight against gay rights.\nIn the presidential race, he is supporting Florida Sen. Marco Rubio and Ohio Gov. John Kasich. He was frustrated when the president of his alma mater endorsed Donald Trump, calling it “an awful day.”\n“I’m a proud Christian,” Mayes said. “But I’ve never been a culture warrior.”","url":"https://calmatters.org/articles/new-gop-leader-wants-to-give-a-hand-up/"}
