{"authors":["Alison Kodjak"],"date_download":"2018-10-22 21:58:46","date_modify":"2018-10-22 21:58:46","date_publish":"2017-04-20 00:00:00","description":"The proposal allows states to put people with pre-existing conditions into high-risk pools and get rid of minimum health benefits for health insurance plans if they choose.","filename":"data/vaneerConsumption/NewGOPHealthProposalCouldDitchProtectionsForPeopleWhoAreSick.json","image_url":"https://media.npr.org/assets/img/2017/04/20/tom-macarthur_wide-d98d6dbfb6aa5c123a0b195cecc2299effd4cfdf.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2017_04_20_524881039_new-gop-health-proposal-could-ditch-protections-for-people-who-are-sick_1540245526.html","title":"New GOP Health Proposal Could Ditch Protections For People Who Are Sick","title_page":"GOP Health Proposal Could Ditch Protections For People Who Are Sick : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"New GOP Health Proposal Could Ditch Protections For People Who Are Sick\nEnlarge this image toggle caption Bill Clark/CQ-Roll Call Inc./Getty Images Bill Clark/CQ-Roll Call Inc./Getty Images\nHouse Republicans are mulling over new changes to their health care proposal, hoping to wrangle enough votes to pass a bill that would allow them to keep their campaign pledge to repeal and replace the Affordable Care Act.\nThe latest proposal allows states to make changes to the ACA's rules governing health insurance policies and markets, in an effort to allow some states to offer stripped-down policies with lower premiums.\nThe proposal represents a deal between Rep. Tom MacArthur, R-N.J., who is the head of the moderate Tuesday Group, and Rep. Mark Meadows, R-N.C., who leads the far-right Freedom Caucus. The two groups could not agree on details of an earlier health care plan championed by House Speaker Paul Ryan, known as the American Health Care Act.\nThe new proposal, which was reported by Politico and The Huffington Post, is an amendment to that bill. It consists of a summary and bullet points rather than legislative language.\nWithout the full language it's unclear whether the plan could bring in enough votes to pass, says a senior House Republican aide.\nThe proposal retains many of the popular consumer protections of the Affordable Care Act, including ensuring that people with pre-existing medical conditions cannot be refused coverage or charged more.\nMacArthur, on his Facebook page, said the plan \"will make coverage of pre-existing conditions sacrosanct for all Americans.\"\nEssential Health Benefits Under the Affordable Care Act, every health insurance plan must cover the following services:\n•Ambulatory services (care you get without being admitted to the hospital)\n•Emergency services\n•Hospitalization (like surgery and overnight stays)\n•Pregnancy, maternity and newborn care\n•Mental health and substance use disorder services, including behavioral health treatment (this includes counseling and psychotherapy)\n•Prescription drugs\n•Rehabilitative and habilitative services and devices\n•Laboratory services\n•Preventive care and chronic disease management\n•Pediatric services, including oral and vision care (but adult dental and vision coverage aren't essential health benefits)\nSource: HealthCare.gov\nBut the plan also allows states to waive those protections.\nIf states requested waivers, people with pre-existing conditions would likely be covered through state-run high-risk pools, which can be expensive for patients and for taxpayers. Many states used high-risk pools before Obamacare with limited success because they weren't adequately funded, according to a study by the Kaiser Family Foundation.\nThe plan \"would make coverage unaffordable for many older consumers and would segregate high-cost consumers in coverage that would likely be inadequate,\" says Timothy Jost, a professor emeritus at Washington and Lee Law School who writes a health policy blog for Health Affairs.\nThe proposal could also cause premiums to spike for people with medical issues, according to comments posted on Twitter by Topher Spiro, vice president for health policy at the left-leaning Center for American Progress. A person with diabetes could see premiums rise by about $5,600 while someone with metastatic breast cancer could be charged an additional $142,650, he says.\nThere are some protections against such premium spikes in the proposal, says Rodney Whitlock, vice president of health policy at ML Strategies, who was a Republican Senate staffer when the Affordable Care Act was passed.\nHe says language that forces states to promise their changes would still protect people with pre-existing conditions, and result in lower premiums, invites people hurt by the changes to sue the state.\nThe proposal doesn't mention Medicaid at all, so it may do little to bring in support for the Republican bill. That's because the American Health Care Act was killed in part because it rolled back Medicaid coverage for millions of low-income people, something moderate Republicans opposed.\n\"I have a hard time believing that this will be acceptable to moderates in the House, much less the Senate, and will certainly be opposed by all Democrats,\" Jost says.","url":"https://www.npr.org/sections/health-shots/2017/04/20/524881039/new-gop-health-proposal-could-ditch-protections-for-people-who-are-sick"}
