{"authors":[],"date_download":"2018-10-22 20:43:18","date_modify":"2018-10-22 20:43:18","date_publish":"2014-06-02 19:54:36","description":"For astronomers, planets around other stars tend to come in two basic types: rocky worlds and gas giants. Now, they've identified a third.","filename":"data/vaneerConsumption/NewGasDwarfClassofAlienPlanetsRevealed.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_23/482461/gas-dwarf-alien-planets_de78dcf1fd1bfdb18a4ee2d9fed4fc8c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_space_new-gas-dwarf-class-alien-planets-revealed-n120601_1540240998.html","title":"New 'Gas Dwarf' Class of Alien Planets Revealed","title_page":"New 'Gas Dwarf' Class of Alien Planets Revealed","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBOSTON — For astronomers, planets around other stars tend to come in two basic types: rocky worlds and gas giants. Now, scientists have identified a third class of exoplanets, called \"gas dwarfs,\" that fall in between the others.\nThese gas-dwarf alien planets have thick atmospheres like their larger gas-giant cousins but never quite made it to the size of the planetary behemoths found in the Earth's the outer solar system, researchers said.\nThe team studied more than 600 planets discovered by NASA's Kepler space telescope and compared their sizes to the amount of elements other than hydrogen and helium contained in their star — a characteristic known as metallicity.\n\"We were particularly interested in probing the planetary regime smaller than four times the size of Earth, because it includes three-fourths of the planets found by Kepler,\" lead author Lars A. Buchhave, of the Harvard-Smithsonian Center for Astrophysics (CfA), said in a statement. He presented the findings today (June 2) here at the 224th meeting of the American Astronomical Society in Boston. [7 Great Exoplanet Discoveries by NASA's Kepler]\n\"That's where you'll find rocky worlds, which are the only kinds that we would consider potentially habitable,\" Buchhave said.\n'Sweet spot' in metallicity\nThe nearly 4,000 candidate exoplanets detected by Kepler were identified when they passed between Earth and their sun. The crossing dimmed the light from the host star, allowing astronomers to identify their presence, determine their diameter and calculate their orbits.\nDetermining the composition of a planet — and whether it is a gas giant or an enormous rocky world — requires knowing its mass. But mass is especially difficult to calculate with smaller worlds, such as the rocky bodies with the potential to host life.\nTo learn more about the exoplanets orbiting a star, Buchhave and his team studied the star itself. Because planets are born from the leftover material in a disc after the formation of their sun, the makeup of the star should provide insight into the composition of the planets orbiting it, they said.\nThe team performed follow-up studies on more than 600 planets orbiting more than 400 Kepler stars in order to determine the metallicity of each star. Next, they performed a statistical test to determine if the newly discovered planets and the stellar metallicities corresponded.\nThe team found clear dividing lines at the planets that were between 1.7 and 3.9 times the size of Earth. These boundaries likely mark changes in composition as well: Planets smaller than 1.7 Earths are likely to be rocky terrestrial bodies, while those 3.9 times larger are apt to be gas giants, the researchers said.\n'Gas dwarfs' exist\nThe team dubbed the planets that lie in between the two extremes \"gas dwarfs.\" Such planets should have thick hydrogen and helium atmospheres surrounding a rocky core, though they never reached the size of the solar system's gas giants.\nBuchhave also found that rocky worlds lying far from their parent star can grow even larger than previously estimated before they accumulate their atmosphere, topping out at monstrous sizes.\nFinally, the team discovered that most of the small, rocky worlds orbit Kepler stars with metallicities similar to the sun. Stars with gas dwarfs tend to be slightly more metal-rich, while those with gas giants have up to 50 percent more metals than the sun.\n\"It seems that there is a 'sweet spot' of metallicity to get Earth-size planets, and it's about the same as the sun,\" Buchhave said. \"That makes sense because, at lower metallicities, you have fewer of the building blocks for planets, and at higher metallicities, you tend to make gas giants instead.\"\n-- Nola Taylor Redd, SPACE.com\nFollow Space.com on Twitter, Facebook and Google+. Original article on Space.com.\nCopyright 2014 SPACE.com, a TechMediaNetwork company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","url":"https://www.nbcnews.com/science/space/new-gas-dwarf-class-alien-planets-revealed-n120601"}
