{"authors":[],"date_download":"2018-10-30 14:31:38","date_modify":"2018-10-30 14:31:38","date_publish":"2018-07-17 19:05:32","description":"The hotel is located at 3312 Piedmont Road, near the Peachtree Road intersection. The property is McKibbon Hospitality’s fourth Atlanta hotel, in addition to the Hampton Inn & Suites Atlanta-Downtown, Home2 Suites Atlanta Downtown and the Hyatt Place Atlanta/Duluth/Johns Creek.","filename":"data/vaneerConsumption/NewhotelwithlocalartnowopennearbusyBuckheadintersection.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p9/AJC/2018/07/17/Images/Ribbon%20Cutting%20for%20Hampton%20Inn%20and%20Suites%20Buckhead.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_new-hotel-with-l_628f141d072c2d77091927f2849d3432__1540909898.html","title":"New hotel with local art now open near busy Buckhead intersection","title_page":"New hotel with local art now open near busy Buckhead intersection","title_rss":"NULL","source_domain":"ajc.com","text":"Nearly two years after hotel developer McKibbon Hospitality and Coro Realty Advisors broke ground on a new hotel in Buckhead, a group of businessmen met for a ribbon-cutting ceremony Tuesday.\nThe recently-opened Hampton Inn & Suites Atlanta Buckhead Place has 186 rooms, a fitness center and a collection of local artwork. The art collection includes original pieces by Tommy Moss, an original sculpture by Sadie Young, work by architect Cooper Cary and prints by Steve Penley.\nHampton Inn & Suites\nRandy Hassen, president of hotel management for McKibbon Hospitality, said the hotel is “an important addition to the growing Buckhead area.”\n“We are excited to deliver a new option for visitors and pleased to offer a number of great amenities through this property, including some with local influences,” Hassen said.\nThe hotel is located at 3312 Piedmont Road, near the Peachtree Road intersection. The property is McKibbon Hospitality’s fourth Atlanta area hotel, in addition to the Hampton Inn & Suites Atlanta-Downtown, Home2 Suites Atlanta Downtown and the Hyatt Place Atlanta/Duluth/Johns Creek.\nREAD | 3 ways the Georgia Dome will be incorporated into its former property\nREAD | Famed architect’s Buckhead beauty going for $2.725M: Open house alert\nLike Intown Atlanta News Now on Facebook | Follow us on Twitter\nIn other news...","url":"https://www.ajc.com/news/local/new-hotel-with-local-art-now-open-near-busy-buckhead-intersection/xya9fEyuBPhpIudObhDC2M/"}
