{"authors":["Daniel Nussbaum"],"date_download":"2018-10-30 18:46:51","date_modify":"2018-10-30 18:46:51","date_publish":"2015-07-29 20:49:28","description":"New Host Trevor Noah Says 'Daily Show' Won't Bash Fox News As Often","filename":"data/vaneerConsumption/NewHostTrevorNoahSaysDailyShowWontBashFoxNewsAsOften.json","image_url":"https://media.breitbart.com/media/2015/03/Screen-Shot-2015-03-30-at-8.58.48-PM.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_07_29__1540925211.html","title":"New Host Trevor Noah Says 'Daily Show' Won't Bash Fox News As Often","title_page":"New Host Trevor Noah Says 'Daily Show' Won't Bash Fox News As Often","title_rss":"NULL","source_domain":"breitbart.com","text":"Incoming Daily Show host Trevor Noah told a roomful of television reporters Wednesday that the Comedy Central staple will take a new approach when he steps in for the outgoing Jon Stewart later this year–it won’t bash Fox News as much.\n“The Daily Show was based on an emerging 24–hour news cycle, that’s everything it was,” Noah said at the Television Critics Association press tour on Wednesday, according to Entertainment Weekly.\nThat’s what inspired the Daily Show. Now you look at news and it’s changed. It’s no longer predicated around 24 hour news. There are so many different choices. Half of it is online now. Now you’ve got the Gawkers, the Buzzfeeds. The way people are drawing their news is soundbites and headlines and click-bait links has changed everything. The biggest challenge is going to be an exciting one, I’m sure, is how are we going to bring all of that together looking at it from a bigger lens as opposed to just going after one source – which was historically Fox News.\nNoah, who takes over hosting duties from Stewart in September, also laid out a few of the changes the Daily Show will undergo, including changes to the show’s set, “different jokes,” and “different sensitivities.”\nBut the show’s spirit will undoubtedly live on, as Comedy Central reportedly announced that five of Stewart’s executive producers will remain onboard for Noah’s tenure.\n“We’re still dealing with the same issues, it’s just a different angle we’re looking at things from – and it’s my angle, really,” Noah elaborated. “I’m taking things in a slightly different direction, but to the same endpoint.”\nWednesday’s panel came on the heels of Noah’s Tuesday night stand-up performance for television journalists in Santa Monica, where he gave critics a brief window into what his tenure on the Daily Show might look like.\nAccording to Deadline, Noah’s stand-up performance eschewed political commentary in favor of Seinfeld-esque comedy about social issues, with a special focus on law enforcement’s treatment of the black community.\n“Every time I turn on the news, another black person has been killed for seemingly fewer and fewer reasonable reasons,” Noah said, according to the outlet.\nOf his own status as a black man living in the United States for the first time, the comedian added: “I just don’t want to die and I don’t know how not to die.”\nThe Noah-led Daily Show premieres September 28 on Comedy Central.","url":"https://www.breitbart.com/entertainment/2015/07/29/new-host-trevor-noah-says-daily-show-wont-bash-fox-news-as-often/"}
