{"authors":["Parry Ernsberger"],"date_download":"2018-10-31 01:44:54","date_modify":"2018-10-31 01:44:54","date_publish":"2018-08-27 21:06:44","description":"The long-awaited final season of House of Cards is rapidly approaching, and fans have been eager to see where the show's plot will go following Kevin Spacey's forced departure. Well, there's good news and there's bad news for loyal supporters of the…","filename":"data/vaneerConsumption/NewHouseOfCardsSeason6PhotosHintThatDianeLaneGregKinnearAreHereToMakeTrouble.json","image_url":"https://imgix.bustle.com/uploads/image/2018/8/27/4973cee4-0a6a-4888-a7b9-3cb291314e3b-hoc_601_unit_00161r.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_new-house-of-cards-season-6-photos-hint-that-diane-lane-greg-kinnear-are-here-to-make-trouble-10250476_1540950294.html","title":"New 'House Of Cards' Season 6 Photos Hint That Diane Lane & Greg Kinnear Are Here To Make Trouble","title_page":"New 'House Of Cards' Season 6 Photos Hint That Diane Lane & Greg Kinnear Are Here To Make Trouble","title_rss":"NULL","source_domain":"bustle.com","text":"The long-awaited final season of House of Cards is rapidly approaching, and fans have been eager to see where the show's plot will go following Kevin Spacey's forced departure. Well, there's good news and there's bad news for loyal supporters of the new President Claire Underwood. The good news is that Netflix has released some new House of Cards Season 6 photos, and Mrs. Underwood (Robin Wright) appears to be thriving. As for the bad news, the stills from the show also seem to imply that her presidency probably won't be drama-free, courtesy of two brand new characters played by Diane Lane and Greg Kinnear.\nAt the end of Season 5 of House of Cards, Frank Underwood (Spacey) resigned from his role as Commander-in-Chief, thrusting his wife-turned-Vice President, Claire, into the Oval Office. And, while it's clear the writers certainly had something in mind for Frank when they made him the First Gentleman, all of those plans were abandoned after a surprising cast shakeup. In November of 2017, Netflix announced that they would \"not be involved with any further production of House of Cards that includes Kevin Spacey,\" after allegations of sexual harassment and assault — which Spacey has denied — were brought against the actor. It's still unclear how they plan on addressing Spacey's character's departure in the sixth and final season, but what is clear is that Claire's in charge of the country now. That much, it seems, has not changed with Spacey's departure.\nEven without Frank's constant plotting and devious ways, it looks like Claire's presidency isn't going to be without a bit of conflict. According to these new Season 6 photos, it looks like Madame Underwood's still going to have to watch her back.\nNetflix on YouTube\nThe new photos give fans a first look at Diane Lane and Greg Kinnear's House of Cards characters. According to Netflix, as reported by /Film, they will play \"Annette and Bill Shepherd, siblings who exert a powerful behind-the-scenes force in politics.\" They also \"share a vision for the future of America, as well as a complicated past with the Underwoods.\" Sounds like Claire will have her hands full dealing with this Shepherd family dynasty.\nDavid Giesbrecht/Netflix\nIn the first of the new photos, Claire, Annette, and Bill look chummy enough — well, kind of. Claire feigns a smile and Annette looks pretty smug while conversing with Bill. It doesn't look like any of them are plotting against each other, but looks are almost always deceiving in the world of House of Cards. And, as any fan would know, relationships between powerful people on the show typically start off civil, only to end in chaos and, potentially, murder.\nDavid Giesbrecht/Netflix\nA second photo shows Annette is holding Claire's arm up victoriously, but it's hard to tell what's going on otherwise. The only other noticeable detail is an American Red Cross \"Disaster Relief\" sign posted up in the background, suggesting that the two are helping out in some sort of disaster relief effort.\nDavid Giesbrecht/Netflix\nThen there's a photo of Annette, Bill, and Duncan, another new character played by Cody Fern. As reported by /Film, Netflix described Duncan as Annette's \"ambitious and devoted son, who represents the next generation of DC power players.\"\nDavid Giesbrecht/Netflix\nFinally, a fourth photo shows Claire pointedly holding what appears to be a gold signet ring in front of Bill's face. She looks angry, to put it mildly. He looks intimidated. And it certainly looks like he has reason to be, after all, the set design looks like the Oval Office, which would mean this tense scene is taking place purely on Claire's turf.\nThe new House of Cards photos aren't exactly illuminating, but they do give a sneak peek into what might be Claire's biggest threat in office — the Shepherds. it's one of the only updates fans have gotten since Claire Underwood's 4th of July message. The final season will hit Netflix on Nov. 2, so in the meantime just imagine all the dramatic schemes that are guaranteed to come.","url":"https://www.bustle.com/p/new-house-of-cards-season-6-photos-hint-that-diane-lane-greg-kinnear-are-here-to-make-trouble-10250476"}
