{"authors":[],"date_download":"2018-10-22 21:32:28","date_modify":"2018-10-22 21:32:28","date_publish":"2014-05-07 16:45:19","description":"The state Supreme Court agreed with the arguments from a man who wanted the vanity plate reading \"COPSLIE\" to protest government corruption.","filename":"data/vaneerConsumption/NewHampshireCourtUpholdsCOPSLIEVanityPlate.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_weird-news_new-hampshire-court-upholds-copslie-vanity-plate-n99436_1540243948.html","title":"New Hampshire Court Upholds COPSLIE Vanity Plate","title_page":"New Hampshire Court Upholds COPSLIE Vanity Plate","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nIf a New Hampshire man thinks cops lie, he's free to say so on his license plate, the state's highest court ruled Wednesday.\nIn a unanimous decision, the state Supreme Court agreed with the arguments of David Montenegro, who wanted the vanity plate reading \"COPSLIE\" to protest what he calls government corruption.\nState law prohibits vanity plates that \"a reasonable person would find offensive to good taste.\" But the New Hampshire Civil Liberties Union argued that the law is unconstitutionally vague and gives too much discretion to a person behind a Department of Motor Vehicles counter.\nNew Hampshire had argued that state workers were right to deny the plate, because the phrase disparages an entire class of people — police officers.\nThe justices said that state law does not define the phrase \"offensive to good taste.\"\n\"The restriction grants DMV officials the power to deny a proposed vanity registration plate because it offends particular officials' subjective idea of what is 'good taste,'\" the court wrote. The decision states the law is unconstitutionally vague and violates free speech rights.\nThe case was sent back to Strafford County Superior Court for further proceedings.\nAttorney Anthony Galdieri, who argued the case on behalf of Montenegro and the New Hampshire Civil Liberties Union, said he was not surprised by the ruling. \"This regulation was an impermissible way to regulate speech under the First Amendment,\" Galdieri said.\nMontenegro did not immediately return a phone call seeking comment.\nAfter court in November, Montenegro — who in 2012 legally changed his name to \"human\" — said he thought police officers who might pull him over and have to type \"COPSLIE\" into their computers would amount to \"the perfect situational irony.\"\nHe also acknowledged that he had been arrested twice but would not say what the charges were.\n— The Associated Press","url":"https://www.nbcnews.com/news/weird-news/new-hampshire-court-upholds-copslie-vanity-plate-n99436"}
