{"authors":[],"date_download":"2018-10-22 22:02:58","date_modify":"2018-10-22 22:02:58","date_publish":"2014-05-08 22:06:22","description":"A highly personalized immune therapy treatment has shrunk tumors in a woman destined to die, and offers a blueprint for other cancers, doctors say.","filename":"data/vaneerConsumption/NewImmuneTherapyApproachTacklesWomansRareCancer.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/430406/140506-melinda-bachini-jms-1808_08165f9cc1f1e8d96b6c07f0ecd3dd1d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/health_cancer_new-immune-therapy-approach-tackles-womans-rare-cancer-n100811_1540245778.html","title":"New Immune Therapy Approach Tackles Woman's Rare Cancer","title_page":"New Immune Therapy Approach Tackles Woman's Rare Cancer","title_rss":"NULL","source_domain":"nbcnews.com","text":"Doctors have known for decades that the body can fight cancer. Immune cells called CD4 T-cells can recognize tumor cells, and often destroy them. But they often get overwhelmed, too.\nCancer immunotherapy seeks to identify the right T-cells and amplify them for patients. It seems simple but it has not been easy. In fact, doctors have been trying with little luck for decades.\nThe only approach that’s worked well has been against melanoma, and that’s in part because melanoma tumor cells are just loaded with mutations, says Rosenberg.\n“If you try to do that in common epithelial cancers, you can’t find them. You can’t use these cells for treatment,” said Rosenberg, a pioneer of modern cancer immunotherapy. Epithelial cancers — solid tumors — account for 80 percent of all cancers, from colon cancer to ovarian and breast cancer.\nBut advances in genetic sequencing have made it more possible. Rosenberg’s team took a tumor out of Bachini’s left lung and found the CD4 cells that were attacking it. “They pulled cells off the tumor that the body sends there to fight the cancer and they grow them in the lab for a month,” Bachini said.\n“My guess is she had a few months left to live when we first saw her.”\nBachini had to undergo a strong chemotherapy treatment to kill off many of her other immune cells, and then was infused with the T-cells that seemed to best attack the tumor.\nIt seemed to work quickly, at first, Bachini says. “Within two weeks of being home, the chronic cough I had had gone away,” she said. “For six months the tumors shrank. For the second six months they were stable.” But then they started to grow back.\nRosenberg’s lab had developed a new DNA sequencing technique in the meantime. “We had to sequence the tumor itself to find all the mutations that are present in the cancer,” he said. They strung together all the mutated DNA, and then tested it against a sampling of Bachini’s own CD4 T-cells.\nThis would not have been possible before the days of what’s called high-throughput genome sequencing. Super-fast sequencers get through a whole genome in a day, compared to the 13 years and $3 billion it took to sequence the first human genome.\nThe National Cancer Institute team found the precise T-cells that were configured to attack only the tumors. Bachini had them — just not enough of them to destroy the cancer.\nThe researchers cultivated and grew these cells in the lab, and once again infused them back into Bachini’s body. It’s been six months, and the tumors are still shrinking, Rosenberg said.\n“My guess is she had a few months left to live when we first saw her,” Rosenberg said.\nBachini is due for another checkup in June. But she’s hopeful. “I am slowly coming back,” she said. “When I went into this trial I felt like I had nothing to lose but everything to gain.” As a mother of six kids, she says, it’s important to get back to normal. “Life definitely doesn’t stop because you have cancer,” she said.\nAnd she wants people to know that clinical trials like this one really can make a difference. “I know I am patient number 3737 in the (Science) article, but I have never felt like a number,” she said.\nOne person is never a cure, and it will take a long time to find enough patients to test and see if the approach works. Other experts are cautious.\nBut Rosenberg says his team has found two patients with colon cancer who might make good candidates for this trial, and they are working with los Angeles-based Kite Pharma to develop the treatment.","url":"https://www.nbcnews.com/health/cancer/new-immune-therapy-approach-tackles-womans-rare-cancer-n100811"}
