{"authors":["Kipp Jones"],"date_download":"2018-10-30 19:36:03","date_modify":"2018-10-30 19:36:03","date_publish":"2015-12-24 20:27:34","description":"With the massive success of \"Star Wars: The Force Awakens\" released in theaters the week before Christmas, a New Jersey megachurch is using the buzz surrounding the film to celebrate the birth of Christ.","filename":"data/vaneerConsumption/NewJerseyMegaChurchCelebratesCosmicChristmaswithLiveStarWarsNativityScene.json","image_url":"https://media.breitbart.com/media/2015/12/Star-Wars-Nativity-Scene-Liquid-Church.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/entertainment_2015_12_24__1540928163.html","title":"New Jersey MegaChurch Celebrates 'Cosmic Christmas' with Live 'Star Wars' Nativity Scene","title_page":"New Jersey MegaChurch Celebrates 'Cosmic Christmas' with Live 'Star Wars' Nativity Scene","title_rss":"NULL","source_domain":"breitbart.com","text":"With the massive success of Star Wars: The Force Awakens released in theaters the week before Christmas, a New Jersey megachurch is using the buzz surrounding the film to celebrate the birth of Christ.\nLiquid Church is holding “Cosmic Christmas” services at all five of its statewide campuses on Christmas Eve.\nPromising New Jersey’s only “LIVE Star Wars Nativity Scene,” Liquid offers a nativity scene that includes Princess Leia, Han Solo, R2D2, and Chewbacca.\nJust when you think you've seen it all, how about a Star Wars themed Christmas Eve church service? Story at 6! #CBS2 pic.twitter.com/R6DGeEIfwp — Tracee Carrasco (@CarrascoTV) December 24, 2015\nPastor Tim Lucas told CBS New York the nativity scene will blend parts of the Star Wars franchise together with biblical theology.\nIn a promo video for the event, Lucas says, “The Christmas story in the Bible has all the makings of a galactic battle.”\n“There are no rules that say church needs to be dry and boring,” Lucas told The Daily Record on Dec. 16. “One of our core values at Liquid is that ‘church is fun.’ It’s okay to laugh and celebrate together while talking about Christmas. If that means having Star Wars characters in costume and dancing Stormtroopers, I’m all for it.”\n“Cosmic Christmas” will feature “Jolly ‘ol Stormtroopers,” Star Wars giveaways, and a chance to sit on Darth Santa’s knee for a selfie.\nEach service will include costumed characters, movie clips, and music. You can watch various videos from the “Cosmic Christmas” services here.\nOn Sunday, Dec. 20, German Star Wars fans converged on Berlin’s Zion Church for a Force Awakens-themed service.\nThe Associated Press reported around 500 people attended the service, more than twice as many as usual on a Sunday. Some attendees were carrying light sabers or wearing Darth Vader masks.\nZion pastor Lucas Ludewig told Fox he and fellow pastor Ulrike Garve planned the event to show that Star Wars draws on religious imagery and “that the Bible and the Church are part of our culture.”\nGarve was quoted by Reuters as saying, “The more we talked about it, the more parallels we discovered between Christian traditions and the movies.”\nWith the film’s iconic theme playing on the church’s organ, Ludewig said the plan was to hold a service that wasn’t “too Christian or too Star Wars, but to find a good compromise.”","url":"https://www.breitbart.com/entertainment/2015/12/24/new-jersey-megachurch-celebrates-christmas-with-star-wars-nativity-scene-services/"}
