{"authors":["Snejana Farberov For Dailymail.Com"],"date_download":"2018-10-23 02:19:52","date_modify":"2018-10-23 02:19:52","date_publish":"2016-01-11 14:11:25","description":"The cavernous pit that first opened up in Andrew Kauff's backyard in Mine Hill now measures 20 by 30 feet, and filling it up could set him back up to $10,000 in out-of-pocket expenses.","filename":"data/vaneerConsumption/NewJerseysinkhole20feetdeepfromoldoreminethreatenstoswallowhome.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300AF37A00000578-0-image-a-35_1452522360305.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393933_Giant-sinkhole-20-feet-deep-old-ore-threatens-swallow-New-Jersey-home_1540261192.html","title":"New Jersey sinkhole 20 feet deep from old ore mine threatens to swallow home","title_page":"New Jersey sinkhole 20 feet deep from old ore mine threatens to swallow home | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A massive sinkhole from a defunct mine is threatening to swallow up a New Jersey home.\nThe sinkhole in Andrew Kauff's backyard in the town of Mine Hill first opened up on the evening of December 30 and have since grown in size.\nThe cavernous pit measures 20 by 30 feet across and nearly 20 feet deep.\nScroll down for video\nYawning chasm: A massive 20-foot deep sinkhole has opened up outside the Mine Hill, New Jersey, home of Andrew Kauff, threatening to swallow up the residence\nDouble trouble: The hole first appeared on December 30. Since then it has grown, and a second pit has opened up next to it in Kauff's backyard\nHomeowner: Kauff, pictured here posing with the sinkhole, has owned the Mine Hill property since the late 1980s\n'Everyone is still on pins and needles,' Kauff told CBS New York last week ' 'They're afraid that the house will fall in.'\nKauff said he first noticed the opening on his property when he returned home from work at around 2pm on December 30.\n‘Right away I called the police and then town and the mayor came right over and put up a fence around it,’ the resident said.\nThat night, he was awakened by a loud thud. When he went outside the check the source of the noise, Kauff saw that the chasm had grown in size, creating a smaller opening in the ground nearby.\nMine Hill Mayor Sam Morris said the sinkhole that is now threatening the Kauff residence along West Randolph Avenue formed at the entrance of an abandoned ore mine dating back to the 19th century.\nKauff, 60, said he knew of the old mine shafts - some dating back to the Revolutionary War - and of sinkholes when he bought the West Randolph Avenue house house from his father 30 years ago\nMoney pit: It could cost Kauff up to $10,000 out of pocket to fill the 20-by-30 chasm with dirt\nEngineers have assured the homeowner that his house, which has been in the Kauff family since the 1970s, will not fall in, but filling in the pit could set him back up to $10,000.\nKauff's homeowner’s insurance does not cover sinkhole damage, and there will be no help coming from the state or federal government either, owning to the fact that New Jersey governors opted out of the program that provides financial aid to sinkhole victims in the 1990s.\nOn Thursday, a New Jersey pool company agreed to donate dirt and equipment to help Kauff fill in one of the pits, but he said it won’t be enough to fix the problem, reported New Jersey Hills.\nA friend of the unlucky homeowner has launched a GoFundMe campaign to raise money for the repairs. As of Monday morning, the fundraiser has drawn $630.\nThe chasm outside the Kauff residence is not the only one in the old mining town of Mine Hill. In the last five years alone, at least seven such sinkholes have opened up, including one that is nearly 20 feet deep.\nKauff, 60, told the Daily Record he knew of the old mine shafts - some dating back to the Revolutionary War - and of sinkholes when he bought the house from his father in the late 1980s, but he never thought he would ever face the possibility of having his house swallowed up by the earth.","url":"https://www.dailymail.co.uk/news/article-3393933/Giant-sinkhole-20-feet-deep-old-ore-threatens-swallow-New-Jersey-home.html"}
