{"authors":["Wills Robinson For Dailymail.Com"],"date_download":"2018-10-23 02:20:25","date_modify":"2018-10-23 02:20:25","date_publish":"2016-01-11 14:14:07","description":"The teenage girl surrendered to police after star athlete Nathaniel 'Nate' Plummer was shot and killed in the middle of a Camden, New Jersey, last Thursday night.","filename":"data/vaneerConsumption/NewJerseygirlturnsherselfinforthemurderofNathanielNatePlummer.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/14/300AD17C00000578-0-image-a-20_1452521143615.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393979_Girl-16-turns-murder-promising-basketball-player-13-gunned-near-grandmother-s-house-s-charged-trying-kill-October_1540261225.html","title":"New Jersey girl turns herself in for the murder of Nathaniel 'Nate' Plummer","title_page":"New Jersey girl turns herself in for the murder of Nathaniel 'Nate' Plummer | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A 16-year-old girl has turned herself in after a 13-year-old boy was brutally gunned down as he was on the way to his grandmother's home.\nStar athlete Nathaniel 'Nate' Plummer was shot and killed in the middle of a Camden, New Jersey, street on Thursday night.\nHis mother Taisha Mercado heard the gunfire that killed her boy, who was set for a promising career in basketball.\nThe youngster's teachers and his family members said he was also talented writer that liked to dress well.\nThe girl, who has not been named, surrendered to police over the weekend and was also charged with attempted murder following a shooting on October 30.\nA 13-year-old girl has turned herself in after star athlete Nathaniel 'Nate' Plummer was shot and killed in the middle of a Camden, New Jersey, street last Thursday night\nA police source told the Philadelphia Inquirer that she's a suspect in Plummer's death, but she has not been formally charged.\nShe was also wanted in connection with several other crimes in the city.\nMercado described how she found out her son had died to the Cherry Hill's Courier Post last Friday:\n'I went outside and asked the officers while they were putting yellow tape up who had gotten shot.'\nCops initially told her it couldn't be her son, but her worries started when they returned to ask her what her son had been wearing that night.\nShe then asked about the suspect: 'They said all they knew was that it was a female.'\n'He wanted to be a basketball player (when he was older),' she added. 'He said he was going to buy me a big house so I didn't have to work.\nHis mother Taisha Mercado (left) heard the gunfire that killed her boy, who was set for a promising career in basketball. She said: 'He was just a baby. It's not fair'\nShe said: My baby didn't even get to his birthday. He didn't deserve this. He was just a baby. It's not fair, it's not fair.\n'They took my baby away.'\nMercado, a certified nurses' assistant, said his younger cousins looked up to him.\nHis sisters, 11-year-old Natasha and 5-year-old Milan, were \"typical siblings,\" she said, but \"Nate was a protector, over me and the girls.\n'No one could argue with them, except him,\" she said. 'My youngest probably doesn't even know what's going on, and they were so close.'","url":"https://www.dailymail.co.uk/news/article-3393979/Girl-16-turns-murder-promising-basketball-player-13-gunned-near-grandmother-s-house-s-charged-trying-kill-October.html"}
