{"authors":[],"date_download":"2018-10-22 21:19:11","date_modify":"2018-10-22 21:19:11","date_publish":"2014-05-06 20:43:40","description":"A counselor at a New Jersey women's clinic says she filmed her own abortion to show that the procedure is \"safe.\"","filename":"data/vaneerConsumption/NewJerseyAbortionCounselorFilmsOwnAbortion.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/424416/140503-nj-abortion-counselor-1623_408d3ea4c13735409df3f019200f5142.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/news_us-news_new-jersey-abortion-counselor-films-own-abortion-n98566_1540243151.html","title":"New Jersey Abortion Counselor Films Own Abortion","title_page":"New Jersey Abortion Counselor Films Own Abortion","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBy NBCNewYork.com\nA counselor at a New Jersey women's clinic says she filmed her own abortion to show that the procedure is \"safe\" and to help support other women through the process.\nEmily Letts, a 25-year-old former professional actress, had been working at the Cherry Hill Women's Center for about a year when she learned in November that she was pregnant. In a column for Cosmopolitan posted this week, Letts writes that it was her first pregnancy -- an unplanned one -- and she had no long-term partner.\n\"I knew I wasn't ready to take care of a child,\" Letts wrote.\nLetts said she decided to have an abortion at her own clinic. It was early in the pregnancy, about two to three weeks, she said. Having searched online herself and been unable to find a video of what the procedure actually looks like, she decided to film it -- in part to educate other women who feared it.\n\"A first trimester abortion takes three to five minutes. It is safer than giving birth. There is no cutting, and risk of infertility is less than 1 percent,\" Letts wrote. \"Yet women come into the clinic all the time terrified that they are going to be cut open, convinced that they won’t be able to have kids after the abortion. The misinformation is amazing.\"\nThe anti-abortion group New Jersey Right to Life said Tuesday \"it's truly sad that an aspiring actress would use this venue\" to achieve notoriety.\n\"Ending a pregnancy through the violence of abortion is not compassionate and is never safe for the defenseless baby who is torn to bits in his or her mother's womb,\" said executive director Marie Tasy.\nLetts said she opted for a surgical abortion with local anesthesia and no IV sedation because she wanted to experience the type of procedure women considering abortions most feared and to be able to better relate to the women who visited the Cherry Hill clinic seeking her help and advice.\nThe video, which she posted on Facebook, is not graphic and shows Letts humming throughout the quick procedure. She says she received some hateful feedback, but also some that was positive.\nShe says she hoped to inspire other women to not feel guilty about making the decision to have an abortion.\n\"Our society breeds this guilt. We inhale it from all directions. Even women who come to the clinic completely solid in their decision to have an abortion say they feel guilty for not feeling guilty,\" Letts wrote. \"I didn't feel bad ... and I am grateful that I can share my story and inspire other women to stop the guilt.\"","url":"https://www.nbcnews.com/news/us-news/new-jersey-abortion-counselor-films-own-abortion-n98566"}
