{"authors":["Laura Wagner"],"date_download":"2018-10-23 01:06:46","date_modify":"2018-10-23 01:06:46","date_publish":"2015-10-22 00:00:00","description":"Kaci Hickox, who was kept in isolation last October after arriving in the U.S. from Sierra Leone where she cared for Ebola patients, is suing Gov. Chris Christie for detaining her.","filename":"data/vaneerConsumption/NewJerseyGovernorFacingLawsuitFromNurseQuarantinedDuringEbolaScare.json","image_url":"https://media.npr.org/assets/img/2015/10/22/ap_402955573904_wide-d85aca478895f2fa9bb3cd2cc28188282314d41a.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_thetwo-way_2015_10_22_450908372_new-jersey-governor-facing-lawsuit-from-quarantined-nurse_1540256806.html","title":"New Jersey Governor Facing Lawsuit From Nurse Quarantined During Ebola Scare","title_page":"New Jersey Governor Facing Lawsuit From Nurse Quarantined During Ebola Scare : The Two-Way : NPR","title_rss":"NULL","source_domain":"npr.org","text":"New Jersey Governor Facing Lawsuit From Nurse Quarantined During Ebola Scare\nEnlarge this image toggle caption Robert F. Bukaty/AP Robert F. Bukaty/AP\nUpdated 5:08 p.m. ET\nNearly one year after Kaci Hickox was quarantined in New Jersey upon her return from treating Ebola patients in Sierra Leone, she is suing Gov. Chris Christie and state health department officials. She says they unlawfully detained her.\nRepresented by the ACLU of New Jersey and two New York law firms, Hickox claims that she was held against her will for three days, even after she tested negative for Ebola.\n\"I never had Ebola. I never had symptoms of Ebola. I tested negative for Ebola the first night I stayed in New Jersey governor Chris Christie's private prison,\" Hickox said, according to a statement released by her attorneys. \"My liberty, my interests and consequently my civil rights were ignored because some ambitious governors saw an opportunity to use an age-old political tactic: fear.\"\nHickox returned to the United States on Oct. 24, 2014. She was first held at the airport in Newark before being moved to the University Hospital in Newark, where she was quarantined in a tent for two days. She was allowed to return to her home in Maine on Oct. 27, 2014.\nThe statement said that Hickox was \"held in a field tent in an unheated parking garage at University Hospital in Newark. She had access to a portable toilet but not a shower, and had to ask for extra blankets.\"\nAccording to the Associated Press, Hickox is seeking at least $250,000 in compensatory and punitive damages.\nNPR's Hansi Lo Wang reported for the Newscast unit that the governor's office declined to comment on the lawsuit, but it did highlight a quote from Christie last year. In response to a question about possible legal action stemming from the quarantine, he said: \"I've been sued lots of times before. Get in line.\"\nAs we reported at the time, the quarantine was a controversial policy from the beginning:","url":"https://www.npr.org/sections/thetwo-way/2015/10/22/450908372/new-jersey-governor-facing-lawsuit-from-quarantined-nurse"}
