{"authors":["Breitbart Jerusalem"],"date_download":"2018-10-30 21:12:24","date_modify":"2018-10-30 21:12:24","date_publish":"2016-05-12 13:35:36","description":"The New Jersey State Senate this week unanimously passed legislation that would prohibit state pension and annuity funds from being invested in companies that boycott Israel or Israeli businesses.","filename":"data/vaneerConsumption/NewJerseyPassesAntiBDSLegislation.json","image_url":"https://media.breitbart.com/media/2016/03/boycott.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_05_12__1540933944.html","title":"New Jersey Passes Anti-BDS Legislation","title_page":"New Jersey Passes Anti-BDS Legislation","title_rss":"NULL","source_domain":"breitbart.com","text":"Arutz Sheva reports: The New Jersey State Senate this week unanimously passed legislation that would prohibit state pension and annuity funds from being invested in companies that boycott Israel or Israeli businesses, the New Jersey Jewish News reported Wednesday, noting that the legislation was passed on Monday.\nThe major sponsors of the bill are Sen. James Beach (D-Dist. 6) and Majority Leader Loretta Weinberg (D-Dist. 37), according to the report.\n“We have Israel’s back,” said Beach. Focusing on New Jersey’s “long-standing relationship with Israel and a common bond,” he added, “We must take a stand against any efforts to boycott Israeli goods, products, and businesses as a way to harm the state.”\nThe Senate passed similar legislation in August 2015, but after questions were raised regarding the constitutionality of the bill, particularly with regard to the First Amendment, the legislation was pulled from the Assembly.\nThe amended bill, now focusing on the NJ-Israel relationship, providing more guidelines on identifying companies participating in boycotting Israel, and clarifying the status of companies offering humanitarian aid to Palestinians, had to be reintroduced into the Senate, according to the New Jersey Jewish News.\nRead more here","url":"https://www.breitbart.com/middle-east/2016/05/12/new-jersey-passes-anti-bds-legislation/"}
