{"authors":["Associated Press"],"date_download":"2018-10-22 22:44:24","date_modify":"2018-10-22 22:44:24","date_publish":"2017-03-16 04:29:17","description":"TRENTON, N.J. (AP) - President Donald Trump might not make it on the ballot in 2020 in New Jersey if he doesn't disclose his tax returns under a bill...","filename":"data/vaneerConsumption/NewJerseyOKsbillpressuringTrumptodisclosetaxreturns.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/20/wire-230595-1489696218-172_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4318794_Bill-pressuring-Trump-disclose-tax-returns-vote_1540248264.html","title":"New Jersey OKs bill pressuring Trump to disclose tax returns","title_page":"New Jersey OKs bill pressuring Trump to disclose tax returns | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TRENTON, N.J. (AP) - President Donald Trump might not make it on the ballot in 2020 in New Jersey if he doesn't disclose his tax returns under a bill approved by lawmakers.\nThe Democrat-led Assembly on Thursday approved the legislation inspired by the Republican president's failure to disclose his tax returns despite state Republicans' claims the bill was \"transparently political and blatantly unconstitutional.\"\nIt now heads to Republican Gov. Chris Christie, a longtime Trump ally, to sign or veto. Christie's office declined to weigh in.\nPresident Donald Trump speaks during a rally Wednesday, March 15, 2017, in Nashville, Tenn. (AP Photo/Evan Vucci)\nThe bill comes after MSNBC obtained and revealed two pages of Trump's 2005 tax return that showed he earned $150 million that year and paid $38 million in income taxes.\nLast week, Hawaii became the first state to send similar legislation to a full floor vote. At least 23 states are considering similar bills, according to the National Conference on State Legislatures.\nDemocratic Assemblyman John McKeon, who sponsored the measure, acknowledged it's unlikely Christie would enact it, and he's banking on the two-term Republican governor's successor being a Democrat who would.\n\"This will be the law. If this governor doesn't sign it the next one will. This is about whoever is going to run for president prospectively,\" McKeon said.\nNew Jersey Assembly Republican Leader Jon Bramnick sought on the floor to amend the bill to require state lawmakers to also disclose their taxes but was blocked by Democrats.\nGOP Assemblyman Jay Webber had the sharpest critique of the legislation, arguing the constitution requires only three things of prospective presidents: that they be natural born citizens, at least 35 years old and 14 years a resident.\n\"This is a doozy,\" he said. \"This is both transparently political and blatantly unconstitutional.\"\nMcKeon countered the 2000 Bush v. Gore Supreme Court ruling established states have latitude in governing ballots.\nRick Hasen, a law professor at University of California, Irvine, called the legislation \"an open question.\"\nThe measure requires presidential and vice presidential candidates to release five years of federal tax returns to appear on the ballot.\nTrump broke with nearly four decades of tradition by failing to release his tax returns.\nNew Jersey assemblyman Jay Webber, R-Parsippany, right, speaks against a bill requiring presidential candidates to disclose tax returns in order to appear on ballots in the state as assemblyman John McKeon, D-Madison, left, the bill's sponsor, listens during a meeting in the state legislature, Thursday, March 16, 2017, in Trenton, N.J. The measure, which was approved by the assembly, requires presidential and vice presidential candidates to release five years of federal tax returns to appear on the ballot. The bill will head to Republican Gov. Chris Christie to sign or veto. (AP Photo/Julio Cortez)\nNew Jersey Assemblyman John McKeon, D-Madison, speaks about a bill requiring presidential candidates to disclose tax returns in order to appear on ballots in the state during a meeting in the state legislature, Thursday, March 16, 2017, in Trenton, N.J. The measure, which was approved by the assembly, requires presidential and vice presidential candidates to release five years of federal tax returns to appear on the ballot. The bill will head to Republican Gov. Chris Christie to sign or veto. (AP Photo/Julio Cortez)\nNew Jersey Assemblyman Jay Webber, R-Parsippany, speaks against a bill requiring presidential candidates to disclose tax returns in order to appear on ballots in the state during a meeting in the state legislature, Thursday, March 16, 2017, in Trenton, N.J. The measure, which was approved by the assembly, requires presidential and vice presidential candidates to release five years of federal tax returns to appear on the ballot. The bill will head to Republican Gov. Chris Christie to sign or veto. (AP Photo/Julio Cortez)","url":"https://www.dailymail.co.uk/wires/ap/article-4318794/Bill-pressuring-Trump-disclose-tax-returns-vote.html"}
