{"authors":["Simon Black","Sovereign Man"],"date_download":"2018-10-31 00:31:53","date_modify":"2018-10-31 00:31:53","date_publish":"2018-07-09 00:00:00","description":"New Jersey lost about 2 million residents between 2005 and 2014 while people flocked to states with less or no income tax. And the state recently rolled out plans to raise taxes on top earners.","filename":"data/vaneerConsumption/NewJerseyhasntlearneditslessononraisingtaxes.json","image_url":"https://amp.businessinsider.com/images/5b43a8c832245c1e008b4f10-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_new-jersey-hasnt-learned-its-lesson-on-raising-taxes-2018-7_1540945913.html","title":"New Jersey hasn't learned its lesson on raising taxes","title_page":"    New Jersey hasn't learned its lesson on raising taxes - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"New Jersey Sen. Stephen Sweeney, D-New Deptford, N.J., speaks during a news conference after he and Democratic legislative leaders failed to strike a budget deal with Gov. Phil Murphy, Friday, June 29, 2018, in Trenton, N.J. The governor and senate democratic leaders have not agreed on a a deal and if a balanced budget is not in place by midnight Saturday the state government faces a shutdown. The major sticking point has been how much to raise taxes. The first-term Democratic governor wants to raise the income tax rate on people making more than $1 million to 10.75 percent. (AP/Julio Cortez\nYou would think New Jersey would have learned its lesson…\nTwo years ago, New Jersey's richest resident - hedge fund billionaire David Tepper - decided to move himself and his business to Miami Beach.\nTepper, who personally earned more than $6 billion from 2012-2015, was tired of paying New Jersey's top income-tax rate of 8.97% for the 20 years he lived there, in addition to the country's highest property taxes, the estate tax and inheritance tax.\nBy moving to Florida, a state with ZERO income tax, Tepper stood to save hundreds of millions of dollars each year. And, as an added bonus, he'd be living in the Sunshine State.\nAnyone with some common sense would have at least acknowledged the possibility that a guy like Tepper would consider moving to save a few hundred million bucks.\nBut New Jersey, content on milking its ultra-wealthy for tax revenue, was caught completely by surprise.\nAnd Tepper's departure left an enormous hole in its budget.\nThink about that: the departure of literally ONE person caused big problems for New Jersey's budget.\nAnd Tepper wasn't the only one leaving…\nAccording to the New Jersey Business and Industry Association, the State of New Jersey lost a whopping 2 million residents between 2005 and 2014, earning a combined $18 billion in net adjusted gross income, i.e. income that would have been taxed by the state.\nSo it's not just the masters of the universe that are tired of paying sky-high taxes. It's also the regular wage earner and small business owner.\n60% of these folks went to Florida, with a state income tax of zero.\nSo the message from New Jersey's residents (well, now former residents) is pretty clear: taxes are too high.\nNow, what do you think New Jersey is doing to solve this problem?\nInstead of making the state friendlier to productive people and businesses, New Jersey decided to RAISE taxes on the sad saps that remain within its borders (for now).\nNew Jersey tax residents making more than $5 million will now pay 10.75%, up from 8.97%.\nAnd the corporate rate on businesses with more than $1 million in net income increased from 9% to 11.5%.\n(Proportionally, that's a potentially 27% increase in the amount of tax a business might pay.)\nThe tax hike will give Jersey the fourth-highest marginal income tax rate on individuals and the second highest corporate rate after Iowa.\nIt's the exact opposite of what New Jersey should have done.\nSadly, New Jersey is not alone in chasing away its citizens.\nIn the 12 months ended July 1, 2017, the State of New York lost a net 190,508 residents (bringing the total loss to 1 million people since 2010 - the largest of any state).\nAnd people are likewise fleeing the People's Republic of California- and its top marginal tax rate of 13.3%- in droves.\nLots of them are landing in Texas (another state with no income tax)… an average 60,000 Californians left for Texas every year from 2011 to 2015.\nAny government trying to keep their productive, high-earning residents from leaving by raising taxes is absolutely foolish.\nPaying zero state income tax is more attractive than paying any state income tax, much less an even higher state income tax like in New Jersey. Duh.\nOn the other hand, you have Puerto Rico…\nIn order to attract more productive residents, Puerto Rico enacted a number of incentives including Act 20 and Act 22, which allow eligible business to pay a 4% corporate tax rate and individuals to pay ZERO taxes on capital gains and dividends, respectively.\nWe recently hosted our Total Access members (our highest level of membership) at an event in San Juan. The Secretary of State, the Secretary of Economic Development and Commerce and several other top government officials spent the day with us.\n(Puerto Rico's incentives are enormous, so I strongly encourage you to consider the option. To give you an example, I will easily save more than $10 million in tax due to these incentives. And it's all 100% legal.)\nNo surprise, these generous tax incentives are working.\nThe Secretary of Economic Development and Commerce told us tax incentive applications are up more than 100% year over year. And it's just getting started.\nUnfortunately, Puerto Rico's stance is unusual.\nThe normal route, as we saw with New Jersey, is to keep squeezing until they've chased out all the taxpayers. Governments have done this for thousands of years, even before the Roman Empire.\nBut New Jersey will soon learn that its residents aren't tied to the land like medieval serfs in the feudal system. Governments still have this antiquated view, but it's no longer valid.\nAmericans who want to legally avoid state income tax can easily move to Florida, Texas, and the handful of other states with no state income tax.\nAnd those who want to legally avoid federal income tax can move to Puerto Rico.\nMost other nationalities, including Canadians, Brits, Australians, etc. can also legally avoid their home country's income tax by relocating overseas to a place like Panama or BVI.\nAnd given how interconnected the world is, relocation needn't cause any significant problems for a business.\nIt's 2018. Businesses can exist entirely online. You can earn your money while living in one place, servicing clients in another, and outsourcing to workers in another.\nAnd, if need be, you can always get on a plane and find yourself on the other side of the planet tomorrow morning for a face-to-face meeting.\nThis is the world we live in. We're no longer medieval serfs. We have options.\nIt's pretty sad that Puerto Rico is one of the only places to have figured it out.\nTo be fair, Puerto Rico did have to hit rock bottom financially before making this drastic change.\nBut I'd guess that New Jersey won't be far behind.","url":"https://www.businessinsider.com/new-jersey-hasnt-learned-its-lesson-on-raising-taxes-2018-7"}
