{"authors":["Snejana Farberov For Dailymail.Com"],"date_download":"2018-10-23 00:25:32","date_modify":"2018-10-23 00:25:32","date_publish":"2016-01-28 14:24:24","description":"New Jersey grade-schooler Aryan Gavali had to get nine stitches after a large raccoon attacked him and proceeded to bite and scratch him in the face until a neighbor came to the boy's rescue.","filename":"data/vaneerConsumption/NewJerseyboymauledbyraccoonwhilewalkingtoschool.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/14/30AADE2B00000578-0-image-a-31_1453990087758.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421015_Boy-6-mauled-raccoon-walking-school-hero-neighbor-steps-beats-animal-death_1540254332.html","title":"New Jersey boy mauled by raccoon while walking to school","title_page":"New Jersey boy mauled by raccoon while walking to school | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A six-year-old New Jersey boy was mauled by a raccoon while walking to school with his mother, who said her son could have died if it weren't for a heroic neighbor who came to his rescue.\nAryan Gavali had to get nine stitches on his face after the vicious animal attack that took place in Elmwood Park Wednesday morning.\nThe child was on his way to the 16th Avenue Elementary School with his mother, Monali Gavali, when a large raccoon attacked him from behind and proceeded to bite and scratch him in the face.\nScroll down for video\nLucky to be alive: Aryan Gavali, six, pictured left and right with his mother, required nine stitches to his face after being mauled by a raccoon in New Jersey. The attack occurred as the boy was walking to school\nDangerous varmint: The carcass of the dead animal was later taken to a lab to be tested for rabies\n‘Within a second, he screamed, “Mommy,” then I turn around and saw that he was on the ground... something was there, something was on his back,' Ms Gavali described the incident to NBC New York.\nElmwood Park resident Danny Walls was getting ready for work when he heard the mother screaming for help outside his window.\nSeeing the massive racoon clawing at Aryan's face, the quick-thinking Good Samaritan grabbed a painter's pole from his car and started beating the varmint until it let go of the child and died.\nWalls described a harrowing scene in the wake of the attack, with little Aryan screaming in terror and blood streaming from his wounds.\n‘He had rips on his face,’ Danny's wife, Diana Walls said of the grade-schooler. 'Not just cuts, rips.'\nHero: Neighbor Danny Walls rescued Aryan by grabbing a painter's pole and whacking the raccoon until it died\nThis image shows Walls recreating how he struck the animal until it let go of the six-year-old boy\nAfter profusely thanking the fearless neighbor for saving her son's life, Monali Gavali rushed Aryan to Hackensack Medical Center to be treated for his injuries.\nSpeaking from her son's bedside via video chat Wednesday night, Ms Gavali called Walls her 'angel,' reported CBS2.\nThe bloody carcass of the raccoon that attacked Aryan was taken to a lab to be tested for rabies. The results are expected on Friday.","url":"https://www.dailymail.co.uk/news/article-3421015/Boy-6-mauled-raccoon-walking-school-hero-neighbor-steps-beats-animal-death.html"}
