{"authors":["Associated Press"],"date_download":"2018-10-23 03:48:07","date_modify":"2018-10-23 03:48:07","date_publish":"2016-01-29 19:06:38","description":"Robert Ehling, 76, of New Jersey was found guilty on Thursday of illegally killing three bears and of a weapons offense following the October 2014 incident when he shot dead a bear and her two cubs.","filename":"data/vaneerConsumption/NewJerseymanwhoclaimedselfdefenseisconvictedofkillingthreebears.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/22/30B584FE00000578-0-image-a-148_1454105404615.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3423293_Man-claimed-self-defense-convicted-killing-3-bears_1540266487.html","title":"New Jersey man who claimed self-defense is convicted of killing three bears","title_page":"New Jersey man who claimed self-defense is convicted of killing three bears | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A New Jersey man who said he shot three bears on his property to defend himself and his wife has been convicted of illegally killing them.\nRobert Ehling, 76, was also found guilty on Thursday of a weapons offense in the 2014 incident and was ordered to pay $4,332 in civil penalties and restitution, the New Jersey Herald reported.\nMunicipal Court Judge James Devine said the Sparta man's actions on October 10, 2014 were those of a vigilante when he shot the animals on the second-floor deck at the back of his home near Lake Mohawk.\nRobert Ehling (pictured at his New Jersey home), 76, was found guilty on Thursday of illegally killing three bears. He said he shot the bears in October 2014 on his property to defend himself and his wife\nHe admitted in court that he shot a bear and her two cubs (one pictured) on the deck at the back of his home near Lake Mohawk\nThe judge said there is no indication that even a game warden or police officer would have had the right to shoot the bear and her two cubs that morning.\nEhling claimed he had shot the three bears to defend him and his wife who he said were only separated from the bear by a sliding-glass door, NJ.com reported.\n'He looked me right in the face,' Ehling said in court last year as he recalled the incident, according to CBS New York.\n'[I] aimed at its head and pulled. Catastrophically, the bear fell.'\nOn Thursday, Ehling was also found guilty of a weapons offense in the incident and was ordered to pay $4,332 in civil penalties and restitution\nEhling had shot the bear on his back deck and shot both of the cubs while they were on the ground, one near the deck and the other below the deck, Conservation Officer Robert Driscoll during a hearing last November.\nDriscoll also said there were no signs the bears had attempted to get into the home, adding there was 'no damage' on the sliding-glass door.\nDevine believes Ehling was not being threatened by the bears and said that Ehling 'became the aggressor' during the incident.\nHe also noted that it was telling how Ehling tried to dispose of the bears' bodies when police first arrived at the scene, as he was spotted leaving a ravine where he had dragged one of the cubs' bodies, according to the New Jersey Herald.\nDefense attorney George Dagget said he is going to recommend that his client, (pictured in court last year) appeal the judge's decision\nEhling was found guilty on all charges including three counts of killing a bear out of season along with one count of possessing a loaded firearm for the purpose of killing an animal within 450 feet of another occupied building.\nDefense attorney George Dagget said he is going to recommend that his client, who was not present in court, appeal the judge's decision.\n'If we had been talking about humans here, there wouldn't have been a case,' Dagget told the New Jersey Herald.","url":"https://www.dailymail.co.uk/news/article-3423293/Man-claimed-self-defense-convicted-killing-3-bears.html"}
