{"authors":["Chris Pleasance For Dailymail.Com"],"date_download":"2018-10-23 01:40:39","date_modify":"2018-10-23 01:40:39","date_publish":"2016-01-28 16:04:31","description":"Saniyah Bonilla, three (left), the girl found inside a snowed-in car in New Jersey with the bodies of mother Sasha, 23 (right), and brother Messiah, one, has also passed away, medics said.","filename":"data/vaneerConsumption/NewJerseythreeyearoldgirlfoundunconsciousinsidesnowedincarhasdied.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/16/308B9BBA00000578-0-image-a-20_1453996862139.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421109_Three-year-old-girl-unconscious-inside-snowed-car-bodies-mother-brother-one-died_1540258839.html","title":"New Jersey three-year-old girl found unconscious inside snowed-in car has died","title_page":"New Jersey three-year-old girl found unconscious inside snowed-in car has died | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A three-year-old girl found in critical condition inside a snowed-in car in New Jersey alongside the bodies of her mother and brother has also died, medics said.\nSaniyah Bonilla was taken to hospital on Sunday after being found unresponsive in a car alongside her mother Sasha, 23, and brother Messiah, one, who were already dead.\nSaniyah had remained in critical care at the St. Joseph's Regional Medical Center in Paterson until she passed away yesterday afternoon, NBC New York reported.\nScroll down for video\nSaniyah Bonilla, three (right), the girl found unconscious inside a snowed-in car alongside the bodies of mother Sasha, 23, and one-year-old brother Messiah (both pictured) has also died\nSasha, Saniyah and Messiah had gone out on Sunday to help father Felix dig their car out of a snow drift following storm Jonas, but climbed into the vehicle and turned the engine on after getting cold\nThe family are thought to have succumbed to carbon monoxide poisoning after their car's tail pipe became blocked with snow, forcing exhaust fumes into the cabin.\nThe tragedy is believed to have unfolded as the family, including father Felix Bonilla Jr, went to dig their car out of a huge snow drift following storm Jonas which hit on Saturday.\nWhile digging Sasha, Saniyah and Messiah are thought to have become cold, and so climbed into the vehicle and turned the heaters on as Felix continued digging just a few feet away.\nBy the time Felix looked up from what he was doing ten minutes later, he found his entire family unconscious.\nWitnesses describe trying to carry out CPR on the trio, but quickly realized that the little boy and his mother could not be saved.\nThey were pronounced dead immediately after arriving at hospital, while doctors described Saniyah's condition as 'very critical' and said she was unlikely to survive.\nAuthorities believe that carbon monoxide fumes were pushed into the cabin of the car (pictured) because the tail pipe was still blocked with snow\nFather Felix carried on shoveling snow for ten minutes before looking inside the vehicle to find his entire family unconscious inside, according to emergency crews\nNeighbor Isabel Carmona described the tragic scene, saying father Felix was reduced to tears, 'crying and jumping' around before medics arrived.\nWhen rescue workers did eventually arrive, she added: 'The paramedic, he cry, and the police cry. Everybody cry.'\nCarbon monoxide is a colorless, odorless and tasteless gas that is produced by the incomplete burning of hydrocarbon fuels, such as gasoline.\nWhile non-toxic at low levels, at high levels it leads to drowsiness, disorientation, extreme fatigue and ultimately death.\nThe family were taken to hospital on Sunday where Messiah and Sasha were pronounced dead on arrival. Medics said Saniyah was in a 'very critical' condition before passing away yesterday afternoon\nCarbon monoxide poisoning is also thought to be behind the death of Brooklyn man Angel Ginel, 44, who was found unresponsive inside his snow-covered vehicle with the engine still running on Tuesday\nOnce inhaled, carbon monoxide binds to hemoglobin in red blood cells, the protein responsible for carrying oxygen to cells.\nAs levels of carbon monoxide build up, the levels of oxygen in the blood drop sharply, and if the poisoning goes undetected, it ultimately causes the body to shut down.\nCarbon monoxide poisoning is also believed to be behind the death of Angel Ginel, 44, in Brooklyn, who was found dead inside his car on Tuesday with the engine still running.","url":"https://www.dailymail.co.uk/news/article-3421109/Three-year-old-girl-unconscious-inside-snowed-car-bodies-mother-brother-one-died.html"}
