{"authors":["Marcia Parker","David Lesher"],"date_download":"2018-10-30 23:34:22","date_modify":"2018-10-30 23:34:22","date_publish":"2018-09-05 10:00:00","description":null,"filename":"data/vaneerConsumption/NewK12EducationReporterToJoinCALmatters.json","image_url":"https://calmatters.org/wp-content/uploads/rhhIM-ms.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles_blog__1540942462.html","title":"New K-12 Education Reporter To Join CALmatters","title_page":"New K-12 Education Reporter To Join CALmatters | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"CALmatters welcomes Donna Lucas, President and CEO of Lucas Public Affairs, and Christy Remey Chin, a Venture Partner at the Draper Richards Kaplan Foundation, on to the CALmatters Advisory Board\n“We are thrilled to have these two very talented and accomplished women join our advisory board,” said CALmatters Publisher Marcia Parker. “They have a broad range of experience, skills and networks.”\nChin, an advocate of social entrepreneurship and high-impact philanthropy, has been instrumental in growing the Foundation’s pipeline, portfolio support, and stewardship of its donor partners over the past decade. Chin has served on the boards of Accountability Counsel, Adventure Scientists, Blue Engine, CareMessage, Green City Force, Jacaranda Health, Students for Education Reform, Urban Teachers and Watsi. Her career includes impressive achievements at the Skoll Foundation, William and Flora Hewlett Foundation, Bedrock Capital Partners and Norwest Venture Capital and at a venture-backed company, The Frontier Group\nShe also chairs the board of Benetech, serves on the National Venture Capital Association board and is on the advisory board of Ashoka U. Chin received her MBA from the Harvard Business School and holds a BA in History from Colgate University.\nDonna Lucas is often referred to as one of the most influential people in Sacramento. The Founder, CEO and President of Lucas Public Affairs has had a 30-year-career in which she has worked in senior executive positions both in public and private sectors. She was the deputy chief of staff for strategic planning and initiatives for Gov. Arnold Schwarzenegger and chief of staff to First Lady Maria Shriver. She was the deputy press secretary for Gov. George Deukmejian, deputy treasurer for state Treasurer Tom Hayes, and California press secretary for the 1988 presidential campaign of George H.W. Bush.\nLucas serves on several boards including the Crocker Art Museum, John Burton Advocates for Youth, College Futures Foundation, All About Sacramento, Scripps Institution of Oceanography, and Maria Shriver’s Women’s Alzheimer’s Movement. She is on the Executive Committee on the California Chamber of Commerce Board of Directors and is Chair-Emeritus of the Public Policy Institute of California (PPIC)\nThey join advisory board members: Mekahlo Medina, Emmy Award-winning co-anchor, technology and social media reporter for NBC4 Los Angeles; Douglas McGray, Editor-in-Chief of The California Sunday Magazine; John Thornton, Founder of the Texas Tribune; Richard Tofel, President of Propublica, and; Ernest Wilson, professor of communication and political science, and founder and director of the USC Center for Third Space Thinking at USC’s Annenberg School of Communications.\nLaunched in 2015, CALmatters is a nonpartisan, nonprofit journalism venture committed to explaining how California’s state Capitol works and why it matters. Environmental regulation, education, health care, criminal justice, economic inequality – the debates on these issues and others have a profound impact on the lives of 38 million Californians and beyond. Our team of 20 + experienced journalists, with the time and resources to dig deep, is committed to meaningfully informing Californians about the players, politics, and interests that shape the issues that affect their lives. To ensure we reach many Californians, we work with more than 140 media organizations throughout the state that have long, deep relationships with their local audiences.\nMedia outlets interested in becoming CALmatters media partners should contact Editor-in-Chief Dave Lesher at dave@calmatters.org","url":"https://calmatters.org/articles/blog/new-k-12-education-reporter-to-join-calmatters/"}
