{"authors":[],"date_download":"2018-10-22 21:19:58","date_modify":"2018-10-22 21:19:58","date_publish":"2014-06-04 23:28:56","description":"With its new a la carte pricing for everything from overhead bin space to coffee, tea and water, unprepared fliers may be in for sticker shock.","filename":"data/vaneerConsumption/NewLowCostAirlinePEOPLExpressTicketsGoonSale.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/488386/140604-peoplexpress_airplane_3b2c448174573a6cb988e8c51230018f.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_new-low-cost-airline-peoplexpress-tickets-go-sale-n122971_1540243198.html","title":"New Low-Cost Airline: PEOPLExpress Tickets Go on Sale","title_page":"New Low-Cost Airline: PEOPLExpress Tickets Go on Sale","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe days of the airline stewardess joke — \"coffee, tea, or me?\" — are gone in more ways than one.\nTickets from $59 went on sale Wednesday afternoon for PEOPLExpress, the new airline that seeks to capitalize on the goodwill for the name of one of the first low-budget airlines that disappeared decades ago amid industry consolidation. But with its new a la carte pricing for everything from overhead bin space to coffee, tea and water, unprepared fliers may be in for sticker shock.\nAll of the airline's flights will be in and out of its hub at Newport News/Williamsburg International Airport in Virginia, with only three destinations when it starts flying June 30. The airline's two daily round-trip flights to Newark, New Jersey, will start with base fares from $76 each way; a daily round-trip to Boston will cost $76 each way; and its daily round-trip to Pittsburgh will cost $59 each way.\nService to West Palm Beach, Florida, will start July 15 with one daily round-trip flight and fares priced from $89 each way.\nFlights to Atlanta will start Aug. 1 with one-way fares priced at $79. The Atlanta route will offer round-trip service once a day, except Tuesdays.\nOn Aug. 28, service will start to New Orleans for $119 each way as well as to St. Petersburg/Clearwater, Florida, from $89 each way. Only three weekly round-trips will be offered to St. Petersburg and New Orleans.\nAll those fares come with a serious \"restrictions apply\" asterisk as fliers will have to pay extra for services that many other airlines still offer for free.\nOn board, coffee or tea will sell for $1; soft drinks water and juice will cost $2; beer will be $5; and a proper cocktail will set you back $7.\nCarry-on bags in overhead bins will cost $25 per bag per flight segment while a single checked bag will cost $20, and a second will add $25 more and if you must, $75 for a third. If you have to check a bag at the gate, that's $50, and if it's overweight, an extra $75 fee will apply. An exit-row seat will cost an extra $25 each way while more comfortable \"Living Large\" seats will cost an extra $59 per flight segment. Advance seat assignments cost $15 each way.\nOn board, coffee or tea will sell for $1; soft drinks water and juice will cost $2; beer will be $5; and a proper cocktail will set you back $7. The good news comes on the snacks pricing: \"Complimentary.\"\nCarry-on bags will be free if they fit under your seat, a company spokesman said.\nThis past Friday, the airline announced it would launch, and technically will be known as \"Vision Airlines, dba PEOPLExpress\" while it gets its full certification from the Federal Aviation Administration. It will fly leased 150-seat Boeing 737-400 aircraft operated by Las Vegas-based Vision Airlines.\nPEOPLExpress hopes to expand to 24 cities within five years, with hubs in Pittsburgh; New Orleans; San Antonio, Texas; and Atlantic City, New Jersey, CEO Jeff Erickson told CNBC in an interview last week.\nAt its first hub, the airline will operate two gates on Concourse A at Newport News. Tickets can only be purchased through its website or its call center, which is open daily from 8 a.m. to 8 p.m. Eastern time.\nThe original PEOPLExpress began flying in 1981 and was based at Newark. It was later acquired by Continental, which was then acquired by United. The new airline has adopted the old logo, but with a new green scheme rather than the old brown, burgundy and orange. Otherwise the new airline is not affiliated with the old airline of the same name, Erickson said, except that some of the executives worked for the old airline.\nPEOPLExpress isn't the only new airline with plans to take off this year. An all-business class airline, tentatively called Dream Jet, has announced plans to fly between Paris and New York. And Eastern Air Lines Group has filed its initial application with the U.S. Department of Transportation to begin operations.","url":"https://www.nbcnews.com/business/travel/new-low-cost-airline-peoplexpress-tickets-go-sale-n122971"}
