{"authors":["Ben Christopher","Julie Cart","Dan Morain","Laurel Rosenhall"],"date_download":"2018-10-30 22:28:13","date_modify":"2018-10-30 22:28:13","date_publish":"2017-03-28 18:15:37","description":"Update: On Oct 5, Gov. Jerry Brown signed a scaled-down version of SB 29— placing a moratorium on local governments entering into new immigration","filename":"data/vaneerConsumption/Newlookathowlocaljailslockupdeportableimmigrants.json","image_url":"https://calmatters.org/wp-content/uploads/AdelantoDetention.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/calmatters.org/articles__1540938493.html","title":"New look at how local jails lock up deportable immigrants","title_page":"New look at how local jails lock up deportable immigrants | CALmatters","title_rss":"NULL","source_domain":"calmatters.org","text":"Update: On Oct 5, Gov. Jerry Brown signed a scaled-down version of SB 29— placing a moratorium on local governments entering into new immigration detention contracts with federal immigration authorities or private corporations.\nTrash-strewn cells, moldy showers, broken telephones, excessive use of solitary confinement, and “slimy, foul-smelling lunch meat.”\nThese are the conditions that detainees face inside one of southern California’s largest immigration detention facilities, according to a report this month by federal inspectors who visited the Theo Lacy Facility, an 11-acre jail complex run by the Orange County Sheriff’s Department.\nFor the past seven years, the U.S. Immigration and Customs Enforcement has been renting bed space there. The county sheriff’s office collects roughly $30 million annually for leasing out the high-security real estate, and in exchange, ICE gets bunk space for roughly 480 of the more than 40,000 undocumented immigrants nationwide that the agency has been keeping behind bars on any given day.\nThe contract is an arrangement of convenience for a county in need of revenue and a federal government in need of jail beds.\nThe county disputes the critical inspection report from the Homeland Security Department’s Office of Inspector General. Sheriff Sandra Hutchens says that while “some legitimate issues were identified…and were quickly addressed,” many of the inspection’s findings were inaccurate, as was the subsequent “sensational” media coverage which provided “a misleading ‘Shawshank-like’ picture of Orange County jail facilities.”\nRegardless, the news comes at a bad time for the Orange County Sheriff’s Department—and for all defenders of business-as-usual across the patchwork of county jails, city lockups, and privately-owned facilities across California that make up the state’s immigration detention system.\nFor state Sen. Ricardo Lara—whose immigration detention reform bill won the Legislature’s approval last year only to be vetoed by Gov. Jerry Brown—the inspection report provides a well-timed “I told you so.” And so Lara, a Democrat from Bell Gardens, is back again this session with Senate Bill 29, which would set new rules for immigration detention facilities and would ban local governments from contracting with private prison companies to detain immigrants.\nWhile the state already regulates all detention facilities in California, Lara and other supporters of the bill argue that the national detention standards articulated in every ICE detention contract are not being followed. This bill would not require the Board of State and Community Corrections, the agency that regulates California prisons and jails, to conduct additional inspections or adopt new rules. Instead, the bill aims to keep immigration facilities in line by allowing both detainees and the state Attorney General to sue any facilities that violate these standards.\nBut the bill also has sharp detractors among law enforcement agencies and many Republicans, who believe that claims of mismanaged detention facilities are overblown. They also argue that the state shouldn’t interfere with local law enforcement decisions, and that Lara’s bill could have unintended, harmful consequences for local budgets—and even for the detainees themselves.\n“Sacramento thinks it’s so smart and has to mandate things to everybody,” says GOP state Sen. John Moorlach, who represents Orange County and used to chair its board of supervisors. “I don’t think that’s good policy in this case, and I think being uncooperative with a federal agency is arrogance at its highest.”\nThe ultimate fate of Lara’s bill, which passed through the Senate Judiciary Committee on Tuesday, may rest again on the governor. With his first veto, Brown wrote that although he was troubled by reports of conditions at privately run facilities, he wanted to wait for a “more permanent solution” from the federal government. The Obama administration had announced plans to phase out contracts between the U.S. Bureau of Prisons and private prison corporations, and to reconsider its use of private immigration detention facilities.\nThe Trump administration is moving in the opposite direction.\nSo as legislators debate Senate Bill 54—which would turn California into a “sanctuary state” by preventing law enforcement officers from cooperating with ICE—this detention fight over SB 29 opens up yet another front in the battle between Sacramento and Washington.\nAlthough the U.S. immigration detention program is the largest single incarceration system in the country, its facilities are often leased. Of the 10 long-term immigration detention facilities in California, none are federally owned: five are county jails, one is a city facility, and the remaining four are owned and operated by for-profit companies. By cobbling together data from public records requests and publically available documents, as well as interviews and site visits, the immigration rights group Community Initiatives for Visiting Immigrants in Confinement estimates that privately-run jails make up 75 percent of all the bed space across California’s long-term immigration detention system.\nSome of those incarcerated in this system have past criminal records, but immigration violations themselves are civil rather than criminal matters—and so detainees in immigration court are not entitled to court-appointed legal counsel. Awaiting their hearings or deportation, detainees may spend weeks, months, or in rare cases years, in custody.\nSupporters of Lara’s bill consider it a necessary remedy to a system too opaque and unaccountable. Orange County’s Theo Lacy Facility, for example, has a history of accusations that it failed to comply with ICE detention standards. A Los Angeles Times article last year featured a former detainee who said he was mistreated and given substandard medical treatment. Likewise, a 2013 report from ICE’s Office of Detention Oversight cited the facility for improper management of detainee complaints, broken telephones, one incident of improper use of force, and eight other violations, some of which reappeared in the latest inspection report.\nIf detention facilities don’t follow the ICE standards, “there really aren’t any repercussions,” said attorney Grisel Ruiz of the Immigrant Legal Resource Center. “It’s just not an effective mechanism to hold facilities accountable.”\nThe Orange County Sheriff’s Department disagrees. Custody operations Commander Jon Briggs said that the facility is evaluated by ICE’s Office of Detention Oversight every year, and that its most recent report returned “a clean bill of health.”\n“Obviously when anyone does an inspection like this, it’s not ignored and it’s not neglected,” said Assistant Sheriff Bob Peterson. “But ultimately, as it relates to the ICE detainees, we’re in a contract with them and ICE can make the determination….We each have the ability to withdraw from this agreement.”\nBut with the election of Donald Trump, who has made aggressive immigration enforcement a cornerstone of his presidency, ICE will probably need all of the beds it can get. In a memo last month, Homeland Security Secretary John Kelly advised that undocumented immigrants should be detained—rather than released under supervision—whenever possible.\n(Detainee figures via Community Initiatives for Visiting Immigrants in Confinement.)\nEasier said than done. With the political tide in California turning against local cooperation with ICE, cities and counties here may be reluctant partners. When the Contra Costa County Board of Supervisors recently voted to expand its West County Detention Facility, parts of which are also rented out for immigration detention, immigration rights groups turned out en masse.\nCounty Supervisor Karen Mitchoff, who voted for the bigger jail, said the expansion “has nothing to do with ICE,” but was instead about providing better facilities for mentally ill inmates. Even so, she defends the contract between the Contra Costa Sheriff’s Department and ICE.\n“The people who are opposed to the ICE contract feel that we’re balancing our budget on the backs of those who may be here illegally,” she says. “That’s a policy decision and a philosophical conversation for another day. The money that the sheriff earns from the contract stays in the sheriff’s department and helps him to provide more services to the citizens of Contra Costa County.”\nLast year, Santa Ana’s city council voted to stop renting jail space to ICE.\nWith more city and county facilities off-limits and existing facilities crowded, ICE is relying on the private sector.\nSince Trump’s election, the stock prices of GEO Group and CoreCivic, the country’s two largest private prison and immigration detention operators, have increased by 87 percent and 125 percent, respectively.\n“If there’s going to be a spike in detention in a relatively short period of time, recent history shows that the only way the government can actually detain those people is if private prisons provide the beds,” says Anita Sinha, an assistant professor of immigration and civil rights law at American University.\nNot in California, if SB 29 prevails.\n“For-profit facilities are inherently problematic because they are incentivized to hold as many people as possible with the lowest standards in the cheapest manner allowed by law in order to maximize profits,” Sen. Lara told the Senate Judiciary Committee.\nThe bill would not interfere with existing contracts—nor with arrangements like the one between ICE and CoreCivic, which owns and operates the Otay Mesa facility in San Diego. But for the handful of California towns that act as middleman between ICE and private detention companies, SB 29 would mean the end of a potentially important source of revenue.\nMore than any other locality in the state, this describes Adelanto. Straddling a two-lane freight route 45 miles north of San Bernardino, the town used to be known for orchards and an Air Force base. Now the local industry is incarceration. Adelanto hosts three jails and prisons, with two more in the works.\nAmong the existing lockups is the privately operated Adelanto Detention Facility, which exclusively houses ICE detainees and is the largest immigration detention center in the state. Though it’s owned by GEO Group, which purchased the facility from the city for $28 million in 2011, the City of Adelanto still holds the ICE contract and receives $1 per day per bed in “mitigation fees.” That puts a little under $1 million per year toward a $40 million budget. Between that facility and a nearby private jail, GEO Group hires roughly 100 locals in a city with a population of roughly 30,000 and a poverty rate of 40 percent.\nBut the facility has been a focal point of protest for immigrant rights activists. Since the Adelanto facility re-opened under GEO ownership in 2011, four ICE detainees in its custody have died, including a Nicaraguan immigrant who died this week in what authorities said was a suicide. After the death of Raul Ernesto Morales-Ramos in 2015, who died after surgery for colon cancer that went undiagnosed for much of his time behind bars, a federal investigation censured the facility for shoddy record keeping, months-long delays in medical care, and medical personnel with minimal expertise and unsuitable training.\nPrior to his arrival at the Adelanto Detention Facility, Morales-Ramos had been detained for three years at the Theo Lacy Facility in Orange County, which was also faulted in the report for a “critical lapse in care.”\nIf California prohibits cities and counties from contracting with private facilities, the Trump administration may react the same way it did to California’s proposed sanctuary state law. Indeed, the terms of debate are virtually identical: opponents of SB 29 claim that immigration enforcement is the province of the federal government, while supporters argue that the state is fully within its rights to set statewide law enforcement policies and to regulate facilities inside its borders.\n“The same constitutional principles apply,” says Deep Gulasekaram, a professor of constitutional and immigration law at Santa Clara University. “If the bill passes…I don’t know why there would be any reason why the state can’t control how sub-state actors choose to detain (or) incarcerate people.”\nLegal issues aside, how will this affect detainees themselves? If the state chooses to eliminate the majority of in-state detention capacity just as immigration enforcement agencies are ramping up enforcement across the country, private detention companies could cut cities and counties out of the deal and contract directly with ICE. Or ICE might simply locate detainees in a more receptive state.\n“If the goal is that we don’t house detainees, that’s going to cause some problems for the detainees,” said Sheriff Hutchens. “I think they’re overlooking the fact that in many cases (detainees are) being allowed to stay in the community where their family can still visit, as opposed to having to be sent to a private facility out of state.”\nBut some proponents of SB 29 contend that people who come to this country illegally or overstay their visas do not belong locked up in the same facilities with those accused of violent crimes.\n“From our perspective we would love to see this system entirely abolished,” says Grisel Ruiz, the immigration lawyer. “Until we can accomplish that, SB 29 is a great step in the right direction.”","url":"https://calmatters.org/articles/feds-seek-beds-lock-deportable-immigrants-california-may-try-thwart/"}
