{"authors":["Robin Hilton","Bob Boilen"],"date_download":"2018-10-22 20:19:06","date_modify":"2018-10-22 20:19:06","date_publish":"2016-01-20 00:00:00","description":"Our first new mix of 2016 includes a David Bowie cover from Glen Hansard, premieres from Ray LaMontagne, Thao & The Get Down Stay Down and Laura Gibson and more.","filename":"data/vaneerConsumption/NewMusicFromRayLaMontagneLuciusABowieCoverFromGlenHansardMore.json","image_url":"https://media.npr.org/assets/img/2016/01/20/collage20160120_wide-e6eb01a372f3f6bcc1928ac9db0bbced15d06c51.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_allsongs_2016_01_20_463700835_new-music-from-ray-lamontagne-lucius-a-bowie-cover-from-glen-hansard-more_1540239546.html","title":"New Music From Ray LaMontagne, Lucius, A Bowie Cover From Glen Hansard, More","title_page":"New Music From Ray LaMontagne, Lucius, A Bowie Cover From Glen Hansard, More : All Songs Considered : NPR","title_rss":"NULL","source_domain":"npr.org","text":"New Music From Ray LaMontagne, Lucius, A Bowie Cover From Glen Hansard, More\ntoggle caption Courtesy of the artists\nIt's our first show with new music in 2016! After nearly two months of best-of's, holiday and Sweet 16 specials, we get back to doing what we do best and love most: playing great new music. On this week's All Songs Considered, we share a new song by Tiny Desk alum AURORA, one of Bob's favorite discoveries from CMJ 2014. In a departure from the soft, whispered folk sounds of her early recordings, we showcase a song from Laura Gibson's upcoming, electrified record Empire Builder.\nIn fact, many of the songs picked this week by hosts Bob Boilen and Robin Hilton showcase the evolution and musical boundary-pushing of some of our favorite artists. Lucius took the experiences of its last two years on the road and channeled them into a massive pop sound for its record Good Grief. Thao & the Get Down Stay Down also trades in its playful folk for a heat-heavy, bass-driven sound.\nThe new year, and what the year has brought thus far, also weighed in on our hosts' minds. The week's opening cut, a stripped-down and staggeringly beautiful take on David Bowie's \"Ashes to Ashes\" performed by Glen Hansard, set another thread for the conversation: renewal. Hansard breathed new life into Bowie's synth pop ode to oddity. Laura Gibson found tragedy and rebirth in her move from Portland to the Big Apple. And we premiered an inspired new song from Ray LaMontagne's upcoming LP Ouroboros, a reference to a symbol for destruction and renewal.","url":"https://www.npr.org/sections/allsongs/2016/01/20/463700835/new-music-from-ray-lamontagne-lucius-a-bowie-cover-from-glen-hansard-more"}
