{"authors":["Saidah Blount","Daoud Tyler-Ameen"],"date_download":"2018-10-22 20:15:24","date_modify":"2018-10-22 20:15:24","date_publish":"2016-08-09 00:00:00","description":"When hosts Bob Boilen and Robin Hilton are away, NPR Music's Saidah Blount and Daoud Tyler-Ameen hack past the All Songs firewall and take over the show.","filename":"data/vaneerConsumption/NewMixBloodOrangeNAOJoyceManorFactoryFloorMore.json","image_url":"https://media.npr.org/assets/img/2016/08/09/collage20160809_wide-2d5500e631a44631bc333af1c9184f2ee5bf27b1.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_allsongs_2016_08_09_489326161_new-mix-blood-orange-nao-joyce-manor-factory-floor-more_1540239324.html","title":"New Mix: Blood Orange, NAO, Joyce Manor, Factory Floor, More","title_page":"New Mix: Blood Orange, NAO, Joyce Manor, Factory Floor, More : All Songs Considered : NPR","title_rss":"NULL","source_domain":"npr.org","text":"New Mix: Blood Orange, NAO, Joyce Manor, Factory Floor, More\ntoggle caption Courtesy of the artists\nThis week, we've got a surprise: Bob Boilen and Robin Hilton both went on vacation and left the All Songs studio unlocked. Apparently neither one of them uses two-step verification, so it took only a very minor effort for a couple of highly skilled NPR Music team members, Daoud Tyler-Ameen and Saidah Blount, to hack into the elaborate system of tubes, funnels and hamster wheels that feed podcasts from our microphones into your earbuds for a very special takeover edition of All Songs Considered.\nDaoud last visited the show to play some foot-stomping power-pop, and Saidah was our copilot for this year's South By Southwest festival preview. Together they dissect new music from California punks Joyce Manor, sounding more fleshed-out and anthemic than ever; slow-burning electro-soul from London songwriter Nao; a hip-hop track by two South Asian MCs that's as funny as it is uneasy about our current political moment and more. (And because Daoud and Sai grew up in the '80s and '90s, reference is made to JNCO jeans, black lipstick, the old THX logo theme and the end credits of the 1995 Power Rangers film. Things get ... specific.)","url":"https://www.npr.org/sections/allsongs/2016/08/09/489326161/new-mix-blood-orange-nao-joyce-manor-factory-floor-more"}
