{"authors":["Nuzha Nuseibeh"],"date_download":"2018-10-30 22:52:49","date_modify":"2018-10-30 22:52:49","date_publish":"2014-08-14 17:05:39","description":"Yes, the term \"amazeballs\" is now, officially, in the dictionary. So's YOLO, humblebrag, and uh, side boob. ICYMI, Oxford Dictionaries updated its database Wednesday to include a whole slew of your familiar millennial lingo, so you can now just…","filename":"data/vaneerConsumption/NewOxfordDictionariesWordsIncludeSideBoobYOLOSoThanksDrake.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/274561f0-896f-4e61-a1b4-050683ac1a06.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35767-new-oxford-dictionaries-words-include-side-boob-yolo-so-thanks-drake_1540939969.html","title":"New Oxford Dictionaries Words Include \"Side Boob,\" & \"YOLO,\" So Thanks, Drake","title_page":"New Oxford Dictionaries Words Include \"Side Boob,\" & \"YOLO,\" So Thanks, Drake","title_rss":"NULL","source_domain":"bustle.com","text":"Yes, the term \"amazeballs\" is now, officially, in the dictionary. So's YOLO, humblebrag, and uh, side boob. ICYMI, Oxford Dictionaries updated its database Wednesday to include a whole slew of your familiar millennial lingo, so you can now just refer your parents to the Oxford Dictionaries site the next time they reply to a text with a panicked \"??\".\nBefore you get too excited, let's be clear: This isn't the Oxford English Dictionary, that austere, dusty-looking thing you can find in a library. This is the OED's younger, hipper cousin — still part of the Oxford University Press, but you know, keeping up with the times. Even its announcement is hip and new and awesome:\nWe don’t mean to humblebrag, but the August update to OxfordDictionaries.com is bare good and nailed on to interest and impress you. Throw an air punch or have a bro hug (don’t be cray and throw shade or show us the side-eye); be a baller and join the hyperconnected vocabulary fandom.\nAdded to the Oxford Dictionaries as of Wednesday are also some potentially less familiar words, like spit-take (\"an act of suddenly spitting out liquid one is drinking in response to something funny or surprising\"); clickbait (\"content, especially that of a sensational or provocative nature, whose main purpose is to attract attention and draw visitors to a particular web page\") and, er, pharmacovigilance (\"the practice of monitoring the effects of medical drugs after they have been licensed for use, especially in order to identify and evaluate previously unreported adverse reactions\").\nThe way it chooses the words that it adds is only slightly less intense than the OED. While the OED strives to be historical, with each word meaning \"spanning perhaps many centuries, from the earliest recorded appearance to the most recent recorded usage,\" the Oxford Dictionary mainly relies on an electronic collection of online text called the Oxford English Corpus. This, along with something called the Reading Programme — which is another electronic collection, this one made up of all types of writing, even song lyrics — is scoured by software that looks for repeated usage and patterns. Evidently, \"neckbeard\" is used a lot.\nSaid Oxford Dictionaries editor Katherine Connor Martin to The Bookseller:\nOne of the advantages of our unique language monitoring program is that it enables us to explore how English language evolves differently across the world.Naturally, many words are used in similar frequencies in the UK and US, for instance the informal additions amazeballs and neckbeard.However, some new slang and informal words catch on much more quickly in a particular variety of English – for instance, in our monitoring sample, side boob is more than 10 times more common in the UK than in the US (although this is due in part to its frequent use in the British media), whereas adorbs is used about four times more often in the US as in the UK.\nThat doesn't mean that OED doesn't also try to keep up with our rapidly changing lingo, though. Some of the OED's more surprising additions from its latest update (June 2014) include \"Goddammit,\" \"selfie,\" \"Skype,\" and, for some reason, \"coffee grinder.\"\nSo WDYT, dudes?","url":"https://www.bustle.com/articles/35767-new-oxford-dictionaries-words-include-side-boob-yolo-so-thanks-drake"}
