{"authors":["Nick Enoch For Mailonline"],"date_download":"2018-10-23 00:47:13","date_modify":"2018-10-23 00:47:13","date_publish":"2017-03-16 10:16:24","description":"The Newquay Safe campaign, in which the police has joined forces with residents, councils and businesses, was extended in 2012 and a zero-tolerance approach was adopted.","filename":"data/vaneerConsumption/Newquaysboozebanturnsseasideresortintoghosttown.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/09/3E53401D00000578-0-image-a-32_1489658365471.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4319282_Newquay-s-booze-ban-turns-seaside-resort-ghost-town_1540255633.html","title":"Newquay's booze ban turns seaside resort into 'ghost town'","title_page":"Newquay's booze ban turns seaside resort into 'ghost town' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A police crackdown on mankinis and stag-party revellers prancing about in fake breasts has been blamed for Newquay turning into a 'ghost town'.\nOnce it was a byword for debauchery, with outrageous alcohol-fuelled antics - and some over-amorous couples had sea-breeze sex sessions on the beach.\nBut times have changed and clubbers are deserting the town in Cornwall because police and the council have now cracked down on the hi-jinks - with one nightclub manager saying the policy has 'crushed the party scene'.\nScroll down for video\nA police crackdown on mankinis and stag-party revellers prancing about has turned Newquay into a 'ghost town'\nWith its stunning beaches, cheap surf lodges and hotels, lax rules and more than ten nightclubs to choose from, Newquay was a magnet for clubbers from all over Britain - but now they are deserting the Cornish resort\n'The council and police have made provisions over the past four or five years to crush the party scene,' said Alex Simms-Rosser, who moved to Newquay in early 2016 to manage Salt - a nightclub which has now closed due to lack of business\nThe decision to ban Borat-style mankinis has helped the seaside town shed its clubgoing, alcohol-fuelled image as a haven for stag and hen parties\nIn the 1990s and early 2000s, it was a place where youngsters flocked to party the summer away at clubs like Tall Trees, Fosters, Disco 5000, Steamers, The Beach, Berties, Sailors, Koola and Red Square. Above, a hen do out on the town\nIn the latest in a series of blows for the English Riviera resort, another of its once-popular nightspots is closing down.\nWith its stunning beaches, cheap surf lodges and hotels, lax rules and more than ten nightclubs to choose from, Newquay was a magnet for clubbers from all over Britain.\nIn the 1990s and early 2000s, it was a place where youngsters flocked to party the summer away at clubs like Tall Trees, Fosters, Disco 5000, Steamers, The Beach, Berties, Sailors, Koola and Red Square.\nBut in the past ten years, things have gradually changed after locals complained about rowdy behaviour.\nIn 2009, two clubbers died after falling from cliffs, when about 10,000 teenagers visited the town in July for post-exams holidays.\nThe tragedies led police to warn youngsters to stay away from the cliffs, specially if they had been drinking.\nThese days, fun-seekers are more keen to spend their money on festivals rather than night clubs. Above, a hen party at Newquay club Bertie's, which has now closed\nThe Newquay Safe campaign, in which the police has joined forces with residents, councils and businesses, was extended in 2012 and a zero-tolerance approach was adopted\nMost of the clubs have closed; the latest, called Salt, on Beach Road, is now available to let after the leaseholder shut down due to a lack of business. Above, revellers in the town\nThe police drive has made the resort more family-friendly by cracking down on obscene fancy dress, fake ID and street drinking\nThe following year, more than 20 'drunk and incapable' under-age holiday makers were sent home from the resort.\nThere was a drive to make the resort more family-friendly by cracking down on obscene fancy dress, fake ID and street drinking.\nThe Newquay Safe campaign, in which the police has joined forces with residents, councils and businesses, was extended in 2012 and a zero-tolerance approach was adopted.\nIn 2009, residents in Newquay marched in protest at a perceived lack of action following the deaths of two teenagers who fell from cliffs in separate visits to the holiday hotspot\nNow most of the clubs have closed; the latest, called Salt, on Beach Road, is now available to let after the leaseholder shut down due to a lack of business.\nAlex Simms-Rosser, who moved to Newquay in early 2016 to manage Salt, said he's sure more nightclubs will close in Newquay in the not too distant future thanks to the efforts to make the seaside resort more genteel.\n'This year I'm pretty sure there will be less choice with a good few establishments closing under the pressure of a terrible summer trade.\n'The council and police have made provisions over the past four or five years to crush the party scene.\nA typical night scene in the Newquay of old with clubgoers flooding the streets\nA more peaceful-looking Newquay is emerging from its once-hedonistic days\n'With large cutbacks and fewer police on the streets, they have opted to put into place no-nonsense strategies that make it less desirable to come to Newquay on any sort of booze-style party holiday - a scene that Newquay was famous for and that kept its economy going for many years.\n'The daytime in Newquay is now thriving with hundreds of families flocking back to the streets, which is totally the wrong demographic for the nightlife.\n'The town can no longer support the four nightclubs that are here - there simply isn't enough to go around.'\nHundreds of families are now flocking back to the streets of Newquay since the demographic shift (file pic)\nOfficers in Newquay say a determination to tackle excess drinking, public disorder and the wearing of mankinis has helped reduce crime and make the Cornish town a more family-friendly holiday destination\nHe also said young people today are more keen to spend their money on festivals rather than club nights.\n'Festivals truly are the new club scene' he said.\n'It was at its worst last summer on Boardmasters weekend. In previous years, you had a good influx of post-festival clubgoers filtering into town for the after parties.\n'Last year, due to the extended licence granted to the festival, an otherwise buzzing Newquay was an absolute ghost town.\n'The town can no longer support the four nightclubs that are here - there simply isn't enough to go around.'","url":"https://www.dailymail.co.uk/news/article-4319282/Newquay-s-booze-ban-turns-seaside-resort-ghost-town.html"}
