{"authors":["Wally Hall"],"date_download":"2018-10-30 18:01:55","date_modify":"2018-10-30 18:01:55","date_publish":"2016-10-19 00:00:00","description":"Until an email invited the newsroom to a small celebration, there was not even a remote idea that Wednesday was the 25th anniversary of the Arkansas Democrat-Gazette.","filename":"data/vaneerConsumption/Newspaperwarasourceforvividmemories.json","image_url":"https://media.arkansasonline.com/img/photos/2016/10/19/walter_hussman_halloween_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/arkansasonline.com/news_2016_oct_20_newspaper-war-a-source-for-vivid-memori__page=1_1540922515.html","title":"Newspaper war a source for vivid memories","title_page":"Newspaper war a source for vivid memories","title_rss":"NULL","source_domain":"arkansasonline.com","text":"Walter Hussman Jr. on Oct. 31, 1986, the day Gannett announces they are buying the Arkansas Gazette, after the press conference where Al Neuharth, Chairman of Gannett, says they will use their \"considerable resources\" to prevail in Little Rock. - Photo by Arkansas Democrat-Gazette File\nUntil an email invited the newsroom to a small celebration, there was not even a remote idea that Wednesday was the 25th anniversary of the Arkansas Democrat-Gazette.\nThe first newspaper after the newspaper.\nEven with Auburn on the horizon, it was impossible not to think back over the great memories of what was one of the greatest newspaper competitions in history, and that the sports section was a significant part of that.\nWhen Walter Hussman decided to challenge the Gazette -- and at that time there was a general feeling that three things were forever in Arkansas: Worthen Bank, the Gazette and the Arkansas Razorbacks -- it was to ensure the state would have two voices.\nCoverage of every sport on most levels was increased, and we did so many good things and were growing in circulation and advertising that in 1989 Orville Henry -- an institution at the Gazette and the man who did as much as anyone to make the Razorbacks a household name -- switched teams.\nHe had been sports editor of the Gazette since 1943.\nBefore going any further, it is not being said sports won the newspaper war. The newspaper war was fought by hundreds, starting with CEO and owner Hussman, to Paul Smith the general manager at the time, and every employee of the entire circulation, advertising, printing press and editorial departments.\nIt was truly a team effort, and in the moments after Hussman bought the Gazette from Gannett, he decided to add the Gazette to his masthead and kept the legacy of that newspaper alive.\nThere were too many great moments during that time to recall them all, but one that was near and dear was the day Smith called me to his office and asked whether I had ever heard of Hoop-D-Do.\nThree-on-three street tournaments were becoming a craze across the country, and Hoop-D-Do was a huge success in Dallas.\nWe want to do that here, Smith said.\nA couple of calls to friends in the Dallas media put me in touch with the founder of Hoop-D-Do, who told me he already had given the rights to someone else. There was a sickness in the pit of my stomach, but then he said, \"Val Hansen, he's a Realtor up there.\"\nHansen was called immediately and agreed to meet with me that afternoon.\nWe visited, and he wanted to meet with our promotions director, Estel Jeffery, and before that meeting was finished a deal was struck.\nSign up for free, daily email alerts from the Arkansas Democrat-Gazette\nUnderstand that the success of that tournament, which grew from 396 teams the first year to almost 3,000 the final year, was on Hansen and Jeffery. The main contribution by yours truly was in the first meeting when the question came up about where to get the backboards and goals.\nIt was suggested if perhaps materials were bought for them, the students at Metropolitan Career Tech Center might take the backboards on as a project. That's how Hansen came to own so many backboards and goals.\nThere were great highlights during the 10-year run, including a reunion of The Triplets -- Sidney Moncrief, Ron Brewer and Marvin Delph. The Nutt brothers entered as a team a few times. Hundreds of former high school and college players participated.\nThere was great competition on that usually steaming hot weekend, then Hansen decided to stop. It was simple: It had grown so big it was almost a year-round business, and he needed to concentrate on his real-estate business, which still thrives.\nIt was one of many great events and part of the sports history and newspaper war.\nSports on 10/20/2016","url":"https://www.arkansasonline.com/news/2016/oct/20/newspaper-war-a-source-for-vivid-memori/?page=1"}
