{"authors":[],"date_download":"2018-10-30 18:49:20","date_modify":"2018-10-30 18:49:20","date_publish":"2016-08-26 13:18:00","description":"The group that represents Georgia parents says Gov. Nathan Deal and state lawmakers are being “deceptive” and even “intentionally misleading” with the new wording they chose for November’s constitutional amendment affecting schools.","filename":"data/vaneerConsumption/newschoolballotlanguageintentionallymisleading.json","image_url":"https://www.ajc.com/rw/PortalConfig/np-free/assets/ajc/images/AJC_200x200.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local-education_pta-sl_e3aeec7588c238af6d5d0e780461419d__1540925360.html","title":"new school ballot language intentionally misleading","title_page":"Georgia PTA: new school ballot language intentionally misleading","title_rss":"NULL","source_domain":"ajc.com","text":"The group that represents Georgia parents says Gov. Nathan Deal and state lawmakers are being “deceptive” and even “intentionally misleading” with the new wording they chose for November’s constitutional amendment affecting schools.\nAmendment 1 on the Nov. 8 ballot would create a new statewide school district with a superintendent answering only to the governor. That superintendent would have the power to requisition local tax dollars and to take control of schools that consistently perform poorly on a measure derived from things like test results, attendance and graduation rates.\nCritics slammed the ballot measure itself as misleading when the two dozen words were authorized by lawmakers and the governor last year. Now, critics of the proposed “Opportunity School District,” or OSD, are critical of 14 new words published this week. Georgia Secretary of State Brian Kemp publicized what’s known as the “preamble” that will introduce voters to the ballot item. In some cases, it will be the first thing voters have read about the proposal and could influence how they vote. It was written by Deal and the leaders of the state House and Senate. It introduces the measure this way: “Provides greater flexibility and state accountability to fix failing schools through increasing community involvement.”\nThat, says the Georgia PTA, is simply untrue.\n“Parental and community involvement is not increased by or required by the OSD enabling legislation,” Lisa-Marie Haygood, president of the Georgia PTA, said Friday morning. She said “local communities” and their elected school boards are the most effective school stewards, and she noted that the constitutional amendment would allow the governor’s new superintendent to take local tax dollars for any school absorbed by the OSD. “Forcing local taxpayers to fund local schools in which their local school board (and by extension, the voters) have no voice is not the answer,” she wrote in an email to The Atlanta Journal-Constitution.\nDeal’s office said this to the AJC: “The question posed to voters is fair and accurate as the Opportunity School District will allow the state to intervene and rescue students trapped in chronically failing schools. Further, opposition has had plenty of opportunities to voice their suggestions and feedback throughout the legislative process and during the public Constitutional Amendments Publication Board meeting.”\nEven so, the PTA called on Deal and the other state leaders on the Constitutional Amendments Publication Board — Lt. Gov. Casey Cagle and House Speaker David Ralston —to re-write their preamble.\n“This deceptive language must not be allowed on the November ballot,” Haygood said. “If the Governor and state legislators believe the best way to fix struggling schools is to put them under state control and either close them or turn them over to charter schools, then let the language on the ballot reflect this initiative. As it stands, the preamble, and indeed, the entire amendment question, is intentionally misleading and disguises the true intentions of the OSD legislation.”\nTeachers at any school taken over by the OSD could be removed from the school’s employ. Teachers groups oppose the proposal. They also reject the ballot language and the new preamble.\n“What communities should understand is this amounts to a state takeover of their local public schools,” said Sid Chapman, president of the Georgia Association of Educators.\nDeal said this on Wednesday about critics of the proposal: “I would hope they would put the same amount of effort into making sure they don’t have any failing schools in their district. … Because if they don’t have any failing schools, they have nothing to worry about it.”\nSchool boards would lose control, and money, that flows to schools taken by the OSD, and a handful have openly opposed the ballot proposal. The Cherokee County school board will consider a resolution against it at their Sept. 1 meeting. A school district blog quoted school board member Mike Chapman’s dissatisfaction with the wording of the ballot question.\n“The language is all motherhood and apple pie, unicorns and rainbows,” he reportedly said. “It’s crazy what’s going on here.”\nThe AJC has created the The Ultimate Atlanta School Guide that lets you look at and compare critical data for every school in Georgia. You can find it at http://schools.myajc.com/#/schools.","url":"https://www.ajc.com/news/local-education/pta-slams-new-ballot-wording-opportunity-school-district-amendment/Km8NLKxmPjR8Jf1YCKPYXI/"}
