{"authors":[],"date_download":"2018-10-22 22:16:38","date_modify":"2018-10-22 22:16:38","date_publish":"2014-05-09 17:53:18","description":"After a scientist discovered the gymnast of the spider world, he decided to make a robot modeled on it.","filename":"data/vaneerConsumption/NewSpiderSpeciesCartwheelsDownSandDunes.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/432581/spider_1_1_c28cfc78470d4b8417910934739eed7c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/science_environment_new-spider-species-cartwheels-down-sand-dunes-n101641_1540246598.html","title":"New Spider Species Cartwheels Down Sand Dunes","title_page":"New Spider Species Cartwheels Down Sand Dunes","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"I caught the spider by hand, and I took it to my car — and in the morning, I tried to take a good photograph of the spider,\" Rechenberg said, adding that he then took the spider with him to Germany and showed it to arachnologist Peter Jäger, who determined that the animal was a new species.\nCebrennus rechenbergi looks similar to another spider species, Cebrennus villosus, which lives in Tunisia. Jäger distinguished C. rechenbergi from its Tunisian cousin by looking at minute differences in the sex organs of the spiders.\n\"However, the unique mode of locomotion also serves as a criterion to distinguish the species,\" Jäger said in a statement.\nThe spider propels itself off the ground and moves its legs in a flic-flac motion to go uphill, downhill or on level ground. On the other hand, its Tunisian relative moves only by rolling its body down sand dunes. In fact, the flic-flac moves propel the spider across the sand at some 6.5 feet per second (2 meters per second), which is twice as fast as its walking speed.\nC. rechenbergi is nocturnal and lives in the Erg Chebbi desert in southeastern Morocco, close to the Algerian border. To protect itself from the sun and predators, the animal weaves tubelike \"towers\" in the sand that are held together by silk threads.\nInspired by the spider's unusual movement mechanism, Rechenberg, a bionics expert, developed a 10-inch-long (25 centimeters) model of a spider robot. The robot — named Tabbot after \"Tabacha,\" which means spider in the Berber language — can move by both walking and turning somersaults, just like the creature it's modeled after.\n- Agata Blaszczak-Boxe, Live Science\nThis is a condensed version of an article that appeared in Live Science. Read the entire story here. Follow Agata Blaszczak-Boxe on Twitter . Follow Live Science @livescience, Facebook & Google+. Original article on Live Science.\nCopyright 2014 LiveScience, a TechMediaNetwork company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","url":"https://www.nbcnews.com/science/environment/new-spider-species-cartwheels-down-sand-dunes-n101641"}
