{"authors":["Abc News","More Daniel"],"date_download":"2018-10-30 00:51:43","date_modify":"2018-10-30 00:51:43","date_publish":"2018-10-28 06:04:36","description":"A fast-moving storm will deliver some rain on Sunday and Monday.","filename":"data/vaneerConsumption/NewstormtohitMidwestNortheastwithstrongwinds.json","image_url":"https://s.abcnews.com/images/US/noreaster-tree-ho-mo-20181028_hpMain_16x9_992.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/abcnews.go.com/US_storm-hit-midwest-northeast-strong-winds_story_id=58802548_1540860703.html","title":"New storm to hit Midwest, Northeast with strong winds","title_page":"New storm to hit Midwest, Northeast with strong winds - ABC News","title_rss":"NULL","source_domain":"abcnews.go.com","text":"The nor’easter that moved through the Northeast on Saturday brought significant coastal flooding, over 2 inches of rain in places and wind gusts over 60 mph.\nInterested in Weather? Add Weather as an interest to stay up to date on the latest Weather news, video, and analysis from ABC News. Add Interest\nSome the highest rainfall totals from the nor’easter included 2.56 inches of rain in Sussex County, Delaware, and 2.42 inches of rain in Atlantic County, New Jersey. Some of the highest wind gusts included one of 67 mph in Seaside Park, New Jersey and 62 mph near Lewes, Delaware. The storm also caused some significant coastal flooding, especially in New Jersey.\nThe nor’easter is losing its grip on the Northeast Sunday morning, though some lingering snow and rain showers remain in parts of New York and Pennsylvania. Some of the snow showers in extreme northern New York and northern Maine could bring some light accumulations -- mainly on the grassy surfaces. This low pressure system will slide off to north later Sunday with most of the unsettled weather ending in the afternoon.\nABC News\nHowever, another system is quickly developing in the Midwest and will race off to the east through Sunday. This new storm is bringing rain from Minneapolis, Minnesota, to Milwaukee, Wisconsin. The more notable and widespread impact will come from the wind. Wind gusts behind the cold front could reach up to 50 mph in parts of Minnesota and Iowa.\nABC News\nThe storm will race toward the I-70 corridor through the day Sunday and bring a quick hit of rain across parts of the northern Ohio Valley. Once again though, winds could gust from 30 to 40 mph from the Midwest to the southern Appalachian mountains, including Indianapolis; Louisville, Kentucky; and Knoxville, Tennessee. These gusty winds could cause scattered power outages in the region.\nABC News\nThe storm will move into New England by Monday morning and bring some additional gusty winds and rainfall to the Northeast fewer than 48 hours after being hit by the nor’easter.\nABC News\nThe good news is that the storm is moving very fast, and the winds look to be less intense by Monday morning. Some locally gusty winds are possible across parts of the mid-Atlantic through the morning hours.\nTemps on the rise\nTemperatures are a few degrees above average on Sunday in parts of the Southwest -- from Los Angeles to Las Vegas. However, in the Rockies, from Salt Lake City to Denver, temperatures are 10 to 20 degrees above average with highs Sunday expected to be in the 70s.\nABC News\nThe mild air will move into the central U.S. later this week and eventually it should reach the East Coast by the middle or end of the week.\nTemperatures in the I-95 corridor -- from Washington, D.C., to Boston -- could be a couple degrees above average by Wednesday and Thursday. This seasonably warm stretch would be the first round of milder weather for the region after several weeks of cold blasts.","url":"https://abcnews.go.com/US/storm-hit-midwest-northeast-strong-winds/story?id=58802548"}
