{"authors":["Associated Press"],"date_download":"2018-10-23 05:51:20","date_modify":"2018-10-23 05:51:20","date_publish":"2017-04-26 17:11:10","description":"NAIROBI, Kenya (AP) - At least 25,000 people were displaced after fighting in the town of Kodok, according to a spokesman for the humanitarian group Doctors...","filename":"data/vaneerConsumption/NewSouthSudanfightingdisplaces25000people.json","image_url":"https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4448432_New-South-Sudan-fighting-displaces-25-000-people_1540273880.html","title":"New South Sudan fighting displaces 25,000 people","title_page":"New South Sudan fighting displaces 25,000 people | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NAIROBI, Kenya (AP) - At least 25,000 people were displaced after fighting in the town of Kodok, according to a spokesman for the humanitarian group Doctors Without Borders, one day after the top United Nations official in South Sudan warned of a government offensive on the town.\nThe fighting has caused a reduction in humanitarian services and a shortage of water for the displaced, Phillippe Carr told The Associated Press. Civilians are fleeing to the nearby South Sudanese town of Aburoc, Carr said.\nOn Tuesday, there were reports of shelling in the town of Kodok and on Wednesday the town was feared deserted with military helicopters sighted nearby.\nSouth Sudan's government troops were on an offensive in Kodok and the Upper Nile region, head of the U.N. mission in South Sudan David Shearer told members of the Security Council on Tuesday. He warned that 70,000 civilians could be displaced.\n\"Virtually no part of the country is immune from conflict,\" Shearer told the 15-member body at the U.N. He added there \"has been no concerted effort by any party to adhere to a ceasefire.\"\nThe government offensive in Kodok appears to be one of the most significant so far this year, causing disarray among rebel leader Johnson Olony and his Shilluk forces. It is also expected to create a flow of civilians fleeing into neighboring Sudan.\nShearer told a press conference at U.N. headquarters in New York on Wednesday that \"there are increasing numbers of people crossing into Sudan\" from Kodok and he thanked the Sudanese government for opening corridors from the north of South Sudan.\nThe U.N. envoy said the number of people fleeing South Sudan reached about 60,000 per month in the first three months of the year.\nIf that rate continues, Shearer said, before the end of 2017 \"we'll have more than two million people who will be refugees.\"\nHe said religious leaders in the \"critical town\" of Torit in Eastern Equatoria in the south told him recently that 75 percent of the town's population had fled to Uganda.\nOn Wednesday, the chief monitor of the peace deal, former Botswanan President Festus Mogae, said South Sudan was experiencing \"a crisis within a crisis.\"\n\"Men, women and children are suffering and dying of starvation because the leadership at various levels is failing to prevent it,\" Mogae said.\nThe International Committee of the Red Cross also evacuated its aid workers from Kodok, spokeswoman Alyona Synenko told AP.\nA spokesman for South Sudan's military was not available for comment.\nThe attack on Kodok comes after a flurry of recent government offensives across South Sudan and questions the legitimacy of an August 2015 peace deal signed by President Salva Kiir.\nSince the August peace deal was signed the opposition has fragmented and the U.N. has noted the presence of ethnic cleansing and declared famine in two counties. Around 1 million people are at risk of starvation in South Sudan and more than 1.7 million people have fled the country.\n___\nAssociated Press writer Edith M. Lederer contributed to this report from the United Nations","url":"https://www.dailymail.co.uk/wires/ap/article-4448432/New-South-Sudan-fighting-displaces-25-000-people.html"}
