{"authors":[],"date_download":"2018-10-30 19:54:00","date_modify":"2018-10-30 19:54:00","date_publish":"2018-10-30 17:22:00","description":"Georgia’s booming film and television industry might see new talent emerge from the the DeKalb Entertainment Commission’s Entertainment Expo this weekend. And for the commission’s executive director Shelbia Jackson, the expo means training DeKalb residents to break in to the entertainment industry.","filename":"data/vaneerConsumption/NewtalentcouldemergeatDeKalbentertainmentexpo.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/11/27/Images/newsEngin.20544934_film-crew.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_dekalb-entertain_3f98c1dd4f7dc108d588928c40cb3c4b__1540929240.html","title":"New talent could emerge at DeKalb entertainment expo","title_page":"New talent could emerge at DeKalb entertainment expo ","title_rss":"NULL","source_domain":"ajc.com","text":"Georgia’s booming film and television industry might see new talent emerge from the the DeKalb Entertainment Commission’s Entertainment Expo this weekend.\nAnd for the commission’s executive director Shelbia Jackson, the expo — now in its second year — means training DeKalb residents to break in to the entertainment industry.\nIn the past year, OWN’s Greenleaf, The CW’s Black Lightning and FX’s Atlanta, helmed by Stone Mountain native Donald Glover, have all been filmed in DeKalb.\nA report from the DeKalb Entertainment Commission said the total impact of the film, television, music and digital arts industry on the county was $1.98 billion. That amount reflects the jobs and income created directly and indirectly by productions, as well as spending by employees within the county.\nTo keep that money in DeKalb means creating opportunities for residents in the area. In 2016, there were nearly 6,000 jobs as result of the county’s entertainment industry, according to the DeKalb Entertainment Commission’s report.\n“One of the issues is keeping our tax credit,” Jackson said. “If it goes away, the industry goes away.”\nParticipants at the expo will get a chance to pitch their television and film ideas, attend casting, legal and budgeting workshops with entertainment veterans and get professional headshots.\nThe expo also offers workshops for children looking to learn more about the entertainment industry, including one that allows them to put together a public safety announcement.\nALSO|DeKalb County: Entertainment industry has $2 billion economic impact\nTHINGS TO DO|Taste 500 wines at the Decatur Wine Festival this weekend\nELECTIONS|DeKalb sees ‘historic’ weekend early voting totals\nNot everyone attending the expo is looking to work in front of or directly behind the camera.\nNiki Williams, a freelance television and film accountant, said she attended last year’s workshop to learn more information about other aspects of the industry.\n“It gives me background on what each person does and how they connect to the whole industry,” Williams said in a phone interview with the AJC. Williams, 39, of Ellenwood, said she got in to the industry last year after seeing an advertisement for a class on Facebook for film accounting.\n“It was just a weekend and I just wanted to get an idea of how it was before I switched over,” said Williams, who worked as an accounting and treasury manager for Mirion Technologies in Smyrna before she transitioned to film.\nWilliams said she went to a meet and greet and soon after interviewed for a job in New Orleans.\n“I didn’t get the job, but they referred me to someone working on a CBS pilot and (that person) wound up hiring me,” she said.\nWilliams said she mainly handles purchase orders for vendors working on film sets. Right now, she is working with vendors attached to the book-turned-film project Just Mercy set to star Michael B. Jordan as author and lawyer Bryan Stevenson. Before then, she worked on an HBO pilot in Union City.\n“I basically go from project to project,” she said.\nWilliams said she is returning this year to gain more knowledge relevant to her craft and is bringing a few interns along with her.\n“You can never get enough information and resources to better anything you’re trying to do in your career path,” she said.\nThe expo, expected to draw nearly 250 participants, will be held from 9 a.m. to 3 p.m. Saturday at the ROAM Innovation Workplace: Perimeter Center at 1151 Hammond Drive and tickets can be purchased for $20 here. Students can get in to the expo for $15.\nMore:","url":"https://www.ajc.com/news/local/dekalb-entertainment-expo-could-your-ticket-film-career/VHxLDcpwKScJuDJjuy5vAO/"}
