{"authors":[],"date_download":"2018-10-22 20:34:12","date_modify":"2018-10-22 20:34:12","date_publish":"2014-05-02 14:03:35","description":"The \"House of Cards\" star lends his CGI presence to \"Call of Duty: Advanced Warfare.\"","filename":"data/vaneerConsumption/NewTrailerKevinSpaceyinCallofDutyAdvancedWarfare.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_18/415836/cgispacey_43749a6a83d36da25ac2a8138683380c.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/tech_gift-guide_new-trailer-kevin-spacey-call-duty-advanced-warfare-n95596_1540240452.html","title":"New Trailer: Kevin Spacey in 'Call of Duty: Advanced Warfare'","title_page":"New Trailer: Kevin Spacey in 'Call of Duty: Advanced Warfare' ","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nKevin Spacey took a break from playing a Machiavellian politician in \"House of Cards\" to play the Machiavellian head of a private military corporation in \"Call of Duty: Advanced Warfare.\"\nActivision has not revealed much about the game, but from the trailer released on Friday, it's clear that it will be set in the near-future, a violent world filled with totally sweet hover-bikes, crawling tanks, deadly drones, mech suits and cynical lectures about nation-building.\nMore information will be revealed on May 4. The trailer uses footage from Microsoft's Xbox One, so it's probably safe to assume the game will also be released on PlayStation 4. The game would be the second \"Call of Duty\" title released on those systems, following last year's \"Call of Duty: Ghosts.\"\nThe trailer doesn't reveal much about gameplay. Players will get to, um, climb walls with super-sticky gloves and blow things up! But a short teaser released by VICE and \"Call of Duty\" indicates that the new game won't shy away from politics.\nThe upcoming documentary \"Superpower for Hire\" explores the world of private military corporations (PMCs) like Blackwater (which changed its name to Xe Services in 2009 and then Academi in 2011). Four of the company's former security guards were charged with voluntary manslaughter by the U.S. Justice Department in 2013 after 14 unarmed citizens were shot dead in Baghdad's Nisour Square.\nThat is some pretty heavy stuff to tackle for a video game, although chances are the game will be light on policy discussions and heavy on things that go boom.\n\"Call of Duty: Advanced Warfare\" will hit stores on November 4.","url":"https://www.nbcnews.com/tech/gift-guide/new-trailer-kevin-spacey-call-duty-advanced-warfare-n95596"}
