{"authors":[],"date_download":"2018-10-22 21:14:47","date_modify":"2018-10-22 21:14:47","date_publish":"2014-06-02 21:14:19","description":"The new $4.1 billion facility is designed to serve 20 million passengers.","filename":"data/vaneerConsumption/NewTerminalatLondonsHeathrowAirportOpens.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_23/482671/140602-heathrowterminal1_fd132dd701f2a924c9d550cb3c23deca.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/business_travel_new-terminal-londons-heathrow-airport-opens-n120686_1540242887.html","title":"New Terminal at London's Heathrow Airport Opens","title_page":"New Terminal at London's Heathrow Airport Opens","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nWith the arrival of the first United Airlines flight on Wednesday, London Heathrow Airport’s newest terminal opens for business.\nTerminal 2 is also known as The Queen’s Terminal in honor of Her Majesty Queen Elizabeth II, who will stop by June 23 for a ribbon-cutting ceremony. The $4.1 billion (2.5 billion pound) facility is designed to serve 20 million passengers a year and has 28 gates, 7,106 seats, 33 shops, 17 restaurants and 634 toilets.\nEventually, 26 airlines, including all 23 Star Alliance carriers operating at Heathrow, will operate out of the new terminal, but to avoid the hiccups that accompanied the grand opening of Heathrow Terminal 5 in 2008, airlines will move over in phases through the end of the year. The new terminal will handle about 330 flights each day.\nDesigned by Madrid-based architect Luis Vidal, Terminal 2 has a footprint four times the size of Buckingham Palace and an undulating roof designed to deliver plenty of natural light to a two-tier international departures hall.","url":"https://www.nbcnews.com/business/travel/new-terminal-londons-heathrow-airport-opens-n120686"}
