{"authors":["Associated Press","Chris Summers For Mailonline"],"date_download":"2018-10-22 23:47:29","date_modify":"2018-10-22 23:47:29","date_publish":"2017-04-26 08:40:33","description":"President Donald Trump has opened an office in Washington for victims of crimes committed by immigrants, following up on a promise he made during last year's election campaign.","filename":"data/vaneerConsumption/NewUSofficeseekstoaidvictimsofcrimesbyimmigrants.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/27/17/3FAB205E00000578-0-image-a-26_1493311070205.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446684_Homeland-Security-formally-opening-immigrant-crime-office_1540252049.html","title":"New US office seeks to aid victims of crimes by immigrants","title_page":"New US office seeks to aid victims of crimes by immigrants | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A controversial new immigration-related hotline launched by President Donald Trump has been mercilessly trolled by people reporting UFOs and extraterrestrial sightings.\nThe VOICE service started yesterday to enable victims of crimes committed by immigrants to contact government officials.\nBut it has been heavily criticized, with opponents pointing out that studies show immigrants are actually far less likely to commit crimes than native-born US citizens.\nThe new office, run by the Department of Homeland Security, promises to help 'victims and their families who have been impacted committed by removable criminal aliens'.\nThe use of the word 'alien' in the Department of Homeland Security's aims has sparked widespread mockery\nTV alien Alf was among the characters who featured in memes and tweets mocking the new initiative\nThe launch coincided with Alien Day, which marks the classic 1986 science fiction classic Alien, which starred Sigourney Weaver\nThe VOICE service started yesterday to enable victims of crimes committed by immigrants to contact government officials\nPeople are being encouraged to report problems they suffer as a result of activity by 'removable criminal aliens'\nJabba the Hutt, from Star Wars, was cited as an alien as the VOICE initiative was mocked on Twitter\nThe new department has been trolled mercilessly by Twitter users over the use of the word 'alien'\nOne Twitter user posted a picture of the Power Rangers to troll the VOICE initiative launched yesterday by President Donald Trump\nPeople have been encouraged to report activity by 'removable criminal aliens'\nThe use of the word 'alien' prompted widespread mockery, with Twitter users and pranksters inundating the service with reports of menacing figures such as TV alien Alf, Star Wars characters and ET.\nThe launch coincided with Alien Day, which marks the classic 1986 science fiction classic Alien, which starred Sigourney Weaver.\nTrump made great play of the issue during the campaign and highlighted the case of Jamiel Shaw Jr, 17, who was murdered in Los Angeles by Mexican illegal immigrant Pedro Espinoza in 2008.\nEspinoza, a gang member who targeted Jamiel simply for wearing the color red in Arlington Heights, had been released from prison rather than being deported.\nKelly said the VOICE office would be used to keep victims informed of the immigration proceedings of suspects and generally walk them through the complicated and often drawn-out immigration court process.\nThe office will be staffed by Immigration and Customs Enforcement employees.\nKelly said victims of immigrant crimes had historically been ignored by the federal government and left without answers about a suspect's immigration proceedings.\nHe said the VOICE name is fitting because the government is giving 'for the first time a voice of their own to these victims.'\nBut the ICE officials will also aid victims of crimes attributed to immigrants living in the United States legally, a group that could include permanent residents.\nDuring the election campaign Trump was supported by Jamiel Shaw Sr (pictured, left) whose 17-year-old son was shot dead by an illegal immigrant in Los Angeles in 2008\nHomeland Security Secretary John Kelly (pictured) said the VOICE name is fitting because the government is giving 'for the first time a voice of their own to these victims'\nRep. Bennie Thompson, a Democrat from Missouri, said VOICE was a waste of money at a time when other threats face the country.\n'Doing this not only ignores the vast majority of the crime, but stokes racist and xenophobic fears while dividing the country,' said Thompson, the top Democrat on the House Homeland Security Committee.\nThe Trump administration has frequently highlighted crimes committed by immigrants in the country illegally and the cases receive widespread attention in pro-Trump news outlets, often more than comparable crimes committed by U.S. citizens.\nBut the administration has not provided statistics about the crimes or countered studies indicating that immigrants are less likely than native-born Americans to commit crimes.\nWhen asked how many crimes have been attributed to immigrants, Homeland Security spokesman David Lapan said 'too many.'\nBrent Wilkes, CEO of the League of United Latin American Citizens, said the office appears to be little more than an extension of Trump's rhetoric against immigrants.\n'It's pretty clear to me that the goal here is to do the kind of thing he did on the campaign trail,' Wilkes said.\nHe added the office is unnecessary because ICE has long had the authority to keep crime victims informed.\nTrump announced plans for the office in February. The unveiling Wednesday came as he highlights accomplishments ahead of Saturday's 100th day of his presidency. Immigration was his core issue in the campaign, but he has faced repeated setbacks on the issue.\nHomeland Security Secretary John Kelly, right, accompanied by acting Immigration and Customs Enforcement (ICE) Director Tom Homan, speaks during a news conference at ICE in Washington, Wednesday, April 26, 2017, to announce the opening of new Victims of Immigration Crime Engagement (VOICE) office. (AP Photo/Susan Walsh)\nHomeland Security Secretary John Kelly announces the opening of new Victims of Immigration Crime Engagement (VOICE) office yesterday\nCourts have blocked orders barring temporarily the admission of refugees and visitors from six Muslim-majority nations and stripping some federal funding from so-called sanctuary cities that the government says aren't cooperating with immigration authorities.\nPreliminary efforts to fund a border wall have encountered obstacles in Congress, and Trump backed away from his earlier insistence that a pending budget deal include more than $1 billion for a down payment on the wall.\nIt's unclear how much information ICE will be able to provide to crime victims given privacy protections afforded to immigrants depending on the nature of their immigration status and the details of their case.\nThe same executive order that called for creating VOICE also directed Homeland Security to overhaul its privacy policy and ensure that immigrants in the country illegally are not afforded the same privacy protections as U.S. citizens. The agency said its lawyers are still reviewing the policies.\nICE already maintains a publicly accessible internet site to track an immigrant detainee's location, but the immigration court system, run by the Justice Department's Executive Office for Immigration Reform, does not allow online access to case information.\nThe court's records are only accessible by telephone and someone looking for information must have an immigrant's registration number.","url":"https://www.dailymail.co.uk/news/article-4446684/Homeland-Security-formally-opening-immigrant-crime-office.html"}
