{"authors":["Stephen Matthews For Mailonline"],"date_download":"2018-10-23 02:06:10","date_modify":"2018-10-23 02:06:10","date_publish":"2017-04-26 13:00:46","description":"Edinburgh University experts say nanoparticles can travel from the lungs into the bloodstream and reach the cardiovascular system where they increase the likelihood of a heart attack or stroke.","filename":"data/vaneerConsumption/Newwarningondeadlynanoparticlesfromdieselfumes.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/16/3FA057C600000578-0-image-a-32_1493220223393.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-4447462_New-warning-diesel-fumes_1540260370.html","title":"New warning on deadly nanoparticles from diesel fumes","title_page":"New warning on deadly nanoparticles from diesel fumes | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Deadly pollutants can reach the bloodstream when they are inhaled through the lungs, researchers warn.\nNanoparticles created by fumes from diesel exhausts have recently been linked to heart disease - the world's leading killer.\nBut how they affected the cardiovascular system had long been a mystery until the new discovery by scientists.\nTiny particles created by diesel fumes and other pollutants have long been linked to heart disease - the world's leading killer\nNew studies in both humans and animals potentially explain the link between air pollution and heart attacks and strokes, experts say.\nThe World Health Organisation estimates in 2012, about 72 per cent of premature deaths related to air pollution were due to ischemic heart disease and strokes.\nPulmonary disease, respiratory infections and lung cancer were linked to the other 28 per cent.\nMany scientists have long suspected that fine particles, particularly black carbon, which is emitted from diesel exhausts, travel from the lungs into the bloodstream.\nBut evidence supporting the assumption in humans had been challenging to collect, until now.\nUniversity of Edinburgh researchers used a selection of specialised techniques to track the fate of inhaled gold nanoparticles.\nBut how these nanoparticles affected the cardiovascular system had long been a mystery until the new discovery by scientists (stock)\nSome 14 healthy volunteers, 12 surgical patients and several mouse models inhaled them, which have been safely used in medical imaging and drug delivery.\nSoon after exposure, the nanoparticles were detected in blood and urine, lead author Dr Mark Miller said.\nHe added: 'Importantly, the nanoparticles appeared to preferentially accumulate at inflamed vascular sites, including carotid plaques in patients at risk of a stroke.\nDIESEL FUMES LOWER GOOD CHOLESTEROL Diesel fumes raise the risk of heart attacks and strokes by damaging protective cholesterol in the body, research suggested earlier this month. Breathing in black carbon - the tiny sooty particles particularly linked to diesel exhausts - reduces levels of 'good' HDL cholesterol thought to protect the heart and arteries. A study of more than 6,500 people in the US found that just three months of exposure to high air pollution was enough to see HDL levels fall.\n'The findings suggest that nanoparticles can travel from the lungs into the bloodstream and reach susceptible areas of the cardiovascular system where they could possibly increase the likelihood of a heart attack or stroke.'\nFumes and toxins in polluted air are estimated to contribute to the deaths of 40,000 people in Britain every year.\nMedical experts are increasingly aware of the impact of diesel air pollution fumes on human health, including the risk of asthma, dementia and some forms of cancer.\nThe UK is notoriously bad at controlling air pollution, with 37 cities across Britain persistently breaching legal limits of air toxins.\nDiesel cars have been promoted since the 1970s as an environmentally-friendly choice because they emits less carbon dioxide, the greenhouse gas which causes global warming.\nSuccessive governments have put tax incentives on diesel cars, allowing drivers to pay less vehicle excise duty.\nBut in recent years scientists have realised that diesel also produces more of the tiny particles and nitrogen oxides that are damaging to human health.\nBlack carbon is one of these particles that are emitted in high levels from diesel engines.","url":"https://www.dailymail.co.uk/health/article-4447462/New-warning-diesel-fumes.html"}
