{"authors":[],"date_download":"2018-10-30 19:32:43","date_modify":"2018-10-30 19:32:43","date_publish":"2017-03-06 05:05:09","description":"Rating how Atlanta United’s players performed in Sunday’s 2-1 loss to the New York Red B...","filename":"data/vaneerConsumption/NewYorkRedBulls2AtlantaUnited1Playerratings.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p8/AJC/2017/03/06/Images/newsEngin.17980522_3C0A6284A.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_new-york-red-bulls-atlanta-united-player-ratings__1540927963.html","title":"New York Red Bulls 2, Atlanta United 1: Player ratings","title_page":"New York Red Bulls 2, Atlanta United 1: Player ratings","title_rss":"NULL","source_domain":"ajc.com","text":"Rating how Atlanta United’s players performed in Sunday’s 2-1 loss to the New York Red Bulls at Georgia Tech’s Bobby Dodd Stadium.\nThe rating system is 0-10, with 0 representing a meltdown and 10 representing a career-definining performance. These are meant to be used as conversation.\nGoalkeeper: Alec Kann, 6. Made an excellent save in the second half when he tipped a shot over the bar. Said he would like to have the shot that led to the corner over again.\nFullback: Tyrone Mears, 6. His cross led to Yamil Asad’s goal. He and Garza had some issues trying to play out of the Red Bulls’ press in the second half.\nCenterhalf: Michael Parkhurst, captain, 6. He and Pirez did a good job containing Bradley Wright-Phillips, the league’s leading scorer last year.\nCenterhalf: Leandro Pirez, 5. Earned a warning in the first half that may have taken away some of his aggressiveness. Grew into the game.\nFullback: Greg Garza, 5. Had some nice combinations of passes with Almiron and Asad in the first half. Also lost the ball a couple of times. Hit one stinging cross that no one could get on the end of.\nHolding midfielder: Carlos Carmona, 4. Played OK in the first half. His red card in the second half was silly.\nMidfielder: Julian Gressel, 4. Didn’t have nearly the influence on this game as he had on the preseason games. Hit a couple of nice passes, but was also caught on the corner kick by Daniel Royer. May have started because Chris McCann didn’t dress. He wasn’t deemed matchfit after missing some training this week while working on visa.\nMidfielder: Yamil Asad, 7. Scored Atlanta United’s only goal.\nMidfielder: Miguel Almiron, 6. Will wish that he tried to round the goalkeeper instead of chip him in the 2-on-1 situation in the second half. Had he scored, Atlanta United would have likely taken all three points.\nMidfielder: Hector Villalba, 5. Showed his speed a few times, but didn’t influence the game a great deal.\nStriker: Josef Martinez, 6. Despite being shorter than the defenders, did a decent job with his hold-up play.\n-\nSubstitutes\nCenterhalf Anton Walkes (on for Pirez), 5. Nothing he could about the own-goal charged to him. It was going to either go off him or Wright-Phillips.\nMidfielder Jeff Larentowicz (on for Gressel), NR. Didn’t have a chance to influence the match.\nKenwyne Jones (on for Villalba), NR. Didn’t have a chance to influence the match.","url":"https://www.ajc.com/sports/new-york-red-bulls-atlanta-united-player-ratings/ajE1Qma9s9epJXdpMML5jN/"}
