{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:52:55","date_modify":"2018-10-30 19:52:55","date_publish":"2015-10-05 14:47:23","description":"New York magazine claimed that the difficulty of pinpointing future criminals should cause the US to rethink its gun policy and consider making the entire country a gun-free zone.","filename":"data/vaneerConsumption/NewYorkMagazineTimetoTurnAmericaIntoaGunFreeZone.json","image_url":"https://media.breitbart.com/media/2015/09/Gun-Control-Rally-Indianapolis-Star-AP-Charlie-Nye.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_05__1540929175.html","title":"New York Magazine: Time to Turn America Into a Gun-Free Zone","title_page":"New York Magazine: Time to Turn America Into a Gun-Free Zone | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On October 2–the day after the heinous attack on innocents in the gun free facilities of Umpqua Community College–New York magazine claimed that the difficulty of pinpointing future criminals should cause the US to rethink its gun policy and consider making the entire country a gun free zone.\nThey cited Australia as an example of this approach. Ironically, a shooting took place in Australia around 4:30 p.m. on the very day that NY MAG was using the country as an illustration of the benefits of gun confiscation and controls. Fox News reported that the shooting took place in Sydney, leaving “at least two dead.”\nNevertheless, New York pressed forward by claiming that the difficulty of pinpointing who might pick up a gun and start shooting is reason enough to implement draconian gun control.\nThey quoted Columbia University psychiatrist Dr. Paul Appelbaum saying that trying to ascertain types of individuals who may develop criminal intentions is just too “broad” an approach to be viable. He said that trying to pin the blame on American culture is not really effective either, as details about “peculiar violence-prone aspects of American culture” may be “interesting in a descriptive sense, but… they [don’t] tell us much about what we should be doing about the problem.”\nIn the end, New York throws up its hands and points to Australia.\nThey turn to Appelbaum again who is ready to endorse the Australian approach with one caveat–he wants to be sure everyone knows that we should still expect to see mass shootings. Appelbaum said, “I don’t think anyone could say honestly that if we tighten up on the availability of guns and the ease of purchasing them, and reduce the number of weapons that are largely produced to kill large numbers of people, that the problem will go away completely.” He added, “Some people who will be able to get their hands on guns and be able to do horrible things with them” no matter what actions are taken.\nYet even with these admissions, Appelbaum still described the Australian example as one that is worthy of emulation.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/10/05/new-york-magazine-time-turn-america-gun-free-zone/"}
