{"authors":["James Dunn For Mailonline"],"date_download":"2018-10-23 02:31:29","date_modify":"2018-10-23 02:31:29","date_publish":"2016-01-28 17:18:30","description":"Eric Schneiderman (pictured) said his office's probe revealed that just 46 per cent of tickets for events are reserved for the public, according to data on the top-grossing shows in New York, 2012-2015.","filename":"data/vaneerConsumption/NewYorkAttorneyGeneralEricSchneidermansaysbuyingticketsisafixedgame.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/17/30AC5CA500000578-0-image-a-38_1454001504464.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3421378_New-York-Attorney-General-says-buying-tickets-fixed-game-vows-stamp-resale-massive-mark-ups_1540261889.html","title":"New York Attorney General Eric Schneiderman says buying tickets is a 'fixed game'","title_page":"New York Attorney General Eric Schneiderman says buying tickets is a 'fixed game' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"New York's Attorney General said that buying tickets is a 'fixed game' and vowed to tackle improper practice after an investigation highlighted glaring irregularities in the industry.\nEric Schneiderman said his office's probe revealed that just 46 per cent of tickets for events are reserved for the public, according to data on the top-grossing shows in New York, 2012-2015.\nThe investigation found that ticket bots - illegal software that allows people to buy large numbers of tickets - were being used by brokers who sold them on with profits of up to 1,000 per cent.\nNew York Attorney General Eric Schneiderman said his office's probe revealed that just 46 per cent of tickets for events are reserved for the public, according to data on the top-grossing shows in New York, 2012-2015\nTwo ticket bots were shown to have bought 15,087 tickets on December 8, 2014, for twenty U2 in the same tour across North America.\nThe probe also found that the vast majority of brokers buying and selling tickets to New York events are unlicensed.\nThe report drew attention to the increasing imposition of resale price floors, which fixes the bottom line for ticket prices.\nEfforts are also being made to have tickets sold on a single 'walled garden' market, as opposed to consumers having the option of buying these tickets from various resale platforms.\nThe investigation found that ticket bots - illegal software that allows people to buy large numbers of tickets - were being used by brokers who sold them on with profits of up to 1,000 per cent for events at world-famous venues like Madison Square Gardens (pictured)\nThe report also brought out recommendations for increased regulation of the ticketing industry, such as brokers providing their New York license numbers as a condition of using resale platforms.\nIt also advised promoters disclosing number of seats held and finding technological solutions to combat the ticket bots.\nIt further urged legislative action to implement reforms, such as imposing criminal penalties for ticket bot use and capping permissible resale markups, in addition to its outlined recommendations.\nThe report also advised ending the ban on non-transferable paperless tickets, giving buyers no recompense if they can no longer go to an event.","url":"https://www.dailymail.co.uk/news/article-3421378/New-York-Attorney-General-says-buying-tickets-fixed-game-vows-stamp-resale-massive-mark-ups.html"}
