{"authors":[],"date_download":"2018-10-30 21:04:11","date_modify":"2018-10-30 21:04:11","date_publish":"2016-12-30 17:57:00","description":"It’s New Year’s Eve. Do you know where your car is?","filename":"data/vaneerConsumption/NewYearsEveisNo2holidayforvehiclesbeingstolen.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/12/30/Images/newsEngin.17294619_BIZ_AUTO-SUBARU-REVIEW_6_MC.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_new-year-eve-holiday-for-vehicles-being-stolen__1540933451.html","title":"New Year’s Eve is No. 2 holiday for vehicles being stolen","title_page":"New Year’s Eve is No. 2 holiday for vehicles being stolen","title_rss":"NULL","source_domain":"ajc.com","text":"It’s New Year’s Eve. Do you know where your car is?\nNo, no one’s accusing you of having, um, misplaced it after a few too many adult beverages.\nThere’s an excellent chance it’s been stolen.\nNew Year’s Eve is the second most popular holiday among vehicle thieves, according to a “New Year’s Fun Facts” graphic compiled by Wallet Hub. Yeah, fun: In 2015, 2,227 vehicles were stolen while their owners were innocently watching the ball drop or whatever, . Only Halloween, when a whopping 2,238 vehicles went vamooski, was worse.\n(And don’t be getting all cocky if your car’s still right where you left it a midnight. Last year, a still very respectable 2,029 cars were stolen on New Year’s Day, good enough for sixth on the list).\nRELATED: Peach drop, peanut drop, possum drop: 9 only-in-Georgia New Year’s Eves\nWallet Hub’s figures come from the National Insurance Crime Bureau, which compiles an Annual Holiday Vehicle Theft Report covering 11 major holidays. The good news, if there is any, is that at least 2015 wasn’t 2013, when New Year’s Day ranked No. 1 for car thefts (2,184). On the other hand, New Year’s Eve ranked a piddling No. 9 in 2013 and has been climbing the list ever since (it also was No. 2 in 2014).\nTo sum up: New Year’s is not a good time for anyone worried about losing weight or their cars.\nStill, it appears even car thieves must take a holiday now and then: For the last three years, Christmas Day ranked 11th and last on the NICB naughty list. In 2015, “only” 1,620 vehicles were reported stolen on Christmas.\nAs far as anyone knows, none of them by a jolly fat man accompanied by eight tiny reindeer.","url":"https://www.ajc.com/news/new-year-eve-holiday-for-vehicles-being-stolen/XYbSvoPz3TyUeC2IJo9tbM/"}
