{"authors":["Adelle Nazarian"],"date_download":"2018-10-30 20:53:59","date_modify":"2018-10-30 20:53:59","date_publish":"2016-09-22 14:55:48","description":"As of Monday, voter registration forms are available in Yiddish thanks to the work of New York Assemblyman Dov Hikind (D-Brooklyn).","filename":"data/vaneerConsumption/NewYorkMakesVoterRegistrationFormsAvailableinYiddish.json","image_url":"https://media.breitbart.com/media/2016/09/Dov-Hikind.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_22__1540932839.html","title":"New York Makes Voter Registration Forms Available in Yiddish","title_page":"New York Makes Voter Registration Forms Available in Yiddish","title_rss":"NULL","source_domain":"breitbart.com","text":"NEW YORK — As of Monday, voter registration forms are available in Yiddish thanks to the work of New York Assemblyman Dov Hikind (D-Brooklyn).\n“Voting is the most important thing we can do in our democracy and whatever we can do to encourage people to fill out forms and make it easier to vote, we should do it,” Hikind (pictured) told Breitbart News. “For 15 to 20 years I’ve been talking about this and trying to get it done.”\nHikind had requested that the NYC Board of Elections make voter registration forms available in Yiddish back in December. His request was finally granted this week. “When I first looked at it, I said ‘wow, that’s cool!'” he told Breitbart News.\n“There are thousands of Yiddish-speakers in my district and New York State,” Hikind said. He also noted that the language is taught in Yeshivas and is spoken by Jews who come from the former Soviet Union.\n“I grew up in a home where we only spoke Yiddish with my mother and father,” Hikind told Breitbart News. He said Yiddish is commonly referred to as “mama loshen,” which translates to “the language of my mother.”\nOutside of the home, Yiddish is predominantly displayed on newspapers in newsstands ranging from places like Crown Heights, Borough Park, Williamsburg and Brighton Beach to Queens. Hikind told Breitbart News that another motivation to make the voter registration forms available in Yiddish is that they are available in so many different languages — Swahili, Bengali, Chinese, Korean, Spanish and Russian. “Why not do it for the Jewish community?” he posited.\nNew York is home to the world’s largest community outside of Israel.\n“It makes it easier for them to register and it’s about time we also did it for the Jewish community,” Hikind said, noting “It will make it easier for people who feel more comfortable in Yiddish to fill it out.”\nAnyone in New York State who is not yet registered to vote must postmark their applications no later than October 14 and it must be received by a board of elections no later than October 19 in order for them to be eligible to vote in the November 8 General Election.\nForms are available at Assemblyman Hikind’s office located at 1310 48th street (2nd floor).\nThey can also be downloaded online at http://www.nyccfb.info/PDF/nyc_votes/forms/YI_Registration_Form.pdf.\nAsked how to say “go out and vote” in Yiddish, Hikind said “geit aros an shtim.”\nFollow Adelle Nazarian on Twitter and Periscope @AdelleNaz","url":"https://www.breitbart.com/middle-east/2016/09/22/new-york-makes-voter-registration-forms-available-in-yiddish/"}
