{"authors":["Jennifer Newton For Mailonline"],"date_download":"2018-10-23 04:07:41","date_modify":"2018-10-23 04:07:41","date_publish":"2016-01-11 17:03:40","description":"The ambulance had been attending an emergency call out in Queens when it was struck by a white mini van which caused the vehicle to lurch forward and then hit and injure a paramedic.","filename":"data/vaneerConsumption/NewYorkdrunkdrivercrashesintoanambulancerespondingtoacall.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/16/300CEE7A00000578-0-image-a-12_1452530938987.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3394208_Suspected-drunk-driver-crashes-ambulance-responding-call-cardiac-arrest-hits-paramedic-New-York_1540267661.html","title":"New York drunk driver crashes into an ambulance responding to a call","title_page":"New York drunk driver crashes into an ambulance responding to a call | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A suspected drunk driver has been detained by police after he crashed his car into an ambulance responding to a call, which then hit a paramedic.\nThe emergency response vehicles had been attending an emergency in the Middle Village in Queens following reports of a person suffering a cardiac arrest.\nBut as the emergency workers were walking back to their vehicles, when a white mini can struck the ambulance head on.\nThe white mini van crashed head on into the ambulance which had been responding to a cardiac arrest call\nThe force of the collision even caused the ambulance to move forward a few feet, striking a paramedic who was placing his equipment back inside\nThe force of the collision even caused the ambulance to move forward a few feet, striking a paramedic who was placing his equipment back inside.\nThe driver, who was suspected of being under the influence of alcohol, fled his car and attempted to run away with his passenger.\nHowever, they were captured by emergency service workers, who were able to hold them at the scene.\nWhen the NYPD arrived, they were taken into custody before being transferred to Elmhurst Hospital with non-life threatenin injuries.\nThe driver, who was suspected of being under the influence of alcohol, fled his car and attempted to run away with his passenger but were eventually detained at the scene\nPictures showed the two suspects lying face down on the ground after being handcuffed by police.\nThe NYPD Highway Patrol was requested to respond to the hospital to test the driver for possible intoxication.\nMeanwhile the injured paramedic was evaluated at the scene before being taken to hospital, where his wounds were described as 'non-life threatening'.","url":"https://www.dailymail.co.uk/news/article-3394208/Suspected-drunk-driver-crashes-ambulance-responding-call-cardiac-arrest-hits-paramedic-New-York.html"}
