{"authors":["Joel B. Pollak"],"date_download":"2018-10-30 21:37:52","date_modify":"2018-10-30 21:37:52","date_publish":"2017-02-15 05:23:20","description":"Officials concluded there's \"no evidence\" Trump was \"colluding with the Russians on the hacking or other efforts to influence the election.\"","filename":"data/vaneerConsumption/NewYorkTimesAccusesthenExoneratesTrumpAidesoverRussia.json","image_url":"https://media.breitbart.com/media/2017/02/Spy-vs.-Spy-Flickr.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2017_02_14__1540935472.html","title":"New York Times Accuses, then Exonerates Trump Aides over Russia","title_page":"New York Times Accuses, then Exonerates Trump Aides over Russia","title_rss":"NULL","source_domain":"breitbart.com","text":"The New York Times published a story Tuesday evening claiming anonymous “aides” on President Donald Trump’s campaign had contact with Russian intelligence, citing classified information supplied by “four current and former American officials.”\nOddly, the Times reports that these officials concluded that there was “no evidence” they had seen that the “Trump campaign was colluding with the Russians on the hacking or other efforts to influence the election.” So there would seem to be no story.\nHowever, the anonymous officials were reportedly alarmed by the “amount of contact that was occurring while Mr. Trump was speaking glowingly about the Russian president, Vladimir V. Putin.” The Times does not report who initiated the contact.\nThe Times misreports at least one key piece of evidence. It claims: “At one point last summer, Mr. Trump said at a campaign event that he hoped Russian intelligence services had stolen Hillary Clinton’s emails and would make them public.”\nThat is not true: the “campaign event” was a press conference, and Trump’s comment was clearly a joke, as Breitbart News reported at the time — though that did not stop the media and the Hillary Clinton campaign from trying to make it a campaign issue.\nIn its report Tuesday, the Times also left out why the so-called “Russian hacking” of the Democratic National Committee (DNC) was important — namely, that emails released by Wikileaks revealed that Democratic Party officials had colluded with the Clinton campaign to ensure that Sen. Bernie Sanders (I-VT) did not win the presidential nomination. The information forced then-DNC chair Rep. Debbie Wasserman Schultz (D-FL) to resign. Later, several other officials also left the DNC.\nThe Times also suggests that the FBI is conducting an investigation of telephone calls made by the Trump campaign (about which Breitbart News speculated on Monday, to the disdain of left-wing critics). The Times’ sources provided no further details, leaving the rest to readers’ imaginations: “The officials would not disclose many details, including what was discussed on the calls, the identity of the Russian intelligence officials who participated, and how many of Mr. Trump’s advisers were talking to the Russians. It is also unclear whether the conversations had anything to do with Mr. Trump himself.”\nOn Monday — perhaps with advance knowledge of the Times story — a reporter asked White House Press Secretary Sean Spicer if he still stood by earlier claims that there had been no contact between campaign staff and “the Russians.” He did so.\nThe Times story mentions, and is sure to bolster, calls on Capitol Hill for deeper investigation of the Trump campaign and the White House.\nBut it will also heighten suspicions among those who are concerned about the leaking of classified information to liberal journalists in what appears to be a calculated manner to cause maximum political damage to the new administration.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.","url":"https://www.breitbart.com/politics/2017/02/14/russia-new-york-times-classified-info-says-trump-aides-spoke-russian-intelligence/"}
