{"authors":["Jeff Desjardins","Visual Capitalist"],"date_download":"2018-10-30 23:35:47","date_modify":"2018-10-30 23:35:47","date_publish":"2018-07-18 00:00:00","description":"The list of the world's 20 most-populated cities will look a lot different in 2100 than it does today.","filename":"data/vaneerConsumption/NewYorkCityisntevenonthelistoftheprojected20mostpopulatedcitiesin2100.json","image_url":"https://amp.businessinsider.com/images/5b4f7b5447680032008b46c4-960-480.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_new-york-city-isnt-even-on-the-list-of-the-projected-20-most-populated-cities-in-2100-2018-7_1540942547.html","title":"New York City isn't even on the list of the projected 20 most-populated cities in 2100","title_page":"    New York City isn't even on the list of the projected 20 most-populated cities in 2100 - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Flickr / Jared Kelly\nThroughout the course of human history, the biggest cities have always seemed impossibly large.\nFor many millennia, it was almost unfathomable for a city to sustain more than 1 million residents. In fact, it wasn't until the 19th century that the largest cities globally, such as London and Beijing, were able to consistently hold populations beyond that impressive mark.\nDespite this, in the modern era, we've quickly discovered that a city of 1 million people isn't remarkable at all. In China alone, there are now over 100 cities with a million people today - and as such, our mental benchmark for what we consider to be a \"big city\" has changed considerably from past times.\nTHINKING BIG\nJust like a city the size of modern Tokyo was hard to imagine for someone living in the 19th century, it can be an extremely difficult thought experiment for us to visualize what future megacities will look like.\nResearchers at the Global Cities Institute have crunched the numbers to provide us with one view of the potential megacities of the future, extrapolating a variety of factors to project a list of the 101 largest cities in the years 2010, 2025, 2050, 2075, and 2100.\nToday's video uses this data - it's also an extension to the previous work we did based on the report here.\nTHE LARGEST MEGACITIES BY 2100\nAccording to the report, human geography will look completely unfamiliar by the turn of the century.\nHere is a list of the 20 largest megacities projected for 2100:\nUnknown\nBy the year 2100, it's estimated that 13 of the world's largest megacities will be located in Africa. Meanwhile, India will hold three of them - and there will be zero of them found in the Americas, China, or Europe.\nHere's a final look at the top three:\n#1: Lagos, Nigeria Nigeria's largest city, Lagos, is expected to push the limits of how big a metropolis can get. Already, Lagos has seen explosive growth over the past few decades, and is growing so fast that no one really knows how many people live there. Over 2,000 people emigrate to the city every day, and current population estimates vary widely from 11 to 21 million inhabitants.\nEither way, by the turn of the century, Lagos is projected to have a population north of 88 million.\n#2: Kinshasa, DRC Kinshasa, the capital of the Democratic Republic of Congo is projected to be the second largest city in the world with a population of 83 million.\n#3: Dar Es Salaam, Tanzania Dar Es Salaam, a city on the coast of Tanzania, has a population of just 4.4 million today. By 2100, its population is projected to jump by a whopping 1,588%, putting the total at 74 million inhabitants.","url":"https://www.businessinsider.com/new-york-city-isnt-even-on-the-list-of-the-projected-20-most-populated-cities-in-2100-2018-7"}
