{"authors":["Awr Hawkins"],"date_download":"2018-10-30 19:52:44","date_modify":"2018-10-30 19:52:44","date_publish":"2015-10-04 19:40:29","description":"New York Daily News: State Department Must Designate The NRA A Terrorist Organization","filename":"data/vaneerConsumption/NewYorkDailyNewsStateDeptMustDesignatetheNRAaTerroristOrganization.json","image_url":"https://media.breitbart.com/media/2015/10/NRA-hat-Getty.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_10_04__1540929164.html","title":"New York Daily News: State Dept Must Designate the NRA a Terrorist Organization","title_page":"New York Daily News: State Dept Must Designate the NRA a Terrorist Organization | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On October 3–two days after a gunman killed 10 at the gun free facilities on the Umpqua Community College campus–the New York Daily News called for the U.S. State Department to designate the National Rifle Association (NRA) a “terrorist organization.”\nThey based this request on their belief that national security faces a greater threat from armed citizens than from “foreign terrorists,” and they singled out the NRA as the bulwark preserving citizens’ right to keep and bear arms. They suggested, “The NRA should take its rightful place on the State Department list of terrorist organizations, because its influence is more of an immediate threat to the lives of our citizens than foreign terrorists.”\nTo be on the State Department’s list of designated terror organizations a group has to be state-sponsored for terrorism–which the NRA is not. Moreover, they do not exist for terrorist reasons. Rather, they exist to defend the civil liberties protected by the Second Amendment. Undaunted by these things, the NYDN simply declares the NRA a “terrorist group” and suggests it falls under the State Department’s purview by being “nearly-state sponsored.”\nThe NYDN added, “Although the NRA is not an officially state-sponsored organization it is the supporter of the state with its massive member and lobbyist donations to our elected officials.”\nThey remind readers that “murdered Americans killed by…lunatic gun slingers include terrified children calling for their mothers, teachers begging for the lives of their students, students begging for not just their own lives but the lives of their classmates, moviegoers looking for escape, bystanders cheering for athletes, athletes trying to be the best they can be as the worst we ever could have imagined struck them down in cold blood.”\nNo mention is made that the children, teachers, and students shot in schools were shot in gun free zones by gunmen who knew their victims could not return fire. Moreover, no utterance given to the fact that the NRA was a leading voice in calling for a change in the gun free policies following the heinous attack on Sandy Hook–they wanted laws changed so teachers could quit begging for their lives and start keeping a gun close at hand with which to defend their lives and the lives of their students.\nOn December 21, 2012–one week after the attack on Sandy Hook–the NRA’s Wayne LaPierre said;\n…Politicians pass laws for Gun-Free School Zones. They issue press releases bragging about them. They post signs advertising them. And in so doing, they tell every insane killer in America that schools are their safest place to inflict maximum mayhem with minimum risk. How have our nation’s priorities gotten so far out of order? Think about it. We care more about our money, so we protect our banks with armed guards. American airports, office buildings, power plants, courthouses — even sports stadiums — are all protected by armed security. We care about the President, so we protect him with armed Secret Service agents. …Yet when it comes to the most beloved, innocent and vulnerable members of the American family — our children — we as a society leave them utterly helpless, and the monsters and predators of this world know it and exploit it. That must change now!\nThe NRA’s position is that faculty and students with concealed carry permits should have the option of being armed on campus so they can fight back. It is that simple.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/politics/2015/10/04/new-york-daily-news-state-dept-must-designate-nra-terrorist-organization/"}
