{"authors":["Chris Spargo For Dailymail.Com"],"date_download":"2018-10-23 00:57:46","date_modify":"2018-10-23 00:57:46","date_publish":"2017-04-26 11:00:24","description":"That arrangement, which was discovered following a review of public records, could put Trump at risk of violating an obscure constitutional clause according to come legal experts.","filename":"data/vaneerConsumption/NewYorkhoteldealshowshowpensionfundsenrichTrump.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/13/3F9F8B2600000578-0-image-a-18_1493208618853.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447050_A-New-York-hotel-deal-shows-public-pension-funds-help-enrich-Trump_1540256266.html","title":"New York hotel deal shows how pension funds enrich Trump","title_page":"New York hotel deal shows how pension funds enrich Trump | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Public pension funds in at least seven US states have invested millions of dollars in an investment fund that owns a New York hotel and pays one of President Donald Trump's companies to run the property.\nThat arrangement, which was discovered following a review of public records, could put Trump at risk of violating an obscure constitutional clause according to come legal experts.\nThe property in question is the Trump Soho Hotel and Condominium, a 46-story skyscraper in lower Manhattan that is owned by the Los Angeles investment group the CIM Group through one of its real estate funds.\nPayday: President Trump (abobe) is paid to run the Trump Soho by the same investment firm the manages hundreds of millions of dollars in public pensions from seven states\nGem: In 2015 and the first five months of 2016, Trump International Hotels Management LLC drew at least $3.1million from the Soho property (above)\nTrump Soho has become the hotel of choice for celebrities while visiting the Big Apple on press trips, drawing in some of the biggest stars in the world since opening its doors in 2008, including Rihanna, Jennifer Lawrence, Amy Adams and Demi Lovato to name a few.\nThe possible problem for Trump lies in the fact that state- and city-run pension funds have invested in the CIM fund and pay it a few million dollars in quarterly fees to manage their investments in its portfolio, which according to state investment records includes the Trump Soho.\nIn return for marketing and managing the hotel-condo, CIM pays Trump International Hotels Management LLC 5.75 percent of the Soho's operating revenues annually.\nThat payment chain merits closer scrutiny because it could put Trump at risk of falling foul of a little-known constitutional rule prohibiting the flow of money from states to the pockets of a sitting president, said five ethics and constitutional law experts in an interview.\nNo other public pension fund investments in Trump-affiliated businesses have been reported.\nThe White House referred comment to the Trump Organization, the parent conglomerate for Trump's businesses, which did not respond to repeated calls and emails for comment.\nWhile Trump turned over management of the Trump Organization in January to a trust controlled by his two elder sons, he still earns revenue from the Soho. That's because he still owns the businesses in the Trump Organization, including Trump International Hotels Management LLC.\nArticle II of the U.S. Constitution bars the president from receiving additional payments beyond his salary from state governments.\nThis so-called 'domestic emoluments clause' prohibits 'any other emolument from the United States, or any of them.'\nThis clause and a 'foreign emoluments clause' prohibiting similar payments from foreign governments have been thrust to the fore because of Trump's vast, complicated network of businesses, which ethics experts say has created unprecedented conflicts of interest.\nA group of constitutional and ethics experts have filed a lawsuit alleging Trump was violating both clauses by letting his hotels and other businesses accept payments from public officials. Trump said the suit was without merit.\nThe lawsuit does not refer to the CIM fund.\nThe group's April complaint cited dozens of violations, including foreign government leases and purchases at Trump´s properties in the United States, which have resulted in unknown amounts being paid to Trump since he was inaugurated.\nGetting jiggy with it: The Trump Soho has become the hotel of choice for celebrities while visiting the Big Apple on press trips since opening its doors in 2008 (Will Smith left, Nene Leakes right)\nFUNDS HAVE 5 MILLION MEMBERS\nThe Soho hotel-condo management contract is a significant revenue generator for Trump through his hotel management company. In 2015 and the first five months of 2016, Trump International Hotels Management LLC drew at least $3.1 million from the SoHo, and Trump received $3.3 million in income from the hotel management company, hotel records and campaign filings show.\nCIM said its policy is not to comment on its private funds, agreements, or the operations of its funds´ investments.\nThe state- or city-run pension funds are in California, New York, Texas, Arizona, Montana, Michigan and Missouri.\nThey have more than 5 million members - from state lawmakers in California to teachers in Texas and police officers in New York. They include the California Public Employees´ Retirement System, the nation´s largest public pension fund.\nThe pension funds' money accounts for about half of the total capital CIM raised from its investors to invest in the properties in the fund, including the Trump SoHo, according to the pension funds' financial records and SEC filings. CIM declined to disclose how many properties are in the fund.\nSome of the 11 pension funds contacted by Reuters declined to comment on the payment chain between them and Trump. Others referred the question to CIM, saying their investment in the CIM fund does not give them control over its asset acquisitions.\nSing: The Trump Soho is owned by the Los Angeles investment group the CIM Group through one of its real estate funds (Pharrell on left, Michelle Williams on rigth)\n\"UNCHARTED TERRITORY\"\nReuters presented its findings to six lawyers with expertise in constitutional law and emoluments issues.\nOne of the lawyers, David Rivkin Jr., associate White House counsel during the George H. W. Bush administration, said the public investments do not put Trump at risk of violating the Constitution.\nPayments clearly related to non-official activities that 'have nothing to do with the discharge of duties in office' are not emoluments, Rivkin said.\nThree, however, said if Trump financially benefited from a business whose owner drew millions of dollars in fees from U.S. states - in this case CIM - this presented a serious argument for a domestic emoluments violation.\n'If you take a step back and look at this transaction, it´s a payment chain from state pension funds to President Trump,' said Jed Shugerman, a law professor at Fordham University.\n'This looks like an emolument to me.'\nTwo other lawyers said the arrangement raised significant questions, but all depended on how broadly a court interpreted the constitutional clause.\n'We´re in largely uncharted territory on that front given that past presidents have gone to great lengths to avoid the kinds of issues we´re now confronting,' said Brianne Gorod, chief counsel at the Constitutional Accountability Center, a Washington research organization and public advocacy law firm.\nOf the 11 pension funds that were contacted for the story, none said they were prepared to divest from the CIM fund.\nThe Teacher Retirement System of Texas, which has invested $225 million in the CIM fund, said it was 'not our practice to comment on questions of this nature.'\nOne member of the Texas teachers' pension fund, Byron Hildebrand, 61, state secretary for the Association of Texas Professional Educators, however, said he would alert teachers across his state to the pension fund's exposure to the Trump hotel and call on the state to consider divesting.\nDivesting from the CIM fund would likely force the public pension funds to sell their CIM shares at a loss, said Tom Lopez, the chief investment officer of the Los Angeles Fire and Police Pensions, one of the pension funds in the CIM fund, which is also known as a real estate partnership.\nEven though the partnership´s returns on investment are overall quite strong, trying to sell interest in a 10-year-old partnership is like 'trying to sell a used car' explained Lopez.\nLopez noted that all the public funds invested in the CIM fund long before it acquired the Soho - and long before anybody thought Trump would become president.","url":"https://www.dailymail.co.uk/news/article-4447050/A-New-York-hotel-deal-shows-public-pension-funds-help-enrich-Trump.html"}
