{"authors":["Will Martin"],"date_download":"2018-10-30 20:31:57","date_modify":"2018-10-30 20:31:57","date_publish":"2016-12-30 00:00:00","description":"Inga Beale, the chief executive officer of the Lloyd's of London insurance market, is to be appointed a dame in the 2017 New Year's Honours list.","filename":"data/vaneerConsumption/NewYearsHonours2017LloydsofLondonCEOIngaBealemadeadame.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_new-years-honours-2017-lloyds-of-london-ceo-inga-beale-made-a-dame-2016-12_1540931517.html","title":"New Year's Honours 2017: Lloyd's of London CEO Inga Beale made a dame","title_page":"    New Year's Honours 2017: Lloyd's of London CEO Inga Beale made a dame - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Inga Beale, CEO of Lloyd's. Reuters Inga Beale, the chief executive officer of the Lloyd's of London insurance market, is to be made a dame in the 2017 New Year's Honours list.\nBeale — a vociferous campaigner for LGBT rights, and possibly the City's most high-profile member of the LGBT community — has been given her honour \"for services to the Economy.\"\nAs the first female CEO in Lloyd's three-century history, Beale has helped shape one of the City of London's most important business areas.\nA recent Financial Times profile of Beale noted that as CEO she \"has focused on modernising the 328-year-old institution, embracing technology and diluting its traditional boys' club culture.\"\nBeale also assists both the British government and London Mayor Sadiq Khan in advisory roles.\nShe sits on the government's Financial Services Trade and Investment Board, and on Khan's Business Advisory Board — a venture set up in the aftermath of the Brexit vote to assist in Khan's commitment to being the \"most pro-business Mayor London has ever seen.\"\nWhile Beale's appointment as a dame is for work in the business community and her contributions to the British economy, her efforts to promote diversity in the workplace are also noteworthy.\nBeale is openly bisexual and uses her position of power to lobby for equality for the lesbian, gay, bisexual, and transgender (LGBT) community in the workplace. At Lloyd's, she has been instrumental in the launch of Pride@Lloyd's, an internal LGBT employee-resource group.\nShe was named as the most powerful LGBT executive in the world by networking group OUTstanding in 2015 and in 2016 she ranked 2nd.\nBeale is the most notable figure from the British business community to receive an honour, but numerous others have been granted titles. Among them are Stephen Dodgson, who has been given a knighthood for his work as Business Group Director of the government's UK Export Finance body, and Simon Walker, the director-general of business lobby group the Institute of Directors. Walker has been granted a CBE.\nIan Powell, the chairman of FTSE 100 outsourcing firm Capita, and ex-chairman of Big Four accountants PriceWaterhouseCooper will also receive a knighthood.","url":"https://www.businessinsider.com/new-years-honours-2017-lloyds-of-london-ceo-inga-beale-made-a-dame-2016-12"}
