{"authors":["Tony Lee"],"date_download":"2018-10-30 18:01:36","date_modify":"2018-10-30 18:01:36","date_publish":"2014-11-21 14:55:00","description":"The New York Times acknowledged on Friday that Republicans can win the White House without the Hispanic vote, especially since President Barack Obama will |","filename":"data/vaneerConsumption/NewYorkTimesRepublicansHavePathtotheWhiteHouseWithoutHispanicVoters.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Big-Government/2014/2016/Republicans/jeb-bush-upset-ap.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2014_11_21__1540922496.html","title":"New York Times: Republicans Have 'Path to the White House Without Hispanic Voters'","title_page":"New York Times: Republicans Have 'Path to the White House Without Hispanic Voters' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The New York Times acknowledged on Friday that Republicans can win the White House without the Hispanic vote, especially since President Barack Obama will no longer be on the ticket.\nThis analysis comes as Republican establishment operatives like Jeb Bush continue to push for massive amnesty legislation, believing that the GOP cannot win the White House without it. In fact, according to theTimes, the GOP’s best path back to the White House rests with white voters, especially Northern white voters.\n“Improving among white Northern voters is the core of the G.O.P. route to victory, regardless of whether the party makes gains with Hispanic voters,” a Times Upshot analysis concluded. “If the Republicans can’t make gains among white Northerners and hold Mr. Romney’s share of white Southerners, it just won’t really matter whether they receive 25 or 40 percent of the Hispanic vote.”\nThe Times‘ analysis determined that since the “Hispanic vote cannot single-handedly determine the presidency,” Republicans “have a path to the White House without Hispanic voters” even if it would be a bit more difficult:\nThis idea may seem jarring, given that Mitt Romney took just 27 percent of the Hispanic vote in his 2012 loss to Mr. Obama, according to the exit polls, while George W. Bush won about 40 percent in his 2004 victory. But in 2016 Hispanics will represent just 12 percent of eligible voters, and between 9 and 10 percent of actual voters. That’s a lot, but it’s not large enough to grant or deny Republicans the presidency. The math is simple: A 10-point gain among 10 percent of the electorate yields an additional point in the popular vote. Mr. Obama won by a 3.9-point margin in 2012. So even if the next Republican presidential candidate received the magical 40 percent of Hispanic voters that Mr. Bush received in 2004 — which seems unlikely in a fairly competitive national election — it still wouldn’t erase Mr. Romney’s deficit in the popular vote.\nObama actually “performed quite well among white voters outside of the South, easily winning overwhelmingly white states like Iowa, Minnesota, Oregon, Wisconsin and New Hampshire, which were all extremely competitive in one or both of the 2000 and 2004 presidential elections,” and Romney “could have entirely erased” Obama’s advantage “among Hispanic voters and still lost the presidency” because he lost in Virginia and Ohio. The Times noted Republican strategists completely misread exit polls from 2012 in which Obama lost white voters predominantly in the South. That prompted the Republican National Committee to push for comprehensive amnesty legislation right out of the gate in its “Growth and Opportunity Project” report after 2012.\n“The next Republican presidential candidate could fare better than Mr. Romney among white voters by retaining Mr. Romney’s strength among Southern white voters and merely returning to Mr. Bush’s showing in many areas north of the Mason-Dixon line,” the Times concludes. “The strong G.O.P. showing in the midterm elections was highly consistent with this pattern, with Southern Democrats barely outperforming Mr. Obama, and Republican candidates like Joni Ernst and Cory Gardner making big improvements over Mr. Romney’s performance among white voters, and particularly among white, rural voters without a college degree.”\nJust like a recent Pew Research report concluded, the Times notes that “Hispanic voters are disproportionately concentrated in noncompetitive states like Texas and California,” and “Hispanics represent more than 5 percent of eligible voters in just three battlegrounds: Florida, Nevada and Colorado.” In addition, since eligible Hispanic voters are younger than those from other groups, they will be less likely to be registered voters, especially in the handful of states where Hispanic voters could make a difference. That is why “a close look at demographic data and recent election results suggest that the Republicans do not necessarily need significant gains among Hispanic voters to win the presidency” even though winning the presidency without gains among Hispanics will be more difficult.\nIn the midterm elections, pro-enforcement and anti-amnesty Republicans in Texas and Georgia received at least 40% of the Hispanic vote, and the Times notes that “it is possible that the same dissatisfaction with the Obama administration that might help Republicans among Northern white voters might also allow them to make gains among Hispanic voters, even if Republicans don’t make any substantive changes on immigration.” Polls conducted by Pew Research and Univision have also found that immigration does not rank near the top of issues that are most important to Hispanic voters.\nSupporting massive amnesty legislation, though, may not bring Republicans gains among Hispanics and lose them the critical white vote. Recent polls have shown that a plurality of Americans–and 74% of voters in the midterm elections–disapproved of Obama’s executive amnesty.\nFormer President Bill Clinton, whose wife Hillary is primed to run in 2016, even concluded that Democrats could have been walloped even more in the midterms had Obama announced his executive amnesty before November.\n“It was a tough call for him because had he done so a lot of others would have lost by even more,” Clinton said last week at an anniversary event for his presidential library. “What that shows you is the people who were against us felt more strongly than the people who were for us. And the people who were for us just in all the din couldn’t hear what was actually a fairly coherent economic message coming out.”\nAccording to Politico, Obama’s executive amnesty is “bound to draw a backlash from middle-of-the-road white voters,” but Obama is going all-in and “making a dramatic and likely irreversible bet that the ultra-diverse Obama coalition will sustain the party through 2016 and beyond” and “voters with the longest memories will be those in the rapidly growing, next-generation national electorate, heavily inflected by socially progressive young people and a growing Latino population.”\nThat bet could backfire in 2016 on Democrats if Republicans oppose Obama’s amnesty.\nA recent Washington Post analysis also determined that “upcoming elections will see larger numbers of older voters,” and there is a strong “correlation between seeing more older Americans and voting more heavily against Obama.” As Breitbart News noted, the study emphasized that “as counties got older, they were slightly less likely to support Obama” and “as they saw increased populations of Hispanics, they were slightly more likely to.” And since the analysis concluded that there is a “very weak correlation between areas with increased Hispanic populations voting more for Obama and a very strong correlation (an r-squared value of .88, for those who care) between an increase in median age and less support for the president,” opposition “won’t put the GOP at much of a disadvantage.”\n“The party probably won’t see a surge in Hispanic voters in 2016, but the number of older white voters could very well offset that imbalance,” the Post concluded.\nBut those “older white voters” and working-class voters may stay at home if they are opposed to a Republican presidential candidate whose stance on amnesty is no different than Obama’s. In the end, perhaps that is what Obama and Democrats are gambling on occurring.","url":"https://www.breitbart.com/the-media/2014/11/21/new-york-times-republicans-have-path-to-the-white-house-without-hispanic-voters/"}
