{"authors":["Will Parker","The Real Deal"],"date_download":"2018-10-31 00:36:13","date_modify":"2018-10-31 00:36:13","date_publish":"2018-07-08 00:00:00","description":"Rents are skyrocketing in New York City, causing Pret A Manger and others to close some stores.","filename":"data/vaneerConsumption/NewYorkCityrentscausingfastfoodchainstoclosestores.json","image_url":"https://amp.businessinsider.com/images/5b3fc250d7751407398b4616-2732-1366.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_new-york-city-rents-causing-fast-food-chains-to-close-stores-2018-7_1540946173.html","title":"New York City rents causing fast-food chains to close stores","title_page":"    New York City rents causing fast-food chains to close stores - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Getty Images\nBritish grab-and-go food chain Pret A Manger announced Friday it was closing three stores in Manhattan.\n\"After opening a record number of shops in the U.S. last year, we've had a good look at the real estate and felt it necessary to close three New York locations whose rents made them unlikely to be profitable—125 Chambers Street, 437 Fifth Avenue and 38 West 48th Street,\" a company spokesperson told Commercial Observer.\nPret isn't alone. Panera Bread and Maison Keyser have also recently closed Manhattan locations, CO reported. And nationally, Starbucks and Chipotle announced they would have to close 150 and 65 stores, respectively.\nSome industry professionals think too many chains thought they could successfully compete in the Manhattan market. \"With all the amazing pastries, soups and sandwiches available in New York City, why on earth would anyone go to a Panera?\" said Newmark Knight Frank retail broker Jeffrey Roseman.\nRetail rents rose 50 percent in Manhattan between 2010 and 2017, according to a report from real estate firm CBRE.","url":"https://www.businessinsider.com/new-york-city-rents-causing-fast-food-chains-to-close-stores-2018-7"}
