{"authors":["Kristin Tate"],"date_download":"2018-10-30 21:11:37","date_modify":"2018-10-30 21:11:37","date_publish":"2014-08-28 12:50:13","description":"HOUSTON, Texas -- Business is booming and companies are hiring in Texas. As a result, the state is home to the fastest growing cities in the nation. New |","filename":"data/vaneerConsumption/NewYorkTimesSmearsTexas.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-Texas/2014/02/Texas-Capitol.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/border_2014_08_28__1540933897.html","title":"New York Times Smears Texas","title_page":"New York Times Smears Texas | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"HOUSTON, Texas — Business is booming and companies are hiring in Texas. As a result, the state is home to the fastest growing cities in the nation. New York Times‘ columnist Paul Krugman recently penned an op-ed called “Wrong Way Nation,” in which he attempted to downplay the factors causing Americans from around the country to pack up and move to Texas every month. Portraying the state in a wholly negative light, Krugman boiled down the migration pattern to one factor alone: cheaper housing costs in Texas. But the economist failed to consider other factors that bring flocks of Americans to the Lone Star State including immense job growth, low unemployment, lax regulation, and low taxes.\nKrugman correctly noted that large liberal cities–such as New York City, Los Angeles, and Chicago–have had stagnant growth over the last decade. Breitbart Texas reported earlier this year on statistics released by the federal government, showing that such liberal cities are losing people to Texas cities–most notably San Antonio, Houston, and Dallas–at a rapid rate.\nBut in Krugman’s view, this trend has nothing to do with Texas’ pro-business, low tax environment that has allowed companies to expand and prosper.\nHe wrote, “What the facts really suggest is that Americans are being pushed out of the Northeast (and, more recently, California) by high housing costs rather than pulled out by superior economic performance in the Sunbelt.”\nFailing to discuss all other factors, Krugman blamed Texas’ fast-growing population entirely on expensive housing in liberal cities. “Why are housing prices in New York or California so high? Population density and geography are part of the answer,” he wrote. “For example, Los Angeles, which pioneered the kind of sprawl now epitomized by Atlanta, has run out of room and become a surprisingly dense metropolis.\nKrugman did not address the various reasons why housing may be more affordable in Texas.\nVance Ginn, an economist at the Texas Public Policy Foundation, told Breitbart Texas that the state’s affordability is driven by the “Texas model of low taxes and smart regulations.”\n“Why do people move to Texas? Sure, some of it has to do with the high cost of living in other states, such as California which is 40% more expensive,” Ginn said. “But this high cost of living is driven in large part by high taxes and regulations that cause prices to be higher than they otherwise would be.”\nKrugman, however, was quick to dismiss the Texas model. He quipped, “America’s center of gravity is shifting south and west. But why? Is it, as people like [Governor Rick] Perry assert, because pro-business, pro-wealthy policies like those he favors mean opportunity for everyone? If that were the case, we’d expect all those job opportunities to cause rising wages in the Sunbelt, wages that attract ambitious people away from moribund blue states.”\nThe Times columnist said that wages in the states attracting migrants, such as Texas, are generally lower than wages in the states that migrants are fleeing from. While this may be true, Texas is a far more affordable state to live in than the blue states many are leaving.\nRelatively lax regulation in Texas has generally allowed businesses to expand quickly and operate effectively while spending less–lower costs are then passed onto consumers.\nAs businesses grow, they hire more people–another factor that is unquestionably enticing new implants from around the United States. Federal data shows that traditional leading markets like Los Angeles see roughly 10 percent of the population often unable to find a job. Texas, on the other hand, has an unemployment rate of just five percent.\n“55 percent of all jobs added in Texas since 2000 have been in the top two wage quartiles, according to a Dallas Fed report,” Ginn told Breitbart Texas. “Clearly, robust job growth in high paying positions are allowing more to prosper in the Lone Star State.”\nHe concluded, “These are reasons people move to Texas. It’s not because of the hot weather. It’s not just because it’s cheaper. It’s because it is the land of opportunity to better one’s livelihood and prosper. This is driven by the state’s model of limited government that unleashes the entrepreneurial spirit of all Texans.”\nFollow Kristin Tate @KristinBTate.","url":"https://www.breitbart.com/border/2014/08/28/new-york-times-smears-texas/"}
