{"authors":["Dailymail.Com Reporter"],"date_download":"2018-10-22 20:56:49","date_modify":"2018-10-22 20:56:49","date_publish":"2016-01-29 04:51:02","description":"Michael Morelli, 31, has been charged with filing a false report after he first told police he was attacked while cleaning a fire hydrant at 4am and later changed his story.","filename":"data/vaneerConsumption/NewYorksanitationworkerwhosaidhewasrobbedwassolicitingaprostitute.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/04/30AEFECB00000578-0-image-a-45_1454043041896.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422186_New-York-sanitation-worker-said-robbed-allegedly-soliciting-prostitute_1540241809.html","title":"New York sanitation worker who said he was robbed was 'soliciting a prostitute'","title_page":"New York sanitation worker who said he was robbed was 'soliciting a prostitute' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It is unknown if his alleged prostitution\nA New York sanitation worker who claimed he was robbed of his phone while cleaning snow was actually soliciting a prostitute, according to police.\nMichael Morelli, 31, first told police he was cleaning snow from a fire hydrant around 4am in Queens on Wednesday some someone ran up and grabbed him in a bear hug.\nMorelli said an accomplice then pistol-whipped him and took his phone. Afterward he was taken to a local hospital and treated for minor injuries.\nMichael Morelli, 31, has been charged with filing a false report after he told police he was robbed of his phone while cleaning snow at 4am in Queens on Wednesday\nAfter Morelli's phone was found and turned into the police, he changed his story.\nMorelli admitted he lost the phone during a fight he got into with two men, according to New York Daily News.\nIt is unknown if the fight was connected to Morelli allegedly soliciting a prostitute.\nMorelli has been charged with filing a false report.","url":"https://www.dailymail.co.uk/news/article-3422186/New-York-sanitation-worker-said-robbed-allegedly-soliciting-prostitute.html"}
