{"authors":["Darren Boyle For Mailonline"],"date_download":"2018-10-22 22:19:03","date_modify":"2018-10-22 22:19:03","date_publish":"2016-01-29 09:17:34","description":"Ras Alula Nagarit, pictured, is accused of attacking the woman on Tuesday at the Atlantic Avenue/Barclays Center station in Brooklyn. He is due to appear in court later today.","filename":"data/vaneerConsumption/NewYorksubwayslasherRasAlulaNagarithandshimselfintoNYPD.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/09/30B0248000000578-0-image-a-7_1454059038877.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422424_I-chop-Subway-slasher-suspect-hands-NYPD-attacking-woman-machete_1540246743.html","title":"New York subway slasher Ras Alula Nagarit hands himself into NYPD","title_page":"New York subway slasher Ras Alula Nagarit hands himself into NYPD | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"He is due to be arraigned at Brooklyn Criminal Court later this morning\nRas Alula Nagarit, 37, handed himself into the NYPD on Thursday\nThe victim took a photograph of her alleged attacker and gave it to police\nA man suspected of slashing a woman with a machete on the New York subway has handed himself into police after he allegedly threatened to 'chop up' his victim.\nRas Alula Nagarit is accused of attacking the woman on Tuesday at the Atlantic Avenue/Barclays Center station in Brooklyn.\nThe 37-year-old suspect handed himself in after the NYPD released a photograph taken by the victim moments before the attack.\nScroll down for video\nRas Alula Nagarit, pictured, has been charged in connection with Tuesday's subway attack in Brooklyn\nIt is alleged that Nagarit, pictured, told the victim 'I will chop you up' before slashing her with a machete\nNagarit, pictured, handed himself into police after the NYPD released photographs taken by the alleged victim\nThe woman told detectives that the suspect warned 'I will chop you up' before slashing her on the hand.\nThe pair were riding on a 3 train in Brooklyn at the time of the attack.\nAccording to the New York Post, Nagarit was charged with assault, criminal possession of a weapon and menacing. He is due to appear in Brooklyn Criminal Court for arraignment later this morning.\nThere have been at least five suspected slasher attacks on the subway since the beginning of the year.\nEarlier this week, Damon Knowles was charged with assault with intent to cause and serious physical injury.\nCarmen Rivera, a mother-of-three and grandmother-of-nine, was attacked on Monday morning on a southbound 6 train that was approaching the Bleecker Street station around 7.15am.\nDamon Knowles, 21, was taken into custody late on Tuesday night suspected of slashing Carmen River, 71\nCourageous: Carmen Rivera, a 71-year-old grandmother-of-nine, smiles as she returns to her home in the Bronx on Tuesday, one day after she was slashed by a stranger on her morning commute to work\nOptimistic: Rivera, who takes the same train to work each day, needed 30 stitches to close the four-inch cut\nDamon Knowles, pictured, was escorted to Manhattan Criminal Court where he was charged with the attack\nThe NYPD said a male passenger sitting across from Rivera lashed out at her. Both the man and Rivera got off at the next stop.\nFootage from inside the subway station shows the suspect jumping over the turnstile as he ran away.\nKnowles reportedly became a suspect after he was charged with criminal trespass and resisting arrest in another incident on Tuesday, according to the Daily News.\nSpeaking outside her home on Tuesday, Rivera said she did not realize she had been cut until getting off the train.\nShe said the man fell on her as she was sitting, and somehow managed to hide the slashing and the blade.\nRivera needed 30 stitches to close the four-inch cut on her left cheek.\nHowever she insisted on returning to her job as a sample maker on Tuesday, and remains defiant about what happened to her.\n'What's going to happen is going to happen. That's it,' she told CBS New York.\n'I'm not afraid. I've never been afraid. I guess that is just me.'\n'I take that train every morning.'\nFamily members said Rivera initially denied what happened to her, saying she had cut herself at work, before finally admitting that she was attacked.\nKnowles, pictured, was arrested following Monday's attack on the 6 train which injured Carmen Rivera\nWounded: The injured woman was taken to Bellevue Hospital suffering from a four-inch laceration to her face\nAnthony Cristopher-Smith, 30, from Newark, New Jersey, was walking in the East village on January 19 when a man yelling profanities knocked him off his feet and slashed him in the face from his ear to his jawline.\nPolice later arrested Francis Salud, 28, in connection to the attack. Salud has also been charged for a similar attack on East 23rd Street in October.\nOn New Year's Day, a 28-year-old woman suffered a facial wound at the hands of a total stranger in The Bronx, and less than a week later, 24-year-old Amanda Morris was sliced with a sharp object while walking to work in Chelsea.\nKari Bazemore, a 41-year-old man suffering from mental illness, has been charged in connection to both attacks. He was also linked to several similar incidents across the city in recent months.\nAmanda Morris was viciously slashed in the face on her daily commute to work in Chelsea on January 6","url":"https://www.dailymail.co.uk/news/article-3422424/I-chop-Subway-slasher-suspect-hands-NYPD-attacking-woman-machete.html"}
