{"authors":["Associated Press"],"date_download":"2018-10-23 04:06:20","date_modify":"2018-10-23 04:06:20","date_publish":"2017-03-16 15:24:55","description":"NEW YORK (AP) - Should a chimpanzee be treated as a person with legal rights?That's what attorney Steven Wise tried to convince a state appeals court in...","filename":"data/vaneerConsumption/NewYorkcourttodetermineifchimpislegallyaperson.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/23/wire-231247-1489706365-894_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_ap_article-4320668_NY-court-asked-determine-chimp-legally-person_1540267580.html","title":"New York court to determine if chimp is legally a person","title_page":"New York court to determine if chimp is legally a person | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NEW YORK (AP) - Should a chimpanzee be treated as a person with legal rights?\nThat's what attorney Steven Wise tried to convince a state appeals court in Manhattan on Thursday. Wise, who represents the Florida-based Nonhuman Rights Project animal advocacy group, argued that two chimps named Tommy and Kiko should be freed from cages to live in a mammoth-sized outdoor sanctuary in Florida.\nThe Boston lawyer has been trying for years, unsuccessfully, to get courts to grant the New York chimps habeas corpus in order to, he says, free them from unlawful imprisonment.\nIn this July 2013 photo provided by the Primate Sanctuary, the chimpanzee Kiko eats wild cherries at the nonprofit Primate Sanctuary in Niagara Falls, N.Y. Kiko's keeper Carmen Presti, and his wife rescued the deaf chimp 23 years ago from a life of performing at state fairs and in the television movie \"Tarzan in Manhattan.\" Kiko, who has medical problems requiring constant attention, is at the center of a court effort Thursday, March 16, 2017, by attorney Steven Wise, who will try to persuade a New York appeals court that a chimpanzee should be treated as a person with legal rights, when he presents the case of Kiko and another chimp, arguing that they should be freed from cages to live in an outdoor sanctuary. But Presti said, \"If he's taken away, he could die without his family to give him the special care he needs, and to bring him into the house to play.\" (Primate Sanctuary via AP)\nHe says that if the judges agree, the apes - which didn't appear in court - would be sent to live with others of their species on one of 13 islands amid a lake in Fort Pierce, Florida, that comprise the Save the Chimps sanctuary.\nA five-judge panel will issue its ruling in the coming days or weeks.\nKiko's keeper, Carmen Presti, says he's not giving him up.\nHe and his wife rescued the deaf chimp 23 years ago from a life of performing at state fairs and in the television movie \"Tarzan in Manhattan.\" Kiko is believed to have lost his hearing when he was beaten by a trainer, and has medical problems requiring constant attention.\n\"If he's taken away, he could die without his family to give him the special care he needs, and to bring him into the house to play,\" says Presti, of Niagara Falls, New York, where he runs the nonprofit Primate Sanctuary, whose rescue animals are part of a youth educational program.\nTommy was caged at a trailer lot in Gloversville, outside Albany.\nHis keeper, Patrick Lavery, calls the various lawsuits \"a ridiculous thing.\" He told The Associated Press that he had temporarily cared for Tommy to spare him from being euthanized, then donated him to an out-of-state facility in September 2015.\nWise's Coral Springs, Florida-based Nonhuman Rights Project has a history of litigation over chimps that started in 2013, when a lawsuit on behalf of Kiko was first filed in state Supreme Court in Niagara Falls and in Fulton County on behalf of Tommy. The same year, another suit named Hercules and Leo - chimps being used for anatomical research at Stony Brook University on Long Island. They're now at a Louisiana research facility, Wise says.\nIn 2014, an Albany appellate court ruled that Tommy was not legally a person because chimps cannot have duties and responsibilities. In a court brief, primate pioneer Jane Goodall countered by saying chimps do carry out duties and responsibilities in animal family settings and that apes have complex cognitive abilities allowing them to make choices.\nHowever, legal personhood does not mean animals are expected to perform daily human tasks. It's a technical term that ensures legal entities - in this case, chimps - have basic rights.\nPresti is not taking any direct legal action, but does have his own view of the latest case.\n\"Albert Einstein said insanity is doing the same thing over and over again and expecting different results,\" Presti said in a telephone interview, with a chuckle.\nOn Thursday, the judges peppered the attorney with questions: Why does he persist in filing lawsuits and challenging so many court decisions? Is there a precedent in the U.S. for making a chimp a \"legal person?\" (apparently not) Or does one have to practically create a new law for that purpose? Does habeas corpus mean moving chimps from one facility to another, or just giving them what Wise calls \"absolute freedom\"? (In that case, he said later tongue-in-cheek, they could end up, say, in Times Square and get killed.)\n\"All of our arguments are really grounded on fundamental ideas of justice,\" Wise said after the 15-minute court session. \"The reasons that humans should have rights are the reasons that nonhumans should have rights.\"\nHe remains doggedly hopeful - especially after an Argentinean judge ruled in November that chimps in fact have habeas corpus rights. \"We will win, in the end,\" he said.\n___\nThe Nonhuman Rights Project: https://www.nonhumanrightsproject.org\nThe Primate Sanctuary: http://theprimatesanctuary.com\n____\nFollow Verena Dobnik on Twitter at https://twitter.com/VerenaChirps","url":"https://www.dailymail.co.uk/wires/ap/article-4320668/NY-court-asked-determine-chimp-legally-person.html"}
