{"authors":["Awr Hawkins"],"date_download":"2018-10-30 20:26:49","date_modify":"2018-10-30 20:26:49","date_publish":"2015-07-20 19:27:52","description":"The New York Times wants Obama to use federal contracts as a means to backdoor controls on gun manufacturers.","filename":"data/vaneerConsumption/NewYorkTimestoObamaUseFederalContractstoSecureBackdoorGunControl.json","image_url":"https://media.breitbart.com/media/2015/07/GettyImages-469216474-1024x696.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/the-media_2015_07_20__1540931209.html","title":"New York Times to Obama: Use Federal Contracts to Secure Backdoor Gun Control","title_page":"New York Times to Obama: Use Federal Contracts to Secure Backdoor Gun Control | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"On July 17 The New York Times reported on the Obama administration’s failure to get any significant gun control passed in Congress by suggesting there is still one avenue open–using federal contracts as a means to backdoor controls on gun manufacturers.\nIn other words, get gun manufacturers common among federal agencies–companies like Beretta, Glock, Ruger, Smith & Wesson, and Sig Sauer–to agree to gun control measures that affect the way their product is sold, to whom it is sold, and even what kind of products they make, before those companies are considered for federal contracts.\nThe NYT suggests these controls could include shrinking the number of dealers through whom these manufacturers will sell guns. They claim this will ensure that manufacturers only used FFLs who “sell guns responsibly.”\nUnder this scenario, certain dealers would be “certified” to handle distribution of products made by gun companies with federal contracts.\nNYT whittles it down further to explain that “certified” dealers would mean those that adopt stricter standards for background checks than required by federal law. They want dealers to agree that they will not hand over a gun to a would-be buyer in a situation where the instant background check is extended to three business days, yet still comes back inconclusive. This means no sale in situations where no record is found, including no criminal record.\nThey also suggest requiring manufacturers to build “smart guns” before they can can even be considered for a federal contract. They stress that these guns, which remain more theoretical than real, “are far less likely to be used in accidental or intentional shootings.” They argue that his approach could “rescue the federal government’s smart-gun research efforts from oblivion” by getting gun companies to pump “tens of millions of research dollars” into a product the market has not embraced.\nNotably absent from the NYT’s suggestions is that the Secret Service, Capitol Police, the FBI, ATF, or ICE, then use “smart guns” for service sidearms.\nFollow AWR Hawkins on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com.","url":"https://www.breitbart.com/the-media/2015/07/20/new-york-times-to-obama-use-federal-contracts-to-secure-backdoor-gun-control/"}
