{"authors":["Louise Cheer For Daily Mail Australia"],"date_download":"2018-10-22 20:52:30","date_modify":"2018-10-22 20:52:30","date_publish":"2016-01-28 04:48:05","description":"A New Zealand woman filmed herself sexually abusing her one-year-old son (not pictured) and sold the video onto a man for $300, knowing he was going to upload it to the internet.","filename":"data/vaneerConsumption/NewZealandmotherpleadsguiltytofilmingherselfsexuallyviolatingbabyson.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/05/30A6CB9000000578-0-image-a-74_1453957205703.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3420326_New-Zealand-mother-pleads-guilty-filming-sexually-violating-one-year-old-son_1540241550.html","title":"New Zealand mother pleads guilty to filming herself sexually violating baby son","title_page":"New Zealand mother pleads guilty to filming herself sexually violating baby son | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A young mother who pleaded guilty to filming herself sexually abusing her one-year-old boy and then selling the footage for $300 has avoided jail.\nThe 23-year-old, who has two children, was handed eight months of home detention and 100 hours of community service as a New Zealand judge did not think jail would not be beneficial to her, One News reported.\nA young mother who pleaded guilty to filming herself sexually violating her one-year-old boy and then selling the footage for $300 has avoided jail\nJudge Philip Recordon described her crime as 'repellent' and the crime was premeditate because she had thought it out and 'did it for the money' knowing the man who bought the video was going to upload it to the internet.\nJudge Recordon said the mother, who appeared in Manukau District Court - south of Auckland on the North Island, had taken advantage of her child.\n'The victim was vulnerable. It was a breach of trust at the highest level,' Judge Recordon said, according to stuff.co.nz.\nThe court also heard the mother had spent the money she earned from the video to purchase a laptop after the August 10, 2014 incident.\nThe woman's lawyer, Annabel Maxwell-Scott, said her client, who had spent her childhood living in a series of foster homes and had an 'extremely difficult upbringing', was aware of the seriousness of her actions and knew she had 'brought this on herself'.\nMs Maxwell-Scott said the man had 'actively groomed' the mother 'over a series of months' and issued her a number of requests over that period before offering her money to film the footage.\n'It's obviously a repellent crime. It makes us feel uncomfortable even talking about it,' the lawyer said.\nCrown prosecutor Nick Dobbs had recommended the woman be given a sentence of at least six to seven years.\nBut Ms Maxwell-Scott thought a sentence of at least four years was suitable.\nWhen he handed down his sentence, Judge Recordon said he had taken several reductions into consideration for the woman who was a first-time offender.\nSocial media groups have been set up to push for a more severe sentence for the mother (pictured), with members of the public threatening violence against her and calling for the death penalty\nShe will be required to be monitored for another 12 months after she completes her home detention, One News reported.\nThe woman's family had successfully applied to lift her name suppression but it was reinstated on Thursday by the court.\nThe child's grandparents were in court at the time of the sentencing and expressed their disappointment at the penalty.\n'She's not shown any remorse,' the grandmother told stuff.co.nz.\nThe mother of the woman said her daughter had 'got away with far too much'.\n'I think it's disgusting. My grandson would not have known what was going on. He was so vulnerable and she's meant to love him and take care of him, not use him as a sex object,' she said.\nJudge Philip Recordon said the mother, who appeared in Manukau District Court (above), had taken advantage of her child but her lawyer said her client had a tough childhood\nThe woman's sentenced had outraged many people across New Zealand and the world.\nSocial media groups have been set up to push for a more severe sentence, with members of the public threatening violence against her and calling for the death penalty.\n'All this piece of s*** deserves is a bullet,' one woman wrote.\n'Filthy cow! I do hope all her close friends and family have washed their hands with this money hungry sick dog! Lock her up and throw away the key,' another woman said.\nA third woman said the mother deserved something worse than jail time.\n'I vote send her to death.... Not just prison,' she said.\nAn investigation into the online remarks has been launched by local authorities.","url":"https://www.dailymail.co.uk/news/article-3420326/New-Zealand-mother-pleads-guilty-filming-sexually-violating-one-year-old-son.html"}
