{"authors":["Sophie Haslett For Daily Mail Australia"],"date_download":"2018-10-22 23:20:21","date_modify":"2018-10-22 23:20:21","date_publish":"2017-03-10 02:37:39","description":"New Zealand-based lingerie label, Lonely Lingerie, has cast 57-year-old model, Mercy Brewer, to be the star of their latest lingerie campaign. The photos celebrate ageing.","filename":"data/vaneerConsumption/NewZealandlingerielabelcasts57yearoldmodel.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/02/3E1F64EA00000578-0-image-a-52_1489112047928.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/femail_article-4299668_New-Zealand-lingerie-label-casts-57-year-old-model_1540250421.html","title":"New Zealand lingerie label casts 57-year-old model","title_page":"New Zealand lingerie label casts 57-year-old model | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It's an industry that is famously obsessed with flawlessness and youth.\nBut from Joan Didion for Celine to Vanessa Redgrave for Gucci, in recent times the fashion world has woken up to the power of the older woman as model.\nThe latest label to join the fantastic silver fray is New Zealand-based lingerie company, Lonely Lingerie.\nThe label's autumn/winter 2017 campaign features 57-year-old model, Mercy Brewer, as its star.\nNew Zealand-based lingerie label, Lonely Lingerie, have cast 57-year-old model, Mercy Brewer (pictured), as its star for their new campaign\nMercy Brewer has been captured for the autumn/winter 2017 campaign in several outfits\nIn the striking campaign images - which were shot by photographer, Harry Were, 57-year-old Mercy can be seen in several covetable pieces of lingerie.\nFrom black lacy bras to French-inspired two pieces, each look is fabulously modelled by Mercy's long, lean frame and striking looks.\nThe photo shoot was captured inside one of New Zealand's historic homesteads.\n'Perceptions of beauty have and always will change, therefore I think we can conclude its standard is not set in stone, and new beauty is always waiting to be discovered,' Mercy said of the campaign.\n'I believe we are in a moment in time where older women's beauty has been a startling revelation. If we don't recognise it, we, every one of us, deny ourselves a future to look forward to.'\nThe images were shot by photographer, Harry Were - inside one of New Zealand's historic homesteads (pictured)\n'Perceptions of beauty have and always will change, therefore I think we can conclude its standard is not set in stone,' Mercy said\n'I believe we are in a moment in time where older women's beauty has been a startling revelation,' the 57-year-old also said\nSpeaking about the campaign, Lonely co-founder and designer Helene Morris, said that Lonely intended to challenge traditional attitudes to ageing.\n'The beauty and fashion industries are so obsessed with youth, but the reality is we are all ageing, and there are so many wonderful things about growing older,' she said.\n'So often the primary message around age is intervention, which is a frustrating response to such a natural, inevitable process.'\nSpeaking about the campaign, Lonely co-founder and designer Helene Morris, said that Lonely intended to challenge traditional attitudes to ageing\n'The beauty and fashion industries are so obsessed with youth, but the reality is we are all ageing, and there are so many wonderful things about growing older,' she said\nMercy herself is originally from Scotland - she spent the 1980s modelling in London with the likes of Kate Moss and Naomi Campbell, before later moving to New Zealand with her husband\nHistorically, Lonely Lingerie have carved out a name for themselves, for featuring women in all shapes and sizes and from all walks of life\nMercy herself is originally from Scotland.\nShe spent the 1980s modelling in London with the likes of Kate Moss and Naomi Campbell, before later moving to New Zealand with her husband in the early 2000s.\nHistorically, Lonely Lingerie have carved out a name for themselves, for featuring women in all shapes and sizes and from all walks of life.\nFamously, the label had a campaign featuring the transgender model, Aurel Haize Odogbo, last year.\nYou can visit the Lonely Lingerie website here.","url":"https://www.dailymail.co.uk/femail/article-4299668/New-Zealand-lingerie-label-casts-57-year-old-model.html"}
