{"authors":["Lucy Mae Beers For Daily Mail Australia"],"date_download":"2018-10-22 23:20:08","date_modify":"2018-10-22 23:20:08","date_publish":"2017-03-10 02:47:11","description":"A New Zealand man has been jailed for life after he murdered his ex-girlfriend with a shotgun while her five-year-old daughter slept in the next room in October 2015.","filename":"data/vaneerConsumption/NewZealandmangetslifeforkillinghisexwithshotgun.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/01/3E1F2BED00000578-0-image-a-25_1489109052147.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299552_New-Zealand-man-jailed-life-killing-ex-partner_1540250408.html","title":"New Zealand man gets life for killing his ex with shotgun","title_page":"New Zealand man gets life for killing his ex with shotgun | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A man has been jailed for life after he murdered his ex-girlfriend with a shotgun while her five-year-old daughter slept in the next room.\nChazz Hall was sentenced in the High Court at Napier, New Zealand, on Thursday to life in jail with a non-parole period of 15 years after pleading guilty to the brutal murder.\nVictoria Foster, 24, was shot in the head on October 26, 2015 after she broke up with Hall and told him to leave her Westshore house, the NZ Herald reported.\nChazz Hall (pictured) was sentenced in the High Court at Napier, New Zealand, on Thursday to life in jail with a non-parole period of 15 years\nThe court heard Hall had taken a bottle of wine to Foster's home the night of the shooting, 'in the hope that events would turn out differently'.\nHall fled the scene after the killing, but was shot by police and arrested two hours later.\nHe initially pleaded not guilty to murder, but changed his plea to avoid the scheduled trial.\nVictoria Foster, 24, (pictured centre) was shot in the head on October 26, 2015 after she broke up with Hall and told him to leave\nHall also pleaded guilty to charges of threatening to kill police, dangerous use of a firearm and dangerous driving.\nOn Friday, the court heard victim impact statements from Foster's uncle, sister and cousin.\nHall has been left with a disability and walks with crutches after being shot by police.","url":"https://www.dailymail.co.uk/news/article-4299552/New-Zealand-man-jailed-life-killing-ex-partner.html"}
