{"authors":["Alex Swoyer"],"date_download":"2018-10-30 21:27:55","date_modify":"2018-10-30 21:27:55","date_publish":"2015-04-27 13:51:18","description":"The next wave of what is expected to be a very crowded 2016 GOP presidential candidate pool is set to crash next week.","filename":"data/vaneerConsumption/NextWaveofGOPPresidentialCandidatesCarsonFiorinaHuckabee.json","image_url":"https://media.breitbart.com/media/2015/04/Carly-Fiorina-Mike-Huckabee-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/politics_2015_04_27__1540934875.html","title":"Next Wave of GOP Presidential Candidates: Carson, Fiorina, Huckabee","title_page":"Next Wave of GOP Presidential Candidates: Carson, Fiorina, Huckabee | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The next wave of what is expected to be a very crowded 2016 GOP presidential candidate pool is set to crash next week as Dr. Ben Carson, former Hewlett-Packard CEO Carly Fiorina, and former Arkansas Gov. Mike Huckabee are all expected to officially jump into the race.\nCarson, a political commentator and retired neurosurgeon, is expected to make his presidential bid official on Monday, May 4, in his hometown of Detroit, Michigan.\nCarson recently took a jab at Hillary Clinton, the Democratic presidential candidate, for the new revelations from the book Clinton Cash, which is exposing new information about foreign donors to her foundation.\n“It is my strong belief that not only should they definitely give back the money and cease accepting foreign donations, but should also make every effort to find missing documents that would shed light if in fact they are innocent,” Carson said.\nAlso on Monday, May 4, Fiorina is expected to launch her official campaign via Twitter–as Breitbart News has previously reported–followed by a conference call with national reporters, according to The Wall Street Journal.\nLike Carson, Fiorina has been outspoken against Clinton.\n“Because I am a woman, there are many things she can’t say,” Fiorina said. “She can’t play the gender card. She can’t talk about being the first woman president. She can’t talk about the war on women.”\nHuckabee, a former Fox News host, is set to announce his run for president the day after Fiorina and Carson. He will make his official announcement from Hope, Arkansas, on Tuesday May 5.\nUnlike relative political newcomers in Carson and Fiorina, Huckabee dove into politics in 1992, when he entered his first political race. He served as the 44th governor of Arkansas from 1996 to 2007.\nHis decades of experience as a political insider could give him an edge as he enters the race.\nAlso unlike Carson and Fiorina, Huckabee has twice run against products from the Clinton machine–both females–and won.\nHuckabee ran for lieutenant governor against Charlie Cole Chaffin in 1994. According to a Huckabee spokesperson, during the 1994 race, an Arkansas news outlet described Chaffin as “a gritty pol herself,” adding, “She reminds us of what Hillary Rodham Clinton would have been if she’d grown.” Chaffin had also served under Gov. Bill Clinton. Huckabee defeated Chaffin with 59 percent of the vote.\nHuckabee’s spokesperson also pointed to his 2002 win against Jimmie Lou Fisher for governor of Arkansas. Fisher, like Chaffin, had served under Gov. Bill Clinton.\nWithout a doubt, the buildup for 2016 is already more crowded than it was at the same time building into 2012. Around this same time, there were only two official Republican candidates who had announced prior to May–Gary Johnson and Fred Karger.\nBut this time around, the Republican primary already has three serious contenders, and it is about to get three more–making the official count at six. Sen. Rand Paul (R-KY) followed Sen. Ted Cruz (R-TX)–the first to announce–and they were joined shortly thereafter by Sen. Marco Rubio (R-FL). Others from the GOP side expected to launch White House bids–or at least seriously considering them–include Wisconsin Gov. Scott Walker, former Florida Gov. Jeb Bush, Louisiana Gov. Bobby Jindal, Sen. Lindsey Graham (R-SC), New Jersey Gov. Chris Christie, and Ohio Gov. John Kasich.\nThe breadth and depth of serious Republican candidates for president stands in stark contrast to the Democratic Party primary–where only Clinton has announced a candidacy, while several lower tier potential candidates are only considering running at this time. It is unclear if Clinton will face any serious opposition.\n“We believe it’s healthy for the Republican Party to have a robust primary, and it’s exciting to see that we have a field of so many qualified candidates, much unlike the Democrats who have already coronated Hillary Clinton,” James Hewitt, a spokesman for the Republican National Committee, told Breitbart News.","url":"https://www.breitbart.com/politics/2015/04/27/next-wave-of-gop-presidential-candidates-carson-fiorina-huckabee/"}
