{"authors":["Deborah Danan"],"date_download":"2018-10-30 19:38:54","date_modify":"2018-10-30 19:38:54","date_publish":"2016-09-25 15:44:16","description":"Rudy Giuliani, an adviser to Donald Trump, said that the U.S. should oppose a two-state solution to the Israeli-Palestinian conflict.","filename":"data/vaneerConsumption/NextPresidentShouldRejectTwoStateSolution.json","image_url":"https://media.breitbart.com/media/2016/08/Giuliani.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/middle-east_2016_09_25__1540928334.html","title":"Next President Should Reject Two-State Solution","title_page":"Trump Advisor Giuliani: Next President Should Reject Two-State Solution","title_rss":"NULL","source_domain":"breitbart.com","text":"TEL AVIV – Former New York mayor Rudy Giuliani, an adviser to Donald Trump, said on Saturday night that the U.S. should oppose a two-state solution to the Israeli-Palestinian conflict until the Palestinians can prove they are capable of renouncing terror, and also expressed his hope that the next president will nullify the Iran deal.\nGiuliani was addressing the Israeli American Council (IAC) following four intense days of debate prep with Trump ahead of the Republican presidential nominee’s face-off with Democratic contender Hillary Clinton Monday night.\n“You can make peace between the two of them, but you can’t treat them the same,” said Giuliani, slamming attempts at moral equivalence between the two sides.\n“The United States should reject the whole notion of a two-state solution in Israel, or maybe it should restate it: It should be a two-state solution when the Palestinian Authority demonstrates that it can be a state, and not a homeland for terrorism,” he added.\n“It’s not in the interest of Israel to have a terrorist state on its border. It would not be the interests of my country to create a new haven for terrorists,” he said as his audience applauded.\nGiuliani’s view that the two-state solution should be abandoned is shared by Trump’s senior Israel aides, Jason Greenblatt and David Friedman.\nThe two-state solution calls for the creation of a Palestinian state alongside Israel.\nGiuliani also told the IAC that he hopes the next president will cancel the nuclear agreement reached with Iran last year.\n“[Supreme Leader Ayatollah Khamenei] is insane. The people around him are insane,” Giuliani said, adding that the Islamic Republic is “the single biggest state sponsor of terrorism in the world,” full of “homicidal maniacs who have killed hundreds of thousands of their own people, who have recently killed young American men and women in Iraq with the Quds Force … and we’re going to give them nuclear weapons?”\n“What does that mean if we give them hundreds and millions and billions of dollars?” he asked.\n“I hope we elect a president who reverses that agreement,” he continued. “I can’t speak for anyone else. I oppose the agreement because I would never put nuclear material in the hands of a proven homicidal maniac. I consider putting a nuclear weapon in the hands of a country that is dedicated to the extermination of the state of Israel as not being a friend of Israel.”","url":"https://www.breitbart.com/middle-east/2016/09/25/trump-advisor-giuliani-next-president-should-reject-two-state-solution-to-israeli-palestinian-conflict-and-cancel-iran-deal/"}
