{"authors":["Arielle Dachille"],"date_download":"2018-10-30 23:30:09","date_modify":"2018-10-30 23:30:09","date_publish":"2014-08-13 17:51:11","description":"Gird your loins, boy band enthusiasts of the world. One Direction is getting edgy. According to MTV, on the next One Direction Album, the band will tone down their collective non-threatening heartthrob charm in favor of something \"a little edgier.\"…","filename":"data/vaneerConsumption/NextOneDirectionAlbumWillbeEdgierSoLetsImagineAllTheThingsTheBoysThinkAreEdgy.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/af87a74c-9554-4bb3-a4ae-1abb708da58d.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35608-next-one-direction-album-will-be-edgier-so-lets-imagine-all-the-things-the-boys-think_1540942209.html","title":"Next One Direction Album Will be \"Edgier,\" So Let's Imagine All The Things The Boys Think Are Edgy","title_page":"Next One Direction Album Will be \"Edgier,\" So Let's Imagine All The Things The Boys Think Are Edgy","title_rss":"NULL","source_domain":"bustle.com","text":"Gird your loins, boy band enthusiasts of the world. One Direction is getting edgy. According to MTV, on the next One Direction Album, the band will tone down their collective non-threatening heartthrob charm in favor of something \"a little edgier.\" Hence, you should really re-think the outfit you were gonna wear to their next show. Really though, just how will they exhibit these newfound edgy tendencies? Well, they could all get matching leather jackets like the T-birds and do a whole album where they have greaser alter-egos. Now, that's what I call edgy...\nThe boy band caught up with Carson Daly on The Today Show, saying that the new music they've been working lately on will be a departure from the ultra-poppy material they've become known for. Their next record release will mark One Direction's fourth studio album, and they're ready for a bit more of an \"edgy\" sound. Niall Horan told Daly of the band's forthcoming record,\"I think it’s going to be a little bit more edgy, but obviously we feel like we’ve got some really good songs and we are happy.\" Liam went on to add to Horan's statement, “We’ve all taken a hand in the writing this time and we’ve literally written almost every song.” So basically edgy just means, you know, incorporating personal experience and writing your own songs.\nHumor me for a minute though, because this gets the old gears a-grinding. What other edgy tricks do these boys have up their sleeves? Facial piercings? Speckled Pasts? Dare I even think it... WILL THEY CUT THEIR HAIR?! Here are all the bad boy tricks that the D could employ for their next album, to morph themselves into boys that you wouldn't be so eager to bring home to mom and dad.\nFacial Piercings\nNothing says \"IDGAF\" like shoving a needle through the skin of a perfectly-moisturized, symmetrical boy band face.\nSkrillex Haircuts\nHarry Styles' mane is the coif that launched a thousand screeches, but an edgy music makeover should be accompanied by an edgy hairstyle. What better choice is there than the Skrillex Cut?\nLOWER NECKLINES!\nThis scoop-neck is currently PG-13, but nothing less than NC-17 is rock and roll.\nMotorcycles\nHey, little lady! Wanna hop on my hog and make some bad decisions?\nFull Beards\nEdgy isn't a grazing of stubble, it's a face full of whiskers.\nAdult Language/ Adult Content\nGiven that they're involved in the song writing process now, they should pepper their stories with naughty words, like \"bum\", and tales of doing forbidden things on the road, like staying up all night playing Apples to Apples.\nGoing to Jail\nA run-in with the authorities always does wonders for your street cred. Now all they need to do is forward the video of Zayn and Louis smoking weed, and boom! You have a PR-friendly felony.\nFarewell family-friendly One Direction. Hello, edgy boys!\nImage: Giphy (8)","url":"https://www.bustle.com/articles/35608-next-one-direction-album-will-be-edgier-so-lets-imagine-all-the-things-the-boys-think"}
