{"authors":[],"date_download":"2018-10-30 01:01:23","date_modify":"2018-10-30 01:01:23","date_publish":"2015-05-23 00:00:00","description":null,"filename":"data/vaneerConsumption/NextTimeYouSeeaSoldierintheAirportSayThankYou.json","image_url":"https://www.americanthinker.com/assets/images/at-painter-og-image.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/americanthinker.com/blog_2015_05_next_time_you_see_a_soldier_in_the_airport_say_thank_you_comments_1540861283.html","title":"Next Time You See a Soldier in the Airport, Say Thank You","title_page":"Blog: Next Time You See a Soldier in the Airport, Say Thank You","title_rss":"NULL","source_domain":"americanthinker.com","text":"I’m a woos. A wimp. I admit it. A private fresh out of boot camp has more courage in his pinkie fingernail than I do in my entire being. I could never imagine putting myself in harm’s way for my country the way our young men and women in the military do. The way my nephew and his wife did for five years. My eyes water every time I think about their dedication and sacrifice. The visible and invisible scars they brought home with them. Their desire to go back and do more. Their disappointment and depression from not being allowed to, due to those very same disabilities. Unfortunately, too many low-information, Obama-voting liberals just don’t get it. I experienced the perfect example of this last week in a bar in Ann Arbor. It’s a trendy place where all the staff have tattoos, bushy beards, and waxed handlebar mustaches. Some of the guys do too. It was a slow point in the day when I was there with my daughter sitting at the bar watching the... (Read Full Post)","url":"https://www.americanthinker.com/blog/2015/05/next_time_you_see_a_soldier_in_the_airport_say_thank_you_comments.html"}
g on a discussion about how one of them saw a group of soldiers in the airport traveling in their fatigues carrying rucksacks. We’ve all seen them. Some of us have thanked them and shaken their hands in appreciation. We cheer them at sporting events and tear up when we watch the videos of them reuniting with their families and puppy dogs. Older folks among us, having served in the defense of our country during the fifties, sixties, and seventies, maybe even stood at attention and saluted our brave souls as they passed by on the concourse. This was not the reaction of these smarter-than-thou yuppies who have parlayed 8 and a half years of government paid liberal arts education into a career of waiting tables and bussing dishes. Risking cuts from broken highball glasses and burns from a scalding Hobart. The consensus seemed to be that the soldiers wear their fatigues in the airport so that they can get freebies and special attention. They felt that they should be required to wear civvies in public because it may bother some people to see soldiers in the airport. Ann Arbor, like all college towns, is a pocket of Progressive Liberalism. They combine with Detroit to make sure that Michiganders are represented in the Senate by two equally useless do-nothing Democrats. The conversation did not surprise me and interjection would be futile. There is a long tradition of anti-war rhetoric and action in the town going back to the sixties. I was one of them in the early eighties, but when I ventured into the real world and saw what Carter did to our economy and worked with small businesses to embrace Reagan’s reforms, I saw firsthand who had it right. I’ve never looked back. For these Leftists, the blinders won’t be removed soon enough. Soldiers in airports will be topics of ridicule and their only concern will be whether their next tattoo will be “I heart Hillary” or “I heart Liz”? For my daughter and I, we will be sure to say thank you to our service men and women every chance we get.","url":"https://www.americanthinker.com/blog/2015/05/next_time_you_see_a_soldier_in_the_airport_say_thank_you.html"}
