{"authors":["Joe Ciolli"],"date_download":"2018-10-30 22:34:51","date_modify":"2018-10-30 22:34:51","date_publish":"2018-07-31 00:00:00","description":"BI PRIME: John Hussman, the outspoken investor and former professor who has been predicting a stock market crash, calls out a big mistake he says investors are making as valuations continue to climb. He says their mentality will end up catalyzing the next market crash.","filename":"data/vaneerConsumption/NextstockmarketcrashtoresultfromhugeinvestingmistakeHussman.json","image_url":"https://amp.businessinsider.com/images/5a0c987035876e8c008b6367-1920-960.jpg","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_next-stock-market-crash-will-result-from-huge-investing-mistake-john-hussman-says-2018-7-msn_1540938891.html","title":"Next stock market crash to result from huge investing mistake: Hussman","title_page":"    Next stock market crash to result from huge investing mistake: Hussman - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters / Cheryl Ravelo-Gagalac\nIn the stock market, the concept of valuation can mean different things, depending on the investor.\nTo novices, it's frequently used as a simple barometer of when an investment gets overextended. Conventional wisdom there suggests once valuation gets stretched too far, it might be time to sell.\nBut to seasoned experts like John Hussman— a former economics professor who is now the president of the Hussman Investment Trust — assessing valuation is more nuanced.\nHe subscribes to what he calls the Iron Law of Valuation, which says the higher the price investors pay for future cash flow, the lower their long-term investment returns will be. In other words, if you arrive late to the party, don't expect to get the full experience.\nIt's a relatively basic concept that informs Hussman's view that irrational investor behavior will eventually lead the market to its doom. Piggybacking off the Iron Law, he points out that as prices have surged, people still seem ...\nSponsored:If you enjoyed reading this story so far, why don't you join Business Insider PRIME? Business Insider provides visitors from MSN with a special offer.Simply click here to claim your deal and get access to all exclusive Business Insider PRIME benefits.","url":"https://www.businessinsider.com/next-stock-market-crash-will-result-from-huge-investing-mistake-john-hussman-says-2018-7-msn"}
