{"authors":[],"date_download":"2018-10-30 18:11:14","date_modify":"2018-10-30 18:11:14","date_publish":"2016-05-24 19:36:00","description":"CHARLOTTE, N.C. — The Super Bowl is headed back to Atlanta after a vote Tuesday by NFL owners to play the nation’s No.","filename":"data/vaneerConsumption/NFLownersaward2019SuperBowltoAtlanta.json","image_url":"https://www.ajc.com/rf/image_large/Pub/p7/AJC/2016/05/24/Images/photos.medleyphoto.9889815.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/sports_football_nfl-owners-award-2019-super-bowl-atlanta__1540923074.html","title":"NFL owners award 2019 Super Bowl to Atlanta","title_page":"NFL owners award 2019 Super Bowl to Atlanta","title_rss":"NULL","source_domain":"ajc.com","text":"CHARLOTTE, N.C. — The Super Bowl is headed back to Atlanta after a vote Tuesday by NFL owners to play the nation’s No. 1 sporting event in the new Mercedes-Benz Stadium in February 2019.\nIt will be the third Super Bowl played in Atlanta and the first since 2000.\nThe NFL owners, meeting at a posh Charlotte hotel, needed four ballots to award the game to Atlanta over three other bidders. Miami and Tampa were eliminated on the second ballot, leaving Atlanta vs. New Orleans. After neither got the required 75 percent on the third ballot, Atlanta prevailed with a simple majority on the fourth.\n“I’m thrilled for Atlanta, thrilled for our bid team, thrilled for all the political leaders who have supported us along the way with a difficult (stadium) project in downtown Atlanta,” Falcons owner Arthur Blank said.\nSeveral members of Atlanta’s bid committee said they provided the NFL with a “fully funded” bid that estimates the local cost of hosting Super Bowl LIII at $46 million.\nIt’s official. Atlanta will be the host city of Super Bowl LIII in 2019 at the new Mercedes-Benz Stadium.\nOf that total, according to the committee members, $20 million will come from donations that have been pledged by two dozen Atlanta businesses; $16 million from a portion of the Atlanta hotel-motel tax designated for major events; and $10 million from a sales-tax exemption on Super Bowl tickets passed by the Georgia Legislature this year.\nMercedes-Benz Stadium — slated to open next year — is now 3-for-3 in bids for marquee events, having previously been awarded college football’s national championship game in January 2018 and college basketball’s Final Four in April 2020.\nThe NFL’s decision capped a year-long effort by the bid committee and the Falcons to land the mega-event for the retractable-roof stadium. The decision also marked a reversal of NFL votes from a decade ago that rejected Atlanta bids for the 2009 and 2010 Super Bowls.\n“I think the difference this time is that we have a new stadium with a significant public-private partnership,” Blank said.\nAtlanta’s bid was presented to the NFL owners by the CEOs of two Atlanta-based companies, Rick Smith of credit-information firm Equifax and Doug Hertz of alcoholic-beverages wholesaler United Distributors.\n“It was nerve-wracking,” Hertz said of the four-ballot vote.\n“Utter joy,” Smith said of the victory.\nThe bid, entitled “Atlanta Transformed,” emphasized the close proximity of the new stadium to other downtown attractions that didn’t exist when the Super Bowl was played at the Georgia Dome in 1994 and 2000.\nThe NFL owners contined a recent trend of awarding Super Bowls to new stadiums. All five NFL stadiums that have opened since 2006 have hosted a Super Bowl. Another stadium opening this year — in Minneapolis — was awarded the 2018 Super Bowl two years ago.\nPlease see more on this story at MyAJC.com.","url":"https://www.ajc.com/sports/football/nfl-owners-award-2019-super-bowl-atlanta/F1V32qCmX0Yu6GP4dcuzIJ/"}
