{"authors":["Warner Todd Huston"],"date_download":"2018-10-30 19:51:29","date_modify":"2018-10-30 19:51:29","date_publish":"2016-12-26 21:24:20","description":"After a season of ratings disappointment, the NFL finally had a winner with its Christmas Day matchup between the Kansas City Chiefs and the Denver Broncos. | Sports","filename":"data/vaneerConsumption/NFLsSundayNightFootballFinallySeesRatingsBumponChristmasDay.json","image_url":"https://media.breitbart.com/media/2016/12/chiefs-broncos.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/sports_2016_12_26__1540929089.html","title":"NFL's Sunday Night Football Finally Sees Ratings Bump on Christmas Day","title_page":"NFL's Sunday Night Football Finally Sees Ratings Bump on Christmas Day | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"After a season of ratings disappointment, the NFL finally had a winner with its Christmas Day matchup between the Kansas City Chiefs and the Denver Broncos.\nThe Chiefs 33-10 victory netted an 11.2 overnight rating and a 23 share, at least a 10 percent improvement over last year’s Week 16 game, USA Today reported.\nThe game ended the playoff hopes of the reigning Super Bowl champion Denver Broncos and further solidified the Chiefs as a contender, after Kansas City clinched a wild-card slot earlier in the day when the Pittsburgh Steelers beat the Baltimore Ravens.\nThis isn’t the first ratings uptick the NFL experienced though. In the week following the 2016 elections, the league’s Week 11 saw a bump in ratings, the first time ratings looked good since the beginning of the season.\nRatings had fallen so sharply for professional football that the league came under heavy pressure to reassess its advertising rates and to refund millions in advertising dollars already paid into the system.\nFor decades football was considered immune from the vagaries of those market forces affecting nearly every other corner of the television market. But with the first 10 weeks of football earning such dismal ratings, nervous advertisers began demanding satisfaction from the networks and the NFL both.\nFollow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail.com.","url":"https://www.breitbart.com/sports/2016/12/26/nfl-sunday-night-football-finally-sees-ratings-bump-christmas-day/"}
