{"authors":["Ariel Zilber For Dailymail.Com"],"date_download":"2018-10-23 00:00:08","date_modify":"2018-10-23 00:00:08","date_publish":"2017-03-10 05:26:13","description":"Retired football stars are suing the NFL in federal court over claims that the 32 teams administered powerful prescription drugs each season in a desperate bid to keep them on the field.","filename":"data/vaneerConsumption/NFLsuedforplyingplayerswithpowerfulpainkillers.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/05/3E2032A100000578-0-image-a-127_1489123491926.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300014_NFL-sued-plying-players-powerful-painkillers_1540252808.html","title":"NFL sued for 'plying players with powerful painkillers'","title_page":"NFL sued for 'plying players with powerful painkillers' | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Retired football stars are suing the National Football League in federal court over claims that the 32 teams and their medical staffs administered powerful prescription drugs each season in a desperate bid to keep them on the field.\nThe lawsuit was filed in US District Court in northern California by a group representing over 1,800 former professional NFL players, according to The Washington Post.\nThe players claim that they are suffering from long-term organ damage as well as other health maladies that they believe stem from the haphazard manner in which team physicians plied them painkillers and anti-inflammatory medication.\nThey allege that the NFL failed to comply with federal laws that regulate the administration of the drugs by team medics.\nCincinnati Bengals outside linebacker Vontaze Burfict (left) is checked by trainer Paul Sparling (right) in 2014. Sparling wrote an email in 2009 which the plaintiffs say is evidence of a cavalier attitude in which teams violated federal regulations on administering drugs\nThe Post report, which was based on unsealed documents from the lawsuit, claims that team doctors 'testified that they violated one or more' federal laws 'while serving in their capacity as team doctor.'\nOne prominent team doctor, Anthony Yates of the Pittsburgh Steelers' medical staff, is a former president of the NFL Physicians Society.\nYates testified in a deposition that 'a majority of clubs as of 2010 had trainers controlling and handling prescription medications and controlled substances when they should not have.'\nThe players allege that the NFL teams and the league itself were made aware of violations of the law, but either were slow to respond or turned a blind eye, according to the Post.\nAccording to court filings, NFL team doctors prescribed at least 5,777 doses of nonsteroidal anti-inflammatory drugs as well as 2,213 doses of controlled medications in 2012 alone. One such drug, Toradol, is seen above\nThe lawsuit cites an email written by the head trainer of the Cincinnati Bengals, Paul Sparling, in August 2009.\n'Can you have your office fax a copy of your DEA certificate to me? I need it for my records when the NFL \"pill counters\" come to see if we are doing things right. Don't worry, I'm pretty good at keeping them off the trail!' he wrote.\nThe players claim that the teams' medical staffs displayed a cavalier attitude in prescribing the drugs.\nAccording to court filings, NFL team doctors prescribed at least 5,777 doses of nonsteroidal anti-inflammatory drugs as well as 2,213 doses of controlled medications in 2012 alone.\nThat averages out to approximately six or seven pain pills or injections per player over the course of a typical NFL season – an astounding number, according to sports medicine experts.\nWhile it is difficult to gauge the extent of alleged abuses given that it is hard to know the exact dosage given to players, the potency of the painkillers and their vulnerability to addiction, like Vicodin, is cause for alarm.\nThe lawsuit alleges that NFL teams pressured their medical staffs to inject their players with painkillers for competitive reasons.\nThe NFL has denied the allegations contained in the lawsuit. A spokesperson says that the league will fight the claims in court.\n'The NFL clubs and their medical staffs are all in compliance with the Controlled Substances Act,' NFL spokesperson Brian McCarthy told the Post.\n'The NFL clubs and their medical staffs continue to put the health and safety of our players first, providing all NFL players with the highest quality medical care. Any claim or suggestion to the contrary is simply wrong.'","url":"https://www.dailymail.co.uk/news/article-4300014/NFL-sued-plying-players-powerful-painkillers.html"}
