{"authors":[],"date_download":"2018-10-30 14:07:41","date_modify":"2018-10-30 14:07:41","date_publish":"2018-10-29 21:45:23","description":"An Alpharetta student fell ill and became unconscious at school after using a vape pen at school, Channel 2 Action News reported.","filename":"data/vaneerConsumption/NFultonteenfallsunconsciousaftervapingatschoolpolicesay.json","image_url":"https://www.ajc.com/rf/image_large/Wires/w2/USAT_News/2018/09/18/Images/1343495002_9e34a291-b573-4dbb-807f-0947d1892929-GettyImages-468455917.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/ajc.com/news_local_fulton-teen-fall_8712e98e72600f79ed9a71215ec6eba3__1540908461.html","title":"N. Fulton teen falls unconscious after vaping at school, police say","title_page":"N. Fulton teen falls unconscious after vaping at school, police say","title_rss":"NULL","source_domain":"ajc.com","text":"An Alpharetta student fell ill and became unconscious at school after using a vape pen at school, Channel 2 Action News reported.\nA student was using the vape pen at Kings Ridge Christian School on Thursday when he began to get sick, Alpharetta police told Channel 2.\nREAD | Check out 4 new shops that recently opened at Alpharetta City Center\n“The student had been smoking the vape liquid, became very sick, became unconscious and was transported to the hospital,\" said Officer Howard Miller, a spokesman for the police department.\nThe student’s friends told police they had purchased a product called “Green Mist” from VaporKing, a Milton vape shop, and believed that’s what their friend was ingesting before he got sick, Miller told Channel 2. A clerk at the store said they had stopped selling “Green Mist” after receiving complaints about side effects.\nVape pens are legal for people over 18 to use; the devices are used to vaporize a liquid that typically contains nicotine, and can sometimes be used as a replacement for typical cigarettes. Miller warned that parents should keep an eye on their kids to ensure they’re not vaping underage.\nLike North Fulton County News Now on Facebook | Follow us on Twitter and Instagram","url":"https://www.ajc.com/news/local/fulton-teen-falls-unconscious-after-vaping-school-police-say/LAeMuRntJmXGUIHx9pjXdL/"}
