{"authors":["Edwin Mora"],"date_download":"2018-10-30 19:38:38","date_modify":"2018-10-30 19:38:38","date_publish":"2016-11-19 02:33:57","description":"Amnesty International has accused state sponsor of terrorism Shiite Iran of “broadcasting forced ‘confessions’ extracted through torture.”","filename":"data/vaneerConsumption/NGOIranBroadcastingForcedConfessionsExtractedThroughTorture.json","image_url":"https://media.breitbart.com/media/2016/11/french-protesters-against-iran-executions-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_11_18__1540928318.html","title":"NGO: Iran ‘Broadcasting Forced Confessions Extracted Through Torture’","title_page":"NGO: Iran ‘Broadcasting Forced Confessions Extracted Through Torture’","title_rss":"NULL","source_domain":"breitbart.com","text":"Amnesty International has accused state sponsor of terrorism Shiite Iran of “broadcasting forced ‘confessions’ extracted through torture” to justify recent mass executions, particularly the hanging of up to 25 Sunni men accused of terrorism in early August.\nIn a report on Iran published Thursday, human rights organization Amnesty International, notes:\nWithin less than 24 hours after the 2 August mass execution, the Iranian authorities embarked on a media campaign, apparently to dehumanize the executed men and those on death row from the same group in the eyes of the public, to convince the public of their guilt and to justify their executions.\nAccording to the report, the videos features “forced ‘confessions’ extracted through torture” along with foreboding music and unrelated footage of terrorist attacks carried out by the Sunni jihadist group Islamic State (ISIS/ISIL) in Iraq and Syria.\nAmnesty International reports:\nThese videos are interjected with clips showing IS [Islamic State] atrocities carried out in Syria and Iraq, which suggests an effort by the authorities to exploit Iranian people’s fears about security threats elsewhere in the region to justify the men’s executions. In messages recorded from inside prison using a clandestine mobile phone, the executed men had said that they were forced to give “confessions” corded on video after suffering months of torture in the Ministry of Intelligence detention centres where they were held in prolonged solitary confinement. Common methods of torture they described included kicking, punching, beatings with electric batons, flogging, suspension, sleep deprivation and denial of access to food and medication.\nThe report cites the August 2 mass state-sanctioned execution of 25 Sunni men, including 22 from Iran’s Kurdish minority.\nThey “had been convicted on the vaguely worded charge of ‘enmity against God’ (moharebeh) in connection with a number of armed activities,” points out the human rights watchdog group.\n“The mass execution, which was carried out without prior notice to the men’s families and lawyers and amid major fair trial concerns, sent shock waves across the media in Iran and throughout the world, and evoked widespread condemnation,” it adds.\nAll 25 men were accused of carrying out terrorist attacks in Iran’s western Kurdish region and hanged for it, marking “one of the largest mass executions ever carried out” in the Islamic Republic, reports the Independent.\nThe move not to notify the accused men’s family and lawyers prompted condemnation from various human rights groups, including Amnesty International.\nAmnesty International has denounced what it has described as a new practice in Iran, the broadcasting of forced “confessions,” adding that they are being used to justify mass executions.\nThe footage, produced by and widely disseminated by Iranian state-controlled media, are reportedly intended to both justify the executions and exploit fears of Sunni terrorism in the Shiite-majority country, notes Amnesty International, adding that the media outlets have used sensationalist titles such as “In the Depth of Darkness” and “In the Devil’s Hands.”\nHuman Rights Watch has also condemned the new trend.\n“It seems Iran has joined the region’s propaganda industry, producing slick videos featuring the apparently forced confessions of men they later executed as ‘terrorists,’” declared Sarah Leah Whitson, Middle East director of the watchdog organization, referring to the reports of the Islamic Republic broadcasting coerced confessions.\nLast year, there were nearly 1,000 state-sanctioned executions in Iran, marking the highest number in two decades, according to the United Nations.\nA report released on in late July by the Norway-based group Iran Human Rights [IHR], revealed that the Islamic Republic executed at least 250 people in the first six months of this year.","url":"https://www.breitbart.com/national-security/2016/11/18/ngo-iran-broadcasting-forced-confessions-extracted-torture-justify-mass-killings/"}
