{"authors":["Alexandra Klausner For Dailymail.Com","Associated Press"],"date_download":"2018-10-22 23:10:14","date_modify":"2018-10-22 23:10:14","date_publish":"2016-01-11 05:04:46","description":"Hockey teams throughout Massachusetts and New England are rallying around Boston pride player Denna Laing, 24, who injured her spinal cord on New Year’s Eve in Massachusetts.","filename":"data/vaneerConsumption/NHLhockeyhonorBostonPridesDennaLaingwhoinjuredherspinalcord.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/05/3004F69200000578-0-image-a-37_1452488613845.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393371_Hockey-teams-form-number-14-ice-honor-Boston-Pride-player-injured-spinal-cord-NHL-Winter-Classic_1540249814.html","title":"NHL hockey honor Boston Pride's Denna Laing who injured her spinal cord","title_page":"NHL hockey honor Boston Pride's Denna Laing  who injured her spinal cord | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Hockey teams throughout Massachusetts and New England are rallying around a professional women's hockey player who injured her spinal cord on New Year’s Eve.\nDenna Laing, 24, has been hospitalized with severe spinal damage since crashing into the boards during an exhibition before the NHL Winter Classic in Foxboro, Massachusetts.\nJerilyn and Dennis Lang said their daughter 'has limited movement of her arms and no feeling in her legs.'\nUpon hearing the news, local hockey teams formed a number 14 on the ice in honor of Laing's number she wore when she played hockey at Princeton University. All of the teams in the National Women's Hockey League will wear helmet patches with the No. 24 she wore with the Pride.\nInjured; Denna Laing, 24, of the Boston Pride team has been hospitalized with severe spinal damage since crashing into the boards during an exhibition before the NHL Winter Classic in Foxboro, Massachusetts. Jerilyn and Dennis Lang said their daughter 'has limited movement of her arms and no feeling in her legs'\nThe Boston Pride Twitter page posted photos of teams making a heart and the number 14 in the ice in support of Laing who is recovering from her injuries in a hospital\nBoston University Hockey, Boston College Women's Hockey, and the SMC Purple Knights are just a few of the teams who posted their photo in the number 14 arrangement on Twitter this week along with the hashtag #14Strong., according to Boston.com.\nThe NWHL Commissioner, the NHL Commissioner, the Boston Bruins along with the Montreal Canadiens all reached out to Laing and wished her the best, according to Dennalaing.org, a fundraising page set up to cover Denna Laing’s medical expenses.\n'The players, teams, coaches, management and staff of the National Women's Hockey League are united in their support of Denna Laing and her family. To reflect our admiration for her as a player and our appreciation for her contribution to the NWHL's first season, we are working with the Laing’s, our business partners and others to respond compassionately and appropriately to her injury. We will announce further details as soon as plans are formalized. Denna's drive to excel has inspired teammates and coaches alike; in honor of that attribute, I have directed our teams to wear a helmet sticker bearing her uniform number, 24,' said Dani Rylan, NWHL Commissioner.\nShowing support: The SMC Purple Knights and the Lady Ice Knights posted this photo of themesleves in the number 14 arrangement. Laing was the number 14 when she played hockey at Princeton University\nTeam player: Denna Laing is pictured here in her #24 Boston pride Uniform. Laing was injured in what she said on Facebook was the most exciting day of her life. She said she had hoped to bump into Tom Brady\n'Everyone at the National Hockey League, including the Boston Bruins and Montreal Canadiens, joins Denna Laing's coaches, teammates, friends and fans in wishing Denna the very best as she confronts the challenges ahead. While we are certain Denna will be served well by the tenaciousness that is her trademark, we also will work with the Laing family to rally the support of the hockey family during Denna's rehabilitation,' said Gary Bettman, NHL Commissioner.\nCam Neely of the Boston Bruins gave the following comment: 'On behalf of the Jacobs family I would like to extend the full support of the Boston Bruins to Denna and the Laing family. The New England hockey community is an incredibly strong group, and we know the assistance that will be provided to Denna and her family will be unwavering both in the immediate future and throughout the various stages of treatment.'\nGeoff Molson of the Montreal Canadiens said: 'The entire Canadiens family, from ownership to management, staff and players, wishes to extend their very best to Denna through this hardship and lends its support to her and her family following this unfortunate injury. Our thoughts are with Denna, her family, friends and teammates.'\nTravis Roy, a Boston University hockey player who was paralyzed after an incident 20 years ago took to his Facebook to extend his well wishes to Laing.\ncare: 'We made history that day and I would never take those moments back,' Laing wrote in a Facebook post, accompanied by pictures of her and her teammates trying on her Winter Classic gear and taking the ice at Gillette Stadium. She is pictured here being removed from the ice in a stretcher following the injury\nMore love: MA Girl Ice Hockey rallied around Laing who has maintained a positive attitude despite being seriously injured\nCollegiate care: BC women's hockey arranged their helmets in the number 14 as they huddled together for a group shot\n'I want to add my warmest thoughts and well wishes to Denna Laing. Many people have reached out to me with concern for Denna and how they can help. I hope people will go to the DennaLaing.org website and make a donation on her behalf,' wrote Roy.\n'If you have excellent insurance coverage, strong support from family and friends, and financial resources, you will drastically brighten the outcome for spinal cord injured survivor,' said Roy after asking people to donate to Laing's fund.\nRoy continued on Facebook to say the hockey community is extremely supportive of other players.\n'I'm sorry that you have joined the paralysis family, but from everything I've read and heard about you, I have no doubt that you will fight through this and inevitably come out on top,' said Roy, adding that he hopes people will donate to further medical research. Roy has his own non-profit called the Travis Roy Foundation.\nLaing has also spoken out via Facebook following her injury saying that it didn't spoil 'the best day of her life.'\nPride: Pictured here is Laing's cubby at the NHL Winter Classic in Foxboro, Massachusetts. 'Let's start from the beginning, the best day of my life,' she wrote, describing her morning iced coffee ritual and arriving at the team's rink to find her name on a locker filled with merchandise from the NHL, Laing wrote on Facebook\nFriendship: 'We made history that day and I would never take those moments back,' she wrote in a Facebook post, accompanied by a dozen pictures of her and her teammates trying on her Winter Classic gear and taking the ice at Gillette Stadium\n'We made history that day and I would never take those moments back,' she wrote in a Facebook post, accompanied by a dozen pictures of her and her teammates trying on her Winter Classic gear and taking the ice at Gillette Stadium.\n'For a long time I have been looking for a new challenge,' she wrote this week. 'Even though I was not expecting it be this, here we go.'\nIn the Facebook post, Laing described the events leading up to the injury.\n'Let's start from the beginning, the best day of my life,' she wrote, describing her morning iced coffee ritual and arriving at the team's rink to find her name on a locker filled with merchandise from the NHL. 'All I could think about was it was like Christmas.'\nFacebook post 'For a long time I have been looking for a new challenge,' she wrote this week. 'Even though I was not expecting it be this, here we go,' the great sport wrote on her facebook page\nHope: 'We have received an incredible outpouring of love and support from countless friends and family members while we try to navigate this overwhelming situation,' Laing's parents said. Pictured here is Laing on a stretcher following her accident\nArriving at the home of the New England Patriots with a police escort, Laing said, she and her teammates were hoping to bump into quarterback Tom Brady. Then they walked onto the field and saw the rink.\n'It was the most beautiful hockey rink I've ever seen,' said Laing, who is from the Boston suburb of Marblehead.\n'After those first few minutes of skating around tragedy struck. You know the rest.... but I don't want you to feel bad for me. This is a moment to remember for Women's Hockey. We made history that day and I would never take those moments back.'\nLaing works as a witness victim advocate at the Essex district attorney's office. She is being treated at Massachusetts General Hospital.\n'We have received an incredible outpouring of love and support from countless friends and family members while we try to navigate this overwhelming situation,' Laing's parents said.","url":"https://www.dailymail.co.uk/news/article-3393371/Hockey-teams-form-number-14-ice-honor-Boston-Pride-player-injured-spinal-cord-NHL-Winter-Classic.html"}
