{"authors":["Kelly Mclaughlin For Dailymail.Com","Associated Press"],"date_download":"2018-10-22 20:48:36","date_modify":"2018-10-22 20:48:36","date_publish":"2016-01-29 04:03:56","description":"In the second period of Wednesday night's game between the Calgary Flames and Nashville Predators, Flames defenseman Dennis Wideman slammed linseman Don Henderson.","filename":"data/vaneerConsumption/NHLsCalgaryFlamessuspendedindefinitelyafterslammingofficialtotheice.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/04/30AEBDF000000578-0-image-a-95_1454040187559.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3422113_NHL-player-suspended-indefinitely-slamming-official-ice-without-penalty-says-hit-unintentional_1540241316.html","title":"NHL's Calgary Flames suspended indefinitely after slamming official to the ice","title_page":"NHL's Calgary Flames suspended indefinitely after slamming official to the ice | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Calgary Flames defenseman Dennis Wideman sent NHL official linesman Don Henderson to the ice when he checked him from behind during a game against the Nashville Predators.\nIn the second period Wednesday night, Wideman was skating toward the Flames' bench when he cross-checked Henderson, who had his back to the defenseman. Moments earlier, Wideman had taken a hit from the Predators' Miikka Salomaki.\nWideman said after the game that his hit to Henderson was unintentional.\nNHL official linesman Don Henderson was cross-checked to the ground on Wednesday by Calgary Flames defenseman Dennis Wideman\nWideman said after the game that his hit to Henderson was unintentional. Moments before the hit Wideman had taken a hit from the Predators' Miikka Salomaki\n'I took a pretty hard hit down in the corner and had some pretty good pain in my shoulder and my neck and I was just trying to get off the ice,' Wideman said. 'And I was kind of keeled over and at the last second, I looked up and I saw him and I couldn't avoid it.'\nHenderson spent much of the night after the game in the hospital with neck pain and nausea, according to CBS Sports.\nThere was no penalty called on Wideman on the play, but he has since been suspended from the game indefinitely pending a meeting with officials next week.\nAt the next stoppage, Wideman skated over to where the officials were gathered and apologized.\n'Throughout my career - and I've been around for a few years - I think I've treated every official with the utmost respect,' Wideman said, 'and I would never intentionally try to hit a linesman or a ref or anything like that.'\nFormer referees Kerry Fraser and Paul Stewart have spoken out following the incident.\nFraser wrote on TSN.ca: 'This is where any free pass for Wideman ends for me. While I believe contact at this point was unavoidable, I do not accept or condone the finishing push of Wideman's hands that exacerbated the degree of impact and caused a hard fall to the ice by the linesman.\n'I would ask Wideman why he didn't bear hug the defenseless linesman to minimize the contact. Why didn't he decelerate his forward motion in any way to reduce the impact?\nThere was no penalty called on Wideman on the play, but he has since been suspended from the game indefinitely pending a meeting with officials next week\n'Finally, I would ask why he felt it necessary to extend his arms and finish the contact with a strong push on the back of linesman Henderson.\nStewart agreed, citing the 'not less than 10 games' suspension explained in Rule 40.3.\nStewart wrote on HockeyBuzz: 'I get the woozy part and I understand the remorse. However, he's got to sit. The rule is specific and justly so.\n'Hitting a ref or linesman, whether you are conscious or semi-conscious, is an absolute NO EXCUSE action. The NHL Rule Book spells out the automatic disciplinary aftermath.'\nNHL commissioner Gary Bettman said that Wideman would face the league's standard disciplinary process, according to ESPN.\n'I may ultimately have to be in a position of making a judgment here, and I try to never prejudge things,' Bettman said. 'There is a process that we will go through, and ultimately we'll get to the right place.'","url":"https://www.dailymail.co.uk/news/article-3422113/NHL-player-suspended-indefinitely-slamming-official-ice-without-penalty-says-hit-unintentional.html"}
