{"authors":["Matt Roper For Mailonline"],"date_download":"2018-10-22 23:35:54","date_modify":"2018-10-22 23:35:54","date_publish":"2017-04-26 08:05:35","description":"The shocking figures, obtained under Freedom of Information rules, include at least 74 occasions when surgeons operated on the wrong part of a person's body.","filename":"data/vaneerConsumption/NHSblundersledto4200deathslastyear.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/08/3F9D164A00000578-0-image-a-4_1493190158878.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4428172_NHS-blunders-led-4-200-deaths-year_1540251354.html","title":"NHS blunders 'led to 4,200 deaths' last year","title_page":"NHS blunders 'led to 4,200 deaths' last year | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"More than 4,000 people died last year after NHS blunders such as leaving instruments INSIDE a patients body or giving them the wrong drugs.\nMailOnline has learned that avoidable mistakes by hospital staff have left a trail of victims - while the health of another 13,400 patients got worse.\nThe shocking figures, obtained under Freedom of Information rules, include at least 74 occasions when surgeons operated on the wrong part of a person's body and 34 times when an instrument or swab was accidentally left inside a patient's body following surgery.\nThe parents of one-year-old Liyho Swift-Mitchell, whose lungs collapsed after a nurse ignored allergy warnings and gave him the wrong antibiotic, called for an investigation.\nLiam Swift-Mitchell, 24, from Gloucester, told MailOnline: 'It's absolutely disgusting. It makes me scared to take my son to hospital, in case it happens again.\nShocking: At least 4,225 patients needlessly lost their lives due to avoidable mistakes by hospital staff last year and 13,400, including one-year-old Liyho Swift-Mitchell, above, got worse\nBlunder: Liyho, pictured above as a newborn, was one of more than 13,000 patients whose conditions deteriorated because of wrong diagnoses, medication errors or poor treatment\n'It makes me sick to my stomach. It destroyed Georgia [Liyho's mother] seeing her son like that, not being able to move, always on some kind of treatment.\nLiyho was wearing a red wristband warning of an amoxicillin allergy when his parents took him to Gloucester Royal Hospital for a cold in October, but a nurse gave him the drug anyway.\nHe was rushed to a High Dependency Unit unit and put on an oxygen mask for three days after suffering a severe allergic reaction to the antibiotic, which caused both of his lungs to collapse.\nSix months later, his father Liam says Liyho still has not recovered from the blunder, telling MailOnline: 'He does get better, then it gets ten times worse.\n'He still gets a really bad chest and he's not been well since that happened, which is due to their mistake.\n'He still has trouble breathing and every time he gets poorly, his lungs are collapsing so we have to give him steroid and oxygen inhaler which we always have to keep nearby.\n'We just want him to have the life he deserves,' added Liam, who now wants to pursue legal action against the NHS.\n'I feel bad for other families going through the same thing and I think people will be quite disgusted at the way we were treated.'\nMistakes: The worrying figure are nine times higher than similar studies done a decade ago, suggesting that staff shortages and longer hours are taking an alarming toll on patient safety. The numbers of people being treated has also increased. Pictured: Liyho, who was given a drug he was allergic to, with his father\nNeedless: In some of the worst cases, NHS users were injected with the wrong drug and given transfusions of the wrong blood type Pictured: Liyho, whose lungs collapsed after being given the wrong drug, with father Liam and mother Georgia\nDangerous: The patients who died needlessly include a 93-year-old patient who had a heart attack after wrongly being given insulin instead of Dextrose. Pictured: Liyho, who still has to use a oxygen and steroid inhaler when his chest inflames\nThe worrying numbers, unearthed through a Freedom of Information request, are nine times higher than similar studies done a decade ago, suggesting that staff shortages and longer hours are taking an alarming toll on patient safety. The numbers of people being treated have also increased.\nIn some of the worst cases, NHS users were injected with the wrong drug, given transfusions of the wrong blood type or received treatment meant for another patient.\nThey include a 93-year-old patient who died of a heart attack after wrongly being given insulin instead of Dextrose.\nIn another incident a patient was accidentally given four potentially fatal injections in his eyes after staff mixed him up with another person with a similar name.\nAnd in one catastrophic mix-up staff put food in the mouth of a patient who should not have been fed orally, leading to the person having a cardio-respiratory arrest and dying.\nLast night Liz McAnulty, Chair of the Patients Association, said the figures showed the NHS is heading for a 'major crisis'.\nShe said: 'The NHS has a long way to go to become an effective learning organisation, that acknowledges its mistakes and draws lessons from them so that they don't happen again. That's the only route to reducing harm to patients from Serious Untoward Incidents, the consequences of which can be heart-breaking for patients and their families.\nSued: It emerged last year that the NHS had set aside £56billion for compensation and legal fees to settle medical negligence claims. Liyho's parents now say they want to pursue legal action against the NHS\nNearly three quarters of the 238 health trusts in England and Wales responded to our request for information about serious untoward incidents (SUIs), avoidable events which result in severe harm or death to patients.\nWith numbers of medical blunders soaring, it was revealed last year that the NHS had set aside £56billion for compensation and legal fees to settle medical negligence claims.\nThe massive amount is almost half the annual £120bn budget of the NHS. Nearly three quarters of the 238 health trusts in England and Wales responded to our request for information about serious untoward incidents (SUIs), avoidable events which result in severe harm or death to patients.\nThe toll of at least 17,625 incidents, resulting in over 4,000 deaths, is nearly nine times high than a similar survey conducted ten years ago, when only 220 deaths were recorded.\nAmong the catalogue of errors committed by overstretched staff last year were at least 352 instances when patients were harmed by wrong or delayed treatment, 331 cases of missed or wrong diagnoses and 440 times when patients were given wrong doses of drugs, or the wrong medication altogether.\nThe Princess Alexandra Hospital in Harlow, Essex, reported that a patient had been received morphine 'with no obvious reason', resulting in respiratory depression.\nIn a statement, the hospital said that following the incident a 'comprehensive root casa analysis was undertaken' and that 'the learning from the investigation was shared widely in the trust'.\nAt the Christie NHS Trust in Withington, Manchester, a patient suffered a heart attack after being given a strong potassium IV by mistake.\nAnd among the 14 errors reported by Bolton NHS Trust, a newborn baby was inadvertently given an overdose of morphine.\nA spokesman for the trust, which runs the Royal Bolton Hospital, said: 'The baby was unfortunately administered an overdose of morphine due to human error in an urgent situation. The baby fully recovered from the dose. The parents were kept fully informed at all times.'\nOther blunders at the trust, which runs the Royal Bolton Hospital, included a patient who was implanted with the wrong lens, another being given an anaesthetic block in the wrong place and another who underwent unnecessary surgery after doctors mixed up the same patient's results.\nMeanwhile, the Clatterbridge Cancer Centre in Wirral, Cheshire, blamed the 'poor design of software' for a patient undergoing Papillon rectal cancer radiotherapy having received a 'dose much greater than intended'.\nIt said: 'A patient undergoing contact therapy received a dose greater than intended due to unexpected behaviour of the treatment machine software. The manufacturer carried out an upgrade to the software so that the incident could not happen again. No harm was caused to the patient involved.'\nAmong the NHS users who died unnecessarily last year was Robert Welch, 93, who was mistakenly being given insulin instead of Dextrose at the Diana, Princess of Wales hospital in Grimsby, Lincs.\nMishaps: Among the 14 errors reported by Bolton NHS Trust, a newborn baby was inadvertently given an overdose of morphine. Pictured: Liyho, whose father told MailOnline he was 'disgusted' by the new findings\nThe insulin overdose caused the ex-Royal Marine to have a heart attack, then it took staff up to an hour to spot he had collapsed following the injection last June.\nFollowing an inquest into his death, Mr Welch's son Andrew, himself a leading NHS surgeon, blamed NHS cutbacks and not doctors, saying: 'It's a really tough time for the NHS.\n'Keeping hold of staff is difficult because of all the pressures. They are doing their best.'\nAnother was Patricia Fowler, 75, who died in January last year after languishing for three days at Blackpool Victoria Hospital, Lancashire, after a mix-up with her name meant doctors had no idea she was there.\nAfter being admitted into hospital with a broken arm, the grandmother was transferred to a cardiac ward because of a shortage of beds.\nDoctors blamed an email list of patients, in which Mrs Fowler appeared next to another patient with the same first name, to explain why she was never seen by a consultant, slowly developing deadly pneumonia and sepsis and dying five days later. Her youngest son Scott said: 'Going into hospital killed my mother.\n'You don't die from a broken arm. You die from pneumonia and sepsis and she got those because she was left on that ward without doctors' reviews. The grief we all feel has devastated us and the personal guilt I feel is immense.'\nGone: Former Royal Marine Robert Welch, above, 93, died unnecessarily after he was mistakenly given insulin instead of Dextrose at the Diana, Princess of Wales hospital in Grimsby\nThe incident was among 60 serious incidents reported by the trust last year. It wasn't the only time NHS staff mixed up patients with potentially catastrophic consequences.\nAt Birmingham and Midlands Eye Centre, based at City Hospital, Birmingham, an outpatient was inadvertently given two Lucentis injections, which slow the growth of blood vessels, in each eye after he was mistaken with another person 'with a similar name and date of birth'.\nSide effects can include bleeding from the eye, cataracts and detached retinas, and in the most serious cases fatal complications related to blood clots, such as heart attacks and strokes.\nAlso in Birmingham, at the Sandwell and West Birmingham Hospitals NHS trust, where the patient died after being mistakenly fed through the mouth, two other shocking errors had a devastating effect on victims' families.\nIn one case, according to the trust's report, a baby was stillborn 'due to misinterpretation of stage of labour on admission'.\nAnd in another, surgeons incorrectly inserted a catheter perforating the urethral or prostate lining. The blunder led to sepsis and multi-organ failure and the patient later died.\nAmong the 57 serious untoward incidents reported at Salford Royal NHS Trust, seven resulted in death, including one patient suffered respiratory arrest after high flow oxygen was inadvertently disconnected.\nIgnored: Patricia Fowler, right, 75, died at Blackpool Victoria Hospital, in Lancashire, last year because a mix-up with her name meant doctors had no idea she was there\nOther blunders included a gall stone removal bag which was left inside a patient post op, a patient who had the wrong tooth removed and another who had surgery on the wrong toe, and another who was being operated on his right side until surgeons realised it should have been his left side.\nBarts hospital in London recorded 329 serious incidents last year, 34 of which resulted in a patient's death.\nThey included a patient given an overdose of insulin caused by the use of an inappropriate syringe, an accidental overdose to a baby, a wire left in a patient following surgery and three cases of wrong site surgery.\nAmbulance crews were also involved in serious errors. Among the 44 incidents reported by East Midlands Ambulance Service, paramedics trying to resuscitate a 19-year-old in cardiac arrest placed the endotracheal tube used to prevent suffocation in the patient's food pipe rather than the windpipe.\nThe patient was declared dead after resuscitation attempts failed. And at the North West Ambulance Service, the incorrect coding of an emergency call by operators meant that by the time crews arrived a child was already in cardiac arrest and later died in hospital.\nJames Sumner, Chief Officer of Salford Royal NHS Foundation Trust said: 'Our patients' safety is our most important priority and as an open and transparent organisation, we actively encourage our staff to speak up if things go wrong. Where mistakes do unfortunately occur, it is important that we learn from them so that we can avoid them happening again.'","url":"https://www.dailymail.co.uk/news/article-4428172/NHS-blunders-led-4-200-deaths-year.html"}
