{"authors":["Katie French For Mailonline"],"date_download":"2018-10-23 03:16:14","date_modify":"2018-10-23 03:16:14","date_publish":"2017-03-10 12:42:50","description":"Paula Vasco-Knight, 53, (pictured), dramatically collapsed in court today after being spared jail. She admitted using tax payer's cash to run her husband's company from their garden shed.","filename":"data/vaneerConsumption/NHSchiefexecPaulaVascoKnightsparedjail.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/13/3E22F11F00000578-0-image-a-33_1489151270040.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4300522_NHS-chief-executive-sentenced-spending-taxpayer-s-cash_1540264574.html","title":"NHS chief exec Paula Vasco-Knight spared jail","title_page":"NHS chief exec Paula Vasco-Knight spared jail | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Paula Vasco-Knight, 53, was given a suspended jail sentence at Exeter Crown Court after admitting one charge of fraud\nAn NHS chief executive earning £200,000 a year defrauded her own Trust by paying her husband's graphic design firm £11,000 for work he never completed.\nPaula Vasco-Knight, 53, was spared prison today but dramatically collapsed outside court after a judge slammed her 'monumental fall from grace'.\nShe gave public money from her £200,000 budget to a company her husband Stephen ran from a garden shed.\nThe former chief executive was given a 16-month suspended jail sentence and ordered to carry out 250 hours of unpaid work.\nHer husband received 10 months' imprisonment, also suspended for two years, and 150 hours of unpaid work.\nVasco-Knight was described during the trial as 'dishonest in the extreme' when she siphoned off the payments without telling colleagues that graphic designer 'Steve' was in fact her husband Stephen.\nHe was paid £9,000 to design one newsletter and £11,072 to knock up a 200-page document on leadership called 'Transform' – described as a 'complete sham' because it never existed.\nProsecuting, Gareth Evans told the court the couple initially denied any wrongdoing and claimed the 200-page publication was highly valuable.\nThe court heard that when interviewed by police, both defendants handed over a hardcopy of the document.\nMr Evans said: 'Paula Vasco-Knight said to officers, \"Please take care of it\", implying an importance and value on the document.'\n'It's clear it's a complete fraud,' he added.\nThe judge said he seldom saw offenders 'so utterly devastated by the enormity of what you so stupidly did'\nThe document was found to contain empty pages and text lifted from other sources.\nThe couple, from Runcorn in Cheshire, kept up the pretense of being not guilty until they dramatically changed their plea on day two of the trial.\nVasco-Knight shook and sobbed uncontrollably as she changed her plea at last minute to one of the two charges of fraud. Her husband also admitted fraud.\nVasco-Knight admitted abusing her position as CEO at the hospital by authorising the £11,072 payment to her husband.\nBefore she collapsed in court, a judge said that Vasco-Knight's condition remained 'frail.'\nSpeaking at Exeter Crown Court today as he delivered their sentence, the judge said: 'This is a monumental fall from grace and I seldom see offenders so utterly devastated by the enormity of what you so stupidly did.\n'Paula Vasco-Knight as as chief executive officer at the South Devon NHS Trust, one can hardly imagine a more serious abuse of trust and responsibility on your part.\n'You were on a six-figure salary. In arranging for your husband to secure this contract between you, you obtained just over £11,000 of the public's money.\n'Money from an NHS budget which we all know is under the severest pressure for resources.'\nExeter Crown Court heard that Vasco-Knight, who also held a position at the national lead for equalities, rose through the ranks, becoming the NHS's first ever black chief executive.\nPaula Vasco-Knight (left) pictured leaving the court with her husband and brother (centre, right) during the two-week trial held in Exeter\nShe earned £170,000 a year as the chief executive of Torbay Hospital and an additional £27,000 for a one-day-a-week position as an equality advisor.\nBut it emerged Vasco-Knight had failed to declare an interest in her husband's company, Thinking Caps, which he solely ran from their garden shed.\nHis company was assigned to make the booklet which was described by the prosecution as 'nothing more than a notepad'.\nShe admitted abusing her position as CEO at the trust by authorising the £11,072 payment to her husband for the document.\nHer husband also pleaded guilty to fraud by submitting a false invoice to the trust for the Transform document in November 2013.\nDefending Stephen Vasco-Knight, Brendan Carville said: '12 years ago Mr Vasco-Knight was a happily married man. His wife had cancer and she suddenly died. He became the sole carer for his three-year-old child.\n'They married and were a successful team.'\nHe also described his client as a 'very, very good' graphic designer.\nHe added that both Mr and Mrs Vasco-knight didn't 'deserve' to go to prison..\nDefending Paula Vasco-Knight, Llyod Morgan, said: 'Mrs Vasco-Knight started in very humble beginnings. She qualified as a nurse and worked many, many years as a nurse.\nExeter Crown Court where Vasco-Knight Vasco-Knight sobbed as she admitted to carrying out the fraud on the second day of the trial\nHe said: 'She continued to work as a nurse, such was her dedication to the welfare of the patients in the trust.'\n'She reached dizzying heights more than she ever expected but has had a fall of an even greater magnitude.'\nHe added: 'She bitterly regrets it and she will regret it for the rest of her life.'\nVasco-Knight was the chief executive of South Devon NHS Foundation Trust until her resignation in 2014.\nShe also worked for one day a week as the NHS's head of equality and diversity, where she had control of a £200,000 annual budget.\nHer fall from grace began in 2015 when whistleblowers accused her of selecting her own daughter's boyfriend as an equality and diversity manager at her own Trust.\nThe claims led to a chief executive quitting her job over 'nepotism and favouritism'. She denied the claims and said she was victim of 'personal slander.'\nNHS senior manager Habib Naqvi, 39, was found not guilty of two charges of encouraging or assisting Mrs Vasco-Knight after the prosecution offered no evidence against him.\nThe fraud investigation was conducted by NHS Protect.","url":"https://www.dailymail.co.uk/news/article-4300522/NHS-chief-executive-sentenced-spending-taxpayer-s-cash.html"}
