{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 20:51:18","date_modify":"2018-10-30 20:51:18","date_publish":"2014-11-16 14:55:00","description":"An NHS doctor has skipped bail for charges of assault and fled to Pakistan, where he has become a senior Taliban leader. He was able to leave the country |","filename":"data/vaneerConsumption/NHSDoctorSkipsBailtoJoinTaliban.json","image_url":"https://media.breitbart.com/media/cdn/mediaserver/Breitbart/Breitbart-London/2014/11/16/Mirza-Tariq-Ali.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2014_11_16__1540932678.html","title":"NHS Doctor Skips Bail to Join Taliban","title_page":"NHS Doctor Skips Bail to Join Taliban | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"An NHS doctor has skipped bail for charges of assault and fled to Pakistan, where he has become a senior Taliban leader. He was able to leave the country despite being ordered to surrender his passport as part of his bail order. Now he has resurfaced on a recruitment video, urging jihadists to join him, the Telegraph has reported.\nMirza Rariq Ali, 39, arrived in Britain in 2004, after serving in the Pakistani army as a medic. He trained at a London teaching hospital before working as a locum surgeon in London and Cambridge, whilst living in Walthamstow, east London. Earlier this month he was removed from the British medical register at a hearing in Manchester.\nLast year he was charged with violent disorder for hitting a bystander with a placard stick repeatedly during a demonstration calling for jihad in Syria, organised by the banned extremist group al-Muhajiroun, which is run by the British cleric Anjem Choudary. He was then re-arrested for breaking his bail conditions, by taking part in two more extremist rallies, contrary to the rules of his bail.\nBriefly imprisoned following the arrests, he was ordered to surrender his passport whilst awaiting trial, with the date of his hearing set for May this year. Instead he managed to give both the Metropolitan Police and MI5 the slip and fled the country. In his absence, in June, judges at the Old Bailey in London sentenced him to 15 months jail time.\nHowever, by then he had changed his name to Dr Abu Obaidah Al-Islamabadi and had begun publishing an online jihadist magazine in the English language, aimed at recruiting Western youths to jihad. Last week, six months after his flight, Ali emerged from hiding to take part in the video, a 13 minute broadcast in which he called on foreign fighters to join the Taliban and overthrow the Pakistani government.\nSpeaking both Urdu and English, Ali attests that, upon his departure from Britain he tried to join ISIS but was arrested and jailed in Croatia. From there, he was deported by the Croatian authorities to Pakistan, rather than being sent to the UK to serve his prison sentence. It is unclear why he was in Croatia at all. With some difficulty, he was then able to join the Tehreek-e-Taliban Pakistan Jamaatul Ahrar (TTPJA). He spoke of leaving a comfortable life in Britain behind.\nAli is the second jihadist associated with al-Muhajiroun and Anjem Choudary to evade effective police surveillance. Last week, it was revealed that Siddhartha Dhar, 31, had also managed to leave the UK less than 24 hours after being released on bail, despite also being ordered to surrender his passport. He was being investigated by Scotland Yard for his links to Choudary’s inner circle.\nA former independent reviewer of anti-terror legislation for the Government, Alex Carlile QC has said “It’s obviously a matter of great concern that people have left the jurisdiction and evaded British justice in this way,” he said. “It may be difficult for the police to keep tabs on everyone but clearly more needs to be done.\n“One has got to ask the question, why was he granted bail for a second time?\n“When someone is asked to surrender their passport, police must check with the Passport Agency to make sure he hasn’t been given a second one.”\nThe cases will raise concerns about the likely efficacy of Prime Minister David Cameron’s latest plans to stop British fighters who have travelled to Syria or Iraq from returning to the UK for two years. Police would also be able to confiscate passports of suspected terrorists for up to 30 days.\nWhen asked whether the proposed measures would leave militants stateless, Cameron replied “We need additional powers as well as simply the criminal law.\n“We believe we need an additional set of powers in order to keep the country safe over and above what the criminal law allows, and I think it is very sensible that we do that.\n“At the end of the day, I make the choices based on what I think is necessary to keep the British public safe, and I think this new power is important in this regard.”","url":"https://www.breitbart.com/europe/2014/11/16/nhs-doctor-skips-bail-to-join-taliban/"}
