{"authors":["Ben Spencer Medical Correspondent For The Daily Mail"],"date_download":"2018-10-22 22:07:30","date_modify":"2018-10-22 22:07:30","date_publish":"2017-03-10 00:20:04","description":"The sepsis campaign was triggered in January last year by the Daily Mail’s revelations over the death of 12-month-old William Mead (pictured) from Cornwall.","filename":"data/vaneerConsumption/NHSintroducerulesafterMailscampaignagainstsepsis.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/00/3E1EA56500000578-0-image-a-33_1489104807430.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4299496_Now-doctors-told-treat-sepsis-one-hour_1540246050.html","title":"NHS introduce rules after Mail's campaign against sepsis","title_page":"NHS introduce rules after Mail's campaign against sepsis | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"All patients arriving at hospital with possible sepsis should be treated by a senior doctor within an hour, under tough new NHS rules.\nThey should be assessed, given antibiotics and put on intravenous fluids within 60 minutes of walking through the hospital door.\nIn a victory for the Daily Mail, health watchdog NICE today publishes NHS ‘quality standards’ designed to slash the number of sepsis deaths.\nThe sepsis campaign was triggered in January last year by the Mail’s revelations over the death of 12-month-old William Mead (pictured left and right). Doctors failed to spot he had sepsis, while workers on the 111 helpline mishandled a call from his mother\nThe document sets out minimum standards to be used by NHS bosses, inspectors and lawyers to hold hospitals to account.\nSepsis, known as the ‘silent killer’, strikes when an infection such as blood poisoning sparks a violent immune response in which the body attacks its own organs.\nIt is the leading cause of avoidable death, killing at least 44,000 a year.\nIf caught early, the infection can be controlled by antibiotics before the body goes into overdrive.\nBut early symptoms can be easily confused with more mild conditions, meaning it is difficult to diagnose. A patient can rapidly deteriorate if sepsis is missed early on, so quick diagnosis and treatment is vital – yet this rarely happens.\nNHS figures from March last year reveal that, even 90 minutes after arriving at hospital, 22 per cent of sepsis patients had not been seen, and 38 per cent had not been given antibiotics.\nDr Ron Daniels, of the UK Sepsis Trust, said: ‘This will ensure the right people get to the right patients and deliver the right care at the right time.\n‘It is not just a tick-box exercise. Hospitals will have to demonstrate that they have the systems in place to make this happen.’\nThe Mail started its End The Sepsis Scandal campaign last year to raise awareness of symptoms among patients and staff, in an attempt to reduce the number of missed cases of sepsis.\nEarly symptoms of sepsis can be easily confused with more mild conditions\nIt led to an awareness drive launched by Health Secretary Jeremy Hunt in December, which included telling pregnant women about sepsis signs, new training for doctors and nurses, and millions of posters and leaflets.\nThe new rules go even further, forcing doctors to consider the risk of sepsis in every patient.\nThe draft document proposes a further safety net in which every patient who has an infection, even if not thought to be high risk, is given a sepsis-signs leaflet and told to come back to hospital if their condition worsens.\nThose who have any sepsis symptoms – such as rapid breathing, high heart rate, confusion, a rash or ashen appearance – should immediately be seen by a senior doctor, who has been qualified for at least four years, or an advanced nurse practitioner.\nThey should be given antibiotics within an hour, and high-risk patients given intravenous fluids.\nUnder-18s should be seen only by doctors with at least five years’ experience, and under-fives by a paediatric specialist.\nThe document also says patients more than an hour away from a hospital should be given antibiotics by a GP or paramedics.\nThe report advises all health professionals – whether a GP, paramedic or A&E doctor – to record vital signs such as temperature and heart rate, as well as checking for rashes and skin discolouration, so no signs are missed.\nMr Hunt said: ‘We need to get far better at spotting sepsis across the NHS and this advice shows how vital it is for clinicians to treat life-threatening symptoms as soon as possible.’\nThe Mail started its End The Sepsis Scandal campaign last year to raise awareness of symptoms among patients and staff\nThe sepsis campaign was triggered in January last year by the Mail’s revelations over the death of 12-month-old William Mead.\nDoctors failed to spot he had sepsis, while workers on the 111 helpline mishandled a call from his mother Melissa. Mrs Mead, of Cornwall, said: ‘I am delighted that all clinical organisations are coming together to improve care.\n‘The speed in which sepsis takes over the body – 36 hours in William’s case – is frightening.’\nProfessor Gillian Leng, from NICE, said: ‘There are inconsistencies in how people’s symptoms are assessed in different settings. More can be done to provide rapid treatment.’\nBut Dr Daniels warned hospitals would need further resources to ensure the standards are met.\nParliamentary and Health Service Ombudsman Julie Mellor said the new rules would ‘ultimately save thousands of lives’.","url":"https://www.dailymail.co.uk/news/article-4299496/Now-doctors-told-treat-sepsis-one-hour.html"}
