{"authors":["James Delingpole","The Lack Of Women Chairs Is Bad Enough. But The Bme Proportions Are Disgraceful","Said Philip Hunt","The Labour Shadow Health Minister In The House Of Lords","Who Was Chair Of The Heart Of England Hospital Trust In Birmingham For Four Years Until"],"date_download":"2018-10-30 22:06:19","date_modify":"2018-10-30 22:06:19","date_publish":"2016-08-22 11:56:11","description":"\"We must have more black and Asian women running the NHS\", said no National Health Service patient, ever.","filename":"data/vaneerConsumption/NHSNeedsMoreSeniorBlackWomenSaysGuardian.json","image_url":"https://media.breitbart.com/media/2016/08/grauniad-640x480.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_08_22__1540937179.html","title":"'NHS Needs More Senior Black Women', Says Guardian.","title_page":"'NHS Needs More Senior Black Women', Says Guardian.","title_rss":"NULL","source_domain":"breitbart.com","text":"“We must have more black and Asian women running the NHS”, said no National Health Service patient, ever.\nThat’s because if you’re in serious need of treatment, as I was earlier this year, you’re too busy with more important stuff, like:\nWhere the hell you’re going to find a space in the (enormously expensive) car park.\nWill it be five hours waiting to be seen by a nurse in the Star-Wars-Cantina-meets-the-Third-Circle-of-Hell (aka A & E) or just the four and a half?\nWill there be a bed available for my operation or will it be occupied by a chronically ill elderly person who really shouldn’t be in an acute ward at all but who has somehow got stuck in the system because there’s nowhere else for him to go?\nWill they diagnose me correctly, in good time, before I die or end up having to have my legs amputated like that poor three-year old boy?\nWhy am I lying in a pool of faeces and blood, with no nurses around to bring me a drink or clean me up or give me my insulin injections?\nEtc.\nReally, you’d need to be clinically insane to imagine that the solution to any of these problems would be to burden the NHS with some kind of quota system requiring it to employ a certain number of women and ethnic minorities in senior positions regardless of their suitability for the jobs.\nYet this, amazingly, is what the Guardian believes. Why else would it have devoted most of its front page today to a story headlined White men keep control of the NHS?\nIt’s based on a report by Labour Shadow Health Minister Lord Hunt:\nOnly 2% of NHS trusts are chaired by people from a black and minority ethnic (BME) background, while 15% of England’s population is of BME heritage. While 80% of NHS staff are women, women make up just 28% of trust chairs, outnumbered three to one by men.\nThe idea that such people should be denied preferment merely on the basis of skin pigmentation and possession of a Y chromosome is as stupid as it is racist as it is insulting.\nWorse than, that, though it is seriously dangerous.\nIf only the sole function of the Guardian were to provide amusement for those of who enjoy having its headlines satirised on Twitter by SoMuchGuardian.\nUnfortunately, it’s the newspaper of choice for: all BBC employees; school teachers; trades unionists; civil service middle managers; university professors; activists.\nThis means that while its circulation is small, its influence on the cultural debate and on government policy is disproportionately huge.\nThe NHS is facing a huge funding crisis and is close to collapse. As the Telegraph recently reported:\nHospitals are to cancel thousands of operations and appointments in a desperate bid to stop the NHS “buckling” this winter, under Government plans. Health officials are drawing up contingency measures to attempt to safeguard emergency care by diverting senior doctors from operating theatres into wards and Accident & Emergency departments as winter sets in. The national plan, detailed in evidence to the Commons health select committee, comes amid concern that the NHS is already in the grip of the worst bed-blocking crisis on record.\nThis isn’t theoretical crap such as Philip Hunt (as he was before his ennoblement) would have learned on his Political Studies course at Leeds in the 1970s. This is about real people with real health problems, some of them a matter of life and death.\nIt’s all too typical of the intellectual and moral corruption of the left that instead of agitating for better, more thorough and efficient patient care – something the poor, being unable to go private, need more than anyone – it is instead concerning itself with politically correct window dressing.\nHow is any patient going to have their treatment or outcome improved by diversity and gender quota systems?\nAnd how dare the NHS grumble about lack of money while simultaneously making announcements like this:\n“We’re investing £2m over two years (2015-17) in the WRES programme to improve equality in recruitment, board membership and career opportunities. This includes training and developing 75 champions based in trusts who will help reduce inequality and spread best practice.”\nIf that’s how the NHS chooses to spend our tax money – £2 million on “inequality” programmes: how many spare beds or anti-cancer drugs could you buy with that? – then maybe it’s time to pull the plug on its life support machine.","url":"https://www.breitbart.com/europe/2016/08/22/guardian-finds-cure-for-the-nhs-more-women-more-ethnic-minorities-obvs/"}
