{"authors":["Press Association"],"date_download":"2018-10-22 21:31:34","date_modify":"2018-10-22 21:31:34","date_publish":"2016-01-29 06:48:31","description":"The NHS is to fund hand transplants for patients in desperate need following injury or serious infection. A team in Leeds has been given the go-ahead to run ...","filename":"data/vaneerConsumption/Nhsprogrammesettofundhandtransplants.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/article-P-5b103345-4573-424b-8d45-643c8494d5c4-4PuZeKVXE7cd9005b2c8765f0224-35_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-3421982_NHS-programme-set-fund-hand-transplants_1540243894.html","title":"Nhs programme set to fund hand transplants","title_page":"Nhs programme set to fund hand transplants | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"NHS programme set to fund hand transplants\nThe NHS is to fund hand transplants for patients in desperate need following injury or serious infection.\nA team in Leeds has been given the go-ahead to run the NHS programme and recruit patients who have suffered injury, an accident or sepsis.\nFour people are currently in line to receive a hand from a donor, with the first operation as part of the programme expected this year.\nMark Cahill, right, became the first person in the UK to have a hand transplant\nThe UK's first hand transplant was performed in 2012 on former pub landlord Mark Cahill, who now has major use of his hand and can pick up his grandchildren.\nNHS England has spent three years examining the potential for hand transplants and has agreed that Leeds Teaching Hospitals NHS Trust will be the UK base.\nConsultant plastic surgeon Professor Simon Kay, who operated on Mr Cahill, will run the programme.\nHe said: \"There have been lots of hand transplants around the world but this is the first time a national funding organisation has closely examined the issue, come up with the conclusion that it's worth pursuing and is now going to fund it nationally in one centre.\"\nSurgeons expect to carry out one or two transplants per year but Prof Kay said his team was willing \"to do as many as are needed\".\nHe said: \"We don't know how many are needed because we haven't been looking for patients. We have four patients waiting, of whom two have been completely evaluated and are on the waiting list. We're looking for donors for them now.\n\"One other patient is in the process of evaluation and will probably be ready to go forward around June. We have another patient who has been closely evaluated but who has health issues that we're still working on.\n\"These are the four that have appeared when we weren't open for business. It's unlikely we will do more than one or two per year, but we will meet the need.\"\nEligible patients have typically lost one or both hands, mostly below the elbow.\nThey may have suffered injuries caused by a machine or other things, including chainsaws.\nThe deadly blood infection sepsis is the commonest cause of hand loss, Prof Kay said.\nNHS Blood and Transplant will work closely with the team in Leeds to identify possible donors. The initial focus will be on donors in Yorkshire and the North due to the need for a rapid transit of the donor hand. There is a view to expanding the search across the UK.\nThe main focus is on matching blood group, skin tone and hand size.\nThe option to choose to donate limbs is not recorded on the NHS Organ Donation Register, so specific permission will be sought from the families of potential donors after their death.\nProf Kay said it was not always the case that hands have to be matched by gender. He personally travels out to see each donor to ensure there is a good match.\n\"There are quite feminine male hands and masculine female hands,\" he said.\n\"Age is kind of a guideline but skin tone is quite important because otherwise they look very odd.\"\nDuring the six to 12 hour procedure, teams of surgeons work to remove the donor hand while separate teams work on the recipient.\nDuring the attachment, the two bones in the upper arm are put in place with titanium plates and screws.\nSurgeons then connect key tendons and muscles, before blood vessels - including the two main arteries in the upper arm - are connected.\nOnce blood is circulating to the limb, remaining nerves, tendons and muscles are attached.\nProf Kay said: \"The hand will be numb straight after the operation, the nerves will not have re-grown.\n\"But the muscles will work so rehabilitation aims to keep joints mobile and maximise the function of the muscles that are already connected.\n\"You're waiting for the nerves to regenerate and power the small muscles within the hand, which will recover in about six to nine months.\"\nThe feeling in the hand should then come back.\nEstimates are that the operation costs £50,000, and after that about £2,000 and £3,000 per year in rehabilitation and immuno-suppressant drug costs.\nMr Cahill, from West Yorkshire, has regained almost complete use of his transplanted hand and can tie his shoelaces and drive a car.\nHe said: \"My experience as a patient and my quality of life since the hand transplant has been fantastic.\n\"I would like to thank once again the family of the donor who gave their permission for me to have the hand of their relative at such a difficult time for them. It really has transformed my life\".\nAll patients will be carefully screened for psychological and physical suitability.\nAround 80 hand transplants have been performed worldwide.\nDr Jonathan Fielden, NHS England's director of specialised commissioning, said: \"The NHS is leading the world in offering this cutting-edge procedure, which has been shown to significantly improve the quality of life for patients who meet the strict criteria.\"\nThe team in Leeds is hoping it will be able to expand the programme at some point to people without hands caused by congenital abnormalities.","url":"https://www.dailymail.co.uk/wires/pa/article-3421982/NHS-programme-set-fund-hand-transplants.html"}
