{"authors":["Tammy Hughes For The Daily Mail"],"date_download":"2018-10-22 21:48:58","date_modify":"2018-10-22 21:48:58","date_publish":"2016-01-11 01:45:32","description":"Thousands of NHS staff have been rehired after being handed generous redundancy pay offs. staff received £92m in redundancy after 2,641 staff were laid off then rehired in the three years.","filename":"data/vaneerConsumption/NHSstaffwererehiredinthreeyearsandgivennewjobsafter92mpayoffs.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/01/017F3CD40000044D-0-image-a-47_1452476500615.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393209_NHS-staff-rehired-three-years-given-new-jobs-92m-payoffs_1540244938.html","title":"NHS staff were rehired in three years and given new jobs after £92m payoffs","title_page":"NHS staff were rehired in three years and given new jobs after £92m payoffs | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Thousands of NHS staff were laid off after being handed generous redundancy pay offs only to re-employed by the health service a short time later.\nA reorganisation of the NHS masterminded by the former health secretary Andrew Lansley was branded a ‘merry-go-round of waste’ last night.\nMr Lansley abolished 161 NHS bodies and created new ones to give doctors more freedom.\nThousands of NHS staff who were given generous redundancy payoffs were rehired within three years\nAs a result, 2,641 staff were laid off and rehired in the three years from April 2012 and average pay-offs topping £36,000, Parliamentary questions by Labour have revealed.\nIn total these staff received £92million in redundancy in that period.\nShadow health secretary Heidi Alexander told The Times: ‘If you wanted a symbol of the folly of the NHS reorganisation, then firing and rehiring managers must surely be it. On David Cameron’s watch it’s been payoffs for managers and pay cuts for nurses.\n‘This merry-go-round of waste is unacceptable particularly at a time when the NHS needs every penny it can get,’ he said.\nThe newspaper revealed that one married couple received redundancy totalling almost £1million but moved to new posts in the same hospital a few months later.\nOn David Cameron’s watch the NHS has seen large payoffs for managers and pay cuts for nurses\nLabour’s questions also found that national bodies created or given new powers by the reforms spent £159million on management consultancy.\nNHS England, which allocates most health funding, had the biggest consultancy bill of £101million.\nThis was followed by the financial regulator Monitor which paid £47million.\nMs Alexander said: ‘Patients left waiting hours on end in A&E this winter will be rightly furious at these figures.’\nA Department of Health spokesperson said: ‘We have introduced tough new rules so that any salaries above the PM’s now have to be scrutinised by the Department and we’re both capping payouts and clawing back redundancy payments when highly-paid staff return to the same part of the public sector within a year.","url":"https://www.dailymail.co.uk/news/article-3393209/NHS-staff-rehired-three-years-given-new-jobs-92m-payoffs.html"}
