{"authors":["Jordan Schachtel"],"date_download":"2018-10-30 19:47:58","date_modify":"2018-10-30 19:47:58","date_publish":"2015-04-13 17:58:32","description":"Representing the National Iranian American Council (NIAC) at an annual anti-Israel convention– which calls for America to terminate its relationship with the Jewish State– NIAC research director Reza Marashi said that Jews in America are responsible for the United States’ endorsement of Israel’s supposed “mistreatment of Palestinians.” |","filename":"data/vaneerConsumption/NIACDirectorUSSupportsIsraelBecauseJewsAreVeryWellOrganizedPolitically.json","image_url":"https://media.breitbart.com/media/2015/04/israel-american-flags-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_04_13__1540928878.html","title":"NIAC Director: U.S. Supports Israel Because Jews 'Are Very Well-Organized Politically'","title_page":"NIAC Director: U.S. Supports Israel Because Jews 'Are Very Well-Organized Politically' | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Representing the National Iranian American Council (NIAC) at an annual anti-Israel convention– which calls for America to terminate its relationship with the Jewish State– NIAC research director Reza Marashi said that Jews in America are responsible for the United States’ endorsement of Israel’s supposed “mistreatment of Palestinians.”\nThe Washington, D.C.-based NIAC, which many have alleged is a lobbying group working on behalf of the Iranian regime, has in the past released an ad that accused Americans who support Israeli Prime Minister Benjamin Netanyahu over President Barack Obama as being more loyal to Israel than to the United States.\nMarashi began answering an audience member’s question by channeling a quote supposedly spoken by Harry Truman, the President who first recognized the State of Israel immediately after it had declared independence in 1948.\n“As it pertains to mistreatment of Palestinians and America’s unwillingness to stand up to Israel, I think it was Harry Truman that once said that… he compared the amount of Zionists he had as constituents versus the amount of Arabs he had… I don’t remember the exact quote,” said Marashi.\nThe NIAC director then accused Jews in America of manipulating elected officials into taking a pro-Israel stance on foreign policy.\n“The reality of the situation is that domestic political constraints in the United States have a propensity to dictate the positions that a lot of elected officials take on this one emotionally and politically charged issues,” he added.\nMarashi’s position, which blames American Jews for U.S. support of Israel, ignores the fact that 7 in 10 Americans view Israel favorably, according to a recent poll. The survey found that less than one in five Americans receive the Palestinian Authority in a positive manner. Moreover, the largest pro-Israel group in America is a Christian organization: Christians United For Israel.\nHowever, the facts do not stop Marashi from complaining about the supposed strength of America’s Jewish lobby. The NIAC Research Director concludes:\nLove it or hate it, Jewish Americans are extremely well-organized politically in the United States of America and until we have equally organized minority groups, that perhaps have a difference of opinion on how these policies should play out as it pertains to the United States’ involvement, I just don’t see a viable way for this to shift.\nTrita Parsi, NIAC’s founder and president, has previously disparaged an American journalist who disagreed with him on Iran as a “Jew” who was taking orders from the Israeli government “under the safety of an American flag.”\nBreitbart News recently found that a former employee of the alleged pro-Tehran organization is now a member of President Obama’s National Security Council, and serves as its Director for Iran.","url":"https://www.breitbart.com/national-security/2015/04/13/niac-director-u-s-supports-israel-because-jews-are-very-well-organized-politically/"}
