{"authors":["The Investigative Project On Terrorism","Ipt"],"date_download":"2018-10-30 18:10:56","date_modify":"2018-10-30 18:10:56","date_publish":"2016-07-15 22:05:19","description":"Before the bodies of all the victims had been removed from the streets of Nice, CAIR Executive Director Nihad Awad insisted that religion had nothing to do with it.","filename":"data/vaneerConsumption/NiceFranceCAIRChiefsReflexiveTerrorDenialStandsApart.json","image_url":"https://media.breitbart.com/media/2016/06/wi/afp_f1b7a75284046ba0a5e37d8de20dc0a3794c26c2.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_07_15__1540923056.html","title":"Nice, France: CAIR Chief's Reflexive Terror Denial Stands Apart","title_page":"Nice, France: CAIR Chief's Reflexive Terror Denial Stands Apart | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Before the bodies of all the victims had been removed from the streets of Nice, Council on American-Islamic Relations (CAIR) Executive Director Nihad Awad insisted that religion had nothing to do with the terrorist attack that killed at least 84 people.\nA French resident of Tunisian descentrammed a truck into a crowd of revelers gathered to watch fireworks commemorating Bastille Day. The truck traveled as much as two kilometers, leaving twisted bodies in its wake.\nFrench President Francois Hollande described the “undeniable terrorist nature” of the attack, which was further established by the presence of guns and explosives inside the killer’s truck.\n“All of France is under the threat of Islamic terrorism,” Hollande said. “Our vigilance must be relentless.”\nTo Awad, this was reckless and inflammatory.\n“French President #Hollande is pouring oil on the fire by describing the #Nice crime as Islamic terrorism and subjects France’s Muslims to danger,” Awadwrote, in Arabic, on Twitter. “What is Islamic about this crime?”\nPlenty of analysts have shown exactly how terrorist groups like ISIS are deeply rootedin Islamic theology. As IPT Shillman Senior Fellow Pete Hoekstra noted, Islamist terrorists have been calling for such attacks for years, and al-Qaida specifically suggested this kind of attack in 2010, using a mock Ford-150 ad: “With the right tools and a little effort, the truck can be turned into a killing machine from a Wes Craven horror film,” an article in al-Qaida’s Inspire magazine said.\nThat seems to be a pretty good description for what happened in Nice.\nISIS spokesman Abū Muhammad al Adnānī ash Shāmī made a similar suggestion in a2014 statement: “If you can kill a disbelieving American or European — especially the spiteful and filthy French — or an Australian, or a Canadian, or any other disbeliever from the disbelievers waging war … kill him in any manner or way however it may be … Smash his head with a rock, or slaughter him with a knife, or run him over with your car, or throw him down from a high place, or choke him, or poison him.” [Emphasis added]\nAwad’s denial does nothing to discredit these ideas or the Islamic theology underpinning them. In another tweet, he claimed such talk was “blaming all Muslims for the heinous # Nicemurders.#Don‘tCallTerroristsJihadists.”\nCompare Awad’s reaction with other Muslim voices. He doesn’t win points for courage.\nWriting in the Telegraph, former Islamist Maajid Nawaz begged Muslims and non-Muslims alike to stop pushing the counter-productive “nothing to do with Islam” message. “Your good intentions towards us Muslims are only making the problem worse,” he wrote.\nTerrorist groups like ISIS successfully recruit new members in part because “we have allowed hardline Islamism to permeate our communities and mobilise the vulnerable,” Nawaz wrote. “To stop it we have to make it less attractive, and that is a long-term struggle, similar to those against racism, homophobia and anti-Semitism.”\nHe could have been speaking directly to Awad when he added, “please stop denying the nature of jihadism. Please stop ignoring the narratives which drive these attacks. Instead of aiding extremists who insist Islam today is perfect, perhaps you should aid us beleaguered reformist Muslims who are attempting to address this crisis within Islam against all the odds.”\nNawaz also called out the hypocrisy of critics who don’t think images of the carnage in Nice should be shown.\nSpeaking on Fox News Channel, American Islamic Forum for Democracy President Zuhdi Jasser explained that “intoxicant of theocratic Islam, the sharia state” must be confronted for the terror to wane. That starts by “looking at the schools of thought of jihadism, Wahabism and Salafism. And the fact that most Americans don’t even know what those terms are is a crime.”\nUnable to argue on the merits, Awad and his CAIR colleagues tend to dismiss Jasseras a sellout and simply ignore reformist voices like Nawaz’s.\nBut even Hamza Yusuf, founder and president of Berkeley’s Zaytunah College, an Islamic institution, acknowledges there is an Islamic root for the recent wave of terrorism. In an essay he titled “The Plague Within” – which he posted after terror attacks in Orlando, Baghdad, Bangladesh and elsewhere that were carried out during the Muslim holy month of Ramadan – Yusuf likened radical interpretations of Islam to “brain-eating amoebas.”\nCiting another cleric, Yusuf said the plague is “the bitter harvest of teachings that have emanated from pulpits throughout the Arabian Peninsula, teachings that have permeated all corners of the world, teachings that focus on hatred, exclusivity, provincialism, and xenophobia. These teachings anathematize any Muslim who does not share their simple-minded, literalist, anti-metaphysical, primitive, and impoverished form of Islam, and they reject the immense body of Islamic scholarship from the luminaries of our tradition.”\nWhile Yusuf still seems to balk at the phrase “Islamic radicalization,” he still called for action from scholars and others to counter the ideology driving the terrorism: “What we do not need are more voices that veil the problem with empty, hollow, and vacuous arguments that this militancy has little to do with religion; it has everything to do with religion: misguided, fanatical, ideological, and politicized religion. It is the religion of resentment, envy, powerlessness, and nihilism.” [Emphasis added]\nYusuf has spoken at CAIR fundraisers, and the organization spotlighted a message of his just last year.\nThese are but a few examples of Muslims who are trying to wage a battle of ideas within Islam in hopes of discrediting the ideology that fuels shooting massacres in Orlando and Paris, bombing massacres in Turkey, Belgium Iraq and Saudi Arabia, and now a vehicle massacre in Nice.\nWith the possible exception of Maajid Nawaz, none of them has the profile and bully pulpit Awad and his organization enjoy. Reporters quote them all the time and television news airs their views almost every day.\nThe message so far – don’t talk about religion when religious zealots kill – is a wasted opportunity of immeasurable proportions.\nThis piece originally appeared at the Investigative Project on Terrorism.","url":"https://www.breitbart.com/national-security/2016/07/15/cair-chiefs-reflexive-terror-denial/"}
