{"authors":["Press Association Reporter"],"date_download":"2018-10-23 04:22:59","date_modify":"2018-10-23 04:22:59","date_publish":"2017-03-16 15:44:42","description":"Ruby Walsh got his third, and most impressive, win of the day at Cheltenham on Thursday after riding Nichols Canyon to a dramatic victory in the Stayers' Hurdle.","filename":"data/vaneerConsumption/NicholsCanyonwinstheStayersHurdleatCheltenham2017.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/15/3E5558C700000578-0-image-a-149_1489679072414.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_racing_article-4320680_Nichols-Canyon-wins-Stayers-Hurdle-Cheltenham_1540268579.html","title":"Nichols Canyon wins the Stayers' Hurdle at Cheltenham 2017","title_page":"Nichols Canyon wins the Stayers' Hurdle at Cheltenham 2017 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Nichols Canyon came from off the pace to register the eighth Grade One success of his career in the Sun Bets Stayers' Hurdle at Cheltenham.\nCompleting a treble on the card for trainer Willie Mullins and jockey Ruby Walsh, Nichols Canyon was produced with a strong run towards the rail to land the spoils for owner Graham Wylie.\nIt was only his second attempt at three miles, but the seven-year-old showed he had no problem getting the trip.\nRuby Walsh celebrates winning the 3:30 Sun Bets Stayers Hurdle on Nichols Canyon\nHe was held up in the early stages as 2015 winner Cole Harden set a strong pace that had the field well strung out.\nWhen he faded out of contention Lil Rockerfeller set sail for home, but Nichols Canyon (10-1) was produced to lead on the run-in and score by three-quarters of a length.\nUnowhatimeanharry, the 5-6 favourite, was three and a half lengths away in third without ever looking like continuing his winning run.\nWylie was celebrating a fourth success in the race after three-time victor Inglis Drever, and he said: 'When I told Willie to buy a horse for me, he rang me up and said 'I think I've found you the next Inglis Drever'.\n'He looks like Inglis Drever as he's only a pony, but he flew up the hill. Ruby told me he'd ride him like that to make sure he got the trip.\n'It wasn't until approaching the last I thought he might get placed, never mind win.\nWalsh and Nichols Canyon race side-by-side with Lil Rockerfeller in the final stretches\n'With the problems with Faugheen and Annie Power we thought he'd be a Champion Hurdle horse, but it hasn't gone right.\n'It's only been the last two weeks he's started to show anything, but this is great. Willie is a genius.'\nWalsh said: 'He's a little warrior. He switched off, he jumped and we just crept away.\n'Lil Rockerfeller was battling back at me but he kept going all the way to the line.\n'He just started to come back to himself the last 10 days, Katie (Walsh) rode him at the Curragh the other day and said he worked very well.\n'I'm delighted for Graham and Andrea (Wylie), this race means a lot to them.'\nNichols Canyon owner Graham Wylie poses with winning jockey Walsh after the race\nMullins said: 'It was some performance. I didn't particularly think the three miles would suit.\n'But he learned to settle and Ruby got him settled out the back door and that made a difference. I imagine we were a little fortunate, too, as Ruby came over and got the rail and all the other horses were all at sea coming up the middle, but you take what you get.\n'He is tough I just thought he would be too keen over that trip. With age, a lot of these horses learn to settle.\n'His last bit of work I thought we would change his stable and work rider. Sometimes when horses are not doing anything you just change things for the sake of changing them.\n'He always works a bit dead so we decided to change his routine to see if that worked.'","url":"https://www.dailymail.co.uk/sport/racing/article-4320680/Nichols-Canyon-wins-Stayers-Hurdle-Cheltenham.html"}
