{"authors":["Donna Rachel Edmunds"],"date_download":"2018-10-30 20:07:27","date_modify":"2018-10-30 20:07:27","date_publish":"2016-01-05 16:52:37","description":"Nick Clegg, the former leader of the Liberal Democrats, has the worst voting record in the House of Commons, new analysis has revealed,","filename":"data/vaneerConsumption/NickCleggStaysAwayFromHouseofCommonsFollowingElectionBlow.json","image_url":"https://media.breitbart.com/media/2016/01/GettyImages-489419232-e1452011554950.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/europe_2016_01_05__1540930047.html","title":"Nick Clegg Stays Away From House of Commons Following Election Blow","title_page":"Nick Clegg Stays Away From House of Commons Following Election Blow","title_rss":"NULL","source_domain":"breitbart.com","text":"Nick Clegg, the former leader of the Liberal Democrats, has the worst voting record in the House of Commons, new analysis has revealed, having failed to show up to more than 85 percent of votes since the last election in May. A spokesman for the former Deputy Prime Minister said he had only voted when he felt it could make a difference.\nIn the last Parliament he was known as ‘the Kingmaker’; leading a group of 57 MPs, he brokered a deal with the Conservatives following the 2010 election that saw Liberal Democrats take ministerial positions for the first time in decades.\nYet the picture following 2015’s general election was very different – the Conservatives won a slim majority, and the Liberals were all but wiped out, losing 15 percent of the vote share and all but eight of their Parliamentary seats.\nNick Clegg, who hung on to his Sheffield Hallam seat in defiance of expectations, resigned as leader the next day and has been little seen around the corridors of Parliament since then. Now it is clear how little: analysis by the House of Commons library for The Telegraph has shown that Mr Clegg voted in just 14.5 percent of all House of Commons divisions since May, or less than 100 times overall.\nAside from the Commons Speakers and Sinn Fein MPs, who do not vote, and Labour’s Rachel Reeves, who has been on maternity leave for much of the Parliament, no MP has voted less often.\nEven the Prime Minister, who has spent much of his time away on business managed to attend 24.3 percent of votes, while the former Labour leader Ed Miliband, who was similarly demoted to the back benches following electoral defeat has made more than half the divisions.\nThe record for most attendances this Parliament is currently held by Philip Hollobone, the Tory MP for Kettering, who made 99.3 per cent of all votes. David Nuttall, the Conservative MP for Bury North, is second placed.\nMr Clegg’s spokesman said: “Nick Clegg has taken part every time he felt it was possible that his vote could make a difference to the outcome, such as the crucial vote on military action in Syria.\n“Otherwise, he has devoted his time to serving his constituents in Sheffield Hallam and to issues that he cares deeply about, including social mobility, drugs reform and Britain’s place in Europe.\n“The first six months after a general election are untypical and Nick expects his voting record to improve in the months ahead.”\nBut Peter Bone, Conservative MP for Wellingborough, whose own record is solid having attended four in five votes, was unconvinced. He has criticised Mr Clegg for not representing the people of Sheffield Hallam properly:\n“An MP has got to represent constituents in the Commons, ask ministers questions, scrutinise government legislation … and obviously vote on the matters before Parliament,” Mr Bone said.\n“If you are a minister occasionally you cannot be there because you might be doing a visit, similarly if you are a shadow minister.\n“But if you are a backbench MP there is no excuse for having such a low voting record. I cannot believe that Nick Clegg was abstaining on all the votes and that he didn’t have an opinion.”\nThis isn’t the first time that Mr Clegg’s voting record has been called into question. In 2014, in the run up to a head to head debate with UK Independence Party leader Nigel Farage on membership of the European Union, Mr Clegg accused Mr Farage of having a poor voting record in the European Parliament.\nMr Farage responded: “I’m very surprised Nick Clegg has chosen this line of attack. He attacks me and [deputy leader] Paul Nuttall for not turning up enough to vote. Well, both our voting records are about 50 per cent but we are leader and deputy leader of a national party in the United Kingdom. Nick Clegg himself, who actually lives in London, has only himself voted in 22% of votes in this parliament.”\nSince his demotion to the backbenches, Mr Clegg has joined the Global Commission on Drug Policy, an international body dedicated to reform of drugs laws, and hopes to become more involved in the debate on membership of the EU during the run up to a referendum.\nHe has also set up Open Reason, a non-profit company dedicated to pursuing his policy ideas.","url":"https://www.breitbart.com/europe/2016/01/05/criticising-farages-attendance-european-parliament-nick-clegg-now-worst-voting-record-house-commons/"}
