{"authors":["Louise Cheer","Daniel Piotrowski For Daily Mail Australia"],"date_download":"2018-10-22 23:03:07","date_modify":"2018-10-22 23:03:07","date_publish":"2016-01-11 04:20:23","description":"SA Senator Nick Xenophon (pictured) wants to give more power to customers as he announced his plan to help them after the collapse of Dick Smith who will not honour gift cards.","filename":"data/vaneerConsumption/NickXenophonsplantohelpcustomersafterDickSmithcollapse.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/04/3004B63B00000578-0-image-a-25_1452485575296.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393287_Senator-Nick-Xenophon-s-three-point-plan-help-customers-Dick-Smith-collapse_1540249387.html","title":"Nick Xenophon's plan to help customers after Dick Smith collapse","title_page":"Nick Xenophon's plan to help customers after Dick Smith collapse | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Independent senator Nick Xenophon has outlined his three-point plan to ensure customers are not left out-of-pocket again like those who were short-changed after electronics retailer Dick Smith went into voluntary administration.\nSenator Xenophon told The Sydney Morning Herald he would like to see legislation changes that would force administrators to give gift card holders as much importance as creditors.\nHe is also pushing for retailers to put away money made from gift cards and deposits in another account.\nScroll down for video\nFederal Senator Nick Xenophon (centre) has introduced his three-point plan to ensure customers are never left out-of-pocket again after Dick Smith failed to honour its gift cards when it went into administration\nSenator Xenophon's third condition placed the onus on company directors who he says should be personally liable for any loss to customers, with lay-bys also considered.\n'These proposed reforms, which will be contained in legislation I will be introducing into the Senate next month, will finally give consumers the protection they deserve,' he told the Herald.\n'The reforms, if passed, will also have the effect of strengthening consumer confidence in gift cards which has been shaken with this collapse.'\nFollowing the collapse of Dick Smith last week, Mr Xenophon told Daily Mail Australia its chief executive Nick Abboud - who bought a waterfront mansion two years ago - should front a Senate inquiry.\nSenator Xenophon said he wanted to find out what had happened to the once venerable retailer, which was purchased from Woolworths by private equity group Anchorage Capital in 2012.\n'Mr Abboud needs to look at those mums and dads who spent their $1,000 in the eye and tell them what he's going to do about it and do the right thing,' he told Daily Mail Australia.\nThe retailer announced to the stock exchange last Monday that it had appointed receivers\nSenator Xenophon said Nick Abboud, the chief executive officer of Dick Smith electronics, should front a Senate inquiry\nThe company's Facebook page lit up with criticism as receivers Ferrier Hodgson announced they would not honour gift cards\n'He needs to look at these people in the eye and explain to them what went wrong in the rosy forecasts that left customers in the lurch.'\nAngry customers vented their rage after the company's receivers Ferrier Hodgson announced it would not honour gift cards and would not refund some deposits.\nSome customers have gift cards worth more than $1,000, but now they are basically worthless in store.\nMr Abboud was appointed CEO by the equity group and non-executive director Bill Wavish in November 2012.\nBoth Anchorage Capital and Mr Wavish described the company in positive terms in early 2015.\n'Myself, Nick Abboud and Anchorage Capital bought Dick Smith Electronics from Woolworths for a peppercorn and subsequently listed it on the ASX for $520 million,' Mr Wavish, who retired from the board in March, wrote.\nMr Abboud owns a spectacular waterfront mansion in Sydney, worth $5 million\nMr Abboud, a wealthy and successful retail industry veteran, purchased the property in 2013\n'After reducing bloated costs and funds employed, increasing sales and reopening stores, it is now a vibrant and growing business.'\nAnchorage Capital said on its website it had 'implemented a rapid and highly successful turnaround program' before selling its stake in September.\nBut after its share price sunk 80 per cent in a single year Dick Smith Holdings announced it had called in the receivers to the ASX last Monday.\nReceivership is a difficult development for Mr Abboud, who was listed at number 88 on BRW's 2015 Executive Rich List with $2,622,621 in salary and an estimated shareholding value of $30.2 million.\nReal estate agents described Mr Abboud's lavish property as ideal for entertainment\nMr Abboud's vast property has four bedrooms and three bathrooms\nAlong with the multimillion-dollar home, Mr Abboud had a $2,622,621 salary and an estimated shareholding value of $30.2 million\nIn a bitter note for customers struggling to get their money back, Mr Abboud lives in a $5 million Sydney mansion, according to company records.\nThe four-bedroom property, three bathroom property was designed for entertaining and has a sun-drenched patio.\nThe home is ideal for barbecue-lovers or dinner and drinks, according to real estate advertisements.","url":"https://www.dailymail.co.uk/news/article-3393287/Senator-Nick-Xenophon-s-three-point-plan-help-customers-Dick-Smith-collapse.html"}
