{"authors":["Anthony Joseph For Mailonline"],"date_download":"2018-10-23 00:15:03","date_modify":"2018-10-23 00:15:03","date_publish":"2017-04-26 09:35:33","description":"The 54-year-old said he suffered dark times in a year of hell, which ended with the DIY SOS host splitting up with his wife Jessica.","filename":"data/vaneerConsumption/NickKnowlesneededcounsellingaftermarriagefailed.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/09/3F78B27A00000578-0-image-a-11_1493195658484.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4446816_Nick-Knowles-needed-counselling-marriage-failed_1540253703.html","title":"Nick Knowles needed counselling after marriage failed","title_page":"Nick Knowles needed counselling after marriage failed | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"TV presenter Nick Knowles revealed he turned to counselling when his marriage fell apart.\nThe 54-year-old said he suffered dark times in a year of hell, which ended with the DIY SOS host splitting up with his wife Jessica.\nAs their relationship hit the rocks, Jess also suffered a miscarriage and was diagnosed with cancer.\nNick is now tackling mental health issues is a BBC series Mind Over Marathon. And he has revealed how he used counsellors to help him through his own tough times.\nFormer flames: Jessica and Nick (pictured at Chelsea Flower Show, May 2016) married in Rome in 2012 but they made their separation public in January last year\nHappier times: The couple, who share a 26-year age gap, announced their initial separation in January yet he confirmed last month that they were giving things another go\nHe told the Daily Mirror: 'I think everyone needs support. It is hard to go through traumatic difficulties without needing it.\n'I did really go through it emotionally last year. My wife Jess was really, really unwell. She suffered some really traumatic experiences last year and we were already going through difficulties in our marriage anyway so all of those things are hugely difficult but I always had people to talk to, people who are close to me.\n'When I actually come under extreme stress or difficulty, I spend time with my older brother John who has had some counselling training.\n'So anytime that I have been in super stressful situations, I'll go and be with him and he's very intuitive and knows how I am feeling.'\nThe couple married in Rome in 2012 but they made their separation public in January last year.\nTheir split was muddied by his fling with Gemma Oaten and Jessica's shock cancer diagnosis earlier this year but last month he insisted they were happily working on their marriage again and are ensuring their two-year-old son remains their priority.\nThey rekindled their romance briefly in November as they tried to make their marriage work - with Nick even moving personal items back into her home.\nBut it wasn't meant to be as it fizzled out within a number of weeks.\nPutting her troubles behind her: The 28-year-old estranged wife of Nick, who shares two-year-old son Eddie with the presenter, was in high spirits\nTheir split was muddied by his fling with Gemma Oaten and Jessica's shock cancer diagnosis earlier this year but last month he insisted they were happily working on their marriage again and are ensuring their two-year-old son remains their priority\nNick has teamed up with Princes Harry and William and Kate Middleton to front the new documentary Mind Over Marathon.\nThe show features 10 amateur runners who live with different mental health issues, as they trained for this year's London Marathon.\nNick is presenting the series and is leading a team of running experts, nutritionists and psychiatrists who will help the runners achieve their goal.\nThe royals made an appearance in the documentary at a training day.\nAs their relationship hit the rocks, Jess also suffered a miscarriage and was diagnosed with cancer. They are pictured here in 2014\nThe runners took part in the 2017 London Marathon with Heads Together, the campaign led by the Duke and Duchess of Cambridge and Prince Harry, which is the official Charity of the Year for this year’s event.\nLast week Prince William used FaceTime to speak to Lady Gaga from as part of the campaign to raise awareness about mental health.\nAnd Nick praised the role of the royals for helping to raise awareness about mental health.","url":"https://www.dailymail.co.uk/news/article-4446816/Nick-Knowles-needed-counselling-marriage-failed.html"}
