{"authors":["Kenya Foy"],"date_download":"2018-10-30 22:38:41","date_modify":"2018-10-30 22:38:41","date_publish":"2014-08-14 21:45:07","description":"Between the backlash over Nicki Minaj's BET Awards speech, the release of her revealing \"Anaconda\" cover art and being number one on Lil Kim's shit list, it's fair to say that some of the recent days haven't been the Barb's best. Meanwhile, Minaj…","filename":"data/vaneerConsumption/NickiMinajRodStewartHaveSomethingInCommonThatWouldMakeMichaelJacksonJealous.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/240c32ec-fc4f-4870-89c9-0551e50ee72c.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35816-nicki-minaj-rod-stewart-have-something-in-common-that-would-make-michael-jackson-jealous_1540939121.html","title":"Nicki Minaj & Rod Stewart Have Something In Common That Would Make Michael Jackson Jealous","title_page":"Nicki Minaj & Rod Stewart Have Something In Common That Would Make Michael Jackson Jealous","title_rss":"NULL","source_domain":"bustle.com","text":"Between the backlash over Nicki Minaj's BET Awards speech, the release of her revealing \"Anaconda\" cover art and being number one on Lil Kim's shit list, it's fair to say that some of the recent days haven't been the Barb's best. Meanwhile, Minaj hasn't let the controversy get her down. In fact, she's done quite the opposite. According to Rap-Up, Minaj surpassed Michael Jackson on the Billboard charts when she nabbed her 51st Hot 100 hit with \"Anaconda.\"\nThat's quite a way to bounce back. Taking a spot from the King of Pop isn't exactly something to take lightly, and what makes the deal even sweeter is the fact that Minaj also holds the number one spot for female rappers with Hot 100. Also, she didn't even realize she shared a chart position with Jackson. In an Instagram post, she wrote, \"Made history today. I didn't even know I was tied with Michael Jackson with 50 Hot 100 entries on Billboard. 'Anaconda' makes 51 and now I'm tied with Rod Stewart. God bless, and thank you.\"\nObviously this is great news for Minaj, and hopefully it will take some of the edge off all the negativity that has been centered upon her lately.\nImeh Akpanudosen/Getty Images Entertainment/Getty Images\nIn spite of it all, she has managed to grab attention for some of her more positive contributions as well. Minaj and Beyoncé almost broke the Internet recently when they dropped that insane remix to \"Flawless,\" and there was her unbelievably empowering appearance on HSN. She's also promoting her highly-anticipated Pinkprint album and she's bound to get everyone talking again (hopefully in a good way) when she performs on the upcoming VMAs.\nEither way, she could benefit from some more positive news, especially when her name's becoming more and more associated with feuding with other female rappers and other unflattering controversies that don't really accomplish much, other than taking the focus off her music.","url":"https://www.bustle.com/articles/35816-nicki-minaj-rod-stewart-have-something-in-common-that-would-make-michael-jackson-jealous"}
