{"authors":["Mallory Schlossberg"],"date_download":"2018-10-30 23:36:18","date_modify":"2018-10-30 23:36:18","date_publish":"2014-08-13 15:48:26","description":"The woman behind (er, in front of) the butt that made headlines on the Internet just a few weeks ago is now making headlines for her music again. MTV announced that Nicki Minaj will perform at the MTV Video Music Awards. She'll be premiering new…","filename":"data/vaneerConsumption/NickiMinajsAnacondaVMAPerformanceCantHelpButStartControversy.json","image_url":"https://imgix.bustle.com/rehost/2016/9/13/63da1655-0b8d-4f9b-ad37-2b576efec698.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/articles_35601-nicki-minajs-anaconda-vma-performance-cant-help-but-start-controversy_1540942578.html","title":"Nicki Minaj's \"Anaconda\" VMA Performance Can't Help But Start Controversy","title_page":"Nicki Minaj's \"Anaconda\" VMA Performance Can't Help But Start Controversy","title_rss":"NULL","source_domain":"bustle.com","text":"The woman behind (er, in front of) the butt that made headlines on the Internet just a few weeks ago is now making headlines for her music again. MTV announced that Nicki Minaj will perform at the MTV Video Music Awards. She'll be premiering new music from her upcoming album The Pinkprint and will probably spew some lyrics from \"Anaconda,\" too. She's a pretty dynamite performer, so you know it's gonna be awesome, and given how cheeky she's been on Instagram after her butt spawned a whole lotta conversation, you know she'll be pushing buttons and dropping jaws when she performs.\nWhat better place to push buttons than the VMAs? The awards show was practically designed for invoking controversy.\nRegardless of all of that — since this is about Minaj as an artist — we should pause and praise The VMAs for a hot second. Why? Minaj's appearance means another awesome lady in the music biz has been added to the roster of performers. Beyoncé? Check. Ariana Grande? Check. Iggy Azalea? Check. This year, it seems like the show is for the ladies, slash a replica of my current workout playlist.\nAnd now, it also feels like an appropriate time for a humble plea that Jessie J makes an appearance, too. A live performance of \"Bang Bang?\" Be still, my not-so-secret beating pop music loving heart.\nYou can watch Nicki blow the audience's collective mind when the show airs on MTV on Aug. 24.","url":"https://www.bustle.com/articles/35601-nicki-minajs-anaconda-vma-performance-cant-help-but-start-controversy"}
