{"authors":["Mike Dickson For Mailonline"],"date_download":"2018-10-22 21:02:03","date_modify":"2018-10-22 21:02:03","date_publish":"2017-03-16 00:24:58","description":"Having beaten him at the ATP event in Acapulco the Australian repeated the dose, driving the Serb Novak Djokovic to distraction with more brilliant serving as he delivered 14 aces.","filename":"data/vaneerConsumption/NickKyrgiosbeatsNovakDjokovicatIndianWells.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/00/3E4FE59300000578-0-image-a-43_1489624425219.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/sport_tennis_article-4318456_Nick-Kyrgios-beats-Novak-Djokovic-Indian-Wells_1540242123.html","title":"Nick Kyrgios beats Novak Djokovic at Indian Wells","title_page":"Nick Kyrgios beats Novak Djokovic at Indian Wells | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Nick Kyrgios scored his second straight win in consecutive tournaments over Novak Djokovic when he beat him 6-4, 7-6 to make the last-eight of the BNP Paribas Open in Indian Wells.\nHaving beaten him at the ATP event in Acapulco the Australian repeated the dose, driving the Serb to distraction with more brilliant serving as he delivered 14 aces to set up a quarter-final with Roger Federer.\nFor Djokovic it was the first time he has lost in the Californian desert Masters event for four years.\nNick Kyrgios defeated Novak Djokovic in straight sets on Wednesday night at Indian Wells\nKyrgios's joy at emerging victorious was written all over his face as he celebrated the win\nIt ended Djokovic's run of victories in California - he has won the title in the last three years\nA dejected Djokovic exits the court on Wednesday night after losing at Indian Wells\nKyrgios's serving display was impeccable - he won 86 per cent of his first serves and did not face a break point at any point in the entire encounter.\nThe Australian broke Djokovic in the opening game of the match en route to grabbing the first set and in the tiebreaker raced out to a 3-0 lead that was ultimately too much for Djokovic\nIt continued to a tough few days for Djokovic, who had needed three sets to get by Juan Martin Del Potro on Tuesday.\nKyrgios will face the winner of Wednesday's clash between Australian Open champion Roger Federer, a four-times winner at Indian Wells, and three-time champion Rafael Nadal.\nDjokovic shows his frustration as his 19-match winning streak at Indian Wells came to an end\nA superb serving display from the Australian allowed him to overcome the world No 2\nIt represented a significant return to form for Kyrgios, who faced criticism from John McEnroe earlier this year after exiting the Australian Open.\nMcEnroe said: 'What I don't understand, what I can't accept, is when he stops trying. It's a black eye for the sport.'\nBut few would suggest Kyrgios did not try his hardest to topple the world No 2, something that was evidenced in his celebrations following the match.\nSpeaking afterwards, Kyrgios said: 'It feels good, I knew what I had to do today, it was always going to be tough, he is a great champion.\nKyrgios beat Djokovic 6-4, 7-6 (3) over the two sets on Wednesday evening in California\n'It's just another match for me I have to get ready for tomorrow. I am serving really well, that is creating chances for me to put pressure on their service games.\n'My mentality is improving and I am trying really hard to fight for every point and just compete.'\nAnd asked who he would rather face out of Nadal and Federer, he responded: 'Roger is one of my favourite players of all time, but I don't mind who I play, they are both great champions.'","url":"https://www.dailymail.co.uk/sport/tennis/article-4318456/Nick-Kyrgios-beats-Novak-Djokovic-Indian-Wells.html"}
