{"authors":["Benge Nsenduluka For Daily Mail Australia"],"date_download":"2018-10-22 22:19:47","date_modify":"2018-10-22 22:19:47","date_publish":"2017-04-26 04:14:17","description":"They tied the knot nearly two weeks ago.","filename":"data/vaneerConsumption/NickyWhelanandKerryRhodespicturedonhoneymoon.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/04/3F9C0F5A00000578-0-image-a-109_1493177221655.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446146_Nicky-Whelan-Kerry-Rhodes-pictured-honeymoon_1540246787.html","title":"Nicky Whelan and Kerry Rhodes pictured on honeymoon","title_page":"Nicky Whelan and Kerry Rhodes pictured on honeymoon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They tied the knot nearly two weeks ago.\nAnd Nicky Whelan, 35, and Kerry Rhodes, 34, shared idyllic snaps from their Hawaiian honeymoon on Wednesday.\nThe newlyweds looked smitten as they basked in the Kauai sunshine on the beach, surrounded by crashing waves and golden sand.\nBikini babe: Nicky Whelan, 35, and Kerry Rhodes, 34, shared idyllic snaps from their Hawaiian honeymoon on Wednesday\nOther snaps showed the happy couple taking in the picturesque waterfalls and breathtaking greenery.\n'Low key and sleepy just what we needed ...THANKYOU #kauai ... @kerryrhodes aka husband !!! #honeymoon,' the former Neighbours star captioned a series of romantic Instagram snaps.\nThe beaming couple showed off their incredible gym-honed physiques as they embraced married life.\nAussie beauty Nicky put on a busty display in a multioloured bikini, while posing in a hotel swimming pool.\nAbs-oultely ripped: Former NFL star Kerry showed off his washboard abs\nWedded bliss! The newlyweds looked smitten as they basked in the Kauai sunshine\n'Low key and sleepy just what we needed ...THANKYOU #kauai ... @kerryrhodes aka husband !!! #honeymoon,' the former Neighbours star captioned a series of romantic Instagram snaps\nFormer NFL star Kerry, showcased his washboard abs while clutching a drink, before taking a dip.\nThe romantic jaunt came days after the couple wed in a lavish ceremony at the Beverly Hills hotel.\nThe blonde beauty recently divulged details from their special day to PEOPLE magazine.\nFun in the sun: The couple wed posed along the beach as they spent quality time together\nStunning: Blonde beauty Nicky showed off her shapely pins in denim cut-off shorts\nBeaming: As the couple travelled around Kauai on their honeymoon, Nicky couldn't wipe the smile off her face\nSerene: Waterfalls and greenery made for a relaxing day out\nMarried life: The couple said they are excited to begin this new chapter of their lives as husband and wife\n'We love the tradition of marriage, and we love being able to call each other husband and wife,' she said.\nShe mentioned how both of their parents were still married and how they decided they wanted that 'traditional environment' themselves.\n'We want to carry that through,' she said. 'We both understand that our relationship takes work, and we made a choice that that’s what we are wanting.'\nOverjoyed: Nicky and Kerry tied the knot on Saturday in a lavish ceremony at the Beverly Hills Hotel in Los Angeles\nTradition: She mentioned how both of their parents were still married and how they decided they wanted that 'traditional environment' themselves\n'We want to carry that through,' she said. 'We both understand that our relationship takes work, and we made a choice that that’s what we are wanting'\nShe shared how the couple had celebrity friends in attendance like Brenda Song, former 90210 actor AnnaLynne McCord and Star Trek star Marina Sirtis.\nThe bride wore a stunning gown from Melbourne-based couture house J’Aton Couture, while the groom wore a royal blue suit from Sydney outfitter Tom James.\nTheir wedding rings were crafted by popular New York-based celebrity jewelers Rafaello & Co, who also made Nicky's 6.5-carat engagement ring.\nBling: Their wedding rings were crafted by popular New York-based celebrity jewelers Rafaello & Co, who also made Nicky's 6.5-carat engagement ring\nHappiness: The debonair couple announced their engagement in 2016\nGuests travelled from Australia, the United Kingdom and Kerry's home state of Alabama to witness the 'incredible energy of love and laughter' of the occasion.\nThe couple made sure they banned all phones from the ceremony, which Nicky said was their best decision on the day.\n'It was amazing to watch everyone get up and communicate and dance - not one person was looking down all night,' she described.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446146/Nicky-Whelan-Kerry-Rhodes-pictured-honeymoon.html"}
