{"authors":["Ciara Farmer For Mailonline"],"date_download":"2018-10-23 01:34:51","date_modify":"2018-10-23 01:34:51","date_publish":"2016-01-11 12:41:40","description":"The 37-year-old former Pussycat Dolls frontwoman oozed Hollywood glamour in a plunging halterneck gown boasting both a super-sexy split and revealing backless detail","filename":"data/vaneerConsumption/NicoleScherzingerwearsaplungingbacklessgownatGoldenGlobesafterparty.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/12/3009890F00000578-0-image-a-9_1452513939440.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3393771_Busty-Nicole-Scherzinger-preened-perfection-perilously-plunging-backless-gown-Golden-Globes-afterparty_1540258491.html","title":"Nicole Scherzinger wears a plunging backless gown at Golden Globes afterparty","title_page":"Nicole Scherzinger wears a plunging backless gown at Golden Globes afterparty | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She recently confirmed her relationship with Grigor Dimitrov.\nAnd Nicole Scherzinger showed exactly what the tennis ace sees in her as she stormed the red carpet at the InStyle and Warner Bros. Golden Globes after-party at The Beverly Hilton Hotel on Sunday.\nThe 37-year-old former Pussycat Dolls frontwoman oozed Hollywood glamour in a plunging halterneck gown boasting both a super-sexy split and revealing backless detail.\nScroll down for video\nBusty: Nicole Scherzinger showed exactly what her tennis ace boyfriend Grigor Dimitrov sees in her as she stormed the red carpet at the InStyle and Warner Bros. Golded Globes after-party at The Beverly Hilton Hotel on Sunday\nNicole looked stylish and sophisticated in the flesh-flashing ensemble as she flaunted her extremely ample bosom in the low-cut look.\nThe fine straps extended to the nape of Nicole's neck before lowering into an entirely backless rear with the dipped back reaching the top of her pert derriere.\nWhile the sensational gown was black in colour, the detailing added a glamorous touch due to an intricately beaded gold leaf embroidery wrapping around the bust and sitting on her shoulder.\nA cheeky slit on the leg exposed her toned, dancer's calf while her thin strapped heels added height to her already statuesque frame.\nSee full Golden Globes coverage on red carpet and after party fashion\nGolden girl: The 37-year-old former Pussycat Dolls frontwoman oozed Hollywood glamour in a plunging halterneck gown boasting both a super-sexy split and revealing backless detail\nThe perfect addition to the shimmering look was Nicole's boxy gold clutch bag of a structured shape which was adorned with jewels.\nThe Don't Hold You Breath hitmaker wore her lustrous ombre locks in a sleek straight style extending from a centre parting and then tucked behind her ears.\nHer make-up was an elegant finishing touch as she slicked on a dash of crimson lipstick to emphasise her plump pout while slightly outlining her almond-shaped eyes in dark Kohl.\nSexy look: The perfect addition to the shimmering look was Nicole's boxy gold clutch bag of a structured shape which was adorned with jewels\nElegant: The Don't Hold You Breath hitmaker wore her lustrous ombre locks in a sleek straight style extending from a centre parting and then tucked behind her ears\nFine form: Her incredible curves were perfectly exhibited in the tight black dress\nSecuring herself: Nicole had to keep checking her dress was concealing her chest adequately\nNicole's Globes appearance comes shortly after her return from Australia, where she confirmed long-circulating romance rumours regarding her relationship with tennis ace Grigor.\nAfter cheering him on in Brisbane on Monday, Nicole once again took her seat in the VIP area at the Queensland Tennis Centre to show her support for the Bulgarian tennis star on Wednesday afternoon.\nAfter her handsome beau departed the arena, he draped his arm around his pop starlet girlfriend and the duo locked lips in a very amorous display.\nPulling a pout: Her make-up was an elegant finishing touch as she slicked on a dash of crimson lipstick to emphasise her plump pout while slightly outlining her almond-shaped eyes in dark Kohl\nLoved up: Nicole's Globes appearance comes shortly after her return from Australia, where she confirmed long-circulating romance rumours regarding her relationship with tennis ace Grigor\nGrigor and Nicole reportedly began dating in July last year, shortly after he broke off his two-year romance with fellow tennis star Maria Sharapova.\nIn November a source told The Sun newspaper: 'They're completed besotted with each other. But they've been careful not to be pictured together because they don't want the pressure of the relationship being in the public eye.\n'But they've been careful not to be pictured together because they don't want the pressure of the relationship being in the public eye.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-3393771/Busty-Nicole-Scherzinger-preened-perfection-perilously-plunging-backless-gown-Golden-Globes-afterparty.html"}
