{"authors":["Simone Amelia For Daily Mail Australia"],"date_download":"2018-10-22 23:24:40","date_modify":"2018-10-22 23:24:40","date_publish":"2017-04-26 07:31:42","description":"They exchanged vows in a lavish Palm Springs ceremony in April last year and one year later, Nicole Trunfio and Gary Clark Jr. are finally on their honeymoon in the Maldives.","filename":"data/vaneerConsumption/NicoleTrunfioandGaryClarkJrgoontheirhoneymoon.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/06/3F9C857D00000578-0-image-a-84_1493185280394.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4446294_Nicole-Trunfio-Gary-Clark-Jr-honeymoon_1540250680.html","title":"Nicole Trunfio and Gary Clark Jr. go on their honeymoon","title_page":"Nicole Trunfio and Gary Clark Jr. go on their honeymoon | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"They exchanged vows in a lavish Palm Springs ceremony in April last year.\nAnd one year after they officially sealed their love for each other, Nicole Trunfio and Gary Clark Jr. are finally on their honeymoon.\nThe lovebirds traveled to the popular Maldives islands in the Indian Ocean for the special occasion, with Nicole posting an array of snaps to her Instagram account.\nScroll down for video\nParadise: Nicole Trunfio and Gary Clark Jr. traveled to the popular Maldives in the Indian Ocean for their honeymoon, with Nicole posting an array of snaps to her Instagram account\nThe Australian model, 31, uploaded an initial shot of the attractive couple preparing to leave for their overdue vacation from New York City.\n'Leaving for a while,' she captioned the sepia-toned image, with the pair dressed for cooler weather in coats and full-length ensembles.\nA video followed two days later, which the brunette beauty shot from inside an airplane as they flew over the islands towards the destination.\n'Leaving for a while,' she captioned the sepia-toned image, with thestar dressed in a Hemant & Nandita dress and big coat\nThe Merredin-born stunner took to a secluded beach for her next upload, showing off her enviable figure in a white one-piece with her arms outstretched in the air.\n'Always wonderful to have your own private beach every morning!' gushed one supporter in the image's comments section.\n'You two are the sweetest couple with the most adorable angel son, enjoy your time together,' added another fan, referencing their two-year-old son Zion.\nBliss: One year after they officially sealed their love for each other, the lovebirds are finally on their honeymoon\nThe Austin-based knockout showed off her style during another day on the islands, riding a bike in a black top flaunting her midriff paired with jean shorts.\nShe later switched up the look in a white lace dress as she headed to an intimate dinner with her husband, whom she met at the Coachella festival five years earlier.\nIn the past, Nicole revealed Gary had taught her how 'to 'trust in the journey'.\n'I'm enjoying everything so much more just being in the moment and not having plans,' she said of their relationship.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4446294/Nicole-Trunfio-Gary-Clark-Jr-honeymoon.html"}
