{"authors":["Lily Waddell For Mailonline"],"date_download":"2018-10-23 01:43:47","date_modify":"2018-10-23 01:43:47","date_publish":"2017-03-16 11:58:20","description":"It is no Simple Life keeping up a slim physique like the former reality star. The makeup-free 35-year-old flaunted her endless pins after an intense workout at a LA gym.","filename":"data/vaneerConsumption/NicoleRichiedabsfacewithatowelafterworkoutinLA.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/16/12/3E53F4E200000578-0-image-a-9_1489665940768.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4319610_Makeup-free-Nicole-Richie-flaunts-pins-leggings_1540259027.html","title":"Nicole Richie dabs face with a towel after workout in LA","title_page":"Nicole Richie dabs face with a towel after workout in LA | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"It is no Simple Life keeping up a slim physique like Nicole Richie!\nAnd the makeup-free 35-year-old, who first came into the spotlight as Paris Hilton's wild best friend, opted for a natural look as she left a gym in LA, California, US.\nNicole Richie showed off her endless pins in black skintight leggings after the intense workout.\nScroll down for video\nThe leggy look: Makeup-free Nicole Richie dabbed her face with a towel as she showed off her endless pins in black skintight leggings at an LA gym in California\nNaked! The style guru opted for a natural look as she went makeup-free for the gym session\nBut the reality star turned designer masked the rest of her slender frame with a baggy dark grey hoodie.\nShe also tackled the vigorous workout in a pair of Nike trainers.\nThe fresh-faced celeb pulled her sun kissed-tipped tresses off her face in a slick ponytail.\nIt is no secret she puts hard work into keeping up her slim figure as she wiped the sweat from her face with a white cloth.\nWorking up a sweat! It is no doubt the reality star turned designer pulled out all the stops on an intense work out as she was spotted leaving the gym wiping her face with a white towel\nBut she didn't let the session wear her out as Nicole is keen to pull out all the stops on staying in shape.\nAnd now the former reality TV babe has landed her first acting role.\nThe on-trend designer is set to return to our screens as she stars in comedy series Great News.\nKeeping in shape! The new comedy show the former reality TV babe stars in will air April 25 on NBC\nThe exciting move follows her reality role as wild child and Paris Hilton's best friend in The Simple Life.\nThe Tina-Fey production tells the story of a New Jersey mum who works at her daughter's workplace.\nGreat News will air April 25 on NBC.","url":"https://www.dailymail.co.uk/tvshowbiz/article-4319610/Makeup-free-Nicole-Richie-flaunts-pins-leggings.html"}
