{"authors":["Cassie Carpenter For Dailymail.Com"],"date_download":"2018-10-22 21:24:57","date_modify":"2018-10-22 21:24:57","date_publish":"2016-01-29 06:35:00","description":"The 34-year-old designer and the 36-year-old singer put on a united, cuddly front despite the ongoing divorce rumours vaguely described this month in Radar Online and Life & Style","filename":"data/vaneerConsumption/NicoleRichieandhusbandJoelMaddenglamupforGDayGalainLA.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/06/30B005EE00000578-0-image-a-144_1454048851065.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3422205_Date-night-Nicole-Richie-husband-Joel-Madden-glam-G-Day-Gala-LA_1540243497.html","title":"Nicole Richie and husband Joel Madden glam up for G'Day Gala in LA","title_page":"Nicole Richie and husband Joel Madden glam up for G'Day Gala in LA | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Nicole Richie and her husband Joel Madden glammed up for the G'Day USA Gala in downtown Los Angeles on Thursday evening.\nThe 36-year-old singer and the 34-year-old designer celebrated their fifth wedding anniversary last month.\n'Tonight is all about Oz #GdayLA #datenight!' the Good Charlotte frontman captioned a b&w snap of the couple.\nScroll down for video\nStill going strong! Nicole Richie and her husband Joel Madden glammed up for the G'Day USA Gala in downtown Los Angeles on Thursday evening\nAmorous emoji: The 36-year-old singer and the 34-year-old designer celebrated their fifth wedding anniversary last month\nThe Good Charlotte frontman captioned a b&w snap of the couple: 'Tonight is all about Oz #GdayLA #datenight!'\nRichie (born Escovedo) and Madden (born Combs) put on a united, cuddly front despite the ongoing divorce rumours vaguely described this month in Radar Online and Life & Style.\nOnce inside Vibiana, Joel and Nicole posed for a cosy couch snap with Hercules director Brett Ratner.\nThe 5ft1in reality star wore a furry beige Opening Ceremony coat cape-like over a matching Grecian-inspired, chiffon Alberta Ferretti gown.\nThe wisecracking celebutante sported full make-up, her own House of Harlow 1960 jewelry, and wore her thinning, platinum pixie cut side-parted.\nWedding rings on: Richie (born Escovedo) and Madden (born Combs) put on a united, cuddly front despite the ongoing divorce rumours vaguely described this month in Radar Online and Life & Style\nRubbing elbows: Once inside Vibiana, Joel and Nicole posed for a cosy couch snap with Hercules director Brett Ratner\nElegant attire: The 5ft1in reality star wore a furry beige Opening Ceremony coat cape-like over a matching Grecian-inspired, chiffon Alberta Ferretti gown\nDamaged 'do: The wisecracking celebutante sported full make-up, her own House of Harlow 1960 jewelry, and wore her thinning, platinum pixie cut side-parted\nMissing from their Aussie-loving festivities were the duo's two children - daughter Harlow, 8, and son Sparrow, 6.\nEarlier on Thursday, the 5ft7in musician hung out with his twin brother Benji - who's married to Cameron Diaz - and their fellow coaches Jessie J, and Ronan Keating.\nThe black-clad foursome - plus Delta Goodrem - will soon head Down Under to star in the fifth season of The Voice Australia.\nFamily-of-four: Missing from their Aussie-loving festivities were the duo's two children - daughter Harlow, 8, and son Sparrow, 6 (pictured July 25)\n'I'm so proud of my team and I!' Earlier on Thursday, the 5ft7in musician hung out with his twin brother Benji - who's married to Cameron Diaz - and their fellow coaches Jessie J, and Ronan Keating\nReplacing Ricky Martin: The black-clad foursome - plus Delta Goodrem - will soon head Down Under to star in the fifth season of The Voice Australia\nThe Madden Brothers' band Good Charlotte will next perform February 10 at the UK's Motorpoint Arena in Cardiff alongside All Time Low.\nFollowing a five-year hiatus, the Maryland rockers plan to drop their sixth studio album in May.\n'I think turning it off for five years, going out and living life as an optimist, [I learned] maybe there's more to me than just being the guy in the band,' Joel told Rolling Stone last month.\nGoing on tour! The Madden Brothers' band Good Charlotte will next perform February 10 at the UK's Motorpoint Arena in Cardiff alongside All Time Low\n'I had to learn how to be a productive human outside of music': Following a five-year hiatus, the Maryland rockers plan to drop their sixth studio album in May\n'I had to learn how to be a productive human outside of music to become a more productive person in music.'\nMeanwhile on Monday, Nicole - whose father is Lionel Richie - wrapped the latest ad campaign for her jewelry label, House of Harlow 1960.\nVH1 has yet to renew the nepotistically-privileged socialite's irreverent reality series Candidly Nicole for a third season.\n'Epic day for #hoh1960!' Meanwhile on Monday, Nicole - whose father is Lionel Richie - wrapped the latest ad campaign for her jewelry label, House of Harlow 1960","url":"https://www.dailymail.co.uk/tvshowbiz/article-3422205/Date-night-Nicole-Richie-husband-Joel-Madden-glam-G-Day-Gala-LA.html"}
