{"authors":["Rebecca Lawrence For Mailonline"],"date_download":"2018-10-23 02:56:59","date_modify":"2018-10-23 02:56:59","date_publish":"2016-01-29 17:42:52","description":"She jetted off to Barbados for best friend's Kimberly Walsh's wedding.But Nicola Roberts decided to take the day off from performing her bridesmaids duties to enjoy an idyllic stroll.","filename":"data/vaneerConsumption/NicolaRobertsflauntshertonedabsinapinkbikiniinBarbados.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/17/30B468BC00000578-0-image-a-4_1454088231581.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-3423175_Nicola-Roberts-flaunts-toned-abs-pink-bikini-Barbados-Kimberly-Walsh-s-wedding_1540263419.html","title":"Nicola Roberts flaunts her toned abs in a pink bikini in Barbados","title_page":"Nicola Roberts flaunts her toned abs in a pink bikini in Barbados | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She jetted off to Barbados for best friend's Kimberley Walsh's wedding.\nBut Nicola Roberts decided to take the day off from performing her bridesmaids duties to enjoy an idyllic stroll on the beach before pre-wedding mania officially takes hold.\nStepping out along the shoreline on Friday, the porcelain-skinned 30-year-old seemed in good spirits as she walked barefoot along the beach.\nScroll down for video\nBridesmaid-to-be: Nicola Roberts decided to take the day off from performing her bridesmaids duties to enjoy an idyllic stroll on the beach in Barbados on Friday before pre-wedding mania officially takes hold\nDonning a baby pink bandeau bikini, the Girls Aloud star flashed her toned abs in the flirty number, turning heads on her walk.\nPutting a quirky twist on the outfit, she teamed the skimpy swimwear with a cream skirt featuring a pleated hem.\nOpting to go barefoot for the outing, the red-head dangled a pair of embellished sandals between her fingers, allowing her to feel the hot sand between her toes.\nSomething Kinda Ooooh! Donning a baby pink bandeau bikini, the Girls Aloud star, 30, flashed her toned abs in the flirty number, turning heads on her walk\nStylish swimmer: Putting a quirky twist on the outfit, she teamed the skimpy swimwear with a cream skirt featuring a pleated hem\nToe-ing the line! Opting to go barefoot for the outing, the red-head dangled a pair of embellished sandals between her fingers, allowing her to feel the hot sand between her toes\nRavishing redhead! Leaving her trademark auburn locks loose and tousled, the pretty star concealed her make-up free face behind a pair of large black sunglasses\nPretty in pink! The pocelain skinned star took the time to soak up the sun and work on her tan in her bikini\nLeaving her trademark auburn locks loose and tousled, the pretty star concealed her make-up free face behind a pair of large black sunglasses.\nOn her walk, the star also enjoyed a brief chat with some of the locals, who helpfully pointed out some landmarks across the coast.\nThe star also posted a picture of the day on Instagram, where she made reference to the similarities between herself and the redheaded Disney mermaid, Ariel.\n'Up where they walk, up where they run, up where they stay all day in the sun. #WalshxScottWedding' she posted.\nUnder the sea! The star also posted a picture of the day on Instagram, where she made reference to the similarities between herself and the redheaded Disney mermaid, Ariel\nBridal party: The star enjoyed the company of her friends ahead of Kimberley Walsh's wedding\nBeach break: Nicola landed in the Caribbean island this week ahead of her bandmate Kimberley's wedding\nGym-honed: The pretty star showed off her toned abs and lean legs as she walked across the beach\nNicola landed in the Caribbean island this week ahead of her bandmate Kimberley's wedding.\nOn Sunday, she revealed just how intimate her duties had been in preparation for the big day, sharing one of her tasks on Twitter.\nJoking with her followers she posted: 'Getting the sexy underwear for your bf bride to be on the premise of what I think her fiancé will like, I just realised is uncomfortable.'\nWalking buddies: Nicola took in the idyllic sights with her blonde friend\nInstagram mode! Nicola and her friends seemed keen to get the perfect holiday snap sorted\nWavy lady! Nicola seemed to be in good spirits as she ran her hands through her auburn locks\nBeach babe! Nicola cut a striking figure on the beach and seemed to be enjoying a few days of calm before the impending nuptials\nThe mum-of-one will soon tie the knot with her partner of 14 years, Justin Scott, but the pair have kept the wedding date under wraps for now.\nJoining Nicola as bridesmaid will be Cheryl Fernandez-Versini, who is currently experiencing her own marriage woes following her split from husband Jean Bernard.\nControversially, Kimberley's fellow bandmates, Sarah Harding and Nadine Coyle. are reported to have been left off the guest list.\nFashionable friends: Nicola and her pals cut a stylish figure as they strolled across the beach\nFresh faced:On her walk, the star also enjoyed a chat with a local who seemed to be massaging her with a leaf\nSightseeing! The star also enjoyed a brief chat with some of the locals, who helpfully pointed out some landmarks across the coast","url":"https://www.dailymail.co.uk/tvshowbiz/article-3423175/Nicola-Roberts-flaunts-toned-abs-pink-bikini-Barbados-Kimberly-Walsh-s-wedding.html"}
