{"authors":["Kate Ferguson","Political Correspondent For Mailonline"],"date_download":"2018-10-23 01:09:39","date_modify":"2018-10-23 01:09:39","date_publish":"2017-04-26 11:17:30","description":"Scotland’s First Minister tore into her rivals as she hit the campaign trail in Stirling for speeding up the timetable for raising the pension age for women.","filename":"data/vaneerConsumption/NicolaSturgeonattacksTheresaMayoverpensions.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/04/26/12/3F9F38DE00000578-0-image-a-24_1493205665997.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-4447096_Nicola-Sturgeon-attacks-Theresa-pensions_1540256979.html","title":"Nicola Sturgeon attacks Theresa May over pensions","title_page":"Nicola Sturgeon attacks Theresa May over pensions | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Nicola Sturgeon has upped the pressure on Theresa May's Conservatives – describing their treatment of pensioners as a 'national scandal'.\nScotland's First Minister tore into her rivals as she hit the campaign trail in Stirling for speeding up the timetable for raising the pension age for women.\nAnd she warned that the Tories will 'betray pensioners yet again' if they are elected on June 8 by scrapping the triple lock - which guarantees pensions increase in line with wages, inflation or 2.5 per cent - whichever is highest.\nBut the attack could backfire as Mrs May is reportedly considering keeping the pledge.\nAnd in a major boost for pensioners, she yesterday promised to unveil a long-term plan to solve Britain's social care crisis.\nNicola Sturgeon climbed aboard a motorbike decked out in paraphernalia demanding a second independence referendum as she hit the campaign trail in Stirling today. She has hit out at the Conservatives' record on pensioners ahead of the June 8 vote\nThe two female leaders have been locked in a war of words since the starting gun was fired on the General Election.\nAnd Ms Sturgeon accelerated her attack on her rival as she climbed aboard a motorbike decked out in Scottish flags and stickers demanding a second independence referendum.\nShe said: 'The treatment of pensioners by this Tory government has been nothing short of a national scandal.\n'Millions of women have been denied their rightful state pension - the WASPI (Women Against State Pension Inequality) campaign has worked tirelessly to highlight their plight, but Theresa May's government has coldly brushed aside their concerns.\n'And now - in this election - it appears that the Tories are hoping to quietly ditch their commitment to the triple lock.\nScotland's First Minister, pictured in Stirling today, has been locked in a war of words with her rival Theresa May as the pair travel the country ahead of the General Election\nMs Sturgeon gets in a round of teas at a coffee shop in Stirling today as she hits the streets to try and win over voters ahead of local and the UK wide General Election\nMs Sturgeon, has a cup of coffee with Bruce Crawford, a member of the Scottish Parliament. Scotland's First Minister had a go at making the coffees at the Burgh Coffee House in Stirling\nThe green-fingered SNP leader also tried her hand at arranging a bunch of flowers while at a florist while on the campaign trip in Stirling. She gets some tips from florist Jillian Gavin\n'The triple lock was supported by all parties precisely because it was crucial in tackling the low incomes that are a reality in too many pensioner households.'\nThe state pension age for women will increase to 65 in November 2018 and to 66 by October 2020.\nDuring a busy morning on the election trail, Ms Sturgeon poses for photos with two flag-waving children. She is campaigning hard ahead of local and UK-wide elections\nMs Sturgeon again lashed out at the Tory leader, warning that pensioner poverty has increased under her tenure.\nShe said: 'With pensioner poverty on the rise across the UK, any more Tory attacks on pensions are the last thing we need.\nWhat is the triple lock on pensions and how does it work? The pensions triple lock was introduced by the coalition government in 2010 in an effort to tackle the problem of pensioner poverty. The guarantee means that the state pension will increase every year in line with average wages, inflation or 2.5 per cent – whichever is highest. It was introduced to protect pensioners from derisory increases, such as the 75p increase given under Labour in 1999.\n'The Tories found the money to cut taxes for the rich in their budget, but seem unwilling to find the money to give state pensioners a decent income - no government which believes in a fair society could pursue those two positions.\n'A vote for the SNP in this election is a vote to stand up for older people across Scotland, for fair pensions, and to stop a Tory betrayal in its tracks.'\nMrs May has repeatedly warned that Britain could be led by a 'coalition of chaos' including Labour and the SNP unless Britons vote Tory at the election.\nBut the prospect of the SNP in power in Westminster will be toxic to English voters and was a huge driver of the Conservative campaign in 2015.\nMrs May yesterday promised to unveil a plan to address Britain's social care crisis in a move which will appeal to pensioners.\nSpeaking at a campaign rally in Wales, she said that under her leadership the UK will 'stop ducking the issue' and deliver a proper fix.\nTheresa May, pictured yesterday at a steelworks in Newport, Wales, has warned that Nicola Sturgeon and the SNP could help create a 'coalition of chaos' unless Britons vote Tory\nMrs May said: 'We are and have been already working on a long-term solution and that's what we need in this country, we need to stop ducking the issue we need to ensure we've got that long-term solution for a sustainable future for social care.'\nMeanwhile, The Times has reported that Mrs May is considering keeping the triple lock.\nA senior figure told the newspaper: ‘It’s a matter of pretty intense debate about whether to include it in the manifesto.’","url":"https://www.dailymail.co.uk/news/article-4447096/Nicola-Sturgeon-attacks-Theresa-pensions.html"}
