{"authors":["Jabeen Waheed For Mailonline"],"date_download":"2018-10-23 00:59:45","date_modify":"2018-10-23 00:59:45","date_publish":"2017-03-10 08:23:04","description":"Nicole Scherzinger, 38, looked sensational as she stepped out to West Hollywood hotspot Craig's on Thursday night.","filename":"data/vaneerConsumption/NicoleScherzingerchannelssafarichicinWestHollywood.json","image_url":"https://i.dailymail.co.uk/i/pix/2017/03/10/08/3E2191C800000578-0-image-a-24_1489133362390.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/tvshowbiz_article-4300310_Nicole-Scherzinger-channels-safari-chic-night-out_1540256385.html","title":"Nicole Scherzinger channels safari chic in West Hollywood","title_page":"Nicole Scherzinger channels safari chic in West Hollywood | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"She's been spotted on a number of date nights recently with her man Grigor Dimitrov.\nBut Nicole Scherzinger opted to enjoy an outing with her pal Kelly Osbourne instead, as she stepped out at West Hollywood hotspot Craig's on Thursday night.\nThe 38-year-old former Pussycat Doll looked sensational as she showcased her svelte frame in a stylish safari-chic ensemble.\nScroll down for video\nSafari chic: Nicole Scherzinger, 38, looked sensational as she stepped out to West Hollywood hotspot Craig's on Thursday night\nAll eyes were on Nicole as she exited the celebrity favourite in a khaki green blouse which drew attention to her slim midriff.\nThe Hawaiian born star teamed the look with a pair of skinny black jeans and bolstered her already statuesque height in chunky brown sandals.\nNicole amped up her fashionista status in a wide felt halt, which complemented her casually unkempt ponytail.\nThe former X Factor judge accentuated her striking features with aptly placed highlighter and a generous coat of mascara.\nStyle queen: All eyes were on the former Pussycat Doll as she exited the celebrity favourite in a khaki green blouse which drew attention to her slim midriff\nSartorially savvy: The Hawaiian born star teamed the look with a pair of skinny black jeans and bolstered her already statuesque height in chunky brown sandals\nNicole seemed in high spirits as she strutted out of Craig's and headed to an awaiting vehicle.\nLilac-haired Kelly Osbourne also enjoyed the night out with Nicole and was clad in a sophisticated all-black ensemble.\nOn Saturday, Nicole enjoyed a night out with her Bulgarian beau - who's 13 years her junior - at the same venue.\nThe talented vocalist emphasised her taut frame in a seemingly airtight peach bodysuit with no sleeves and a turtleneck.\nTopping off the look: Nicole amped up her fashionista status in a wide felt halt, which complemented her casually unkempt ponytail\nBeauty: The former X Factor judge accentuated her striking features with aptly placed highlighter and a generous coat of mascara\nHer tennis star beau, who she's been dating for one year, slipped on a flowing blue top with an enormous black patch at the top left side of its front.\nTight black trousers threw his athletic legs into relief, and he'd garnished his ensemble with a large watch that glinted on his left wrist.\nIn last year's December issue of InStyle UK, she'd explained that she prefers not 'to put focus on' her romance in interviews.\nGood night: Nicole seemed in high spirits as she strutted out of Craig's and headed to an awaiting vehicle\n'We like to keep it our own business': In last year's December issue of InStyle UK , she'd explained that she prefers not 'to put focus on' her romance in interviews\n'A few years down the line': Nicole also opened up about her plans to start a family with the tennis star\nFashionista: Lilac-haired Kelly Osbourne also enjoyed the night out with Nicole and was clad in a sophisticated all-black ensemble\n'I’m happy, and I’m in a relationship, and we like to keep it our own business. And that’s it. You talk about it, then people write about it like: \"Ooooh, she can’t wait to be blah, blah, blah with blah, blah, blah\" and it’s like, \"No, I never said that!\"' she said.\nOn the topic of whether she does want to begin cobbling together a family, she's conceded: 'A few years down the line, yeah, it’s something that I’m going to be thinking about.'\nYet and still, 'I feel like I haven’t scratched the surface of what I’m supposed to do and create, and that’s where my mind is at. So when I’ve got there, and it’s the right time, then maybe I’ll think about kids and a family.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-4300310/Nicole-Scherzinger-channels-safari-chic-night-out.html"}
