{"authors":["Thomas Colson","Will Martin"],"date_download":"2018-10-30 23:29:07","date_modify":"2018-10-30 23:29:07","date_publish":"2016-12-07 00:00:00","description":"The report found that a crackdown would slow economic growth in the long term — although low-skilled workers would actually benefit from a wage boost.","filename":"data/vaneerConsumption/NIESRBrexitimmigrationcrackdownwoulddamageUKeconomy.json","image_url":"https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png","language":null,"localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/businessinsider.com/_niesr-brexit-immigration-crackdown-would-damage-uk-economy-2016-12_1540942147.html","title":"NIESR: Brexit immigration crackdown would damage UK economy","title_page":"    NIESR: Brexit immigration crackdown would damage UK economy - Business Insider\n","title_rss":"NULL","source_domain":"businessinsider.com","text":"Reuters A fall in immigration post-Brexit will hit the growth of the British economy, but some low-skilled workers would see their incomes slightly boosted, according to new research by the National Institute of Economic and Social Research (NIESR).\nThe report, titled \"The Economic Impact of Brexit-induced Reductions in Migration,\" found that a fall in total immigration of 91,000 — the \"middle-range\" Brexit scenario, would mean that GDP per capita would be 3.4% lower by 2030 than it would otherwise have been.\nIf immigration fell by 150,000 — the \"hard\" scenario — the slowdown would be 5.4%. Annual immigration levels currently lie at around 650,000.\nIn some sectors, the wage impact would actually be positive. Workers in construction, retail, hospitality, food processing, and agriculture could see their wages increase by 0.51% by 2030 in the \"middle-range\" scenario and by 0.82% in the \"hard\" scenario.\nJonathan Portes, who co-authored the paper, told the Financial Times that the figures are \"highly uncertain\" but nonetheless provide a \"useful guide\" to the potential impact of Brexit.\nThe paper is one of the first kinds of research on the potential impact of the post-Brexit immigration crackdown which Theresa May has pledged to pursue. Analysis from bodies including the UK Treasury and the International Monetary Fund focused on the effects of reducing trade, but not of reducing immigration.\nAnnual immigration levels currently lie at around 650,000 — a record high which has been boosted by a large number of EU migrants moving to the UK before it exits from the EU.\nImmigration has been a hot-button topic in the UK, particularly since the Brexit vote. Numerous polls have shown that people voting for Brexit saw Britain's ability to place greater controls on who comes into the UK as the most important issue in the vote. Once recent poll found that 70% of people want any Brexit deal to include controls on immigration from the EU.\nThe so-called \"taking back control\" of Britain's borders, and ending the free movement of European citizens into and out of the UK is one of the arguments most frequently cited by prominent Brexiteer politicians like Boris Johnson — although Johnson got into hot water last week when he allegedly told a group of EU ambassadors that he personally favours free movement.\nOne possible post-Brexit immigration system is that the UK could adopt a more stringent points-based system for EU migrants.\nThe points system would mean that people who apply to come to the UK will have to adhere to a grading system to be granted a visa to live and work here. Points would be calculated on your ability to speak English, your skills, your earning power and various other elements, such as your age.","url":"https://www.businessinsider.com/niesr-brexit-immigration-crackdown-would-damage-uk-economy-2016-12"}
