{"authors":[],"date_download":"2018-10-22 22:39:32","date_modify":"2018-10-22 22:39:32","date_publish":"2014-05-12 07:35:46","description":"A teenage science student who escaped abduction by Boko Haram said the kidnapping was \"terrifying\" and is scared to return to school.","filename":"data/vaneerConsumption/NigeriaGirlWhoEscapedBokoHaramImNowTerrifiedofSchool.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_20/435391/140512-nigeria-girls-345a_a0b00db7c96b905f914c8e4e709a6852.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_nigeria-girl-who-escaped-boko-haram-im-now-terrified-school-n102796_1540247972.html","title":"Nigeria Girl Who Escaped Boko Haram: I'm Now Terrified of School","title_page":"Nigeria Girl Who Escaped Boko Haram: I'm Now Terrified of School","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nOne of the teenagers who escaped from Islamist extremists who abducted more than 200 schoolgirls says the kidnapping was \"too terrifying for words,\" and she is now scared to go back to school.\nSarah Lawan, a 19-year-old science student, told The Associated Press that more of the girls could have escaped but that they were frightened by their captors' threats to shoot them.\nShe spoke in the local Hausa language in a phone interview from Chibok, her home and the site of the mass abduction in northeast Nigeria.\nThe failure to rescue those who remain captive four weeks later has attracted mounting national and international outrage. Last week, Nigeria was forced to accept international help in the search, after ignoring offers for weeks.\nMore experts are expected in Nigeria to help rescue the girls, including U.S. hostage negotiators and others from Britain, France, China and Spain.\n\"I am pained that my other colleagues could not summon the courage to run away with me,\" Lawan said. \"Now I cry each time I come across their parents and see how they weep when they see me.\"\nPolice say 53 students have escaped. Nigeria's homegrown Boko Haram terrorist network is threatening to sell those who remain in captivity into slavery.\nWashington last year put a $7 million ransom on the head of Boko Haram leader Abubakar Shekau, who said in a video last week that he will sell the girls into slavery.\nLawan said other girls who escaped later have told her that the abductors spoke of their plans to marry them.\nShe said the thought of going back to school terrifies her — either the burned out ruins of Chibok Government Girls Secondary School or any other school. But it will have to be done if she is to realize her dream of studying law.\n\"I am really scared to go back there; but I have no option if I am asked to go because I need to finish my final year exams which were stopped half way through,\" she said.\n- The Associated Press","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/nigeria-girl-who-escaped-boko-haram-im-now-terrified-school-n102796"}
