{"authors":[],"date_download":"2018-10-22 21:13:26","date_modify":"2018-10-22 21:13:26","date_publish":"2014-05-06 11:29:06","description":"Britain’s Foreign Secretary William Hague describes schoolgirls' kidnapping as “disgusting and immoral.”","filename":"data/vaneerConsumption/NigeriaOfferedHelpbyUKinBringOurGirlsHomeCase.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/422536/140506-nigeria-girls-730a_daf011e11e2947ecaee61593e4be9d9d.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_nigeria-offered-help-u-k-bring-our-girls-home-case-n97926_1540242806.html","title":"Nigeria Offered Help by U.K. in 'Bring Our Girls Home' Case","title_page":"Nigeria Offered Help by U.K. in 'Bring Our Girls Home' Case","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nBritain has joined the U.S. in offering help to secure the release of more than 200 Nigerian schoolgirls kidnapped by Islamist militant group Boko Haram amid growing outrage over the failure to find the girls.\nThe group’s leader threatened to sell the girls “in the market” in a video obtained Monday by the AFP news agency.\nThe United Nations warned Boko Haram that doing so could constitute crimes against humanity, saying Tuesday it was “deeply concerned” by the video.\n“There is an absolute prohibition against slavery and sexual slavery in international law,” said Rupert Colville, spokesperson for the U.N. High Commissioner for Human Rights. “The girls must be immediately returned, unharmed, to their families.”\nColville told a briefing Tuesday that the U.N. has contacted Nigeria’s president and urged the government “to ensure that it spares no effort” to bring the girls home.\nIt has been weeks since the girls were taken from their secondary school in the northeastern town of Chibok. The failure to find them has sparked anger and global protests.\nWith pressure mounting on the Nigerian government to find them, a growing chorus of voices is urging President Goodluck Jonathan to accept outside assistance.\nBritain’s Foreign Office William Hague confirmed on Tuesday that the U.K. stands ready to help find the girls.\n“Britain is offering assistance but of course the primary responsibility will rest with the Nigerians,” he said in a statement. “I hope they will do what is necessary to reunite these girls with their families.”\nThe Foreign Office told NBC News that assistance could take the form of planning or operational support in the short term.\nHis comments came as the Reuters news agency reported that suspected Boko Haram gunmen kidnapped eight more girls between the ages of 12 and 15 overnight from the village of Warabe in northeast Nigeria.\nThe State Department also has said it is talking to Nigeria about how it can help find the girls.\nOn Monday, Sen. Chris Coons criticized the Nigerian president for a \"lack of urgency and alarm\" over the kidnappings.\n\"The U.S. stands ready to assist the Nigerian government in locating the girls and the perpetrators, and has offered to do everything possible to bring them home,\" Coons said in a statement. \"President Jonathan should accept this assistance immediately, and apply a degree of urgency to this search with the help of U.S. experts.\"\nA worldwide campaign to raise awareness about the girl’s plight using the hashtag #BringBackOurGirls has drawn in international figures from Hillary Clinton to young rights activist Malala Yousafzai.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/nigeria-offered-help-u-k-bring-our-girls-home-case-n97926"}
