{"authors":[],"date_download":"2018-10-22 21:26:30","date_modify":"2018-10-22 21:26:30","date_publish":"2014-05-07 12:01:32","description":"Last month's mass kidnapping by militant group Boko Haram has triggered an international outcry and protests in Nigeria.","filename":"data/vaneerConsumption/NigeriaPoliceOffer300KRewardAfterBokoHaramKidnapsGirls.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_19/425521/140506-nigeria-abducted-girls-mn-755_cec18994690a0d566ab3359b5d0fbe19.1200;630;7;70;5.JPG","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_nigeria-police-offer-300k-reward-after-boko-haram-kidnaps-girls-n99026_1540243590.html","title":"Nigeria Police Offer $300K Reward After Boko Haram Kidnaps Girls","title_page":"Nigeria Police Offer $300K Reward After Boko Haram Kidnaps Girls","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nABUJA, Nigeria -- A 50 million naira ($300,000) reward was offered by Nigerian police on Wednesday to anyone who can give credible information leading to the rescue of more than 200 schoolgirls abducted by Islamist rebels.\nLast month's mass kidnapping by militant group Boko Haram in the remote northeastern village of Chibok triggered an international outcry and protests in Nigeria, piling pressure on the government to get the girls back.\nOn Tuesday, it emerged that suspected Boko Haram gunmen had kidnapped eight more girls from a village in northeastern Nigeria.\nBoko Haram leader Abubakar Shekau threatened in a video released to the media on Monday to sell the girls abducted from a secondary school on April 14 \"on the market\".\nThe kidnappings by the Islamists, who say they are fighting for an Islamic state in Nigeria, have shocked a country long inured to the violence around the northeast.\n- Reuters","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/nigeria-police-offer-300k-reward-after-boko-haram-kidnaps-girls-n99026"}
