{"authors":[],"date_download":"2018-10-22 22:02:52","date_modify":"2018-10-22 22:02:52","date_publish":"2014-05-08 21:51:43","description":"Ann Curry: A short time ago, everyone in our news editing room suddenly went silent.","filename":"data/vaneerConsumption/NigerianMothersWaitinAnguishForTheReturnofMissingGirls.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/430391/nigerian_families_crying_school_1310d5565568faf25022592c4ad73ec9.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_nigerian-mothers-wait-anguish-return-missing-girls-n100801_1540245772.html","title":"Nigerian Mothers Wait in Anguish For The Return of Missing Girls","title_page":"Nigerian Mothers Wait in Anguish For The Return of Missing Girls","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA short time ago, everyone in our news editing room suddenly went silent, as we watched the latest video to emerge from northeast Nigeria, where 300 girls were kidnapped by Islamic militants 24 days ago.\nAcross our TV screens for the first time, we saw more than a 100 loved ones of missing girls, most of them mothers, step into public view. Until now we'd been told, these families didn't want their faces known, for fear of being stigmatized by the assumption their daughters have been raped.\nBut now it appeared their desperation, more than three weeks after the kidnappings, could not be contained.\nAnd neither could their tears. They cried out for their daughters, sobbing openly in this place where people rarely show their emotions in public.\nOne mother said she would rather have died than to see her daughter kidnapped in this way.\nThese girls were the greatest hopes of their families, striving for an education in a place where only 25 percent of girls are literate, aspiring to be teachers and doctors.\nMost of the schools in the area had been closed because of a terror campaign by the extremists, called Boko Haram.\nThe kidnapped girls knew going to school was risky, but they wanted to take their physics exams.\nAnd now their parents wait in anguish, fearing it may be too late to find them.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/nigerian-mothers-wait-anguish-return-missing-girls-n100801"}
