{"authors":[],"date_download":"2018-10-23 04:08:52","date_modify":"2018-10-23 04:08:52","date_publish":"2016-01-28 20:00:26","description":"Nigeria's former highest-ranking airforce officer is being questioned as part of an investigation into the alleged diversion of funds intended to fight Boko ...","filename":"data/vaneerConsumption/Nigerianantigraftagencyarrestsformerairforcechief.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/28/article-doc-7h3id-2vdWmEltwXfba0ce28e632c5785c-323_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3421607_Nigerian-anti-graft-agency-arrests-former-airforce-chief_1540267732.html","title":"Nigerian anti-graft agency arrests former airforce chief","title_page":"Nigerian anti-graft agency arrests former airforce chief | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Nigerian anti-graft agency arrests former airforce chief\nNigeria's former highest-ranking airforce officer is being questioned as part of an investigation into the alleged diversion of funds intended to fight Boko Haram, a source close to the probe said on Thursday.\n\"Former chief of air staff Air Marshal Adesola Amosun has been with us since yesterday (Wednesday),\" the official at the Economic and Financial Crimes Commission told AFP on condition of anonymity.\n\"He is being interrogated in connection with the arms deal scandal.\"\nNigerian soldiers patrol in the north of Borno state near a former Boko Haram camp on June 5, 2013 near Maiduguri ©Quentin Leboucher (AFP/File)\nA statement from President Muhammadu Buhari's office on January 15 said the EFCC probe into alleged weapons procurement fraud had been widened to include 17 former or serving high-ranking officers.\nThey included the former chief of defence staff, Alex Badeh, whom Buhari replaced last year, it added.\nThe probe would look at \"the roles of the officers and the... companies and their directors in fundamental breaches associated with the procurements\" by former national security advisor Sambo Dasuki and the air force, the statement read.\nDasuki is facing a string of allegations over allegedly bogus arms deals to provide Nigeria's military with the weapons and equipment needed to fight the Islamist group in the country's northeast.\nThe material either never materialised, was over-priced or deficient, according to a panel looking into the procurement.\nProsecutors allege the money was channelled to the then-ruling Peoples Democratic Party (PDP) to fund Goodluck Jonathan's re-election campaign last year.\nJonathan lost to Buhari, a no-nonsense anti-corruption campaigner and former military ruler, in the first democratic transition of power between political parties in Nigeria's history.","url":"https://www.dailymail.co.uk/wires/afp/article-3421607/Nigerian-anti-graft-agency-arrests-former-airforce-chief.html"}
