{"authors":["Frances Martel"],"date_download":"2018-10-30 17:53:03","date_modify":"2018-10-30 17:53:03","date_publish":"2016-02-11 02:21:47","description":"Nigerian officials arrested two soldiers this week for having provided government-issued weapons to Boko Haram.","filename":"data/vaneerConsumption/NigeriaArrestsSoldiersSupplyingArmstoBokoHaram.json","image_url":"https://media.breitbart.com/media/2016/02/nigerian-soldiers-inspect-boko-haram-weapons-file-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_02_10__1540921983.html","title":"Nigeria Arrests Soldiers Supplying Arms to Boko Haram","title_page":"Nigeria Arrests Soldiers Supplying Arms to Boko Haram | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"The government of Nigeria may have declared the war won against Islamic State affiliate Boko Haram, but new evidence has surfaced that they not only remain active, but have deep ties within the Nigerian military. Officials arrested two soldiers this week for having provided government-issued weapons to the jihadist terror group.\nNigeria’s Leadership newspaper reports that two soldiers working in the army’s Explosives Ordnance Unit were arrested Sunday after evidence surfaced that they were using their security clearance to gain access to “high calibre arms and ammunition,” to be taken to an “unknown destination.” Army spokesman Sami Usman confirmed that the “black sheep” were in illegal possession of the following items when arrested:\n1 Smoke grenade, 2,136 live rounds of 7.62 (Special) ammunition, 50 live rounds of 7.6mm (NATO) ammunition, 5 magazines of AK 47 rifles, 2 Browning Machine Gun live rounds of ammunitions. Others include, 1 Axe, 1 Cutlass, 1 Jack knife, 9 Jungle hats, 11 pairs of Camouflage (9 Desert and 3 woodland green), 4 Military Pullovers, 1 Black beret, 1 Green beret, 1 Pair of number 7 dress, 2 General Duty belt, 12 Army T-shirts, 2 Rain Coats, 2 Water bottles, 1 Pairs of Rain boot and 5 Pairs of Desert boots.\nThe military believes, had the soldiers not been arrested, the weapons would have ended up in the hands of Boko Haram.\nThe discovery of Boko Haram acquiring arms directly from Nigerian soldiers may damage calls in national media for the government of President Muhammadu Buhari to spend more money on heavier-caliber weapons for the Nigerian military to better fight Boko Haram. In a column Tuesday, the newspaper Vanguard demanded more investment into weapons munitions for soldiers:\nWe are surprised and disappointed that, almost nine months into the life of the Buhari regime, the issues of poor equipment and delay in the release of funds for the military still subsist. Coming from an administration that had promised during the campaigns to eliminate Boko Haram within three months, we are surprised that the insurgents are still able to invade communities.\nUpon assuming the presidency last year, Buhari vowed to eradicate the jihadist group from Nigeria entirely, giving the military a December ultimatum to destroy the organization. In late December, Buhari declared that “we have won the war” against the terrorist group. “Boko Haram is an organized fighting force, I assure you, [but] we have dealt with them,” he told BBC Hausa.\nBoko Haram has remained active and deadly since the declaration, however. Vanguard reports Wednesday that Boko Haram has killed at least 60 people in a refugee camp in northern Borno state, their home base, Tuesday, with news surfacing now due to the lack of easy access to long-distance communication in the region.\nOn Wednesday, Boko Haram suicide bombers struck a funeral wake in Cameroon, on the Nigerian border. At least 6 have been killed and more than 30 injured. “The villagers were gathered for the wake when two suicide attackers joined them, pretending to be family members,” one witness noted. Both suicide bombers were females, their age yet to be determined.\nAttacks also appear to be escalating in severity, despite claims by Nigerian officials that the increased use of female suicide bombers is a sign of disorganization. Last week, Boko Haram killed more than 100 people in a Borno village, Dalori. Witnesses say dozens of children were burned alive, and the death toll remains incomplete, as hundreds of people are still missing.\nTo combat the latest string of attacks in Borno, the military is shutting down markets in Maiduguri, the capital of Borno. The increase in attacks appears to indicate that jihadists are finding it easier to arm themselves, so as a complimentary measure to the arrest of the two soldiers, Nigerian officials have announced they will sweep markets for illegal weapons and arrest anyone suspected of selling weapons to Boko Haram. Sani Usman, Army spokesman, said of the event:","url":"https://www.breitbart.com/national-security/2016/02/10/nigeria-arrests-soldiers-supplying-arms-to-boko-haram/"}
