{"authors":[],"date_download":"2018-10-22 21:10:21","date_modify":"2018-10-22 21:10:21","date_publish":"2014-05-06 11:30:27","description":"A 16-year-old was among about 50 students who escaped kidnappers. More than 270 remain missing.","filename":"data/vaneerConsumption/NigerianSchoolgirlDescribesKidnappingbyTerrorists.json","image_url":"https://media3.s-nbcnews.com/j/newscms/2014_19/422646/140506-nigeria-abduction-protest-8a_046cb91e516a017164ac0f8ab03f1d9e.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_nigerian-schoolgirl-describes-kidnapping-terrorists-n97931_1540242621.html","title":"Nigerian Schoolgirl Describes Kidnapping by Terrorists","title_page":"Nigerian Schoolgirl Describes Kidnapping by Terrorists","title_rss":"NULL","source_domain":"nbcnews.com","text":"\"We ran and ran, so fast,\" said the girl, who has always prided herself on running faster than her six brothers. \"That is how I saved myself. I had no time to be scared, I was just running.\"\nA few other girls clung to low-hanging branches and waited until the vehicles had passed. Then they met up in the bush and made their way back to the road. A man on a bicycle came across them and accompanied them back home.\nThere, they were met with tears of joy.\n\"I'm the only girl in my family, so I hold a special place and everyone was so happy,\" the girl said. \"But that didn't last long.\"\nThe day after, the Defense Ministry put out a statement quoting the school principal, saying soldiers had rescued all but eight of the girls. When the principal denied it, the ministry retracted its statement.\nWith confidence in the military eroded, the residents of Chibok pooled their money, bought fuel for motorcycles and headed into the dangerous Sambisa Forest. The forest sprawls over more than 23,000 square miles (59,570 sq. kilometers), nearly eight times the size of Yellowstone National Park in the United States, and is known to shelter extremist hideouts.\nMutah Buba joined the search party hoping to find his two sisters and two nieces. They got directions from villagers along the way who said they had seen the abductors with the girls on a forest path. Finally, an old man herding cattle at a fork in the road warned them that they were close to the camp, but that they and their daughters could be killed if they confronted the militants.\nThe searchers returned to Chibok and appealed to the few soldiers there to accompany them into the forest. They refused, point blank, Buba said. Parents in Chibok ask why they came within a couple of miles of their daughters, yet the military did not.\n\"What was strange was that none of the people we spoke to had seen a soldier man in the area, yet the military were saying they were in hot pursuit,\" said Buba, a 42-year-old drawn home to Chibok by the tragedy from Maiduguri, the Borno state capital 130 kilometers (80 miles) to the northwest.\nThe military says it is diligently searching for the girls, with extensive aerial surveillance.\n\"Every information relayed to security agencies has so far been investigated, including the search of all places suspected as a possible hide-away of the kidnapped girls,\" Information Minister Labaran Maku said Friday.\nMany soldiers have told the AP they are demoralized, because Boko Haram is more heavily armed and better equipped, while they get little more than a meal a day.\nSome of the kidnapped girls have been forced into \"marriage\" with their Boko Haram abductors, sold for a nominal bride price of $12, according to parents who talked with villagers. Others have been taken across borders to Cameroon and Chad, they said. Their accounts could not be verified, but forced child marriage is common in northern Nigeria, where it is allowed under Islamic law but not the country's Western-style constitution.\nIn the meantime, the parents are frantic. Through sobs and jagged gasps for air, the mother of a missing 15-year-old said she had lost confidence in the authorities.\n\"I am so very sad because the government of Nigeria did not take care of our children and does not now care about our children,\" said the mother, who spoke on condition of anonymity to protect her daughter. \"All we have left is to pray to God to help them and help us.\"\nThe mother of six wondered what would happen to her daughter's lofty ambition to become a doctor. She said the girl spent her time caring for the family, and would cook whatever her mother wanted to eat.\n\"She is my first-born, the best,\" said the mother, who broke into a scream followed by wails of sorrow. \"What am I to do as a mother?\"\nSpurred by growing national outrage, President Goodluck Jonathan on Friday set up a committee to work out a rescue strategy, and expressed confidence that the military will find the girls.\nThe only way to get the girls back is through negotiation, according to an Islamic scholar who has mediated the release of previous hostages. The scholar, who remained anonymous because his position receiving messages from Boko Haram is sensitive, said the militants are willing to free the girls for a ransom, but have not specified how much.\nThe 16-year-old who escaped keeps thinking of her friends, and wondering why she was able to get away while they are still captive. She is at times afraid and at times angry.\n\"I am really lucky and I can thank God for that,\" she said. \"But God must help all of them ... Their parents are worrying. Every day, everyone is crying.\"\n— The Associated Press","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/nigerian-schoolgirl-describes-kidnapping-terrorists-n97931"}
