{"authors":["Frances Martel"],"date_download":"2018-10-30 17:51:53","date_modify":"2018-10-30 17:51:53","date_publish":"2016-11-01 01:36:49","description":"A devastating Human Rights Watch report published Monday accuses members of the Nigerian military of raping underaged Boko Haram victims.","filename":"data/vaneerConsumption/NigerianMilitaryRapedBokoHaramVictims.json","image_url":"https://media.breitbart.com/media/2015/08/Boko-Haram-hostages-rescued-Nigeria-ap.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2016_10_31__1540921913.html","title":"Nigerian Military Raped Boko Haram Victims","title_page":"Report: Nigerian Military Raped Boko Haram Victims","title_rss":"NULL","source_domain":"breitbart.com","text":"A devastating Human Rights Watch report published Monday accuses members of the Nigerian military of raping underaged Boko Haram victims.\nNigerian President Muhammadu Buhari has said, through a presidential statement, that he is “worried and shocked” by the allegations and will launch an investigation into the matter, according to Reuters.\nHuman Rights Watch conducted a study documenting instances of rape, sexual harassment, inducement into sexual activity by promising food, and other such violations against the victims of the Islamic State-affiliated terrorist group. Many of these refugees — technically internally displaced persons (IDPs), as they are refugees in their own country — had already been the victims of rape and non-sexual violent attacks as part of Boko Haram raids, and live in the Maiduguri refugee camp because their villages have been deemed at high risk for subsequent terrorist attacks.\nThe NGO found 43 women and girls willing to discuss their experience of “sexual abuse, including rape, and exploitation” at the camp. Maiduguri is the capital of northeast Borno State, where Boko Haram is headquartered.\nHuman Rights Watch’s report notes that the situation in Maiduguri, however, is not unique: a Nigerian polling firm “reported that 66 percent of 400 displaced people in Adamawa, Borno, and Yobe states said that camp officials sexually abuse the displaced women and girls.” One result has been a 40 percent increase in the number of HIV cases in the Maiduguri camp.\nThe girls and women who told their stories to the NGO accused an assortment of soldiers, police, and militia leaders of this behavior. Human Rights Watch reproduced in full one particularly harrowing anecdote told by a 16-year-old girl:\nThe day he raped me, he offered me a drink in a cup. As soon as I drank it, I slept off. It was in his camp room. I knew something was wrong when I woke up. I was in pain, and blood was coming out of my private part. I felt weak and could not walk well. I did not tell anyone because I was afraid. When my menstrual period did not come, I knew I was pregnant and just wanted to die to join my dead mother. I was too ashamed to even go to the clinic for pregnancy care. I am so young!\nOthers said they were raped without being drugged, while yet other women say they were coerced into sexual relationships with police and troops after being promised food and marriage. Most who were impregnated in this way say the men who attacked them fled as soon as they learned of the pregnancy.\nReuters notes that Nigeria’s national police force adamantly rejected all accusations. Buhari’s office has nonetheless vowed an investigation. “President Buhari has instructed the Inspector General of Police and the state governors of the affected states to immediately commence investigations into the issue,” a statement from the president’s office read Monday. “While the Nigerian military continues to work hard so that these unfortunate victims of Boko Haram terrorism can soon return safely to their homes, the government will do its best to ensure their protection and welfare in the temporary IDP camps.”\nThis is not the first report indicating that Nigerian men in government positions are using their power to abuse of Boko Haram victims. A report conducted in part by the medical charity International Medical Corps (IMC) in September found many women saying they needed to trade sex for food in order to avoid starvation. Before reports of sexual exploitation surfaced, Doctors without Borders (MSF) issued calls to action regarding the Bama refugee camp, where the group said hundreds of refugees had starved to death.\nPresident Buhari announced in December 2015 that “technically, we have won the war” against Boko Haram. Since then, the group has conducted multiple village raids, suicide bombings, and attacks on military bases. Buhari’s personal bodyguard was arrested for having ties to the Islamic State affiliate, as well, shortly before Buhari’s government proclaimed once again that Boko Haram had been defeated.","url":"https://www.breitbart.com/national-security/2016/10/31/report-nigerian-military-abused-raped-boko-haram-victims/"}
