{"authors":["John Hayward"],"date_download":"2018-10-30 17:53:07","date_modify":"2018-10-30 17:53:07","date_publish":"2015-10-30 04:44:08","description":"The Nigerian military said they conducted a successful operation against the ISIS-aligned terrorists of Boko Haram, rescuing 338 captives.","filename":"data/vaneerConsumption/NigerianMilitaryClaims338BokoHaramCaptivesRescued.json","image_url":"https://media.breitbart.com/media/2015/10/Rescued-Boko-Haram-Captives-Nigerian-Army-AFP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_10_29__1540921987.html","title":"Nigerian Military Claims 338 Boko Haram Captives Rescued","title_page":"Nigerian Military Claims 338 Boko Haram Captives Rescued","title_rss":"NULL","source_domain":"breitbart.com","text":"The Nigerian military said they conducted an extremely successful operation against the ISIS-aligned terrorists of Boko Haram. They reportedly took out two of the terrorist camps in the Sambisa Forest, killing some thirty militants and rescuing 338 hostages, most of them women and children.\n“The rescued persons, which comprised eight males, 138 females and 192 children, have since been evacuated,” said a statement from the Nigerian military related by International Business Times.\nThe Associated Press reports that Nigeria’s Defense Headquarters has posted photos of weapons seized and the bodies of slain insurgents to back up its claims.\nAdditionally, the AP reports four suspects were killed by Nigerian troops before they could carry out a suicide bombing in northwestern Adamawa state, while the Daily Trust relates the Nigerian Air Force’s announcement of air strikes within Sambisa Forest, destroying Boko Haram vehicle workshops, fuel depots, and ammunition dumps.\nA Nigerian Air Force spokesman said that “with these successful strikes on the insurgents, their capabilities have been further degraded to pave the way for the final onslaught by the land forces to meet the Commander-in-Chief, President Mohammadu Buhari’s directives to bring insurgency in the North-East to an end.”\nOne of the main reasons Buhari got to be the Commander-in-Chief is because the previous president, Goodluck Jonathan, was unable to make progress against Boko Haram. It was seen as not only a security failure, but also a symbol of government corruption, as the central government was not eager to expend resources battling the Islamist militants in the hinterlands. Bringing Boko Haram down by the end of the year was one of Buhari’s major campaign promises.\nAssuming the Nigerian military’s reports are accurate – a caveat which, unfortunately, experience suggests is necessary – the war against Boko Haram has been going well of late. Several successful raids have been reported, and the insurgents are now said to have been driven into the Sambisa Forest as their final refuge.\nUnfortunately, as IBT points out, Boko Haram is not down for the count. They killed at least 14 people in an overnight attack in Niger earlier this week. Also, it appears that none of the rescue missions reported by the Nigerian military have liberated the 219 girls famously kidnapped from their school in Chibok in April 2014.","url":"https://www.breitbart.com/national-security/2015/10/29/nigerian-military-claims-338-boko-haram-captives-rescued/"}
