{"authors":["Frances Martel"],"date_download":"2018-10-30 17:52:03","date_modify":"2018-10-30 17:52:03","date_publish":"2017-01-19 03:39:54","description":"The Nigerian Air Force conducted an airstrike on a refugee camp housing Boko Haram victims, killing up to over 100.","filename":"data/vaneerConsumption/NigeriaBombsItsOwnRefugeeCampInsteadofBokoHaramover100Killed.json","image_url":"https://media.breitbart.com/media/2017/01/nigeria-bombs-refugee-camp-reuters.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2017_01_18__1540921923.html","title":"Nigeria Bombs Its Own Refugee Camp Instead of Boko Haram, over 100 Killed","title_page":"Nigeria Bombs Its Own Refugee Camp Instead of Boko Haram, over 100 Killed | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"In what the nation’s president called a “regrettable operational mistake,” the Nigerian Air Force conducted an airstrike on a refugee camp housing Boko Haram victims in northeast Borno state, leaving up to over 100 civilians dead and dozens wounded.\nThe Air Force intended to bomb a Boko Haram strategic outpost, instead hitting a camp full of internally-displaced persons, mostly women and children forced to flee their villages by the Islamic State affiliate’s relentless raids.\nReuters estimates that “at least 76 people” were killed on Tuesday, though Nigerian national newspapers put that number at over 100. Reuters cites Medecins Sans Frontieres (MSF) as saying that 120 others were wounded, some seriously and many still trapped in the refugee camp with minimal medical care.\nThe Nigerian newspaper Vanguard puts the number of injured at over 100, citing a government source who said the bombing was part of “mop-up operations” meant to eradicate a small cluster of Boko Haram terrorists.\nVanguard has also published the official version of events from Major-General Lucky Irabor, the Chief of Army Staff:\nThis morning (yesterday), we received reports about gathering of Boko Haram terrorists somewhere in Kala Balge Local Government area of Borno State. We got a coordinate and I directed that the air should go to address the problem. Unfortunately, the strike was conducted but it turned out that the locals somewhere in Rann were affected.\nMaj. Gen. Irabor noted that some of those killed and wounded were also members of international aid groups like MSF and the International Red Cross. These groups have estimated that “at least 90” wounded individuals are trapped in the camp and neighboring Rann village, according to the Associated Press, and are demanding the Nigerian government provide transportation to well-equipped medical facilities.\nThe government has begun issuing official apologies for the incident. President Muhammadu Buhari called the incident a “regrettable operational mistake” in his apology. His information minister, meanwhile, called the bombing “not a true reflection of the level of professionalism” of the military.\nAbba Kyari, Buhari’s chief of staff, said in a statement, “this kind of incident happens occasionally in war.”\n”The Nigerian Air Force (NAF) is saddened by today’s accidental air strike by its fighter jet at Rann in Kala Balge area of Borno State in which some innocent lives were lost,” the air force said in a statement.\nThe Nigerian Senate called for the military to cease bombing civilians. “We urge the military, especially the air force; to as much as possible ensure that this does not happen again,” Deputy Senate President Ike Ekeremadu said, thanking the nation’s “gallant soldiers” for their service.\nWhile multiple government officials have echoed each other in referring to the airstrike as an anomaly, the Nigerian military has long struggled with disciplinary and execution issues. Thousands of Nigerian soldiers have refused to fight Boko Haram, fearing their own deaths and protesting that they are not sufficiently armed to successfully complete the orders handed to them.\nSoldiers have also been accused of gross misconduct with Boko Haram victims. In October, Human Rights Watch accused Nigerian soldiers of raping women and girls trapped in the refugee camp. In some cases, girls and women protested that they had been drugged and raped; in others, the victims said they consented to sexual relations after being romanced and, upon finding out they were pregnant, the soldiers would disappear. Human Rights Watch compiled the testimonies of 43 female members of the camp who experienced “sexual abuse, including rape, and exploitation.”\nThe Nigerian government has repeatedly claimed that Boko Haram, once the deadliest wing of the deadliest terrorist group in the world, has been conclusively defeated. Buhari announced in December 2015 that “technically, we have won the war” on Boko Haram. In January 2016, after a Boko Haram attack proved this to be a suspect claim, Irabor’s predecessor Lt. General Tukur Buratai said, “the terrorists have been defeated; these criminals may rear their ugly heads through other means.”\nBoko Haram continued to attack, and the Nigerian government continued to wave off their existence. “We have come to the point that we can beat our chest and decisively say we have dealt with Boko Haram,” military spokesman Col. Sani Usman said in July 2016.\nFollowing a bombing at the University of Maiduguri, in the capital of Borno state, this week, the Nigerian government’s ruling party issued a statement calling the attack “another confirmation of the group’s desperation.”","url":"https://www.breitbart.com/national-security/2017/01/18/nigeria-mistakenly-bombs-refugee-camp-100-killed/"}
