{"authors":[],"date_download":"2018-10-23 01:23:00","date_modify":"2018-10-23 01:23:00","date_publish":"2017-03-10 09:28:11","description":"Nigeria's next presidential and parliamentary elections will be held in February 2019, the Independent National Electoral Commission (INEC) has...","filename":"data/vaneerConsumption/NigeriafixespresidentialelectionsforFebruary2019.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/09/wire-195085-1489138092-408_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300520_Nigeria-fixes-presidential-elections-February-2019_1540257780.html","title":"Nigeria fixes presidential elections for February 2019","title_page":"Nigeria fixes presidential elections for February 2019 | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"The last elections were in March 2015 when opposition candidate Muhammadu Buhari was elected president\nNigeria's next presidential and parliamentary elections will be held in February 2019, the Independent National Electoral Commission (INEC) has announced.\nINEC said on Thursday the early release of the election timetable was \"to allow for proper planning by the commission, political parties, security agencies, candidates and all stakeholders\".\nPresidential and national assembly elections will be held on Saturday, February 16, 2019, while regional and local elections to elect new governors and local assembly members will be held two weeks later on Saturday, March 2, 2019.\nNigeria's constitution stipulates that elections must be held in the closing months of the president's term, within a period not earlier than 150 days and not later than 30 days before it officially ends.\nThe last elections in March 2015 saw Muhammadu Buhari of the All Progressives Congress defeat sitting president Goodluck Jonathan of the Peoples Democratic Party.\nIt was the first time in Nigerian political history that an opposition candidate had won at the ballot box against an incumbent head of state.\nBuhari took office on May 29, 2015.\nThe vote was initially postponed from February 14, 2015 as the government said the military could not provide security at polling stations because of operations against Boko Haram insurgents.\nThe election passed off broadly without a hitch, despite a history of widespread voter fraud and election-linked violence that left hundreds dead across the country in previous polls.","url":"https://www.dailymail.co.uk/wires/afp/article-4300520/Nigeria-fixes-presidential-elections-February-2019.html"}
