{"authors":[],"date_download":"2018-10-22 21:29:27","date_modify":"2018-10-22 21:29:27","date_publish":"2014-05-07 14:47:51","description":"A number of U.S. military officials, in Nigeria since before the kidnapping of more than 200 girls, have been consulting with the Nigerian government.","filename":"data/vaneerConsumption/NigeriaLeaningOnUSMilitaryAdvisersinSearchforGirls.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_nigeria-leaning-u-s-military-advisers-search-girls-n99276_1540243767.html","title":"Nigeria Leaning On U.S. Military Advisers in Search for Girls","title_page":"Nigeria Leaning On U.S. Military Advisers in Search for Girls","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nA number of U.S. military officials, on the ground in Nigeria since well before the kidnapping of more than 200 schoolgirls, have been consulting with the Nigerian government to advise the Nigerians on possible courses of action.\nThey’re part of the military’s permanent Office of Security Cooperation, found in most larger nations. The U.S. military’s Office of Security Cooperation in Nigeria is the largest in the world.\nSenior defense officials say those military officials have already been “consulting” with the Nigerian government in an effort to advise the Nigerians on where to proceed regarding the kidnapped girls, missing since April 15. Defense officials also say one permanent resident FBI agent in Nigeria has been consulting with Nigerian law enforcement.\nThe Pentagon is preparing to send additional military to Nigeria as a formal “assessment team” in an effort to determine what, if anything, U.S. military forces could do. According to defense officials, the military has begun the usual “prudent planning” but “no decisions have been made” to deploy any combat forces in an effort to rescue the girls.\nOne senior official told NBC News while no formal decision has been made, it’s practically a certainty that the U.S. military will deploy multiple surveillance drones from AFRICOM in Europe to take part in overhead search operations and intelligence gathering.\n— Courtney Kube and Jim Miklaszewski","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/nigeria-leaning-u-s-military-advisers-search-girls-n99276"}
