{"authors":[],"date_download":"2018-10-23 00:54:04","date_modify":"2018-10-23 00:54:04","date_publish":"2017-03-10 08:13:10","description":"Nigeria's President Muhammadu Buhari on Friday said he will not resume power immediately and instead leave his deputy in charge after returning from nearly...","filename":"data/vaneerConsumption/NigeriasBuharireturnsbutVPwillstayincharge.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/11/wire-195749-1489146511-112_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4300336_Buhari-returns-Nigeria-London-treatment_1540256044.html","title":"Nigeria's Buhari returns but VP will stay in charge","title_page":"Nigeria's Buhari returns but VP will stay in charge | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Nigeria's Mohammadu Buhari arrived back home after nearly two months in London for \"routine medical checks\", prompting rumours he was seriously ill\nNigeria's President Muhammadu Buhari on Friday said he will not resume power immediately and instead leave his deputy in charge after returning from nearly two months' medical leave in Britain.\nA Nigerian Air Force jet carrying the 74-year-old landed at the airport in the northern city of Kaduna at about 7:40 am (0640 GMT). He was then flown by helicopter to Abuja.\nIn the capital, the head of state, looking gaunt in a billowing black kaftan, stepped off the helicopter and walked across the tarmac to be greeted by Vice President Yemi Osinbajo.\nHe also met security chiefs and senior government officials before being driven away in a black official car to meet his cabinet and officials of his ruling All Progressives Congress party.\nAt the meeting, he did not give any indication of what illness he was suffering from but said \"I have received, I think, the best of treatment I could receive.\n\"I couldn't recall being so sick since I was a young man,\" he added, referring to \"blood transfusions, going to the laboratories and so on and so forth\".\nBut he said he was \"pleased to be back\", although he disclosed that he may need \"further follow-up within some weeks\".\nBuhari's return from London was announced on Thursday evening and he said he \"came back towards the weekend, so that the vice president will continue and I will continue to rest\".\nNo timeline was given for how long Osinbajo, who was officially conferred powers as acting president, would be in charge.\nFormer military ruler Buhari flew to London on January 19, officially on holiday and to have what his office said were \"routine medical check-ups\" for an undisclosed condition.\nBut while he was away, aides had to counter persistent rumours online that he was seriously ill or even dead, despite photographs showing him meeting senior Nigerian politicians.\nEarlier Friday he was shown in photographs looking painfully thin at a meeting with the most senior cleric in the Anglican communion, Archbishop of Canterbury Justin Welby.\nBuhari had previously travelled to London in June last year to receive treatment for what was described as a persistent inner ear infection.\nHe left for London again in January but on the eve of his expected return on February 5, his office announced he had to extend his stay to receive medical test results.\nThe health of Nigeria's president has become a sensitive issue following the 2010 death of president Umaru Musa Yar'Adua from a long-standing, but previously undisclosed, kidney complaint.\nYar'Adua's initial illness and treatment in hospital abroad triggered months of political uncertainty. His deputy, Goodluck Jonathan, took over on Yar'Adua's death.","url":"https://www.dailymail.co.uk/wires/afp/article-4300336/Buhari-returns-Nigeria-London-treatment.html"}
