{"authors":["Frances Martel"],"date_download":"2018-10-30 17:54:06","date_modify":"2018-10-30 17:54:06","date_publish":"2015-07-07 04:00:45","description":"An advisor to Nigerian President Muhammadu Buhari told BBC the government \"can't rule out\" the possibility of negotiating with Boko Haram.","filename":"data/vaneerConsumption/NigerianGovernmentSpokesmanCantRuleOutNegotiatingwithBokoHaram.json","image_url":"https://media.breitbart.com/media/2015/06/isis-boko-haram-vid-screenshot.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_06__1540922046.html","title":"Nigerian Government Spokesman: 'Can't Rule Out' Negotiating with Boko Haram","title_page":"Nigerian Government Spokesman: 'Can't Rule Out' Negotiating with Boko Haram | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"A special advisor to Nigerian President Muhammadu Buhari told BBC over the weekend that the government “can’t rule out” the possibility of negotiating with jihadist terror group Boko Haram, following a string of bombings and village raids in the northeast of the country.\nIn an interview last week with BBC, advisor Femi Adesina refused to categorically oppose negotiations with Boko Haram leadership. Asked if he could “foresee a situation” where the negotiating table could have a role to play in ending violence in Nigeria, Adesina said, “If they were willing, why not?” He noted that attempts to negotiate with Boko Haram “didn’t work” before but that “you can’t rule that out.”\nAdesina reaffirmed in the interview that it “remains a priority” to President Buhari to “deal with the group. Buhari won Nigeria’s presidential election in May largely as a result of promising to deal with Boko Haram firmly and eradicate the group. His first act as president was to move the military’s headquarters out of the capital, Abuja, and into Maiduguri, the capital of Borno state and the city in which Boko Haram was established.\nThe Nigerian publication Naij contends that these statements constitute a “U-Turn” on Buhari administration policy, as Buhari had promised in February, before being elected, that he would eradicate the group entirely. The Nigerian government has, however, previously attempted to work with Buhari in negotiations. In 2012, an underling of Boko Haram leader Abubakar Shekau nominated Buhari as a “trusted” government official they felt they could work with to negotiate territorial claims with the Nigerian government. Those talks did not materialize, however, and Buhari became ever more vocal against the group. By 2014, Buhari had escaped an assassination attempt by Boko Haram terrorists.\nThat year, President Goodluck Jonathan attempted once again to establish talks with the terrorist group following the abduction of more than 300 schoolgirls from the town of Chibok in northeastern Borno state. While government officials then claimed the talks would result in “concrete and positive” solutions, most of the kidnapped girls remain missing, and the group has expanded in the past year.\nSince that attempt at negotiating, it is rumored that Boko Haram leadership has changed. For one, Shekau has not appeared in Boko Haram propaganda in months. The group has also rebranded after pledging allegiance to Islamic State terrorist leader Abu Bakr al-Baghdadi, referring to itself now as Islamic State West African Province, or ISWAP. What such a leadership change would mean for any attempts to bring Boko Haram to the negotiating table remains unclear.\nBoko Haram has expanded its offensive against both Nigerian and allied states like Chad and Niger in the past month. Most recently, on Sunday, the group is believed to have orchestrated twin bombings in the town of Jos, also in the northeast. Last week, at least 150 people were killed in a raid of multiple villages that left a string of residences razed to the ground in the same region.","url":"https://www.breitbart.com/national-security/2015/07/06/nigerian-government-spokesman-cant-rule-out-negotiating-with-boko-haram/"}
