{"authors":[],"date_download":"2018-10-22 21:32:04","date_modify":"2018-10-22 21:32:04","date_publish":"2014-05-07 15:05:17","description":"\"You can’t fight in the Sambisa using, let’s say, drones or helicopters.\" one expert says. \"You need to put troops on the ground.\"","filename":"data/vaneerConsumption/NigerianGirlsMayBeHeldinCountrysEvilForest.json","image_url":"https://media1.s-nbcnews.com/j/newscms/2014_19/426546/140507-boko-haram-mn-1220_a9479dffc2a6fbbb317a2855f530f9b0.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_nigerian-girls-may-be-held-countrys-evil-forest-n99306_1540243924.html","title":"Nigerian Girls May Be Held in Country's 'Evil Forest'","title_page":"Nigerian Girls May Be Held in Country's 'Evil Forest'","title_rss":"NULL","source_domain":"nbcnews.com","text":"The Sambisa forest itself covers 23,000 square miles — eight times the size of Yellowstone National Park or roughly equal to the area of West Virginia — and is nestled in the northeast of Nigeria, near where it touches Cameroon, Niger and Chad.\nThe members of Boko Haram, who are violently opposed to Western education, and many of whom have been expelled from more urban sections of the country, live there in small, makeshift camps, in tents and huts.\nThey know the terrain well, better than the Nigerian military, and can melt easily into surrounding local populations that they have terrorized before, the professor said by phone Wednesday.\nAnyone approaching is likely to be seen, he said, and word would quickly spread to other camps, said Mohammed, who teaches history at the Modibbo Adama University of Technology in Nigeria and has interviewed former Boko Haram captives.\nThe girls were abducted April 15 from their secondary school in northeast Nigeria. More than 50 managed to escape, but more than 270 are believed to be held by the Boko Haram, who have promised to sell them into slavery.\nThe United States said Tuesday that it is sending technical experts and law enforcement who specialize in intelligence and hostage negotiations. The U.S. contingent does not include armed forces.\nU.S. military were working in Nigeria well before the kidnappings, and are “consulting” with the Nigerians on possible action regarding the girls, U.S. military officials told NBC News.\nThe officials said that the U.S. military is planning, but that “no decisions have been made” to deploy combat forces to rescue the girls.\nIt is a near-certainty that the U.S. will deploy surveillance drones to take part in overhead intelligence-gathering, one senior official said.\nThe forest was meant by British colonials to be a game reserve. Today about 200 square miles, roughly the size of Lake Tahoe, has been set off for that purpose.\nIt is a refuge for elephants and the last stronghold of the ostrich in Nigeria. It is also home to giant crustaceans and patches of thick, thorny bushes.\nParents of the schoolgirls have said they have little confidence in the government of President Goodluck Jonathan. The Nigerian military has so far been unwilling to accept casualties and use ground troops to clear the forest of militants, Mohammed said.\nA week after the abductions, some of the parents trekked into the forest, according to an account in the British newspaper The Guardian.\nThey armed themselves with machetes and knives but turned back after they were warned by locals in the forecast that they would be taken out by the sophisticated guns of the militants.\nOne of the young women who escaped abduction by jumping off the back of a truck told The Guardian about entering the forest.\n“Each time we got to a village, they stopped and started shooting people and burning their houses,” said the woman, Godiya Usman, 18.\n“When we got to another village, they started shooting. I jumped down and I was expecting my friends to jump too, but they didn’t. I just started crying and running into the bush.”\nPolly DeFrank and Jim Miklaszewski of NBC News contributed to this report. The Associated Press also contributed.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/nigerian-girls-may-be-held-countrys-evil-forest-n99306"}
