{"authors":["Thomas D. Williams"],"date_download":"2018-10-30 17:52:57","date_modify":"2018-10-30 17:52:57","date_publish":"2015-12-24 09:42:30","description":"Nigerian President Muhammadu Buhari says that he has met the December deadline set for defeating the jihadi terror group Boko Haram.","filename":"data/vaneerConsumption/NigerianPresidentWeHaveWontheWarAgainstBokoHaram.json","image_url":"https://media.breitbart.com/media/2015/09/Nigerian-President-Muhammadu-Buhari-AP.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_12_24__1540921977.html","title":"Nigerian President: ‘We Have Won the War’ Against Boko Haram","title_page":"Nigerian President: ‘We Have Won the War’ Against Boko Haram","title_rss":"NULL","source_domain":"breitbart.com","text":"Nigerian President Muhammadu Buhari (pictured) says that he has met the December deadline set for defeating the jihadi terror group Boko Haram and that the Islamists are no longer capable of mounting a serious attack against the Nigerian military or population centers.\n“I think, technically, we have won the war,” he said. “Boko Haram is an organized fighting force, I assure you, [but] we have dealt with them.”\nContemporaneous to his presentation of the 2016 national budget, Buhari said that Boko Haram can no longer marshal forces to attack towns or military installations as they did before, and that the Nigerian military has been reorganized and reequipped.\nIronically, on Wednesday Boko Haram militants launched four attacks on villages in Niger, Chad and Cameroon, killing at least seven people including two soldiers and three civilians in Niger’s southern border town of Abadam.\nOn the same day, Nigeria’s Minister of Information and Culture, Alhaji Lai Mohammed, reiterated the President’s message that the Nigerian military had met the December deadline promised by Buhari on assuming office.\n“Today, I can report that the war against Boko Haram is largely won,” Mohammed said to a group of journalists in Lagos.\n“I can confidently say this because just recently, I led a group of 33 journalists from both the local and international media to the hot bed of the insurgency, that is, Maiduguri, Kondugua, Kaoure and Bama,” he said.\n“Today, I can report to you that the entire 70 plus kilometers stretch from Maiduguri to Bama and all the way to Banki which leads to Cameroun and the Central African Republic are in the hands of our gallant troops,” he added.\nThe minister said that the Nigerian army had so degraded Boko Haram’s capabilities that the terrorists can no longer hold on to any territory. At the same time, he underscored differences between fighting a terror group and conventional warfare, since terrorists can continue launching isolated attacks even when substantially beaten.\n“Unlike a war between two armies, an insurgency never ends with arms victory,” he said. “Even in countries like Colombia where insurgency was supposed to have ended decades ago, attacks like this still happen.”\nMohammed noted that the jihadists were employing a new style of terror attacks on soft targets such as schools, parking lots and gathering places, looking to instill fear by killing civilians, mostly women and children.\nThe Boko Haram group, which pledged its allegiance to the Islamic State earlier this year, has killed tens of thousands of people during its six-year insurgency displacing more than 2 million people in the process.\nIn June, an 8,700-member regional military coalition including forces from Nigeria, Chad, Niger, Cameroon and Benin was formed to combat the group, and the United States has supplied some intelligence and tactical assistance as well.\nFollow Thomas D. Williams on Twitter @tdwilliamsrome","url":"https://www.breitbart.com/national-security/2015/12/24/nigerian-president-won-war-boko-haram/"}
