{"authors":[],"date_download":"2018-10-23 04:06:38","date_modify":"2018-10-23 04:06:38","date_publish":"2017-03-10 14:08:10","description":"Niger has begun the trials behind closed doors of about 1,000 suspected fighters from the Boko Haram jihadist movement, officials said Friday.Chief...","filename":"data/vaneerConsumption/Nigerputs1000BokoHaramfightersontrial.json","image_url":"https://i.dailymail.co.uk/1/2017/03/10/14/wire-196311-1489154894-956_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-4301414_Niger-puts-1-000-Boko-Haram-fighters-trial_1540267598.html","title":"Niger puts 1,000 'Boko Haram fighters' on trial","title_page":"Niger puts 1,000 'Boko Haram fighters' on trial | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Guard duty at Niger's top security Koutoukale prison, where troops last October repelled a jihadist bid to free detainees\nNiger has begun the trials behind closed doors of about 1,000 suspected fighters from the Boko Haram jihadist movement, officials said Friday.\nChief prosecutor Chaibou Samna told AFP that the trials, on charges of terrorist links, had begun on March 2.\nThose facing trial are from several countries including Niger and Mali, Samna said, as well as neighbouring Nigeria where Boko Haram's deadly insurgency began in 2009 before spreading abroad.\nSome of the suspects were \"captured during combat\" in southern Niger across the border from Boko Haram's stronghold in Nigeria, a security source said.\nSamna said the trials will last several months and mostly arise from offences entailing \"not more than 10 years in prison\".\n\"There have already been convictions and a large number of people freed for lack of evidence,\" he added.\n\"The government has provided the means to transport prosecutors to investigate on the ground\" in the Diffa region, close to territory in northeast Nigeria that is the bastion of the armed fundamentalist movement, Samna said.\nThe government announced in December that it would speed up legal proceedings against suspected Boko Haram fighters in prison for more than a year.\nAbout 1,200 people suspected of close ties to the group have been detained awaiting trial since 2015, according to a source in the security forces.\nSome were captured in combat or during identity checks carried out under the state of emergency imposed in the Diffa region on the Nigerian border, the source said.\nBoko Haram carried out its first attacks in Niger on February 6, 2015, but has established no base in the mainly Sunni Muslim nation.\nThe jihadists killed at least 177 civilians in Diffa between February 2015 and September 2016, according to a UN report.\nThe region has also taken in more than 300,000 refugees and displaced people. Thousands of them subsist at the expense of the local population, which is already very poor, and the United Nations has repeatedly asked the international community to step up financial support.","url":"https://www.dailymail.co.uk/wires/afp/article-4301414/Niger-puts-1-000-Boko-Haram-fighters-trial.html"}
