{"authors":["Stephanie Linning For Mailonline"],"date_download":"2018-10-23 00:43:16","date_modify":"2018-10-23 00:43:16","date_publish":"2016-01-11 10:33:18","description":"Nigerian orphan Ofonime Inuk was just 14 when Emmanuel Edet, 61 and his wife, senior nursing sister Antan, 58, lured him away from his home country with the promises of a better life in the UK.","filename":"data/vaneerConsumption/Nigerianmankeptasaslavefor24yearsbyNHSdoctorandhisnursewife.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/10/30071DBE00000578-0-image-a-46_1452507972105.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/news_article-3393596_Man-kept-slave-24-years-NHS-doctor-nurse-wife-lured-Britain-promises-better-life-says-FORGIVES-couple_1540255396.html","title":"Nigerian man kept as a slave for 24 years by NHS doctor and his nurse wife","title_page":"Nigerian man kept as a slave for 24 years by NHS doctor and his nurse wife | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"For more than two decades, Ofonime Inuk was forced to work 17 hours a day in the suburban home of an NHS doctor and his wife.\nThe Nigerian orphan was just 14 when Emmanuel Edet, 61, and his wife, senior nursing sister Antan, lured him away from his home country with the promises of a better life in the UK.\nBut once he set foot in their west London home in December 1989, Mr Inuk, now 40, had his passport taken and soon discovered the couple intended for him to work for nothing.\nVictim: Ofonime Inuk, pictured, was kept as a slave by an NHS doctor and his wife for more than 20 years\nLies: Emmanuel Edet, 61, left, and his wife, senior nursing sister Antan, 58, right, promised him a better life\nCruel: Mr Inuk, now 40, was made to sleep on this thin foam mattress, pictured with his few belongings in a cupboard under the stairs in the couple's west London home. He cleaned the property for up to 17 hours a day\nHe was made to cook and clean the house, eat his meals alone, and help raise the couple's sons as they travelled the country working for a number of NHS trusts.\nAnd at the end of his gruelling 17-hour day Mr Inuk would curl up on a thin foam mattress in the hallway of the property.\nAfter spending decades trapped in servitude, afraid of being cast out on the street with nowhere else to go, Mr Inuk finally sought help from charity Hope For Justice and later reported the Edets.\nBut speaking today Mr Inuk said he forgives the couple, and said he even 'felt a bit sorry for them' when he learned they had been arrested.\nThe couple, who told friends and family that Mr Inuk was their adopted son, were sentenced to six years in prison each after being convicted of cruelty to a child under 16, servitude and assisting unlawful immigration.\nSpeaking about his tormentors, Mr Inuk said: 'They'd been in my life for 24 years, so I kind of felt a bit sorry for them, even though they'd treated me so badly.\n'I'd become almost attached to them because they'd controlled my teen and adult life. 'I'm still angry. I will forgive them – what else can I do? - but I'll never forget them.\nRelentless: A selection of notes written by the Edets that detail the chores Mr Inuk was expected to carry out\nCramped: A piece of foam on which the victim was forced to sleep on in the hallway of the property, in one of many evidence photographs released by the Metropolitan Police following the guilty verdict last November\n'I'm not going to get my life back, it's gone now. Twenty-four years of my life have been wasted.\n'I know I have a lot ahead, but I've missed a lot. It makes me so sad to think about those wasted years, and they just didn't care. They were playing God with my life.'\nHarrow Crown Court heard how Mr Inuk became scared of the couple after realising they would not pay him or send him to school.\nIn a police interview, he said he was known as a 'house boy', adding: 'My role is to stay in the house ... I always do everything in the house, sir … clean, cook, wash car, the gardening, ironing … or maybe like a slave. That's called slavery.'\nBeing watched: A CCTV camera can be seen in the home, which was set up by the victim's tormentors\nWith no official paperwork, no money and nowhere else to go, Mr Inuk said he had no choice but to stay at the Edets' home in Perivale, West London.\n'When they went to work, they'd take the keys and lock all the bedrooms. If I went out, I wouldn't have been able to come back,' he said.\n'I didn't have anywhere else to go. I didn't want to sleep on the streets. It was very tough on my mental state. Nobody was there to help me. I even thought about suicide.'\nMr Inuk also told of how he was banned from entering certain rooms unless he was cleaning them.\n'From the very day I arrived in the UK, they mistreated me,' he said. 'I wrote my family back home, but I asked them not to write back. [The Edets] would go through my stuff and I didn't want to find myself in trouble.\n'They made me do everything in the house. Cook, wash, iron, clean – everything, every day. I didn't count hours. I just worked from when I woke up to when I went to bed.\n'They'd control what I wore because I didn't have any money to buy my own clothes. I didn't have a choice. Whatever they gave me, that's what I wore.\n'A few times for Christmas I was given around £10, but never enough money to go out on my own.'\nIn a stark contrast to his own life, the Edets' biological sons were allowed to go to school, and went on to forge successful careers as a City analyst and a solicitor.\n'Their other sons wouldn't do anything in the house. They went to school, but I wasn't allowed to,' recalled Mr Inuk. '[Mr and Mrs Edet] told me that school and an education wasn't for everyone.\n'I don't have any problem with the sons. It's not their fault. It's their parents' fault.\n'They were so young when I first arrived. I used to talk to them when they were in the house, then when they moved out, I had nobody.'\nThe only glimmer of normality in Mr Inuk's gruelling 17 hour days came from being allowed to listen to the radio as he worked.\nIn December 2013 when the Edets had gone to Nigeria for Christmas, he caught - completely by chance - a BBC Radio Five Live programme in which human trafficking and slavery charity Hope for Justice were mentioned.\nGruelling: Mr Inuk was only allowed to enter rooms in the home when he was cleaning. Pictured, the kitchen\nImmaculate: The Edets forced Mr Inuk to clean their home (pictured, the living room) to very high standards\nPreviously, he had sought help from the police and social services. Without his passport, though, he received little assistance, aside from being told to visit his embassy.\nBut, realising there were others out there who could help him, he set about contacting the charity.\n'After I finished my work, there was nothing else to do but sit in the kitchen and stare at the wall, listening to the radio,' he recalled. 'The radio was my lifeline. It was the only thing they let me have.\n'When I heard the show, I went to the library to contact the charity. The Edets would let me go to the library if they had visitors because the wanted to pretend I was working or going to college.'\nAfter Hope for Justice heard about Mr Inuk's grave situation, they convinced him to speak to the Metropolitan police.\nThey made me do everything in the house. Cook, wash, iron, clean – everything, every day. I didn't count hours. I just worked from when I woke up to when I went to bed Ofonime Inuk\nMr and Mrs Edet were then arrested in March 2014.\nDuring their trial, Harrow Crown Court heard that the sum Mr Inuk was owed for his years of work ran well into six figures, and that their horrendous treatment had left him 'conditioned' to his plight.\nSentencing the couple to six years each for cruelty to a child under 16, servitude and assisting unlawful immigration, Judge Graham Arran said: 'He was conditioned to the extent that that he did not ask for what he wanted because he expected his request to be refused.\n'He was paid the occasional pocket money of perhaps £10. He claims that that was only at Easter and Christmas and occasionally visitors would give him larger sums.\n'He most certainly was not paid for the work that he was performing for you.\n'The most serious aspect of your behaviour towards him was that it went on for an exceptionally long period of time, robbing him of the opportunity of leading a normal life.\n'He suffered as a result of that treatment and has found it difficult to adjust (to) a normal life.'\nFollowing the Edets' imprisonment, Mr Inuk is attempting to piece his life back together.\nNow working, he has left London, but does not wish to reveal his location.\nTrapped: Mr Inuk was too afraid to leave the couple's four-bedroom home in west London, pictured\nHe also soon hopes to visit his family, who has has not seen in more than 20 years, back home in Nigeria.\n'I'm still in touch with my family back home. They're so happy all this is over,' he said.\n'I haven't seen them since I came to the UK, but I'm hoping to see them in maybe two years time. I want to get myself together first.\n'I have a lot of plans now. I want to go to university but I'm not sure what I'll study. I'm keeping my options open.\n'Now, I pay my own rent. I'm not living on government help. I work and pay my taxes.\n'It's been hard to adjust. I'm used to being on my own, so I find it difficult to have close friends. I tend to spend a lot of time inside my house. I don't know why.\n'I'm responsible for myself now, where before I was always told what to do.\n'I haven't told many people in my new life about what's happened. I want to leave it behind me and move on.'\nWhen asked what he would say to other slavery victims out there who may be suffering in silence, Mr Inuk said: 'Report it. There are people to help you.\n'I want to thank Hope for Justice as well as my lawyer Caroline Carberry and investigating officers Steve Taylor and Andy Nolan of the Metropolitan police.\n'I wish I had known about Hope for Justice years ago. Maybe then I'd have been out of the house a long time ago.\n'It was just by luck I was listening to the radio that morning.'","url":"https://www.dailymail.co.uk/news/article-3393596/Man-kept-slave-24-years-NHS-doctor-nurse-wife-lured-Britain-promises-better-life-says-FORGIVES-couple.html"}
