{"authors":["Frances Martel"],"date_download":"2018-10-30 17:54:04","date_modify":"2018-10-30 17:54:04","date_publish":"2015-07-14 14:20:22","description":"Nigerian President Muhammadu Buhari has fired numerous members of his staff in the wake of a surge in Boko Haram attacks.","filename":"data/vaneerConsumption/NigerianPresidentFiresMilitaryChiefsAfterWaveofBokoHaramAttacks.json","image_url":"https://media.breitbart.com/media/2015/06/Buhari-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_14__1540922044.html","title":"Nigerian President Fires Military Chiefs After Wave of Boko Haram Attacks","title_page":"Nigerian President Fires Military Chiefs After Wave of Boko Haram Attacks | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Nigerian President Muhammadu Buhari has fired his National Security adviser, chief of defense, and the heads of every branch of the Nigerian armed forces, following a surge in Boko Haram attacks that has left more than 600 people dead since Buhari took office in May.\nAll the service chiefs had been appointed by his predecessor, Goodluck Jonathan, and many experts have told Nigerian media that the move was not just expected, but “long overdue.” All the heads of national security were fired Monday and immediately replaced with interim staff. The heads of the armed forces include the chiefs of the Army, Navy, and Air Force. It is the first major military restructuring under Buhari’s tenure following his Inauguration Day promise to relocate the nation’s military headquarters out of southern Abuja, the nation’s capital, and to Maiduguri, birthplace of Boko Haram in Nigeria’s mostly Muslim north.\nNigeria’s Vanguard newspaper identifies all the new heads of the military and national security, noting that a statement from Buhari’s spokesman, Femi Adesina, states that “President Buhari thanks the outgoing service chiefs and National Security Adviser for their services to the nation and wishes them well in their future endeavours.” Experts tell Vanguard the major overhaul is positive and was widely expected.\n“In fact, it has taken too long,” Itse Sagay, a constitutional lawyer, told Vanguard, adding:\nThese were all Jonathan’s men, loyal to Jonathan, who were ready to sabotage the election in order to allow Jonathan re-plan. These are all anti-Buhari and anti-APC people. They should have been sacked long ago. Their sack was overdue, they deserved to be sacked.\nBuhari made clear in his public statements that the appointees were not his friends and did not arrive at their new positions through connections, so much so that he admitted, “I don’t know any of you.” He confirmed, “Your records gave you the job.”\nBoko Haram, newly renamed the Islamic State West Africa Province after pledging allegiance to ISIS head terrorist Abu Bakr al-Baghdadi, has increased the frequency and intensity of attacks in the past two months not just in Nigeria, but in neighboring Niger and Chad. On Tuesday, Nigerian authorities alerted the press to their most recent crime: a rampage through four northern villages, leaving 43 people dead, many with their throats slit open. “They opened fire on residents and in some cases they used knives to slaughter their victims,” said Sheriff Kulo of Kilwa village, one of the four under attack Monday night. Kulo’s survival after fleeing to Maiduguri ensured that the state would be aware of the attack.\nIn addition to the gun and knife killings, a Boko Haram terrorist is believed to have masterminded the bombing of a military checkpoint near Maiduguri this week, killing at least one bystander.\nNigerians, who voted Buhari in, largely as a rebuke of President Jonathan’s inability to destroy the jihadist sect, are calling for stronger action to eradicate Boko Haram. A poll taken by Nigeria’s News24 says that 78 percent of voters want military checkpoints to resurface throughout the country, despite their proven inability to be fully effective when confronted with a suicide bomber. Buhari had previously ordered all military checkpoints taken down, left to local police.\nThe escalation of attacks has led to the death of more than 600 people during Buhari’s tenure and coincides with a message from Boko Haram’s shadowy leadership that they are willing to negotiate with Buhari. Namely, a Boko Haram statement claimed they would be interested in trading some of the more-than-200 girls kidnapped from Chibok, Borno, in April 2014 for hundreds of imprisoned terrorists they could use to bolster their numbers.","url":"https://www.breitbart.com/national-security/2015/07/14/nigeria-president-fires-all-military-chiefs-after-wave-of-boko-haram-attacks/"}
