{"authors":[],"date_download":"2018-10-22 22:20:14","date_modify":"2018-10-22 22:20:14","date_publish":"2014-05-09 20:49:12","description":"Amnesty International says Nigerian security forces had more than four hours warning about the raid in which nearly 300 schoolgirls were abducted.","filename":"data/vaneerConsumption/NigerianMilitaryFailedtoActonWarningsofBokoHaramRaidReport.json","image_url":"https://nodeassets.nbcnews.com/cdnassets/projects/socialshareimages-bento/og-nbcnews1200x630.png","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_nigerian-military-failed-act-warnings-boko-haram-raid-report-n101836_1540246814.html","title":"Nigerian Military Failed to Act on Warnings of Boko Haram Raid: Report","title_page":"Nigerian Military Failed to Act on Warnings of Boko Haram Raid: Report","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nThe Nigerian military failed to act on warnings about an impending raid by Boko Haram on the school where nearly 300 schoolgirls were abducted more than three weeks ago, according to a report by Amnesty International issued Friday.\nThe human rights organization said it conducted interviews with reliable sources and concluded that Nigerian security forces had more than four hours advance warning about the extremists' attack on the state-run boarding school in Chibok on April 14 -- but didn't attempt to stop it.\nAmnesty quoted two senior officers in Nigeria’s armed forces as saying the military was aware of the planned attack even prior to calls received from local officials. One officer said the commander was unable to mobilize reinforcements, according to the report.\n“It amounts to a gross dereliction of Nigeria’s duty to protect civilians, who remain sitting ducks for such attacks,\" said Netsanet Belay, Amnesty International’s Africa director for research and advocacy.\nBoko Haram militants, who want to impose Islamic Shariah law on Nigeria, abducted the girls from the boarding school in the northeastern town of Chibok. Some of them managed to escape.\nThe U.N. Security Council Friday condemned the kidnappings and violence and expressed concern at statements made by the leader of Boko Haram, who threatened to sell the girls as slaves.\nPublic demonstrations in support of the missing girls have been staged across the world, and a social media campaign dubbed #BringBackOurGirls has been growing online, with prominent politicians and celebrities joining in.\nThe girls remain in captivity in an unknown location. Some are said to have been taken across the country's porous borders. U.S. and British military advisers arrived in Nigeria Friday to assist local forces in their search.\nSpeaking at the World Economic Forum being hosted in the Nigerian capital Abuja on Thursday, Nigeria's President Goodluck Jonathan pledged to find the girls and thanked foreign nations for their support.\n\"By God's grace we will conquer the terrorists,\" he told the audience. “I believe that the kidnap of these girls will be the beginning of the end of terror in Nigeria.”\nAmnesty International’s research indicates that at least 2,000 people have been killed in the conflict in Nigeria this year alone.\nThe Associated Press contributed to this report.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/nigerian-military-failed-act-warnings-boko-haram-raid-report-n101836"}
