{"authors":["Frances Martel"],"date_download":"2018-10-30 17:53:25","date_modify":"2018-10-30 17:53:25","date_publish":"2015-07-23 14:57:23","description":"Nigerian President Muhammadu Buhari accused the United States of unintentionally \"aiding and abetting\" Boko Haram.","filename":"data/vaneerConsumption/NigerianPresidentUSHumanRightsLawAidedandAbettedBokoHaram.json","image_url":"https://media.breitbart.com/media/2015/06/Buhari-afp.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/national-security_2015_07_23__1540922005.html","title":"Nigerian President: US Human Rights Law 'Aided and Abetted' Boko Haram","title_page":"Nigerian President: US Human Rights Law 'Aided and Abetted' Boko Haram | Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"Speaking at the United States Institute for Peace during his trip to Washington, D.C., this week, Nigerian President Muhammadu Buhari accused the United States of unintentionally “aiding and abetting” Boko Haram by denying weapons support to the Nigerian military following accusations of human rights violations.\nBuhari, who defeated then-incumbent Goodluck Jonathan in May to become the first Nigerian leader in history to come to power out of a peaceful democratic transition, is in Washington this week to meet with President Barack Obama and rally international support for Nigeria’s war on the Islamic State-affiliated Boko Haram terrorist group.\nIn his speech Wednesday, Buhari claimed an erroneous application of the Leahy Law–a U.S. law that prevents military funding from going to groups with dubious human rights backgrounds–was unwittingly helping Boko Haram expand its control over Nigerian territory.\n“Regrettably, the blanket application of the Leahy Law by the United States on the grounds of unproven allegations of human rights violations levelled against our forces has denied us access to appropriate strategic weapons to prosecute the war against the insurgents,” he stated, adding:\nUnwittingly, and I dare say, unintentionally, the application of the Leahy law amendment by the US Government has aided and abetted the Boko Haram terrorist group in the prosecution of its extremist ideology and hate, the indiscriminate killings and maiming of civilians, in raping of women and girls, and in their other heinous crimes.\nBuhari noted that he did not believe this was “the spirit of the Leahy Laws” nor the intention of the American people.\nA day before Buhari’s speech, newly-appointed Nigerian Army Chief Tukur Buratai lost his home in northeastern Borno state after Boko Haram jihadists stormed his village and burned down his house. Buratai, reportedly, was not in his home at the time. Military chiefs, under Buhari’s orders, are now operating out of Borno state rather than the old military headquarters in the Nigerian capital, Abuja, until Boko Haram is definitvely taken down.\nThe United States limited its military support to Nigeria following a report by Amnesty International alleging that the Nigerian military has been either responsible or unable to prevent at least 8,000 deaths in the campaign against Boko Haram, and that in the process, they have killed and tortured thousands of civilians. The Nigerian government under President Jonathan attacked the report as “biased” and generally dismissed it; the Buhari administration has promised to review it, but nonetheless dismissed it as a reason not to provide funding against Boko Haram.\nIn the early rise of Boko Haram, the United States appeared somewhat reluctant to help Nigeria, even warning the military to exercise “restraint” in 2013. Since then, American troops have traveled to Nigeria to aid in the training of soldiers from both Nigeria and Chad, which has joined a coalition that also includes Niger, Benin, and Cameroon, to eradicate the terrorist group.","url":"https://www.breitbart.com/national-security/2015/07/23/nigerian-president-us-human-rights-law-aided-and-abetted-boko-haram/"}
