{"authors":[],"date_download":"2018-10-22 21:50:16","date_modify":"2018-10-22 21:50:16","date_publish":"2014-05-08 10:32:08","description":"“The kidnap of these girls will be the beginning of the end of terror in Nigeria,\" president says.","filename":"data/vaneerConsumption/NigeriaWillConquerBokoHaramGoodluckJonathanSays.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/428376/140508-boko-haram-jsw-734a_4d40a50cfd7e889b0b4bc877917f9305.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_nigeria-will-conquer-boko-haram-goodluck-jonathan-says-n100116_1540245016.html","title":"Nigeria Will 'Conquer' Boko Haram, Goodluck Jonathan Says","title_page":"Nigeria Will 'Conquer' Boko Haram, Goodluck Jonathan Says","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNigeria’s president vowed Thursday to defeat terrorism in his country, suggesting that the kidnapping of nearly 300 schoolgirls marked a turning point in his country's battle against Islamist extremists.\nIn an address to the World Economic Forum in Abuja, President Goodluck Jonathan also thanked the U.S., U.K. and China for their pledges of assistance to track down the girls, whose abductions have sparked international outrage.\n\"By God's grace we will conquer the terrorists,\" he told the audience. “I believe that the kidnap of these girls will be the beginning of the end of terror in Nigeria.”\nBoko Haram, an extremist Islamist group, has claimed responsibility for kidnapping the girls weeks ago from their school in the northeastern village of Chibok.\nThe group - whose name, roughly translated, means “Western education is sinful” - has been waging a bloody campaign in northeast Nigeria for years, destroying churches, kidnapping scores of people and burning down schools, sometimes with the students locked inside.\nBoko Haram also is believed to be behind an attack earlier this week in northeastern Nigeria's market town of Gamburu which left at least 300 people dead.\nThe schoolgirls' kidnappings - and a video featuring the terror organization's leader threatening to sell the girls \"in the market\" - have sparked protests worldwide over the Nigerian government's perceived inaction and failure to find the girls.\nHillary Clinton said the Nigerian government has been \"somewhat derelict\" in protecting its citizens, while figures including Michelle Obama and Malala Yousoufzai have lent their voices to an international social media campaign to #BringBackOurGirls.\nJonathan said Thursday he appreciated the assistance to come from the U.S., U.K., France and China in the search for the girls.\nHe also thanked delegates the World Economic Forum for not pulling out of the event.\n“If you had refused to come because of fear the terrorists would have ... committed more havoc,” he said. “Your coming here to support us morally is a major blow on the terrorists.”","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/nigeria-will-conquer-boko-haram-goodluck-jonathan-says-n100116"}
