{"authors":[],"date_download":"2018-10-22 22:26:40","date_modify":"2018-10-22 22:26:40","date_publish":"2014-05-10 16:37:22","description":"Nigerian residents say killings and terror have not ceased despite international rescue efforts.","filename":"data/vaneerConsumption/NigerianExtremistsBlowUpBridgeinDeadlyAttack.json","image_url":"https://media2.s-nbcnews.com/j/newscms/2014_19/432406/140509-nigeria-schoolgirls-mn-1320_51e6de1c51dcf6b2b86cb93ca109cb17.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_nigerian-extremists-blow-bridge-deadly-attack-n102166_1540247200.html","title":"Nigerian Extremists Blow Up Bridge in Deadly Attack","title_page":"Nigerian Extremists Blow Up Bridge in Deadly Attack","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nYOLA, Nigeria — Islamic extremists blew up a bridge, killed an unknown number of people and abducted the wife and two children of a retired police officer in northeast Nigeria, residents said Saturday as an international effort got underway to rescue 276 schoolgirls kidnapped by the militants.\nInternational outrage at the failure of Nigeria's military to rescue the girls abducted a month ago was joined Saturday by U.S. first lady Michelle Obama. In a radio address she said she and President Barack Obama are \"outraged and heartbroken\" over the April 15 mass abduction.\n\"In these girls, Barack and I see our own daughters,\" Mrs. Obama said, referring to Malia, 15, and Sasha, 12. \"We see their hopes, their dreams and we can only imagine the anguish their parents are feeling right now.\"\nAhmed Mahmud-Gumi, a Nigerian Islamic scholar, speaking in northern Kaduna city on Friday, said it \"may trigger waves of terrorism never seen before.\"\nIn the war zone, local government chairman Abawu James Watharda said no one could count the dead because 3,000 survivors have fled Friday night's attack on the town of Liman Kara.\nFleeing residents say the insurgents blew up the bridge that links the states of Adamawa and Borno. That would cut off any military vehicles attempting a hot pursuit.\nThere were no details about the latest children to be abducted. The Boko Haram terrorist network has said that its abductions of family members of Nigerian officials is a tit-for-tat measure since Nigeria's military and police often detain the spouses and children of wanted suspects.\nBoko Haram has killed more than 1,500 people this year. The militants, abducted more than 300 girls from a boarding school in the northeastern town of Chibok.\nFifty-three escaped but 276 remain captive. In a video seen by The Associated Press, Boko Haram's leader threatens to sell the girls into slavery.\n— The Associated Press","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/nigerian-extremists-blow-bridge-deadly-attack-n102166"}
