{"authors":[],"date_download":"2018-10-30 17:54:02","date_modify":"2018-10-30 17:54:02","date_publish":"2015-10-05 02:40:11","description":"MAIDUGURI, Nigeria, Oct. 4 (UPI) — Nigeria’s armed forces on Sunday reiterated previous vows to end terrorism in the country by December.","filename":"data/vaneerConsumption/NigerianarmyvowstoendBokoHaramterrorismbyDecember.json","image_url":"https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/breitbart.com/news__1540922042.html","title":"Nigerian army vows to end Boko Haram terrorism by December","title_page":"Nigerian army vows to end Boko Haram terrorism by December - Breitbart","title_rss":"NULL","source_domain":"breitbart.com","text":"MAIDUGURI, Nigeria, Oct. 4 (UPI) — Nigeria’s armed forces on Sunday reiterated previous vows to end terrorism in the country by December.\nXinhua news agency reported Maj. Gen. Yushau Abubakar, commander of forces in the northeastern city of Maiduguri, made the pledge and said recent bombings were designed to take attention away from military defeats over terrorist group Boko Haram.\nThe statement comes two days after multiple bomb attacks killed at least 18 people and injured 40 others in the townships of Kuje and Nyanya, on the outskirts of Abuja, the Nigerian capital.\nLt. Gen. Tukur Yusuf Buratai, Nigeria’s chief of army staff, made a similar assurance, Tuesday saying, “We will not rest on our oars until we defeat the terrorists by December.”\nNigerian President Muhammadu Buhari, who was elected earlier this year on a promise to destroy Boko Haram, pledged in early August to defeat the Sunni Muslim terrorist group by the end of the year.\nIn August 2014, the administration of former President Goodluck Jonathan made a similar vow, promising to end terrorist attacks in Nigeria by December of that year.\nSince 2009, Boko Haram has waged a campaign of mass kidnappings, executions, suicide bombings and assaults on remote military bases and villages, killing thousands of Nigerians.\nWhile the group has lost most of its strongholds, it has over the summer been blamed for a series of suicide bombings in crowded markets, mainly in northeastern Nigeria but also in neighboring countries such as Chad, Niger and Cameroon, which are members of an 8,700-strong joint-force that is expected to begin operations against Boko Haram sometime this year after months of delay.","url":"https://www.breitbart.com/news/nigerian-army-vows-to-end-boko-haram-terrorism-by-december/"}
