{"authors":[],"date_download":"2018-10-22 20:54:25","date_modify":"2018-10-22 20:54:25","date_publish":"2014-05-04 18:56:34","description":"The young girls were abducted from a secondary school by the Nigerian Islamist militant group Boko Haram on April 15.","filename":"data/vaneerConsumption/NigeriasPresidentIssuesNewPushtoFindAbductedSchoolgirls.json","image_url":"https://media4.s-nbcnews.com/j/newscms/2014_18/419276/140504-nigeria-kidnapped-girls-protest-3p_dcdaadce6c6fe99f3d76589d5bf80812.1200;630;7;70;5.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/nbcnews.com/storyline_missing-nigeria-schoolgirls_nigerias-president-issues-new-push-find-abducted-schoolgirls-n96756_1540241665.html","title":"Nigeria's President Issues New Push to Find Abducted Schoolgirls","title_page":"Nigeria's President Issues New Push to Find Abducted Schoolgirls","title_rss":"NULL","source_domain":"nbcnews.com","text":"Breaking News Emails Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\nNigeria's president held a security meeting late Saturday in to the early hours Sunday morning, calling for intensified efforts to rescue hundreds of school girls kidnapped by a local terror group more than two weeks ago, officials said.\nPresident Goodluck Jonathan assured that \"wherever the girls are in the world, we will get them back, apprehend and punish the culprits,\" his Minister of Information Labaran Maku said in a statement.\nThe young girls were abducted from a secondary school by the Nigerian Islamist militant group Boko Haram on April 14.\nPolice said last week that 276 remain in captivity, after 53 managed to escape, according to The Associated Press.\nMothers in Nigeria have marched in protest of the Nigerian government’s inaction, and a #BringBackOurGirls Twitter campaign launched rallies in cities across the U.S., and in London.\n“Jonathan has to show that he is actively doing something” because of the protests and the upcoming World Economic Forum, set to take place in Nigeria’s capital on Wednesday, said Veryan Khan, who has studied the group in depth as executive director of the Terrorism Research and Analysis Consortium.\nMausi Segun, Nigeria researcher for Human Rights Watch, agreed that the international attention “forced [Jonathan’s] hands,” and said he shouldn't have waited “until the people took to the streets and used social media to galvanize international interest to carry out his obligations to the abducted girls and their families.”\nWithout disclosing specifics, the U.S. and Britain promised to help find the girls, following reports that Boko Haram — which translates to “Western education is sinful” — is selling the girls into marriages for as little as $12.","url":"https://www.nbcnews.com/storyline/missing-nigeria-schoolgirls/nigerias-president-issues-new-push-find-abducted-schoolgirls-n96756"}
