{"authors":[],"date_download":"2018-10-23 04:59:43","date_modify":"2018-10-23 04:59:43","date_publish":"2016-01-11 18:06:43","description":"A Niger court on Monday denied bail to Hama Amadou, a leading opposition figure and contender in next month's presidential election who has been jailed for h...","filename":"data/vaneerConsumption/Nigercourtrejectsbailforpresidentialhopefuljailedinbabyscandal.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/11/article-doc-700fv-3WAQP5SaQH704788ebcf7e1b3367-990_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_afp_article-3394358_Niger-court-rejects-bail-presidential-hopeful-jailed-baby-scandal_1540270783.html","title":"Niger court rejects bail for presidential hopeful jailed in baby scandal","title_page":"Niger court rejects bail for presidential hopeful jailed in baby scandal | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Niger court rejects bail for presidential hopeful jailed in baby scandal\nA Niger court on Monday denied bail to Hama Amadou, a leading opposition figure and contender in next month's presidential election who has been jailed for his alleged role in a baby trafficking scandal.\nAn appeals court upheld the decision of another court in late December that the former premier and parliament speaker, arrested on November 14 upon his return from exile in France, should not be granted conditional release.\n\"The judge said the appeal could be admitted in theory but he turned down the request\" for bail, said Ibrahim Bana, a member from Amadou's party who was present in the Niamey court.\nHama Amadou, pictured on November 6, 2013, has been jailed for his alleged role in a baby trafficking scandal ©Issouf Sanogo (AFP/File)\nAmadou's lawyers were not in court as lawyers across the west African country staged a one-day strike over the authorities' refusal to let them assist clients who have been detained since last month in connection with an alleged coup plot.\nThe opposition has condemned the arrests as politically motivated in the run-up to the elections.\nNiger's constitutional court this month approved 15 candidates for the February 21 presidential polls, including Amadou, who is also a former parliament speaker.\nIncumbent Mahamadou Issoufou, elected in 2011, is seeking another term and will also be up against chief opposition leader Seini Oumarou, former president Mahamane Ousmane and ex-planning minister Amadou Boubacar Cisse.\nThe electoral campaign begins on January 30.\n\"We will be conducting the campaign as if Mr Amadou were free,\" said Bana.\nSeveral other senior political, military and business figures who also face accusations of participating in the trafficking of babies from neighbouring Nigeria have been released pending trial.\nThe defendants are accused of taking illegal custody of around 30 babies, including twins, born to women in private Nigerian clinics that offer infants for sale.\nAmadou denies the allegations and has denounced the legal process against him as a ploy keep him sidelined from the elections.","url":"https://www.dailymail.co.uk/wires/afp/article-3394358/Niger-court-rejects-bail-presidential-hopeful-jailed-baby-scandal.html"}
