{"authors":["Press Association"],"date_download":"2018-10-23 02:46:32","date_modify":"2018-10-23 02:46:32","date_publish":"2017-03-16 13:23:09","description":"The walkouts will take place on April 8 and 29.","filename":"data/vaneerConsumption/NightTubedriverstostagetwoSaturdaystrikesinjobapplicationsrow.json","image_url":"https://i.dailymail.co.uk/1/2017/03/16/13/wire-228567-1489670598-271_636x382.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/wires_pa_article-4320284_Night-Tube-drivers-stage-two-Saturday-strikes-job-applications-row_1540262792.html","title":"Night Tube drivers to stage two Saturday strikes in job applications row","title_page":"Night Tube drivers to stage two Saturday strikes in job applications row | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"Drivers on London’s Night Tube are to stage two strikes on Saturdays next month after voting in favour of action in a dispute over jobs.\nThe Aslef union said its members backed industrial action by 100% in a turnout of 75%, adding that there was “ample opportunity” for talks to avert the planned walkouts on April 8 and 29.\nThe Rail, Maritime and Transport (RMT) union has already revealed that its members voted by more than 9-1 to strike.\nRMT Night Tube drivers vote by over 96% for strike action over block on career progression https://t.co/mX50Oy4YJ4 — RMT (@RMTunion) March 14, 2017\nThe unions say drivers on the weekend service, which started last August, are being blocked from applying for full-time jobs on the Tube and do not qualify for overtime pay.\nAslef official Finn Brennan said: “Under the previous mayor, London Underground pushed through the recruitment of part-time staff to operate Night Tube because they weren’t prepared to find a fair way to roster the work with full-time staff.\nA Night Tube logo at Oxford Circus underground station\n“Boris Johnson believed that new part-time recruits could be used to undermine trade unions and attack conditions for existing staff.\n“Instead, these new recruits saw that it made sense to join and get active in Aslef and have now delivered a huge Yes vote to strike.\n“Aslef is determined to achieve a fair deal for Night Tube drivers just as we are for every other member. The executive committee has decided to give London Underground much longer than the normal seven days’ notice of industrial action that is required by law, so that there is ample opportunity for London Underground management to reach an agreement with us.\n“I hope they will take advantage of this opportunity to avoid the necessity to take strike action.”","url":"https://www.dailymail.co.uk/wires/pa/article-4320284/Night-Tube-drivers-stage-two-Saturday-strikes-job-applications-row.html"}
