{"authors":["Lia Beck"],"date_download":"2018-10-31 01:43:20","date_modify":"2018-10-31 01:43:20","date_publish":"2018-09-14 15:44:59","description":"What's this? What's this? It's Nightmare Before Christmas games for anyone who is obsessed with the movie 25 years after its release — and who loves a game night. Even though The Nightmare Before Christmas came out way back in 1993, there is plenty…","filename":"data/vaneerConsumption/NightmareBeforeChristmasGamesAreAvailableToCelebrate25YearsOfTheSpookyFilm.json","image_url":"https://imgix.bustle.com/uploads/image/2018/9/14/1d5cbdfd-f2b5-4fe6-a5f0-10c05f52a486-screen-shot-2018-09-14-at-114324-am.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/30/bustle.com/p_nightmare-before-christmas-games-are-available-to-celebrate-25-years-of-the-spooky-film-11917661_1540950200.html","title":"'Nightmare Before Christmas' Games Are Available To Celebrate 25 Years Of The Spooky Film","title_page":"'Nightmare Before Christmas' Games Are Available To Celebrate 25 Years Of The Spooky Film","title_rss":"NULL","source_domain":"bustle.com","text":"What's this? What's this? It's Nightmare Before Christmas games for anyone who is obsessed with the movie 25 years after its release — and who loves a game night. Even though The Nightmare Before Christmas came out way back in 1993, there is plenty of merch related to the movie hitting shelves, some of it specifically in celebration of the anniversary. And since the film came out on October 29, 1993, the anniversary and the new items are just in time for Halloween.\nThe Nightmare Before Christmas follows Jack Skellington from Halloween Town as he discovers Christmas Town and tries to have the residents of Halloween Town celebrate Christmas that year. (It doesn't go so smoothly.) It's a Halloween movie. It's a Christmas movie. It's basically perfect for any month that ends in -ber, and now it's 25 years old.\nThree games have been released in honor of The Nightmare Before Christmas' 25th year: Yahtzee, Operation, and Monopoly. There is also a Nightmare Before Christmas Clue game on the market, as well as playing cards (and many, many other non-game items), but they aren't special 25th anniversary editions. Read on for details on the games that have been released or to purchase them for yourself.\nYahtzee\nThe Yahtzee game includes dice and a score pad covered with pictures of the characters — including Sally, Oogie Boogie, Zombie Duck, and Evil Teddy — and a dice cup shaped like Jack Skellington's head.\nMonopoly\nThis brightly colored Monopoly game features money with Jack's face on all the bills and game pieces in the shape of Sally, Oogie Boogie, Evil Teddy, Zombie Duck, Jack, and the Mayor's Hearse. The locations in the game have also been changed to reflect locations from the movie, like Dr. Finkelstein's lab and Jack's tower.\nOperation\nIt's time to operate on Oogie Boogie and he needs bats, bugs, bones and more strange items removed. The game also includes Oogie Boogie voiceovers from the movie.\nPlaying Cards\nThese aren't in specific honor of the 25th anniversary, but Shop Disney also sells Nightmare Before Christmas playing cards that feature Jack as the king, Sally as the queen, and Zero the dog as the jack.\nClue\nMove over Ms. Scarlett, because Sally is taking over. This Nightmare Before Christmas version of Clue replaces the faces and locations of the original game with characters (ex. Jack and the Mayor) and locales from the movie (ex. Oogie's lair and Christmas Town).\nIf these aren't enough for you, there is also Nightmare Before Christmas homeware and Nightmare Before Christmas plush dolls. There was even been Nightmare Before Christmas makeup in the past. This movie might be 25 years old, but fans are still super passionate about it. And in today's world, they can show their love via themed game nights, with the eyeshadow they choose, or by displaying Jack Skellington salt and pepper shakers. Whether keeping it to the colder months or showing your love for the movie year-round, there are plenty of ways to do it.","url":"https://www.bustle.com/p/nightmare-before-christmas-games-are-available-to-celebrate-25-years-of-the-spooky-film-11917661"}
