{"authors":["Anna Hodgekiss For Mailonline"],"date_download":"2018-10-23 01:47:52","date_modify":"2018-10-23 01:47:52","date_publish":"2016-01-29 15:59:33","description":"Nihal Bitla, from Mumbai, has progeria, a rare disease which ages the body - but not the mind. Sufferers do not usually live past the age of 14. The condition has left Nihal bald with heavy wrinkles.","filename":"data/vaneerConsumption/NihalBitlaageingEIGHTtimesfasterthannormalreacheshis15thbirthday.json","image_url":"https://i.dailymail.co.uk/i/pix/2016/01/29/16/30B3F19200000578-0-image-a-2_1454083785113.jpg","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/dailymail.co.uk/health_article-3422880_Teenager-trapped-body-pensioner-s-ageing-EIGHT-times-faster-normal-defies-doctors-reach-15th-birthday_1540259272.html","title":"Nihal Bitla ageing EIGHT times faster than normal reaches his 15th birthday","title_page":"Nihal Bitla ageing EIGHT times faster than normal reaches his 15th birthday | Daily Mail Online","title_rss":"NULL","source_domain":"dailymail.co.uk","text":"A teenager with a ultra-rare genetic condition that makes him look like an old man has defied doctors to celebrate his 15th birthday.\nNihal Bitla, who lives on the outskirts of Mumbai, has Hutchinson-Gilford progeria syndrome - which ages his body eight times faster than normal.\nThe condition leaves him bald, with heavy wrinkles and severely weakened limbs.\nThe average life expectancy for children with progeria is 14.\nMany sufferers die from a heart condition where the arteries become hard and narrow - which usually affects adults over 60.\nAs a result, children with progeria are prone to heart attacks and strokes aged ten or under.\nBut Nihal blew out the candles on his 15th birthday cake on January 20, making him the oldest living child diagnosed with progeria in India.\nScroll down to video\nNihal Bitla has the premature ageing condition progeria, a disease ages the body - but not the mind - at eight times the normal rate\nThe average life expectancy for sufferers is 14 - but Nihal has defied doctors' predictions and celebrated his 15th birthday last week\nAnd despite the challenges posed by the syndrome, the teenager remains positive about his future.\nNihal said: 'I have never felt that this is a disease, because I'm a special child. This is like a God's gift to me.'\nLike most boys his age, he loves playing computer games - and those who know him say he has bright eyes, a caring nature, and a child-like innocence.\nBut his body is that of an elderly man, with wrinkled leathery skin, a bald enlarged head and withered limbs.\nHe weighs 12.5kg - just under two stone - and is under 4 foot (1.2 m) in height.\nIn the years to come, his mind will remain young, but his body will age and his health will deteriorate.\nThe teenager has already stopped going to school, after his classmates began teasing him.\nThey called him Auro, a progeria patient played by Indian actor Amitabh Bachchan in the Bollywood movie Paa.\nWhen a fellow student told him he too would suffer a heart attack like Auro did in the movie, upset Nihal refused to go back.\nHowever, last December Nihal was sent to the Progeria Research Foundation in Boston, where he began undergoing clinical trials for a cancer drug that doctors hope will slow the ageing process.\nIt is not known if his life expectancy will be lengthened, so in the meantime he is hoping to fulfil dreams such as meeting Honda's ASIMO robot and going to Disneyland in California.\nProgeria is very rare, with between 200 to 250 children living with the syndrome at any given time, according to The Progeria Research Foundation.\nThe condition takes its name from the Greek word ' proeros ', meaning prematurely old.\nNihal, with his father Srinivas, posing beside a Lamborghini in Mumbai. Progeria is very rare, with between 200 to 250 children living with the syndrome at any given time\nNihal's body is that of an elderly man, with wrinkled leathery skin, a bald enlarged head and withered limbs\nNihal's father, Srinivas (with his daughter Vaishnavi) claims his son was the first person in India to be discovered with HGPS, the most severe form of progeria\nFor years, the family did not know what was wrong with Nihal.\nHe appeared healthy until the age of 18 months, when his parents noticed some light patches and dark spots on his skin.\nIn the following years, it was clear that something was drastically wrong: he did not grow and develop as a child normally would.\nHis joints were weak, his hair fell out, his veins became very prominent, and his skin aged rapidly.\nNihal was taken to several doctors, who said that he had a genetic disorder but were unsure exactly what his condition was.\nIt was not until five years ago that Dr Parag Tamhankar, a paediatrician and geneticist in Mumbai, diagnosed Nihal with progeria.\nNihal's father, Srinivas, who owns a small mobile phone repair shop, claims his son was the first person in India to be discovered with HGPS, the most severe form of progeria.\nNihal weighs just under two stone (12.5kg) and is under 4 foot (1.2 m) in height. In the years to come, his mind will remain young, but his body will age and his health will deteriorate\nThe condition causes the body to lose fat and muscle beneath the skin, and causes problems with joints. Eventually, it will become too difficult for Nihal to move his joints, especially his ankles, knees, and fingers\nPictured is one of Nihal's drawings. He stopped going to school five years ago after being teased due to his condition, and now spends his time painting and surfing the internet\nWHAT IS PROGERIA? Hutchinson-Gilford Progeria Syndrome ('Progeria', or 'HGPS') is a rare, fatal genetic condition characterised by an appearance of accelerated ageing in children. Its name is derived from the Greek and means 'prematurely old'. While there are different forms of progeria, the classic type is Hutchinson-Gilford Progeria Syndrome, which was named after English doctors Dr Jonathan Hutchinson and Dr Hastings Gilford who first described it in 1886 and 1897 respectively. HGPS is caused by a mutation in the gene called LMNA. The LMNA gene produces the Lamin A protein, which is the structural scaffolding that holds the nucleus of a cell together. Researchers now believe that the defective Lamin A protein makes the nucleus unstable. That cellular instability appears to lead to the process of premature aging in Progeria. Although they are born looking healthy, children with progeria begin to display many characteristics of accelerated ageing at around 18-24 months of age. Progeria signs include growth failure, loss of body fat and hair, aged-looking skin, stiffness of joints, hip dislocation, generalized atherosclerosis, cardiovascular (heart) disease and stroke. The children have a remarkably similar appearance, despite differing ethnic backgrounds. Children with progeria die of heart disease at an average age of 14 years. Source: Progeria Research Foundation\nDr Tamhankar referred Nihal to the Progeria Research Foundation in Boston, which is trialling treatment for the condition. Currently there is no cure.\nNihal went to Boston last December to undergo this treatment, which uses a cancer drug called Lonafarnib.\nResearch has shown that the drug reverses changes in blood vessels that cause heart attacks and strokes, which kill patients of the disease.\nDoctors do not know if the treatment will elongate his life expectancy, but they have said the treatment is promising if it helps him gain weight and stops his blood vessels from hardening, Dr Tamhankar said.\nNihal says the drug helped improve the flexibility of his joints and helped him gain 4lbs (2kg) in weight.\nBut in recent weeks he has stopped taking the treatment because he has had other problems.\nThese include a liver infection, for which he needs drugs that he cannot take in conjunction with Lonafarnib.\nSince he stopped going to school, Nihal now spends his time playing computer games, surfing the internet and he is passionate about painting.\nHis family say he has a kind, gentle nature and gets on well with his two healthy siblings, sister Sonu, 11, and a brother Lucky, 4.\nNow, he says he has three wishes in his life; to meet ASIMO The Robot made by Honda in Japan; to go to Disneyland in California and another secret wish he says he will reveal later in his life.\nHis father now desperately wants to make his son's potentially last years memorable.\nHe said: 'No matter how much time is left, I just want to try to fulfil my son's wishes for now.'","url":"https://www.dailymail.co.uk/health/article-3422880/Teenager-trapped-body-pensioner-s-ageing-EIGHT-times-faster-normal-defies-doctors-reach-15th-birthday.html"}
