{"authors":["Rob Stein"],"date_download":"2018-10-22 23:16:56","date_modify":"2018-10-22 23:16:56","date_publish":"2016-08-04 00:00:00","description":"The National Institutes of Health is proposing to fund experiments that create chimeras of human and animal cells while also imposing restrictions in response to ethical concerns.","filename":"data/vaneerConsumption/NIHPlansToLiftBanOnResearchFundsForPartHumanPartAnimalEmbryos.json","image_url":"https://media.npr.org/assets/img/2016/08/03/chimera-lab_wide-17a49b5963dc965d1857b691657ac068cbd6ceac.jpg?s=1400","language":"en","localpath":"/home/avsp_here/news-please-repo//data/2018/10/22/npr.org/sections_health-shots_2016_08_04_488387729_nih-plans-to-lift-ban-on-research-funds-for-part-human-part-animal-embryos_1540250216.html","title":"NIH Plans To Lift Ban On Research Funds For Part-Human, Part-Animal Embryos","title_page":"NIH Plans To Lift Ban On Research Funds For Part-Human, Part-Animal Embryos : Shots - Health News : NPR","title_rss":"NULL","source_domain":"npr.org","text":"NIH Plans To Lift Ban On Research Funds For Part-Human, Part-Animal Embryos\nEnlarge this image toggle caption Rob Stein/NPR Rob Stein/NPR\nThe federal government announced plans Thursday to lift a moratorium on funding of certain controversial experiments that use human stem cells to create animal embryos that are partly human.\nThe National Institutes of Health is proposing a new policy to permit scientists to get federal money to make embryos, known as chimeras, under certain carefully monitored conditions.\nThe NIH imposed a moratorium on funding these experiments in September because they could raise ethical concerns.\nOne issue is that scientists might inadvertently create animals that have partly human brains, endowing them with some semblance of human consciousness or human thinking abilities. Another is that they could develop into animals with human sperm and eggs and breed, producing human embryos or fetuses inside animals or hybrid creatures.\nBut scientists have argued that they could take steps to prevent those outcomes and that the embryos provide invaluable tools for medical research.\nFor example, scientists hope to use the embryos to create animal models of human diseases, which could lead to new ways to prevent and treat illnesses. Researchers also hope to produce sheep, pigs and cows with human hearts, kidneys, livers, pancreases and possibly other organs that could be used for transplants.\nTo address the ethical concerns, the NIH's new policy imposes several restrictions.\nThe policy proposes prohibiting the introduction of certain types of human cells into embryos of nonhuman primates, such as monkeys and chimps, at even earlier stages of development than what was currently prohibited.\nThe extra protections are being added because these animals are so closely related to humans.\nBut the policy would lift the moratorium on funding experiments involving other species. Because of the ethical concerns, though, at least some of the experiments would go through an extra layer of review by a new, special committee of government officials.\nThat committee would, for example, consider experiments designed to create animals with human brain cells or human brain tissue. Scientists might want to create them to study neurological conditions such as Alzheimer's and Parkinson's diseases. But the experiments would undergo intensive scrutiny if there's any chance there might be a \"substantial contribution\" or \"substantial functional modification\" to an animal's brain.\nIn addition, the NIH would even consider experiments that could create animals with human sperm and human eggs since they may be useful for studying human development and infertility. But in that case steps would have to be taken to prevent the animals from breeding.\n\"I am confident that these proposed changes will enable the NIH research community to move this promising area of science forward in a responsible manner,\" Carrie Wolinetz, the NIH's associate director for science policy, wrote in a blog post.\n\"At the end of the day, we want to make sure this research progresses because its very important to our understanding of disease. It's important to our mission to improve human health,\" she said in an interview with NPR. \"But we also want to make sure there's an extra set of eyes on these projects because they do have this ethical set of concerns associated with them.\"\nSeveral scientists said they are thrilled by the new policy. \"It's very, very welcome news that NIH will consider funding this type of research,\" says Pablo Ross, a developmental biologist at the University of California, Davis, trying to grow human organs in farm animals. \"We need funding to be able to answer some very important questions.\"\nBut critics denounced the decision. \"Science fiction writers might have imagined worlds like this — like The Island of Dr. Moreau, Brave New World, Frankenstein,\" says Stuart Newman, a biologist at New York Medical College. \"There have been speculations. But now they're becoming more real. And I think that we just can't say that since it's possible then let's do it.\"\nThe public has 30 days to comment on the proposed new policy. NIH could start funding projects as early as the start of 2017.","url":"https://www.npr.org/sections/health-shots/2016/08/04/488387729/nih-plans-to-lift-ban-on-research-funds-for-part-human-part-animal-embryos"}
